{
  "ticker": "RVTY",
  "cik": "0000031791",
  "company_name": "REVVITY, INC.",
  "filing_date": "2025-02-25",
  "accession": "0000031791-25-000009",
  "primary_doc": "revv-20241229.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n88\nSignatures\n88\n \nTable of Contents\nPART I\nItem 1.    \nBusiness\nOverview\nWe are a leading provider of health science solutions, technologies, expertise and services that deliver complete workflows from discovery to development, and diagnosis to cure. Revvity is revolutionizing what’s possible in healthcare, with specialized focus areas in translational multi-omics technologies, biomarker identification, imaging, prediction, screening, detection and diagnosis, informatics and more.\nOur headquarters are in Waltham, Massachusetts, and we market our products and services in more than 160 countries. As of December 29, 2024, we employed approximately 11,000 employees. Our common stock is listed on the New York Stock Exchange under the symbol “RVTY” and we are a component of the S&P 500 Index.\nWe maintain a website with the address \nhttp://www.revvity.com\n. We are not including the information contained in our website as part of, or incorporating it by reference into, this annual report on Form 10-K. We make available free of charge through our website our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to these reports, as soon as reasonably practicable after we electronically file these materials with, or otherwise furnish them to, the Securities and Exchange Commission.\nOur Strategy\nOur strategy is to develop and deliver innovative products, services and solutions in high-growth markets that utilize our knowledge and expertise to address customers’ critical needs and drive scientific breakthroughs. To execute on our strategy and accelerate revenue growth, we focus on broadening our offerings through both the investment in research and development and the acquisition of innovative technology. Our strategy includes:\n•\nStrengthening our position within key markets by expanding our global product and service offerings, maintaining superior product quality and driving an enhanced customer experience;\n•\nAttracting, retaining and developing talented and engaged employees;\n•\nAccelerating transformational innovation through both internal research and development and third-party collaborations and alliances;\n•\nAugmenting growth in both of our core business segments, Life Sciences and Diagnostics, through strategic acquisitions and licensing; \n•\nEngraining focused operational excellence to improve organizational efficiency and agility; and\n•\nOpportunistically utilizing our share repurchase programs to help drive shareholder value.\nBusiness Segments and Products\nWe report our business in two segments: Life Sciences and Diagnostics. \nLife Sciences Segment\nOur comprehensive portfolio of technologies helps life sciences researchers better understand diseases and develop treatments. We provide a broad suite of products, solutions and services that facilitate optimized workflows, increase productivity, and accelerate every stage of the drug discovery and development pipeline. Our offerings span the areas of cell, gene, and protein research, enabling scientists to work smarter, make research breakthroughs, and transform those breakthroughs into real-world outcomes. We partner with global pharmaceutical, biotech and contract research organizations, as well as academic and government institutions, to enable them to discover and develop better treatments and therapeutics to fight disease faster and more efficiently.\n3\nTable of Contents\nPrincipal Products:\nOur principal products and services for Life Sciences applications include the following:\n•\nReagents\n◦\nRadiometric detection solutions, including over 750 radiochemicals and instrumentation such as the Tri-Carb\n® \n and\n Quantulus\n® \n GCT families of liquid scintillation analyzers, Wizard\n2TM\n Gamma counters and MicroBeta\n2TM\n plate based LSA are used for beta, gamma and luminescence counting in microplate and vial formats utilized in research, environmental and drug discovery applications.\n◦\nReagents and solutions for microscopy and imaging applications. These include PhenoVue\n® \ncellular imaging reagents and cell painting kits, PhenoPlate (formerly CellCarrier Ultra™) cellular imaging microplates and GrowDex\nTM \nhydrogels, fluorophore-conjugated and enzyme-conjugated antibodies, as well as buffers and solutions, such as our Ce3D™ collection of buffers for 3D tissue imaging.\n◦\nA wide range of homogeneous biochemical and cell-based reagents using HTRF®, LANCE® Ultra™, DELFIA®, AlphaLISA®, AlphaLISA® SureFire® Ultra™, AlphaScreen®, AlphaPlex® and luminescence assay technologies that can be paired with our microplates, which cover a variety of applications.\n◦\nNew assay kits for Adeno-associated Virus Vectors (AAVs) and gene therapy applications in our range of HTRF\n® \nand AlphaLISA\n® \nreagents, for detecting and quantifying CHO HCP impurities in biotherapeutics development, as well as kits across oncology, neuroscience, and targeted protein degradation applications.\n◦\nA broad portfolio of recombinant GPCR and ion channel cell lines, including over 300 products and 120 ready-to-use frozen cell lines for a wide range of disease areas.\n◦\nDharmacon\n® \n reagents and gene modulation technologies such as RNAi that support drug discovery and development for greater understanding of gene function, identifying genetic drivers behind human disease, developing and validating diagnostic workflows, and helping deliver biotherapeutics, cellular and gene therapies for precision medicine with a portfolio of cell engineering tools.\n◦\nBioLegend\n®\n ELISA MAX™ Standard Sets, ELISA MAX™ Deluxe Sets, LEGEND MAX™ ELISA Kits, and RAPID MAX™ ELISA Kits as well as complementary solutions and buffers for immunoassays to cover more than 200 targets for human, mouse, and rat samples, many of which are designed to assess the immune environment and its inflammatory state for vaccine, infectious disease and autoimmune disease research.\n◦\nBioLegend\n®\n LEGENDplex™ bead-based reagents, which, in contrast to single analyte assays such as enzyme-linked immunosorbent assays (“ELISAs”), can quantitate up to 14 targets from one small sample volume and read on common flow cytometers, and include both desktop and cloud-based analysis software.\n◦\nBioLegend\n®\n best-in-class antibodies, recombinant proteins, and related reagents are used across multiple applications and research areas, including proteogenomics, tissue, cell and protein analysis, cancer research, immunology, cell and gene therapy, stem cell therapy and neuroscience.\n◦\nFluorophore-conjugated antibodies are used in flow cytometers to characterize protein expression on the surface and in internal compartments of cells. The large collection of dyes and antibodies allows for an increasing number of conjugate options, facilitating the use of bigger and better flow cytometry panels using conventional and spectral flow cytometers. Notable products are Brilliant Violet™ and the Spark and Fire\nTM\n dye series, among others.   \n◦\nBioLegend\n®\n TotalSeq™ reagents are oligonucleotide-barcoded antibodies that enable protein detection to be combined with traditional RNA or DNA sequencing experiments with high-parameter protein detection. Data can be analyzed with their complimentary and comprehensive cloud-based Multiomics Analysis Software. \n◦\nCell culture and biofunctional assay reagents, including bioactive recombinant proteins, as well as other specialized reagents such as Cell-Vive™ T-NK Xeno-Free Serum Substitute (compliant with Good Manufacturing Practice requirements (“GMP”)), and other GMP-produced recombinant proteins and reagents. These products serve several markets, notably cell and gene therapy applications.\n◦\nBioLegend\n®\n’s MojoSort™  for cell separation that complements our fluorophore-antibody conjugates, used for FACS (Fluorescence-activated Cell Sorting), thus covering most cell separation and cell sorting technologies and applications.\n◦\nBioLegend’s catalog of more than 33,000 SKUs, incorporating antibodies and a large collection of antibody conjugates and modifications as well as recombinant proteins, immunoassays, and other supportive reagents and solutions for cell and molecular analysis.\n◦\nFlex-T™ reagents that utilize peptide-loaded major histocompatibility molecules assembled into tetramers for the identification of antigen-specific T cells. Our Flex-T products can be used to screen the efficacy of antigen peptides for vaccine and drug trials, as well as characterize the dominance of cancer-specific self-peptides, and more recently, SARS-CoV-2 peptides for COVID-19 research.\n◦\nAntibodies and solutions for Western blotting, as well as supporting buffers and substrates, provide a convenient set of tools to characterize protein size and relative expression levels in cell or tissue lysates.\n4\nTable of Contents\n◦\nMimix\nTM\n reference standards are cell line-derived to mimic patient samples and suitable for next generation sequencing, droplet-digital and real-time PCR as well as Sanger sequencing. The platform is agnostic for seamless integration into quality control workflows.\n◦\nOptiScint™ NPE-free scintillation cocktails and quench standards, providing a more environmentally friendly alternative without compromising performance.\n◦\nExpansion of our Western blotting reagents with the addition of the Western Lightning™ One range, which has a pre-mixed one component chemiluminescent HRP substrate for more consistent results. \n◦\nAdditional Spark and Fire\nTM\n dye-conjugated antibodies, enabling higher-parameter flow cytometry. Notable products are the Spark PLUS UV395™ and Spark PLUS B550™ conjugates.\n◦\nFor the TotalSeq\n™\n reagent portfolio, more large panels of pre-titrated oligo-conjugated antibodies released in universal panels for the analysis of human and mouse samples. New options were created for intracellular target staining and protein-only analysis.\n◦\nNew fluorescent stains, reagents and secondary antibodies in our PhenoVue\nTM\n cellular imaging reagents portfolio for the detection and analysis of cellular components.  \n◦\nGoInVivo™ as well as Ultra-LEAF™ and LEAF™ functional antibodies provide an affordable solution for researchers performing in vivo and ex vivo studies.\n•\nInstruments\n◦\nThe Opera Phenix\n®\n Plus high-content screening system for sensitive and high-speed phenotypic drug screening of complex cellular models.\n◦\nThe Operetta\n®\n CLS™ high-content analysis system enables scientists to reveal fine sub-cellular details from everyday assays as well as more complex studies, for example using live cells, 3D and stem cells.\n◦\nThe VICTOR Nivo\nTM\n multimode plate reader benchtop system designed for assay development and academic labs, including those using HTRF® and AlphaLISA® assay technologies.\n◦\nThe EnVision\nTM\n multimode plate reader designed for high-throughput screening laboratories, including those using HTRF®, AlphaScreen® and AlphaLISA® assay technologies.\n◦\nThe EnVision Nexus\nTM\n multimode plate reader, our next generation system for high-throughput screening with advanced detection technologies for Alpha, TRF, and Luminescence. \n◦\nIn vivo optical imaging platforms and reagents for preclinical research, comprised of the IVIS\n®\n Spectrum™ series for 2D and 3D optical imaging and optionally integrated low-dose CT imaging and the IVIS\n®\n Lumina™ series for benchtop 2D imaging, along with IVISbrite\n®\n bioluminescent and IVISense\n®\n fluorescent imaging agents and imaging reagents.\n◦\nThe Quantum\nTM\n GX3 system, which enables low-dose in vivo CT imaging of multiple species and areas of anatomical interest across multiple disease areas by way of high-resolution, tomographic imaging.\n◦\nThe Vega™ ultrasound system, a hands-free automated ultrasound platform delivers high-resolution 2D and 3D imaging in just a few minutes. This innovative in vivo ultrasound system removes the challenges associated with conventional hand-held systems through the use of automated transducers located under the imaging stage and is easy to use, requires minimal training and produces more consistent results. It is complemented by GoInVivo™ as well as Ultra-LEAF™ and LEAF™ functional antibodies providing an affordable solution for researchers performing in vivo and ex vivo studies.\n◦\nThe high-throughput, microwell Celigo\n®\n image cytometry system, the Cellaca\n®\n MX high-throughput cell counter, the Cellaca\n®\n PLX image cytometry system, and the Cellometer\n®\n automated cell counters, complemented by consumables and reagents, including reagents and kits for cell counting assays and cell viability, microplates, slides, and counting beads.\n◦\nCellaca\n®\n PLX™ image cytometry system combines best-in-class image cytometer hardware, software, validated consumables and optimized reagent kits with validated antibodies from our BioLegend business, and trackable data reporting to enable the simultaneous detection of multiple markers and to streamline cell and gene therapy workflows. \n•\nSoftware\n◦\nThe Signals Image Artist™ next-generation image analysis and management platform for drug discovery research, to help scientists process and analyze high-content screening (HCS) and cellular imaging data in a matter of hours versus days or weeks, so they can make more informed decisions faster. \n◦\nSignals Research platform equips pharmaceutical scientists with the essential tools to gather, search, mine, analyze and visualize critical data, yielding actionable insights in an automated, predictive, and scalable manner. Within life science research and development and clinical research applications, our software accelerates innovation, development, collaboration and research, ultimately leading to accelerated life-enhancing medical breakthroughs, promoting our vision of a healthier humankind. In addition, it also \n5\nTable of Contents\nempowers scientists and formulators in specialty chemical and food sciences to analyze food, and additives, and create high-performing materials that align with sustainability initiatives, promoting energy efficiency, lower toxicity and a circular economy.\n◦\nThe Signals Notebook\nTM\n secure cloud-native electronic lab notebook (ELN) for chemistry, biology, research, and formulations. From increased collaboration to securely accessible data, the Signals Notebook\nTM\n offering accelerates research and development workflows, increases collaboration, integrates with Microsoft Office and more.\n◦\nSignals ChemDraw\n® \nsoftware providing solutions with powerful capabilities and integrations to help quickly turn ideas and drawings into publications since 1985. Signals ChemDraw\n® \nsoftware automates chemical drawings and transforms them into chemical knowledge by facilitating the management, reporting and presenting of chemistry research.\n◦\nSignals Clinical offering provides a single unified platform to support data access, preparation and analytics, from source to visualization to action. With unrivaled workflow flexibility to support dynamic collaboration, Signals Clinical’s SaaS solution helps accelerate the delivery of urgently needed therapeutics to patients.\n◦\nSignals DLX™ powered by Scitara\n®\n establishes seamless, bidirectional connectivity across instruments, LIMS, ELNs and other critical lab systems that previously existed in isolation. \n◦\nThe latest version of the Signals Image Artist™ next-generation image analysis and management platform provides improved 3D cell segmentation and analysis, an AWS S3 cloud deployment option and enhanced cloud security, and compatibility with a broader range of systems, including the Nexcelom from Revvity Celigo\n®TM\n image cytometer.\n◦\nAn updated VICTOR Nivo™ multimode plate reader with a new software version for streamlined data analysis. \n◦\nSoftware solutions for BioLegend\n®\nLEGENDplex\n™ \nassays and multiomics analysis with TotalSeq™ reagents, that are now part of BioLegend’s data integration offerings. \n•\nTechnology and Licensing\n◦\nThe Pin-point™ base editing platform is a CRISPR-Cas9-based technology that allows researchers to make precision base changes in genomic DNA. Editing with such precision can be used to silence disease-causing genes, correct disease-associated mutations, and optimize cell therapies. \n◦\nCHOSOURCE™ platform was expanded to include a CHO-K1 ADCC+ expression cell line for development of therapeutic antibodies in oncology, infectious disease and autoimmune conditions.\n◦\nGene Delivery services and technologies to design and manufacture viral vectors for cell and gene therapy research and preclinical development. This includes LentiBOOST\n®\n transduction enhancer technology for improved lentiviral transduction efficiency, helping to reduce the cost of goods for cell therapies.  \n◦\nPreclinical services for oncology, leveraging capabilities such as cell panel screening, cell line engineering, functional genomic screening, and immune cell screening, for a range of applications to help accelerate the drug development process.\nNew Products:\nNew products introduced or acquired for Life Sciences applications in fiscal year 2024 include the following:\n•\nReagents\n◦\nBiolegend launched new dyes to expand flow cytometry panel building options, including PE/Fire™ 744, Spark PLUS UV395™, Spark PLUS™ B550 antibody conjugates and Zombie UV387™ for dead cell analysis. In addition, the Flexi-Fluor™ portfolio of reagents was created as a made-to-order, rapid alternative to traditional custom products.\n◦\nOligo-conjugated antibodies for intracellular detection of proteins and cytokines introduced in BioLegend's TotalSeq\nTM\n portfolio. BioLegend also introduced a solution for high-throughput, high-parameter single-cell protein analysis - TotalSeq™ PhenoCyte\nTM\n. PhenoCyte\nTM\n provides a streamlined, instrument-free workflow for scalable single-cell immunoprofiling.\n•\nInstruments\n◦\nThe Cellometer\n™ \nAscend™ automated cell counter accelerates lab workflow by mitigating human error, all while providing a consistent, standardized cell count. Incorporated with its user-friendly Matrix software, this product performs an automated and sophisticated image analysis workflow that delivers reliable results in seconds.\n6\nTable of Contents\n•\nSoftware\n◦\nPhenologic.AI\n™\n software, a module in our Harmony™ high-content imaging and analysis software and in our Signals Image Artist™ image analysis and data management platform uses  a pre-trained deep-learning image-analysis model to enable analysis of brightfield images and provides an additional channel for multiplexing and easier analysis of live cell assays.\nBrand Names:\nOur Life Sciences segment offers additional products under various brand names:\n Accell™, AdenoBOOST™, AlphaLISA\n®\n, AlphaPlex\n™\n, AlphaScreen\n®\n, Alpha™ SureFire\n®\n, BioLegend\n®\n, Brilliant Violet™, Ce3D™,  CellCarrier\n®\n, Cellaca™, Celigo™, Cellometer™, cell::explorer\n™\n, Cell-Vive™, Chalice™, Chem3D\n®\n, ChemDraw\n®\n, ChemOffice\n®\n, CHOSOURCE™, DELFIA\n®\n, Dharmacon™, DharmaFECT™, Edit-R™, ELISA MAX™, EnVision\nTM\n, EnVision Nexus\nTM\n, Flex-T™, FMT\n®\n, FolateRSense\n™\n, GoInVivo™, HTRF\n®\n, ImmuSignature\n ™\n, IVIS\n®\n, IVISbrite\n®\n, IVISense\n®\n, LANCE\n®\n, LANCE\n ®\n Ultra ™, LEAF™, LEGEND MAX™, LEGENDplex™, LentiBOOST\n®\n, Lincode™, Living Image\n®\n, Lumina™,\n \nMicroBeta\nTM\n, Mimix\nTM\n, Mini ELISA Plate Reader™, miRIDIAN™, MojoSort™, MuviCyte™, NEN\n ®\n , OncoSignature™, OncoSpan\nTM\n, ON-TARGET™, ON-TARGETplus™, Opera Phenix\nTM\n Plus, Operetta-CLS™, OptiScint™, PhenoPlate™, PhenoVue™, Pin-point™,  Quantulus\n™\n GCT, Quantum™, RAPID MAX™, RediJect™,  RNAiONE™, Signals™, Signals Image Artist™,  SMARTpools\n™\n, SMARTvector\n™\n, Spark PLUS™, Spectrum™, TotalSeq™, Tri-Carb\nTM\n, Ultra-LEAF™, Vega\nTM\n, VesselVue\n®\n, ViaStain™, VICTOR Nivo\n™\n, Western Lightning\n™\n, and Wizard2\nTM\n.\nDiagnostics Segment\nWe offer instruments, reagents, assay platforms and software to hospitals, medical labs, clinicians and medical research professionals to help improve the health of families. Our Diagnostics segment is especially focused on reproductive health, immunodiagnostics, emerging market diagnostics and applied genomics. \nWe provide early detection for genetic disorders from pregnancy to early childhood, and infectious disease testing for the diagnostics market. Our screening products are designed to provide early and accurate insights into the health of expectant mothers during pregnancy and into the health of their babies. Diagnostic labs use our instruments, reagents and software for testing and screening genetic abnormalities and certain disorders and diseases, including Down syndrome, hypothyroidism, muscular dystrophy, infertility and various metabolic conditions. We also develop technologies that enable and support genomic workflows using PCR and next-generation DNA sequencing for applications in oncology, immunodiagnostics and drug discovery.\nPrincipal Products:\nOur principal products and services for Diagnostics applications include the following:\n•\nReproductive Health\n◦\nThe DELFIA\n®\n Xpress screening platform, a complete solution for prenatal and maternal health screening including a fast continuous loading system. It is supported by kits for first, second and third trimester analyses for prenatal screening and clinically validated LifeCycle™ software.\n◦\nThe DELFIA\n®\n Xpress sFlt-1 kit enables short term prediction of pre-eclampsia and aids in diagnosis in the second and third trimesters of pregnancy together with the previously launched DELFIA\n®\n Xpress PlGF 1-2-3™ assay.\n◦\nThe NeoBase™ non-derivatized MS/MS AAAC kits is used to support detection of metabolic disorders in newborns through tandem mass spectrometry. The kits analyze newborn dry blood spot samples for measurement of amino acids and other metabolic analytes for specific diseases.\n◦\nThe GSP\n®\n Neonatal hTSH, T4 17á-OHP, GALT IRT, BTD, PKU, Total Galactose, CK-MM and G6PD kits, used for screening congenital neonatal conditions from a drop of blood.\n◦\nThe Specimen Gate\n®\n informatics data management solution, designed specifically for newborn screening laboratories.\n◦\nThe NeoLSD™ MS/MS kit, the first commercial IVD kit for screening of Pompe, MPS-I, Fabry, Gaucher, Niemann-Pick A/B and Krabbe disorders from a single dried blood spot sample.\n◦\nQSight\n®\n 210MD and 225MD UHPLC MS/MS instruments used for newborn screening.\n◦\nVanadis® NIPT, a non-PCR non-sequencing fully automated cfDNA technology for use in any laboratory for screening common trisomies in the pregnant population.\n7\nTable of Contents\n◦\nThe EONIS™ assay, a CE marked and United States Food and Drug Administration (“FDA”) authorized system utilizing real-time PCR technology, which allows for simultaneous screening of SMA, SCID and XLA in newborns from a single DBS punch.\n◦\nEONIS™ Q novel “dry-chemistry” qPCR newborn screening workflow for SCID, SMA, and XALD screening. \n◦\nDELFIA™ Trio automated plate dispenser, washer and disk remover for the manual newborn screening and prenatal workflows.\n◦\nEVOYA\n®\n cloud-based, newborn screening, informatics and data management software. \n◦\nViaCord\n®\n umbilical cord blood banking services for the banking of stem cells harvested from umbilical cord blood and cord tissue, for potential therapeutic application in transplant and regenerative medicine.\n◦\nRevvity Omics global laboratory network offering multi-OMIC clinical grade services for testing over an individual’s lifetime (prenatal to adults) in cytogenetics, biochemical genetics, molecular genetics and immunodiagnostics. The laboratory network includes testing laboratories in the United States, Sweden, India, China and the United Kingdom.\n◦\nUtilizing next-generation sequencing, Revvity Omics labs provide testing solutions including but not limited to whole genome sequencing, whole exome sequencing, curated and customized gene panels. \n◦\nRevvity Omics Whole Genome Sequencing test provides dual genome analysis (nuclear and mitochondrial) detecting single nucleotide variants, chromosomal and intragenic copy number events, short tandem repeats analysis for >30genes and SMN1 copy number characterization. This test also provides additional findings like pharmacogenomic analysis and carrier status among others.  \n◦\nUltrarapid Whole Genome Sequencing test, a variant of the whole genome sequencing (WGS) analysis, bundles the StepOne biochemical profile, cCMV analysis and metagenomic analysis with the standard WGS analysis to help babies in the NICU with a result as fast as five days.\n◦\nUsing WGS as a backbone, Revvity Omics provides two unique products, the CNGnome® NGS Array and WholePanel ™ test. Utilizing the uniform coverage across genome, the CNGnome NGS array is used to detect copy number events over 25kb in size, making this as a new gold standard in CNV detection. The WholePanel test provides enhanced coverage including the intronic regions for the expertly curated WholeCancer, WholeAtaxia, WholeCardiology and WholeMuscularDystrophy gene panels.   \n•\nApplied Genomics\n◦\nThe Omni Bead Ruptor\n®\n Elite Bead Mill Homogenizer enables grinding, lysing, and homogenization of biological samples prior to molecular analyte extraction, delivering repeatable sample disassociation.\n◦\nThe Omni Prep 96 Automated Homogenizer Workstation, a fully automated homogenizer enabling true walk-away processing for high-throughput labs.\n◦\nAutomated liquid handling platforms (Fontus™, JANUS®, Sciclone®, Zephyr® and FlexDrop™) offering a choice of robotic solutions in genomics, biotherapeutics, high throughput screening and high content analysis to assist life science research from bench to clinic.\n◦\nJANUS\n®\n BioTx™ and PreNAT II™ workstations for automated small-scale purification, offering column, tip and plate-based chromatography on a single platform.\n◦\nThe LabChip® GXII Touch™ protein characterization system provides a means of characterizing multiple protein product attributes for research labs through QC.\n◦\nThe explorer™ automated workstation allows integration of multiple laboratory instrumentation using a centralized robotic interface, allowing high throughput and turnkey-application focused solutions.\n◦\nThe PG-Seq™ Rapid kit v2 analyzes picogram quantities of DNA from an embryo biopsy for preimplantation genetic research with enhanced whole genome coverage and accuracy. \n◦\nDOPlify\n®\n WGA V2 kit performs fast whole genome amplification on single cells or limited template DNA samples, allowing cell chromosome copy number status to be determined.\n◦\nNEXTFLEX\n®\n library prep kits simplify library prep with optimized protocols and reagents, making the library preparation process more efficient and reliable.\n◦\nAutomation protocols and kits launched for the BioQule™ NGS System, making it an open system that combines automation, reagents, consumables and scripts, enabling walkaway automation to simplify low throughput nucleic acid isolation, NGS library preparation and quantitation. \n◦\nThe Fontus™ liquid handler is available in multiple versions to automate both NGS and life science workflows.\n•\nImmunodiagnostics\n◦\nThe chemagic™ Prime™ instrument is a fully automated, LIMS-compatible solution for primary sample transfer, DNA and RNA isolation, to normalization and the setup of PCR and Next Generation Sequencing (“NGS”) applications.  \n◦\nThe chemagic™ 360 instrument is a flexible solution for automated nucleic acid isolation from 0.1-18 ml sample volumes of diverse sample materials. The chemagic™ 360-D instrument (IVDR) and chemagic™ \n8\nTable of Contents\nPrime™ Junior-D instrument (IVDR), together with the chemagic™ IVD Kits, are the optimal choice for automated IVDR compliant nucleic acid isolation for clinical diagnostics. \n◦\nThe Oxford Immunotec T-SPOT\n®\n Technology platform, a modified ELISPOT used to detect a T cell immune response to infection. \n◦\nThe Oxford Immunotec T-SPOT\n®\nTB test, an in vitro diagnostic test for the detection of effector T cells that respond to stimulation by mycobacterium tuberculosis antigens by capturing interferon gamma in the vicinity of T cells in human whole blood. It is intended for use as an aid in the diagnosis of tuberculosis infection. \n◦\nAn expanded portfolio of molecular-based infectious disease screening technologies for blood bank and clinical laboratory settings in China. The tools include a qualitative 3-in-1 assay for the detection of hepatitis B, hepatitis C and HIV, as well as assays for other communicable diseases.\n◦\nTRF-based Anti HBs/HCV/TP kits for infectious disease testing.\n◦\nChitas\n®\n instrument and HBV/HCV/HIV 3-in-1 PCR reagents for blood screening, and Hi Sensitivity HBV DNA and HCV RNA assays for clinical infectious disease testing.\n◦\nChemiluminescence immunoassays and ELISA for therapeutic drug monitoring.\n◦\nA comprehensive portfolio of chemiluminescence immunoassays and ELISAs for endocrinology testing.\n◦\nRadioactive immunoassays in testing calcium metabolism.\n◦\nAutoimmune testing, including indirect immunofluorescence tests (IIFT), ELISA, chemiluminescence immunoassays and immunoblots, covering rheumatology, hepatology, gastroenterology, endocrinology, neurology, nephrology, dermatology and infertility.\n◦\nAllergy testing covering allergen-specific immunoglobin E (IgE), measuring the level of different IgE antibodies or total IgE in blood using multiplex EUROLINE\nTM\n immunoblot assays as well as singleplex chemiluminescence immunoassays.\n◦\nInfectious disease testing, including IIFT, ELISA, chemiluminescence immunoassays, immunoblots, microarrays and real-time PCR, covering bacteria, viruses, fungi and parasites.\n◦\nA complete portfolio of chemiluminescence immunoassays (“ChLIA”) for precise Alzheimer’s disease diagnostics providing reliable analysis of the established CSF biomarkers beta-amyloid (1-40), beta-amyloid (1-42), total tau and pTau (181) and a high degree of standardization due to fully automated processing.\n◦\nEUROLabPolaris platform provides the secure transfer of indirect immunofluorescence data to several locations enabling central evaluation within the software.\n◦\nEUROLabOffice\nTM\n4.0 laboratory management system provides a central interface between devices to simplify and speed up the diagnostic routine and increases security through organization of all lab procedures and traceable documentation of all data and processes.\n◦\nEUROPattern Classifier\nTM\n 2.4 AI-enhanced software module of EUROLabOffice\nTM\n4.0 offers automated result proposals from images captured with the all-in-one IFA instrument UNIQO 160 as well as from the automated microscopes EUROPattern and EUROPattern Microscope Live.\n◦\nEUROLabWorkstation\nTM\n IFA and EUROLabWorkstation ELISA provide fully automated processing of IIFT and ELISA, respectively, for laboratories with high sample throughput.\n◦\nEUROPattern\nTM\n microscope provides fully automated immunofluorescence microscopy including IIFT pattern recognition and titer determination.\n◦\nEUROPattern\nTM\n microscope live provides fully automated and fast image recording and modern on-screen reporting, also including IIFT pattern recognition and titer determination.\n◦\nEUROBlotOne\nTM\n compact tabletop device for complete processing of immunoblots.\n◦\nUNIQO160\nTM\n device for fully automated processing of IIFT from primary sample to final microscopy result for up to 160 samples and 18 slides.\n◦\nIDS-i10\nTM\n compact random-access solution for the processing of ChLIA in the field of autoimmune and infection diagnostics as well as antigen detection, providing sample throughput of up to 170 tests per hour.\n◦\nIDS-iSYS Multi-Discipline Automated System is a compact automation solution for the processing of ChLIA in the field of autoimmune, infection and allergy diagnostics as well as antigen detection, providing sample throughput of up to 120 samples per hour.\n◦\nMyFoodProfile immunoblots for the determination of IgG and IgE reactivity against more than 200 foods (CE-marked).\nNew Products:\nNew products or services introduced or acquired for Diagnostics applications in fiscal year 2024 include the following:\n•\nReproductive Health\n◦\nCD34+ hematopoietic stem cells from human umbilical cord blood (for research use only and not for use in diagnostic procedures).\n◦\nThe NEXTFLEX\n®\n Neo NGS RUO Panel 1 kit, which is part of a new end-to-end workflow solution for newborn sequencing research.\n9\nTable of Contents\n◦\nRevvity Genomics LIMS cloud-based, genomic platform solution is primed for secure data management and LIS integration.\n◦\nRevvity Genomics Analyze\nTM\n genomics primary and secondary analysis software for variant calling.\n◦\nRevvity Genomics Interpret\nTM\n tertiary and reporting software for genomic testing.\n◦\nRevvity Transcribe AI\nTM\n innovative OCR service designed to convert handwritten text on test request forms into a digitized format.\n•\nApplied Genomics\n◦\nLabChip\n®\n Plasmid DNA assay enables purity and sizing analysis of the three primary isoforms of pDNA during the manufacturing of proteins, viral vectors, and messenger RNA.\n•\nImmunodiagnostics\n◦\nAuto-Pure\nTM\n 2400 automated liquid handling platform designed to provide efficient workflows in the lab for T-SPOT.TB\n®\n testing.\n◦\nEUROStar IV Plus, a new model of EUROIMMUN's successful LED microscope series for convenient manual fluorescence microscopy with attractive new features for easy and ergonomic manual microscopy.\n◦\nThe optimised (IVDR-compliant) \n“RVTY”\n\"CSF ELISA 2.0\" series for facilitated handling and resource savings.\n◦\nThe GeneProof-ALPCO\nTM\n portfolio for molecular diagnostics.\n◦\nEURORealTime APOE for APOE genotyping to assess a patient’s risk for side effects prior to the start of an anti-amyloid (beta) therapy in Alzheimer’s disease.\nBrand Names:\nOur Diagnostics segment offers additional products under various brand names, including:\nAutoDELFIA\n®\n, BACS-on-Beads\n®\n, BIOCHIPs, Bioo Scientific\n®\n, BioQule™, BoBs\n®\n, chemagic™, Chitas\n®\n, DELFIA\n®\n, DELFIA\n®\n Xpress, DOPlify\n®\n, EONIS™, EUROArray™ , EUROIMMUN\n®\n, EUROLabWorkstation™, EUROLINE™, EUROPattern\nTM\n, Evolution™  Evoya\n®\n, explorer™, Fontus™, GSP\n®\n, Haoyuan™, IDS\n® \n Immunodiagnosticsystems, IDS-i10\n®\n, IDS-i10T\n®\n, IDS-iSYS\n®\n, iLab™, iQ™, JANUS\n®\n, LabChip\n®\n, LifeCycle™, LimsLink™, Migele\n®\n,  MultiPROBE\n®\n, NEXTFLEX\n®\n, NextPrep™, Omni Bead Ruptor\n®\n, Omni Bead Ruptor Elite™, Omni Tip™,  Pannoramic™, Panthera Puncher™,  PG-Seq™, PG-Find™,  PreNAT II™, Prime™, Protein Clear™, ProteinEXact™, QuantiVac™, RONIA\n®\n, Sciclone\n®\n, SimplicityChrom™, Specimen Gate\n®\n, Superflex™, Symbio™, T-SPOT\n®\n, Touch™, Twister®, Vanadis®, VariSpec™, ViaCord\n®\n, VICTOR2™D, and Zephyr\n®\n.\nMarketing\nAll of our businesses market their products and services primarily through their own specialized sales forces. As of December 29, 2024, we employed approximately 1,400 sales and service representatives operating in approximately 40 countries and marketing products and services in more than 160 countries. In geographic regions where we do not have a sales and service presence, we utilize distributors to sell our products.\nRaw Materials, Key Components and Supplies\nEach of our businesses uses a wide variety of raw materials, key components and supplies that are generally available from alternate sources of supply and in adequate quantities from domestic and foreign sources. We generally have multi-year contracts, with no minimum purchase requirements, with our suppliers. For certain critical raw materials, key components and supplies required for the production of some of our principal products, we have qualified only a limited or a single source of supply. We periodically purchase quantities of some of these critical raw materials in excess of current requirements, in anticipation of future manufacturing needs. With sufficient lead times, we believe we would be able to qualify alternative suppliers for each of these raw materials and key components. See the applicable risk factor in “",
    "item1a": "Item 1A.    \nRisk Factors\nThe following important factors affect our business and operations generally or affect multiple segments of our business and operations:\nRisks Related to our Business Operations and Industry\nIf the markets into which we sell our products decline or do not grow as anticipated due to a decline in general economic conditions, or there are uncertainties surrounding the approval of government or industrial funding proposals, or there are unfavorable changes in government regulations, we may see an adverse effect on the results of our business operations.\nOur customers include pharmaceutical and biotechnology companies, laboratories, academic and research institutions, public health authorities, private healthcare organizations, doctors and government agencies. Our quarterly revenue and results \n13\nTable of Contents\nof operations are highly dependent on the volume and timing of orders received during the quarter. In addition, our revenues and earnings forecasts for future quarters are often based on the expected trends in our markets. However, the markets we serve do not always experience the trends that we may expect. Negative fluctuations in our customers’ markets, the inability of our customers to secure credit or funding, rest\nrictions in capital expenditures, general economic conditions, cuts in government funding, deficit reduction efforts or other actions that reduce or freeze the availability of government funding for healthcare and research or unfavorable changes in government regulations would likely result in a reduction in demand for our products and services and additional pricing pressures, as well as create potential collection risk associated with those sales. In addition, government funding is subject to economic conditions and the political process, which is inherently fluid and unpredictable. Our revenues may be adversely affected if our customers delay or reduce purchases as a result of uncertainties surrounding the approval of government or industrial funding proposals or reductions in government funding. Such declines could harm our consolidated financial position, results of operations, cash flows and trading price of our common st\nock, and could limit our ability to sustain profitability.\n    \nOur growth and profitability are subject to global economic and political conditions, and operational disruptions at our facilities.\nOur business is affected by global economic and political conditions as well as the state of the financial markets, particularly as the United States and other countries balance concerns around debt, inflation, trade protectionism, growth and budget allocations in their policy initiatives. There can be no assurance that global economic conditions and financial markets will not worsen and that we will not experience any adverse effects that may be material to our consolidated cash flows, results of operations, financial position or our ability to access capital, such as the adverse effects resulting from a prolonged shutdown in government operations both in the United States and internationally. Our business is also affected by local economic environments, including inflation, recession, financial liquidity, interest rates and currency volatility or devaluation. Environmental events and political changes, including trade barriers and tariffs, and war or other conflicts, such as the current conflicts in Ukraine and the Middle East, some of which may be disruptive, could interfere with our supply chain, our customers and all of our activities in a particular location. \nWhile we take precautions to prevent production or service interruptions at our global facilities, a major earthquake, fire, flood, power loss or other catastrophic event that results in the destruction or delay of any of our critical business operations could result in our incurring significant liability to customers or other third parties, cause significant reputational damage or have a material adverse effect on our business, operating results or financial condition.\nCertain of these risks can be hedged to a limited degree using financial instruments, or other measures, and some of these risks are insurable, but any such mitigation efforts are costly and may not always be fully successful. Our ability to engage in such mitigation efforts has decreased or become even more costly as a result of recent market developments.\nIf we do not introduce new products in a timely manner, we may lose market share and be unable to achieve revenue growth targets.\nWe sell many of our products in industries characterized by rapid technological change, frequent new product and service introductions, and evolving customer needs and industry standards. Many of the businesses competing with us in these industries have significant financial and other resources to invest in new technologies, substantial intellectual property portfolios, substantial experience in new product development, regulatory expertise, manufacturing capabilities, and established distribution channels to deliver products to customers. Our products could become technologically obsolete over time, or we may invest in technology that does not lead to revenue growth or continue to sell products for which the demand from our customers is declining, in which case we may lose market share or not achieve our revenue growth targets. The success of our new product offerings will depend upon several factors, including our ability to:\n•\naccurately anticipate customer needs,\n•\ninnovate and develop new reliable technologies and applications,\n•\nreceive regulatory approvals in a timely manner,\n•\nsuccessfully commercialize new technologies in a timely manner,\n•\nprice our products competitively, and manufacture and deliver our products in sufficient volumes and on time, and\n•\ndifferentiate our offerings from our competitors’ offerings.\nMany of our products are used by our customers to develop, test and manufacture their products. We must anticipate industry trends and consistently develop new products to meet our customers’ expectations. In developing new products, we may be required to make significant investments before we can determine the commercial viability of the new product. If we fail to accurately foresee our customers’ needs and future activities, we may invest heavily in research and development of \n14\nTable of Contents\nproducts that do not lead to significant revenue. We may also suffer a loss in market share and potential revenue if we are unable to commercialize our technology in a timely and efficient manner.\nIn addition, some of our licensed technology is subject to contractual restrictions, which may limit our ability to develop or commercialize products for some applications.\nWe may not be able to successfully execute acquisitions or divestitures, license technologies, integrate acquired businesses or licensed technologies into our existing businesses, maintain licensed technologies, or make acquired businesses or licensed technologies profitable.\nWe have in the past supplemented, and may in the future supplement, our internal growth by acquiring businesses and licensing technologies that complement or augment our existing product lines. However, we may be unable to identify or complete promising acquisitions or license transactions for many reasons, such as:\n•\ncompetition among buyers and licensees,\n•\nthe high valuations of businesses and technologies,\n•\nthe need for regulatory and other approval, and\n•\nour inability to raise capital to fund these acquisitions.\nSome of the businesses we acquire may be unprofitable or marginally profitable, or may increase the variability of our revenue recognition. If, for example, we are unable to successfully commercialize products and services related to significant in-process research and development that we have capitalized, we may have to impair the value of such assets. Accordingly, the earnings or losses of acquired businesses may dilute our earnings. For these acquired businesses to achieve acceptable levels of profitability, we would have to improve their management, operations, products and market penetration. We may not be successful in this regard and may encounter other difficulties in integrating acquired businesses into our existing operations, such as incompatible management, information or other systems, cultural differences, loss of key personnel, unforeseen regulatory requirements, previously undisclosed liabilities or difficulties \nin predicting financial results. We may lose the right to utilize licensed technologies which could limit our ability to offer products incorporating such technologies. To finance our acquisitions, we may have to raise additional funds, either through public or private financings. We may be unable to obtain \nsuch funds or may be able to do so only on terms unacceptable to us. We may also incur expenses related to completing acquisitions or licensing technologies, or in evaluating potential acquisitions or technologies, which may adversely impact our profitability.\nIf we do not compete effectively, our business will be harmed.\nWe encounter aggressive competition from numerous competitors in many areas of our business. We may not be able to compete effectively with all of these competitors. To remain competitive, we must develop new products and periodically enhance our existing products. We anticipate that we may also have to adjust the prices of many of our products to stay competitive. In addition, new competitors, technologies or market trends may emerge to threaten or reduce the value of entire product lines.\nOur quarterly operating results could be subject to significant fluctuation, and we may not be able to adjust our operations to effectively address changes we do not anticipate, which could increase the volatility of our stock price and potentially cause losses to our shareholders.\nGiven the nature of the markets in which we participate, we cannot reliably predict future revenue and profitability. Changes in competitive, market and economic conditions may require us to adjust our operations, and we may not be able to make those adjustments or make them quickly enough to adapt to changing conditions. A high proportion of our costs are fixed in the short term, due in part to our research and development and manufacturing costs. As a result, small declines in sales could disproportionately affect our operating results in a quarter. Factors that may affect our quarterly operating results include:\n•\ndemand for and market acceptance of our products,\n•\ncompetitive pressures resulting in lower selling prices,\n•\nchanges in the level of economic activity in regions in which we do business, including as a result of global health crises or pandemics,\n•\nchanges in trade policy applicable to the regions in which we do business,\n•\nchanges in general economic conditions or government funding,\n•\nsettlements of income tax audits,\n15\nTable of Contents\n•\nexpenses incurred in connection with claims related to environmental conditions at locations where we conduct or formerly conducted \noperations,\n•\ncontract terminations, adverse litigation outcomes, and litigation costs,\n•\ndiffering tax laws and changes in those laws (including the enactment by countries of the Organization for Economic Cooperation and Development (OECD) Base Erosion and Profit Shifting Pillar Two, which would impose a minimum corporate income tax rate of least 15%), or changes in the countries in which we are subject to taxation,\n•\nchanges in our effective tax rate,\n•\nchanges in industries, such as pharmaceutical and biomedical,\n•\nchanges in the portions of our revenue represented by our various products and customers,\n•\nour ability to introduce new products,\n•\nour competitors’ announcement or introduction of new products, services or technological innovations,\n•\ncosts of raw materials, labor, energy, supplies, transportation or other indirect costs,\n•\nchanges in healthcare or other reimbursement rates paid by government agencies and other third parties for certain of our products and services,\n•\nour ability to realize the benefit of ongoing productivity initiatives,\n•\nchanges in the volume or timing of product orders, \n•\nfluctuation in the expense related to the mark-to-market adjustment on postretirement benefit plans,\n•\nchanges in our assumptions underlying future funding of pension obligations,\n•\nchanges in assumptions used to determine contingent consideration in acquisitions, and\n•\nchanges in foreign currency exchange rates.\nA significant disruption in third-party package delivery and import/export services, or significant increases in prices for those services, could interfere with our ability to ship products, increase our costs and lower our profitability.\nWe ship a significant portion of our products to our customers through independent package delivery and import/export companies, including UPS and Federal Express in the United States; TNT, UPS and DHL in Europe; and UPS in Asia. We also ship our products through other carriers, including commercial airlines, freight carriers, national trucking firms, overnight carrier services and the United States Postal Service. If one or more of the package delivery or import/export providers experiences a significant disruption in services or institutes a significant price increase, we may have to seek alternative providers and the delivery of our products could be prevented or delayed. Such events could cause us to incur increased shipping costs that could not be passed on to our customers, negatively impacting our profitability and our relationships with certain of our customers.\nDisruptions in the supply of raw materials, certain key components and other goods from our limited or single source suppliers could have an adverse effect on the results of our business operations, and could damage our relationships with customers.\nThe production of our products requires a wide variety of raw materials, key components and other goods that are generally available from alternate sources of supply. However, certain critical raw materials, key components and other goods required for the production and sale of some of our principal products are available from limited or single sources of supply. We generally have multi-year contracts with no minimum purchase requirements with these suppliers, but those contracts may not fully protect us from a failure by certain suppliers to supply critical materials or from the delays inherent in being required to change suppliers and, in some cases, validate new raw materials. Such raw materials, key components and other goods can usually be obtained from alternative sources with the potential for an increase in price, decline in quality or delay in delivery. A prolonged inability to obtain certain raw materials, key components or other goods is possible and could have an adverse effect on our business operations, and could damage our relationships with customers. In addition, global health crises or pandemics, changes in trade policy, wars, conflicts, or other changes in a country’s or region’s political or economic conditions, could have a significant adverse effect on our supply chain.\nWe are subject to the rules of the Securities and Exchange Commission requiring disclosure as to whether certain materials known as conflict minerals (tantalum, tin, gold, tungsten and their derivatives) that may be contained in our products are mined from the Democratic Republic of the Congo and adjoining countries. As a result of these rules, we may incur \n16\nTable of Contents\nadditional costs in complying with the disclosure requirements and in satisfying those customers who require that the components used in our products be certified as conflict-free, and the potential lack of availability of these materials at competitive prices could increase our production costs.\nIf we do not retain our key personnel, our ability to execute our business strategy will be limited.\nOur success depends to a significant extent upon the continued service of our executive officers and key management and technical personnel, particularly our experienced engineers and scientists, and on our ability to continue to attract, retain, and motivate qualified personnel. The competition for these employees is intense. The loss of the services of key personnel could have a material adverse effect on our operating results. In addition, there could be a material adverse effect on us should the turnover rates for key personnel increase significantly or if we are unable to continue to attract qualified personnel. We do not maintain any key person life insurance policies on any of our officers or employees.\nOur success also depends on our ability to execute leadership succession plans. The inability to successfully transition key management roles could have a material adverse effect on our operating results.\nIf we experience a significant disruption in, or breach in security of, our information technology systems or those of our customers, suppliers or other third parties, or cybercrime, resulting in inappropriate access to or inadvertent transfer of information or assets or result in a ransom demand from a third party, or if we fail to implement new systems, software and technologies successfully, our business could be adversely affected.\nWe rely on several centralized information technology systems throughout our company to develop, manufacture and provide products and services, keep financial records, process orders, manage inventory, process shipments to customers and operate other critical functions. Our and our third-party service providers' information technology systems may be susceptible to damage, disruptions or shutdowns due to power outages, hardware failures, computer viruses, attacks by computer hackers, telecommunication failures, user errors, catastrophes or other unforeseen events. The risk of a security breach or disruption through cyber-attacks has generally increased as the number, intensity and sophistication of attempted attacks from around the world have increased. For example, many companies have experienced an increase in phishing and social engineering attacks from third parties. If we were to experience a prolonged system disruption in the information technology systems that involve our interactions with customers, suppliers or other third parties, it could result in the loss of sales and customers and significant incremental costs, which could adversely affect our business. In addition, security breaches of our information technology systems or cybercrime, resulting in inappropriate access to or inadvertent transfer of information or assets, could result in losses or misappropriation of assets, ransom demands by third parties, or unauthorized disclosure of confidential information belonging to us or to our employees, partners, customers or suppliers, which could result in our suffering significant financial or reputational damage.\nOur results of operations will be adversely affected if we fail to realize the full value of our intangible assets.\nAs of December 29, 2024, our total assets included $9.1 billion of net intangible assets. Net intangible assets consist principally of goodwill associated with acquisitions and costs associated with securing patent rights, trademark rights, customer relationships, core technology and technology licenses, net of accumulated amortization. We test goodwill at least annually for potential impairment by comparing the carrying value to the fair value of the reporting unit to which it is assigned. All of our amortizing intangible assets are also evaluated for impairment should events occur that call into question the value of the intangible assets.\nAdverse changes in our business, adverse changes in the assumptions used to determine the fair value of our reporting units, or the failure to grow our Life Sciences and Diagnostics segments may result in impairment of our intangible assets, which could adversely affect our results of operations.\nRisks Related to our Intellectual Property\nWe may not be successful in adequately protecting our intellectual property.\nPatent and trade secret protection is important to us because developing new products, processes and technologies gives us a competitive advantage, although it is time-consuming and expensive. We own many United States and foreign patents and intend to apply for additional patents. Patent applications we file, however, may not result in issued patents or, if they do, the claims allowed in the patents may be narrower than what is needed to protect fully our products, processes and technologies. The expiration of our previously issued patents may cause us to lose a competitive advantage in certain of the products and services we provide. Similarly, applications to register our trademarks may not be granted in all countries in which they are filed. For our intellectual property that is protected by keeping it secret, such as trade secrets and know-how, we may not use adequate measures to protect this intellectual property.\n17\nTable of Contents\nThird parties have in the past and may in the future also challenge the validity of our issued patents, may circumvent or “design around” our patents and patent applications, or claim that our products, processes or technologies infringe their patents. In addition, third parties may assert that our product names infringe their trademarks. We may incur significant expense in legal proceedings to protect our intellectual property against infringement by third parties or to defend against claims of infringement by third parties. Claims by third parties in pending or future lawsuits could result in awards of substantial damages against us or court orders that could effectively prevent us from manufacturing, using, importing or selling our products in the United States or other countries.\nIf we are unable to renew our licenses or otherwise lose our licensed rights, we may have to stop selling products or we may lose competitive advantage.\nWe may not be able to renew or otherwise lose our right to utilize our existing licenses, or licenses we may obtain in the future, on terms acceptable to us, or at all. If we lose the rights to a patented or other proprietary technology, we may need to stop selling products incorporating that technology and possibly other products, redesign our products or lose a competitive advantage. Potential competitors could in-license technologies that we fail to license and potentially erode our market share.\nOur licenses typically subject us to various economic and commercialization obligations. If we fail to comply with these obligations, we could lose important rights under a license, such as the right to exclusivity in a market, or incur losses for failing to comply with our contractual obligations. In some cases, we could lose all rights under the license. In addition, rights granted under the license could be lost for reasons out of our control. For example, the licensor could lose patent protection for a number of reasons, including invalidity of the licensed patent, or a third-party could obtain a patent that curtails our freedom to operate under one or more licenses.\nRisks Related to Legal, Government and Regulatory Matters\nThe manufacture and sale of products and services may expose us to product and other liability claims for which we could have substantial liability.\nWe face an inherent business risk of exposure to product and other liability claims if our products, services or product candidates are alleged or found to have caused injury, damage or loss. We may be unable to obtain insurance with adequate levels of coverage for potential liability on acceptable terms or claims of this nature may be excluded from coverage under the terms of any insurance policy that we obtain. If we are unable to obtain such insurance or the amounts of any claims successfully brought against us substantially exceed our coverage, then our business could be adversely impacted.\nIf we fail to maintain satisfactory compliance with the regulations of the United States Food and Drug Administration and other governmental agencies in the United States and abroad, we may be forced to recall products and cease their manufacture and distribution, and we could be subject to civil, criminal or monetary penalties.\nOur operations are subject to regulation by different state and federal government agencies in the United States and other countries, as well as to the standards established by international standards bodies. If we fail to comply with those regulations or standards, we could be subject to fines, penalties, criminal prosecution or other sanctions. Some of our products are subject to regulation by the United States Food and Drug Administration and similar foreign and domestic agencies. These regulations govern a wide variety of product activities, from design and development to labeling, manufacturing, promotion, sales and distribution. If we fail to comply with those regulations or standards, we may have to recall products, cease their manufacture and distribution, and may be subject to fines or criminal prosecution.\nWe are also subject to a variety of laws, regulations and standards that govern, among other things, the importation and exportation of products, the handling, transportation and manufacture of toxic or hazardous substances, the collection, storage, transfer, use, disclosure, retention and other processing of personal data, and our business practices in the United States and abroad such as anti-bribery, anti-corruption and competition laws. This requires that we devote substantial resources to maintaining our compliance with those laws, regulations and standards. A failure to do so could result in the imposition of civil, criminal or monetary penalties having a material adverse effect on our operations.\nWe are subject to stringent data privacy and information security laws and regulations and changes in such laws or regulations, or our failure to comply with such requirements, could subject us to significant fines and penalties, which may have a material adverse effect on our business, financial condition or results of operations.\nWe are subject to data privacy and information security laws and regulations that apply to the collection, transmission, storage and use of personally identifying information, which among other things, impose certain requirements relating to the privacy, security and transmission of personal information, including comprehensive regulatory systems in the United States, European Union and the United Kingdom. The legislative and regulatory landscape for privacy and data protection continues to \n18\nTable of Contents\nevolve in jurisdictions worldwide, and there has been an increasing focus on privacy and data protection issues with the potential to affect our business. Failure to comply with any of these laws or regulations could result in enforcement actions against us, including fines, claims for damages by affected individuals, damage to our reputation and loss of goodwill, any of which could have a material adverse effect on our business, financial condition, results of operations or prospects.\nChanges in governmental regulations may reduce demand for our products or increase our expenses.\nWe compete in markets in which we or our customers must comply with federal, state, local and foreign regulations, such as environmental, health and safety, data privacy and food and drug regulations. We develop, configure and market our products to meet customer needs created by these regulations. Any significant change in these regulations could reduce demand for our products or increase our costs of producing these products.\nThe healthcare industry is highly regulated and if we fail to comply with its extensive system of laws and regulations, we could suffer fines and penalties or be required to make significant changes to our operations which could have a significant adverse effect on the results of our business operations.\nThe healthcare industry, including the genetic screening market, is subject to extensive and frequently changing international and United States federal, state and local laws and regulations. In addition, legislative provisions relating to healthcare fraud and abuse, patient privacy violations and misconduct involving government insurance programs provide federal enforcement personnel with substantial powers and remedies to pursue suspected violations. We believe that our business will continue to be subject to increasing regulation as the federal government continues to strengthen its position on healthcare matters, the scope and effect of which we cannot predict. If we fail to comply with applicable laws and regulations, we could suffer civil and criminal damages, fines and penalties, exclusion from participation in governmental healthcare programs, and the loss of various licenses, certificates and authorizations necessary to operate our business, as well as incur liabilities from third-party claims, all of which could have a significant adverse effect on our business.\nRisks Related to our Foreign Operations\n    Economic, political and other risks associated with foreign operations could adversely affect our international sales and profitability.\nBecause we sell our products worldwide, our businesses are subject to risks associated with doing business internationally. Our sales originating outside the United States represented the majority of our total revenue in fiscal year 2024. We anticipate that sales from international operations will continue to represent a substantial portion of our total revenue. In addition, many of our manufacturing facilities, employees and suppliers are located outside the United States. Accordingly, our future results of operations could be harmed by a variety of factors, including:\n•\nchanges in actual, or from projected, foreign currency exchange rates,\n•\nglobal health crises of unknown duration,\n•\nwars, conflicts, or other changes in a country’s or region’s political or economic conditions, particularly in developing or emerging markets,\n•\nlonger payment cycles of foreign customers and timing of collections in foreign jurisdictions,\n•\ntrade protection measures including embargoes, sanctions and tariffs, such as the sanctions and other restrictions implemented by the United States and other governments on the Russian Federation and related parties in connection with the conflict in Ukraine,\n•\nimport or export licensing requirements and the associated potential for delays or restrictions in the shipment of our products or the receipt of products from our suppliers,\n•\npolicies in foreign countries benefiting domestic manufacturers or other policies detrimental to companies headquartered in the United States,\n•\ndiffering tax laws and changes in those laws, or changes in the countries in which we are subject to tax,\n•\nadverse income tax audit settlements or loss of previously negotiated tax incentives,\n•\ndiffering business practices associated with foreign operations,\n•\ndifficulty in transferring cash between international operations and the United States,\n•\ndifficulty in staffing and managing widespread operations,\n19\nTable of Contents\n•\ndiffering labor laws and changes in those laws,\n•\ndiffering protection of intellectual property and changes in that protection,\n•\nexpanded enforcement of laws related to data protection and personal privacy, \n•\nincreasing global enforcement of anti-bribery and anti-corruption laws, and\n•\ndiffering regulatory requirements and changes in those requirements.\nRisks Related to our Debt\nWe have a substantial amount of outstanding debt, which could impact our ability to obtain future financing and limit our ability to make other expenditures in the conduct of our business.\n    \nWe have a substantial amount of debt and other financial obligations. Our debt level and related debt service obligations could have negative consequences, including:\n•\nrequiring us to dedicate significant cash flow from operations to the payment of principal and interest on our debt, which reduces the funds we have available for other purposes, such as acquisitions and stock repurchases;\n•\nreducing our flexibility in planning for or reacting to changes in our business and market conditions;\n•\nexposing us to interest rate risk as a portion of our debt obligations are at variable rates;\n•\nincreasing our foreign currency risk as a portion of our debt obligations are in denominations other than the U.S. dollar; and\n•\nincreasing the chances of a downgrade of our debt ratings due to the amount or intended purpose of our debt obligations.\nWe may incur additional indebtedness in the future to meet future financing needs. If we add new debt, the risks described above could increase. In addition, the market for both public and private debt offerings has experienced liquidity concerns and increased volatility, which could ultimately increase our borrowing costs and limit our ability to obtain future financing. \nRestrictions in our senior unsecured revolving credit facility and other debt instruments may limit our activities.\nOur senior unsecured revolving credit facility, senior unsecured notes due in 2026 (“2026 Notes”), senior unsecured notes due in 2028 (“2028 Notes”), senior unsecured notes due in 2029 (“2029 Notes”), senior unsecured notes due in March 2031 (“March 2031 Notes”), senior unsecured notes due in September 2031 (“September 2031 Notes”) and senior unsecured notes due in 2051 (“2051 Notes”) include restrictive covenants that limit our ability to engage in activities that could otherwise benefit our company. These include restrictions on our ability and the ability of our subsidiaries to:\n•\npay dividends on, redeem or repurchase our capital stock,\n•\nsell assets,\n•\nincur obligations that restrict our subsidiaries’ ability to make dividend or other payments to us,\n•\nguarantee or secure indebtedness,\n•\nenter into transactions with affiliates, and\n•\nconsolidate, merge or transfer all, or substantially all, of our assets and the assets of our subsidiaries on a consolidated basis.\nWe are also required to meet specified financial ratios under the terms of certain of our existing debt instruments. Our ability to comply with these financial restrictions and covenants is dependent on our future performance, which is subject to prevailing economic conditions and other factors, including factors that are beyond our control, such as foreign exchange rates, interest rates, changes in technology and changes in the level of competition. In addition, if we are unable to maintain our investment grade credit rating, our borrowing costs would increase and we would be subject to different and potentially more restrictive financial covenants under some of our existing debt instruments.\nAny future indebtedness that we incur may include similar or more restrictive covenants. Our failure to comply with any of the restrictions in our senior unsecured revolving credit facility, the 2026 Notes, the 2028 Notes, the 2029 Notes, the March 2031 Notes, the September 2031 Notes, the 2051 Notes, including our new senior unsecured revolving credit facility that was entered into in January 2025, or any future indebtedness may result in an event of default under those debt instruments, which \n20\nTable of Contents\ncould permit acceleration of the debt under those debt instruments, and require us to prepay that debt before its scheduled due date under certain circumstances.\nRisks Related to Ownership of our Common Stock\nOur share price will fluctuate.\nOver the last several years, stock markets in general and our common stock in particular have experienced significant price and volume volatility. Both the market price and the daily trading volume of our common stock may continue to be subject to significant fluctuations due not only to general stock market conditions but also to a change in sentiment in the market regarding our operations and business prospects. In addition to the risk factors discussed above, the price and volume volatility of our common stock may be affected by:\n•\noperating results that vary from our financial guidance or the expectations of securities analysts and investors,\n•\nthe financial performance of the major end markets that we target,\n•\nthe operating and securities price performance of companies that investors consider to be comparable to us,\n•\nannouncements of strategic developments, acquisitions and other material events by us or our competitors,\n•\nchanges in global financial markets and global economies and general market conditions, such as interest or foreign exchange rates, inflation, freight costs, commodity and equity prices and the value of financial assets, and\n•\nchanges to economic conditions arising from global health crises and pandemics, climate change, or from wars or conflicts.\nDividends on our common stock could be reduced or eliminated in the future.\nOn October 24, 2024, we announced that our Board of Directors (our “Board”) had declared a quarterly dividend of $0.07 per share for the fourth quarter of fiscal year 2024 that was pai\nd in February 2025. On January 23, 2025, we announced that our Board had declared a quarterly dividend of $0.07 per share for the first quarter of fiscal year 2025 that will be payable in May 2025. In the future, our Board may determine to reduce or eliminate our common stock dividend in order to fund investments for growth, repurchase shares or conserve capital resources.",
    "item1b": "Item 1B.    \nUnresolved Staff Comments\n \nNot applicable.\n \n21\nTable of Contents",
    "item1c": "Item 1C.    \nCybersecurity Disclosures\n \nWe have developed and maintain a Material Cyber Incident Disclosure Program. The program includes processes for the identification, review and assessment of materiality of cyber events, notification of our senior leadership and Board of Directors of such events, and financial reporting disclosure where applicable. As part of the program, we also engage in due diligence regarding the cybersecurity capabilities of our current and potential third-party vendors in accordance with industry best practices. Under the program, all material cyber incidents will be reported to our Board of Directors. The program is led by our \nCyber Event Disclosure Committee, which includes members of our Information Security, Corporate Legal, External Reporting and Enterprise Risk Management teams.\n \nIn addition to assessing our own cybersecurity preparedness, we also consider and evaluate cybersecurity risks associated with use of \nthird-party service providers\n. Our Internal Audit team conducts an annual review of third-party hosted applications with a specific focus on any sensitive data shared with third parties. For all critical third party service provides, we perform a review of the vendor's System and Organization Controls (SOC), which is referred to as a SOC 1 or SOC 2 report. If a third-party vendor is not able to provide a SOC 1 or SOC 2 report, we take additional steps to understand and mitigate any additional risks. Our assessment of risks associated with use of third-party providers is part of our overall risk management framework.\n We have implemented comprehensive cybersecurity initiatives for our employees, including education, training, and testing. These measures are conducted annually to ensure our employees remain up-to-date with the latest security practices, complementing our continuously improving processes and systems.\n  Our Chief Information Officer is responsible for developing and implementing our information security program. \nOur Information Security team monitors our exposure to external cybersecurity threats, leveraging automated tools and manual processes to ensure cybersecurity risk is effectively mitigated on a continuous basis. This team leverages internal IT resources, a managed security service provider, and additional third-party security software and technology services. When a specific incident has been identified, the Information Security team leverages our Cyber Incident Response Plan in conjunction with established Information Security policies to begin assessment of the incident. Depending on the type and/or severit\ny of the incident, our Information Security team will determine (in compliance with our Cyber Incident Response Plan) whether third party expertise or consultation is necessary. If such expertise or consultation is determined to be necessary, our Information Security and Corporate Legal teams will engage with third-party experts.\n As part of its review of incidents, our Information Security team considers the risk exposure, potential impact, severity and implications with respect to our information technology systems. \nOur Information Security team is responsible for escalating incidents which are determined to be higher risk to our Cyber Event Disclosure Committee. \nThe \nCyber Event Disclosure Committee\n will work with our General Counsel to determine the materiality of the incident and any required disclosure. When an incident is determined to be material and is required to be disclosed, the Cyber Event Disclosure Committee will notify our senior leadership and our Board of Directors through the Audit Committee of our Board of Directors.\n The Cyber Event Disclosure Committee will collaborate with our Corporate Legal and Financial Reporting teams to develop any required Form 8-K Item 1.05 disclosure.    \nThe oversight, monitoring, and testing of the program occurs under our Sarbanes-Oxley entity-level control reviews and the program is integrated into our Enterprise Risk Management processes. The Cyber Event Disclosu\nre Committee convenes, at least monthly, to review recent developments in cybersecurity and in the cybersecurity risk landscape. The Cyber Event Disclosure Committee is comprised of representatives with relevant expertise for assessing and managing the applicable risks. Our Board of Directors is presented with updates on an annual, or as needed, basis regarding our cybersecurity preparedness.\n Additionally, our Board of Directors is provided with a comprehensive cyber training from our Chief Information Security Officer at least annually. \nOur Board of Directors annually reviews our cybersecurity program\n and \nthe Audit Committee of our Board of Directors\n is specifically responsible for oversight of cybersecurity risk, which it regularly reviews with Company leadership.\nWe have not identified risks from known cybersecurity threats, including as a result of any prior cybersecurity incidents\n, that have materially affected or are reasonably likely to materially affect us, including our operations, business strategy, results of operations or financial condition."
  }
}