{
  "ticker": "SBUX",
  "cik": "0000829224",
  "company_name": "STARBUCKS CORP",
  "filing_date": "2025-11-14",
  "accession": "0000829224-25-000114",
  "primary_doc": "sbux-20250928.htm",
  "item_sections": {
    "item1": "Item 1.    \nBusiness\n \nGeneral\nIn this Annual Report on Form 10-K (“10-K” or “Report”) for the fiscal year ended September 28, 2025 (“fiscal 2025”), Starbucks Corporation (together with its subsidiaries) is referred to as “Starbucks,” the “Company,” “we,” “us,” or “our.”\nStarbucks is the premier roaster, marketer, and retailer of specialty coffee in the world, operating in 89 markets. Formed in 1985, Starbucks Corporation’s common stock trades on the Nasdaq Global Select Market (“Nasdaq”) under the symbol “SBUX.” We purchase and roast high-quality coffees that we sell, along with handcrafted coffee, tea, and other beverages and a variety of high-quality food items through company-operated stores (“stores” or “coffeehouses”). We also sell a variety of coffee and tea products and license our trademarks through other channels, such as licensed stores as well as grocery and foodservice through our Global Coffee Alliance with Nestlé S.A. (“Nestlé”). In addition to our flagship Starbucks Coffee\n®\n brand, we sell goods and services under the following brands: Teavana\n®\n, Ethos\n®\n, and Starbucks Reserve\n®\n.\nOur primary objective is to maintain Starbucks standing as one of the most recognized and respected brands in the world. We believe the continuous investments in our brand and operations will deliver long-term targeted revenue and income growth. This includes expansion of our global store base, adding stores in both existing, developed markets such as the U.S. and in higher growth markets, as well as optimizing the mix of company-operated and licensed stores around the world. In addition, by leveraging experiences gained through our stores and elsewhere, we continue to drive beverage, equipment, process, and technology innovation, including in our industry-leading digital platform. We strive to regularly offer consumers new, innovative coffee and other products in a variety of forms, across new categories and diverse channels. \nIn the fourth quarter of fiscal 2024, we announced our \n“\nBack to Starbucks\n”\n strategy, which was implemented with the goal to bring new and existing customers to our stores and business, and return to growth. The strategy\n includes supporting our green apron partners, enhancing the customer experience, reestablishing ourselves as the community coffeehouse, and strengthening the brand through product development, marketing, in-store and digital experience. This strategic reset provides us with the opportunity to assess the business and refocus our efforts, including capital allocation priorities, efficiency efforts, and store growth initiatives. \nIn the fourth quarter of fiscal 2025, we announced a restructuring plan involving the closure of coffeehouses, and the further transformation of our support organization, as part of the Company’s “Back to Starbucks” strategy. We assessed our existing store portfolio with respect to both whether coffeehouses had a viable path to offering the physical environment consistent with the brand and a clear path to financial performance and we closed, or plan to close, the coffeehouses that did not meet these criteria. \nRefer to \nNote 18\n, Restructuring, included in Item 8 of Part II of this 10-K, for further discussion.\nHuman Capital Management\nWe invest in the well-being – the mental, physical, and financial health – of every partner through our practices, policies, and benefits. This work is grounded in the belief that we are at our best when we create inclusive, supportive, and welcoming environments, where we uplift one another with dignity, respect, and kindness. We believe the strength of our workforce is one of the significant contributors to our success as a global brand that leads with purpose. Therefore, one of our core strategies is to invest in, and support, our partners to differentiate our brand, products, and services in the competitive specialty coffee market, including the following areas of focus:\nOversight and Management\nWe believe in creating an inclusive and equitable environment that represents a broad spectrum of backgrounds and cultures that is reflective of our customers, partners, and communities. Working under these principles, our Partner Resources Organization is tasked with managing employment-related matters, including recruiting and hiring, onboarding and training, compensation planning, performance management, and professional development. Our Board of Directors (the “Board”) and Board committees provide oversight on certain human capital matters. As noted in its charter, our Compensation and Management Development Committee is responsible for periodically reviewing Starbucks partner resource programs and initiatives, including healthcare and other benefits, as well as our management development and succession planning practices and strategies. Our Audit and Compliance Committee works closely with the Risk Steering Committee, led by Starbucks chief financial officer (“cfo”) and chief legal officer, to monitor and mitigate current and emerging labor and human capital management risks. The Board, through its committees, annually reviews and assesses the effectiveness of the Company’s \n3\nTable of Contents\nenvironmental and social strategies, policies, practices, goals, programs, disclosure, and risks, including review of the Company’s annual global impact report.\nThese reports and recommendations to the Board and its committees are part of the broader framework that guides how Starbucks should attract, retain, and develop a skilled workforce that aligns with our values and strategies.\nWe regularly conduct anonymous surveys to seek feedback from our partners on a variety of topics, including confidence in company leadership, competitiveness of our compensation and benefits package, career growth opportunities, and recommendations on how we can remain an employer of choice. The results are shared with our partners and reviewed by senior leadership, who analyze areas of progress or deterioration and prioritize actions and activities in response to this feedback to drive meaningful improvements in partner engagement. Our management and cross-functional teams also work closely to evaluate human capital management issues such as partner retention, workplace safety, harassment, and bullying, as well as to implement measures to mitigate these issues.\nBelonging at Starbucks \nAt Starbucks, we are committed to creating environments where everyone is welcome and belongs. In 2023, led by Starbucks partners, we reaffirmed this commitment by cementing “Belonging” as one of our company values.  \nWe are dedicated to being an inclusive, accessible and diverse company, with a deep commitment to opportunity for every one of our partners by making Starbucks the best job in retail and a great place to build a career.  \nStarbucks programs and benefits are open to every partner and designed to strengthen a culture of inclusion that values diverse perspectives and experiences – from strong partner networks to a focus on hiring internally for 90% of retail leadership roles. Our hiring and recruiting practices are competitive, fair and inclusive. They help us hire the strongest candidate for every job, every time.  We offer industry-leading benefits, competitive pay, and opportunities for learning and development. When our partners feel good about their future – at Starbucks or beyond – they take care of our customers. Investing in them and prioritizing their experience creates value for everyone. \nTotal Rewards\nWe have demonstrated a history of investing in our workforce by offering competitive salaries and wages by continuously assessing the current business environment and labor market. We have consistently made enhancements in wages in order to attract talent to support our growth strategy and to elevate the customer experience. To foster a stronger sense of ownership and align the interests of partners with shareholders, restricted stock units are provided to eligible non-executive partners under our broad-based stock incentive programs. Furthermore, we offer competitive pay and a collection of benefits that are best in class. Partners in the U.S., which is our largest and most mature market, can:\n•\nGrow their careers with us. We established a goal to fill 90% of retail leadership roles internally, creating a way for our hourly partners to build a career at Starbucks.\n•\nGet a college degree, on us. Through the Starbucks College Achievement Plan (SCAP), Starbucks covers 100% of tuition for a first-time online bachelor’s degree from Arizona State University for partners working an average of 20 hours or more each week.\n•\nGrow their savings. In fiscal 2025, more than 230,000 partners received a Bean Stock grant giving them an ownership stake in Starbucks.\n•\nObtain comprehensive healthcare coverage. We offer industry-leading health and wellbeing benefits for partners working an average of 20 hours or more each week.\n•\nExtend parental leave. Starbucks covers up to 18 weeks of fully paid leave for birth parents, and up to 12 weeks of fully paid leave for non-birth parents for partners working an average of 20 hours or more each week.\nOutside of the U.S., we have provided other innovative benefits to help address market-specific needs, such as providing interest-free loans to our U.K. partners to help cover rental deposits, mental health services in Canada, and, in China, an extra 14th Month Pay initiative, giving retail partners an additional month’s salary as a bonus on top of the 13th month pay that is customary in China, as well as a monthly housing subsidy for full-time Starbucks baristas and shift supervisors, and comprehensive health insurance coverage for parents of partners.\n4\nTable of Contents\nRole-based Support\nTo help our partners succeed in their roles, we emphasize ongoing training and development opportunities. These include, but are not limited to, role-based training for our retail hourly partners, safety and security protocols, updates on new products and service offerings, and deployment of technologies. We periodically address a wide variety of topics such as achievable goal setting, giving and receiving constructive feedback, and effective engagement with communities and customers through the rollout of the Green Apron Service Model, a new foundational operating model that establishes repeatable, consistent, and scalable standards, across U.S company-operated coffeehouses. It is designed to create deeper connections between partners and customers by enabling partners to deliver consistent, high-quality experiences with warmth and care. The model includes new routines and tools that give partners more time to focus on craft and connection, supported by technology that improves order flow and speed of service.\nPay Equity\nTo be an employer of choice and maintain the strength of our workforce, we consistently assess the current business environment and labor market to refine our compensation and benefits programs and other resources available to our partners.\nStarbucks is committed to fair pay principles to ensure partners are paid appropriately and equitably for their roles and the work they do, regardless of race, gender, or other protected categories. Further, we have formulated pay-equity principles, which provide equal footing, transparency, and accountability as best practices that help address known, systemic barriers to global pay equity.\nAs of September 28, 2025, Starbucks employed approximately 381,000 people worldwide. In the U.S., Starbucks employed approximately 223,000 people, with approximately 214,000 in company-operated stores and the remainder in corporate support, store development, roasting, manufacturing, warehousing, and distribution operations. Approximately 158,000 employees were employed outside of the U.S., with approximately 153,000 in company-operated stores and the remainder in regional support operations. Partners in approximately 6% of Starbucks U.S. company-operated stores are represented by unions. We believe our efforts in managing our workforce have been effective, evidenced by low turnover, a strong culture, and active employee participation.\nInformation about our Executive Officers\nName\nAge\nPosition\nBrian Niccol\n51\nchairman and chief executive officer\nCathy R. Smith\n62\nexecutive vice president, chief financial officer \nMike Grams\n55\nexecutive vice president, chief operating officer\nBrady Brewer\n52\nchief executive officer, Starbucks International \nSara Kelly\n46\nexecutive vice president, chief partner officer\nPilar Ramos\n53\nexecutive vice president, chief legal officer\nBrian Niccol\n joined Starbucks as chairman and chief executive officer in September 2024. Mr. Niccol spent more than 25 years in leadership, marketing, and operations roles for some of the world’s most respected restaurant brands. Mr. Niccol joined Starbucks after leading Chipotle Mexican Grill, Inc. through a period of growth and transformation, having served as a director and as its Chief Executive Officer from 2018 to 2024 and as its Chairman, from 2020 to 2024. Before joining Chipotle, he served as Chief Executive Officer of Taco Bell, a division of Yum! Brands, Inc., from 2015 to 2018, after having served as its President (2013 to 2014) and Chief Marketing and Innovation Officer (2011 to 2012). Mr. Niccol also served in leadership roles at Pizza Hut, another division of Yum! Brands from 2005 to 2011. Mr. Niccol currently serves on the Board of Directors of Walmart Inc., a NYSE-listed omni-channel retailer.\nCathy R. Smith\n joined Starbucks in March 2025 as executive vice president, chief financial officer, after having served as Executive Vice President, Chief Financial Officer and Treasurer of Nordstrom, Inc., a department store chain, since 2023. From 2020 to 2023, Ms. Smith served as Chief Financial and Administrative Officer for Bright Health Group, Inc., a health insurance company. From 2015 to 2020, Ms. Smith served as the Chief Financial Officer for Target Corporation, a retail company. Previously, Ms. Smith served as Chief Financial Officer for Express Scripts Holding Company, a pharmacy benefit manager company, from 2014 to 2015, for Walmart International, a retail company, from 2010 to 2014, and for GameStop Corporation, an electronics retail company, from 2009 to 2010. Ms. Smith currently serves on the board of directors for PPG Industries, Inc., a manufacturer and distributor of paintings and coatings, and Baxter International, Inc., a healthcare company. Previously, Ms. Smith served as a director for Dick’s Sporting Goods, Inc. Ms. Smith holds an undergraduate degree from the University of California, Santa Barbara and an MBA from the University of Southern California. \n5\nTable of Contents\nMike Grams\n joined Starbucks in February 2025 as executive vice president, North America chief coffeehouse officer, and has served as executive vice president, chief operating officer since June 2025. Prior to joining Starbucks, Mr. Grams spent nearly thirty years at Taco Bell Corp. where he held various leadership positions, including President and Chief Operating Officer from 2020 to December 2024, Global Chief Operating Officer and General Manager, North America from 2017 to 2020 and Chief Operating Officer and Chief Development Officer from 2015 to 2019. \nBrady Brewer \njoined Starbucks in 2001 and has served as chief executive officer, Starbucks International since April 2024, where he is responsible for the teams across Asia Pacific, Europe, Middle East, Africa, Japan, Latin America, and the Caribbean, as well as Global Coffee Operations and the Company’s international licensed partners. From February 2020 through March 2024, he served as Starbucks executive vice president and chief marketing officer, leading the Starbucks brand, marketing, food and beverage portfolio, digital customer experience innovation, R&D/Engineering, creative and brand management, consumer insights, data analytics, and sustainability. His prior roles at Starbucks include senior vice president of Digital Customer Experience for Starbucks (2019 through February 2020), where he focused on delivering new innovations that made the Starbucks Experience continually more effortless and delightful for customers; chief operating officer for Starbucks Japan (2016 to 2019), where he led store operations as well as brand and marketing strategy; and senior vice president, Marketing and Product for the Company’s China and Asia Pacific region (2014 to 2016). Mr. Brewer currently serves on the Board of Directors of The Gap, Inc., a NYSE-listed clothing and accessories retailer.\nSara Kelly\n joined Starbucks in 2001 and has served as executive vice president and chief partner officer since 2022, where she is responsible for helping partners realize their career potential and building global partner capability to enable growth and deliver on the Company’s strategic plan. Prior to her current role, Ms. Kelly was senior vice president, Talent & Partner Experience from 2021 to 2022, where she was responsible for advancing Starbucks talent and organizational leadership agenda and was focused on amplifying the strategic work being led by the talent acquisition, talent management, partner experience, learning and development, and organization and leadership effectiveness teams. From 2014 to 2021, Ms. Kelly served as vice president, Partner Resources, supporting partners in our global markets.\nPilar Ramos\n joined Starbucks in November 2025 as executive vice president and chief legal officer. In this role, she leads the Company’s Law & Corporate Affairs organization. Prior to Starbucks, Ms. Ramos served as Executive Vice President, General Counsel and Corporate Secretary for TelevisaUnivision Inc., the leading Spanish-language media company, from August 2021 to October 2025. Ms. Ramos previously served in various roles for Mastercard Inc., a global payment card services company, from 2003 to 2021, including Executive Vice President, General Counsel, North America, from 2015 to 2021.\nSegment Financial Information\nSegment information is prepared on the same basis that our ceo, who is our Chief Operating Decision Maker, manages the segments, evaluates financial results, and makes key operating decisions.\nWe have \nthree\n reportable operating segments: 1) North America, which is inclusive of the U.S. and Canada; 2) International, which is inclusive of China, Japan, Asia Pacific, Europe, Middle East, Africa, Latin America, and the Caribbean; and 3) Channel Development. Unallocated corporate expenses are reported within Corporate and Other. Revenues from our reportable operating segments as a percentage of total net revenues for fiscal 2025 were as follows: North America (74%), International (21%), and Channel Development (5%).\nOur North America and International segments include both company-operated and licensed stores. Our North America segment is our most mature business and has achieved significant scale. Certain markets within our International operations are in various stages of development and may require more extensive support, relative to their current levels of revenue and operating income, than our North America operations.\nOur Channel Development segment includes roasted whole bean and ground coffees, Starbucks-branded single-serve products, a variety of ready-to-drink beverages, such as Frappuccino\n®\n and Starbucks Doubleshot\n®\n, foodservice products, and other branded products sold worldwide outside of our company-operated and licensed stores. A large portion of our Channel Development business operates under a licensed model of the Global Coffee Alliance with Nestlé, while our global ready-to-drink businesses operate under collaborative relationships with PepsiCo, Inc., Nestlé, and others.\n6\nTable of Contents\nRevenue Components\nWe generate the majority of our revenues through company-operated stores and licensed stores. \nCompany-operated and Licensed Store Summary as of September 28, 2025:\nNorth America\nAs a % of \nTotal\nNorth America Stores\nInternational\nAs a % of \nTotal\nInternational Stores\nTotal\nAs a % of\nTotal \nStores\nCompany-operated stores\n11,018 \n60 \n%\n10,496 \n46 \n%\n21,514 \n52 \n%\nLicensed stores\n7,293 \n40 \n%\n12,183 \n54 \n%\n19,476 \n48 \n%\nTotal\n18,311\n \n100\n \n%\n22,679\n \n100\n \n%\n40,990\n \n100\n \n%\nThe mix of company-operated versus licensed stores in a given market generally varies based on several factors, including our ability to access desirable local retail space, the complexity, profitability, and expected ultimate size of the market for Starbucks, and our ability to leverage the support infrastructure within a geographic region.\nCompany-operated Stores\nRevenue from company-operated stores accounted for 83% of total net revenues during fiscal 2025. Our retail objective is to be the leading retailer and brand of coffee and tea in each of our target markets by selling the finest quality coffee, tea, and related products, as well as complementary food offerings, and by providing each customer with a unique \nStarbucks Experience\n. The \nStarbucks Experience\n is built upon superior customer service through the Green Apron Service Model, convenience, and a seamless digital experience as well as warm and welcoming stores that reflect the personalities of the communities in which they operate, thereby building a high degree of customer loyalty.\nOur strategy for expanding our global retail business is to increase our category share in a disciplined manner, by selectively opening additional stores in new and existing markets, as well as increasing sales in existing stores, to support our long-term strategic objective to maintain Starbucks standing as one of the most recognized and respected brands in the world. Store growth in specific existing markets will vary due to many factors, including expected financial returns, the maturity of the market, economic conditions, consumer behavior, and the local business environment.\nCompany-operated store data for the fiscal year-ended September 28, 2025:\n \nStores Open \nas of\nStores Open \nas of\n \nSep 29, 2024\nOpened\nClosed \n(1)\nTransfers \n(2)\nNet\nSep 28, 2025\nNorth America:\nU.S.\n10,158 \n509 \n(620)\n— \n(111)\n10,047 \nCanada\n997 \n45 \n(75)\n— \n(30)\n967 \nSiren Retail\n6 \n— \n(2)\n— \n(2)\n4 \nTotal North America\n11,161 \n554 \n(697)\n— \n(143)\n11,018 \nInternational:\nChina\n7,594 \n569 \n(154)\n— \n415 \n8,009 \nJapan\n1,809 \n87 \n(12)\n(1)\n74 \n1,883 \nU.K.\n378 \n44 \n(11)\n113 \n146 \n524 \nAll Other\n71 \n7 \n(3)\n— \n4 \n75 \nSiren Retail\n5 \n— \n— \n— \n— \n5 \nTotal International\n9,857 \n707 \n(180)\n112 \n639 \n10,496 \nTotal company-operated\n21,018\n \n1,261\n \n(877)\n112\n \n496\n \n21,514\n \n(1)\nIncludes 627 stores closed in the fourth quarter of fiscal 2025 as part of our “Back to Starbucks” restructuring plan.\n(2)\nIncludes 113 licensed stores converted to company-operated stores in the first quarter of fiscal 2025 following the acquisition of 23.5 Degrees Topco Limited.\nStarbucks company-operated stores are typically located in high-traffic, high-visibility locations. Our ability to vary the size and format of our stores allows us to locate them in or near a variety of settings, including downtown and suburban retail centers, office buildings, university campuses, and rural and off-highway locations. We will continue to expand our coffeehouse portfolio to meet customers where they are with formats that provide a warm and welcoming environment, enable multiple opportunities to connect and gather, and provide attractive returns on invested capital.\n7\nTable of Contents\nRetail sales mix by product type for company-operated stores:\nFiscal Year Ended\nSep 28,\n2025\nSep 29,\n2024\nOct 1,\n2023\nBeverages\n73 \n%\n74 \n%\n74 \n%\nFood\n23 \n%\n23 \n%\n22 \n%\nOther\n(1)\n4 \n%\n3 \n%\n4 \n%\nTotal\n100 \n%\n100 \n%\n100 \n%\n(1)\n“Other” primarily consists of serveware, packaged and single-serve coffees and teas, and ready-to-drink beverages, among other items.\nStored Value Cards and Loyalty Program\nOur branded stored value card program (the “Starbucks Card”) is designed to provide customers with a convenient payment method, support gifting, and increase the frequency of store visits by cardholders, in part through the related Starbucks\n®\n Rewards loyalty program where available, as discussed below. Starbucks Cards are issued to customers when they initially load them with an account balance. They can be obtained in our company-operated and most licensed stores in North America, China, Japan, and many of our other markets in our International segment. Starbucks Cards can also be obtained online, via the Starbucks\n®\n Mobile App, and through other U.S. and international retailers. Customers may access their card balances by utilizing their Starbucks Card or the Starbucks Mobile App in participating stores. In nearly all markets, including the U.S. and Canada, customers who register their Starbucks Cards are automatically enrolled in the Starbucks Rewards program. Registered members can receive various benefits depending on factors such as the number of reward points (“Stars”) earned. In addition to using their Starbucks Cards, Starbucks Rewards members can earn Stars by paying with cash, credit or debit cards, or selected mobile wallets at all company-operated stores and a majority of licensed stores in North America. Using the Mobile Order and Pay functionality of the Starbucks Mobile App, customers can also place orders in advance for pick-up at certain participating locations in several markets. Refer to \nNote 1\n, Summary of Significant Accounting Policies and Estimates, included in Item 8 of Part II of this 10-K, for further discussion of our Starbucks Cards and loyalty program.\nLicensed Stores\nRevenues from our licensed stores accounted for 12% of total net revenues in fiscal 2025. Licensed stores generally have a lower gross margin and a higher operating margin than company-operated stores. Under the licensed model, Starbucks receives a margin on branded products and supplies sold to the licensed store operator along with a royalty on retail sales. Licensees are responsible for operating costs and capital investments, which more than offset the lower revenues we receive under the licensed store model.\nIn our licensed store operations, we seek to leverage the expertise of our local partners and share our operating and store development experience. Licensees provide improved, and at times the only, access to desirable retail space. Most licensees are prominent retailers with in-depth market knowledge and access. As part of these arrangements, we sell coffee, tea, food, and related products to licensees for resale to customers and receive royalties and license fees from the licensees. We also sell certain equipment, such as coffee brewers and espresso machines, to our licensees for use in their operations. Licensee employees working in licensed retail locations are required to follow our detailed store operating procedures and attend training classes similar to those given to employees in company-operated stores. In a limited number of international markets, we also use traditional franchising and include these stores in the results of operations from our other licensed stores.\n8\nTable of Contents\nLicensed store data for the fiscal year-ended September 28, 2025:\n \nStores Open \nas of\nStores Open \nas of\n \nSep 29, 2024\nOpened\nClosed\nTransfers  \n(1)\nNet\nSep 28, 2025\nNorth America:\nU.S.\n6,777 \n238 \n(202)\n— \n36 \n6,813 \nCanada\n486 \n14 \n(20)\n— \n(6)\n480 \nTotal North America\n7,263 \n252 \n(222)\n— \n30 \n7,293 \nInternational:\nKorea\n1,980 \n134 \n(37)\n— \n97 \n2,077 \nLatin America\n1,705 \n115 \n(7)\n— \n108 \n1,813 \nU.K.\n976 \n56 \n(19)\n(113)\n(76)\n900 \nTurkey\n722 \n45 \n(5)\n— \n40 \n762 \nTaiwan\n571 \n33 \n(12)\n— \n21 \n592 \nIndonesia\n603 \n8 \n(14)\n— \n(6)\n597 \nThailand\n513 \n39 \n(2)\n— \n37 \n550 \nPhilippines\n479 \n43 \n(2)\n— \n41 \n520 \nAll Other\n4,369 \n276 \n(274)\n1 \n3 \n4,372 \nTotal International\n11,918 \n749 \n(372)\n(112)\n265 \n12,183 \nTotal licensed\n19,181\n \n1,001\n \n(594)\n(112)\n295\n \n19,476\n \n(1)\nIncludes 113 licensed stores converted to company-operated stores in the first quarter of fiscal 2025 following the acquisition of 23.5 Degrees Topco Limited.\nOther Revenues \nOther revenues primarily are recorded in our Channel Development segment and include sales of packaged coffee, tea, and ready-to-drink beverages to customers outside of our company-operated and licensed stores, as well as royalties received from Nestlé under the Global Coffee Alliance and other collaborative partnerships.\nProduct Supply\nStarbucks is committed to selling the finest whole bean coffees and coffee beverages. To help ensure compliance with our rigorous coffee standards, we generally control substantially all coffee purchasing, roasting, and packaging, and the global distribution of coffee used in our operations. Nestlé controls distribution of Starbucks packaged coffee products outside of Starbucks stores through the Global Coffee Alliance, and in some cases, also roasts and packages these products. We purchase green coffee beans from multiple coffee-producing regions around the world and custom roast them to our exacting standards for our many blends and single-origin coffees.\nThe price of coffee is subject to volatility and has steadily increased over the past five years with significant increases over the last two years. Although most coffee trades in the commodity market, high-altitude \narabica\n coffee of the quality sought by Starbucks tends to trade on a negotiated basis at a premium above the “C” coffee commodity price. Both the premium and the commodity price depend upon the supply and demand at the time of purchase. Supply and price can be affected by multiple factors in the producing countries, including weather and extreme weather events, water supply quality and availability throughout the coffee production chain, natural disasters, crop disease and pests, general increases in farm inputs and costs of production, inventory levels, and political and economic conditions. Climate change may further exacerbate many of these factors. Price is also impacted by geopolitical conditions, including new and existing tariffs on coffee imports and other trade controls, and by trading activities in the \narabica\n coffee futures market, including hedge funds and commodity index funds. In addition, green coffee prices have been affected in the past, and may be affected in the future, by the actions of certain organizations and associations that have historically attempted to influence prices of green coffee through agreements establishing export quotas or by restricting coffee supplies.\nWe buy coffee using fixed-price and price-to-be-fixed purchase commitments, depending on market conditions, to secure an adequate supply of quality green coffee. We also utilize forward contracts, futures contracts, and collars to hedge “C” price exposure under our price-to-be-fixed green coffee contracts and our long-term forecasted coffee demand where underlying fixed-price and price-to-be-fixed contracts are not yet available. Total purchase commitments, together with existing inventory, are expected to provide an adequate supply of green coffee through fiscal 2026.\n9\nTable of Contents\nWe depend upon our relationships with coffee producers, outside trading companies, and exporters for our supply of green coffee. We believe, based on the established relationship and historical performance of our suppliers, that the risk of non-delivery on such purchase commitments is remote.\nTo help ensure the future supply of high-quality green coffee and to reinforce our leadership role in the coffee industry, Starbucks operates ten farmer support centers, including our China Farmer Support Center located in the Yunnan Province of this high-growth market. Farmer support centers are staffed with agronomists and sustainability experts who work with coffee farming communities to promote best practices in coffee production designed to improve both coffee quality and yields as well as agronomy support to address climate change and other impacts.\nIn addition to coffee, we also purchase significant amounts of dairy, particularly fluid milk, and to a lesser degree, plant-based dairy-free alternative products, such as oat milk and almond milk, to support the needs of our company-operated stores. We believe, based on the established relationship and historical performance of our dairy and plant-based dairy-free suppliers, that the risk of non-delivery of sufficient fluid milk and plant-based dairy-free alternatives to support our stores generally is remote.\nProducts other than whole bean coffees and coffee beverages sold in Starbucks stores include tea and a number of ready-to-drink beverages that are purchased from several specialty suppliers, usually under long-term supply contracts. Food products, such as pastries, breakfast sandwiches, and lunch items, are purchased from national, regional, and local sources. We also purchase a broad range of paper and plastic products, such as cups and cutlery, from several companies to support the needs of our retail stores as well as our manufacturing and distribution operations. We believe, based on the established relationship and historical performance of our suppliers and manufacturers, that the risk of non-delivery of sufficient amounts of these items generally is remote.\nCompetition\nOur primary competitors for coffee beverage sales are specialty coffee retailers and shops. We believe that our customers choose among specialty coffee retailers and shops primarily on the basis of product quality, brand reputation, service, and convenience, as well as price. We continue to experience direct competition from large competitors in the quick-service restaurant sector and the ready-to-drink coffee beverage market, in addition to both well-established and start-up companies in many international markets. We also compete with restaurants and other specialty retailers for prime retail locations and qualified personnel to operate both new and existing stores.\nOur coffee and tea products sold through our Channel Development segment compete directly against specialty coffees and teas sold through grocery stores, warehouse clubs, specialty retailers, convenience stores, and foodservice accounts and also compete indirectly against all other coffees and teas on the market. \nTrademarks, Copyrights, Patents, and Domain Names\nStarbucks owns and has applied to register numerous trademarks and service marks in the U.S. and in other countries throughout the world. Some of our trademarks, including Starbucks, the Starbucks logo, Starbucks Reserve, and Frappuccino, are of material importance. The duration of trademark registrations varies from country to country. However, trademarks are generally valid and may be renewed indefinitely as long as they are in use and/or their registrations are properly maintained.\nWe own numerous copyrights for items such as product packaging, promotional materials, in-store graphics, and training materials. We also hold patents on certain products, systems, and designs, which have an average remaining duration of approximately fifteen years. In addition, Starbucks has registered and maintains numerous Internet domain names, including “Starbucks.com,” “Starbucks.net,” and “Starbucksreserve.com.”\nSeasonality and Quarterly Results\nOur business is subject to moderate seasonal fluctuations, of which our second fiscal quarter typically experiences lower revenues and operating income. Additionally, as Starbucks Cards are issued to, and loaded by, customers during the holiday season, we tend to have higher cash flows from operations during the first quarter of the fiscal year. However, since revenues from Starbucks Cards are recognized upon redemption and not when cash is loaded onto the Starbucks Cards, the impact of seasonal fluctuations on the consolidated statements of earnings is much less pronounced. As a result of moderate seasonal fluctuations, results for any quarter are not necessarily indicative of the results that may be achieved for the full fiscal year.\nGovernment Regulation \nAs a company with global operations, we are subject to the laws and regulations of the United States and the multiple foreign jurisdictions in which we operate as well as the rules, reporting obligations, and interpretations of all such requirements and obligations by various governing bodies, which may differ among jurisdictions. In addition, changes to such laws, regulations, rules, reporting obligations, and related compliance obligations could result in significant costs but are not expected to have a material effect on our capital expenditures, results of operations, and competitive position as compared to prior periods.\n10\nTable of Contents\nAvailable Information\nStarbucks Annual Report on Form 10-K reports, along with all other reports and amendments filed with or furnished to the SEC, are publicly available free of charge on the Investor Relations section of our website at investor.starbucks.com as soon as reasonably practicable after these materials are filed with or furnished to the SEC. In addition, the SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at www.sec.gov. Our corporate governance policies, code of ethics, and Board committee charters and policies are also posted on the Investor Relations section of our website. We also use the Investor Relations section of our website and our social media channels as tools to disclose important information about the Company and comply with our disclosure obligations under Regulation Fair Disclosure. We encourage investors and others to review the information we make public on the Investor Relations section of our website and our social media channels, as such information could be deemed material information. The information on our website (or any webpages referenced in this Report) or our social media channels is not part of this or any other report Starbucks files with, or furnishes to, the SEC, and all website addresses in this report are intended to be inactive textual references only.",
    "item1a": "Item 1A of this Form 10-K.\nGovernance\nOur cybersecurity program is \nled by\n our senior vice president, chief information security officer (“ciso”), who is responsible for identifying, assessing, and managing our collective information security and technology risks.\n \nOur ciso has more than 20 years of experience in the information security and technology fields, including various leadership roles in several large companies across multiple industries. Those roles have included leading various cybersecurity capabilities and managing information security, business intelligence, and data analytics teams.\nThe ciso is informed about the prevention, detection, mitigation, and remediation of cybersecurity incidents through management of, and participation in, the cybersecurity program described above, including through reports prepared by our internal cybersecurity team and the operation of our incident response plan. \nThe ciso meets regularly with leaders of our various information technology management teams and with the \nRisk Management Committee\n (a cross-functional management-level \n22\nTable of Contents\ncommittee, which is co-managed by our cfo and chief legal officer and meets at least quarterly), to review and discuss our cybersecurity and other information technology risks and opportunities.\nOur Board has ultimate cybersecurity and data privacy risk oversight responsibility for the Company and administers this responsibility both directly and with assistance from the Audit and Compliance Committee (“Audit Committee”). The Audit Committee oversees our cybersecurity and technology risks, along with our data privacy risks, all of which are integrated into our overall ERM program. The Audit Committee actively reviews and discusses our cybersecurity and technology risk management programs and regularly reports out to the full Board on our relevant strengths and opportunities. The Audit Committee also reviews our data privacy risk management programs and reports out to the full Board on our relevant strengths and opportunities.\nThe Audit Committee receives quarterly updates from the ciso or other members of the ciso’s team with responsibility for oversight of our key cybersecurity program components. These updates include, as appropriate, ongoing changes in our external and internal cybersecurity threat landscape, new technology trends and regulatory developments, evolving internal policies and practices used to manage and mitigate cybersecurity and technology-related risks, cybersecurity incidents and our response to them, and trends in various metrics that are used to help assess our overall cybersecurity program effectiveness\n.",
    "item1b": "Item 1B.  \nUnresolved Staff Comments\nNone.\n21\nTable of Contents",
    "item1c": "Item 1C.  \nCybersecurity\nRisk Management and Strategy\nStarbucks has implemented a cybersecurity program that leverages industry-standard cybersecurity frameworks, such as the National Institute of Standards and Technology Cybersecurity Framework, to assess, identify, and manage cybersecurity risk. Our cybersecurity program is \nintegrated\n with the Enterprise Risk Management (“ERM”) framework and governance processes\n utilized by management and our Board to oversee our various top enterprise risks. Our \ninternal\n audit function periodically evaluates our cybersecurity program and selected aspects of it. \nWe have implemented various processes and tools to identify cybersecurity threats, detect potential attacks, and protect our data and information technology. We periodically evaluate evolving cybersecurity risks and legal and compliance requirements, and we make ongoing strategic investments to address those evolving risks and requirements. We also participate in multiple cybersecurity forums that share threat intelligence and best practices.\nStarbucks assesses, measures, and reports on cybersecurity risk at operational, program or management, and strategic or executive oversight levels. We maintain and periodically update written cybersecurity policies, standards, and controls, which are reviewed by a cross-functional management-level committee and designed to align with business objectives, regulatory requirements, and industry best practices. We train our employees through annual cybersecurity awareness training, which includes information about how to report cybersecurity concerns and incidents, as well as phishing simulations and periodic communications about timely cybersecurity topics and threats. We also implement a variety of tools to monitor our systems and network activity, and we conduct various simulated attacks and penetration tests to assess the effectiveness of these tools.\nWe maintain an incident response plan that guides us in identifying, evaluating, responding to, and recovering from cybersecurity incidents. The plan provides for the creation of a cross-functional, tailored incident response team, led by dedicated incident responders, that may include both Company personnel and third-party service providers, as appropriate. The incident response plan includes incident classification and escalation protocols, including a process for informing senior management and the Board, as appropriate, as well as processes to assess and comply with applicable legal obligations. We periodically test the effectiveness of the plan, and review and update it, as appropriate. \nWe also maintain insurance coverage that, subject to its terms and conditions, is intended to help us mitigate certain costs associated with cybersecurity incidents.\nWe engage third-party security experts, as appropriate, to support our processes for assessing, identifying, and managing cybersecurity risks, including, for example, periodic evaluations of our cybersecurity program from a design and effectiveness perspective, penetration testing, vulnerability scanning, employee awareness training, phishing simulations, and incident monitoring and response.\nTo address cybersecurity risk arising from our relationships with our third-party business partners and service providers, we maintain a third-party risk management program, which takes a risk-based approach and includes elements such as conducting cybersecurity assessments, including cybersecurity-related obligations in agreements, and utilizing external monitoring sources. \nIn addition, we maintain a global privacy program to identify, assess, and manage privacy risks related to how we are collecting, using, sharing, storing, and otherwise processing personal data.\nAs of the date of this filing, we have \nnot\n identified any cybersecurity threats or incidents that have materially affected or are reasonably likely to materially affect our business strategy, results of operations, or financial condition. However, there can be no assurance that we, or our third-party business partners or service providers, will not experience a cybersecurity threat or incident in the future that could materially adversely affect our business strategy, results of operations, or financial condition.\n For further discussion of the risks related to cybersecurity, see the risk factors discussed under “Risks Related to Cybersecurity, Data Privacy, and Information Technology” in our Risk Factors in"
  }
}