{
  "ticker": "SHW",
  "cik": "0000089800",
  "company_name": "SHERWIN WILLIAMS CO",
  "filing_date": "2025-02-20",
  "accession": "0000089800-25-000030",
  "primary_doc": "shw-20241231.htm",
  "item_sections": {
    "item1": "Item 1A Risk Factors for further information regarding the current and potential impact of general business and macroeconomic conditions, including inflation rates and interest rates, supply chain disruptions, raw material availability and fluctuations in foreign currency.\nRESULTS OF OPERATIONS \nThe following discussion and analysis addresses comparisons of material changes in the consolidated financial statements for the years ended December 31, 2024 and 2023. For comparisons of the years ended December 31, 2023 and 2022, see Management’s Discussion and Analysis of Financial Condition and Results of Operations in Item 7 of the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed on February 20, 2024.\nNet Sales\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nCurrency Impact\nAcquisition and Divestiture Impact\nPaint Stores Group\n$\n13,188.0\n \n$\n12,839.5 \n$\n348.5 \n2.7 \n%\n— \n%\n— \n%\nConsumer Brands Group\n3,108.0\n \n3,365.6 \n(257.6)\n(7.7)\n%\n(2.9)\n%\n(1.4)\n%\nPerformance Coatings Group\n6,797.3\n \n6,843.1 \n(45.8)\n(0.7)\n%\n(0.8)\n%\n1.2 \n%\nAdministrative\n5.2\n \n3.7 \n1.5 \n40.5 \n%\n2.7 \n%\n— \n%\nTotal\n$\n23,098.5\n \n$\n23,051.9 \n$\n46.6 \n0.2 \n%\n(0.7)\n%\n0.1 \n%\nConsolidated Net sales for 2024 increased 0.2% primarily due to higher sales in the Paint Stores Group. This increase was partially offset by lower sales in the Consumer Brands and Performance Coatings Groups. Net sales of all consolidated foreign subsidiaries decreased to $4.426 billion in 2024 compared to $4.428 billion in 2023 primarily due to unfavorable currency translation impact in Latin America and lower Net sales in Asia as a result of the divestiture of the China architectural business, partially offset by higher Net sales in Europe as a result of acquisitions. Net sales of all operations other than consolidated foreign subsidiaries increased to $18.673 billion for 2024 compared to $18.624 billion for 2023.\nNet sales in the Paint Stores Group increased 2.7% primarily due to sales volume growth and selling price increases, which both impacted Net sales by a low-single digit percentage.\n \nNet sales from stores in the Paint Stores Group open for more than twelve calendar months increased 1.7% in the year over the prior year comparable period. During 2024, the Paint Stores Group opened 84 new stores and closed 5 locations for a net increase of 79 stores. The total number of stores in operation at December 31, 2024 was 4,773 in the United States, Canada and the Caribbean region. The Paint Stores Group’s objective is to expand its store base by an approximate average of 2% each year, primarily through organic growth. Sales of products other than paint increased 0.6% over last year. A discussion of changes in volume versus pricing for sales of products other than paint is not pertinent due to the wide assortment of general merchandise sold.\nNet sales in the Consumer Brands Group decreased 7.7% in 2024 primarily due to a low-single digit percentage sales volume decline primarily due to soft DIY demand in North America, 2.9% unfavorable foreign currency translation driven by Latin America and the impact from divestitures in the prior year. In 2024, the Consumer Brands Group opened 18 new stores and closed 2 locations for a net increase of 16 new stores. The total number of stores in operation at December 31, 2024 was 334 in Latin America.  \nNet sales in the Performance Coatings Group decreased 0.7% in 2024 primarily due to selling price decreases, largely attributable to product mix, which impacted Net sales by a low-single digit percentage and unfavorable foreign currency translation. These decreases were partially offset by low-single digit volume growth, inclusive of the acquisition of SIC Holding GmbH in 2023 and the acquisition of a metal packaging coatings business in 2024. In 2024, the Performance Coatings Group added 2 net new branches, increasing the total to 324 branches. \nNet sales in the Administrative function, which primarily consists of external leasing revenue, increased by an insignificant amount in 2024.\n25\nTable of Contents\nIncome Before Income Taxes\nThe following table presents the components of Income before income taxes as a percent of Net sales:\nYear Ended December 31,\n2024\n2023\n% of Net Sales\n% of Net Sales\nNet sales\n$\n23,098.5\n100.0\n \n%\n$\n23,051.9\n100.0 \n%\nCost of goods sold\n11,903.4\n51.5\n \n%\n12,293.8\n53.3 \n%\nGross profit\n11,195.1\n48.5\n \n%\n10,758.1\n46.7 \n%\nSelling, general and administrative expenses (SG&A)\n7,422.1\n32.1\n \n%\n7,065.4\n30.6 \n%\nOther general (income) expense - net\n(38.8)\n(0.1)\n%\n67.1\n0.3 \n%\nImpairment\n—\n—\n \n%\n57.9\n0.3 \n%\nInterest expense\n415.7\n1.8\n \n%\n417.5\n1.8 \n%\nInterest income\n(11.0)\n—\n \n%\n(25.2)\n(0.1)\n%\nOther (income) expense - net\n(44.7)\n(0.2)\n%\n65.5\n0.3 \n%\nIncome before income taxes\n$\n3,451.8\n14.9\n \n%\n$\n3,109.9\n13.5 \n%\nConsolidated Cost of goods sold decreased $390.4 million, or 3.2%, in 2024 compared to the same period in 2023 primarily due to lower sales volume in the Consumer Brands Group and moderating raw material costs, partially offset by higher sales volumes in the Paint Stores and Performance Coatings Groups.\nConsolidated Gross profit increased $437.0 million, or 4.1%, in 2024 compared to the same period in 2023 primarily due to higher sales volumes in the Paint Stores and Performance Coatings Groups and moderating raw material costs, partially offset by lower sales volume in the Consumer Brands Group. Consolidated Gross profit as a percent to consolidated Net sales increased to 48.5% in 2024 from 46.7% in 2023 for these same reasons.\nThe Paint Stores Group’s Gross profit for 2024 increased $242.1 million compared to the same period in 2023 primarily due to higher Net sales driven by sales volume growth, selling price increases and moderating raw material costs. The Paint Stores Group’s Gross profit as a percent of Net sales increased for these same reasons. The Consumer Brands Group’s Gross profit increased $181.1 million in 2024 compared to the same period in 2023 primarily due to higher fixed cost absorption in the manufacturing and distribution operations within the segment and moderating raw material costs, partially offset by lower Net sales. The Consumer Brands Group’s Gross profit as a percent of Net sales increased for these same reasons. The Performance Coatings Group’s Gross profit increased $13.6 million compared to the same period in 2023 primarily due to moderating raw material costs, partially offset by lower Net sales. The Performance Coatings Group’s Gross profit as a percent of Net sales increased for these same reasons. \nConsolidated SG&A increased by $356.7 million, or 5.0%, in 2024 compared to the same period in 2023 primarily due to investments in long-term growth strategies, including expenses to support net new store openings and digital technologies and higher employee-related costs. As a percent of Net sales, SG&A increased 150 basis points compared to the same period in 2023 for these same reasons.\nThe Paint Stores Group’s SG&A increased $194.1 million or 4.6% for the year primarily due to higher employee-related costs and investments in long-term growth initiatives, including increased spending from net new store openings and costs to support higher sales. The Consumer Brands Group’s SG&A decreased $19.2 million or 2.2% for the year primarily due to effective cost control in managing the operations of the business, partially offset by higher employee-related costs. The Performance Coatings Group’s SG&A increased by $27.5 million or 1.9% for the year primarily due to investments in long-term initiatives and higher employee-related costs. The Administrative function’s SG&A increased $154.3 million or 27.7% primarily due to higher employee-related costs and increased expenses related to digital technologies and systems.\nOther general (income) expense - net changed by $105.9 million from expense of $67.1 million in 2023 to income of $38.8 million in 2024. The change was primarily attributable to a decrease in provisions for environmental matters, net in the Administrative function and increased net gains on sale or disposition of assets. This activity was partially offset by the non-recurring gain recognized in 2023 related to the divestiture of a non-core domestic aerosol business. See Note 19 to the consolidated financial statements in Item 8 for additional information. \n26\nTable of Contents\nThere was no impairment in 2024. Asset impairment of $34.0 million related to the divestiture of the China architectural business and impairment related to trademarks of $23.9 million primarily related to a trademark in Europe were recorded in 2023. For information on impairment considerations, see Notes 3 and 6 to the consolidated financial statements in Item 8.\nInterest expense decreased $1.8 million in 2024 compared to 2023 primarily due to a decrease in long-term debt, partially offset by higher interest expense as a result of an increase in short-term borrowings. See Note 7 to the consolidated financial statements in Item 8 for additional information on the Company’s outstanding debt.\nOther (income) expense - net changed by $110.2 million from expense of $65.5 million in 2023 to income of $44.7 million in 2024 primarily due to lower foreign currency transaction related losses in 2024 compared to 2023 and an increase in miscellaneous income. The foreign currency transaction related losses in 2023 included a $41.8 million unfavorable impact from the significant devaluation of the Argentine peso in December 2023 as part of economic reforms implemented by the government of Argentina. In addition, a $12.8 million loss on extinguishment of debt was recognized in 2023. This activity was partially offset by a decrease in miscellaneous pension income and investment gains. See Note 19 to the consolidated financial statements in Item 8 for additional information related to Other (income) expense - net.\nThe following table presents Income before income taxes by segment and as a percent of Net sales by segment:\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nIncome Before Income Taxes:\nPaint Stores Group\n$\n2,902.6\n$\n2,860.8\n$\n41.8 \n1.5 \n%\nConsumer Brands Group\n589.9\n309.3\n280.6 \n90.7 \n%\nPerformance Coatings Group\n1,027.9\n991.6\n36.3 \n3.7 \n%\nAdministrative\n(1,068.6)\n(1,051.8)\n(16.8)\n(1.6)\n%\nTotal\n$\n3,451.8\n$\n3,109.9\n$\n341.9 \n11.0 \n%\nIncome Before Income Taxes as a percent of Net sales:\nPaint Stores Group\n22.0\n \n%\n22.3 \n%\nConsumer Brands Group\n19.0\n \n%\n9.2 \n%\nPerformance Coatings Group\n15.1\n \n%\n14.5 \n%\nAdministrative\nnm\nnm\nTotal\n14.9\n \n%\n13.5 \n%\nnm - not meaningful\nIncome Tax Expense\nThe effective income tax rate for 2024 was 22.3% compared to 23.2% in 2023. The decrease in the effective rate was primarily due to a more favorable impact of tax benefits related to employee share-based payments. The other significant components of the Company’s effective tax rate were consistent year-over-year. See Note 20 to the consolidated financial statements in Item 8 for additional information.\nNet Income Per Share\nDiluted net income per share for 2024 increased to $10.55 per share from $9.25 per share in 2023. Currency translation rate changes decreased diluted net income per share by $0.06 per share for 2024. Diluted net income per share in 2024 included acquisition-related amortization expense of $0.78 per share. Diluted net income per share for 2023 included acquisition-related amortization expense of $0.78 per share, severance and other expense of $0.04 per share, expenses related to the divestiture of the China architectural business of $0.11 per share, impairment related to trademarks of $0.07 per share and expense related to the devaluation of the Argentine peso of $0.16 per share. These expenses were partially offset by a gain on the divestiture of a non-core domestic aerosol business of $0.06 per share. See Notes 3, 6 and 19 to the consolidated financial statements in Item 8 for additional information.\n27\nTable of Contents\nFINANCIAL CONDITION, LIQUIDITY AND CASH FLOW\nOverview\nThe Company’s financial condition, liquidity and cash flow remained strong in 2024. The Company generated $3.153 billion in Net operating cash and invested $1.014 billion in capital expenditures and approximately $80 million in the acquisition of a metal packaging coatings business. The Company also returned cash of $2.462 billion to shareholders in the form of cash dividends and share repurchases during the year.\nThe Company’s EBITDA increased 8.2% to $4.492 billion. See the Non-GAAP Financial Measures section for the definition and calculation of EBITDA. As of December 31, 2024, the Company had Cash and cash equivalents of $210.4 million and total debt outstanding of $9.888 billion. Total debt, net of Cash and cash equivalents, was $9.678 billion and was 2.2 times the Company’s EBITDA in 2024.\n \nNet Working Capital\nNet working capital, defined as Total current assets less Total current liabilities, decreased $293.9 million to a deficit of $1.408 billion at December 31, 2024 compared to a deficit of $1.114 billion at December 31, 2023. The net working capital decrease is due to an increase in Short-term borrowings and a decrease in current assets, particularly Accounts receivable, net and Cash and cash equivalents, partially offset by an increase in Other current assets and a decrease in Accounts payable.\nCurrent asset balances decreased $112.1 million at December 31, 2024 compared to December 31, 2023 primarily due to a decrease in Accounts receivable, net of $79.1 million, a decrease in Cash and cash equivalents of $66.4 million and a decrease in Inventories of $41.7 million. These decreases were partially offset by an increase in Other current assets of $75.1 million, primarily related to prepaid expenses.\nCurrent liability balances increased $181.8 million at December 31, 2024 compared to December 31, 2023 primarily due to an increase in Short-term borrowings of $288.2 million and an increase in Other accruals of $30.7 million primarily related to liabilities related to insurance, investments in U.S. affordable housing and historic renovation real estate partnerships and contracts with customers, partially offset by a decrease in short-term environmental liabilities. These increases were partially offset by a decrease in Accounts payable of $61.8 million, a decrease in Current portion of long-term debt of $49.6 million and a decrease in Accrued taxes of $23.1 million. \nAs a result of the net effect of these changes, the Company’s current ratio decreased to 0.79 at December 31, 2024 from 0.83 at December 31, 2023. Accounts receivable as a percent of Net sales decreased to 10.3% in 2024 from 10.7% in 2023. Accounts receivable days outstanding was 58 days in 2024 and 2023.\n \nIn 2024, the allowance for current expected credit losses increased $0.8 million, or 1.3%. Inventories as a percent of Net sales decreased to 9.9% in 2024 from 10.1% in 2023. Inventory days outstanding was 93 days in 2024 compared to 94 days in 2023. The Company has sufficient total available borrowing capacity to fund its current operating needs.\nProperty, Plant and Equipment\nProperty, plant and equipment, net increased $696.4 million to $3.533 billion at December 31, 2024 primarily due to capital expenditures of $1.014 billion and assets acquired through a business combination of $32.9 million, partially offset by depreciation expense of $297.4 million and foreign currency translation and other adjustments of $52.6 million. During 2023, the Company closed on a transaction to sell and subsequently lease back its current global headquarters and R&D center. In connection with the sale, proceeds of $47.2 million were received and an immaterial gain was recognized.  \nCapital expenditures during 2024 included expenditures related to construction activities associated with the new global headquarters and R&D center in the Administrative function. Construction of the new global headquarters and R&D center is expected to be complete in 2025. Also included in 2024 capital expenditures were expenditures related to manufacturing capacity expansion, operational efficiencies and maintenance projects in the Consumer Brands and Performance Coatings Groups and the opening of new paint stores and renovation and improvements in existing stores in the Paint Stores Group.\nIn 2025, the Company expects to spend slightly less than 2024 for capital expenditures, which it will fund primarily through the generation of operating cash. Core capital expenditures are expected to be for investments in various productivity improvement and maintenance projects at existing manufacturing, distribution and research and development facilities and new store openings. Additionally, the Company expects to complete construction of its new global headquarters and R&D center. Refer to the Real Estate Financing section herein for further information on the financing transaction for the new global headquarters. \nReal Estate Financing\nIn December 2022, the Company closed a transaction to sell and subsequently lease back its partially-constructed new global headquarters. As part of the terms of the transaction, the Company is contractually obligated for completing the \n28\nTable of Contents\nconstruction of the building and related improvements at the new global headquarters. Construction is expected to complete in 2025. This transaction did not meet the criteria for recognition as an asset sale under U.S. generally accepted accounting principles (US GAAP) and as such, was accounted for as a real estate financing transaction. The Company expects to receive total proceeds approximating $800 million to $850 million, with final proceeds expected in the first quarter of 2025. The initial lease term includes the construction period and extends for 30 years thereafter, and the Company has the right and option to extend the lease term. The lease payment amounts during the construction period are dependent upon the timing and amount of total reimbursement of construction and other costs received by the Company. Lease payments over the next twelve months are expected to be approximately $50 million. The amount of the lease payments during the initial 30 year lease term will be calculated upon completion of the construction period and receipt of total reimbursement of construction and other costs. Once determinable, this is expected to result in a significant increase in the Company’s long-term contractual obligations.  \nThe following table summarizes the activity related to this transaction and the corresponding balances recognized in the Consolidated Balance Sheets.\n2024\n2023\n2022\nActivity:\nProceeds received\n$\n244.2\n \n$\n305.0 \n$\n210.0 \nCapitalized interest\n45.2\n \n23.8 \nBalances:\nShort-term liability\n$\n49.7\n \n$\n39.9 \n$\n20.0 \nLong-term liability\n715.9\n \n475.9 \n187.0 \nTotal liability\n$\n765.6\n \n$\n515.8 \n$\n207.0 \nThe net proceeds from this transaction and other real estate financing transactions are recognized as proceeds from real estate financing transactions within the Financing Activities section of the Statements of Consolidated Cash Flows. The Company will continue to recognize the related assets within Property, plant and equipment, net on the Consolidated Balance Sheets under US GAAP. These assets will be subject to depreciation over their useful lives in accordance with the Company’s accounting policies. The Company will also allocate payments between interest and repayment of the financing liability over the life of the agreement. See Note 10 to the consolidated financial statements within Item 8 for further information.\nGoodwill and Intangible Assets\nGoodwill, which represents the excess of cost over the fair value of net assets acquired in business combinations, decreased $45.9 million to $7.580 billion at December 31, 2024, due to foreign currency translation rate fluctuations of $94.1 million, partially offset by purchase accounting allocations of $48.2 million.\nIntangible assets decreased $347.3 million to $3.533 billion at December 31, 2024 due to amortization of finite-lived intangible assets of $326.7 million and foreign currency translation rate fluctuations and other adjustments of $75.9 million, partially offset by purchase accounting allocations of $28.0 million and capitalization of software of $27.3 million.\n \nSee Note 3 to the consolidated financial statements in Item 8 for additional information related to acquisitions. See Note 6 to the consolidated financial statements in Item 8 for a description of goodwill, intangible assets, historical impairments and summaries of the remaining carrying values of goodwill and intangible assets.\nOther Assets\nOther assets increased $420.7 million to $1.632 billion at December 31, 2024. The increase was primarily due to an increase in finance lease right-of-use (ROU) assets of $187.5 million, largely related to a new finance lease which commenced during 2024, an increase in assets related to contracts with customers and investments in U.S. affordable housing and historic renovation real estate partnerships. See Notes 1, 9 and 18 to the consolidated financial statements in Item 8 for additional information. \n29\nTable of Contents\nDebt (including Short-term borrowings)\nDecember 31,\nDecember 31,\n2024\n2023\nLong-term debt\n$\n9,226.0\n \n$\n9,476.7 \nShort-term borrowings\n662.4\n \n374.2 \nTotal debt outstanding\n$\n9,888.4\n \n$\n9,850.9 \nTotal debt outstanding, including Short-term borrowings, increased by $37.5 million to $9.888 billion in 2024. Short-term borrowings are primarily comprised of amounts outstanding under the Company’s domestic commercial paper program and various foreign credit facilities. The Company’s Long-term debt primarily consists of senior notes. The Company targets Net debt, which is total debt outstanding, net of Cash and cash equivalents, to be 2.0 to 2.5 times EBITDA. At December 31, 2024,  Net debt was $9.678 billion and was 2.2 times the Company’s EBITDA in 2024.\n \nSee the Non-GAAP Financial Measures section for the definition and calculation of EBITDA.\nIn August 2024, the Company repaid principal of $600.0 million related to the Company’s 4.05% senior notes due August 8, 2024 using commercial paper and subsequently issued $400.0 million of 4.55% senior notes due 2028 and $450.0 million of 4.80% senior notes due 2031 in a public offering. The net proceeds from the issuance of these notes were used to repay outstanding borrowings under the Company’s domestic commercial paper program and for general corporate purposes. The newly issued senior notes contain customary qualitative covenants as defined in their respective agreements. During the second quarter of 2024, the Company repaid the principal of $500.0 million related to its 3.125% senior notes due June 1, 2024 using commercial paper.\nIn December 2023, the Company exercised its call provision to make-whole the entire outstanding $119.4 million aggregate principal amount of its 7.38% Debentures due 2027 and the entire outstanding $3.5 million aggregate principal amount of its 7.45% Debentures due 2097. The retirement of the Debentures resulted in a loss of $12.8 million recorded in Other general (income) expense - net. See Note 19 to the consolidated financial statements in Item 8 for additional information.\nThe Company’s available capacity under its committed credit agreements is reduced for amounts outstanding under its domestic commercial paper program and letters of credit. At December 31, 2024, the Company had unused capacity under its various credit agreements of $3.274 billion. \nSee Note 7 to the consolidated financial statements in Item 8 for a detailed description and summary of the Company’s outstanding debt, short-term borrowings and other available financing programs.\nDefined Benefit Pension and Other Postretirement Benefit Plans\nIn accordance with the accounting prescribed by the Retirement Benefits Topic of the ASC, the Company’s total liability for unfunded or underfunded defined benefit pension plans decreased $1.2 million to $67.8 million primarily due to changes in actuarial assumptions. The Company’s liability for other postretirement benefits decreased $12.1 million to $135.1 million at December 31, 2024 primarily due to benefits paid and changes in actuarial assumptions.\nThe assumed discount rate used to determine the projected benefit obligation for the domestic defined benefit pension plan increased to 5.8% at December 31, 2024 from 5.1% at December 31, 2023. The assumed discount rate used to determine the projected benefit obligation for foreign defined benefit pension plans increased to 5.5% at December 31, 2024 from 4.8% at December 31, 2023. The assumed discount rate used to determine the projected benefit obligation for other postretirement benefit obligations increased to 5.6% at December 31, 2024 from 5.0% at December 31, 2023. The increase in the discount rates was primarily due to higher interest rates. \nIn determining the rates of compensation increases, management considered historical Company increases as well as expectations for future increases. The rate of compensation increases used to determine the projected benefit obligation at December 31, 2024 was 3.0% for the domestic pension plan and 3.3% for foreign pension plans, which was comparable to the rates used in the prior year. \nIn establishing the expected long-term rate of return on plan assets, management considered the historical rates of return, the nature of investments and an expectation for future investment strategies. The expected long-term rate of return on assets for the domestic defined benefit pension plan was 6.5% and 6.3% at December 31, 2024 and 2023, respectively. The expected long-term rate of return on assets for the foreign defined benefit pension plans was 4.8% at December 31, 2024 and 2023.\nIn developing the assumed health care cost trend rates, management considered industry data, historical Company experience and expectations for future health care costs. The assumed health care cost trend rates used to determine the projected benefit \n30\nTable of Contents\nobligation for other postretirement benefit obligations at December 31, 2024 were 6.5% and 11.8% for medical and prescription drug cost increases, respectively, both decreasing gradually to 4.5% in 2034. The assumed health care cost trend rates for medical and prescription costs used to determine the projected benefit obligation for other postretirement benefit obligations at December 31, 2023 were 6.0% and 9.0%, respectively. \nThe respective year-end assumptions described above for the Company’s defined benefit plans are also used to determine expense for the next year. Net pension (credit) cost in 2025 for the domestic pension plan and foreign pension plans is expected to be approximately $(1.6) million and $5.3 million, respectively. Net periodic benefit credit for other postretirement benefits in 2025 is expected to be approximately $9.7 million. This credit is primarily due to the remaining amortization of the impact of a plan amendment executed in 2022. This impact will be fully amortized in 2025. See Note 8 to the consolidated financial statements in Item 8 for additional information on the Company’s obligations and funded status of its defined benefit pension plans and other postretirement benefits.\nDeferred Income Taxes\nDeferred income taxes at December 31, 2024 decreased $75.6 million to $607.5 million at December 31, 2024 primarily due to amortization of intangible assets in the current year. See Note 20 to the consolidated financial statements in Item 8 for additional information on deferred taxes.\nOther Long-Term Liabilities\nOther long-term liabilities increased $401.4 million to $2.309 billion at December 31, 2024 primarily due to liabilities associated with real estate financing transactions, finance leases and commitments related to investments in U.S. affordable housing and historic renovation real estate partnerships, partially offset by the impact of expected settlements related to tax positions over the next twelve months. See Notes 1, 9, 10 and 20 to the consolidated financial statements in Item 8.\nEnvironmental Matters\nThe operations of the Company, like those of other companies in the same industry, are subject to various federal, state and local environmental laws and regulations. These laws and regulations not only govern current operations and products, but also impose potential liability on the Company for past operations. Management expects environmental laws and regulations to impose increasingly stringent requirements upon the Company and the industry in the future. Management believes that the Company conducts its operations in compliance with applicable environmental laws and regulations and has implemented various programs designed to protect the environment and promote continued compliance. \nDepreciation of capital expenditures and other expenses related to ongoing environmental compliance measures were included in the normal operating expenses of conducting business. The Company’s capital expenditures, depreciation and other expenses related to ongoing environmental compliance measures were not material to the Company’s financial condition, liquidity, cash flow or results of operations during 2024. Management does not expect that such capital expenditures, depreciation and other expenses will be material to the Company’s financial condition, liquidity, cash flow or results of operations in 2025. See Note 10 to the consolidated financial statements in Item 8 for further information on environmental-related liabilities.\nContractual and Other Obligations and Commercial Commitments\nThe Company has certain obligations and commitments to make future payments under contractual and other obligations and commercial commitments. The Company believes that cash generated from operating activities and borrowings available under long-term and short-term debt, including its committed credit agreements and commercial paper program, will be sufficient for it to meet its contractual and other obligations and commercial commitments. The following tables summarize such obligations and commitments as of December 31, 2024.\n31\nTable of Contents\nPayments Due by Period\nContractual and Other Obligations\nTotal\nLess Than\n1 Year\n1–3 Years\n3–5 Years\nMore Than\n5 Years\nLong-term debt\n$\n9,300.2 \n$\n1,050.0 \n$\n1,850.2 \n$\n1,200.0 \n$\n5,200.0 \nInterest on Long-term debt\n4,086.4 \n327.2 \n555.0 \n443.2 \n2,761.0 \nOperating leases\n2,289.1 \n540.4 \n845.6 \n489.8 \n413.3 \nFinance leases\n629.7 \n9.1 \n16.6 \n17.4 \n586.6 \nShort-term borrowings\n662.4 \n662.4 \nReal estate financing transactions \n(1)\n148.1 \n15.7 \n31.7 \n33.3 \n67.4 \nPurchase obligations \n(2)\n465.4 \n465.4 \nOther contractual obligations \n(3)\n757.3 \n157.0 \n187.2 \n165.0 \n248.1 \nTotal contractual cash obligations\n$\n18,338.6 \n$\n3,227.2 \n$\n3,486.3 \n$\n2,348.7 \n$\n9,276.4 \n(1)\nExcludes real estate financing transactions related to the new global headquarters. Refer to “Real Estate Financing” section herein for further information.\n(2)\nRelates to open purchase orders for raw materials at December 31, 2024.\n(3)\nRelates primarily to estimated future capital contributions for investments in the U.S. affordable housing and historic renovation real estate partnerships and various other contractual obligations.\nAdditionally, the Company has an obligation with respect to an agreement signed in February 2025 to acquire the Brazilian decorative paints business of BASF SE, which is excluded from the preceding table. The timing and amount of this obligation is uncertain as the transaction is expected to close in the second half of 2025 and is subject to customary closing conditions, including Brazilian regulatory approval and post-closing adjustments. Refer to Note 3 to the consolidated financial statements in Item 8 for further information.\n \nAmount of Commitment Expiration Per Period\nCommercial Commitments\nTotal\nLess Than\n1 Year\n1–3 Years\n3–5 Years\nMore Than\n5 Years\nStandby letters of credit\n$\n125.5 \n$\n125.5 \nSurety bonds\n216.1 \n216.1 \nTotal commercial commitments\n$\n341.6 \n$\n341.6 \n$\n— \n$\n— \n$\n— \nWarranties\nThe Company offers product warranties for certain products. The specific terms and conditions of such warranties vary depending on the product or customer contract requirements. Management estimated the costs of unsettled product warranty claims based on historical results and experience and included an amount in Other accruals. Management periodically assesses the adequacy of the accrual for product warranty claims and adjusts the accrual as necessary. Changes in the Company’s accrual for product warranty claims during 2024 and 2023, including customer satisfaction settlements during the year, were as follows:\n2024\n2023\nBalance at January 1\n$\n40.4\n \n$\n36.2 \nCharges to expense\n34.2\n \n37.0 \nSettlements\n(28.2)\n(32.8)\nBalance at December 31\n$\n46.4\n \n$\n40.4 \nShareholders’ Equity\nShareholders’ equity increased $335.4 million to $4.051 billion at December 31, 2024 from $3.716 billion last year. The\n \nincrease\n \nwas primarily attributable to\n \nthe generation of $2.681 billion of Net income and benefits from stock option exercises and the recognition of stock-based compensation expense of $367.5 million.\n \nThis was partially offset by the repurchase of $1.739 billion in Treasury stock, the payment of $723.4 million in cash dividends and a decrease in AOCI of $250.9 million mainly due to foreign currency translation adjustments. See the Statements of Consolidated Shareholders’ Equity and Statements of Consolidated Comprehensive Income in Item 8 for additional information.\nThe Company purchased 5.2 million shares of its common stock for treasury purposes through open market purchases during 2024. The Company acquires its common stock for general corporate purposes, and depending on its cash position and market \n32\nTable of Contents\nconditions, it may acquire shares in the future. The Company had remaining authorization from its Board of Directors at December 31, 2024 to purchase 34.4 million shares of its common stock. \nThe Company’s 2024 annual cash dividend of $2.86 per share represented 31% of 2023 diluted net income per share. The 2024 annual dividend represented the 46\nth\n consecutive year of increased dividend payments. On February 19, 2025, the Board of Directors increased the quarterly cash dividend to $0.79 per share. This quarterly dividend, if approved in each of the remaining quarters of 2025, would result in an annual dividend for 2025 of $3.16 per share, or a 30% payout of 2024 diluted net income per share.\nCash Flow\nNet operating cash decreased $368.7 million in 2024 to a cash source of $3.153 billion from a cash source of $3.522 billion in 2023 primarily due to higher cash requirements for working capital partially offset by higher Net income. Net operating cash decreased as a percent of Net sales to 13.7% in 2024 compared to 15.3% in 2023. \nNet investing cash usage increased $157.0 million to a usage of $1.196 billion in 2024 from a usage of $1.039 billion in 2023 primarily due to an increase in cash used for capital expenditures, proceeds from the divestiture of a business in 2023 and reduced proceeds from the sale of assets, partially offset by lower cash used for acquisitions. See Note 3 to the consolidated financial statements in Item 8 for additional information on acquisitions and divestitures.\nNet financing cash usage decreased $407.5 million to a usage of $2.017 billion in 2024 from a usage of $2.425 billion in 2023. This decrease was primarily due to a net increase in short-term borrowings, proceeds from long-term debt in 2024 and higher proceeds from stock options exercised, partially offset by an increase in payments of long-term debt, treasury stock purchases and payment of cash dividends.\nMarket Risk\nThe Company is exposed to market risk associated with interest rate, foreign currency and commodity fluctuations. The Company occasionally utilizes derivative instruments as part of its overall financial risk management policy, but does not use derivative instruments for speculative or trading purposes. In 2024 and 2023, the Company entered into foreign currency forward contracts with maturity dates of less than twelve months primarily to hedge against value changes in foreign currency and cross currency swap contracts to hedge its net investment in European operations. See Notes 1, 16 and 19 to the consolidated financial statements in Item 8 for additional information related to the Company’s use of derivative instruments.\nThe Company believes it may be exposed to continuing market risk from foreign currency exchange rate and commodity price fluctuations. However, the Company does not expect that foreign currency exchange rate and commodity price fluctuations or hedging contract losses will have a material adverse effect on the Company’s financial condition, results of operations or cash flows. See Notes 1 and 19 to the consolidated financial statements in Item 8 for additional information related to foreign currency translation.\nFinancial Covenant\nCertain borrowings contain a consolidated leverage covenant. The covenant states the Company’s consolidated leverage ratio is not to exceed 3.75 to 1.00; however, the Company may elect to temporarily increase the leverage ratio to 4.25 to 1.00 for a period of four consecutive fiscal quarters immediately following the consummation of a qualifying acquisition, as defined in the credit agreement dated July 31, 2024. The leverage ratio is defined as the ratio of total indebtedness (the sum of Short-term borrowings, Current portion of long-term debt and Long-term debt) at the reporting date to consolidated “Earnings Before Interest, Taxes, Depreciation and Amortization” (EBITDA), as defined in the credit agreement, for the 12-month period ended on the same date. Refer to the “Non-GAAP Financial Measures” section for a reconciliation of EBITDA to Net income. At December 31, 2024, the Company was in compliance with the covenant and expects to remain in compliance. The Company’s notes, debentures and revolving credit agreements contain various default and cross-default provisions. In the event of default under any one of these arrangements, acceleration of the maturity of any one or more of these borrowings may result. See Note 7 to the consolidated financial statements in Item 8 for additional information.\nDefined Contribution Savings Plan\nParticipants in the Company’s defined contribution savings plan are allowed to contribute up to the lesser of fifty percent of their annual compensation or the maximum dollar amount allowed under the Internal Revenue Code. The Company matches one hundred percent of all contributions up to six percent of eligible employee contributions. The Company’s matching contributions to the defined contribution savings plan charged to operations were $165.1 million in 2024 compared to $153.9 million in 2023. At December 31, 2024, there were 16,771,640 shares of the Company’s common stock being held by the defined contribution savings plan, representing 6.7% of the total number of voting shares outstanding. See Note 13 to the consolidated financial statements in Item 8 for additional information concerning the Company’s defined contribution savings plan.\n33\nTable of Contents\nNON-GAAP FINANCIAL MEASURES\nManagement utilizes certain financial measures that are not in accordance with US GAAP to analyze and manage the performance of the business. The required disclosures for these non-GAAP measures are shown below. The Company provides such non-GAAP information in reporting its financial results to give investors additional data to evaluate the Company’s operations. Management does not, nor does it suggest investors should, consider such non-GAAP measures in isolation from, or in substitution for, financial information prepared in accordance with US GAAP.\nEBITDA and Adjusted EBITDA\nEBITDA is a non-GAAP financial measure defined as Net income before income taxes, Interest expense, depreciation and amortization. Adjusted EBITDA is a non-GAAP financial measure defined as EBITDA that excludes certain adjustments that management believes enhances investors’ understanding of the Company’s operating performance. Management considers EBITDA and Adjusted EBITDA useful in understanding the operating performance of the Company. The reader is cautioned that the Company’s EBITDA and Adjusted EBITDA should not be compared to other entities unknowingly. Further, EBITDA and Adjusted EBITDA should not be considered alternatives to Net income or Net operating cash as an indicator of operating performance or as a measure of liquidity. The reader should refer to the determination of Net income and Net operating cash in accordance with US GAAP disclosed in the Statements of Consolidated Income and Statements of Consolidated Cash Flows in Item 8.\nThe following table summarizes EBITDA and Adjusted EBITDA as calculated by management for the years indicated below:\nYear Ended December 31,\n2024\n2023\nNet income\n$\n2,681.4\n \n$\n2,388.8 \nInterest expense\n415.7\n \n417.5 \nIncome taxes\n770.4\n \n721.1 \nDepreciation\n297.4\n \n292.3 \nAmortization\n326.6\n \n330.2 \nEBITDA\n$\n4,491.5\n \n$\n4,149.9 \nRestructuring expense\n—\n \n9.6 \nImpairment related to Restructuring Plan\n—\n \n34.0 \nGain on divestiture of domestic aerosol business\n—\n \n(20.1)\nImpairment related to trademarks\n—\n \n23.9 \nDevaluation of the Argentine peso\n—\n \n41.8 \nAdjusted EBITDA\n$\n4,491.5\n \n$\n4,239.1 \nFree Cash Flow After Dividends\nFree cash flow after dividends is a non-GAAP financial measure defined as Net operating cash, as shown in the Statements of Consolidated Cash Flows, less the amount reinvested in the business for capital expenditures and the return on investment to its shareholders by the payments of cash dividends. Management considers Free cash flow after dividends to be a useful tool in its determination of appropriate uses of the Company’s Net operating cash. The reader is cautioned that the Free cash flow after dividends measure should not be compared to other entities unknowingly as it may not be comparable and it does not consider certain non-discretionary cash flows, such as mandatory debt and interest payments. The amount shown below should not be considered an alternative to Net operating cash or other cash flow amounts provided in accordance with US GAAP as disclosed in the Statements of Consolidated Cash Flows in Item 8. \nThe following table summarizes Free cash flow after dividends as calculated by management for the years indicated below: \nYear Ended December 31,\n2024\n2023\nNet operating cash\n$\n3,153.2\n \n$\n3,521.9 \nCapital expenditures\n(1,070.0)\n(888.4)\nCash dividends\n(723.4)\n(623.7)\nFree cash flow after dividends\n$\n1,359.8\n \n$\n2,009.8 \n34\nTable of Contents\nAdjusted Diluted Net Income Per Share\nManagement believes investors’ understanding of the Company’s operating performance is enhanced by the disclosure of diluted net income per share excluding Valspar acquisition-related amortization expense and certain other adjustments. Valspar acquisition-related amortization expense is excluded from diluted net income per share due to its significance as a result of the purchase price assigned to finite-lived intangible assets at the date of acquisition and the related impact on underlying business performance and trends. While these intangible assets contribute to the Company’s revenue generation, the related revenue is not excluded. This adjusted earnings per share measurement is not in accordance with US GAAP. It should not be considered a substitute for earnings per share in accordance with US GAAP and may not be comparable to similarly titled measures reported by other companies. The following tables reconcile diluted net income per share computed in accordance with US GAAP to adjusted diluted net income per share.\nYear Ended\nDecember 31, 2024\nPre-Tax\nTax \nEffect \n(1)\nAfter-Tax\nDiluted net income per share\n$\n10.55 \nAcquisition-related amortization expense \n(2)\n$\n1.02 \n$\n.24 \n.78 \nAdjusted diluted net income per share\n$\n11.33 \nYear Ended\nDecember 31, 2023\nPre-Tax\nTax \nEffect \n(1)\nAfter-Tax\nDiluted net income per share\n$\n9.25 \nItems related to Restructuring Plan:\nSeverance and other\n$\n.06 \n$\n.02 \n.04 \nImpairment of assets related to China divestiture\n.13 \n.08 \n.05 \nGain on divestiture of domestic aerosol business\n(.08)\n(.02)\n(.06)\nDiscrete income tax expense related to China divestiture \n(1)\n— \n(.06)\n.06 \nTotal\n.11 \n.02 \n.09 \nImpairment related to trademarks\n.09 \n.02 \n.07 \nDevaluation of the Argentine peso\n.16 \n— \n.16 \nAcquisition-related amortization expense \n(2)\n1.03 \n.25 \n.78 \nAdjusted diluted net income per share\n$\n10.35 \n(1)    \nThe tax effect is calculated based on the statutory rate and the nature of the item, unless otherwise noted.\n(2)    \nAcquisition-related amortization expense, which is included within Selling, general and administrative expenses, consists of the amortization of intangible assets related to the Valspar acquisition. These intangible assets are primarily customer relationships and intellectual property and are being amortized over their remaining useful lives.\n35\nTable of Contents\nAdjusted Segment Profit\nManagement believes investors’ understanding of the Company’s operating performance is enhanced by the disclosure of Segment profit excluding Valspar acquisition-related amortization expense and certain other adjustments. Valspar acquisition-related amortization expense is excluded from Segment profit due to its significance as a result of the purchase price assigned to finite-lived intangible assets at the date of acquisition and the related impact on underlying business performance and trends. While these intangible assets contribute to the Company’s revenue generation, the related revenue is not excluded. This Adjusted segment profit measurement is not in accordance with US GAAP. It should not be considered a substitute for Segment profit in accordance with US GAAP and may not be comparable to similarly titled measures reported by other companies. The following tables reconcile Segment profit computed in accordance with US GAAP to Adjusted segment profit.\nYear Ended December 31, 2024\nPaint \nStores \nGroup\nConsumer Brands \nGroup\nPerformance Coatings \nGroup\nAdministrative\nTotal\nNet sales\n$\n13,188.0 \n$\n3,108.0 \n$\n6,797.3 \n$\n5.2 \n$\n23,098.5 \nIncome before income taxes\n$\n2,902.6 \n$\n589.9 \n$\n1,027.9 \n$\n(1,068.6)\n$\n3,451.8 \nas a percent of Net sales\n22.0 \n%\n19.0 \n%\n15.1 \n%\nnm\n14.9 \n%\nAcquisition-related amortization \nexpense \n(1)\n63.8 \n196.3 \n260.1 \nAdjusted segment profit\n$\n2,902.6 \n$\n653.7 \n$\n1,224.2 \n$\n(1,068.6)\n$\n3,711.9 \nas a percent of Net sales\n22.0 \n%\n21.0 \n%\n18.0 \n%\nnm\n16.1 \n%\nYear Ended December 31, 2023\nPaint \nStores \nGroup\nConsumer Brands \nGroup\nPerformance Coatings \nGroup\nAdministrative\nTotal\nNet sales\n$\n12,839.5 \n$\n3,365.6 \n$\n6,843.1 \n$\n3.7 \n$\n23,051.9 \nIncome before income taxes\n$\n2,860.8 \n$\n309.3 \n$\n991.6 \n$\n(1,051.8)\n$\n3,109.9 \nas a percent of Net sales\n22.3 \n%\n9.2 \n%\n14.5 \n%\nnm\n13.5 \n%\nItems related to Restructuring Plan:\nSeverance and other\n14.2 \n(0.2)\n1.3 \n15.3 \nImpairment of assets related to \nChina divestiture\n6.9 \n27.1 \n34.0 \nGain on divestiture of domestic aerosol business\n(20.1)\n(20.1)\nTotal\n— \n21.1 \n(0.2)\n8.3 \n29.2 \nImpairment related to trademarks\n23.9 \n23.9 \nDevaluation of the Argentine peso\n30.8 \n11.0 \n41.8 \nAcquisition-related amortization \nexpense \n(1)\n69.3 \n196.8 \n266.1 \nAdjusted segment profit\n$\n2,860.8 \n$\n454.4 \n$\n1,199.2 \n$\n(1,043.5)\n$\n3,470.9 \nas a percent of Net sales\n22.3 \n%\n13.5 \n%\n17.5 \n%\nnm\n15.1 \n%\nnm    -not meaningful\n(1)    \nAcquisition-related amortization expense, which is included within Selling, general and administrative expenses, consists of the amortization of intangible assets related to the Valspar acquisition. These intangible assets are primarily customer relationships and intellectual property and are being amortized over their remaining useful lives.\n36\nTable of Contents\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe preparation of financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect amounts reported in the accompanying consolidated financial statements. These determinations were made based upon management’s best estimates, judgments and assumptions that were believed to be reasonable under the circumstances, giving due consideration to materiality. We do not believe there is a great likelihood that materially different amounts would be reported under different conditions or using different assumptions related to the critical accounting policies and estimates described below. However, application of these critical accounting policies and estimates involves the exercise of judgment and use of assumptions as to future uncertainties and as a result, actual results could differ from these estimates.\nAll of the significant accounting policies that were followed in the preparation of the consolidated financial statements are disclosed in Note 1 to the consolidated financial statements in Item 8. Management believes that the following critical accounting policies and estimates have a significant impact on our consolidated financial statements.\nInventories\nInventories are stated at the lower of cost or market with cost determined principally on the last-in, first-out (LIFO) method based on inventory quantities and costs determined during the fourth quarter and market representing current replacement cost, which is the cost to purchase or reproduce the inventory. Market shall not exceed net realizable value and shall not be less than net realizable value reduced by an allowance for an approximately normal profit margin. Inventory quantities are adjusted throughout the year as formal cycle counts are completed, or during the fourth quarter as a result of annual physical inventory counts. If inventories accounted for on the LIFO method are reduced on a year-over-year basis, then liquidation of certain quantities carried at costs prevailing in prior years occurs. Management records an estimate of the lower of cost or market whenever the utility of inventory is impaired by damage, deterioration, obsolescence, changes in price levels, or other causes based on historical experience and current trends through reductions to inventory cost by recording a provision included in Cost of goods sold. If management estimates that the reasonable market value is below cost or determines that future demand was lower than current inventory levels, based on historical experience, current and projected market demand, current and projected volume trends and other relevant current and projected factors associated with the current economic conditions, a reduction in inventory cost to current market price is provided for in the reserve for obsolescence. See Note 4 to the consolidated financial statements in Item 8 for more information regarding the impact of the LIFO inventory valuation and the reserve for obsolescence.\nGoodwill and Intangible Assets\nIn accordance with the Goodwill and Other Intangibles Topic of the ASC, management performs impairment tests of goodwill and indefinite-lived intangible assets on an annual basis, as well as whenever an event occurs or circumstances change that indicate impairment has occurred on a more likely than not basis. An optional qualitative assessment allows companies to forego the annual quantitative test if it is not more likely than not that impairment has occurred based on monitoring key Company financial performance metrics and macroeconomic conditions. The qualitative assessment is performed when deemed appropriate.\nManagement tests goodwill for impairment at the reporting unit level. Per the Segment Reporting Topic of the ASC, a reporting unit is an operating segment or one level below the operating segment (component level) as determined by the availability of discrete financial information that is regularly reviewed by operating segment management or an aggregate of component levels of an operating segment having similar economic characteristics. At the time of goodwill impairment testing (if performing a quantitative assessment), management determines fair value through the use of a discounted cash flow valuation model incorporating discount rates commensurate with the risks involved for each reporting unit. If the calculated fair value is less than the current carrying value, the difference represents the amount of impairment attributable to the reporting unit. The use of a discounted cash flow valuation model to determine estimated fair value is common practice in impairment testing. The key assumptions used in the discounted cash flow valuation model for impairment testing include a discount rate, growth rates, cash flow projections and a terminal value rate. Discount rates are set by using the Weighted Average Cost of Capital (WACC) methodology. The WACC methodology considers market and industry data as well as Company-specific risk factors for each reporting unit in determining the appropriate discount rate to be used. The discount rate utilized for each reporting unit is indicative of the return an investor would expect to receive for investing in such a business. Management, considering industry and Company-specific historical and projected data, develops growth rates, sales projections and cash flow projections for each reporting unit. Terminal value rate determination follows common methodology of capturing the present value of perpetual cash flow estimates beyond the last projected period assuming a constant WACC and a long-term growth rate. As an indicator that each reporting unit has been valued appropriately through the use of the discounted cash flow valuation model, the aggregate of all reporting units’ fair value is reconciled to the total market capitalization of the Company within a reasonable and supportable control premium. \n37\nTable of Contents\nThe Company had seven components, some of which are aggregated due to similar economic characteristics, to form three reporting units (also the reportable operating segments) with goodwill as of October 1, 2024, the date of the annual impairment test. The Company performed the optional qualitative impairment test as of October 1, 2024, and determined that there was no indication of impairment on a more likely than not basis in the Company’s reporting units.\nManagement tests indefinite-lived intangible assets for impairment at the asset level, as determined by appropriate asset valuations at acquisition. Management utilizes the royalty savings method to determine the estimated fair value for each indefinite-lived intangible asset or trademark. In this method, management estimates the royalty savings arising from the ownership of the intangible asset. The key assumptions used in estimating the royalty savings for impairment testing include a discount rate, a royalty rate, growth rates, sales projections, a terminal value rate and to a lesser extent, a tax rate. The discount rate used is similar to the rate developed by the WACC methodology considering any differences in Company-specific risk factors between reporting units and trademarks. The royalty rate is established by management and valuation experts and periodically substantiated by valuation experts. Management, considering industry and Company-specific historical and projected data, develops growth rates and sales projections for each significant trademark. Terminal value rate determination follows common methodology of capturing the present value of perpetual sales estimates beyond the last projected period assuming a constant WACC and a low long-term growth rate. The royalty savings valuation methodology and calculations used in 2024 impairment testing are consistent with prior years. The Company performed the optional qualitative impairment test as of October 1, 2024, and determined that there was indication of impairment on a more likely than not basis in certain of the Company’s trademarks. The resulting quantitative impairment test performed as of October 1, 2024 did not result in any trademark impairment.\nThe discounted cash flow and royalty savings valuation methodologies require management to make certain assumptions based upon information available at the time the valuations are performed from the perspective of a market participant. See Note 6 to the consolidated financial statements in Item 8 for a discussion of goodwill and intangible assets and the impairment tests performed in accordance with the Goodwill and Other Intangibles Topic of the ASC.\nValuation of Long-Lived Assets\nIn accordance with the Property, Plant and Equipment Topic of the ASC, if events or changes in circumstances indicate that the carrying value of long-lived assets, including operating and finance lease right-of-use assets, may not be recoverable or the useful life has changed, impairment tests are performed or the useful life is adjusted. Undiscounted cash flows are used to calculate the recoverable value of long-lived assets to determine if such assets are recoverable. If the carrying value of the assets is deemed to not be recoverable, the impairment to be recognized is the amount by which the carrying value of the assets exceeds the estimated fair value of the assets as determined in accordance with the Fair Value Topic of the ASC. If the usefulness of an asset is determined to be impaired, an updated useful life is assessed based on the period of time for projected use of the asset. Fair value approaches and changes in useful life are based on certain assumptions and information available at the time the valuation or determination is performed. Management believes the assumptions used are reflective of what a market participant would have used in calculating fair value or useful life considering the current economic conditions. As of October 1, 2024, the Company performed an analysis and determined that there were no events or changes in circumstances to suggest the carrying value of each long-lived asset group is not recoverable and therefore, no further impairment tests were performed. See Note 5 to the consolidated financial statements in Item 8 for a discussion of the reductions in carrying value or useful life of long-lived assets in accordance with the Property, Plant and Equipment Topic of the ASC.\nDefined Benefit Pension and Other Postretirement Benefit Plans\nTo determine the Company’s ultimate obligation under its defined benefit pension and other postretirement benefit plans, management estimates the future cost of benefits and attributes that cost to the time period during which each covered employee works. To determine the obligations of the benefit plans, management uses actuaries to calculate such amounts using key assumptions which include discount rates, inflation rates, long-term investment returns, mortality, employee turnover, rate of compensation increases and medical and prescription drug costs. Management reviews all of these assumptions on an ongoing basis to ensure that the most current information available is considered. An increase or decrease in the assumptions or economic events outside management’s control could have a direct impact on the Company’s results of operations or financial condition.\nIn accordance with the Retirement Benefits Topic of the ASC, the Company recognizes each plan’s funded status as an asset for overfunded plans and as a liability for unfunded or underfunded plans. Actuarial gains and losses and prior service costs are recognized and recorded in Accumulated other comprehensive income (AOCI). The amounts recorded in AOCI will continue to be modified as actuarial assumptions and service costs change, and all such amounts will be amortized to expense over a period of years through the net pension and net periodic benefit costs. Based on facts and circumstances, the expense amounts recorded in AOCI can also have accelerated amortization due to certain plan changes, including those that result in a \n38\nTable of Contents\ncurtailment. See Note 8 to the consolidated financial statements in Item 8 for information concerning the Company’s defined benefit pension plans and other postretirement benefit plans.\nEnvironmental Matters\nThe Company is involved with environmental investigation and remediation activities at some of its currently and formerly owned sites (including sites which were previously owned and/or operated by businesses acquired by the Company). The Company initially provides for estimated costs of environmental-related activities relating to its past operations and third-party sites for which commitments or clean-up plans have been developed and when such costs can be reasonably estimated based on industry standards and professional judgment. These estimated costs, which are mostly undiscounted, are determined based on currently available facts regarding each site. If the reasonably estimable costs can only be identified as a range and no specific amount within that range can be determined more likely than any other amount within the range, the minimum of the range is provided. \nThe Company routinely assesses its potential liability for investigation and remediation-related activities and adjusts its environmental-related accruals as information becomes available upon which more accurate costs can be reasonably estimated and as additional accounting guidelines are issued. Actual costs incurred may vary from the accrued estimates due to the inherent uncertainties involved. See Note 10 to the consolidated financial statements in Item 8 for information concerning the accrual for extended environmental-related activities and a discussion concerning unaccrued future loss contingencies.\nLitigation and Other Contingent Liabilities\nIn the course of its business, the Company is subject to a variety of claims and lawsuits, including, but not limited to, litigation relating to product liability and warranty, personal injury, environmental, intellectual property, commercial, contractual and antitrust claims. Management accrues for all known liabilities that existed and those where a loss was deemed probable for which a fair value was available or an amount could be reasonably estimated in accordance with US GAAP. However, because litigation is inherently subject to many uncertainties and the ultimate result of any present or future litigation is unpredictable, the Company’s ultimate liability may result in costs that are significantly higher than currently accrued. In the event that the Company’s loss contingency is ultimately determined to be significantly higher than currently accrued, the recording of the liability may result in a material impact on Net income for the annual or interim period during which such liability is accrued. Additionally, due to the uncertainties involved, any potential liability determined to be attributable to the Company arising out of such litigation may have a material adverse effect on the Company’s results of operations, liquidity or financial condition. See Note 11 to the consolidated financial statements in Item 8 for information concerning litigation.\nIncome Taxes\nThe Company estimates income taxes for each jurisdiction in which it conducts operations. This involves estimating taxable earnings, specific taxable and deductible items, the likelihood of generating sufficient future taxable income to utilize deferred tax assets and possible exposures related to future tax audits. To the extent these estimates change, adjustments to deferred and accrued income taxes will be made in the period in which the changes occur. \nThe Company recognizes a tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the consolidated financial statements from such a position are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate resolution. These assessments of uncertain tax positions contain judgments related to the interpretation of tax regulations in the jurisdictions in which we transact business. The judgments and estimates made at a point in time may change based on the outcome of tax audits, expiration of statutes of limitations, as well as changes to, or further interpretations of, tax laws and regulations. Income tax expense is adjusted in our Statements of Consolidated Income in the period in which these events occur. See Note 20 to the consolidated financial statements in Item 8 for information concerning income taxes.\n39\nTable of Contents\nITEM 7A.    QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to market risk associated with interest rates, foreign currency and commodity fluctuations. We occasionally utilize derivative instruments as part of our overall financial risk management policy, but do not use derivative instruments for speculative or trading purposes. In 2024, 2023 and 2022, the Company utilized U.S. dollar to euro cross currency swap contracts to hedge the Company’s net investment in its European operations. The contracts have been designated as net investment hedges and have various maturity dates. See Note 16 to the consolidated financial statements in Item 8. The Company entered into forward foreign currency exchange contracts during 2024, 2023 and 2022 primarily to hedge against value changes in foreign currency. There were no material contracts outstanding at December 31, 2024. Forward foreign currency exchange contracts are described in Note 19 to the consolidated financial statements in Item 8. We believe we may experience continuing losses from foreign currency fluctuations. However, we do not expect currency translation, transaction or hedging contract losses to have a material adverse effect on our financial condition, results of operations or cash flows. \n40\nTable of Contents\nITEM 8.    FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nIndex to Consolidated Financial Statements\nPage\nReport of Management on Internal Control Over Financial Reporting\n42\nReport of Independent Registered Public Accounting Firm on Internal Control Over Financial Reporting\n43\nReport of Management on the Consolidated Financial Statements\n45\nReport of Independent Registered Public Accounting Firm on the Consolidated Financial Statements (PCAOB ID: \n42\n)\n46\nStatements of Consolidated Income\n48\nStatements of Consolidated Comprehensive Income\n49\nConsolidated Balance Sheets\n50\nStatements of Consolidated Cash Flows\n51\nStatements of Consolidated Shareholders’ Equity\n52\nNotes to Consolidated Financial Statements\n53\n41\nTable of Contents\nReport of Management \nOn Internal Control Over Financial Reporting\nShareholders of The Sherwin-Williams Company\nWe are responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended. We recognize that internal control over financial reporting cannot provide absolute assurance of achieving financial reporting objectives because of its inherent limitations. Internal control over financial reporting is a process that involves human diligence and is subject to the possibility of human error or the circumvention or the overriding of internal control. Therefore, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. However, we believe we have designed into the process safeguards to reduce, though not eliminate, this risk. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with policies or procedures may deteriorate.\nIn order to ensure that the Company’s internal control over financial reporting was effective as of December 31, 2024, we conducted an assessment of its effectiveness under the supervision and with the participation of our management group, including our principal executive officer and principal financial officer. This assessment was based on the criteria established in the 2013 Internal Control – Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nBased on our assessment of internal control over financial reporting under the criteria established in Internal Control – Integrated Framework, we have concluded that, as of December 31, 2024, the Company’s internal control over financial reporting was effective to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. Our internal control over financial reporting as of December 31, 2024 has been audited by \nErnst & Young LLP\n, an independent registered public accounting firm, and their report on the effectiveness of our internal control over financial reporting is included on page 43 of this report.\nHeidi G. Petz\nChair, President and Chief Executive Officer\nAllen J. Mistysyn\nSenior Vice President - Finance and Chief Financial Officer\nJ. Paul Lang\nSenior Vice President - Enterprise Finance and Chief Accounting Officer\n42\nTable of Contents\nReport of Independent Registered Public Accounting Firm \nTo the Shareholders and the Board of Directors of The Sherwin-Williams Company \nOpinion on Internal Control Over Financial Reporting\nWe have audited The Sherwin-Williams Company and subsidiaries internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control\n—\nIntegrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, The Sherwin-Williams Company and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024, 2023 and 2022, the related statements of consolidated income, comprehensive income, cash flows and shareholders’ equity for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the index at Item 15(a) and our report dated February 20, 2025 expressed an unqualified opinion thereon. \nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Report of Management On Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n43\nTable of Contents\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young, LLP\nCleveland, Ohio\nFebruary 20, 2025 \n44\nTable of Contents\nReport of Management \nOn the Consolidated Financial Statements\nShareholders of The Sherwin-Williams Company \nWe are responsible for the preparation and fair presentation of the consolidated financial statements, accompanying notes and related financial information included in this report of The Sherwin-Williams Company and its consolidated subsidiaries (collectively, the Company) as of December 31, 2024, 2023 and 2022 and for the years then ended in accordance with U.S. generally accepted accounting principles. The consolidated financial information included in this report contains certain amounts that were based upon our best estimates, judgments and assumptions that we believe were reasonable under the circumstances.\nWe have conducted an assessment of the effectiveness of internal control over financial reporting based on criteria established in Internal Control – Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. As discussed in the Report of Management on Internal Control Over Financial Reporting on page 42 of this report, we concluded that the Company’s internal control over financial reporting was effective as of December 31, 2024.\nThe Board of Directors fulfills its responsibility for the oversight of the Company’s accounting policies and procedures, financial statement preparation and internal control over financial reporting through the Audit Committee, comprised exclusively of independent directors. The Audit Committee is responsible for the appointment and compensation of the independent registered public accounting firm. The Audit Committee meets at least quarterly with financial management, internal auditors and the independent registered public accounting firm to review the adequacy of financial controls, the effectiveness of the Company’s internal control over financial reporting and the nature, extent and results of the audit effort. Both the internal auditors and the independent registered public accounting firm have private and confidential access to the Audit Committee at all times.\nWe believe that the consolidated financial statements, accompanying notes and related financial information included in this report fairly reflect the form and substance of all material financial transactions and fairly present, in all material respects, the consolidated financial position, results of operations and cash flows as of and for the periods presented.\nHeidi G. Petz\nChair, President and Chief Executive Officer\nAllen J. Mistysyn\nSenior Vice President - Finance and Chief Financial Officer\nJ. Paul Lang\nSenior Vice President - Enterprise Finance and Chief Accounting Officer\n45\nTable of Contents\nReport of Independent Registered Public Accounting Firm \nTo the Shareholders and the Board of Directors of The Sherwin-Williams Company\nOpinion on the Financial Statements \nWe have audited the accompanying consolidated balance sheets of The Sherwin-Williams Company and subsidiaries (the Company) as of December 31, 2024, 2023 and 2022, the related statements of consolidated income, comprehensive income, cash flows and shareholders’ equity for each of the three years in the period ended December 31, 2024, and the related notes and the financial statement schedule listed in the index at Item 15(a) (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated February 20, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. \nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n46\nTable of Contents\nGibbsboro environmental-related accrual\nDescription of the Matter\nAs described in Note 10 to the consolidated financial statements, the Company had short-term and long-term accruals for environmental-related activities of $66.4 million and $230.3 million, respectively, at December 31, 2024. The Company’s largest and most complex site is the Gibbsboro, New Jersey site (Gibbsboro) and the substantial majority of the environmental-related accrual relates to this site. Gibbsboro consists of six operable units which contain a combination of soil, sediment, surface water and groundwater contamination, and are in various phases of investigation and remediation with the Environmental Protection Agency (EPA). The Company’s estimated environmental-related accrual for Gibbsboro is based on industry standards and professional judgement, and the most significant assumptions underlying the estimated cost of remediation efforts reserved for Gibbsboro are the types and extent of future remediation.\nAuditing the Company’s environmental-related accrual at the Gibbsboro site required complex judgement due to the inherent challenges in identifying the type and extent of future remedies in determining the probable and reasonably estimable loss for which the Company will be responsible.\nHow We Addressed the Matter \nin Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company's processes to estimate the Gibbsboro environmental-related accrual. For example, we tested controls over management’s review of the environmental loss calculations and the key assumptions affecting those calculations as described above. \nTo test the Gibbsboro environmental-related accrual, our audit procedures included, among others, a review of correspondence with the EPA supporting the Company’s assessment of the type, extent and cost of remediation at the Gibbsboro site for which the Company is responsible. We assessed the appropriateness of the Company’s policies and procedures and tested management’s environmental reserve estimate. We involved our environmental specialists to confirm our understanding of the remediation plans for the most significant operable units within the Gibbsboro site and to evaluate the impact of current year investigation and remediation activities on the Company's methodology and assumptions used to estimate the cost and extent of remediation in accordance with industry practice, applicable laws and regulations.  We reconciled types and extent of remediation identified in communications between the Company and the EPA, including agreed upon remediation plans with the EPA, to the Company’s remediation cost estimates recorded for Gibbsboro. We also conducted a search for publicly available information that might indicate facts contrary to the types and extent of remediation currently identified in the Company’s remediation cost estimates recorded for Gibbsboro. \n/s/ Ernst & Young, LLP\nWe have served as the Company’s auditor since 1908.\nCleveland, Ohio\nFebruary 20, 2025 \n47\nTable of Contents\nTHE SHERWIN-WILLIAMS COMPANY AND SUBSIDIARIES\nSTATEMENTS OF CONSOLIDATED INCOME\n(in millions, except per share data)\nYear Ended December 31,\n2024\n2023\n2022\nNet sales\n$\n23,098.5\n \n$\n23,051.9\n \n$\n22,148.9\n \nCost of goods sold \n11,903.4\n \n12,293.8\n \n12,823.8\n \nGross profit \n11,195.1\n \n10,758.1\n \n9,325.1\n \nPercent to Net sales \n48.5\n \n%\n46.7\n \n%\n42.1\n \n%\nSelling, general and administrative expenses \n7,422.1\n \n7,065.4\n \n6,331.6\n \nPercent to Net sales\n32.1\n \n%\n30.6\n \n%\n28.6\n \n%\nOther general (income) expense - net\n(\n38.8\n)\n67.1\n \n(\n24.9\n)\nImpairment\n—\n \n57.9\n \n15.5\n \nInterest expense\n415.7\n \n417.5\n \n390.8\n \nInterest income\n(\n11.0\n)\n(\n25.2\n)\n(\n8.0\n)\nOther (income) expense - net\n(\n44.7\n)\n65.5\n \n47.0\n \nIncome before income taxes \n3,451.8\n \n3,109.9\n \n2,573.1\n \nIncome taxes\n770.4\n \n721.1\n \n553.0\n \nNet income \n$\n2,681.4\n \n$\n2,388.8\n \n$\n2,020.1\n \nNet income per common share:\nBasic\n$\n10.68\n \n$\n9.35\n \n$\n7.83\n \nDiluted\n$\n10.55\n \n$\n9.25\n \n$\n7.72\n \nWeighted average shares outstanding:\nBasic\n251.0\n \n255.4\n \n258.0\n \nDiluted\n254.1\n \n258.3\n \n261.8\n \nSee notes to consolidated financial statements.\n48\nTable of Contents\nTHE SHERWIN-WILLIAMS COMPANY AND SUBSIDIARIES\nSTATEMENTS OF CONSOLIDATED COMPREHENSIVE INCOME\n(in millions)\nYear Ended December 31,\n2024\n2023\n2022\nNet income \n$\n2,681.4\n \n$\n2,388.8\n \n$\n2,020.1\n \nOther comprehensive (loss) income, net of tax:\nForeign currency translation adjustments \n(1)\n(\n256.0\n)\n93.9\n \n(\n108.7\n)\nPension and other postretirement benefit adjustments:\nAmounts recognized in AOCI \n(2)\n23.0\n \n3.9\n \n106.8\n \nAmounts reclassified from AOCI \n(3)\n(\n14.2\n)\n(\n17.9\n)\n3.7\n \nTotal\n8.8\n \n(\n14.0\n)\n110.5\n \nUnrealized net gains on cash flow hedges:\nAmounts reclassified from AOCI \n(4)\n(\n3.7\n)\n(\n3.6\n)\n(\n4.0\n)\nOther comprehensive (loss) income, net of tax\n(\n250.9\n)\n76.3\n \n(\n2.2\n)\nComprehensive income\n$\n2,430.5\n \n$\n2,465.1\n \n$\n2,017.9\n \n(1)    \nThe years ended December 31, 2024, 2023 and 2022 include unrealized gains (losses), net of taxes, of $\n53.6\n million, $(\n24.9\n) million and $\n34.1\n million, respectively, related to net investment hedges. See Note 16.\n(2)    \nNet of taxes of $(\n6.6\n) million, $(\n2.8\n) million and $(\n33.8\n) million in 2024, 2023 and 2022, respectively.\n(3)    \nNet of taxes of $\n4.6\n million, $\n5.9\n million and $(\n1.2\n) million in 2024, 2023 and 2022, respectively\n.\n(4)    \nNet of taxes of $\n1.2\n million in 2024 and 2023 and $\n1.1\n million in 2022.\nSee notes to consolidated financial statements.\n49\nTable of Contents\nTHE SHERWIN-WILLIAMS COMPANY AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(in millions)\nDecember 31,\n2024\n2023\n2022\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n210.4\n \n$\n276.8\n \n$\n198.8\n \nAccounts receivable, net\n2,388.8\n \n2,467.9\n \n2,563.6\n \nInventories\n2,288.1\n \n2,329.8\n \n2,626.5\n \nOther current assets\n513.5\n \n438.4\n \n518.8\n \nTotal current assets\n5,400.8\n \n5,512.9\n \n5,907.7\n \nProperty, plant and equipment, net\n3,533.2\n \n2,836.8\n \n2,207.0\n \nGoodwill\n7,580.1\n \n7,626.0\n \n7,583.2\n \nIntangible assets\n3,533.2\n \n3,880.5\n \n4,002.0\n \nOperating lease right-of-use assets\n1,953.8\n \n1,887.4\n \n1,866.8\n \nOther assets\n1,631.5\n \n1,210.8\n \n1,027.3\n \nTotal Assets \n$\n23,632.6\n \n$\n22,954.4\n \n$\n22,594.0\n \nLiabilities and Shareholders’ Equity\nCurrent liabilities:\nShort-term borrowings\n$\n662.4\n \n$\n374.2\n \n$\n978.1\n \nAccounts payable\n2,253.2\n \n2,315.0\n \n2,436.5\n \nCompensation and taxes withheld\n842.8\n \n862.7\n \n784.5\n \nAccrued taxes\n174.3\n \n197.4\n \n197.4\n \nCurrent portion of long-term debt\n1,049.2\n \n1,098.8\n \n0.6\n \nCurrent portion of operating lease liabilities\n466.6\n \n449.3\n \n425.3\n \nOther accruals\n1,360.2\n \n1,329.5\n \n1,138.3\n \nTotal current liabilities\n6,808.7\n \n6,626.9\n \n5,960.7\n \nLong-term debt\n8,176.8\n \n8,377.9\n \n9,591.0\n \nPostretirement benefits other than pensions\n120.7\n \n133.2\n \n139.3\n \nDeferred income taxes \n607.5\n \n683.1\n \n681.6\n \nLong-term operating lease liabilities\n1,558.3\n \n1,509.5\n \n1,512.9\n \nOther long-term liabilities\n2,309.4\n \n1,908.0\n \n1,606.4\n \nShareholders’ equity:\nCommon stock - $\n0.33\n-1/3 par value: \n  \n251.3\n, \n254.5\n and \n258.9\n million shares outstanding\n     at December 31, 2024, 2023 and 2022, respectively\n92.5\n \n91.8\n \n91.2\n \nOther capital\n4,576.2\n \n4,193.6\n \n3,963.9\n \nRetained earnings \n7,246.3\n \n5,288.3\n \n3,523.2\n \nTreasury stock, at cost\n(\n6,988.6\n)\n(\n5,233.6\n)\n(\n3,775.6\n)\nAccumulated other comprehensive loss\n(\n875.2\n)\n(\n624.3\n)\n(\n700.6\n)\nTotal shareholders’ equity \n4,051.2\n \n3,715.8\n \n3,102.1\n \nTotal Liabilities and Shareholders’ Equity \n$\n23,632.6\n \n$\n22,954.4\n \n$\n22,594.0\n \nSee notes to consolidated financial statements.\n50\nTable of Contents\nTHE SHERWIN-WILLIAMS COMPANY AND SUBSIDIARIES\nSTATEMENTS OF CONSOLIDATED CASH FLOWS\n(in millions)\nYear Ended December 31,\n \n2024\n2023\n2022\nOperating Activities\nNet income \n$\n2,681.4\n \n$\n2,388.8\n \n$\n2,020.1\n \nAdjustments to reconcile Net income to Net operating cash:\nDepreciation\n297.4\n \n292.3\n \n264.0\n \nNon-cash lease expense\n460.5\n \n452.7\n \n416.9\n \nAmortization of intangible assets\n326.6\n \n330.2\n \n317.1\n \nGain on divestiture of business\n—\n \n(\n20.1\n)\n—\n \nLoss on extinguishment of debt\n—\n \n12.8\n \n—\n \nImpairment\n—\n \n57.9\n \n15.5\n \nProvisions for environmental-related matters - net\n(\n1.3\n)\n80.7\n \n(\n7.1\n)\nProvisions for restructuring\n—\n \n15.3\n \n47.3\n \nDeferred income taxes \n(\n74.9\n)\n(\n88.9\n)\n(\n144.8\n)\nOther postretirement benefit plan net cost\n(\n17.0\n)\n(\n15.8\n)\n(\n1.6\n)\nStock-based compensation expense\n138.1\n \n115.9\n \n99.7\n \nAmortization of non-traded investments\n75.0\n \n65.4\n \n38.5\n \n(Gain) loss on sale or disposition of assets\n(\n49.9\n)\n0.9\n \n(\n10.7\n)\nOther\n6.1\n \n7.0\n \n43.9\n \nChange in working capital accounts:\n(Increase) decrease in accounts receivable\n(\n10.7\n)\n85.6\n \n(\n200.2\n)\n(Increase) decrease in inventories\n(\n32.9\n)\n323.4\n \n(\n666.7\n)\nIncrease (decrease) in accounts payable\n21.8\n \n(\n241.1\n)\n46.6\n \nDecrease in accrued taxes\n(\n14.3\n)\n(\n8.9\n)\n(\n38.1\n)\n(Decrease) increase in accrued compensation and taxes withheld\n(\n7.9\n)\n75.7\n \n65.8\n \nDecrease in refundable income taxes\n0.8\n \n25.8\n \n47.6\n \nOther\n(\n20.7\n)\n306.7\n \n32.5\n \nChange in operating lease liabilities\n(\n460.7\n)\n(\n453.4\n)\n(\n405.3\n)\nCosts incurred for environmental-related matters\n(\n24.1\n)\n(\n35.3\n)\n(\n23.8\n)\nOther\n(\n140.1\n)\n(\n251.7\n)\n(\n37.3\n)\nNet operating cash\n3,153.2\n \n3,521.9\n \n1,919.9\n \nInvesting Activities\nCapital expenditures\n(\n1,070.0\n)\n(\n888.4\n)\n(\n644.5\n)\nAcquisitions of businesses, net of cash acquired\n(\n78.9\n)\n(\n264.7\n)\n(\n1,003.1\n)\nProceeds from divestiture of business\n—\n \n103.7\n \n—\n \nProceeds from sale of assets\n11.6\n \n70.1\n \n33.2\n \nOther\n(\n59.0\n)\n(\n60.0\n)\n6.8\n \nNet investing cash\n(\n1,196.3\n)\n(\n1,039.3\n)\n(\n1,607.6\n)\nFinancing Activities\nNet increase (decrease) in short-term borrowings\n288.6\n \n(\n603.9\n)\n214.4\n \nProceeds from long-term debt\n848.7\n \n—\n \n999.7\n \nPayments of long-term debt\n(\n1,100.0\n)\n(\n136.4\n)\n(\n260.3\n)\nPayments for credit facility and debt issuance costs\n(\n8.6\n)\n—\n \n(\n7.3\n)\nPayments of cash dividends\n(\n723.4\n)\n(\n623.7\n)\n(\n618.5\n)\nProceeds from stock options exercised\n242.0\n \n111.6\n \n67.3\n \nTreasury stock purchased\n(\n1,738.8\n)\n(\n1,432.0\n)\n(\n883.2\n)\nProceeds from treasury stock issued\n—\n \n—\n \n22.0\n \nProceeds from real estate financing transactions\n244.2\n \n306.5\n \n207.3\n \nOther\n(\n69.8\n)\n(\n46.7\n)\n(\n23.8\n)\nNet financing cash\n(\n2,017.1\n)\n(\n2,424.6\n)\n(\n282.4\n)\nEffect of exchange rate changes on cash\n(\n6.2\n)\n20.0\n \n3.2\n \nNet (decrease) increase in cash and cash equivalents\n(\n66.4\n)\n78.0\n \n33.1\n \nCash and cash equivalents at beginning of year\n276.8\n \n198.8\n \n165.7\n \nCash and cash equivalents at end of year\n$\n210.4\n \n$\n276.8\n \n$\n198.8\n \nSupplemental cash flow information\nIncome taxes paid\n$\n779.8\n \n$\n816.7\n \n$\n580.1\n \nInterest paid\n$\n406.9\n \n$\n416.5\n \n$\n371.1\n \nSee notes to consolidated financial statements. \n51\nTable of Contents\nTHE SHERWIN-WILLIAMS COMPANY AND SUBSIDIARIES\nSTATEMENTS OF CONSOLIDATED SHAREHOLDERS’ EQUITY\n(in millions, except per share data)\nCommon\nStock\nOther\nCapital\nRetained\nEarnings\nTreasury\nStock\nAccumulated\nOther\nComprehensive\nLoss\nTotal\nBalance at January 1, 2022\n$\n90.8\n \n$\n3,793.0\n \n$\n2,121.7\n \n$\n(\n2,869.9\n)\n$\n(\n698.4\n)\n$\n2,437.2\n \nNet income\n \n2,020.1\n \n2,020.1\n \nOther comprehensive loss\n(\n2.2\n)\n(\n2.2\n)\nTreasury stock purchased\n(\n883.2\n)\n(\n883.2\n)\nTreasury stock issued\n11.0\n11.0\n \n22.0\n \nStock-based compensation activity\n0.4\n \n167.1\n(\n33.5\n)\n134.0\n \nOther adjustments\n(\n7.2\n)\n(\n0.1\n)\n(\n7.3\n)\nCash dividends -- $\n2.40\n per share\n(\n618.5\n)\n(\n618.5\n)\nBalance at December 31, 2022\n91.2\n \n3,963.9\n \n3,523.2\n \n(\n3,775.6\n)\n(\n700.6\n)\n3,102.1\n \nNet income\n2,388.8\n \n2,388.8\n \nOther comprehensive income\n76.3\n \n76.3\n \nTreasury stock purchased\n(\n1,432.0\n)\n(\n1,432.0\n)\nStock-based compensation activity\n0.6\n \n229.3\n \n(\n26.0\n)\n203.9\n \nOther adjustments\n0.4\n \n0.4\n \nCash dividends -- $\n2.42\n per share\n(\n623.7\n)\n(\n623.7\n)\nBalance at December 31, 2023\n91.8\n \n4,193.6\n \n5,288.3\n \n(\n5,233.6\n)\n(\n624.3\n)\n3,715.8\n \nNet income\n2,681.4\n \n2,681.4\n \nOther comprehensive loss\n(\n250.9\n)\n(\n250.9\n)\nTreasury stock purchased\n(\n1,738.8\n)\n(\n1,738.8\n)\nStock-based compensation activity\n0.7\n \n383.0\n \n(\n16.2\n)\n367.5\n \nOther adjustments\n(\n0.4\n)\n(\n0.4\n)\nCash dividends -- $\n2.86\n per share\n(\n723.4\n)\n(\n723.4\n)\nBalance at December 31, 2024\n$\n92.5\n \n$\n4,576.2\n \n$\n7,246.3\n \n$\n(\n6,988.6\n)\n$\n(\n875.2\n)\n$\n4,051.2\n \nSee notes to consolidated financial statements.\n52\nTable of Contents\nTHE SHERWIN-WILLIAMS COMPANY AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(millions of dollars, unless otherwise noted)\nNOTE 1 – \nSIGNIFICANT ACCOUNTING POLICIES\nConsolidation\n \nThe consolidated financial statements included in this report have been prepared by management of The Sherwin-Williams Company (herein referred to as the Company). These statements include the accounts of the Company and all consolidated subsidiaries. Intercompany accounts and transactions have been eliminated. The Company’s share of earnings or losses from nonconsolidated affiliates is included in the consolidated financial statements using the equity method of accounting when the Company is able to exercise significant influence over the operating and financial decisions of the affiliate.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. generally accepted accounting principles (US GAAP) requires management to make estimates, judgments and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. Actual results could differ from those amounts.\nNature of Operations\n \nThe Company is engaged in the development, manufacture, distribution and sale of paint, coatings and related products to professional, industrial, commercial and retail customers primarily in North and South America, with additional operations in the Caribbean region, Europe, Asia and Australia.\nCash Equivalents\nManagement considers all highly liquid investments with a maturity of three months or less when purchased to be cash equivalents.\nAccounts Receivable and Allowance for Current Expected Credit Losses\nAccounts receivable are recorded at the time of credit sales, net of an allowance for current expected credit losses. The Company records an allowance for current expected credit losses to reduce Accounts receivable to the net amount expected to be collected. \nUnder Accounting Standards Codification (ASC) 326, the Company reviews the collectibility of the Accounts receivable balance each reporting period and estimates the allowance for current expected credit losses based on historical bad debt experience, aging of accounts receivable, current creditworthiness of customers, current economic factors, as well as reasonable and supportable forward-looking information. Accounts receivable balances are written-off against the allowance for current expected credit losses if a final determination of uncollectibility is made. All provisions for the allowance for current expected credit losses are included in Selling, general and administrative expenses. See Note 18 for further details.\nInventories\nInventories are stated at the lower of cost or market with cost determined principally on the last-in, first-out (LIFO) method. Market represents current replacement cost, which is the cost to purchase or reproduce the inventory. If inventories accounted for on the LIFO method are reduced on a year-over-year basis, then liquidation of certain quantities carried at costs prevailing in prior years occurs. Management records an estimate of the lower of cost or market whenever the utility of inventory is impaired by damage, deterioration, obsolescence, changes in price levels, or other causes based on historical experience and current trends through reductions to inventory cost by recording a provision included in Cost of goods sold. If management estimates that the reasonable market value is below cost or determines that future demand was lower than current inventory levels, based on historical experience, current and projected market demand, current and projected volume trends and other relevant current and projected factors associated with the current economic conditions, a reduction in inventory cost to current market price is provided for in the reserve for obsolescence. See Note 4 for further details.\nProperty, Plant and Equipment\nProperty, plant and equipment (including leasehold improvements) is stated on the basis of cost. Depreciation is charged to expense using the straight-line method over the assets’ estimated useful lives which range from \n5\n to \n25\n years for buildings and \n3\n to \n15\n years for machinery and equipment. Depreciation and amortization are included in the appropriate Cost of goods sold or Selling, general and administrative expenses caption on the Statements of Consolidated Income. See Note 5 for further details.\n53\nTable of Contents\nGoodwill and Intangible Assets\nGoodwill represents the cost in excess of fair value of net assets acquired in business combinations. Intangible assets include software, customer relationships, intellectual property and trademarks. In accordance with the Goodwill and Other Intangibles Topic of the ASC, goodwill and indefinite-lived trademarks are not amortized, but instead are tested for impairment on an annual basis, as well as whenever an event occurs or circumstances change that indicate impairment has occurred on a more likely than not basis. Finite-lived intangible assets are amortized on a straight-line basis over the expected period of benefit, which ranges primarily from \n3\n to \n29\n years. See Note 6 for further details.\nImpairment of Long-Lived Assets\n \nIn accordance with the Property, Plant and Equipment Topic of the ASC, management evaluates the recoverability and remaining lives of long-lived assets, including right-of-use assets, whenever events or changes in circumstances indicate that the carrying amount may not be recoverable or the useful life has changed.\n See Note 5 for further details.\nDerivative Instruments\nThe Company utilizes derivative instruments to mitigate certain risk exposures as part of its overall financial risk management policy and accounts for these instruments in accordance with the Derivatives and Hedging Topic of the ASC. Derivatives are recorded as assets or liabilities in the Consolidated Balance Sheets at fair value. Changes in fair value of the derivative instruments are recognized immediately in earnings unless the derivative instrument qualifies for and is designated in an effective hedging relationship.\nThe Company entered into foreign currency forward contracts with maturity dates of less than twelve months in 2024, 2023 and 2022, primarily to hedge against value changes in foreign currency. There were \nno\n material foreign currency option and forward contracts outstanding at December 31, 2024, 2023 and 2022. See Note 19 for further details. \nThe Company also entered into cross currency swap contracts to hedge its net investment in European operations in 2024, 2023 and 2022. These contracts qualified for and were designated as net investment hedges under US GAAP. The changes in fair value for the cross currency swaps are recognized in the Foreign currency translation adjustments component of AOCI. The cash flow impact of these instruments is classified as an investing activity in the Statements of Consolidated Cash Flows. See Note 16 for further details.\nNon-Traded Investments\nThe Company has invested in U.S. affordable housing, historic renovation and other real estate investments (Non-Traded Investments) that have been identified as variable interest entities which qualify for certain tax credits and other tax benefits. Since the Company does not have the power to direct the day-to-day operations of the Non-Traded Investments and the risk of loss is limited to the amount of contributed capital, the Company is not considered the primary beneficiary. Therefore, in accordance with the Consolidation Topic of the ASC, the Non-Traded Investments are not consolidated.\nUnder the Investments - Equity Method and Joint Ventures Topic of the ASC, the Company uses the proportional amortization method, whereby the initial cost and any subsequent changes in the level of investment of Non-Traded Investments are amortized in proportion to the receipt of related tax credits. The Company reasonably expects amortization based on the receipt of tax credits would produce a measurement substantially similar to amortization based on the receipt of tax credits and other tax benefits. Both the amortization and related tax credits and other tax benefits are recognized in Income tax expense on the Statements of Consolidated Income.\n2024\n2023\n2022\nAmortization of Non-Traded Investments\n$\n75.0\n \n$\n65.4\n \n$\n38.5\n \nTax credits and other tax benefits received\n104.9\n \n94.8\n \n67.2\n \n54\nTable of Contents\nThe carrying value of Non-Traded Investments is recorded in Other assets. The liabilities for estimated future capital contributions are recorded in Other accruals and Other long-term liabilities. In addition, the associated impact of related tax credits and other tax benefits are recorded as a reduction of Accrued taxes and a net deferred income tax asset within Deferred income taxes. On the Statements of Consolidated Cash Flows, the tax credits and other tax benefits are presented as a change in Accrued taxes and in Deferred income taxes within Operating activities. Tax credits and other tax benefits reduced Accrued taxes by $\n104.9\n million, $\n94.8\n million and $\n67.2\n million at December 31, 2024, 2023 and 2022, respectively. \nThe following table summarizes the balances related to Non-Traded Investments and related tax credits and other tax benefits on the Consolidated Balance Sheets:\n2024\n2023\n2022\nOther assets\n$\n744.0\n \n$\n675.0\n \n$\n587.0\n \nOther accruals\n101.4\n \n80.9\n \n89.8\n \nOther long-term liabilities\n600.3\n \n568.2\n \n476.5\n \nNet deferred income tax asset\n7.6\n \n19.4\n \n23.4\n \nStandby Letters of Credit\n \nThe Company occasionally enters into standby letter of credit agreements to guarantee various operating activities. These agreements provide credit availability to the various beneficiaries if certain contractual events occur.\n Amounts outstanding under these agreements totaled $\n125.5\n million, $\n146.2\n million and $\n149.8\n million at December 31, 2024, 2023 and 2022, respectively.\nProduct Warranties\n \nThe Company offers assurance-type product warranties for certain products. The specific terms and conditions of such warranties vary depending on the product or customer contract requirements. Management estimated the costs of unsettled product warranty claims based on historical results and experience and included an amount in Other accruals. Management periodically assesses the adequacy of the accrual for product warranty claims and adjusts the accrual as necessary.\n \nChanges in the Company’s accrual for product warranty claims during 2024, 2023 and 2022, including customer satisfaction settlements during the year, were as follows:\n2024\n2023\n2022\nBalance at January 1\n$\n40.4\n \n$\n36.2\n \n$\n35.2\n \nCharges to expense\n34.2\n \n37.0\n \n30.1\n \nSettlements\n(\n28.2\n)\n(\n32.8\n)\n(\n29.1\n)\nBalance at December 31\n$\n46.4\n \n$\n40.4\n \n$\n36.2\n \nDefined Benefit Pension and Other Postretirement Benefit Plans\n \nThe Company accounts for its defined benefit pension and other postretirement benefit plans in accordance with the Retirement Benefits Topic of the ASC, which requires the Company to recognize an asset for overfunded defined benefit pension or other postretirement benefit plans and a liability for unfunded or underfunded plans. In addition, actuarial gains and losses and prior service costs of such plans are recorded in AOCI. The amounts recorded in AOCI will continue to be modified as actuarial assumptions and service costs change, and all such amounts will be amortized to expense over a period of years through the net pension cost (credit) and net periodic benefit cost (credit).\n See Note 8 for further details.\nDefined Contribution Savings Plan\nThe Company accounts for its defined contribution savings plan in accordance with the Defined Contribution Plans Subtopic of the Compensation – Retirement Benefits Topic of the ASC. The Company recognized compensation expense for amounts contributed to the defined contribution savings plan.\n See Note 13 for further details.\nEnvironmental Matters\nCapital expenditures for ongoing environmental compliance measures are recorded in Property, plant and equipment, net, and related expenses are included in the normal operating expenses of conducting business. The Company accrued for environmental-related activities for which commitments or clean-up plans have been developed and when such costs could be reasonably estimated based on industry standards and professional judgment. Accrued amounts are primarily recorded on an undiscounted basis and have not been recorded net of insurance proceeds in accordance with the Offsetting Subtopic of the Balance Sheet Topic of the ASC. Environmental-related expenses include direct costs of investigation and remediation and \n55\nTable of Contents\nindirect costs such as compensation and benefits for employees directly involved in the investigation and remediation activities and fees paid to outside engineering, consulting and law firms.\n See Notes 10 and 19 for further details.\nStock-Based Compensation\n \nThe cost of the Company’s stock-based compensation is recorded in accordance with the Stock Compensation Topic of the ASC.\n See Note 14 for further details.\nOther Liabilities\nThe Company retains risk for certain liabilities, primarily workers’ compensation claims, employee medical and disability benefits and automobile, property, general and product liability claims. Estimated amounts are accrued for certain workers’ compensation, employee medical and disability benefits, automobile and property claims filed but unsettled and estimated claims incurred but not reported. Estimates are based upon management’s estimated aggregate liability for claims incurred using historical experience, actuarial assumptions followed in the insurance industry and actuarially-developed models for estimating certain liabilities. Certain estimated general and product liability claims filed but unsettled are accrued based on management’s best estimate of ultimate settlement or actuarial calculations of potential liability using industry experience and actuarial assumptions developed for similar types of claims.\nForeign Currency Translation\nAll consolidated non-highly inflationary foreign operations use the local currency of the country of operation as the functional currency. Local currency asset and liability accounts are translated at year-end exchange rates while income and expense accounts are translated at average exchange rates. The resulting translation adjustments are included in AOCI.\nEconomies with a three-year cumulative inflation rate of more than 100% are considered highly inflationary. For subsidiaries operating in highly inflationary economies, the parent’s reporting currency is the functional currency. Monetary assets and liabilities are translated into U.S. dollars using rates of exchange at the balance sheet date and non-monetary assets and liabilities are translated into U.S. dollars at their historical rates of exchange, with remeasurement adjustments and other transaction gains and losses recognized in Net income. See Note 19 for further details.\nRevenue Recognition\nThe Company recognizes revenue when performance obligations under the terms of the contract are satisfied. This generally occurs with the transfer of control of our products to the customer. Collectibility of amounts recorded as revenue is probable at the time of recognition.\n See Note 18 for further details.\nCustomer and Vendor Consideration\nThe Company offers certain customers rebate and sales incentive programs which are classified as reductions in sales. Such programs are in the form of volume rebates, rebates that constituted a percentage of sales or rebates for attaining certain sales goals. The Company receives consideration from certain suppliers of raw materials in the form of volume rebates or rebates that constitute a percentage of purchases. These rebates are recognized on an accrual basis by the Company as a reduction of the purchase price of the raw materials and a subsequent reduction of Cost of goods sold when the related product was sold.\nCost of Goods Sold\n \nIncluded in Cost of goods sold are costs for materials, manufacturing, distribution and related support. Distribution costs include expenses related to the distribution of products including inbound freight charges, purchase and receiving costs, warehousing costs, internal transfer costs and other costs incurred to ship products. Also included in Cost of goods sold are research and development costs, quality control, product formulation expenditures and other similar items.\n Research and development costs were $\n217.3\n million, $\n196.6\n million and $\n119.3\n million during 2024, 2023 and 2022, respectively.\nSelling, General and Administrative Expenses\n \nSelling costs include advertising expenses, marketing costs, employee and store costs and sales commissions. The cost of advertising is expensed as incurred. The Company incurred $\n386.9\n million, $\n394.0\n million and $\n314.4\n million in advertising costs during 2024, 2023 and 2022, respectively. General and administrative expenses include human resources, legal, finance and other support and administrative functions.\nGovernment Incentives\n \nThe Company receives incentives from various government entities in the form of tax rebates or credits, grants and loans. These incentives typically require that the Company maintain specified spending levels and other operational metrics and may be subject to reimbursement if conditions are not met or maintained. Government incentives are recorded in the Company’s consolidated financial statements in accordance with their purpose as a reduction of expense, a reduction of the cost of the \n56\nTable of Contents\ncapital investment or other income. The benefit of these incentives is recorded when received and all conditions as specified in the agreement are fulfilled.\nThere were $\n86.6\n million of government incentives received as cash payments related to the construction of the Company’s new global headquarters and research and development center in 2022. These government incentives were recorded as a reduction in the carrying amount of the respective assets under construction within Property, plant and equipment, net on the Consolidated Balance Sheets and within Other as an investing activity on the Statements of Consolidated Cash Flows. There were \nno\n material government incentives received in 2024 or 2023.\nSupply Chain Financing\n \nAs part of our strategy to manage working capital, we have entered into agreements with various financial institutions that act as intermediaries between the Company and certain suppliers. The Company is not a party to agreements between the suppliers and the financial institutions. These arrangements provide participating suppliers the option to settle outstanding accounts payable incurred by the Company in the normal course of business early at a discount and do not impact our rights and obligations with suppliers, including amounts due and scheduled payment terms. Under the terms of our agreements, the Company confirms the validity of each supplier invoice to the respective financial institution upon receipt. On the invoice due date, the Company settles the outstanding amount with the respective financial institution. Liabilities associated with these arrangements are recorded in \nAccounts payable\n on the Consolidated Balance Sheets and amounted to $\n215.7\n million, $\n213.1\n million and $\n258.1\n million at December 31, 2024, 2023 and 2022, respectively.\nThe following table presents a rollforward of the Company’s outstanding obligations under its supplier finance programs for year ended December 31, 2024.\n2024\nBalance at January 1\n$\n213.1\n \nInvoices confirmed during the year\n988.8\n \nConfirmed invoices paid during the year\n(\n986.2\n)\nBalance at December 31\n$\n215.7\n \nEarnings Per Share\n \nCommon stock held in a revocable trust (see Note 12) is not included in outstanding shares for basic or diluted income per share calculations. Basic and diluted net income per share are calculated using the treasury stock method in accordance with the Earnings Per Share Topic of the ASC. Basic net income per share amounts are computed based on the weighted-average number of shares outstanding during the year. Diluted net income per share amounts are computed based on the weighted-average number of shares outstanding plus all dilutive securities potentially outstanding during the year.\n See Note 21 for further details.\nNOTE 2 – \nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nAdopted\nEffective January 1, 2024, the Company adopted Accounting Standards Update (ASU) 2023-02, “Investments - Equity Method and Joint Ventures (Topic 323): Accounting for investments in tax credit structures using the proportional amortization method.” This ASU allows entities to apply the proportional amortization method to all tax equity investments if certain conditions are met. In addition, the ASU requires certain disclosures about the nature and financial implications of tax equity investments on an entity’s financial position, results of operations and cash flows, including the impact of transition on the periods presented, if any. The adoption of the ASU did not materially affect the Company’s financial position, results of operations or cash flows since the Company has historically applied the proportional amortization method to its Non-Traded Investments, however, certain disclosures have been added based on the requirements of the ASU. See Note 1 for further details.\nEffective December 31, 2024, the Company adopted ASU 2023-07, “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures.” This ASU enhances reportable segment disclosures on both an annual and interim basis primarily in regards to the disclosure of significant segment expenses that are regularly provided to the chief operating decision maker (CODM) and included within the reported measure(s) of segment profit or loss. In addition, the ASU requires disclosure, by segment, of other items included in the reported measure(s) of segment profit or loss, including qualitative information describing the composition, nature and type of each item. The ASU also expands disclosure requirements related to the CODM, including how the reported measure(s) of segment profit or loss are used to assess segment performance and allocate resources, the method used to allocate overhead for significant segment expenses and others. Lastly, all current required annual segment \n57\nTable of Contents\nreporting disclosures under Topic 280 are now effective for interim periods. The adoption of the ASU has only impacted the Company’s segment disclosures with no impact to the consolidated financial statements. See Note 22 for further details.\nEffective January 1, 2023, the Company adopted ASU 2022-04, “Liabilities - Supplier Finance Programs (Subtopic 405-50): Disclosure of Supplier Finance Program Obligations.” This ASU includes a requirement to present a rollforward of supply chain financing activity prospectively, beginning with the annual period ending December 31, 2024. The adoption of ASU 2022-04 did not affect the Company’s financial position, results of operations or cash flows as the standard only impacts financial statement footnote disclosures. See Note 1 for additional information. \nNot Yet Adopted\nIn December 2023, the Financial Accounting Standards Board (FASB) issued ASU 2023-09, “Income Taxes (Topic 740): Improvements to Income Tax Disclosures.” This ASU enhances income tax disclosures by providing information to better assess how an entity’s operations, related tax risks, tax planning and operational opportunities affect its tax rate and prospects for future cash flows. This ASU requires additional disclosures to the annual effective tax rate reconciliation including specific categories and further disaggregated reconciling items that meet the quantitative threshold. Additionally, the ASU requires disclosures relating to income tax expense and payments made to federal, state, local and foreign jurisdictions. This ASU is effective for fiscal years beginning after December 15, 2024. The Company is evaluating the impact of adopting this ASU.\nIn November 2024, the FASB issued ASU 2024-03, “Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses.” This ASU enhances expense disclosures on both an annual and interim basis by requiring public business entities to disclose additional information about specific expense categories in the notes to the consolidated financial statements. This ASU requires public entities to disclose, in a tabular format, purchases of inventory, employee compensation, depreciation, intangible asset amortization and depletion, as applicable, for each income statement line item that contains those expenses. Specific expenses, gains and losses that are already disclosed under existing US GAAP are also required to be included in the disaggregated income statement expense line-item disclosures, and any remaining amounts will need to be described qualitatively. Additionally, the ASU requires disclosure of the total amount of selling expenses and the entity’s definition of selling expenses. This ASU is effective for fiscal years beginning after December 15, 2026 and for interim periods within fiscal years beginning after December 15, 2027. The Company is evaluating the impact of adopting this ASU.\n \nNOTE 3 – \nACQUISITIONS AND DIVESTITURES\nAcquisitions\nSubsequent Event\nIn February 2025, the Company signed an agreement to acquire the Brazilian decorative paints business of BASF SE (BASF), which is a leading provider of architectural paints in Brazil with annual sales of approximately $\n525.0\n million. The business develops, manufactures and sells a comprehensive portfolio of innovative products under the Suvinil and Glasu! brand names to professional painters, designers, architects, general contractors and consumers across the country. The business also operates two production facilities located in the Northeast and Southeast regions of Brazil.\nThe closing of the transaction is subject to receipt of Brazilian antitrust approval, satisfaction or waiver of certain other customary closing conditions, as well as BASF’s completion of its carve-out of all relevant assets, properties, contracts, permits, rights and employees of the decorative paints business into a separate entity. The Company will acquire all issued and outstanding equity interests in this separate entity for an agreed-upon cash purchase price of $\n1.15\n billion, subject to customary post-closing adjustments. The Company intends to finance the transaction through a combination of cash on hand, liquidity available under existing facilities and new debt. The acquired business is expected to be reported within the Company’s Consumer Brands Group.\nPending\nIn December 2024, the Company signed an agreement to acquire a European coil and industrial coatings company. The transaction is subject to customary closing conditions and is expected to close in 2025. The acquired business will be reported within the Company’s Performance Coatings Group.\nClosed in Current Year\nIn October 2024, the Company completed the acquisition of a metal packaging coatings business for approximately $\n80\n million. The acquired business develops, manufactures and sells coatings for the food and household product markets and is reported within the Company’s Performance Coatings Group. As of December 31, 2024, $\n33.0\n million of Property, plant and equipment, net, $\n27.9\n million of finite-lived intangibles and $\n21.1\n million of Goodwill were recognized from this transaction. \n58\nTable of Contents\nThe Company expects to finalize the purchase price allocation for the acquisition within the allowable measurement period. Pro forma results of operations have not been presented as the impact on the Company’s consolidated financial results is not material.\nClosed in 2023\nIn October 2023, the Company completed the acquisition of German-based SIC Holding GmbH, a Peter Möhrle Holding venture comprised of Oskar Nolte GmbH and Klumpp Coatings GmbH (SIC Holding). The acquired business specializes in foil coatings as well as radiation-cured and waterbased industrial wood coatings for the board, furniture and flooring industry. The total purchase price for the acquisition was approximately $\n290\n million, including an immaterial amount paid in 2024 to finalize certain representations, warranties and closing conditions. The Company finalized the purchase price allocation within the allowable measurement period, and $\n110.8\n million of finite-lived intangible assets, $\n181.3\n million of goodwill, $\n46.0\n million of other assets, net of cash and $\n47.5\n million of liabilities were recognized from this transaction.\nClosed in 2022\nIn April 2022, the Company completed the acquisition of the European industrial coatings business of Sika AG. In July 2022, the Company completed the acquisitions of Gross & Perthun GmbH, Dur-A-Flex, Inc. and Powdertech Oy Ltd. In December 2022, the Company completed the acquisition of Industria Chimica Adriatica S.p.A. (ICA). The aggregate purchase price for the acquisitions completed in 2022 was approximately $\n1.024\n billion, including amounts withheld as security for certain representations, warranties and obligations of the sellers. Based on the preliminary purchase price allocations for these transactions, as of December 31, 2022, the Company recognized intangible assets and goodwill of $\n282.8\n million and $\n565.8\n million, respectively, with the remaining purchase price for each transaction allocated to various other assets acquired and liabilities assumed. In June 2023, purchase price allocation adjustments were made to ICA which decreased goodwill by $\n145.9\n million, increased finite-lived intangible assets by $\n195.9\n million and increased deferred tax liabilities by $\n57.4\n million. There were no material adjustments related to the other acquisitions that closed in 2022 and the Company finalized the purchase price allocations for these transactions in the allowable measurement period. In accordance with certain purchase agreements, the Company paid $\n29.2\n million in 2023 related to holdbacks for acquisitions completed in prior years.\nDivestitures\nClosed in 2023\nThe Company completed the divestiture of a non-core domestic aerosol business within the Consumer Brands Group in April 2023. This transaction resulted in the recognition of a $\n20.1\n million gain in 2023 within the Administrative function. This gain was recorded within Other general (income) expense - net (see Note 19).\nDuring the third quarter of 2023, the Company completed the divestiture of the China architectural business within the Consumer Brands Group. An immaterial working capital adjustment was finalized during the first quarter of 2024. The associated net assets were classified as held for sale at June 30, 2023 in accordance with the Property, Plant and Equipment Topic of the ASC. Following the prescribed order of impairment testing, the Company first reviewed individual tangible and intangible assets under their applicable Topic of the ASC to determine if their carrying value was higher than their respective fair value. As a result, the Company recorded an impairment charge of $\n6.9\n million within the Consumer Brands Group related to China architectural trademarks during 2023. The Company then compared the updated carrying value of the assets and liabilities comprising the disposal group as a whole to its respective fair value which was determined to be equal to the selling price, less costs to sell. As a result of this comparison, the Company recorded an additional impairment charge of $\n27.1\n million within the Administrative function in the second quarter of 2023. The fair value of the disposal group was classified as level 2 in the fair value hierarchy as it was based on a specific price and other observable inputs for similar items with no active market.\nThese divestitures did not meet the criteria to be reported as discontinued operations in the consolidated financial statements as the Company’s decision to divest these businesses did not represent a strategic shift that will have a major effect on the Company’s operations and financial results.\n \n59\nTable of Contents\nNOTE 4 – \nINVENTORIES\nIncluded in Inventories were the following:\n2024\n2023\n2022\nFinished goods\n$\n1,751.9\n \n$\n1,810.9\n \n$\n1,957.7\n \nWork in process and raw materials\n536.2\n \n518.9\n \n668.8\n \nInventories\n$\n2,288.1\n \n$\n2,329.8\n \n$\n2,626.5\n \nInventories were stated at the lower of cost or market, with cost primarily determined on the LIFO method. Management believes that the use of LIFO results in a better matching of costs and revenues. \nThe following table summarizes the extent to which the Company’s Inventories use the LIFO cost method, and presents the effect on Inventories had the Company used the first-in, first-out (FIFO) inventory valuation method.\n2024\n2023\n2022\nPercentage of total inventories on LIFO\n74\n \n%\n74\n \n%\n74\n \n%\nExcess of FIFO over LIFO\n$\n630.2\n$\n668.0\n$\n792.7\nDuring 2024 and 2023, certain inventories accounted for on the LIFO method were reduced, resulting in the liquidation of certain quantities carried at costs prevailing in prior years. The 2024 and 2023 liquidations increased Net income by $\n4.8\n million and $\n1.2\n million, respectively. There were \nno\n liquidations in 2022.\nThe Company recorded a reserve for obsolescence of $\n137.7\n million, $\n170.8\n million and $\n139.0\n million at December 31, 2024, 2023 and 2022, respectively, to reduce Inventories to their estimated current market price.\nNOTE 5 – \nPROPERTY, PLANT AND EQUIPMENT\nIncluded in Property, plant and equipment, net were the following:\n2024\n2023\n2022\nLand\n$\n259.9\n \n$\n257.5\n \n$\n263.0\n \nBuildings\n1,175.9\n \n1,048.7\n \n1,199.3\n \nMachinery and equipment\n3,689.5\n \n3,459.8\n \n3,230.2\n \nConstruction in progress\n1,598.1\n \n1,111.0\n \n496.1\n \nProperty, plant and equipment, gross\n6,723.4\n \n5,877.0\n \n5,188.6\n \nLess allowances for depreciation\n3,190.2\n \n3,040.2\n \n2,981.6\n \nProperty, plant and equipment, net\n$\n3,533.2\n \n$\n2,836.8\n \n$\n2,207.0\n \nThe Company capitalizes interest costs incurred in the construction of certain property, plant and equipment. In 2024 and 2023, the Company capitalized interest of $\n59.6\n million and $\n30.7\n million, respectively. There was \nno\n interest capitalized in 2022.\nIn accordance with the Property, Plant and Equipment Topic of the ASC, whenever events or changes in circumstances indicate that the carrying value of long-lived assets may not be recoverable or the useful life may have changed, an impairment test is to be performed. Undiscounted cash flows are used to calculate the recoverable value of long-lived assets to determine if such assets are not recoverable. If the carrying value of the assets is deemed to not be recoverable, the impairment to be recognized is the amount by which the carrying value of the assets exceeds the estimated fair value of the assets as determined in accordance with the Fair Value Topic of the ASC. See Note 3 for information on the impairment tests performed in 2023 for the assets held for sale prior to the divestiture of the China architectural business. No other material impairments of Property, plant and equipment were recorded in 2024, 2023 or 2022.\n \n60\nTable of Contents\nNOTE 6 – \nGOODWILL AND INTANGIBLE ASSETS\nIn 2024, the Company completed the acquisition of a metal packaging coatings business, which resulted in the recognition of goodwill of $\n21.1\n million and finite-lived intangibles of $\n27.9\n million. The acquired intangibles are being amortized over a weighted-average useful life of approximately \n15\n years.\nDuring 2023, the Company completed the acquisition of SIC Holding, which resulted in the recognition of goodwill of $\n181.3\n million and finite-lived intangibles of $\n110.8\n million. The acquired intangibles are being amortized over a weighted-average useful life of approximately \n15\n years. \nDuring 2022, the Company acquired \nfive\n companies which resulted in the recognition of goodwill of $\n419.9\n million and finite-lived intangibles of $\n478.6\n million. The acquired intangibles are being amortized over a weighted-average useful life of approximately \n14\n years. \nSee Note 3 for additional information related to the acquisitions and divestitures.\nIn accordance with the Goodwill and Other Intangibles Topic of the ASC, goodwill at the reporting unit level and indefinite-lived intangible assets are tested for impairment annually. In addition, interim impairment tests are performed whenever required as a result of a specific event or circumstances which indicate potential impairment on a more likely than not basis. October 1 has been established for the annual impairment review. An optional qualitative assessment may alleviate the need to perform quantitative goodwill and indefinite-lived intangible asset impairment tests when there is no indication of impairment on a more likely than not basis. Should a quantitative impairment test be performed, values are estimated separately for goodwill and indefinite-lived intangible assets using applicable valuation models, incorporating discount rates commensurate with the risks involved for each group of assets. \nThe annual impairment review performed as of October 1, 2024 did not result in any trademark or goodwill impairment. \nAs a result of the Latin America architectural paint business moving to the Consumer Brands Group reportable segment effective January 1, 2023, the Company performed a quantitative impairment analysis for the impacted reporting units and determined both before and after the change, there was no indication of impairment. The annual impairment review performed as of October 1, 2023 resulted in no goodwill impairment and trademark impairment of $\n23.9\n million in the Consumer Brands Group primarily related to a trademark in Europe. \nThe annual impairment review performed as of October 1, 2022 resulted in trademark impairments totaling $\n15.5\n million in the Consumer Brands Group related to the discontinuation of an architectural paint brand and lower than anticipated sales of an acquired brand and no goodwill impairment.\nA summary of changes in the Company’s carrying value of Goodwill by Reportable Segment is as follows:\nGoodwill\nPaint Stores Group\nConsumer Brands\nGroup\nPerformance Coatings\nGroup\nConsolidated\nTotals\nBalance at January 1, 2022 \n(1)\n$\n2,182.1\n \n$\n1,783.4\n \n$\n3,169.1\n \n$\n7,134.6\n \nAcquisitions and acquisition adjustments\n49.7\n \n21.3\n \n422.5\n \n493.5\n \nCurrency and other adjustments\n(\n2.8\n)\n(\n42.1\n)\n(\n44.9\n)\nBalance at December 31, 2022 \n(1)\n2,231.8\n \n1,801.9\n \n3,549.5\n \n7,583.2\n \nAcquisitions and acquisition adjustments\n8.3\n \n8.3\n \nCurrency and other adjustments\n(\n9.1\n)\n43.6\n \n34.5\n \nBalance at December 31, 2023 \n(1)\n2,231.8\n \n1,792.8\n \n3,601.4\n \n7,626.0\n \nAcquisitions and acquisition adjustments\n48.2\n \n48.2\n \nCurrency and other adjustments\n(\n0.3\n)\n(\n93.8\n)\n(\n94.1\n)\nBalance at December 31, 2024 \n(1)\n$\n2,231.8\n \n$\n1,792.5\n \n$\n3,555.8\n \n$\n7,580.1\n \n (1)    \nNet of accumulated impairment losses of $\n19.4\n million ($\n10.2\n million in Paint Stores Group, $\n8.4\n million in Consumer Brands Group and $\n0.8\n million in Performance Coatings Group).\n61\nTable of Contents\nA summary of the Company’s carrying value of Intangible assets is as follows: \nFinite-Lived Intangible Assets\nTrademarks\nWith \nIndefinite\nLives \n(1)\nTotal\nIntangible\nAssets\nSoftware\nCustomer\nRelationships\nIntellectual\nProperty\nAll Other\nSubtotal\nDecember 31, 2024\nGross\n$\n185.0\n \n$\n3,187.8\n \n$\n1,973.0\n \n$\n225.8\n \n$\n5,571.6\n \nAccumulated amortization\n(\n154.3\n)\n(\n1,489.6\n)\n(\n747.7\n)\n(\n154.7\n)\n(\n2,546.3\n)\nNet value\n$\n30.7\n \n$\n1,698.2\n \n$\n1,225.3\n \n$\n71.1\n \n$\n3,025.3\n \n$\n507.9\n \n$\n3,533.2\n \nDecember 31, 2023\nGross\n$\n158.2\n \n$\n3,263.4\n \n$\n1,968.5\n \n$\n232.6\n \n$\n5,622.7\n \nAccumulated amortization\n(\n152.8\n)\n(\n1,310.6\n)\n(\n644.4\n)\n(\n152.9\n)\n(\n2,260.7\n)\nNet value\n$\n5.4\n \n$\n1,952.8\n \n$\n1,324.1\n \n$\n79.7\n \n$\n3,362.0\n \n$\n518.5\n \n$\n3,880.5\n \nDecember 31, 2022\nGross\n$\n180.2\n \n$\n3,121.2\n \n$\n1,732.5\n \n$\n427.5\n \n$\n5,461.4\n \nAccumulated amortization\n(\n148.1\n)\n(\n1,132.1\n)\n(\n477.4\n)\n(\n258.0\n)\n(\n2,015.6\n)\nNet value\n$\n32.1\n \n$\n1,989.1\n \n$\n1,255.1\n \n$\n169.5\n \n$\n3,445.8\n \n$\n556.2\n \n$\n4,002.0\n \n(1)    \nTrademarks are net of accumulated impairment losses of $\n163.8\n million\n as of December 31, 2024 and 2023 and $\n139.9\n million as of December 31, 2022.\nAmortization of finite-lived intangible assets is estimated as follows for the next five years: $\n317.2\n million in 2025, $\n315.3\n million in 2026, $\n310.5\n million in 2027, $\n307.5\n million in 2028 and $\n305.9\n million in 2029.\nAlthough the Company believes its estimates of fair value related to reporting units and indefinite-lived intangible assets are reasonable, actual financial results could differ from these estimates due to the inherent uncertainty involved in making such estimates. Changes in assumptions concerning future financial results or other underlying assumptions could have a significant impact and future impairment charges may be required.\n62\nTable of Contents\nNOTE 7 – \nDEBT\nLong-Term Debt\nThe table below summarizes the carrying value of the Company’s outstanding debt, net of capitalized debt issuance costs, discounts and premiums:\nDue Date\n2024\n2023\n2022\n3.45\n% Senior Notes \n2027\n$\n1,495.7\n \n$\n1,493.9\n \n$\n1,492.1\n \n4.50\n% Senior Notes \n2047\n1,233.7\n \n1,233.0\n \n1,232.3\n \n2.95\n% Senior Notes\n2029\n795.5\n \n794.6\n \n793.6\n \n3.80\n% Senior Notes\n2049\n543.7\n \n543.6\n \n543.2\n \n2.30\n% Senior Notes \n2030\n497.6\n \n497.1\n \n496.7\n \n2.20\n% Senior Notes\n2032\n495.5\n \n494.8\n \n494.2\n \n3.30\n% Senior Notes \n2050\n494.6\n \n494.3\n \n494.1\n \n2.90\n% Senior Notes\n2052\n492.1\n \n491.9\n \n491.5\n \n4.80\n% Senior Notes\n2031\n445.0\n \n—\n \n—\n \n3.45\n% Senior Notes\n2025\n399.8\n \n399.4\n \n399.1\n \n4.25\n% Senior Notes\n2025\n399.5\n \n398.6\n \n397.7\n \n4.55\n% Senior Notes\n2045\n395.4\n \n395.2\n \n395.0\n \n4.55\n% Senior Notes\n2028\n397.6\n \n—\n \n—\n \n3.95\n% Senior Notes \n2026\n351.6\n \n353.1\n \n354.7\n \n4.00\n% Senior Notes\n2042\n297.2\n \n297.0\n \n296.9\n \n3.30\n% Senior Notes \n2025\n250.0\n \n249.9\n \n249.8\n \n4.40\n% Senior Notes \n2045\n241.3\n \n240.9\n \n240.5\n \n0.53\n% to \n8.00\n% Promissory Notes\nThrough 2026\n0.2\n \n0.9\n \n1.6\n \n4.05\n% Senior Notes \n2024\n—\n \n598.8\n \n596.9\n \n3.125\n% Senior Notes\n \n2024\n—\n \n499.7\n \n499.0\n \n7.375\n% Debentures\n2027\n—\n \n—\n \n119.2\n \n7.45\n% Debentures\n2097\n—\n \n—\n \n3.5\n \nTotal\n (1)\n9,226.0\n \n9,476.7\n \n9,591.6\n \nLess amounts due within one year\n1,049.2\n \n1,098.8\n \n0.6\n \nLong-term debt\n$\n8,176.8\n \n$\n8,377.9\n \n$\n9,591.0\n \n(1)\n     Net of capitalized debt issuance costs of $\n48.6\n million, $\n49.3\n million and $\n57.3\n million and net of discounts and premiums of $\n26.0\n million, $\n25.2\n million and $\n25.7\n million at December 31, 2024, 2023 and 2022, respectively.\n \nMaturities of long-term debt are as follows for the next five years: $\n1.050\n billion in 2025; $\n350.2\n million in 2026; $\n1.500\n billion in 2027; $\n400.0\n million in 2028 and $\n800.0\n million in 2029. Interest expense on long-term debt was $\n354.7\n million, $\n374.6\n million and $\n348.4\n million for 2024, 2023 and 2022, respectively.\nIn August 2024, the Company repaid principal of $\n600.0\n million related to the Company’s \n4.05\n% senior notes due August 8, 2024 using commercial paper and subsequently issued $\n400.0\n million of \n4.55\n% senior notes due 2028 and $\n450.0\n million of \n4.80\n% senior notes due 2031 in a public offering. The net proceeds from the issuance of these notes were used to repay outstanding borrowings under the Company’s domestic commercial paper program and for general corporate purposes. The newly issued senior notes contain customary qualitative covenants as defined in their respective agreements. During the second quarter of 2024, the Company repaid the principal of $\n500.0\n million related to its \n3.125\n% senior notes due June 1, 2024 using commercial paper.\nIn December 2023, the Company exercised its call provision to make-whole the entire outstanding $\n119.4\n million aggregate principal amount of its \n7.38\n% Debentures due 2027 and the entire outstanding $\n3.5\n million aggregate principal amount of its \n7.45\n% Debentures due 2097. The retirement of the Debentures resulted in a loss of $\n12.8\n million recorded in Other general (income) expense - net. See Note 19.\nIn \nAugust\n 2022, the Company issued \n$\n600.0\n million\n of \n4.05\n% Senior Notes due August 2024 and \n$\n400.0\n million\n of \n4.25\n% Senior Notes due August 2025 in a public offering. The net proceeds from the issuance of these notes were used to repay \n63\nTable of Contents\nborrowings outstanding under the Company’s credit agreement dated May 9, 2016, as amended, and the domestic commercial paper program. \nShort-Term Borrowings\nIn November 2024, the Company amended its credit agreement dated May 9, 2016, as amended, to extend the maturity of $\n75.0\n million of the commitments available for borrowing and obtaining the issuance, renewal, extension and increase of a letter of credit under the credit agreement from June 20, 2025 to December 20, 2029.\nIn July 2024, the Company entered into a new $\n2.500\n billion revolving credit agreement maturing on July 31, 2029 (2024 Credit Agreement), which replaced the the 2022 Credit Agreement. Under the terms of the 2024 Credit Agreement, the Company may request to extend the maturity date for \ntwo\n additional \none-year\n periods, request an uncommitted increase up to $\n750.0\n million and issue letters of credit under a $\n250.0\n million subfacility. \nIn August 2022, the Company entered into a \nfive-year\n credit agreement (2022 Credit Agreement), which replaced the $\n2.000\n billion credit agreement dated June 29, 2021. The 2022 Credit Agreement gave the Company the right to borrow $\n2.250\n billion and to obtain letters of credit in an amount of up to $\n250.0\n million. \nIn August 2021, the Company entered into an amended and restated $\n625.0\n million credit agreement (2021 Credit Agreement), which amends and restates the \nfive-year\n credit agreement entered into in September 2017. The 2021 Credit Agreement was subsequently amended on multiple dates to extend the maturity of commitments available for borrowing or letters of credit under the agreement. \nIn May 2016, the Company entered into a \nfive-year\n credit agreement (2016 Credit Agreement), subsequently amended on multiple dates to extend the maturity of commitments available for borrowing or letters of credit under the agreement. The 2016 credit agreement gives the Company the right to borrow and obtain letters of credit up to an aggregate availability of $\n875.0\n million. These credit agreements are/were used for general corporate purposes, including the financing of working capital requirements.\nAt December 31, 2024, 2023 and 2022, there were \nno\n borrowings outstanding under these credit agreements. \nThe Company’s available capacity under its committed credit agreements is reduced for amounts outstanding under its domestic commercial paper program and letters of credit. At December 31, 2024, the Company had unused capacity under its various credit agreements of $\n3.274\n billion. \nThe table below summarizes the Company’s Short-term borrowings:\n2024\n2023\n2022\nDomestic commercial paper\n$\n655.6\n \n$\n347.7\n \n$\n938.5\n \nForeign facilities\n6.8\n \n26.5\n \n39.6\n \nTotal\n$\n662.4\n \n$\n374.2\n \n$\n978.1\n \nWeighted average interest rate:\nDomestic\n4.7\n%\n5.5\n%\n4.6\n%\nForeign\n3.1\n%\n3.6\n%\n6.7\n%\nInterest expense on Short-term borrowings was $\n61.0\n million, $\n42.9\n million and $\n42.4\n million for 2024, 2023 and 2022, respectively.\nAmong other restrictions, the Company’s notes, debentures and revolving credit agreement contain certain covenants relating to liens, ratings changes, merger and sale of assets, consolidated leverage and change of control, as defined in the agreements. In the event of default under any one of these arrangements, acceleration of the maturity of any one or more of these borrowings may result. The Company was in compliance with all covenants for all years presented.\n64\nTable of Contents\nNOTE 8 – \nPENSION, HEALTH CARE AND OTHER POSTRETIREMENT BENEFITS\nThe Company provides pension benefits to substantially all full-time employees through primarily noncontributory defined contribution or defined benefit pension plans and certain health care and life insurance benefits to domestic active employees and eligible retirees. \nHealth Care Plans\nThe Company provides certain domestic health care plans that are contributory and contain cost-sharing features such as deductibles and coinsurance. There were \n32,283\n, \n31,327\n and \n30,009\n active employees covered by the benefits under these plans at December 31, 2024, 2023 and 2022, respectively. The cost of these benefits for active employees, which includes claims incurred but not reported, amounted to $\n382.6\n million, $\n363.2\n million and $\n347.4\n million for 2024, 2023 and 2022, respectively.\nDefined Contribution Pension Plans\nThe Company’s annual contribution for its domestic defined contribution pension plan was $\n103.5\n million, $\n97.8\n million and $\n88.9\n million for 2024, 2023 and 2022, respectively. The contribution percentage ranges from \ntwo\n percent to \nseven\n percent of compensation for covered employees based on an age and service formula. Assets in employee accounts of the domestic defined contribution pension plan are invested in various investment funds as directed by the participants. These investment funds did not own a significant number of shares of the Company’s common stock for any year presented. \nThe Company’s annual contributions for its foreign defined contribution pension plans, which are based on various percentages of compensation for covered employees up to certain limits, were $\n20.6\n million, $\n19.5\n million and $\n19.4\n million for 2024, 2023 and 2022, respectively. Assets in employee accounts of the foreign defined contribution pension plans are invested in various investment funds. These investment funds did not own a significant number of shares of the Company’s common stock for any year presented.\nDefined Benefit Pension Plans\nAt December 31, 2024, the domestic defined benefit pension plan was overfunded, with a projected benefit obligation of $\n95.3\n million, fair value of plan assets of $\n148.7\n million and excess plan assets of $\n53.4\n million. The plan was funded in accordance with all applicable regulations at December 31, 2024. \nThe Company has \nthirty-six\n foreign defined benefit pension plans. At December 31, 2024, \ntwenty-nine\n of the Company’s foreign defined benefit pension plans were unfunded or underfunded, with combined accumulated benefit obligations, projected benefit obligations, fair values of net assets and deficiencies of plan assets of $\n73.9\n million, $\n88.3\n million, $\n20.5\n million and $\n67.8\n million, respectively.\nThe Company expects to make the following benefit payments for all domestic and foreign defined benefit pension plans: $\n19.2\n million in 2025; $\n18.9\n million in 2026; $\n20.6\n million in 2027; $\n22.2\n million in 2028; $\n22.7\n million in 2029; and $\n139.2\n million in 2030 through 2034. The Company expects to contribute $\n5.8\n million to the foreign defined benefit pension plans in 2025.\nThe estimated net actuarial gains and prior service costs for the defined benefit pension plans that are expected to be amortized from AOCI into net pension costs in 2025 are $\n3.2\n million and $\n2.0\n million, respectively.\n65\nTable of Contents\nThe following table summarizes the components of the net pension costs and AOCI related to the defined benefit pension plans:\nDomestic\nDefined Benefit Pension Plan\nForeign\nDefined Benefit Pension Plans\n2024\n2023\n2022\n2024\n2023\n2022\nNet pension cost:\nService cost\n$\n2.9\n \n$\n3.0\n \n$\n4.6\n \n$\n4.6\n \n$\n4.4\n \n$\n6.3\n \nInterest cost\n4.9\n \n4.6\n \n3.2\n \n11.8\n \n11.8\n \n7.3\n \nExpected return on plan assets\n(\n8.3\n)\n(\n7.3\n)\n(\n7.6\n)\n(\n11.1\n)\n(\n12.3\n)\n(\n9.4\n)\nAmortization of prior service cost (credit)\n1.9\n \n1.3\n \n1.0\n \n(\n0.1\n)\n(\n0.2\n)\n(\n0.2\n)\nAmortization of actuarial (gains) losses\n(\n0.5\n)\n(\n1.3\n)\n(\n1.5\n)\n0.2\n \nOngoing pension cost\n0.9\n \n1.6\n \n1.2\n \n3.9\n \n2.2\n \n4.2\n \n  Settlement credits\n(\n1.1\n)\n(\n0.3\n)\nCurtailment cost\n7.1\n \nNet pension cost\n0.9\n \n1.6\n \n1.2\n \n11.0\n \n1.1\n \n3.9\n \nOther changes in plan assets and projected benefit \nobligation recognized in AOCI (before taxes):\nNet actuarial (gains) losses arising during the year\n(\n20.9\n)\n(\n8.6\n)\n5.0\n \n(\n8.0\n)\n5.8\n \n(\n29.6\n)\nPrior service cost (credit) arising during the year\n1.0\n \n3.0\n \n1.6\n \n6.9\n \n1.1\n \n(\n0.3\n)\nAmortization of actuarial gains (losses)\n0.5\n \n1.3\n \n1.5\n \n(\n0.2\n)\nAmortization of prior service (cost) credit\n(\n1.9\n)\n(\n1.3\n)\n(\n1.0\n)\n(\n7.0\n)\n0.2\n \n0.2\n \nLoss recognized for settlement\n1.1\n \n0.3\n \nExchange rate loss (gain) recognized during the year\n1.6\n \n(\n1.5\n)\n(\n0.4\n)\nTotal recognized in AOCI\n(\n21.3\n)\n(\n6.9\n)\n5.6\n \n(\n5.2\n)\n8.2\n \n(\n30.0\n)\nTotal recognized in net pension cost and AOCI\n$\n(\n20.4\n)\n$\n(\n5.3\n)\n$\n6.8\n \n$\n5.8\n \n$\n9.3\n \n$\n(\n26.1\n)\nService cost is recorded in Cost of goods sold and Selling, general and administrative expenses. All other components of Net pension costs are recorded in Other (income) expense - net. \nIn December 2024, the Company amended one of its foreign defined benefit plans to freeze future benefit accruals as of December 31, 2024. As a result of the amendment, the Company recognized a non-cash pre-tax curtailment charge of $\n7.1\n million primarily related to the acceleration of amounts previously recorded within AOCI in the Statements of Consolidated Comprehensive Income.\nThe Company employs a total return investment approach for the domestic and foreign defined benefit pension plan assets. A mix of equities and fixed income investments are used to maximize the long-term return of assets for a prudent level of risk. In determining the expected long-term rate of return on defined benefit pension plan assets, management considers the historical rates of return, the nature of investments and an expectation of future investment strategies. The target allocations for the domestic defined benefit pension plan assets are \n35\n% – \n65\n% equity securities, \n35\n% – \n65\n% fixed income securities and \n0\n% – \n5\n% other (including alternative investments and cash). The target allocations for the foreign defined benefit pension plan assets vary by plan, but are generally within the following ranges: \n0\n% – \n20\n% equity securities, \n75\n% – \n100\n% fixed income securities and \n0\n% – \n10\n% other (including alternative investments and cash).\n66\nTable of Contents\nThe following tables summarize the fair value of the defined benefit pension plan assets at December 31, 2024, 2023 and 2022. The presentation is in accordance with the Fair Value Topic of the ASC.\nFair Value at\nDecember 31,\n2024\nQuoted Prices\nin Active \nMarkets for \nIdentical \nAssets \n(Level 1)\nSignificant \nOther\nObservable \nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nInvestments at fair value:\n Cash and cash equivalents\n$\n8.7\n \n$\n8.7\n \n$\n—\n \nEquity investments \n(1)\n95.3\n \n86.6\n \n8.7\n \nFixed income investments \n(2)\n226.5\n \n36.8\n \n189.7\n \nOther assets \n(3)\n24.2\n \n24.2\n \nTotal investments in fair value hierarchy\n$\n354.7\n \n$\n132.1\n \n$\n222.6\n \nInvestments measured at NAV or its equivalent \n(4)\n25.3\n \nTotal investments\n$\n380.0\n \nFair Value at \nDecember 31,\n2023\nQuoted Prices\nin Active \nMarkets for \nIdentical \nAssets \n(Level 1)\nSignificant \nOther\nObservable \nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nInvestments at fair value:\nEquity investments \n(1)\n$\n133.0\n \n$\n72.9\n \n$\n60.1\n \nFixed income investments \n(2)\n188.9\n \n36.8\n \n152.1\n \nOther assets \n(3)\n34.6\n \n34.6\n \nTotal investments in fair value hierarchy\n$\n356.5\n \n$\n109.7\n \n$\n246.8\n \nInvestments measured at NAV or its equivalent \n(4)\n25.3\n \nTotal investments\n$\n381.8\n \nFair Value at\nDecember 31,\n2022\nQuoted Prices\nin Active \nMarkets for \nIdentical \nAssets \n(Level 1)\nSignificant \nOther\nObservable \nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nInvestments at fair value:\nEquity investments \n(1)\n$\n80.1\n \n$\n8.5\n \n$\n71.6\n \nFixed income investments \n(2)\n117.6\n \n117.6\n \nOther assets \n(3)\n34.4\n \n34.4\n \nTotal investments in fair value hierarchy\n$\n232.1\n \n$\n8.5\n \n$\n223.6\n \nInvestments measured at NAV or its equivalent \n(4)\n110.9\n \nTotal investments\n$\n343.0\n \n(1)    \nThis category includes actively managed equity assets that track primarily to the S&P 500 or an international equity index.\n(2)    \nThis category includes government and corporate bonds that track primarily to a domestic or an international bond index.\n(3)    \nThis category primarily includes insurance contracts and real estate.\n(4)    \nThis category includes pooled investment funds and private equity funds that are measured at NAV or its equivalent using the practical expedient. Therefore, these investments are not classified in the fair value hierarchy.\n67\nTable of Contents\nThe following table summarizes the obligations, plan assets and assumptions used for the defined benefit pension plans, which are all measured as of December 31:\nDomestic\nDefined Benefit Pension Plan\nForeign\nDefined Benefit Pension Plans\n2024\n2023\n2022\n2024\n2023\n2022\nAccumulated benefit obligations \nat end of year\n$\n94.2\n \n$\n100.5\n \n$\n90.3\n \n$\n221.7\n \n$\n236.4\n \n$\n209.3\n \nProjected benefit obligations:\nBalances at beginning of year\n$\n102.1\n \n$\n91.7\n \n$\n120.8\n \n$\n257.8\n \n$\n230.4\n \n$\n362.7\n \nService cost\n2.9\n \n3.0\n \n4.6\n \n4.6\n \n4.4\n \n6.3\n \nInterest cost\n4.9\n \n4.6\n \n3.2\n \n11.8\n \n11.8\n \n7.3\n \nActuarial (gains) losses\n(\n11.1\n)\n2.8\n \n(\n32.6\n)\n(\n19.8\n)\n8.8\n \n(\n112.4\n)\nPlan amendments and other\n1.0\n \n3.0\n \n1.6\n \n13.5\n \n2.0\n \n3.2\n \nSettlements\n(\n2.2\n)\n(\n3.7\n)\n(\n2.4\n)\nEffect of foreign exchange\n(\n12.2\n)\n14.1\n \n(\n28.8\n)\nBenefits paid\n(\n4.5\n)\n(\n3.0\n)\n(\n5.9\n)\n(\n10.5\n)\n(\n10.0\n)\n(\n5.5\n)\nBalances at end of year\n95.3\n \n102.1\n \n91.7\n \n243.0\n \n257.8\n \n230.4\n \nPlan assets:\nBalances at beginning of year\n135.1\n \n119.4\n \n155.2\n \n246.7\n \n223.6\n \n328.4\n \nActual returns on plan assets\n18.1\n \n18.7\n \n(\n29.9\n)\n(\n2.6\n)\n15.4\n \n(\n73.4\n)\nContributions and other\n5.7\n \n8.6\n \n5.8\n \nSettlements\n(\n2.2\n)\n(\n3.7\n)\n(\n2.4\n)\nEffect of foreign exchange\n(\n7.1\n)\n12.8\n \n(\n29.3\n)\nBenefits paid\n(\n4.5\n)\n(\n3.0\n)\n(\n5.9\n)\n(\n10.5\n)\n(\n10.0\n)\n(\n5.5\n)\nBalances at end of year\n148.7\n \n135.1\n \n119.4\n \n231.3\n \n246.7\n \n223.6\n \nExcess (deficient) plan assets over \nprojected benefit obligations\n$\n53.4\n \n$\n33.0\n \n$\n27.7\n \n$\n(\n11.7\n)\n$\n(\n11.1\n)\n$\n(\n6.8\n)\nAssets and liabilities recognized in the \nConsolidated Balance Sheets:\nDeferred pension assets\n$\n53.4\n \n$\n33.0\n \n$\n27.7\n \n$\n56.1\n \n$\n57.9\n \n$\n51.7\n \nOther accruals\n(\n6.0\n)\n(\n3.4\n)\n(\n3.0\n)\nOther long-term liabilities\n(\n61.8\n)\n(\n65.6\n)\n(\n55.5\n)\n$\n53.4\n \n$\n33.0\n \n$\n27.7\n \n$\n(\n11.7\n)\n$\n(\n11.1\n)\n$\n(\n6.8\n)\nAmounts recognized in AOCI:\nNet actuarial gains\n$\n36.9\n \n$\n16.6\n \n$\n8.0\n \n$\n29.9\n \n$\n24.8\n \n$\n31.7\n \nPrior service (costs) credits\n(\n7.8\n)\n(\n8.8\n)\n(\n7.1\n)\n0.4\n \n0.3\n \n1.6\n \n$\n29.1\n \n$\n7.8\n \n$\n0.9\n \n$\n30.3\n \n$\n25.1\n \n$\n33.3\n \nWeighted-average assumptions used to \ndetermine projected benefit obligations:\nDiscount rate\n5.78\n \n%\n5.09\n \n%\n5.27\n \n%\n5.49\n \n%\n4.81\n \n%\n5.06\n \n%\nRate of compensation increase\n3.00\n \n%\n3.00\n \n%\n3.00\n \n%\n3.29\n \n%\n3.33\n \n%\n3.39\n \n%\nWeighted-average assumptions used to \ndetermine net pension cost:\nDiscount rate\n5.09\n \n%\n5.27\n \n%\n3.12\n \n%\n4.81\n \n%\n5.06\n \n%\n2.26\n \n%\nExpected long-term rate of \nreturn on assets\n6.25\n \n%\n6.25\n \n%\n5.00\n \n%\n4.78\n \n%\n5.48\n \n%\n3.19\n \n%\nRate of compensation increase\n3.00\n \n%\n3.00\n \n%\n3.00\n \n%\n3.33\n \n%\n3.39\n \n%\n3.25\n \n%\n68\nTable of Contents\nOther Postretirement Benefits\nEmployees of the Company hired in the United States prior to January 1, 1993 who are not members of a collective bargaining unit, and certain groups of employees added through acquisitions, are eligible for health care and life insurance benefits upon retirement, subject to the terms of the unfunded plans. There were \n3,354\n, \n3,367\n and \n3,409\n retired employees covered by these postretirement benefits at December 31, 2024, 2023 and 2022, respectively.\nThe following table summarizes the obligation and the assumptions used for other postretirement benefits:\nOther Postretirement Benefits\n2024\n2023\n2022\nBenefit obligation:\nBalance at beginning of year - unfunded\n$\n147.2\n \n$\n153.8\n \n$\n276.4\n \nService cost\n0.5\n \n0.6\n \n1.2\n \nInterest cost\n6.8\n \n7.4\n \n6.0\n \nActuarial gain\n(\n8.6\n)\n(\n8.0\n)\n(\n54.5\n)\nPlan amendments\n(\n62.8\n)\nBenefits paid\n(\n10.8\n)\n(\n6.6\n)\n(\n12.5\n)\nBalance at end of year - unfunded\n$\n135.1\n \n$\n147.2\n \n$\n153.8\n \nLiabilities recognized in the Consolidated Balance Sheets:\nOther accruals\n$\n(\n14.4\n)\n$\n(\n14.0\n)\n$\n(\n14.5\n)\nPostretirement benefits other than pensions\n(\n120.7\n)\n(\n133.2\n)\n(\n139.3\n)\n$\n(\n135.1\n)\n$\n(\n147.2\n)\n \n$\n(\n153.8\n)\nAmounts recognized in AOCI:\nNet actuarial gains\n$\n21.0\n \n$\n12.9\n \n$\n4.7\n \nPrior service credits\n16.2\n \n40.0\n \n64.0\n \n$\n37.2\n \n$\n52.9\n \n$\n68.7\n \nWeighted-average assumptions used to determine benefit obligation:\nDiscount rate\n5.61\n \n%\n4.97\n \n%\n5.16\n \n%\nHealth care cost trend rate - pre-65\n7.50\n \n%\n7.00\n \n%\n6.25\n \n%\nHealth care cost trend rate - post-65\n6.50\n \n%\n6.00\n \n%\n5.50\n \n%\nPrescription drug cost increases\n11.75\n \n%\n9.00\n \n%\n8.25\n \n%\nWeighted-average assumptions used to determine net periodic benefit cost:\nDiscount rate\n4.97\n \n%\n5.16\n \n%\n2.83\n \n%\nHealth care cost trend rate - pre-65\n7.00\n \n%\n6.25\n \n%\n6.38\n \n%\nHealth care cost trend rate - post-65\n6.00\n \n%\n5.50\n \n%\n5.13\n \n%\nPrescription drug cost increases\n9.00\n \n%\n8.25\n \n%\n8.25\n \n%\n69\nTable of Contents\nThe following table summarizes the components of the net periodic benefit cost and AOCI related to other postretirement benefits:\nOther Postretirement Benefits\n2024\n2023\n2022\nNet periodic benefit (credit) cost:\nService cost\n$\n0.5\n \n$\n0.6\n \n$\n1.2\n \nInterest cost\n6.8\n \n7.4\n \n6.0\n \nAmortization of actuarial (gains) losses\n(\n0.4\n)\n0.1\n \n4.2\n \nAmortization of prior service credit\n(\n23.9\n)\n(\n23.9\n)\n(\n0.4\n)\nNet periodic benefit (credit) cost \n(\n17.0\n)\n(\n15.8\n)\n11.0\n \nOther changes in projected benefit obligation recognized in \nAOCI (before taxes):\nNet actuarial gain arising during the year\n(\n8.6\n)\n(\n8.0\n)\n(\n54.5\n)\nPrior service credit arising during the year\n(\n62.8\n)\nAmortization of actuarial gains (losses)\n0.4\n \n(\n0.1\n)\n(\n4.2\n)\nAmortization of prior service credit\n23.9\n \n23.9\n \n0.4\n \nTotal recognized in AOCI\n15.7\n \n15.8\n \n(\n121.1\n)\nTotal recognized in net periodic benefit cost and AOCI\n$\n(\n1.3\n)\n$\n—\n \n$\n(\n110.1\n)\nThe estimated net actuarial gains and prior service credits for other postretirement benefits that are expected to be amortized from AOCI into net periodic benefit cost in 2025 are $\n2.4\n million and $\n14.2\n million, respectively.\nThe assumed health care cost trend rate and prescription drug cost increases used to determine the net periodic benefit cost for postretirement health care benefits for 2025 both decrease in each successive year until reaching \n4.5\n% in 2034.\nThe Company expects to make retiree health care benefit cash payments as follows:\n2025\n$\n14.4\n \n2026\n14.9\n \n2027\n14.9\n \n2028\n14.3\n \n2029\n13.2\n \n2030 through 2034\n48.2\n \nTotal expected benefit cash payments\n$\n119.9\n \n70\nTable of Contents\nNOTE 9 – \nLEASES\nThe Company leases retail stores, manufacturing and distribution facilities, office space and equipment under operating and finance lease agreements. Operating leases are included in Operating lease right-of-use (ROU) assets, Current portion of operating lease liabilities and Long-term operating lease liabilities on the Consolidated Balance Sheets. Finance leases are included in Other assets, Other accruals and Other long-term liabilities on the Consolidated Balance Sheets. The finance lease related asset and liability as of December 31, 2024 was $\n187.5\n million and $\n189.3\n million\n, respectively.\nOperating and finance lease ROU assets and lease liabilities are recognized based on the present value of lease payments over the lease term. The majority of the operating lease ROU asset and lease liability balances are related to the retail operations of the Paint Stores Group. The majority of the finance lease ROU asset and lease liability balances are related to a distribution facility within the Consumer Brands Group. Most leases include \none\n or more options to renew. The exercise of lease renewal options is at the Company’s discretion and is not reasonably certain at lease commencement. \nThe Company does not account for lease and non-lease components of contracts separately for any underlying asset class. Some leases have variable payments, however, because they are not based on an index or rate, they are not included in the ROU assets and liabilities. Variable payments for real estate leases relate primarily to common area maintenance, insurance, taxes and utilities associated with the properties. Variable payments for equipment leases relate primarily to hours, miles or other quantifiable usage factors which are not determinable at the time the lease agreement is entered into by the Company. The Company has made an accounting policy election by underlying asset class to not apply the recognition requirements of ASC 842 to short-term leases. As a result, certain leases with a term of 12 months or less are not recorded on the Consolidated Balance Sheets and expense is recognized on a straight-line basis over the lease term. \nMost leases do not contain an incremental borrowing rate which is readily determinable from their associated contract. Therefore, the Company uses its estimated incremental borrowing rate on a collateralized basis which is derived from information available at the lease commencement date, giving consideration to publicly available credit rating data, other risk characteristics and the term of the lease in determining the present value of lease payments.\nAdditional lease information is summarized below:\n2024\n2023\n2022\nComponents of Lease Expense\nOperating lease cost\n \n$\n562.4\n \n$\n528.5\n \n$\n498.0\n \nFinance lease cost:\nAmortization of right-of-use assets\n$\n0.7\n \nInterest on lease liabilities\n1.5\n \nTotal\n$\n2.2\n \n$\n—\n \n$\n—\n \nShort-term lease cost \n$\n69.6\n \n$\n58.5\n \n$\n47.1\n \nVariable lease cost\n$\n132.1\n \n$\n104.1\n \n$\n89.9\n \nSupplemental Cash Flow Information\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash outflows from operating leases\n$\n545.5\n \n$\n513.8\n \n$\n480.1\n \nOperating cash outflows from finance leases\n0.2\n \nFinancing cash outflows from finance leases\n0.2\n \nLeased assets obtained in exchange for new lease liabilities:\nOperating leases\n$\n526.9\n \n$\n473.3\n \n$\n463.1\n \nFinance leases\n188.2\n \n71\nTable of Contents\n2024\n2023\n2022\nSupplemental Balance Sheet Information\nOperating Leases:\nOperating lease right-of-use assets\n$\n1,953.8\n \n$\n1,887.4\n \n$\n1,866.8\n \nCurrent portion of operating lease liabilities\n466.6\n \n449.3\n \n425.3\n \nLong-term operating lease liabilities\n1,558.3\n \n1,509.5\n \n1,512.9\n \nFinance Leases:\nOther assets\n$\n187.5\n \nOther accruals\n3.7\n \nOther long-term liabilities\n185.6\n \nOther Supplemental Information\nWeighted average remaining lease term:\nOperating leases\n5.5\n years\n5.5\n years\n5.6\n years\nFinance leases\n43.4\n years\nWeighted average discount rate:\nOperating leases\n4.2\n \n%\n3.8\n \n%\n3.3\n \n%\nFinance leases\n5.5\n \n%\nThe following table reconciles the undiscounted cash flows for each of the next five years and thereafter to the operating and finance lease liabilities recognized on the Consolidated Balance Sheets as of December 31, 2024. The reconciliation excludes short-term leases that are not recorded on the Consolidated Balance Sheets. \nOperating Leases\nFinance Leases\nYear Ending December 31,\n2025\n$\n540.4\n \n$\n9.1\n \n2026\n466.9\n \n8.2\n \n2027\n378.7\n \n8.4\n \n2028\n289.3\n \n8.6\n \n2029\n200.5\n \n8.8\n \nThereafter\n413.3\n \n586.6\n \nTotal lease payments\n2,289.1\n \n629.7\n \nAmount representing interest\n(\n264.2\n)\n(\n440.4\n)\nPresent value of lease liabilities\n$\n2,024.9\n \n$\n189.3\n \n72\nTable of Contents\nNOTE 10 – \nOTHER LONG-TERM LIABILITIES\nEnvironmental Matters\nThe operations of the Company, like those of other companies in its industry, are subject to various domestic and foreign environmental laws and regulations. These laws and regulations not only govern current operations and products, but also impose potential liability on the Company for past operations. Management expects environmental laws and regulations to impose increasingly stringent requirements upon the Company and the industry in the future. Management believes that the Company conducts its operations in compliance with applicable environmental laws, regulations and requirements and has implemented various programs designed to protect the environment and promote continued compliance.\nThe Company is involved with environmental investigation and remediation activities at some of its currently and formerly owned sites (including sites which were previously owned and/or operated by businesses acquired by the Company). In addition, the Company, together with other parties, has been designated a potentially responsible party under federal and state environmental protection laws for the investigation and remediation of environmental contamination and hazardous waste at a number of third-party sites, primarily Superfund sites. In general, these laws provide that potentially responsible parties may be held jointly and severally liable for investigation and remediation costs regardless of fault. The Company may be similarly designated with respect to additional third-party sites in the future.\nThe Company initially provides for estimated costs of environmental-related activities relating to its past operations and third-party sites for which commitments or clean-up plans have been developed and when such costs can be reasonably estimated based on industry standards and professional judgment. These estimated costs, which are mostly undiscounted, are determined based on currently available facts regarding each site. If the reasonably estimable costs can only be identified as a range and no specific amount within that range can be determined more likely than any other amount within the range, the minimum of the range is provided.\nThe Company routinely assesses its potential liability for investigation and remediation-related activities and adjusts its environmental-related accruals as information becomes available, including as a result of sites progressing through investigation and remediation-related activities, upon which more accurate costs can be reasonably estimated and as additional accounting guidelines are issued. At December 31, 2024, 2023 and 2022, the Company had accruals reported on the Consolidated Balance Sheets as \nOther long-term liabilities\n of $\n230.3\n million, $\n230.8\n million and $\n240.2\n million, respectively. Estimated costs of current investigation and remediation activities of $\n66.4\n million, $\n88.1\n million and $\n50.2\n million are included in \nOther accruals\n on the Consolidated Balance Sheets at December 31, 2024, 2023 and 2022, respectively. \nActual costs incurred may vary from the accrued estimates due to the inherent uncertainties involved including, among others, the number and financial condition of parties involved with respect to any given site, the volumetric contribution which may be attributed to the Company relative to that attributed to other parties, the nature and magnitude of the wastes involved, the various technologies that can be used for remediation and the determination of acceptable remediation with respect to a particular site. If the Company’s future loss contingency is ultimately determined to be at the unaccrued maximum of the estimated range of possible outcomes for every site for which costs can be reasonably estimated, the Company’s accrual for environmental-related activities would be $\n93.4\n million higher than the minimum accruals at December 31, 2024. Additionally, costs for environmental-related activities may not be reasonably estimable at early stages of investigation and therefore would not be included in the unaccrued maximum amount. \nFour\n of the Company’s currently and formerly owned manufacturing sites (Major Sites) account for the majority of the accrual for environmental-related activities and the unaccrued maximum of the estimated range of possible outcomes at December 31, 2024. At December 31, 2024, $\n250.3\n million, or \n84.3\n% of the total accrual, related directly to the Major Sites. In the aggregate unaccrued maximum of $\n93.4\n million at December 31, 2024, $\n70.6\n million, or \n75.6\n%, related to the Major Sites. The significant cost components of this liability continue to be related to remedy implementation, regulatory agency interaction and project management and other costs. While different for each specific environmental situation, these components generally each account for approximately \n85\n%, \n10\n% and \n5\n%, respectively, of the accrued amount and those percentages are subject to change over time. While environmental investigations and remedial actions are in different stages at these sites, additional investigations, remedial actions and monitoring will likely be required at each site.\nThe largest and most complex of the Major Sites is the Gibbsboro, New Jersey site (Gibbsboro) which comprises the substantial majority of the environmental-related accrual. Gibbsboro, a former manufacturing plant, and related areas, which ceased operations in 1978, has had various areas included on the National Priorities List since 1999. This location has soil, sediment, surface water and groundwater contamination related to the historic operations of the facility. Gibbsboro has been divided by the Environmental Protection Agency (EPA) into \nsix\n operable units (OUs) based on location and characteristics, whose investigation and remediation efforts are likely to occur over an extended period of time. To date, the Company has completed remedy construction on \nthree\n of the \nsix\n operable units. While there are administrative tasks to be completed before final agency \n73\nTable of Contents\napproval, the remediation phase of the work for these three OUs is effectively complete and future work for these OUs is anticipated to be limited. OUs are in various phases of investigation and remediation with the EPA that provide enough information to reasonably estimate cost ranges and record environmental-related accruals. The most significant assumptions underlying the reliability and precision of remediation cost estimates for the Gibbsboro site are the type and extent of future remedies to be selected by the EPA and the costs of implementing those remedies.\nThe remaining \nthree\n Major Sites comprising the majority of the accrual include: (1) a multi-party Superfund site that (a) has received a record of decision from the federal EPA and is currently in the remedial design phase for one OU, (b) has received a record of decision from the federal EPA for an interim remedy for another OU and (c) has a remedial investigation ongoing for another OU, (2) a closed paint manufacturing facility that is in the operation and maintenance phase of remediation under both federal and state EPA programs and (3) a formerly-owned site containing warehouse and office space that is in the remedial/design investigation phase under a state EPA program. Each of these \nthree\n Major Sites are in phases of investigation and remediation that provide sufficient information to reasonably estimate cost ranges and record environmental-related accruals.\nExcluding the Major Sites discussed above, no sites are individually material to the total accrual balance. There are multiple, future events yet to occur, including further remedy selection and design, remedy implementation and execution and securing applicable governmental agency approvals, all of which have the potential to contribute to the uncertainty surrounding these future events. As these events occur and to the extent that the cost estimates of the environmental remediation change, the existing reserve will be adjusted.\nManagement cannot presently estimate the ultimate potential loss contingencies related to these sites or other less significant sites until such time as a substantial portion of the investigation at the sites is completed and remedial action plans are developed. Unasserted claims could have a material effect on the Company’s loss contingency as more information becomes available over time. At \nDecember 31, 2024\n, the Company did not have material loss contingency accruals related to unasserted claims. Management does not expect that a material portion of unrecognized loss contingencies will be recoverable through insurance, indemnification agreements or other sources. In the event any future loss contingency significantly exceeds the current amount accrued, the recording of the ultimate liability may result in a material impact on net income for the annual or interim period during which the additional costs are accrued. Moreover, management does not believe that any potential liability ultimately attributed to the Company for its environmental-related matters will have a material adverse effect on the Company’s financial condition, liquidity or cash flow due to the extended length of time during which environmental investigation and remediation takes place. An estimate of the potential impact on the Company’s operations cannot be made due to the aforementioned uncertainties.\nManagement expects these contingent environmental-related liabilities to be resolved over an extended period of time. Management is unable to provide a more specific time frame due to the indeterminate amount of time to conduct investigation activities at any site, the indeterminate amount of time to obtain environmental agency approval, as necessary, with respect to investigation and remediation activities and the indeterminate amount of time necessary to conduct remediation activities.\nAsset Retirement Obligations\nThe Asset Retirement and Environmental Obligations Topic of the ASC requires a liability to be recognized for the fair value of a conditional asset retirement obligation if a settlement date and fair value can be reasonably estimated. The Company recognizes a liability for any conditional asset retirement obligation when sufficient information is available to reasonably estimate a settlement date to determine the fair value of such a liability. The Company has identified certain conditional asset retirement obligations at various current and closed manufacturing, distribution and store facilities. These obligations relate primarily to asbestos abatement, hazardous waste Resource Conservation and Recovery Act (RCRA) closures, well abandonment, transformers and used oil disposals and underground storage tank closures. Using investigative, remediation and disposal methods that are currently available to the Company, the estimated costs of these obligations were accrued and are not significant. The recording of additional liabilities for future conditional asset retirement obligations may result in a material impact on Net income for the annual or interim period during which the costs are accrued. Management does not believe that any potential liability ultimately attributed to the Company for its conditional asset retirement obligations will have a material adverse effect on the Company’s financial condition, liquidity or cash flow due to the extended period of time over which sufficient information may become available regarding the closure or modification of any one or group of the Company’s facilities. An estimate of the potential impact on the Company’s operations cannot be made due to the aforementioned uncertainties.\n74\nTable of Contents\nReal Estate Financing\nIn December 2022, the Company closed a transaction to sell and subsequently lease back its partially-constructed new global headquarters. As a result of this transaction, the Company has entered into certain sale-leaseback agreements that do not qualify as asset sales and were accounted for as real estate financing transactions. Net proceeds are recognized within the Financing Activities section in the Statements of Consolidated Cash Flows. The Company expects to receive total proceeds approximating $\n800\n million to $\n850\n million on an incremental basis until the completion of construction of the new global headquarters. The Company expects to receive the final proceeds for the new global headquarters in the first quarter of 2025, at which point the Company will calculate the remaining obligation under the terms of the lease. \nThe following table summarizes the activity related to this transaction and the corresponding balances recognized in the Consolidated Balance Sheets.\n2024\n2023\n2022\nActivity:\nProceeds received\n$\n244.2\n \n$\n305.0\n \n$\n210.0\n \nCapitalized interest\n (1)\n45.2\n \n23.8\n \nBalances:\nShort-term liability\n (2)\n$\n49.7\n \n$\n39.9\n \n$\n20.0\n \nLong-term liability \n(3)\n715.9\n \n475.9\n \n187.0\n \nTotal liability\n$\n765.6\n \n$\n515.8\n \n$\n207.0\n \n(1)    \nInterest is capitalized within construction in progress in Property, plant and equipment, net.\n(2)    \nThe short-term portion of the liability is recorded in Other accruals.\n(3)    \nThe long-term portion of the liability is recorded in Other long-term liabilities.\nNOTE 11 – \nLITIGATION\nIn the course of its business, the Company is subject to a variety of claims and lawsuits, including, but not limited to, litigation relating to product liability and warranty, personal injury, environmental, intellectual property, commercial, contractual and antitrust claims, that are inherently subject to many uncertainties regarding the possibility of a loss to the Company. Uncertainties to which litigation is inherently subject include, among other things, costs, unpredictable court or jury decisions that could affect other litigation against the Company and encourage an increase in the number and nature of future claims and proceedings and differing laws and regulations in jurisdictions where the Company operates. These uncertainties will ultimately be resolved when one or more future events occur or fail to occur confirming the incurrence of a liability or the reduction of a liability. In accordance with the Contingencies Topic of the ASC, the Company accrues for these contingencies by a charge to income when it is both probable that one or more future events will occur confirming the fact of a loss and the amount of the loss can be reasonably estimated. In the event that the Company’s loss contingency is ultimately determined to be significantly higher than currently accrued, the recording of the additional liability may result in a material impact on the Company’s results of operations, liquidity or financial condition for the annual or interim period during which such additional liability is accrued. In those cases where no accrual is recorded because it is not probable that a liability has been incurred or the amount of any such loss cannot be reasonably estimated, any potential liability ultimately determined to be attributable to the Company may result in a material impact on the Company’s results of operations, liquidity or financial condition for the annual or interim period during which such liability is accrued. In those cases where no accrual is recorded or exposure to loss exists in excess of the amount accrued, the Contingencies Topic of the ASC requires disclosure of the contingency when there is a reasonable possibility that a loss or additional loss may have been incurred.\nDue to the uncertainties involved in litigation, management is unable to predict the outcome of the litigation identified below, the number or nature of possible future claims and proceedings or the effect that any legislation and/or administrative regulations may have on the litigation or against the Company. In addition, management cannot reasonably determine the scope or amount of the potential costs and liabilities related to such litigation, or resulting from any such legislation and regulations. With respect to the litigation identified below, the Company has only accrued for the court-approved agreement related to the California Proceedings, identified in the Public Nuisance Claim Litigation section. For the remaining litigation identified below, the Company does not believe it is probable that a loss has occurred, or the Company believes it is not possible to estimate the range of potential losses. In addition, any potential liability that may result from any changes to legislation and regulations cannot reasonably be estimated. Due to the uncertainties associated with the amount of any such liability and/or the nature of any other remedy which may be imposed in litigation, any potential liability determined to be attributable to the Company arising out of such litigation may have a material adverse effect on the Company’s results of operations, liquidity, or financial condition. An estimate of the potential impact on the Company’s results of operations, cash flow, liquidity or financial condition cannot be made due to the aforementioned uncertainties.\n75\nTable of Contents\nLead pigment and lead-based paint litigation.\n The Company’s past operations included the manufacture and sale of lead pigments and lead-based paints. The Company, along with other companies, is and has been a defendant in a number of legal proceedings arising from the manufacture and sale of lead pigments and lead-based paints. The plaintiffs’ claims have been based upon various legal theories, including negligence, strict liability, breach of warranty, negligent misrepresentations and omissions, fraudulent misrepresentations and omissions, concert of action, civil conspiracy, violations of unfair trade practice and consumer protection laws, enterprise liability, market share liability, public nuisance, unjust enrichment and other theories. The Company has also been a defendant in legal proceedings arising from the manufacture and sale of non-lead-based paints that seek recovery based upon various legal theories, including the failure to adequately warn of potential exposure to lead during surface preparation when using non-lead-based paint on surfaces previously painted with lead-based paint. Other than the California Proceedings and currently pending cases, all of these legal proceedings have been concluded in favor of the Company and other defendants at various stages in the proceedings.\nIn addition, from time to time, various legislation and administrative regulations have been enacted, promulgated or proposed to impose obligations on present and former manufacturers of lead pigments and lead-based paints respecting asserted health concerns associated with such products or to overturn the effect of court decisions in which the Company and other manufacturers have been successful. The Company is vigorously defending all lead pigment and lead-based paint litigation. The Company expects that additional lead pigment and lead-based paint litigation may be filed against the Company in the future asserting similar or different legal theories and seeking similar or different types of damages and relief. The Company will continue to vigorously defend against any additional litigation that may be filed, including utilizing all avenues of appeal, if necessary.\nPublic Nuisance Claim Litigation\n.\n The Company and other companies have been defendants in legal proceedings seeking recovery based on public nuisance liability theories, among other theories, brought by various states, cities and counties, including by the State of Rhode Island; the City of St. Louis, Missouri; various cities and counties in the State of New Jersey; various cities in the State of Ohio and the State of Ohio; the City of Chicago, Illinois; the City of Milwaukee, Wisconsin; the County of Santa Clara, California and other public entities in the State of California (the California Proceedings); and Lehigh and Montgomery Counties in Pennsylvania. Except for the California Proceedings in which the Company reached a court-approved agreement in 2019 after nearly twenty years of litigation, all of those legal proceedings have been concluded in favor of the Company and other defendants at various stages in the proceedings. Most recently, on May 7, 2024, as further described below in Wisconsin Litigation, \nthree\n plaintiffs filed amended complaints alleging, in part, public nuisance claims.  \nWisconsin Litigation\n. \nThe Company and other companies are or have been defendants in a number of legal proceedings seeking monetary damages and other relief from alleged personal injuries. The current proceedings consist of \ntwo\n federal court cases pending in the United States District Court for the Eastern District of Wisconsin (Ernest Gibson v. American Cyanamid, et al. and Deziree and Detareion Valoe v. American Cyanamid, et. al.) and \none\n case pending in Milwaukee County Circuit Court in Wisconsin (Arrieona Beal v. Hattie and Jerry Mitchell, et al.). Those matters include claims by \nfour\n individuals allegedly injured from ingestion of lead pigment or lead-containing paint while they were minors. The plaintiffs generally seek compensatory damages and have invoked Wisconsin’s risk contribution theory (which is similar to market share liability, except that liability can be joint and several) due to the plaintiff’s inability to identify the manufacturer of any product that allegedly injured the plaintiff. \nOn May 20, 2021, as a result of a decision in favor of the Company by United States Court of Appeals for the Seventh Circuit in the Ravon Owens v. American Cyanamid, et al., Cesar Sifuentes v. American Cyanamid, et al. and Glenn Burton, Jr. v. American Cyanamid, et al. cases, the Company and the \nthree\n other defendants filed motions for summary judgment to dismiss all claims of the approximately \n150\n plaintiffs then pending in the Eastern District of Wisconsin, including the claims of Gibson and the Valoes. On March 3, 2022, the district court granted summary judgment in favor of the Company and the other defendants. On September 15, 2022, the plaintiffs filed notices of appeal with the Seventh Circuit, seeking to appeal the district court’s summary judgment in favor of the Company and the other defendants. On February 9, 2024, the Seventh Circuit affirmed the district court’s summary judgment in favor of the Company and the other defendants in all cases except those filed by Gibson and the Valoes, which cases were remanded to the district court for further proceedings. Following remand of the Gibson and Valoe cases, the \nthree\n remaining plaintiffs filed amended complaints on May 7, 2024, alleging strict liability, negligence and public nuisance claims. The defendants filed motions to dismiss the plaintiffs’ amended complaints on June 20, 2024. On November 8, 2024, the district court granted in part and denied in part defendants’ motions to dismiss the amended complaints, dismissing the second cause of action for general negligence and plaintiffs’ abatement allegations, but otherwise permitting the case to proceed. On December 6, 2024, the Company and some of the other defendants filed a third-party complaint against NL Industries, Inc. (NL) and the owners and landlords of the properties where plaintiffs resided. Some of the owners and landlords filed a motion to dismiss the third-party complaints; that motion remains pending. On January 30, 2025, the district court entered a stipulated order dismissing NL pursuant to the execution of a Pierringer release between plaintiffs and NL.\n76\nTable of Contents\nIn the separate state court proceeding, on August 24, 2021, Arrieona Beal filed an amended complaint in Milwaukee County Circuit Court, naming the Company and other alleged former lead pigment manufacturers as defendants pursuant to the risk contribution liability theory. The plaintiff previously had sued her landlords. On January 3, 2024, the Company and some of the other manufacturing defendants filed a third-party complaint against NL and cross-claims against the landlord defendants. On January 10, 2024, one of the landlord defendants filed a counterclaim and cross-claim against all parties. On May 15, 2024, the plaintiff filed a motion for partial judgment on the pleadings to strike the Company and other manufacturing defendants’ affirmative defenses, and on August 6, 2024, the circuit court granted defendants’ motion to strike the plaintiff’s motion. On December 6, 2024, plaintiff filed a notice of voluntary dismissal as to landlords Hattie and Jerry Mitchell pursuant to the execution of a Pierringer release.\nInsurance Coverage Litigation.\n The Company and its liability insurers, including certain underwriters at Lloyd’s of London, initiated legal proceedings against each other to determine, among other things, whether the costs and liabilities associated with the abatement of lead pigment are covered under certain insurance policies issued to the Company. The insurers’ action, which was filed on February 23, 2006, in the Supreme Court of the State of New York, County of New York, was dismissed. The Company’s action, filed on March 3, 2006, in the Common Pleas Court, Cuyahoga County, Ohio, previously was stayed and inactive. \nOn January 9, 2019, the Company filed an unopposed motion to lift the stay with the trial court, which was granted, allowing the case to proceed to determine whether the insurers were required to indemnify the Company following the California Proceedings. On June 28, 2019, the Company and its liability insurers each filed separate motions for summary judgment seeking various forms of relief. The trial court entered an order on December 4, 2020, granting the insurers’ motion for summary judgment, denying the Company’s motion and entering final judgment in favor of the insurers. The trial court sided with the Company on all of the issues presented, except one. \nOn December 21, 2020, the Company filed a notice of appeal to the Court of Appeals of Cuyahoga County, Ohio, Eighth Appellate District, and the insurers filed cross-appeals. \nOn September 1, 2022, the appellate court reversed the trial court’s grant of summary judgment, finding in favor of the Company \non\n its appeal and against the insurers on their cross-appeal, and remanded the case to the trial court. On September 12, 2022, the insurers applied to the appellate court for reconsideration of its decision, en banc review, or certification of an appeal to the Ohio Supreme Court, which the appellate court denied. \nThe insurers subsequently filed a notice of appeal to the Ohio Supreme Court, to which the Company filed its response. On May 9, 2023, the Ohio Supreme Court accepted the insurers’ appeal. Oral argument was held on October 24, 2023. On December 10, 2024, the Ohio Supreme Court reversed the Court of Appeals and mandated judgment in favor of the insurers, holding that because the abatement-fund payment was made to prevent future harm rather than compensate for past harm, payment was not “damages” covered under the insurance policies. \nThis decision means that insurance proceeds could be unavailable under the policies at issue to mitigate past or future abatement related liabilities. The Company has not recorded a receivable related to these insurance policies or otherwise assumed that proceeds from these insurance policies would be received in estimating any contingent liability accrual within the consolidated financial statements. Therefore, this decision, without a determination of liability against the Company in the lead pigment or lead-based paint litigation will have no impact on the Company’s results of operation, liquidity or financial condition. As previously stated, except with respect to the litigation in the California Proceedings, the Company has not accrued any amounts for the lead pigment or lead-based paint litigation and any significant liability ultimately determined to be attributable to the Company relating to such litigation may result in a material impact on the Company’s results of operations, liquidity or financial condition for the annual or interim period during which such liability is accrued.\n77\nTable of Contents\nOther matters.\n On December 18, 2019, the New Jersey Department of Environmental Protection, the Commissioner of the New Jersey Department of Environmental Protection and the Administrator of the New Jersey Spill Compensation Fund (collectively, the NJ DEP) filed a lawsuit against the Company in the Superior Court of New Jersey Law Division in Camden County, New Jersey. The NJ DEP seeks to recover natural resource damages, punitive damages and litigation fees and costs, as well as other costs, damages, declaratory relief and penalties pursuant to New Jersey state statutes and common law theories in connection with the alleged discharge of hazardous substances and pollutants at the Company’s Gibbsboro, New Jersey site, a former manufacturing plant and related facilities. Following expert discovery, on November 20, 2024, the Company filed a motion in the United States District Court for the District of New Jersey seeking to enforce the terms of an April 2019 Remedial Design/Remedial Action Consent Decree between the Company and the United States Environmental Protection Agency (the Consent Decree) that is being attacked by the NJ DEP’s state court lawsuit. On December 21, 2024, the United States filed a brief in opposition to the Company’s motion, to which the Company filed a reply brief. The Company’s motion regarding the Consent Decree remains pending in federal court. Meanwhile, on November 20, 2024, the Company filed a motion to stay the state court proceedings pending resolution of the Company’s motion regarding the Consent Decree. On December 19, 2024, the state court denied the Company’s stay motion, but suspended all then-pending dates in the court’s schedule, including the previous trial date of March 10, 2025, until an ongoing discovery dispute between the Company and the NJ DEP is resolved. On December 20, 2024, the NJ DEP filed a motion for partial summary judgment seeking to find the Company liable under the Spill Act and Solid Waste Management Act. On January 31, 2025, the state court denied the NJ DEP’s motion for partial summary judgment. On February 6, 2025, the state court sent an automated notice re-setting the trial for March 10, 2025. Upon the parties’ request seeking clarification regarding the schedule, there is a status conference with the state court set for February 18, 2025.  \nIn July 2024, a third-party assurance, testing, inspection and certification provider changed its listing for one of the Company’s protective coatings products, an intumescent coating used for fire protection of steel beam assemblies. The Company has received claims regarding this matter and is working with its customers and end users to assist in understanding the potential impacts of the listing change, including the extent of potential remedial action that may involve the application of additional product. The Company’s review of this matter is ongoing. Except for an immaterial product warranty liability which remains recorded on the Consolidated Balance Sheets as of December 31, 2024, any additional amount or range of potential loss cannot be reasonably estimated at this time.\nNOTE 12 – \nSHAREHOLDERS’ EQUITY\nCapital Stock\nAt December 31, 2024, there were \n900,000,000\n shares of common stock and \n30,000,000\n shares of serial preferred stock authorized for issuance. Of the authorized serial preferred stock, \n3,000,000\n shares are designated as cumulative redeemable serial preferred stock. There we no shares of serial preferred stock issued during 2024, 2023 or 2022.\nUnder the 2006 Equity and Performance Incentive Plan (2006 Employee Plan), \n71,100,000\n shares may be issued or transferred. An aggregate of \n13,603,814\n, \n15,830,386\n and \n17,939,143\n shares of common stock at December 31, 2024, 2023 and 2022, respectively, were reserved for the exercise and future grants of option rights and future grants of restricted stock and restricted stock units. See Note 14 for additional information related to stock-based compensation. \nShares outstanding shown in the following table included \n1,426,883\n shares of common stock held in a revocable trust at December 31, 2024, 2023 and 2022. The revocable trust is used to accumulate assets for the purpose of funding the ultimate obligation of certain non-qualified benefit plans. Transactions between the Company and the trust are accounted for in accordance with the Deferred Compensation – Rabbi Trusts Subtopic of the Compensation Topic of the ASC, which requires the assets held by the trust be consolidated with the Company’s accounts.\n78\nTable of Contents\nShares\nin Treasury\nShares\nOutstanding\nBalance at January 1, 2022\n11,313,634\n \n261,143,805\n \nShares issued for exercise of option rights\n778,075\n \nShares tendered as payment for option rights exercised\n3,861\n \n(\n3,861\n)\nShares issued for vesting of restricted stock units\n357,832\n \nShares tendered in connection with vesting of restricted stock units\n124,852\n \n(\n124,852\n)\nTreasury stock purchased\n3,350,000\n \n(\n3,350,000\n)\nTreasury stock sold \n(1)\n(\n75,000\n)\n75,000\n \nBalance at December 31, 2022\n14,717,347\n \n258,875,999\n \nShares issued for exercise of option rights\n1,081,815\n \nShares tendered as payment for option rights exercised\n10,467\n \n(\n10,467\n)\nShares issued for vesting of restricted stock units\n302,713\n \nShares tendered in connection with vesting of restricted stock units\n106,770\n \n(\n106,770\n)\nTreasury stock purchased\n5,600,000\n \n(\n5,600,000\n)\nBalance at December 31, 2023\n20,434,584\n \n254,543,290\n \nShares issued for exercise of option rights\n1,879,285\n \nShares tendered as payment for option rights exercised\n11,884\n \n(\n11,884\n)\nShares issued for vesting of restricted stock units\n122,276\n \nShares tendered in connection with vesting of restricted stock units\n41,867\n \n(\n41,867\n)\nTreasury stock purchased\n5,200,000\n \n(\n5,200,000\n)\nBalance at December 31, 2024\n25,688,335\n \n251,291,100\n \n(1)\n    During the year ended December 31, 2022, the Company sold treasury shares to fund Company contributions to the domestic defined contribution plan. The related proceeds were $\n22.0\n million.\nDividends\nThe following table summarizes the dividends declared and paid on common stock:\n2024\n2023\n2022\nCash dividend per share\n$\n2.86\n \n$\n2.42\n \n$\n2.40\n \nTotal dividends (in millions)\n723.4\n \n623.7\n \n618.5\n \nTreasury Stock\nThe Company acquires its common stock for general corporate purposes through its publicly announced share repurchase program. As of December 31, 2024, the Company had remaining authorization from its Board of Directors to purchase \n34.4\n million shares of its common stock. \nThe table below summarizes the Company’s share repurchase activity:\n2024\n2023\n2022\nTreasury stock purchases (in millions)\n$\n1,738.8\n \n$\n1,432.0\n \n$\n883.2\n \nTreasury stock purchases (shares)\n5,200,000\n \n5,600,000\n \n3,350,000\n \nAverage price per share\n$\n334.38\n \n$\n255.72\n \n$\n263.64\n \nNOTE 13 – \nDEFINED CONTRIBUTION SAVINGS PLAN\nAs of December 31, 2024, \n44,917\n employees contributed to the Company’s defined contribution savings plan, voluntary to all eligible salaried employees and any employee in a group of employees to which coverage has been extended on a non-discriminatory basis by the plan’s Administration Committee. Participants are allowed to contribute, on a pretax or after-tax basis, up to the lesser of \nfifty\n percent of their annual compensation or the maximum dollar amount allowed under the Internal Revenue Code. The Company matches \none hundred\n percent of all contributions up to \nsix\n percent of eligible employee contributions. Such participant contributions may be invested in a variety of investment funds or a Company common stock \n79\nTable of Contents\nfund and may be exchanged between investments as directed by the participant. Participants are permitted to diversify both future and prior Company matching contributions previously allocated to the Company common stock fund into a variety of investment funds. \nThe Company made contributions to the defined contribution savings plan on behalf of participating employees, representing amounts authorized by employees to be withheld from their earnings, of $\n279.6\n million, $\n260.5\n million and $\n240.1\n million in 2024, 2023 and 2022, respectively. The Company’s matching contributions to the defined contribution savings plan charged to operations were $\n165.1\n million, $\n153.9\n million and $\n140.0\n million for 2024, 2023 and 2022, respectively. \nAt December 31, 2024, there were \n16,771,640\n shares of the Company’s common stock being held by the defined contribution savings plan, representing \n6.7\n% of the total number of voting shares outstanding. Shares of Company common stock credited to each member’s account under the defined contribution savings plan are voted by the trustee under instructions from each individual plan member. Shares for which no instructions are received are voted by the trustee in the same proportion as those for which instructions are received.\nNOTE 14 – \nSTOCK-BASED COMPENSATION\nThe 2006 Employee Plan authorizes the Board of Directors, or a committee of the Board of Directors, to issue or transfer up to an aggregate of \n71,100,000\n shares of common stock, plus any shares relating to awards that expire, are forfeited or canceled. The Company issues new shares upon exercise of option rights (options) and vesting of restricted stock units (RSUs). The 2006 Employee Plan permits the granting of options, appreciation rights, restricted stock, RSUs, performance shares and performance units to eligible employees. At December 31, 2024, \nno\n appreciation rights, performance shares or performance units had been granted under the 2006 Employee Plan. Shares available for future grants under the 2006 Employee Plan were \n5,458,273\n at December 31, 2024. \nThe 2006 Stock Plan for Nonemployee Directors (Nonemployee Director Plan) authorizes the Board of Directors, or a committee of the Board of Directors, to issue or transfer up to an aggregate of \n600,000\n shares of common stock, plus any shares relating to awards that expire, are forfeited or canceled. The Nonemployee Director Plan permits the granting of options, appreciation rights, restricted stock and RSUs to members of the Board of Directors who are not employees of the Company. At December 31, 2024, \nno\n options or appreciation rights had been granted under the Nonemployee Director Plan. Shares available for future grants under the Nonemployee Director Plan were \n210,675\n at December 31, 2024.\nAt December 31, 2024, the Company had total unrecognized stock-based compensation expense of $\n192.7\n million that is expected to be recognized over a weighted-average period of \n1.08\n years. \n2024\n2023\n2022\nStock-based compensation expense\n$\n138.1\n \n$\n115.9\n \n$\n99.7\n \nIncome tax benefit recognized\n34.1\n \n28.6\n \n24.6\n \nExcess tax benefits from share-based payments are recognized as an income tax benefit in the Statements of Consolidated Income when options are exercised and RSUs vest. For the years ended December 31, 2024, 2023 and 2022, the Company’s excess tax benefit from options exercised and RSUs vested reduced the income tax provision by $\n73.0\n million, $\n35.7\n million and $\n35.4\n million, respectively. \nOptions\nThe fair value of the Company’s options was estimated at the date of grant using a Black-Scholes-Merton option-pricing model with the following weighted-average assumptions for all options granted:\n2024\n2023\n2022\nRisk-free interest rate\n3.93\n \n%\n4.57\n \n%\n4.00\n \n%\nExpected life of options\n5.02\n years\n5.02\n years\n5.05\n years\nExpected dividend yield of stock\n.83\n \n%\n.94\n \n%\n.92\n \n%\nExpected volatility of stock\n27.5\n \n%\n29.3\n \n%\n31.6\n \n%\n80\nTable of Contents\nThe risk-free interest rate is based upon the U.S. Treasury yield curve at the time of grant. The expected life of options was calculated using a scenario analysis model. Historical data was used to aggregate the holding period from actual exercises, post-vesting cancellations and hypothetical assumed exercises on all outstanding options. The expected dividend yield of stock is the Company’s best estimate of the expected future dividend yield. Expected volatility of stock was calculated using historical and implied volatilities. \nGrants of non-qualified and incentive stock options have been awarded to certain officers and key employees under the 2006 Employee Plan. The options generally become exercisable to the extent of one-third of the optioned shares for each full year following the date of grant and generally expire \nten years\n after the date of grant. Unrecognized compensation expense with respect to options granted to eligible employees amounted to $\n116.4\n million at December 31, 2024. The unrecognized compensation expense is being amortized on a straight-line basis over the \nthree-year\n vesting period, net of estimated forfeitures based on historical activity, and is expected to be recognized over a weighted-average period of \n1.14\n years.\nThe following table summarizes the Company’s option activity:\nOptioned\nShares\nWeighted\nAverage\nExercise\nPrice\nPer Share\nAggregate\nIntrinsic\nValue\nWeighted Average Remaining Term\n(in Years)\nOutstanding at January 1, 2024\n8,925,011\n \n$\n175.70\n \n$\n1,215.6\n \n5.64\nGranted\n939,699\n \n376.90\n \nExercised\n(\n1,871,201\n)\n131.48\n \nForfeited\n(\n53,373\n)\n254.48\n \nExpired\n(\n5,270\n)\n202.79\n \nOutstanding at December 31, 2024\n7,934,866\n \n209.39\n \n$\n1,074.4\n \n5.69\nExercisable at December 31, 2024\n6,054,247\n \n$\n178.95\n \n$\n974.6\n \n4.64\nThe following table summarizes fair value and intrinsic value information for option activity:\n2024\n2023\n2022\nWeighted average grant date fair value per share\n$\n109.05\n \n$\n77.08\n \n$\n69.82\n \nTotal fair value of options vested\n66.8\n \n61.3\n \n57.9\n \nTotal intrinsic value of options exercised\n402.7\n \n170.6\n \n125.4\n \nRSUs\nThe fair value of each RSU is equal to the market value of a share of the Company’s stock on the grant date. Grants of time-based RSUs, which generally require \nthree years\n of continuous employment from the date of grant before vesting and receiving the stock without restriction, have been awarded to certain officers and key employees under the 2006 Employee Plan. The February 2024, 2023 and 2022 grants of performance-based RSUs vest at the end of a \nthree-year\n period based on the Company’s achievement of specified financial and operating performance goals relating to earnings per share and return on net assets employed. \nUnrecognized compensation expense with respect to grants of RSUs to eligible employees amounted to $\n74.4\n million at December 31, 2024. The unrecognized compensation expense is being amortized on a straight-line basis over the vesting period and is expected to be recognized over a weighted-average period of \n0.82\n years.\nGrants of RSUs have been awarded to nonemployee directors under the Nonemployee Director Plan. These grants generally vest and stock is received without restriction to the extent of one-third of the RSUs for each year following the date of grant. Unrecognized compensation expense with respect to grants of RSUs to nonemployee directors amounted to $\n1.9\n million at December 31, 2024. The unrecognized compensation expense is being amortized on a straight-line basis over the \nthree-year\n vesting period and is expected to be recognized over a weighted-average period of \n0.90\n years.\n81\nTable of Contents\nThe following table summarizes the Company’s RSU activity:\nNumber of RSUs\nWeighted Average Grant Date  Fair Value Per Share\nAggregate\nIntrinsic\nValue\nWeighted Average Remaining Term\n(in Years)\nOutstanding at January 1, 2024\n434,874\n \n$\n244.21\n \n$\n135.6\n \n1.26\nGranted \n124,667\n \n305.50\n \nVested\n(\n122,276\n)\n239.14\n \nForfeited\n(\n4,251\n)\n251.80\n \nOutstanding at December 31, 2024\n433,014\n \n \n$\n265.03\n \n$\n147.2\n \n1.18\nThe following table summarizes the fair value and intrinsic value information for RSU activity:\n2024\n2023\n2022\nWeighted average grant date fair value per share\n$\n305.50\n \n$\n232.22\n \n$\n271.75\n \nIntrinsic value of RSUs vested during year\n38.4\n \n68.5\n \n97.5\n \nNOTE 15 – \nACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS)\nThe components of AOCI, including the reclassification adjustments for items that were reclassified from AOCI to Net income, are shown below.\nForeign Currency Translation Adjustments \n(1)\nPension and Other Postretirement Benefits Adjustments \n(2)\nUnrealized Net Gains on Cash Flow Hedges \n(3)\nTotal\nBalance at January 1, 2022\n$\n(\n702.1\n)\n$\n(\n32.2\n)\n$\n35.9\n \n$\n(\n698.4\n)\nAmounts recognized in AOCI\n(\n108.7\n)\n106.8\n \n(\n1.9\n)\nAmounts reclassified from AOCI\n3.7\n \n(\n4.0\n)\n(\n0.3\n)\nBalance at December 31, 2022\n(\n810.8\n)\n78.3\n \n31.9\n \n(\n700.6\n)\nAmounts recognized in AOCI\n93.9\n \n3.9\n \n97.8\n \nAmounts reclassified from AOCI\n(\n17.9\n)\n(\n3.6\n)\n(\n21.5\n)\nBalance at December 31, 2023\n(\n716.9\n)\n64.3\n \n28.3\n \n(\n624.3\n)\nAmounts recognized in AOCI\n(\n256.0\n)\n23.0\n \n(\n233.0\n)\nAmounts reclassified from AOCI\n(\n14.2\n)\n(\n3.7\n)\n(\n17.9\n)\nBalance at December 31, 2024\n$\n(\n972.9\n)\n$\n73.1\n \n$\n24.6\n \n$\n(\n875.2\n)\n \n(1)    \nIncludes changes in the fair value of cross currency swap contracts of $\n53.6\n million, $(\n24.9\n) million and $\n34.1\n million in 2024, 2023 and 2022, respectively. See Note 16.\n(2)    \nNet of taxes of $(\n2.0\n) million, $\n3.1\n million and $(\n35.0\n) million in 2024, 2023 and 2022, respectively. See Note 8.\n(3)    \nNet of taxes of $\n1.2\n million in 2024 and 2023 and $\n1.1\n million in 2022. See Statements of Consolidated Comprehensive Income.\n82\nTable of Contents\nNOTE 16 – \nDERIVATIVES AND HEDGING\nNet Investment Hedges\nThe Company has entered into U.S. dollar to euro cross currency swap contracts with various counterparties to hedge the Company’s net investment in its European operations. During the term of the contracts, the Company will pay fixed-rate interest in euros and receive fixed-rate interest in U.S. dollars, thereby effectively converting a portion of the Company's U.S. dollar denominated fixed-rate debt to euro denominated fixed-rate debt. \nThe outstanding contracts as of December 31, 2024 are summarized by maturity date in the table below.\nNotional Value\nMaturity Date\n$\n200.0\n \nAugust 8, 2025\n687.7\n \nJune 1, 2027\n100.0\n \nMarch 1, 2028\n525.0\n \nAugust 15, 2029\n100.0\n \nSeptember 1, 2031\n$\n1,612.7\n \nIn August 2024, the Company settled its $\n150.0\n million U.S. dollar to euro cross currency swap contract entered into on March 28, 2023. In May 2024, the Company settled its $\n500.0\n million U.S. dollar to euro cross currency swap contract entered into on February 13, 2020. At the time of both of these settlements, an immaterial unrealized loss was recognized in AOCI.\nIn December 2023, the Company settled its $\n100.0\n million U.S. dollar to euro cross currency swap contract entered into on August 1, 2023. At the time of settlement, an immaterial unrealized gain was recognized in AOCI.\nThe following table summarizes the balance sheet location of the cross currency swap contracts. See Note 17 for additional information on the fair value of these contracts. \nDecember 31,\nDecember 31,\nDecember 31,\n2024\n2023\n2022\nOther current assets\n$\n9.4\n \n$\n—\n \n$\n—\n \nOther assets\n39.5\n \n—\n \n9.1\n \nOther accruals\n—\n \n12.0\n \n—\n \nOther long-term liabilities\n—\n \n12.4\n \n—\n \nThe changes in fair value of the cross currency swap contracts are recognized in the foreign currency translation adjustments component of AOCI. See Note 15. \nThe following table summarizes the unrealized gains (losses) for the years ended December 31:\n2024\n2023\n2022\nGains (losses)\n$\n71.2\n \n$\n(\n33.1\n)\n$\n45.2\n \nTax effect\n(\n17.6\n)\n8.2\n \n(\n11.1\n)\nGains (losses), net of taxes\n$\n53.6\n \n$\n(\n24.9\n)\n$\n34.1\n \nDerivatives Not Designated as Hedging Instruments\nThe Company enters into foreign currency option and forward contracts with maturity dates less than twelve months primarily to hedge against value changes in foreign currency. The related gains and losses are recorded in Other (income) expense - net. See Note 19 for further details.\n \n83\nTable of Contents\nNOTE 17 – \nFAIR VALUE MEASUREMENTS\nThe Fair Value Measurements and Disclosures Topic of the ASC applies to the Company’s financial and non-financial assets and liabilities. The guidance applies when other standards require or permit the fair value measurement of assets and liabilities. Under the guidance, assets and liabilities measured at fair value are categorized as follows:\nLevel 1: Quoted prices in active markets for identical assets\nLevel 2: Significant other observable inputs\nLevel 3: Significant unobservable inputs\nThere were no assets and liabilities measured at fair value on a recurring basis classified as Level 3 at December 31, 2024, 2023 and 2022. Except for the acquisition-related fair value measurements and assets held for sale prior to divestiture of the China architectural business described in Note 3 and the reporting unit impairment analysis and trademark quantitative impairment test described in Note 6, there were no assets and liabilities measured at fair value on a nonrecurring basis. \nThe following table summarizes the Company’s assets and liabilities measured at fair value on a recurring basis, categorized using the fair value hierarchy. \nDecember 31, 2024\nDecember 31, 2023\nDecember 31, 2022\nTotal\nLevel 1\nLevel 2\nTotal\nLevel 1\nLevel 2\nTotal\nLevel 1\nLevel 2\nAssets:\nDeferred compensation plan\n$\n98.6\n \n$\n98.6\n \n$\n—\n \n$\n84.7\n \n$\n84.7\n \n$\n74.1\n \n$\n43.7\n \n$\n30.4\n \nQualified replacement plan\n—\n \n—\n \n29.8\n \n29.8\n \nNet investment hedges\n48.9\n \n48.9\n \n—\n \n9.1\n \n9.1\n \n$\n147.5\n \n$\n98.6\n \n$\n48.9\n \n$\n84.7\n \n$\n84.7\n \n$\n—\n \n$\n113.0\n \n$\n73.5\n \n$\n39.5\n \nLiabilities:\nNet investment hedges\n$\n—\n \n$\n24.4\n \n$\n24.4\n \n$\n—\n \nThe deferred compensation plan assets consist of the investment funds maintained for future payments under the Company’s executive deferred compensation plans, which are structured as rabbi trusts. The investments are marketable securities accounted for under the Debt and Equity Securities Topic of the ASC. The level 1 investments are valued using quoted market prices multiplied by the number of shares. The level 2 investments are valued based on vendor or broker models. There was $\n7.0\n million and $\n6.4\n million of deferred compensation plan assets held in partnership funds measured using NAV (or its equivalent) as a practical expedient as of December 31, 2024 and 2023, respectively. These investments are not classified in the fair value hierarchy. The cost basis of all investments within the deferred compensation plan and qualified replacement plan was $\n82.7\n million, $\n76.3\n million and $\n67.2\n million at December 31, 2024, 2023 and 2022, respectively.\nThe qualified replacement plan assets consisted of investment funds maintained for future contributions to the Company’s domestic defined contribution pension plan. See Note 8. During 2023, the remaining balance was fully utilized to fund the Company’s domestic defined contribution pension plan. The cost basis of the investment funds was $\n29.8\n million at December 31, 2022.\nThe net investment hedge asset and liability represent the fair value of the cross currency swaps. See Note 16. The fair value is based on a valuation model that uses observable inputs, including interest rate curves and the euro foreign currency rate.\nThe carrying amounts reported for Cash and cash equivalents and Short-term borrowings approximate fair value.\nThe fair value of the Company’s publicly traded debt is based on quoted market prices. The fair value of the Company’s non-publicly traded debt is estimated using discounted cash flow analyses, based on the Company’s current incremental borrowing rates for similar types of borrowing arrangements. The Company’s publicly traded debt and non-traded debt are classified as level 1 and level 2, respectively, in the fair value hierarchy. \nThe following table summarizes the carrying amounts and fair values of the Company’s publicly traded debt and non-traded debt. \n84\nTable of Contents\n \nDecember 31,\n \n2024\n2023\n2022\nCarrying \nAmount\nFair\nValue\nCarrying Amount\nFair\nValue\nCarrying Amount\nFair \nValue\nPublicly traded debt\n$\n9,225.8\n \n$\n8,172.8\n \n$\n9,475.8\n \n$\n8,615.1\n \n$\n9,590.0\n \n$\n8,382.3\n \nNon-traded debt\n0.2\n \n0.2\n \n0.9\n \n0.8\n \n1.6\n \n1.5\n \nNOTE 18 – \nREVENUE\nThe Company manufactures and sells paint, stains, supplies, equipment and floor covering through company-operated stores, branded and private label products through retailers and a broad range of industrial coatings directly to global manufacturing customers through company-operated branches. A large portion of the Company’s revenue is recognized at a point in time and made to customers who are not engaged in a long-term supply agreement or any form of contract with the Company. These sales are paid for at the time of sale in cash, credit card or on account with the vast majority of customers having terms between \n30 and 60 days\n, not to exceed one year. Many customers who purchase on account take advantage of early payment discounts offered by paying within 30 days of being invoiced. The Company estimates variable consideration for these sales on the basis of both historical information and current trends to estimate the expected amount of discounts to which customers are likely to be entitled.\nThe remaining revenue is governed by long-term supply agreements and related purchase orders (contracts) that specify shipping terms and aspects of the transaction price including rebates, discounts and other sales incentives, such as advertising support. Contracts are at standalone pricing. The performance obligation in these contracts is determined by each of the individual purchase orders and the respective stated quantities, with revenue being recognized at a point in time when obligations under the terms of the agreement are satisfied. This generally occurs with the transfer of control of our products to the customer. Sales, value add and other taxes we collect concurrent with revenue-producing activities are excluded from revenue. \nSee Note 22 for the Company’s disaggregation of Net sales by Reportable Segment. As the Reportable Segments are aligned by similar economic factors, trends and customers, this disaggregation best depicts how the nature, amount, timing and uncertainty of revenue and cash flows are affected by economic factors. Approximately \n80\n% of the Company’s net external sales are in the Company’s North America region (which is comprised of the United States, Canada and the Caribbean region), slightly less than \n10\n% in the EMEAI region (Europe, Middle East, Africa and India), with the remaining global regions accounting for the residual balance. No individual country outside of the United States is individually significant.\nThe Company has made payments or given credits for various incentives at the beginning of a long-term contract where future revenue is expected and before satisfaction of performance obligations. Under these circumstances, the Company recognizes a contract asset and amortizes these prepayments over the expected benefit life of the long-term contract, typically on a straight-line basis. \nThe majority of variable consideration in the Company’s contracts include volume rebates, discounts and other incentives, where the customer receives a retrospective percentage rebate based on the amount of their purchases. In these situations, the rebates are accrued as a fixed percentage of sales and recorded as a reduction of Net sales until paid to the customer per the terms of the contract. Forms of variable consideration such as tiered rebates, whereby a customer receives a retrospective price decrease dependent on the volume of their purchases, are calculated using a forecasted percentage to determine the most likely amount to accrue. Management creates a baseline calculation using historical sales and then utilizing forecast information, estimates the anticipated sales volume each quarter to calculate the expected reduction to Net sales. The remainder of the transaction price is fixed as agreed upon with the customer, limiting estimation of revenues, including constraints. \nThe Company’s Accounts receivable and current and long-term contract assets and liabilities are summarized in the following table.\n85\nTable of Contents\nAccounts Receivable, Less Allowance\nContract Assets (Current)\nContract Assets (Long-Term)\nContract Liabilities (Current)\nContract Liabilities (Long-Term)\nBalance sheet caption:\nAccounts receivable\nOther current assets\nOther assets\nOther accruals\nOther liabilities\nBalance at December 31, 2023\n$\n2,467.9\n \n$\n46.2\n \n$\n151.7\n \n$\n365.7\n \n$\n3.8\n \nBalance at December 31, 2024\n2,388.8\n \n55.0\n \n231.0\n \n386.2\n \n1.6\n \nThe difference between the opening and closing balances of the Company’s contract assets and contract liabilities primarily results from the timing difference between the contractual performance obligation and the associated payment. \nProvisions for estimated returns are established and the expected costs continue to be recognized as contra-revenue per ASC 606 when the products are sold. The Company only offers an assurance type warranty on products sold, and there is no material service to the customer beyond fixing defects that existed at the time of sale and no warranties are sold separately. \nWarranty liabilities are excluded from the table above. Amounts recognized during the year from deferred revenue were not material. The Company records a right of return liability within each of its operations to accrue for expected customer returns. Historical actual returns are used to estimate future returns as a percentage of current sales. Obligations for returns and refunds were not material individually or in the aggregate.\nAllowance for Current Expected Credit Losses\nThe following table summarizes the movement in the Company’s allowance for current expected credit losses:\n2024\n2023\n2022\nBeginning balance\n$\n59.6\n \n$\n56.6\n \n$\n48.9\n \nBad debt expense\n69.5\n \n67.9\n \n65.3\n \nUncollectible accounts written off, net of recoveries\n(\n68.7\n)\n(\n64.9\n)\n(\n57.6\n)\nEnding balance\n$\n60.4\n \n$\n59.6\n \n$\n56.6\n \nNOTE 19 – \nOTHER (INCOME) EXPENSE \nOther General (Income) Expense - Net \nIncluded in Other general (income) expense - net were the following:\n2024\n2023\n2022\nProvisions for environmental matters - net\n$\n(\n1.3\n)\n$\n80.7\n \n$\n(\n7.1\n)\nGain on divestiture of business (see Note 3)\n—\n \n(\n20.1\n)\n—\n \n(Gain) loss on sale or disposition of assets\n(\n49.9\n)\n0.9\n \n(\n17.8\n)\nOther\n12.4\n \n5.6\n \n—\n \nTotal\n$\n(\n38.8\n)\n$\n67.1\n \n$\n(\n24.9\n)\nProvisions for environmental matters – net represent initial provisions for site-specific estimated costs of environmental investigation or remediation and increases or decreases to environmental-related accruals as information becomes available upon which more accurate costs can be reasonably estimated and as additional accounting guidelines are issued. Provisions for environmental matters - net for the year ended December 31, 2024 included an immaterial amount of insurance proceeds related to environmental cleanup at a current manufacturing site. See Note 10 for further details on the Company’s environmental-related activities.\nThe (gain) loss on sale or disposition of assets represents the net realized (gain) loss associated with the sale or disposal of property, plant and equipment and intangible assets previously used in the conduct of the primary business of the Company. (Gain) loss on sale or disposition of assets for the year ended December 31, 2024 included an immaterial amount of insurance proceeds related to a current manufacturing site.\n86\nTable of Contents\nOther (Income) Expense - Net \nIncluded in Other (income) expense - net were the following:\n2024\n2023\n2022\nInvestment (gains) losses\n$\n(\n16.9\n)\n$\n(\n22.9\n)\n$\n9.7\n \nLoss on extinguishment of debt (see Note 7)\n—\n \n12.8\n \n—\n \nNet expense from banking activities\n15.7\n \n15.0\n \n12.2\n \nForeign currency transaction related losses - net\n3.9\n \n80.5\n \n33.6\n \nMiscellaneous pension and benefit (income) expense\n(\n13.1\n)\n(\n21.1\n)\n4.0\n \nOther income\n(\n69.8\n)\n(\n48.5\n)\n(\n39.6\n)\nOther expense\n35.5\n \n49.7\n \n27.1\n \nTotal\n$\n(\n44.7\n)\n$\n65.5\n \n$\n47.0\n \nInvestment (gains) losses primarily relate to the change in market value of the investments held in the deferred compensation plan. See Note 17 for additional information on the fair value of these investments. \nForeign currency transaction related losses - net include the impact from foreign currency transactions, including from highly inflationary economies such as Argentina, and net realized losses from foreign currency option and forward contracts. See Note 16 for further details regarding these foreign currency contracts.\nMiscellaneous pension and benefit (income) expense consists of the non-service components of net periodic pension and benefit cost (credit). See Note 8.\nOther income and other expense included items of revenue, gains, expenses and losses that were unrelated to the primary business purpose of the Company. There were no items within other income or other expense that were individually significant at December 31, 2024, 2023 and 2022.\nNOTE 20 – \nINCOME TAXES\nSignificant components of the provisions for income taxes were as follows:\n2024\n2023\n2022\nCurrent:\nFederal\n$\n558.0\n \n$\n553.4\n \n$\n505.5\n \nForeign\n155.1\n \n147.6\n \n90.3\n \nState and local\n132.2\n \n109.0\n \n102.0\n \nTotal current\n845.3\n \n810.0\n \n697.8\n \nDeferred:\nFederal\n(\n54.8\n)\n(\n39.9\n)\n(\n81.7\n)\nForeign\n(\n15.8\n)\n(\n51.5\n)\n(\n47.3\n)\nState and local\n(\n4.3\n)\n2.5\n \n(\n15.8\n)\nTotal deferred\n(\n74.9\n)\n(\n88.9\n)\n(\n144.8\n)\nTotal provisions for income taxes\n$\n770.4\n \n$\n721.1\n \n$\n553.0\n \n87\nTable of Contents\nA reconciliation of the statutory federal income tax rate to the effective tax rate follows: \n2024\n2023\n2022\nStatutory federal income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nEffect of:\nState and local income taxes\n3.2\n \n3.0\n \n2.8\n \nInvestment vehicles\n(\n0.5\n)\n(\n0.5\n)\n(\n0.4\n)\nEmployee share-based payments\n(\n2.1\n)\n(\n1.1\n)\n(\n1.4\n)\nResearch and development credits\n(\n0.3\n)\n(\n0.4\n)\n(\n0.6\n)\nAmended returns and refunds\n(\n0.2\n)\n0.2\n \n0.4\n \nTaxes on non-U.S. earnings\n1.1\n \n0.8\n \n0.2\n \nOther - net\n0.1\n \n0.2\n \n(\n0.5\n)\nReported effective tax rate\n22.3\n \n%\n23.2\n \n%\n21.5\n \n%\nThe decrease in the effective tax rate for 2024 compared to 2023 was primarily related to a more favorable impact from tax benefits related to employee share-based payments. The other significant components of the Company’s effective tax rate were consistent year-over-year.\nSignificant components of income before income taxes as used for income tax purposes, were as follows:\n2024\n2023\n2022\nDomestic\n$\n3,046.6\n \n$\n2,817.0\n \n$\n2,427.6\n \nForeign\n405.2\n \n292.9\n \n145.5\n \n$\n3,451.8\n \n$\n3,109.9\n \n$\n2,573.1\n \n \nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes using the enacted tax rates and laws that are currently in effect. \nSignificant components of the Company’s deferred tax assets and liabilities as of December 31, 2024, 2023 and 2022 were as follows:\n2024\n2023\n2022\nDeferred tax assets:\nEnvironmental and other similar items\n$\n66.8\n \n$\n72.0\n \n$\n66.4\n \nEmployee related and benefit items\n175.2\n \n162.1\n \n157.1\n \nOperating lease liabilities\n499.6\n \n483.2\n \n478.1\n \nResearch and development capitalization\n103.9\n \n81.5\n \n52.6\n \nOther items \n206.5\n \n205.6\n \n204.1\n \nTotal deferred tax assets\n1,052.0\n \n1,004.4\n \n958.3\n \nDeferred tax liabilities:\nIntangible assets and Property, plant and equipment\n948.7\n \n1,001.1\n \n973.4\n \nLIFO inventories\n120.5\n \n115.2\n \n97.3\n \nOperating lease right-of-use assets\n482.1\n \n465.6\n \n460.5\n \nOther items \n40.7\n \n28.6\n \n31.7\n \nTotal deferred tax liabilities\n1,592.0\n \n1,610.5\n \n1,562.9\n \nNet deferred tax liabilities \n$\n540.0\n \n$\n606.1\n \n$\n604.6\n \nNetted against the Company’s other deferred tax assets were valuation allowances of $\n124.5\n million, $\n106.6\n million and $\n97.5\n million at December 31, 2024, 2023 and 2022, respectively. The Company has $\n13.5\n million of domestic net operating loss carryforwards acquired through acquisitions that have expiration dates through tax year 2037, foreign tax credits of $\n34.9\n million that expire in calendar years 2028 through 2034 and foreign net operating losses of $\n339.1\n million. The foreign net \n88\nTable of Contents\noperating losses are related to various jurisdictions that provide for both indefinite carryforward periods and others with carryforward periods that expire between tax years 2024 to 2034.\nThe Company and its subsidiaries file income tax returns in the U.S. federal jurisdiction and various state and foreign jurisdictions. The Company finalized the IRS audit for the 2013 through 2016 income tax returns in 2023 and paid the related assessments in the fourth quarter of 2023 and first quarter of 2024. The Company finalized the IRS audit for the 2011 income tax return in 2023 and paid the tax assessment in the second quarter of 2024 and the interest assessment in the third quarter of 2024. The Company finalized the IRS audit for the 2017 through 2019 income tax returns in the fourth quarter of 2024 and expects to pay the tax and interest assessment in the first quarter of 2025. The IRS plans to start its next audit cycle of the Company’s 2020 through 2022 income tax returns in 2025. As of December 31, 2024, the federal statute of limitations has not expired for the 2017 through 2024 tax years.\nAs of December 31, 2024, the Company is subject to non-U.S. income tax examinations for the tax years of 2015 through 2024. In addition, the Company is subject to state and local income tax examinations for the tax years 2017 through 2024.\nA reconciliation of the beginning and ending amount of unrecognized tax benefits is as follows:\n2024\n2023\n2022\nBalance at beginning of year\n$\n121.8\n \n$\n242.4\n \n$\n228.5\n \nAdditions based on tax positions related to the current year\n16.0\n \n14.2\n \n18.7\n \nAdditions for tax positions of prior years\n12.8\n \n12.6\n \n10.6\n \nReductions for tax positions of prior years\n(\n8.6\n)\n(\n16.9\n)\n(\n6.0\n)\nSettlements\n(\n31.7\n)\n(\n123.2\n)\n(\n1.7\n)\nLapses of statutes of limitations\n(\n11.0\n)\n(\n7.3\n)\n(\n7.7\n)\nBalance at end of year\n$\n99.3\n \n$\n121.8\n \n$\n242.4\n \nThe decrease in unrecognized tax benefits was primarily related to settlements of federal adjustments with the IRS in the tax years 2017 through 2019. There were also additions in unrecognized tax benefits related to the reversal of benefits recognized from certain positions taken on current and prior year income tax returns filed in U.S. federal and various state jurisdictions. These additions were partially offset by various positions taken on prior year income tax returns filed in U.S. and various foreign jurisdictions that were no longer deemed to be at risk. At December 31, 2024, 2023 and 2022, the total amount of unrecognized tax benefits that, if recognized, would affect the effective tax rate was $\n84.0\n million, $\n109.4\n million and $\n230.3\n million, respectively.\nIncluded in the balance of unrecognized tax benefits at December 31, 2024 is $\n7.9\n million related to tax positions for which it is reasonably possible that the total amounts could significantly change during the next twelve months. This amount represents a decrease in unrecognized tax benefits comprised primarily of items related to federal audits of partnership investments and expiring statutes in federal, foreign and state jurisdictions.\nThe Company classifies all income tax related interest and penalties as income tax expense. During the year ended December 31, 2024, there was an increase in income tax interest and penalties of $\n7.8\n million. During the years ended December 31, 2023 and 2022, there was an increase in income tax interest and penalties of $\n5.9\n million and $\n10.3\n million, respectively. The Company accrued $\n18.8\n million, $\n20.4\n million and $\n36.6\n million at December 31, 2024, 2023 and 2022, respectively, for the potential payment of interest and penalties.\n89\nTable of Contents\nNOTE 21 – \nNET INCOME PER SHARE\n \nBasic and diluted net income per share are calculated using the treasury stock method. \n2024\n2023\n2022\nBasic\nNet income\n$\n2,681.4\n \n$\n2,388.8\n \n$\n2,020.1\n \nWeighted average shares outstanding\n251.0\n \n255.4\n \n258.0\n \nBasic net income per share\n$\n10.68\n \n$\n9.35\n \n$\n7.83\n \nDiluted\nNet income\n$\n2,681.4\n \n$\n2,388.8\n \n$\n2,020.1\n \nWeighted average shares outstanding assuming dilution:\nWeighted average shares outstanding\n251.0\n \n255.4\n \n258.0\n \nStock options and other contingently issuable shares \n(1)\n3.1\n \n2.9\n \n3.8\n \nWeighted average shares outstanding assuming dilution\n254.1\n \n258.3\n \n261.8\n \nDiluted net income per share\n$\n10.55\n \n$\n9.25\n \n$\n7.72\n \n(1)    \nStock options and other contingently issuable shares excludes \n0.9\n million, \n2.8\n million and \n1.9\n million shares at December 31, 2024, 2023 and 2022, respectively, due to their anti-dilutive effect.\nNOTE 22 – \nREPORTABLE SEGMENT INFORMATION\nThe Company reports its segment information in the same way that management internally organizes its business for assessing performance and making decisions regarding the allocation of resources in accordance with the Segment Reporting Topic of the ASC. The Company has \nthree\n reportable operating segments: Paint Stores Group, Consumer Brands Group and Performance Coatings Group (individually, a Reportable Segment and collectively, the Reportable Segments). Factors considered in determining the \nthree\n Reportable Segments of the Company include the nature of business activities, the management structure directly accountable to the Company’s Chief Operating Decision Maker (CODM) for operating and administrative activities, availability of discrete financial information and information presented to the Board of Directors. The Company reports all other business activities within the Administrative function. \nThe Company’s CODM has been identified as the Chair, President and Chief Executive Officer because she has the final authority over performance assessment and resource allocation decisions. Because of the diverse operations of the Company, the CODM regularly receives and uses discrete financial information about each Reportable Segment as well as select supplemental financial information about certain divisions, business units or subsidiaries of the Company. The CODM uses all such financial information for performance assessments and resource allocation decisions. The CODM evaluates the performance of and allocates resources to the Reportable Segments based on Segment profit or loss, which represents the segments’ Income before income taxes. The accounting policies of the Reportable Segments are the same as those described in Note 1.\nThe Paint Stores Group consisted of \n4,773\n company-operated specialty paint stores in the United States, Canada and the Caribbean region at December 31, 2024. Each store in this segment is engaged in servicing the needs of architectural and industrial paint contractors and do-it-yourself homeowners. These stores market and sell Sherwin-Williams\n®\n and other controlled brand architectural paint and coatings, protective and marine products, OEM product finishes and related products. The majority of these products are produced by manufacturing facilities in the Consumer Brands Group. In addition, each store sells select purchased associated products. The loss of any single customer would not have a material adverse effect on the business of this segment. During 2024, this segment opened \n79\n net new stores, consisting of \n84\n new stores opened and \n5\n stores closed. In 2023 and 2022, this segment opened \n70\n and \n75\n net new stores, respectively. In accordance with ASC 280-10-50-9, the Paint Stores Group as a whole is considered the operating segment, and because it meets the criteria in ASC 280-10-50-10, it is also considered a Reportable Segment.\nThe Consumer Brands Group manufactures and supplies a broad portfolio of branded and private-label architectural paint, stains, varnishes, industrial products, wood finishes products, wood preservatives, applicators, corrosion inhibitors, aerosols, caulks and adhesives to retailers, including home centers and hardware stores, dedicated dealers and distributors throughout North America, Latin America and Europe. Sales and marketing of certain controlled brand and private-label products is performed by a direct sales staff. The products distributed through third-party customers are intended for resale to the ultimate \n90\nTable of Contents\nend-user of the product. The Consumer Brands Group also consisted of \n334\n company-operated specialty paint stores in Latin America at December 31, 2024. Each store in this segment is engaged in servicing the needs of home, commercial and industrial projects to contractors and do-it-yourself customers in Latin America. These stores market and sell Sherwin-Williams\n®\n and other controlled brand architectural paint and coatings, protective and marine products, OEM product finishes and related products which are branded for the Latin America market. In addition, each store sells select purchased associated products. The Consumer Brands Group had sales to certain customers that, individually, may be a significant portion of the sales and related profitability of the segment. During 2024, the segment opened \n16\n net new stores, consisting of \n18\n stores opened and \n2\n stores closed. In 2023 and 2022, this segment opened (closed) \n11\n and (\n3\n) net new stores, respectively.\nThe Consumer Brands Group also supports the Company’s other businesses around the world with new product research and development, manufacturing, distribution and logistics. Approximately \n63\n% of the total sales of the Consumer Brands Group in 2024 were intersegment transfers of products primarily sold through the Paint Stores Group. This segment incurred most of the Company’s capital expenditures related to ongoing environmental compliance measures, manufacturing capacity expansion, operational efficiencies and maintenance projects at sites currently in operation. In accordance with ASC 280-10-50-9, the Consumer Brands Group as a whole is considered the operating segment, and because it meets the criteria in ASC 280-10-50-10, it is also considered a Reportable Segment.\nThe Performance Coatings Group develops and sells industrial coatings for wood finishing and general industrial (metal and plastic) applications, automotive refinish, protective and marine coatings, coil coatings, packaging coatings and performance-based resins and colorants worldwide. This segment licenses certain technology and trade names worldwide, including Sherwin-Williams\n®\n and other controlled brand products which are distributed through the Paint Stores Group, this segment’s \n324\n company-operated branches and by a direct sales staff and outside sales representatives to retailers, dealers, jobbers, licensees and other third-party distributors. The Performance Coatings Group had sales to certain customers that, individually, may be a significant portion of the sales of the segment. However, the loss of any single customer would not have a material adverse effect on the overall profitability of the segment. During 2024, the segment added \n2\n new branches (\nno\n branches were closed). In 2023 and 2022, this segment added \n5\n and \n35\n net new branches, respectively. In accordance with ASC 280-10-50-9, the Performance Coatings Group as a whole is considered the operating segment, and because it meets the criteria in ASC 280-10-50-10, it is also considered a Reportable Segment.\nThe Administrative function includes the administrative expenses and assets of the Company’s new global headquarters and research and development center, both currently under construction. In addition, it includes the operations of a real estate management unit that is responsible for the ownership, management and leasing of non-retail properties held primarily for use by the Company, including the Company’s current global headquarters and research and development center and disposal of idle facilities. The Administrative function’s remaining assets consist primarily of cash and cash equivalents, investments and deferred pension assets. Also included in the Administrative function was interest expense, interest and investment income, certain expenses related to closed facilities and environmental-related matters and other expenses that were not directly associated with the Reportable Segments. Sales of this function represented external leasing revenue. The Administrative function did not include any significant foreign operations. Gains and losses from the sale of property were not a significant operating factor in determining the performance of the Administrative function.\nNet external sales of all consolidated foreign subsidiaries were $\n4.426\n billion, $\n4.428\n billion and $\n4.294\n billion for 2024, 2023 and 2022, respectively.\nLong-lived assets consisted of Property, plant and equipment, net, Goodwill, Intangible assets, net, Operating lease right-of-use assets, deferred pension assets and Other assets. The aggregate total of long-lived assets for the Company was $\n18.231\n billion, $\n17.441\n billion and $\n16.686\n billion at December 31, 2024, 2023 and 2022, respectively. Long-lived assets of consolidated foreign subsidiaries totaled $\n3.405\n billion, $\n3.586\n billion and $\n3.369\n billion at December 31, 2024, 2023 and 2022, respectively.\nTotal Assets of the Company were $\n23.633\n billion, $\n22.954\n billion and $\n22.594\n billion at December 31, 2024, 2023 and 2022, respectively. Total assets of consolidated foreign subsidiaries were $\n5.208\n billion, $\n5.718\n billion and $\n5.337\n billion, which represented \n22.0\n%, \n24.9\n% and \n23.6\n% of the Company’s total assets at December 31, 2024, 2023 and 2022, respectively. \nNo single geographic area outside the United States was significant relative to consolidated Net sales or consolidated long-lived assets. Export sales and sales to any individual customer were each less than 10 percent of consolidated sales to unaffiliated customers during all years presented.\nIn the reportable segment financial information that follows, Segment profit represents each segment’s Income before income taxes. Domestic intersegment transfers are primarily accounted for at the approximate fully absorbed manufactured cost, based on normal capacity volumes, plus customary distribution costs for paint products. Non-paint domestic and all international intersegment transfers are primarily accounted for at values comparable to normal unaffiliated customer sales. All intersegment \n91\nTable of Contents\ntransfers are eliminated within the Administrative function. In 2023, the absorbed manufactured cost standards utilized for domestic intersegment transfers were established inclusive of forecasted cost reductions from planned initiatives. Deviations from the forecasted cost reductions were recognized within the Consumer Brands Group. Due to the nature of the Company’s integrated manufacturing operations and centralized administrative and information technology support, a substantial amount of allocations are made to determine segment financial information. Expenses that are specifically identifiable to a certain Reportable Segment are allocated accordingly. For expenses that are not specifically identifiable to a certain Reportable Segment, an appropriate allocation base is identified, and expenses are allocated based on each segment’s respective share of the allocation base. The significant expense categories and amounts align with the segment-level information that is regularly provided to the CODM and include intersegment expenses within the amounts shown. Identifiable assets were those directly identified with each Reportable Segment. \n2024\nPaint \nStores\nGroup\nConsumer Brands\nGroup\nPerformance Coatings\nGroup\nAdministrative\nConsolidated\nTotals\nNet sales\n$\n13,188.0\n \n$\n3,108.0\n \n$\n6,797.3\n \n$\n5.2\n \n$\n23,098.5\n \nIntersegment transfers\n—\n \n5,304.3\n \n56.8\n \n(\n5,361.1\n)\n—\n \nTotal net sales and intersegment transfers\n$\n13,188.0\n \n$\n8,412.3\n \n$\n6,854.1\n \n$\n(\n5,355.9\n)\n$\n23,098.5\n \nCost of goods sold\n$\n5,900.8\n \n$\n6,943.5\n \n$\n4,406.5\n \n$\n(\n5,347.4\n)\n$\n11,903.4\n \nSelling, general and administrative expenses\n4,405.6\n \n863.1\n \n1,443.0\n \n710.4\n \n7,422.1\n \nInterest expense\n—\n \n1.4\n \n—\n \n414.3\n \n415.7\n \nOther segment items \n(1)\n(\n21.0\n)\n14.4\n \n(\n23.3\n)\n(\n64.6\n)\n(\n94.5\n)\nIncome before income taxes\n$\n2,902.6\n \n$\n589.9\n \n$\n1,027.9\n \n$\n(\n1,068.6\n)\n$\n3,451.8\n \n% to Net sales\n22.0\n \n%\n19.0\n \n%\n15.1\n \n%\nnm\n14.9\n \n%\nSupplemental Information:\nIdentifiable assets\n$\n5,878.0\n \n$\n6,854.7\n \n$\n7,847.4\n \n$\n3,052.5\n \n$\n23,632.6\n \nCapital expenditures\n141.3\n \n290.3\n \n15.2\n \n623.2\n \n1,070.0\n \nDepreciation \n(2)\n89.9\n \n162.7\n \n18.0\n \n26.8\n \n297.4\n \nAmortization\n (3)\n1.7\n \n66.4\n \n256.7\n \n1.8\n \n326.6\n \nnm - not meaningful\n(1)    \nOther segment items includes Other general (income) expense - net, Interest income and Other (income) expense - net. See Note 19.\n(2)    \nDepreciation is recorded within Cost of goods sold and Selling, general and administrative expenses.\n(3)    \nAmortization is recorded within Selling, general and administrative expenses.\n92\nTable of Contents\n2023\nPaint \nStores \nGroup\nConsumer Brands\nGroup\nPerformance Coatings \nGroup\nAdministrative\nConsolidated\nTotals\nNet sales\n$\n12,839.5\n \n$\n3,365.6\n \n$\n6,843.1\n \n$\n3.7\n \n$\n23,051.9\n \nIntersegment transfers\n— \n5,234.0\n \n197.8\n \n(\n5,431.8\n)\n— \nTotal net sales and intersegment transfers\n$\n12,839.5\n \n$\n8,599.6\n \n$\n7,040.9\n \n$\n(\n5,428.1\n)\n$\n23,051.9\n \nCost of goods sold\n$\n5,794.4\n \n$\n7,311.9\n \n$\n4,606.9\n \n$\n(\n5,419.4\n)\n$\n12,293.8\n \nSelling, general and administrative expenses\n4,211.5\n \n882.3\n \n1,415.5\n \n556.1\n \n7,065.4\n \nInterest expense\n—\n \n—\n \n—\n \n417.5\n \n417.5\n \nOther segment items \n(1)\n(\n27.2\n)\n96.1\n \n26.9\n \n69.5\n \n165.3\n \nIncome before income taxes\n$\n2,860.8\n \n$\n309.3\n \n$\n991.6\n \n$\n(\n1,051.8\n)\n$\n3,109.9\n \n% to Net sales\n22.3\n \n%\n9.2\n \n%\n14.5\n \n%\nnm\n13.5\n \n%\nSupplemental Information:\nIdentifiable assets\n$\n5,745.3\n \n$\n6,631.8\n \n$\n8,266.6\n \n$\n2,310.7\n \n$\n22,954.4\n \nCapital expenditures\n111.4\n \n309.6\n \n32.6\n \n434.8\n \n888.4\n \nDepreciation \n(2)\n79.0\n \n151.4\n \n26.0\n \n35.9\n \n292.3\n \nAmortization \n(3)\n3.3\n \n72.4\n \n253.0\n \n1.5\n \n330.2\n \nnm - not meaningful\n(1)    \nOther segment items includes Other general (income) expense - net, Impairment, Interest income and Other (income) expense - net. See Notes 3 and 6 for information on Impairment and Note 19 for information on Other general (income) expense - net and Other (income) expense - net.\n(2)    \nDepreciation is recorded within Cost of goods sold and Selling, general and administrative expenses.\n(3)    \nAmortization is recorded within Selling, general and administrative expenses.\n2022\nPaint \nStores\nGroup\nConsumer Brands\nGroup\nPerformance Coatings \nGroup\nAdministrative\nConsolidated\nTotals\nNet sales\n$\n11,963.3\n \n$\n3,388.4\n \n$\n6,793.5\n \n$\n3.7\n \n$\n22,148.9\n \nIntersegment transfers\n— \n5,214.8\n \n203.7\n \n(\n5,418.5\n)\n— \nTotal net sales and intersegment transfers\n$\n11,963.3\n \n$\n8,603.2\n \n$\n6,997.2\n \n$\n(\n5,414.8\n)\n$\n22,148.9\n \nCost of goods sold\n$\n5,826.8\n \n$\n7,454.8\n \n$\n4,965.4\n \n$\n(\n5,423.2\n)\n$\n12,823.8\n \nSelling, general and administrative expenses\n3,810.1\n \n817.8\n \n1,275.6\n \n428.1\n \n6,331.6\n \nInterest expense\n—\n \n—\n \n—\n \n390.8\n \n390.8\n \nOther segment items \n(1)\n(\n21.7\n)\n16.4\n \n21.3\n \n13.6\n \n29.6\n \nIncome before income taxes\n$\n2,348.1\n \n$\n314.2\n \n$\n734.9\n \n$\n(\n824.1\n)\n$\n2,573.1\n \n% to Net sales\n19.6\n \n%\n9.3\n \n%\n10.8\n \n%\nnm\n11.6\n \n%\nSupplemental Information:\nIdentifiable assets\n$\n5,873.6\n \n$\n6,749.6\n \n$\n8,296.8\n \n$\n1,674.0\n \n$\n22,594.0\n \nCapital expenditures\n87.3\n \n295.0\n \n38.7\n \n223.5\n \n644.5\n \nDepreciation \n(2)\n73.9\n \n126.2\n \n29.1\n \n34.8\n \n264.0\n \nAmortization \n(3)\n3.3\n \n79.8\n \n232.0\n \n2.0\n \n317.1\n \nnm - not meaningful\n(1)    \nOther segment items includes Other general (income) expense - net, Impairment, Interest income and Other (income) expense - net. See Note 6 for information on Impairment and Note 19 for information on Other general (income) expense - net and Other (income) expense - net.\n(2)    \nDepreciation is recorded within Cost of goods sold and Selling, general and administrative expenses.\n(3)    \nAmortization is recorded within Selling, general and administrative expenses\n.\n93\nTable of Contents\nITEM 9.    CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A.    CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nAs of the end of the period covered by this report, we carried out an evaluation, under the supervision and with the participation of our Chair, President and Chief Executive Officer and our Senior Vice President – Finance and Chief Financial Officer, of the effectiveness of our disclosure controls and procedures pursuant to Rule 13a-15 and Rule 15d-15 of the Securities Exchange Act of 1934, as amended (Exchange Act). Based upon that evaluation, our Chair, President and Chief Executive Officer and our Senior Vice President – Finance and Chief Financial Officer concluded that as of the end of the period covered by this report, our disclosure controls and procedures were effective to ensure that information required to be disclosed by us in reports we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in Securities and Exchange Commission rules and forms, and accumulated and communicated to our management, including our Chair, President and Chief Executive Officer and our Senior Vice President – Finance and Chief Financial Officer, to allow timely decisions regarding required disclosure. \nInternal Control Over Financial Reporting\nThe “Report of Management on Internal Control over Financial Reporting” and the “Report of the Independent Registered Public Accounting Firm on Internal Control over Financial Reporting” are set forth in Item 8.\nThere have been no changes in our internal control over financial reporting identified in connection with the evaluation that occurred during the period covered by this report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nITEM 9B.    OTHER INFORMATION\nTrading Arrangements\nDuring the quarter ended December 31, 2024, none of the Company’s directors or “officers,” as defined in Rule 16a-1(f) of the Exchange Act, \nadopted\n, modified, or \nterminated\n a “Rule 10b5-1 trading arrangement” or a “non-Rule 10b5-1 trading arrangement,” as each term is defined in Item 408 of Regulation S-K.\nITEM 9C.    DISCLOSURE REGARDING JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n94\nTable of Contents\nPART III\nITEM 10.    DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors\nThe information regarding our directors and director nominees is set forth in our Proxy Statement under the caption “Proposal 1 – Election of 9 Directors” and is incorporated herein by reference.\nThere have been no material changes to the procedures by which security holders may recommend nominees to our Board of Directors. Please refer to the information set forth in our Proxy Statement under the caption “Board Committees,” which is incorporated herein by reference.\nExecutive Officers\nThe information regarding our executive officers is set forth under the caption “Information About Our Executive Officers” in Part I of this report, which is incorporated herein by reference.\nSection 16(a) Beneficial Ownership Reporting Compliance\nTo the extent disclosure of any delinquent form under Section 16(a) of the Securities Exchange Act of 1934 is made by the Company, such disclosure will be set forth in our Proxy Statement under the caption “Delinquent Section 16(a) Reports” and is incorporated herein by reference.\nAudit Committee\nThe information regarding the Audit Committee of our Board of Directors and audit committee financial experts is set forth in our Proxy Statement under the caption “Board Committees” and is incorporated herein by reference.\nCode of Ethics\nWe have adopted a Code of Conduct, which applies to all directors, officers and employees, including our principal executive officer, principal financial officer, principal accounting officer or controller and persons performing similar functions, of Sherwin-Williams and our subsidiaries wherever located. Our Code of Conduct contains the general guidelines and principles for conducting Sherwin-Williams’ business consistent with the highest standards of business ethics.\nWe have also adopted a Code of Ethics for Senior Financial Management, pursuant to which our chief executive officer, chief financial officer and senior financial management are responsible for creating and maintaining a culture of high ethical standards and of commitment to compliance throughout our Company to ensure the fair and timely reporting of Sherwin-Williams’ financial results and condition. Senior financial management includes the controller, the treasurer, the principal financial/accounting personnel in our operating groups and divisions and all other financial/accounting personnel within our corporate departments and operating groups and divisions with staff supervision responsibilities. \nOur Code of Conduct and Code of Ethics for Senior Financial Management are available on our Investor Relations website, investors.sherwin.com. \nWe intend to disclose on our Investor Relations website, investors.sherwin.com, any amendment to, or waiver from, a provision of our Code of Conduct or Code of Ethics for Senior Financial Management that applies to our directors and executive officers, including our principal executive officer, principal financial officer, principal accounting officer or controller or any persons performing similar functions, and that is required to be publicly disclosed pursuant to the rules of the SEC.\nInsider Trading Policy\nThe information regarding our Insider Trading Policy is set forth in our Proxy Statement under the caption “Insider Trading Policy” and is incorporated herein by reference. A copy of our Insider Trading Policy is filed with this Annual Report on Form 10-K as Exhibit 19.\n95\nTable of Contents\nITEM 11.    EXECUTIVE COMPENSATION\nThe information required by this item is set forth in our Proxy Statement under the captions “2024 Director Compensation Table,” “Director Compensation Program,” “Executive Compensation,” “Executive Compensation Tables” and “2024 CEO Pay Ratio” and is \nincorporated\n herein by reference (other than the Compensation Committee Report, which will be deemed furnished).\nITEM 12.   SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information regarding security ownership of certain beneficial owners and management is set forth in our Proxy Statement under the captions “Security Ownership of Management, Directors and Director Nominees” and “Security Ownership of Certain Beneficial Owners” and is incorporated herein by reference.\nThe information regarding securities authorized for issuance under the Company’s equity compensation plans is set forth in our Proxy Statement under the caption “Equity Compensation Plan Information” and is incorporated herein by reference.\n \nITEM 13.    CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information required by this item is set forth in our Proxy Statement under the captions “Certain Relationships and Transactions with Related Persons” and “Director Independence” and is incorporated herein by reference.\nITEM 14.    PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this item is set forth in our Proxy Statement under the caption “Matters Relating to the Independent Registered Public Accounting Firm” and is incorporated herein by reference.\n96\nTable of Contents\nPART IV\nITEM 15.    EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)(1)\nFinancial Statements \nPage Number in Form 10-K\nStatements of Consolidated Income\n48\nStatements of Consolidated Comprehensive Income\n49\nConsolidated Balance Sheets\n50\nStatements of Consolidated Cash Flows\n51\nStatements of Consolidated Shareholders’ Equity\n52\nNotes to Consolidated Financial Statements\n53\n(2)  \nFinancial Statement Schedule\nSchedule II — Valuation and Qualifying Accounts and Reserves for the years ended December 31, 2024, 2023 and 2022 is set forth below. All other schedules for which provision is made in the applicable SEC accounting regulations are not required under the related instructions or are inapplicable and therefore have been omitted.\nValuation and Qualifying Accounts and Reserves\n(Schedule II)\nChanges in deferred tax asset valuation allowances were as follows:\n(millions of dollars)\n2024\n2023\n2022\nBeginning balance\n$\n106.6\n \n$\n97.5\n \n$\n97.2\n \nAdditions (deductions) \n (1)\n17.9\n \n9.1\n \n0.3\n \nEnding balance\n$\n124.5\n \n$\n106.6\n \n$\n97.5\n \n(1)    \nAdditions (deductions) did not have a material impact on the Income Statement in 2024, 2023 or 2022.\n \n97\nTable of Contents\n(3)  Exhibits\n3.1\nAmended and Restated Articles of Incorporation of the Company, as amended through February 18, 2015, filed as Exhibit 3 to the Company’s Current Report on Form 8-K dated February 18, 2015, and incorporated herein by reference.\n3.2\nAmendment to the Amended and Restated Articles of Incorporation of the Company, as amended through February 18, 2015, filed as Exhibit 3.1 to the Company’s Current Report on Form 8-K dated March 3, 2021, and incorporated herein by reference.\n3.3\nRegulations of the Company (As Amended and Restated July 19, 2023), filed as Exhibit 3.1 to the Company’s Current Report on Form 8-K dated July 18, 2023, and incorporated herein by reference.\n4.1\nDescription of Securities Registered under Section 12 of the Securities Exchange Act of 1934 filed as Exhibit 4(a) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2021, and incorporated herein by reference.\n4.2\nIndenture between the Company and The Bank of New York Mellon (as successor to Chemical Bank), as trustee, dated as of February 1, 1996, filed as Exhibit 4(a) to Form S-3 Registration Statement Number 333-01093 dated February 20, 1996, and incorporated herein by reference.\n4.2.1\nThird Supplemental Indenture by and between the Company and The Bank of New York Mellon, as trustee (including Form of Note), dated as of December 7, 2012, filed as Exhibit 4.2 to the Company’s Current Report on Form 8-K dated December 4, 2012, and incorporated herein by reference.\n4.3\nIndenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated July 31, 2015, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated July 28, 2015, and incorporated herein by reference.\n4.3.1\nFirst Supplemental Indenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated July 31, 2015, (including Form of Note), filed as Exhibit 4.2 to the Company’s Current Report on Form 8-K dated July 28, 2015, and incorporated herein by reference.\n4.3.2\nSecond Supplemental Indenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated July 31, 2015, (including Form of Note), filed as Exhibit 4.3 to the Company’s Current Report on Form 8-K dated July 28, 2015, and incorporated herein by reference.\n4.3.3\nSixth Supplemental Indenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated May 16, 2017 (including Form of Note), filed as Exhibit 4.4 to the Company’s Current Report on Form 8-K dated May 16, 2017, and incorporated herein by reference.\n4.3.4\nSeventh Supplemental Indenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated May 16, 2017 (including Form of Note), filed as Exhibit 4.5 to the Company’s Current Report on Form 8-K dated May 16, 2017, and incorporated herein by reference.\n4.3.5\nEleventh Supplemental Indenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated June 2, 2017 (including Form of Note), filed as Exhibit 4.4 to the Company’s Current Report on Form 8-K dated June 2, 2017, and incorporated herein by reference.\n4.3.6\nTwelfth Supplemental Indenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated June 2, 2017 (including Form of Note), filed as Exhibit 4.5 to the Company’s Current Report on Form 8-K dated June 2, 2017, and incorporated herein by reference.\n4.3.7\nThirteenth Supplemental Indenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated August 26, 2019 (including Form of Note), filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated August 26, 2019, and incorporated herein by reference.\n98\nTable of Contents\n4.3.8\nFourteenth Supplemental Indenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated August 26, 2019 (including Form of Note), filed as Exhibit 4.2 to the Company’s Current Report on Form 8-K dated August 26, 2019, and incorporated herein by reference.\n4.3.9\nFifteenth Supplemental Indenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated March 17, 2020 (including Form of Note), filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated March 17, 2020, and incorporated herein by reference.\n4.3.10\nSixteenth Supplemental Indenture by and between the Company and Wells Fargo Bank, National Association, as trustee, dated March 17, 2020 (including Form of Note), filed as Exhibit 4.2 to the Company’s Current Report on Form 8-K dated March 17, 2020, and incorporated herein by reference.\n4.3.11\nSeventeenth Supplemental Indenture by and between the Company and U.S. Bank National Association, as trustee, dated November 10, 2021 (including Form of Note), filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated November 10, 2021, and incorporated herein by reference.\n4.3.12\nEighteenth Supplemental Indenture by and between the Company and U.S. Bank National Association, as Trustee, dated November 10, 2021 (including Form of Note), filed as Exhibit 4.2 to the Company’s Current Report on Form 8-K dated November 10, 2021, and incorporated herein by reference.\n4.4\nIndenture by and between the Company and U.S. Bank Trust Company, National Association, as trustee, dated August 10, 2022, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated August 10, 2022, and incorporated herein by reference.\n4.4.1\nSecond Supplemental Indenture by and between the Company and U.S. Bank Trust Company, National Association, as trustee, dated August 10, 2022 (including Form of Note), filed as Exhibit 4.3 to the Company’s Current Report on Form 8-K dated August 10, 2022, and incorporated herein by reference.\n4.4.2\nThird Supplemental Indenture by and between the Company and U.S. Bank Trust Company, National Association, as trustee, dated August 9, 2024 (including Form of Note), filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated August 9, 2024, and incorporated herein by reference.\n4.4.3\nFourth Supplemental Indenture by and between the Company and U.S. Bank Trust Company, National Association, as trustee, dated August 9, 2024 (including Form of Note), filed as Exhibit 4.2 to the Company’s Current Report on Form 8-K dated August 9, 2024, and incorporated herein by reference.\n10.1\nCredit Agreement, dated as of May 9, 2016, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated May 9, 2016, and incorporated herein by reference.\n10.1.1\nAmendment No. 1 to the Credit Agreement, dated as of May 12, 2016, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated May 12, 2016, and incorporated herein by reference.\n10.1.2\nAmendment No. 2 to the Credit Agreement, dated as of June 20, 2016, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated June 20, 2016, and incorporated herein by reference.\n10.1.3\nAmendment No. 3 to the Credit Agreement, dated as of August 1, 2016, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated August 1, 2016, and incorporated herein by reference.\n10.1.4\nAmendment No. 4 to the Credit Agreement, dated as of January 31, 2017, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated January 31, 2017, and incorporated herein by reference.\n99\nTable of Contents\n10.1.5\nAmendment No. 5 to the Credit Agreement, dated as of February 13, 2017, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated February 13, 2017, and incorporated herein by reference.\n10.1.6\nAmendment No. 6 to the Credit Agreement, dated as of February 27, 2017, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated February 27, 2017, and incorporated herein by reference.\n10.1.7\nAmendment No. 7 to the Credit Agreement, dated as of May 8, 2017, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated May 8, 2017, and incorporated herein by reference.\n10.1.8\nAmendment No. 8 to the Credit Agreement, dated as of May 11, 2017, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated May 11, 2017, and incorporated herein by reference.\n10.1.9\nAmendment No. 9 to the Credit Agreement, dated as of February 27, 2018, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated February 27, 2018, and incorporated herein by reference.\n10.1.10\nAmendment No. 10 to the Credit Agreement, dated as of July 26, 2018, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated July 26, 2018, and incorporated herein by reference.\n10.1.11\nAmendment No. 11 to the Credit Agreement, dated as of September 14, 2020, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated September 14, 2020, and incorporated herein by reference.\n10.1.12\nAmendment No. 12 to the Credit Agreement, dated as of November 9, 2020, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated November 9, 2020, and incorporated herein by reference.\n10.1.13\nAmendment No. 13 to the Credit Agreement, dated as of December 7, 2020, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated December 7, 2020, and incorporated herein by reference.\n10.1.14\nAmendment No. 14 to the Credit Agreement, dated as of February 16, 2021, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated February 16, 2021, and incorporated herein by reference.\n10.1.15\nAmendment No. 15 to the Credit Agreement, dated as of May 3, 2021, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated May 3, 2021, and incorporated herein by reference.\n10.1.16\nAmendment No. 16 to the Credit Agreement, dated as of May 23, 2022, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated May 23, 2022, and incorporated herein by reference.\n10.1.17\nAmendment No. 17 to the Credit Agreement, dated as of October 31, 2022, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated October 31, 2022, and incorporated herein by reference.\n100\nTable of Contents\n10.1.18\nAmendment No. 18 to the Credit Agreement, dated as of November 28, 2022, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated November 28, 2022, and incorporated herein by reference.\n10.1.19\nAmendment No. 19 to the Credit Agreement, dated as of May 1, 2023, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated May 1, 2023, and incorporated herein by reference.\n10.1.20\nAmendment No. 20 to the Credit Agreement, dated as of November 18, 2024, by and among the Company, Citicorp USA, Inc., as administrative agent and issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated November 18, 2024, and incorporated herein by reference.\n10.2\nAgreement for Letter of Credit, dated as of May 9, 2016, by and between the Company and Citibank, N.A. filed as Exhibit 4.2 to the Company’s Current Report on Form 8-K dated May 9, 2016, and incorporated herein by reference.\n10.2.1\nAmendment No. 1 to the Agreement for Letter of Credit, dated as of July 26, 2018, by and between the Company and Citibank, N.A., filed as Exhibit 4.4 to the Company’s Quarterly Report on Form 10-Q for the quarterly period ended September 30, 2018, and incorporated herein by reference.\n10.3\nAmended and \nRestated Credit Agreement, dated as of August 2, 2021, by and among the Company, Goldman Sachs Bank USA, as administrative agent, Goldman Sachs Mortgage Company, as issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated August 2, 2021, and incorporated herein by reference.\n10.3.1\nAmendment \nNo. 1 to the Amended and Restated Credit Agreement, dated as of August 6, 2021, by and among the Company, Goldman Sachs Bank USA, as administrative agent, Goldman Sachs Mortgage Company, as issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated August 6, 2021, and incorporated herein by reference.\n10.3.2\nAmendment \nNo. 2 to the Amended and Restated Credit Agreement, dated as of November 18, 2021, by and among the Company, Goldman Sachs Bank USA, as administrative agent, Goldman Sachs Mortgage Company, as issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated November 18, 2021, and incorporated herein by reference.\n10.3.3\nAmendment \nNo. 3 to the Amended and Restated Credit Agreement, dated as of November 30, 2021, by and among the Company, Goldman Sachs Bank USA, as administrative agent, Goldman Sachs Mortgage Company, as issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated November 30, 2021, and incorporated herein by reference.\n10.3.4\nAmendment No. 4 to the Amended and Restated Credit Agreement, dated as of August 15, 2022, by and among the Company, Goldman Sachs Bank USA, as administrative agent, Goldman Sachs Mortgage Company, as issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated August 15, 2022, and incorporated herein by reference.\n10.3.5\nAmendment No. 5 to the Amended and Restated Credit Agreement, dated as of August 26, 2022, by and among the Company, Goldman Sachs Bank USA, as administrative agent, Goldman Sachs Mortgage Company, as issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated August 26, 2022, and incorporated herein by reference.\n10.3.6\nAmendment No. 6 to the Amended and Restated Credit Agreement, dated as of September 8, 2022, by and among the Company, Goldman Sachs Bank USA, as administrative agent, Goldman Sachs Mortgage Company, as issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated September 8, 2022, and incorporated herein by reference.\n101\nTable of Contents\n10.3.7\nAmendment No. 7 to the Amended and Restated Credit Agreement, dated as of September 14, 2022, by and among the Company, Goldman Sachs Bank USA, as administrative agent, Goldman Sachs Mortgage Company, as issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated September 14, 2022, and incorporated herein by reference.\n10.3.8\nAmendment No. 8 to the Amended and Restated Credit Agreement, dated as of February 28, 2023, by and among the Company, Goldman Sachs Bank USA, as administrative agent, Goldman Sachs Mortgage Company, as issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated February 28, 2023, and incorporated herein by reference.\n10.3.9\nAmendment No. 9 to the Amended and Restated Credit Agreement, dated as of May 1, 2024, by and among the Company, Goldman Sachs Bank USA, as administrative agent, Goldman Sachs Mortgage Company, as issuing bank, and the lenders party thereto, filed as Exhibit 4.1 to the Company’s Quarterly Report on Form 10-Q for the quarterly period ended June 30, 2024, and incorporated herein by reference.\n10.4\nCredit Agreement, dated as of July 31, 2024, by and among The Sherwin-Williams Company, Sherwin-Williams Canada Inc. and Sherwin-Williams Luxembourg S.à r.l., as borrowers, the lenders party thereto, the issuing lenders party thereto and Citibank, N.A., as administrative agent, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K dated August 2, 2024, and incorporated herein by reference.\n*10.5\nForms of Amended and Restated Severance Agreements, filed as Exhibit \n10(a)\n to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, and incorporated herein by reference. \n \n*10.5.1\nSchedule of Current and Former Executive Officers who are Parties to the Amended and Restated Severance Agreements in the forms referred to in Exhibit 10\n.5\n above (filed herewith).\n*10.6\nForm of Director, Executive Officer and Corporate Officer Indemnity Agreement, filed as Exhibit 10(c) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, and incorporated herein by reference. \n^ *10.7\nAircraft Time Sharing Agreement between the Company and Heidi G. Petz, dated January 2, 2024 (filed herewith).\n*10.8\nThe Sherwin-Williams Company 2005 Deferred Compensation Savings and Pension Equalization Plan (Amended and Restated Effective as of January 1, 2016) filed as Exhibit 10(e) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2015, and incorporated herein by reference.\n*10.9\nThe Sherwin-Williams Company 2005 Key Management Deferred Compensation Plan (Amended and Restated Effective as of October 13, 2023), filed as Exhibit 10(g) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, and incorporated herein by reference. \n*10.10\nThe Sherwin-Williams Company 2005 Director Deferred Fee Plan (Amended and Restated Effective as of March 1, 2023) filed as Exhibit 10(a) to the Company’s Quarterly Report on Form 10-Q for the quarterly period ended March 31, 2023, and incorporated herein by reference.\n*10.11\nThe Sherwin-Williams Company Executive Disability Income Plan filed as Exhibit 10(g) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 1991 (SEC File Number 001-04851), and incorporated herein by reference.\n*10.11.1\nAmendment Number One to The Sherwin-Williams Company Executive Disability Income Plan filed as Exhibit 10(l) to the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2009, and incorporated herein by reference.\n*10.12\nSummary of The Sherwin-Williams Company Revised Executive Disability Plan filed as Exhibit 10(o) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2013, and incorporated herein by reference.\n*10.13\nThe Sherwin-Williams Company 2008 Amended and Restated Executive Life Insurance Plan filed as Exhibit 10(m) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2009, and incorporated herein by reference.\n102\nTable of Contents\n*10.14\nThe Sherwin-Williams Company 2006 Equity and Performance Incentive Plan (Amended and Restated as of October 13, 2023), filed as Exhibit 10(m) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, and incorporated herein by reference.\n*10.14.1\nForms of Stock Option Award under The Sherwin-Williams Company 2006 Equity and Performance Incentive Plan filed as Exhibit 10(x) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2015, and incorporated herein by reference.\n*10.14.2\nForms of Stock Option Award under The Sherwin-Williams Company 2006 Equity and Performance Incentive Plan filed as Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q for the quarterly period ended September 30, 2017, and incorporated herein by reference.\n*10.14.3\nForms of Stock Option Award under The Sherwin-Williams Company 2006 Equity and Performance Incentive Plan filed as Exhibit 10(p) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2017, and incorporated herein by reference.\n*10.14.4\nForms of Stock Option Award under The Sherwin-Williams Company 2006 Equity and Performance Incentive Plan filed as Exhibit 10(x) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2018, and incorporated herein by reference.\n*10.14.5\nForms of Stock Option Award under The Sherwin-Williams Company 2006 Equity and Performance Incentive Plan, filed as Exhibit 10(s) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, and incorporated herein by reference. \n*10.14.6\nForm of Restricted Stock Units Award Agreement under The Sherwin-Williams Company 2006 Equity and Performance Incentive Plan filed as Exhibit 10(x) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2022, and incorporated herein by reference.\n*10.14.7\nForm of Restricted Stock Units Award Agreement under The Sherwin-Williams Company 2006 Equity and Performance Incentive Plan, filed as Exhibit 10(w) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, and incorporated herein by reference.\n*10.14.6\nForms of Stock Option Award under The Sherwin-Williams Company 2006 Equity and Performance Incentive Plan (filed herewith).\n*10.14.9\nForm of Restricted Stock Units Award Agreement under The Sherwin-Williams Company 2006 Equity and Performance Incentive Plan (filed herewith).\n*10.15\nThe Sherwin-Williams Company 2006 Stock Plan for Nonemployee Directors (Amended and Restated as of April 20, 2016) filed as Exhibit 10.1 to the Company's Quarterly Report on Form 10-Q for the quarterly period ended March 31, 2016, and incorporated herein by reference.\n*10.15.1\nForm of Restricted Stock Units Award Agreement under The Sherwin-Williams Company 2006 Stock Plan for Nonemployee Directors filed as Exhibit 10(gg) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2016, and incorporated herein by reference.\n*10.16\nThe Sherwin-Williams Company 2007 Executive Annual Performance Bonus Plan (Amended and Restated as of October 13, 2023), filed as Exhibit 10(z) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, and incorporated herein by reference.\n \n*10.17\nThe Sherwin-Williams Company Key Employee Separation Plan as Amended and Restated Effective October 13, 2023, filed as Exhibit 10(aa) to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, and incorporated herein by reference.\n19.1\nInsider Trading Policy (filed herewith)\n21.1\nSubsidiaries (filed herewith).\n23.1\nConsent of Ernst & Young LLP, Independent Registered Public Accounting Firm (filed herewith).\n24.1\nPowers of Attorney (filed herewith).\n24.2\nCertified Resolution Authorizing Signature by Power of Attorney (filed herewith).\n31.1\nRule 13a-14(a)/15d-14(a) Certification of Chief Executive Officer (filed herewith).\n103\nTable of Contents\n31.2\nRule 13a-14(a)/15d-14(a) Certification of Chief Financial Officer (filed herewith).\n32.1\nSection 1350 Certification of Chief Executive Officer (furnished herewith).\n32.2\nSection 1350 Certification of Chief Financial Officer (furnished herewith).\n*97.1\nThe Sherwin-Williams Company Section 16 Executive Officer Clawback Policy, Effective October 10, 2023, filed as Exhibit 97 to the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, and incorporated herein by reference\n.  \n101.INS\nInline XBRL Instance Document - the instance document does not appear in the interactive data file because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n104\nThe cover page from this Annual Report on Form 10-K for the fiscal year ended December 31, 2024, formatted in Inline XBRL and contained in Exhibit 101. \n^\nCertain exhibits and schedules have been omitted in accordance with Item 601(a)(5) of Regulation S-K and the Company agrees to furnish supplementally to the SEC a copy of any omitted exhibits and schedules upon request.\n*\nManagement contract or compensatory plan or arrangement.\nITEM 16.    FORM 10-K SUMMARY\nNone.\n104\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Company has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on February 20, 2025.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on February 20, 2025.\n \nTHE SHERWIN-WILLIAMS COMPANY\nBy:\n/S/\nMARY L. GARCEAU\nMary L. Garceau, Secretary\n* HEIDI G. PETZ\nChair, President and Chief Executive Officer, Director\n(Principal Executive Officer)\n    Heidi G. Petz\n* ALLEN J. MISTYSYN\nSenior Vice President – Finance and Chief Financial Officer (Principal Financial Officer)\n    Allen J. Mistysyn\n* J. PAUL LANG\nSenior Vice President – Enterprise Finance and Chief Accounting Officer (Principal Accounting Officer)\n    J. Paul Lang\n* KERRII B. ANDERSON\nDirector\n    Kerrii B. Anderson\n* ARTHUR F. ANTON\nDirector\n    Arthur F. Anton \n* JEFF M. FETTIG\nDirector\n    Jeff M. Fettig\n* JOHN G. MORIKIS\nDirector\nJohn G. Morikis\n* CHRISTINE A. POON\nDirector\n    Christine A. Poon\n* AARON M. POWELL\nDirector\n    Aaron M. Powell\n* MARTA R. STEWART\nDirector\n    Marta R. Stewart\n* MICHAEL H. THAMAN\nDirector\n    Michael H. Thaman\n* MATTHEW THORNTON III\nDirector\n    Matthew Thornton III\n* THOMAS L. WILLIAMS\nDirector\n    Thomas L. Williams\n*\nThe undersigned, by signing her name hereto, does sign this report on behalf of the designated officers and directors of the Company pursuant to powers of attorney executed on behalf of each such officer and director and filed as an exhibit to this report.\nBy:\n/S/\nMARY L. GARCEAU\n  \nFebruary 20, 2025\n \nMary L. Garceau, Attorney-in-fact\n  \n105"
  }
}