{
  "ticker": "SJM",
  "cik": "0000091419",
  "company_name": "J M SMUCKER Co",
  "filing_date": "2025-06-18",
  "accession": "0000091419-25-000056",
  "primary_doc": "sjm-20250430.htm",
  "item_sections": {
    "item1": "Item 1.    Business. \nThe Company:\n The J. M. Smucker Company (“Company,” “registrant,” “we,” “us,” or “our”), often referred to as Smucker’s (a registered trademark), was established in 1897 and incorporated in Ohio in 1921. We operate principally in one industry, the manufacturing and marketing of branded food and beverage products on a worldwide basis, although the majority of our sales are in the United States (“U.S.”). Operations outside the U.S. are principally in Canada, although our products are exported to other countries as well. Net sales outside the U.S., subject to foreign currency translation, represented 4 percent of consolidated net sales for 2025. Our branded food and beverage products include a strong portfolio of trusted, iconic, market-leading brands that are sold to consumers primarily through retail outlets in North America.\nWe have four reportable segments: U.S. Retail Coffee, U.S. Retail Frozen Handheld and Spreads, and U.S. Retail Pet Foods (the “U.S. retail market segments”), and Sweet Baked Snacks. These segments in total comprised 86 percent of consolidated net sales in 2025 and represent a major portion of our strategic focus – the sale of branded food and beverage products with leadership positions to consumers through retail outlets in North America. Additionally, we sell products both domestically and in foreign countries through retail channels and foodservice distributors and operators through the Sweet Baked Snacks segment and the combined International and Away From Home operating segments. For additional information on our reportable segments, see Note 5: Reportable Segments.\nOn March 3, 2025, we sold certain Sweet Baked Snacks value brands to JTM Foods, LLC (“JTM”). The transaction included certain trademarks and licenses, a manufacturing facility in Chicago, Illinois, and approximately 400 employees who support the business. Under our ownership, these Sweet Baked Snacks value brands generated net sales of approximately $48.4 and $30.0 in 2025 and 2024, respectively, which were included in the Sweet Baked Snacks segment. \nOn December 2, 2024, we sold the \nVoortman\n® \nbusiness to Second Nature Brands (“Second Nature”). The transaction included products sold under the \nVoortman \nbrand, inclusive of certain trademarks, a leased manufacturing facility in Burlington, Ontario, and approximately 300 employees who supported the business. Under our ownership, the \nVoortman \nbusiness generated net sales of approximately $86.3 and $65.0 in 2025 and 2024, respectively, which were included in the Sweet Baked Snacks segment. \nOn January 2, 2024, we sold the Canada condiment business to TreeHouse Foods, Inc. (“TreeHouse Foods”). The transaction included \nBick’s\n®\n pickles, \nHabitant\n®\n pickled beets, \nWoodman’s\n®\n horseradish, and \nMcLarens\n®\n pickled onions brands, inclusive of certain trademarks. Under our ownership, these brands generated net sales of $43.8 and $61.6 in 2024 and 2023, respectively, which were included in the International operating segment.\nOn November 7, 2023, we completed a cash and stock transaction to acquire Hostess Brands, Inc. (“Hostess Brands”), a manufacturer and marketer of sweet baked goods brands and included \nHostess\n®\n Donettes\n®\n, \nTwinkies\n®\n, \nCupCakes\n, \nDingDongs\n®\n, \nZingers\n®\n, \nCoffeeCakes\n, \nHoHos\n®\n, \nMini Muffins\n, and \nFruit Pies\n, and the \nVoortman\n cookie brand at the acquisition date.\nOn November 1, 2023, we sold the \nSahale Snacks\n®\n business to Second Nature. The transaction included products sold under the \nSahale Snacks \nbrand, inclusive of certain trademarks and licensing agreements, a leased manufacturing facility in Seattle, Washington, and approximately 100 employees who supported the brand. Under our ownership, the \nSahale Snacks\n brand generated net sales of $24.1 and $48.4 in 2024 and 2023, respectively, primarily included in the U.S. Retail Frozen Handheld and Spreads segment.\nOn April 28, 2023, we sold certain pet food brands to Post Holdings, Inc. (“Post”). The transaction included the\n Rachael Ray\n®\n Nutrish\n®\n,\n 9Lives\n®\n,\n Kibbles ’n Bits\n®\n,\n Nature’s Recipe\n®\n, and \nGravy Train\n®\n brands, as well as the private label pet food business, inclusive of certain trademarks and licensing agreements, manufacturing and distribution facilities in Bloomsburg, Pennsylvania, manufacturing facilities in Meadville, Pennsylvania and Lawrence, Kansas, and approximately 1,100 employees who supported these pet food brands. Under our ownership, these brands generated net sales of $1.5 billion in 2023, primarily included in the U.S. Retail Pet Foods segment.\nFor additional information on the acquisition and divestitures, see Note 2: Acquisition and Note 3: Divestitures.\n2\nPrincipal Products:\n In 2025, our principal products were coffee, sweet baked goods, pet snacks, frozen handheld products, peanut butter, cat food, fruit spreads, portion control products, toppings and syrups, and baking mixes and ingredients. Product sales information for the years 2025, 2024, and 2023 is included within Note 5: Reportable Segments.\nProducts within our U.S. retail market segments are primarily sold through a combination of direct sales and brokers to food retailers, club stores, discount and dollar stores, online retailers, pet specialty stores, drug stores, military commissaries, mass merchandisers, and distributors. The Sweet Baked Snacks segment includes products distributed across all channels, both domestically and in foreign countries, such as supermarket chains, convenience stores, national mass retailers, discount and dollar stores, club stores, the vending channel, drug stores, and military commissaries. International and Away From Home includes the sale of all products that are distributed in foreign countries through retail channels, as well as domestically and in foreign countries through foodservice distributors and operators (e.g., healthcare operators, restaurants, educational institutions, offices, lodging and gaming establishments, and convenience stores). \nSources and Availability of Raw Materials:\n The raw materials used in each of our segments are primarily commodities, agricultural-based products, and packaging materials. Green coffee, peanuts, flour, sugar, oils and fats, fruit, and other ingredients are obtained from various suppliers. The availability, quality, and cost of many of these commodities have fluctuated, and may continue to fluctuate over time, partially driven by the elevated commodity and supply chain costs we have continued to experience in 2025. We actively monitor changes in commodity and supply chain costs, and to mitigate the fluctuation of costs, we may be required to implement material price increases or decreases across our business. Futures, basis, options, and fixed-price contracts are used to manage price volatility for a significant portion of our commodity costs. Green coffee, along with certain other raw materials, is sourced solely from foreign countries, and its supply and price is subject to high volatility due to factors such as weather, global supply and demand, product scarcity, plant disease, investor speculation, geopolitical conflicts, changes in governmental agricultural and energy policies and regulations, and political and economic conditions in the source countries. We source peanuts, flour, sugar, oils and fats, and fruit mainly from North America. The principal packaging materials we use are plastic, glass, metal cans, caps, carton board, and corrugate.\n \nFor additional information on the commodities we purchase, see “Commodities Overview” within Management’s Discussion and Analysis of Financial Condition and Results of Operations in this Annual Report on Form 10-K.\nRaw materials are generally available from numerous sources, although we have elected to source certain plastic packaging materials for our \nFolgers\n®\n coffee products, as well as our \nJif\n®\n \npeanut butter, and certain finished goods, such as K-Cup\n®\n pods, our \nPup-Peroni\n®\n \ndog snacks, and liquid coffee, from primary or single sources of supply pursuant to long-term contracts. While availability may vary year to year, we have not historically encountered significant shortages of key raw materials, and we believe that we will continue to obtain adequate supplies. We consider our relationships with key raw material suppliers to be in good standing. \nTrademarks and Patents:\n Many of our products are produced and sold under various patents and patents pending, and marketed under trademarks owned or licensed by us or one of our subsidiaries. Our major trademarks as of April 30, 2025, are listed below. \nPrimary Reportable Segment\n  \nMajor Trademark\nU.S. Retail Coffee\nFolgers\n®\n, \nDunkin’\n®\n, and \nCafé Bustelo\n®\nU.S. Retail Frozen Handheld and Spreads\nUncrustables\n®\n,\n \nJif\n®\n,\n \nand \nSmucker’s\n®\n \nU.S. Retail Pet Foods\nMeow Mix\n®\n,\n Milk-Bone\n®\n, \nPup-Peroni\n®\n, and \nCanine Carry Outs\n®\nSweet Baked Snacks \nHostess\n®\nOther \n(A)\n  \nFolgers\n, \nSmucker’s\n,\n \nand\n Uncrustables\n (A)  Represents the combined International and Away From Home operating segments. \nDunkin’ \nis a trademark of DD IP Holder LLC used under three licenses (the “Dunkin’ Licenses”) for packaged coffee products, including K-Cup\n®\n pods, sold in retail channels, such as grocery stores, mass merchandisers, club stores, e-commerce, and drug stores, as well as in certain away from home channels. The Dunkin’ Licenses do not pertain to coffee or other products for sale in \nDunkin’\n restaurants. The terms of the Dunkin’ Licenses include the payment of royalties to an affiliate of DD IP Holder LLC and other financial commitments by the Company. The Dunkin’ Licenses are in effect until January 1, 2039. Keurig\n®\n and K-Cup\n®\n are trademarks of Keurig Green Mountain, Inc. (“Keurig”), used with permission.\nSlogans or designs considered to be important trademarks include, without limitation, “\nWith A Name Like Smucker’s, It Has To Be Good\n®\n,” “\nThe Best Part of Wakin’ Up Is Folgers In Your Cup\n®\n,” “\nThat Jif’ing Good\n®\n,”\n \n“\nThe Only One Cats Ask For \n3\nBy Name\n®\n,” the \nSmucker’s\n banner, the\n Uncrustables\n Round, Crustless Sandwich design, the Crock Jar shape, the Gingham design, the \nJif \nColor Banner design, the\n Café Bustelo \nAngelina design, and the \nMilk-Bone,\n \nMeow Mix, \nand\n Hostess\n logos.\nWe own many patents worldwide in addition to utilizing proprietary trade secrets, technology, know-how processes, and other intellectual property rights that are not registered.\nWe consider all of our owned and licensed intellectual property, taken as a whole, to be essential to our business.\nSeasonality:\n The U.S. retail market segments do not experience significant seasonality, as demand for our products is generally consistent throughout the year. However, the Sweet Baked Snacks segment does experience moderate seasonality, with declines during the early winter period due to the holiday season.\nCustomers: \nSales to Walmart Inc. and subsidiaries amounted to 33 percent of net sales in both 2025 and 2024 and 34 percent of net sales in 2023. These sales are primarily included in our U.S. retail market segments. No other customer exceeded 10 percent of net sales for any year.\nDuring 2025, our top 10 customers, collectively, accounted for approximately 60 percent of consolidated net sales. Supermarkets, warehouse clubs, and food distributors continue to consolidate, and we expect that a significant portion of our revenues will continue to be derived from a limited number of customers. Although the loss of any large customer for an extended length of time could negatively impact our sales and profits, we do not anticipate that this will occur to a significant extent due to strong consumer demand for our brands.\nGovernment Business: \nNo material portion of our business is subject to renegotiation of profits or termination of contracts at the election of the government.\nCompetition:\n Our business is highly competitive as all of our brands compete with other branded products as well as private label products. In order to remain competitive, companies in the food industry need to consider emerging consumer preferences, technological advances, product and packaging innovations, and the growth of certain retail channels, such as the \ne-commerce market. The primary ways in which products and brands are distinguished include brand recognition, product quality, price, packaging, new product introductions, nutritional value, convenience, advertising, promotion, and the ability to identify and satisfy consumer preferences. Positive factors pertaining to our competitive position include well-recognized brands, high-quality products, consumer trust, experienced brand and category management, varied product offerings, product innovation, responsive customer service, and an integrated distribution network.\nThe packaged foods industry has been challenged by a general long-term decline in sales volume in the center of the store.  Certain evolving consumer trends have contributed to the longer-term decline, such as a heightened focus on health and wellness, an increased desire for fresh foods, and the growing impact of social media and e-commerce on consumer behavior. To address these dynamics, we continue to focus on innovation with an increased emphasis on products that satisfy evolving consumer trends. However, in recent years, there has been an increase in sales primarily driven by changes in consumer behaviors, including the increased frequency of employees working from home. \nIn addition, private label continues to be a competitor in the categories in which we compete, partially due to improvements in private label quality, the increased emphasis of store brands by retailers in an effort to cultivate customer loyalty, and a movement toward lower-priced offerings during economic downturns or instances of increased inflationary pressures. For the U.S. retail market segments, private label held a 15.2 dollar average market share during the 52 weeks ended April 20, 2025, for the categories in which we compete, as compared to a 13.7 dollar average market share during the same period in the prior year. We believe that both private label and leading brands play an important role in the categories in which we compete, appealing to different consumer segments. We closely monitor the price gap, or price premium, between our brands and private label brands, with the view that value is about more than price and the expectation that number one brands will continue to be an integral part of consumers’ shopping baskets. \n4\nOur primary brands and major competitors as of April 30, 2025, are listed below. \nOur Primary Products\nOur Primary Brands\nCompeting Brands\nCompetitors\nU.S. Retail Coffee\nMainstream roast and ground coffee\nFolgers \n(A)\n \nand \nCafé Bustelo\nMaxwell House \nand\n Yuban\nThe Kraft Heinz Company\nPrivate label brands\nVarious\nMcCafé\nKeurig Dr. Pepper\nCafe La Llave\nF. Gaviña & Sons, Inc.\nSingle serve coffee – K-Cup\n®\nDunkin’\n,\n Folgers\n,\n \nand\n Café Bustelo\nPrivate label brands\nVarious\nGreen Mountain Coffee \n(A)\n,\n Donut Shop\n,\n \nand \nMcCaf\né\nKeurig Dr. Pepper\nStarbucks\nNestlé S.A.\nPeet’s Coffee & Tea\nJDE Peet’s N.V.\nMaxwell House\n and \nGevalia\nThe Kraft Heinz Company\nPremium coffee\nDunkin’\nStarbucks \n(A)\n and\n Seattle’s Best Coffee\nNestlé S.A.\nPrivate label brands\nVarious\nPeet’s Coffee & Tea\nJDE Peet’s N.V.\nEight O’Clock\nTata Global Beverages Limited\nCommunity Coffee\nCommunity Coffee Company\nGevalia\nThe Kraft Heinz Company\nU.S. Retail Frozen Handheld and Spreads\nPeanut butter and specialty spreads\nJif \n(\nA)\nPrivate label brands\nVarious\nSkippy\nHormel Foods Corporation\nNutella\nFerrero SpA\nPeter Pan\nPost Holdings, Inc.\nFruit spreads\nSmucker’s \n(A)\nPrivate label brands\nVarious\nWelch’s\nWelch Foods Inc.\nBonne Maman\nAndros Foods USA, Inc.\nFrozen sandwiches and snacks\nSmucker’s Uncrustables\nHot Pockets \n(A)\nNestlé S.A.\nTotino’s\nGeneral Mills, Inc.\nEl Monterrey\nRuiz Foods\nPrivate label brands\nVarious\nU.S. Retail Pet Foods\nMainstream cat food\nMeow Mix\nCat Chow \n(A)\n,\n Friskies\n,\n Kit & Kaboodle\n,\n \nand\n Fancy Feast\nNestlé Purina PetCare Company\nIams \nand\n Sheba\nMars, Incorporated\nPet snacks\nMilk-Bone \n(A)\n,\n Pup-Peroni\n,\n \nand \nCanine Carry Outs\nBeggin’ Strips\nNestlé Purina PetCare Company\nBlue Buffalo \nand \nNudges\nGeneral Mills, Inc.\nDentastix, Greenies and Temptations\nMars, Incorporated\nPrivate label brands\nVarious\nSweet Baked Snacks\nSweet baked goods\nHostess\nLittle Debbie \n(A)\nMcKee Foods Corporation\nEntenmann’s\nGrupo Bimbo, S.A.\nPrivate label brands\nVarious, Flower Foods, Inc. \n5\nInternational and Away From Home\nFoodservice hot beverage\nFolgers\n,\n 1850\n®\n, and\n Café Bustelo\nStarbucks\nNestlé S.A.\nPrivate label brands\nVarious\nNescafé\nSociété des Produits Nestlé S.A.\nFoodservice portion control\nSmucker’s\n and \nJif\nPrivate label brands\nVarious, including Diamond Crystal Brands\nHeinz\n,\n Welch’s\n,\n \nand\n \nPrivate Label Brands\nThe Kraft Heinz Company\nFoodservice frozen handheld\nSmucker’s Uncrustables\nHot Off the Grill\nIntegrated Food Service\nClassic Delight\nClassic Delight Inc.\nCanada coffee\nFolgers\nTim Hortons \n(A)\nRestaurant Brands International Inc.\nMaxwell House\nThe Kraft Heinz Company\nPrivate label brands\nVarious\nCanada flour\nRobin Hood\n® (A)\n \nand\n Five Roses\n®\nPrivate label brands\nVarious\n(A)  Identifies the current market leader within the product category. In certain categories, the market leader is not identified as two or more brands compete for the largest share. \nGovernment Regulations: \nOur operations are subject to various regulations and laws administered by federal, state, and local government agencies in the U.S., including the U.S. Food and Drug Administration (the “FDA”), U.S. Federal Trade Commission, U.S. Departments of Agriculture, Commerce, and Labor, and U.S. Environmental Protection Agency. Additionally, we are subject to regulations and laws administered by government agencies in Canada and other countries in which we have operations and our products are sold. In particular, the manufacturing, marketing, transportation, storage, distribution, packaging disposal, and sale of food products are each subject to governmental regulation that is increasingly extensive. Governmental regulation encompasses such matters as ingredients (including whether a product contains bioengineered ingredients or artificial dyes), packaging and disposal of packaging (including extended producer responsibility regulations), labeling (including use of certain terms such as sugar free, healthy, low sodium, and low fat), pricing, advertising, relations with distributors and retailers, health, safety, data privacy and security, and anti-corruption, as well as environmental policies relating to climate change, regulating greenhouse gas emissions, energy, and sustainability, including single-use plastics. We are subject to tax and securities regulations, accounting and reporting standards, and other financial laws and regulations. We rely on legal and operational compliance programs, including in-house and outside counsel, to guide our business in complying with applicable laws and regulations of the countries in which we do business. We believe we are in compliance with such laws and regulations and do not expect continued compliance to have a material impact on our capital expenditures, earnings, or competitive position in 2026. \nEnvironmental Matters:\n Compliance with environmental regulations relating to climate change, regulating greenhouse gas emissions, energy, and sustainability, including single-use plastics, and prioritizing our environmental sustainability efforts are important to us as a responsible corporate citizen. As such, we have public goals related to waste diversion, water usage, energy usage, greenhouse gas emissions, and sustainable packaging. In support of our commitment to environmental sustainability, we have implemented and manage a variety of programs across our operations, including energy optimization, utilization of renewable energy, water conservation, recycling, and, in our supply chains, we support projects that increase sustainable practices. We continue to evaluate and modify our processes to further limit our impact on the environment.\nHuman Capital Management: \nOur values and principles are rooted in our \nBasic Beliefs \nto \nBe Bold\n,\n Be Kind\n,\n Do the Right Thing\n,\n Play to Win\n,\n \nand\n Thrive Together\n, which\n \nserve as the foundation for everything we do as an organization and are clear, concise, and actionable to help our employees continue to bring our unique culture to life, as our employees are among our most important resources. Our employees are critical to our success as a company, and we are committed to supporting them holistically, both personally and professionally. With over 8,000 full-time employees worldwide, every employee makes a difference to our Company. We believe our basic belief, \nThrive Together, \ntakes proactive steps to ensure we are enabling our employees to reach their full potential. To hold ourselves accountable, we conduct an employee engagement survey annually to provide an opportunity for open and confidential feedback from our employees and to help guide our priorities for the upcoming fiscal year. Additionally, we conduct functional pulse surveys as needed to gain additional information based on responses to the larger engagement survey, or in sub-groups of our employee population where a specific topic or question may be needed. These surveys are supplemented by regular Company Town Halls, which help to foster an environment of transparency and two-way communication. Employees have the opportunity to anonymously report violations of the Commitment to Integrity: Our Code (“Code of Conduct”) or complaints regarding accounting, auditing, and financial-related \n6\nmatters through our Integrity Portal (“Portal”). The Portal also can be utilized by customers, contractors, vendors, and their employees, as well as any others in a business relationship with our Company. To further support our commitment to ethics and our basic belief, \nDo the Right Thing\n, our employees are also asked to participate in Ethics and Compliance Surveys, to help us understand our strengths and identify opportunities for future ethics and compliance programs and training. We track our progress in the Ethics and Compliance space through ongoing assessments of our internal programs and through our Ethics and Compliance Survey, as well as through dedicated questions included in our annual Employee Engagement Survey, and we are pleased to share that our Company was once again recognized in 2025 as one of the World’s Most Ethical Companies by Ethisphere, a global leader in business ethics.\nIn conjunction with our\n \nbasic belief, \nThrive Together\n, we continue to advance on our three business imperatives that have guided our work for many years:\n•\nTo foster a safe, welcoming, and respectful workplace consistent with \nOur Commitment to Each Other\n and our \nBasic Beliefs\n;\n•\nTo cultivate and develop a workforce that reflects the consumers we serve and the communities in which we live and work; and\n•\nTo drive business growth while also helping our Company’s constituents thrive.\nOur \nThrive Together \nbasic belief is authentic to who we are and consists of five pillars: (1) community, (2) career, (3) health and wellness, (4) financial, and (5) family – each meant to support our employees’ varied interests and needs. \nCommunity:\n \nWe believe having a culture that supports all employees allows us to attract and retain talented professionals with unique skills, thoughts, and experiences across our business while helping them cultivate deeper connections at work, home, and in our communities. In support of our business imperatives, we have made important progress on our commitment to create an environment where our employees are supported, differences are truly celebrated, and individuality is appreciated. We have established employee resource groups, which are employee-led groups that represent a unique community and welcome all employees to join as either a member or ally. \nSupporting the communities where we live and work has been a Company priority since our inception and is aligned with our basic belief, \nBe Kind\n. Through our many partnerships, we are able to understand the needs and support required within our local communities and leverage these relationships to make the connections necessary to offer this critical assistance. This past year we donated more than $10 million to over 100 philanthropic partners, including local food banks, the American Red Cross\n®\n, United Way\n®\n, and Feeding America\n®\n.  \nAlong with our long-term national partnerships, we also have dedicated programming to support the unique needs of those in our communities. Examples include our consistent support of local food banks; expanding our work with Akron Children’s Hospital through the launch of the Smucker’s Berry Good Reading Program to encourage adolescent literacy; volunteerism, corporate donations, and employee engagement to aid the National Alliance on Mental Illness, the largest grassroots mental health organization dedicated to building better lives for Americans battling mental illness; and our brand engagements, such as \nMilk-Bone \nwhich provides funding for Canine Assistants, an organization dedicated to placing service dogs with people who need them most.\n \nWe are fortunate to have the expertise and passion of talented employees who help us deliver high-quality products to our customers and consumers across North America and who share our commitment to ensure that people, pets, and communities where we live and work have access to the support and essential resources they need. We believe it is important to celebrate their contributions, including recognizing organizations about which they are especially passionate. One way we do this is through our Company Matching Gift Program, which gives employees the opportunity to donate to partner charities and have their donation matched by the Company, dollar-for-dollar, from a minimum of $5 up to a maximum of $2,500 per calendar year per employee. Furthermore, the Company Matching Gift Program credits our employees’ Smucker Giving accounts for each hour of volunteering done for a non-profit charity, and these funds can be donated to an approved charity of the employee’s choice.\nIn addition, this past year we coordinated an initiative to evaluate our local market relationships to create more opportunities for us to connect in meaningful and impactful ways. As part of this work, we increased funding from our operational sites to organizations in the communities where we live and work, making a difference for our families, friends, and neighbors.\n7\nCareer:\n \nWe strive to foster an environment of growth and continuous learning for our people with a focus on our basic belief,\n Play to Win\n. We support and challenge our employees to increase their knowledge, skills, and capabilities through all phases of their career. We believe that we offer one of the best cultures in the food industry. As part of our work to retain this unique culture, we offer numerous learning and development opportunities to support a long and prosperous career for our employees. Our Employee Development programs offer foundational instruction on Company culture and provide employees additional learning opportunities throughout their careers to help them reach their full potential. This is reflected in annual reviews, which allow management and employees to partner and determine specific opportunities for growth within each role through important work, new experiences generated through a dynamic environment, regular feedback, and purposeful development opportunities. Building a career at our Company is fundamental to who we are and is evidenced by our Executive Leadership Team, where 4 of 6 members were promoted from within, and our trailing 12-month turnover remains below the industry average. While the current labor market presents significant challenges for employers, we have made differential investments in our talent acquisition tools and programs to help us continue to attract the right candidates.\nIn addition, we are committed to providing the tools and resources our employees need to learn, develop, and grow with us, including virtual sessions. A suite of online training and education programs is available to our employees, ranging from role-specific training to education on soft skills and our Company culture. Through these tools and resources, in 2025, we coordinated over 27,000 hours of professional development training for our employees. Our best-in-class “Discovering the Art of Leadership” series, developed in collaboration with Case Western Reserve University, teaches our people managers how to effectively lead teams and develop employees. We dedicate time to developing and coaching our people managers to provide support to our employees holistically. This means promoting resonant leadership and the practice of emotional intelligence and mindfulness, so our people managers have the knowledge and tools to support the unique needs of each employee. Our total rewards program also includes tuition assistance.\nFostering an environment for growth and continuous learning for our employees is an important priority of our Company. However, our commitment to education also includes our communities as evidenced by our partnerships with organizations passionate about improving access to quality education. We have partnered with Akron Children’s Hospital to launch the Smucker's Berry Good Reading Program, which provides books to children during annual well visits. We also continue to support our long-time partners including the Boys & Girls Clubs of America\n®\n and Junior Achievement USA\n®\n, among others, which offer programming focused on childhood growth and development. \nHealth and Wellness:\n \nMaintaining a safe and healthy workplace is among our top priorities and is aligned with our basic belief,\n Do the Right Thing\n. We are diligent in ensuring workforce health and safety through education and training which is provided at all locations. Our health and safety internal assessments conducted at each of our production facilities quarterly, as well as periodic external assessments, confirm our compliance with safety regulations and corporate policies. The teams document the results and determine corrective actions to ensure we hold ourselves accountable for providing a safe work environment. During 2025, we achieved a total recordable incident rate that is less than half of the national average for our industry peers as a result of these efforts. \nAs part of our focus on well-being, we emphasize the need for our employees to embrace healthy lifestyles. We offer all employees a variety of free and discounted services, as well as educational opportunities, to support their physical, emotional, and financial well-being, including free sessions through our Employee Assistance Program. We also offer onsite conveniences, such as health and wellness centers at several of our locations and a Child Development Center at our corporate headquarters in Orrville, Ohio. In addition, we provide our employees with paid time off to renew and programs to promote workplace flexibility.\nFurther, we have continued to promote the importance of self-care and the availability of mental health resources to our employees. In recognition of the need for mental health resources across society, we have partnered with the National Alliance on Mental Health to provide support for our employees and communities. Their mental health services and self-care programs benefit our employees by raising awareness and providing additional support and education for mental health. Additionally, we partner with The Village Network on their Early Childhood Mental Health initiatives. This commitment provides access to important mental health and educational services for families and their children from birth to age five and is provided by Therapeutic Childcare Centers.\nFinancial:\n In support of our basic beliefs,\n Be Kind \nand \nPlay to Win\n,\n \nwe believe in paying for performance and compensating our employees at market competitive rates and utilizing performance-based awards to support the overall well-being of our employees. Additionally, we employ an incentive program for eligible participants to reward both shared Company results and strong individual performance. Our Total Rewards program offers competitive, comprehensive benefits to meet the \n8\nunique needs of each employee at each life stage, including insurance coverage options for domestic partners in addition to married couples, a retirement savings program with a Company match, access to spending accounts and educational resources, including those available from our partners, to help employees navigate their immediate financial needs and prepare for long-term financial security. \nWe are committed to paying our employees fairly and equitably. To that end, we conduct a pay equity analysis each year and, with the support of our Compensation and People Committee, make necessary adjustments to make sure that similarly situated employees are paid equitably.\nLastly, we have an established working hours policy to clarify shared expectations but continue to review the professional environment to determine how to effectively manage it. As we looked at how to address the evolving workplace at our Company, it was important to us to deliver on our employees’ needs and expectations while enabling collaboration and supporting continued productivity to deliver our business objectives. To realize this, our corporate workplace model is focused on the idea of presence with purpose. We plan around core weeks, where we encourage employees to be in office three days per week. To us, true flexibility is not simply establishing a specific number of days in the office, and we have approached the development of our model based on guiding principles. Employees have shared an appreciation of the balance this model provides, allowing them the flexibility they desire with the consistent opportunity to engage with colleagues in person, which also remains important to them. While we are pleased with the results of the working hours policy to date, we will continue to evaluate and adjust, if needed. \nFamily:\n \nOur approach to paid time off is competitive with our industry peers, which includes at least three weeks of paid time off (and increases based on an employee’s tenure), 12 paid Company holidays per calendar year, including a floating holiday, which can be used at the employee’s discretion to observe and celebrate occasions that align with their personal interests and beliefs, 12 weeks of parental leave, in addition to short-term disability available to birth mothers, and pet bereavement leave. In addition, our family-building benefits support the desire for all aspiring parents to build their family through enhanced fertility benefits through a third-party partner, as well as enhanced adoption and surrogacy financial support. Our rewards program also addresses the holistic needs of our employees by supporting their physical well-being, providing tools and resources to help them actively take responsibility, share in the cost, and make the best decisions regarding their personal well-being. These programs provide resources that respond to their changing needs throughout their careers, including access to our Child Development Center, pet insurance, paid bereavement leave, and expanded parental leave for both parents.\nAdditional information regarding our human capital management is available in our 2024 Corporate Impact Report that can be found on our website at investors.jmsmucker.com/overview/default.aspx. Information on our website, including our 2024 Corporate Impact Report, is not incorporated by reference into this Annual Report on Form 10-K. \nInformation about our Executive Officers: \nThe names, ages as of June 11, 2025, and current positions of our executive officers are listed below. All executive officers serve at the pleasure of the Board, with no fixed term of office.\nName\nAge\nYears\nwith\nCompany\nPosition\nServed as\nan Officer\nSince\nMark Smucker\n55\n27\nChief Executive Officer and Chair of the Board \n(A)\n2001\nJohn Brase\n57\n5\nPresident and Chief Operating Officer \n(B)\n2020\nJeannette Knudsen\n55\n22\nChief Legal Officer and Secretary \n(C)\n2009\nTucker Marshall\n49\n13\nChief Financial Officer \n(D)\n2020\nJill Penrose\n52\n21\nChief People and Corporate Services Officer \n(E)\n2014\n(A)\nMr. Mark Smucker was elected to his present position in April 2025, having previously served as Chair of the Board, President, and Chief Executive Officer since August 2022. Prior to that time, he served as President and Chief Executive Officer since May 2016.\n(B)\nMr. Brase was elected to his present position in April 2025, having previously served as Chief Operating Officer since April 2020.  Prior to the time, he served at The Procter & Gamble Company (“P&G”) for 30 years. He was the Vice President and General Manager of P&G’s North American Family Care business from April 2016 through March 2020.\n(C)\nMs. Knudsen was elected to her present position in September 2022, having served as Chief Legal and Compliance Officer and Secretary since November 2019. Prior to that time, she served as Senior Vice President, General Counsel and Secretary since May 2016.\n9\n(D)\nMr. Marshall was elected to his present position in May 2020, having served as Senior Vice President and Deputy Chief Financial Officer since November 2019. Prior to that time, he served as Vice President, Finance since May 2016.\n(E)\nMs. Penrose was elected to her present position in March 2023, having served as Chief People and Administrative Officer since November 2019. Prior to that time, she served as Senior Vice President, Human Resources and Corporate Communications since May 2016. \nAvailable Information:\n Access to all of our Securities and Exchange Commission (“SEC”) filings, including our Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), is provided, free of charge, on our website (investors.jmsmucker.com/sec-filings) as soon as reasonably practicable after such reports are electronically filed with, or furnished to, the SEC.",
    "item1a": "Item 1A.    Risk Factors. \nOur business, operations, and financial condition are subject to various risks and uncertainties. The following risk factors should be carefully considered, together with the other information contained or incorporated by reference in this Annual Report on Form 10-K and our other filings with the SEC, in connection with evaluating the Company, our business, and the forward-looking statements contained in this Annual Report. Although the risks are organized and described separately, many of the risks are interrelated. Additional risks and uncertainties not presently known to us or that we currently deem immaterial also may affect us. The occurrence of any of these known or unknown risks could have a material adverse impact on our business, financial condition, and results of operations.\nRisks Related to Our Business\nDeterioration of national and global macroeconomic conditions, an economic recession or slow growth, periods of inflation, or economic uncertainty in key markets may adversely affect consumer spending and demand for our products.\nNational and global macroeconomic conditions can be uncertain and volatile. We have in the past been, and may continue to be, adversely affected by changes in national and global macroeconomic conditions, such as inflation, rising interest rates, tax rates, availability of capital markets, consumer spending rates, energy availability and costs, supply chain challenges (including new or increased tariffs imposed by the U.S. and retaliatory tariffs by other countries), labor shortages, geopolitical conflicts, \nthe negative impacts caused by pandemics and public health crises, and growing recession risk.\nVolatility in financial markets and deterioration of national and global macroeconomic conditions could impact our business and results of operations in a number of ways, including, but not limited to, the following:\n•\nfinancial instability of our customers and suppliers could result in additional bad debts or non-performance;\n•\nvalue of our investments in debt and equity securities may decline;\n•\nfuture volatility or disruption in the capital and credit markets could negatively impact our liquidity or increase costs of borrowing; \n•\nan impairment in the carrying value of goodwill, other intangible assets, or other long-lived assets, or a change in the useful life of finite-lived intangible assets could occur if there are sustained changes in consumer purchasing behaviors, government restrictions, financial results, or a deterioration of macroeconomic conditions;\n•\nvolatility in commodity and other input costs could continue due to adverse macroeconomic conditions;\n•\nconsumers could choose to purchase private label or competitive products of our lower-priced products as a result of an economic downturn; and\n•\ntiming, duration, and extent of new or increased tariffs on imports and exports and the expected retaliatory measures on U.S. goods and the impact on our business are uncertain.\nThese and other impacts of global and national macroeconomic conditions could also heighten many of the other risk factors discussed in this section. Our sensitivity to economic cycles and any related fluctuation in consumer demand could negatively impact our business, results of operations, financial condition, and liquidity.\n10\nOur operations are subject to the general risks associated with acquisitions, divestitures, and restructuring programs. Specifically, we may not realize all of the anticipated benefits of the acquisition of Hostess Brands, or those benefits may take longer to realize than expected. We may also encounter significant unexpected difficulties in integrating the Hostess Brands business and may be unable to effectively manage stranded overhead resulting from recent divestitures.\nOur stated strategic vision is to engage, delight, and inspire consumers by building brands they love and leading in growing categories. We have historically made strategic acquisitions of brands and businesses and intend to do so in the future in support of this strategy. If we are unable to complete acquisitions or successfully integrate and develop acquired businesses, including the effective management of integration and related restructuring costs, we could fail to achieve the anticipated synergies and cost savings, or the expected increases in revenues and operating results. Additional acquisition risks include the diversion of management attention from our existing business, potential loss of key employees, suppliers, or consumers from the acquired business, assumption of unknown risks and liabilities, and greater than anticipated operating costs of the acquired business. Any of these factors could have a material adverse effect on our financial results.\nIn particular, our ability to realize\n the anticipated benefits of the acquisition of Hostess Brands will depend on our ability to\n achieve synergies and cost savings, while overcoming executional hurdles\n. The combination of two independent businesses is a complex, costly, and time-consuming process. As a result, \nmanagement has devoted a significant amount of time and attention to integrate the Hostess Brands’ business into our Company and resolve operational difficulties. The integration process may disrupt the businesses and, if implemented ineffectively or if impacted by unforeseen negative economic or market conditions or other factors, we may not realize the full anticipated benefits of the acquisition. \nOur failure to meet the challenges involved in integrating the two businesses and to realize the anticipated benefi\nts of the acquisition could cause an interruption of, or a loss of momentum in, our activities and could adversely affect our results of operations or cash flows, cause dilution to our earnings per share, decrease or delay any accretive effect of the transaction, and negatively impact the price of our common shares.\nSpecifically, the difficulties of combining the operations of Hostess Brands with our business include, among others: \n•\nthe diversion of management’s attention to acquisition matters;\n•\ndifficulty in achieving anticipated cost savings, synergies, business opportunities, and growth prospects from combining the Hostess Brands business with our business;\n•\ndifficulties in managing the expanded operations of a significantly larger and more complex company; \n•\nchallenges in keeping existing customers and obtaining new customers; \n•\nchallenges in attracting and retaining key personnel; \n•\nunanticipated expenses resulting from integration activities and disputes with third parties; and \n•\nunanticipated liabilities, such as environmental liabilities resulting from contamination at our properties or those of third parties. \n \nIn addition, we have made strategic divestitures of brands and businesses, including the recent divestitures of certain \nSweet Baked Snacks value brands and the \nVoortman\n business,\n as well as past divestitures of the Canada condiment and \nSahale Snacks\n businesses, and certain pet food brands, among others, and we may continue to do so in the future. If we are unable to complete divestitures or successfully transition divested businesses, including the effective management of the related separation and stranded overhead costs, transition services, and the maintenance of relationships with customers, suppliers, and other business partners, our business and financial results could be negatively impacted. Further, we may incur asset impairment charges related to divestitures that reduce our profitability. Divestitures and related restructuring and integration costs require a significant amount of management and operational resources. These additional demands could divert management’s attention from core business operations, potentially adversely impacting existing business relationships and employee morale, resulting in negative impacts on our financial performance. For more information, see Note 2: Acquisition\n, \nNote 3: Divestitures, and Note 4: Special Project Costs.\nOur proprietary brands, packaging designs, and manufacturing methods are essential to the value of our business, and the inability to protect our intellectual property could harm the value of our brands and adversely affect our sales and profitability.\nThe success of our business depends significantly on our brands, know-how, and other intellectual property. We rely on a combination of trademarks, service marks, trade secrets, patents, copyrights, licensing agreements, and similar rights to protect our intellectual property. The success of our growth strategy depends on our continued ability to use our existing trademarks and service marks in order to maintain and increase brand awareness and further develop our brands. If our efforts \n11\nto protect our intellectual property are not adequate, such as in the event of a cybersecurity incident, if any third party misappropriates or infringes on our intellectual property, or if we are alleged to be misappropriating or infringing on the intellectual property rights of others, the value of our brands may be harmed, which could have a material adverse effect on our business. From time to time, we are engaged in litigation to protect our intellectual property, which could result in substantial costs as well as diversion of management attention.\nIn particular, we consider our proprietary coffee roasting methods essential to the consistent flavor and richness of our coffee products and, therefore, essential to our coffee brands. Because many of the roasting methods we use are considered our trade secrets and not protected by patents, it may be difficult for us to prevent competitors from copying our coffee products if such coffee roasting methods are independently discovered or become generally known in the industry. We also believe that our packaging innovations, such as our \nAromaSeal\n™\n canisters, are important to the coffee business’ marketing and operational efforts. In addition, we utilize a number of proprietary methods for manufacturing our \nUncrustables\n sandwiches, which we believe are essential to producing high-quality sandwiches that consistently meet consumer expectations. Since the current methods used in making our sandwiches are considered our trade secrets and not protected by patents, it may be difficult for us to prevent competitors from copying our sandwiches if such sandwich-making methods are independently discovered or become generally known in the industry. If our competitors copy or develop more advanced coffee roasting or packaging or sandwich-making methods, the value of our coffee products or \nUncrustables\n brand, respectively, may be diminished, and we could lose customers to our competitors. \nIn addition, certain of our intellectual property rights, including the \nDunkin’ \ntrademarks, are owned by third parties and licensed to us. These trademarks are renegotiated and renewed pursuant to their terms, and if in the future, we are unable to renew or fail to renegotiate the licensing arrangements, then our financial results could be materially and negatively affected.\nLoss or interruption of supply from primary or single-source suppliers of raw materials and finished goods could have a disruptive effect on our business and adversely affect our results of operations.\nWe have elected to source certain raw materials, such as packaging for our \nFolgers\n coffee products, as well as our \nJif \npeanut butter, and certain finished goods, such as K-Cup\n®\n pods, our \nPup-Peroni\n dog snacks, and liquid coffee, from primary or single sources of supply. While we believe that, except as set forth below, alternative sources of these raw materials and finished goods could be obtained on commercially reasonable terms, loss or an extended interruption in supplies from a primary or single-source supplier would result in additional costs, could have a disruptive short-term effect on our business, and could adversely affect our results of operations.\nKeurig is our single-source supplier for K-Cup\n®\n pods, which are used in its proprietary Keurig\n®\n K-Cup\n®\n brewing system. In addition, JDE Peet’s N.V. (“JDE Peet’s”) is our single-source supplier for liquid coffee for our Away From Home business, and there are a limited number of manufacturers other than JDE Peet’s that are able to manufacture liquid coffee. Further, Graham Packaging Company, L.P. (“Graham Packaging”) is our single-source supplier for the packaging of our \nFolgers\n coffee products. If either Keurig, JDE Peet’s, or Graham Packaging is unable to supply K-Cup\n®\n pods, liquid coffee, or packaging for \nFolgers \ncoffee products, respectively, to us for any reason, it could be difficult to find an alternative supplier for such goods on commercially reasonable terms, which could have a material adverse effect on our results of operations.\nCertain of our products are produced at single manufacturing sites.\nWe have consolidated our production capacity for certain products into single manufacturing sites, including substantially all of our coffee, \nMilk-Bone\n dog snacks, and fruit spreads. We could experience a production disruption at these or any of our manufacturing sites resulting in a reduction or elimination of the availability of some of our products. If we are not able to obtain alternate production capability in a timely manner, our business, financial condition, and results of operations could be adversely affected.\nA significant interruption in the operation of any of our supply chain or distribution capabilities could have an adverse effect on our business, financial condition, and results of operations.\nOur ability and the ability of our third-party suppliers, service providers, distributors, and contract manufacturers to manufacture, distribute, and sell products is critical to our success. A significant interruption in the operation of any of our manufacturing or distribution capabilities, or the manufacturing or distribution capabilities of our suppliers, distributors, or contract manufacturers, or a service failure by a third-party service provider, whether as a result of adverse weather conditions or a natural disaster, fire, or water availability, as a result of climate change or otherwise; work stoppage or labor \n12\nshortages; cybersecurity breaches; political instability, terrorism, or geopolitical conflicts; pandemic illness; government restrictions or government trade policies (including new or increased tariffs imposed by the U.S. and retaliatory tariffs by other countries); or other causes could significantly impair our ability to operate our business. In particular, substantially all of our coffee production takes place in New Orleans, Louisiana and is subject to risks associated with hurricane and other weather-related events, and some of our production facilities are located in places where tornadoes or wildfires can frequently occur, such as Alabama, Kansas, Arkansas, and California. Failure to take adequate steps to mitigate or insure against the likelihood or potential impact of such events, or to effectively manage such events if they occur, could adversely affect our business, financial condition, and results of operations. While we insure against many of these events and certain business interruption risks and have policies and procedures to manage business continuity planning, such insurance may not compensate us for any losses incurred and our business continuity plans may not effectively resolve the issues in a timely manner.\nOur business could be harmed by strikes or work stoppages.\nAs of April 30, 2025, 22 percent of our full-time employees, located at nine manufacturing locations, are covered by collective bargaining agreements. These contracts vary in term depending on location, with three contracts expiring in 2026, representing approximately 10 percent of our total employees. We cannot be certain that we will be able to renew these collective bargaining agreements on the same or more favorable terms as the current agreements, or at all, without production interruptions caused by labor stoppages. If a strike or work stoppage were to occur in connection with negotiations of a new collective bargaining agreement or as a result of disputes under collective bargaining agreements with labor unions, our business, financial condition, and results of operations could be materially adversely affected.\nThe success of our business depends substantially on consumer perceptions of our brands.\nWe are the branded market leader in several categories both in the U.S. and Canada. We believe that maintaining and continually enhancing the value of our brands is critical to the success of our business. Brand value is based, in large part, on consumer perceptions. Success in promoting and enhancing brand value depends on our ability to provide high-quality products. Brand value could diminish significantly as a result of a number of factors, such as if we fail to preserve the quality of our products, if there are concerns about the safety of our products, if we are perceived to act in an irresponsible manner, if the Company or our brands otherwise receive negative publicity, if our brands fail to deliver a consistently positive consumer experience, or if our products become unavailable to consumers. The growing use of social and digital media by consumers increases the speed and extent that information and opinions can be shared. Negative posts or comments about us, our brands, or products on social or digital media could damage our brands and reputation. If we are unable to build and sustain brand equity by offering recognizably superior products, we may be unable to maintain premium pricing over private label products. If our brand values are diminished, our revenues and operating results could be materially adversely affected. In addition, anything that harms the \nDunkin’ \nbrand could adversely affect the success of our exclusive licensing agreements with the owner of that brand.\nWe may not be able to attract, develop, and retain the highly skilled people we need to support our business, and our results could be adversely impacted as a result of increased labor and employee-related expenses.\nWe depend on the skills and continued service of key employees, including our experienced management team. In addition, our ability to achieve our strategic and operating goals depends on our ability to identify, recruit, hire, train, and retain qualified individuals, including, for example, all levels of skilled labor in our manufacturing facilities. We compete with other companies both within and outside of our industry for talented people, and we may lose key employees or fail to attract, recruit, train, develop, and retain other talented individuals. Any such loss, failure, or negative perception with respect to these individuals may adversely affect our business or financial results. In addition, activities related to identifying, recruiting, hiring, integrating, and training qualified individuals may require significant time and expense. We may not be able to locate suitable replacements for any key employees who leave or to offer employment to potential replacements on reasonable terms, each of which may adversely affect our business and financial results. \nOver the past few years, particularly related to operations, we have experienced an increasingly competitive labor market, lack of skilled labor with advanced capabilities developed over the course of a career, labor inflation, labor shortages in our supply chain as a result of national and global macroeconomic conditions, and like most in the national workforce, an increased demand for greater flexibility and control over work schedules. These challenges have resulted in, and could continue to result in, increased costs and could impact our ability to meet consumer demand, each of which may adversely affect our business and financial results.\n13\nWe may not realize the benefits we expect from our cost reduction and other cash management initiatives. \nWe continuously review our operations in an effort to pursue initiatives to reduce costs, increase effectiveness, and optimize cash flow. We may not realize all of the anticipated cost savings or other benefits from such initiatives. Other events and circumstances, such as financial or strategic difficulties, delays, or unexpected costs, may also adversely impact our ability to realize all of the anticipated cost savings or other benefits, or cause us not to realize such cost savings or other benefits on the expected timetable. If we are unable to realize the anticipated benefits, our ability to fund other initiatives may be adversely affected. Finally, the complexity of the implementation may require a substantial amount of management and operational resources. Our management team must successfully execute the administrative and operational changes necessary to achieve the anticipated benefits of the initiatives. These and related demands on our resources may divert the organization’s attention from other business issues, have adverse effects on existing business relationships with suppliers and customers, and impact employee morale. Any failure to implement these initiatives in accordance with our plans could adversely affect our business, operating efficiency, and financial results.\nDuring 2023, we created a Transformation Office to support our multi-year commitment to ongoing margin enhancement efforts, inclusive of the removal of stranded overhead costs associated with the recent divestitures of certain Sweet Baked Snacks value brands, the \nVoortman\n, Canada condiment, and \nSahale Snacks \nbusinesses, and certain pet food brands. The Transformation Office is focused on enterprise-wide continuous improvement strategies to ensure a pipeline of productivity initiatives and profit growth opportunities. It is comprised of cross-functional leaders at every level of our organization who help to establish new ways of working, along with sustainable efficiencies and cost reduction efforts throughout our Company. If we are unable to successfully implement our transformation initiatives, our business and results of operations could be adversely affected.\nOur success will depend on our continued ability to produce and successfully market products with extended shelf life.\nWe have made investments to extend the shelf life of our products, while maintaining such products\n’\n taste, texture, and quality. Extended shelf life (“ESL”) is an important component of our Direct-to-Warehouse model. Our ability to produce and successfully market existing and new products with ESL is important to our success. If we are unable to continue to produce our products with ESL or if such products are not accepted by consumers, we could be forced to make changes to our distribution model or products that could have an adverse effect on our product sales, financial condition, and operating results.\nRisks Related to Our Industry\nOur operations are subject to the general risks of the food industry.\nThe food industry is subject to risks posed by food spoilage and contamination, product tampering, mislabeling, food allergens, adulteration of food products resulting in product recall, consumer product liability claims, or regulatory investigations or actions. Our operations could be impacted by both genuine and fictitious claims regarding our products as well as our competitors’ products. In the event of product contamination, tampering, or mislabeling, we may need to recall some of our products. A widespread product recall could result in significant loss due to the cost of conducting a product recall, including destruction of inventory and the loss of sales resulting from the unavailability of product for a period of time. We could also suffer losses from a significant judgment or settlement of a claim or litigation or a regulatory action taken against us. In addition, we could be the target of claims of false or deceptive advertising under U.S. federal and state laws as well as foreign laws, including consumer protection statutes of some states. A significant product recall, a product liability judgment or settlement, a regulatory action, or false advertising claim, involving either us or our competitors, could also result in a loss of consumer confidence in our food products or the food category, and an actual or perceived loss of value of our brands, materially impacting consumer demand.\nWe are defendants in ongoing consumer litigation associated with a voluntary recall of select \nJif\n peanut butter products initiated in May 2022. The outcome and financial impact of this litigation cannot be predicted at this time. Accordingly, no loss contingency has been recorded for these matters as of April 30, 2025, and the likelihood of loss is not considered probable or reasonably estimable.\n14\nChanges in our relationships with significant customers, including the loss of our largest customer, could adversely affect our results of operations.\nSales to Walmart Inc. and subsidiaries amounted to 33 percent of net sales in 2025. These sales are primarily included in our U.S. retail market segments. Trade receivables – net at April 30, 2025, included amounts due from Walmart Inc. and subsidiaries of $172.3, or 28 percent of the total trade receivables – net balance. During 2025, our top 10 customers, collectively, accounted for approximately 60 percent of consolidated net sales. We expect that a significant portion of our revenues will continue to be derived from a limited number of customers as the traditional retail grocery environment continues to consolidate and as dollar stores, club stores, and e-commerce retailers have experienced growth. Our customers are generally not contractually obligated to purchase from us as we do not have long-term supply contracts with any of our major customers. These customers make purchase decisions based on a combination of price, promotional support, product quality, consumer demand, customer service performance, their desired inventory levels, and other factors. Changes in customers’ strategies, including a reduction in the number of brands they carry or a shift of shelf space to private label products or other companies’ branded products, may adversely affect sales and profitability. Customers also may respond to price increases by reducing distribution, resulting in reduced sales of our products. Additionally, our customers may face financial or other difficulties that may impact their operations and their purchases from us, which could adversely affect our results of operations. A reduction in sales to one or more major customers could have a material adverse effect on our business, financial condition, and results of operations.\nWe operate in the competitive food industry and continued demand for our products may be affected by our failure to effectively compete or by changes in consumer preferences.\nWe face competition across our product lines from other food and snack companies with competition based primarily on pro\nduct quality, price, packaging, product innovation, nutritional value, ingredient content, taste, convenience, customer service, advertising, promotion, and brand recognition and loyalty. Continued success is dependent on product innovation, the ability to secure and maintain adequate retail shelf space and to compete in new and growing channels, and effective and sufficient trade merchandising, advertising, and marketing programs. In particular, technology-based systems, which give consumers the ability to shop through e-commerce websites and mobile commerce applications, are also significantly altering the retail landscape in many of our markets and intensifying competition by simplifying distribution and lowering barriers to entry. We are committed to serving customers and consumers in e-commerce, transforming our manufacturing, commercial, and corporate operations through digital technologies, and enhancing our data analytics capabilities to develop new commercial insights. However, if we are unable to effectively compete in the expanding e-commerce market, adequately leverage technology to improve operating efficiencies (including artificial intelligence, machine learning, and augmented reality), or develop the data analytics capabilities needed to generate actionable commercial insights, our business performance may be impacted, which may negatively impact our financial condition and results of operations.  \nSome of our competitors have substantial financial, marketing, and other resources, and competition with them in our various markets, channels, and product lines could cause us to reduce prices, increase marketing or other expenditures, or lose category share. Category share and growth could also be adversely impacted if we are not successful in introducing new products. Introduction of new products an\nd product extensions requires significant development, marketing investment, and consideration of our diverse consumer base. If our products fail to meet consumer preferences, or we fail to introduce new and improved products on a timely basis, then the return on that investment will be less than anticipated and our strategy to grow sales and profits through investment in innovation will be less successful. In addition, if sales generated by new products cause a decline in our sales of our existing products, our financial condition and results of operations could be negatively affected. In order to generate future revenues and profits, we must continue to sell products that appeal to our customers and consumers. Specifically, there are a number of trends in consumer preferences that may impact us and the food industry as a whole, including convenience, flavor variety, an emphasis on health and wellness, including weight management (e.g., the use of medications and dieting), the desire for transparent product labeling, and simple and natural ingredients.\nFurther, weak economic conditions, recessions, significant inflation, severe or unusual weather events, pandemics, and other factors (including new or increased tariffs imposed by the U.S. and retaliatory tariffs by other countries) could affect consumer preferences and demand, causing a strain on our supply chain due, in part, to retailers, distributors, or carriers modifying their restocking, fulfillment, or shipping procedures. Failure to respond to these changes could negatively affect our financial condition and results of operations.\n15\nWe may be limited in our ability to pass cost increases onto our customers in the form of price increases or may realize a decrease in sales volume to the extent price increases are implemented.\nWe may not be able to pass some or all of any increases in the price of raw materials, energy, and other input costs (including new or increased tariffs imposed by the U.S. and retaliatory tariffs by other countries) to our customers by raising prices or decreasing product size. To the extent competitors do not also increase their prices or decrease product size, customers and consumers may choose to purchase competing products, including private label or other lower-priced offerings, which may adversely affect our results of operations or our market share.\nConsumers may be less willing or able to pay a price differential for our branded products and may increasingly purchase lower-priced offerings or may forego some purchases altogether, especially during economic downturns or instances of increased inflationary pressures. Retailers may also increase levels of promotional activity for lower-priced offerings as they seek to maintain sales volumes during times of economic uncertainty. Accordingly, sales volumes of our branded products could be reduced or lead to a shift in sales mix toward our lower-margin offerings. As a result, decreased demand for our products or a shift in sales mix toward lower-margin offerings may adversely affect our results of operations or our market share. \nWe must leverage our brand value to comp\nete against private label products and lower-priced alternative brands.\nIn nearly all of our product categories, we compete against branded products as well as private label products. Our products must provide higher value and/or quality to our consumers than alternatives, particularly during periods of economic uncertainty, weakness, or inflation. Consumers may not buy our products if relative differences in value and/or quality between our products and private label products change in favor of competitors’ products or if consumers perceive this type of change and choose the lower-priced brands. If consumers prefer private label products, which are typically sold at lower prices, then we could lose category share or sales volumes and/or shift our product mix to lower margin offerings, which could have a material effect on our business, financial position, and results of operations.\nOur ability to competitively serve customers depends on the availability of reliable transportation. Increases in logistics and other transportation-related costs could adversely impact our results of operations.\nLogistics and other transportation-related costs have a significant impact on our earnings and results of operations. We use multiple forms of transportation, including ships, trucks, railcars, and third-party carriers, to bring our products to market. Disruption to the timely supply of these services or increases in the cost of these services for any reason, including availability or cost of fuel, regulations affecting the industry (including new or increased tariffs imposed by the U.S. and retaliatory tariffs by other countries), labor shortages in the transportation industry, service failures by third-party service providers, carrier capacity, accidents, natural disasters, inflation, a pandemic illness, or a cybersecurity breach or attack, may impact our ability to obtain reliable transportation for products. Our procurement of transportation services from a diversified group of carriers and continuous monitoring of our transportation methods could be insufficient to protect us from changes in market demand or carrier capacity. The inability to distribute our products in a cost-effective manner could have a material adverse effect on our ability to serve our customers, our business, financial condition, and results of operations. \nFinancial Risks\nOur results may be adversely impacted as a result of increased cost, limited availability, and/or insufficient quality of raw materials, including commodities and agricultural products.\nWe and our business partners purchase and use large quantities of many different commodities and agricultural products in the manufacturing of our products, including green coffee, peanuts, flour, sugar, oils and fats, fruit, and other ingredients. In addition, we and our business partners utilize significant quantities of plastic, glass, metal cans, caps, carton board, and corrugate to package our products and natural gas and fuel oil to manufacture, package, and distribute our products. The prices of these commodities, agricultural-based products, and other materials are subject to volatility and can fluctuate due to conditions that are difficult to predict, including global supply and demand, commodity market fluctuations, crop sizes and yield fluctuations, adverse weather conditions, natural disasters, water supply, pandemic illness, foreign currency fluctuations, investor speculation, trade agreements (including new or increased tariffs imposed by the U.S. and retaliatory tariffs by other countries), political instability, geopolitical conflicts, consumer demand, general economic conditions (such as inflationary pressures and rising interest rates), and changes in governmental agricultural programs. \n16\nWe also compete for certain raw materials, notably corn and soy-based agricultural products, with the biofuels industry, which has resulted in increased prices for these raw materials. Additionally, farm acreage currently devoted to other agricultural products we purchase may be utilized for biofuel crops resulting in higher costs for the other agricultural products we utilize. Although we use futures, basis, options, and fixed price contracts to manage commodity price volatility in some instances, commodity price increases ultimately result in corresponding increases in our raw material and energy costs. \nDuring 2025, we continued to experience materially higher commodity and supply chain costs, including manufacturing, ingredient, and packaging costs, due to inflationary pressures, and we expect the pressures of cost inflation to continue into 2026. Although we take measures to mitigate inflation through the use of derivatives and pricing actions, if these measures are not effective, our financial condition, results of operations, and cash flows could be materially adversely affected.\nWe expect the green coffee commodity markets to continue to be challenging due to the significant ongoing price volatility. For example, during 2025, we experienced extreme drought impact, which substantially reduced green coffee production in Brazil. Due to the significance of green coffee to our coffee business, combined with our ability to only partially mitigate future price risk through purchasing practices and hedging activities, significant increases or decreases in the cost of green coffee could have an adverse impact on our profitability, as compared to that of our competitors. In addition, if we are not able to purchase sufficient quantities of green coffee due to any of the above factors or to a worldwide or regional shortage, we may not be able to fulfill the demand for our coffee, which could have a material adverse effect on our business, financial condition, and results of operations.\nOur efforts to manage commodity, foreign currency exchange, and other price volatility through derivative instruments could adversely affect our results of operations and financial condition.\nWe use derivative instruments, including commodity futures and options, to reduce the price volatility associated with anticipated commodity purchases. The extent of our derivative position at any given time depends on our assessment of the markets for these commodities. If we fail to take a derivative position and costs subsequently increase, or if we institute a position and costs subsequently decrease, our costs may be greater than anticipated or higher than our competitors’ costs and our financial results could be adversely affected. In addition, our liquidity may be adversely impacted by the cash margin requirements of the commodity exchanges or the failure of a counterparty to perform in accordance with a contract.\nWe currently do not qualify any of our commodity or foreign currency exchange derivatives for hedge accounting treatment. We instead mark-to-market our derivatives through the Statements of Consolidated Income (Loss), which results in changes in the fair value of all of our derivatives being immediately recognized in consolidated earnings, resulting in potential volatility in both gross profit and net income (loss). These gains and losses are reported in cost of products sold in our Statements of Consolidated Income (Loss) but are excluded from our segment operating results and non-GAAP earnings until the related inventory is sold, at which time the gains and losses are reclassified to segment profit and non-GAAP earnings. Although this accounting treatment aligns the derivative gains and losses with the underlying exposure being hedged within segment results, it may result in volatility in our consolidated earnings.\nWeak financial performance, downgrades in our credit ratings, or disruptions in the financial markets may adversely affect our ability to access capital in the future.\nWe may need new or additional financing in the future to conduct our operations, expand our business, or refinance existing indebtedness, which would be dependent upon our financial performance. Any downgrade in our credit ratings, particularly our short-term rating, would likely impact the amount of commercial paper we could issue and increase our commercial paper borrowing costs. The liquidity of the overall capital markets and the state of the economy, including the food and beverage industry, may make credit and capital markets more difficult for us to access, even though we have an established revolving credit facility. From time to time, we have relied, and also may rely in the future, on access to financial markets as a source of liquidity for working capital requirements, acquisitions, and general corporate purposes. In particular, our access to funds under our revolving credit facility is dependent on the ability of the financial institutions that are parties to that facility to meet their funding commitments. The obligations of the financial institutions under our revolving credit facility are several and not joint and, as a result, a funding default by one or more institutions does not need to be made up by the others. In addition, long-term volatility and disruptions in the capital and credit markets as a result of uncertainty, changing or increased regulation of financial institutions, reduced alternatives, or the failure of significant financial institutions could adversely affect our access to the liquidity needed for our business in the longer term. Such disruptions could require us to take measures to conserve cash until the markets stabilize or until alternative credit arrangements or other funding for our business needs can be arranged. Disruptions in the capital and credit markets could also result in higher interest rates on \n17\npublicly issued debt securities and increased costs under credit facilities. Continuation of these disruptions would increase our interest expense and capital costs and could adversely affect our results of operations and financial position.\nOur substantial debt obligations could restrict our operations and financial condition. Additionally, our ability to generate cash to make payments on our indebtedness depends on many factors beyond our control. \nAs of April 30, 2025, we had $7.7 billion of short-term borrowings and long-term debt. We may also incur additional indebtedness in the future. Our debt service obligations will require us to use a portion of our operating cash flow to pay interest and principal on indebtedness rather than for other corporate purposes, including funding future expansion of our business and ongoing capital expenditures, which could impede our growth. Our substantial indebtedness could have other adverse consequences, including:\n•\nmaking it more difficult for us to satisfy our financial obligations;\n•\nincreasing our vulnerability to adverse economic, regulatory, and industry conditions, and placing us at a disadvantage compared to our competitors that are less leveraged;\n•\nlimiting our ability to compete and our flexibility in planning for, or reacting to, changes in our business and the industry in which we operate;\n•\nlimiting our ability to borrow additional funds for working capital, capital expenditures, acquisitions, and general corporate or other purposes;\n•\nexposing us to greater interest rate risk, including the risk to variable borrowings of a rate increase and the risk to fixed borrowings of a rate decrease; and\n•\nchanging the outlook or downgrading our public credit ratings by a rating agency.\nOur ability to make payments on our indebtedness will depend on our ability to generate cash in the future. Our ability to generate cash is subject to general economic, financial, competitive, legislative, regulatory, and other factors, many of which are beyond our control. Our business may not generate sufficient cash flow from operations, and future borrowings may not be available to us in an amount sufficient to enable us to pay our indebtedness when scheduled payments are due or to fund other liquidity needs. In these circumstances, we may need to refinance all or a portion of our indebtedness on or before maturity. Any refinancing of our debt could be at higher interest rates and may require make-whole payments and compliance with more onerous covenants, which could further restrict our business operations. Our ability to refinance our indebtedness or obtain additional financing would depend on, among other things, our financial condition at the time, restriction in the agreements governing our indebtedness, and the condition of the financial markets and the industry in which we operate. As a result, we may not be able to refinance any of our indebtedness on commercially reasonable terms or at all. Without this financing, we may have to seek additional equity or debt financing or restructure our debt, which could harm our long-term business prospects. Our failure to comply with the terms of any existing or future indebtedness could result in an event of default which, if not cured or waived, could result in the acceleration of the payment of all of our debt.\nIn addition, there are various covenants and restrictions in our debt and financial instruments. If we fail to comply with any of these requirements, the related indebtedness could become due and payable prior to its stated maturity, and our ability to obtain additional or alternative financing may also be negatively affected.\nA material impairment in the carrying value of acquired goodwill or other intangible assets could negatively affect our consolidated operating results and net worth.\nA significant portion of our assets is composed of goodwill and other intangible assets, the majority of which are not amortized but are reviewed for impairment at least annually on February 1, and more often if indicators of impairment exist. At April 30, 2025, the carrying value of goodwill and other intangible assets totaled $12.1 billion, compared to total assets of $17.6 billion and total shareholders’ equity of $6.1 billion. If the carrying value of these assets exceeds the current estimated fair value, the asset would be considered impaired, and this would result in a noncash charge to earnings, which could be material. Events and conditions that could result in impairment include a sustained drop in the market price of our common shares, increased competition or loss of market share, obsolescence, product claims that result in a significant loss of sales or profitability over the product life, deterioration in macroeconomic conditions, declining financial performance in comparison to projected results, increased input costs beyond projections, or divestitures of significant brands.\nAs of April 30, 2025, goodwill and indefinite-lived intangible assets totaled $5.7 billion and $3.8 billion, respectively. The carrying values of the goodwill and indefinite-lived intangible assets were $0.5 billion and $1.2 billion, respectively, within the Sweet Baked Snacks segment, $2.1 billion and $1.3 billion, respectively, within the U.S. Retail Coffee segment, and $1.6 billion and $1.1 billion, respectively, within the\n18\n U.S. Retail Pet Foods segment, which represent approximately 80 percent of the total goodwill and indefinite-lived intangible assets as of April 30, 2025.\nDuring the second quarter of 2025, the disposal group for the \nVoortman\n business, inclusive of approximately $251.0 of goodwill within the Sweet Baked Snacks reporting unit that was allocated to the disposal group based on a relative fair value analysis, was classified as held for sale. As a result, a pre-tax loss on the divestiture of $260.8 was recognized and included as a noncash charge in our Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows. We evaluated whether it was more likely than not that the remaining goodwill of the Sweet Baked Snacks reporting unit was impaired as of October 31, 2024, and concluded that no impairment existed at this date. On December 2, 2024, we completed the divestiture of the \nVoortman\n business.\nDuring the third quarter of 2025, we completed the integration of the Hostess Brands business and operations, but continued to face execution challenges from a distribution, merchandising, and competitive standpoint, which resulted in lost market share. Further, the sweet baked goods category continued to face increased inflationary pressures and diminished discretionary income for consumers. These factors were key inputs into our long-range planning process, which was also completed during the third quarter of 2025, and indicated a decline in forecasted net sales and segment profit for the Sweet Baked Snacks reporting unit. As a result, we performed an interim impairment assessment of the Sweet Baked Snacks reporting unit that indicated an estimated fair value significantly below the carrying value of the reporting unit. We also performed an interim impairment assessment of the \nHostess \nbrand\n \nindefinite-lived trademark. As a result of these assessments, we recognized total pre-tax impairment charges of $1.0 billion during the third quarter of 2025, of which $794.3 and $208.2 related to the goodwill of the Sweet Baked Snacks reporting unit and the \nHostess\n brand indefinite-lived trademark, respectively. These charges were included as noncash charges in our Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows.   \nWe completed the annual impairment assessment, in which goodwill was tested for impairment at the reporting unit level for each reporting unit with goodwill as of the annual assessment date. As part of our annual evaluation, we did not recognize any impairment charges related to our reporting units or indefinite-lived intangible assets. The estimated fair value exceeded the carrying value by greater than 10 percent for all of our reporting units and indefinite-lived intangible assets, with the exception of the Sweet Baked Snacks reporting unit and \nHostess\n brand indefinite-lived trademark, as the carrying values approximated estimated fair values due to the impairment charges recognized during the third quarter of 2025.\nDuring the fourth quarter of 2025, we continued to underperform as compared to plan in both net sales and segment profit for the Sweet Baked Snacks segment as a result of ongoing performance challenges from a distribution, merchandising, and competitive standpoint and sustained challenges in the sweet baked goods category. Performance during the fourth quarter of 2025 reflected the impact of a dynamic macroeconomic environment, inclusive of a reduction in discretionary consumer spending and the changing regulatory environment. Furthermore, in conjunction with the recently announced leadership transition, we re-evaluated the strategic priorities for the Sweet Baked Snacks segment to drive growth for the \nHostess\n brand, with a focus on strengthening our portfolio, elevating our execution, and refocusing our strategy to reignite sustainable growth. Following the leadership transition, we revised our financial plan for 2026 as compared to prior expectations, reflecting near-term underperformance, an evolving macroeconomic environment, and updated Sweet Baked Snacks strategic priorities, inclusive of the recently announced closure of the Indianapolis, Indiana manufacturing facility in 2026. The updated financial plan reflects decreased net sales and segment profit, as compared to the projections used in the annual impairment review. The overall reduction in net sales and segment profit, in conjunction with the sustained underperformance of the sweet baked goods category since acquisition, led to a reduction of the forecasted long-term growth rate for the Sweet Baked Snacks reporting unit. As a result of these declines and the narrow differences between estimated fair values and carrying values as of the annual assessment date, we performed an interim impairment assessment of the Sweet Baked Snacks reporting unit that indicated an estimated fair value significantly below the carrying value of the reporting unit. We also performed an interim impairment assessment of the \nHostess \nbrand\n \nindefinite-lived trademark. As a result of these assessments, we recognized total pre-tax impairment charges of $980.0 during the fourth quarter of 2025, of which $867.3 and $112.7 related to the goodwill of the Sweet Baked Snacks reporting unit and the \nHostess\n brand indefinite-lived trademark, respectively. These charges were included as noncash charges in our Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows.    \nThe goodwill and indefinite-lived trademark within the Sweet Baked Snacks segment remain susceptible to future impairment charges. Any significant adverse change in our near- or long-term projections or macroeconomic conditions would result in future impairment charges for the Sweet Baked Snacks reporting unit. There were no other indicators of impairment during the fourth quarter of 2025, and as a result, we do not believe that any of our remaining reporting units or \n19\nmaterial indefinite-lived intangible assets are more likely than not impaired as of April 30, 2025. \nFor additional information, refer to Note 7: Goodwill and Other Intangible Assets.\nWe work with our suppliers to extend our payment terms, which are then supplemented by a third-party administrator to assist in effectively managing our working capital. If the extension of payment terms is reversed or the financial institution terminates its participation in the program, our ability to maintain acceptable levels of working capital may be adversely affected.\nAs part of ongoing efforts to maximize working capital, we work with our suppliers to optimize our terms and conditions, which includes the extension of payment terms. Payment terms with our suppliers, which we deem to be commercially reasonable, range from 0 to 180 days. We have an agreement with a third-party administrator to provide an accounts payable tracking system and facilitate a supplier financing program, which allows participating suppliers the ability to monitor and voluntarily elect to sell our payment obligations to a designated third-party financial institution. Participating suppliers can sell one or more of our payment obligations at their sole discretion, and our rights and obligations to our suppliers are not impacted. We have no economic interest in a supplier’s decision to enter into these agreements. Our rights and obligations to our suppliers, including amounts due and scheduled payment terms, are not impacted by our suppliers’ decisions to sell amounts under these arrangements. As of April 30, 2025 and 2024, $340.4 and $384.9 of our outstanding payment obligations, respectively, were elected and sold to a financial institution by participating suppliers.\nIf the financial institution terminates its participation in our supplier financing program and we are unable to modify related consumer payment terms or payment terms are shortened as a result of supplier negotiations, working capital could be adversely affected. In addition, due to terminations or negotiations, we may be unable to secure alternative programs and may have to utilize various financing arrangements for short-term liquidity or increase our long-term debt.\nThe declaration, payment, and amount of dividends is made at the discretion of our Board and depends on a number of factors.\nThe declaration, payment, and amount of any dividends is made pursuant to our dividend policy and is subject to the discretion of our Board and depends on various factors, such as our net income (loss), financial condition, cash requirements, future events, and other factors deemed relevant by the Board. Accordingly, there can be no assurance that any future dividends will be equal or similar in amount to any dividends previously paid or that our Board will not decide to reduce, suspend, or discontinue the payment of dividends at any time in the future. A reduction or elimination of our dividend payments could have a negative effect on our share price.\nRisks Related to Regulation and Litigation\nWe could be subject to adverse publicity or claims from consumers.\nCertain of our products contain ingredients which are the subject of public scrutiny, including the suggestion that consumption may have adverse health effects. Although we strive to respond to consumer preferences and social expectations, we may not be successful in these efforts. An unfavorable report on the effects of ingredients present in our products or packaging, product recalls, or negative publicity or litigation could influence consumer preferences, significantly reduce the demand for our products, and adversely affect our profitability.\nWe may also be subject to complaints from or litigation by consumers who allege food and beverage-related illness, or other quality, health, advertising, or operational concerns. Adverse publicity resulting from such allegations could materially adversely affect us, regardless of whether such allegations are true or whether we are ultimately held liable. A lawsuit or claim could result in an adverse decision against us, which could have a material adverse effect on our business, financial condition, and results of operations.\nChanges in tax, environmental, or other regulations and laws, or their application, or failure to comply with existing licensing, trade, and other regulations and laws could have a material adverse effect on our financial condition. \nWe are subject to income and other taxes, primarily in the U.S. and Canada, based upon the jurisdictions in which our sales and profits are determined to be earned and taxed. Federal, state, and foreign statutory income tax rates and taxing regimes have been subject to significant change and continue to evolve. Our interpretation of current tax laws and their applicability to our business, as well as any changes to existing laws, can significantly impact our effective income tax rate and deferred \n20\ntax balances. We are also subject to regular reviews, examinations, and audits by the Internal Revenue Service (the “IRS”) and other taxing authorities with respect to taxes within and outside of the U.S. Although we believe our tax estimates are reasonable, the final outcome of tax controversies could result in material incremental tax liabilities, including interest and penalties. Our effective income tax rate is also influenced by the geography, timing, nature, and magnitude of transactions, such as acquisitions and divestitures, restructuring activities, and impairment charges.\nOur operations are subject to various regulations and laws, in addition to tax laws, administered by federal, state, and local government agencies in the U.S., including the FDA, U.S. Federal Trade Commission, the U.S. Departments of Agriculture, Commerce, and Labor, state regulatory agencies, and other agencies, as well as to regulations and laws administered by government agencies in Canada and other countries in which we have operations and our products are sold. In particular, the manufacturing, marketing, transportation, storage, distribution, packaging disposal (including extended producer responsibility regulations), and sale of food products are each subject to governmental regulation that is increasingly extensive. Governmental regulation encompasses such matters as ingredients (including whether a product contains bioengineered ingredients or artificial dyes), packaging and disposal of packaging, labeling (including use of certain terms such as sugar free, healthy, low sodium, and low fat), pricing, advertising, relations with distributors and retailers, health, safety, data privacy and security, and anti-corruption, as well as an increased focus regarding environmental policies relating to climate change, regulating greenhouse gas emissions, energy policies, and sustainability, including single-use plastics. Additionally, we are routinely subject to new or modified securities regulations, other laws and regulations, and accounting and reporting standards. \nThe current U.S. presidential administration announced the imposition of significant new tariffs that will be imposed on our imports and exports, which could negatively impact international trade relations, result in retaliatory actions, and cause inflationary pressures and higher costs. The imposition of such tariffs and retaliatory measures could have a significant adverse impact on our results of operations, financial position, or cash flows, depending on their timing, degree, and magnitude. Further, we may be required to raise prices for our products to offset the additional costs, which could reduce demand and result in the loss of customers. Additionally, tariffs may harm our competitive position in key markets, as we may be at a disadvantage as compared to our competitors who operate in countries that are subject to lesser tariffs.\nIn the U.S., we are required to comply with federal laws, such as the Federal Food, Drug, and Cosmetic Act, the Food Safety Modernization Act, the Occupational Safety and Health Act, the Clean Air Act, the Clean Water Act, the Resource Conservation and Recovery Act, the Tariff Act, laws governing equal employment opportunity, and various other federal statutes and regulations. \nWe are also subject to various laws and regulations that are continuously evolving in the U.S., Canada, and other jurisdictions regarding privacy, data protection, and data security, including those related to the collection, storage, handling, use, disclosure, transfer, and security of personal data. For example, in the U.S., California, Colorado, Connecticut, Delaware, Iowa, Minnesota, Montana, Nebraska, New Hampshire, New Jersey, Oregon, Tennessee, Texas, Utah, and Virginia all have comprehensive privacy laws in effect that impose privacy obligations on companies that do business in these states and that collect personal information from certain individuals. In some jurisdictions, these laws impose civil penalties on companies that fail to comply with these requirements including, in certain cases, a private right of action for data breaches. In addition, several other states have passed similar comprehensive privacy laws that are set to take effect in either the second half of calendar year 2025 or in calendar year 2026, and still more states have either already introduced or have corresponding privacy rights bills in committee, which means the scope of privacy laws we will be subject to will continue to expand beyond calendar year 2026. Therefore, on an ongoing basis, we will continuously evaluate our new privacy obligations and develop additional compliance mechanisms and processes as may be required. There are also a wide range of enforcement agencies at both state and federal levels that can investigate companies for privacy and data security concerns based on general consumer protection laws. Accordingly, failure to comply with federal and state laws regarding privacy and security of personal information could expose us to fines and penalties. \nComplying with new regulations and laws, or changes to existing regulations and laws, or their application could increase our costs or adversely affect our sales of certain products. In addition, our failure or inability to comply with applicable regulations and laws could subject us to civil remedies, including fines, injunctions, recalls or seizures, and potential criminal sanctions, which could have a material adverse effect on our business and financial condition.\n21\nOur international operations expose us to regulatory risks.\nIn many countries outside of the U.S., particularly in those with developing or emerging economies, it may be common for others to engage in business practices prohibited by laws and regulations applicable to us, such as the U.S. Foreign Corrupt Practices Act or similar local anti-bribery or anti-corruption laws. These laws generally prohibit companies and their employees, contractors, or agents from making improper payments to government officials for the purpose of obtaining or retaining business. Failure to comply with these laws could subject us to civil and criminal penalties that could have a material adverse effect on our financial condition and results of operations. In addition, the enforcement of remedies in foreign jurisdictions may be less certain, resulting in varying abilities to enforce intellectual property and contractual rights.\nRisks associated with corporate responsibility matters may negatively affect our business and operations.\nThere is a growing focus from certain investors, customers, and other key stakeholders regarding corporate responsibility resulting in an increased emphasis on corporate responsibility ratings.\n \nCorporate responsibility ratings are released by a variety of third-party organizations who provide reports on companies in order to measure and assess corporate responsibility performance. We risk damage to our brand and reputation if it is determined that our corporate responsibility procedures or standards do not meet the standards set by our stakeholders. Any failure in our decision-making or related investments regarding corporate responsibility could affect consumer perceptions of our brand.\nOur initiatives may fail to satisfy the varied and differing views of our stakeholders. In recent years, opposing sentiment of corporate responsibility topics or initiatives has gained momentum across the U.S., as several states and Congress have proposed or enacted policies, legislation, or initiatives, and stakeholders have expressed opposing views on corporate responsibility topics and initiatives. In addition, the federal government has recently issued and acted on executive orders, memoranda, and investigations opposing diversity, equity, and inclusion initiatives. Such policies, sentiment, legislation, initiatives, litigation, legal opinions, and scrutiny could result in us facing additional compliance obligations, becoming the subject of investigations, litigation, enforcement actions, boycotts, loss of consumer demand, or sustaining reputational harm, which could negatively impact our business and financial results.\nRisks associated with climate change and other environmental impacts or legal, regulatory, or market measures to address climate change may negatively affect our business and operations.\nAs set forth in the Intergovernmental Panel on Climate Change Sixth Assessment Report, global average temperatures are gradually increasing due to increased concentration of carbon dioxide and other greenhouse gases in the atmosphere, which have contributed to and are expected to continue contributing to significant changes in weather patterns around the globe and an increase in the frequency and severity of extreme weather and natural disasters. In the event that climate change has a negative effect on agricultural productivity, we may be subject to decreased availability or less favorable pricing for certain commodities that are necessary for our products, such as green coffee, peanuts, oils and fats, flour, sugar, fruit, and other ingredients. We may also be subjected to decreased availability or less favorable pricing for water or energy as a result of such change, which could impact our manufacturing and distribution operations. In addition, natural disasters, extreme weather conditions, and other natural conditions may disrupt the productivity of our facilities or the operation of our supply chain, which could increase our insurance or other operating costs or require us to make additional, unplanned capital expenditures. Specifically\n, in January 2024, a snow and ice storm in the south caused our cat food plant in Decatur, Alabama to be temporarily shut down\n. Although we consider these to be uncommon events, and we were able to effectively minimize any disruptions through our business continuity planning efforts, extreme weather could disrupt our production in the future, adversely affecting our ability to meet customer deadlines and supply demands.\nAdditionally, there is an increased focus by foreign, federal, state, and local regulatory and legislative bodies regarding environmental policies relating to climate change, regulating greenhouse gas emissions, energy policies, and sustainability, including single-use plastics. Increased energy or compliance costs and expenses due to the impacts of climate change and additional legal or regulatory requirements regarding climate change designed to reduce or mitigate the effects of carbon dioxide and other greenhouse gas emissions on the environment could be costly and may cause disruptions in, or an increase in the costs associated with, our manufacturing and distribution facilities, as well as increased supply chain costs. Moreover, compliance with any such legal or regulatory requirements may require us to make significant changes to our business operations, strategy, and reporting\n. Collecting, measuring, and analyzing information relating to climate change and sustainability matters can be costly, time consuming, dependent on third-party cooperation, and unreliable. Furthermore, methodologies for measuring, tracking, and reporting on climate change and sustainability continue to change over time, \n22\nwhich requires our processes and controls for such data to evolve as well.\nFinally, we might fail to effectively address increased attention from the media, shareholders, activists, and other stakeholders on climate change and related environmental sustainability matters. Such failure, or the perception that we have failed to act responsibly with respect to such matters, or to effectively respond to new or additional regulatory requirements regarding climate change, whether or not valid, could result in adverse publicity and negatively affect our business and reputation. In addition, from time to time we establish and publicly announce goals and commitments, including goals to reduce our impact on the environment. For example, in 2022, we established science-based targets for Scope 1, 2, and 3 greenhouse gas emissions. Our ability to achieve any stated goal, target, or objective is subject to numerous factors and conditions, many of which are outside of our control, including evolving regulatory requirements and the availability of suppliers that can meet our sustainability and other standards. Furthermore, standards for tracking and reporting such matters continue to evolve. Our selection of voluntary disclosure frameworks and standards, and the interpretation or application of those frameworks and standards, may change from time to time or differ from those of others. Methodologies for reporting this data may be updated and previously reported data may be adjusted to reflect improvement in availability and quality of third-party data, changing assumptions, changes in the nature and scope of our operations (including from acquisitions and divestitures), and other changes in circumstances, which could result in significant revisions to our current goals, reported progress in achieving such goals, or ability to achieve such goals in the future. If we fail to achieve, are perceived to have failed to achieve, or are delayed in achieving these goals and commitments, it could negatively affect consumer preference for our products or investor confidence in our stock, as well as expose us to government enforcement actions and private litigation.\nGeneral Risk Factors\nWe may be unable to grow market share of our products.\nWe operate in the competitive food industry whose growth potential is positively correlated to population growth. Our success depends in part\n on our ability to drive revenue growth in our brands faster than the population in general. We consider our ability to build and sustain the equity of our brands critical to our market share growth. Since our operations are concentrated in the North American consumer and snacking industry, our success also depends in part on our ability to enhance our portfolio by adding innovative new products. If we do not suc\nceed in these efforts, our market share growth may slow, which could have a material impact on our results of operations.\n \nIf our information technology systems fail to perform adequately or we are unable to protect such information technology systems against data corruption or cybersecurity incidents, our operations could be disrupted, and we may suffer financial damage or loss because of lost or misappropriated information.\nWe rely on information technology (“IT”) networks and systems, including the Internet, to process, transmit, and store electronic information, and the importance of such networks and systems has increased due to many of our employees working remotely. In particular, we depend on our IT infrastructure to effectively manage our business data, supply chain, logistics, finance, manufacturing, and other business processes and for digital marketing activities and electronic communications between Company personnel and our customers and suppliers. If we do not allocate and effectively manage the resources necessary to build, sustain, and protect an appropriate technology infrastructure, or we do not effectively implement system upgrades, our business or financial results could be negatively impacted. Furthermore, the rapid evolution of emerging technologies such as artificial intelligence may intensify our cybersecurity risks. We are regularly the target of attempted cyber and other security threats. Therefore, we continuously monitor and update our IT networks and infrastructure to prevent, detect, address, and mitigate the risk of unauthorized access, misuse, computer viruses, phishing attacks, malware, ransomware, social engineering, password theft, physical breaches, and other events that could have a security impact. In addition, the ongoing geopolitical conflicts have heightened the risk of cyberattacks. We invest in industry-standard security technology to protect our data and business processes against the risk of data security breaches and cyber-based attacks. We believe our security technology tools and processes provide adequate measures of protection against security breaches and reduce cybersecurity risks. Nevertheless, despite continued vigilance in these areas, security breaches or system failures of our infrastructure, whether due to attacks by hackers, employee error, or other causes, can create system disruptions, shutdowns, transaction errors, or unauthorized disclosure of confidential or proprietary information. If we are unable to prevent such breaches or failures, our operations could be disrupted, or we may suffer financial damage or loss because of lost or misappropriated information. In addition, the cost to remediate any damages to our IT systems suffered as a result of a cyber-based attack could be significant.\n23\nIn addition, if we experience a loss as a result of a cybersecurity incident or other breakdown in technology, we may suffer reputational, competitive, and/or business harm and may be exposed to legal liability and government investigations, which may adversely affect our results of operations or financial condition. The misuse, leakage, or falsification of information could also result in violations of data privacy laws, and we may become subject to legal action and increased regulatory oversight. We could also be required to spend significant financial and other resources to remedy the damage caused by a cybersecurity incident or to repair or replace networks and information.\nFurther, we have outsourced several IT support services and administrative functions, including benefit plan administration and other functions, to third-party service providers and strategic partners and may outsource other functions in the future to achieve cost savings and efficiencies. In addition, certain of our processes rely on third-party cloud computing services. If the service providers to which we outsource these functions do not perform effectively, we may not be able to achieve the expected benefits and may have to incur additional costs to correct errors made by such service providers. Depending on the function involved, such errors may also lead to business disruption, processing inefficiencies, inaccurate financial reporting, the loss of or damage to intellectual property through a security breach, the loss of sensitive data through a security breach, or otherwise.\nWe may face complications with the design or implementation of our new enterprise performance management (\n“\nEPM\n”\n) system, which may negatively affect our business and operations.\nW\ne rely on IT networks and systems to manage our business and operations and occasionally implement new and upgrade our existing IT systems. We are in the process of a multi-year implementation of a new EPM system, inclusive of an enterprise resource planning system (i.e., general ledger), through the use of Oracle Cloud Solutions. The EPM system will replace our existing financial system and is designed to accurately maintain our financial records, enhance operational functionality and efficiency, and provide timely information to our management team. The EPM system implementation process has required, and will continue to require, the investment of significant personnel and financial resources over the duration of the project. We anticipate full integration of the EPM system in early 2026. Further, we may not be able to successfully implement the EPM system without experiencing delays, increased costs, and other complications, including potential design defects, miscalculations, testing requirements, and the diversion of management’s attention from day-to-day business operations. If we are unable to successfully design and implement the new EPM system as planned, our financial condition, results of operations, and cash flows could be negatively impacted. In addition, if the EPM system does not operate as intended, the effectiveness of our internal controls over financial reporting could be adversely affected.\nOngoing geopolitical conflicts and the related disruptions to the global economy could adversely affect our business, financial condition, or results of operations.\nThe global economy has been negatively impacted by the ongoing conflicts between Russia and Ukraine and Israel and Hamas, as well as rising tensions between China and Taiwan. Governments in the United States, United Kingdom, and European Union have imposed sanctions on certain products, industry sectors, and parties in Russia. Although we do not have any operations in Russia, Ukraine, Israel, Palestine, China, or Taiwan, we have experienced and may continue to experience shortages in materials and increased costs for transportation, energy, and raw materials due in part to the negative impact of the conflicts on the global economy. If the conflicts continue for an extended period of time, they could result in cyberattacks, supply chain disruptions, lower consumer demand, changes in foreign currency exchange rates, increased trade barriers and restrictions on global trade, and other impacts, which may adversely affect our business, financial condition, or results of operations. These and other impacts of the ongoing conflicts between Russia and Ukraine, Israel and Hamas, and rising tensions between China and Taiwan could also heighten many of the other risk factors discussed in this section.",
    "item1b": "Item 1B.    Unresolved Staff Comments. \nNone.\n24",
    "item1c": "Item 1C.    Cybersecurity.\nRisk Management and Strategy\nIT systems and networks are important to our business operations, and we are committed to protecting the privacy, security, and integrity of our data, inclusive of our employee and customer data. We have a comprehensive cybersecurity program in place that is responsible for identifying, preventing, and mitigating data security risks. \nThis program is \naligned\n with the Company’s overall Enterprise Risk Management process\n.\nWe actively monitor and update our \nIT\n systems and infrastructure to prevent unauthorized access, viruses, phishing, and other security risks. Our cybersecurity program follows the National Institute of Standards and Technology (\n“NIST”\n) Cybersecurity Framework standards.\nOur security technology tools and processes provide protection against security breaches and reduce cybersecurity risks. Our cybersecurity incident response plan includes procedures for identifying, containing, and responding to incidents. While we continue to invest in our program and capabilities, we cannot guarantee prevention of all incidents.\nWe depend on IT systems, \nthird-party\n service providers, and strategic partners to facilitate our business operations. This includes secure handling of personal, confidential, financial, sensitive, proprietary, and other forms of information, as well as enabling our service offerings. Despite continuous efforts to enhance both our and our partners’ cybersecurity defenses, we cannot guarantee the protection of all information systems, products, and service technologies.\nWhile we face regular cybersecurity threats, including ransomware and data breaches, we have not encountered significant incidents during the year ended April 30, 2025. We believe our security measures are adequate, but we acknowledge the rising sophistication of threats. Despite vigilance, system disruptions or unauthorized disclosures remain possible.\nGovernance and Oversight\nThe Board actively supports strategy and oversees risk management, drawing on a diverse range of experiences, skills, qualifications, and backgrounds. This includes oversight of cybersecurity matters. The Audit Committee, composed entirely of independent Board members, receives quarterly updates on the Company\n’\ns cybersecurity program, which includes recent developments, program improvements, risk analysis, and an annual update on the scenario-based cybersecurity exercise. \nThe Audit Committee also receives periodic updates, as needed, including any cybersecurity events that would require notification to the Audit Committee. \nThe \nAudit Committee\n provides quarterly updates to the Board on key cybersecurity activities, and cybersecurity is also reviewed at least annually with the Board\n. In addition, two of our Audit Committee members, including the Chair, hold a CERT Certificate in Cybersecurity Oversight from the National Association of Corporate Directors.\nWe actively educate our employees about potential cybersecurity threats and actions. Our executive officers and global workforce receive ongoing trainings in response to cyber threats and cybersecurity incidents. We mandate annual completion of our information security training and compliance program, which includes reviewing and acknowledging the Company’s information security policy. All employees also participate in regular security awareness training, which includes data protection principles, general end-user security hygiene, and internal phishing simulations. Additional annual training covers information security topics related to our Code of Conduct and Records Management Policies.\n \n25"
  }
}