{
  "ticker": "SLB",
  "cik": "0000087347",
  "company_name": "SLB LIMITED/NV",
  "filing_date": "2025-01-22",
  "accession": "0000950170-25-007638",
  "primary_doc": "slb-20241231.htm",
  "item_sections": {
    "item1": "Item 10.  Directors, Executive Officers and Corporate Governance.\n \n\n\nSee “Item 1. Business—Information About Our Executive Officers” of this Report for information regarding SLB’s executive officers. The information set forth under the captions “Election of Directors,” “Corporate Governance—Process for Selecting New Directors,” and “Corporate Governance—Board Committees” in SLB’s 2025 Proxy Statement is incorporated herein by reference. The information set forth under the caption “Stock Ownership Information—Delinquent Section 16(a) Reports” in SLB’s 2025 Proxy Statement is incorporated herein by reference to the extent any disclosure is required.\n \n\n\n \n\n\nSLB has a Code of Conduct that applies to all of its directors, officers and employees, including its principal executive, financial and accounting officers, or persons performing similar functions. SLB’s Code of Conduct is posted on its website at https://www.slb.com/about/who-we-are/our-code-of-conduct. SLB will provide, without charge, upon request, copies of our Code of Conduct. Requests for copies of our Code of Conduct should be sent in writing to SLB, Chief Legal Officer and Secretary, 5599 San Felipe, Houston, Texas 77056.\n \nSLB intends to disclose future amendments to the Code of Conduct and any grant of a waiver from a provision of the Code of Conduct requiring disclosure under applicable SEC rules at\n \nhttps://www.slb.com/about/who-we-are/our-code-of-conduct\n.\n\n\n \n\n\nSLB has a securities transactions policy governing the purchase, sale and other dispositions of its securities by directors, officers, and employees. SLB believes that its securities transactions policy is reasonably designed to promote compliance with insider trading laws, rules and regulations, and any applicable listing standards. A copy of SLB’s securities transactions policy is filed as Exhibit 19 to this Form 10-K.\n \n\n\n \n\n\nThe table below sets forth information regarding SLB’s directors:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nName\n\n\n \n\n\n\n\n\n\nPeter Coleman\n\n\nFormer Chief Executive Officer and Managing Director, Woodside Petroleum Ltd.\n\n\n\n\n\n\nPatrick de La Chevardière\n\n\nFormer Chief Financial Officer, TotalEnergies S.A.\n\n\n\n\n\n\nMiguel M. Galuccio\n\n\nChairman and Chief Executive Officer, Vista\n\n\n\n\n\n\nJames Hackett\n\n\nPresident, Tessellation Services\n \n\n\n\n\n\n\nOlivier Le Peuch\n\n\nChief Executive Officer, SLB\n\n\n\n\n\n\nSamuel Leupold\n\n\nFormer Chief Executive Officer, Ørsted Wind Power A/S\n\n\n\n\n\n\nTatiana A. Mitrova\n\n\nDirector, New Energy Advancement Hub\n\n\n\n\n\n\nMaria Moræus Hanssen\n\n\nFormer Deputy Chief Executive Officer & Chief Operating Officer, Wintershall Dea GmbH\n\n\n\n\n\n\nVanitha Narayanan\n\n\nFormer Chairman and Managing Director, IBM India\n\n\n\n\n\n\nJeff W. Sheets\n\n\nFormer Chief Financial Officer, ConocoPhillips Company\n\n\n\n\n\n\nUlrich Spiesshofer\n\n\nSenior Advisor, The Blackstone Group\n\n\n\n\n\n\nItem 11.  Executiv\ne Compensation.\n \n\n\nThe information set forth under the captions “Compensation Committee Report,” “Compensation Discussion and Analysis,” “Executive Compensation Tables,” “Pay vs. Performance Comparison,” and “Director Compensation” in SLB’s 2025 Proxy Statement is incorporated herein by reference.\n \n \n\n\nItem 12.  Security Ownership of Certain Beneficial Ow\nners and Management and Related Stockholder Matters.\n \n\n\nThe information under the captions “Stock Ownership Information—Security Ownership by Management and Our Board,” “Stock Ownership Information—Security Ownership by Certain Beneficial Owners,” and “Executive Compensation Tables—Equity Compensation Plan Information” in SLB’s 2025 Proxy Statement is incorporated herein by reference.\n \n\n\nItem 13.  Certain Relationships and Related\n Transactions, and Director Independence.\n \n\n\nThe information under the captions “Corporate Governance—Director Independence” and “Corporate Governance—Certain Relationships and Related Person Transactions” in SLB’s 2025 Proxy Statement is incorporated herein by reference.\n\n\nItem 14.  Principal Accou\nnting Fees and Services.\n \n\n\nThe information under the caption “Ratification of Appointment of Independent Auditors for 2025” in SLB’s 2025 Proxy Statement is incorporated herein by reference.\n\n\n \n\n\n \n\n\n63\n\n\n\n\n \n\n\nPART IV\n \n\n\n \n\n\nItem 15.  Exhibits and Financial Statement Schedules.\n \n\n\n(a)\tThe following documents are filed as part of this Report:\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPage(s)\n\n\n\n\n\n\n(1)\n\n\nFinancial Statements\n\n\n \n\n\n\n\n\n\n \n\n\nConsolidated Statement of Income for the three years ended December 31, 2024\n\n\n29\n\n\n\n\n\n\n \n\n\nConsolidated Statement of Comprehensive Income for the three years ended December 31, 2024\n\n\n30\n\n\n\n\n\n\n \n\n\nConsolidated Balance Sheet at December 31, 2024 and 2023\n\n\n31\n\n\n\n\n\n\n \n\n\nConsolidated Statement of Cash Flows for the three years ended December 31, 2024\n\n\n32\n\n\n\n\n\n\n \n\n\nConsolidated Statement of Stockholders’ Equity for the three years ended December 31, 2024\n\n\n33 and 34\n\n\n\n\n\n\n \n\n\nNotes to Consolidated Financial Statements\n\n\n35 to 58\n\n\n\n\n\n\n \n\n\nReport of Independent Registered Public Accounting Firm\n (PCAOB ID \n238\n)\n\n\n60\n\n\n\n\n\n\nFinancial statements of companies accounted for under the equity method and unconsolidated subsidiaries have been omitted because they do not meet the materiality tests for assets or income.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(2)\n\n\nFinancial Statement Schedules not required.\n\n\n \n\n\n\n\n\n\n(3)\n\n\nExhibits: See exhibits listed under Part (b) below.\n\n\n \n\n\n\n\n\n\n(b)\tExhibits\n \n\n\n \n\n\n \n\n\n \n\n\nINDEX TO EXHIBITS\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nExhibit\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAgreement and Plan of Merger among Schlumberger Limited, Sodium Holdco, Inc., Sodium Merger Sub, Inc., and ChampionX Corporation, dated April 2, 2024 (incorporated by reference to Exhibit 2 to SLB’s Current Report on Form 8-K/A filed on April 2, 2024) (***)\n\n\n \n\n\n2\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nArticles of Incorporation of Schlumberger Limited (Schlumberger N.V.) (incorporated by reference to Exhibit 3.1 to SLB’s Current Report on Form 8-K filed on April 6, 2016)\n\n\n \n\n\n3.1\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAmended and Restated By-Laws of Schlumberger Limited (Schlumberger N.V.) (incorporated by reference to Exhibit 3 to SLB’s Current Report on Form 8-K filed on April 21, 2023)\n\n\n \n\n\n3.2\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDescription of Common Stock of Schlumberger Limited (incorporated by reference to Exhibit 4.1 to SLB’s Annual Report on Form 10-K filed on January 27, 2021)\n\n\n \n\n\n4.1\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIndenture dated as of December 3, 2013, by and among Schlumberger Investment S\n.A., as issuer, Schlumberger Limited, as guarantor, and The Bank of New York Mellon, as trustee (incorporated by reference to Exhibit 4.1 to SLB’s Current Report on Form 8-K filed on December 3, 2013)\n\n\n \n\n\n4.2\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSecond Supplemental Indenture dated as of June 26, 2020, by and among Schlumberger Investment S\n.A., as issuer, Schlumberger Limited, as guarantor, and The Bank of New York Mellon, as trustee (including form of global notes representing 2.650% Senior Notes due 2030) (incorporated by reference to Exhibit 4.1 to SLB’s Current Report on Form 8-K filed on June 26, 2020)\n\n\n \n\n\n4.3\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nThird Supplemental Indenture dated as of May 15, 2023, by and among Schlumberger Investment S\n.A.\nas issuer, Schlumberger Limited, as guarantor, and The Bank of New York Mellon, as trustee \n(including form of global notes representing 4.500% Senior Notes due 2028 and form of global notes representing 4.850% Senior Notes due 2033) (incorporated by reference to Exhibit 4.1 to SLB’s Current Report on Form 8-K filed on May 15, 2023)\n\n\n \n\n\n4.4\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nFourth Supplemental Indenture dated as of May 29, 2024, by and among Schlumberger Investment S.A., as issuer, Schlumberger Limited, as guarantor, and The Bank of New York Mellon, as trustee (including form of global notes representing 5.000% Senior Notes due 2034) (incorporated by reference to Exhibit 4.1 to SLB’s Current Report on Form 8-K filed on May 29, 2024)\n\n\n \n\n\n4.5\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n64\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nExhibit\n\n\n\n\n\n\nOfficers’ Certificate dated as of August 11, 2020, executed by Schlumberger Investment S\n.A., as issuer, and Schlumberger Limited, as guarantor (including form of global notes representing 2.650% Senior Notes due 2030) (incorporated by reference to Exhibit 4.1 to SLB’s Current Report on Form 8-K filed on August 11, 2020)\n\n\n \n\n\n4.6\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIndenture dated as of September 18, 2020, by and among Schlumberger Finance Canada Ltd., as issuer, Schlumberger Limited, as guarantor, and The Bank of New York Mellon, as trustee (incorporated by reference to Exhibit 4.1 to SLB’s Current Report on Form 8-K filed on September 18, 2020)\n\n\n \n\n\n4.7\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nFirst Supplemental Indenture dated as of September 18, 2020, by and among Schlumberger Finance Canada Ltd., as issuer, Schlumberger Limited, as guarantor, and The Bank of New York Mellon, as trustee (including form of global notes representing 1.400% Senior Notes due 2025) (incorporated by reference to Exhibit 4.2 to SLB’s Current Report on Form 8-K filed on September 18, 2020)\n\n\n \n\n\n4.8\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSchlumberger Limited Supplementary Benefit Plan, as amended and restated effective November 1, 2020 and conformed to include amendments effective through January 1, 2023 (incorporated by reference to Exhibit 10.1 to SLB’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2023) (+)\n\n\n \n\n\n10.1\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSchlumberger Limited Restoration Savings Plan, as amended and restated effective January 1, 2023 (incorporated by reference to Exhibit 10.2 to SLB’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2023) (+)\n\n\n \n\n\n10.2\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSchlumberger Technology Corporation Supplementary Benefit Plan, as established effective January 1, 1995 and conformed to include amendments through January 1, 2023 (incorporated by reference to Exhibit 10.3 to SLB’s Annual Report on Form 10-K for the year ended December 31, 2023) (+)\n\n\n \n\n\n10.3\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2010 Omnibus Stock Incentive Plan, as amended and restated as of July 19, 2017 (incorporated by reference to Exhibit 10.8 to SLB’s Annual Report on Form 10-K for the year ended December 31, 2018) (+)\n\n\n \n\n\n10.4\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForm of Option Agreement (Employees in France), Incentive Stock Option, under SLB’s 2010 Omnibus Stock Incentive Plan (incorporated by reference to Exhibit 10.10 to SLB’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2013) (+)\n\n\n \n\n\n10.5\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForm of Option Agreement (Employees in France), Non-Qualified Stock Option, under SLB’s 2010 Omnibus Stock Incentive Plan (incorporated by reference to Exhibit 10.11 to SLB’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2013) (+)\n\n\n \n\n\n10.6\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2018 Rules of SLB’s 2010, 2013 and 2017 Omnibus Incentive Plans for Employees in France (incorporated by reference to Appendix B to SLB’s Definitive Proxy Statement on Schedule 14A filed with the SEC on March 2, 2018) (+)\n\n\n \n\n\n10.7\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2013 Omnibus Stock Incentive Plan, as amended and restated as of July 19, 2017 (incorporated by reference to Exhibit 10.15 to SLB’s Annual Report on Form 10-K for the year ended December 31, 2018) (+)\n\n\n \n\n\n10.8\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForm of Option Agreement, Incentive Stock Option, under SLB’s 2013 Omnibus Stock Incentive Plan (incorporated by reference to Exhibit 10.1 to the SLB’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2015) (+)\n\n\n \n\n\n10.9\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForm of Restricted Stock Unit Award Agreement under SLB’s 2013 Omnibus Stock Incentive Plan (ratable vesting) (incorporated by reference to Exhibit 10.15 to SLB’s Annual Report on Form 10-K filed on January 27, 2021) (+)\n\n\n \n\n\n10.10\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForm of Restricted Stock Unit Award Agreement under SLB’s 2017 Omnibus Stock Incentive Plan (incorporated by reference to Exhibit 10.4 to SLB’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2017) (+)\n\n\n \n\n\n10.11\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAddendum to Restricted Stock Unit Award Agreements, Performance Share Unit Agreements, Incentive Stock Option Agreements, and Non-Qualified Stock Option Agreements Issued Prior to July 19, 2017 (incorporated by reference to Exhibit 10.27 to SLB’s Annual Report on Form 10-K for the year ended December 31, 2018) (+)\n\n\n \n\n\n10.12\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForm of Performance Share Unit Award Agreement (Based on Free Cash Flow Margin Performance) under SLB’s 2017 Omnibus Stock Incentive Plan (incorporated by reference to Exhibit 10.3 to SLB’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2022) (+)\n\n\n \n\n\n10.13\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n65\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nExhibit\n\n\n\n\n\n\nForm of Performance Share Unit Award Agreement (Based on Return on Capital Employed Performance) under SLB’s 2017 Omnibus Stock Incentive Plan (incorporated by reference to Exhibit 10.4 to SLB’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2022) (+)\n\n\n \n\n\n10.14\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForm of Performance Share Unit Award Agreement (Based on Relative TSR Performance) under SLB’s 2017 Omnibus Stock Incentive Plan (incorporated by reference to Exhibit 10.5 to SLB’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2022) (+)\n\n\n \n\n\n10.15\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2017 Omnibus Stock Incentive Plan, as amended and restated effective January 21, 2021 (incorporated by reference to Exhibit 10.1 to SLB’s Current Report on Form 8-K filed on April 7, 2021) (+)\n\n\n \n\n\n10.16\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDiscounted Stock Purchase Plan, as amended and restated effective July 1, 2022 (incorporated by reference to Exhibit 10.1 to SLB’s Current Report on Form 10-Q filed on July 27, 2022) (+)\n\n\n \n\n\n10.17\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2004 Stock and Deferral Plan for Non-Employee Directors, as amended and restated effective January 21, 2021 (incorporated by reference to Exhibit 10.3 to SLB’s Current Report on Form 8-K filed on April 7, 2021) (+)\n\n\n \n\n\n10.18\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForm of Indemnification Agreement (incorporated by reference to Exhibit 10.19 to SLB’s Annual Report on Form 10-K for the year ended December 31, 2023) (+)\n\n\n \n\n\n10.19\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSecurities Transactions Policy (*)\n\n\n \n\n\n19\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSignificant Subsidiaries (*)\n\n\n \n\n\n21\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIssuers of Registered Guaranteed Debt Securities (*)\n\n\n \n\n\n22\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nConsent of Independent Registered Public Accounting Firm (*)\n\n\n \n\n\n23\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPowers of Attorney (*)\n\n\n \n\n\n24\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCertification of Chief Executive Officer pursuant to Rule 13a-14(a) as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (*)\n\n\n \n\n\n31.1\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCertification of Chief Financial Officer pursuant to Rule 13a-14(a) as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (*)\n\n\n \n\n\n31.2\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (**)\n\n\n \n\n\n32.1\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (**)\n\n\n \n\n\n32.2\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nMine Safety Disclosure (*)\n\n\n \n\n\n95\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPolicy for Recovery of Performance-Based Incentive Compensation from Executive Officers (incorporated by reference to Exhibit 97 to SLB’s Annual Report on Form 10-K for the year ended December 31, 2023)\n\n\n \n\n\n97\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInline XBRL Instance Document (*)\n\n\n \n\n\n101.INS\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInline XBRL Taxonomy Extension Schema Document (*)\n\n\n \n\n\n101.SCH\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInline XBRL Taxonomy Extension Calculation Linkbase Document (*)\n\n\n \n\n\n101.CAL\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInline XBRL Taxonomy Extension Definition Linkbase Document (*)\n\n\n \n\n\n101.DEF\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInline XBRL Taxonomy Extension Label Linkbase Document (*)\n\n\n \n\n\n101.LAB\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInline XBRL Taxonomy Extension Presentation Linkbase Document (*)\n\n\n \n\n\n101.PRE\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101)\n\n\n \n\n\n104\n\n\n\n\n\n\n66\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nExhibit\n\n\n\n\n\n\n \n(*) Filed with this Form 10-K\n\n\n \n\n\n \n\n\n\n\n\n\n(**) Furnished with this Form 10-K\n\n\n \n\n\n \n\n\n\n\n\n\n(***) Certain of the exhibits and schedules to this exhibit have been omitted in accordance with Regulation S-K Item 601(b)(2). SLB agrees to furnish supplementally a copy of all omitted exhibits and schedules to the SEC upon its request.\n\n\n \n\n\n \n\n\n\n\n\n\n(+) Management contracts or compensatory plans or arrangements\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nThe Exhibits filed herewith do not include certain instruments with respect to long-term debt of Schlumberger Limited and its subsidiaries, inasmuch as the total amount of debt authorized under any such instrument does not exceed 10 percent of the total assets of Schlumberger Limited and its subsidiaries on a consolidated basis. SLB agrees, pursuant to Item 601(b)(4)(iii) of Regulation S-K, that it will furnish a copy of any such instrument to the SEC upon request.\n\n\n\n\n\n\n \n\n\nItem \n16.  Form 10-K Summary.\n \n\n\nNone.\n\n\n67\n\n\n\n\n \n\n\nSIGNA\nTURES\n\n\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDate:\n\n\n \n\n\nJanuary 22, 2025\n\n\n \n\n\n \n\n\nSCHLUMBERGER LIMITED\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\nBy:\n\n\n \n\n\n/s/ \nHoward Guild\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nHoward Guild\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nChief Accounting Officer\n\n\n\n\n\n\n \n\n\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nName\n \n\n\n \n\n\nTitle\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nChief Executive Officer and Director\n(Principal Executive Officer)\n\n\n\n\n\n\nOlivier Le Peuch\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ \nStephane Biguet\n\n\n \n\n\nExecutive Vice President and Chief Financial Officer\n(Principal Financial Officer)\n\n\n\n\n\n\nStephane Biguet\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ \nHoward Guild\n\n\n \n\n\nChief Accounting Officer\n(Principal Accounting Officer)\n\n\n\n\n\n\nHoward Guild\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nPeter Coleman\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nPatrick de La Chevardière\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nMiguel M. Galuccio\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nChairman of the Board\n\n\n\n\n\n\nJames Hackett\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nSamuel Leupold\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nTatiana A. Mitrova\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nMaria Moræus Hanssen\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nVanitha Narayanan\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nJeff W. Sheets\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nUlrich Spiesshofer\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ \nDianne B. Ralston\n\n\n \n\n\nJanuary 22, 2025\n\n\n\n\n\n\n*By Dianne B. Ralston, Attorney-in-Fact\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n68"
  }
}