{
  "ticker": "SMCI",
  "cik": "0001375365",
  "company_name": "Super Micro Computer, Inc.",
  "filing_date": "2025-08-28",
  "accession": "0001375365-25-000027",
  "primary_doc": "smci-20250630.htm",
  "item_sections": {
    "item1": "Item 1.        Business\nOur Company \nWe are a Silicon Valley-based provider of total IT solutions which address demanding workloads from the enterprise and cloud to the intelligent edge. We deliver rack-scale solutions optimized for various workloads, including artificial intelligence (“AI”) and high-performance computing (“HPC”), where acceleration is critical. Additionally, we offer an extensive portfolio of server and storage solutions for enterprise data centers, cloud service providers, and edge computing applications, such as 5G Telco, Retail and embedded.\nOur Total IT Solutions encompass complete servers, storage systems, modular blade servers, workstations, full-rack scale solutions, networking devices, server sub-systems and server management. These turn-key solutions are designed, developed, validated and installed for leading AI datacenters. Our Total IT Solutions are designed for optimal power and thermal management, including using Supermicro’s state-of-the-art liquid cooling technologies. We also provide global support and services to help our customers install, upgrade and maintain their computing infrastructure, including liquid-cooling operations. We offer our customers a high degree of flexibility and customization by providing a broad array of server models and configurations from which they can choose the best solutions to meet their computing needs. Our server and storage systems, sub-systems and accessories are architecturally designed for high reliability, quality, configurability, and scalability.\nOur in-house design competencies, design control over many of the sub-systems required within our server and storage systems, along with our Server Building Block Solutions\n®\n (an innovative, modular and open architecture) enable us to rapidly develop, build and test complete solutions, which include servers, storage, software, and networking components. As a result, when new technologies are brought to market, we are generally able to quickly assemble a broad portfolio of solutions by leveraging common building blocks across product lines. We work closely with the leading microprocessor, graphics processing units (“GPU”), memory, disk/flash, and interconnect vendors and other hardware and software suppliers to coordinate our new products’ design with their product release schedules. This enhances our ability to rapidly introduce new products by incorporating the latest technology, improve quality and reduce costs. We seek to be the first to market with superior product designs, and we have the ability to offer a broad selection of products using those technologies to our customers.  \nSMCI | 2025 Form 10-K | 1\nTable of Contents\nWe conduct our operations principally from our Silicon Valley headquarters and facilities in Taiwan and the Netherlands. Additionally as part of our efforts to expand our capacities, we added a new facility in Malaysia during the fiscal year ended June 30, 2025. Our sales and marketing activities operate through a combination of our direct sales force and indirect sales channel partners. We work with distributors, value-added resellers, system integrators, and original equipment manufacturers (“OEMs”) to market and sell our optimized solutions to their end customers in our indirect sales channels. \nStrategy\nOur objective is to be the world’s leading provider of Rack Scale Total IT Solutions, offering a comprehensive portfolio of high-performance, application-optimized server, storage and networking solutions. Achieving this objective requires continuous development and innovation of our Total IT Solutions portfolio with better price-performance and architectural advantages over both prior generations of our solutions and competitors’ offerings. Through our strategy, we seek to maintain or improve our relative competitive position in many product areas and pursue markets that provide us with additional long-term growth opportunities. Key elements of our strategy include executing upon the following:\nStrong Internal Research and Development and Internal Manufacturing Capability\nWe are continually investing in our engineering organization. As of June 30, 2025, we had over 3,200 employees in our research and development organization. These resources, along with our understanding of complex computing and storage requirements, enable us to deliver product innovation featuring advanced functionality and capabilities required by our customers. Also, our worldwide manufacturing facilities enable us to reduce the time to delivery in every geography around the world. Our engineers work directly with our manufacturing personnel to plan together and identify and address any issues together.\nIntroducing Innovative Products Faster\nWe seek to sustain advantages in both time-to-market and breadth of products by incorporating the latest technological innovations, such as new processors (central processing units (“CPUs”), and GPUs), liquid cooling enhancements, advancements in memory and storage, and evolving I/O technologies. We seek these advantages by leveraging our in-house design capabilities and our Building Block Solutions® architecture. This allows us to offer customers a broad range of products tailored to their specific application requirements and to focus on delivering products with better time-to-market. \nIn particular, during the fiscal year ended June 30, 2025 (“fiscal year 2025”):\n•\nWe delivered a comprehensive portfolio of AI-focused solutions, specifically designed to support the latest AI workloads, including products compatible with NVIDIA’s Hopper (H100/H200) and Blackwell (GB200/B200/RTX Pro 6000) generation platforms;\n•\nWe launched our Data Center Building Block Solutions (“DCBBS”), an integrated offering that simplifies the deployment of liquid-cooled AI factories. This solution includes all critical infrastructure components - servers, storage, networking, racks, liquid cooling infrastructure, software, services, and support;\n•\nWe unveiled DLC-2, our next-generation Direct Liquid Cooling solution, engineered to significantly reduce power and water consumption, noise, and spatial requirements in data centers. DLC-2 can lower electricity costs by up to 40% compared to air-cooled setups and reduce total cost of ownership (“TCO”) by up to 20%;\n•\nWe introduced new products supporting Intel\n®\n Xeon\n®\n 6900 Series processors and Intel\n®\n Xeon\n®\n 6 data center CPUs, as well as AMD EPYC™ 9005 Series CPUs and AMD Instinct™ MI350/355 Series GPUs;\n•\nWe expanded our edge and IoT portfolio with a variety of new systems designed for low-power environments that require compact, efficient compute solutions; and\n•\nWe broadened our storage offerings with an AI-optimized storage solution built for large-scale AI training workloads, and introduced new, enterprise-grade, scale-up storage products.\nCapitalizing on New Applications and Technologies\nIn addition to meeting traditional needs for server and storage systems, we have devoted, and will continue to devote, substantial resources to developing systems that support emerging and growing applications including AI, cloud computing, 5G/edge computing, storage and others. We believe there are significant opportunities for us in each of these rapidly developing markets, driven by stringent design requirements for these applications that often require the use of the latest technologies, allowing us to leverage our capabilities in product innovation, superior time-to-market, and portfolio breadth.\nSMCI | 2025 Form 10-K | 2\nTable of Contents\nLiquid Cooling\nTo reduce the high cost of operating and address constraints on power and cooling in data centers, IT managers increasingly turn to suppliers that offer high-performance, cost-effective, energy-efficient, and environmentally friendly products. Our resource saving architecture supports our leadership in green IT innovation. We offer product lines that are designed to share common computing resources, thereby saving both valuable space and power as compared to general-purpose rackmount servers. In addition, due to the advanced power requirements of these systems, we provide end-to-end liquid cooling solutions across our designs to optimize the elevated power and thermal management requirements. We believe our approach of leveraging an overall architecture that balances data center power requirements, cooling, shared resources and refresh cycles helps reduce environmental impact while providing TCO savings for our customers.\nLiquid cooling necessitates the need for rack-scale integration of the power and cooling infrastructure. We design, build, test, validate, and deliver complete rack scale solutions for liquid-cooled direct-to-chip cold plate solutions for CPUs, GPUs, and memory. In addition, we manufacture the sophisticated management systems -- Cooling Distribution Units, Cooling Distribution Manifolds -- to regulate system temperatures for maximum performance. Liquid cooling can be easily included in rack-level integrations to further increase system efficiency, reduce instances of thermal throttling, and lower both the TCO and Total Cost to Environment of data center deployments.\nDriving Software and Services Sales to our Global Enterprise Customers\nWe work closely with customers by offering total data center life-cycle management software. This enables data center operators to closely monitor their entire IT infrastructure, identify potential issues, and address them before they lead to failures. By offering management software and worldwide onsite and remote services to our customers, we also drive additional revenue for our total IT solutions. These software products and services are required for large-scale deployments, help meet service level agreements and address uptime requirements. In addition to our internal software development efforts, we partner with external software vendors to meet customer requirements.\nLeveraging Our Global Operating Structure\nWe are committed to expanding our worldwide manufacturing capacity and logistics operations across the United States, Taiwan, and the Netherlands, and we have increased our manufacturing capacity with our new facility in Malaysia. This strategic expansion allows us to serve our customers more efficiently while reducing overall manufacturing costs.\nProducts and Services\nWe offer a broad range of compute, storage and edge platforms that are application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories. These products are designed to serve a variety of markets, such as enterprise data centers, cloud computing, AI and 5G/edge computing. We complement our accelerated compute platforms inclusive of server and storage system offerings with software management, global services and support, the revenue for which is included in our server and storage systems revenue.\nSMCI | 2025 Form 10-K | 3\nTable of Contents\nServer and Storage Systems\nWe offer platforms in rackmount, blade, multi-node and embedded form factors, which support single, dual, and multiprocessor architectures. Our key product lines include:\n•\nAn extensive portfolio of liquid and air cooled AI Servers for Training and Inferencing with integrated GPUs or PCIe based architectures;\n•\nSuperBlade\n®\n,\n \nMicroBlade\n®\n, FlexTwin™, GrandTwin\n®\n, \nand\n BigTwin\n®\n blade and multi-node system families that are designed for density, performance, and efficiency that share common computing resources, thereby saving space and power over standard rackmount servers and offering superior serviceability and manageability;\n•\nSuperStorage\n systems that provide high-density storage while leveraging an efficient use of power to achieve performance-per-watt savings. Our storage systems are also designed for maximum performance for AI training environments;\n•\nHyper, CloudDC, and WIO\n an extensive rackmount system family that provides optimization for a broad range of workloads and environments that deliver entire clusters of racks, with both liquid-cooled and air-cooled options, per customer requirements;\n•\nEmbedded (5G/IoT/Edge)\n systems optimized for evolving networks and intelligent management of connected devices; and\n•\nMicroCloud\n server systems that deliver node density in environments with space and power constraints.\nIn addition to our server and storage platforms business, we offer a large array of modular server subsystems and accessories, including server boards, chassis, power supplies and other accessories. These subsystems serve as the foundation for platform solutions, covering a range of product offerings from entry-level single and dual-processor servers to high-end multiprocessor markets. The majority of the subsystems and accessories we sell individually are designed to work together to optimize performance and are ultimately integrated into complete server and storage systems.\nServer Software Management Solutions\nOur open industry-standard remote system management solutions, such as our Server Management suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer and SuperDoctor 5, are designed to efficiently manage large-scale heterogeneous data center environments, including liquid cooling. \nSupermicro Global Services\nWe are rapidly expanding our global service capabilities in support of large-scale AI Cluster deployments and the need to support Enterprise AI adoption in on-premise data centers. We provide global service and support offerings for our direct and OEM customers and our indirect sales channel partners, either directly or through approved distributors and third-party partners. We also identify service requirements, create and execute project plans, conduct verification testing, offer training, and provide technical documentation.\nRack Level Services: \nOur rack level services provide complete service from design to deployment for full rack and cluster level deployments of AI and HPC datacenters.  We leverage Supermicro experts and resources to work with leading CSP and Enterprise data centers to completely design and deliver turn-key solutions handling all phases of the data center design and rack integration and installation process.  We provide a single point of contact for the entire solution accelerating time to online and optimizing performance and efficiency.\nGlobal Services:\n Our strategic direct and OEM customers may purchase a variety of on-site support service plans. Our service plans vary in terms of specific services, response times, coverage hours and duration, repair priority levels, spare parts requirements, logistics, data privacy and security needs. Our Global Services team provides help desk services and on-site product support for our server and storage systems.\nSupport Services:\n Our customer support services offer competitive warranties, typically ranging from one-to-three years, and warranty extension options for products sold by our direct sales team and approved indirect sales channel partners. Our customer support team provides ongoing maintenance and technical support for our products through our website and 24/7 direct phone-based support.\nSMCI | 2025 Form 10-K | 4\nTable of Contents\nResearch and Development\nWe perform most of our research and development activities in-house in the United States at our facilities in San Jose, California, and in Taiwan. This approach enhances communication and collaboration between our design teams, streamlining the development process and reducing time-to-market. We believe that the combination of our focus on internal research and development activities, our close working relationships with local customers and vendors and our modular design approach allows us to decrease time-to-market, improve quality and deliver superior product designs. Additionally, we continue to invest in reducing our design and manufacturing costs while improving the performance, cost-effectiveness and power- and space-efficiency of our Total IT Solutions.\nOur research and development teams focus on the development of new and enhanced products that can support emerging technological and engineering innovations while achieving high overall system performance. Much of our research and development activity relates to the new product cycles of leading processor vendors. We work closely with NVIDIA, Intel and AMD, among others, to develop products that are compatible with the latest generation of industry-standard technologies under development. Our collaborative approach with these vendors allows us to align the design of our new products with their product release schedules, thereby enhancing our ability to rapidly introduce new products incorporating the latest technology. We work closely with their respective development teams to enhance system performance and reduce system-level issues. Similarly, we work very closely with our customers to understand their needs and develop our new product plans accordingly.\nCustomers\nDuring each of the fiscal years ended June 30, 2025, 2024, and 2023, we sold to over 1,000 customers in over 100 countries. In addition, over the three years ended June 30, 2025, we have sold to thousands of end users through our indirect sales channel. These customers represent a diverse set of market verticals including enterprise data centers, cloud computing, AI, 5G and edge computing markets. Four customers each accounted for 10% or more of our net sales in fiscal year 2025 and one single customer accounted for 10% or more of net sales in fiscal year 2024. No customer accounted for 10% or more of our net sales in fiscal year 2023.\nSales and Marketing \nOur sales and marketing activities are conducted through a combination of our direct sales force and our indirect sales channel partners. Our direct sales force is primarily focused on selling Total IT Solutions, including management software and global services, to large scale cloud, enterprise and OEM customers. In addition, we operate a centralized command center, designed to assist customers with quick and accurate configurations.\nWe work with distributors, value-added resellers, system integrators, and OEMs to market and sell our optimized solutions to their end customers. We provide sales and marketing assistance and training to our indirect sales channel partners and OEMs. We leverage our relationships in our indirect sales channel and with OEMs to penetrate select industry vertical market segments where our products can provide better alternatives to existing solutions.\nWe maintain close contact with our indirect sales channel partners and end customers. We often collaborate during the sales process with our indirect sales channel partners and the end customer’s technical staff to determine the optimal system configuration for the customer’s needs. Our interaction with our indirect sales channel partners and end customers allows us to monitor customer requirements and develop new products to meet their needs.\nInternational Sales\nOur global sales efforts are supported both by our international offices in the Netherlands, Taiwan, South Korea, United Kingdom, China, and Japan, as well as by our United States based sales team. Product fulfillment and first level support for our international customers are provided by Supermicro Global Services, as well as through our indirect sales channel and OEMs. Sales to customers located outside of the United States represented 40.6%, 32.0%, and 32.1% of net sales in fiscal years 2025, 2024, and 2023, respectively.\nSMCI | 2025 Form 10-K | 5\nTable of Contents\nMarketing\nOur marketing programs are designed to create global awareness and brand-recognition for our company and products, as well as an understanding of the significant value we bring to customers. These programs also inform existing and potential customers, the trade press, market analysts, indirect sales channel partners, and OEMs about the strong capabilities and benefits of using our products and solutions. Our marketing efforts support the sale and distribution of our products through both direct sales and indirect channels. We utilize a variety of marketing vehicles, including advertising, public relations, web, social media, collateral, and participation in industry events and tradeshows, to build market awareness and generate new customer demand. We provide cooperative marketing funds to our indirect sales channel partners to extend the reach of our marketing efforts. We also leverage our suppliers’ cooperative marketing programs to jointly benefit from their marketing development funds.\nIntellectual Property\nWe seek to protect our intellectual property rights with a combination of patents, trademarks, copyrights, trade secret laws, and disclosure restrictions. We rely primarily on trade secrets, technical know-how, and other unpatented proprietary information relating to our design and product development activities. We also enter into confidentiality and proprietary rights agreements with our employees, consultants, and other third parties and control access to our designs, documentation, and other proprietary information.\nManufacturing and Quality Control\nWe manufacture the majority of our systems at our San Jose, California headquarters. We believe we are the only major server, storage, and accelerated compute platform vendor that designs, develops, and manufactures a significant portion of their systems in the United States. Global assembly, test and quality control of our servers are performed at our manufacturing facilities in San Jose, California, Taiwan, the Netherlands, and Malaysia. In each of our existing facilities, a Quality and Environmental Management System has been certified according to ISO 9001, ISO 14001 and/or ISO 13485 standards. Our suppliers and contract manufacturers are required to adhere to the same standards to maintain consistent product and service quality and continuous improvement of quality and environmental performance.\nWe use several third-party suppliers and contract manufacturers for materials and sub-assemblies. We believe that selectively using outsourced manufacturing services allows us to focus on our core competencies in product design and development, and increases our operational flexibility. We believe our manufacturing strategy allows us to adjust manufacturing capacity in response to changes in customer demand and to rapidly introduce new products to the market. We use Ablecom Technology, Inc. (“Ablecom”) and its affiliate Compuware Technology, Inc. (“Compuware”), both of which are related parties, for contract design and manufacturing coordination support. We work with Ablecom to optimize modular designs for our chassis and several other components. Ablecom also coordinates the manufacturing of chassis for us. In addition to providing a large volume of contract manufacturing services to us, Ablecom warehouses multiple components and subassemblies manufactured by various suppliers before shipping them to our facilities in the United States, Europe, and Asia. We also have a series of agreements with Compuware, including multiple product development, production and service agreements, as well as product manufacturing agreements and lease agreements for office space. See Note 10, “Related Party Transactions” in the notes to the consolidated financial statements and Part III, Item 13, “Certain Relationships and Related Transactions and Director Independence.”\nWe continuously monitor our inventory to meet customer delivery requirements and minimize the risk of inventory obsolescence. Due to our building-block designs, our inventory can generally be used with multiple products, lowering working capital requirements and reducing the risk of inventory write-downs.\nCompetition\nThe market for our products is highly competitive, rapidly evolving and subject to new technological developments, changing customer needs and new product introductions. We compete primarily with large vendors of x86-based general purpose servers and components. In addition, we also face competition from smaller vendors that specialize in the sale of server components and systems. In recent years, we have experienced increased competition from original design manufacturers (“ODMs”) that benefit from their scale and very low-cost manufacturing and are increasingly offering their own branded products. We believe our principal competitors include:\n•\nglobal technology vendors, such as Cisco, Dell, Hewlett-Packard Enterprise, and Lenovo; and\n•\nODMs, such as Foxconn, Quanta Computer, and Wiwynn Corporation.\nSMCI | 2025 Form 10-K | 6\nTable of Contents\nThe principal competitive factors in our market include the following:\n•\nrack Scale Total IT Solutions to reduce TCO for our customers;\n•\nfirst to market with new emerging technologies, offered at a competitive price;\n•\nbroad product portfolio providing customers more options to optimize for their workload and environment;\n•\nhigh product performance, efficiency and reliability;\n•\nearly identification of emerging opportunities;\n•\ncost-effective design and manufacturing;\n•\nsufficient manufacturing capacity necessary to support market demand;\n•\nenergy efficient (Green Computing) product designs that reduce environmental impact, overall power consumption, and costs; and\n•\nlocalized and responsive customer support on a worldwide basis.\nWe believe that we compete favorably with respect to most of these factors. However, most of our competitors have longer operating histories, significantly greater resources, greater name recognition, or deeper market penetration. They may be able to allocate more resources to the development, promotion, and sale of their products, which could allow them to respond more quickly to new technologies and changes in customer needs. In addition, it is possible that new competitors could emerge and gain significant market share.\nGovernment Regulation\nOur worldwide business activities subject us to various federal, state, local, and foreign laws in the countries in which we operate, and our Total IT Solutions are subject to laws and regulations affecting their sale. To date, costs and expenses incurred to comply with these governmental regulations, including environmental and import and export controls regulations, have not been material to our business, financial condition, results of operations, and competitive position. Although there is no assurance that existing or future governmental laws and regulations, including environmental and import and export controls regulations, applicable to our operations or Total IT Solutions will not have a material adverse effect on our business, financial condition, results of operations, and competitive position, we do not currently anticipate material increases in expenditures for compliance with government regulations.\nWe are subject to U.S. and other applicable trade control regulations that restrict with whom we may transact business, including the trade sanctions enforced by the U.S. Treasury, Office of Foreign Assets Control and the import and export controls enforced by the U.S. Commerce Department’s Bureau of Industry and Security. If we fail to comply with laws and regulations restricting dealings with sanctioned countries, companies and/or persons subject to restricted party lists or parties engaged in restricted end uses, we may be subject to enforcement actions, including civil or criminal penalties. The United States and other countries continually update their lists of export-controlled items and technologies and may impose new or more-restrictive export requirements on our products in the future. As a result of regulatory changes, we may be required to obtain licenses or other authorizations to continue supporting existing customers or to supply existing products to new customers in China, Eastern Europe, Southeast Asia, and elsewhere. Further escalations in trade restrictions or hostilities, particularly between the United States and China, could impede our ability to sell or support our products. Our joint venture in China may become subject to additional trade restrictions, and those trade restrictions could harm our reputation in the market.\nIn October 2022, U.S. export restrictions and export licensing requirements were imposed targeting China’s semiconductor and supercomputing industries. These restrictions impact exports of software, hardware, equipment, and technology used to develop, produce or manufacture certain chips in China (including Hong Kong). At the same time, export restrictions and export license requirements were also imposed on certain GPUs and advanced integrated circuits, as well as computing equipment containing such components, with a focus on China (including Hong Kong). These restrictions impacted certain of our products, including products that contain the NVIDIA A100 and H100 integrated circuits, among others. \nIn November 2023, the export control restrictions on advanced integrated circuits, supercomputing and other end uses were revised and further expanded to cover additional countries where we sell our products, such as those in the Middle East, as well as additional parties based on the location of their headquarters, or the headquarters of their ultimate parent. Compliance with ever-changing regulations is complex and time consuming. We may experience delays in implementing procedures to address the evolving regulatory requirements.\nSMCI | 2025 Form 10-K | 7\nTable of Contents\nIn January 2025, the U.S. export control regulations targeting advanced integrated circuits and computing were further revised to include a worldwide authorization requirement for certain of our advanced computing products. New license exceptions were added to the regulations, allowing us to export in some cases without the need for an export license, thus expanding upon previous authorizations. However, these new regulations will, depending on the country and ultimate consignee, impose new limits on the number of advanced computing products that we can export to each ultimate consignee per calendar year, as well as the number of advanced computing products that the Commerce Department will license per-country over a given period to all exporters in the aggregate. These new limitations create a competitive process for obtaining the product allocation associated with these new government authorizations and therefore could disadvantage us relative to certain of our competitors. The limitations may also prevent us from selling our advanced computing products to the full extent of customer demand in certain countries that have not historically been subject to such limitations.\nIn May 2025, the U.S. Commerce Department announced that it is in the process of rescinding certain export control rules for advanced integrated circuits and computing systems and has ceased enforcement of certain aspects of the regulations previously issued in January 2025. The Commerce Department has indicated that it will issue new replacement export control regulations in the future, but the scope and timing of those regulatory changes remain uncertain. Such regulatory changes could impact our new and existing business, and place new regulatory requirements on our suppliers, customers and/or end users, or on the data centers into which our products are deployed. \nThe process to obtain licenses required under the recently adopted export control regulations is complicated and time-consuming in the event we determine to pursue them, and there is no guarantee that they will be granted. Our competitive position and future results may be harmed, over the long-term, if there are further changes in import and export controls, including further expansion of the geographic, customer, end use, deemed export, or product scope of the controls, if customers purchase product from competitors, if customers develop their own internal solution, if we are unable to provide contractual warranty or other extended service obligations, if licenses are not granted in a timely manner or denied to significant customers or if we incur significant transition costs. Even if requested licenses are granted, they may be temporary or impose burdensome conditions that we or our customers or end users cannot or choose not to fulfill. The licensing requirements may benefit certain of our competitors, as the licensing process could make our technical support efforts more cumbersome and less certain, encouraging customers to pursue alternatives to our products.\nSee “Risks Related to Regulatory, Legal, Our Stock, and Other Matters” for additional discussion of risks related to government regulation.\nHuman Capital Resources and Management\nMission, Culture, and Engagement\nThe key to success in technology is designing a company around people committed to work that they love. We aim to attract, develop, and retain a high performing and engaged global workforce. \nAs of June 30, 2025, we employed 6,238 employees, consisting of 3,255 employees engaged in research and development, 705 engaged in sales and marketing, 545 engaged in general and administrative and 1,733 engaged in manufacturing. Of these employees, 2,948 employees are based in our San Jose, California facilities. We consider our highly qualified and motivated employees to be a key factor in our business success. Our employees are not represented by any collective bargaining organization, and we have never experienced a work stoppage.\nWe are committed to protecting the environment through our “We Keep IT Green” initiative as a first to market innovator in high-performance, high-efficiency server, storage, networking, and management total solutions. We recognize the critical importance of talent and culture to our success and ability to fulfill this vision.\nWe encourage opportunities for growth and conduct regular performance reviews that set clear expectations to motivate employees and align their performance with our objectives. We communicate to our employees through a secure intranet site, executive communications, company meetings, and business-related emails.\nWe also believe that a workplace that encourages different voices, perspectives, and backgrounds fosters stronger teams, better solutions, and greater innovation. Employees should be treated fairly and respectfully regardless of their differences and feel welcomed to share their unique perspective, which we believe empowers valued contributors.\nSMCI | 2025 Form 10-K | 8\nTable of Contents\nTalent Development, Acquisition, Retention and Rewards\nTalent Strategy\nOur talent strategy focuses on attracting skilled, engaged employees who bring the talent and skills critical to our innovative and forward-looking workforce. Our recruiting process actively sources talent supporting our ability to hire candidates with professional qualifications and potential. We identify opportunities through tracking and analyzing data from various sources such as annual performance reviews to assess our progress in ensuring critical talent fills critical roles.  \nIt is our policy to ensure equal employment opportunity for all applicants and employees without regard to prohibited considerations of race, color, religion, sex (including pregnancy, gender identity, and sexual orientation), national origin, age, disability, genetic information, marital status, or any other classification protected by applicable local, state or federal laws. All employees receive training on the prevention of sexual harassment and abusive conduct in the workplace.\nTotal Rewards Program\nOur total rewards program is designed to attract and reward talented individuals who possess the skills necessary to support our business objectives, assist in the achievement of our strategic goals and create long-term value for our stockholders. We provide employees with compensation packages that include base salary in the form of cash and representing fixed compensation to reward individual performance and contributions (“Base Salary”), incentive bonus programs, and long-term equity awards, such as restricted stock units and options, which are tied to the value of our stock price. We believe that a compensation program with both short-term and long-term awards provides fair and competitive compensation, aligns employee and stockholder interests, incentivizes business and individual performance (pay for performance), motivates based on long-term company performance, and integrates compensation with our business plans. In addition to cash and equity compensation, we provide U.S. employees with a range of benefits, including life and health insurance (medical, dental, and vision), paid time off, sick leave, holiday pay, and a 401(k) plan. For employees outside of the U.S., we offer benefits based on local requirements.\nHealth, Safety & Wellness\nThroughout our history, we have remained committed to providing a safe workplace that protects against personal injury and minimizes environmental harm. We adhere to international standards and regulations to ensure product safety and security. Our health and safety programs emphasize personal accountability, professional conduct, and regulatory compliance, while fostering a culture of proactivity, caution, and open communication. In developing our products, we define and conduct various tests to ensure their safety and security. We evaluate risks using both government-mandated procedures and industry best practices to understand residual risk and appropriately safeguard our employees. Our proactive efforts to prevent occupational illnesses and injuries enable us to maintain a safe, healthy, and secure workplace. Additionally, we have a Safety Committee, dedicated to promoting communication about health, safety, and emergency response procedures, as well as facilitating continuous improvements to our work environment and practices. \nWe are committed to complying with all applicable laws related to labor and employment across every aspect of our operations. Beyond legal requirements, we adhere to global standards regarding the fair and ethical treatment of workers, such as those set by the Responsible Business Alliance, regarding the fair and ethical treatment of workers. These include preventing excessive working hours and unfair wages, implementing controls to prohibit child labor and human trafficking, and bolstering workplace health and safety measures. \nBoard Oversight of Human Capital Management\nOur Board of Directors, as part of its overall responsibility to provide oversight, has purview over matters related to human capital management. Our Compensation Committee oversees various aspects of human capital management, such as incentive and equity compensation plans, the administration of these plans, compensation matters outside the ordinary course of business, and compensation policies.\nCorporate Information\nWe were founded and maintain our worldwide headquarters in San Jose, California, where approximately half of our employees are based. As one of the largest employers in the City of San Jose, we are proud to be an active member of the San Jose and Silicon Valley communities.\nSMCI | 2025 Form 10-K | 9\nTable of Contents\nWe were incorporated in California in September 1993 and subsequently reincorporated in Delaware in March 2007. Our common stock is listed on the Nasdaq Global Select Market under the symbol “SMCI”. Our principal executive offices are located at 980 Rock Avenue, San Jose, California 95131. Our telephone number is (408) 503-8000, and our website address is www.supermicro.com.\nFinancial Information about Segments and Geographic Areas\nPlease see Note 15, “Segment Reporting” in the notes to the consolidated financial statements in this Annual Report for information regarding segment reporting, and Note 4, “Revenue” in the notes to the consolidated financial statements in this Annual Report for information regarding our net sales by geographic region. See Part I,",
    "item1a": "Item 1A of this Form 10-K for additional information about cybersecurity-related risks.\nGovernance\nAs part of its broader risk oversight activities, our Board maintains oversight of cybersecurity matters, including managing and assessing risks from cybersecurity threats.\n \nThe Audit Committee also reviews the adequacy and effectiveness of our information security policies and practices and the internal controls regarding information security risks. \nThe Audit Committee and the Board receive regular information security updates relating to cybersecurity risk from management, including from our Director of Information Security.\nCybersecurity risk is primarily managed by our \nDirectors of Information Security and Information Technology\n.\n \nThese individuals have decades of experience in managing cybersecurity risk for public companies.\n Additionally, we have established a cross-functional Cybersecurity Committee, consisting of executive-level leadership, including representatives from Finance, IT, Legal, and other teams, that meets periodically to review cybersecurity risks, incidents, and assess emerging threats. The Cybersecurity Committee is also informed of our responses to such risks, incidents and threats.\nOur cybersecurity incident response plan also contains mechanisms to notify executive management of cybersecurity incidents. As part of the plan, an executive-level leadership team may be activated and can act to direct our response efforts, to include mitigation and remediation activities, when appropriate.",
    "item1b": "Item 1B.    Unresolved Staff Comments\n    None.",
    "item1c": "Item 1C.    Cybersecurity\nRisk Management and Strategy\nWe have in place certain infrastructure, systems, policies, and procedures that are designed to proactively and reactively address risks from cybersecurity threats. This includes processes for assessing, identifying, and managing material risks from cybersecurity threats. Our information security management program seeks to follow processes set forth in recognized industry standards, and we evaluate and evolve our security measures as appropriate. We maintain a cybersecurity incident response plan that we practice and update as needed. \nThe identification, assessment and management of cybersecurity risk is \nintegrated\n into our overall enterprise risk management program that is ultimately overseen by the Board.\n \nWe consult with external parties, such as third-party cybersecurity firms, to provide, among other things, monitoring of systems, threat intelligence, and employee cybersecurity training. We also use third parties to assist our risk management processes by conducting security assessments.  \nSMCI | 2025 Form 10-K | 34\nTable of Contents\nWe also have a vendor risk assessment process to oversee and identify risks from cybersecurity threats associated with our use of third-party service providers.\n \nThese processes consist of the distribution and review of questionnaires designed to identify cybersecurity risks associated with the engagement of third parties.\n We also audit cybersecurity practices of certain third-party service providers, and take steps designed to ensure that such vendors have implemented data privacy and security controls that help mitigate the cybersecurity risks associated with these vendors, depending on the nature and sensitivity of the supplier and data it processes on our behalf. We routinely assess our high-risk suppliers’ conformance to industry standards and evaluate them for additional information, product, and physical security requirements. \nWe employ a number of protective measures, including firewalls, endpoint detection and response technologies, regular annual training of employees with respect to cybersecurity and testing employee competence with anti-phishing policies followed up by additional remedial training as needed.\n \nWhile there have been cyber incidents in the past, none of these incidents, individually or in aggregate, had a material adverse effect on our business strategy, operations, or financial conditions.\n Refer to “Risk Factors” in"
  }
}