{
  "ticker": "SNA",
  "cik": "0000091440",
  "company_name": "Snap-on Inc",
  "filing_date": "2025-02-13",
  "accession": "0000091440-25-000010",
  "primary_doc": "sna-20241228.htm",
  "item_sections": {
    "item1": "Item 1: Business\nSnap-on is a leading global innovator, manufacturer and marketer of tools, equipment, diagnostics, repair information and systems solutions for professional users performing critical tasks including those working in vehicle repair, aerospace, the military, natural resources, and manufacturing. From its founding in 1920, Snap-on has been recognized as the mark of the serious and the outward sign of the pride and dignity working men and women take in their professions. Products and services are sold through the company’s network of widely recognized franchisee vans as well as through direct and distributor channels, under a variety of notable brands. The company also provides financing programs to facilitate the sales of its products and to support its franchise business. \nSnap-on markets its products and brands worldwide in more than 130 countries. Snap-on’s largest geographic market is the United States.  In addition, Snap-on has a meaningful presence across continental Europe and in the Asia Pacific region, as well as in Canada and the United Kingdom.\nThe company began with the development of the original Snap-on interchangeable socket set and subsequently pioneered mobile tool distribution in the automotive repair market, where well-stocked vans sell to professional vehicle technicians at their place of business. Today, Snap-on defines its value proposition more broadly, extending its reach “beyond the garage” to deliver a broad array of unique solutions that make work easier for serious professionals. The company’s “coherent growth” strategy focuses on developing and expanding its professional customer base in its legacy automotive market, as well as in adjacent markets, additional geographies and other areas, including in critical industries, where the cost and penalties for failure can be high. In addition to its coherent growth strategy, Snap-on is committed to its “Value Creation Processes” – a set of strategic principles and processes designed to create value and employed in the areas of (i) safety; (ii) quality; (iii) customer connection; (iv) innovation; and (v) rapid continuous improvement (“RCI”). Snap-on’s RCI initiatives employ a structured set of tools and processes across multiple businesses and geographies intended to eliminate waste and improve operations. Savings from Snap-on’s RCI initiatives reflect benefits from a wide variety of ongoing efficiency, productivity and process improvements, including savings generated from product design cost reductions, improved manufacturing line set-up and change-over practices, lower-cost sourcing initiatives and facility consolidations.\nSnap-on’s primary customer segments include: (i) commercial and industrial customers, including professionals in critical industries and in emerging markets; (ii) professional vehicle repair technicians who purchase products through the company’s multinational mobile tool distribution network; and (iii) other professional customers related to vehicle repair, including owners and managers of independent service and repair shops, as well as original equipment manufacturer (“OEM”) dealership service and repair shops (“OEM dealerships”). Snap-on’s Financial Services customer segment includes: (i) franchisees’ customers, principally serving vehicle repair technicians, and Snap-on customers who require financing for the purchase or lease of tools, diagnostics, and equipment products on an extended-term payment plan; and (ii) franchisees who require financing options for vehicle and business needs.\n4\nSNAP-ON INCORPORATED\nSnap-on’s operating segments, which represent Snap-on’s reportable segments, are based on the organizational structure used by the Chief Executive Officer, its chief operating decision maker (“CODM”), to make operating and investment determinations and to assess performance. Snap-on’s reportable operating segments are: (i) the Commercial & Industrial Group; (ii) the Snap-on Tools Group; (iii) the Repair Systems & Information Group; and (iv) Financial Services. The Commercial & Industrial Group consists of business operations serving a broad range of industrial and commercial customers worldwide, including customers in the aerospace, natural resources, government and military, power generation, transportation and technical education market segments (collectively, “critical industries”), primarily through direct and distributor channels. The Snap-on Tools Group consists of business operations primarily serving vehicle service and repair technicians through the company’s multinational mobile tool distribution channel. The Repair Systems & Information Group consists of business operations serving other professional vehicle repair customers worldwide, primarily owners and managers of independent repair shops and OEM dealerships, through direct and distributor channels. Financial Services consists of the business operations of Snap-on Credit LLC (“SOC”), the company’s financial services business in the United States, and Snap-on’s other financial services subsidiaries in those international markets where Snap-on has franchise operations. See Note 19 to the Consolidated Financial Statements for information on operating segments and foreign operations.\nSnap-on evaluates the performance of the Commercial & Industrial Group, the Snap-on Tools Group and the Repair Systems & Information Group operating segments based on segment net sales and segment operating earnings while the Financial Services operating segment is evaluated based on segment revenue and segment operating earnings. The Snap-on Tools Group segment net sales reflect external net sales, while the Commercial & Industrial Group and the Repair Systems & Information Group segment net sales include both external and intersegment net sales. Snap-on accounts for intersegment net sales and transfers based primarily on standard costs with reasonable mark-ups established between the segments. Identifiable assets by segment are those assets used in the respective reportable segment’s operations. Corporate assets consist of cash and cash equivalents (excluding cash held at Financial Services), deferred income taxes and certain other assets. Corporate expenses primarily reflect stock-based compensation and other costs not attributable to an operating segment. Intersegment amounts are eliminated to arrive at Snap-on’s consolidated financial results.\nRecent Acquisitions\nSnap-on has continued to broaden its business through a series of coherent acquisitions, which have expanded and enhanced Snap-on’s capabilities in a variety of critical industries and in its business operations serving primarily owners and managers of independent repair shops and OEM dealerships. For information regarding recent acquisitions, see Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and Note 3 to the Consolidated Financial Statements.\nInformation Available on the Company’s Website\nAdditional information about Snap-on, including its products and its environmental, health and safety, social responsibility, governance and sustainability (collectively, “ESG”) commitment, is available on the company’s website at \nwww.snapon.com\n. Snap-on is not including the information contained on its website as a part of, or incorporating it by reference into, this Annual Report on Form 10-K. \nSnap-on’s Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Proxy Statements on Schedule 14A and Current Reports on Form 8-K, as well as any amendments to those reports, are made available to the public at no charge through the “Investors” section of the company’s website at \nwww.snapon.com\n. Snap‑on makes such material available on its website as soon as reasonably practicable after it electronically files such material with, or furnishes it to, the Securities and Exchange Commission (“SEC”). Copies of any materials the company files with the SEC can also be obtained free of charge through the SEC’s website at \nwww.sec.gov\n. In addition, Snap-on’s (i) charters for the Audit, Corporate Governance and Nominating, and Organization and Executive Compensation Committees of the company’s Board of Directors; (ii) Corporate Governance Guidelines; and (iii) Code of Business Conduct and Ethics are available on the company’s website. Snap-on will also post any amendments to these documents, or information about any waivers granted to directors or executive officers with respect to the Code of Business Conduct and Ethics, on the company’s website at \nwww.snapon.com\n.\n2024 ANNUAL REPORT\n5\nProducts and Services\nTools; Diagnostics, Information and Management Systems; and Equipment\nSnap-on offers a broad line of products and complementary services that are grouped into three product categories: (i) tools; (ii) diagnostics, information and management systems; and (iii) equipment. Further product line information is not presented as it is not practicable to do so. The following table shows the consolidated net sales of these product categories for the last three years:\n \nNet Sales\n(Amounts in millions)\n2024\n2023\n2022\nProduct Category:\nTools\n$\n2,546.2 \n$\n2,528.9 \n$\n2,399.4 \nDiagnostics, information and management systems\n1,028.1 \n991.2 \n942.4 \nEquipment\n1,133.1 \n1,210.1 \n1,151.0 \n$\n4,707.4 \n$\n4,730.2 \n$\n4,492.8 \nThe \ntools\n product category includes hand tools, power tools, tool storage products and other similar products. Hand tools include wrenches, sockets, ratchet wrenches, pliers, screwdrivers, punches and chisels, saws and cutting tools, pruning tools, torque measuring instruments and other similar products. Power tools include cordless (battery), pneumatic (air), hydraulic and corded (electric) tools, such as impact wrenches, ratchets, screwdrivers, drills, sanders, grinders and similar products. Tool storage includes tool chests, roll cabinets and other similar products. For many industrial customers, Snap-on creates specific, engineered solutions, including facility-level tool control and asset management hardware and software, custom kits in a wide range of configurations, and custom-built tools designed to meet customer requirements. The majority of products are manufactured by Snap-on and, in completing the product offering, other items are purchased from external manufacturers.\nThe \ndiagnostics, information and management systems\n product category includes handheld and computer-based diagnostic products, service and repair information products, diagnostic software solutions, electronic parts catalogs, business management systems and services, point-of-sale systems, integrated systems for vehicle service shops, OEM purchasing facilitation services, and warranty management systems and analytics to help OEM dealerships manage and track performance.\nThe \nequipment\n product category includes solutions for the service of vehicles and industrial equipment. Products include wheel alignment equipment, wheel balancers, tire changers, vehicle lifts, test lane equipment, collision repair equipment, vehicle air conditioning service equipment, brake service equipment, fluid exchange equipment, transmission troubleshooting equipment, safety testing equipment, battery chargers and hoists.\nSnap-on supports the sale of its diagnostics and vehicle service shop equipment by offering training programs as well as after-sales support for its customers, primarily focusing on the technologies and the application of specific products developed and marketed by Snap-on.\n6\nSNAP-ON INCORPORATED\nProducts are marketed under a number of brand names and trademarks, many of which are well known in the vehicle service and industrial markets served. Some of the major trade names and trademarks and the products and services with which they are associated include the following:\nNames\n  \nProducts and Services\nSnap-on\n  \nHand tools, power tools, tool storage products (including tool control software and hardware), diagnostics, certain equipment and related accessories, mobile tool stores, websites, electronic parts catalogs, warranty analytics solutions, business management systems and services, OEM specialty tools and equipment development and distribution, and OEM facilitation services\nATI\n  \nAircraft hand tools and machine tools\nAutoCrib\nAsset and tool control systems\nautoVHC\n  \nVehicle inspection and training services\nBAHCO\n  \nSaw blades, cutting tools, pruning tools, hand tools, power tools and tool storage, including tool control systems\nBlue-Point\n  \nHand tools, power tools, tool storage, diagnostics, certain equipment and related accessories\nCar-O-Liner\n  \nCollision repair equipment and information systems\nCartec\n  \nSafety testing, brake testers, test lane equipment, dynamometers, suspension testers, emission testers and other equipment\nCDI\n  \nTorque tools\nChallenger\n  \nVehicle lifts\nCognitran\nOEM SaaS products\nDealer-FX\nService operation solutions and OEM SaaS systems\nEcotechnics\n  \nVehicle air conditioning service equipment\nFastorq\nHydraulic torque and tensioning products\nFish and Hook\n  \nSaw blades, cutting tools, pruning tools, hand tools, power tools and tool storage\nHofmann\n  \nWheel balancers, vehicle lifts, tire changers, wheel aligners, brake testers and test lane equipment\nIrimo\n  \nSaw blades, cutting tools, hand tools, power tools and tool storage\nJohn Bean\n  \nWheel balancers, vehicle lifts, tire changers, wheel aligners, brake testers and test lane equipment\nJosam\n  \nHeavy duty alignment and collision repair solutions\nLindström\n  \nHand tools\nMitchell1\n  \nRepair and service information, shop management systems and business services\nMountz\nTorque tools\nNexiq\n  \nDiagnostic tools, information and program distributions for fleet and heavy duty equipment\nNorbar\n  \nTorque tools\nPower Hawk\nRescue tools and related equipment for military, government, fire and rescue\nPro-Cut\nBrake service equipment and accessories\nSandflex\n  \nHacksaw blades, bandsaws, saw blades, hole saws and reciprocating saw blades\nShopKey\n  \nRepair and service information, shop management systems and business services\nSioux\n  \nPower tools\nSturtevant Richmont\n  \nTorque tools\nSun\n  \nDiagnostic tools, wheel balancers, vehicle lifts, tire changers, wheel aligners, air conditioning products and emission testers\nTreadReader\nAutomotive tire drive-over ramps and handheld devices\nTruckCam\n  \nCommercial vehicle OEM factory solutions\nWilliams\n  \nHand tools, tool storage, certain equipment and related accessories\n2024 ANNUAL REPORT\n7\nFinancial Services\nSnap-on also generates revenue from various financing programs that include: (i) installment sales and lease contracts arising from franchisees’ customers and Snap-on customers who require financing for the purchase or lease of tools, diagnostics, and equipment products on an extended-term payment plan; and (ii) business and vehicle loans and leases to franchisees. The decision to finance through Snap-on or another financing source is solely by election of the customer. When assessing customers for potential financing, Snap-on considers various factors regarding ability to pay, including the customers’ financial condition, debt-servicing ability, past payment experience, and credit bureau and proprietary Snap-on credit model information, as well as the value of the underlying collateral.\nSnap-on offers financing through SOC and the company’s international finance subsidiaries in most markets where Snap-on has franchise operations. Financing revenue is recognized over the life of the underlying contracts, with interest or finance charges computed primarily on the average daily balances of the underlying contracts.\nMarkets\nSales and Distribution\nSnap-on markets and distributes its products and related services principally to professional tool and equipment users around the world. The two largest market sectors are the vehicle service and repair sector and the industrial sector.\nVehicle Service and Repair Sector\nThe vehicle service and repair sector has three main customer groups: (i) professional technicians who purchase tools, diagnostics, and equipment products for use in their work; (ii) other professional customers related to vehicle repair, including owners and managers of independent repair shops and OEM dealerships who purchase tools, diagnostics, and equipment products for use by multiple technicians within a service or repair facility; and (iii) OEMs.\nSnap-on provides innovative tool, equipment and business solutions, as well as technical sales support and training, designed to meet technicians’ evolving needs. Snap-on’s mobile tool distribution system offers technicians the convenience of purchasing quality tools at their place of business with minimal disruption of their work routine. Snap-on also provides owners and managers of repair shops, where technicians work, with tools, diagnostics, equipment, and repair and service information, including electronic parts catalogs and shop management products. Snap-on’s OEM facilitation business provides OEMs and OEM dealerships with products and services including special and essential tools as well as consulting and facilitation services, which are comprised of product procurement, distribution and administrative support for dealership equipment programs.\nThe market for vehicle service and repair is driven by an accelerating rate of technological change, car and truck population growth and increasing unit age, and the resulting effects of these changes on both our suppliers and customers. Snap-on has historically benefited from the increasing complexity of car and truck fleets and the changing tools, technologies and data needed to monitor, calibrate, service and repair evolving vehicle platforms. While new technologies, including those associated with alternative energy drivetrains and greater vehicle autonomy, may alter the nature of certain service and repair for particular vehicle types, we believe many of these new technologies provide opportunities to fulfill requirements for enhanced solutions or greater precision. Snap-on believes it is well-positioned to innovate new products to address these changing needs and to extend its leadership position in the expanding vehicle service and repair market sector.\nIndustrial Sector\nSnap-on markets its products and services globally to a broad cross-section of commercial and industrial customers, including maintenance and repair operations; manufacturing and assembly facilities; various government agencies, facilities and operations, including military operations; schools with vocational and technical programs; aviation and aerospace operations; oil and gas developers; mining operations; power generation operations, including those associated with alternative energies; equipment fabricators and operators; railroad manufacturing and maintenance; customers in agriculture; infrastructure construction companies; and other customers that require instrumentation, service tools and/or equipment for their products and business needs. The industrial sector for Snap-on focuses on providing value-added products and services to an increasingly expanding global base of customers in critical industries. \nThe industrial sector is characterized by a highly competitive environment with multiple suppliers offering either a full line or industry-specific portfolios for tools and equipment. Industrial customers increasingly require specialized solutions that provide repeatability and reliability in performing tasks of consequence that are specific to the particular end market in which they operate. Snap-on believes it is a meaningful participant in the industrial tools and equipment market sector.\n8\nSNAP-ON INCORPORATED\nDistribution Channels\nSnap-on serves customers primarily through the following channels of distribution: (i) the mobile van channel; (ii) company direct sales; (iii) distributors; and (iv) e-commerce. The following discussion summarizes Snap-on’s general approach for each channel and is not intended to be all-inclusive.\nMobile Van Channel\nIn the United States, a significant portion of sales to the vehicle service and repair sector is conducted through Snap‑on’s mobile franchise van channel. Snap-on’s franchisees primarily serve vehicle repair technicians and vehicle service shop owners, generally providing weekly contact at the customer’s place of business. Franchisees’ sales are concentrated in hand and power tools, tool storage products, shop equipment, diagnostics, and repair information products, which can be transported in a van or trailer and demonstrated during a sales call. Franchisees purchase Snap-on’s products at a discount from suggested list prices and resell them at prices established by the franchisee. U.S. franchisees are provided a list of calls that serves as the basis of the franchisee’s sales route. Snap-on’s franchisees also have the opportunity to add a limited number of additional franchises.\nSnap-on charges nominal initial and ongoing monthly franchise fees. Franchise fee revenue, including nominal, non-refundable initial and ongoing monthly fees (primarily for sales and business training, marketing and product promotion programs, and technology support), is recognized as the fees are earned. Franchise fee revenue totaled $19.4 million, $18.7 million and $18.4 million in fiscal 2024, 2023 and 2022, respectively.\nIn addition to its mobile van channel in the United States, Snap-on has franchise distribution models in certain other countries, including Canada, the United Kingdom, Japan, Australia, Germany, Netherlands, South Africa, New Zealand, Belgium and Ireland. In many of these markets, as in the United States, purchase decisions are generally made or influenced by professional vehicle service technicians as well as repair shop owners and managers. \nSnap-on also has a company-owned route program that is designed to: (i) provide another pool of potential field organization personnel; (ii) service customers in select new and/or open routes not currently serviced by franchisees; and (iii) allow Snap‑on to pilot new sales and promotional ideas before introducing them to franchisees. As of 2024 year end, company-owned routes comprised approximately 5% of the total route population. Snap-on may elect to increase or reduce the number of company-owned routes in the future. As of 2024 year end, Snap-on’s total route count was approximately 4,700, including approximately 3,400 routes in the United States.\nThrough SOC, financing is available to U.S. franchisees, including financing for van leases, working capital loans and loans to help enable new franchisees to fund the purchase of the franchise or the expansion of an existing franchise. In many international markets, Snap-on offers a variety of financing options to its franchisees and/or customer networks through its international finance subsidiaries. The decision to finance through Snap-on or another financing source is solely at the customer’s election.\nSnap-on supports its franchisees with a field organization of regional offices, franchise performance teams, customer care centers and distribution centers. Snap-on also provides sales and business training, and marketing and product promotion programs, as well as customer and franchisee financing programs through SOC and the company’s international finance subsidiaries, all of which are designed to strengthen franchisee sales. National Franchise Advisory Councils in the United States, the United Kingdom, Canada and Australia, composed primarily of franchisees that are elected by franchisees, assist Snap-on in identifying and implementing enhancements to the franchise program.\nCompany Direct Sales\nA significant proportion of shop equipment sales in North America under the Car-O-Liner, Challenger, Hofmann, John Bean and Pro-Cut brands, diagnostic products under the Snap-on brand, and information and shop management products under the Mitchell1 and Dealer-FX brands are made by direct and independent sales forces that have responsibility for national and other accounts. As the vehicle service and repair sector consolidates (with more business conducted by national chains and franchised service centers), Snap-on believes these larger organizations can be serviced most effectively by sales people who can demonstrate and sell the full line of diagnostics, equipment, and services. Snap-on also sells these products and services directly to OEMs and their franchised dealers.\nSnap-on brand tools and equipment are marketed to industrial and governmental customers worldwide through both industrial sales associates and independent distributors. Selling activities focus on industrial customers whose main purchase criteria are quality and integrated solutions. As of 2024 year end, Snap-on had industrial sales associates and independent distributors primarily in the United States, Canada and in various European, Latin American, Middle Eastern, Asia Pacific and African countries, with the United States representing the majority of Snap-on’s total industrial sales.\n2024 ANNUAL REPORT\n9\nSnap-on also sells software, services and solutions to the automotive, commercial, heavy duty, agriculture, power equipment and power sports segments. Products and services are marketed to targeted groups, including OEMs and their dealerships, fleets and individual repair shops. To effectively reach OEMs, which frequently have a multinational presence, Snap-on has deployed focused business teams globally.\nDistributors\nSales of certain tools and equipment are made through independent distributors who purchase the items from Snap-on and resell them to end users. Hand tools marketed under the ATI, BAHCO, CDI, Fastorq, Irimo, Lindström, Mountz, Norbar, Sioux, Sturtevant Richmont and Williams brands and trade names, for example, are sold through distributors worldwide. Asset and tool control solutions are sold under the AutoCrib brand primarily through distributors worldwide. Wheel service and other vehicle service equipment are sold through distributors primarily under brands including Car-O-Liner, Challenger, Ecotechnics, Hofmann, John Bean, and Pro-Cut. Diagnostics and equipment products are marketed through distributors in South America and Asia, and through both distributors and a direct sales force in Europe under the Snap-on, Blue-Point and Sun brands.\nE-commerce\nSnap-on offers current and prospective customers online access to research and purchase products through its public website, \nwww.snapon.com\n. The site features an online catalog of Snap-on hand tools, power tools, tool storage units and diagnostic equipment available to customers in the United States, the United Kingdom, Canada and Australia. E-commerce and certain other system enhancement initiatives are designed to improve productivity and further leverage the one-on-one relationships and service Snap-on has with its current and prospective customers. Sales through the company’s e-commerce distribution channel were not significant in any of the last three years.\nCompetition\nSnap-on competes on the basis of its product quality and performance, product line breadth and depth, service, brand awareness and imagery, technological innovation and availability of financing (through SOC or its international finance subsidiaries). While Snap-on does not believe that any single company competes with it across all of its product lines and distribution channels, various companies compete in one or more product categories and/or distribution channels.\nSnap-on is a leading manufacturer and distributor of professional tools, tool storage, diagnostics, equipment products, and repair software and solutions, offering a broad line of these products to both vehicle service and industrial marketplaces. Various competitors target and sell to professional technicians in the vehicle service and repair sector through the mobile tool distribution channel. Snap-on also competes with companies that sell tools and equipment to vehicle service and repair technicians online and through retail stores, vehicle parts supply outlets and tool supply warehouses/distributorships. Within the power tools category and the industrial sector, Snap-on has various other competitors, including companies with offerings that overlap with other areas discussed herein. Major competitors selling diagnostics, shop equipment, and information to vehicle dealerships and independent repair shops include OEMs and their proprietary electronic parts catalogs and diagnostics and information systems, and other companies that offer products serving this sector.\nResources\nRaw Materials and Purchased Product\nSnap-on’s supply of raw materials, including steel, and purchased components are generally available from numerous suppliers and the company continuously works to expand and enhance supplier relationships to meet its supply needs. Snap-on believes it has secured sufficient raw materials and purchased components for the near future to meet the expected general sales demand. While the company does experience raw material and component cost fluctuations, as well as availability variations from time to time and from operation to operation, Snap-on endeavors to employ its RCI processes to improve efficiencies and reduce waste to minimize the impact of any cost increases. The company does not currently anticipate any significant impact in 2025 from raw material and purchased component cost or availability issues. \nTo date, the company has not observed any meaningful supply shortages or cost increases directly or indirectly resulting from climate change factors.\n10\nSNAP-ON INCORPORATED\nPatents, Trademarks and Other Intellectual Property\nSnap-on vigorously pursues and relies on patent protection to safeguard its intellectual property and position in its markets. As of 2024 year end, Snap-on and its subsidiaries held approximately 940 active and pending patents in the United States and approximately 3,420 active and pending patents outside of the United States. Sales relating to any single patent did not represent a material portion of Snap-on’s revenues in any of the last three years.\nExamples of products that have features or designs that benefit from patent protection include hand tools, power tools, wheel alignment systems, wheel balancers, tire changers, vehicle lifts, tool storage, tool control, collision measurement, test lane equipment, brake lathes, electronic torque instruments, emissions-sensing devices and diagnostic equipment.\nMuch of the technology used in the manufacture of vehicle service tools and equipment is in the public domain. Snap-on relies primarily on trade secret protection for proprietary processes used in manufacturing. Methods and processes are patented when appropriate. Snap-on leverages trade secret and other protections, as well as contractual arrangements and confidentiality procedures, for its proprietary software and other innovative solutions. Copyright protection is also utilized when appropriate.\nTrademarks used by Snap-on are of continuing importance in the marketplace. Trademarks have been registered in the United States and many other countries, and additional applications for trademark registrations are pending. Snap-on vigorously polices proper use of its trademarks. Snap-on’s right to manufacture and sell certain products is dependent upon licenses from others; however, these products under license do not represent a material portion of Snap-on’s net sales.\nDomain names are a valuable corporate asset for companies around the world, including Snap-on. Domain names often contain a trademark or service mark or even a corporate name and are often considered intellectual property. The recognition and value of the Snap-on name, trademark and domain name are core strengths of the company.\nSnap-on strategically licenses the Snap-on brand to carefully selected manufacturing and distribution companies for items such as apparel and a variety of other goods, in order to further build brand awareness and market presence for the company’s strongest brand.\nGovernment Regulations\nSnap-on is subject to various federal, state and local laws, such as those related to international trade, data privacy, tax and government contracts, as well as environmental laws, ordinances, regulations, and requirements of government authorities in the United States and other nations. At Snap-on, environmental liabilities are managed through the Snap-on Environmental, Health and Safety Management System (“EH & SMS”), which is applied worldwide. The system is based upon continual improvement and is certified to ISO 9001:2015, ISO 14001:2015 and ISO 45001:2018, verified through Det Norske Veritas (DNV) Certification, Inc.\nSnap-on believes that it complies with applicable environmental and government requirements in its operations. Expenditures on environmental and governmental matters through EH & SMS have not had a material effect upon Snap-on’s capital expenditures, earnings or competitive position. However, the increasing global focus on climate change is resulting in new and/or more stringent environmental or climate-related regulations or standards. While such regulations have historically created select opportunities for our business operations, the company continually monitors developments in this area.\nHuman Capital Management\nAs of December 28, 2024, Snap-on employed approximately 13,000 people worldwide, of which approximately 7,300 were employed in the United States and approximately 5,700 were outside the United States.  Recently filed EEO-1 data is available under “ESG Reporting” in the “Investors” section of the company’s website at \nwww.snapon.com\n. Additionally, on a global basis, approximately 2,300 employees are represented by unions and/or covered under collective bargaining agreements with varying expiration dates through 2027. In recent years, Snap-on has not experienced any significant work slowdowns, stoppages or other labor disruptions. \nSnap-on is guided by the beliefs and values in the company’s “Who We Are” mission statement and strives to be the “employer of choice” for its current and future associates. Our “Who We Are” beliefs serve as the guidepost against which we evaluate performance in operating reviews throughout the company. Furthermore, through our Snap-on Value Creation Processes, a suite of principles we use every day, the company remains committed to the areas of safety, quality, customer connection, innovation and RCI, which are closely linked to and contribute to improving employee engagement, productivity, and efficiency. \n2024 ANNUAL REPORT\n11\nSuccessful execution of our way forward is dependent on attracting, developing and retaining key employees and members of our management team, which we achieve through the following:\n•\nSnap-on believes strongly in workplace safety. As a permanent priority agenda item at all operational meetings, safety comes first. Snap-on strives to maintain a safe workplace and expects its employees to broadly embrace the company’s safety programs. Snap-on invests in its strong safety culture and in elevating the importance of worker safety throughout all levels of the organization. For 2024, Snap-on had an overall safety incident rate of\n \n1.08\n (nu\nmber of injuries and illnesses multiplied by 200,000, divided by hours worked).\n•\nSnap-on is committed to its employees and provides developmental opportunities throughout the organization. Leadership reviews to identify high potential talent in the organization are conducted on an ongoing basis with all business units and on an annual basis with the Board of Directors. Snap-on offers competitive compensation and benefits to its employees, including performance-based and stock-based management incentive plans, an employee stock purchase plan for associates in the U.S. and Canada, as well as pension plans covering most U.S. employees and certain employees in foreign countries. Additional information related to these plans is included in Notes 11 and 13 to the Consolidated Financial Statements. Other benefits, including skill training and tuition assistance programs, are available to employees, but vary from location to location.\n•\nSnap-on is committed to providing equal opportunities across all of our stakeholders and the company does not tolerate discrimination. To further our support of makers and fixers, both within and outside our company, Snap-on is partnering with national nonprofit organizations and community colleges to leverage career and technical education to expand the opportunities in our facilities, as well as in the critical industries we serve and beyond, for people from all walks of life.\n•\nSnap-on’s people and the behaviors they display define our success, including integrity, respect and teamwork. Annual employee training is used to reinforce ethics, environmental matters, health and safety, human rights, informatio\nn/cyber security\n and regulatory compliance, which includes anti-corruption training for all relevant employees.\n \nSocial Responsibility and Sustainability Commitment\nSnap-on is deeply dedicated to honoring and celebrating the dignity of work. The company supports upskilling the workforce through collaborations with Career and Technical Education (CTE) schools across the United States and throughout the world, and with SkillsUSA and World Skills to engage youth in order to enable and promote technical careers. Additionally, the company is a founding partner of the National Coalition of Certification Centers (NC3), which aims to more effectively match technical school curricula with the precise needs of the current and future workplace by developing, implementing, and sustaining industry-recognized certifications with programs in automotive, aviation, energy, oil and gas, manufacturing and other critical industries. To date, over 350,000 students have earned Snap-on certifications, preparing them for successful and satisfying careers across various technical disciplines. \nSnap-on is committed to conducting business and making decisions honestly, ethically, fairly and within the law, and is guided by the company’s “Who We Are” mission statement, which is translated into multiple languages and prominently displayed in its facilities around the world. Snap-on is dedicated to earning and keeping the trust and confidence of its shareholders, customers, franchisees, distributors, retirees and associates, as well as of the communities where the company does business. Snap-on’s Code of Business Conduct and Ethics provides guidelines and a framework for conducting business in an ethical manner. These beliefs go beyond Snap-on and are expected of suppliers as detailed in the company’s Supplier Code of Conduct. Snap-on has adopted policies that seek to eliminate human trafficking, slavery, forced labor and child labor from its global supply chain, and has formalized its commitment to protecting human rights in the company’s Human Rights Policy.\nSnap-on prioritizes continuous improvement in all facets of its operations, including environmental matters and health and safety. The company strives to protect environmental quality and human welfare in its workplaces and in its communities by implementing sound policies designed to prevent, mitigate and reduce the company’s impact on the environment. The company has voluntarily reported Scope 1 and Scope 2 greenhouse gas (“GHG”) emissions to the CDP (formerly known as the Carbon Disclosure Project) on an annual basis since 2008. In\n 2024\n, the company’s total Scope 1 and Scope 2 GHG emissions of 89,085 metric tons of carbon dioxide equivalent (“CO2e”) reflected an intensity of 18.9 (metric tons of CO2e, divided by net sales in millions).\n12\nSNAP-ON INCORPORATED\nSnap-on’s sustainability framework is focused on key areas impacting our industry, including energy management, employee health and safety, and material management, and is aligned with the principles of the International Financial Reporting Standards Foundation (formerly known as the Sustainability Accounting Standards Board or “SASB”), which has been consolidated into the International Financial Reporting Standards Foundation. Snap-on’s SASB Index is available under “ESG Reporting” in the “Investors” section of the company’s website at \nwww.snapon.com\n. \nFeedback on the evaluation of risks and/or opportunities related to ESG matters identified by the company’s internal Environmental, Social and Governance Committee (the “ESGC”) and by the company’s operating units is included and discussed as part of the company’s quarterly operations reviews with senior management. The ESGC reports to the company’s Chief Executive Officer and updates the Corporate Governance and Nominating Committee about its plans and actions at least two times per year. The full Board has ultimate oversight of the company’s strategy related to ESG matters and receives regular reports on the subject from the Corporate Governance and Nominating Committee.\nAdditional information regarding the company’s sustainability commitment is available in the “Investors” section of the company’s website at \nwww.snapon.com\n.\nCustomers and Seasonality\nSnap-on does not have any single customer or government on which its business was substantially dependent in any of the indicated periods. Most of Snap-on’s businesses are not seasonal and their inventory needs are relatively constant.",
    "item1a": "Item 1A: Risk Factors for an additional discussion regarding risks related to information technology systems.",
    "item1b": "Item 1B: Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C: \nCybersecurity\nCybersecurity and related considerations are a component of Snap-on’s cross-functional approach to risk management. \nOur cybersecurity policies and practices follow the cybersecurity framework of the Center for Internet Security (“CIS”) Controls and are integrated into the company’s enterprise risk management practices.\n These practices are designed to enable the identification of, and provide management visibility into, the critical enterprise risks facing the company, as well as to facilitate the incorporation of risk considerations into company strategy and decision making. The company’s cybersecurity program is designed to detect, contain and respond to cybersecurity threats and incidents in a prompt and effective manner with the primary goals of protecting information assets, preventing the misuse and loss of those assets, minimizing disruptions to the business, and establishing the basis for audits and risk assessments.\n2024 ANNUAL REPORT\n21\nElements of the cybersecurity program include:\n•\nA cross-functional approach to addressing and managing the risk from cybersecurity threats and incidents involving management personnel from operations, legal, risk, finance, information technology and other key business functions, and with oversight by the Board of Directors.\n•\nCollaboration mechanisms with public and private entities, including intelligence and enforcement agencies (such as the Department of Homeland Security’s Cybersecurity and Infrastructure Security Agency), industry groups, consultants and other third-party service providers to identify and assess cybersecurity risks.\n•\nTechnical safeguards intended to protect the company’s information systems from cybersecurity threats, including data encryption, firewalls, threat monitoring, intrusion prevention and detection systems, anti-malware, access controls, privilege management, network segmentation, asset and end point management, and ongoing system security assessments.\n•\nAnnual training for personnel regarding cybersecurity threats based on their roles, responsibilities, and levels of system access.\n•\nA risk-based approach to identifying and monitoring cybersecurity risks presented by third parties, such as vendors and service providers, that includes periodic assessments.\n•\nA data incident response plan that addresses the company’s response to a cybersecurity threat or incident.\nThe company’s \nVice President and Chief Information Officer (the “CIO”)\n is principally responsible for overseeing the company’s cybersecurity risk management program.\n The company’s CIO, along with multidisciplinary teams throughout the company, works collaboratively to implement a program designed to protect the company’s information systems from, and respond to, cybersecurity threats and incidents, including any originating at its third-party providers. The company has also appointed a Vice President, Information Technology Infrastructure and Security (the “VP of IT”), who oversees its Information Security Team. \nThe CIO, who reports to the company’s President and Chief Executive Officer, has served in her role since 2017, and has over 20 years of information technology experience in positions of increasing responsibility. The VP of IT has served in information technology leadership roles at Snap-on for over 13 years.\n In addition to regularly updating senior management on information security matters as part of the company’s quarterly business review process, the CIO provides a dedicated presentation to the Board of Directors on information security matters at least once per year. The company’s Chief Executive Officer and Chief Financial Officer each have many years of experience of managing risk at the company, including risks arising from cybersecurity threats. We believe that the CIO, the VP of IT, our other information technology business leaders and members of senior management have the appropriate expertise, background and depth of experience to manage risks arising from cybersecurity threats.\nEach business group has a designated information security manager who is responsible for assessing the business unit’s cybersecurity risks and reporting them to the president of the group. The company holds quarterly gatherings involving, among others, the CIO, VP of IT, representatives from the legal department, and the information security managers for our operating groups. In addition, as noted above, cybersecurity considerations related to our business groups are incorporated into the company’s quarterly business review process, which involves senior management, including the Chief Executive Officer, the Chief Financial Officer, the Vice President, General Counsel and Secretary, the CIO and the VP of IT.\nA key part of the company’s strategy for managing risks from cybersecurity threats is the ongoing assessments and testing of the company’s practices through auditing, ethical hacking, and other exercises focused on evaluating effectiveness. The company regularly engages third parties to assess its information security environment. The company’s Internal Audit function also annually evaluates compliance with the company’s overall information technology policies, and the Vice President of Internal Audit reports the results of these assessments to the Audit Committee. \nIn addition, the company has established a data incident response plan, which provides employees with the process and mechanism to report any suspected or confirmed cybersecurity threat or data incident. The company’s response to cybersecurity incidents is managed and coordinated by the CIO, in consultation with the company’s Vice President, General Counsel and Secretary, and, when appropriate, will discuss the situation with the Chief Executive Officer and Chief Financial Officer. These leaders will determine whether to engage the company’s Incident Response Team, a cross-functional group led by the CIO that includes the VP of IT, as well as representatives from legal (including the Vice President, General Counsel and Secretary), human resources, treasury, public relations, finance (including the Chief Financial Officer), and affected operations. The company’s Information Security Team also promptly takes steps to protect the company’s systems and information by containing and mitigating the impact of any incident. The Incident Response Team involves others, as appropriate, including third parties, such as technical consultants and outside legal counsel, and determines when to notify law enforcement or regulatory authorities. The Incident Response Team also coordinates communications with internal and external stakeholders.\n22\nSNAP-ON INCORPORATED\nThe Incident Response Team leads the materiality assessment with input and guidance from senior management, including the Chief Executive Officer, Chief Financial Officer, and Chief Accounting Officer. In determining materiality, both quantitative and qualitative factors are considered, including the potential impact of the incident on the company’s operations, competitive position, financial results, reputation, and customer or vendor relationships, as well as the nature of the information potentially exposed and systems impacted. The Chief Executive Officer informs the Board of Directors and the Audit Committee regarding any significant incidents as well as collaborates on management’s recommendations concerning materiality. Management also facilitates external communications, as appropriate.\nManagement of cybersecurity risk is overseen by the company’s \nBoard of Directors\n and is supported by the Audit Committee. The Audit Committee is primarily responsible for evaluating the company’s policies with respect to risk assessment and risk management, and it reviews and discusses the company’s major financial and other risk exposures, including those relating to cybersecurity. Management annually briefs the Board on the company’s enterprise risk practices, including cybersecurity matters addressing a wide range of topics including new developments, evolving standards, vulnerability assessments, third-party and independent reviews, threat environment summaries, and technological trends.\n As discussed above, and when applicable, the Board and the Audit Committee also receive prompt information from the Chief Executive Officer regarding any material cybersecurity incident and appropriate ongoing updates regarding the same.\nIn response to the rapidly evolving cyber threat environment, the company continues to invest in data security and system resiliency.\n See also"
  }
}