{
  "ticker": "SNPS",
  "cik": "0000883241",
  "company_name": "SYNOPSYS INC",
  "filing_date": "2024-12-19",
  "accession": "0000883241-24-000024",
  "primary_doc": "snps-20241031.htm",
  "item_sections": {
    "item1": "Item 1 \nBusiness\n of this Annual Report.\nWe have consistently grown our revenue since 2005, despite periods of global economic uncertainty. We achieved these results because of our solid execution, leading technologies and strong customer relationships, and because we generally recognize our revenue for software licenses over the arrangement period, which typically approximates three years. See Note 2. \nSummary of Significant Accounting Polices and Basis of Presentation\n of the \nNotes to Consolidated Financial Statements \nin this Annual Report for a discussion on our revenue recognition policy\n. \nThe revenue we recognize in a particular period generally results from selling efforts in prior periods rather than the current period. As a result, decreases as well as increases in customer spending do not immediately affect our revenue in a significant way.\nOur growth strategy is based on maintaining and building on our leadership in our Design Automation products, expanding and proliferating our Design IP offerings and continuing to expand our product portfolio and our total addressable market. Our revenue growth from period to period is expected to vary based on the mix of our time based and upfront products. Based on our leading technologies, customer relationships, business model, diligent expense management, and acquisition strategy, we believe that we will continue to execute our strategies successfully.\nPending Acquisition of Ansys\nOn January 15, 2024, we entered into an Agreement and Plan of Merger (the Merger Agreement) to acquire all of the outstanding shares of Ansys, a provider of broad engineering simulation and analysis software and services, in a cash-and-stock transaction (the Ansys Merger) that values Ansys at approximately $35.0 billion, based on the closing price of Synopsys common stock on December 21, 2023.\nUnder the terms of the Merger Agreement, at the effective time of the Ansys Merger (the Effective Time), each share of Ansys common stock issued and outstanding immediately prior to the Effective Time (with certain exceptions set forth in the Merger Agreement) will be converted into the right to receive 0.3450 (the Exchange Ratio) of a share of Synopsys common stock and $197.00 in cash, without interest. The Exchange Ratio is expected to result in Ansys equityholders and Synopsys equityholders owning approximately 16.5% and 83.5%, respectively, of the combined company on a pro forma basis following the Effective Time. The Merger Agreement also provides for Synopsys’ assumption of certain outstanding Ansys options and other unvested Ansys equity awards held by continuing Ansys employees. If the stock consideration to be issued by Synopsys in connection with the Ansys Merger exceeds 19.9999% of the shares of Synopsys common stock issued and outstanding immediately prior to the Effective Time, the Exchange Ratio will be reduced to the minimum extent necessary to ensure that the aggregate number of shares of Synopsys common stock to be issued in connection with the Ansys Merger does not exceed such threshold, and the cash consideration will be correspondingly increased to offset such adjustment.\nPursuant to the Merger Agreement, at the Effective Time, two members of the board of directors of Ansys selected by mutual agreement of Synopsys and Ansys will become members of the Board of Directors of Synopsys. If the closing occurs less than six months prior to the next annual meeting of Synopsys’ stockholders, Synopsys will nominate such directors for election at such meeting. On March 19, 2024, Synopsys and Ansys mutually agreed to designate Dr. Ajei Gopal, the current President and Chief Executive Officer of Ansys, to become a member of the Synopsys Board of Directors at the Effective Time, subject to the completion of Synopsys’ director nomination process and satisfaction of all applicable eligibility requirements established by Synopsys’ Corporate Governance and Nominating Committee. Ansys and Synopsys have not yet determined or agreed on the remaining member of the Ansys board of directors to be appointed to the Synopsys Board of Directors. \nThe Ansys Merger was approved by the holders of a majority of the outstanding shares of Ansys common stock on May 22, 2024 and is anticipated to close in the first half of calendar year 2025. The Ansys Merger is subject to the satisfaction or waiver of customary closing conditions, including, among other things, the clearance of the Ansys Merger under certain antitrust and foreign investment regimes, and the continued effectiveness of the registration statement on Form S-4 (File No. 333-277912) filed by us on March 14, 2024 and declared\n effective by the SEC on April 17, 2024\n. Following the determination that it was a necessary step towards obtaining governmental approval of and successfully closing the Ansys Merger, on September 3, 2024, we signed a definitive agreement for the sale of \n37\nTable of \nContents\nour Optical Solutions Group to Keysight Technologies, Inc. (the Optical Solutions Divestiture). The Optical Solutions Divestiture is subject to customary closing conditions, including review by regulatory authorities, and the successful closing of the Ansys Merger.\nWe and Ansys each have termination rights under the Merger Agreement. A fee of $1.5 billion may be payable by us to Ansys, or a fee of $950.0 million may be payable by Ansys to us, upon termination of the Merger Agreement under specified circumstances, each as more fully described in the Merger Agreement. The receipt of financing by us is not a condition to complete the Ansys Merger.\nIn connection with the execution of the Merger Agreement, we entered into a commitment letter on January 15, 2024 (the Bridge Commitment Letter) with certain financial institutions that committed to provide, subject to the satisfaction of customary closing conditions, a senior unsecured bridge facility (the Bridge Commitment). On October 3, 2024, we reduced the Bridge Commitment by $1.1 billion to $10.6 billion following the closing of the Software Integrity Divestiture (as defined below). The Bridge Commitment currently provides for an aggregate principal amount of up to $10.6 billion. On February 13, 2024, we entered into a term loan facility credit agreement (the Term Loan Agreement), which provides us with the ability to borrow up to $4.3 billion at the closing of the Ansys Merger, subject to the satisfaction of customary closing conditions for similar facilities, for the purpose of financing a portion of the cash consideration to be paid in the Ansys Merger and paying related fees and expenses in connection with the Ansys Merger and the other transactions contemplated by the Merger Agreement. See Note 11.\n Bridge Commitment Letter, Term Loan and Revolving Credit Facilities\n of the \nNotes to Consolidated Financial Statements\n in this Annual Report for more information on the Bridge Commitment and the Term Loan Agreement.\nFor more on risks related to the Ansys Merger, see Part I,",
    "item1a": "Item 1A,\n Risk Factors\n.\nMaterial Cash Requirements\nOur material cash requirements include the following contractual and other obligations. \nLeases\nWe have operating lease arrangements for office space, data center, equipment and other corporate assets. As of \nOctober 31, 2024\n, we had lease payment obligations, net of immaterial sublease income, of $631.0 million, with $93.2 million payable within 12 months.\nPurchase Obligations\nPurchase obligations represent an estimate of all open purchase orders and contractual obligations in the ordinary course of business for which we have not received the goods or services. As of \nOctober 31, 2024\n, we had $650.0 million of purchase obligations, with $558.5 million payable within 12 months. Although open purchase orders are considered enforceable and legally binding, the terms may allow us the option to cancel, reschedule and adjust our requirements based on our business needs prior to the delivery of goods or performance of services.\nTerm Loan\nRefer to \"Bridge Commitment Letter, Term Loan and Revolving Credit Facilities” under Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n included in this Annual Report for more information. \nLong Term Accrued Income Taxes\nAs of \nOctober 31, 2024\n, we had $18.8 million of long-term accrued income taxes which represent uncertain tax benefits. Currently, a reasonably reliable estimate of timing of payments related to uncertain tax benefits in individual years beyond fiscal 2024 cannot be made due to uncertainties in timing of the commencement and settlement of potential tax audits.\n51\nTable of \nContents\n Item 7A.     \nQuantitative and Qualitative Disclosures About Market Risk\nWe are exposed to financial market risks, primarily due to changes in interest rates, foreign currency exchange rates, and non-marketable equity security price. None of market risk sensitive instruments are held for speculative trading purposes.\nInterest Rate Risk\n. The primary objective of our investment activities is to preserve the invested principal while maximizing yields without significantly increasing risk exposure. To achieve this objective, we maintain our portfolio of investments in a mix of tax-exempt and taxable instruments that meet high credit quality standards, as specified in our investment policy. Our policy also limits the amount of credit exposure to any one issue, issuer and type of instrument. \nOur exposure to market risk for changes in interest rates relates to our cash, cash equivalents, short-term investments, and outstanding debt. As of October 31, 2024, all of our cash, cash equivalents, and debt were at short-term variable or fixed interest rates. As of October 31, 2024, we had short term fixed income investment portfolio of $153.9 million. These securities, as with all fixed income instruments, are subject to interest rate risk and will decline in value if market interest rates increase. While par value generally approximates fair value on variable instruments, rising interest rates over time would increase both our interest income and our interest expense. \nOur cash equivalents and debt by fiscal year of expected maturity and average interest rates as of October 31, 2024 are as follows:\n \nMaturing in Year Ending \n \n2025\n2026\n2027\n2028\n2029 and thereafter\nTotal\nFair Value\n \n(in thousands)\nCash & Cash equivalents\n$\n3,778,164 \n$\n3,778,164 \n$\n3,778,164 \nApprox. average interest rate\n3.56 \n%\nShort-term investments\n$\n57,156 \n$\n58,484 \n$\n27,380 \n$\n4,260 \n$\n6,589 \n$\n153,869 \n$\n153,869 \nApprox. average coupon rate\n3.25 \n%\n4.17 \n%\n4.29 \n%\n4.43 \n%\n5.37 \n%\nShort-term debt (variable rate):\nCredit Facility in China\n$\n15,601 \n$\n15,601 \n$\n15,601 \nAverage interest rate\nLPR +\n.74% of such rate\nForeign Currency Risk.\n We operate internationally and are exposed to potentially adverse movements in currency exchange rates. The functional currency of the majority of our active foreign subsidiaries is the foreign subsidiary’s local currency. A weakening U.S. dollar relative to other currencies increases expenses of our foreign subsidiaries when they are translated into U.S. dollars in our consolidated statements of income. Likewise, a strengthening of the U.S. dollar relative to other currencies, including the renminbi or Yen, reduces revenue of our foreign subsidiaries upon translation and consolidation. If the U.S. dollar continues to strengthen, this could adversely affect our financial condition and operating results. In addition, increased international sales in the future may result in greater foreign currency denominated sales, increasing our foreign currency risk. Our operating expenses incurred outside the United States and denominated in foreign currencies are increasing and are subject to fluctuations due to changes in foreign currency exchange rates. If we are not able to successfully hedge against the risks associated with foreign currency fluctuations, our financial condition and operating results could be adversely affected. We enter into hedges in the form of foreign currency forward contracts to reduce our exposure to foreign currency rate changes on non-functional currency denominated forecasted transactions and balance sheet positions including: (1) certain assets and liabilities, (2) shipments forecasted to occur within approximately one month, (3) future billings and revenue on previously shipped orders, and (4) certain future intercompany invoices denominated in foreign currencies. The foreign currency contracts are carried at fair value and denominated in various currencies as listed in the tables below. The duration of forward contracts usually ranges from 2 months to 29 months. See Note 2. \nSummary of Significant Accounting Policies and Basis of Presentation\n and Note 9. \nFinancial Assets and Liabilities\n of the \nNotes to Consolidated Financial Statements \nin this Annual Report for a description of our accounting for foreign currency contracts\n.\n52\nTable of \nContents\nThe success of our hedging activities depends upon the accuracy of our estimates of various balances and transactions denominated in non-functional currencies. Exchange rates are subject to significant and rapid fluctuations due to a number of factors, including interest rate changes and political and economic uncertainty. Therefore, we cannot predict the prospective impact of exchange rate fluctuations. To the extent our estimates are correct, gains and losses on our foreign currency contracts will be offset by corresponding losses and gains on the underlying transactions. For example, if the Euro were to depreciate by 10% compared to the U.S. dollar prior to the settlement of the Euro forward contracts listed in the table below as of October 31, 2024, the fair value of the contracts would decrease by approximately $16.4 million, and we would be required to pay approximately $16.4 million to the counterparty upon contract maturity. At the same time, the U.S. dollar value of our Euro-based expenses would decline, resulting in positive cash flow of approximately $16.4 million that would offset the loss and negative cash flow on the maturing forward contracts.\nIf estimates of our balances and transactions prove inaccurate, we will not be completely hedged, and we will record gains or losses, depending upon the nature and extent of such inaccuracy. Although we engage in foreign currency hedging activity, we may be unable to hedge all of our foreign currency risk, which could have a negative impact on our results of operations.\n \nWe enter into foreign exchange forward contracts with financial institutions and have not experienced nonperformance by counterparties. Further, we anticipate performance by all counterparties to such agreements. \nInformation about the gross notional values of our foreign currency contracts as of October 31, 2024 is as follows:\nGross Notional\nAmount in\nU.S. Dollars\nAverage\nContract\nRate\n \n(in thousands)\n \nForward Contract Values:\nIndian rupee\n$\n589,799 \n86.973 \nJapanese yen\n469,566 \n151.041 \nEuro\n164,701 \n1.100 \nCanadian dollar\n157,536 \n1.369 \nChinese renminbi\n122,191 \n7.013 \nKorean won\n68,720 \n1,342.594 \nTaiwanese dollar\n64,599 \n32.042 \nIsrael shekel\n34,919 \n3.704 \nBritish pound sterling\n10,055 \n1.257 \nSingapore dollar\n2,557 \n1.328 \nSwiss franc\n1,698 \n0.883 \n$\n1,686,341 \nEquity Price Risk.\n Our non-marketable equity securities investments totaled $15.7 million and $19.1 million as of October 31, 2024 and 2023, respectively. Our strategic investments include privately-held companies that are considered to be in the start-up or development stages and have a higher inherent risk. Specifically, the technologies or products these companies have under development are typically in the early stages and may never materialize, which could result in a loss of a substantial part of our initial investment in these companies. These investments could be impaired if the carrying value exceeds the fair value and is not expected to recover. \nThe evaluation of these investments is based on information provided by these companies, which is not subject to the same disclosure regulations as U.S. publicly traded companies and as such, the basis for these evaluations is subject to the timing and accuracy of the data provided.\n53\nTable of \nContents\n Item 8.     \nFinancial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors \nSynopsys, Inc.:\nOpinions on the Consolidated Financial Statements and Internal Control Over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Synopsys, Inc. and subsidiaries (the Company) as of November 2, 2024 and October 28, 2023, the related consolidated statements of income, comprehensive income, stockholders’ equity, and cash flows for each of the fiscal years in the three-year period ended November 2, 2024, and the related notes (collectively, the consolidated financial statements). We also have audited the Company’s internal control over financial reporting as of November 2, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of November 2, 2024 and October 28, 2023, and the results of its operations and its cash flows for each of the fiscal years in the three-year period ended November 2, 2024, in conformity with U.S. generally accepted accounting principles. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of November 2, 2024 based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nBasis for Opinions\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s consolidated financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, \n54\nTable of \nContents\naccurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nEvaluation of the Company's analysis of terms and conditions in software and intellectual property license contracts with customers\nAs discussed in Notes 2 and 6 to the consolidated financial statements, the Company generates revenue from the sale of products that include software and intellectual property (IP) licenses, hardware products, maintenance and services. The Company's contracts with customers often include promises to transfer multiple products and services to a customer. Arrangements with customers can involve hundreds of products and various license rights, and customers negotiate with the Company over many aspects of these arrangements. The Company's customers often request a broader portfolio of solutions, support and services and seek more favorable terms such as expanded license usage, future purchase rights and other unique rights at an overall lower total cost. The Company recognized total revenue of $6,127.4 million for the fiscal year ended November 2, 2024, which included revenue related to software and IP licenses.\nWe identified the evaluation of the Company's analysis of terms and conditions in significant software and IP license contracts with customers and their effect on revenue recognition as a critical audit matter. Complex auditor judgment was required to assess the Company's judgments made in applying revenue recognition requirements to certain terms and conditions. \nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the Company's revenue recognition process, including the Company's analysis of terms and conditions in software and IP license contracts with customers and their effect on revenue recognition. We tested certain software and IP license customer contracts by inspecting the underlying customer agreements and evaluating the Company's assessment of the contractual terms and conditions in accordance with revenue recognition requirements. For a selection of software and IP license contracts with customers entered during the year, we inquired of personnel outside of the accounting function to corroborate our understanding of certain terms and conditions.\n/s/ KPMG LLP\nWe have served as the Company’s auditor since 1992.\nSanta Clara, California\nDecember 18, 2024 \n55\nTable of \nContents\nSYNOPSYS, INC.\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except par value amounts)\n \nOctober 31,\n \n2024\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n3,896,532\n \n$\n1,433,966\n \nShort-term investments\n153,869\n \n151,639\n \n      Total cash, cash equivalents and short-term investments\n4,050,401\n \n1,585,605\n \nAccounts receivable, net\n934,470\n \n856,660\n \nInventories\n361,849\n \n325,590\n \nPrepaid and other current assets\n1,122,946\n \n548,115\n \nCurrent assets of discontinued operations\n—\n \n114,654\n \nTotal current assets\n6,469,666\n \n3,430,624\n \nProperty and equipment, net\n563,006\n \n549,837\n \nOperating lease right-of-use assets, net\n565,917\n \n559,923\n \nGoodwill\n3,448,850\n \n3,346,065\n \nIntangible assets, net\n195,164\n \n239,577\n \nDeferred income taxes\n1,247,258\n \n853,526\n \nOther long-term assets\n583,700\n \n444,820\n \nLong-term assets of discontinued operations\n—\n \n908,759\n \nTotal assets\n$\n13,073,561\n \n$\n10,333,131\n \nLIABILITIES, REDEEMABLE NON-CONTROLLING INTEREST AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable and accrued liabilities\n$\n1,163,592\n \n$\n1,059,914\n \nOperating lease liabilities\n94,791\n \n79,832\n \nDeferred revenue\n1,391,737\n \n1,559,461\n \nCurrent liabilities of discontinued operations\n—\n \n286,244\n \nTotal current liabilities\n2,650,120\n \n2,985,451\n \nLong-term operating lease liabilities\n574,065\n \n579,686\n \nLong-term deferred revenue\n340,831\n \n150,827\n \nLong-term debt\n15,601\n \n18,078\n \nOther long-term liabilities\n469,738\n \n381,531\n \nLong-term liabilities of discontinued operations\n—\n \n33,257\n \nTotal liabilities\n4,050,355\n \n4,148,830\n \nRedeemable non-controlling interest\n30,000\n \n31,043\n \nStockholders’ equity:\nPreferred stock, $\n0.01\n par value: \n2,000\n shares authorized; \nnone\n outstanding\n—\n \n—\n \nCommon stock, $\n0.01\n par value: \n400,000\n shares authorized; \n154,112\n and \n152,053\n shares outstanding, respectively\n1,541\n \n1,521\n \nCapital in excess of par value\n1,211,206\n \n1,276,152\n \nRetained earnings\n8,984,105\n \n6,741,699\n \nTreasury stock, at cost: \n3,148\n and \n5,207\n shares, respectively\n(\n1,025,770\n)\n(\n1,675,650\n)\nAccumulated other comprehensive income (loss)\n(\n180,380\n)\n(\n196,414\n)\nTotal Synopsys stockholders’ equity\n8,990,702\n \n6,147,308\n \nNon-controlling interest\n2,504\n \n5,950\n \nTotal stockholders’ equity\n8,993,206\n \n6,153,258\n \nTotal liabilities, redeemable non-controlling interest and stockholders’ equity\n$\n13,073,561\n \n$\n10,333,131\n \nSee the accompanying \nNotes to Consolidated Financial Statements\n.\n56\nTable of \nContents\nSYNOPSYS, INC.\nCONSOLIDATED STATEMENTS OF INCOME\n(In thousands, except per share amounts)\n \nYear Ended October 31,\n \n2024\n2023\n2022\nRevenue:\nTime-based products\n$\n3,224,299\n \n$\n3,016,256\n \n$\n2,657,724\n \nUpfront products\n1,802,222\n \n1,400,125\n \n1,221,240\n \n    Total products revenue\n5,026,521\n \n4,416,381\n \n3,878,964\n \nMaintenance and service\n1,100,915\n \n901,633\n \n736,750\n \nTotal revenue\n6,127,436\n \n5,318,014\n \n4,615,714\n \nCost of revenue:\nProducts\n770,238\n \n697,686\n \n594,007\n \nMaintenance and service\n367,055\n \n287,876\n \n259,332\n \nAmortization of acquired intangible assets\n107,996\n \n45,281\n \n44,674\n \nTotal cost of revenue\n1,245,289\n \n1,030,843\n \n898,013\n \nGross margin\n4,882,147\n \n4,287,171\n \n3,717,701\n \nOperating expenses:\nResearch and development\n2,082,360\n \n1,849,935\n \n1,589,846\n \nSales and marketing\n859,342\n \n724,934\n \n642,729\n \nGeneral and administrative\n568,496\n \n376,677\n \n313,554\n \nAmortization of acquired intangible assets\n16,238\n \n9,295\n \n11,637\n \nRestructuring charges\n—\n \n53,091\n \n11,221\n \nTotal operating expenses\n3,526,436\n \n3,013,932\n \n2,568,987\n \nOperating income\n1,355,711\n \n1,273,239\n \n1,148,714\n \nInterest and other income (expense), net\n158,147\n \n32,231\n \n(\n45,262\n)\nIncome before income taxes\n1,513,858\n \n1,305,470\n \n1,103,452\n \nProvision (benefit) for income taxes\n99,718\n \n90,188\n \n139,385\n \nNet income from continuing operations\n1,414,140\n \n1,215,282\n \n964,067\n \nIncome from discontinued operations, net of income taxes\n821,670\n \n2,843\n \n14,369\n \nNet income\n2,235,810\n \n1,218,125\n \n978,436\n \nLess: Net income (loss) attributed to non-controlling interest and redeemable non-controlling interest\n(\n27,570\n)\n(\n11,763\n)\n(\n6,158\n)\nNet income attributed to Synopsys\n$\n2,263,380\n \n$\n1,229,888\n \n$\n984,594\n \nNet income attributed to Synopsys:\nContinuing operations\n$\n1,441,710\n \n$\n1,227,045\n \n$\n970,225\n \nDiscontinued operations\n821,670\n \n2,843\n \n14,369\n \nNet income\n$\n2,263,380\n \n$\n1,229,888\n \n$\n984,594\n \nNet income per share attributed to Synopsys - basic:\nContinuing operations\n$\n9.41\n \n$\n8.06\n \n$\n6.34\n \nDiscontinued operations\n5.37\n \n0.02\n \n0.10\n \nBasic net income per share\n$\n14.78\n \n$\n8.08\n \n$\n6.44\n \nNet income per share attributed to Synopsys - diluted:\nContinuing operations\n$\n9.25\n \n$\n7.91\n \n$\n6.20\n \nDiscontinued operations\n5.26\n \n0.01\n \n0.09\n \nDiluted net income per share\n$\n14.51\n \n$\n7.92\n \n$\n6.29\n \nShares used in computing per share amounts:\nBasic\n153,138\n \n152,146\n \n153,002\n \nDiluted\n155,944\n \n155,195\n \n156,485\n \nSee the accompanying \nNotes to Consolidated Financial Statements\n.\n57\nTable of \nContents\nSYNOPSYS, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands)\n \nYear Ended October 31,\n \n2024\n2023\n2022\nNet income\n$\n2,235,810\n \n$\n1,218,125\n \n$\n978,436\n \nOther comprehensive income (loss):\nChange in foreign currency translation adjustment\n8,150\n \n(\n13,912\n)\n(\n108,145\n)\nChange in unrealized gains (losses) on available-for-sale securities, net of tax of $\n0\n for periods presented\n1,460\n \n1,513\n \n(\n2,353\n)\nCash flow hedges:\nDeferred gains (losses), net of tax of $(\n3,052\n), $(\n8,940\n), and $\n28,416\n for fiscal years 2024, 2023 and 2022, respectively\n9,625\n \n24,986\n \n(\n79,069\n)\nReclassification adjustment on deferred (gains) losses included in net income, net of tax of $(\n446\n), $(\n10,053\n), and $(\n1,342\n) for fiscal years 2024, 2023 and 2022, respectively\n(\n3,201\n)\n25,276\n \n4,894\n \nOther comprehensive income (loss), net of tax effects\n16,034\n \n37,863\n \n(\n184,673\n)\nComprehensive income\n2,251,844\n \n1,255,988\n \n793,763\n \nLess: Net income (loss) attributed to non-controlling interest and redeemable non-controlling interest\n(\n27,570\n)\n(\n11,763\n)\n(\n6,158\n)\nComprehensive income attributed to Synopsys\n$\n2,279,414\n \n$\n1,267,751\n \n$\n799,921\n \nSee the accompanying \nNotes to Consolidated Financial Statements.\n58\nTable of \nContents\nSYNOPSYS, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(In thousands)\n \nCapital in\nExcess of\nPar\nValue\nRetained\nEarnings\nTreasury\nStock\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nTotal \nSynopsys\nStockholders’\nEquity\nNon-controlling\nInterest\nStockholders'\nEquity\nCommon Stock\n \nShares\nAmount\nBalance at October 31, 2021\n153,062\n \n$\n1,531\n \n$\n1,576,363\n \n$\n4,549,713\n \n$\n(\n782,866\n)\n$\n(\n49,604\n)\n$\n5,295,137\n \n$\n3,806\n \n$\n5,298,943\n \nNet income\n984,594\n \n984,594\n \n(\n1,306\n)\n983,288\n \nOther comprehensive income (loss), net of tax effects\n(\n184,673\n)\n(\n184,673\n)\n(\n184,673\n)\nPurchases of treasury stock\n(\n3,609\n)\n(\n36\n)\n36\n \n(\n1,135,000\n)\n(\n1,135,000\n)\n(\n1,135,000\n)\nEquity forward contract, net\n35,000\n \n35,000\n \n35,000\n \nCommon stock issued, net of shares withheld for employee taxes\n2,922\n \n29\n \n(\n581,001\n)\n644,911\n \n63,939\n \n63,939\n \nStock-based compensation\n456,728\n \n456,728\n \n2,301\n \n459,029\n \nBalance at October 31, 2022\n152,375\n \n$\n1,524\n \n$\n1,487,126\n \n$\n5,534,307\n \n$\n(\n1,272,955\n)\n$\n(\n234,277\n)\n$\n5,515,725\n \n$\n4,801\n \n$\n5,520,526\n \nNet income\n1,229,888\n \n1,229,888\n \n(\n1,761\n)\n1,228,127\n \nOther comprehensive income (loss), net of tax effects\n37,863\n \n37,863\n \n37,863\n \nPurchases of treasury stock\n(\n2,992\n)\n(\n30\n)\n30\n \n(\n1,160,724\n)\n(\n1,160,724\n)\n(\n1,160,724\n)\nEquity forward contract, net\n(\n45,000\n)\n(\n45,000\n)\n(\n45,000\n)\nCommon stock issued, net of shares withheld for employee taxes\n2,670\n \n27\n \n(\n725,211\n)\n(\n19,108\n)\n758,029\n \n13,737\n \n13,737\n \nStock-based compensation\n558,078\n \n558,078\n \n5,214\n \n563,292\n \nAdjustments to redeemable non-controlling interest\n(\n3,388\n)\n(\n3,388\n)\n(\n3,388\n)\nRecognition of non-controlling interest upon issuance of subsidiary stock\n1,129\n \n1,129\n \n(\n2,304\n)\n(\n1,175\n)\nBalance at October 31, 2023\n152,053\n \n$\n1,521\n \n$\n1,276,152\n \n$\n6,741,699\n \n$\n(\n1,675,650\n)\n$\n(\n196,414\n)\n$\n6,147,308\n \n$\n5,950\n \n$\n6,153,258\n \nNet income\n2,263,380\n \n2,263,380\n \n(\n5,552\n)\n2,257,828\n \nOther comprehensive income (loss), net of tax effects\n16,034\n \n16,034\n \n16,034\n \nPurchases of treasury stock\n(\n74\n)\n(\n1\n)\n1\n \n(\n45,000\n)\n(\n45,000\n)\n(\n45,000\n)\nEquity forward contract, net\n45,000\n \n45,000\n \n45,000\n \nCommon stock issued, net of shares withheld for employee taxes\n2,133\n \n21\n \n(\n799,210\n)\n694,880\n \n(\n104,309\n)\n(\n104,309\n)\nStock-based compensation\n687,765\n \n687,765\n \n4,551\n \n692,316\n \nAdjustments to redeemable non-controlling interest\n(\n20,974\n)\n(\n20,974\n)\n(\n20,974\n)\nRecognition of non-controlling interest upon issuance of subsidiary stock\n1,498\n \n1,498\n \n(\n2,445\n)\n(\n947\n)\nBalance at October 31, 2024\n154,112\n \n$\n1,541\n \n$\n1,211,206\n \n$\n8,984,105\n \n$\n(\n1,025,770\n)\n$\n(\n180,380\n)\n$\n8,990,702\n \n$\n2,504\n \n$\n8,993,206\n \nSee the accompanying \nNotes to Consolidated Financial Statements\n.\n59\nTable of \nContents\nSYNOPSYS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\n \nYear Ended October 31,\n \n2024\n2023\n2022\nCash flows from operating activities:\nNet income\n$\n2,235,810\n \n$\n1,218,125\n \n$\n978,436\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nAmortization and depreciation\n295,065\n \n247,120\n \n228,405\n \nReduction of operating lease right-of-use assets\n97,273\n \n97,705\n \n89,541\n \nAmortization of capitalized costs to obtain revenue contracts\n73,587\n \n82,190\n \n73,026\n \nStock-based compensation\n692,316\n \n563,292\n \n459,029\n \nAllowance for credit losses\n19,724\n \n19,932\n \n(\n3,477\n)\nGain on sale of strategic investments\n(\n55,077\n)\n—\n \n—\n \nGain on divestitures, net of transaction costs\n(\n868,830\n)\n—\n \n—\n \nAmortization of bridge financing costs\n33,677\n \n—\n \n—\n \nDeferred income taxes\n(\n407,649\n)\n(\n211,045\n)\n(\n36,913\n)\nOther \n(\n1,295\n)\n13,295\n \n10,188\n \nNet changes in operating assets and liabilities, net of effects from acquisitions and dispositions:\nAccounts receivable\n(\n103,460\n)\n(\n178,432\n)\n(\n251,390\n)\nInventories\n(\n51,449\n)\n(\n123,752\n)\n1,320\n \nPrepaid and other current assets\n(\n410,432\n)\n(\n106,396\n)\n(\n89,983\n)\nOther long-term assets\n(\n168,255\n)\n(\n100,618\n)\n(\n15,283\n)\nAccounts payable and accrued liabilities\n187,564\n \n170,496\n \n(\n34,066\n)\nOperating lease liabilities\n(\n96,966\n)\n(\n73,281\n)\n(\n85,828\n)\nIncome taxes\n(\n73,215\n)\n198,078\n \n1,644\n \nDeferred revenue\n8,641\n \n(\n113,435\n)\n414,251\n \nNet cash provided by operating activities\n1,407,029\n \n1,703,274\n \n1,738,900\n \nCash flows from investing activities:\nProceeds from maturities and sales of short-term investments\n138,961\n \n130,435\n \n93,696\n \nPurchases of short-term investments\n(\n136,821\n)\n(\n131,079\n)\n(\n97,245\n)\nProceeds from sales of strategic investments\n55,696\n \n8,492\n \n582\n \nPurchases of strategic investments\n(\n1,293\n)\n(\n435\n)\n(\n7,000\n)\nPurchases of property and equipment, net\n(\n123,161\n)\n(\n189,618\n)\n(\n136,589\n)\nAcquisitions, net of cash acquired\n(\n156,947\n)\n(\n297,692\n)\n(\n422,374\n)\nProceeds from business divestiture, net of cash divested\n1,446,578\n \n—\n \n—\n \nCapitalization of software development costs\n—\n \n(\n2,204\n)\n(\n2,493\n)\nOther\n—\n \n—\n \n(\n1,200\n)\nNet cash provided by (used in) investing activities\n1,223,013\n \n(\n482,101\n)\n(\n572,623\n)\nCash flows from financing activities:\nRepayment of debt\n(\n2,607\n)\n(\n2,603\n)\n(\n76,838\n)\nPayment of bridge financing and term loan costs\n(\n72,265\n)\n—\n \n—\n \nIssuances of common stock\n232,212\n \n252,986\n \n237,956\n \nPayments for taxes related to net share settlement of equity awards\n(\n337,541\n)\n(\n241,408\n)\n(\n174,005\n)\nPurchase of equity forward contract\n—\n \n(\n45,000\n)\n—\n \nPurchases of treasury stock\n—\n \n(\n1,160,724\n)\n(\n1,100,000\n)\nOther\n(\n1,096\n)\n(\n122\n)\n(\n3,413\n)\n       Net cash used in financing activities\n(\n181,297\n)\n(\n1,196,871\n)\n(\n1,116,300\n)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n8,797\n \n(\n2,979\n)\n(\n65,296\n)\nNet change in cash, cash equivalents and restricted cash\n2,457,542\n \n21,323\n \n(\n15,319\n)\nCash, cash equivalents and restricted cash, beginning of year, including cash from discontinued operations\n1,441,187\n \n1,419,864\n \n1,435,183\n \nCash, cash equivalents and restricted cash, end of year, including cash from discontinued operations\n3,898,729\n \n1,441,187\n \n1,419,864\n \nLess: Cash, cash equivalents and restricted cash from discontinued operations\n—\n \n4,947\n \n4,269\n \n60\nTable of \nContents\nCash, cash equivalents and restricted cash from continuing operations\n$\n3,898,729\n \n$\n1,436,240\n \n$\n1,415,595\n \nSupplemental disclosure of cash flow information:\nCash paid for income taxes during the year:\n$\n680,064\n \n$\n97,956\n \n$\n167,768\n \nInterest payments during the year:\n$\n814\n \n$\n996\n \n$\n1,258\n \nNon-cash activities:\nPurchase of property and equipment included in accounts payable\n$\n32,014\n \n$\n21,672\n \n$\n17,857\n \nConversion of notes receivable to non-marketable equity securities\n$\n—\n \n$\n2,000\n \n$\n14,280\n \nContingent consideration receivable in connection with divestiture\n$\n22,202\n \n$\n—\n \n$\n—\n \nSee the accompanying \nNotes to Consolidated Financial Statements.\n61\nTable of Contents\nSYNOPSYS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1. \nDescription of Business\nSynopsys, Inc. (Synopsys, we, our or us) delivers trusted and comprehensive silicon to systems design solutions, from electronic design automation (EDA), including system verification and validation solutions, to silicon intellectual property (IP). We partner closely with semiconductor and systems customers across a wide range of industries to maximize their engineering and research and development capacity. We are catalyzing the era of pervasive intelligence, powering innovation today that ignites the ingenuity of tomorrow. \nWe are a global leader in supplying the mission-critical EDA software that engineers use to design and test integrated circuits (ICs), also known as chips or silicon, and we are pioneering artificial intelligence (AI) driven chip design across the full-stack EDA suite to improve efficiency and accelerate the design, verification testing and manufacturing of advanced digital and analog chips. We provide software and hardware used to validate the electronic systems that incorporate chips and the software that runs on them, including cloud-based digital design flow to boost chip-design development productivity. We also provide technical services and support to help our customers develop advanced chips and electronic systems. These products and services are part of our Design Automation segment.\nWe also offer a broad and comprehensive portfolio of semiconductor IP solutions, which are pre-designed circuits that engineers use as components of larger chip designs to reduce integration risk and speed time to market. Our high quality, silicon-proven semiconductor IP includes logic libraries, embedded memories, analog IP, wired and wireless interface IP, security IP, embedded processors and subsystems. To accelerate IP integration and silicon bring-up, our IP Accelerated initiative provides architecture design expertise, hardening, and signal and power integrity analysis. These products and services are part of our Design IP segment.\nNote 2. \nSummary of Significant Accounting Policies and Basis of Presentation\nBasis of Presentation and Principles of Consolidation.\n \nHistorically, our fiscal years have been 52- or 53-week periods ending on the Saturday nearest to October 31. Fiscal 2024 was a 53-week year ending on November 2, 2024. Fiscal 2023 and 2022 were 52-week years and ended on October 28, 2023 and October 29, 2022, respectively. For presentation purposes, the consolidated financial statements and accompanying notes refer to the closest calendar month end. We have changed our fiscal year end from the Saturday nearest to October 31 and consisting of 52 or 53 fiscal weeks to a fiscal year end of October 31 each year. The fiscal year change becomes effective with our fiscal 2025, which began on November 3, 2024. Our fiscal quarters will end on January 31, April 30, July 31 and October 31 of each year.\nThe consolidated financial statements include our accounts and the accounts of our wholly and majority-owned subsidiaries. All intercompany accounts and transactions have been eliminated in consolidation.\n \nUse of Estimates.\n \nTo prepare financial statements in conformity with U.S. GAAP, management must make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. Actual results could differ from these estimates and could have a material impact on our operating results and financial position.\nSoftware Integrity Divestiture.\n On May 5, 2024, we entered into an Equity Purchase Agreement, by and between Synopsys and Sapphire Software Buyer, Inc., an entity controlled by funds affiliated with Clearlake Capital Group, L.P. and Francisco Partners (together, the Sponsors). On September 30, 2024, we completed the previously announced sale of our Software Integrity business to entities controlled by funds affiliated with the Sponsors (the Software Integrity Divestiture). We previously determined that the Software Integrity Divestiture met the criteria to be disclosed as discontinued operations in the second quarter of fiscal 2024 as it represented a significant strategic shift that had a major effect on our operations and financial results. The results of the Software Integrity business, including the gain on divestiture, are presented as discontinued operations in the consolidated statements of income, and as such, have been excluded from both continuing operations and segment results for all periods presented. Further, we reclassified the assets and liabilities of the Software Integrity business as assets and liabilities of discontinued operations in the consolidated balance sheets as of October 31, 2023. The consolidated statements of cash flows are presented on a consolidated basis for both continuing operations and discontinuing operations. We did not allocate any general corporate overhead to the Software Integrity business. Unless otherwise noted, reference within these \nNotes to Consolidated Financial Statements\n relates to continuing \n62\nTable\n of Contents\noperations. See Note 3. \nDiscontinued Operations \nof the \nNotes to Consolidated Financial Statements \nin this Annual Report.\nSegment Reporting.\n As a result of the Software Integrity Divestiture, we changed our reportable segment from the \nthree\n reportable segments to the following \ntwo\n reportable segments: (1) Design Automation, which includes our advanced silicon design, verification products and services, system integration products and services, digital, custom and FPGA IC design software, verification software and hardware products, manufacturing software products and other; and (2) Design IP, which includes our interface, foundation, security, and embedded processor IP, IP subsystems, and IP implementation services. Our Chief Operating Decision Maker (CODM), our Chief Executive Officer (CEO) reviews disaggregated segment information, assess performance against our key growth strategies and allocates resources. See Note 20. \nSegment Disclosure \nof the \nNotes to Consolidated Financial Statements \nin this Annual Report\n. \nPrior period segment results and related disclosures have been reclassified to conform to the current period segment presentation.\nCash Equivalents and Short-term Investments\n.\n We consider all highly liquid investments with original maturities of \nthree months\n or less at the date of purchase to be cash equivalents. \nOur investments in debt securities with remaining maturities greater than \nthree months\n at the date of purchase are designated as available-for-sale securities as we may convert these investments into cash at any time to fund general operations, and included in short-term investments in the consolidated balance sheets. Our debt securities\n generally have an effective maturity term of less than \nthree years\n and are carried at fair value, with unrealized gains and losses included in the consolidated balance sheets as a component of accumulated other comprehensive income (loss). For available-for-sale debt securities in an unrealized loss position, we evaluate whether a current expected credit loss exists based on available information relevant to the credit rating of the security, current economic conditions and reasonable and supportable forecasts. The allowance for credit loss is recorded in interest and other income (expense), net, in the consolidated statements of income, not to exceed the amount of the unrealized loss. Any excess unrealized loss other than the credit loss is recognized in accumulated other comprehensive income or loss in the stockholders' equity section of the consolidated balance sheets. The cost of securities sold is based on the specific identification method and realized gains and losses are included in interest and other income (expense), net. See Note 9.\n Financial Assets and Liabilities \nof the \nNotes to Consolidated Financial Statements \nin this Annual Report.\nInvestments in Equity Securities. \nWe hold equity securities in privately held companies for the promotion of business and strategic objectives. We account for these investments using either the measurement alternative approach when the fair value of the investment is not readily determinable and we do not have the ability to exercise significant influence, or the equity method of accounting when it is determined that we have the ability to exercise significant influence. Investments accounted for using the measurement alternative approach are initially recorded at cost and adjusted for changes in fair value from observable transactions. For investments accounted for using the equity method of accounting, we record our proportionate share of the investee’s income or loss to interest and other income (expense), net, in our consolidated statements of income. These investments are subject to a periodic impairment review, and are included in other long-term assets in the consolidated balance sheets.\nAccounts Receivable, Net.\n The balances consist of billed accounts receivable and current portion of unbilled accounts receivable. Trade accounts receivables are recorded at the invoiced amount and do not bear interest.\nAllowance for Credit Losses.\n We maintain an allowance for credit losses for expected uncollectible accounts receivable and contract assets, which is recorded as an offset to accounts receivable or contract assets and provisions for credit losses are recorded in general and administrative expense in the consolidated statements of income. The allowance for current expected credit losses is based on a review of customer accounts and considers historical credit loss information that is adjusted for current conditions and reasonable and supportable forecasts. The allowance for credit losses is reviewed on a quarterly basis to assess the adequacy of the allowance.\n \nThe following table presents the changes in the allowance for credit losses:\n63\nTable\n of Contents\nFiscal Year\nBalance at\nBeginning\nof Period\nProvisions\nWrite-offs/Adjustments\nBalance at\nEnd of\nPeriod\n \n(in thousands)\n2024\n$\n50,366\n \n$\n19,286\n \n$\n(\n5,609\n)\n$\n64,043\n \n2023\n$\n38,586\n \n$\n18,345\n \n$\n(\n6,565\n)\n$\n50,366\n \n2022\n$\n27,034\n \n$\n11,486\n \n$\n66\n \n$\n38,586\n \nInventories.\n \nInventories are computed at standard costs which approximate actual costs, on a first-in, first-out basis and valued at the lower of cost or net realizable value. Inventories primarily include components and finished goods for complex emulation and prototyping hardware systems. The valuation process includes a review of the forecasts based upon future demand and market conditions. Inventory provisions are recorded when the costs are determined to be in excess of anticipated demand or considered obsolete. Inventory provisions are impacted by market and economic conditions, technology changes, new product introductions and changes in strategic direction, and require estimates that may include uncertain elements.\nFair Values of Financial Instruments.\n Our cash equivalents, short-term investments and foreign currency contracts are carried at fair value. The fair value of our accounts receivable and accounts payable approximates the carrying amount due to their short duration. Non-marketable equity securities are accounted for using either the measurement alternative or equity method of accounting. We perform periodic impairment analysis on these non-marketable equity securities. The carrying amount of the short-term and long-term debt approximates the estimated fair value. See Note 10. \nFair Value Measurements \nof the \nNotes to Consolidated Financial Statements\n in this Annual Report.\nForeign Currency Contracts.\n We operate internationally and are exposed to potentially adverse movements in currency exchange rates. We enter into hedges in the form of foreign currency forward contracts to reduce our exposure to foreign currency rate changes on non-functional currency denominated forecasted transactions and balance sheet positions. The assets or liabilities associated with the forward contracts are recorded at fair value in other current assets or accrued liabilities in the consolidated balance sheets.\nThe accounting for gains and losses resulting from changes in fair value depends on the use of the foreign currency forward contract and whether it is designated and qualifies for hedge accounting. See Note 9.\n Financial Assets and Liabilities \nof the \nNotes to Consolidated Financial Statements \nin this Annual Report.\nConcentration of Credit Risk.\n Financial instruments that potentially subject us to significant concentrations of credit risk consist principally of cash equivalents, short-term investments, foreign currency contracts, and trade accounts receivable. We maintain cash equivalents primarily in highly rated taxable and tax-exempt money market funds located in the U.S. and in various overseas locations. Our short-term investments include a variety of financial instruments, such as corporate debt and municipal securities, U.S. Treasury and Government agency securities. By policy, we limit the amount of credit exposure with any one issue, issuer and type of instrument.\nWe sell our products worldwide primarily to customers in the global electronics market. We perform on-going credit evaluations of our customers’ financial condition and do not require collateral. We establish reserves for potential credit losses and such losses have been within management’s expectations and have not been material in any year presented.\nIncome Taxes.\n We account for income taxes using the asset and liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nWe account for uncertainty in income taxes using a two-step approach to recognizing and measuring uncertain tax positions. The first step is to evaluate the tax position for recognition by determining whether it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. The second step is to measure the tax benefit as the largest amount which is more than 50% likely of being realized \n64\nTable\n of Contents\nupon ultimate settlement. An uncertain tax position is considered effectively settled on completion of an examination by a taxing authority if certain other conditions are satisfied.\nProperty and Equipment.\n Property and equipment is recorded at cost less accumulated depreciation. Assets, excluding land, are depreciated using the straight-line method over their estimated useful lives.\n Depreciation expenses were $\n162.9\n million, $\n141.4\n million and $\n103.9\n million in fiscal 2024, 2023 and 2022, respectively. Repair and maintenance costs are expensed as incurred and such costs were $\n89.4\n million, $\n74.4\n million and $\n65.2\n million in fiscal 2024, 2023 and 2022, respectively.\nThe useful lives of depreciable assets are as follows:\n \nUseful Life in Years\nComputer and other equipment\n3\n - \n8\nBuildings\n30\nFurniture and fixtures\n5\nLeasehold improvements \nShorter of the lease term or the estimated useful life\nLeases\n.\n We determine if an arrangement is a lease at inception of the contract, which is the date on which the terms of the contract are agreed to, and the agreement creates enforceable rights and obligations. A contract is or contains a lease when we have the right to control the use of an identified asset for a period of time. The commencement date of the lease is the date that the lessor makes an underlying asset available for use by the lessee. On the commencement date, leases are evaluated for classification and assets and liabilities are recognized based on the present value of lease payments over the lease term.\nThe lease term used to calculate the lease liability includes options to extend or terminate the lease when it is reasonably certain that the option will be exercised. The right of use (ROU) asset is initially measured as the amount of lease liability, adjusted for any initial lease costs, prepaid lease payments and any lease incentives. Variable lease payments, consisting primarily of reimbursement of costs incurred by lessors for common area maintenance, real estate taxes and insurance, are not included in the lease liability and are recognized as they are incurred.\nAs most of our leases do not provide an implicit rate, we use the incremental borrowing rate at lease commencement to measure ROU assets and lease liabilities. We use a benchmark senior unsecured yield curve for debt instruments over the similar term, and consider specific credit quality, market conditions, tenor of lease arrangements, and quality of collateral to determine the incremental borrowing rate.\nOperating lease expense is generally recognized on a straight-line basis over the lease term. We have elected the practical expedient to account for the lease and non-lease components as a single lease component for the majority of our asset classes. For leases with an initial term of one year or less, we have elected not to record the ROU asset or liability.\nBusiness Combinations.\n \nWe allocate the purchase price of acquired companies to the tangible and intangible assets acquired and liabilities assumed based on their acquisition-date fair values with the exception of contract assets and contract liabilities (deferred revenue) which are recognized and measured on the acquisition date in accordance with our “Revenue Recognition” policy. The excess of the fair value of purchase consideration over the fair value of these identifiable assets and liabilities is recorded as goodwill. Acquisition-related expenses are recognized separately from the business combination and are expensed as incurred. We include the results of operations of the businesses that are acquired from the acquisition date.\nGoodwill.\n \nGoodwill represents the excess of the aggregate purchase price over the fair value of the net tangible and identifiable intangible assets acquired by us. All goodwill acquired in a business combination is assigned to one or more reporting units as of acquisition date. We have \ntwo\n reportable segments, and reporting units are determined to be the same as reportable segments. The carrying amount of goodwill at each reporting unit is tested for impairment annually on the first day of the fourth fiscal quarter, or more frequently if facts and circumstances warrant a review. We perform either a qualitative or quantitative assessment for goodwill impairment test. When a quantitative goodwill impairment assessment is performed, we use an income approach based on discounted cash \n65\nTable\n of Contents\nflow analysis, a market approach based on market multiples, or a combination of both. If the fair value of a reporting unit is less than its carrying value, a goodwill impairment loss is recorded for the difference.\n \nIntangible Assets.\n Intangible assets consist of acquired technology, certain contract rights, customer relationships, trademarks and trade names, and capitalized software. These intangible assets are acquired through business combinations, direct purchases, or internally developed capitalized software. Intangible assets are amortized on a straight-line basis over their estimated useful lives which range from \none\n to \nthirteen years\n.\nWe review the carrying values of long-lived assets including intangible assets whenever events or changes in circumstances indicate that the carrying value may not be fully recoverable. Recoverability of long-lived assets is measured by comparing the carrying value of such asset group to the future undiscounted cash flows that asset group is expected to generate. If the undiscounted future cash flow is less than the carrying amount of the asset group, we recognize an impairment loss based on the excess of the carrying amount over the fair value of the asset group.\n \nRedeemable Non-controlling Interest.\n Non-controlling interest that is not solely redeemable within our control is reported as temporary equity in our consolidated balance sheets. The carrying value of the redeemable non-controlling interest equals the redemption value at the end of each reporting period, after giving effect to the change from the net income (loss) attributable to the redeemable non-controlling interest. We remeasure the redemption value of the non-controlling interest on a quarterly basis and changes in the estimated redemption value are recognized through retained earnings and may also impact the net income or loss attributable to common stockholders of Synopsys if the redemption value falls below a stated threshold. See Note 5. \nBusiness Combinations \nof the \nNotes to Consolidated Financial Statements\n in this Annual Report for more information regarding the redeemable non-controlling interests.\n \nRevenue Recognition.\n \nWe recognize revenue for the transfer of services or products to customers in an amount that reflects the consideration to which we expect to be entitled in exchange for those services or products. The principle is achieved through the following five-step approach:\n•\nIdentification of the contract, or contracts, with the customer\n•\nIdentification of the performance obligation in the contract\n•\nDetermination of the transaction price \n•\nAllocation of the transaction price to the performance obligations in the contract \n•\nRecognition of revenue when, or as, we satisfy a performance obligation \nNature of Products and Services\nWe generate revenue from the licensing of our EDA software and IP blocks, as well as sale of hardware products, and maintenance and services. The various types are set forth below.\nElectronic Design Automation\nSoftware license revenue consists of fees associated with the licensing of our software primarily through Technology Subscription License (TSL) contracts. TSLs are time-based licenses for a finite term and generally provide the customer with limited rights to receive, or to exchange certain quantities of licensed software for, unspecified future technology. The majority of our arrangements are TSLs due to the nature of our business and customer requirements. In addition to the licenses, the arrangements also include: post-contract customer support, which includes providing frequent updates and upgrades to maintain the utility of the software due to rapid changes in technology; other intertwined services such as multiple copies of the tools; assisting our customers in applying our technology in the customers' development environment; and rights to remix licenses for other licenses. Payments are generally received in equal or near equal installments over the term of the arrangement. We have concluded that our software licenses in TSL contracts are not distinct from our obligation to provide unspecified software updates to the licensed software throughout the license term. Such updates represent inputs to a single, combined performance obligation, commencing upon the later of the arrangement effective date or transfer of control to the software license. Remix rights are not an additional promised good or service in the contract, and where unspecified additional software product rights are part of the contract with the customer, such rights are accounted for as part of \n66\nTable\n of Contents\nthe single performance obligation that includes the licenses, updates, and technical support because such rights are provided for the same period of time and have the same pattern of transfer to the customer over the duration of the subscription term. \nDesign IP Products\nWe generally license IP under nonexclusive license agreements that provide usage rights for specific applications. Additionally, for certain IP license agreements, royalties are collected as customers sell their own products that incorporate our IP. These arrangements generally have two distinct performance obligations that consist of transferring the licensed IP and the post contract support service. Support services consist of a stand-ready obligation to provide technical support and software updates over the support term. Revenue allocated to the IP license is recognized at a point in time upon the later of the delivery date or the beginning of the license period, and revenue allocated to support services is recognized ratably over the support term. Royalties are recognized as revenue is earned, generally when the customer sells its products that incorporate our IP. \nHardware \nWe generally have two performance obligations in arrangements involving the sale of hardware products. The first performance obligation is to transfer the hardware product, which includes embedded software integral to the functionality of the hardware product. The second performance obligation is to provide maintenance on the hardware and our embedded software, including rights to technical support, hardware repairs and software updates that are all provided over the same term and have the same time-based pattern of transfer to the customer. The portion of the transaction price allocated to the hardware product is recognized as revenue at a point in time when control of the hardware is transferred to the customer. We have concluded that control generally transfers upon shipment because the customer has the ability to direct the use of the asset and an obligation to pay for the hardware. The portion of the transaction price allocated to maintenance is recognized as revenue that is ratable over the maintenance term. \nProfessional Services\nOur arrangements often include service elements other than maintenance and support services. These services include training, design assistance, and consulting. These services are generally performed on a time and materials basis, and are recognized over time, as the customer simultaneously receives and consumes the benefit provided. Certain arrangements also include the customization or modification of licensed IP. Revenue from these contracts is recognized over time as the services are performed, when the development is specific to the customer’s needs and we have enforceable rights to payment for performance completed. Inputs such as costs incurred and hours expended are used in order to measure progress of performance. We have a history of accurately estimating project status and the costs necessary to complete projects. A number of internal and external factors can affect these estimates, including labor rates, utilization and efficiency variances, specification and testing requirement changes, and changes in customer delivery priorities. Payments for services are generally due upon milestones in the contract or upon consumption of the hourly resources.\nFlexible Spending Accounts\nOur customers frequently enter into non-cancelable Flexible Spending Account arrangements (FSA) whereby the customer commits to a fixed dollar amount over a specified period of time that can be used to purchase from a list of our products or services. These arrangements do not meet the definition of a revenue contract until the customer executes a separate order (pulldown request) to identify the required products and services that they are purchasing. The combination of the FSA arrangement and the subsequent order creates enforceable rights and obligations, thus meeting the definition of a revenue contract. Each separate order under the agreement is treated as an individual contract and accounted for based on the respective performance obligations included within the pulldown requests.   \nSignificant Judgments\nOur contracts with customers often include promises to transfer multiple products and services to a customer. Determining whether services and products are considered distinct performance obligations that should be accounted for separately versus together requires significant judgment\n.\n We have concluded that (1) our EDA software licenses in TSL contracts are not distinct from our obligation to provide unspecified software updates to the \n67\nTable\n of Contents\nlicensed software throughout the license term, because those promises represent inputs to a single, combined performance obligation, and (2) where unspecified additional software product rights are part of the contract with the customer, such rights are accounted for as part of the single performance obligation that includes the licenses, updates, and technical support, because such rights are provided for the same period of time and have the same time-based pattern of transfer to the customer. In reaching this conclusion, we considered the nature of the obligation to customers, which is to provide an ongoing right to use the most up to date and relevant software. As EDA customers operate in a rapidly changing and competitive environment, satisfying the obligation requires providing critical updates to the existing software products, including ongoing iterative interaction with customers to make the software relevant to customers’ ability to meet the time to go to market with advanced products.  \nOur contracts with customers can involve hundreds of products and various license rights. Customers often negotiate a broad portfolio of solutions, and favorable terms along with future purchase options to manage their overall costs. Determining whether the purchase options are considered distinct performance obligations that should be accounted for separately as material rights versus combined together may require significant judgment.\nJudgment is also required to determine the standalone selling price (SSP) for each distinct performance obligation. For non-software performance obligations (IP, Hardware, and services), SSP is established based on observable prices of products and services sold separately. SSP for license (and related updates and support) in a contract with multiple performance obligations is determined by applying a residual approach whereby all other non-software performance obligations within a contract are first allocated a portion of the transaction price based upon their respective SSP, using observable prices, with any residual amount of the transaction price allocated to the license because we do not sell the license separately, and the pricing is highly variable.\nContract Balances\nThe timing of revenue recognition may differ from the timing of invoicing customers, and these timing differences result in receivables (billed or unbilled), contract assets, or contract liabilities (deferred revenue) in our consolidated balance sheets. We record a contract asset when revenue is recognized prior to the right to invoice, or deferred revenue when revenue is recognized subsequent to invoicing. For time-based software agreements, customers are generally invoiced in equal, quarterly amounts, although some customers prefer to be invoiced in single or annual amounts. We record an unbilled receivable when revenue is recognized and we have an unconditional right to invoice and receive payment.\nWarranties and Indemnities\nWarranties.\n We generally warrant our products to be free from defects in media and to substantially conform to material specifications for a period of \n90\n days for our software products and for up to \nsix months\n for our hardware products. \nIndemnities. \nIn addition to such warranties, in certain cases, we provide our customers with limited indemnification with respect to claims that their use of our software products infringes on patents, copyrights, trademarks or trade secrets.\n \nWe are unable to estimate the potential impact of these commitments on the future results of operations. \nNet Income Per Share.\n We compute basic net income per share by dividing net income available to common stockholders by the weighted average number of common shares outstanding during the period. Diluted net income per share reflects the dilution from potential common shares outstanding such as stock options and unvested restricted stock units and awards during the period using the treasury stock method. See Note 17.\n Net Income Per Share \nof the \nNotes to Consolidated Financial Statements \nin this Annual Report\n.\nForeign Currency Translation.\n \nThe functional currency of the majority of our active foreign subsidiaries is the foreign subsidiary’s local currency. Assets and liabilities that are not denominated in the functional currency are remeasured into the functional currency with any related gains or losses recorded in earnings. We translate assets and liabilities of our non-U.S. dollar functional currency foreign operations into the U.S. dollar reporting currency at exchange rates in effect at the balance sheet date. We translate income and expense items of such foreign operations into the U.S. dollar reporting currency at average exchange rates for the period. Accumulated translation adjustments are reported in stockholders’ equity, as a component of accumulated other comprehensive income (loss).\n68\nTable\n of Contents\nRecent Accounting Pronouncements Not Yet Adopted\nIn June 2022, the FASB issued ASU 2022-03, Fair Value Measurement (Topic 820): Fair Value Measurement of Equity Securities Subject to Contractual Sale Restrictions, which applies to all equity securities measured at fair value that are subject to contractual sale restrictions. This change prohibits entities from taking into account contractual restrictions on the sale of equity securities when estimating fair value and introduces required disclosures for such transactions. The ASU will be effective for us beginning the fiscal year 2025 and will be applied prospectively. Any future impact from the adoption of this ASU will depend on the facts and circumstances of future transactions.\nIn November 2023, the FASB issued ASU 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures. The ASU expands public entities’ segment disclosures by requiring disclosure of significant segment expenses that are regularly provided to the Chief Operating Decision Maker (CODM) and included within each reported measure of segment profit or loss, an amount and description of its composition for other segment items, and interim disclosures of a reportable segment’s profit or loss and assets. The ASU will be effective for our annual reports beginning in fiscal 2025, and interim period reports beginning in fiscal 2026. We are currently evaluating the impact of adopting this ASU on our consolidated financial statements and disclosures.\nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures, which enhances the transparency and decision usefulness of income tax disclosures primarily through changes to the rate reconciliation and income taxes paid information. \nThe ASU will be effective for us beginning in fiscal 2026 and will be applied on a prospective ba\nsis. Early\n adoption is permitted. \nWe are currently evaluating the impact of this ASU on our consolidated financial statements and related disclosures.  \nIn November 2024, the FASB issued ASU 2024-03, Income Statement – Reporting Comprehensive Income-Expense Disaggregation (Subtopic 220-40): Disaggregation of Income Statement Expenses. The ASU requires the disclosure of additional information related to certain costs and expenses, including amounts of inventory purchases, employee compensation, and depreciation and amortization included in each income statement line item. The ASU also requires disclosure of the total amount of selling expenses and our definition of selling expenses. The ASU is effective for our annual reports beginning in fiscal 2028, and interim period reports beginning in fiscal 2029 either on a prospective or retrospective basis. Early adoption is permitted. We are currently evaluating the impact of adopting this ASU on our consolidated financial statements and disclosures.\nNote 3. \nDiscontinued Operations\nOn September 30, 2024, we completed the sale of Software Integrity business to entities controlled by funds affiliated with Clearlake Capital Group, L.P. and Francisco Partners. The aggregate consideration for the sale was $\n1.65\n billion, comprised of (i) cash of $\n1.48\n billion received upon closing; (ii) $\n121.5\n million reflecting the present value of $\n125\n million deferred consideration receivable in equal installments over \nfive\n fiscal quarters beginning on January 17, 2025, subject to acceleration at our option prior to the closing of our pending acquisition of ANSYS Inc. (Ansys); (iii) $\n22.2\n million reflecting fair value of contingent consideration of up to $\n475\n million receivable upon the Sponsors achieving a specified rate of return in the event of one or more potential liquidity transactions; and (iv) additional consideration receivable of $\n27.1\n million as a result of net working capital adjustments. The fair value of the contingent consideration receivable was estimated using an option pricing model to derive the likelihood of achieving the performance-based metrics. The valuation methodology includes assumptions and judgments regarding volatility, discount rates, and the expected timing of payments. As of October 31, 2024, the deferred consideration receivable and the contingent consideration receivables were recorded within the prepaid and other current assets \nin the consolidated balance sheets.\n As a result of the Software Integrity Divestiture, we derecognized net assets of $\n720.5\n million and incurred transaction costs of $\n61.7\n million, resulting in \na pre-tax gain of \n$\n868.8\n million\n within income from discontinued operations in the consolidated statements of income, subject to certain post-closing adjustments that are expected to be finalized in the first quarter of fiscal 2025.\n69\nTable\n of Contents\nThe financial results of the Software Integrity business are presented as income from discontinued operations, net of income taxes in our consolidated statements of income. The financial results for fiscal 2024 include the period from the beginning of year through the date of sale. \nThe following table presents the major components of financial results of our Software Integrity business for the periods presented:\nYear Ended October 31,\n2024\n2023\n2022\n(in thousands)\nRevenue\n$\n468,720\n \n$\n524,605\n \n$\n465,828\n \nCost of revenue\n153,081\n \n191,350\n \n165,684\n \nOperating expenses\n265,029\n \n337,235\n \n286,820\n \nInterest and other income (expense), net\n2,003\n \n292\n \n(\n1,262\n)\nIncome (loss) from discontinued operations\n52,613\n \n(\n3,688\n)\n12,062\n \nGain on Software Integrity Divestiture\n868,830\n \n—\n \n—\n \nIncome (loss) from discontinued operations before income taxes\n921,443\n \n(\n3,688\n)\n12,062\n \nIncome tax provision (benefit)\n99,773\n \n(\n6,531\n)\n(\n2,307\n)\nIncome from discontinued operations, net of income taxes\n$\n821,670\n \n$\n2,843\n \n$\n14,369\n \nThe following table represents \nthe aggregated carrying amounts of classes of \nassets and liabilities that are classified as discontinued operations in the consolidated balance sheets for the periods presented:\nAs of October 31, 2023\n(in thousands)\nAssets:\nCash and cash equivalents\n$\n4,947\n \nAccounts receivable, net\n90,307\n \nPrepaid and other current assets\n19,400\n \nTotal current assets of discontinued operations\n$\n114,654\n \nProperty and equipment, net\n$\n7,424\n \nOperating lease right-of use assets, net\n8,906\n \nGoodwill\n724,271\n \nIntangible assets, net\n134,617\n \nDeferred income taxes\n7,388\n \nOther long-term assets\n26,153\n \nTotal long-term assets of discontinued operations\n$\n908,759\n \nLiabilities:\nAccounts payable and accrued liabilities\n$\n63,847\n \nOperating lease liabilities\n5,858\n \nDeferred revenue\n216,539\n \nTotal current liabilities of discontinued operations\n$\n286,244\n \nLong-term operating lease liabilities\n$\n4,349\n \nLong-term deferred revenue\n24,301\n \nOther long-term liabilities\n4,607\n \nTotal long-term liabilities of discontinued operations\n$\n33,257\n \n70\nTable\n of Contents\nThe following table presents significant non-cash items and capital expenditures of discontinued operations for the periods presented:\nYear Ended October 31,\n2024\n2023\n2022\n( in thousands)\nAmortization and depreciation\n$\n16,317\n \n$\n51,971\n \n$\n44,173\n \nReduction of operating lease right-of-use assets\n$\n2,162\n \n$\n5,120\n \n$\n4,898\n \nAmortization of capitalized costs to obtain revenue contracts \n$\n25,051\n \n$\n30,071\n \n$\n23,090\n \nStock-based compensation\n$\n34,381\n \n$\n50,198\n \n$\n37,280\n \nDeferred income taxes\n$\n(\n31,679\n)\n$\n(\n3,136\n)\n$\n(\n599\n)\nPurchases of property and equipment\n$\n1,487\n \n$\n3,232\n \n$\n3,610\n \nNote 4. \nPending Acquisition of Ansys\nOn January 15, 2024, we entered into an Agreement and Plan of Merger (the Merger Agreement) to acquire all of the outstanding shares of Ansys, a provider of broad engineering simulation and analysis software and services, in a cash-and-stock transaction (the Ansys Merger) that values Ansys at approximately $\n35.0\n billion, based on the closing price of Synopsys common stock on December 21, 2023. \nUnder the terms of the Merger Agreement, at the effective time of the Ansys Merger (the Effective Time), each share of Ansys common stock issued and outstanding immediately prior to the Effective Time (with certain exceptions set forth in the Merger Agreement) will be converted into the right to receive \n0.3450\n (the Exchange Ratio) of a share of Synopsys common stock and $\n197.00\n in cash, without interest. The Merger Agreement also provides for Synopsys’ assumption of certain outstanding Ansys options and other unvested Ansys equity awards held by continuing Ansys employees. If the stock consideration to be issued by Synopsys in connection with the Ansys Merger exceeds \n19.9999\n% of the shares of Synopsys common stock issued and outstanding immediately prior to the Effective Time, the Exchange Ratio will be reduced to the minimum extent necessary to ensure that the aggregate number of shares of Synopsys common stock to be issued in connection with the Ansys Merger does not exceed such threshold, and the cash consideration will be correspondingly increased to offset such adjustment.\nThe Ansys Merger was approved by the holders of a majority of the outstanding shares of Ansys common stock on May 22, 2024 and is anticipated to close in the first half of calendar year 2025. The Ansys Merger is subject to the satisfaction or waiver of customary closing conditions, including, among other things, the clearance of the Ansys Merger under certain antitrust and foreign investment regimes, and the continued effectiveness of the registration statement on Form S-4 (File No. 333-277912) filed by us on March 14, 2024 and declared effective by the SEC on April 17, 2024. Following the determination that it was a necessary step towards obtaining governmental approval of and successfully closing the Ansys Merger, on September 3, 2024, we signed a definitive agreement for the sale of our Optical Solutions Group (OSG) to Keysight Technologies, Inc. (Keysight) (such sale, the Optical Solutions Divestiture). \nThe Optical Solutions Divestiture is subject to customary closing conditions, including review by regulatory authorities, and the successful closing of the Ansys Merger.\n \nAs such, the assets and liabilities of OSG have not been classified as assets held for sale in the consolidated balance sheets.\nWe and Ansys each have termination rights under the Merger Agreement. A fee of $\n1.5\n billion may be payable by us to Ansys, or a fee of $\n950.0\n million may be payable by Ansys to us, upon termination of the Merger Agreement under specified circumstances, each as more fully described in the Merger Agreement.\nIn connection with the execution of the Merger Agreement, we entered into a commitment letter on January 15, 2024 (the Bridge Commitment Letter) with certain financial institutions that committed to provide, subject to the satisfaction of customary closing conditions, a senior unsecured bridge facility (the Bridge Commitment). \nOn October 3, 2024, we reduced the Bridge Commitment by $\n1.1\n billion to $\n10.6\n billion following the closing of the Software Integrity Divestiture.\n The Bridge Commitment currently provides for an aggregate principal amount of up to $\n10.6\n billion. On \nFebruary 13, 2024\n, we entered into a term loan facility credit agreement (the Term Loan Agreement), which provides us with the ability to borrow up to $\n4.3\n billion at the closing of the Ansys Merger, \nsubject to the satisfaction of customary closing conditions for similar facilities, for the purpose of financing a portion of the \n71\nTable\n of Contents\ncash consideration to be paid in the Ansys Merger and paying related fees and expenses in connection with the Ansys Merger and the other transactions contemplated by the Merger Agreement. \nSee Note 11. \nBridge Commitment Letter, Term Loan and Revolving Credit Facilities\n of the\n Notes to Consolidated Financial Statements \nin this Annual Report\n \nfor more information on the Bridge \nCommitment\n and the Term Loan Agreement.\nNote 5.\n Business Combinations\nFiscal 2024\nDuring fiscal 2024, we completed several acquisitions for an aggregate purchase consideration of $\n159.3\n million, net of cash acquired. \nThe aggregate purchase consideration was preliminary and allocated as follows: \n$\n78.9\n million to identifiable intangible assets, $\n96.1\n million to goodwill, and $\n15.7\n million to net tangible liabilities. \nThe acquired identifiable intangible assets were valued using the income approach and are being amortized over their respective useful lives ranging from \n3\n to \n13\n years. The goodwill recognized from these acquisitions, \nof which $\n61.8\n million was attributable to the Design Automation reporting unit, and $\n34.3\n million was attributable to the Design IP reporting unit, was \nnot\n deductible for income tax purposes. \nWe have included the financial results of the fiscal 2024 acquisitions in our consolidated financial statements from their respective acquisition date. \nWe do not consider these acquisitions to be material, individually or in the aggregate, to our consolidated financial statements.\nFiscal 2023\nDuring fiscal 2023, we completed several acquisitions for an aggregate purchase consideration of $\n295.4\n million, net of cash acquired. \nWe do not consider these acquisitions to be material, individually or in the aggregate, to our consolidated financial statements. The t\notal purchase consideration was allocated as follows: $\n95.8\n million to identifiable intangible assets, $\n229.4\n million to goodwill, and $\n29.8\n million to net tangible liabilities. The goodwill recognized from these acquisitions was assigned to the Design Automation reporting unit, of which $\n5.7\n million was deductible for income tax purposes.\nFiscal 2022\nOpenLight Photonics, Inc.\nDuring the second quarter of fiscal 2022, we acquired a \n75\n% equity interest in OpenLight Photonics, Inc. (OpenLight) for cash consideration of $\n90.0\n million. The remaining \n25\n% equity interest in OpenLight is held by Juniper Networks, Inc. (the Minority Investor) from their contribution of IP and certain tangible assets.\nThe agreement with the Minority Investor contains redemption features whereby the interest held by the Minority Investor is redeemable either (i) at the option of the Minority Investor on or after the third anniversary of the acquisition or sooner in certain circumstances or (ii) at our option beginning on the third anniversary of the acquisition. This option is exercisable at the greater of fair value at the time of redemption or $\n30.0\n million and was valued at $\n10.1\n million, resulting in a total consideration of $\n100.1\n million.\nThe purchase price was allocated as follows: $\n94.0\n million to identifiable intangible assets and $\n46.7\n million to goodwill, which were attributable to the \nDesign Automation reporting unit.\n There was \nno\n tax-deductible goodwill related to the acquisition. During fiscal 2024, we assessed long-lived assets for impairment and wrote off the remaining unamortized intangible assets balance of $\n53.5\n million due to impairment. See Note 7. \nGoodwill and Intangible Assets\n of the \nNotes to Consolidated Financial Statements \nin this Annual Report.\nDuring fiscal 2024, our ownership interest in OpenLight was reduced to \n71\n% as a result of the recognition of non-controlling interest upon issuance of OpenLight stock.\nDuring fiscal \n2024, 2023 and 2022\n, OpenLight incurred a net loss of $\n91.7\n million, \n$\n40.9\n million\n and \n$\n19.4\n million\n, \nrespectively, of which $\n22.0\n million, \n$\n10.0\n million and $\n4.9\n million\n, \nrespectively,\n \nwas attributable to redeemable non-controlling interest. As of October 31, 2024 and \n2023\n, the carrying value of the redeemable non-controlling interest was recorded at its estimated fair value of $\n30.0\n million and \n$\n31.0\n million, respectively,\n \nin the consolidated balance sheets.\n72\nTable\n of Contents\nNTT Security AppSec Solutions Inc.\nOn June 22, 2022, we completed the acquisition of all outstanding shares of NTT Security AppSec Solutions Inc. (which operated under the name WhiteHat Security, or WhiteHat), a provider of dynamic application security testing solutions, from NTT Security Corporation for an aggregate purchase price of $\n310.0\n million, net of cash acquired. With this acquisition, we broadened our product offering in the application security testing market.\nThe aggregate purchase consideration was allocated as follows: $\n97.5\n million \nto identifiable intangible assets, $\n252.9\n million to goodwill, and $\n40.4\n million to net tangible liabilities. The goodwill was \nnot\n deductible for tax purposes. The assets and liabilities attributed to WhiteHat were related to the Software Integrity business and reclassified as discontinued operations as of October 31, 2023 in our consolidated balance sheets. \nOther Fiscal 2022 Acquisitions\nDuring fiscal 2022, we completed \ntwo\n other acquisitions for aggregate purchase consideration of $\n31.8\n million, net of cash acquired. The purchase price was allocated as follows: $\n12.7\n million to identifiable intangible assets, $\n3.1\n million to net tangible liabilities, and $\n22.2\n million to goodwill, which were attributable to the \nDesign Automation reporting unit\n. There was \nno\n tax-deductible goodwill related to the acquisitions.\nPreliminary Fair Value Estimates\nFor all acquisitions completed in fiscal 2024, the purchase price was allocated to tangible and identifiable intangible assets acquired and liabilities assumed based on their preliminary estimated fair values, which were determined using generally accepted valuation techniques based on estimates and assumptions made by management at the time of acquisition.\n \nThese estimates and assumptions are subject to change as additional information becomes available during the respective measurement period, which is not expected to exceed 12 months from applicable acquisition date. The primary areas of those preliminary estimates relate to certain tangible assets and liabilities, identifiable intangible assets, and income taxes.\nTransaction Costs\nTransaction costs from continuing operations were $\n172.6\n million, mainly \nin connection with the pending Ansys Merger\n, $\n13.8\n million and $\n9.4\n million during fiscal\n \n2024, 2023 and 2022, respectively. These costs mainly consisted of professional fees and administrative costs for closed and pending acquisitions and were expensed as incurred in our consolidated statements of income.\nNote 6. \nRevenue\nDisaggregated Revenue\nThe following table shows the percentage of revenue by product groups:\nYear Ended October 31,\n2024\n2023\n2022\nEDA\n66.4\n \n%\n69.2\n \n%\n69.2\n \n%\nDesign IP\n31.1\n \n%\n29.0\n \n%\n28.5\n \n%\nOther\n2.5\n \n%\n1.8\n \n%\n2.3\n \n%\nTotal\n100.0\n \n%\n100.0\n \n%\n100.0\n \n%\nContract Balances \nThe contract assets indicated below are presented as prepaid and other current assets in the consolidated balance sheets. The contract assets are transferred to receivables when the rights to invoice and receive payment become unconditional. Unbilled receivables are presented as accounts receivable, net, in the consolidated balance sheets.\n73\nTable\n of Contents\nContract balances are as follows:\nAs of October 31,\n2024\n2023\n \n(in thousands)\nContract assets, net\n$\n757,075\n \n$\n375,904\n \nUnbilled receivables\n$\n44,166\n \n$\n60,016\n \nDeferred revenue\n$\n1,732,568\n \n$\n1,710,288\n \nDuring fiscal 2024, we recognized revenue of $\n1.5\n billion, that was included in the deferred revenue balance as of October 31, 2023, including previously unfulfilled contracts that have expired and are no longer subject to an implied promise to provide future services. During fiscal 2023, we recognized revenue of $\n1.5\n billion, that was included in the deferred revenue balance as of October 31, 2022, including previously unfulfilled contracts that have expired and are no longer subject to an implied promise to provide future services.\nContracted but unsatisfied or partially unsatisfied performance obligations (backlog) were approximately $\n8.1\n billion\n \nas of October 31, 2024, which includes $\n1.2\n billion in non-cancellable Flexible Spending Account (FSA) commitments from customers where actual product selection and quantities of specific products or services are to be determined by customers at a later date. We have elected to exclude future sales-based royalty payments from the remaining performance obligations. Approximately \n41\n% of the backlog as of October 31, 2024, excluding non-cancellable FSA, is expected to be recognized as revenue over the next \n12\n months, with the remainder to be recognized thereafter. The majority of the remaining backlog is expected to be recognized in the following \nthree years\n. The backlog was approximately $\n8.1\n billion\n \nas of October 31, 2023, which included $\n1.4\n billion in non-cancellable FSA commitments from customers. \nDuring fiscal 2024 and 2023, we recognized $\n104.4\n million\n \nand $\n99.3\n million, respectively, from performance obligations satisfied from sales-based royalties earned during the periods.\nCosts of Obtaining a Contract with Customer\nThe incremental costs of obtaining a contract with a customer, which consist primarily of direct sales commission earned upon execution of the contract, were capitalized in compliance with authoritative guidance, and amortized over the estimated period of which the benefit is expected to be received. As direct sales commission paid for renewals are commensurate with the amounts paid for initial contracts, the deferred incremental costs will be recognized over the contract term.\nCapitalized commission costs, net of accumulated amortization, as of October 31, 2024 and 2023 were $\n72.8\n million and $\n67.2\n million, respectively. The balances are included in other long-term assets in our consolidated balance sheets. Amortization of these assets were $\n48.5\n million, $\n52.1\n million and $\n49.9\n million during fiscal 2024, 2023 and 2022, respectively, and are included in sales and marketing expense in our consolidated statements of income.\nNote 7. \nGoodwill and Intangible Assets\nGoodwill\nAs a result of the Software Integrity Divestiture effective in the second quarter of fiscal 2024, we have \ntwo\n reporting segments, and reporting units are determined to be the same as reportable segments. The change has no impact on the composition of remaining \ntwo\n reporting units, therefore, no impairment indicator was identified upon the change. We performed the required annual goodwill assessment in the fourth quarter of fiscal 2024, and concluded the goodwill was not impaired. There was \nno\n goodwill impairment in fiscal 2024, 2023 and 2022.\nGoodwill activity by reportable segment consists of the following:\n74\nTable\n of Contents\n \nDesign Automation\nDesign IP\nTotal\n(in thousands)\nBalance at October 31, 2022\n$\n2,176,337\n \n$\n944,734\n \n$\n3,121,071\n \nAdditions\n229,351\n \n—\n \n229,351\n \nEffect of foreign currency translation\n(\n5,006\n)\n649\n \n(\n4,357\n)\nBalance at October 31, 2023\n2,400,682\n \n945,383\n \n3,346,065\n \nAdditions\n61,803\n \n34,339\n \n96,142\n \nAdjustments\n170\n \n—\n \n170\n \nEffect of foreign currency translation\n6,602\n \n(\n129\n)\n6,473\n \nBalance at October 31, 2024\n$\n2,469,257\n \n$\n979,593\n \n$\n3,448,850\n \nIntangible Assets\nDuring the fourth quarter of fiscal 2024, we assessed long-lived assets for impairment and recorded an impairment charge of $\n53.5\n million related to acquired intangible assets. The impairment charge was triggered by a decline in estimated fair value resulting from the reductions in the expected future cash flows associated with our core/developed technology intangible assets related to our OpenLight business. There were \nno\n other impairment charges for long-lived assets in fiscal 2024, 2023 and 2022. \nIntangible assets as of October 31, 2024 consists of the following:\nGross Carrying Amount\nAccumulated\nAmortization\nand Impairment\nNet Amount\n \n(in thousands)\nCore/developed technology\n$\n904,347\n \n$\n777,518\n \n$\n126,829\n \nCustomer relationships\n314,140\n \n247,025\n \n67,115\n \nContract rights intangible\n176,382\n \n175,170\n \n1,212\n \nTrademarks and trade names\n12,925\n \n12,917\n \n8\n \nTotal\n$\n1,407,794\n \n$\n1,212,630\n \n$\n195,164\n \nIntangible assets as of October 31, 2023 consists of the following:\n75\nTable\n of Contents\nGross Carrying Amount\nAccumulated\nAmortization\nNet Amount\n \n(in thousands)\nCore/developed technology\n$\n842,448\n \n$\n672,480\n \n$\n169,968\n \nCustomer relationships\n296,883\n \n231,557\n \n65,326\n \nContract rights intangible\n175,747\n \n171,487\n \n4,260\n \nTrademarks and trade names\n12,925\n \n12,902\n \n23\n \nCapitalized software development costs\n50,795\n \n50,795\n \n—\n \nTotal\n$\n1,378,798\n \n$\n1,139,221\n \n$\n239,577\n \nAmortization expense related to acquired intangible assets, including the \nimpairment charge\n, consists of the following:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nCore/developed technology\n$\n104,797\n \n$\n42,892\n \n$\n42,582\n \nCustomer relationships\n15,550\n \n9,288\n \n11,389\n \nContract rights intangible\n3,872\n \n2,389\n \n2,307\n \nTrademarks and trade names\n15\n \n7\n \n33\n \nCapitalized software development costs\n(1)\n—\n \n4,770\n \n2,672\n \nTotal\n$\n124,234\n \n$\n59,346\n \n$\n58,983\n \n(1)\nAmortization of capitalized software development costs is included in cost of products revenue in the consolidated statements of income.\nThe following table presents the estimated future amortization of acquired intangible assets as of October 31, 2024:\nFiscal Year\n(in thousands)\n2025\n$\n46,436\n \n2026\n36,112\n \n2027\n31,165\n \n2028\n25,572\n \n2029\n23,038\n \n2030 and thereafter\n32,841\n \nTotal\n$\n195,164\n \n76\nTable\n of Contents\nNote 8. \nBalance Sheet Components\nAs of October 31,\n2024\n2023\n(in thousands)\nAccounts receivable, net:\nAccounts receivable\n$\n941,312\n \n$\n835,327\n \nUnbilled accounts receivable\n44,166\n \n60,016\n \nTotal accounts receivable\n985,478\n \n895,343\n \nLess: allowance for credit losses\n(\n51,008\n)\n(\n38,683\n)\nTotal\n$\n934,470\n \n$\n856,660\n \nProperty and equipment, net:\nComputer and other equipment\n$\n1,011,712\n \n$\n973,540\n \nBuildings\n103,779\n \n135,255\n \nFurniture and fixtures\n87,524\n \n83,649\n \nLand\n18,219\n \n21,598\n \nLeasehold improvements\n271,753\n \n259,241\n \n1,492,987\n \n1,473,283\n \nLess: accumulated depreciation \n(1)\n(\n929,981\n)\n(\n923,446\n)\nTotal\n$\n563,006\n \n$\n549,837\n \nOther long-term assets:\nDeferred compensation plan assets\n$\n386,757\n \n$\n297,180\n \nCapitalized commission, net\n72,801\n \n67,240\n \nOther\n124,142\n \n80,400\n \nTotal\n$\n583,700\n \n$\n444,820\n \nAccounts payable and accrued liabilities:\nPayroll and related benefits\n$\n624,823\n \n$\n531,848\n \nAccrued income taxes\n147,115\n \n226,762\n \nOther accrued liabilities\n184,321\n \n146,696\n \nAccounts payable\n207,333\n \n154,608\n \nTotal\n$\n1,163,592\n \n$\n1,059,914\n \nOther long-term liabilities:\nDeferred compensation plan liabilities\n$\n386,757\n \n$\n297,180\n \nOther\n82,981\n \n84,351\n \nTotal\n$\n469,738\n \n$\n381,531\n \n(1)\nAccumulated depreciation includes write-offs due to retirement of fully depreciated fixed assets.\n77\nTable\n of Contents\nNote 9. \nFinancial Assets and Liabilities\nCash Equivalents and Short-term Investments \nAs of October 31, 2024, the balances of our cash equivalents and short-term investments are as follows:\nAmortized Cost\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses Less Than 12 Continuous Months\nGross\nUnrealized\nLosses 12 Continuous Months or Longer\nEstimated\nFair Value\n(1)\n \n(in thousands)\nCash equivalents:\nMoney market funds\n$\n869,972\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n869,972\n \nU.S. Treasury, agency & T-bills\n7,984\n \n1\n \n—\n \n—\n \n7,985\n \nTotal:\n$\n877,956\n \n$\n1\n \n$\n—\n \n$\n—\n \n$\n877,957\n \nShort-term investments:\nU.S. Treasury, agency & T-bills\n$\n19,411\n \n$\n44\n \n$\n(\n6\n)\n$\n—\n \n$\n19,449\n \nCorporate debt securities\n105,024\n \n349\n \n(\n115\n)\n(\n2\n)\n105,256\n \nAsset-backed securities\n29,061\n \n130\n \n(\n7\n)\n(\n20\n)\n29,164\n \nTotal:\n$\n153,496\n \n$\n523\n \n$\n(\n128\n)\n$\n(\n22\n)\n$\n153,869\n \n(1)\nSee Note 10. Fair Value Measurements for further discussion on fair values.\nOur short-term investment portfolio includes both corporate and government debt securities that have a maximum maturity of \nthree years\n. The longer the duration of these securities, the more susceptible they are to changes in market interest rates and bond yields. As yields increase, those securities with a lower yield-at-cost show a mark-to-market unrealized loss. Most of our unrealized losses are due to changes in market interest rates, and bond yields. We believe that we have the ability to realize the full value of all of these investments upon maturity. As of October 31, 2024, our investments that were in a continuous loss position of 12 months or more, as well as the unrealized losses on those investments, were immaterial.\nThe contractual maturities of our available-for-sale debt securities as of October 31, 2024 are as follows:\nAmortized Cost\nFair Value\n(in thousands)\nLess than 1 year\n$\n57,022\n \n$\n57,156\n \n1-5 years\n92,217\n \n92,449\n \n5-10 years\n2,518\n \n2,531\n \n>10 years\n1,739\n \n1,733\n \nTotal\n$\n153,496\n \n$\n153,869\n \n78\nTable\n of Contents\nAs of October 31, 2023, the balances of our cash equivalents and short-term investments are as follows:\nAmortized\nCost\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses Less Than 12 Continuous Months\nGross\nUnrealized\nLosses 12 Continuous Months or Longer\nEstimated\nFair Value\n(1)\n \n(in thousands)\nCash equivalents:\nMoney market funds\n$\n10,129\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n10,129\n \nU.S. Treasury, agency & T-bills\n2,994\n \n—\n \n—\n \n—\n \n$\n2,994\n \nTotal:\n$\n13,123\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n13,123\n \nShort-term investments:\nU.S. Treasury, agency & T-bills\n$\n15,752\n \n$\n—\n \n$\n(\n61\n)\n$\n(\n2\n)\n$\n15,689\n \nMunicipal bonds\n515\n \n—\n \n—\n \n(\n16\n)\n499\n \nCorporate debt securities\n103,213\n \n13\n \n(\n455\n)\n(\n396\n)\n102,375\n \nAsset-backed securities\n33,245\n \n21\n \n(\n93\n)\n(\n97\n)\n33,076\n \nTotal:\n$\n152,725\n \n$\n34\n \n$\n(\n609\n)\n$\n(\n511\n)\n$\n151,639\n \n(1)\nSee Note 10. Fair Value Measurements for further discussion on fair values.\nRestricted cash \nWe include amounts generally described as restricted cash in cash and cash equivalents when reconciling beginning-of-period and end-of-period total amounts shown in the consolidated statements of cash flows. Restricted cash is primarily associated with office leases and employee loan programs.\nThe following table provides a reconciliation of cash, cash equivalents and restricted cash included in the consolidated balance sheets and the consolidated statements of cash flows:\nAs of October 31,\n2024\n2023\n(in thousands)\nCash and cash equivalents\n$\n3,896,532\n \n$\n1,433,966\n \nRestricted cash included in prepaid and other current assets\n1,529\n \n1,549\n \nRestricted cash included in other long-term assets\n668\n \n725\n \nCash, cash equivalents and restricted cash\n3,898,729\n \n1,436,240\n \nCash, cash equivalents and restricted cash from discontinued operations\n—\n \n4,947\n \nTotal cash, cash equivalents and restricted cash, including cash from discontinued operations\n$\n3,898,729\n \n$\n1,441,187\n \nNon-marketable equity securities\nOur portfolio of non-marketable equity securities consists of strategic investments in privately held companies. In November 2023, we completed the sale of strategic investments in privately-held companies. The gain recognized from the sales was $\n55.1\n million and included in interest and other income (expense), net, in our consolidated statements of income. There were \nno\n material impairments of non-marketable equity securities in fiscal 2024, 2023, and 2022.\nDerivatives\n \nWe recognize derivative instruments as either assets or liabilities in the consolidated balance sheets at fair value and provide qualitative and quantitative disclosures about such derivatives. We operate internationally and are exposed to potentially adverse movements in foreign currency exchange rates. We enter into hedges in the form of foreign currency forward contracts to reduce our exposure to foreign currency rate changes on non-functional \n79\nTable\n of Contents\ncurrency denominated forecasted transactions and balance sheet positions including: (1) certain assets and liabilities, (2) shipments forecasted to occur within approximately \none month\n, (3) future billings and revenue on previously shipped orders, and (4) certain future intercompany invoices denominated in foreign currencies.\nThe duration of forward contracts, the majority of which are short-term, ranges from approximately \n2\n months to \n29\n months at inception. We do not use foreign currency forward contracts for speculative or trading purposes. We enter into foreign exchange forward contracts with high credit quality financial institutions that are rated \"A\" or above and to date have not experienced nonperformance by counterparties. In addition, we mitigate credit risk in derivative transactions by permitting net settlement of transactions with the same counterparty and anticipate continued performance by all counterparties to such agreements.\nThe assets or liabilities associated with the forward contracts are recorded at fair value in other current assets or accrued liabilities in the consolidated balance sheets. The accounting for gains and losses resulting from changes in fair value depends on the use of the foreign currency forward contract and whether it is designated and qualifies for hedge accounting. The cash flow impact upon settlement of the derivative contracts is included in “net cash provided by operating activities” in the consolidated statements of cash flows.\nCash Flow Hedging Activities\nCertain foreign exchange forward contracts are designated and qualify as cash flow hedges. These contracts have durations of approximately \n29\n months or less. Certain forward contracts are rolled over periodically to capture the full length of exposure to our foreign currency risk, which can be up to \nthree years\n. To receive hedge accounting treatment, all hedging relationships are formally documented at the inception of the hedge, and the hedges must be highly effective in offsetting changes to future cash flows on the hedged transactions. The related gains or losses resulting from changes in fair value of these hedges is initially reported, net of tax, as a component of other comprehensive income (loss) (OCI) in stockholders’ equity and reclassified into revenue or operating expenses, as appropriate, at the time the hedged transactions affect earnings. We expect a majority of the hedge balance in OCI to be reclassified to the statements of income within the next \n12\n months.\nWe did \nnot\n record any gains or losses related to discontinuation of cash flow hedges for fiscal years 2024, 2023 and 2022.\nNon-designated Hedging Activities\nOur foreign exchange forward contracts that are used to hedge non-functional currency denominated balance sheet assets and liabilities are not designated as hedging instruments. Accordingly, any gains or losses from changes in the fair value of the forward contracts are recorded in interest and other income (expense), net. The gains and losses on these forward contracts generally offset the gains and losses associated with the underlying assets and liabilities, which are also recorded in interest and other income (expense), net. The duration of the forward contracts for hedging our balance sheet exposure is approximately \none month\n.\nWe also have certain foreign exchange forward contracts for hedging certain international revenues and expenses that are not designated as hedging instruments. Accordingly, any gains or losses from changes in the fair value of the forward contracts are recorded in interest and other income (expense), net. The gains and losses on these forward contracts generally offset the gains and losses associated with the foreign currency in operating income. The duration of these forward contracts is usually less than \none year\n. The overall goal of our hedging program is to minimize the impact of currency fluctuations on the net income over the fiscal year.\n80\nTable\n of Contents\nThe effects of the non-designated derivative instruments in our consolidated statements of income are summarized as follows: \n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nGains (losses) recorded in interest and other income (expense), net\n$\n(\n307\n)\n$\n(\n5,899\n)\n$\n(\n15,851\n)\nThe notional amounts in the table below for derivative instruments provide one measure of the transaction volume outstanding:\nAs of October 31,\n2024\n2023\n \n(in thousands)\nTotal gross notional amounts\n$\n1,686,341\n \n$\n1,666,758\n \nNet fair value\n$\n1,819\n \n$\n(\n2,308\n)\nOur exposure to the market gains or losses will vary over time as a function of currency exchange rates. The amounts ultimately realized upon settlement of these financial instruments, together with the gains and losses on the underlying exposures, will depend on actual market conditions during the remaining life of the instruments.\nThe following table represents the consolidated balance sheets location and amount of derivative instrument fair values segregated between designated and non-designated hedge instruments: \nFair values of\nderivative instruments\ndesignated as\nhedging instruments\nFair values of\nderivative instruments\nnot designated as\nhedging instruments\n \n(in thousands)\nBalance at October 31, 2024\nOther current assets\n$\n8,839\n \n$\n12\n \nAccrued liabilities\n$\n6,918\n \n$\n114\n \nBalance at October 31, 2023\nOther current assets\n$\n12,962\n \n$\n491\n \nAccrued liabilities\n$\n14,665\n \n$\n1,096\n \n81\nTable\n of Contents\nThe following table represents the location of the amount of gains and losses on derivative instrument fair values for designated hedge instruments, net of tax in the consolidated statements of income:\nLocation of gains (losses)\nrecognized in OCI on\nderivatives\nAmount of gains (losses)\nrecognized in \nOCI on\nderivatives\n(effective portion)\nLocation of gains (losses)\nreclassified \nfrom OCI\nAmount of\ngains (losses)\nreclassified \nfrom OCI\n(effective \nportion)\n \n(in thousands)\nFiscal year ended October 31, 2024\nForeign exchange contracts\nRevenue\n$\n3,940\n \nRevenue\n$\n3,089\n \nForeign exchange contracts\nOperating expenses\n5,685\n \nOperating expenses\n112\n \nTotal\n$\n9,625\n \n$\n3,201\n \nFiscal year ended October 31, 2023\nForeign exchange contracts\nRevenue\n$\n8,390\n \nRevenue\n$\n(\n9,942\n)\nForeign exchange contracts\nOperating expenses\n16,596\n \nOperating expenses\n(\n15,334\n)\nTotal\n$\n24,986\n \n$\n(\n25,276\n)\nFiscal year ended October 31, 2022\nForeign exchange contracts\nRevenue\n$\n(\n19,755\n)\nRevenue\n$\n10,975\n \nForeign exchange contracts\nOperating expenses\n(\n59,314\n)\nOperating expenses\n(\n15,869\n)\nTotal\n$\n(\n79,069\n)\n$\n(\n4,894\n)\nNote 10. \nFair Value Measurements\nASC 820-10, \nFair Value Measurements and Disclosures\n, defines fair value, establishes guidelines and enhances disclosure requirements for fair value measurements. The accounting guidance requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The accounting guidance also establishes a fair value hierarchy based on the independence of the source and objective evidence of the inputs used. There are three fair value hierarchies based upon the level of inputs that are significant to fair value measurement:\nLevel 1\n—Observable inputs that reflect quoted prices (unadjusted) for identical instruments in active markets;\nLevel 2\n—Observable inputs other than quoted prices for identical instruments in active markets, quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in inactive markets, and model-driven valuations in which all significant inputs and significant value drivers are observable in active markets; and\nLevel 3\n—Unobservable inputs derived from fair valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nOn a recurring basis, we measure the fair value of certain assets and liabilities, which include cash equivalents, short-term investments, non-qualified deferred compensation plan assets, and foreign currency derivative contracts.\nOur cash equivalents and short-term investments are classified within Level 1 or Level 2 because they are valued using quoted market prices in an active market or alternative independent pricing sources and models utilizing market observable inputs.\nOur non-qualified deferred compensation plan assets consist of money market and mutual funds invested in domestic and international marketable securities that are directly observable in active markets and are therefore classified within Level 1.\nOur foreign currency derivative contracts are classified within Level 2 because these contracts are not actively traded and the valuation inputs are based on quoted prices and market observable data of similar instruments.\n82\nTable\n of Contents\nOur borrowings under our Credit and Term Loan facilities are classified within Level 2 because these borrowings are not actively traded and have a variable interest rate structure based upon market rates currently available to us for debt with similar terms and maturities. See Note 11. \nBridge Commitment Letter, Term Loan and Revolving Credit Facilities \nof the \nNotes to Consolidated Financial Statements \nin this Annual Report for more information on these borrowings.\nOur contingent consideration receivable, which was recorded in connection with the Software Integrity Divestiture, was classified within Level 3 because it was estimated using significant inputs that were not observable in the market. See Note 3. \nDiscontinued Operation \nof the \nNotes to Consolidated Financial Statements\n in this Annual Report for additional information.\nAssets/Liabilities Measured at Fair Value on a Recurring Basis\nAssets and liabilities measured at fair value on a recurring basis are summarized below as of October 31, 2024:\n \n \n \nFair Value Measurement Using\nDescription\nTotal\nQuoted Prices in \nActive Markets \nfor Identical Assets\n(Level 1)\nSignificant Other\nObservable Inputs\n(Level 2)\nSignificant\nUnobservable Inputs\n(Level 3)\n \n(in thousands)\nAssets\nCash equivalents:\nMoney market funds\n$\n869,972\n \n$\n869,972\n \n$\n—\n \n$\n—\n \nU.S. Treasury, agency & T-bills\n7,985\n \n—\n \n7,985\n \n—\n \nShort-term investments:\nU.S. Treasury, agency & T-bills\n19,449\n \n—\n \n19,449\n \n—\n \nCorporate debt securities\n105,256\n \n—\n \n105,256\n \n—\n \nAsset-backed securities\n29,164\n \n—\n \n29,164\n \n—\n \nPrepaid and other current assets:\nForeign currency derivative contracts\n8,851\n \n—\n \n8,851\n \n—\n \nContingent consideration receivable\n22,202\n \n—\n \n—\n \n22,202\n \nOther long-term assets:\nDeferred compensation plan assets\n386,757\n \n386,757\n \n—\n \n—\n \nTotal assets\n$\n1,449,636\n \n$\n1,256,729\n \n$\n170,705\n \n$\n22,202\n \nLiabilities\nAccounts payable and accrued liabilities:\nForeign currency derivative contracts\n$\n7,032\n \n$\n—\n \n$\n7,032\n \n$\n—\n \nOther long-term liabilities:\nDeferred compensation plan liabilities\n386,757\n \n386,757\n \n—\n \n—\n \nTotal liabilities\n$\n393,789\n \n$\n386,757\n \n$\n7,032\n \n$\n—\n \n \n83\nTable\n of Contents\nAssets and liabilities measured at fair value on a recurring basis are summarized below as of October 31, 2023:\nDescription\nTotal\nFair Value Measurement Using\nQuoted Prices in \nActive Markets \nfor Identical Assets\n(Level 1)\nSignificant Other\nObservable Inputs\n(Level 2)\nSignificant\nUnobservable Inputs\n(Level 3)\n \n(in thousands)\nAssets\nCash equivalents:\nMoney market funds\n$\n10,129\n \n$\n10,129\n \n$\n—\n \n$\n—\n \nU.S. Treasury, agency & T-bills\n2,994\n \n—\n \n2,994\n \n—\n \nShort-term investments:\nU.S. Treasury, agency & T-bills\n15,689\n \n—\n \n15,689\n \n—\n \nMunicipal bonds\n499\n \n—\n \n499\n \n—\n \nCorporate debt securities\n102,375\n \n—\n \n102,375\n \n—\n \nAsset-backed securities\n33,076\n \n—\n \n33,076\n \n—\n \nPrepaid and other current assets:\nForeign currency derivative contracts\n13,453\n \n—\n \n13,453\n \n—\n \nOther long-term assets:\nDeferred compensation plan assets\n297,180\n \n297,180\n \n—\n \n—\n \nTotal assets\n$\n475,395\n \n$\n307,309\n \n$\n168,086\n \n$\n—\n \nLiabilities\nAccounts payable and accrued liabilities:\nForeign currency derivative contracts\n$\n15,761\n \n$\n—\n \n$\n15,761\n \n$\n—\n \nOther long-term liabilities:\nDeferred compensation plan liabilities\n297,180\n \n297,180\n \n—\n \n—\n \nTotal liabilities\n$\n312,941\n \n$\n297,180\n \n$\n15,761\n \n$\n—\n \nAssets/Liabilities Measured at Fair Value on a Non-Recurring Basis\nNon-Marketable Equity Securities\nNon-marketable equity securities are classified within Level 3 as they are valued using a combination of observable transaction price and unobservable inputs or data in an inactive market due to the absence of market price and inherent lack of liquidity.\n \nNote 11. \nBridge Commitment Letter, Term Loan and Revolving Credit Facilities\nOn January 15, 2024, we entered into the Bridge Commitment Letter with certain financial institutions that committed to provide, subject to the satisfaction of customary closing conditions, the Bridge Commitment. The Bridge Commitment currently provides for an aggregate principal amount of up to $\n10.6\n billion. The proceeds of any borrowing under the Bridge Commitment will be used for the purpose of financing a portion of the cash consideration to be paid in the Ansys Merger and paying related fees and expenses in connection with the Ansys Merger and the other transactions contemplated by the Merger Agreement.\nThe commitments to provide the Bridge Commitment may be terminated in whole or reduced in part, at our discretion. In addition, the Bridge Commitment Letter provides that net cash proceeds received from certain debt and equity issuances or the sale of certain businesses and assets, including the Software Integrity Divestiture, as well as term loan commitments under certain qualifying term loan facilities, will result in mandatory commitment reductions under the Bridge Commitment. On October 3, 2024, we reduced the Bridge Commitment by $\n1.1\n billion to $\n10.6\n billion following the closing of the Software Integrity Divestiture.\n84\nTable\n of Contents\nOn February 13, 2024, we entered into the Term Loan Agreement in connection with the financing of the pending Ansys Merger. The Term Loan Agreement provides us with the ability to borrow up to $\n4.3\n billion at the closing of the Ansys Merger, subject to the satisfaction of customary closing conditions for similar facilities, for the purpose of financing a portion of the cash consideration to be paid in the Ansys Merger and paying related fees and expenses in connection with the Ansys Merger and the other transactions contemplated by the Merger Agreement. \nThe Term Loan Agreement provides for two tranches of senior unsecured term loans: a $\n1.45\n billion tranche (Tranche 1) that matures \ntwo years\n after funding and a $\n2.85\n billion tranche (Tranche 2) that matures \nthree years\n after funding. There was \nno\n outstanding balance under the Term Loan Agreement as of October 31, 2024.\nThe Term Loan Agreement contains a financial covenant requiring that Synopsys maintain a maximum consolidated leverage ratio commencing the last day of the first fiscal quarter ending on or after the completion of the Ansys Merger, as well as other non-financial covenants. Under the Term Loan Agreement, borrowings will bear interest on the principal amount outstanding at a floating rate based on, at Synopsys’ election, (i) the Adjusted Term SOFR Rate (as defined in the Term Loan Agreement) plus an applicable margin based on the credit ratings of Synopsys ranging from \n0.875\n% to \n1.375\n% (in the case of Tranche 1) or \n1.000\n% to \n1.500\n% (in the case of Tranche 2) or (ii) the ABR (as defined in the Term Loan Agreement) plus an applicable margin based on the credit ratings of Synopsys ranging from \n0.000\n% to \n0.375\n% (in the case of Tranche 1) or \n0.000\n% to \n0.500\n% (in the case of Tranche 2). \nOn May 14, 2024, a ticking fee began to accrue under the Term Loan Agreement in an amount equal to a rate per annum equal to \n0.10\n% times the actual daily undrawn portion of the commitments in respect of the term loan facility. This ticking fee will accrue until the earlier of (i) termination or expiration of the commitments under the term loan facility or (ii) the funding of the commitments, at which point the accrued amount of the ticking fee will become payable.\nOn February 13, 2024, we entered into a Sixth Amendment Agreement (the Sixth Amendment), which amended and restated our previous revolving credit agreement, dated as of December 14, 2022 (as amended and restated, the Revolving Credit Agreement).\nThe Revolving Credit Agreement provides an unsecured $\n850.0\n million committed multicurrency revolving credit facility and an unsecured uncommitted incremental revolving loan facility of up to $\n150.0\n million. The maturity date of the revolving credit facility is December 14, 2027, which may be extended at our option.\nUnder the Sixth Amendment, certain amendments became effective on February 13, 2024 and certain additional amendments will become effective upon the completion of the Ansys Merger. Upon the effective date, the Sixth Amendment amended the financial covenant to allow netting of the cash proceeds of certain debt incurred to finance the Ansys Merger as well as certain other modifications set forth therein. Upon the completion of the Ansys Merger, the Sixth Amendment, among other things: (i) amends the applicable margin used to determine the interest that accrues on loans and the facility fee payable under the revolving credit facility to be based on our credit ratings, (ii) amends the financial covenant thresholds under the financial covenant in the Revolving Credit Agreement requiring us to maintain a maximum consolidated leverage ratio and (iii) amends certain conditions to borrowing, other non-financial covenants and events of default.\nThe Revolving Credit Agreement contains a financial covenant requiring us to maintain a maximum consolidated leverage ratio, as well as other non-financial covenants. As of October 31, 2024, we were in compliance with the financial covenant.\nInterest accrues on dollar-denominated loans at a floating rate based on, at Synopsys’ election, (i) the Adjusted Term SOFR Rate (as defined in the Revolving Credit Agreement) plus an applicable margin or (ii) the ABR (as defined in the Revolving Credit Agreement) plus an applicable margin. The applicable margin for Adjusted Term SOFR Rate based loans ranges from \n0.785\n% to \n0.975\n%, based upon Synopsys’ consolidated leverage ratio. The applicable margin for ABR based loans is \n0.000\n%. In addition to the interest on any outstanding loans, Synopsys is also required to pay a facility fee on the entire portion of the revolving credit facility ranging from \n0.09\n% to \n0.15\n% based on Synopsys’ consolidated leverage ratio on the daily amount of the revolving commitment.\nSubject to the completion of the Ansys Merger, interest under the Revolving Credit Agreement will accrue on dollar-denominated loans at a floating rate based on, at Synopsys’ election, (i) the Adjusted Term SOFR Rate plus an applicable margin based on our credit ratings ranging from \n0.795\n% to \n1.200\n% or (ii) the ABR plus an applicable margin based on our credit ratings ranging from \n0.000\n% to \n0.200\n%. In addition to the interest on any outstanding \n85\nTable\n of Contents\nloans, Synopsys will also be required to pay a facility fee on the entire portion of the revolving credit facility ranging from \n0.080\n% to \n0.175\n% based on the credit ratings of Synopsys on the daily amount of the revolving commitment.\nThere was \nno\n outstanding balance under the Revolving Credit Agreement as of October 31, 2024 and October 31, 2023. \nIn July 2018, we entered into a \n12\n-year \n220.0\n million Renminbi (approximately $\n33.0\n million) credit agreement with a lender in China to support our facilities expansion. Borrowings bear interest at a floating rate based on the 5-year Loan Prime Rate plus \n0.74\n%. As of October 31, 2024, we had a $\n15.6\n million outstanding balance under the agreement. The carrying amount of the short-term and long-term debt approximates the estimated fair value.\nNote 12. \nLeases\nWe have operating lease arrangements for office space, data center, equipment and other corporate assets. These leases have various expiration dates through December 31, 2042, some of which include options to extend the leases for up to \n10\n years. Because we are not reasonably certain to exercise these renewal options, the options are not considered in determining the lease term and associated potential option payments are excluded from lease payments. \nThe components of our lease expense during the period presented are as follows:\nYear Ended October 31,\n2024\n2023\n2022\n(in thousands)\nOperating lease expense\n (1)\n$\n92,222\n \n$\n90,680\n \n$\n85,631\n \nVariable lease expense \n(2)\n23,835\n \n20,395\n \n11,379\n \nTotal lease expense\n$\n116,057\n \n$\n111,075\n \n$\n97,010\n \n(1)\nOperating lease expense includes immaterial amounts of short-term leases, net of sublease income.\n(2)\nVariable lease expense includes payments to lessors that are not fixed or determinable at lease commencement date. These payments primarily consist of maintenance, property taxes, insurance and variable indexed based payments. \nSupplemental cash flow information during the period presented is as follows:\nYear Ended October 31,\n2024\n2023\n2022\n(in thousands)\nCash paid for amounts included in the measurement of operating lease liabilities\n(1)\n$\n99,905\n \n$\n88,983\n \n$\n83,858\n \nROU assets obtained in exchange for operating lease liabilities\n(2)\n$\n100,480\n \n$\n101,390\n \n$\n168,095\n \n(1) Cash paid for amounts included in the measurement of operating lease liabilities included cash from discontinued operations of $\n5.2\n million, $\n5.7\n million and $\n6.3\n million for the periods presented.\n(2) ROU assets obtained in exchange for operating lease liabilities included ROU assets from discontinued operations of $\n2.2\n million, $\n1.2\n million and $\n1.6\n million for the periods presented.\nLease term and discount rate information related to our operating leases as of the end of the period presented are as follows:\nAs of October 31,\n2024\n2023\nWeighted-average remaining lease term (in years)\n7.59\n8.44\nWeighted-average discount rate\n2.86\n \n%\n2.5\n \n%\nThe following table represents the maturities of our future lease payments due under operating leases as of October 31, 2024:\n86\nTable\n of Contents\nLease Payments\nFiscal year\n(in thousands)\n2025\n$\n111,332\n \n2026\n112,130\n \n2027\n109,380\n \n2028\n94,005\n \n2029\n86,579\n \n2030 and thereafter\n233,161\n \nTotal future minimum lease payments\n746,587\n \nLess: Imputed interest\n77,731\n \nTotal lease liabilities\n$\n668,856\n \nIn addition, certain facilities owned by us were leased to third parties under non-cancellable operating lease agreements. These leases have annual escalating payments and have expiration dates through March 31, 2031 in accordance with the terms and conditions of the existing agreement. \nThe lease receipts from owned facilities, including sublease income from other facilities leased by us, due to us as of October 31, 2024, are as follows:\nLease Receipts\n \n(in thousands)\nFiscal year\n2025\n$\n24,479\n \n2026\n25,333\n \n2027\n26,452\n \n2028\n27,245\n \n2029\n28,063\n \n2030 and thereafter\n28,429\n \nTotal\n$\n160,001\n \nNote 13. \nContingencies\nLegal Proceedings \nWe are subject to routine legal proceedings, as well as demands, claims and threatened litigation that arise in the normal course of our business. The ultimate outcome of any litigation is often uncertain and unfavorable outcomes could have a negative impact on our results of operations and financial condition. We regularly review the status of each significant matter and assess its potential financial exposure. If the potential loss from any claim or legal proceeding is considered probable and the amount is estimable, we accrue a liability for the estimated loss. Legal proceedings are inherently uncertain and as circumstances change, it is possible that the amount of any accrued liability may increase, decrease, or be eliminated.\nWe have determined that, except as set forth below, no disclosure of estimated loss is required for a claim against us because: (1) there is not a reasonable possibility that a loss exceeding amounts already recognized (if any) may be incurred with respect to such claim; (2) a reasonably possible loss or range of loss cannot be estimated; or (3) such estimate is immaterial.\nMentor Patent Litigation\nPrior to the legal settlement as further described below, we were engaged in complex patent litigation with Mentor Graphics Corporation (Mentor) involving several actions in different forums. We succeeded to the litigation when we acquired Emulation & Verification Engineering S.A. on October 4, 2012.\n87\nTable\n of Contents\nLegal Settlement\nIn March 2017, Siemens PLM Software (now Siemens Industry Software Inc. or SISW)) acquired Mentor. On June 29, 2018, we, SISW and Mentor settled all outstanding patent litigation between us and Mentor for a $\n65.0\n million payment made from us to Mentor. As a result of the settlement, the litigation with Mentor was dismissed and the injunction entered in connection with that litigation was vacated. The settlement included mutual \nseven-year\n patent cross-licenses between us and SISW, and between us and Mentor. We and Mentor also amended an existing interoperability agreement to collaborate on a wide range of EDA products for the benefit of our mutual customers (the interoperability amendment). The interoperability amendment includes a one-time termination charge between $\n0.0\n and $\n25.0\n million, payable to SISW under certain conditions. Mentor no longer exists as an independent entity and is succeeded by SISW.\nIn June 2024, the parties extended the existing patent cross-license to December 31, 2031, and entered into a new cross-license of patents related to certain computer-aided engineering technology. The new cross-license is conditioned on the close of the Ansys Merger and expires on December 31, 2031. The interoperability amendment expires by its terms on June 29, 2025.\nTax Matters\nWe undergo examination from time to time by U.S. and foreign authorities for non-income based taxes, such as sales, use and value-added taxes, and are currently under examination by tax authorities in certain jurisdictions. If the potential loss from such examinations is considered probable and the amount or the range of loss could be estimated, we would accrue a liability for the estimated expense. In addition to the foregoing, we are, from time to time, party to various other claims and legal proceedings in the ordinary course of our business, including with tax and other governmental authorities. For a description of certain of these other matters, refer to \nNote 18. Income Taxes \nof the \nNotes to Consolidated Financial Statements \nin this Annual Report\n.\nNote 14. \nAccumulated Other Comprehensive Income (Loss)\nThe components of accumulated other comprehensive income (loss), on an after-tax basis where applicable, are as follows:\n \nAs of October 31,\n \n2024\n2023\n \n(in thousands)\nCumulative currency translation adjustments\n$\n(\n161,954\n)\n$\n(\n170,104\n)\nUnrealized gains (losses) on derivative instruments, net of taxes\n(\n18,800\n)\n(\n25,224\n)\nUnrealized gains (losses) on available-for-sale securities, net of taxes\n374\n \n(\n1,086\n)\nTotal\n$\n(\n180,380\n)\n$\n(\n196,414\n)\nThe effect of amounts reclassified out of each component of accumulated other comprehensive income (loss) into net income is as follows:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nReclassifications:\nGains (losses) on cash flow hedges, net of taxes\nRevenues\n$\n3,089\n \n$\n(\n9,942\n)\n$\n10,975\n \nOperating expenses\n112\n \n(\n15,334\n)\n(\n15,869\n)\nTotal\n$\n3,201\n \n$\n(\n25,276\n)\n$\n(\n4,894\n)\nAmounts reclassified in fiscal 2024, 2023, and 2022 primarily consisted of gains (losses) from our cash flow hedging activities. See \nNote 9. Financial Assets and Liabilities \nof the \nNotes to Consolidated Financial Statements \nin this Annual Report\n.\n88\nTable\n of Contents\nNote 15. \nStock Repurchase Program\nIn fiscal 2022, our Board of Directors approved a stock repurchase program (the Program) with authorization to purchase \nup to $\n1.5\n billion of our common stock. \nAs of October 31, 2024, $\n194.3\n million remained available for future repurchases under the Program. However, in connection with the pending Ansys Merger, we have suspended the Program until we reduce our expected debt levels.\nStock repurchase activities as well as the reissuance of treasury stock for employee stock-based compensation purposes are as follows:\n \nYear Ended October 31,\n \n2024\n2023 \n(1)\n2022\n \n(in thousands, except per share price)\nShares repurchased\n74\n \n2,992\n \n3,609\n \nAverage purchase price per share\n608.91\n \n$\n387.92\n \n$\n314.51\n \nAggregate purchase price\n45,000\n \n$\n1,160,724\n \n$\n1,135,000\n \nReissuance of treasury stock\n2,133\n \n2,670\n \n2,922\n \n(1)\n     Excludes \n73,903\n shares and $\n45.0\n million equity forward contract that was settled in November 2023.\nNote 16. \nEmployee Benefit Plans\nEmployee Stock Purchase Plan\nUnder our Employee Stock Purchase Plan (ESPP), participating employees are granted the right to purchase shares of common stock at a price per share that is \n85\n% of the lesser of the fair market value of the shares at (1) the beginning of an offering period (generally, a rolling \ntwo year\n period) or (2) the purchase date (generally occurring at the end of each semi-annual purchase period), subject to the terms of ESPP, including a limit on the number of shares that may be purchased in a purchase period.\nOn April 12, 2022, our stockholders approved amendments to the ESPP to increase the number of shares of common stock authorized for issuance under the plan by \n2.0\n million shares. During fiscal 2024, 2023 and 2022, we issued \n0.5\n million, \n0.6\n million, and \n0.7\n million shares, respectively, under the ESPP at average per share prices of $\n315.24\n, $\n266.82\n and $\n195.48\n, respectively. As of October 31, 2024, \n12.9\n million shares of common stock were reserved for future issuance under the ESPP.\nEquity Compensation Plans\n2006 Employee Equity Incentive Plan.\n On April 25, 2006, our stockholders approved the 2006 Employee Equity Incentive Plan (2006 Employee Plan), which provides for the grant of incentive stock options, non-statutory stock options, restricted stock awards, restricted stock unit awards, stock appreciation rights and other forms of equity compensation, including performance stock awards and performance cash awards, as determined by the plan administrator. The terms and conditions of each type of award are set forth in the 2006 Employee Plan and in the award agreements governing particular awards. \nRestricted stock units are granted under the 2006 Employee Plan as part of our incentive compensation program. In general, restricted stock units vest over \nthree\n to \nfour years\n and are subject to the employee's continuing service with us. Restricted stock units granted with specific performance criteria vest to the extent performance conditions are met. Restricted stock units granted with certain market conditions vest over \ntwo\n to \nthree years\n to the extent these market conditions are met. For each restricted stock unit granted under the 2006 Employee Plan, a share reserve ratio of \n1.70\n is applied for the purpose of determining the remaining number of shares reserved for future grants under the plan. Options granted under this plan generally have a contractual term of \nseven years\n and generally vest over \nfour years\n.\nOn April 10, 2024, our stockholders amended the 2006 Employee Plan to, among other things, increase the number of shares of common stock reserved for future issuance under the plan by \n3.4\n million shares. As of October 31, 2024, an aggregate of \n1.3\n million stock options and \n3.9\n million restricted stock units were outstanding, and \n14.5\n million shares were available for future issuance under the 2006 Employee Plan.\n89\nTable\n of Contents\n2017 Non-Employee Directors Equity Incentive Plans.\n On April 6, 2017, our stockholders approved the 2017 Non-Employee Directors Equity Incentive Plan (2017 Directors Plan). The 2017 Directors Plan provides for equity awards to non-employee directors in the form of stock options, restricted stock units, restricted stock or a combination thereof. On April 6, 2017, our stockholders approved an aggregate of \n0.45\n million shares of common stock reserved under the 2017 Directors Plan.\nWe grant restricted stock awards and options under the 2017 Directors Plan. Restricted stock awards generally vest on an annual basis and options vest over a period of \nthree years\n. As of October 31, 2024, \n3,751\n shares of restricted stock awards were unvested and \n12,792\n stock options were outstanding, and a total of \n365,203\n shares of common stock were reserved for future issuance under the 2017 Directors Plan.\nOther Assumed Stock Plans through Acquisitions.\n We have assumed certain outstanding stock awards of acquired companies, including restricted stock units and options. If these assumed equity awards are canceled, forfeited or expire unexercised, the underlying shares do not become available for future grant. As of October 31, 2024, \n18\n thousand\n \nshares of our common stock remained subject to such outstanding assumed equity awards.\nRestricted Stock Units.\n \nThe following table contains information concerning activities related to restricted stock units granted under the 2006 Employee Plan and assumed from acquisitions including those associated with our discontinued operations:\nRestricted\nStock Units Outstanding\n(1)\nWeighted \nAverage\nGrant Date\nFair Value\nWeighted\nAverage\nRemaining\nContractual\nLife (In Years)\nAggregate\nFair\nValue\n \n(in thousands, except per share amounts and years)\nBalance at October 31, 2021\n4,187\n \n$\n193.58\n \n1.39\nGranted\n(2)\n2,402\n \n$\n323.46\n \nVested\n(3)\n(\n1,589\n)\n$\n170.36\n \n$\n529,766\n \nForfeited\n(\n362\n)\n$\n228.70\n \nBalance at October 31, 2022\n4,638\n \n$\n265.76\n \n1.32\nGranted\n(2)\n2,083\n \n$\n394.34\n \nVested\n(3)\n(\n1,839\n)\n$\n237.19\n \n$\n706,136\n \nForfeited\n(\n365\n)\n$\n283.29\n \nBalance at October 31, 2023\n4,517\n \n$\n335.26\n \n1.41\nGranted\n(2)\n1,620\n \n$\n543.69\n \nVested\n(3)\n(\n1,778\n)\n$\n303.23\n \n$\n962,127\n \nForfeited\n(\n460\n)\n$\n395.74\n \nBalance at October 31, 2024\n3,899\n \n$\n429.36\n \n1.35\n(1)\nNo restricted stock units were assumed in connection with acquisitions in the last three fiscal years.\n(2)\nThe number of granted restricted stock units includes those granted to senior management with market-based and performance-based vesting criteria (in addition to service-based vesting criteria) (market-based RSUs) reported at the maximum possible number of shares that may ultimately be issuable if all applicable market-based and performance-based criteria are achieved at their maximum levels and all applicable service-based criteria are fully satisfied. \n(3)\nThe number of vested restricted stock units includes shares that were withheld on behalf of employees to satisfy the minimum statutory tax withholding requirements.\n90\nTable\n of Contents\nStock Options. \nThe following table summarizes stock option activity and includes stock options granted under all equity plans including those associated with our discontinued operations:\n \nOptions Outstanding\n \nShares Under Stock Option\n (1)\nWeighted-\nAverage Exercise\nPrice per Share\nWeighted-\nAverage\nRemaining\nContractual\nLife (In Years)\nAggregate\nIntrinsic\nValue\n \n(in thousands, except per share amounts and years)\nBalance at October 31, 2021\n3,107\n \n$\n109.51\n \n3.81\n$\n694,921\n \nGranted\n293\n \n$\n342.86\n \nExercised\n(\n1,126\n)\n$\n86.24\n \nCanceled/forfeited/expired\n(\n114\n)\n$\n164.46\n \nBalance at October 31, 2022\n2,160\n \n$\n150.37\n \n3.57\n$\n328,120\n \nGranted\n294\n \n$\n361.64\n \nExercised\n(\n849\n)\n$\n109.83\n \nCanceled/forfeited/expired\n(\n90\n)\n$\n245.86\n \nBalance at October 31, 2023\n1,515\n \n$\n208.49\n \n3.70\n$\n376,563\n \nGranted\n238\n \n$\n551.41\n \nExercised\n(\n429\n)\n$\n141.83\n \nCanceled/forfeited/expired\n(\n42\n)\n$\n376.97\n \nBalance at October 31, 2024\n1,282\n \n$\n288.91\n \n3.63\n$\n301,781\n \nVested and expected to vest as of October 31, 2024\n1,282\n \n$\n288.91\n \n3.63\n$\n301,781\n \nExercisable at October 31, 2024\n810\n \n$\n197.95\n \n2.54\n$\n259,550\n \n(1)\nNo stock options were assumed in connection with acquisitions in the last three fiscal years, but the balance at fiscal year-end includes certain stock options that were previously assumed in connection with acquisitions.\nThe aggregate intrinsic value in the preceding table represents the pre-tax intrinsic value based on stock options with an exercise price less than our closing stock price of $\n518.40\n at the end of fiscal 2024.\n The pre-tax intrinsic value of options exercised and their average exercise prices including those associated with our discontinued operations are:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands, except per share price)\nIntrinsic value\n$\n185,663\n \n$\n241,385\n \n$\n273,524\n \nAverage exercise price per share\n$\n141.83\n \n$\n109.83\n \n$\n86.24\n \n91\nTable\n of Contents\nRestricted Stock Units and Stock Options. \nThe following table contains additional information concerning activities related to stock options and restricted stock units that were granted under the 2006 Employee Plan and assumed from acquisitions including those associated with our discontinued operations:\n \nAvailable for Grant \n(1)(2)\n \n(in thousands)\nBalance at October 31, 2021\n13,751\n \nOptions granted\n(2)\n(\n286\n)\nOptions canceled/forfeited/expired\n(2)\n114\n \nRestricted stock units granted\n(1)(3)\n(\n4,083\n)\nRestricted stock units forfeited\n(1)\n615\n \nAdditional shares reserved\n3,000\n \nBalance at October 31, 2022\n13,111\n \nOptions granted\n(2)\n(\n294\n)\nOptions canceled/forfeited/expired\n(2)\n89\n \nRestricted stock units granted\n(1)(3)\n(\n3,540\n)\nRestricted stock units forfeited\n(1)\n620\n \nAdditional shares reserved\n3,300\n \nBalance at October 31, 2023\n13,286\n \nOptions granted\n(2)\n(\n238\n)\nOptions canceled/forfeited/expired\n(2)\n40\n \nRestricted stock units granted\n(1)(3)\n(\n2,754\n)\nRestricted stock units forfeited\n(1)\n782\n \nAdditional shares reserved\n3,400\n \nBalance at October 31, 2024\n14,516\n \n(1)\nRestricted stock units includes awards granted under the 2006 Employee Plan \nand assumed through acquisitions. \nThe number of RSUs reflects the application of the award multiplier of \n1.70\n as described above.\n(2)\nOptions granted by us are not subject to the award multiplier ratio described above. \n(3)\nThe number of granted restricted stock units includes market-based RSUs reported at the maximum possible number of shares that may ultimately be issuable if all applicable market-based and performance-based criteria are achieved at their maximum levels and all applicable service-based criteria are fully satisfied.\n92\nTable\n of Contents\nRestricted Stock Awards\n. The following table summarizes restricted stock award activities under the 2005 Directors Plan and 2017 Directors Plan:\nRestricted\nShares\nWeighted-Average\nGrant Date Fair Value\n \n(in thousands, except per share amounts)\nUnvested at October 31, 2021\n5\n \n$\n261.01\n \nGranted\n5\n \n$\n310.02\n \nVested\n(\n5\n)\n$\n261.01\n \nForfeited\n—\n \n$\n—\n \nUnvested at October 31, 2022\n5\n \n$\n310.02\n \nGranted\n5\n \n$\n387.79\n \nVested\n(\n5\n)\n$\n310.02\n \nForfeited\n—\n \n$\n—\n \nUnvested at October 31, 2023\n5\n \n$\n387.79\n \nGranted\n3\n \n$\n561.23\n \nVested\n(\n4\n)\n$\n382.88\n \nForfeited\n—\n \n$\n—\n \nUnvested at October 31, 2024\n4\n \n$\n541.51\n \nValuation and Expense of Stock-Based Compensation.\n We estimate the fair value of stock options and employee stock purchase rights under the ESPP on the grant date. The value of awards expected to vest is recognized as expense over the applicable service periods. We use the Black-Scholes option-pricing model to determine the fair value of stock options and employee stock purchase plan rights\n.\n The Black-Scholes option-pricing model incorporates various assumptions including expected volatility, expected term and interest rates. The expected volatility for both stock options and employee stock purchase rights is estimated by a combination of implied volatility for publicly traded options of our common stock with a term of six months or longer and the historical stock price volatility over the estimated expected term of such awards, which is based on historical experience.\nRestricted stock units are valued based on the closing price of our common stock on the grant date. We use the straight-line attribution method to recognize stock-based compensation costs over the service period of the award except for performance-based RSUs and market-based RSUs.\nWe estimate the probability of achievement of applicable performance goals for performance-based RSUs in each reporting period and recognize related stock-based compensation expense using the graded-vesting method. The amount of stock-based compensation expense recognized in any period can vary based on the attainment or expected attainment of the various performance goals. If such performance goals are not ultimately met, no compensation expense is recognized and any previously recognized compensation expense is reversed. \nWe estimated the fair value of market-based RSUs on the grant date using a Monte Carlo simulation model. Under the award agreements, the vesting of the market-based RSUs is contingent on achieving total stockholder return (TSR) relative to a peer index as well as revenue growth metrics. The maximum potential awards that may be earned are \n187.5\n% of the target number of the initial awards. For market-based RSUs granted in February, May, August and December 2022, the performance period during which the achievement goals was measured is fiscal 2022 and fiscal 2023. Following the achievement of the TSR target, revenue growth metrics, and service conditions, the first tranche of the awards vested in December 2023 and the second tranche of the awards will vest in December 2024. For market-based RSUs granted in February and August 2023, the performance period during which the achievement goals will be measured is fiscal 2023, fiscal 2024 and fiscal 2025. The awards will vest in December 2025 if the TSR target, revenue growth metrics, and service conditions are achieved. For market-based RSUs granted in December 2023, the performance period during which the achievement goals will be measured is fiscal 2024, fiscal 2025 and fiscal 2026. The awards will vest in December 2026 if the TSR target, revenue growth metrics, and service conditions are achieved.\n93\nTable\n of Contents\nThe assumptions presented in the following table are used to estimate the fair value of stock options and employee stock purchase rights granted under our stock plans:\n \nYear Ended October 31,\n \n2024\n2023\n2022\nStock Options:\nExpected life (in years)\n4.1\n \n4.1\n4.1\nRisk-free interest rate\n3.62\n%- \n4.61\n%\n3.8\n% - \n4.80\n%\n1.07\n% - \n4.42\n%\nVolatility\n32.09\n% -\n35.42\n%\n32.74\n% - \n36.16\n%\n32.28\n%- \n37.04\n%\nWeighted average estimated fair value\n$\n178.67\n$\n120.33\n$\n98.07\nESPP:\nExpected life (in years)\n0.5\n - \n2.0\n0.5\n - \n2.0\n0.5\n - \n2.0\nRisk-free interest rate\n3.88\n% - \n5.27\n%\n4.85\n% - \n5.38\n%\n0.67\n% - \n3.44\n%\nVolatility\n31.40\n% - \n34.39\n%\n28.03\n% - \n35.27\n%\n34.51\n% - \n38.69\n%\nWeighted average estimated fair value\n$\n179.10\n$\n120.82\n$\n102.63\nThe grant date fair value of the market-based RSUs and the assumptions used in the Monte Carlo simulation model to determine the grant date fair value during the periods are as follows:\n \nYear Ended October 31,\n \n2024\n2023\n2022\nExpected life (in years)\n2.89\n \n0.90\n -  \n2.70\n1.16\n -  \n1.69\nRisk-free interest rate\n4.41\n%\n4.36\n% - \n4.80\n%\n1.33\n% - \n3.46\n%\nVolatility\n34.03\n%\n34.79\n% - \n42.86\n%\n33.01\n% - \n37.80\n%\nGrant date fair value\n$\n600.29\n$\n357.29\n - $\n465.79\n$\n280.52\n - $\n412.20\nThe compensation cost recognized in the consolidated statements of income for our stock compensation arrangements is as follows:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nCost of products\n$\n66,403\n \n$\n49,896\n \n$\n43,618\n \nCost of maintenance and service\n32,189\n \n29,572\n \n24,146\n \nResearch and development expense\n359,244\n \n282,540\n \n233,772\n \nSales and marketing expense\n121,524\n \n91,082\n \n70,607\n \nGeneral and administrative expense\n78,575\n \n60,004\n \n49,606\n \nStock-based compensation expense from continuing operations before taxes\n657,935\n \n513,094\n \n421,749\n \nStock-based compensation expense from discontinued operations before taxes\n34,381\n \n50,198\n \n37,280\n \nTotal stock-based compensation expense before taxes\n692,316\n \n563,292\n \n459,029\n \nIncome tax benefit\n(\n115,271\n)\n(\n90,915\n)\n(\n74,271\n)\nStock-based compensation expense after taxes\n$\n577,045\n \n$\n472,377\n \n$\n384,758\n \n \nAs of October 31, 2024, we had $\n1.3\n billion of total unrecognized stock-based compensation expense relating to options, RSUs and restricted stock awards, which is expected to be recognized over a weighted average period of \n2.3\n years. As of October 31, 2024, we had $\n111.2\n million of total unrecognized stock-based compensation expense relating to the ESPP, which is expected to be recognized over a period of \n2.0\n years.\nDeferred Compensation Plan.\n We maintain the Synopsys Deferred Compensation Plan (Deferred Plan), which permits eligible employees to defer up to \n50\n% of their annual cash base compensation and up to \n100\n% of their eligible cash variable compensation. Amounts may be withdrawn from the Deferred Plan pursuant to elections made \n94\nTable\n of Contents\nby the employees in accordance with the terms of the plan. Since the inception of the Deferred Plan, we have not made any matching or discretionary contributions to the Deferred Plan. There are no Deferred Plan provisions that provide for any guarantees or minimum return on investments. Undistributed amounts under the Deferred Plan are subject to the claims of our creditors.\nDeferred plan assets and liabilities are as follows:\nAs of October 31,\n2024\n2023\n \n(in thousands)\nPlan assets recorded in other long-term assets\n$\n386,757\n \n$\n297,180\n \nPlan liabilities recorded in other long-term liabilities\n(1)\n$\n386,757\n \n$\n297,180\n \n(1)\nUndistributed deferred compensation balances due to participants.\nIncome or loss from the change in fair value of the Deferred Plan assets is recorded in interest and other income (expense), net. The increase or decrease in the fair value of the undistributed Deferred Plan obligation is recorded in total cost of revenue and operating expense. \nThe following table summarizes the impact of the Deferred Plan:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nIncrease (reduction) to cost of revenue and operating expense\n$\n85,446\n \n$\n20,196\n \n$\n(\n67,516\n)\nInterest and other income (expense), net\n85,446\n \n20,196\n \n(\n67,516\n)\nNet increase (decrease) to net income\n$\n—\n \n$\n—\n \n$\n—\n \nOther Retirement Plans.\n We sponsor various defined contribution retirement plans for our eligible U.S. and non-U.S. employees. Total contributions to these plans were $\n51.3\n million, $\n50.8\n million, and $\n44.0\n million in fiscal 2024, 2023, and 2022, respectively. For employees in the United States and Canada, we match pre-tax employee contributions up to a maximum of U.S. $\n3,000\n and Canadian $\n4,000\n, respectively, per participant per year.\nCertain of our international subsidiaries sponsor defined benefit retirement plans. The unfunded projected benefit obligation for these defined benefit retirement plans as of October 31, 2024 and 2023 was immaterial and recorded in other long-term liabilities in our consolidated balance sheets.\n95\nTable\n of Contents\nNote 17. \nNet Income Per Share\nThe table below reconciles the weighted average common shares used to calculate basic net income per share with the weighted average common shares used to calculate diluted net income per share:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands, except per share amounts)\nNumerator:\nNet income from continuing operations attributed to Synopsys\n$\n1,441,710\n \n$\n1,227,045\n \n$\n970,225\n \nNet income from discontinued operations attributed to Synopsys\n821,670\n \n2,843\n \n14,369\n \nNet income attributed to Synopsys\n$\n2,263,380\n \n$\n1,229,888\n \n$\n984,594\n \nDenominator:\nWeighted average common shares for basic net income per share\n153,138\n \n152,146\n \n153,002\n \nDilutive effect of common share equivalents from equity-based compensation\n2,806\n \n3,049\n \n3,483\n \nWeighted average common shares for diluted net income per share\n155,944\n \n155,195\n \n156,485\n \nNet income per share attributed to Synopsys - basic:\nContinuing operations\n$\n9.41\n \n$\n8.06\n \n$\n6.34\n \nDiscontinued operations\n5.37\n \n0.02\n \n0.10\n \nBasic net income per share\n$\n14.78\n \n$\n8.08\n \n$\n6.44\n \nNet income per share attributed to Synopsys - diluted:\nContinuing operations\n$\n9.25\n \n$\n7.91\n \n$\n6.20\n \nDiscontinued operations\n5.26\n \n0.01\n \n0.09\n \nDiluted net income per share\n$\n14.51\n \n$\n7.92\n \n$\n6.29\n \nAnti-dilutive employee stock-based awards excluded\n229\n \n475\n \n281\n \nNote 18. \nIncome Taxes\nThe domestic and foreign components of our total income before provision for income taxes are as follows:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nUnited States\n$\n1,333,132\n \n$\n1,144,410\n \n$\n1,028,829\n \nForeign\n180,726\n \n161,060\n \n74,623\n \nTotal income before provision for income taxes\n$\n1,513,858\n \n$\n1,305,470\n \n$\n1,103,452\n \n96\nTable\n of Contents\nThe components of the provision (benefit) for income taxes are as follows:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nCurrent:\nFederal\n$\n345,859\n \n$\n252,186\n \n$\n109,030\n \nState\n19,808\n \n23,042\n \n23,593\n \nForeign\n110,021\n \n22,869\n \n43,076\n \n475,688\n \n298,097\n \n175,699\n \nDeferred:\nFederal\n(\n312,677\n)\n(\n191,249\n)\n(\n38,901\n)\nState\n(\n39,164\n)\n(\n219\n)\n(\n1,067\n)\nForeign\n(\n24,129\n)\n(\n16,441\n)\n3,654\n \n(\n375,970\n)\n(\n207,909\n)\n(\n36,314\n)\nProvision (benefit) for income taxes\n$\n99,718\n \n$\n90,188\n \n$\n139,385\n \nThe provision (benefit) for income taxes differs from the taxes computed with the statutory federal income tax rate as follows: \n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nStatutory federal tax\n$\n317,912\n \n$\n274,149\n \n$\n231,723\n \nState tax (benefit), net of federal effect \n48,393\n \n438\n \n(\n2,870\n)\nFederal tax credits\n(\n70,119\n)\n(\n60,500\n)\n(\n55,708\n)\nTax (benefit) on foreign earnings\n3,316\n \n(\n17,571\n)\n23,709\n \nForeign-derived intangible income deduction\n(\n104,835\n)\n(\n80,034\n)\n(\n38,816\n)\nTax settlements\n—\n \n(\n23,752\n)\n—\n \nStock-based compensation\n(\n43,419\n)\n(\n39,995\n)\n(\n50,469\n)\nChanges in valuation allowance\n(\n57,371\n)\n29,631\n \n19,794\n \nOther\n5,841\n \n7,822\n \n12,022\n \nProvision (benefit) for income taxes\n$\n99,718\n \n$\n90,188\n \n$\n139,385\n \nOn December 22, 2017, the Tax Cuts and Jobs Act (Tax Act) was enacted, which significantly changed prior U.S. tax law and includes numerous provisions that affect our business. Effective in our fiscal 2023 year, the Tax Act requires that research and development expenditures are capitalized and amortized instead of being deducted when incurred. Domestic research is capitalized over five years and foreign research is capitalized over fifteen years. Capitalization of research and development expenditures also results in a corresponding deferred tax benefit and decreased our effective tax rate due to increasing the foreign-derived intangible income deduction.\nWe have provided for foreign withholding taxes on undistributed earnings of certain of our foreign subsidiaries to the extent such earnings are no longer considered to be indefinitely reinvested in the operations of those subsidiaries. Where foreign subsidiaries are considered indefinitely reinvested, and if the tax effect of undistributed earnings and other outside basis differences were recognized, the nature of taxes expected would primarily be withholding, taxes in non-conforming states, and taxes on intermediate holding companies outside of the U.S., net of foreign tax credits where available. As of October 31, 2024, the taxes due, after allowable foreign tax credits, are not expected to be material.\n97\nTable\n of Contents\nThe significant components of deferred tax assets and liabilities are as follows:\n \nAs of October 31,\n \n2024\n2023\n \n(in thousands)\nNet deferred tax assets:\nDeferred tax assets:\nDeferred revenue\n$\n37,849\n \n$\n37,641\n \nDeferred compensation\n73,869\n \n69,824\n \nIntangible and depreciable assets\n65,489\n \n94,299\n \nCapitalized research and development costs\n978,085\n \n591,617\n \nStock-based compensation\n74,934\n \n64,326\n \nTax loss carryovers\n37,787\n \n36,804\n \nForeign tax credit carryovers\n42,534\n \n41,584\n \nResearch and other tax credit carryovers\n107,643\n \n178,416\n \nOperating Lease Liabilities\n108,235\n \n118,679\n \nAccruals and reserves\n49,935\n \n27,636\n \nGross deferred tax assets\n1,576,360\n \n1,260,826\n \nValuation allowance\n(\n170,672\n)\n(\n221,713\n)\nTotal deferred tax assets\n1,405,688\n \n1,039,113\n \nDeferred tax liabilities:\nIntangible assets\n80,034\n \n98,305\n \nOperating lease Right-of-Use-Assets\n84,512\n \n94,068\n \nAccruals and reserves\n—\n \n602\n \nUndistributed earnings of foreign subsidiaries\n8,800\n \n8,900\n \nOther\n21,641\n \n19,169\n \nTotal deferred tax liabilities\n194,987\n \n221,044\n \nNet deferred tax assets\n$\n1,210,701\n \n$\n818,069\n \nIt is more likely than not that the results of future operations will be able to generate sufficient taxable income to realize the net deferred tax assets. The valuation allowance provided against our deferred tax assets as of October 31, 2024 is mainly attributable to foreign tax credits available to non-U.S. subsidiaries and the California research credits. The valuation allowance decreased by a net of $\n51.0\n million in fiscal 2024, primarily related to anticipated utilization of California research credits.\n98\nTable\n of Contents\nWe have the following tax loss and credit carryforwards available to offset future income tax liabilities:\nCarryforward\nAmount\nExpiration\nDate\n \n(in thousands)\n \nFederal net operating loss carryforward\n$\n69,062\n \n2025-2043\nFederal research credit carryforward\n6,214\n \n2025-2035\nFederal foreign tax credit carryforward\n34,217\n \n2034\nInternational foreign tax credit carryforward\n5,337\n \nIndefinite\nInternational net operating loss carryforward\n51,326\n \n2027-Indefinite\nCalifornia research credit carryforward\n151,380\n \nIndefinite\nOther state research credit carryforward\n25,621\n \n2027-2044\nState net operating loss carryforward\n138,482\n \n2028-2045\nThe federal and state net operating loss carryforward is from acquired companies and the annual use of such loss is subject to significant limitations under Internal Revenue Code Section 382. Foreign tax credits may only be used to offset tax attributable to foreign source income.\nThe gross unrecognized tax benefits decreased by approximately $\n3.0\n million during fiscal 2024 resulting in gross unrecognized tax benefits of $\n61.9\n million as of October 31, 2024. \nA reconciliation of the beginning and ending balance of gross unrecognized tax benefits is summarized as follows:\nAs of October 31,\n2024\n2023\n \n(in thousands)\nBeginning balance\n$\n64,880\n \n$\n71,898\n \nIncreases in unrecognized tax benefits related to prior year tax positions\n1,106\n \n211\n \nDecreases in unrecognized tax benefits related to prior year tax positions\n(\n8,639\n)\n(\n25,678\n)\nIncreases in unrecognized tax benefits related to current year tax positions\n8,036\n \n8,029\n \nReductions in unrecognized tax benefits due to lapse of applicable statute of limitations\n(\n4,380\n)\n(\n249\n)\nIncreases in unrecognized tax benefits acquired\n161\n \n165\n \nChanges in unrecognized tax benefits due to foreign currency translation\n690\n \n10,504\n \nEnding balance\n$\n61,854\n \n$\n64,880\n \nAs of October 31, 2024 and 2023, approximately $\n61.9\n million and $\n64.9\n million, respectively, of the unrecognized tax benefits would affect our effective tax rate if recognized upon resolution of the uncertain tax positions.\nInterest and penalties related to estimated obligations for tax positions taken in our tax returns are recognized as a component of income tax expense (benefit) in the consolidated statements of income and totaled approximately $(\n1.0\n) million\n,\n $(\n10.6\n) million and $\n0.8\n million for fiscal years 2024, 2023 and 2022, respectively. As of October 31, 2024 and 2023, the combined amount of accrued interest and penalties related to tax positions taken on our tax returns were approximately $\n1.1\n million and $\n2.1\n million, respectively.\nThe timing of the resolution of income tax examinations, and the amounts and timing of various tax payments that are part of the settlement process, are highly uncertain. Variations in such amounts and/or timing could cause large fluctuations in the balance sheet classification of current and non-current assets and liabilities. We believe that in the coming 12 months, it is reasonably possible that either certain audits and ongoing tax litigation will conclude or the statute of limitations on certain state and foreign income and withholding taxes will expire, or both. Given the uncertainty as to ultimate settlement terms, the timing of payment and the impact of such settlements on other uncertain tax positions, the range of the estimated potential decrease in underlying unrecognized tax benefits is between $\n0.0\n and $\n12.0\n million.\n99\nTable\n of Contents\nWe and/or our subsidiaries remain subject to tax examination in the following jurisdictions:\nJurisdiction\nYear(s) Subject to Examination\nUnited States\nFiscal years after 2020\nCalifornia\nFiscal years after 2019\nIreland\nFiscal years after 2019\nJapan\nFiscal years after 2019\nKorea\nFiscal years after 2020\nTaiwan\nFiscal years after 2022\nChina\nFiscal years after 2014\nIndia\nFiscal years after 2019\nIn addition, we have made acquisitions with operations in several of our significant jurisdictions which may have years subject to examination different from the years indicated in the above table.\nNon-U.S. Examinations\nHungarian Tax Authority\nIn 2017, the Hungarian Tax Authority (the HTA) assessed withholding taxes of approximately $\n25.0\n million and interest and penalties of $\n11.0\n million, against our Hungary subsidiary (Synopsys Hungary). Synopsys Hungary contested the assessment with the Hungarian Administrative Court (Administrative Court). In 2018, Synopsys Hungary paid the assessment. Following years of litigation, the Administrative Court issued its written decision in favor of Synopsys Hungary on May 17, 2023, and the HTA subsequently refunded Synopsys Hungary the tax, penalty and interest paid in fiscal 2018, as well as additional interest all totaling $\n39.1\n million (including foreign currency effects). During the third quarter of fiscal 2023, we released our unrecognized tax benefit and offsetting U.S. foreign tax credits, resulting in a net benefit of $\n23.8\n million.\nWe are also under examination by the tax authorities in certain other jurisdictions. No material assessments have been proposed in these examinations.\nLegislative Developments\nEffective our fiscal 2024, we are subject to the new 15% corporate alternative minimum tax (CAMT) enacted as part of the Inflation Reduction Act of 2022. We do not expect any impact of CAMT in fiscal 2024, due to our regular tax liability exceeding CAMT. The details of the computation will be subject to final regulations to be issued by the U.S. Department of the Treasury. We will monitor regulatory developments and will continue to evaluate the impact, if any, of the minimum tax.\nThe IR Act imposes a 1% excise tax on the fair market value of stock repurchases made by covered corporations after December 31, 2022. The total taxable value of shares repurchased is reduced by the fair market value of any newly issued shares during the taxable year. As of October 31, 2024, this does not have any impact on our consolidated financial statements.\nOn June 27, 2024, California enacted SB-167, which suspends the use of California net operating loss and limits the use of California research tax credits to $5 million for our fiscal 2025-2027. On June 29, 2024, California enacted SB-175, which provides a refund mechanism effective beginning in our fiscal 2025 for the incremental tax that was paid as a result of SB-167. \nThe Organization for Economic Co-operation and Development (OECD) has a two-pillar solution to address tax challenges arising from digitalization of the economy. Included in this two-pillar solution is the Pillar Two Model Rules (Pillar Two) which defines a global minimum tax rules and includes a 15% minimum tax rate. Various countries have started to enact new laws related to Pillar Two, including certain new laws effective beginning in fiscal 2025. Based on our preliminary analysis, we are not expecting the impact of Pillar 2 to be material.\n100\nTable\n of Contents\nNote 19. \nInterest and Other Income (Expense), Net\nThe following table presents the components of interest and other income (expense), net:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nInterest income\n$\n67,017\n \n$\n36,674\n \n$\n8,545\n \nInterest expense\n(\n35,161\n)\n(\n1,178\n)\n(\n1,698\n)\nGains (losses) on assets related to deferred compensation plan\n85,446\n \n20,196\n \n(\n67,516\n)\nGain on sale of strategic investments\n55,077\n \n—\n \n—\n \nForeign currency exchange gains (losses)\n6,294\n \n(\n1,529\n)\n4,694\n \nOther, net\n(\n20,526\n)\n(\n21,932\n)\n10,713\n \nTotal\n$\n158,147\n \n$\n32,231\n \n$\n(\n45,262\n)\nNote 20. \nSegment Disclosure\nSegment reporting is based upon the “management approach,” i.e., how management organizes our operating segments for which separate financial information is (1) available and (2) evaluated regularly by the CODM in deciding how to allocate resources and in assessing performance. Our CODM is our CEO.\nWe have \ntwo\n reportable segments: (1) Design Automation, which includes our advanced silicon design, verification products and services, system integration products and services, digital, custom and FPGA IC design software, verification software and hardware products, manufacturing software products and other; and (2) Design IP, which includes our interface, foundation, security, and embedded processor IP, IP subsystems, and IP implementation services.\nThe financial information provided to and used by the CODM to assist in making operational decisions, allocating resources, and assessing performance includes consolidated financial information as well as revenue, adjusted operating income, and adjusted operating margin information for the Design Automation, and Design IP segments, accompanied by disaggregated information relating to revenue by geographic region.\nThe Software Integrity business constituted its own reportable segment under Topic 280. In accordance with applicable accounting guidance, the results of the Software Integrity business are presented as discontinued operations in the consolidated statements of income and, as such, have been excluded from both continuing operations and segment results for all periods presented. See Note 3. \nDiscontinued Operations \nof the \nNotes to Consolidated Financial Statements \nin this Annual Report.\n101\nTable\n of Contents\nInformation by reportable segment is as follows:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nTotal Segments:\n      Revenue\n$\n6,127,436\n \n$\n5,318,014\n \n$\n4,615,714\n \n      Adjusted operating income\n2,362,059\n \n1,928,027\n \n1,579,899\n \n      Adjusted operating margin\n39\n \n%\n36\n \n%\n34\n \n%\nDesign Automation:\n      Revenue\n$\n4,221,122\n \n$\n3,775,288\n \n$\n3,300,173\n \n      Adjusted operating income\n1,631,885\n \n1,413,926\n \n1,176,101\n \n      Adjusted operating margin\n39\n \n%\n37\n \n%\n36\n \n%\nDesign IP:\nRevenue\n$\n1,906,314\n \n$\n1,542,726\n \n$\n1,315,541\n \nAdjusted operating income\n730,174\n \n514,101\n \n403,798\n \nAdjusted operating margin\n38\n \n%\n33\n \n%\n31\n \n%\nCertain operating expenses are not allocated to the segments and are managed at a consolidated level. \nThe unallocated expenses managed at a consolidated level, including amortization of acquired intangible assets, stock-based compensation, changes in the fair value of deferred compensation plan, restructuring charges, and acquisition/divestiture related items, are presented in the table below to provide a reconciliation of the total adjusted operating income from segments to our consolidated operating income from continuing operations:\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nTotal segment adjusted operating income\n$\n2,362,059\n \n$\n1,928,027\n \n$\n1,579,899\n \nReconciling items:\n      Amortization of acquired intangible assets\n(\n124,234\n)\n(\n54,576\n)\n(\n56,311\n)\n      Stock-based compensation expense\n(\n657,935\n)\n(\n513,094\n)\n(\n421,749\n)\n      Deferred compensation plan\n(\n85,446\n)\n(\n20,196\n)\n67,516\n \n      Restructuring charges\n—\n \n(\n53,091\n)\n(\n11,221\n)\n      Acquisition/divestiture related items\n(\n138,733\n)\n(\n13,831\n)\n(\n9,420\n)\nTotal operating income\n$\n1,355,711\n \n$\n1,273,239\n \n$\n1,148,714\n \nThe CODM does not use total assets by segment to evaluate segment performance or allocate resources. As a result, total assets by segment are not disclosed.\nIn allocating revenue to particular geographic areas, the CODM considers where individual “seats” or licenses to our products are located. Revenue is defined as revenue from external customers. Revenue and property and equipment, net, related to operations in the United States and other geographic areas are:\n102\nTable\n of Contents\n \nYear Ended October 31,\n \n2024\n2023\n2022\n \n(in thousands)\nRevenue:\nUnited States\n$\n2,739,756\n \n$\n2,462,009\n \n$\n2,094,470\n \nEurope\n614,584\n \n514,780\n \n430,369\n \nChina\n989,524\n \n855,023\n \n774,265\n \nKorea\n773,018\n \n625,502\n \n523,501\n \nOther\n1,010,554\n \n860,700\n \n793,109\n \nConsolidated\n$\n6,127,436\n \n$\n5,318,014\n \n$\n4,615,714\n \n \nAs of October 31,\n \n2024\n2023\n \n(in thousands)\nProperty and Equipment, net:\nUnited States\n$\n335,306\n \n$\n334,272\n \nOther\n227,700\n \n215,565\n \nTotal\n$\n563,006\n \n$\n549,837\n \nGeographic revenue data for multi-regional, multi-product transactions reflect internal allocations and are therefore subject to certain assumptions and to our allocation methodology.\nOne customer, including its subsidiaries, accounted for \n12.6\n%, \n13.5\n%, and \n12.8\n% of our consolidated revenue in fiscal 2024, 2023, and 2022, respectively. No customer accounted for over 10% of our accounts receivable as of October 31, 2024. One customer accounted for \n12.1\n% of our accounts receivable as of October 31, 2023.\nNote 21. \nRestructuring Charges\nIn the first quarter of fiscal 2023, we initiated a restructuring plan for involuntary employee terminations as part of a business reorganization (the 2023 Plan). The 2023 Plan was substantially completed in the third quarter of fiscal 2023 and total charges under the 2023 Plan consisting primarily of severance costs and facility exit costs were $\n77.0\n million, of which $\n23.9\n million were related to discontinued operations.\nDuring fiscal 2024, we made payments of $\n3.6\n million related to continuing operations and $\n0.5\n million related to discontinued operations under the 2023 Plan. As of October 31, 2024, the payroll and related benefits liabilities of $\n0.8\n million were recorded in accounts payable and accrued liabilities, and the remaining outstanding restructuring related liabilities of $\n3.8\n million were recorded in other long-term liabilities in the consolidated balance sheets. \nDuring fiscal 2023, we recorded restructuring charges related to continuing operations of $\n53.1\n million and made payments of $\n44.9\n million under the 2023 Plan. We recorded restructuring charges related to discontinued operations of $\n23.9\n million and made payments of $\n23.4\n million under the 2023 Plan. As of October 31, 2023, the payroll and related benefits liabilities related to continuing operations of $\n3.7\n million were recorded in accounts payable and accrued liabilities, and the remaining outstanding restructuring related liabilities of $\n4.5\n million were recorded in other long-term liabilities in the consolidated balance sheets. The payroll and related benefits liabilities related to discontinued operations were $\n0.5\n million.\nDuring fiscal 2022, we recorded restructuring charges related to continuing operations of $\n11.2\n million and made payments of $\n24.1\n million under the 2021 restructuring plan (the 2021 Plan) initiated in the third quarter of fiscal 2021. We recorded restructuring charges related to discontinued operations of $\n0.9\n million and made payments of $\n2.2\n million under the 2021 Plan. There was \nno\n outstanding balance under the 2021 Plan as of October 31, 2022.\n103\nTable\n of Contents\nSupplementary Data - Selected Unaudited Quarterly Financial Data\nThe table below includes certain unaudited financial information for the last eight fiscal quarters. \nQuarter Ended\nJanuary 31,\nApril 30,\nJuly 31,\nOctober 31,\nin thousands, except per share amounts\n2024\nRevenue\n$\n1,510,989 \n$\n1,454,712 \n$\n1,525,749 \n$\n1,635,986 \nGross margin\n1,231,796 \n1,154,315 \n1,235,073 \n1,314,491 \nIncome before provision for income taxes\n457,454 \n341,530 \n391,995 \n322,879 \nNet income from continuing operations\n434,545 \n296,093 \n422,707 \n260,795 \nIncome (loss) from discontinued operations, net of income taxes\n11,662 \n(7,004)\n(17,813)\n834,825 \nNet income\n446,207 \n289,089 \n404,894 \n1,095,620 \nNet income attributed to Synopsys\n449,112 \n292,107 \n408,055 \n1,114,106 \nNet income (loss) per share attributed to Synopsys - basic:\nContinuing operations\n$\n2.87 \n$\n1.96 \n$\n2.78 \n$\n1.81 \nDiscontinued operations\n0.08 \n(0.05)\n(0.12)\n5.43 \nBasic net income per shares\n(1)\n$\n2.95 \n$\n1.91 \n$\n2.66 \n$\n7.24 \nNet income (loss) per share attributed to Synopsys - diluted:\nContinuing operations\n$\n2.82 \n$\n1.92 \n$\n2.73 \n$\n1.79 \nDiscontinued operations\n0.07 \n(0.04)\n(0.12)\n5.35 \nDiluted net income per shares\n(1)\n$\n2.89 \n$\n1.88 \n$\n2.61 \n$\n7.14 \n2023\nRevenue\n$\n1,233,497 \n$\n1,262,744 \n$\n1,354,390 \n$\n1,467,383 \nGross margin\n997,508 \n1,014,503 \n1,093,958 \n1,181,202 \nIncome before provision for income taxes\n279,558 \n296,587 \n325,560 \n403,765 \nNet income from continuing operations\n266,775 \n272,640 \n332,511 \n343,356 \nIncome (loss) from discontinued operations, net of income taxes\n1,852 \n(2,692)\n544 \n3,139 \nNet income\n268,627 \n269,948 \n333,055 \n346,495 \nNet income attributed to Synopsys\n271,536 \n272,910 \n336,252 \n349,190 \nNet income (loss) per share attributed to Synopsys - basic:\nContinuing operations\n$\n1.77 \n$\n1.81 \n$\n2.21 \n$\n2.28 \nDiscontinued operations\n0.01 \n(0.02)\n— \n0.02 \nBasic net income per shares\n(1)\n$\n1.78 \n$\n1.79 \n$\n2.21 \n$\n2.30 \nNet income (loss) per share attributed to Synopsys - diluted:\nContinuing operations\n$\n1.74 \n$\n1.78 \n$\n2.17 \n$\n2.23 \nDiscontinued operations\n0.01 \n(0.02)\n— \n0.03 \nDiluted net income per shares\n(1)\n$\n1.75 \n$\n1.76 \n$\n2.17 \n$\n2.26 \n(1) Net income per share is computed independently. Therefore, the sum of the quarterly net income per share may not equal to the total computed for the year or any cumulative interim period\n.\n104\nTable of Contents\n Item 9.     \nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable.\n Item 9A.     \nControls and Procedures\n(a)\nEvaluation of Disclosure Controls and Procedures.\n As of November 2, 2024, Synopsys carried out an evaluation under the supervision and with the participation of Synopsys’ management, including the Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of Synopsys’ disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act). Regardless of how well designed and operated, there are inherent limitations to the effectiveness of any system of disclosure controls and procedures. Accordingly, even effective disclosure controls and procedures can only provide reasonable, not absolute, assurance of achieving their control objectives. Our compliance programs and compliance training for employees may not prevent our employees or contractors from breaching or circumventing our policies or violating applicable laws and regulations. Our Chief Executive Officer and Chief Financial Officer have concluded that, as of November 2, 2024, Synopsys’ disclosure controls and procedures were effective to provide reasonable assurance that information required to be disclosed in the reports Synopsys files and submits under the Exchange Act is recorded, processed, summarized and reported as and when required, and that such information is accumulated and communicated to Synopsys’ management, including the Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding its required disclosure.\n(b)\nManagement’s Report on Internal Control Over Financial Reporting\n. Our management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) for Synopsys.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of November 2, 2024. In assessing the effectiveness of our internal control over financial reporting, our management used the framework established in \nInternal Control Integrated Framework (2013)\n issued by The Committee of Sponsoring Organizations of the Treadway Commission (COSO). \nOur management has concluded that, as of November 2, 2024, our internal control over financial reporting was effective based on these criteria. Our independent registered public accounting firm, KPMG LLP, has issued an auditors’ report on the effectiveness of our internal control over financial reporting, which is included herein.\n(c)\nChanges in Internal Control Over Financial Reporting.\n There were no changes in Synopsys’ internal control over financial reporting during the fiscal quarter ended November 2, 2024 that have materially affected, or are reasonably likely to materially affect, Synopsys’ internal control over financial reporting.\n105\nTable of Contents\n Item 9B.     \nOther Information\nInsider Adoption or Termination of Trading Arrangements\nNone\n of our directors or officers informed us of the adoption, modification or termination of a \"Rule 10b5-1 trading arrangement\" or \"non-Rule 10b5-1 trading arrangement\" (as those terms are defined in Item 408(c) of Regulation S-K) during the quarterly period covered by this report, except as described in the table below:\nName and Title\nAction\nDate Adopted\nCharacter of Trading Arrangement\n(1)\nAggregate Number of Common Stock to be Purchased or Sold Pursuant to Trading Arrangement\nExpiration Date\n(2)\nSassine Ghazi\nAdoption\n \n9/30/2024\nRule 10b5-1 Trading Arrangement\nUp to \n34,098\n shares to be sold\n12/12/2025\nPresident, Chief Executive Officer and Director\nRick Mahoney\nAdoption\n \n9/13/2024\nRule 10b5-1 Trading Arrangement\n(3)\n1/16/2026\nChief Revenue Officer\n(1)\nExcept as indicated by footnote, each trading arrangement marked as a “Rule 10b5-1 Trading Arrangement” is intended to satisfy the affirmative defense of Rule 10b5-1(c), as amended (the Rule).\n(2)\nExcept as indicated by footnote, each trading arrangement permitted or permits transactions through and including the earlier to occur of (a) the completion of all purchases or sales or (b) the date listed in the table. Each trading arrangement marked as a “Rule 10b5-1 Trading Arrangement” only permitted or only permits transactions upon expiration of the applicable mandatory cooling-off period under the Rule.\n(3)\nThe aggregate number of common stock to be sold pursuant to Mr. Mahoney's Rule 10b5-1 Trading Arrangement includes: \na.\n30,222\n shares of common stock held by Mr. Mahoney;\nb.\nAll of net after-tax shares of common stock received upon the payout of \n7,344\n performance-based restricted stock units (PRSUs), which were earned on December 12, 2023, and thereafter subject to only time-based vesting; and\nc.\nAll of net after-tax shares of common stock received upon the payout of \n6,348\n PRSUs, which were granted in fiscal 2023. The number of shares that will be earned will depend on our performance. See the Compensation Discussion and Analysis in our most recent proxy statement, which was filed on February 16, 2024 for more information (the Proxy Statement). In addition, the actual number of shares that will be released to Mr. Mahoney in connection with the 2023 Annual PRSUs (as defined in the proxy statement) and sold under the Rule 10b5-1 Trading Arrangement will be net of the number of shares withheld to satisfy tax withholding obligations arising from the vesting of such shares and is not yet determinable\n.\n Item 9C.     \nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNone.\n106\nTable of Contents\nPART III\n Item 10.     \nDirectors, Executive Officers and Corporate Governance\nFor information required by this Item relating to our executive officers, see \nInformation about our Executive Officers\n in Part I, Item 1 of this Annual Report.\nThe information required by this Item relating to our directors and nominees is included under the heading “Proposal 1 — Election of Directors,” in our definitive Proxy Statement to be filed within 120 days after November 2, 2024 for the 2025 Annual Meeting of Stockholders (our Proxy Statement) and is incorporated herein by reference. The information required by this Item regarding our Audit Committee is included under the headings “Audit Committee Report” and “Corporate Governance” in our Proxy Statement and is incorporated herein by reference. We will provide disclosure of delinquent Section 16(a) reports, if any, in our Proxy Statement, and such disclosure, if any, is incorporated herein by reference.\nThe information required by this Item relating to our code of ethics and its applicability to our Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer is included under the heading “Ethics and Business Conduct” in our Proxy Statement and is incorporated herein by reference.\n Item 11.     \nExecutive Compensation\nThe information required by this Item relating to director and executive compensation is included under the headings “Compensation Discussion and Analysis,” “Executive Compensation Tables,” “Director Compensation,” “Compensation Committee Interlocks and Insider Participation,” and “Compensation Committee Report” in our Proxy Statement and is incorporated herein by reference.\n Item 12.     \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item relating to security ownership of certain beneficial owners and management is included under the heading “Security Ownership of Certain Beneficial Owners and Management” in our Proxy Statement, and the information required by this Item relating to securities authorized for issuance under equity compensation plans is included under the heading “Equity Compensation Plan Information” in our Proxy Statement, and, in each case, is incorporated herein by reference.\n Item 13.     \nCertain Relationships and Related Transactions and Director Independence\nThe information required by this Item relating to the review, approval or ratification of transactions with related persons is included under the heading “Transactions with Related Persons” in our Proxy Statement, and the information required by this Item relating to director independence is included under the heading “Director Independence,” and, in each case, is incorporated herein by reference.\n Item 14.     \nPrincipal Accountant Fees and Services\nThe information required by this Item is included under the headings “Fees and Service of Independent Registered Public Accounting Firm” and “Audit Committee Pre-Approval Policies and Procedures” in our Proxy Statement and is incorporated herein by reference.\n107\nTable of Contents\nPART IV\n Item 15.     \nExhibits and Financial Statement Schedules\n(a)\nThe following documents are filed as part of this Form 10-K:\n(1)\nFinancial Statements\nThe following documents are included as Part II, Item 8 of this Form 10-K:\n \nPage\nReport of Independent Registered Public Accounting Firm\n (\nKPMG LLP\n, \nSanta Clara, CA\n, PCAOB ID: \n185\n)\n54\nConsolidated Balance Sheets\n56\nConsolidated Statements of Income\n57\nConsolidated Statements of Comprehensive Income\n58\nConsolidated Statements of Stockholders’ Equity\n59\nConsolidated Statements of Cash Flows\n60\nNotes to Consolidated Financial Statements\n62\n(2)\nFinancial Statement Schedules\nSchedules not listed above have been omitted because the information required to be set forth therein is not applicable or is shown in the financial statements or notes herein.\n(3)\nExhibits\nSee Item 15(b) below.\n(b)\nExhibits\nEXHIBIT INDEX\nExhibit Number\nExhibit Description\nIncorporated By Reference\nFiled or Furnished Herewith\nForm\nFile No.\nExhibit\nFiling Date\n2.1\nAgreement and Plan of Merger, dated as of January 15, 2024, by and among Synopsys, Inc., ANSYS, Inc. and ALTA Acquisition Corp. \n8-K\n000-19807\n2.1\n1/16/2024\n3.1\nAmended and Restated Certificate of Incorporation\n10-Q\n000-19807\n3.1\n9/15/2003\n3.2\nAmended and Restated Bylaws\n8-K\n000-19807\n3.1\n3/25/2024\n4.1\nDescription of Synopsys' Capital Stock\n10-K\n000-19807\n4.2\n12/15/2020\n10.1\nSixth Amendment Agreement, dated February 13, 2024, by and among Synopsys, as borrower, the lenders party thereto and JPMorgan Chase Bank, N.A., as administrative agent for the lenders.\n8-K\n000-19807\n2.1\n2/14/2024\n108\nTable of Contents\nExhibit Number\nExhibit Description\nIncorporated By Reference\nFiled or Furnished Herewith\nForm\nFile No.\nExhibit\nFiling Date\n10.2\nTerm Loan Facility Credit Agreement, dated February 13, 2024, by and among Synopsys, as borrower, the lenders party thereto, HSBC Securities (USA) Inc., and Bank of America, N.A., as co-syndication agents, Mizuho Bank, LTD., The Bank of Nova Scotia, TD Bank, N.A., Truist Bank, and Wells Fargo Bank, National Association, as co-documentation agents, and JPMorgan Chase Bank, N.A., as administrative agent for the lenders.\n8-K\n000-19807\n2.2\n2/14/2024\n10.3*\n2006 Employee Equity Incentive Plan, as amended\n8-K\n000-19807\n10.1\n4/12/2024\n10.4*\nForm of Restricted Stock Unit Grant Notice and Award Agreement under 2006 Employee Equity Incentive Plan\n8-K\n000-19807\n10.3\n4/14/2023\n10.5*\nForm of Stock Option Grant Notice and Award Agreement under 2006 Employee Equity Incentive Plan\n8-K\n000-19807\n10.4\n4/14/2023\n10.6*\nEmployee Stock Purchase Plan, as amended\n8-K\n000-19807\n10.6\n4/15/2022\n10.7*\n2017 Non-Employee Directors Equity Incentive Plan\n8-K\n000-19807\n10.8\n4/10/2017\n10.8*\nForm of Restricted Stock Grant Notice and Award Agreement under 2017 Non-Employee Directors Equity Incentive Plan\n10-K\n000-19807\n10.9\n12/14/2017\n10.9*\nForm of Stock Options Grant Notice and Option Agreement under 2017 Non-Employee Directors Equity Incentive Plan\n10-K\n000-19807\n10.10\n12/14/2017\n10.10*\nSynopsys Amended and Restated Deferred Compensation Plan II\n10-Q\n000-19807\n10.23\n3/9/2009\n10.11\nForm of Indemnification Agreement for directors and executive officers\n8-K\n000-19807\n99.2\n7/14/2011\n10.12*\nDirector’s and Officer’s Insurance and Company Reimbursement Policy\nS-1\n33-45138\n10.2\n2/24/1992\n(effective date)\n10.13*\nExecutive Incentive Plan, as amended\n10-Q\n000-19807\n10.1\n2/17/2023\n10.14*\nAmended and Restated Executive Change of Control Severance Benefit Plan\n8-K\n000-19807\n10.19\n12/21/2016\n10.15*\nExecutive Severance Benefit and Transition Plan\n8-K\n000-19807\n10.1\n2/9/2021\n109\nTable of Contents\nExhibit Number\nExhibit Description\nIncorporated By Reference\nFiled or Furnished Herewith\nForm\nFile No.\nExhibit\nFiling Date\n10.16*\nOffer Letter, dated November 23, 2022, by and between Synopsys, Inc. and Shelagh Glaser\n8-K\n000-19807\n10.1\n11/29/2022\n10.17*\nEmployment Agreement, dated December 20, 2023 between Synopsys, Inc. and Mr. Sassine Ghazi\n8-K/A\n000-19807\n10.1\n12/21/2023\n10.18*\nExecutive Chairperson Agreement, dated December 20, 2023 between Synopsys, Inc. and Dr. Aart J. de Geus\n8-K/A\n000-19807\n10.2\n12/21/2023\n19.1\nI\nnsi\nder\n Trading Policy\nX\n21.1\nSubsidiaries of Synopsys, Inc.\nX\n23.1\nConsent of KPMG LLP, Independent Registered Public Accounting Firm\nX\n31.1\nCertification of Chief Executive Officer pursuant to Rule 13a-14(a) or Rule 15d-14(a) of the Exchange Act\nX\n31.2\nCertification of Chief Financial Officer pursuant to Rule 13a-14(a) or Rule 15d-14(a) of the Exchange Act\nX\n32.1+\nCertification of Chief Executive Officer and Chief Financial Officer furnished pursuant to Rule 13a-14(b) or Rule 15d-14(b) of the Exchange Act and Section 1350 of Chapter 63 of Title 18 of the United States Code\nX\n97.1\nExecutive Officer Compensation Recovery Policy\n10-K\n000-19807\n97.1\n12/12/2023\n110\nTable of Contents\nExhibit Number\nExhibit Description\nIncorporated By Reference\nFiled or Furnished Herewith\nForm\nFile No.\nExhibit\nFiling Date\n101\nThe following financial statements from the Company’s Annual Report on Form 10-K for the year ended November 2, 2024, formatted in Inline XBRL: (i) Consolidated Balance Sheets as of November 2, 2024 and October 28, 2023, (ii) Consolidated Statements of Income for the Years Ended November 2, 2024, October 28, 2023 and October 29, 2022 (iii) Consolidated Statements of Comprehensive Income for the Years Ended November 2, 2024, October 28, 2023, and October 29, 2022 (iv) Consolidated Statements of Stockholders' Equity for the Years Ended November 2, 2024, October 28, 2023 and October 29, 2022, (v) Consolidated Statements of Cash Flows for the Years Ended November 2, 2024, October 28, 2023 and October 29, 2022 (vi) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags\nX\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*    Indicates a management contract, compensatory plan or arrangement.\n+    This exhibit is furnished with this Annual Report on Form 10-K and is not deemed filed with the Securities and Exchange Commission and is not incorporated by reference in any filing of Synopsys, Inc. under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended, whether made before or after the date hereof and irrespective of any general incorporation language contained in such filing.\n Item 16.     \nForm 10-K Summary\nNone.\n111\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nS\nYNOPSYS\n, I\nNC\n.\nDate:  December 18, 2024\n \nBy:\n \n/s/ S\nHELAGH\n G\nLASER\n \n \nShelagh Glaser\nChief Financial Officer\n(Principal Financial Officer)\n112\nTable of Contents\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nName\n \nTitle\n \nDate\n/\nS\n/    S\nASSINE\n G\nHAZI\n \nPresident, Chief Executive Officer (Principal Executive Officer) and Director\n \nDecember 18, 2024\nSassine Ghazi\n/\nS\n/    S\nHELAGH\n G\nLASER\n \nChief Financial Officer (Principal Financial Officer)\n \nDecember 18, 2024\nShelagh Glaser\n/\nS\n/    S\nUDHINDRA\n K\nANKANWADI\n \nChief Accounting Officer (Principal Accounting Officer)\n \nDecember 18, 2024\nSudhindra Kankanwadi\n/\nS\n/    A\nART \nJ\n.\n \nDE\n G\nEUS\nExecutive Chair of the Board of Directors\nDecember 18, 2024\nAart J. de Geus\n/\nS\n/   L\nUIS\n B\nORGEN\nDirector\nDecember 18, 2024\nLuis Borgen\n/\nS\n/   M\nARC\n C\nASPER\nDirector\nDecember 18, 2024\nMarc Casper\n/\nS\n/     J\nANICE\n D. C\nHAFFIN\n \nDirector\n \nDecember 18, 2024\nJanice D. Chaffin\n/\nS\n/    B\nRUCE\n R. C\nHIZEN\n \nDirector\n \nDecember 18, 2024\nBruce R. Chizen\n/\nS\n/    M\nERCEDES \nJ\nOHNSON\n \nDirector\n \nDecember 18, 2024\nMercedes Johnson\n/\nS\n/    R\nOBERT\n P\nAINTER\n \nDirector\n \nDecember 18, 2024\nRobert Painter\n/s/    J\nEANNINE \nS\nARGENT\n \nDirector\n \nDecember 18, 2024\n Jeannine Sargent\n/\nS\n/    J\nOHN\n G. S\nCHWARZ\n \nDirector\n \nDecember 18, 2024\nJohn G. Schwarz\n/\nS\n/    R\nOY\n V\nALLEE\n \nDirector\n \nDecember 18, 2024\nRoy Vallee\n113"
  }
}