{
  "ticker": "SO",
  "cik": "0000092122",
  "company_name": "SOUTHERN CO",
  "filing_date": "2025-02-20",
  "accession": "0000092122-25-000018",
  "primary_doc": "so-20241231.htm",
  "item_sections": {
    "item1": "Item 1.\n BUSINESS\nSouthern Company is a holding company that owns all of the outstanding common stock of three traditional electric operating companies, Southern Power Company, and Southern Company Gas.\n•\nThe traditional electric operating companies – Alabama Power, Georgia Power, and Mississippi Power – are each operating public utility companies providing electric service to retail customers in three Southeastern states in addition to wholesale customers in the Southeast.\n•\nSouthern Power Company is also an operating public utility company. The term \"Southern Power\" when used herein refers to Southern Power Company and its subsidiaries, while the term \"Southern Power Company\" when used herein refers only to the Southern Power parent company. Southern Power develops, constructs, acquires, owns, operates, and manages power generation assets, including renewable energy projects, and sells electricity at market-based rates in the wholesale market.\n•\nSouthern Company Gas is an energy services holding company whose primary business is the distribution of natural gas in four states – Illinois, Georgia, Virginia, and Tennessee – through the natural gas distribution utilities. Southern Company Gas is also involved in several other businesses that are complementary to the distribution of natural gas.\nSouthern Company also owns SCS, Southern Linc, Southern Holdings, Southern Nuclear, PowerSecure, and other direct and indirect subsidiaries. SCS, the system service company, has contracted with Southern Company, each of the Subsidiary Registrants, Southern Nuclear, SEGCO, and other subsidiaries to furnish, at direct or allocated cost and upon request, the following services: general executive and advisory, general and design engineering, operations, purchasing, accounting, finance, treasury, legal, tax, information technology, marketing, auditing, insurance and pension administration, human resources, systems and procedures, digital wireless communications, cellular tower space, and other services with respect to business and operations, construction management, and Southern Company power pool transactions. Southern Linc provides digital wireless communications for use by Southern Company and its subsidiary companies and also markets these services to the public and provides fiber optics services through its subsidiary, Southern Telecom, Inc. Southern Linc's system covers approximately 122,000 square miles in the Southeast. Southern Holdings is an intermediate holding company subsidiary, which invests in various projects. Southern Nuclear operates and provides services to the Southern Company system's nuclear power plants. PowerSecure develops distributed energy and resilience solutions and deploys microgrids for commercial, industrial, governmental, and utility customers.\nSee \"The Southern Company System\" herein for additional information. Also see Note 15 to the financial statements in Item 8 herein for information regarding recent acquisition and disposition activity. Segment information for the Registrants is included in Note 16 to the financial statements in Item 8 herein. Alabama Power, Georgia Power, and Mississippi Power each operate with one reportable business segment, since substantially all of their business is providing electric service to customers. Southern Power also operates its business with one reportable business segment, the sale of electricity in the competitive wholesale market.\nThe Registrants' Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to those reports are made available on Southern Company's website, free of charge, as soon as reasonably practicable after such material is electronically filed with or furnished to the SEC. Southern Company's internet address is www.southerncompany.com.\nThe Southern Company System\nTraditional Electric Operating Companies\nThe traditional electric operating companies are vertically integrated utilities that own generation, transmission, and distribution facilities. See PROPERTIES in"
  }
}