{
  "ticker": "SOLV",
  "cik": "0001964738",
  "company_name": "Solventum Corp",
  "filing_date": "2025-02-28",
  "accession": "0001964738-25-000019",
  "primary_doc": "solv-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business\nSolventum Corporation (“Solventum,\n”\n or the “Company\n”\n), is a leading global healthcare company developing, manufacturing, and commercializing a broad portfolio of solutions that leverages deep material science, data science, and digital capabilities to address critical customer and patient needs. We constantly seek to enable the improvement of standards of care and move healthcare forward with innovation powered by insights, clinical intelligence, technology, and manufacturing expertise. Our 70+ year history of discovering and innovating advanced solutions has helped us solve our customers’ toughest challenges. \nOur solutions are relied on every day within the global healthcare industry to deliver higher-quality patient care, more efficient processes and workflows, and improved standards of safety and accuracy. Additionally, our products and services are present along a patient’s journey through prevention, diagnosis, treatment, and recovery. \nOur business possesses strong customer relationships, a broad, wide-ranging, and well-known portfolio of brands, differentiated technology, and manufacturing expertise. We serve a diverse customer base, ranging from multidisciplinary hospitals and local clinics/practices to biopharmaceutical manufacturers. Our long-tenured and collaborative customer relationships globally give us unique insights into their needs and preferences. These insights inform our innovation processes, drive stronger customer retention, and create multiple avenues for further customer engagement. \nBusiness Segments\nWe are organized into four operating business segments that are aligned with the markets we serve.\nMedSurg (56.2% of 2024 total sales)\n is a provider of solutions including negative pressure wound therapy, advanced wound dressings, advanced skin care, I.V. site management, sterilization assurance, temperature management, surgical supplies, medical tapes and wraps, stethoscopes, medical electrodes, and medical technologies Original Equipment Manufacturer (“OEM\n”)\n. These solutions are designed to accelerate healing, prevent complications, and lower the total cost of care. Additionally, our comprehensive range of surgical solutions are designed to mitigate a patient’s risk of infection or complications.\nDental Solutions (15.7% of 2024 total sales)\n is a provider of a comprehensive suite of dental and orthodontic products including brackets, aligners, restorative cements, and bonding agents that span the “life of the tooth,” including products designed for preventative dental care, direct and indirect restoration, and broad orthodontic needs.\nHealth Information Systems (15.8% of 2024 total sales)\n provides healthcare systems with software solutions – including computer-assisted physician documentation, direct-to-bill and coding automation, classification methodologies, speech recognition, and data visualization platforms – that are designed to eliminate revenue cycle waste, create more time for patient care, and support value-based care. These solutions are designed to ensure accuracy of reimbursement and reduce the administrative burden that clinicians face.\nPurification and Filtration (11.6% of 2024 total sales) \nis a provider of purification and filtration technologies including filters, purifiers, cartridges, and membranes. These solutions are designed to simplify purification processes, reduce debris and bioburden in fluids, and remove contaminants to enable the development and manufacturing of biopharmaceutical and medical technology treatments and provide cleaner water.\nAcquisitions\nAs part of our business strategy, Solventum intends to monitor its business portfolio and organizational structure and may make acquisitions that expand or enhance its organizational structure. \nResearch and Development Activities\nOur Research and Development (“R&D\n”\n) activities are focused on developing new solutions that are clinically supported and differentiated as well as improving on our marketed solutions to address evolving customer needs and enable better outcomes and access for patients. Our R&D capabilities include R&D organizations that operate within each of our business segments, as well as R&D capabilities spanning across our business segments.\nOur business segment R&D organizations are responsible for the full product development life cycle, leveraging industry insights, domain-specific expertise in end-to-end product development, and a detailed understanding of customer applications \n6\nTable of\n \nContents\nand usability to innovate in both new and marketed products. Our cross-segment capabilities include building new shared technologies and advancing existing shared technologies. We believe that collaboration across our organization further enhances our R&D capabilities by encouraging the sharing of best practices, enabling collaborative development and issue resolution, promoting synergies in development and manufacturing, and creating a broad culture of exploration.\nOur R&D team consists of approximately 2,000 employees, including research scientists, chemical engineers, data scientists, software engineers, application development engineers and product developers. They are supported by a team of accomplished clinicians from our medical affairs group. We partner with our medical affairs group to enhance our clinical insight and expand awareness of clinical studies regarding our solutions by increasing both the number of peer-reviewed publications and the visibility for existing publications that address our solutions.\nIntellectual Property\nDevelopment and protection of our proprietary technologies through IP rights is a strategic priority for our business. To protect our proprietary technologies, Solventum relies on a combination of patent, design, utility model, trademark, copyright, and trade secret protections as well as regulatory exclusivity periods and confidentiality agreements. Our IP team collaborates with our R&D and product teams to develop product line focused IP strategies and secure IP rights as appropriate. We generally file patent applications in the United States and foreign countries that have strong technology patent protections. We also license from third parties IP that complements our internal R&D efforts and product offerings. While, in aggregate, our patents and other IP are vital to our operations, we do not consider any single IP asset or group of assets to be of material importance to any segment or to the business as a whole; rather, we believe understanding our customers’ needs, technology expertise, and manufacturing know-how are critical for our business.\nCompetitors\nWe operate in highly competitive markets across our segments and product categories throughout the world. Our ability to compete effectively is contingent upon several factors, including but not limited to our ability to deliver differentiated clinical and economic outcomes for our customers.\nIn the MedSurg segment, our advanced wound care market is highly competitive, particularly in the United States and Europe, with our principal competitors including Smith & Nephew, Medela, Mölnlycke, Coloplast, and Convatec. Our infection prevention and surgical supplies solutions are offered in highly competitive and fragmented end markets, especially in the United States and Europe. Our principal competitors in this segment include Becton Dickinson, Hartmann, ICU Medical, Medline, Cardinal Health, Fortive, Steris, MDF Instruments, and BSN. \nThe dental market is highly competitive, with players ranging from very large broad-based multinational companies to localized or specialized suppliers and start-ups. Principal multinational competitors within the oral care market include Dentsply Sirona, Envista, and Straumann, all of which compete with both dental and orthodontic solutions, and Ivoclar, which competes with only dental solution offerings, and Align Technology, which competes with only orthodontic solution offerings. \nThe health care software technology market in which we conduct our business, and the healthcare information technology (“HCIT\n”\n) industry in general, is highly competitive and dynamic, characterized by the continual introduction of new products and technologies. Principal competitors include Optum, Microsoft (Nuance), Epic, Cerner, Athena, and a host of start-up technologies actively working to disrupt the areas of revenue cycle management and clinician productivity. In the United States, the market for value-based care software solutions is highly fragmented and subject to continuous entry of new competitors. The market is even more fragmented internationally. Outside the U.S., we compete primarily with local players in the respective country or region, in addition to new market entrants. \nThe Purification and Filtration segment competes against a diverse spectrum of competitors. Established global filtration competitors such as Danaher, Merck KGaA, Sartorius, Pentair, Repligen, and Entegris compete on a variety of factors across product lines, including breadth of offering, product performance, customer service, product availability, distribution capabilities, innovation, name recognition and price. \nHuman Capital\nWe have a long-tenured and diverse talent base with significant work experience, technical qualifications, and healthcare industry expertise. Our employee base consists of approximately 22,000 employees, with approximately 40% having more than 10 years of tenure. We have approximately 11,000 employees in the United States and approximately 2,600 in Germany. Of our employees, approximately 5,200 are production employees working in plants across the globe. We have approximately 80 employees who are represented by a union in the U.S., all of whom are in one manufacturing facility and are covered by a three-year collective bargaining agreement that expires on November 1, 2027. Our relationship with employee-representative \n7\nTable of\n \nContents\norganizations outside the U.S. takes many forms, including in European Union countries where we engage with representative bodies for employees, such as employee forums, works councils and trade unions, in accordance with local law.\nOur employees are united in our mission to provide better, smarter, safer healthcare to improve lives.  Our culture highlights collaboration and teamwork, along with a focus on empathy, solving challenges and improving care.\nThe ability to recruit, retain, develop, protect, and fairly compensate our global workforce will be a key driver of our success. Our key human capital priorities are designed to support those efforts, including those listed below.\n•\nHealth and Safety\n: Solventum is committed to the safety, health, and well-being of its employees. We continuously evaluate opportunities to raise safety and health standards, visiting sites to identify and manage environmental health and safety risks; evaluating compliance with regulatory requirements and company policies; and maintaining a global security operation for the protection of facilities and people on our sites. We also promote health and well-being through disease prevention programs, on-site clinical services, employee assistance programs, and comprehensive healthcare benefits.\n•\nDevelopment and Pipeline\n: We have a robust, continuous talent review process focused on succession planning and key talent development. We deploy functional and leadership development opportunities and support time to learn. In addition, we advance our talent pipeline by attracting competitive talent and accelerating leadership and key skill development. We are expanding our external talent pools and leveraging university and professional organizations to identify talent with critical skills.\n•\n \nWorkplace Environment\n: Our ability to evolve as a highly preferred organization who serves the needs of our employees and contributes to customer success is realized by enabling a workplace and environment which fosters belonging. In support of the communities we operate in globally, we are committed to inclusion in its broadest sense. We strengthen our commitment by ensuring accessible and fair processes for all. Whether we are attracting or advancing talent, we focus on conveying our intent for leaders and employees to thrive. Engaging talent such as those who are involved in our Employee Resource Networks, which are open to everyone, has proven to be a way to empower and inspire our workforce as they drive innovation in unique ways.\n•\nCompensation and Benefits\n: Our total compensation for employees includes a variety of components that support sustainable employment and the ability to build a strong financial future, including competitive market-based pay and comprehensive benefits. In addition, we have a professional and flexible work environment that promotes innovation and well-being and rewards performance. \nEnvironmental, Health, and Safety Matters\nWe are subject to various laws, regulations, ordinances, customer requirements, and industry standards related to environment, health, and safety (\n“\nEHS\n”\n) matters. These include, but are not limited to, permitting, licensing, and authorization requirements, and regulatory obligations. These laws, regulations, ordinances, requirements and standards affect a significant portion of our activities globally across each of our segments and product lines and require compliance related to, among other things: (a) occupational health, safety, and well-being; (b) the protection of the environment; (c) emissions and discharges to air and water; (d) greenhouse gas management and climate change; (e) the use of natural resources; (f) the handling, use, storage, transportation, and disposal of toxic or hazardous materials, radioactive materials, and solid and hazardous wastes; and (g) the procurement and use of select materials and chemicals. EHS laws and regulations also vary widely by jurisdiction, may be established at supranational, international, national, state, and/or local levels, and are constantly evolving, often to become more stringent. \nCompliance with EHS laws, regulations, customer requirements, and industry standards requires, among other things, that we maintain and operate our equipment safely; obtain and keep current environmental permits, radioactive material licenses, and radiation machine registrations; install pollution control technologies; and maintain certain records and submit specific reports. Failure to comply could lead to enforcement actions, such as the imposition of civil or criminal fines and penalties; the suspension or termination of our permits, licenses, authorizations, or operations; claims by third parties; remediation expenses or liabilities; or other sanctions. \nSolventum also is subject to extensive and evolving regulations regarding the manufacturing, processing, distribution, importing, exporting, and labeling of its products and their raw materials. In the European Union, for instance, the Registration, Evaluation, Authorisation and Restriction of Chemicals (REACH) regulations came into effect in 2007, with implementation rolling out over time. Registered chemicals then can be subject to further evaluation and potential restrictions. Since the promulgation of REACH, other countries have enacted or are in the process of implementing similar comprehensive chemical regulations.\n8\nTable of\n \nContents\nSome of Solventum’s products utilize third-party purchased components that contain PFAS. Use is critically evaluated on an on-going basis, and non-PFAS alternatives are utilized, when possible. Regulatory and legislative activities concerning PFAS are accelerating in the United States, Europe and elsewhere. These regulatory activities include gathering of exposure and use information, risk assessment activities, and increasingly strict restrictions on various uses of PFAS in products and on PFAS in manufacturing emissions and in water, soil and air, in some cases moving towards setting non-detectable limits for certain PFAS compounds.  Governments, including in the United States, are also increasingly proposing changes to existing environmental regulations to specifically apply to PFAS.  In February 2023, the European Chemicals Agency published a proposal under REACH, which has not yet been finalized, that aims to restrict the manufacture, placing on the market and use of PFAS, subject to certain exceptions. \nSolventum’s operations are also subject to regulation under the federal Occupational Safety and Health Act (“OSHA\n”\n) and parallel state and local occupational health and safety standards, as well as occupational health and safety standards applicable to its operations in other jurisdictions. These standards establish certain employer responsibilities, including requirements to maintain a workplace free of recognized hazards likely to cause serious injury or death, certain medical and hygiene standards, licensing and permitting obligations and various recordkeeping, disclosure and procedural requirements. Solventum’s facilities and operations may be subject to periodic inspections by OSHA representatives and comparable authorities in other jurisdictions. Failure to comply with applicable occupational health and safety standards, even if no work-related serious injury or death occurs, could result in civil or criminal enforcement and substantial penalties, significant capital expenditures or suspension or limitation of Solventum’s operations.\nIn addition to REACH and OSHA, Solventum manufacturing facilities are also subject to additional environmental, health and safety statutes, regulations and permit requirements, including, but not limited to, applicable requirements under the Clean Air Act, the Clean Water Act, the Resource Conservation and Recovery Act, the Seveso-III Directive (Directive 2012/18/EU), the European Machinery Directive (Directive 2006/42/EC), the EU Industrial Emissions Directive (Directive 2010/75/EU), and the European Pollutant Release and Transfer Register.\nSales and Marketing\nWe have an extensive global commercial footprint with sales in over 90 countries. To serve our diverse customer base across our prioritized geographies, we take a multi-model commercial approach, including direct-to-customer, distribution, key account management, inside sales, and e-commerce. We augment our commercial model with both marketing and service support. Key marketing activities include brand management, insights, price management, digital marketing, and integrated marketing communications. As our customers increasingly leverage both traditional and digital media in their path to purchase, we continue to optimize our own omnichannel execution to ensure the best customer experience possible. Our service support teams include clinical specialists (licensed nurses or technicians), medical liaisons (clinical professionals such as surgeons and dentists), and application engineers (technical subject matter experts). These teams provide high-quality customer support serving as the clinical and/or technical expert for the customer. \nTo expand our market coverage into emerging geographies in the Latin America (\"LATAM\"), Europe, Middle East and Africa (\"EMEA\"), and Asia regions, we employ an export commercial model and leverage local partners to market and sell our products. Our local third-party partners facilitate regulatory and cross-border import compliance and distribute directly to the customer. Our export commercial team provides technical, clinical, and marketing support both directly to our customers as well as to our third-party partners, to help increase customer satisfaction and support our ability to grow our global presence.\nGlobal Supply Chain and Sourcing\nOur sourcing, production, and distribution network is managed globally. We believe we have advanced manufacturing and assembly production capabilities across our global manufacturing network. Our manufacturing is supported by a global distribution network. \nOur distribution network is strategically designed as a “hub and spoke” model. \nThis approach optimizes route planning and increases the speed of deliveries to our customers in all regions. In addition, our distribution network footprint meets the needs of our customers in a cost-effective model.\nAs we separate from 3M, we continue to leverage 3M's distribution networks and manufacturing sites across certain geographies. The use of both distribution network and manufacturing sites are covered under a Transition and Distribution Agreement and a Transition Contract Manufacturing Agreement, respectively, with 3M.\nOur supply chain resiliency program consisting of regional sources of supply, dual-source manufacturing capabilities and vertically integrated operations presents a competitive advantage by providing a reliable supply of products to our customers.\n9\nTable of\n \nContents\nRegulations\nGeneral \nThe regulations applicable to Solventum are promulgated and enforced by government bodies in individual countries and govern the methods and controls used for the design, manufacture, packaging labeling, storage, safety, sales and distribution, marketing clearance or approval, advertising and promotion, sterilization, installation, servicing, performance and effectiveness of the products Solventum sells globally. These regulations apply to all facilities of Solventum’s business that conduct the foregoing activities, regardless of where the facilities are located. These regulations apply to the activities performed by most of Solventum’s employees, including but not limited to sales and marketing, research and development, regulatory affairs, quality assurance, medical affairs, and operations, both before and after a product is commercially distributed. These regulations differ by country and/or region and are dynamic. \nSolventum commits a significant amount of resources to maintain compliance with these regulations. Compliance with these regulations requires Solventum to create systems, processes, and procedures that are aligned with the regulations in all markets Solventum serves. Compliance also requires Solventum to maintain knowledge of the current regulations that govern its activities. As these regulations change, Solventum must adapt its systems, processes, and procedures to comply with the new regulations. \nGoverning bodies monitor compliance, among other ways, by conducting regularly occurring and unexpected audits of Solventum’s facilities. These audits are conducted to determine if Solventum’s systems, processes, and procedures comply with the current regulations in the markets it serves. After each audit, the governing body typically provides a report of their findings. The report describes the observations made during the audit. Sometimes these observations describe minor non-compliance issues in Solventum’s systems, processes, and procedures. Often, these gaps require commensurate modifications but have no impact to Solventum’s ability to continue operations and commercialization of its products. In rare situations, the governing body may find significant or major non-compliance issues in Solventum’s systems, processes, and procedures. If a governing body concludes, through these audits or otherwise, that Solventum is not in compliance with applicable laws or regulations or that any of its products are defective, ineffective, or pose an unreasonable risk for patients, users, or others, the governing body may require Solventum to recall a product or products, retract promotional materials, and/or cease shipment of products, among other required actions; these requirements may remain in place until Solventum can demonstrate adequate compliance. Failure to demonstrate adequate modifications to Solventum’s systems, processes, and procedures and continued compliance or repeat findings may result in more significant enforcement actions, including but not limited to warning letters, revocation of product approvals and licenses, injunctions, product seizure, penalties and fines, consent decrees, and criminal prosecution, among other actions. These actions may have a negative impact on Solventum’s consolidated results of operations, financial condition or competitive position. \nAs discussed in more detail below under “Regulation of Medical Devices and Pharmaceutical Products,” to market its products internationally in compliance with applicable medical device and pharmaceutical regulations, Solventum must obtain approvals for products and product modifications. The regulations promulgated by the governing bodies also require Solventum to submit data to demonstrate that its products meet the safety and effectiveness requirements to support the intended uses described in its labeling. This data is reviewed by the governing bodies to determine if Solventum has provided the necessary and sufficient information to demonstrate the safety and effectiveness of its products for the intended use described in its labeling. In many cases, the governing bodies request additional information to make this determination. The additional information requested by the governing bodies sometimes requires Solventum to conduct new testing, delaying the approval and commercialization of the product. In rare instances, the governing body will disapprove the application, prohibiting Solventum’s ability to commercialize the product in that market. In these instances, Solventum may decide to cease commercialization efforts for the product in that (or those) market(s) or it may decide to modify the product or retest the products and resubmit the data to the governing bodies. Delays to product approvals or disapproval of Solventum’s applications may have a negative impact on Solventum’s consolidated results of operations, financial condition or competitive position.\nFailure to establish, follow or comply with any of the above requirements could have a negative impact on Solventum’s consolidated results of operations, financial condition or competitive position. \nThis global regulatory environment will likely continue to evolve, which could impact Solventum’s ability, or increase the time and cost, to obtain future approvals for its products. The process of obtaining regulatory clearances and/or approvals to market and sell Solventum’s products can be rigorous, costly and time-consuming and the clearances and/or approvals might not be granted timely or result in limitations on the indicated uses of products. \n10\nTable of\n \nContents\nRegulation of Medical Devices and Pharmaceutical Products\nThe products Solventum develops, manufactures, and commercializes are regulated in most of the markets Solventum serves. Some of these products meet the definition of medical devices or pharmaceuticals and are regulated, as such, by various governmental bodies, globally. All products produced by the MedSurg and Dental Solutions segments, with very few exceptions, meet the definition of a medical device or pharmaceutical product. Accordingly, the development, manufacture, and commercialization of these products must comply with the regulations governing medical devices or pharmaceuticals in the markets we serve. Conversely, none of the products produced by the Health Information Systems and Purification and Filtration segments meet the definition of medical devices or pharmaceuticals. The product portfolio of each segment is dynamic and changes with time, depending on the needs of the customers served. While the Health Information Systems and Purification and Filtration segments do not currently include medical devices or pharmaceutical products, this may change in the future. \nDeterminations of the safety and efficacy of our products are solely within the authority of the FDA or other applicable regulatory authorities in jurisdictions outside the United States.\nAdditionally, 3M™ Promogran™ Collagen Dressing and 3M™ Tegaderm™ CHG Chlorhexidine Gluconate IV Securement Dressing, which are products of the MedSurg segment, are regulated by the FDA’s Center for Device and Radiological Health as a combination product category.\nUnited States\nIn the United States, the Food, Drug, and Cosmetic Act (“FDA”) authorizes the FDA to oversee and regulate the production, sale, and distribution of food, drugs, medical devices, and cosmetics. \nMedical Devices\nSolventum’s medical devices are regulated by the FDA’s Center for Devices and Radiological Health. The FDA classifies medical devices into one of three classes depending on the degree of risk associated with the medical device and the extent of manufacturer and regulatory control needed to ensure its safety and effectiveness: Class I (Low Risk), Class II (Moderate Risk), and Class III (High Risk). \n•\nClass I: Class I medical devices are those where the General Controls for Medical Devices are sufficient to provide a reasonable assurance of safety and effectiveness.\n•\nClass II: Class II medical devices are where the General Controls for Medical Devices alone are insufficient to provide reasonable assurance of its safety and effectiveness and there is sufficient information to establish special controls, including the promulgation of performance standards, post-market surveillance, patient registries, development and dissemination of guidelines, recommendations, and other appropriate actions as the FDA Commissioner deems necessary to provide such assurance.\n•\nClass III: Class III medical devices are intended to be used in supporting or sustaining human life or preventing impairment of human health, or that may present a potential unreasonable risk of illness or injury for which the General Controls for Medical Devices and special controls are insufficient to provide reasonable assurance of the safety and effectiveness of a device, or for which there is insufficient information to make such a determination. Class III devices typically require pre-market approval. \nMost medical devices are cleared by FDA through the \nPre-Market Notification, or 510(k), process. This process requires medical device manufacturers \nto \ndemonstrate that their devices are as safe and effective as (i.e., substantially equivalent to) a legally marketed medical device. Pre-market notifications are required for most Class II and some Class I medical devices. Due to the level of risk associated with Class III devices, the FDA has determined that these devices require a Pre-market approval (a “PMA”). A PMA application is the most stringent type of marketing application required by the FDA. Typically, PMA submissions require the submission of human clinical trials to achieve FDA approval. Currently, none of the medical devices in Solventum’s portfolio of products are Class III medical devices in the United States. \nPharmaceutical Products\nSolventum’s pharmaceutical products are regulated by the FDA’s Center for Drug Evaluation and Research. Generally, drugs are brought to the market through the New Drug Application (“NDA”) process or an Over-the-Counter (“OTC”) Monograph. Solventum’s pharmaceutical products are brought to market through the NDA and OTC pathways. \nThe NDA process typically begins with the completion of extensive preclinical laboratory tests and preclinical animal studies, which may need to be performed in accordance with the Good Laboratory Practices regulations, followed by the submission to \n11\nTable of\n \nContents\nthe FDA of an investigational new drug application which must become effective before human clinical trials may begin and must be updated annually. \nBefore each clinical study may be initiated, an independent Institutional Review Board or ethics committee representing each clinical site must approve such study. The clinical studies must be adequate, well-controlled and conducted in accordance with Good Clinical Practice (“GCP”) requirements.\n \nAfter the completion of the clinical trials, an \nNDA is submitted to the FDA to demonstrate that a drug is safe and effective in its proposed use(s), the benefits of the drug outweigh the risks, the drug’s proposed labeling (package insert) is appropriate, and the methods used to manufacture the drug are adequate to preserve the drug’s identity, strength, quality, and purity. Following the completion of the clinical trials, the NDA process with the FDA generally involves the following:\n•\npreparation of and submission to the FDA of an NDA;\n•\npotential review of the product application by an FDA advisory committee, where appropriate and if applicable;\n•\na determination by the FDA within 60 days of its receipt of an NDA to file the application for review;\n•\nsatisfactory completion of an FDA pre-approval inspection of the manufacturing facilities where the proposed product drug substance and drug product are produced to assess compliance with current Good Manufacturing Processes (“cGMP”), and audits of selected clinical trial sites to ensure compliance with GCP; and\n•\nFDA review and approval of an NDA prior to any commercial marketing or sale of the drug or biologic in the United States.\nA\nn OTC drug monograph is a type of “recipe book” covering acceptable ingredients, doses, formulations, labeling, and, in some cases, testing parameters. OTC drug monographs are continually updated to add additional ingredients and labeling as needed. Products conforming to a monograph may be marketed without FDA pre-approval. Under the OTC monograph system, selected OTC drugs are generally recognized as safe and effective and do not require the submission and approval of an NDA. The FDA OTC monographs include well-known ingredients and specific requirements for permitted indications, required warnings and precautions, allowable combinations of ingredients and dosage levels. Pharmaceutical products marketed under the OTC monograph system must conform to specific quality, formula and labeling requirements. Facilities where OTC drugs are manufactured, tested, packaged, stored or distributed must comply with cGMP regulations and/or regulations promulgated by the FDA or other competent authorities. OTC monograph products that do not comply with these standards can be deemed unapproved new drugs and can be required to be withdrawn from the market. The Over-the-Counter Monograph Safety, Innovation, and Reform Act, enacted in March 2020, is expected to introduce significant reform to the OTC monograph system, including by replacing the FDA’s existing rulemaking process with an administrative order process for issuing, revising and amending OTC monographs.\nEuropean Union\nMedical Devices\nAll medical devices that are placed on the market or put into service in the European Union must meet the requirements of the Medical Device Regulation. Manufacturers must demonstrate compliance to the requirements of the Medical Device Regulation, prior to affixing the CE Mark on the products and commercializing in the European Union. A CE Mark is a symbol placed on a product that declares that the product is compliant with the essential requirements of applicable health, safety and environmental protection regulation. Compliance to the Medical Device Regulation requires a manufacturer to \ndemonstrate that its products comply with minimum standards of performance, safety, and quality, through a conformity assessment procedure that depends on the product’s classification. The \nMedical Device Regulation\n describes four classes of medical devices: Class I (Lowest Risk), Class IIa, Class IIb, and Class III (Highest Risk). Classification is dependent on a variety of factors, including duration of use, whether the device is invasive or non-invasive, and whether the device is considered “active.” Notified bodies are responsible for ensuring that manufacturers comply with the requirements of the Medical Device Regulation. All medical devices in Solventum’s current portfolio are regulated as medical devices in the European Union. \nPharmaceutical Products\nThe European Medicines Agency is responsible for regulating pharmaceutical products in the European Union. The European Medicines Agency implements a system similar to the U.S. FDA’s Center for Drug Evaluation and Research and it is responsible for evaluating the quality, safety, and efficacy of drug products in the EU. If the European Medical Agency concludes that all requirements for efficacy, safety and quality are met, it issues a positive opinion that is forwarded to the European Commission and the European Commission makes the final decision on the granting of a marketing authorization. \n12\nTable of\n \nContents\nChina \nThe chief pharmaceutical product and medical device regulator in China is the National Medical Products Administration (“NMPA”), which enforces medical device and pharmaceutical product laws and regulations and standards and has the power to issue fines, seize products, withdraw or suspend an approval or a registration for serious non-compliances, and refer cases for criminal prosecution. These national laws and regulations are also supplemented by provincial and other local-level rules and enforcement policies.\nMedical Devices\nLocally manufactured medical devices gain market authorization through municipal authorities, while medical devices that are not manufactured in China are reviewed by the NMPA and must be accompanied by appropriate documentation showing that the device has been approved in its country of origin. \nMedical devices are classified into three classes: Class I (Lowest Risk), Class II, and Class III (Highest Risk). Approved products are subject to post-market requirements for reporting adverse events and recalls, as well as regular risk assessments of devices and potentially re-evaluation reports of the safety and effectiveness of the device based on more significant safety signals.\nIn addition to product licenses, manufacturing and distribution facilities that handle Class II and III devices require licenses or notifications and must comply with cGMP requirements and good supply practices. The NMPA regularly conducts inspections of manufacturing facilities in China (as part of a pre-market submission review, routine or for-cause inspections, or unannounced inspections) as well as periodic inspections of overseas manufacturers for compliance with China medical device cGMP requirements. The NMPA inspects distributors and user facilities and conducts annual national and provincial sampling inspections and testing to ensure compliance with labeling, licensing, mandatory standards, and other related requirements. In addition, the NMPA conducts regular and for-cause good clinical practice audits of clinical sites that provide data and clinical trial reports for product registration.\nPharmaceutical Products\nSolventum’s pharmaceutical products are strictly regulated by the NMPA and various provincial, city, and county regulators. Some of Solventum’s pharmaceutical products require pre-market approval from the NMPA before they can be marketed in China, and those marketing applications must be supported by clinical data, which typically comes from a multi-phase study in China or by relying on clinical data generated abroad that meets the NMPA’s requirements.\nRegulation on Advertising, Marketing, and Promotion\nThe advertising, marketing, and promotion of Solventum’s products must be truthful and non-misleading, consistent with applicable regulatory clearances and approvals, and supported by adequate and reasonable scientific data. Solventum typically is required to have a reasonable basis to support any factual marketing claims, and what constitutes a reasonable basis for substantiation can vary widely from market to market and from product to product. \nWith limited exceptions, Solventum may not market, promote, or sell regulated products prior to regulatory authority clearance or approval. Regulatory authorities, including the FDA, strictly regulate the indications for use and associated promotional safety and effectiveness claims that may be made about approved or cleared products. If regulatory authorities determine that Solventum has promoted or marketed a product for off-label use, including through external-facing materials, oral statements, or physician training, Solventum could be subject to fines, injunctions or other penalties. \nIn addition, the National Advertising Division (“NAD”) of the Better Business Bureau administers a self-regulatory program of the advertising industry to ensure truth and accuracy in national advertising. NAD monitors national advertising and entertains inquiries and challenges from competitors and consumers. Solventum may also be subject to various state consumer protection laws, including California’s Proposition 65, which requires a specific warning on any product that contains a substance listed by California as having been found to cause cancer or birth defects, unless the level of such substance in the product is below a safe harbor level.\nSolventum must also comply with advertising, marketing, and promotion rules in all countries in which it markets its products\n.\n In the European Union, advertising of products is subject both to general consumer advertising requirements pursuant to the Unfair Commercial Practices Directive (Directive 2005/29/EC), which imposes a general prohibition on misleading and aggressive advertising, as well as more specific regulations in respect of various product classifications. For example, pursuant to Directive 2001/83/EC, advertisements of Solventum’s OTC products must, among other requirements, (1) make clear that the message is an advertisement and that the product is clearly identified as a medicinal product, (2) not refer to claims of \n13\nTable of\n \nContents\nrecovery in improper, alarming or misleading terms and (3) not suggest that the effects of taking the medicine are guaranteed, are unaccompanied by adverse reactions or are better than, or equivalent to, those of another treatment or medicinal product. \nIn China, advertisements of OTC products must, among other requirements, include an “OTC” marking and must not contain difficult or confusing medical or pharmaceutical terms that could mislead the public about a product’s efficacy or safety.\nA failure to comply with these regulations could expose Solventum to legal liability, such as enforcement actions, investigations by a governmental authority, civil fines or criminal actions, lawsuits brought by competitors or company whistleblowers, or other actions. \nData Privacy Laws\nSolventum is also subject to extensive laws and regulations protecting the privacy, security, and integrity of personal information, including patient medical information, that it receives, including, among others, the U.S. Health Insurance Portability and Accountability Act of 1996, as amended, (the “HIPAA”), the California Consumer Privacy Act (the “CCPA”), and similar U.S. state laws, the European Union’s General Data Protection Regulation (the “E.U. GDPR”), the United Kingdom’s Data Protection Act 2018 (the “UK DPA”) and the General Data Protection Regulation (the “U.K. GDPR”), and China’s Personal Information Protection Law (“PIPL”), and Personal Data Cross Border Transfer Rule (“CBDT”). Federal health information privacy laws, such as HIPAA, and consumer protection laws impose requirements for the collection, use, storage, access, transfer and protection of health-related and other sensitive and personal information, and failure to comply may result, such as with respect to any CCPA violations, in civil penalties. The CCPA has been amended by the California Privacy Rights Act (“CPRA”), which came into effect, in most material respects, on January 1, 2023. The CPRA significantly modifies the CCPA, including by expanding consumers’ rights with respect to certain sensitive personal information. The E.U. GDPR and the U.K. GDPR and UK DPA, together with national legislation, regulations and guidelines of the E.U. Member States and the United Kingdom governing the processing of personal data, impose strict obligations and restrictions on the ability to collect, analyze, store, transfer and otherwise process personal data, including health data and adverse event reporting. The E.U. GDPR contemplates fines for certain violations of up to four percent of global annual revenue or €20 million (or GBP 17.5 million under the U.K. GDPR), whichever is greater, and enforcement can include limits on data transfers to countries outside the E.U. or U.K. In China, Solventum is subject to PIPL, which applies to the secure processing of personal information of natural persons within China, and Solventum is also subject to CBDT for the processing of personal information outside China where the purpose is to provide products and services within China and the analysis or assessment of the activities of individuals within China. Consequences of non-compliance may include monetary fines of up to five percent of the previous year’s revenue, termination of data transfers and personal liability imposed on those directly responsible. Solventum is also subject to similar privacy and data protection frameworks in other developed and emerging markets. While Solventum utilizes industry standard processes, including the National Institute of Standards and Technology (the “NIST”) privacy framework and third-party management processes, to assess the potential impact of emerging laws and enforcement trends on its business and to mitigate potential impacts on its business, data privacy laws and regulations and their scope and enforcement are constantly evolving, and Solventum cannot predict what effect, if any, changes to these laws and regulations and Solventum’s compliance with them may have on its business. \nGlobal Healthcare Compliance\nThe marketing, promotion, and sale of medical devices, drugs, and services is regulated by the U.S. Department of Health and Human Services and equivalent U.S. state and non-U.S. agencies responsible for reimbursement and regulation of the delivery of healthcare items and services. These include laws and regulations related to kickbacks, false claims, self-referrals, and healthcare fraud and abuse. Similar regulations are imposed at the state level, as well as in many global markets in which we do business. \nThe U.S. FCPA, the U.K. Bribery Act of 2010, and similar anti-corruption and anti-bribery laws in other jurisdictions generally prohibit companies from promising to pay money or anything of value to any foreign official for the purpose of obtaining or retaining business. These laws apply to many of Solventum’s customer interactions, as healthcare professionals in other countries are or are often considered government officials, and in some cases lay out specific requirements of how to comply or demonstrate compliance with the legal requirements. Failure to comply with these laws may expose Solventum to monetary fines and penalties, criminal and civil enforcement actions and reputational damage. \nQuality and Safety\nThe FDA and comparable authorities in other jurisdictions regulate the facilities and operational procedures that Solventum uses to manufacture its products. Solventum is required to register its facilities with these authorities. Solventum’s products are required to be manufactured in facilities that operate in accordance with current cGMPs. Compliance with cGMPs requires Solventum to establish and follow quality systems that are designed to ensure that its products consistently meet applicable requirements and specifications. The scope of cGMP includes, but is not limited to, production and process controls, document \n14\nTable of\n \nContents\ncontrols, acceptance activities, labeling and packing controls, handling, storage, distribution, and installation activities, among others. The FDA and comparable authorities in other jurisdictions periodically inspect Solventum’s manufacturing facilities for compliance with cGMP or similar manufacturing standards in the applicable country. Failure to comply with cGMPs could disrupt Solventum’s ability to manufacture or supply its products.\nSolventum is also required to establish and follow quality systems to comply with certain post-market surveillance requirements, specifically those pertaining to adverse event reporting for medical devices and pharmaceuticals. For medical devices, Solventum is required to report deaths and serious injuries that a device may have caused or to which a device may have contributed. Solventum is also required to report certain device malfunctions. For pharmaceuticals, Solventum is required to report any undesirable event that is associated with the use of a drug or biological product in humans whether or not the events are considered to be product related. For both medical devices and pharmaceuticals, Solventum is required to establish and implement quality systems to comply with regulations pertaining to post-market surveillance.\nIn addition, many of Solventum’s products are subject to regulation by the Consumer Product Safety Commission (the “CPSC”) under the Consumer Product Safety Act and other laws enforced by the CPSC. These statutes and related regulations establish safety standards and bans for consumer products. The CPSC monitors compliance of consumer products under its jurisdiction through market surveillance and has the authority to conduct product safety inspections of establishments where consumer products are manufactured, held or transported. The CPSC can require the recall of noncompliant products or products containing a defect that creates a substantial risk of injury to the public, and the CPSC may seek penalties for regulatory noncompliance under certain circumstances. CPSC regulations also require manufacturers of consumer products to report to the CPSC certain types of information regarding products that fail to comply with applicable regulations, contain a defect that could create a substantial product hazard or create an unreasonable risk of serious injury or death. Certain state laws also address the safety of consumer products and may mandate reporting or labeling requirements.\nPricing\nSolventum’s activities are subject to a variety of price control laws, regulations and government mandates in some of the markets in which it operates. In certain markets the pricing for certain Solventum’s products may be subject to prior approval, including in jurisdictions where Solventum’s products are subject to government reimbursement, whereas in other markets Solventum may be able to set its own prices for its products subject to certain degrees of monitoring and control by the applicable governmental authority. \nThese price control mechanisms, and mechanisms in other markets, including long-term price commitments as the result of market dynamics, may restrict the amount Solventum is able to charge for its products, which may reduce its profits and otherwise adversely affect its business, results of operations or financial condition. In addition, price control laws, regulations or government mandates may be enacted or become more stringent during times of uncertain or unfavorable economic or market conditions, such as during times of economic slowdown, recession or inflation.\nEnvironmental, Health, and Safety Laws \nSolventum is subject to a broad range of federal, state, provincial and local environmental laws and regulations concerning environmental, health and safety matters. For a discussion of these laws and regulations, see the section titled “Environmental, Health, and Safety Matters.” \n15\nTable of\n \nContents\nInformation about our Executive Officers\nBelow is a list of the executive officers of the Company and other significant employees who are members of our leadership team. The respective age of each individual in the tables below is as of December 31, 2024. No family relationships exist among any of the executive officers named, nor is there any undisclosed arrangement or understanding pursuant to which any person was selected as an officer. This information is presented in the table below as of the date of the 10-K filing (February 28, 2025).\nName\nAge\nPosition\nBryan Hanson\n58\nChief Executive Officer \nWayde McMillan\n55\nChief Financial Officer\nSanjiv Arora\n59\nChief Strategy & Corporate Development Officer\nChris Barry\n52\nExecutive Vice President and Group President, Medical Surgical\nTammy Gomez\n53\nChief Human Resources Officer\nPaul Harrington\n56\nChief Supply Chain Officer\nMarcela Kirberger\n58\nChief Legal Affairs Officer\nAmy Landucci\n50\nChief Information and Digital Officer\nGarri Garrison\n65\nPresident, Health Information Systems\nVaughn Grannis\n61\nPresident, Purification and Filtration\nKarim Mansour\n51\nPresident, Dental Solutions\nThe following are brief biographies describing the backgrounds of our executive officers.\nBryan Hanson\n. Mr. Hanson has served as the Chief Executive Officer of Solventum since 2024 after serving as the Chief Executive Officer of 3M’s Health Care Business Group from September 2023 to the Spin-Off. Mr. Hanson has also served as a director of Solventum since 2024. Previously, Mr. Hanson served as Chairman of the Board of Directors of Zimmer Biomet, a global medical technology company with annual revenues over $7 billion, from May 2021 to August 2023, and as President and Chief Executive Officer and a member of the Board of Zimmer Biomet from December 2017 to August 2023. Previously, Mr. Hanson served as Executive Vice President and President, Minimally Invasive Therapies Group of Medtronic plc, a medical device company, from January 2015 until joining Zimmer Biomet in December 2017. Prior to that, he was Senior Vice President and Group President of Covidien plc, a medical device company, from October 2014 to January 2015; Senior Vice President and Group President, Medical Devices and United States of Covidien from October 2013 to September 2014; Senior Vice President and Group President of Covidien for the Surgical Solutions business from July 2011 to October 2013; and President of Covidien’s Energy-based Devices business from July 2006 to June 2011. Mr. Hanson held several other positions of increasing responsibility in sales, marketing and general management with Covidien from October 1992 to July 2006. Mr. Hanson holds a Bachelor of Science degree in Finance from Florida State University. He also completed the Kellogg School of Management Finance for Executives program in 2010 and the Harvard Executive Education in Leadership program in 2013.\nWayde McMillan\n. Mr. McMillan has served as the Chief Financial Officer of Solventum since 2024 after serving as the Chief Financial Officer of 3M’s Health Care Business Group since November 2023. Previously, Mr. McMillan served as Executive Vice President, Chief Financial Officer and Treasurer of Insulet, a medical device company, from March 2019 to November 2023. From January 2015 to February 2019, he was Chief Financial Officer and Vice President of Finance of the Minimally Invasive Therapies Group at Medtronic plc., a medical device company. From November 2006 to January 2015, prior to Medtronic’s acquisition of Covidien plc, a medical device company, Mr. McMillan held a variety of leadership positions at Covidien, including Chief Financial Officer and Vice President of Finance of the Medical Devices Group & U.S., Chief Financial Officer and Vice President of Finance of the Surgical Solutions Business Unit, and Vice President Finance and Controller of the Respiratory and Monitoring Solutions Business Unit. Mr. McMillan started his career in accounting, audit, financial analysis and investor relations positions at various institutions. Mr. McMillan earned his Bachelor of Science in Business Administration from Merrimack College and an MBA from Bentley University McCallum Graduate School of Business.\nSanjiv Arora\n. Mr. Arora has served as the Chief Strategy and Corporate Development Officer of Solventum since 2024. Before joining Solventum, Mr. Arora was Vice President, Business Development & Strategy, Cardiac Surgery, Cardiovascular Diagnostics at Medtronic from February 2021 to March 2024 and as Vice President of Corporate Development from January 2018 to February 2021. His expertise was also honed from working at Edwards LifeSciences, Covidien, Cargill Ventures, RBC Capital Markets and Boston Scientific throughout his career. Mr. Arora earned his Bachelor of Science in Chemical Engineering from the University of Minnesota and an MBA from Duke University.\n16\nTable of\n \nContents\nChris Barry\n. Mr. Barry has served as the Executive Vice President and Group President of our Medical Surgical business since 2024. Prior to joining Solventum, Mr. Barry was Chief Executive Officer and a member of the NuVasive Board of Directors from November 2018 to September 2023. Prior to that role, he served as Senior Vice President and President of Surgical Innovations at Medtronic from January 2015 to October 2018, its second largest business unit. Before the acquisition of Covidien by Medtronic, Mr. Barry was President of Advanced Surgical Technologies of Covidien, where he led global strategy, product portfolio, and U.S. commercial teams for the global business unit. He also spent more than 15 years increasing commercial and executive leadership roles at Covidien. Currently, Mr. Barry serves as a member of the LivaNova Board of Directors. Mr. Barry earned his Bachelor of Science in Environmental Science from Texas Tech University. \nTammy Gomez\n. Ms. Gomez has served as the Chief Human Resources Officer of Solventum since 2024. Before joining Solventum, Ms. Gomez was Executive Vice President and Chief Human Resource Officer at Owens & Minor from July 2022 to December 2023. After starting as a Corporate Audit Manager in 1999, she spent more than 20 years at Cardinal Health in various roles of increasing responsibility, including most recently leading its Global HR Center of Excellence & HR Services team. She began her career in finance and worked with Prudential and General Motors. Ms. Gomez earned her Bachelor’s degree in Business Administration and Management from the University of South Alabama.\nPaul Harrington.\n Mr. Harrington has served as the Chief Supply Chain Officer of Solventum since 2024. Mr. Harrington spent 10 years at Medtronic, from November 2013 to November 2023, where he was most recently Senior Vice President, Global Operations Innovation responsible for shaping, transforming and innovating across the global operations and supply chain function. He also previously served as Vice President Global Operations for the Restorative Therapies Group and Neuromodulation business unit. Prior to joining Medtronic, he was Vice President of Global Manufacturing at Covidien. Mr. Harrington earned his Bachelor's degree in Business Administration from Kingston College.\nMarcela Kirberger\n.\n Ms. Kirberger has served as the Chief Legal Affairs Officer of Solventum since 2024 after serving as the Chief Legal Affairs Officer of 3M’s Health Care Business Group since November 2023. Previously, Ms. Kirberger was Executive Vice President, General Counsel and Corporate Secretary at Elanco, a pharmaceutical company in the animal health field, from June 2021 to November 2023, where she was responsible for the global strategy and operations of the legal function and had responsibility for Corporate Affairs, Ethics & Compliance and ESG. Prior to joining Elanco, Ms. Kirberger held U.S., regional and global leadership roles within Fortune 500 life sciences companies, including as General Counsel and Corporate Secretary at Roche Diagnostics NA, a diagnostics company, from 2019 to 2021; and General Counsel and Chief Compliance Officer at Leica Microsystems GmbH, a global medical device manufacturer and subsidiary of Danaher Corporation, from 2017 to 2019. She also worked for the Novartis Group of Companies from 2006 to 2017 in different Novartis companies, including Gerber Products, Novartis Consumer Health, Novartis Pharmaceuticals and Sandoz International, where she was Global Head of Legal for Biopharma and before that, Global Chief Compliance Officer. Ms. Kirberger began her career as a securities litigator at Lowenstein Sandler in New Jersey. A native of Argentina, she earned her law degrees from Rutgers School of Law in Newark, New Jersey and the Catholic University of Argentina in Buenos Aires.\nAmy Landucci\n. Ms. Landucci has served as the Chief Information and Digital Officer of Solventum since 2024. Prior to joining Solventum, Ms. Landucci was Chief Digital and Technology Officer at Haleon from July 2022 until April 2024, where she led the technical carveout from GSK to form a standalone consumer healthcare company. Prior to the carveout, she spent five years from July 2017 until July 2022 at GSK and previously spent a decade at Novartis in a variety of roles. The first eight years of her career were in consulting with Accenture. Ms. Landucci has served on the Board of Directors for Healthy Women, the leading independent, non-profit health information source for women in the U.S. Ms. Landucci earned her Bachelor of Arts in Environmental Studies from Gustavus Adolphus College. \nGarri Garrison\n. Ms. Garrison has served as the President of Solventum’s Health Information Systems business since 2024. Ms. Garrison has more than 35 years of experience in healthcare, including more than 27 years spent at 3M. Starting in April 1999, she served in a variety of positions for 3M’s Health Information Systems division, including director of consulting services, director of performance management, integration manager, chief operating officer, Lean Six Master Black Belt and area division leader for the U.S. and Canada. Ms. Garrison earned her Bachelor’s degree in nursing from Western Kentucky University.\nVaughn Grannis\n. Mr. Grannis has served as the President of Solventum’s Purification and Filtration business since 2024. Focusing his career on technology enterprises including diversified manufacturers and businesses dealing in high-technology applications and customer groups, Vaughn took the helm of the global P&F at 3M business in 2023, leading the business’ four segments: Bioprocessing Filtration, Drinking Water Filtration, Industrial Filtration and Membranes OEM. Mr. Grannis has more than 38 years of experience creating new business growth, profitability and operational performance across several business sectors and verticals, all of which were with 3M, where he started in 1985. He holds a Bachelor’s Degree and a Master’s Degree in mechanical engineering from the University of Minnesota and an MBA from the University of St. Thomas.\nKarim Mansour\n. Mr. Mansour has served as the President of Solventum’s Dental Solutions business since 2024. With more than 25 years of international healthcare and medical device experience, Karim has acquired industry expertise within the \n17\nTable of\n \nContents\npublic and private sectors, academia, as well as healthcare economics, all of which were with 3M. Karim has held leadership roles of increasing responsibility, including his most recent previous role as President of Dental Solutions, Senior Vice President of 3M Health Care EMEA, Global Strategy and Business Development Director, as well as global operational and financial leadership roles across Europe, U.S. and Latin America. Mr. Mansour earned his Cycle Formation Supérieur au Management (FSM) and a Master’s Degree in Business from IPAG Business School.\nEthics and Governance\nAll of Solventum's employees, including its Chief Executive Officer, Chief Financial Officer, Controller and Chief Accounting Officer, are required to abide by Solventum’s Code of Conduct to ensure that its business is conducted in a consistently legal and ethical manner. The Code of Conduct forms the foundation of a comprehensive process that includes compliance with corporate policies and procedures and a company-wide focus on uncompromising integrity in every aspect of Solventum’s operations. Solventum’s Code of Conduct covers many topics, including antitrust and competition law, conflicts of interest, financial reporting, protection of confidential information, and compliance with all laws and regulations applicable to the conduct of its business.\nEmployees are required to report any conduct that they believe in good faith to be an actual or apparent violation of the Code of Conduct. Solventum Ethics and Compliance maintains processes to receive, retain, and address concerns received from internal, external or anonymous sources. Solventum takes all reported concerns about business conduct seriously and employs a team of experienced investigators who review each concern thoroughly and conduct investigations when necessary. Solventum maintains the confidentiality of all reported concerns in accordance with legal requirements and in the best interest of the organization and those involved. Solventum does not tolerate retaliation for anyone who raises a genuine concern in good faith and educates employees on this policy. Information on how to submit any such communications can be found on Solventum’s website, under “Ethics and Compliance.” Solventum’s Chief Compliance Officer has a direct reporting obligation to the Audit Committee and regularly reports to the Audit Committee on compliance with Solventum's Code of Conduct, including the effectiveness of Solventum's compliance program. See “Item 10: Directors, Executive Officers and Corporate Governance – Code of Ethics” for information about our Code of Ethics governing our Chief Executive Officer, Chief Financial Officer and Controller and Chief Accounting Officer.\nSolventum’s Board of Directors has also implemented a Code of Business Conduct and Ethics for Directors of Solventum. This Code incorporates principles of conduct at Solventum and Solventum’s Board of Directors are to follow to ensure Solventum’s business, and the activities of Solventum’s Board of Directors are conducted with integrity and adherence to the highest ethical standards, and in compliance with the law. Solventum’s Code of Conduct for employees and the Code of Business Conduct and Ethics for Directors are available on Solventum’s website at www.solventum.com.\nAdditional Information\nSolventum’s Internet address is www.solventum.com. Our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), are available on our website for free as soon as reasonably practicable after they are filed electronically with the SEC. Reports filed with the SEC may be viewed at sec.gov. The information on our website is not, and shall not be deemed to be, a part of this Annual Report on Form 10-K or incorporated into any other filings we make with the SEC.",
    "item1a": "Item 1A. Risk Factors” in this Form 10-K.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.\n39\nTable of\n \nContents",
    "item1c": "Item 1C. Cybersecurity\n \nRisk Management\n \nThe Company has practices and procedures designed to proactively and comprehensively manage risks from cybersecurity threats. \nThese processes are integrated into the Company’s overall enterprise risk management, as overseen by the Company’s board of directors (the “Board”), primarily through its committees, with its Audit Committee having direct oversight over cybersecurity matters.\n \nWe identify and assess cybersecurity risk through various technologies, processes and policies that are regularly updated to align with the changing threat landscape, evolving business needs, as well as global regulatory requirements.  \nOur cybersecurity risk mitigation involves a range of threat defense and protection measures such as monitoring of systems, threat containment methods, penetration testing, conducting crises simulations, identity and access management, vulnerability scanning, promoting security and privacy awareness training to our global employees, improving internal processes and following a system of controls, including but not limited to back-up protocols, system restoration processes, and end-point protection on Company devices.  \nWe seek to align our cybersecurity risk management with the NIST Cyber Security Framework, as well as industry best practices. Our cybersecurity incident response processes guide the detection, response and recovery from cybersecurity incidents and compliance with regulatory reporting requirements. \nWe engage third-party consultants, external auditors, legal advisors and assessors to help evaluate our cybersecurity program to assist in conducting risk and maturity assessments and as part of our processes for oversight, identification, and management of material risks from cybersecurity threats.\n \nOur Third-Party Risk Management program oversees diligence relating to cybersecurity risks from third parties in our supply chain or that have access to our systems, data, or that house such systems or data. The program assesses cybersecurity risks of third-party posture, incidents and data breaches at the third parties identified through such diligence. Also, standard cybersecurity and privacy clauses are included in contracts where appropriate.\n \nA cross-functional Business Resiliency team oversees the adequacy of disaster recovery and business continuity considerations needed in response to cybersecurity threats and incidents.\n \nGovernance\n \nBoard of Directors\n \nThe Audit Committee of our Board is responsible for the oversight of cybersecurity-related risks.\n \nThe Audit Committee regularly receives reports from our Chief Information Security Officer (“CISO”), Chief Information and Digital Officer (“CIO”) and other members of management on cybersecurity threat risk management, including security posture improvements, results from third-party assessments, identified risks and progress towards risk-mitigation-related goals. The full \nBoard\n  receives a report from our CISO and other members of management annually.\n \nManagement\n \nOur cybersecurity risk management and strategy processes are led by our \nCISO\n. The CISO works closely with the CIO, Chief Privacy Officer, and members of the legal team who report to the Chief Legal Affairs Officer to periodically review the cybersecurity program.\n \nThe CISO has over 25 years of experience in cybersecurity, risk management, and compliance, and has served as the chief information security officer at other organizations.\n \nThe Company’s CISO oversees the Company’s cybersecurity incident response plan and related processes that are designed to assess and manage material risks from cybersecurity threats. The Company’s CISO also coordinates with the Company’s Legal Affairs team and third parties, such as consultants and legal advisors, to assess and manage material risks from cybersecurity threats. \nThe Company’s CISO is informed about and monitors the prevention, detection, mitigation, and remediation of cybersecurity incidents pursuant to criteria set forth in the Company’s incident response plan and related processes.\nOur Disclosure Committee, with the assistance of its Cybersecurity Subcommittee, is responsible for overseeing the establishment and effectiveness of controls and procedures related to the public disclosure of material cybersecurity matters. The Cybersecurity Subcommittee of the Disclosure Committee is comprised of the Controller and Chief Accounting Officer, Treasurer, Chief Legal Affairs Officer, Assistant Secretary, General Auditor, as well as the CISO, CIO and Chief Privacy \n40\nTable of\n \nContents\nOfficer. The Cybersecurity Subcommittee receives, at least every quarter, a report from CISO on cybersecurity incidents and their mitigation, and remediation pursuant to incident response plan and related processes, as well as other relevant cybersecurity risk topics.\n \nAs of the date of this Form 10-K, the Company is not aware of any risks from cybersecurity threats or cybersecurity incidents that have materially affected or are reasonably likely to materially affect the Company, including its business strategy, results of operations, or financial condition.\n For further discussion of the risks associated with cybersecurity incidents, see the cybersecurity risk factor of the section entitled “"
  }
}