{
  "ticker": "SPG",
  "cik": "0001063761",
  "company_name": "SIMON PROPERTY GROUP INC.",
  "filing_date": "2025-02-21",
  "accession": "0001558370-25-001271",
  "primary_doc": "spg-20241231x10k.htm",
  "item_sections": {
    "item1": "Item 1.\nBusiness\nSimon Property Group, Inc. is a Delaware corporation that operates as a self-administered and self-managed real estate investment trust, or REIT, under the Internal Revenue Code of 1986, as amended, or the Internal Revenue Code. REITs will generally not be liable for U.S. federal corporate income taxes as long as they distribute not less than 100% of their REIT taxable income. Simon Property Group, L.P. is our majority-owned Delaware partnership subsidiary that owns directly or indirectly all of our real estate properties and other assets. Unless stated otherwise or the context otherwise requires, references to \"Simon\" mean Simon Property Group, Inc. and references to the \"Operating Partnership\" mean Simon Property Group, L.P.  References to \"we,\" \"us\" and \"our\" mean collectively Simon, the Operating Partnership and those entities/subsidiaries owned or controlled by Simon and/or the Operating Partnership. According to the amended and restated Operating Partnership's partnership agreement, the Operating Partnership is required to pay all expenses of Simon.\nWe own, develop and manage premier shopping, dining, entertainment and mixed-use destinations, which consist primarily of malls, Premium Outlets\n®\n, and The Mills\n®\n. As of December 31, 2024, we owned or held an interest in 194 income-producing properties in the United States, which consisted of 92 malls, 70 Premium Outlets, 14 Mills, six lifestyle centers, and 12 other retail properties in 37 states and Puerto Rico. We also own an 88% noncontrolling interest in The Taubman Realty Group, LLC, or TRG, which has an interest in 22 regional, super-regional, and outlet malls in the U.S. and Asia. Internationally, as of December 31, 2024, we had ownership interests in 35 Premium Outlets and Designer Outlet properties primarily located in Asia, Europe and Canada. As of December 31, 2024, we also owned a 22.4% equity stake in Klépierre SA, or Klépierre, a publicly traded, Paris-based real estate company, which owns, or has an interest in, shopping centers located in 14 countries in Europe. We also have interests in investments in retail operations (such as Catalyst Brands LLC); an e-commerce venture (Rue Gilt Groupe, or RGG, which operates shop.simon.com), and Jamestown (a global real estate investment and management company), collectively, our other platform investments.\nFor a description of our operational strategies and developments in our business during 2024, see Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of this Form 10-K.\nOther Policies\nThe following is a discussion of our investment policies, financing policies, conflict of interest policies and policies with respect to certain other activities. One or more of these policies may be amended or rescinded from time to time without a stockholder vote.\nInvestment Policies\nWhile we emphasize equity real estate investments, we may also provide secured financing to or invest in equity or debt securities of other entities engaged in real estate activities or securities of other issuers consistent with Simon’s qualification as a REIT. However, any of these investments would be subject to the percentage ownership limitations and gross income tests necessary for REIT qualification. These REIT limitations mean that Simon cannot make an investment that would cause its real estate assets and certain other qualifying assets (such as cash) to be less than 75% of its total assets. Simon must also derive at least 75% of its gross income directly or indirectly from investments relating to real property or mortgages on real property, including “rents from real property,” dividends from other REITs and, in certain circumstances, interest from certain types of temporary investments. In addition, Simon must also derive at least 95% of its gross income from such real property investments, and from dividends, interest and gains from the sale or dispositions of stock or securities or from other combinations of the foregoing.\nSubject to Simon’s REIT limitations, we may invest in the securities of other issuers in connection with acquisitions of indirect interests in real estate. Such an investment would normally be in the form of general or limited partnership or membership interests in special purpose partnerships and limited liability companies that own one or more properties. We may, in the future, acquire all or substantially all of the securities or assets of other REITs, management companies or similar entities where such investments would be consistent with our investment policies.  Additionally we have and may in the future make investments in entities engaged in non-real estate activities, primarily through a taxable REIT subsidiary, similar to the investments we currently hold in certain retail operations.\n5\n\n\nTable of Contents\nFinancing Policies\nBecause Simon’s REIT qualification requires Simon to distribute at least 90% of its REIT taxable income, we regularly access the debt markets to raise the funds necessary to finance acquisitions, develop and redevelop properties, and refinance maturing debt. We must comply with the covenants contained in our financing agreements that limit our ratio of debt to total assets or market value, as defined. The Operating Partnership has a $5.0 billion unsecured revolving credit facility, or the Credit Facility, and a $3.5 billion supplemental unsecured revolving credit facility, or Supplemental Facility, or together, the Credit Facilities. The Credit Facilities and the indentures for the Operating Partnership’s debt securities contain covenants that restrict the total amount of debt of the Operating Partnership to 65%, or 60% in relation to certain debt, of total assets, as defined under the related agreements, and secured debt to 50% of total assets. In addition, these agreements contain other covenants requiring compliance with financial ratios. Furthermore, the amount of debt that we may incur is limited as a practical matter by our desire to maintain acceptable ratings for the debt securities of the Operating Partnership. We strive to maintain investment grade ratings at all times for various business reasons, including their effect on our ability to access attractive capital, but we cannot assure you that we will be able to do so in the future.\nIf Simon’s Board of Directors determines to seek additional capital, we may raise such capital by offering equity or incurring debt, creating joint ventures with existing ownership interests in properties, entering into joint venture arrangements for new development projects, retaining cash flows or a combination of these methods. If Simon’s Board of Directors determines to raise equity capital, it may, without stockholder approval, issue additional shares of common stock or other capital stock. Simon’s Board of Directors may issue a number of shares up to the amount of our authorized capital or may issue units in any manner and on such terms and for such consideration as it deems appropriate. We may also raise additional capital by issuing common units of partnership interest in the Operating Partnership, or units. Such securities also may include additional classes of Simon’s preferred stock or preferred units of partnership interest in the Operating Partnership, or preferred units, which may be convertible into common stock or units, as the case may be. Existing stockholders and unitholders have no preemptive right to purchase shares or units in any subsequent issuances of securities by us. Any issuance of equity could dilute a stockholder’s investment in Simon or a limited partner’s investment in the Operating Partnership.\nWe expect most future borrowings will be made through the Operating Partnership or its subsidiaries. We might, however, incur borrowings through other entities that would be reloaned to the Operating Partnership. Borrowings may be in the form of bank borrowings, publicly and privately placed debt instruments, or purchase money obligations to the sellers of properties. Any such indebtedness may be secured or unsecured. Any such indebtedness may also have full or limited recourse to the borrower or be cross-collateralized with other debt, or may be fully or partially guaranteed by the Operating Partnership. We issue unsecured debt securities through the Operating Partnership, but we may issue other debt securities which may be convertible into common or preferred stock or be accompanied by warrants to purchase common or preferred stock. We also may sell or securitize our lease receivables. Although we may borrow to fund the payment of dividends, we currently have no expectation that we will regularly do so.\nThe Credit Facility can be increased in the form of additional commitments in an aggregate amount not to exceed $1.0 billion, for a total aggregate size of $6.0 billion, subject to obtaining additional lender commitments and satisfying certain customary conditions precedent. The initial maturity date of the Credit Facility is June 30, 2027. The Credit Facility can be extended for two additional six-month periods to June 30, 2028, at our sole option, subject to satisfying certain customary conditions precedent. \nBorrowings under the Credit Facility bear interest, at our election, at either (i) (x) for Term Benchmark Loans, the Adjusted Term SOFR Rate, the applicable Local Rate, the Adjusted EURIBOR Rate, or the Adjusted TIBOR Rate, (y) for RFR Loans, if denominated in Sterling, SONIA plus a benchmark adjustment and if denominated in Dollars, Daily Simple SOFR plus a benchmark adjustment, or (z) for Daily SOFR Loans, the Adjusted Floating Overnight Daily SOFR Rate, in each case of clauses (x) through (z) above, plus a margin determined by our corporate credit rating of between 0.650% and 1.400% or (ii) for loans denominated in U.S. Dollars only, the base rate (which rate is equal to the greatest of the prime rate, the federal funds effective rate plus 0.500% or Adjusted Term SOFR Rate for one month plus 1.000%) (the “Base Rate”), plus a margin determined by our corporate credit rating of between 0.000% and 0.400%. The Credit Facility includes a facility fee determined by our corporate credit rating of between 0.100% and 0.300% on the aggregate revolving commitments under the Credit Facility.  Based upon our current credit ratings, the interest rate on the Credit Facility is SOFR plus 72.5 basis points, plus a spread adjustment to account for the transition from LIBOR to SOFR. \nThe Supplemental Facility’s initial borrowing capacity of $3.5 billion may be increased to $4.5 billion during its term subject to obtaining additional lender commitments and satisfying certain customary conditions precedent. The initial maturity date of the Supplemental Facility is January 31, 2029 and can be extended for an additional year to January 31, 2030 at our sole option, subject to our continued compliance with the terms thereof.\n6\n\n\nTable of Contents\nBorrowings under the Supplemental Facility bear interest, at the Company’s election, at either (i) (x) for Term Benchmark Loans, the Adjusted Term SOFR Rate, the applicable Local Rate, the Adjusted EURIBOR Rate, the Adjusted Term CORRA Rate, or the Adjusted TIBOR Rate, (y) for RFR Loans, if denominated in Sterling, SONIA plus a benchmark adjustment, if denominated in Dollars, Daily Simple SOFR plus a benchmark adjustment, and if denominated in Canadian Dollars, Daily Simple CORRA plus a benchmark adjustment or (z) for Daily SOFR Loans, the Adjusted Floating Overnight Daily SOFR Rate, in each case of clauses (x) through (z) above, plus a margin determined by the Company’s corporate credit rating of between 0.650% and 1.400% or (ii) for loans denominated in U.S. Dollars only, the base rate (which rate is equal to the greatest of the prime rate, the NYFRB Rate plus 0.500% or Adjusted Term SOFR Rate for one month plus 1.000%) (the “Base Rate”), plus a margin determined by the Company’s corporate credit rating of between 0.000% and 0.400%. The Supplemental Facility includes a facility fee determined by the Company’s corporate credit rating of between 0.100% and 0.300% on the aggregate revolving commitments under the Supplemental Facility. Based upon our current credit ratings, the interest rate on the Supplemental Facility is SOFR plus 72.5 basis points, plus a spread adjustment to account for the transition from LIBOR to SOFR.\nThe Operating Partnership also has available a global unsecured commercial paper note program, or Commercial Paper program, of $2.0 billion, or the non-U.S. dollar equivalent thereof. The Operating Partnership may issue unsecured commercial paper notes, denominated in U.S. dollars, Euro and other currencies. Notes issued in non-U.S. currencies may be issued by one or more subsidiaries of the Operating Partnership and are guaranteed by the Operating Partnership. Notes are sold under customary terms in the U.S. and Euro commercial paper note markets and rank (either by themselves or as a result of the guarantee described above) \npari passu\n with the Operating Partnership’s other unsecured senior indebtedness. The Commercial Paper program is supported by the Credit Facilities and, if necessary or appropriate, we may make one or more draws under the Credit Facilities to pay amounts outstanding from time to time on the Commercial Paper program.\nWe may also finance our business through the following:\n●\nissuance of shares of common stock or preferred stock or warrants to purchase the same;\n●\nissuance of additional units;\n●\nissuance of preferred units;\n●\nissuance of other securities, including unsecured notes and mortgage debt;\n●\ndraws on our Credit Facilities;\n●\nborrowings under the Commercial Paper program; or\n●\nsale or exchange of ownership interests in properties.\nThe Operating Partnership may also issue units to contributors of properties or other partnership interests which may permit the contributor to defer tax gain recognition under the Internal Revenue Code.\nWe do not have a policy limiting the number or amount of mortgages that may be placed on any particular property. \nMortgage financing instruments, however, typically limit additional indebtedness on such properties. Additionally, the Credit Facilities, our unsecured note indentures and other contracts may limit our ability to borrow and contain limits on mortgage indebtedness we may incur as well as certain financial covenants we must maintain.\nTypically, we invest in or form special purpose entities to assist us in obtaining secured permanent financing at attractive terms. Permanent financing may be structured as a mortgage loan on a single property, or on a group of properties, and generally requires us to provide a mortgage lien on the property or properties in favor of an institutional third party, as a joint venture with a third party, or as a securitized financing. For securitized financings, we create special purpose entities to own the properties. These special purpose entities, which are common in the real estate industry, are structured so that they would not be consolidated in a bankruptcy proceeding involving a parent company. We decide upon the structure of the financing based upon the best terms then available to us and whether the proposed financing is consistent with our other business objectives. For accounting purposes, we include the outstanding securitized debt of special purpose entities owning consolidated properties as part of our consolidated indebtedness.\nConflict of Interest \nPolicies\nWe maintain policies and have entered into agreements designed to reduce or eliminate potential conflicts of interest. Simon has adopted governance principles governing the function, conduct, selection, orientation and duties of its \n7\n\n\nTable of Contents\nsubsidiaries and Simon’s Board of Directors and the Company, as well as written charters for each of the standing Committees of Simon’s Board of Directors. In addition, Simon’s Board of Directors has a Code of Business Conduct and Ethics, which applies to all of its officers, directors, and employees and those of its subsidiaries. At least a majority of the members of Simon’s Board of Directors must qualify, and do qualify, as independent under the listing standards of the New York Stock Exchange, or NYSE, and cannot be affiliated with the Simon family, who are significant stockholders in Simon and/or unitholders in the Operating Partnership. In addition, the Audit and Compensation and Human Capital Committees of Simon’s Board of Directors are comprised entirely of independent members who meet the additional independence and financial expert requirements of the NYSE as required. \nThe sale by the Operating Partnership of any property that it owns may have an adverse tax impact on the Simon family or other limited partners of the Operating Partnership. Any transaction between us and the Simon family, including property acquisitions, service and property management agreements and retail space leases, must be approved by the Company’s Audit Committee.\nIn order to avoid any conflict of interest, the Simon charter requires that at least three-fourths of Simon’s independent directors must authorize and require the Operating Partnership to sell any property it owns. Any such sale is subject to applicable agreements with third parties. A noncompetition agreement executed by Herbert Simon, Simon’s Chairman Emeritus, and a noncompetition agreement executed by David Simon, Simon’s Chairman, Chief Executive Officer and President, which remains in effect notwithstanding the expiration of David Simon’s employment agreement in 2019, contain covenants limiting their ability to participate in certain shopping center activities.\nPolicies With Respect To Certain Other Activities\nWe intend to make investments which are consistent with Simon’s qualification as a REIT, unless Simon’s Board of Directors determines that it is no longer in Simon’s best interests to so qualify as a REIT. Simon’s Board of Directors may make such a determination because of changing circumstances or changes in the REIT requirements. Simon has authority to issue shares of its capital stock or other securities in exchange for property. We also have authority to repurchase or otherwise reacquire Simon’s shares, the Operating Partnership’s units, or any other securities. On May 9, 2022, Simon’s Board of Directors authorized a common stock repurchase plan commencing on May 16, 2022.  Under the program, the Company could purchase up to $2.0 billion of its common stock during the two-year period ending May 16, 2024 in open market or privately negotiated transactions, at prices that the Company deemed appropriate and subject to market conditions, applicable law, and other factors deemed relevant in the Company’s sole discretion.  On February 8, 2024, Simon’s Board of Directors authorized a new common stock repurchase program which replaced the prior repurchase program immediately, where the Company may purchase up to $2.0 billion of its common stock over the next 24 months.  As Simon repurchases shares under these programs, the Operating Partnership repurchases an equal number of units from Simon. Simon may also issue shares of its common stock, or pay cash at its option, to holders of units in future periods upon exercise of such holders’ rights under the partnership agreement of the Operating Partnership. Our policy prohibits us from making any loans to the directors or executive officers of Simon for any purpose. We may make loans to the joint ventures in which we participate. Additionally, we may make or buy interests in loans secured by real estate properties owned by others or make investments in companies that own real estate assets.\nCompetition\nThe retail real estate industry is dynamic and competitive. We compete with numerous merchandise distribution channels, including malls, outlet centers, community/lifestyle centers, and other shopping centers in the United States and abroad. We also compete with internet retailing sites and catalogs, including our tenants, which provide retailers with distribution options beyond existing brick and mortar retail properties. The existence of competitive alternatives could have a material adverse effect on our ability to lease space and on the level of rents we can obtain. This results in competition for both the tenants to occupy the properties that we develop and manage as well as for the acquisition of prime sites (including land for development and operating properties). We believe that there are numerous factors that make our properties highly desirable to retailers, including:\n●\nthe quality, location and variety of tenants of our properties;\n●\nour management and operational expertise;\n●\nour extensive experience and relationships with tenants, lenders and suppliers;\n●\nour marketing initiatives and consumer focused strategic corporate alliances; and\n●\nthe efficiency and immediacy of physical retail.\n8\n\n\nTable of Contents\nCertain Activities\nDuring the past three years, we have:\n●\nissued 57,680 shares of Simon common stock upon the exchange of units in the Operating Partnership;\n●\nissued 871,680 restricted shares of Simon common stock and 689,202 long-term incentive performance units, or LTIP units, net of forfeitures, under the Simon Property Group, L.P. 2019 Stock Incentive Plan, or the 2019 Plan;\n●\npurchased 3,103,755 shares of Simon common stock in the open market at an average price of $103.42 per share for $321.0 million pursuant to our repurchase program;\n●\nissued 3,297,500 units in the Operating Partnership as part of the consideration for the acquisition of additional interests in TRG, bringing our noncontrolling ownership interest in TRG to 88%;\n●\nredeemed 417,331 units in the Operating Partnership for $57.7 million \nat an average price of\n $138.18 per unit in cash; \n●\namended, restated, extended, and increased our existing $4.0 billion unsecured revolving credit facility on March 14, 2023 with a new $5.0 billion unsecured revolving credit facility.\n●\namended, restated, and extended our existing $3.5 billion unsecured revolving credit facility on September 19, 2024;\n●\nborrowed a maximum amount of $325.1 million under the Credit Facilities; the outstanding amount of borrowings under the Credit Facility was $323.7 million as of December 31, 2024. There were no borrowings under the Supplemental Facility as of December 31, 2024;\n●\nthere were no outstanding borrowings of Commercial Paper notes as of December 31, 2024; and\n●\nprovided annual reports containing financial statements audited by our independent registered public accounting firm and quarterly reports containing unaudited financial statements to our security holders. \nHuman Capital\nAt December 31, 2024, we and our affiliates employed approximately 3,000 persons at various properties and offices throughout the United States, of which approximately 400 were part-time. Approximately 1,000 of these employees were located at our corporate headquarters in Indianapolis, Indiana.\nWe believe our employees are the driving force behind our success.  To ensure we continue to attract, develop and retain the best talent across the organization, we invest in our employees and provide equal opportunities. We offer a variety of ongoing talent programs that foster continual development, high performance and overall organizational effectiveness, including a series of leadership development programs. We conduct an annual talent-assessment process for selected business functions within our corporate and field organizations that includes plans for individual employee career development and long-term leadership succession, and also conduct an annual performance appraisal process for all regular employees. \nWe are focused on providing a work environment that is free from any form of discrimination or harassment for any protected class and also embraces a code of conduct. We have an internal policy of targeted solutions for employees and an annual process of assessment, action and evaluation led by our human resources department.\nOur compensation program is designed to, among other things, attract, retain and motivate talented and experienced individuals using a mix of competitive salaries, bonuses, equity based awards and other benefits.\nGovernment Regulations Affecting Our Properties\nWe are subject to federal, state and local environmental regulations that apply generally to the ownership of real property and the operations conducted on real property.  As of December 31, 2024, we are not aware of any environmental conditions or material costs of complying with environmental or other regulations that would have a material adverse effect on our overall business, financial condition, or results of operations.  However, it is possible that we are not aware of, or may become subject to, potential environmental liabilities or material costs of complying with governmental regulations that could be material.  See further discussion in",
    "item1a": "Item 1A. Risk Factors.\nCybersecurity Governance\nOur Board of Directors considers cybersecurity risk as critical to the enterprise and delegates the cybersecurity risk oversight function to the \nAudit Committee\n. The Audit Committee oversees and is regularly updated on management’s design, implementation and enforcement of our cybersecurity risk management program. The Audit Committee is composed of board members with varied expertise including, risk management, technology, and finance, equipping them to oversee cybersecurity risks.\nOur \nChief Financial Officer periodically provides reports to the Audit Committee\n, and, together with our Chief Technology Officer and Director of Cybersecurity, leads the Company’s overall cybersecurity function. \nThe Audit Committee receives regular reports on our cybersecurity risks, including briefings on our cyber risk management program and cybersecurity incidents\n. Audit Committee members also receive periodic presentations on cybersecurity, IT and data protection topics.\nOur \nChief Financial Officer\n oversees our CSIRT, whose members have years of experience working in cybersecurity and certifications including CISSP (Certified Information Systems Security Professional), CCSP (Certified Cloud Security Professional), CGRC (Certification in Governance of Enterprise IT), GIAC (Global Information Assurance Certification) and GCED (GIAC Certified Enterprise Defender).\n \nOur CSIRT supervises efforts to prevent, detect, mitigate, and remediate cybersecurity risks and incidents through various means, which include briefings from internal security personnel; threat intelligence and other information obtained from governmental, public or private sources, including external cybersecurity service providers\n; and alerts and reports produced by security tools deployed in the IT environment.\nThe \nCSIRT\n is responsible for assessing and managing our material risks from cybersecurity threats.  They have primary responsibility for leading our overall cybersecurity risk management program and supervise both our internal cybersecurity personnel and our external cybersecurity service providers.\n \n27\n\n\nTable of Contents",
    "item1b": "Item 1B.  Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.  Cybersecurity\nCybersecurity Risk Management and Strategy\nWe have developed and implemented a cybersecurity risk management program intended to protect the confidentiality, integrity, and availability of our critical systems and information. We execute a risk-based approach to identify and assess the cybersecurity threats that could affect our business and information systems. Our cybersecurity risk management program includes a cybersecurity incident response plan and dedicated cybersecurity incident response team (“CSIRT”).  We do not have actual or contractual access to the systems or information maintained by our tenants, who maintain their own cybersecurity risk management programs to protect their operations from various risks from cybersecurity threats. \n26\n\n\nTable of Contents\nWe use the National Institute of Standards and Technology Cybersecurity Framework and CIS Critical Security Controls as a guide to help us identify, assess, and manage cybersecurity risks relevant to our business. This does not imply that we meet any particular technical standards, specifications, or requirements.\nOur cybersecurity risk management program is \nintegrated\n with our overall enterprise risk management program, and shares common methodologies, reporting channels and governance processes that apply across the enterprise risk management program to other legal, compliance, strategic, operational, public relations and financial risk areas.\nOur cybersecurity risk management program includes the following key elements:\n●\nrisk assessments designed to help identify material cybersecurity risks to our critical systems, information, services, and our broader enterprise information technology (IT) environment;\n●\na team comprised of IT security, infrastructure, and compliance personnel principally responsible for directing (1) our cybersecurity risk assessment processes, (2) our security processes, and (3) our response to cybersecurity incidents, supported by legal, human resources, corporate security and other internal resources;\n●\nthe use of \nexternal cybersecurity service providers\n, where appropriate, to assess, test or otherwise assist with aspects of our security processes, which enable us to leverage specialized knowledge and insights, with the goal of ensuring our cybersecurity strategies and processes remain at the forefront of industry best practices;\n●\ncybersecurity awareness training of employees with access to our IT systems; \n●\na cybersecurity incident response plan and Security Operations Center (“SOC”) to respond to cybersecurity incidents; and\n●\na \nthird-party risk management process \nfor service providers.\nWe have not identified risks from known cybersecurity threats, including as a result of any prior cybersecurity incidents, that have materially affected us\n, including our operations, business strategy, results of operations, or financial condition. We face certain ongoing risks from cybersecurity threats that, if realized, are reasonably likely to materially affect us, including our operations, business strategy, results of operations, or financial condition. See further discussion in"
  }
}