{
  "ticker": "STE",
  "cik": "0001757898",
  "company_name": "STERIS plc",
  "filing_date": "2025-05-29",
  "accession": "0001757898-25-000005",
  "primary_doc": "ste-20250331.htm",
  "item_sections": {
    "item1": "Item 1, \"Business,\" Part I,",
    "item1a": "Item 1A. of this Annual Report on Form 10-K.\nWe are subject to taxation from United States federal, state and local, and foreign jurisdictions. Tax positions are settled primarily through the completion of audits within each individual jurisdiction or the closing of statutes of limitation. Changes in applicable tax law or other events may also require us to revise past estimates. We describe income taxes further in Note 10 to our consolidated financial statements titled, “Income Taxes” in t\nhis Annual Report on Form 10-K.\nAs of March 31, 2025 and 2024, our commercial commitments totaled \n$\n127,396\n and $\n110,402\n, respectively. Commercial commitments include standby letters of credit, letters of credit required as security under our self-insured risk retention policies, and other potential cash outflows resulting from an event that requires payment by us. Approximately \n$\n10,875\n and $\n9,975\n of the March 31, 2025 and 2024 totals, respectively, relate to letters of credit required as security under our self-ins\nured risk retention policies.\nAs of March 31, 2025, we had minimum purchase commitments with suppliers for raw material purchases totaling \n$\n64,263\n. As of March 31, 2025, we also had commitments of \n$\n77,927\n for long term construction contracts. \nLeases\nWe lease manufacturing, warehouse and office space, service facilities, vehicles, equipment and communication systems.  Certain leases contain options that provide us with the ability to extend the lease term. Such options are included in the lease term when it is reasonably certain that the option will be exercised.  We made an accounting policy election to not recognize lease assets or lease liabilities for leases with a lease term of twelve months or less.\nWe determine if an agreement contains a lease and classify our leases as operating or finance at the lease commencement date. Finance leases are generally those leases for which we will pay substantially all the underlying asset’s fair value or will use the asset for all or a major part of its economic life, including circumstances in which we will ultimately own the asset.  Lease assets arising from finance leases are included in Property, plant, and equipment, net and the liabilities are included in Other liabilities. For finance leases, we recognize interest expense using the effective interest method, and we recognize amortization expense on the lease asset over the shorter of the lease term or the useful life of the asset. Our finance leases are not material as of March 31, 2025 and for the twelve-month period then ended.  \nOperating lease assets and liabilities are recognized at the commencement date of the lease based on the present value of lease payments over the lease term. Lease assets represent the right to use an underlying asset for the lease term and lease liabilities represent the obligation to make lease payments arising from the lease. As most leases do not provide an implicit interest rate, we estimate an incremental borrowing rate to determine the present value of lease payments. Our estimated incremental borrowing rate reflects a secured rate based on recent debt issuances, our estimated credit rating, lease term, as well as publicly available data for instruments with similar characteristics. For operating leases, we recognize lease cost on a straight-line basis over the term of the lease. When accounting for leases, we combine payments for leased assets, related services and other components of a lease.\n86\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\nThe components of operating lease expense recognized in income from continuing operations in the consolidated statements of income are as follows:\nYear Ended\nYear Ended\nYear Ended\nMarch 31, 2025\nMarch 31, 2024\nMarch 31, 2023\nFixed operating lease expense   \n$\n46,482\n \n$\n41,330\n \n$\n39,473\n \nVariable operating lease expense\n21,299\n \n24,441\n \n18,581\n \nTotal operating lease expense\n$\n67,781\n \n$\n65,771\n \n$\n58,054\n \nSupplemental cash flow information related to operating leases is as follows:\nYear Ended\nYear Ended\nYear Ended\nMarch 31, 2025\nMarch 31, 2024\nMarch 31, 2023\nCash paid for amounts included in the measurement of operating lease liabilities\n$\n46,541\n \n$\n46,946\n \n$\n45,249\n \nRight-of-use assets obtained in exchange for operating lease obligations, net\n$\n29,821\n \n$\n24,668\n \n$\n53,099\n \nMaturities of lease liabilities at March 31, 2025 are as follows\n:\nMarch 31,\n2025\n2026\n$\n41,391\n \n2027\n32,753\n \n2028\n32,753\n \n2029\n17,533\n \n2030 and thereafter\n82,663\n \nTotal operating lease payments\n207,093\n \nLess imputed interest\n48,254\n \nTotal operating lease liabilities\n$\n158,839\n \nIn the preceding table, the future minimum annual rentals payable under noncancelable leases denominated in foreign currencies have been calculated using March 31, 2025 foreign currency exchange rates.\nSupplemental information related to operating leases is as follows:\nMarch 31,\nMarch 31,\n2025\n2024\nWeighted-average remaining lease term of operating leases\n9.1\n years\n9.9\n years\nWeighted-average discount rate of operating leases\n4.5\n \n%\n4.4\n \n%\n13. BUSINESS SEGMENT INFORMATION\nWe operate and report our financial information in \nthree\n reportable business segments: Healthcare, AST, and Life Sciences.\n \nPreviously, we had four reportable business segments, however, as a result of the divestiture of our Dental segment, Dental is presented as discontinued operations. Historical information has been retrospectively adjusted to reflect these changes for comparability, as required. For more information, refer to Note 4 titled, \"Discontinued Operations.\" \nNon-allocated operating costs that support the entire Company and items not indicative of operating trends are excluded from segment operating income.\nOur Healthcare segment provides a comprehensive offering for healthcare providers worldwide, focused on sterile processing departments and procedural centers, such as operating rooms and endoscopy suites. Our products and services range from infection prevention consumables and capital equipment, as well as services to maintain that equipment; to the repair of re-usable procedural instruments; to outsourced instrument reprocessing services. In addition, our procedural products also \n87\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\ninclude endoscopy accessories, instruments, and capital equipment infrastructure used primarily in operating rooms, ambulatory surgery centers, endoscopy suites, and other procedural areas.\nOur AST segment supports medical device and pharmaceutical manufacturers through a global network of contract sterilization and laboratory testing facilities, and integrated sterilization equipment and control systems. Our technology-neutral offering supports Customers every step of the way, from testing through sterilization.\nOur Life Sciences segment provides a comprehensive offering of products and services designed to support biopharmaceutical and medical device research and manufacturing facilities, in particular those focused on aseptic manufacturing. Our portfolio includes a full suite of capital equipment, consumable products, equipment maintenance and specialty services.\nOur chief operating decision maker (\"CODM\") is our President and Chief Executive Officer (\"CEO\"). The CEO is responsible for performance assessment and resource allocation. The CEO regularly receives discrete financial information about each reportable segment and uses this information to assess performance and allocate resources. This information includes Revenues and Cost of revenues; Selling, general, and administrative expenses; and Research and development expenses for each reportable segment. \nWe d\nisclose a measure of segment income that is consistent with the way management operates and views the business. The accounting policies for reportable segments are the same as those for the consolidated Company.\nFor the three years ended March 31, 2025, revenues from a single Customer did not represent ten percent or more of the Healthcare, AST or Life Sciences segment revenues.\n \nInformation regarding our segments is presented in the following tables.\nYear Ended March 31, 2025\nHealthcare\nAST\nLife Sciences\nCorporate\nCompany\nRevenues\n$\n3,878,671\n \n$\n1,038,573\n \n$\n542,271\n \n$\n—\n \n$\n5,459,515\n \nSegment expenses\nCost of revenues\n2,204,084\n \n516,704\n \n243,714\n \nSelling, general, and administrative\n609,974\n \n52,485\n \n59,755\n \nResearch and development\n93,092\n \n3,808\n \n9,361\n \nTotal income from operations before adjustments\n$\n971,521\n \n$\n465,576\n \n$\n229,441\n \n$\n(\n399,033\n)\n$\n1,267,505\n \nLess: Adjustments\nAmortization of acquired intangible assets \n(1)\n273,784\n \nAcquisition and integration related charges \n(2)\n11,159\n \nTax restructuring costs \n(3)\n54\n \nAmortization of inventory and property \"step up\" to fair value \n(1)\n5,442\n \nRestructuring charges \n(4)\n62,275\n \nIllinois EO litigation settlement \n(5)\n48,150\n \nTotal income from operations\n$\n866,641\n \n88\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\nYear Ended March 31, 2024\nHealthcare\nAST\nLife Sciences\nCorporate\nCompany\nRevenues\n$\n3,613,019\n \n$\n953,980\n \n$\n571,702\n \n$\n—\n \n$\n5,138,701\n \nSegment expenses\nCost of revenues\n2,083,850\n \n458,397\n \n283,880\n \nSelling, general, and administrative\n568,040\n \n51,698\n \n58,218\n \nResearch and development\n89,771\n \n4,141\n \n8,255\n \nTotal income from operations before adjustments\n$\n871,358\n \n$\n439,744\n \n$\n221,349\n \n$\n(\n348,497\n)\n$\n1,183,954\n \nLess: Adjustments\nAmortization of acquired intangible assets \n(1)\n266,420\n \nAcquisition and integration related charges \n(2)\n25,526\n \nTax restructuring costs \n(3)\n620\n \nNet loss on divestiture of businesses \n(1)\n873\n \nAmortization of inventory and property \"step up\" to fair value \n(1)\n10,032\n \nRestructuring charges \n(4)\n44,365\n \nTotal income from operations\n$\n836,118\n \nYear Ended March 31, 2023\nHealthcare\nAST\nLife Sciences\nCorporate\nCompany\nRevenues\n$\n3,085,131\n \n$\n914,431\n \n$\n536,704\n \n$\n—\n \n$\n4,536,266\n \nSegment expenses\nCost of revenues\n1,788,174\n \n436,682\n \n266,458\n \nSelling, general, and administrative\n506,262\n \n43,804\n \n52,608\n \nResearch and development\n84,675\n \n4,925\n \n7,413\n \nTotal income from operations before adjustments\n$\n706,020\n \n$\n429,020\n \n$\n210,225\n \n$\n(\n264,974\n)\n$\n1,080,291\n \nLess: Adjustments\nAmortization of acquired intangible assets \n(1)\n256,355\n \nAcquisition and integration related charges \n(2)\n23,486\n \nTax restructuring costs \n(3)\n661\n \nGain on fair value adjustment of acquisition related contingent consideration \n(1)\n(\n3,100\n)\nNet loss on divestiture of businesses \n(1)\n(\n67\n)\nAmortization of inventory and property \"step up\" to fair value \n(1)\n11,370\n \nRestructuring charges \n(4)\n485\n \nTotal income from operations\n$\n791,101\n \n89\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\n(1)\n For more information regarding our recent acquisitions and divestitures, refer to Note 3 titled, \"Business Acquisitions and Divestitures\n\"\n(2)\n Acquisition and integration related charges include transaction costs and integration expenses associated with acquisitions.\n(3)\n Costs incurred in tax restructuring. \n(4) \nFor more information regarding our restructuring efforts, refer to Note 2 titled, \"Restructuring\".\n(5)\n \nFor more information regarding our Illinois EO litigation settlement, refer to Note 12 titled, \"Commitments and Contingencies\".\nAssets include the current and long-lived assets directly attributable to the segment based on the management of the location or on utilization. Certain corporate assets were allocated to the reportable segments based on revenues. Assets attributed to sales and distribution locations are only allocated to the Healthcare and Life Sciences segments. \nIndividual facilities, equipment, and intellectual properties are utilized by both the Healthcare and Life Sciences segments at varying levels over time. As a result, an allocation of total assets, capital expenditures, and depreciation and amortization is not meaningful to the individual performance of the Healthcare and Life Sciences segments. Therefore, their respective amounts are reported together.\nMarch 31,\n2025\n2024\nAssets\nHealthcare and Life Sciences\n$\n6,806,442\n \n$\n7,055,576\n \nAST\n3,340,369\n \n3,203,217\n \nAssets excluding assets held for sale\n$\n10,146,811\n \n$\n10,258,793\n \nYears Ended March 31,\n2025\n2024\n2023\nCapital Expenditures\nHealthcare and Life Sciences\n$\n142,845\n \n$\n114,164\n \n$\n98,585\n \nAST\n227,246\n \n237,012\n \n253,914\n \nTotal Capital Expenditures\n$\n370,091\n \n$\n351,176\n \n$\n352,499\n \nDepreciation, Depletion, and Amortization\nHealthcare and Life Sciences \n$\n334,212\n \n$\n322,244\n \n$\n306,377\n \nAST\n142,003\n \n127,823\n \n116,153\n \nTotal Depreciation, Depletion, and Amortization\n$\n476,215\n \n$\n450,067\n \n$\n422,530\n \n \nFinancial information for each of our United States and international geographic areas is presented in the following table. Revenues are based on the location of these operations and their Customers. Property, plant, and equipment, net are those assets that are identified within the operations in each geographic area.\nMarch 31,\n2025\n2024\nProperty, Plant, and Equipment, Net\nIreland\n$\n74,901\n \n$\n68,603\n \nUnited States\n1,008,712\n \n1,009,979\n \nOther locations\n872,931\n \n686,598\n \nProperty, Plant, and Equipment, Net\n$\n1,956,544\n \n$\n1,765,180\n \n \nYears Ended March 31,\n2025\n2024\n2023\nRevenues:\nIreland\n$\n107,321\n \n$\n82,695\n \n$\n74,292\n \nUnited States\n4,007,622\n \n3,751,437\n \n3,254,373\n \nOther locations\n1,344,572\n \n1,304,569\n \n1,207,601\n \nTotal Revenues\n$\n5,459,515\n \n$\n5,138,701\n \n$\n4,536,266\n \n90\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\nYears Ended March 31,\n2025\n2024\n2023\nHealthcare:\nCapital equipment\n$\n1,037,200\n \n$\n1,091,537\n \n$\n896,590\n \nConsumables\n1,396,031\n \n1,248,424\n \n1,050,316\n \nService\n1,445,440\n \n1,273,058\n \n1,138,225\n \nTotal Healthcare Revenues \n$\n3,878,671\n \n$\n3,613,019\n \n$\n3,085,131\n \nAST:\nCapital equipment\n$\n30,946\n \n$\n14,519\n \n$\n26,460\n \nService\n1,007,627\n \n939,461\n \n887,971\n \nTotal AST Revenues\n$\n1,038,573\n \n$\n953,980\n \n$\n914,431\n \nLife Sciences:\nCapital equipment\n$\n117,534\n \n$\n155,520\n \n$\n147,420\n \nConsumables\n286,656\n \n251,580\n \n241,114\n \nService\n138,081\n \n164,602\n \n148,170\n \nTotal Life Sciences Revenues\n$\n542,271\n \n571,702\n \n536,704\n \nTotal Revenues\n$\n5,459,515\n \n$\n5,138,701\n \n$\n4,536,266\n \n14. SHARES AND PREFERRED SHARES\nOrdinary Shares\nWe calculate basic earnings per share based upon the weighted average number of shares outstanding. We calculate diluted earnings per share based upon the weighted average number of shares outstanding plus the dilutive effect of share equivalents calculated using the treasury stock method. Income from continuing operations is used as the benchmark to determine whether share equivalents are dilutive or anti-dilutive. The following is a summary of shares and share equivalents outstanding used in the calculations of basic and diluted earnings per share:\nYears ended March 31,\n2025\n2024\n2023\nDenominator \n(\nshares in thousands\n):\nWeighted average shares outstanding—basic\n98,575\n \n98,787\n \n99,706\n \nDilutive effect of share equivalents\n494\n \n572\n \n540\n \nWeighted average shares outstanding and share equivalents—diluted\n99,069\n \n99,359\n \n100,246\n \nOptions to purchase the following number of shares were outstanding but excluded from the computation of diluted earnings per share because the combined exercise prices, unamortized fair values, and assumed tax benefits upon exercise were greater than the average market price for the shares during the periods, so including these options would be anti-dilutive:\nYears ended March 31,\n2025\n2024\n2023\nNumber of ordinary share options\n (\nshares in thousands\n)\n671\n \n606\n \n578\n \nAdditional Authorized Shares\nThe Company has an additional authorized share capital of \n50,000,000\n preferred shares of $\n0.001\n par value each, plus \n25,000\n deferred ordinary shares of €\n1.00\n par value each, in order to satisfy minimum statutory capital requirements for all Irish public limited companies.\n15. REPURCHASES OF ORDINARY SHARES\nOn May 3, 2023 our Board of Directors terminated the previous share repurchase program and authorized a new share repurchase program for the purchase of up to $\n500,000\n (exclusive of fees, commissions, and other charges). As of March 31, 2025, there was $\n300,000\n (exclusive of fees, commissions, and other charges) of remaining availability under the Board authorized share repurchase program. The share repurchase program has no specified expiration date. \n91\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\nUnder the authorization, the Company may repurchase its shares from time to time through open market purchases, including 10b5-1 plans. Any share repurchases may be activated, suspended or discontinued at any time.\n \nDuring fiscal 2025, we repurchased \n907,158\n of our ordinary shares for the aggregate amount of $\n200,000\n (exclusive of fees, commissions, and other charges) pursuant to authorizations under the share repurchase program.  During fiscal 2024, we had no share repurchase activity pursuant to share repurchase program authorizations. During fiscal 2023, we repurchased \n1,563,983\n of our ordinary shares for the aggregate amount of $\n295,000\n (net of fees and commissions) pursuant to the authorizations under the share repurchase program.\n During fiscal 2025, we obtained \n94,577\n of our ordinary shares in the aggregate amount of $\n11,303\n in connection with share-based compensation award programs. During fiscal 2024, we obtained \n76,645\n of our ordinary shares in the aggregate amount of $\n11,765\n in connection with share-based compensation award programs. During fiscal 2023, we obtained \n79,169\n of our ordinary shares in the aggregate amount of $\n13,534\n in connection with share-based compensation award programs.\n16. SHARE-BASED COMPENSATION\nWe maintain a long-term incentive plan that makes available shares for grants, at the discretion of the Board of Directors or  Compensation and Organizational Development Committee of the Board of Directors, to officers, directors, and key employees in the form of stock options, restricted shares, restricted share units, stock appreciation rights and share grants. We satisfy share award incentives through the issuance of new ordinary shares. In recent years, grants have been limited to stock options, restricted shares, and restricted share units. \nStock option awards to employees generally vest and become nonforfeitable in increments of 25% per year over a four-year period, with full vesting four years after the date of grant. Historically, restricted stock awards to employee recipients generally cliff vested on the fourth anniversary of the grant date if the recipient remained in continuous employment through that date. Beginning with fiscal 2024 grants, Company restricted stock (and restricted stock units) generally cliff vest over a three year period after the grant date. However, employees who are grantees of restricted stock and have attained age 55 and been employed for at least five years at the time of the grant or meet these criteria during the term of the grant and are employed in the U.S. or in a few other foreign jurisdictions, or employees who have 25 years of service at the time of grant or meet that criterion during the term of the grant, will be subject to installment vesting rules over the applicable vesting period. Awards to certain employees in the U.S. or a few other jurisdictions may provide for continued vesting after “retirement,” if certain conditions are met.  As of March 31, 2025, \n2,647,200\n shares remained available for grant under the long-term incentive plan.\nThe fair value of share-based stock option compensation awards was estimated at their grant date using the Black-Scholes-Merton option pricing model. This model was developed for use in estimating the fair value of traded options that have no vesting restrictions and are fully transferable, characteristics that are not present in our option grants. If the model permitted consideration of the unique characteristics of employee stock options, the resulting estimate of the fair value of the stock options could be different. The value of the portion of the award that is ultimately expected to vest is recognized as expense over the requisite service periods in our Consolidated Statements of Income. The expense is classified as Cost of revenues or Selling, general, and administrative expenses in a manner consistent with the employee’s compensation and benefits.\nThe following weighted-average assumptions were used for options granted during fiscal 2025, fiscal 2024 and fiscal 2023:\n \nFiscal 2025\nFiscal 2024\nFiscal 2023\nRisk-free interest rate\n4.21\n \n%\n3.59\n \n%\n2.44\n \n%\nExpected life of options\n6.1\n years\n6.0\n years\n5.9\n years\nExpected dividend yield of stock\n0.94\n \n%\n1.08\n \n%\n0.80\n \n%\nExpected volatility of stock\n28.42\n \n%\n27.92\n \n%\n24.49\n \n%\n92\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\nThe risk-free interest rate is based upon the U.S. Treasury yield curve. The expected life of options is reflective of historical experience, vesting schedules and contractual terms. The expected dividend yield of stock represents our best estimate of the expected future dividend yield. The expected volatility of stock is derived by referring to our historical stock prices over a time frame similar to that of the expected life of the grant. An estimated forfeiture rate of \n2.07\n%, \n2.22\n% and \n2.54\n% was applied in fiscal 2025, 2024 and 2023 respectively. This rate is calculated based upon historical activity and represents an estimate of the granted options not expected to vest. If actual forfeitures differ from this calculated rate, we may be required to make additional adjustments to compensation expense in future periods. The assumptions used above are reviewed at the time of each significant option grant, or at least annually.\nA summary of share option activity is as follows:\n \nNumber of\nOptions\nWeighted\nAverage\nExercise\nPrice\nAverage\nRemaining\nContractual\nTerm\nAggregate\nIntrinsic\nValue\nOutstanding at March 31, 2024\n1,869,871\n \n$\n168.22\n \nGranted\n217,426\n \n250.76\n \nExercised\n(\n248,263\n)\n109.27\n \nForfeited\n(\n13,815\n)\n236.93\n \nOutstanding at March 31, 2025\n1,823,883\n \n$\n185.51\n \n5.8\n years\n$\n85,349\n \nExercisable at March 31, 2025\n1,276,312\n \n$\n163.48\n \n4.7\n years\n$\n83,402\n \nWe estimate that \n540,180\n of the non-vested stock options outstanding at March 31, 2025 will ultimately vest.\nThe aggregate intrinsic value in the table above represents the total pre-tax difference between the $\n226.65\n closing price of our ordinary shares on March 31, 2025 over the exercise prices of the stock options, multiplied by the number of options outstanding or outstanding and exercisable, as applicable. The aggregate intrinsic value is not recorded for financial accounting purposes, and the value changes daily based on the daily changes in the fair market value of our ordinary shares.\nThe total intrinsic value of stock options exercised during the years ended March 31, 2025, 2024 and 2023 was $\n30,731\n, $\n18,177\n and $\n6,502\n, respectively. Net cash proceeds from the exercise of stock options were $\n25,469\n, $\n10,472\n and $\n1,828\n for the years ended March 31, 2025, 2024 and 2023, respectively. The tax benefit from stock option exercises w\nas\n $\n7,581\n, \n$\n5,470\n and $\n4,945\n for the years ended March 31, 2025, 2024 and 2023, respectively.\nThe weighted average grant date fair value of stock option grants was $\n67.81\n, $\n54.60\n and $\n50.72\n for the years ended March 31, 2025, 2024 and 2023, respectively.\nA summary of the non-vested restricted share and restricted share unit activity is presented below:\n \nNumber of\nRestricted\nShares\nNumber of Restricted Share Units\nWeighted-Average\nGrant Date\nFair Value\nNon-vested at March 31, 2024\n463,381\n \n28,348\n \n$\n200.04\n \nGranted\n164,530\n \n17,159\n \n228.38\n \nVested\n(\n134,383\n)\n(\n13,375\n)\n186.50\n \nForfeited\n(\n44,397\n)\n(\n2,577\n)\n208.82\n \nNon-vested at March 31, 2025\n449,131\n \n29,555\n \n$\n214.21\n \nRestricted shares and restricted share unit grants are valued based on the closing stock price at the grant date. The value of restricted shares and units at the time of grant that vested during fiscal 2025 was $\n27,728\n.\nAs of March 31, 2025, there was a total of $\n51,059\n in unrecognized compensation cost related to non-vested share-based compensation granted under our share-based compensation plans. We expect to recognize the cost over a weighted average period of \n1.6\n years.\n93\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\n17. FINANCIAL AND OTHER GUARANTEES\nWe generally offer a limited parts and labor warranty on capital equipment. The specific terms and conditions of those warranties vary depending on the product sold and the countries where we conduct business. We record a liability for the estimated cost of product warranties at the time Product revenues are recognized. The amounts we expect to incur on behalf of our Customers for the future estimated cost of these warranties are recorded as a current liability on the accompanying Consolidated Balance Sheets. Factors that affect the amount of our warranty liability include the number and type of installed units, historical and anticipated rates of product failures, and material and service costs per claim. We periodically assess the adequacy of our recorded warranty liabilities and adjust the amounts as necessary.\nChanges in our warranty liability during the periods presented are as follows:\nYears Ended March 31,\n2025\n2024\n2023\nBalance, Beginning of Year\n$\n15,388\n \n$\n13,394\n \n$\n13,892\n \nWarranties issued during the period\n19,175\n \n18,051\n \n13,195\n \nSettlements made during the period\n(\n18,223\n)\n(\n16,057\n)\n(\n13,693\n)\nBalance, End of Year\n$\n16,340\n \n$\n15,388\n \n$\n13,394\n \n18. DERIVATIVES AND HEDGING\nWe utilize foreign currency forward contracts to hedge a portion of our monetary assets and liabilities denominated in foreign currencies, including intercompany transactions. Within each fiscal year, we also utilize foreign currency forward contracts to hedge a portion of our expected non-U.S. dollar-denominated earnings against our reporting currency, the U.S. dollar. Further, we utilize commodity swap contracts to hedge price changes in nickel that impact raw materials included in our Cost of revenues.\nThese contracts are not designated as hedging instruments and do not receive hedge accounting treatment; therefore, changes in their fair value are not deferred but are recognized immediately in the Consolidated Statements of Income. We do not use derivative financial instruments for speculative purposes.\nAt March 31, 2025, we held foreign currency forward contracts to buy \n44.0\n million British pounds sterling and \n15.0\n million euros; and to sell \n13.0\n million Australian dollars. At March 31, 2025, we held commodity swap contracts to buy \n592.4\n thousand pounds of nickel.\n \nAsset Derivatives\nLiability Derivatives\nFair Value at\nFair Value at\nFair Value at\nFair Value at\nBalance Sheet Location\nMarch 31, 2025\nMarch 31, 2024\nMarch 31, 2025\nMarch 31, 2024\nPrepaid & Other\n$\n90\n \n$\n208\n \n$\n—\n \n$\n—\n \nAccrued expenses and other\n—\n \n—\n \n566\n \n1,014\n \nThe following table presents the impact of derivative instruments and their location within the Consolidated Statements of Income:\n \nLocation of (loss) gain recognized in income\nAmount of (loss) gain recognized in income\nYears Ended March 31,\n2025\n2024\n2023\nForeign currency forward contracts\nSelling, general, and administrative\n$\n1,979\n \n$\n1,272\n \n$\n5,036\n \nCommodity swap contracts\nCost of revenues\n(\n200\n)\n(\n1,611\n)\n(\n3,630\n)\n94\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\n19. FAIR VALUE MEASUREMENTS\nFair value is defined as the price that would be received to sell an asset or that would be paid to transfer a liability in an orderly transaction between market participants at the measurement date. We estimate the fair value of financial assets and liabilities using available market information and generally accepted valuation methodologies. The inputs used to measure fair value are classified into three tiers. These tiers include Level 1, defined as observable inputs such as quoted prices in active markets; Level 2, defined as inputs other than quoted prices in active markets that are either directly or indirectly observable; and Level 3, defined as unobservable inputs in which little or no market data exists, therefore requiring the entity to develop its own assumptions. \nThe following table shows the fair value of our financial assets and liabilities at March 31, 2025 and March 31, 2024:\n \n \nFair Value Measurements\n At March 31,\nCarrying Value\nQuoted Prices\nin Active Markets\nfor Identical Assets\nSignificant Other\nObservable Inputs\nSignificant\nUnobservable\nInputs\nLevel 1\nLevel 2\nLevel 3\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nAssets:\nCash and cash equivalents \n$\n171,701\n \n$\n207,020\n \n$\n171,701\n \n$\n207,020\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \nForward and swap contracts \n(1)\n90\n \n208\n \n—\n \n—\n \n90\n \n208\n \n—\n \n—\n \nEquity investments \n(2)\n1,120\n \n4,767\n \n1,120\n \n4,767\n \n—\n \n— \n—\n \n— \nOther investments \n2,977\n \n2,902\n \n2,977\n \n2,902\n \n—\n \n—\n \n—\n \n—\n \nLiabilities:\nForward and swap contracts \n(1)\n$\n566\n \n$\n1,014\n \n$\n—\n \n$\n—\n \n$\n566\n \n$\n1,014\n \n$\n—\n \n$\n—\n \nDeferred compensation plans \n(2)\n1,194\n \n1,186\n \n1,194\n \n1,186\n \n—\n \n—\n \n—\n \n—\n \nTotal debt \n(3)\n2,043,701\n3,206,100\n—\n \n—\n \n1,756,530\n \n2,895,784\n \n—\n \n—\n \nContingent consideration obligations \n(4)\n3,182\n11,000\n—\n \n—\n \n—\n \n—\n \n3,182\n \n11,000\n \n(1)\n \nThe fair values of forward and swap contracts are based on period-end forward rates and reflect the value of the amount that we would pay or receive for the contracts involving the same notional amounts and maturity dates.\n(2)\n \nWe maintain a frozen domestic non-qualified deferred compensation plan covering certain employees, which allowed for the deferral of payment of previously earned compensation for an employee-specified term or until retirement or termination. Amounts deferred can be allocated to various hypothetical investment options (compensation deferrals have been frozen under the plan). We hold investments to satisfy the future obligations of the plan. Employees who made deferrals are entitled to receive distributions of their hypothetical account balances (amounts deferred, together with earnings (losses)). Changes in the fair value of these investments are recorded in the Interest income and miscellaneous (income) expense line of the Consolidated Statements of Income. During fiscal 2025 and fiscal 2024, we recorded gains (losses) of $\n906\n and \n$\n1,060\n, respectively, related to these investments. \n(3) \nWe estimate the fair value of our debt using discounted cash flow analyses, based on our current incremental borrowing rates for similar types of borrowing arrangement\ns. \n(4)\n As of March 31, 2025 and 2024, we had contingent consideration obligations of $\n3.2\n million and $\n11.0\n million arising from prior year acquisitions, respectively. During fiscal 2025, we recorded an adjustment to reduce the fair value of contingent consideration liabilities based on a change in the likelihood of payment. This amount was offset by the impairment of related Patents and Technology intangibles assets and recorded net in the Selling, general, and administrative expenses line of the Consolidated Statements of Income.\n \nAs of March 31, 2025, we also held $\n14.3\n million of other investments without readily determinable fair values measured at cost and classified as level 3. These investments are included in Other assets on the Consolidated Balance Sheets.\n \n95\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\n20. RECLASSIFICATIONS OUT OF ACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS)\nAmounts in Accumulated Other Comprehensive Income (Loss) are presented net of the related tax. Foreign Currency Translation is not adjusted for income taxes. \nAccumulated other comprehensive income (loss) shown in our Consolidated Statements of Shareholders' Equity and changes in our balances, net of tax, for the years ended March 31, 2025, 2024 and 2023 were as follows:\nDefined Benefit \nPlans \n(1)\nForeign Currency Translation\nTotal Accumulated Other Comprehensive Loss\n2025\n2024\n2023\n2025\n2024\n2023\n2025\n2024\n2023\nBeginning Balance\n$\n(\n724\n)\n$\n12\n \n$\n1,276\n \n$\n(\n327,933\n)\n$\n(\n320,722\n)\n$\n(\n211,084\n)\n$\n(\n328,657\n)\n$\n(\n320,710\n)\n$\n(\n209,808\n)\nOther Comprehensive Income (Loss) before reclassifications\n447\n \n615\n \n(\n799\n)\n9,153\n \n(\n7,211\n)\n(\n109,638\n)\n9,600\n \n(\n6,596\n)\n(\n110,437\n)\nAmounts reclassified from Accumulated Other Comprehensive Income (Loss)\n(\n298\n)\n(\n1,351\n)\n(\n465\n)\n27,017\n \n—\n \n—\n \n26,719\n \n(\n1,351\n)\n(\n465\n)\nNet current-period Other Comprehensive Income (Loss)\n149\n \n(\n736\n)\n(\n1,264\n)\n36,170\n \n(\n7,211\n)\n(\n109,638\n)\n36,319\n \n(\n7,947\n)\n(\n110,902\n)\nEnding Balance\n$\n(\n575\n)\n$\n(\n724\n)\n$\n12\n \n$\n(\n291,763\n)\n$\n(\n327,933\n)\n$\n(\n320,722\n)\n$\n(\n292,338\n)\n$\n(\n328,657\n)\n$\n(\n320,710\n)\n(1)\n The a\nmortization (gain) of defined benefit plan costs is reported in the Interest income and miscellaneous expense (income) line of our Consolidated Statements of Income.\n96\nSTERIS PLC AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollars in thousands, except per share amounts and as noted)\nSCHEDULE II – VALUATION AND QUALIFYING ACCOUNTS\nDescription\nBalance at\nBeginning\nof Period\nCharges\nto Costs\nand\nExpenses\n \nCharges\nto Other\nAccounts\n \nDeductions\n \nBalance at\nEnd of\nPeriod\nYear ended March 31, 2025\nDeducted from asset accounts:\nAllowance for credit losses \n(1)\n$\n22,984\n \n$\n9,109\n \n$\n(\n140\n)\n(3)\n$\n(\n7,599\n)\n(4)\n$\n24,354\n \nInventory valuation reserve\n43,893\n \n5,566\n \n(2)\n314\n \n(3)\n—\n \n49,773\n \nDeferred tax asset valuation allowance\n26,374\n \n7,537\n \n(\n425\n)\n(3)\n(\n2,879\n)\n30,607\n \nRecorded within liabilities:\nCasualty loss reserves\n$\n30,736\n \n$\n8,400\n \n$\n427\n \n$\n(\n4,622\n)\n$\n34,941\n \nYear ended March 31, 2024\nDeducted from asset accounts:\nAllowance for credit losses \n(1)\n$\n19,284\n \n$\n11,240\n \n$\n(\n96\n)\n(3)\n$\n(\n7,444\n)\n(4)\n$\n22,984\n \nInventory valuation reserve\n35,601\n \n8,204\n \n(2)\n88\n \n(3)\n—\n \n43,893\n \nDeferred tax asset valuation allowance\n20,315\n \n6,765\n \n52\n \n(3)\n(\n758\n)\n26,374\n \nRecorded within liabilities:\nCasualty loss reserves\n$\n30,437\n \n$\n7,884\n \n$\n(\n2,389\n)\n$\n(\n5,196\n)\n$\n30,736\n \nYear ended March 31, 2023\nDeducted from asset accounts:\nAllowance for trade accounts receivable \n(1)\n$\n19,875\n \n$\n6,991\n \n  \n$\n247\n \n(3)\n$\n(\n7,829\n)\n(4)\n$\n19,284\n \nInventory valuation reserve\n22,617\n \n12,652\n \n(2)\n332\n \n(3)\n—\n \n  \n35,601\n \nDeferred tax asset valuation allowance\n24,691\n \n1,733\n \n  \n(\n530\n)\n(3)\n(\n5,579\n)\n20,315\n \nRecorded within liabilities:\nCasualty loss reserves\n$\n26,126\n \n$\n7,829\n \n  \n$\n2,040\n \n  \n$\n(\n5,558\n)\n$\n30,437\n \n(1)\n \nNet allowance for credit losses and allowance for sales and returns.\n(2)\n \nProvision for excess and obsolete inventory, net of inventory written off.\n(3)\n \nChange in foreign currency exchange rates and acquired reserves.\n(4)\n \nUncollectible accounts written off, net of recoveries.\n97\nTable of Contents\nITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A.\nCONTROLS AND PROCEDURES\nEVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES\nOur management, including the Principal Executive Officer (“PEO”) and Principal Financial Officer (“PFO”), has evaluated the effectiveness of our disclosure controls and procedures, as defined in Exchange Act Rules 13a-15(e) and 15d-15(e), as of the end of the period covered by this Annual Report on Form 10-K. Based on this evaluation, the PEO and PFO have determined that, as of the end of the period covered by this Annual Report on Form 10-K, our disclosure controls and procedures were effective.\nCHANGES IN INTERNAL CONTROLS\nDuring the quarter ended March 31, 2025, there were no changes in our internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in the Exchange Act Rules 13a-15(f). Under the supervision and with the participation of management, including the PEO and PFO, we conducted an evaluation of the effectiveness of internal control over financial reporting as of March 31, 2025 based on the framework in 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation under this framework, management concluded that the internal control over financial reporting was effective as of March 31, 2025. Our evaluation of internal control over financial reporting did not \ninclude the internal controls of the businesses that were acquired during fiscal 2025. Total assets of the acquired businesses represented approximately\n 0.6% of our total assets as of March 31, 2025 and approximately 0.4% of our total revenues for the year ended March 31, 2025. Based on this evaluation under this framework, management concluded that the internal control over financial reporting was effective as of March 31, 2025.\nThe independent registered public accounting firm that audited the financial statements has issued an attestation report\n on internal control over financial reporting.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM \nTo the Shareholders and the Board of Directors of STERIS plc\nOpinion on Internal Control Over Financial Reporting\nWe have audited STERIS plc and subsidiaries’ internal control over financial reporting as of March 31, 2025, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, STERIS plc and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of March 31, 2025, based on the COSO criteria.\nAs indicated in the accompanying Management’s Report on Internal Control Over Financial Reporting, management’s assessment of and conclusion on the effectiveness of internal control over financial reporting did not include the internal controls of the businesses that were acquired during the year ended March 31, 2025, which are included in the fiscal 2025 consolidated financial statements of the Company and constituted approximately 0.6% of total assets as of March 31, 2025 and approximately 0.4% of total revenues for the year then ended. Our audit of internal control over financial reporting of the Company also did not include an evaluation of the internal control over financial reporting of the businesses that were acquired during the year ended March 31, 2025.                                                          \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of March 31, 2025 and 2024, the related consolidated statements of income, comprehensive income (loss), cash flows and shareholders' equity for each of the three years in the period ended March 31, 2025, and the related notes and the financial statement schedule listed in the Index at Item 15(a) and our report dated May 29, 2025 expressed\n \nan unqualified opinion thereon.\n98\nTable of Contents\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nCleveland, Ohio\nMay 29, 2025\n99\nTable of Contents\nITEM 9B.\nOTHER INFORMATION\nDuring the quarter ended March 31, 2025, none of our directors or officers (as defined in Rule 16a-1(f) of the Exchange Act) \nadopted\n, modified or \nterminated\n a \"Rule 10b5-1 trading arrangement\" or a \"non-Rule 10b5-1 trading arrangement\" as such terms are defined under Item 408 of Regulation S-K.\nITEM 9C.    DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT   PREVENT INSPECTIONS\nNot Applicable.\n100\nTable of Contents\nPART III\nITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThis Annual Report on Form 10-K incorporates by reference the information appearing under the caption \"Nominees for Election as Directors,\"  \"Board Meetings and Committees,\" \"Shareholder Nominations of Directors and Nominee Criteria\", \"\nInsider Trading Policy\n\" and \"Shareholder Proposals\" of our definitive proxy statement to be filed with the SEC in connection with our 2025 Annual Meeting of Shareholders (the \"Proxy Statement\").\nOur executive officers serve for a term of one year from the date of election to the next organizational meeting of the Board of Directors and until their respective successors are elected and qualified, except in the case of death, resignation, or removal.  Information concerning our executive officers is contained in Item 1 of Part 1 of this Annual Report under the heading \"Information about our Executive Officers\", and is incorporated herein by reference. We have adopted a code of ethics, our Code of Business Conduct for Employees, that applies to our CEO and CFO and Principal Accounting Officer as well as all of our other employees. We have also adopted a code of ethics, our Director Code of Ethics, which applies to the members of the Company's Board of Directors, including our CEO. Our Code of Business Conduct for Employees and the Director Code of Ethics can be found on our Investor Relations website at www.steris-ir.com. Any amendments or waivers of either of these codes will be made available on this website.\nITEM 11.\nEXECUTIVE COMPENSATION\nThis Annual Report on Form 10-K incorporates by reference the information appearing beginning under the captions \"Executive Compensation,\" \"Non-Employee Director Compensation,\" \"Pay for Performance,\" and \"Miscellaneous Matters\" of the Proxy Statement.\nITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThis Annual Report on Form 10-K incorporates by reference the information appearing under the captions \"Ownership of Voting Securities\" of the Proxy Statement.\nThe table below presents information concerning all equity compensation plans and individual equity compensation arrangements in effect as of our fiscal year ended March 31, 2025.\nPlan Category\nNumber of securities to\nbe issued upon exercise\nof outstanding options,\nwarrants and rights\nWeighted-average\nexercise price of\noutstanding options,\nwarrants and rights\n($)\nNumber of securities\nremaining available for\nfuture issuance under\nequity compensation plans\n(excluding securities\nreflected in column (a))\n(a)\n(b)\n(c)\nEquity compensation plans approved by security holders\n1,823,883\n$185.51\n2,647,200\nEquity compensation plans not approved by security holders\n—\n—\n—\nTotal\n1,823,883\n$185.51\n2,647,200\nITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThis Annual Report on Form 10-K incorporates by reference the information beginning under the captions \"Governance Generally\", \"Board Meetings and Committees\" and \"Miscellaneous Matters\" of the Proxy Statement. \nITEM 14.\nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nThis Annual Report on Form 10-K incorporates by reference the information relating to principal accountant fees and services appearing under the caption \"Independent Registered Public Accounting Firm\" of the Proxy Statement.\n101\nTable of Contents\nPART IV\nITEM 15.     EXHIBITS AND FINANCIAL STATEMENT SCHEDULE\nLIST OF CONSOLIDATED FINANCIAL STATEMENTS AND FINANCIAL STATEMENT SCHEDULE\n(a) (1) The following consolidated financial statements of STERIS plc and subsidiaries are included in Item 8:\nConsolidated Balance Sheets – March 31, 2025 and 2024.\nConsolidated Statements of Income – Years ended March 31, 2025, 2024, and 2023.\nConsolidated Statements of Comprehensive Income – Years ended March 31, 2025, 2024, and 2023.\nConsolidated Statements of Cash Flows – Years ended March 31, 2025, 2024, and 2023.\nConsolidated Statements of Shareholders’ Equity – Years ended March 31, 2025, 2024, and 2023.\nNotes to Consolidated Financial Statements.\n(a) (2) The following consolidated financial statement schedule of STERIS plc and subsidiaries is included in Item 8: \nSchedule II - Valuation and Qualifying Accounts\nAll other schedules for which provision is made in the applicable accounting regulation of the SEC are not required under the related instructions or are inapplicable and, therefore, have been omitted.\n(a) (3) Exhibits\nExhibit\nNumber\nExhibit Description\n2.1\nAmended and Restated Asset Purchase Agreement by and between STERIS Corporation; Becton, Dickinson and Company; and STERIS plc, solely for the purposes set forth in Section 12.21, dated as of August 2, 2023 (filed as Exhibit 2.1 to STERIS plc Form 10-Q for the fiscal quarter ended June 30, 2023 filed August 8, 2023 (Commission File No. 001-38848) and incorporated herein by reference).\n2.2\nEquity Purchase Agreement by and between STERIS Corporation, HuFriedy Group Holding LLC, Hu-Friedy Mfg. Co. LLC and Crosstex International, Inc., dated as of April 10, 2024 (filed as Exhibit 2.1 to STERIS plc Form 10-Q for the fiscal quarter ended June 30, 2024 filed August 8, 2024 (Commission File No. 001-38848) and incorporated herein by reference).\n3.1\nSTERIS plc Memorandum of Association (filed as Exhibit 3.1 to STERIS plc Form 10-K for the fiscal year ended March 31, 2019 (Commission File No. 001-38848) and incorporated herein by reference). \n4.1\nIndenture, dated as of April 1, 2021, among STERIS Irish FinCo Unlimited Company, the guarantors party thereto, and U.S. Bank National Association, as trustee (filed as Exhibit 4.1 to STERIS plc Form 8-K filed April 1, 2021 (Commission File No. 001-38848) and incorporated herein by reference).\n4.2\nFirst Supplemental Indenture, dated as of April 1, 2021, among STERIS Irish FinCo Unlimited Company, the guarantors party thereto and U.S. Bank National Association, as trustee (filed as Exhibit 4.2 to STERIS plc Form 8-K filed April 1, 2021 (Commission File No. 001-38848) and incorporated herein by reference).\n4.3\nForm of 2.700% Notes due 2031 (filed as Exhibit 4.3 to STERIS plc Form 8-K filed April 1, 2021 (Commission File No. 001-38848) and incorporated herein by reference).\n4.4\nForm of 3.750% Notes due 2051 (filed as Exhibit 4.4 to STERIS plc Form 8-K filed April 1, 2021 (Commission File No. 001-38848) and incorporated herein by reference)\n.\n4.5\nDescription of Securities Registered Under Section 12 of the Securities Exchange Act of 1934  (filed as Exhibit 4.5 to STERIS plc Form 10-K for the fiscal year ended March 31, 2021 (Commission File No. 001-38848), and incorporated herein by reference).\n10.1\nSTERIS plc 2006 Long-Term Equity Incentive Plan, as Assumed, Amended and Restated Effective March 28, 2019 (filed as Exhibit 10.1 to STERIS plc Form 8-K filed March 28, 2019 (Commission File No. 001-38848) and incorporated herein by reference).*\n102\nTable of Contents\n10.2\nAmendment No. 1 to STERIS plc 2006 Long-Term Equity Incentive Plan (as Assumed, Amended and Restated Effective March 28, 2019), effective July 27, 2021 (filed as Exhibit 10.2 to Form 10-Q for the fiscal quarter ended September 30, 2021 (Commission File No. 001-38848) and incorporated herein by reference).*\n10.3\nSTERIS Corporation Form of Career Restricted Stock Unit Agreement for Nonemployee Directors (filed as Exhibit 10.33 to Form 10-K for the fiscal year ended March 31, 2013 (Commission File No. 001-14643) and incorporated herein by reference).*\n10.4\nForm of STERIS plc Nonqualified Stock Option Agreement for Employees (filed as Exhibit 10.2 to STERIS plc Form 10-Q for the fiscal quarter ended December 31, 2015 (Commission File No. 001-37614) and incorporated herein by reference).*\n10.5\nSTERIS plc Form of Nonqualified Stock Option Agreement for Nonemployee Directors (filed as Exhibit 10.20 to STERIS plc Form 10-K for the year ended March 31, 2016 (Commission File No. 001-37614) and incorporated herein by reference).*\n10.6\nAmendment to Nonqualified Stock Option Agreement (filed as Exhibit 10.4 to STERIS plc Form 10-Q for the fiscal quarter ended September 30, 2018 (Commission File No. 001-37614) and incorporated herein by reference).*\n10.7\nSTERIS plc Form of Nonqualified Stock Option Agreement for Employees (filed as Exhibit 10.2 to STERIS plc Form 10-Q for the fiscal quarter ended September 30, 2018 (Commission File No. 001-37614) and incorporated herein by reference).*\n10.8\nForm of STERIS plc Nonqualified Stock Option Agreement for Employees (filed as Exhibit 10.3 to STERIS plc Form 10-Q for the fiscal quarter ended September 30, 2019 (Commission File No. 001-38848) and incorporated herein by reference).*\n10.9\nForm of STERIS plc Career Restricted Stock Unit Agreement for Nonemployee Directors (filed as Exhibit 10.21 to STERIS plc Form 10-K for the year ended March 31, 2016 (Commission File No. 001-37614) and incorporated herein by reference).*\n10.10\nForm of STERIS plc Restricted Stock Agreement for Employees (filed as Exhibit 10.16 to STERIS plc Form 10-K for the fiscal year ended March 31, 2023 (Commission File No. 001-38848) and incorporated herein by reference).* \n10.11\nForm of STERIS plc Nonqualified Stock Option Agreement for Employees (filed as Exhibit 10.17 to STERIS plc Form 10-K for the fiscal year ended March 31, 2023 (Commission File No. 001-38848) and incorporated herein by reference).*\n10.12\nDescription of STERIS plc Non-Employee Director Compensation Program (filed as Exhibit 10.1 to STERIS plc Form 10-Q for the fiscal quarter ended September 30, 202\n4\n (Commission File No. 001-38848) and incorporated herein by reference).*\n10.13\nSTERIS Corporation Deferred Compensation Plan Document (As Amended and Restated Effective January 1, 2009) (filed as Exhibit 10.1 to Form 10-Q for the fiscal quarter ended December 31, 2008 (Commission File No. 001-14643) and incorporated herein by reference).*\n10.14\nAmended and Restated Adoption Agreement related to STERIS Corporation Deferred Compensation Plan, dated December 16, 2008 (filed as Exhibit 10.2 to Form 10-Q filed for the fiscal quarter ended December 31, 2008 (Commission File No. 001-14643) and incorporated herein by reference).*\n10.15\nAmendment No. 1 to STERIS Corporation Deferred Compensation Plan Document (As Amended and Restated Effective January 1, 2009), dated November 4, 2011 (filed as Exhibit 10.1 to Form 10-Q for the fiscal quarter ended December 31, 2011 (Commission File No. 001-14643), and incorporated herein by reference).*\n10.16\nSTERIS plc Senior Executive Severance Plan, As Adopted Effective March 28, 2019 (filed as Exhibit 10.3 to STERIS plc 8-K filed March 28, 2019 (Commission File No. 001-38848) and incorporated herein by reference).*\n10.17\nForm of Indemnification Agreement between STERIS Corporation and each of its directors and certain executive officers (filed as Exhibit 10.3 to Form 10-Q for the fiscal quarter ended June 30, 2022 (Commission File No. 001-14643) and incorporated herein by reference). *\n10.18\nForm of Deed of Indemnification for STERIS plc directors and executive officers (filed as Exhibit 10.1 to STERIS plc Form 10-Q for the fiscal quarter ended June 30, 2022 (Commission File No. 001-38848) and incorporated herein by reference). *\n103\nTable of Contents\n10.19\nForm of Deed of Indemnification for STERIS plc directors and executive officers (filed as Exhibit 10.2 to STERIS plc Form 10-Q for the fiscal quarter ended June 30, 2022)(Commission File No. 001-38848) and incorporated herein by reference).*\n10.20\nFirst Amendment dated as of March 19, 2021 to Amended and Restated Note Purchase Agreement, dated as of March 5, 2019, among STERIS Corporation and each of the institutions signatory thereto (filed as Exhibit 10.4 to Form 8-K filed March 23, 2021 (Commission File No. 001-38848) and incorporated herein by reference).\n10.21\nFirst Amendment dated as of March 19, 2021 to Amended and Restated Note Purchase Agreement, dated as of March 5, 2019, among STERIS Corporation and each of the institutions signatory thereto (filed as Exhibit 10.5 to Form 8-K filed March 23, 2021 (Commission File No. 001-38848) and incorporated herein by reference).\n10.22\nFirst Amendment dated as of March 19, 2021 to Amended and Restated Note Purchase Agreement, dated as of March 5, 2019, among STERIS Limited and each of the institutions signatory thereto (filed as Exhibit 10.6 to Form 8-K filed March 23, 2021 (Commission File No. 001-38848) and incorporated herein by reference).\n10.23\nCredit Agreement, dated as of October 7, 2024, among STERIS plc, STERIS Limited, STERIS Corporation, STERIS Irish FinCo Unlimited Company, the lenders party thereto and JPMorgan Chase Bank, N.A., as administrative agent. (filed as Exhibit 10.1 to Form 8-K filed October 7, 2024 (Commission File No. 001-38848) and incorporated here by reference).\n19.1\nSTERIS plc Insider Trading Policy (filed as Exhibit 19.1 to STERIS plc Form 10-K for the year ended March 31, 2024 filed May 29, 2024 (Commission File No. 001-38848) and incorporated herein by reference).\n21.1\nSubsidiaries of STERIS plc.\n22.1\nList of Guarantor Subsidiaries with respect to the 2.700% Notes due 2031 and 3.750% Notes due 2051 issued by STERIS Irish FinCo Unlimited Company (filed as Exhibit 22.1 to Form 10-K for the fiscal year ended March 31, 2021 (Commission File No. 001-38848), and incorporated by reference).\n23.1\nConsent of Independent Registered Public Accounting Firm.\n24.1\nPower of Attorney \n31.1\nCertification of the Principal Executive Officer Pursuant to Exchange Act Rule 13a-14(a)/15d-14(a).\n31.2\nCertification of the Principal Financial Officer Pursuant to Exchange Act Rule 13a-14(a)/15d-14(a).\n32.1\nCertification of the Principal Executive Officer and the Principal Financial Officer Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97.1\nSTERIS plc Policy relating to recovery of erroneously awarded compensation.\n \nfiled as Exhibit 97.1 to STERIS plc Form 10-K for the year ended March 31, 2024 filed May 29, 2024 (Commission File No. 001-38848) and incorporated herein by reference).\n101.SCH\nInline Schema Document.\n101.CAL\nInline Calculation Linkbase Document.\n101.DEF\nInline Definition Linkbase Document.\n101.LAB\nInline Labels Linkbase Document.\n101.PRE\nInline Presentation Linkbase Document.\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibits 101).\n*\nA management contract or compensatory plan or arrangement required to be filed as an exhibit hereto.\n104\nTable of Contents\nITEM 16.     FORM 10-K SUMMARY\n Not Applicable.\n105\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Sections 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on the date indicated.\nSTERIS plc\n(Registrant)\nDate: \nMay 29, 2025\nBy:\n/S/    KAREN L. BURTON  \nKaren L. Burton\nVice President and Chief Accounting Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the date indicated.\nSIGNATURE\n  \nTITLE\n \nDATE\n/S/    DANIEL A. CARESTIO\n  \nPresident, Chief Executive Officer and Director (Principal Executive Officer)\n \nMay 29, 2025\nDaniel A. Carestio\n/S/    MICHAEL J. TOKICH        \n  \nSenior Vice President and Chief Financial Officer (Principal Financial Officer)\n \nMay 29, 2025\nMichael J. Tokich\n/S/    KAREN L. BURTON        \n  \nVice President and Chief Accounting Officer (Principal Accounting Officer)\n \nMay 29, 2025\nKaren L. Burton\n*\n  \nChairman and Director\n \nMay 29, 2025\nMohsen M. Sohi\n*\n  \nDirector\n \nMay 29, 2025\nEsther M. Alegria\n*\nDirector\nMay 29, 2025\nRichard C. Breeden\n*\nDirector\nMay 29, 2025\nDaniel A. Carestio\n*\n  \nDirector\n \nMay 29, 2025\nCynthia L. Feldmann\n*\nDirector\nMay 29, 2025\nChristopher S. Holland\n*\nDirector\nMay 29, 2025\nJacqueline B. Kosecoff\n*\nDirector\nMay 29, 2025\nPaul E. Martin\n*\nDirector\n \nMay 29, 2025\nNirav R. Shah\n  \n*\n  \nDirector\n \nMay 29, 2025\nRichard M. Steeves\n*\nThe undersigned, by signing his name hereto, does sign and execute this Annual Report on Form 10-K pursuant to the Powers of Attorney executed by the above-named directors of the Registrant and filed with the Securities and Exchange Commission on behalf of such directors.\nDate:\nMay 29, 2025\nBy:\n/S/    J. ADAM ZANGERLE     \nJ. Adam Zangerle,\nAttorney-in-Fact for Directors\n106"
  }
}