{
  "ticker": "SW",
  "cik": "0002005951",
  "company_name": "Smurfit Westrock plc",
  "filing_date": "2025-03-07",
  "accession": "0002005951-25-000005",
  "primary_doc": "smur-20241231.htm",
  "item_sections": {
    "item1": "Item 1. “Business — Sales and Marketing” for additional\n \ninformation on our vertical integration.\nIn the year ended \nDecember 31, 2024\n our containerboard mills in North America produced approximately \n8.2 million \ntons, including\n \ntons produced by WestRock before the Combination\n. In the \nyear\n ended \nDecember 31, 2024\n, our paperboard mills in North America\n \nproduced approximately \n3.1\n \nmillion tons, including tons produced by WestRock before the Combination\n.\nAny paper not used in our own operations is sold through our commercial paper operations, generating revenues primarily from the\n \nsale of containerboard, paperboard and specialty grades to external customers, and we serve primarily corrugated packaging, folding\n \ncarton, food service, liquid packaging, tobacco and commercial print markets. We sell our products globally to customers who value\n \nour scale, wide range of products, and service.\n \n              Corrugated Packaging\n \nWe convert corrugated sheets into corrugated products ranging from one-color protective cartons to graphically brilliant point-of-\npurchase packaging. Our corrugated container plants serve local customers and regional and large national accounts. We provide\n \ncustomers with innovative packaging solutions to help them promote and sell their products. We provide structural and graphic design,\n \nengineering services and custom, proprietary and standard automated packaging machines, offering customers turn-key installation,\n \nautomation, line integration and packaging solutions. We offer a machinery solution that creates pouches that replace single-use\n \nplastics, including bubble mailers.\n \n11\nWe design, manufacture and, in certain cases, pack temporary displays for sale to consumer products companies and retailers. These\n \ndisplays are used as marketing tools to support new product introductions and specific product promotions in mass merchandising\n \nstores, supermarkets, convenience stores, home improvement stores and other retail locations. We also design, manufacture and, in\n \nsome cases, pre-assemble permanent displays for these customers. We make temporary displays primarily from corrugated\n \npaperboard. Unlike temporary displays, permanent displays are restocked with our customers’ product; therefore, they are constructed\n \nprimarily from metal, plastic, wood and other durable materials. We manufacture and distribute point of sale material utilizing litho,\n \nscreen and digital printing technologies. We manufacture lithographic laminated packaging for sale to our customers that require\n \npackaging with high quality graphics and strength characteristics.\nWe also have distribution operations that generate revenues primarily from the distribution of packaging products and assembly of\n \ndisplay products. We distribute corrugated packaging materials and other specialty packaging products, including stretch film, void\n \nfill, carton sealing tape and other specialty tapes, through our network of warehouses and distribution facilities. We also provide\n \ncontract packing services, such as multi-product promotional packing and product manipulation, such as multipacks and onpacks.\nWe are the one of the largest manufacturers of corrugated packaging in North America, with operations in the U.S., Canada and\n \nMexico. In the year ended \nDecember 31, 2024\n \nour corrugated operations in North America produced approximately \n83.9 billion\n \nsquare feet, including square feet produced by WestRock before the \nCombination\n.\n \n              Consumer Packaging\n \nOur consumer packaging operations generate revenues primarily from the sale of consumer packaging products such as folding\n \ncartons, inserts and labels. We are one of the largest manufacturers of folding cartons in North America, with operations in the U.S.,\n \nCanada and Mexico. Our customers generally use our inserts and labels to provide customer product information either inside a\n \nsecondary package (e.g., a folding carton) or affixed to the outside of a primary package (e.g., a bottle). Folding cartons typically\n \nprotect customers’ products during shipment and distribution, and employ graphics to promote them at retail. We print, coat, die-cut\n \nand glue the cartons to customer specifications and ship finished cartons to customers for assembling, filling and sealing. We employ a\n \nbroad range of offset, flexographic, gravure, backside printing, coating and finishing technologies, as well as iridescent, holographic,\n \ntextured and dimensional effects to provide differentiated packaging products, and support our customers with new package\n \ndevelopment, innovation and design services and package testing services.\n \nB) Europe, MEA and APAC\n Segment\nOur Europe, MEA and APAC segment includes a system of mills and box plants that primarily produce a full line of containerboard\n \nthat is converted into corrugated containers. We operate in 23 countries across western and eastern Europe. Our main European\n \noperations are in Germany, France, the Netherlands, Italy, the United Kingdom, Spain, Sweden and Austria. \nOur Europe, MEA and\n \nAPAC operational management manage a number of operations outside Europe, including \nfour (non-European) facilities that\n \nmanufacture bag-in-box, located in \nArgentina\n, Canada\n,\n Mexico and the United States, a recently inaugurated \ncorrugated plant in\n \nMorocco, Africa, a containerboard mill and corrugated plant in India, and consumer packaging operations in China, Japan and\n \nAustralia and therefore such operations are included in the Europe, MEA and APAC segments.\n \nSales of our Europe, MEA and APAC segment accounted for \n45%\n of our \nnet sales\n \nto our external customers in \n2024\n. See “Note \n3.\n   \nSegment Information\n” of the Notes to Consolidated Financial Statements, as well as Item 7. “Management’s Discussion and Analysis\n \nof Financial Condition and Results of Operations”, for additional information.\n       \nProducts\nWe are one of the European leaders in terms of capacity in corrugated packaging, containerboard, consumer packaging and bag-in-\nbox. We also operate in several other packaging and paper market segments, such as sack kraft paper, \nmachine\n glazed paper, graphic\n \nboard, solidboard, solidboard packaging \nand\n boxboard\n.\nOur operations in the \nEurope\n, MEA and APAC\n \nsegment are highly integrated, with the total production of the mills in 2024\n \napproximately matching the volume of the containerboard that is converted into corrugated containers in our converting plants.\n \n12\n            Containerboard and Corrugated Containers\nWe operate 14 recycled containerboard mills throughout Europe (two in France, three in Germany, two in each of the United\n \nKingdom, the Netherlands and Italy, and one in each of Spain, the Czech Republic and Serbia).  Our three kraftliner mills, located at\n \nPiteå (Sweden), Facture (France), and Nettingsdorfer (Austria), are among the largest and, we believe, the lowest cost kraftliner mills\n \nin Western Europe.\n \nIn the year ended December 31, 2024, our containerboard mills in  Europe, MEA and APAC produced approximately \n6.2 million tons\n.\n \nWe are one of the leading producers of corrugated containers in Europe by capacity, with 190 production facilities (comprising\n \ncorrugated plants, sheet feeders, sheet plants and other specialized facilities). We have an extensive geographic presence in western\n \nEurope and a growing presence in eastern and southeastern Europe. We also have a containerboard mill and corrugated conversion\n \nfacility in \nIndia\n. \nIn 2024, our corrugated operations in Europe, MEA and APAC produced approximately 97.5 billion square feet.\n              Consumer Packaging\n \nWe operate \n40\n consumer packaging plants in Europe in 12 countries which primarily manufacture folding cartons, labels and leaflets\n \nfor consumer packaging markets. We are one of the largest producers in Europe. We also have operations in China, Japan and\n \nAustralia in consumer packaging.\n              Other Paperboard and Other Paper\nIn the year ended \nDecember 31, 2024\n we produced \napproximately\n 0.7 million tons of other paperboard, comprising sack kraft,\n \nmachine glazed paper, graphic board, solidboard and boxboard in five mills located in Germany and Spain. We are one of the leading\n \nmanufacturers of both solidboard and solidboard packaging in Europe.\nOur containerboard mill in the Netherlands also produces graphic paper for use in inserts. Its production in the year ended\n \nDecember 31, 2024\n was approximately 0.2\n m\nillion tons.\n              Bag-in-box\nWe are one of the largest European manufacturers in the high growth bag-in-box market, a leading European supplier of bags for bag-\nin-box packaging (primarily packaged in corrugated boxes) for the wine market, and a significant global supplier for taps for bag-in-\nbox packaging for the wine market. We have sales offices and agencies across more than 25 countries and nine bag-in-box or tap\n \nmanufacturing facilities located in \nFrance, Spain, Italy, Canada, Argentina, Mexico, Germany and the United States.\nC) \nLatin America Segment\nWe are a leading business in containerboard and corrugated containers in Latin America.\nIn Latin America, we are one of the largest producers of corrugated containers and containerboard, by volume, with corrugated\n \noperations in nine countries. Our largest operations in Latin America are in Brazil and Colombia, with other corrugated operations in\n \nArgentina, the Dominican Republic, Costa Rica, Chile and Peru, and other operations in Ecuador and El Salvador. We have operated\n \ncontinuously in Latin America since 1986.\nReliable third-party data on Latin America is not available and, therefore, statements in relation to our market position in Latin\n \nAmerica are based on management estimates.\nSales of our Latin American segment accounted for \n8%\n of our \nnet sales\n \nin 2024\n. See “Note \n3.   Segment Information\n” of the Notes to\n \nConsolidated Financial Statements, as well as Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of\n \nOperations”, for additional information.\n13\n       Products\nOur Latin American segment mill operations consist of 9 mills in three countries (Brazil, Colombia and Argentina) producing\n \ncontainerboard, consumer packaging board and sack kraft paper, with combined productions of around 1.5 million tons the year ended\n \nDecember 31, 2024\n (of which containerboard represented around 1.3\n \nmillion tons).\nThe Latin American segment also has 28 corrugated plants in 9 countries – Brazil, Colombia, Argentina, Dominican Republic, Costa\n \nRica, El Salvador, Peru, Chile and Puerto Rico. Production for the Latin American segment for the year ended \nDecember 31, 2024\n was\n \napproximately 23 billion square feet of corrugated containers.\nWe also have folding cartons operations\n in Costa Rica and El Salvador and the Dominican Republic, paper \nsack\n operations in\n \nColombia, Ecuador, Costa Rica and the Dominican Republic, and a recycling plant in Nicaragua.\n       Sales and Marketing\nW\ne provide packaging products for the transportation of a diverse range of consumer and industrial goods, such as processed and fresh\n \nfood, agricultural pr\noducts, beverages, industrial and consumer electronics, chemicals and pharmaceuticals, and a range of other\n \nproducts, as well as higher value-added corrugated products, such as those featuring enhanced graphics used for point of sale displays\n \nand consumer and shelf-ready packaging. During 2024, the majority of our products were sold to the fast-moving consumer goods\n \nsector.\n \nNo individual customer accounted for more than 10% of our net sales in 2024. \nWe generally manufacture our products pursuant to our\n \ncustomers’ orders. We believe that we have good relationships with our customers.\nA\n \n proportion of our customers are considered pan-regional, and we have\n teams devoted to managing and servicing \nthe requirements\n \nof these customers. These teams work in conjunction with local operations. \nAnother\n proportion of our customers are multi-national\n \naccounts, serviced in more than one country (or state, in the case of the U.S.) but not across a full region. We have also built teams to\n \nservice their requirements. The remaining customers are considered either multi-site national accounts within a single country or local\n \naccounts, and marketing and sales activity for these customers is primarily undertaken by local businesses. The dual approach to sales\n \nand marketing allows us to remain close to our customers irrespective of size while also\n \nstaying\n updated \non competitors’ offerings\n and\n \nlocal market developments.\nWe market our products\n th\nrough our own sales force. We also market a number of our product\ns, primarily paper, \nthrough independent\n \nsales representatives and independent distributors. We generally pay our sales personnel a combination of base salary, commissions\n \nand annual bonus. We pay our independent sales representatives on a commission basis. Orders from our customers generally do not\n \nhave significant lead times. We discuss net sales to unaffiliated customers through our foreign operations and other financial\n \ninformation in “Note \n3.   Segment Information\n” of the Notes to Consolidated Financial Statements.\nA considerable portion of our converted product sales are made under customer contracts with terms ranging from one to three years.\n \nThese agreements typically provide that the customer will source a specified percentage of its total product requirements from us on an\n \nexclusive basis, and \ntypically allow for raw material cost movements to be passed through to end pricing.\n \nOur marketing strategy focuses on product quality, design differentiation and high caliber customer service. Through continuous\n \ncommunication with customers, our goal is to improve\n our\n service quality and proactively anticipate or respond to customers’ needs.\nThe marketing strategy for our mills is to profitably match the sale of appropriate paper and containerboard to the demand\n \nrequirements of both internal and external converters located within an economically reasonable shipping distance from each mill,\n \nthereby minimizing logistics costs. Our strategy for the corrugated container and other converting plants focuses on both customized\n \nproducts tailored to fit customers’ needs and high-volume sales of commodity products, such as transport packaging for predominantly\n \nlocal markets. Most sales of converted products are made on the basis of short-term orders for specified volumes at market rates.\n \n14\nThese orders are priced based on a number of factors such as currency, volume, weight, applications (printing, die-cutting and\n \nlamination) and geographic area. We seek to maintain a broad customer base for each market to avoid customer concentration.\nSince all of our businesses operate in highly competitive industry segments, we regularly discuss sales opportunities for new business\n \nor for renewal of existing business with customers. Our packaging products compete with packaging made from other materials,\n \nincluding plastics. The primary competitive factors we face include price, design, product innovation, quality, service and\n \nsustainability, with varying emphasis on these factors depending on the product line and customer preferences. Our machinery\n \nsolutions represent one example of how we compete by providing differentiated solutions that create value for our customers. We\n \nbelieve that we compete effectively with respect to each of these factors and we obtain feedback on our performance with periodic\n \ncustomer surveys, among other means.\n       Competition\nWe operate in a competitive global marketplace. The industries in which we operate are highly competitive, and no single company\n \ndominates any of those industries.\nIn North America, our containerboard and paperboard operations compete with integrated and non-integrated national and regional\n \ncompanies operating primarily in North America, and to a limited extent, manufacturers outside of North America. Our competitors\n \ninclude large and small, vertically integrated companies and numerous smaller non-integrated companies. In the corrugated packaging\n \nand folding carton markets, we compete with a significant number of national, regional and local packaging suppliers in North\n \nAmerica. In the promotional point-of-purchase display and converted paperboard products markets, we primarily compete with a\n \nsmaller number of national, regional and local companies offering highly specialized products.\nIn Europe,\n there are different types of companies operating in the vertically integrated containerboard and corrugated container\n \nindustry; some are vertically integrated, having both containerboard and corrugated container capacity, while others may be in only\n \none of those businesses. There are also a number of companies which have a presence in more than one country, while others operate\n \nin a single geography. Our key competitors for containerboard and corrugated containers in western and eastern Europe are the other\n \nleading pan-continental producers of containerboard and corrugated containers. As containerboard and corrugated containers products\n \nare largely standardized products, competition is primarily based on price. Our key competitors for consumer packaging board and\n \nconsumer packaging are also pan-continental players.\nIn Latin America, our key competitors for containerboard and corrugated containers in Latin America are regional or national\n \ncompanies\n \nwithin the countries in which we operate, as there are few pan-continental \nor international producer\ns of containerboard and\n \ncorrugated containers. As containerboard and corrugated containers products are largely standardized products, competition is\n \nprimarily based on price. O\nur\n key competitors for consumer packaging board and consumer packaging are also pan-continental\n \nplayers.\n       Seasonality\nWhile our businesses are not materially impacted by seasonality, there is some variability in demand that occurs from quarter to\n \nquarter, \nwith net sales in the first quarter of each year typically being the lowest\n.\n Generally, we expect more of our earnings and cash\n \nflows to be generated in the second half of the year than in the first half of the fiscal year due to these variations and other factors\n.\n       Raw Materials\nThe primary raw materials used by our mill operations are recycled fiber at our recycled containerboard and paperboard mills and\n \nvirgin fiber from hardwoods and softwoods at our virgin containerboard and paperboard mills. Certain of our virgin containerboard is\n \nmanufactured with some recycled fiber content.\n15\nIn Europe, the principal raw materials for the recycled containerboard, recycled consumer packaging board, solidboard and graphic\n \nboard mills are various grades of recovered papers and, in particular, OCC. In Europe, we source recovered paper in a number of\n \ndifferent ways, which we refer to as “grip” levels, through sources we\n \ndirectly control or with whom we\n \nhave contracts, with the\n \nr\nemainder being acquired primarily under spot purchases. We believe this security of supply to be a significant benefit at times when\n \nrecovered fiber is in short \nsupply\n.\n \nFrom a price perspective, most of our requirements in Europe are linked to official reference prices and are therefore based on market\n \nprices.\nOur kraftliner mills and sack kraft mill require virgin fiber as their principal raw material. We purchase virgin fiber on the open market\n \nthrough contractual arrangements and, in some cases, \ncooperate \nwith landowners to develop forest resources. We are not reliant on any\n \none supplier for a substantial portion of our raw materials sourced from third parties.\nOur overall fiber sourcing for all of our mills in \nNorth America is approximately 55\n% virgin and 45%\n recycled\n. Recycled fiber prices\n \nand virgin fiber prices can fluctuate significantly. We source virgin fiber from third party sources, and recycled fiber through a\n \ncombination of our own depots, long and short term contracts and from the open \nmarket\n.\nOur overall fiber sourcing for our mills in Europe, MEA and APAC is approximately 24% virgin and 76% recycled. Recycled fiber\n \nprices in particular can fluctuate significantly, and may not necessarily move in the same direction or quantum as in other regions. We\n \nsource virgin fiber in Europe from third party sources, and \nrecycled\n fiber through a combination of our own depots, long and short\n \nterm contracts and on the open market.\nOur overall fiber sourcing for our mills in Latin America is approximately 58\n% virgin and 42% recycled\n. Recycled prices in particular\n \ncan fluctuate significantly and vary from country to country in Latin America. We source virgin fiber primarily from our own forestry\n \nbases in Colombia and Brazil, but also from the market. We source recycled fiber through a combination of our own depots, long and\n \nshort term contracts and from the open market.\nContainerboard and paperboard are the primary raw materials used by our corrugated and consumer packaging converting operations\n \nin our operating segments. Our converting operations use many different grades of containerboard and paperboard. We supply\n \nsubstantially all of our converting operations' needs for containerboard and paperboard from our own mills and through the use of\n \ntrade swaps with other manufacturers. These arrangements allow us to optimize our mill system and reduce freight costs. Because\n \nthere are other suppliers that produce the necessary grades of containerboard and paperboard used in our converting operations, we\n \nbelieve we would be able to source significant replacement quantities from other suppliers in the event that we incur production\n \ndisruptions for recycled or virgin containerboard and paperboard.\nEnergy\nWe incur energy costs in our mill operations and the cost of natural gas, oil, electricity and purchased biomass fuel is subject to\n \nfluctuations. In our recycled mills, we primarily use natural gas and electricity, supplemented at certain mills with fuel oil. In our\n \nvirgin fiber mills, we primarily use biomass and natural gas, supplemented at times with fuel oil, and, at a limited number of facilities,\n \ncoal, to generate steam used in the pulping and paper making processes and to generate some or all the electricity used on site. We\n \nprimarily use purchased electricity and natural gas to operate our converting facilities. We generally purchase these products from\n \nsuppliers at market or tariff rates. We use commodity contracts to hedge energy exposures.\n See Item 1. “Business — Governmental\n \nRegulation — Environmental” and Item 7A. “Quantitative and Qualitative Disclosures About Market Risk — “Energy” for additional\n \ninformation.\nTransportation\nWe also incur costs of inbound and outbound freight in our business. Factors that influence our freight expense are distance between\n \nshipping and delivery locations, distance from our facilities to customers and suppliers, mode of transportation (rail, truck, intermodal\n \nand ocean) and freight rates, which are influenced by supply and demand and fuel costs. The principal markets for our products are in\n \nNorth America, Europe and Latin America\n.\n16\nInnovation\nOur approach \nto innovation focuses on helping customers save more, sell more, and optimize packaging solutions to improve\n \nconsumer experience.\nOur innovation model prioritizes agility for faster innovation and smarter testing, promoting global innovation with local relevance,\n \nfostering end-to-end circular packaging innovation, and enabling quicker, better decision making with market-leading capabilities.\nWe emphasize local implementation and strong coordination to optimize efficiency and effectiveness across all operations and\n \ncustomer interactions. To help achieve this, we have 30 interconnected customer-centric Innovation and Experience centers,\n \nstrategically positioned throughout the organization. These hubs are responsible for bringing to life a “local” approach by aligning the\n \nglobal vision with local customization influenced by the culture, trends and customer needs. Additionally, \nour\n European innovation\n \nteam focuses on \ncustomer focused\n initiatives, backed by market-leading capabilities. We also have an innovation center in Richmond,\n \nVirginia which focuses on solutions for converted products, paper and processes.\nWe\n have a suite of tools to support\n our\n innovation and selling efforts. The strength of these tools is the fact that they are internally\n \ndeveloped and are equally available to all operations.\n \nDemonstrating our industry leadership, in 2024, we won 106 awards across a host of categories, including design, safety,\n \nsustainability, community engagement and as a top employer. We were recognized for our technical innovation and creativity by\n \nwinning 16\n \nawards at the Flexographic Industry Association UK awards in addition to 13 WorldStar 2024 awards, more than any other\n \nentrant. We were also the proud winner of PepsiCo’s “Supplier of the Year” award, as well as Mondelez’ “Supplier of the Year”\n \naward.\nOur “Better Planet \nPackaging\n” initiative aims to develop our\n \nsustainable packaging to positively impact global supply chains, \nimprove\n \nour packaging environmental footprint and reduce packaging traces on the planet. Characteristics of Better Planet Packaging include:\n•\noptimized and fit-for-purpose materials;\n•\nreduced carbon footprint;\n•\ndesigned to be recyclable and are actually recycled;\n•\nmanufactured with recycled material when possible, and sustainably sourced virgin material when needed; and\n•\nnaturally biodegradab\nle.\n \nTo support the market in developing and implementing innovative packaging solutions more rapidly, reliably and collaboratively, we\n \nlaunched our Design2Market concept in 2022. With over 80 successful projects executed for leading brands, our customers benefit\n \nfrom a streamlined testing process, reduced risk and sustainable packaging options, all aligned with our commitment to innovation and\n \nsustainability through the Better Planet Packaging initiative.\nSustainability\n       \nCommitment to Sustainability Matters\nAt Smurfit Westrock we are committed to creating packaging solutions that protect what we all care about. We believe this\n \ncommitment is evident in our culture and behaviors at all levels and across all areas of our business, informing our strategic business\n \ndecisions and actions, now and into the future.\n \nAs a global leader in \nsustainable, paper-based packaging\n, we are proud to create solutions from renewable and recyclable materials,\n \nthat help deliver a better future for all. Together, we are committed to being an impactful business and supporting a greener, bluer\n \nplanet.\n \n17\nThere is strong oversight of sustainability and related matters within the Company. The Sustainability Committee of the Company’s\n \nBoard of Directors (the “Board”) has been in place since the completion of the Combination and met on three occasions in 2024.\n \nClimate change is a regular agenda ite\nm\n \nat Board Committee meetings, where the Sustainability Committee reviews various aspects of\n \nthe Company’s climate strategy, stakeholder expectations and the evolving regulatory landscape. The Company’s chief executive\n \nofficer (the “CEO”), through his overall responsibility for the day-to-day oversight of the Company’s business and the implementation\n \nof the Company strategy and policies, is directly responsible for actions governing sustainability, including areas such as climate\n \nchange. He is also responsible for providing that the Company’s purpose, values and culture are instilled throughout the Company.\n \nThe CEO is also a Director of the Board.\n \nAs a responsible company, operating globally, we provide products that are\n \nsustainable, driven by a culture with strong values of\n \nloyalty, integrity, respect and safety at work\n. We understand the challenges facing both our business and the planet and are committed\n \nto doing our part in resolving these critical issues. Our ambition is to deliver sustainable growth for the benefit of all our stakeholders\n \nbased on three pillars: Planet, People and Impactful Business.\n \n       \nPlanet\nThe circular economy has long been the core of our business. We use renewable, recyclable, \nand \nrecycled materials to create\n \ninnovative, sustainable packaging solutions. As a leading consumer of recycled fiber, we play our part in the circular economy by\n \nrecycling\n old paper-based packaging\n.\n The virgin wood fiber we use is sourced from responsibly managed forests and all our fiber-\nbased manufacturing facilities have been chain of custody certified to internationally recognized standards. We work with our\n \ncustomers to help them deliver on their sustainability goals.\n      \n \nPeople and Communities\nHaving engaged employees is critical for the success of our business. We are committed to providing an inclusive and safe place to\n \nwork for the talented people in our globally and culturally diverse organization. Our commitment also extends to all of the\n \ncommunities in which we operate.\n       Impactful Business\nThrough our activities, we aim to create sustainable value for our customers, investors, employees, suppliers and the communities in\n \nwhich we are privileged to operate. We innovate and partner with our customers to create packaging solutions that can replace less\n \nsustainable materials and reduce their carbon footprint. We aim to do this with the highest ethical business standards.\nOur sustainability report is expected to be made available on our website in the second quarter of 2025 at\n \nwww.\nsmurfitwestrock.com/\nsustainability\n. The information contained in our sustainability reports is not incorporated by reference \ninto\n this Form 10-K and should\n \nnot be considered part of this or any other report that we file with or furnish to the SEC.\n       Climate-Related Disclosures\nWe recognize the need for climate-related disclosures as part of our commitment to sustainability and responsible corporate\n \ncitizenship. We plan to publish an overview of our approach to climate risk management in the \nfirst\n half of 2025 which will take into\n \nconsideration the recommendations of the Task Force on Climate-related Financial \nDisclosures \nas part of our sustainability reporting\n \nfor 2024.\n       Sustainability Performance\nDue to the mid-year merger of Smurfit Kappa Group and WestRock, consolidated targets and data are not yet available but are\n \nexpected to form an integral part of our reporting on the 2025 financial year.\n \nFor our 2024 calendar year reporting, we plan to report\n \non a selection of each of the legacy company’s key sustainability metrics.\n \n18\n       Environmental Regulations\nWe may incur additional compliance costs and burdens resulting from the enactment of new laws and regulations aimed at reducing\n \ncarbon emissions, which could take the form of cap-and-trade, carbon taxes or a greenhouse gas (“GHG”) reduction mandate.\nWe may also incur higher prices for certain raw materials and fuels, including biomass and natural gas, related to the transition to a\n \nlower-carbon economy or the enactment of GHG reduction mandates. Also, new climate rules and regulations that result in fuel\n \nefficiency standards could increase our transportation costs.\nCertain jurisdictions in which we have manufacturing facilities or other investments have already taken actions to address climate\n \nchange.\nWe also operate in countries or regions that have already adopted GHG emissions trading schemes such as the European Union where\n \nwe are subject to the impact on energy prices and compliance from the\n E\nU\n Emission Trading \nScheme\n Directive.\nHuman Capital Resources\n \nPeople are our priority. Our primary objective is to provide a great place to work for all our colleagues guided by our commitment to\n \nequal employment opportunity for all. We understand that our success is driven by our highly valued and motivated, diverse teams\n \nacross the world.\n \nBy building a safe and inclusive work environment that empowers and inspires our global workforce, our people will\n \nbe able to thrive and grow our business. Our responsibility as an employer is to create a workplace where people can earn a fair living,\n \nwhere they will be safe and can return home to their families every day, and to provide the conditions where they feel valued and\n \nrespected.\nAs of December 31, 2024, we employed approximately 100,000 people in the \n40\n countries in which we operate\n, of which\n \napproximately 52,500 were in the \nNorth America segment, approximately 37,000 in Europe, MEA and APAC, and approximately\n \n10,500 in the Latin America segment. \nOur businesses can be seasonal in nature which results in peaks and troughs in employment\n \nnumbers across certain sections of our workforce. These changes are managed through fair and flexible hiring practices in accordance\n \nwith applicable laws.\nAs of December 31, 2024, approximately 54% of our hourly employees in the U.S.\n worked pursuant to collective bargaining\n \nagreemen\nts and \n60%\n of our employees in Europe were covered by collective labor agreements. The majority of our unionized\n \nemployees are represented by the United Steel Workers. During 2025, we expect to negotiate for renewal or extension of 27 contracts\n \n(27% of total contracts) that have recently expired or that will expire during the year. During 2024, we experienced no work\n \nstoppages, and we believe we have satisfactory labor relations with our employees.\n \n       Safety, Health and Well-Being\n \nWe promote a strong culture of safety and well-being. The safety and well-being of our employees, contractors and other stakeholders\n \nis paramount to us, and is a core value for Smurfit Westrock. Operating safely is a non-negotiable, and our ‘Safety for Life’ Program is\n \nembedded across many of our operations; this will continue to be deployed in our expanded organization and facilities.\n \nWe strive\n \nevery day to ensure that each of our colleagues return home safely.\n  \nSmurfit Westrock invests substantial time, effort and financial resources to comply with applicable regulations and ensure a safe\n \nworkplace. In 2024, we achieved a lost time incident rate of 0.27, and a global Total Recordable Incident Rate of 0.58 for the\n \ncombined group, based on the number of incidents per 200,000 work hours for employees and contractors globally. Beyond reporting\n \nof incidents, we proactively invest in initiatives, tools, technology and safety programs across the group, to make incident reporting\n \neasier, to ensure the right safety conversations are happening, and to better control and mitigate potential risks.\n \n19\n       An Employer of Choice\nWe are truly a diverse organization with approximately 100,000 colleagues from across the \n40\n countries in which we operate. We are\n \ncommitted to fostering a safe, respectful and inclusive workplace where everyone has a real sense of belonging and can be their\n \nauthentic selves at work every day. We strive for a culture and a workplace where all our employees feel valued, respected, and\n \nempowered to thrive. Our people priorities, which are designed to help us develop a sustainable business, includes a focus on\n \nemployee engagement, people development and social support to our communities.\nWe have a number of communications coordinators and Employee Resource Groups\n \nin each region which focus on the topics that\n \nmatter most locally.\n \nThese groups have been established on a voluntary basis, are employee-led based on common interests and\n \nbackgrounds, and have executive sponsorship to help with momentum, profile and resourcing.\n  \nWe are deeply committed to our communities and collaborating with them. We encourage our local teams to connect with their\n \ncommunities through social and environmental initiatives.\n \nOur Open Community initiatives cover all aspects of our involvement with\n \nour communities around the world, with almost 200 projects in flight centered on four pillars:\n \nEmpowering\n \nCommunities,\n \nEncouraging Wellbeing, Inspiring Our Future and Protecting Our Planet.\n \n       Culture & Engagement\n \nOur culture is rooted in our values, which expects each employee, leader and function to live our values of safety, integrity, respect\n \nand loyalty. We infuse our values through our ways of working and communication across the organization.\n I\nn addition to engagement\n \nand pulse surveys (we anticipate carrying out the first Smurfit Westrock global employee engagement survey in the first half of 2025),\n \nwe also encourage regular, live communication across the organization and host quarterly global town halls with our senior leadership\n \nthat include business updates and employee question-and-answer sessions. In addition, regional business town halls are held on a\n \nregular basis.\n       \nLearning and Development\n \nFor employees, across all levels and businesses in our Company, our learning and development programs equip employees with the\n \nrelevant skills to be effective in their current roles and also to prepare them for the future, both within and outside of Smurfit\n \nWestrock.\n  \nAs a business with a strong track record of \ndeveloping\n talent internally, our talent planning initiatives and programs help our business\n \nto ensure we have the right people, with the right experience ready to progress in their careers as critical roles and talent needs arise.\n  \nThrough our talent cycle of talent identification, succession planning and talent development, we have been able to ensure talent\n \nmobility across the organization in a timely manner into key vacancies.\n  \nThrough our Smurfit Westrock Learning Academy, we have a number of key management development programs which take place\n \nannually\n, including\n Regional Graduate Programs, \nAdvanced Management Development Progra\nm\n and Global Manager Program. These\n \nserve to ensure that we retain, motivate and develop employees, allowing us to have a robust talent pipeline at all career stages.\n \nWe\n \npartner with leading academic \ninstitutions\n,\n including Harvard and INSEAD, which allow us to leverage global best practice in this\n \narea. Since 2016 our flagship leadership development program, Open Leadership, runs in partnership with INSEAD business school\n \nand has seen more than 500 of our senior leaders attend this year long three-module program.\n \nThis investment in our leadership\n \ncommunity is based on the belief that business performance is linked to human behavior.\n20\n       Compensation & Benefits\nWe believe our compensation packages provide the appropriate incentives to attract, retain and motivate our employees, and\n \nultimately to grow our business. Our compensation programs are designed to re-enforce performance, our business growth and our\n \ntalent strategy. We provide base pay that is market relevant and competitive and that aligns with employee positions, skill levels, and\n \nexperience. In addition to base pay, we provide opportunity for employees to receive annual performance-based incentive awards for\n \ncertain jobs and job levels. Our employee benefits packages, which vary by country and region, are competitive and local market\n \nrelevant.\n \nWe continue to evolve our medical and welfare benefits programs to ensure we provide for employees’ health and well-being,\n \nincluding\n employee assistance programs. Additionally, to foster a strong sense of accountability and ownership, and align the interests\n \nof managers with shareholders, we grant stock-based incentives to our most senior manager levels.\nWe are committed to equal pay for equal work. To deliver on that commitment we conduct frequent pay analysis, global pay equity\n \nbenchmarking and job analysis, and review our pay practices annually.\nPatents and Other Intellectual Property\nWe hold a substantial number of foreign and domestic trademarks, trademark applications, trade names, patents, patent applications\n \nand licenses relating to our business, our products and our production processes. Our patent portfolio consists primarily of utility\n \npatents relating to our products and manufacturing operations, including proprietary automated packaging systems. Our company\n \nname and logo, and certain of our products and services, are protected by domestic and foreign trademarks. Our patents, trademarks\n \nand other intellectual property rights, particularly those relating to our manufacturing operations, are important to our operations as a\n \nwhole. Our intellectual property has various expiration dates.\nGovernmental Regulation\n       Health and Safety\nOur business involves the use of heavy equipment, machinery and chemicals and requires the performance of activities that create\n \nsafety exposures. Safeguarding the health, safety and overall welfare of our team is core to how we operate and critical to attracting\n \nand retaining the best talent, while also playing a pivotal role in realizing our business and sustainability objectives. We implement our\n \nhealth and safety requirements through comprehensive safety management systems that include global policies, performance\n \nstandards, implementation tools, guidance documents, standardized forms, best practice sharing and operational learning. We seek to\n \nreduce exposures and eliminate life changing events through engagement, execution of targeted, results-driven activities, and\n \nimplementation of systems that promote continuous improvement.\nWe are subject to a broad range of foreign, federal, state and local laws and regulations relating to occupational health and safety, and\n \nour safety program includes measures required for compliance. We have incurred, and will continue to incur, operating costs and\n \ncapital expenditures to meet our health and safety compliance requirements, as well as to continually improve our safety systems. We\n \nbelieve that future compliance with occupational health and safety laws and regulations will not have a material adverse effect on our\n \nresults of operations, financial condition or cash flows.\nCertain governmental authorities in locations where we do business have established asbestos standards for the workplace. Although\n \nwe do not use asbestos in manufacturing our products, asbestos containing material (“ACM”) is present in some of the facilities we\n \nown or lease. For those facilities where ACM is present and ACM is subject to regulation, we have established procedures for properly\n \nmanaging it.\n21\n       Environmental\nEnvironmental compliance requirements are a significant factor affecting our business. Our manufacturing processes involve the use\n \nof natural resources, such as virgin wood fiber and fresh water, discharges to water, air emissions and waste handling and disposal\n \nactivities. T\nhese processes are subject to numerous federal, state, local and international environmental laws and regulations, as well as\n \nthe requirements of environmental permits and similar authorizations issued by various governmental authorities.\nWe invested approximately $127 millio\nn of capital expenditure during fiscal 2024 on matters relating to environmental compliance.\n \nThis is the combined amount between Smurfit Kappa and \nWestRock;\n however, it is an approximation as the same definitions and\n \nmethodology were not used by the respective companies in calculating it and this number remains subject to review and adjustments\n \nas we refine our methodology post-combination.\nAvailable Information\nOur website address is www.smurfitwestrock.com, and our investor relations website is https://investors.smurfitwestrock.com. We\n \npromptly make available on our investor relations website, free of charge, the reports that we file or furnish with the SEC, corporate\n \ngovernance information (including our Code of Conduct and Code of Ethical Conduct for Directors and Senior Financial Officers) and\n  \nselect press releases. None of the information on our website is incorporated into this Annual Report on Form 10-K or any other\n \nfilings  the Company makes with the SEC. We file annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on\n \nForm 8-K, proxy and information statements, and amendments to reports filed or furnished pursuant to Sections 13(a), 14, and 15(d)\n \nof the Exchange Act. The SEC maintains a website at www.sec.gov that contains reports, proxy and information statements, and other\n \ninformation regarding Smurfit Westrock and other issuers that file electronically with the SEC.\n \nFrom time to time, we have used, and expect in the future to use, our website as a means of disclosing material information to the\n \npublic in a broad, non-exclusionary manner, including for purposes of the SEC’s Regulation Fair Disclosur\ne\n. Financial and other\n \nmaterial information regarding the Company is routinely posted on our website and accessible at \nhttps://\ninvestors.smurfitwestrock.com\n. In order to receive notifications regarding new postings to our website, investors are encouraged to\n \nenroll on our website to receive automatic email alerts.\nInformation About Our Executive Officers\nOur executive officers as of the date of this Annual Report on Form 10-K are as follows:\nAnthony Smurfit,\n 61,\n \nserves as our President \n&\n Group Chief Executive Officer, a position he held since 2024 and as director of\n \nSmurfit Westrock since 2023. He served as a director of Smurfit Kappa, our now subsidiary, and its predecessors from 1989 until the\n \nCombination closed on July 5, 2024 and as Group Chief Executive Officer of Smurfit Kappa between 2015 and July 5, 2024. Prior to\n \nt\nhat\n, he served as Group Chief Operations Officer of Smurfit Kappa from 2002 until 2015. He was Chief Executive of Smurfit Europe\n \nfrom October 1999 to 2002 prior to which he was Deputy Chief Executive of Smurfit Europe and previously Chief Executive Officer\n \nof Smurfit France.\nKen Bowles\n, 53, serves as our Executive Vice Pr\nesident & Grou\np Chief Financial Officer, a position he held since 2024 and as\n \ndirector of Smurfit Westrock since 2023. He joined a predecessor of Smurfit Kappa, our now subsidiary, in 1994 and occupied a\n \nnumber of finance roles in various parts of Smurfit Kappa and its predecessors. He was appointed Group Chief Financial Officer of\n \nSmurfit Kappa in 2016, prior to which he was the Financial Controller between 2010 and 2016. He served as a director of Smurfit\n \nKappa between 2016 and the completion of the Combination on July 5, 2024. Previously, he served as Smurfit Kappa’s Head of Tax\n \nfrom 2007 to 2010, prior to which he was appointed as the first Head of Compliance in 2004.\nLaurent Sellier, \n56,\n serves as our President &\n C\nhief Executive Officer, North America (including\n Mexico\n), a position he held since\n \nthe completion of the Combination on July 5, 2024. He joined Smurfit Kappa, our now subsidiary, in 1994 as an internal auditor, and\n \nsince then has worked in several positions across Smurfit Kappa in France, the United Kingdom, Spain and the Netherlands. Mr.\n \nSellier was appointed Chief Executive Officer of Smurfit Kappa Americas in January 2022. Mr. Sellier was formerly the Chief\n \nOperating Officer of the Smurfit Kappa Europe Paper and Board\n Division.\n22\nSaverio Mayer, \n59\n,\n \nserves as our President \n&\n Chief Executive Officer, Europe, MEA and APAC, a position he held since the\n \ncompletion of the Combination on July 5, 2024. He joined Smurfit Kappa, our now subsidiary, in 1986 and since then has held a\n \nnumber of commercial and operational roles. Mr. Mayer was appointed Chief Executive Officer, Europe, at Smurfit Kappa in April\n \n2017. \nFormerly\n Mr. Mayer was Head of Pan European Sales in 1996, before taking up the position of Chief Executive Officer of\n \nSmurfit Kappa Italy in 2001. In conjunction with his role in Italy, Mr. Mayer also served as the Chief Executive Officer of Smurfit\n \nKappa Russia from 2007 to 2009, Chief Executive Officer of Smurfit Kappa Poland from 2007 to 2011 and since 2011 was\n \nresponsible for the Bag-in-Box (“BIB”) Division. In September 2015, he was appointed Chief Operations Officer of Corrugated and\n \nConverting Europe and was responsible for the operational, sales, and financial performance of the corrugated plants and BIB\n \nDivision.\nAlvaro Henao\n, 59,\n \ncurrently serves as our President &\n \nChief Executive Officer, LATAM, a position he held since February 1, 2025.\n \nPrior to this role, Mr. Henao served as the Company’s Senior Vice President of Integration, the role he has held since 2024.\n \nPreviously, over the course of 36 years, he held various positions of increased responsibility at Smurfit Kappa, our now subsidiary.\n \nMost recently, between 2013 and 2023, he served as Chief Executive Officer, Central \nCluster\n, at Smurfit Kappa.\nBen Garren\n, 63, serves as our EVP \n& Group General Counsel, a position he held since July 8, 2024. Prior to his current position, Mr.\n \nGarren worked for The Coca-Cola Company, a multinational beverage corporation, for more than 24 years, during which he held a\n \nnumber of senior legal roles, including most recently serving as General Counsel, International between 2018 and 2021, overseeing\n \nlegal operations for EMEA, LATAM and APAC Groups, and prior to that, he served as General Counsel, North America. Before\n \njoining The Coca-Cola Company, Mr. Garren practiced law in New York as a litigation associate with leading law firms Baker Botts\n \nLLP and Cravath, Swaine & Moore LLP.",
    "item1a": "Item 1A. “Risk Factors — We are subject to cybersecurity risks that could threaten the\n \nconfidentiality, integrity and availability of data in our systems, and could result in disruptions to our operations and adversely affect\n \nour operations, cash flows and financial condition.”\n \n47\nGovernance\nAs part of our Board’s role in overseeing the Company’s cybersecurity risks, the Board devotes time and attention to cybersecurity\n \nand data privacy-related risks, with the Audit Committee of the Board of Directors (the “Audit Committee”) being primarily\n \nresponsible for overseeing information technology risk exposures, including cybersecurity, data privacy and data security.\n \nThe Audit\n \nCommittee regularly reviews the measures implemented by the Company to identify and mitigate risks from cybersecurity threats. \nAs\n \npart of such reviews, the Audit Committee receives reports and presentations from members of our \nteam responsible for overseeing the\n \nCompany’s cybersecurity risk management, including our Chief Information Officer (“CIO”), other cybersecurity leaders, consisting\n \nof our Chief Information Security Officers \n(“CISOs”), \nand our legal team\n, which may address a wide range of topics including recent\n \ndevelopments, evolving standards, vulnerability assessments, third-party and independent reviews, the threat environment,\n \ntechnological trends and information security considerations arising with respect to the Company’s peers and third parties.\n  \nThe Chair\n \nof the \nAudit Committee and the CFO\n regularly brief the full Board on these matters.\n We have procedures by which certain\n \ncybersecurity incidents are escalated within the Company. Cybersecurity incidents that meet specified criteria for financial,\n \noperational, or otherwise relevant impact are escalated for further review to our Cyber Disclosure Committee, comprised of senior\n \nleaders and subject matter experts representing functional areas such as information security and legal.  The Cyber Disclosure\n \nCommittee will, where appropriate, report certain cybersecurity incidents to the Board in a timely manner.\n \nOur CIO has 30 years of experience in information security and cybersecurity areas. Our cybersecurity leaders, who report into our\n \nCIO,\n have extensive knowledge and skills gained from nearly two decades of work experience at the Company and elsewhere that\n \nhead the teams responsible for implementing, monitoring and maintaining cybersecurity and data protection practices across the\n \nCompany. The cybersecurity leaders are supported by a team with expertise in technical architecture and security operations;\n \ngovernance, risk and compliance; data protection; behavioral change; and cyber incident response, many of whom hold cybersecurity\n \ncertifications and possess deep technical knowledge and experience.\n  \nCybersecurity leaders receive reports on cybersecurity threats from internal cybersecurity sources and industry partners on an ongoing\n \nbasis and regularly review risk management measures implemented by the Company to identify and mitigate data protection and\n \ncybersecurity risks. Our cybersecurity leaders work closely with the legal department to oversee compliance with regulatory and\n \ncontractual security requirements.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity\nRisk Management and Strategy\nWe face various cybersecurity risks, including, but not limited to, risks related to unauthorized access, misuse, data theft, computer\n \nviruses, system disruptions, ransomware, malicious software and other intrusions. We utilize a multilayered, proactive approach to\n \nidentify, evaluate, mitigate and prevent potential cyber and information security threats through our cybersecurity risk management\n \nprogram. \nOur cybersecurity risk management program is integrated into our broader Enterprise Risk Management (“ERM”) program,\n \nwhich is designed to identify, assess, prioritize and mitigate risks across the organization to enhance our resilience and support the\n \nachievement of our strategic objectives\n. This integrated approach helps safeguard that cybersecurity risks are not viewed in isolation,\n \nbut are assessed, prioritized and managed in alignment with the Company’s operational, financial and strategic risks, assisting the\n \nCompany in more effectively managing interdependencies among risks and enhancing risk mitigation strategies. There are also\n \nprocesses, policies, procedures, operations, technologies and systems in place within our cybersecurity risk management program that\n \npertain to legacy companies as a result of our Combination. Though these remain to be fully integrated as part of the Combination,\n \nsuch integration will be a major focus over the year. Cybersecurity risk measures or governance described herein apply to our whole\n \nCompany, unless otherwise specified.\n \n46\nWe devote resources to protecting the security of our computer systems, software, networks, data, and other technology assets. The\n \nCompany follows cybersecurity control frameworks based on industry standards.  We also employ systems and processes designed to\n \noversee, identify, and reduce the potential impact of a security incident originating from a third-party vendor, service provider or\n \ncustomer.  We have cybersecurity architecture practices in place to promote robust architecture design in our technology and to foster\n \na standardized security landscape. We have security operations teams that provide 24/7 monitoring of our IT environment for any\n \nindications of compromise and incident response processes to react as necessary. In addition to our internal cybersecurity capabilities,\n \nwe also regularly engage other third-party specialists to assist with independent reviews of our security posture. For instance, external\n \npenetration testing is completed on an annual basis by specialist third-parties\n.\n As part of our overall risk mitigation strategy, the\n \nCompany also maintains cyber insurance coverage; however, such insurance may not be sufficient in type or amount to cover us\n \nagainst claims related to security breaches, cybersecurity incidents and other related breaches.\n \nWe deliver cybersecurity courses and awareness training on information security to our employees with access to Company email or\n \ndevices at least annually. Additional cybersecurity trainings are made available for all employees throughout the year, including\n \nphishing, social engineering and other cybersecurity training as well as targeted training for specific roles based on responsibilities and\n \nrisk level.\n  \nThe Company has cybersecurity teams and incident response processes focusing on industry standard incident response stages, such as\n \ninvestigation, containment, mitigation, and recovery. These processes provide a standardized approach when responding to\n \ncybersecurity threats or security incidents and include procedures for communication with senior management and key stakeholders,\n \nas appropriate. Our incident response processes align with National Institute of Standards and Technology (“NIST”) standards and are\n \ntested via externally led tabletop exercises, at least annually. In the event of an incident, the cybersecurity team assesses, among other\n \nfactors, supply chain disruption, data and personal information loss, business operations disruption, and projected cost and potential\n \nfor reputational harm, with participation from senior management, technical staff, and legal support, as appropriate. As part of the\n \nannual cybersecurity awareness training program, employees are informed of their responsibilities to report an incident to the\n \ncybersecurity team, supporting awareness of the importance of incident response across the Company's workforce.\n \nIn order to oversee and identify risks from cybersecurity threats associated with the Company’s business partners, as well as our use of\n \nthird-party service providers, we maintain various processes and procedures to evaluate and/or monitor cybersecurity threats\n \nassociated with third parties.\n We have information technology disaster recovery plans in place which are regularly tested.\n \nAdditionally, we have business continuity processes in place. Cybersecurity threats are constantly expanding and evolving, becoming\n \nincreasingly sophisticated and complex, increasing the difficulty of detecting and defending against them and maintaining effective\n \nsecurity measures and protocols. Due to evolving cybersecurity threats, it has and will continue to be difficult to prevent, detect,\n \nmitigate, and remediate cybersecurity incidents, and the Company has been and continues to be the target of cybersecurity incidents\n \nand network disruptions. \nDuring the periods covered by this report, we believe that the risks posed by such cybersecurity threats have\n \nnot materially affected the Company and its business strategy, results of operations and financial condition, and as of the date of this\n \nreport, the Company is not aware of any material risks from cybersecurity threats that are reasonably likely to do so, however, we\n \ncannot eliminate all risks from cybersecurity threats or provide assurances that the Company will not be materially affected by such\n \nrisks in the future.\n For further information, see"
  }
}