{
  "ticker": "SWK",
  "cik": "0000093556",
  "company_name": "STANLEY BLACK & DECKER, INC.",
  "filing_date": "2025-02-18",
  "accession": "0000093556-25-000007",
  "primary_doc": "swk-20241228.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nStanley Black & Decker, Inc. (\"the Company\") was founded in 1843 by Frederick T. Stanley and incorporated in Connecticut in 1852. In March 2010, the Company completed a merger with The Black & Decker Corporation (“Black & Decker”), a company founded by S. Duncan Black and Alonzo G. Decker and incorporated in Maryland in 1910. At that time, the Company changed its name from The Stanley Works to Stanley Black & Decker, Inc. The Company’s principal executive office is located at 1000 Stanley Drive, New Britain, Connecticut 06053 and its telephone number is (860) 225-5111.\nThe Company is a global provider of hand tools, power tools, outdoor products and related accessories, as well as a leading provider of engineered fastening solutions, with 2024 consolidated annual revenues of $15.4 billion. Approximately 62% of the Company’s 2024 revenues were generated in the United States, with the remainder largely from Europe (16%), emerging markets (13%) and Canada (5%).   \nIn recent years, the Company has re-shaped its portfolio through a series of divestitures. In July 2022, the Company sold its Convergent Security Solutions (\"CSS\") business comprised of the commercial electronic security and healthcare businesses for net proceeds of $3.1 billion and its Mechanical Access Solutions (\"MAS\") business comprised of the automatic doors business for net proceeds of $916 million. In August 2022, the Company sold its Oil & Gas business comprised of the pipeline services and equipment businesses. In April 2024, the Company sold its Infrastructure business, comprised of the attachment and handheld hydraulic tools business, for net proceeds of $729 million. These recent divestitures are part of the Company's strategic commitment to simplify and streamline its portfolio to focus on its leading market positions in tools and outdoor, as well as engineered fastening systems.  \nRefer to \nNote S, Divestitures\n, of the \nNotes to Consolidated Financial Statements\n in \nItem 8\n for further discussion.\nLeveraging the benefits of a more focused portfolio, the Company initiated a business transformation in mid-2022 that includes reinvestment for faster growth as well as a $2.0 billion Global Cost Reduction Program through 2025. The Company’s primary areas of multi-year strategic focus remain unchanged as follows:\n•\nAdvancing innovation, electrification and global market penetration to achieve mid-single digit organic revenue growth (2 to 3 times the market);\n•\nStreamlining and simplifying the organization, and investing in initiatives that more directly impact the Company's customers and end users;\n•\nReturning adjusted gross margins to historical 35%+ levels by accelerating the operations and supply chain transformation to improve fill rates and better match inventory with customer demand; and\n•\nPrioritizing cash flow generation and inventory optimization.\nIn terms of capital allocation, the Company remains committed, over time, to returning excess capital to shareholders through a strong and growing dividend as well as a preference toward opportunistically repurchasing shares. In the near term, the Company intends to direct any capital in excess of the quarterly dividend on its common stock toward debt reduction and internal growth investments. \nThe Company’s business strategy is designed to drive long-term value for its stakeholders by creating a simplified and focused organization, investing in core growth and innovation to be a market leader, and delivering for its customers, end users and shareholders. The Company has accordingly focused its sustainability efforts to better align with this business strategy. The Company’s sustainability approach is comprised of three impact pillars of People, Product, and Planet–which guide the Company’s focus and initiatives for sustainable performance. The Company’s most recent Impact Report provides an overview of the Company’s priority impact goals and progress. To learn more about the Company’s sustainability strategy and sustainability efforts, please view the most recent Impact Report on the Company's website. As explained in the most recent Impact Report, these goals make a number of assumptions and measurements of progress against such goals are based on certain methodologies and there are no assurances that those assumptions or methodologies will be correct or that such goals will be achieved or retained. The Impact Report is not, and is not intended to be, part of this Annual Report on Form 10-K and is not incorporated into this report by reference.\nDescription of the Business\nThe Company’s operations are classified into two reportable business segments: Tools & Outdoor and Industrial. Both reportable segments have significant international operations and are exposed to translational and transactional impacts from fluctuations in foreign currency exchange rates. \nAdditional information regarding the Company’s business segments and geographic areas is incorporated herein by reference to the material captioned “\nBusiness Segment Results\n” in \nItem 7\n and \nNote O, Business Segments and Geographic Areas\n, of the \nNotes to Consolidated Financial Statements\n in \nItem 8\n.\n3\nTools & Outdoor\nThe Tools & Outdoor segment is comprised of the Power Tools Group (\"PTG\"), Hand Tools, Accessories & Storage (\"HTAS\"), and Outdoor Power Equipment (\"Outdoor\") product lines. Annual revenues in the Tools & Outdoor segment were $13.3 billion in 2024, representing 87% of the Company’s total revenues. The segment is a worldwide leader in the tools and outdoor markets and carries iconic brands in the industry, including DEWALT®, CRAFTSMAN®, STANLEY®, BLACK+DECKER® and CUB CADET®. \nThe PTG product line includes both professional and consumer products. Professional products, primarily under the DEWALT® brand, include professional grade corded and cordless electric power tools and equipment including drills, impact wrenches and drivers, grinders, saws, routers, sanders, and concrete prep and placement tools as well as pneumatic tools and fasteners including nail guns, nails, staplers and staples, and concrete and masonry anchors. DIY and tradesperson focused products include corded and cordless electric power tools sold primarily under the CRAFTSMAN® and STANLEY® brands, and consumer home products such as household power tools, hand-held vacuums, and small appliances primarily under the BLACK+DECKER® brand.\nThe HTAS product line sells hand tools, power tool accessories and storage products primarily under the DEWALT®, CRAFTSMAN® and STANLEY® brands. Hand tools include measuring, leveling and layout tools, planes, hammers, demolition tools, clamps, vises, knives, saws, chisels, material handling, and industrial and automotive tools. Power tool accessories include drill bits, screwdriver bits, router bits, abrasives, saw blades and threading products. Storage products include tool boxes, sawhorses, cabinets and engineered storage solution products.\nThe Outdoor product line primarily sells corded and cordless electric lawn and garden products, including hedge trimmers, string trimmers, lawn mowers, pressure washers and related accessories, and gas powered lawn and garden products, including lawn tractors, zero turn ride on mowers, walk behind mowers, snow blowers, residential robotic mowers, hand-held outdoor power equipment, garden tools, and parts and accessories to professionals and consumers under the DEWALT®, CRAFTSMAN®, CUB CADET®, BLACK+DECKER®, and HUSTLER® brand names.\nThe segment sells its products to professional end users, distributors, independent dealers, retail consumers and industrial customers in a wide variety of industries and geographies. The majority of sales are distributed through retailers, including home centers, mass merchants, hardware stores, and retail lumber yards, as well as third-party distributors, independent dealers, and a direct sales force.\nIndustrial\nThe Industrial segment is comprised of the Engineered Fastening business and the Infrastructure business prior to its sale in April 2024. Annual revenues in the Industrial segment, inclusive of the Infrastructure business through the date of sale, were $2.1 billion in 2024, representing 13% of the Company’s total revenues. \nThe Engineered Fastening business is a global leader of highly engineered, application-based solutions. The business primarily sells highly engineered components such as fasteners, fittings and various engineered products, which are designed for specific application across multiple verticals. The product lines include externally threaded fasteners, blind rivets and tools, blind inserts and tools, drawn arc weld studs and systems, engineered plastic and mechanical fasteners, self-piercing riveting systems, precision nut running systems, micro fasteners, high-strength structural fasteners, axel swage, latches, heat shields, pins, and couplings. The business sells to customers in the automotive, manufacturing, electronics, construction, and aerospace industries, amongst others, and its products are distributed through a direct sales force and, to a lesser extent, third-party distributors.\nOther Information\nCompetition\nThe Company competes on the basis of its reputation for innovation and product quality, its well-known brands, its commitment to customer service, its strong customer relationships, the breadth of its product lines focused on core end-user segments, and customer value propositions.\nThe Company encounters active competition in the Tools & Outdoor and Industrial segments from both larger and smaller companies that offer the same or similar products and services or that produce different products appropriate for the same uses. Certain large customers offer private label brands (“house brands”) that compete across a wide spectrum of the Company’s Tools & Outdoor segment product offerings. \nMajor Customers\n4\nA significant portion of the Company’s Tools & Outdoor products are sold to home centers and mass merchants in the U.S. and Europe. A consolidation of retailers both in North America and abroad has occurred over time. While this consolidation and the domestic and international expansion of these large retailers have provided the Company with opportunities for growth, the increasing size and importance of individual customers create a certain degree of exposure to potential sales volume loss. Lowe's accounted for approximately 14%, 14% and 15% of the Company's consolidated net sales in 2024, 2023 and 2022, respectively, while The Home Depot accounted for approximately 14%, 13% and 13% of the Company's consolidated net sales in 2024, 2023 and 2022, respectively. No other customer exceeded 10% of the Company's consolidated net sales in 2024, 2023 or 2022. \nWorking Capital\nThe Company continues to practice the operating principles encompassed by Operational Excellence, one element of the supply chain transformation, leveraging the principles of sales and operations planning, operational lean, global supply management, order-to-cash excellence, and upskilling the Company's workforce. The Company aims to develop standardized business processes and system platforms to reduce costs and provide scalability. Working capital turns were 4.9 at the end of 2024, up 0.7 turns from 2023, driven by the Company's continued focus on strategic inventory management and working capital efficiency. The Company plans to continue leveraging Operational Excellence to generate ongoing improvements in working capital turns, cycle times, and customer service levels. \nRaw Materials\nThe Company’s products are manufactured using resins, ferrous and non-ferrous metals including, but not limited to, steel, zinc, copper, brass, aluminum and nickel. The Company also purchases components such as batteries, motors, engines, transmissions, and electronic components to use in manufacturing and assembly operations along with resin-based molded parts. The raw materials required are procured globally and generally available from multiple sources at competitive prices. As part of the Company's Enterprise Risk Management, the Company has implemented a supplier risk mitigation strategy in order to identify and address any potential supply disruption or material scarcity issues associated with commodities, components, finished goods and critical services. The Company does not anticipate difficulties in obtaining supplies for any raw materials used in its production processes and has maintained the proactive measures taken in 2022 to secure energy supply in its European factories to insulate the Company's production from supply constraints in the region.\nPatents and Trademarks\nNo business segment is solely dependent, to any significant degree, on patents, licenses, franchises or concessions, and the loss of one or several of these patents, licenses, franchises or concessions would not have a material adverse effect on any of the Company's businesses. The Company owns numerous patents, none of which individually are material to the Company's operations as a whole. These patents expire at various times over the next 20 years. The Company holds licenses, franchises and concessions, none of which individually or in the aggregate are material to the Company's operations as a whole. These licenses, franchises and concessions vary in duration, but generally run from one to 40 years. \nThe Company has numerous trademarks that are used in its businesses worldwide. In the Tools & Outdoor segment, significant trademarks include DEWALT®, CRAFTSMAN®, STANLEY®, BLACK+DECKER®, DEWALT FLEXVOLT®, DEWALT POWERSTACK®, DEWALT POWERSHIFT™, IRWIN®, LENOX®, PORTER-CABLE®, BOSTITCH®, FATMAX®, Powers®, Guaranteed Tough®, MAC TOOLS®, PROTO®, Vidmar®, FACOM®, Expert®, LISTA®, MTD®, CUB CADET®, TROY-BILT®, HUSTLER®, and the yellow & black color scheme for power tools and accessories. Significant trademarks in the Industrial segment include STANLEY®, NELSON®, CribMaster®, POP®, Avdel®, Tucker®, NPR®, Spiralock®, CAM®, Bristol Industries®, Voss™, Aerofit™, EA Patten™, Integra®, and Optia®. The terms of these trademarks typically vary from 10 to 20 years, with most trademarks being renewable indefinitely for like terms.\nResearch and Development Costs\nResearch and development costs, which are classified in Selling, general and administrative (\"SG&A\"), were $328.8 million, $362.0 million and $357.4 million, or 2.1%, 2.3%, and 2.1% of net sales, for fiscal years 2024, 2023 and 2022, respectively. The 2024 investment reflects a modest decline versus prior year due to the Infrastructure divestiture and more focused spend in the outdoor product line. The Company continues to invest in its innovation model targeting key end-user segments with products designed to deliver against the attributes of productivity, quality and safety, and places an emphasis on electrification. \nGovernmental Regulations\nThe Company's operations are subject to numerous federal, state and local laws and regulations, both within and outside the U.S., in areas such as environmental protection, international trade, anti-corruption, data privacy, tax, consumer protection, government contracts, climate change and others. The Company is subject to import and export controls, tariffs, and other \n5\ntrade-related regulations and restrictions in the countries in which it has operations or otherwise does business. These controls, tariffs, regulations, and restrictions have had, and may continue to have, a material impact on the Company's business, including its ability to sell products and to manufacture or source components. Refer to",
    "item1a": "Item 1A. Risk Factors\n in \nPart I\n of this Annual Report on Form 10-K, which should be read in conjunction with the foregoing information, for additional information on cybersecurity risks the Company faces.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nThe Company has a comprehensive cybersecurity program to assess, identify and manage risks from cybersecurity threats that may result in adverse effects to the confidentiality, integrity, and availability of its information systems and oversee compliance with applicable regulatory, operational, and contractual requirements.\n \nCyber Incident Response Team and \nGovernance\nBoard of Directors\nThe Board of Directors (the \"Board\") has the primary responsibility for oversight of cybersecurity matters. This responsibility had been previously delegated to the Audit Committee. The Board regularly reviews compliance and disclosure control procedures for cybersecurity matters. The Board also receives quarterly briefings from members of management responsible for cybersecurity and digital risk management for the Company, including the Vice President and \nChief Information Officer (the “CIO”)\n, Chief Information Security Officer (the “CISO”) and Senior Vice President, General Counsel and Secretary (the “General Counsel”), as well as third-party cybersecurity advisors, on the Company’s cybersecurity program, including data protection and cybersecurity risks and the Company’s new and existing cyber risk controls intended to mitigate them, as appropriate. The Company has protocols and procedures by which certain cybersecurity incidents are escalated within the Company and, where appropriate, reported promptly to the Board.\nManagement\nAt the management level, oversight of risks from cybersecurity threats has been integrated into the Company’s overall risk management processes. \nThe Senior Risk Council has broad oversight of the Company’s risk management processes, and is also responsible for the assessment and management of risks from cybersecurity threats. The Senior Risk Council is comprised of senior management personnel representing different functional and business areas, including the Chief Executive Officer; Chief Operating Officer (\"COO\"); Chief Financial Officer; General Counsel; Treasurer; and CIO, as well as other senior business leaders. \nThe Company believes the experience that these senior management personnel have from serving on the Senior Risk Council provides them with an understanding of the Company’s risk management processes overall, and individual members are able to provide further insight to the risk analysis process based on their functional area of expertise within the business.\n \n22\nThe CIO also has extensive leadership experience in computer product engineering and information technology fields, including responsibility for overseeing cybersecurity risk management and digital risk management. The CIO also holds a bachelor’s degree in computer science. The Senior Risk Council meets regularly to discuss the risk management measures implemented by the Company, including measures to identify and mitigate data protection and cybersecurity risks. The Senior Risk Council receives regular updates on cybersecurity incidents from the CISO and CIO.\nThe Company’s CISO is the member of management principally responsible for overseeing the Company’s cybersecurity risk management program, under the CIO's leadership and in coordination with other business leaders across the Company, including legal, product engineering management, internal audit, finance and risk management. The CISO has extensive cybersecurity knowledge and skills gained from over 20 years of technical and business experience in the cybersecurity and information security fields, including as a Chief Information Security Officer and through other leadership and technical roles in IT governance and strategy, security risk and compliance, corporate product security and data privacy, and IT infrastructure.  She also holds a Master of Science degree in Information and Cybersecurity from the University of California, Berkeley.\n \nThe CISO reports directly to the CIO who in turn reports directly to the COO. \nThe CISO receives reports on cybersecurity threats from members of the Cyber Security Office on an ongoing basis and, in conjunction with the Senior Risk Council, regularly reviews risk management measures implemented by the Company to identify and mitigate data protection and cybersecurity risks.\n The CISO and CIO also work closely with the Company's legal department to oversee compliance with applicable legal, regulatory and contractual security requirements.\nInternal Cybersecurity Team\nThe Company's Cyber Security Office, led by the CISO, is responsible for the implementation, monitoring, and maintenance of cybersecurity governance, operations and data protection practices across the Company. The Information Technology organization, led by the CIO, is responsible for the implementation of cybersecurity technical controls. Reporting to the CISO are a number of experienced information security directors responsible for various parts of the Company’s business, each of whom is supported by a team of trained cybersecurity professionals. The team also holds a number of industry recognized certifications such as Certified Information Systems Security Professional, Certified Information Security Manager, Certified in Risk and Information Systems Control, Certified Information Systems Auditor, Certified Network Defense Architect, Certified Cloud Security Professional, Certified Secure Software Lifecycle Professional, and Certified Ethical Hacker, among others. In addition to its internal cybersecurity capabilities, the Company also regularly engages assessors, consultants, auditors, or other third parties to assist with assessing, identifying, and managing cybersecurity risks.\nRisk Management & Strategy\nThe Company has adopted information security policies that establish requirements and responsibilities with respect to the protection of the Company’s interests and information technology assets against loss, improper disclosure and unauthorized modification. The Company regularly educates and shares best practices with its employees to raise awareness of cybersecurity threats and the Company’s information security program, which the Company believes creates a culture of shared responsibility for the security of sensitive data and the Company’s network. All employees are regularly offered information security and protection training, including specialized training for employees exposed to sensitive information, which prompt them to certify their awareness of and compliance with applicable information technology policies and additional technology and cybersecurity standards. The Company deploys technical safeguards that are designed to protect the Company’s information systems from cybersecurity threats, including firewalls, encryption intrusion prevention and detection systems, anti-malware functionality, data monitoring, endpoint extended detection and response, architecture controls, access controls and ongoing vulnerability assessments.\nThe Company has adopted a Cybersecurity Incident Response Plan (the “IRP”) that applies in the event of a cybersecurity threat or incident, which is designed to protect the Company’s information systems from cybersecurity threats and to promptly respond to cybersecurity incidents. The IRP sets out a coordinated approach to investigating, containing, documenting and mitigating incidents, including reporting findings and keeping senior management and other key stakeholders informed and involved as appropriate. To facilitate the success of this program, multi-disciplinary teams throughout the Company are deployed to address cybersecurity threats and to respond to cybersecurity incidents in accordance with the IRP. Through the ongoing communications among these teams, the CISO, in coordination with the legal department and the Senior Risk Council, monitor the prevention, detection, mitigation and remediation of cybersecurity incidents, and report such incidents to the Board when appropriate, as discussed above. In general, the IRP leverages the National Institute of Standards and Technology guidance. The IRP applies to all Company personnel who provide or deliver technology systems (including employees, contractors and service providers). \nAs part of the Company’s cybersecurity risk management strategy, the Company takes measures to test and improve its cybersecurity program, including reviewing and updating the information technology policies and IRP, engaging independent \n23\nthird-party consultants to conduct regular assessments of its cyber security maturity against industry best practice frameworks and recommend program enhancements, and conducting tabletop exercises. The Company also engages in internal and external audits to meet its regulatory obligations or customer requirements. The assessment summaries and action plans are shared with the Board as part of the regular briefings provided by the CIO and CISO.\nThe Company has processes and procedures as part of its centralized supplier risk management system to oversee, identify, assess and reduce cybersecurity threats and risks associated with key third-party service providers.\n As part of this process, the Company utilizes external frameworks and tools to provide assessment scoring, planning and monitoring against cybersecurity threats and risks and remediation recommendations, as applicable. Updates on third-party service provider risks are included in regular briefings to the Senior Risk Council by the CISO and CIO and escalated to the Board as appropriate.\n \nCybersecurity Risks, Threats & Incidents\nRisks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have not materially affected the Company, including its business strategy, results of operations or financial condition, and the Company does not believe that such risks are reasonably likely to have such an effect over the long term. As of the date of this report, the Company has not experienced a cybersecurity incident or third-party information security breach in the last three fiscal years that has materially affected the Company, including its business strategy, results of operations or financial condition.\n \nThe Company deploys measures which it believes leverage industry accepted frameworks to deter, prevent, detect, respond to, and mitigate these threats. The Company has invested and continues to invest in risk management and information security and data privacy measures it believes are appropriate to protect its systems and data, including employee and critical service provider training, organizational investments, incident response plans, tabletop exercises and technical defenses. Despite these efforts, cybersecurity incidents (against the Company or parties with whom the Company contracts), depending on their nature and scope, could potentially result in the misappropriation, disclosure, destruction, corruption or unavailability of critical data and confidential or proprietary information (the Company's or that of third parties) and the disruption of business operations. Refer to"
  }
}