{
  "ticker": "SYK",
  "cik": "0000310764",
  "company_name": "STRYKER CORP",
  "filing_date": "2025-02-12",
  "accession": "0000310764-25-000023",
  "primary_doc": "syk-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n50\nSTRYKER CORPORATION\n2024 FORM 10-K\nPART I\nITEM 1.\nBUSINESS.\nStryker Corporation (Stryker or the Company) is a global leader in medical technologies and, together with our customers, we are driven to make healthcare better. We offer innovative products and services in MedSurg, Neurotechnology and Orthopaedics that help improve patient and healthcare outcomes. Alongside our customers around the world, we impact more than 150 million patients annually.\nOur core values guide our behaviors and actions and are fundamental to how we execute our mission.\nStryker was incorporated in Michigan in 1946 as the successor company to a business founded in 1941 by Dr. Homer H. Stryker, a prominent orthopaedic surgeon and inventor of several medical products. Our products are sold in approximately 75 countries through company-owned subsidiaries and branches as well as third-party dealers and distributors, and include surgical equipment and surgical navigation systems; endoscopic and communications systems; patient handling, emergency medical equipment and intensive care disposable products; clinical communication and artificial intelligence-assisted virtual care platform technology; neurosurgical and neurovascular devices; implants used in joint replacement and trauma surgeries; Mako Robotic-Arm Assisted technology; spinal devices; as well as other products used in a variety of medical specialties. Most of our products are marketed directly to doctors, hospitals and other healthcare facilities.\nAs used herein, and except where the context otherwise requires, \"Stryker,\" \"we,\" \"us,\" and \"our\" refer to Stryker Corporation and its consolidated subsidiaries.\nBusiness Segments and Geographic Information\nWe segregate our operations into two reportable business segments: (i) MedSurg and Neurotechnology and (ii) Orthopaedics. Financial information regarding our reportable business segments and certain geographic information is included under \"Consolidated Results of Operations\" in Item 7 of this report and Note 14 to our Consolidated Financial Statements.\nIn the fourth quarter 2024 we reorganized our Spine business to align with certain updates to our internal reporting structure. The spine enabling technologies portfolio (Enabling Technologies) was reclassified to Other Orthopaedics and Spine, the Interventional Spine (IVS) portfolio was reclassified to Neuro Cranial and the remaining Spine business was renamed to Spinal Implants. In addition, we changed the name of our “Orthopaedics and Spine” operating segment to “Orthopaedics.”   \nQuarterly Net Sales - Enabling Technologies\n2024\n2023\n2022\nMar 31\n$\n30 \n$\n31 \n$\n30 \nJun 30\n$\n31 \n$\n32 \n$\n25 \nSep 30\n$\n59 \n$\n54 \n$\n44 \nDec 31\n$\n32 \n$\n32 \n$\n32 \nTotal\n$\n152\n \n$\n149\n \n$\n131\n \nQuarterly Net Sales - IVS\n2024\n2023\n2022\nMar 31\n$\n98 \n$\n77 \n$\n65 \nJun 30\n$\n98 \n$\n83 \n$\n73 \nSep 30\n$\n117 \n$\n84 \n$\n72 \nDec 31\n$\n100 \n$\n83 \n$\n72 \nTotal\n$\n413\n \n$\n327\n \n$\n282\n \nQuarterly Net Sales - Spinal Implants\n2024\n2023\n2022\nMar 31\n$\n171 \n$\n176 \n$\n183 \nJun 30\n$\n178 \n$\n181 \n$\n193 \nSep 30\n$\n186 \n$\n180 \n$\n182 \nDec 31\n$\n172 \n$\n176 \n$\n175 \nTotal\n$\n707\n \n$\n713\n \n$\n733\n \nNet Sales by Reportable Segment\n2024\n2023\n2022\nMedSurg and Neurotechnology\n$\n13,518 \n60 \n%\n$\n12,163 \n59 \n%\n$\n10,893 \n59 \n%\nOrthopaedics\n9,077 \n40 \n8,335 \n41 \n7,556 \n41 \nTotal\n$\n22,595\n \n100\n \n%\n$\n20,498\n \n100\n \n%\n$\n18,449\n \n100\n \n%\nMedSurg and Neurotechnology\nMedSurg products include surgical equipment, patient and caregiver safety technologies, and navigation systems (Instruments), endoscopic and communications systems (Endoscopy), and patient handling, emergency medical equipment, intensive care disposable products and clinical communication and artificial intelligence-assisted virtual care platform technology (Medical). Neurotechnology includes neurosurgical, neurovascular and craniomaxillofacial implant products. Our neurotechnology offering includes products used for minimally invasive endovascular procedures; a comprehensive line of products for traditional brain and open skull based surgical procedures; orthobiologic and biosurgery products, including synthetic bone grafts and vertebral augmentation products (Neuro Cranial); and minimally invasive products for the treatment of acute ischemic and hemorrhagic stroke (Neurovascular). The craniomaxillofacial implant offering includes cranial, maxillofacial and chest wall devices as well as dural substitutes and sealants. \nWe are one of five leading global competitors in Instruments; the other four being Zimmer Biomet Holdings, Inc. (Zimmer), Medtronic plc (Medtronic), Johnson & Johnson MedTech (a subsidiary of Johnson & Johnson) and ConMed Linvatec, Inc. (a subsidiary of CONMED Corporation). We are one of seven leading global competitors in Endoscopy; the other six being Karl Storz GmbH & Co., Olympus Optical Co. Ltd., Smith & Nephew plc (Smith & Nephew), ConMed Linvatec, Arthrex, Inc. and STERIS plc. We are one of five leading global competitors in Medical; the other four being Baxter International Inc., Zoll Medical Corporation, Medline Industries and Ferno-Washington, Inc. We are one of five leading global competitors in Neurotechnology; the other four being Medtronic, Johnson & Johnson Medtech, Terumo Corporation and Penumbra, Inc.    \nDollar amounts in millions except per share amounts or as otherwise specified.\n1\nSTRYKER CORPORATION\n2024 FORM 10-K\nComposition of MedSurg and Neurotechnology Net Sales\n2024\n2023\n2022\nInstruments\n$\n2,834 \n21 \n%\n$\n2,534 \n21 \n%\n$\n2,245 \n21 \n%\nEndoscopy\n3,389 \n25 \n3,068 \n25 \n2,759 \n25 \nMedical\n3,852 \n28 \n3,459 \n28 \n3,031 \n28 \nNeurovascular\n1,307 \n10 \n1,226 \n11 \n1,200 \n11 \nNeuro Cranial\n2,136 \n16 \n1,876 \n15 \n1,658 \n15 \nTotal\n$\n13,518\n \n100\n \n%\n$\n12,163\n \n100\n \n%\n$\n10,893\n \n100\n \n%\nIn 2024 Instruments launched SurgiCount+ powered by Triton, which combines our existing sponge counting technology with artificial intelligence and quantifying blood loss software.  We also launched CoPilot, which combines with our Spine Q guidance system to help surgeons plan and perform certain spinal procedures, including supporting bone resection, pedicle preparation and screw delivery.\nIn addition we completed the acquisition of Vertos Medical, Inc., a leader in interventional pain management solutions for chronic lower back pain caused by lumbar spinal stenosis. The acquisition of Vertos is complementary to our Interventional Spine business as we continue to focus on advanced pain procedures.\nEndoscopy continued to deliver its 4K 1788 Camera platform to the market. Our 1788 Camera platform features several enhancements for a broader range of clinical applications and specialties, including urology, neurology and ear, nose and throat and can be used to visualize indocyanine green and Cytalux.\nMedical launched the LIFEPAK 35 monitor/defibrillator, our next generation platform designed to optimize care with new clinical features such as the new Glasgow 30.4 algorithm, cprINSIGHT, 15-lead monitoring capabilities, and STJ insight and mapping. LIFEPAK 35 combines a modern intuitive touch screen display and increased processing power with Bluetooth and WiFi data connectivity.  \nMedical also completed the acquisition of care.ai, a virtual care and ambient intelligence solutions platform. care.ai adds complementary technology that is expected to integrate seamlessly with the Vocera platform (Vocera) and Stryker’s devices, providing customers with an enterprise-wide ecosystem that is intended to deliver dynamic clinical workflows and further the development of smart care facilities.\nNeurovascular initiated a targeted launch of the Surpass Elite Flow Diverting Stent (FDS) in the U.S. and South Korea. Surpass Elite FDS is designed to reduce thrombin generation when compared to unmodified stents. Additionally, Neurovascular launched Surpass Evolve FDS in Japan. The Stryker FDS platform is designed to effectively treat aneurysms by redirecting blood flow away from the aneurysm to promote healing. \nOrthopaedics\nOrthopaedics products primarily include implants used in total joint replacements, such as hip, knee and shoulder, and trauma and extremities surgeries. We bring patients and physicians advanced implant designs and specialized instrumentation that make orthopaedic surgery and recovery simpler, faster and more effective. We support surgeons with the technologies, products and services they need to support each patient’s clinical challenge. \nWe are one of four leading global competitors for joint replacement and trauma and extremities products and robotics; the other three being Zimmer, Johnson & Johnson MedTech and Smith & Nephew.\nComposition of Orthopaedics Net Sales\n2024\n2023\n2022\nKnees\n$\n2,447 \n27 \n%\n$\n2,273 \n27 \n%\n$\n1,997 \n26 \n%\nHips\n1,704 \n19 \n1,544 \n18 \n1,413 \n19 \nTrauma and Extremities\n3,507 \n39 \n3,147 \n38 \n2,807 \n37 \nSpinal Implants\n707 \n8 \n713 \n9 \n733 \n10 \nOther\n712 \n8 \n658 \n8 \n606 \n8 \nTotal\n$\n9,077\n \n100\n \n%\n$\n8,335\n \n100\n \n%\n$\n7,556\n \n100\n \n%\nIn 2024 we continued the full commercial launch of our Triathlon Hinge revision knee system. Triathlon Hinge received approval in August of 2023 and is now released in the U.S., Ca\nnada and New Zealand. We also continued delivering growth in total hip arthroplasty, particularly in the primary segment where Direct Anterior Reconstructive Technology and Mako Total Hip can help to reduce, if not eliminate, a surgeon's use of intraoperative fluoroscopy during direct anterior hip procedures. With the acquisition of SERF SAS, we strengthened distribution in key European markets and continue to scale differentiated solutions such as the Novae monolithic dual mobility cup engineered to deliver greater hip stability and reduce dislocation risk.\nWe continued to expand our global footprint of Mako SmartRobotics™ in 2024 which is now sold in more than 45 countries. To date more than one million robotic Mako Total Knees and 1.5 million robotic procedures across Total Hips, Total Knees and Partial Knees have been performed globally. Stryker’s Joint Replacement division also launched the “Scan. Plan. Mako Can.” direct to patient campaign, accelerating awareness of Mako technology in the U.S.\nOur spine enabling technologies portfolio includes best in class imaging solutions, image-guided surgical technology, patient specific implants and digital health solutions supporting surgeons and their patients throughout the continuum of care. \nIn December 2024 we performed our first Mako Shoulder procedure using robotic-arm assistance to remove bone, prepare the glenoid surface and enable positioning and placement of the Perform Reversed Glenoid implant. \nIn 2024 Trauma launched Pangea, a comprehensive variable angle plating portfolio designed to optimize plate fit to bone utilizing simple, intuitive instrumentation that enhances ease of use and reproducibility.  These combined solutions empower Stryker to deliver a complete portfolio across all trauma segments.\nRaw Materials and Inventory\nRaw materials essential to our business are generally readily available from multiple sources; however, certain of our raw materials are currently sourced from single suppliers. Substantially all products we manufacture are stocked in inventory, while certain MedSurg products are assembled to order.\nPatents and Trademarks\nPatents and trademarks are significant to our business to the extent that a product or an attribute of a product represents a unique design or process. Patent protection of such products restricts competitors from duplicating these unique designs and features. We seek to obtain patent protection on our products whenever appropriate for protecting our competitive advantage. On December 31, 2024 we owned approximately 5,600 United States patents and approximately 8,600 patents in other countries.\nSeasonality\nOur business is generally not seasonal in nature; however, the number of orthopaedic implant surgeries is typically lower in the \nDollar amounts in millions except per share amounts or as otherwise specified.\n2\nSTRYKER CORPORATION\n2024 FORM 10-K\nsummer months, and sales of capital equipment are generally higher in the fourth quarter.\nCompetition\nIn each of our product lines we compete with local and global companies. The development of innovative products is important to our success in all areas of our business. Competition in research involving the development and improvement of new and existing products and processes is particularly significant. The competitive environment requires substantial investments in continuing research and maintaining sales forces.\nWe believe our commitment to innovation, quality and service and our reputation differentiates us in the highly competitive product categories in which we operate and enables us to compete effectively. We believe that our competitive position in the future will depend to a large degree on our ability to develop new products and make improvements to existing products. \nRegulation\nOur businesses are subject to varying degrees of governmental regulation in the countries in which we operate, and the general trend is toward increasingly stringent regulation. We are required to comply with the unique regulatory requirements of each country in which we market and sell our products.\nIn the United States the Medical Device Amendments of 1976 to the Federal Food, Drug and Cosmetic Act and its subsequent amendments and the regulations issued and proposed thereunder provide for federal regulation by the United States Food and Drug Administration (FDA) of the design, manufacture and marketing of medical devices, including most of our products. In addition, state licensing requirements often apply to certain of our business operations and products. On the federal level, many of our new products fall into FDA classifications that require notification submitted as a 510(k) and review by the FDA before we begin marketing them. Certain of our products require extensive clinical testing, consisting of safety and efficacy studies, followed by pre-market approval applications for specific surgical indications. Certain of our products also fall under other FDA classifications, such as drugs and Human Cells, Tissues, and Cellular and Tissue-Based Products.\nThe FDA's Quality System regulations set forth standards for our product design and manufacturing processes, require the maintenance of certain records and provide for inspections of our facilities by the FDA. There are also certain requirements of state, local and foreign governments that must be complied with in the manufacture and marketing of our products.\nThe European Union enacted the European Union Medical Device Regulation in May 2017 with an original effective date of May 2022, which imposes stricter requirements for the marketing and sale of medical devices, including in the areas of clinical evaluation requirements, quality systems, labeling and post-market surveillance. Extended transition timelines were published in 2023 which range from May 2026 through December 2028 depending on the type of device and our implementation is on track to meet these timelines.\nInitiatives to limit the growth of general healthcare expenses and hospital costs are ongoing in the markets we do business. These initiatives are sponsored by government agencies, legislative bodies and the private sector and include price regulation and competitive pricing. It is not possible to predict at this time the long-term impact of such cost containment measures on our future business. In addition, business practices in the healthcare industry are scrutinized, particularly in the United States, by federal and state government agencies. Any resulting \ninvestigations and prosecutions potentially carry the risk of significant civil and criminal penalties.\nEnvironment\nWe are subject to various rules and regulation in the United States and internationally related to the protection of human health and the environment. Our operations involve the use of substances regulated under environmental laws, primarily in manufacturing and sterilization processes. We believe our policies, practices and procedures are properly designed to comply, in all material respects, with applicable environmental laws and regulations. We do not expect compliance with these requirements to have a material effect on purchases of property, plant and equipment, cash flows, net earnings or competitive position. \nEmployees \nOn December 31, 2024 we had approximately 53,000 employees globally, with approximately 27,000 employees in the United States. Our talented employees are an integral reason for our standing as a global leader in medical technologies where, together with our customers, we are driven to make healthcare better. Our company values of integrity, accountability, people and performance are a key component of that mission. Our people, as one of our core values, continue to be a key focus.\nOur success depends on our ability to attract the best talent. To do so, we continue to focus on creating and maintaining a great workplace. We believe in attracting the right people, maintaining and building employee engagement and developing our employees. We believe when people are able to do what they do best, they will look forward to coming to work and, in turn, will deliver great business results.\nOur leadership team and Board of Directors receive regular updates on our people and culture strategy and provide feedback on our strategy and goals, including alignment to our mission and values, peer benchmarking and stakeholder feedback.\nEmployee Development\nOur employee development is extensive and exists at all levels of the organization, including company-wide training on our Code of Conduct, job-related technical training and management and leadership training. Our development programs include on-the-job learning, coaching and mentoring, management and leadership development courses, team building and collaboration training and immersive experiences with expert partners. \nWe encourage all employees to establish development objectives, in partnership with their manager, to help employees gain the needed development experience to grow their careers. \nEmployee Engagement\nAn engaged workplace culture that drives performance and business outcomes is central to our mission. Listening to and learning from our employees forms the foundation of an engaging culture. More than 90% of our employees participate in our annual engagement survey, which provides a valued platform for listening and allows us to take action based on the feedback collected. \nWe supplement our annual engagement survey with targeted pulse surveys to gather feedback on topics relevant to the current climate.\nWe also provide tools and resources that enable managers and teams to act on the insights we gain from our surveys and to drive employee engagement and strong business outcomes.\nDollar amounts in millions except per share amounts or as otherwise specified.\n3\nSTRYKER CORPORATION\n2024 FORM 10-K\nDiversity, Equity and Inclusion (DE&I)\nAn essential part of our culture is respecting each individual’s strengths and values. Building on this foundation, we are focused on maintaining an inclusive, engaging work environment in keeping with our values of integrity and people. Our DE&I strategy is centered around these three commitments:\n•\nStrengthen the diversity of our workforce\n•\nAdvance a culture of inclusion, engagement and belonging\n•\nMaximize the power of inclusion to drive innovation and growth\nWe are advancing our commitments through the following actions, among others:\n•\nIncreasing access to talent through strategic partnerships and campaigns\n•\nGrowing and engaging talent with a range of opportunities to learn and develop\n•\nAligning our employee resource groups, which are open to all employees, to focus on creating community and belonging\nAttracting and Hiring\nWe understand that every employee drives our success. We focus on attracting, identifying and selecting strong candidates who will be successful at Stryker and ensuring that each person we hire brings the talent, expertise and passion we need to continue to be successful.\nHealth and Safety\nEnsuring our employees' safety is a top priority. It is a responsibility that we share throughout the company and one that has evolved to meet the needs of our workforce. Employees' safety risks vary depending on the roles they perform, so we tailor our safety efforts accordingly.\nCompetitive Pay and Benefits\nOur compensation and benefits programs are designed to attract and retain top talent and to incentivize performance and alignment to our mission and values.\nWe offer market-competitive base pay and benefits to our employees in countries around the world. We regularly evaluate our compensation and benefit offerings and levels, using recognized outside consulting firms to ensure internal fairness and competitiveness in our offerings.\nMost of our employees also have variable components to their compensation packages that reward employees based on individual, business unit and/or company-wide performance.\nOur proxy statement provides more detail on the competitive compensation programs we offer to our executive officers.\nInformation about our Executive Officers\nAs of January 31, 2025\nName\nAge\nTitle\nFirst Became an Executive Officer\nKevin A. Lobo\n59\nChair, Chief Executive Officer and President\n2011\nYin C. Becker\n61\nVice President, Chief Corporate Affairs Officer\n2016\nWilliam E. Berry Jr.\n59\nVice President, Chief Accounting Officer\n2014\nGlenn S. Boehnlein\n63\nVice President, Chief Financial Officer\n2016\nM. Kathryn Fink\n55\nVice President, Chief Human Resources Officer\n2016\nRobert S. Fletcher\n54\nVice President, Chief Legal Officer\n2019\nViju S. Menon\n57\nGroup President, Global Quality and Operations\n2018\nJ. Andrew Pierce\n51\nGroup President, MedSurg and Neurotechnology\n2021\nSpencer S. Stiles\n48\nGroup President, Orthopaedics\n2021\nEach of our executive officers was elected by our Board of Directors to serve in the office indicated until the first meeting of the Board of Directors following the annual meeting of shareholders in 2025 or until a successor is chosen and qualified or until his or her resignation or removal. Each of our executive officers held the position above or served Stryker in various executive or administrative capacities for at least five years.\nAvailable Information\nOur main corporate website address is \nwww.stryker.com. \nThe information on our website is not incorporated by reference into this report. Copies of our filings with the United States Securities and Exchange Commission (SEC) are available free of charge on our website within the \"Investors Relations\" section as soon as reasonably practicable after having been electronically filed or furnished to the SEC. All SEC filings are also available at the SEC's website at \nwww.sec.gov\n.",
    "item1a": "Item 1A. Risk Factors.",
    "item1b": "ITEM 1B.\nUNRESOLVED STAFF COMMENTS.\nNone.",
    "item1c": "ITEM 1C.\nCYBERSECURITY.\nRISK MANAGEMENT AND STRATEGY\nWe review cybersecurity risk as part of our overall enterprise risk management program.\n This ensures that cybersecurity risk management remains a top priority in our business strategy and operations.\n \nMANAGEMENT'S ROLE IN MANAGING RISK\nPrimary management responsibility for assessing, monitoring and managing our cybersecurity risks rests with our \nchief information security officer (\"CISO\")\n. \nOur current CISO has over 30 years of experience in information technology including over 20 years in cybersecurity and oversees a team of cybersecurity professionals with over 140 security, risk, and compliance certifications. The CISO is regularly informed about recent developments in cybersecurity, including potential threats and innovative risk management techniques.\n \nThe CISO implements and oversees processes for the regular monitoring of our information systems. We use various tools and methodologies to manage cybersecurity risk that are tested regularly. We also monitor and evaluate our cybersecurity posture and performance on an ongoing basis through regular vulnerability scans, penetration tests and threat intelligence feeds. \nIn addition, we engage third-party consultants to conduct annual cybersecurity assessments and to conduct audits for compliance with regulatory, Sarbanes-Oxley Act, Service Organization Control Type 2 and\n \nInternational Organization for Standardization standards.\n We also engage third parties to assess our cybersecurity maturity and risk management programs.\nWe use a cross-departmental approach to addressing cybersecurity risk, with our cybersecurity, product security and legal teams presenting quarterly on key topics to a committee of leaders in finance, regulatory, and corporate affairs functions. This leadership committee meets quarterly to ensure that we have input and oversight from critical stakeholders into our cybersecurity program and evolving issues.\nThe CISO oversees a training and awareness program for employees to take part in protecting the Company against cybersecurity risks. We have implemented annual mandatory security education to help employees understand cybersecurity risks and comply with our cybersecurity policies. Additionally, we provide frequent communications around pertinent cybersecurity topics and policies to all employees. We also provide additional \ncybersecurity and data protection training to employees in certain roles. \nAs part of our cybersecurity risk management program, we also conduct cybersecurity and privacy assessments on all third parties who integrate with Stryker’s data, network, systems and products. We use a combination of internal and external tools to confirm that these third parties meet our security requirements. We leverage standard industry threat model and privacy impact assessment concepts to confirm that data minimization and adequate data protections are in place. We perform supplemental reviews as necessary, commensurate with the risk associated with each vendor.\nIn the event of a cybersecurity incident, we have an incident response plan that includes immediate actions to mitigate the impact and long-term strategies for remediation and prevention of future incidents. The cybersecurity and product security teams routinely practice this plan with functions across the organization. We conduct tabletop exercises with senior management, during which we practice the procedures in place to ensure that potentially material cybersecurity risks and incidents are escalated to management and the Board of Directors where applicable.\nGOVERNANCE\nCybersecurity risks are overseen by the full Board of Directors and the Audit Committee. The Audit Committee is central to the Board of Directors’ oversight of cybersecurity risks and bears the primary responsibility for overseeing cybersecurity risk. The Audit Committee actively participates in strategic decisions related to cybersecurity, offering guidance and approval for major cybersecurity initiatives. This involvement ensures that cybersecurity considerations are integrated into our broader strategic objectives.\n \nOur \nCISO\n provides comprehensive updates to the Audit Committee quarterly and the full Board of Directors periodically. These briefings include a range of topics, including:\n•\nCurrent cybersecurity landscape and emerging threats;\n•\nStatus of ongoing cybersecurity initiatives and strategies;\n•\nIncident reports and learnings from any cybersecurity events; \n•\nMetrics demonstrating company and industry-standard prevention of common threats; and\n•\nRegulatory changes impacting cybersecurity requirements and strategy.\nThe Board of Directors is aware of the critical nature of managing risks associated with cybersecurity threats and is actively engaged in our cybersecurity risk management strategy.\nRISKS FROM CYBERSECURITY THREATS\nAlthough cybersecurity risks have not materially affected us, including our business strategy, results of operations or financial condition, to date, we face numerous and evolving cybersecurity threats in our business.\n For more information about the cybersecurity risks we face, see the risk factor entitled \"We, our business partners or our third-party vendors could experience a material failure or breach of a key information technology system, network, process or site\" in"
  }
}