{
  "ticker": "T",
  "cik": "0000732717",
  "company_name": "AT&T INC.",
  "filing_date": "2025-02-12",
  "accession": "0000732717-25-000013",
  "primary_doc": "t-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.\n \nBUSINESS\nGENERAL\nAT&T Inc. (“AT&T,” “we” or the “Company”) is a holding company incorporated under the laws of the State of Delaware in 1983 and has its principal executive offices at 208 S. Akard St., Dallas, Texas, 75202 (telephone number 210-821-4105). We maintain an internet website at www.att.com. (This website address is for information only and is not intended to be an active link or to incorporate any website information into this document.) We file electronically with the Securities and Exchange Commission (SEC) required reports on Form 8-K, Form 10-Q and Form 10-K; proxy materials; registration statements on Forms S-3 and S-8, as necessary; and other forms or reports as required. The SEC maintains a website (www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. We make available, free of charge, on our website our annual report on Form 10-K, our quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports as soon as reasonably practicable after such reports are electronically filed with, or furnished to, the SEC. We also make available on that website, and in print, if any stockholder or other person so requests, our “Code of Ethics” applicable to all employees and Directors, our “Corporate Governance Guidelines,” and the charters for all committees of our Board of Directors, including Audit, Human Resources and Governance and Policy committees. Any changes to our Code of Ethics or waiver of our Code of Ethics for senior financial officers, executive officers or Directors will be posted on that website.\nA reference to a “Note” refers to the Notes to Consolidated Financial Statements in Item 8.\nHistory\nAT&T, formerly known as SBC Communications Inc. (SBC), was formed as one of several regional holding companies created to hold AT&T Corp.’s (ATTC) local telephone companies. On January 1, 1984, we were spun-off from ATTC pursuant to an anti-trust consent decree, becoming an independent publicly traded telecommunications services provider. \nFollowing our formation, we expanded our communications footprint and operations, most significantly:\n•\nOur subsidiaries merged with incumbent local exchange carriers (ILEC) Pacific Telesis Group in 1997 and Ameritech Corporation in 1999.\n•\nIn 2005, we merged one of our subsidiaries with ATTC, creating one of the world’s leading telecommunications providers. In connection with the merger, we changed the name of our company from “SBC Communications Inc.” to “AT&T Inc.”\n•\nIn 2006, we acquired ILEC BellSouth Corporation (BellSouth), which included BellSouth’s 40% economic interest in AT&T Mobility LLC (AT&T Mobility), formerly Cingular Wireless LLC, resulting in 100% ownership of AT&T Mobility.\n•\nIn 2014, we completed the acquisition of wireless provider Leap Wireless International, Inc. \n•\nIn 2015, we acquired wireless properties in Mexico and acquired DIRECTV, a leading provider of digital television entertainment services in both the United States (included in our Video business) and Latin America (referred to as Vrio).\n•\nFrom 2018 through April 2022, we acquired and held various investments in entertainment businesses, namely Time Warner Inc., which comprised a substantial portion of our previous WarnerMedia segment.\n•\nIn July 2021, we closed our transaction with TPG Capital (TPG) to form a new company named DIRECTV Entertainment Holdings, LLC (DIRECTV). With the close of the transaction (DIRECTV Transaction), we separated our Video business, comprised of our U.S. video operations, and began accounting for our investment in DIRECTV under the equity method. In September 2024, we agreed to sell our remaining interest in DIRECTV to TPG, which we expect to close in mid-2025.\n•\nIn April 2022, we completed the separation of our WarnerMedia business in a Reverse Morris Trust transaction (WarnerMedia/Discovery Transaction). Upon its separation and distribution, the WarnerMedia business met the criteria for discontinued operations, as did other dispositions that were part of a single plan, including Vrio, Xandr and Playdemic Ltd. (Playdemic). These businesses are reflected in our historical financial statements as discontinued operations, including for periods prior to the consummation of the WarnerMedia separation.\n1\nAT&T Inc.\nDollars in millions except per share amounts\nGeneral\nWe are a leading provider of telecommunications and technology services globally. The services and products that we offer vary by market and utilize various technology platforms in a range of geographies. Our reportable segments are organized as follows:\nThe \nCommunications segment \nprovides wireless and wireline telecom and broadband services to consumers located in the United States and businesses globally. Our business strategies reflect integrated product offerings that cut across product lines and utilize shared assets. This segment contains the following business units:\n•\nMobility \nprovides nationwide wireless service and equipment.\n•\nBusiness Wireline \nprovides advanced ethernet-based fiber services, fixed wireless services, IP Voice and managed professional services, as well as legacy voice and data services and related equipment, to business customers. \n•\nConsumer Wireline \nprovides broadband services, including fiber connections that provide multi-gig services, and our fixed wireless access product (AT&T Internet Air or “AIA”) that provides internet services delivered over our 5G wireless network, to residential customers in select locations. Consumer Wireline also provides legacy telephony voice communication services.\nThe \nLatin America segment \nprovides wireless service and equipment in Mexico. \nCorporate support costs, including administrative support costs borne by AT&T where business units do not influence decision making and results from business no longer integral to our operations are reported as \nCorporate \nand\n Other\n, which\n \nreconciles our segment results to consolidated operating income and income before income taxes. \nAreas of Focus\nWe are a leader in providing connectivity services through our market focus areas of 5G and fiber. Fiber underpins the connectivity we deliver, both wired and wireless. Building on that fiber foundation is our solid spectrum portfolio, strengthened through Federal Communications Commission (FCC) auction acquisitions and 5G deployment. We believe our fixed wireline and mobile approach will differentiate our services and provide us with additional convergence growth opportunities in the future as bandwidth demands continue to grow. We will continue to demonstrate our commitment to ensure management attention is sharply focused on growth areas and operational efficiencies.\nOur integrated telecommunications network utilizes different technological platforms to provide instant connectivity at the higher speeds made possible by our fiber network expansion and wireless network enhancements. Streaming, augmented reality, “smart” technologies, user generated content and artificial intelligence (AI) are expected to continue to drive greater demand for broadband, which we believe will allow us to capitalize on our fiber and 5G deployments. During 2025, we are focused on the core capabilities of our products, our infrastructure and our network. Our concentration is to aggregate the most traffic on the largest, lowest marginal cost, converged network through efficient spectrum deployment and construction of the largest high-capacity broadband solutions in the United States, while also working with regulators and customers to decommission high-cost legacy technologies over the next several years.\nDuring 2024, we collaborated with Ericsson to lead the U.S. in commercial scale open radio access network (Open RAN) deployment to build a more robust ecosystem of network infrastructure providers and suppliers, fostering lower network costs, improved operational efficiencies and allowing for continued investment in our fast-growing broadband network. We plan for about 70% of our wireless network traffic to flow across open-capable platforms by late 2026. Beginning in 2025, we expect to scale this Open RAN environment throughout our wireless network in coordination with multiple suppliers. We believe the move to an open, agile, programmable wireless network positions us to quickly capitalize on the next generation of wireless technology and spectrum when it becomes available. These innovative technologies are expected to enable lower-power, sustainable networks with higher performance to deliver enhanced user experiences.\nWireless Service \nWe continue to experience rapid growth in data usage as consumers are demanding seamless access across their wireless and wired devices, and businesses and municipalities are connecting more and more equipment and facilities to the internet. The deployment of 5G, which allows for faster connectivity, lower latency and greater bandwidth, requires modifications of existing cell sites to add equipment supporting new frequencies, like the C-Band and the 3.45 GHz band. The increased speeds and network operating efficiency expected with 5G technology should enable massive deployment of devices connected to the internet as well as faster delivery of data services. As the wireless industry has matured, with nearly full penetration of smartphones in the U.S. population, future wireless growth will depend on our ability to offer innovative services, plans and devices that bundle product offerings and take advantage of our 5G wireless network. \nTo support higher mobile data usage, our priority is to best utilize a wireless network that has sufficient spectrum and capacity to support these innovations on as broad a geogra\nphic basis as possible. \nWe expect to continue to invest significant capital in expanding our network capacity, as well as obtaining additional spectrum, when available, that meets our long-term needs. We participate in FCC spectrum auctions and have been redeploying spectrum previously used for more basic services to support \n2\nAT&T Inc.\nDollars in millions except per share amounts\nmore advanced mobile internet services. \nAdditionally, in November 2024, we agreed to purchase select spectrum licenses from United States Cellular Corporation (UScellular) for approximately $1,000, subject to closing conditions, including the consummation of UScellular’s proposed sale of its wireless operations and select spectrum assets to T-Mobile US, Inc. \nIn North America, our network covers over 440 million people with 4G LTE and over 314 million with 5G technology. In the United States, our network covers all major metropolitan areas and more than 336 million people with our LTE technology and more than 314 million people with our 5G technology. \nBroadband Technology \nIn 2020, we identified fiber as a core priority for our business and enhanced our focus to expand our fiber footprint and grow customers. At December 31, 2024, we had more than 9.3 million fiber consumer wireline broadband customers, adding 1.0 million during the year. The expansion builds on our recent investments to convert to a software-based network, managing the migration of wireline customers to services using our fiber infrastructure to provide broadband technology. Software-based technologies align with our global leadership in software defined network (SDN) and network function virtualization (NFV). This network approach delivers a demonstrable cost advantage in the deployment of next-generation technology over the traditional, hardware-intensive network approach. Our virtualized network supports next-generation applications like 5G and broadband-based services quickly and efficiently. At December 31, 2024, we had 15.3 million broadband connections, compared to 15.1 million broadband connections in the prior year.\nCopper Decommissioning \nWhile building the network of the future, we are actively working to exit our legacy copper network operations across the large majority of our wireline footprint. Our exit strategy includes migrating customers to fiber and wireless alternatives, and working with policy-makers to decommission our inefficient and less reliable copper network. At December 31, 2024, we had 3.3 million network access lines in service and 127,000 DSL subscribers compared, to 4.2 million network access lines in service and 210,000 DSL subscribers in the prior year.\nBUSINESS OPERATIONS\nOPERATING SEGMENTS\nOur segments are strategic business units that offer different products and services over various technology platforms and/or in different geographies that are managed accordingly. We have two reportable segments: Communications and Latin America.\nAdditional information about our segments, including financial information, is included under the heading “Segment Results” in Item 7 and in Note 4 of Item 8.\nCOMMUNICATIONS\nOur Communications segment provides wireless and wireline telecom and broadband services to consumers located in the U.S. and businesses globally. Our Communications services and products are marketed under the AT&T, AT&T Business, Cricket, AT&T PREPAID\nSM\n, AT&T Fiber and AT&T Internet Air brand names. The Communications segment provided approximately 97% of 2024 segment operating revenues and accounted for substantially all of our 2024 total segment operating income. This segment contains the Mobility, Business Wireline and Consumer Wireline business units.\nMobility – \nOur Mobility business unit provides nationwide wireless service to consumers and wholesale and resale wireless subscribers located in the United States by utilizing our network to provide voice and data services, including high-speed internet over wireless devices. We classify our subscribers as either postpaid, prepaid or reseller. As of December 31, 2024, we served 118 million Mobility subscribers, including 89 million postpaid (73 million phone), 19 million prepaid and 10 million through resellers. Our Mobility business unit revenue includes the following categories: service and equipment.\nService\nWe offer a comprehensive range of high-quality nationwide wireless voice and data communications services in a variety of pricing plans to meet the communications needs of targeted customer categories. Through FirstNet\n®\n services, we also provide a nationwide wireless broadband network dedicated to public safety.\nConsumers continue to require increasing availability of data-centric services and a network to connect and control those devices. An increasing number of our subscribers are using more advanced devices, including embedded computing systems and/or software, commonly called the Internet of Things (IoT). We offer unlimited plans that include features allowing for the sharing of voice, text and data across multiple devices, which attracts subscribers from other providers and helps minimize subscriber churn. We continue to upgrade our network and coordinate with equipment manufacturers and application developers to further capitalize on the continued growing demand for wireless data services.\nWe also offer nationwide wireless voice and data communications to certain customers who prefer to pay in advance. These services are offered under the Cricket and AT&T PREPAID brands and are typically monthly prepaid services.\n3\nAT&T Inc.\nDollars in millions except per share amounts\nEquipment\nWe sell a wide variety of handsets, wireless data cards and wireless computing devices manufactured by various suppliers for use with our voice and data services. We also sell accessories, such as carrying cases/protective covers and wireless chargers. We sell online and through our own company-owned stores, agents and third-party retail stores. We provide our customers the ability to purchase handsets on an installment basis and the opportunity to bring their own device. Subscribers that bring their own devices or retain handsets for longer periods impact upgrade activity. Like other wireless service providers, we also provide postpaid contract subscribers promotional equipment offers to initiate, renew or upgrade service.\nBusiness Wireline – \nOur Business Wireline business unit provides services to business customers, including multinational corporations, small and mid-sized businesses, and governmental and wholesale customers. Our Business Wireline business unit revenue includes the following categories: service and equipment.\nService\nWe offer fiber and other advanced connectivity services, such as AT&T Dedicated Internet, fiber ethernet and broadband, fixed wireless, and hosted and managed professional services, as well as legacy voice and other transitional services comprised of copper-based voice and data, Virtual Private Networks (VPN), wholesale, outsourcing and IP sales. Historically, a majority of our Business Wireline service revenues came from legacy copper-based voice and data and traditional products; however, over recent years those services have been declining due to secular pressures. \nWe continue to reconfigure our wireline network to take advantage of the latest technologies and services, and rely on our SDN and NFV to enhance business customers’ digital agility in a rapidly evolving environment. Some of the services we have offered historically are in secular decline and, going forward, we will focus on our owned and operated connectivity services powered by 5G and fiber as well as evaluating opportunities where we can turn down existing copper infrastructure.\nEquipment\nEquipment revenues include customer premises equipment.\nConsumer Wireline\n – Our Consumer Wireline business unit provides broadband services, including fiber connections, AIA and legacy telephony voice communication services, to customers in the United States by utilizing our IP-based and copper wired network. Our Consumer Wireline business unit revenue includes the following categories: broadband, legacy voice and data services and other service and equipment.\nBroadband Service\nWe provide broadband and internet services to approximately 14.1 million customers, including 9.3 million fiber broadband subscribers at December 31, 2024. With changes in video viewing preferences and the impacts of remote learning trends, we are experiencing increasing demand for high-speed broadband services. We believe our investment in expanding our industry-leading fiber network positions us to be a leader in wired connectivity. Our focus on fiber brings owners economics and expected efficiencies while we continue to evaluate opportunities where we can turn down existing copper infrastructure. \nWe believe that our flexible platform, with a broadband and wireless connection, is the most efficient way to transport direct-to-consumer video and data experiences both at home and on mobile devices. Through this integrated approach, we can optimize the use of storage in the home as well as in the cloud, while also providing a seamless service for consumers across screens and locations. \nLegacy Voice and Data Services\nRevenues from our traditional voice services continue to decline as customers switch to wireless or VoIP services provided by us, cable companies or other internet-based providers.\nOther Service and Equipment\nOther service revenues include VoIP services, customer fees and equipment.\nAdditional information on our Communications segment is contained in the “Overview” section of Item 7.\nLATIN AMERICA\nOur Latin America segment provides wireless service in Mexico. We utilize our regional and national wireless networks in Mexico to provide consumer and business customers with wireless data and voice communication services. The Latin America segment provided approximately 3% of 2024 segment operating revenues and less than 1% of our 2024 total segment operating income. We divide our revenue into the following categories: service and equipment.\n4\nAT&T Inc.\nDollars in millions except per share amounts\nService\nWe provide postpaid and prepaid wireless services in Mexico to approximately 24 million subscribers under the AT&T and Unefon brands. Postpaid service allows for (1) no annual service contract for subscribers who bring their own device or purchase a device on installment and (2) service contracts for periods up to 36 months for subscribers who purchase their equipment under the traditional device subsidy model. We also offer prepaid plans.\nEquipment\nWe sell a wide variety of handsets, including smartphones manufactured by various suppliers for use with our voice and data services. We sell through our own company-owned stores, agents and third-party retail stores.\nAdditional information on our Latin America segment is contained in the “Overview” section of Item 7.\nMAJOR CLASSES OF SERVICE\nThe following table sets forth the percentage of total consolidated reported operating revenues by any class of service that accounted for 10% or more of our consolidated total operating revenues in any of the last three fiscal years:\nPercentage of Total \nConsolidated Operating Revenues\n2024\n2023\n2022\nCommunications Segment\nWireless service\n53\n \n %\n52 \n %\n50 \n %\nBusiness service\n15\n \n17 \n18 \nEquipment\n17\n \n17 \n18 \nLatin America Segment\nWireless service\n2\n \n2 \n2 \nEquipment\n1\n \n1 \n1 \nAdditional information on our geographical distribution of revenues is contained in Note 4 of Item 8.\nGOVERNMENT REGULATION\nFacilities-based wireless communications providers in the United States, like AT&T, must be licensed by the FCC to provide communications services at specified spectrum frequencies within defined geographic areas and must comply with FCC rules and policies governing the use of the spectrum. The FCC’s rules have a direct impact on whether the wireless industry has sufficient spectrum available to support the high-quality, innovative services our customers demand. Wireless licenses are issued for a fixed time period, typically 10 to 15 years, and we must seek renewal of these licenses. While the FCC has generally renewed licenses, the FCC has authority to both revoke a license for cause and to deny a license renewal if a renewal is not in the public interest. Additionally, while wireless communications providers’ prices and service offerings have historically not been subject to prescriptive regulation, the federal government and various states periodically consider new regulations and legislation relating to various aspects of wireless services.\nThe Communications Act of 1934 and other related laws give the FCC broad authority to regulate the U.S. operations of our interstate telecommunications services. In addition, our ILEC subsidiaries are subject to regulation by state governments, which have the power to regulate intrastate rates and services, including local, long-distance and network access services, provided such state regulation is consistent with federal law. Some states have eliminated or reduced regulations on our retail offerings. These subsidiaries are also subject to the jurisdiction of the FCC with respect to intercarrier compensation, interconnection, and interstate and international rates and services, including interstate access charges. Access charges are a form of intercarrier compensation designed to reimburse our wireline subsidiaries for the use of their networks by other carriers.\nWe continue to support regulatory and legislative measures and efforts at both the federal and state levels to minimize and/or moderate regulatory burdens that are no longer appropriate in a competitive communications market and that inhibit our ability to compete more effectively and offer services wanted and needed by our customers, including initiatives to transition services from traditional networks to all IP-based networks. At the same time, we also seek to ensure that legacy regulations are not further extended to broadband or wireless services, which are subject to vigorous competition.\nOur subsidiaries operating outside the United States are subject to the jurisdiction of national and supranational regulatory authorities in the market where service is provided.\n5\nAT&T Inc.\nDollars in millions except per share amounts\nFor a discussion of significant regulatory issues directly affecting our operations, please see the information contained under the headings “Operating Environment and Trends of the Business” and “Regulatory Landscape” of Item 7, which information is incorporated herein by reference. \nIMPORTANCE, DURATION AND EFFECT OF LICENSES\nCertain of our subsidiaries own or have licenses to various patents, copyrights, trademarks and other intellectual property necessary to conduct business. Many of our subsidiaries also hold government-issued licenses or franchises to provide wireline or wireless services. Additional information relating to regulations affecting those rights is contained under the heading “Operating Environment and Trends of the Business” of Item 7. We actively pursue patents, trademarks and service marks to protect our intellectual property within the United States and abroad. We maintain a significant global portfolio of patents, trademarks and service mark registrations. We have also entered into licenses that permit other companies to utilize certain of our patents, trademarks, service marks, and technologies, in exchange for payments and subject to appropriate safeguards and restrictions. As we transition our network from a switch-based network to an IP, software-based network, we have increasingly entered into licensing agreements with software developers.\nWe periodically license third-party patents and other intellectual rights in exchange for payments. We also receive claims from third parties asserting that our products, services or technologies infringe on their patents or other intellectual property rights. These claims could require us to pay damages or acquire license rights, stop offering the relevant products or services, and/or cease network functions or other activities. While the outcome of any litigation is uncertain, we do not believe that the resolution of any of these infringement claims or the expiration or non-renewal of any of our intellectual property rights would have a material adverse effect on our results of operations.\nMAJOR CUSTOMERS\nNo customer accounted for 10% or more of our consolidated revenues in 2024, 2023 or 2022.\nCOMPETITION\nCompetition continues to increase for communications and digital services from traditional and nontraditional competitors. Technological advances have expanded the types and uses of services and products available. In addition, lack of or a reduced level of regulation of comparable legacy services has lowered costs for alternative communications service providers. As a result, we face continuing competition as well as some new opportunities in significant portions of our business.\nWireless \nWe face substantial competition in our wireless businesses. Under current FCC rules, multiple licensees, who provide wireless services on the cellular, PCS, Advanced Wireless Services, 700 MHz and other spectrum bands, may operate in each of our U.S. service areas. Our competitors include two national wireless providers; a larger number of regional providers and resellers of each of those providers’ services; and certain cable companies. In addition, we face competition from providers who offer voice, text messaging and other services as applications on data networks. We are one of three facilities-based providers in Mexico (retail and wholesale), with the most significant market share controlled by América Móvil. We may experience significant competition from companies that provide similar services using other communications technologies and services. While some of these technologies and services are now operational, others are being developed or may be developed. We compete for customers based principally on service/device offerings, price, network quality, coverage area and customer service.\nBroadband \nThe desire for high-speed data on demand, including video, is continuing to lead customers to terminate their traditional wired or copper-based services and use our fiber or fixed wireless services or competitors’ wireless, satellite and internet-based services. In most U.S. markets, we compete for customers with large cable companies and wireless broadband providers for high-speed internet and voice services.\nLegacy Voice and Data \nWe continue to lose legacy voice and data subscribers due to industry-wide secular declines and competitors (e.g., wireless, cable and VoIP providers) who can provide comparable services at lower prices because they are not subject to traditional telephone industry regulation (or the extent of regulation they are subject to is in dispute), utilize different technologies or promote a different business model. In most U.S. markets, we compete for customers with large cable companies and other smaller telecommunications companies.\nAdditionally, we provide local and interstate telephone and switched services to other service providers, primarily large internet service providers using the largest class of nationwide internet networks (internet backbone), wireless carriers, other telephone companies, cable companies and systems integrators. These services are subject to additional competitive pressures from the development of new technologies, the introduction of innovative offerings and increasing satellite, wireless, fiber-optic and cable transmission capacity for services.\n6\nAT&T Inc.\nDollars in millions except per share amounts\nRESEARCH AND DEVELOPMENT\nAT&T scientists and engineers conduct research in a variety of areas, including IP networking, advanced network design and architecture, network and cybersecurity, network operations support systems and data analytics. The majority of the development activities are performed to create new services and to invent tools and systems to manage secure and reliable networks for us and our customers. Research and development expenses were $955 in 2024, $954 in 2023, and $1,236 in 2022.\nHUMAN CAPITAL\nNumber of Employees\n As of December 31, 2024, we employed approximately 140,990 persons.\nEmployee Development\n We believe our success depends on our employees’ success and that all employees must have the skills they need to thrive. We offer training and elective courses that give employees the opportunity to enhance their skills. We also intend to help cultivate the next generation of talent that will lead our company into the future by providing employees with educational opportunities through our internal training organization.\nLabor Contracts\n Approximately 43% of our employees are represented by the Communications Workers of America (CWA), the International Brotherhood of Electrical Workers (IBEW) or other unions. After expiration of collective bargaining agreements, work stoppages or labor disruptions may occur in the absence of new contracts or other agreements being reached. The main contract set to expire in 2025 covers approximately 9,000 employees in Arkansas, Kansas, Missouri, Oklahoma and Texas and is set to expire in April.\nCompensation and Benefits\n In addition to salaries, we provide a variety of benefit programs to help meet the needs of our employees. These programs cover active and former employees and may vary by subsidiary and region. These programs include 401(k) plans, pension benefits, and health and welfare benefits, among many others. In addition to our active employee base, at December 31, 2024, we had approximately 496,000 retirees and dependents who were eligible to receive retiree benefits.\nWe review our benefit plans to maintain competitive packages that reflect the needs of our workforce. We also adapt our compensation model to provide fair and inclusive pay practices across our business. We are committed to pay equity for employees who hold the same jobs, work in the same geographic area, and have the same levels of experience and performance.\nEmployee Wellness\n We provide our employees access to flexible and convenient health and welfare programs and workplace accommodations. We have prioritized self-care and emphasized a focus on wellness and providing flexible scheduling or time-off options.\nInclusion\n We believe that championing inclusion does more than just make us a better company, it contributes to a world where people are empowered to be their very best and it leads to a workforce that is representative of, and responsive to, the broad customer base that we serve. That is why we are committed to inclusion and one of the reasons why our company purpose is “to connect people to greater possibilities.” This emanates from our unwavering pledge to ensure that employees feel included when they join AT&T, and are provided with opportunities for advancement, training and development to realize their full potential while working for the company.\nWe believe in attracting and hiring talented people who represent a mix of backgrounds and experiences. At AT&T, we have employee groups that reflect our large and varied workforce. These affinity groups provide opportunities for professional enrichment, leadership, community engagement, market development and networking. It is important that our employees feel they are included, valued, and are fully engaged in our success.",
    "item1a": "Item 1A.",
    "item1b": "ITEM 1B. \nUNRESOLVED STAFF COMMENTS\nNot applicable.",
    "item1c": "ITEM 1C.\n \nCYBERSECURITY\nGovernance\nBoard and Audit Committee Oversight\nOur \nBoard of Directors has delegated to the Audit Committee\n the oversight responsibility to review and discuss with management the Company’s privacy and data security, including cybersecurity, risk exposures, policies and practices, and the steps management has taken to detect, monitor and control such risks and the potential impact of those exposures on our business, financial results, operations and reputation. \nThe full Board and Audit Committee regularly receive reports and presentations on privacy and data security, which address relevant cybersecurity issues and risks and span a wide range of topics.\n These reports and presentations are provided by officers with responsibility for privacy and data security, who include our \nChief Information Security Officer (CISO), Chief Technology Officer (CTO) and AT&T’s Legal team\n. \nIn addition to regular reports to the Audit Committee, we have protocols by which certain security incidents are escalated within the Company and, where appropriate, reported in a timely manner to the Audit Committee.\nChief Security Office/CISO\nWe maintain a \nChief Security Office (CSO)\n, which is charged with management-level responsibility for all aspects of network and information security within the Company. Led by our CISO and comprised of a large team of highly trained security professionals across multiple countries\n, the CSO is responsible for:\na.\nestablishing the policies, standards and requirements for the security of AT&T’s computing and network environments;\nb.\nprotecting AT&T-owned and -managed assets and resources against unauthorized access by monitoring potential security threats, correlating network events and overseeing the execution of corrective actions; \nc.\npromoting compliance with AT&T’s security policies and network and information security program in a consistent manner on network systems and applications; and\nd.\nproviding security thought leadership in the global security arena. \nOur CISO plays the key management role in assessing and managing our material risks from cybersecurity threats.\n The CISO also works closely with AT&T Legal to oversee compliance with legal, regulatory and contractual security requirements. \nThe CISO has extensive technical leadership experience and cybersecurity expertise, gained from approximately 20 years of experience, including serving as the Chief Information Security Officer and Director of the Office of Cybersecurity at a U.S. government agency, in addition to serving as the Chief Information Security Officer of two large public companies. Prior to that, he served for 20 years in the U.S. military, in various information technology roles of increasing seniority. The security professionals in the CSO have cybersecurity backgrounds and expertise relevant to their roles, including, in certain circumstances, relevant industry certifications.\n \nRisk Management and Strategy\nWe maintain a network and information security program that is reasonably designed to protect our information, and that of our customers, from unauthorized risks to their confidentiality, integrity or availability. \nOur program encompasses the CSO and its policies, platforms, procedures and processes for assessing, identifying, and managing risks from cybersecurity threats, including third-party risk from vendors and suppliers.\n \nThe program is integrated into our overall risk management framework\n and is generally designed to identify and respond to security incidents and threats in a timely manner to minimize the loss or compromise of information assets and to facilitate incident resolution.\nWe maintain continuous and near-real-time security monitoring of the AT&T network for investigation, action and response to network security events. This security monitoring leverages tools, where available, such as near-real-time data correlation, situational awareness reporting, active incident investigation, case management, trend analysis and predictive security alerting. We assess, identify and manage risks from cybersecurity threats through various mechanisms, which from time to time may include tabletop exercises to test our preparedness and incident response process, business unit assessments, control gap analyses, threat modeling, impact analyses, internal audits, external audits, penetration tests and engaging third parties to conduct analyses of our information security program. \nWhen circumstances warrant, we also retain external cybersecurity experts to assist the CSO.\n We conduct vulnerability testing and assess identified vulnerabilities for severity, the potential impact to AT&T and our customers, and likelihood of occurrence. We regularly evaluate security controls to maintain their functionality in accordance with security policy. We also obtain cybersecurity threat intelligence from recognized forums, third parties and other sources as part of our risk assessment process. In addition, as a critical infrastructure entity, we collaborate \n15\nAT&T Inc.\nDollars in millions except per share amounts\nwith numerous agencies in the U.S. government to help protect U.S. communications networks and critical infrastructure, which, in turn, informs our cybersecurity threat intelligence. \nWith respect to incident response, the Company has adopted a Cybersecurity Incident Response Plan, as well as a Data Privacy Incident Response Plan that applies if customer information has been compromised (together, the “IRPs”), to provide a common framework for responding to security incidents. This framework establishes procedures for identifying, validating, categorizing, documenting and responding to security events that are identified by or reported to the CSO. The IRPs apply to all AT&T personnel (including contractors and partners) that perform functions or services that require securing AT&T information and computing assets, and to all devices and network services that are owned or managed by the Company. \nThe IRPs set out a coordinated, multi-functional approach for investigating, containing and mitigating incidents, including reporting findings to senior management and other key stakeholders and keeping them informed and involved as appropriate. In general, our incident response process follows the NIST (National Institute of Standards and Technology) framework and focuses on four phases: preparation; detection and analysis; containment, eradication and recovery; and post-incident remediation.\n \nImpact of Cybersecurity Risk\nIn 2024, we \ndid not identify and were not aware of any risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, that we believe have materially affected or are reasonably likely to materially affect\n our business strategy, results of operations or financial condition. For a discussion of cybersecurity risk, please see the information contained under the heading “Cyberattacks impacting our networks, systems or data or those of our suppliers or vendors may have a material adverse effect on our operations or results of operations” of"
  }
}