{
  "ticker": "TDG",
  "cik": "0001260221",
  "company_name": "TransDigm Group INC",
  "filing_date": "2025-11-12",
  "accession": "0001260221-25-000081",
  "primary_doc": "tdg-20250930.htm",
  "item_sections": {
    "item1": "ITEM 1.    BUSINESS\nThe Company\nTD Group, through its wholly-owned subsidiary, TransDigm Inc., is a leading global designer, producer and supplier of highly engineered aircraft components that are critical to the safe and effective operation of nearly all commercial and military aircraft worldwide. Our products are represented in nearly every commercial and military aircraft in service today. Our business is well diversified due to the broad range of products we offer to our customers. We estimate that approximately 90% of our net sales for fiscal year 2025 were generated by proprietary products.\nMost of our products generate significant aftermarket revenue. Once our parts are designed into and sold on a new aircraft, we generate net sales from aftermarket consumption over the life of that aircraft, which is generally estimated to be approximately 25 to 30 years. A typical platform can be produced for 20 to 30 years, giving us an estimated product life cycle in excess of 50 years. We estimate that approximately 55% of our net sales in fiscal year 2025 were generated from the aftermarket, the vast majority of which come from the commercial and military aftermarkets. Historically, these aftermarket revenues have produced a higher gross profit and have been more stable than net sales to original equipment manufacturers (“OEMs”).\n1\nTable of Contents\nOur business strategy is made up of two key strengths: (1) successful execution of our value-driven operating strategy focused around our three core value drivers and (2) a selective acquisition strategy.\nValue-Driven Operating Strategy.\n Our three core value drivers are:\n•\nObtaining Profitable New Business.\n We attempt to obtain profitable new business by using our technical expertise and application skill and our detailed knowledge of our customer base and the individual niche markets in which we operate. We have regularly been successful in identifying and developing both aftermarket and OEM products to drive our growth.\n•\nImproving Our Cost Structure.\n We are committed to maintaining and continuously improving our lean cost structure through detailed attention to the cost of each of the products that we offer and our organizational structure, with a focus on reducing the cost of each.\n•\nProviding Highly Engineered Value-Added Products to Customers.\n We focus on the engineering, manufacturing and marketing of a broad range of highly engineered niche products that we believe provide value to our customers. We believe we have been consistently successful in communicating to our customers the value of our products. This has generally enabled us to price our products to fairly reflect the value we provide and the resources required to do so.\nSelective Acquisition Strategy.\n We maintain a selective acquisition strategy, concentrating on proprietary commercial aerospace component businesses with significant aftermarket content where we see a clear path to value creation through the application of our three core value drivers. The integration of acquisitions into our existing businesses combined with implementing our proven operating strategy has historically resulted in improvements in the financial performance of the acquired businesses. Since the inception of our company in 1993, we have acquired 95 businesses and various product lines. Refer to Note 2, “Acquisitions,” in the notes to the consolidated financial statements included herein for information on the recent acquisitions.\nProducts\nWe primarily design, produce and supply highly engineered proprietary aerospace components with significant aftermarket content. We seek to develop highly customized products to solve specific needs for aircraft operators and manufacturers. We attempt to differentiate ourselves from our competitors by producing highly engineered products with high quality, reliability and timely delivery. Our proprietary products, and particularly our new product initiatives, are designed by our engineers and are intended to serve the needs of the aircraft component industry. These proprietary designs must withstand the extraordinary conditions and stresses that will be endured by products during use and meet the rigorous demands of our customers’ tolerance and quality requirements. Our portfolio of products encompasses a vast array of essential components that play pivotal roles on commercial aerospace and defense platforms, as well as other products. For example, TransDigm’s operating units make aircraft seatbelts and cockpit security systems that keep passengers and pilots safe; parachutes that protect military personnel; and specialized equipment for the National Aeronautics and Space Administration’s (“NASA”) space telescopes, aiding in space exploration and scientific advancement.\nOur engineering costs are recorded in cost of sales and in selling and administrative expenses within our consolidated statements of income. Research and development costs are recorded in selling and administrative expenses within our consolidated statements of income. Refer to Note 1, “Summary of Significant Accounting Policies,” in the notes to the consolidated financial statements included herein with respect to the total costs of research and development.\n2\nTable of Contents\nSegments\nThe Company’s businesses are organized and managed in three reporting segments: Power & Control, Airframe and Non-aviation.\nThe Power & Control segment includes operations that primarily develop, produce and market systems and components that predominately provide power to or control power of the aircraft utilizing electronic, fluid, power and mechanical motion control technologies. Major product offerings include mechanical/electromechanical actuators and controls, ignition systems and engine technology, specialized pumps and valves, power conditioning devices, specialized AC/DC electric motors and generators, batteries and chargers, databus and power controls, advanced sensor products, switches and relay panels, high performance hoists, winches and lifting devices, cargo loading, handling, delivery systems and electronic components used in the generation, amplification, transmission and reception of microwave signals. Primary customers of this segment are engine and power system and subsystem suppliers, airlines, third party maintenance suppliers, military buying agencies and repair depots. Products are sold in the original equipment and aftermarket market channels.\nThe Airframe segment includes operations that primarily develop, produce and market systems and components that are used in non-power airframe applications utilizing airframe and cabin structure technologies. Major product offerings include engineered latching and locking devices, engineered rods, engineered connectors and elastomer sealing solutions, cockpit security components and systems, specialized and advanced cockpit displays, engineered audio, radio and antenna systems, specialized lavatory components, seat belts and safety restraints, engineered and customized interior surfaces and related components, thermal protection and insulation, lighting and control technology, parachutes, specialized flight, wind tunnel and jet engine testing services and equipment and complex testing and instrumentation solutions. Primary customers of this segment are airframe manufacturers and cabin system suppliers and subsystem suppliers, airlines, third party maintenance suppliers, military buying agencies and repair depots. Products are sold in the original equipment and aftermarket market channels.\nThe Non-aviation segment includes operations that primarily develop, produce and market products for non-aviation markets. Major product offerings include seat belts and safety restraints for ground transportation applications, mechanical/electromechanical actuators and controls for space applications, hydraulic/electromechanical actuators and fuel valves for land-based gas turbines, and refueling systems for heavy equipment used in mining, construction and other industries and turbine controls for the energy and oil and gas markets. Primary customers of this segment are off-road vehicle suppliers and subsystem suppliers, child restraint system suppliers, satellite and space system suppliers, manufacturers of heavy equipment used in mining, construction and other industries and turbine original equipment manufacturers, gas pipeline builders and electric utilities.\nFor financial information about our segments, refer to Note 15, “Segments,” in the notes to the consolidated financial statements included herein.\nCustomers\nWe predominantly serve customers in the commercial, regional, business jet and general aviation aftermarket, which generally account for 30% to 35% of our annual net sales; the commercial aerospace OEM market, comprising large commercial transport manufacturers and regional and business jet manufacturers, which generally account for 25% to 30% of our annual net sales; and the defense market (which includes defense OEMs and aftermarket sales to the U.S. and friendly foreign governments), which generally account for approximately 35% to 40% of our annual net sales. \nOur customers include: (1) distributors of aerospace components; (2) worldwide commercial airlines, including national and regional airlines; (3) large commercial transport and regional and business aircraft OEMs; (4) various armed forces of the United States and friendly foreign governments; (5) defense OEMs; (6) system suppliers; and (7) various other industrial customers. Our top ten customers for fiscal year 2025 accounted for approximately 40% of our net sales. Products supplied to many of our customers are used on multiple platforms. None of our customers individually accounted for greater than 10% of our net sales for fiscal year 2025. We believe that our diversified revenue base reduces our dependence on any particular product, platform or market channel and has been a significant factor in maintaining our financial performance.\nCompetition\nThe niche markets within the aerospace industry that we serve are relatively fragmented and we face several competitors for many of the products and services we provide. Due to the global nature of the commercial aircraft industry, competition in these categories comes from both U.S. and foreign companies. Competitors in our product offerings range in size from divisions of large public corporations to small privately-held entities with only one or two components in their entire product portfolios.\n3\nTable of Contents\nWe compete on the basis of engineering, manufacturing and marketing high quality and reliable products, which we believe meet or exceed the performance and maintenance requirements of our customers, consistent and timely delivery, and superior customer service and support. The industry’s stringent regulatory, certification and technical requirements and the investments necessary in the development and certification of products may create disincentives for potential new competitors for certain products. If customers receive products that meet or exceed expectations and performance standards, we believe that they will have a reduced incentive to certify another supplier because of the cost and time of the technical design and testing certification process. In addition, we believe that the availability, dependability and safety of our products are reasons for our customers to continue long-term supplier relationships.\nGovernmental Regulations\nThe commercial aircraft component industry is highly regulated by the Federal Aviation Administration (“FAA”) in the United States and by the European Union Aviation Safety Agency in Europe and other agencies throughout the world, while the military aircraft component industry is governed by military quality specifications. We, and the components we manufacture, are required to be certified by one or more of these entities or agencies, and, in many cases, by individual OEMs, in order to engineer and service parts and components used in specific aircraft models.\nWe must also satisfy the requirements of our customers, including OEMs and airlines that are subject to FAA regulations, and provide these customers with products and services that comply with the government regulations applicable to commercial flight operations. In addition, the FAA and other aviation authorities require that various maintenance routines be performed on aircraft components. We believe that we currently satisfy or exceed these maintenance standards in our repair and overhaul services. We also maintain several FAA-approved repair stations.\nIn addition, our businesses are subject to many other laws and requirements typically applicable to manufacturers and exporters. Without limiting the foregoing, sales of many of our products that will be used on aircraft owned by foreign entities are subject to compliance with export control laws and the manufacture of our products and the operations of our businesses, including the disposal of hazardous wastes, are subject to compliance with applicable environmental laws.\nRefer to",
    "item1a": "Item 1A. “Risk Factors.”",
    "item1b": "ITEM 1B.    UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C.    CYBERSECURITY\nWe have established a risk-based cybersecurity and information security program (“program”) designed to assess, identify, and manage material risks from cybersecurity threats. Our cybersecurity risk management process includes policies that specify the requirements for technical security controls, monitoring systems, tools and services from \nthird-party providers\n, and employee training and awareness. Our cybersecurity risk management process also includes regular independent audits across our operating units. Management oversees our cybersecurity risk management process in order to assess and manage material risks from cybersecurity threats identified by both internal and external threat intelligence. Our program monitors and evaluates risks from cybersecurity threats, and we aim to adapt our program and related processes accordingly.  \nThe \nmulti-layered framework\n on which our cybersecurity and information security program is built incorporates cybersecurity standards and certain requirements of the National Institute of Standards and Technology (“NIST”) Special Publication 800-171—Protecting Controlled Unclassified Information in Non-Federal Systems and Organizations—along with other legal and regulatory requirements. However, this does not mean that we meet any particular technical standards, specifications, or requirements, but rather that we use NIST and other cybersecurity standards as a guide to help us identify, assess, and manage cybersecurity risks relevant to our business.\nOur cybersecurity and information security program is led by the Company’s \nVice President of Cybersecurity (“VPoC”)\n who reports to our Chief Financial Officer. \nOur VPoC has served as a technology leader of cybersecurity, information security, infrastructure, and operational functions for over 35 years.\n The VPoC is supported by the Incident Response Team (“IRT”), a management committee made up of the Co-Chief Operating Officers, Chief Financial Officer, and executives in legal, finance, IT, and audit. The IRT supports the VPoC in assessing and managing risks from cybersecurity threats and in the event of a cybersecurity incident, provides oversight and leadership with respect to incident response.\nAs adopted by our businesses, which has been overseen by our corporate executive team, we have a cybersecurity incident response plan that outlines our policies and procedures to identify, respond to, and recover from cybersecurity threats and cybersecurity incidents. Our businesses are required to conduct regular exercises of their incident response plan as part of our program.\nIn the event of a potentially material cybersecurity incident, as determined by the VPoC with support from legal, as needed, the IRT is notified through an established escalation protocol. The Chair of the Audit Committee is also notified and briefed, and meetings of the Audit Committee and/or full \nBoard of Directors\n would be held as appropriate. We maintain a relationship with third-party forensic vendor(s) available for incident response and investigation. Additionally, we maintain cybersecurity insurance.\n14\nTable of Contents\nThe Company’s Board of Directors oversees our enterprise risk management (“ERM”) program and has delegated the primary responsibility for its oversight, which includes oversight of cybersecurity risk, to the Audit Committee. The Audit Committee is informed of material risks from cybersecurity threats through regular discussion with management regarding cybersecurity risk mitigation and cybersecurity incident management. Executive management, including our VPoC, regularly presents to the Audit Committee regarding cybersecurity matters, including program updates, key metrics, and developments.\nThe ERM program inventories and classifies key risk areas. We employ a methodology for scoring the risks based on the probability and impact of individual risks and discuss and implement countermeasures to address the risks.\n \nBased on the information we have as of the date of this Annual Report on Form 10-K, we \ndo not believe any risks from cybersecurity threats\n, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect our business strategy, results of operations or financial condition. For further information about risks related to cybersecurity threats, refer to"
  }
}