{
  "ticker": "TDY",
  "cik": "0001094285",
  "company_name": "TELEDYNE TECHNOLOGIES INC",
  "filing_date": "2025-02-21",
  "accession": "0001094285-25-000053",
  "primary_doc": "tdy-20241229.htm",
  "item_sections": {
    "item1": "Item 1.\nBusiness\nWho We Are\nTeledyne Technologies Incorporated is a Delaware corporation that provides enabling technologies for industrial growth markets that require advanced technology and high reliability.  These markets include aerospace and defense, factory automation, air and water quality environmental monitoring, electronics design and development, oceanographic research, deepwater oil and gas exploration and production, medical imaging and pharmaceutical research.  Our products include digital imaging sensors, cameras and systems within the visible, infrared and X-ray spectra, monitoring and control instrumentation for marine and environmental applications, harsh environment interconnects, electronic test and measurement equipment, aircraft information management systems, and defense electronics and satellite communication subsystems.  We also supply engineered systems for defense, space, environmental and energy applications.  We believe our technological capabilities, innovation and ability to invest in the development of new and enhanced products are critical to obtaining and maintaining leadership in our markets and the industries in which we compete.  We became an independent public company effective November 29, 1999.\nThe following description of our business should be read together with “Management’s Discussion and Analysis of Financial Condition and Results of Operations” within Item \n7\n of this Form 10-K.\nRecent Developments\nConsistent with our strategy, we completed two acquisitions each in 2024 and in 2023.  The financial results of these acquisitions have been included since the respective date of each acquisition.  Our 2024 and 2023 acquisitions were within the Digital Imaging and Instrumentation segments.  See Note \n3\n for additional information about our 2024 and 2023 business acquisitions. Subsequent to the end of the year, we have completed two acquisitions.  See Note \n18\n for additional information.\nOur Business Segments\nOur businesses are aligned in four segments: Digital Imaging, Instrumentation, Aerospace and Defense Electronics and Engineered Systems.  Additional financial information about our business segments can be found in Note \n4\n.\n \n \nPercentage of Total Net Sales\nSegment contribution to total net sales:\n2024\n2023\n2022\nDigital Imaging\n54\n \n%\n56 \n%\n57 \n%\nInstrumentation\n24\n \n%\n23 \n%\n23 \n%\nAerospace and Defense Electronics\n14\n \n%\n13 \n%\n12 \n%\nEngineered Systems\n8\n \n%\n8 \n%\n8 \n%\nTotal\n100\n \n%\n100 \n%\n100 \n%\nDigital Imaging Segment\nOur Digital Imaging segment includes high-performance sensors, cameras, and systems, within the visible, infrared, ultraviolet and X-ray spectra for use in industrial, scientific, government, space, defense, security, medical and other applications.  We also produce and provide manufacturing services for micro electromechanical systems (“MEMS”) and high-performance, high-reliability semiconductors including analog-to-digital and digital-to-analog converters, as well as unmanned aerial and ground systems.\nThrough this segment, we provide visible spectrum sensors and digital cameras for industrial machine vision and automated quality control, as well as for medical, research and scientific applications.  We provide a range of cooled and uncooled infrared or thermal products, including sensors, camera cores and camera systems based on long wave infrared, mid-wave infrared, and short-wave infrared technologies.  Products and applications include space-based imaging, factory condition monitoring, optical and acoustic-based gas leak detection, laboratory research and maritime thermal imaging.  We develop high-resolution, low-dose X-ray sensors as well as high-power microwave and high-energy X-ray subsystems for medical, dental and industrial applications.  We also provide instruments for the measurement of physical properties and maritime products for recreational and commercial customers globally.\nWe provide research and engineering capabilities primarily in the areas of electronics, materials, optical systems, and information science to military, aerospace and industrial customers, as well as to various businesses throughout Teledyne.\n1\nTable of Contents\nFor defense applications, we also develop and manufacture multi-spectrum electro-optic/infrared imaging systems and associated products such as lasers, optics, and radars, CBRNE (“Chemical, Biological, Radiological, Nuclear and Explosive detectors”) and unmanned air and ground systems.  These sensors and instruments can be deployed as integrated solutions and with advanced target detection, identification and classification capabilities.  We provide solutions for threat protection, military maneuver and force protection, border controls and homeland security, law enforcement, public safety, and commercial applications worldwide. \nInstrumentation Segment\nOur Instrumentation segment provides monitoring and control instruments for marine, environmental, industrial and other applications, and electronic test and measurement equipment.  We also provide power and communications connectivity devices for distributed instrumentation systems and sensor networks deployed in mission critical, harsh environments.  Below is a description of the product lines that comprise the Instrumentation segment.\nMarine Instrumentation\nWe offer a variety of products designed for use in harsh underwater environments, instruments that measure currents and other physical properties in the water column, systems that create acoustic images of objects beneath the water’s surface, including the bottom of a body of water, instruments for navigation and sensors that determine the geologic structure below the bottom.  We also design and manufacture vehicles that utilize and transport these sensors over and beneath the water’s surface.\nWe provide a broad range of end-to-end undersea interconnect solutions to the offshore oil and gas, naval defense, oceanographic and telecom markets.  We manufacture subsea, wet-mateable electrical and fiber-optic interconnect systems and subsea pressure vessel penetrators and connector systems with glass-to-metal seals.  Our waterproof and splash-proof neoprene and glass reinforced epoxy connectors and cable assemblies are used in underwater equipment, submerged monitoring systems and other industrial and defense applications.  Other marine products used by the U.S. Navy and commercial customers include acoustic modems for networked underwater communication and optical underwater cameras and LED lighting sources.\nWe manufacture complete autonomous-operated underwater vehicles systems, including underwater gliders.  Glider applications range from oceanographic research to persistent surveillance systems for the U.S. Navy.  We also design and manufacture remotely operated underwater vehicles used in maritime security, military, search and rescue, aquaculture, and scientific research applications.\nEnvironmental Instrumentation\nWe offer a wide range of products used for environmental monitoring.  Our instrumentation monitors trace levels of gases such as sulfur dioxide, carbon monoxide, oxides of nitrogen and ozone, as well as particulate pollution, in order to measure the quality of the air we breathe.  We supply monitoring systems for the detection, measurement and automated reporting of air pollutants from industrial stack emissions, ozone generators and other process gas monitoring instruments.  We also supply water monitoring systems for wastewater monitoring and detection of water-borne pathogens and contaminants of concern.  Our instrumentation is used to detect a variety of water quality parameters and in applications found in petrochemical and refinery facilities.\nWe also manufacture and provide complementary laboratory instrumentation including through laboratory automation and sample introduction systems that automate the preparation and concentration of organic samples.\nOur advanced elemental analysis products are used by environmental and quality control laboratories to detect trace levels of inorganic contaminants in water, foods, soils and other environmental and geological samples.  We manufacture high-precision pumps utilized in a wide variety of analytical, research clinical, preparative and fluid-metering applications.  In addition, we manufacture liquid chromatography instruments and accessories for the purification of organic compounds, which include highly sensitive evaporative light scanning detectors, primarily for pharmaceutical laboratories involved in drug discovery and development.  We manufacture instruments that are used by pharmaceutical scientists to evaluate the release rate characteristics and physical properties of various dosage forms to ensure the safety and efficacy of medicines worldwide.\nFinally, we manufacture\n \nfixed and portable industrial gas and flame detection instruments used in a variety of industries including petrochemical, power generation, oil and gas, food and beverage, mining and wastewater treatment. \nTest and Measurement Instrumentation\nOur test and measurement products provide capabilities that enable the designers of complex electronic systems in many industry sectors to bring their products to market reliably and quickly.  Our customers use our equipment in the design, development, manufacture, installation, deployment and operation of electronics equipment in a broad range of industries, including aerospace and defense, internet infrastructure, automotive, industrial, computer and semiconductor, consumer electronics mobile and power electronics.\n2\nTable of Contents\nWe develop, manufacture, sell and license high-performance oscilloscopes, high-speed protocol analyzers, generators and emulators, and related test and measurement solutions for a wide range of industries.  Our oscilloscopes are used by designers and engineers to measure and analyze complex electronic signals to develop high-performance systems, validate high data-rate communication interfaces, qualify their electronic designs, and improve time-to-market.  We also make high-speed, high-resolution modular analog-to-digital conversion systems for applications, including test and measurement, scientific instruments, medical imaging, and distributed sensing systems.\nDesign and test engineers use our protocol analysis solutions, including traffic generators and emulators, to accurately and reliably monitor and test high data-rate communication interfaces and diagnose operational problems in a wide range of systems and devices to ensure that they comply with industry standards, including in the areas of cloud computing, data storage and networks.  Our leadership in USB and video technologies provides a unique base to service the mobile, internet of things, automotive and consumer electronics test markets.  We also produce protocol validation and test tools for high-performance solid-state storage devices used in both enterprise-grade data centers and in consumer computing applications.  Our interposers and software options allow engineers to get a complete picture when testing the PCI Express interface standard by enabling a link between an oscilloscope and a protocol analyzer to show a synchronized view of both the physical and protocol layers. \n \nWe also manufacture torque sensors and automatic data acquisition systems that are used to test critical control valves in nuclear power and industrial plants.  Our torque sensors are also used in other markets, including automotive and power tools.\nAerospace and Defense Electronics Segment\nOur Aerospace and Defense Electronics segment provides sophisticated electronic and optical components and subsystems, data acquisition and communications components and equipment, harsh environment interconnects, general aviation batteries and other components for a variety of commercial and defense applications that require high performance and high reliability.\n \nSuch applications include aircraft, radar, electronic countermeasures, weapon systems, space, wireless and satellite communications and terminals and test equipment.\nWe provide onboard avionics systems and ground-based applications that allow civil and military aircraft operators to access, manage and utilize their data more efficiently.  Our products include aircraft data and connectivity solutions, hardware systems, and software applications used by commercial airlines and the U.S. military, and we provide services related to our products. \nEngineered Systems Segment\nOur Engineered Systems segment provides innovative systems engineering, integration and advanced technology development, and complex manufacturing solutions for defense, space, environmental and energy applications.  This segment also designs and manufactures electrochemical energy systems and manufactures specialty electronics for demanding military applications.  \nOur core business base includes National Aeronautics and Space Administration (“NASA”), the U.S. Department of Defense, the U.S. Department of Energy, foreign militaries and commercial customers.\nCustomers\nWe have a broad and diversified customer base in the various markets we serve.  No commercial customer in 2024 or 2023 accounted for more than 10% of net sales for any of our segments or for the total Company.\nTotal sales to international customers were $2,731.1 million in 2024 and $2,740.1 million in 2023.  Of these net sales to international customers, our businesses in the United States accounted for $950.0 million in 2024 and $900.5 million in 2023.  \nIn both 2024 and 2023, we sold products to customers in over 100 foreign countries.  Approximately 90% of our net sales to international customers during 2024 were made to customers in 30 foreign countries.  In 2024, the top five countries for sales to international customers, ranked by net sales, were the United Kingdom, China, Germany, Japan and France and represented approximately 19% of our total net sales.  There were no sales to individual countries outside of the United States in excess of 10% of our sales.\n3\nTable of Contents\nInformation on our net sales to the U.S. Government, including direct sales to agencies as a prime contractor and indirect sales as a subcontractor, was as follows (in millions):\nU.S. Government sales by segment:\n2024\n2023\n2022\nDigital Imaging\n$\n557.1\n$\n570.7\n$\n619.1\nInstrumentation\n123.5\n95.9\n108.1\nAerospace and Defense Electronics\n307.5\n330.3\n266.3\nEngineered Systems\n389.0\n384.8\n366.4\nTotal U.S. Government sales\n$\n1,377.1\n$\n1,381.7\n$\n1,359.9\nTotal U.S. Government sales as a percent of total net sales\n24.3\n \n%\n24.5 \n%\n24.9 \n%\nOur principal U.S. Government customer is the U.S. Department of Defense, with total net sales of $1,062.7 million and $1,081.3 million in 2024 and 2023, respectively.  With the exception of the Engineered Systems segment, no U.S Government program in 2024 or 2023 accounted for more than 10% of net sales for any of our segments or for the total Company.  In 2024 and 2023, the largest program with the U.S. Government within the Engineered Systems segment was the Marshall Operations, Systems, Services, and Integration II (“MOSSI II”) contract with the NASA Marshall Space Flight Center, which represented approximately 16% and approximately 17% of Engineered Systems net sales, respectively.\nAs described in greater detail under",
    "item1a": "Item \n1A\n. Risk Factors for more information on our cybersecurity risks.\nRisk Management and Strategy\nOur cybersecurity strategy prioritizes risk identification, quantification, communication, and mitigation, and this strategy is aligned with our overall Enterprise Risk Management strategy.\n  Our strategy focuses on the deterrence, early detection, interception, and interruption of potential cyber-attacks.  We strive to continuously monitor, evaluate, prioritize and mitigate vulnerabilities and attacks.  Our policies and processes are compliant with applicable control frameworks provided by the U.S. National Institute of Standards and Technology (“NIST”) and other applicable standards.\nOur employees are required to take cybersecurity-related training which promotes awareness of how to detect and respond to cybersecurity threats.  We utilize benchmarking against peers in the industry to validate our defense posture, and we conduct internal and external assessments to evaluate our controls around information technology, operating technology, and product and service information security.  We work with government, customer, industry and/or supplier partners, such as the National Defense Cyber Alliance to gather and develop best practices and share information to address cyber threats, and we contribute to overall cyber-safety of the defense industrial base through contributions of threat intelligence to law enforcement agencies.\nWe deploy layered defenses and connect them to allow automated responses to urgent threats, which aims to provide continued protection for mobile computing systems when they are outside the company perimeter.  We conduct active threat hunting and vulnerability scanning to anticipate and pro-actively mitigate risks.  We utilize third-party risk scoring services to quantify cybersecurity risks associated with our supply chain and service providers. We also use cybersecurity vetting procedures to maintain lists of approved and disallowed applications and services.\nWe have incident response plans and procedures, the goal of which is to enable the company to respond effectively and compliantly should a cyber-incident arise.  “Tabletop” exercises are held at both the technical and executive level to maintain readiness to respond and to identify any areas where improvements or updates are required.  \nWe engage third-party expertise and utilize threat intelligence feeds to supplement and enhance our internal team of cybersecurity professionals.\nGovernance\nPursuant to its charter, the Audit Committee of the Board is responsible for reviewing, discussing and making recommendations to the Board on cybersecurity matters.  \nOur Vice President of Information Technology and Chief Information Officer (“CIO”) and our Chief Information Security Officer (“CISO”) provide presentations to the Audit Committee on cybersecurity status, outcomes, and risks at each quarterly meeting.  These briefings include assessments of cyber risks and threats landscape, updates on incidents, and our investments and plans in cybersecurity risk mitigation and governance.\n \nAt the management level, our Enterprise Risk Management Committee identifies and drives mitigation of company-wide risks, including those related to cybersecurity.  The committee consists of our Vice President, Associate General Counsel and Assistant Secretary (“Chair”), Executive Vice President and Chief Financial Officer, Executive Vice President, General Counsel, Chief Compliance Officer and Secretary, Associate General Counsel and Senior Vice President, Human Resources, Vice President and CIO, and individuals representing the business operations.  The Chair of the Enterprise Risk Management Committee periodically reports to the Audit Committee and the Board of Directors on the progress and results of the actions taken by the committee. \nOur management team, including our Enterprise Risk Management Committee, CIO and CISO, is responsible for assessing and managing our cybersecurity risks and threats.  \nOur \nCISO\n, who has approximately 30 years in various information technology and security roles and reports to our CIO, is primarily responsible for our overall cybersecurity risk management program and supervises both internal and external resources to prevent, detect, mitigate, and remediate cybersecurity risks, threats, and incidents.\n  As such, our CISO has extensive experience and expertise in developing, implementing, and operating security policies and procedures covering our protective defenses of our network and critical data.  \nWe have established processes by which the CISO routinely informs the management team and the \nBoard\n of cybersecurity risks, threats and incidents that have been identified or are reasonably likely of occurring and how such matters are managed.\n21\nTable of Contents",
    "item1b": "Item 1B.    Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.    Cybersecurity\nWe face many cybersecurity threats including ransomware and more advanced and persistent threats from state-affiliated groups.  We have experienced cyber-attacks in the past and may experience cybersecurity incidents going forward.  Our customers and suppliers face similar cybersecurity threats.  While prior incidents have not materially affected our business, results of operations or financial condition, there is no guarantee that a future cyber incident would not affect our business strategy, results of operations or financial condition.\n  See"
  }
}