{
  "ticker": "TECH",
  "cik": "0000842023",
  "company_name": "BIO-TECHNE Corp",
  "filing_date": "2025-08-22",
  "accession": "0001558370-25-011716",
  "primary_doc": "tech-20250630x10k.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nOVERVIEW\nBio-Techne and its subsidiaries, collectively doing business as Bio-Techne Corporation (Bio-Techne, we, our, us or the Company), develop, manufacture and sell life science reagents, instruments and services for the research, diagnostics and bioprocessing markets worldwide. Our broad product portfolio and application expertise enables scientific investigations into biological processes and molecular diagnostics, revealing the nature, diagnosis, etiology and progression of specific diseases. Our products aid in drug discovery efforts and provide the means for accurate clinical tests and diagnoses.\nWe manage the business in two operating segments – our Protein Sciences segment and our Diagnostics and Spatial Biology segment. Our Protein Sciences segment is a leading developer and manufacturer of high-quality biological reagents used in all aspects of life science research, diagnostics and cell and gene therapy. This segment also includes proteomic analytical tools, both manual and automated, that offer researchers and pharmaceutical manufacturers efficient and streamlined options for protein analysis, automated western blot, and multiplexed ELISA workflows. Our Diagnostics and Spatial Biology segment develops and manufactures diagnostic products, including controls, calibrators, and diagnostic assays for the regulated diagnostics market, exosome-based molecular diagnostic assays, advanced tissue-based in-situ hybridization assays and instrumentation for spatial genomic and tissue biopsy analysis, and genetic and oncology kits for research and clinical applications.\nWe are a Minnesota corporation with our global headquarters in Minneapolis, Minnesota. We were founded in 1976 as Research and Diagnostic Systems, Inc. We became a publicly traded company in 1985 through a merger with Techne Corporation, now Bio-Techne Corporation. Our common stock is listed on the NASDAQ under the symbol “TECH.” We operate globally, with offices in many locations throughout North America, Europe and Asia. Today, our product lines include hundreds of thousands of diverse products, most of which we manufacture ourselves in multiple locations in North America, as well as locations in the U.K., Canada, Switzerland and China.\nWe have implemented a disciplined strategy to accelerate growth in part by acquiring businesses and product portfolios that leveraged and diversified our existing product lines, filled portfolio gaps with differentiated high growth businesses, and expanded our geographic scope. Recent examples include the investment in Spear Bio at the beginning of fiscal 2025 and the acquisition of Lunaphore SA (“Lunaphore”) at the beginning of fiscal 2024. We also completed a 19.9% investment in Wilson Wolf Corporation (“Wilson Wolf”) in fiscal 2023, and will acquire the remaining ownership in Wilson Wolf by the end of calendar year 2027, if not earlier due to its achievement of revenue or earnings before interest, taxes, depreciation, and amortization (“EBITDA”) targets. Recognizing the importance of an integrated, global approach to meeting our mission and accomplishing our strategies, we have maintained many of the brands of the companies we have acquired, but unified under a single global brand -- Bio-Techne.\nWe are committed to providing the life sciences community with innovative, high-quality scientific tools that allow our customers to make extraordinary discoveries and treat and diagnose diseases. We intend to build on Bio-Techne’s past accomplishments, high product quality reputation and sound financial position by executing strategies that position us to serve as the standard for biological content in the research market, and to leverage that leadership position to enter the diagnostics and other adjacent markets. Our strategic pillars include:\nGrow & Leverage the Core. \nThrough collaborations with key opinion leaders, participation in scientific discussions and societies, and leveraging our internal talent we expect to be able to convert our continued significant investment in our research and development activities to be first-to-market with quality products that are at the leading edge of life science researchers’ needs.\nCapitalize on High Potential Markets.\n We will continue to leverage our strong balance sheet to gain access to new and differentiated technologies and products that improve our competitiveness in the current market, meet customers’ expanding workflow needs and allow us to enter adjacent markets.\nMarket Expansion Through Innovation & Acquisition. \nWe will leverage our existing portfolio to expand our product offerings into novel research fields and further penetrate diagnostics and therapeutics markets. \n4\n\n\nTable of Contents\nAcquisitions have, and will likely continue to play, an important role in our efforts to expand our portfolio of innovative tools and bioactive reagents, and support our initiatives to enter adjacent markets.\nDeliver Best-in-Class Customer Experience. \nWe will continue to expand our sales staff and distribution channels globally in order to increase our global presence and make it easier for customers to transact with us. We strive for every interaction to be seamless, personalized, and exceeding expectations. We aim to deeply understand customers’ wants and needs while simultaneously offering high-quality service at every touchpoint. \nDevelop People Through a Transofrmative Culture. \nAs we continue to grow both organically and through acquisition, we are intentionally fostering an “EPIC” culture based on the ideals of Empowerment, Passion, Innovation and Collaboration. We strive to recruit, train and retain the most talented staff, who share these EPIC ideals to effectively implement our global strategies.\nPROTEIN SCIENCES SEGMENT\nProtein Sciences Segment Products and Markets\nThe Protein Sciences segment is the larger of our two segments, representing approximately 72% of our net sales in fiscal 2025. It is comprised of two divisions with complementary product offerings serving many of the same customers – the Reagent Solutions division and the Analytical Solutions division.\nThe Reagent Solutions division consists of specialized proteins, such as cytokines and growth factors, antibodies, small molecules, tissue culture sera and cell selection technologies traditionally used by researchers to further their life science experimental activities and by companies developing next generation diagnostics and therapeutics, including cell- and gene-based therapeutics. We believe we are the world leader in providing high quality proteins, both for research use and under current Good Manufacturing Practices, or cGMP. Key product brands include R&D Systems, Tocris Biosciences and Novus Biologicals. Our combined chemical and biological reagents portfolio provides high quality tools that customers can use in solving complex biological pathways and glean knowledge that may lead to a more complete understanding of biological processes, and, ultimately, to the development of novel therapeutic strategies to address different pathologies. In recent years, we have made several acquisitions and investments that have expanded our product offerings for the cell and gene therapy market. These include a significant investment in state-of-the art facilities for production of both proteins and small molecules in large quantities manufactured in accordance with cGMP, as well as a 19.9% investment in, and eventual acquisition of , Wilson Wolf, a leading provider of cell culture devices for cell-based therapies. Through a collaborative marketing venture with Wilson Wolf and another company, we have leveraged the products we have or are developing to provide a more complete offering for the cell and gene therapy market.\nThe Analytical Solutions division includes manual and automated protein analysis instruments and immunoassays that are used in quantifying proteins in a variety of biological fluids. Products in this division include traditional manual plate-based immunoassays, fully automated multiplex immunoassays on various instrument platforms, and automated western blotting and isoelectric focusing analysis of complex protein samples. Key product brands include R&D Systems and ProteinSimple. A number of our products have been demonstrated to have the potential to serve as predictive biomarkers and therapeutic targets for a variety of human diseases and conditions including cancer, autoimmunity, diabetes, hypertension, obesity, inflammation, neurological disorders, and kidney failure. Immunoassays can also be useful in clinical diagnostics. In fact, we have received Food and Drug Administration (FDA) marketing clearance for a few of our immunoassays for use as \nin vitro\n diagnostic devices. \nProtein Sciences Segment Customers and Distribution Methods\nOur customers for this segment include researchers in academia and industry (chiefly pharmaceutical and biotech companies as well as contract research organizations). This segment also sells to diagnostic/companion diagnostic and therapeutic customers, including those engaged in the development of cell- and gene-based therapies. Our biologics line of products in the Analytical Solutions division is used chiefly by production and quality control departments at biotech and pharmaceutical companies. We sell our products directly to customers who are primarily located in North America, Europe and China, as well as through a distribution agreement with Thermo Fisher Scientific. We also sell through third \n5\n\n\nTable of Contents\nparty distributors in China, Japan, certain eastern European countries and the rest of the world. Our sales are widely distributed, and no single end-user customer accounted for more than 10% of the Protein Sciences segment’s net sales during fiscal 2025, 2024, or 2023.\nDIAGNOSTICS AND SPATIAL BIOLOGY SEGMENT\nThe Diagnostics and Spatial Biology segment, representing approximately 28% of our net revenues in fiscal 2025, includes three divisions and is focused primarily on the diagnostic and research markets and includes spatial biology, liquid biopsy, molecular diagnostics kits and products, and diagnostics reagents.\nDiagnostics and Spatial Biology Segment Products\nThe Spatial Biology division products sold under the Advanced Cell Diagnostics, or ACD, brand, are novel \nin-situ\n hybridization (ISH) assays for transcriptome, DNA copy, and structural variation analysis within intact cells, providing highly sensitive and specific spatial information at single cell resolution. Since these products preserve spatial context, they are particularly useful for complex tissue profiling. In the first quarter of fiscal 2024, we closed on the acquisition of Lunaphore, a leading developer of fully automated spatial biology solutions using precision microfluidic technology capable of revealing hyperplex proteomic and transcriptomic biomarkers in tumors and other tissues at single-cell and subcellular resolution. Lunaphore’s COMET instrument automates ACD’s RNAscope assays and utilizies antibodies to enable simultaneous hyperplex detection of protein and RNA biomarkers on the same slide at single-cell resolution.\nThe Molecular Diagnostics division markets and sells products and services under the Exosome Diagnostics and Asuragen brands. The Exosome Diagnostics brand is based on exosome-based liquid biopsy techniques that analyze genes or their transcripts. It includes the ExoDx Prostate test, which is a urine-based assay for early detection of high-grade prostate cancer used as an aid in deciding the need for biopsy in men with grey-zone prostate specific antigen (PSA) scores. ExoDX Prostate is offered by Exosome Diagnostics as a lab-developed test. We have also licensed exclusively the ExoTRU kidney transplant rejection test to Thermo Fisher Scientific. We also sell products for genetic carrier screening, oncology diagnostics, molecular controls, and research under the Asuragen brand. \nThe Diagnostic Reagents division consists of regulated products traditionally used as calibrators and controls in the clinical setting. Also included are instrument and process control products for hematology, blood chemistry, blood gases, coagulation controls and reagents used in various diagnostic applications. We often manufacture these reagents on a custom basis, tailored to a customer’s specific diagnostic assay technology. We supply these reagents in various formats including liquid, frozen, or in lyophilized form. Most of these products are sold on an Original Equipment Manufacturer (OEM) basis to instrument manufacturers, with most products being FDA-cleared.\nDiagnostics and Spatial Biology Segment Customers and Distribution Methods\nThe customers for the Spatial Biology division include researchers in academia as well as investigators in pharmaceutical and biotech companies. We sell our products directly to those customers who are primarily located in North America, Europe, and China, and through distributors elsewhere. In addition to being useful research tools, our DNA and RNA \nin situ \nhybridization (ISH) assays have diagnostics applications, and several are cleared or currently under review by the FDA in partnership with diagnostics instrument manufacturers and pharmaceutical companies. \nIn the United States, we offer the ExosomeDx Prostate test to physicians using our lab-developed non-invasive urine-based assay for prostate cancer detection. Our diagnostic laboratory is certified under and regulated by the State of Massachusetts pursuant to the Clinical Laboratory Improvement Amendments, or CLIA. We reach our customers through physicians prescribing such tests for their patients. This test is also available in Europe as a CE-marked product. The Asuragen-branded products are sold primarily to laboratories for use in lab-developed tests or in kit form as regulated diagnostic tests.\nThe majority of Diagnostic Reagents Division’s sales are through OEM agreements, but we sell some of our diagnostic reagent products directly to customers and, in Europe and Asia, also through distributors. \nNo customer accounted for 10% or more of the reporting segment’s consolidated net sales during fiscal 2025, 2024 or 2023.\n6\n\n\nTable of Contents\nMANUFACTURING AND MATERIALS\nOur manufacturing operations use a wide variety of raw materials and components, including electronic components, chemicals and biological materials. No single supplier is material, although for some components that require particular specifications or regulatory or other qualifications there may be a single supplier or a limited number of suppliers that can readily provide such components. We utilize a number of techniques to address potential disruption in and other risks relating to our supply chain, which in certain cases includes the use of safety stock, alternative materials, and qualification of multiple supply sources.\nThe majority of our products are shipped within one day of receipt of the customers’ orders, other than our instruments and related cartridges, which are typically shipped within one to two weeks of receipt of an order. There was no significant backlog of orders for our products as of the date of this Annual Report on Form 10-K or as of a comparable date. For additional discussion of risks relating to supply chain and manufacturing, refer to “",
    "item1a": "Item 1A. Risk Factors – “A significant disruption in, or breach of security of, our information technology systems or data, or violation of data privacy laws, could result in damage to our reputation, data integrity and/or subject us to costs, fines, or lawsuits under data privacy or other laws or contractual requirements.”\n \n​\nCybersecurity Risk Management and Strategy \nBio-Techne’s cybersecurity strategy is to maintain and fortify a secure, actively-monitored environment for our internal and our customers’ data while supporting our and our customers’ business needs. \nOur cybersecurity program follows industry standards and best practice for preventing, detecting, remediating, and mitigating potential cybersecurity threats, including regular processes to identify, evaluate and manage potential risks\n.\n​\n28\n\n\nTable of Contents\nOur IT Security Operations team administers and monitors the prevention, detection, mitigation, and remediation of potential cybersecurity risks. This team leverages both Bio-Techne’s internal IT resources, including its personnel, as well as managed security service providers and other \nthird-party\n security software and technology services, as well as through other means. We also have implemented processes and technologies for network monitoring and data loss prevention procedures.\n​\nWe conduct periodic risk assessments, including with support from external vendors, to assess our cyber program, identify areas of enhancement, and develop strategies for the mitigation of cyber risks. \nWe also conduct regular security testing and have established a vulnerability management process supported by security testing, for the treatment of identified security risks based on severity, including risks arising from our use of third-party providers software and service providers. In addition to our evolving processes and systems, we foster a culture of cybersecurity education, training, and testing. Every year, employees must take and pass rigorous information security and protection training. \n​\nWe partner with experienced external consultants to assess our cybersecurity program, and to perform penetration testing as well as other testing programs designed to identify vulnerabilities and areas for fortification. Also, as part of our cybersecurity risk management program we maintain cyber insurance, with coverage amounts and terms that are typical and appropriate for a company of our size and type. This insurance may not be sufficient to cover us against all types of claims related to security breaches, cyberattacks and other related breaches. \n​",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nThere are no unresolved staff comments as of the date of this report.",
    "item1c": "ITEM 1C. CYBERSECURITY\nCybersecurity Governance and Oversight\nBio-Techne’s cybersecurity program is led by \nthe Company’s \nChief Information Officer\n (“CIO”), with day-to-day management and administration of our cybersecurity program performed by the Director of IT Infrastructure and Security and the IT Security Operations team.\n The Director of IT Infrastrcuture and Security reports to the CIO, and the CIO reports to the Chief Financial Officer. The CIO is supported by the Incident Response Team (“IRT”), a multi-disciplinary management committee comprising senior members from the Security Operations Team, legal, finance, internal audit and other functions. The IRT supports the CIO in supporting and reviewing information security risks and in the event of a cybersecurity incident provides leadership with respect to incident response, investigation, mitigation and remediation. \n​\nIn addition to leadership and support within management, we also work with security service providers to monitor for vulnerabilities and threats, and which are reported to the Security Operations team. All employees are trained and tested annually on cybersecurity risks, and we continually perform simulated phishing exercises. We also conduct periodic tabletop exercises for key personnel involved in cybersecurity risk management, including the IRT.\n​\nOur Board of Directors (“Board”) holds overall oversight responsibility for the Company’s strategy and risk management, including in relation to cybersecurity risks. The Board exercises its oversight function through the \nAudit Committee\n, which oversees the management of risk exposure across various areas, including data security risks, in accordance with its charter. \nIn addition, the Audit Committee is specifically responsible for the review and approval of any cybersecurity incident disclosure, as set forth in the Committee’s charter. In the event of a potentially significant cybersecurity incident, the Audit Committee’s charter requires that management promptly communicate and consult with the Audit Committee.\n​\nBio-Techne’s General Counsel updates the Audit Committee multiple times per year regarding Bio-Techne’s cybersecurity programs, including regularly-tracked metrics on incident response, internal security testing, and measures implemented to monitor and address cybersecurity risks and threats, as appropriate. The Audit Committee regularly \nupdates\n the full Board on these matters. In addition, on at least an annual basis, the CIO provides the full Board with a thorough review of the Company’s cybersecurity program, including current status, industry risks and exposure, and future strategy.\n​\nBased on the information we have as of the date of this Annual Report, we do not believe any risks from cybersecurity threats have materially affected or are reasonably likely to materially affect Bio-Techne, including our business strategy, results of operations or financial condition.\n However, please see"
  }
}