{
  "ticker": "TEL",
  "cik": "0001385157",
  "company_name": "TE Connectivity plc",
  "filing_date": "2025-11-10",
  "accession": "0001104659-25-109150",
  "primary_doc": "tel-20250926x10k.htm",
  "item_sections": {
    "item1": "ITEM \n1.  BUSINESS\nGeneral\nWe are a global industrial technology leader creating a safer, sustainable, productive, and connected future. As a trusted innovation partner, our broad range of connectivity and sensor solutions enable the distribution of power, signal, and data to advance next-generation transportation, energy networks, automated factories, data centers enabling artificial intelligence, and more. References in this report to “TE Connectivity,” the “Company,” “we,” “us,” or “our” refer to TE Connectivity Ltd. before September 30, 2024 and to TE Connectivity plc on or after September 30, 2024.\nWe became an independent, publicly traded company in 2007; however, through our predecessor companies, we trace our foundations in the connectivity business back to 1941.\nDuring fiscal 2024, our board of directors and shareholders approved a change in our jurisdiction of incorporation from Switzerland to Ireland. In connection with the change, TE Connectivity Ltd., our former parent entity, entered into a merger agreement with TE Connectivity plc, its then wholly-owned subsidiary and a public limited company incorporated under Irish law. Under the merger agreement, TE Connectivity Ltd. merged with and into TE Connectivity plc, which was the surviving entity, in order to effect our change in jurisdiction of incorporation from Switzerland to Ireland. The merger was completed on September 30, 2024, thereby changing our jurisdiction of incorporation from Switzerland to Ireland. Effective for fiscal 2025, we are organized under the laws of Ireland. We have not had and do not anticipate any material changes in our operations or financial results as a result of the merger and change in place of incorporation. \nWe acquired Richard Manufacturing Co. (“Richards Manufacturing”) in fiscal 2025. See Note 4 to the Consolidated Financial Statements for additional information regarding the acquisition.\nWe have a 52- or 53-week fiscal year that ends on the last Friday of September. Fiscal 2025, 2024, and 2023 ended on September 26, 2025, September 27, 2024, and September 29, 2023, respectively. Fiscal 2025, 2024, and 2023 were each 52 weeks in length. For fiscal years in which there are 53 weeks, the fourth fiscal quarter includes 14 weeks, with the next occurrence taking place in fiscal 2028.\nSegments\nEffective for fiscal 2025, we reorganized our management and segments to align the organization around our current strategy. Prior period segment results have been recast to conform to the new segment structure. See additional information regarding our segments in Notes 1 and 20 to the Consolidated Financial Statements.\nWe now operate through two reportable segments: Transportation Solutions and Industrial Solutions. We believe our two segments served a combined market of approximately $200 billion as of fiscal year end 2025.\nOur net sales by segment as a percentage of our total net sales were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal\n​\n​\n​\n    \n2025\n    \n    \n2024\n    \n    \n2023\n    \n    \nTransportation Solutions\n \n 54\n%  \n​\n 60\n%  \n​\n 60\n%\n​\nIndustrial Solutions\n \n 46\n \n​\n 40\n \n​\n 40\n​\n​\nTotal\n \n 100\n%  \n​\n 100\n%  \n​\n 100\n%\n​\nBelow is a description of our reportable segments and the primary products, markets, and competitors of each segment.\n1\n\n\nTable of Contents\nTransportation Solutions\nThe Transportation Solutions segment is a leader in connectivity and sensor technologies. The primary products sold by the Transportation Solutions segment include terminals and connector systems and components, sensors, heat shrink tubing, relays, and application tooling. The Transportation Solutions segment’s products, which must withstand harsh conditions, are used in the following end markets:\n●\nAutomotive (75% of segment’s net sales)—\nWe are one of the leading providers of advanced automobile connectivity solutions. The automotive industry uses our products in automotive technologies for body and chassis systems, convenience applications, driver information, infotainment solutions, miniaturization solutions, motor and powertrain applications, and safety and security systems. Hybrid and electronic mobility solutions include in-vehicle technologies, battery technologies, and charging solutions.\n●\nCommercial transportation (15% of segment’s net sales)—\nWe deliver reliable connectivity products designed to withstand harsh environmental conditions for on- and off-highway vehicles and recreational transportation, including heavy trucks, construction, agriculture, buses, and other vehicles.\n●\nSensors (10% of segment’s net sales)—\nWe offer a portfolio of intelligent, efficient, and high-performing sensor solutions that are used by customers across multiple industries, including automotive, industrial equipment, commercial transportation, medical solutions, aerospace and defense, and consumer applications.\nThe Transportation Solutions segment’s major competitors include Yazaki, Aptiv, Sumitomo, Sensata, Honeywell, Molex, and Amphenol.\nIndustrial Solutions\nThe Industrial Solutions segment is a leading supplier of products that connect and distribute power, data, and signals. The primary products sold by the Industrial Solutions segment include terminals and connector systems and components, interventional medical components, heat shrink tubing, relays, wire and cable, and filters. The Industrial Solutions segment’s products are used in the following end markets:\n●\nDigital data networks (28% of segment’s net sales)—\nWe deliver products and solutions that are used in a variety of equipment architectures within the networking, data center, and wireless infrastructure industries. Additionally, we deliver a range of connectivity solutions for the Internet of Things, smartphones, tablet computers, virtual reality, and artificial intelligence/machine learning applications to help our customers meet their current challenges and future innovations.\n●\nAutomation and connected living (27% of segment’s net sales)—\nOur products are used in factory and warehouse automation and process control systems such as industrial controls, robotics, human machine interface, industrial communication, and power distribution. Our building automation and smart city infrastructure products are used to connect lighting and offer solutions in HVAC, elevators/escalators, and security. Our rail products are used in high-speed trains, metros, light rail vehicles, locomotives, and signaling switching equipment. Additionally, we provide both standard products and custom-designed solutions to meet the daily demands of home appliances, including washers, dryers, refrigerators, air conditioners, dishwashers, cooking appliances, water heaters, air purifiers, floor care devices, and microwaves.\n●\nAerospace, defense, and marine (19% of segment’s net sales)—\nWe design, develop, and manufacture a comprehensive portfolio of critical electronic components and systems for the harsh operating conditions of the commercial aerospace, defense, and marine industries. Our products and systems are designed and manufactured to operate effectively in harsh conditions ranging from the depths of the ocean to the far reaches of space.\n●\nEnergy (17% of segment’s net sales)—\nOur products are used by electric power utilities, OEMs, and engineering procurement construction companies serving the electrical power grid and renewables industries. They include a wide range of insulation, protection, and connection solutions for electrical power generation, transmission, distribution, and industrial markets.\n2\n\n\nTable of Contents\n●\nMedical (9% of segment’s net sales)—\nOur products are used in imaging, diagnostic, surgical, and minimally invasive interventional applications. We specialize in the design and manufacture of advanced surgical, imaging, and interventional device solutions. Key markets served include cardiovascular, peripheral vascular, structural heart, endoscopy, electrophysiology, and neurovascular therapies.\nThe Industrial Solutions segment competes primarily against Amphenol, Hubbell, Carlisle Companies, Integer Holdings, Molex, Omron, JST, and Korea Electric Terminal (KET).\nCustomers\nAs an industry leader, we have established close working relationships with many of our customers. These relationships allow us to better anticipate and respond to customer needs when designing new products and new technical solutions. By working with our customers in developing new products and technologies, we believe we can identify and act on trends and leverage knowledge about next-generation technology across our products.\nOur approach to our customers is driven by our dedication to further develop our product families and ensure that we are globally positioned to best provide our customers with sales and engineering support. We believe that as electronic component technologies continue to proliferate, our broad product portfolio and engineering capability give us a potential competitive advantage when addressing the needs of our global customers.\nWe manufacture and sell a broad portfolio of products to customers in various industries. Our customers include many of the leaders in their respective industries, and our relationships with them typically date back many years. We believe that our diversified customer base provides us an opportunity to leverage our skills and experience across markets and reduce our exposure to individual end markets, thereby reducing the variability of our financial performance. Additionally, we believe that the diversity of our customer base reduces the level of cyclicality in our results and distinguishes us from our competitors.\nNo single customer accounted for a significant amount of our net sales in fiscal 2025, 2024, or 2023.\nSales and Distribution\nWe maintain a strong local presence in each of the geographic regions in which we operate. Our net sales by geographic region\n(1) \nas a percentage of our total net sales were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal\n​\n​\n​\n    \n2025\n    \n    \n2024\n    \n    \n2023\n    \n    \nAsia–Pacific\n \n 38\n%  \n​\n 34\n%  \n​\n 32\n%\n​\nEurope/Middle East/Africa (“EMEA”)\n \n 33\n​\n​\n 37\n​\n​\n 39\n​\n​\nAmericas\n \n 29\n \n​\n 29\n \n​\n 29\n​\n​\nTotal\n \n 100\n%  \n​\n 100\n%  \n​\n 100\n%\n​\n(1)\nNet sales to external customers are attributed to individual countries based on the legal entity that records the sale.\nWe sell our products into approximately 130 countries primarily through direct selling efforts to manufacturers. In fiscal 2025, our direct sales represented approximately 75% of total net sales. We also sell our products indirectly via third-party distributors.\nWe maintain distribution centers around the world. Products are generally delivered to the distribution centers by our manufacturing facilities and then subsequently delivered to the customer. In some instances, however, products are delivered directly from our manufacturing facility to the customer. Our global coverage positions us near our customers’ locations and allows us to assist them in consolidating their supply base and lowering their production costs. We contract with a wide range of transport providers to deliver our products globally via road, rail, sea, and air. We believe our balanced sales distribution lowers our exposure to any particular geography and improves our financial profile.\n3\n\n\nTable of Contents\nSeasonality and Backlog\nTypically, we experience a slight seasonal pattern to our business. Overall, the third and fourth fiscal quarters are usually the strongest quarters of our fiscal year, whereas the first fiscal quarter is negatively affected by holidays and the second fiscal quarter may be affected by adverse winter weather conditions in some of our markets.\nCertain of our end markets experience some seasonality. Our sales in the automotive market are dependent upon global automotive production, and seasonal declines in European production may negatively impact net sales in the fourth fiscal quarter. Also, our sales in the energy market typically increase in the third and fourth fiscal quarters as customer activity increases.\nCustomer orders and demand may fluctuate as a result of economic and market conditions. Backlog by reportable segment was as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal Year End\n \n​\n    \n2025\n    \n2024\n    \n​\n \n(in millions)\n​\nTransportation Solutions\n​\n$\n 2,278\n​\n$\n 2,478\n​\nIndustrial Solutions\n​\n \n 3,910\n​\n \n 3,561\n​\nTotal\n​\n$\n 6,188\n​\n$\n 6,039\n​\nWe expect that the majority of our backlog at fiscal year end 2025 will be filled during fiscal 2026. Backlog is not necessarily indicative of future net sales as unfilled orders may be cancelled prior to shipment of goods.\nCompetition\nThe industries in which we operate are highly competitive, and we compete with thousands of companies that range from large multinational corporations to local manufacturers. Competition is generally based on breadth of product offering, product innovation, price, quality, delivery, and service. We have experienced, and expect to continue to experience, downward pressure on prices. However, as a result of increased costs and tariffs, certain of our businesses implemented price increases in recent years.\nRaw Materials\nWe use a wide variety of raw materials in the manufacture of our products. The principal raw materials that we use include plastic resins for molding; precious metals such as gold, silver, and palladium for plating; and other metals such as copper, aluminum, brass, and steel for manufacturing cable, contacts, and other parts that are used for cable and component bodies and inserts. Many of these raw materials are produced in a limited number of countries around the world or are only available from a limited number of suppliers. The prices of these materials are driven by global supply and demand. In recent years, raw material prices and availability have been affected by worldwide economic conditions, including supply chain disruptions, trade wars, and inflationary cost pressures.\nIntellectual Property\nPatents and other proprietary rights are important to our business. We also rely upon trade secrets, manufacturing know-how, continuing technological innovations, and licensing opportunities to maintain and improve our competitive position. We review third-party proprietary rights, including patents and patent applications, as available, in an effort to develop an effective intellectual property strategy, avoid infringement of third-party proprietary rights, identify licensing opportunities, and monitor the intellectual property claims of others.\nWe own a large portfolio of patents that relate principally to electrical, optical, and electronic products. We also own a portfolio of trademarks and are a licensee of various patents and trademarks. Patents for individual products extend for varying periods according to the date of patent filing or grant and the legal term of patents in the various countries where patent protection is obtained. Trademark rights may potentially extend for longer periods of time and are dependent upon national laws and use of the trademarks.\nWhile we consider our patents and trademarks to be valued assets, we do not believe that our competitive position or our operations are dependent upon or would be materially impacted by any single patent or group of related patents.\n4\n\n\nTable of Contents\nHuman Capital Management\nWe have employees located throughout the world. As of fiscal year end 2025, we employed approximately 93,000 people worldwide, including 13,000 contract employees. Approximately 34,000 were in the Asia–Pacific region, 34,000 were in the EMEA region, and 25,000 were in the Americas region. Of our total employees, approximately 55,000 were employed in manufacturing. Our strong employee base, along with their commitment to uncompromising values, provides the foundation of our success. \nWe are governed by our core values of integrity, accountability, inclusion, teamwork, and innovation. They guide our decisions and our actions, both individually and as an organization. Additionally, our employees are responsible for upholding our purpose—to create a safer, sustainable, productive, and connected future. We track and report internally on key talent metrics including workforce demographics, critical role pipeline data, global diversity data, and engagement and inclusion indices. As part of its charter, the management development and compensation committee of our board of directors oversees our policies and practices related to the management of human capital resources including talent management, culture, global diversity, and inclusion. \nInclusion\nWe are committed to leveraging the skills and perspectives of a wealth of backgrounds and experiences, and building a workforce and supplier network that represents our global markets and the customers we serve. We strive to maintain a work environment where all employees are engaged, feel their differences are valued and mutually-respected, and believe that all opinions count. Our people reflect our customers and markets. Our employees work in over 50 countries and represent approximately 150 nationalities, and our total employee population is over 40% women. \nOur employee resource groups (“ERGs”) are company-sponsored, employee-led groups that focus on shared identities or experiences of employees. These groups apply those perspectives to create value for our company as a whole. The ERGs provide a space where employees can foster connections and develop in a supportive environment. As of fiscal year end 2025, we had eight ERGs—African Heritage, ALIGN (lesbian, gay, bisexual, transgender, and queer employees (LGBTQ+) and their allies), Asian Heritage, Latin Heritage, TE Veterans, TE Young Professionals, THRIVE (employees with mental, emotional, and physical disabilities and their allies), and Women in Networking—with over 12,000 members worldwide. Our ERGs welcome any employee interested in supporting their mission and participation is optional. \nEmployee Engagement\nOur annual employee engagement survey explores how employees feel about their experience at our company and enables us to develop tailored actions to enhance the working environment. Focused on measuring engagement, inclusion, well-being, and leadership effectiveness, this fully digital, enterprise-wide survey is available to all employees in 22 languages. In fiscal 2025, we had a participation rate of 88% and year over year improvement in all four indices of engagement, inclusion, well-being, and leadership effectiveness. Our engagement and inclusion \nscores were once again favorable when compared to external global manufacturing benchmark\ns. \nTraining and Development\nWe provide employees with a range of development programs, opportunities, skills, and resources, empowering them to unleash their potential. Also, we emphasize employee development and training to support engagement and retention. Our LEARN@TE platform supplements our talent development strategies. It is an online portal that enables employees to access instructor-led classroom or virtual courses and self-directed web-based courses. Strategy, execution, and talent (“SET”) leadership expectations, which focus on how we drive strategy, effectively execute, and build talent, are expectations of all employees and are embedded in all of our leadership programs. We integrate these behavioral expectations into the way we assess and select talent, manage performance, and develop and reward our people. \nWe are committed to identifying and developing our next generation of leaders. We have a robust talent and succession planning process, and we offer programs to support the development of leaders at all levels and those in critical roles, general management, engineering, and operations. We are focused on recruiting top candidates, developing employees at all levels, and providing opportunities for career advancement. On an annual basis, we conduct an organization and leadership review process with our Chief Executive Officer and all segment, business unit, and function leaders focusing on our high-performing and high-potential talent, globally diverse talent, and the succession for our most critical roles. Also, our \n5\n\n\nTable of Contents\nboard of directors reviews and assesses management development plans for senior executives and the succession plans relating to those positions.\nWe believe our management team has the experience necessary to effectively execute our strategy and advance our product and technology leadership. Our Chief Executive Officer and segment leaders average over 25 years of industry experience. They are supported by an experienced and talented management team who is dedicated to maintaining and expanding our position as a global leader in the industry. For discussion of the risks relating to the attraction and retention of management and executive management employees, see “Part 1.",
    "item1a": "Item 1A. Risk Factors.”\nCybersecurity Program Governance\nOur cybersecurity program is governed by the \ninformation security committee (“ISC”)\n, composed of our leaders from information technology, enterprise risk, legal, compliance, strategy, human resources, finance, internal audit, and various business units. \nOn a quarterly basis, the CISO reports to the ISC on topics such as risk mitigation project status, audit results, security metrics, cyber incidents investigated and impact, if any, and significant changes that contribute toward protecting the enterprise from cybersecurity threats\n.\nOur CISO has over 20 years of experience in information security leadership roles and over 9 years as our CISO. He holds many industry certifications, including Certified Information Systems Security Professional (“CISSP”), and is an active member in professional organizations. Also, certain members of our board of directors have completed cybersecurity program trainings, or have relevant industry experience\n.\nCybersecurity incidents are evaluated by a cross-functional team based on defined criteria and regularly communicated to leadership pursuant to criteria set forth in our incident response plan and related processes. We have engaged cybersecurity and information technology third-party consultants to assist in cybersecurity incident response including forensics and technical analysis.\nThe \ncybersecurity committee \nof our board of directors has oversight \nresponsibility\n for cybersecurity risks. The CISO provides updates at least twice a year to the cybersecurity committee regarding matters related to information technology and cybersecurity risks including the state of our cybersecurity programs, emerging cybersecurity developments and threats, and our strategy to mitigate cybersecurity risk. Additionally, the \nfull board of directors receives updates \non cybersecurity risks twice a year as part of the enterprise risk management meetings\n.",
    "item1b": "ITEM 1B.  UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C.  CYBERSECURITY\nCybersecurity Risk Management and Strategy\nOur cybersecurity risk management strategy and processes are designed to identify, assess, and manage risks to the confidentiality, integrity, and availability of our information technology environment, systems, and information. The cybersecurity risk management process is managed centrally and is led by our Chief Information Security Officer (“CISO”) who reports to our Chief Information Officer. Our cybersecurity program takes a risk-based approach and is \nintegrated\n with our global enterprise risk management program. Our cybersecurity risk strategy is aligned with cyber/information security frameworks and industry standards, including the National Institute of Standards and Technology Cybersecurity Framework.\nOur cybersecurity program includes the following risk management practices:\n●\na formal cybersecurity risk assessment is performed annually in collaboration with our enterprise risk management function, resulting in updates to plans and actions that are incorporated into improvement projects;\n●\nour cybersecurity program maturity is benchmarked annually against global industry standards and norms. The result serves as a guide to identifying evolving risks, prioritizing improvements, and enhancing the program;\n●\ncybersecurity threats are evaluated throughout the year by our around-the-clock security operations center, utilizing a variety of third-party subscription and threat intelligence data sources, and data collected via internal monitoring and scanning processes;\n●\nannual security awareness trainings are required to be completed by employees, and monthly phishing campaigns and additional function-specific cybersecurity trainings are also conducted;\n●\nsecurity and risk metrics are reviewed monthly and reported to leadership regularly;\n●\nexternal penetration tests are conducted annually by independent \nthird parties\n and appropriate actions are taken to strengthen controls;\n21\n\n\nTable of Contents\n●\na cybersecurity incident response plan and governance charter are maintained by the cybersecurity incident response team. The cybersecurity incident response plan and supporting playbooks are utilized during table-top exercises and trainings. Participants may include information technology, business, corporate function, and external resources depending on the table-top scenario; and\n●\nthird-party supplier security reviews\n are conducted based on risk. Reviews may include the assessment of security architecture, connections between our systems and the third party, data security controls, and user access controls.\nTo date, we do not believe that any risks from cybersecurity threats, nor any previous cybersecurity incidents, have materially affected our business strategy, results of operations, or financial condition\n. However, the sophistication of cybersecurity threats continues to increase, and the preventative actions we have taken and continue to take to reduce the risk of cybersecurity incidents and protect our systems and information may not successfully protect against future cybersecurity incidents, which could materially affect our business strategy, results of operations, or financial condition. For additional information on certain risks associated with cybersecurity, refer to the risk factors related to cybersecurity and information technology systems in “Part I,"
  }
}