{
  "ticker": "TER",
  "cik": "0000097210",
  "company_name": "TERADYNE, INC",
  "filing_date": "2025-02-20",
  "accession": "0000950170-25-023784",
  "primary_doc": "ter-20241231.htm",
  "item_sections": {
    "item1": "Item 1: \nB\nusiness\n \n\n\nTeradyne, Inc. (“Teradyne”) was founded in 1960 and is a leading global supplier of automated test equipment and robotics solutions.\n \n\n\nWe design, develop, manufacture and sell automated test systems and robotics products. Our automated test systems are used to test semiconductors, wireless products, data storage and complex electronics systems in many industries including consumer electronics, wireless, automotive, industrial, computing, communications, and aerospace and defense industries. Our robotics products include collaborative robotic arms and autonomous mobile robots (“AMRs”) used by global manufacturing, logistics and industrial customers to improve quality, increase manufacturing and material handling efficiency and decrease manufacturing and logistics costs. Our automated test equipment and robotics products and services include:\n \n\n\n•\nsemiconductor test (“Semiconductor Test”) systems; \n\n\n•\nrobotics (“Robotics”) products; and \n\n\n•\ndefense/aerospace (“Defense/Aerospace”) test instrumentation and systems, circuit-board test and inspection (“Production Board Test”) systems, and wireless test systems (referred collectively as \"All Other\"). \n\n\nThe market for our test products is concentrated with a limited number of significant customers accounting for a substantial portion of the purchases of test equipment. A few customers drive significant demand for our products both through direct sales and sales to the customer’s supply partners. We expect that sales of our test products will continue to be concentrated with a limited number of significant customers for the foreseeable future.\n \n\n\nIn 2024, we saw strength in our Semiconductor Test business, with memory and compute offerings growing considerably compared to 2023. We expect mobile, automotive, and industrial will grow in 2025 and that recent advancements in AI inference may help mid-term recovery in these markets. Beyond AI compute, we are investing in other areas of the semiconductor test market that offer the opportunity for accelerating long-term growth, including power semi-conductors and the shift towards vertically integrated products (\"VIPs\"). We have seen the benefits start to materialize in 2024 and expect them to continue through the mid-term.\n \n\n\n2024 was a very weak industrial automation market resulting in a year-over-year decline in Robotics revenues while outperforming our peer group. In 2024, we built key OEM, systems integrators and large account strategic partnerships which will strengthen our go to market for years to come. Introduction of new products, including the MiR 1200 Pallet Jack, will further expand our available markets to support our growth\n.\n\n\nOn May 27, 2024, we paid 483.1 million Euros, equivalent to $524.1 million, to purchase a combination of previously issued and outstanding shares and shares newly issued by Technoprobe, S.p.A. (\"Technoprobe\"). The shares purchased represent 10% of the issued and outstanding shares of Technoprobe. We also received a board seat as part of the purchase. Additionally, as part of the transaction, we completed the sale of the Device Interface Solutions (\"DIS\") business, a component of our Semiconductor Test segment, to Technoprobe for $85.0 million in cash, net of cash and cash equivalents sold, and a customary working capital adjustment. The sale resulted in a pre-tax gain of $57.1 million recorded as 'Gain on sale of business' in the consolidated statement of operations.\n\n\nOur financial statements are denominated in U.S. dollars. While revenues in our test businesses are predominantly in U.S. dollars, the majority of our Robotics revenue is denominated in foreign currencies. Strengthening of the U.S. dollar would negatively affect Robotics revenue growth in 2025.\n \n\n\nOur corporate strategy for our test businesses is to profitably grow market share while in Robotics, we plan to profitably grow revenue through the introduction of differentiated products targeting expanding markets. Our capital allocation plan will continue to be balanced between investing in organic and inorganic growth and returning cash to shareholders through share repurchases and dividends.\n \n\n\nInvestor Information\n \n\n\nWe are a Massachusetts corporation incorporated on September 23, 1960. We are subject to the informational requirements of the Securities Exchange Act of 1934 (“Exchange Act”). We file periodic reports, proxy statements and other information with the SEC. The SEC maintains an internet site (http://www.sec.gov) that contains reports, proxy and information statements and other information regarding issuers that file documents electronically.\n \n\n\n2\n\n\n\n\nTable of Contents\n\n\n \n\n\nYou can access financial and other information, including the charters of our Audit Committee, Compensation Committee and Nominating and Corporate Governance Committee, our Corporate Governance Guidelines and Code of Conduct, by clicking the Investors link on our web site at www.teradyne.com. We make available, free of charge, copies of our filings with the SEC, including our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act through our web site as soon as reasonably practicable after filing such material electronically or otherwise furnishing it to the SEC.\n \n\n\nProducts\n \n\n\nSemiconductor Test\n \n\n\nWe design, manufacture, sell and support Semiconductor Test products and services and hard disk drives on a worldwide basis. The test systems we provide are used for wafer level, device package testing, and system level testing of semiconductor devices. These devices are used in automotive, industrial, communications, consumer, smartphones, cloud, computer and electronic game applications, among others. Semiconductor devices span a broad range of functionality, from very simple low-cost devices such as appliance microcontrollers, operational amplifiers or voltage regulators to complex digital signal processors, Artificial Intelligence/Machine Learning (“AI/ML”) training, high performance computing and microprocessors as well as memory devices. Semiconductor Test products and services are sold to integrated device manufacturers (“IDMs”) that integrate the fabrication of silicon wafers into their business, “Fabless” companies that outsource the manufacturing of silicon wafers, “Foundries” that cater to the processing and manufacturing of silicon wafers, and semiconductor assembly and test providers (“OSATs”) that provide test and assembly services for the final packaged devices to both Fabless companies and IDMs. Fabless companies perform the design of integrated circuits and use Foundries for wafer manufacturing and OSATs for test and assembly. Our customers obtain the overall benefit of comprehensively testing devices and reducing the total costs associated with testing by using our Semiconductor Test systems to:\n \n\n\n•\nimprove and control product quality; \n\n\n•\nmeasure and improve product performance; \n\n\n•\nreduce time to market; and \n\n\n•\nincrease production yields. \n\n\nOur FLEX Test Platform architecture advances our core technologies to produce test equipment that is designed for high efficiency multi-site testing. Multi-site testing involves the simultaneous testing of many devices in parallel. Leading semiconductor manufacturers are using multi-site testing to significantly improve their “Cost of Test” economics. The FLEX Test Platform architecture addresses customer requirements through the following key capabilities:\n \n\n\n•\nA high efficiency multi-site architecture that reduces tester overhead such as instrument setup, synchronization and data movement, and signal processing; \n\n\n•\nThe IG-XL™ software operating system which provides fast program development, including instant conversion from single to multi-site test; and \n\n\n•\nBroad technology coverage by instruments designed to cover the range of test parameters, coupled with a universal slot test head design that allows easy test system reconfiguration to address changing test needs. \n\n\nFLEX Test Platform purchases are made by IDMs, OSATs, Foundries and Fabless customers. The FLEX Test Platform has become a widely used test solution at OSATs by providing versatile testers that can handle the widest range of devices, allowing OSATs to leverage their capital investments. The broad consumer, automotive and broadband markets have historically driven most of the device volume growth in the semiconductor industry. These markets include mobile phones and tablets, PCs, servers, networking and automotive electronics. These end use markets continue to be drivers for the FLEX Test Platform family of products because they require a wide range of technologies and instrument coverage. In 2019, we introduced our next generation UltraFLEX\nPlus \ntester, the newest member of the UltraFLEX family, which uses the new PACE\nTM \narchitecture to deliver superior economics and fast time to market for complex digital devices.\n \n\n\nOur J750™ test system shares the IG-XL software environment with the family of FLEX Test Platform systems. The J750 is designed to handle high volume semiconductor devices, such as microcontrollers, that are central to the functionality of almost every consumer electronics product, from small appliances to automobiles. J750 test systems combine compact packaging, high throughput and ease of production test. We extended the J750 platform technology to create the IP750 Image Sensor™ test system. The IP750 is focused on testing image sensor devices used in smartphones, automobiles and other imaging products. We have continued to invest in\n \n\n\n3\n\n\n\n\nTable of Contents\n\n\n \n\n\nthe J750 platform with new instrument releases that bring new capabilities to existing market segments and expand the J750 platform to new devices that include high end microcontrollers and the latest generation of image sensors.\n \n\n\nOur Magnum platform addresses the requirements of mass production test of memory devices for flash and DRAM memory. Flash and DRAM memory are widely used core building blocks in modern electronic products finding wide application in consumer, industrial, and computing equipment. Our Magnum 7 solution is designed for parallel memory test in the flash, DRAM and multi-chip package markets while our Magnum platform called Magnum EPIC giving us full product coverage of the memory test market.\n \n\n\nOur ETS platform is used by semiconductor manufacturers and assembly and test subcontractors, primarily in the analog/mixed signal markets that cover cost sensitive applications. Our proprietary SmartPin\n™\n technology enables high efficiency multi-site testing on an individual test system permitting greater test throughput. Semiconductors tested by ETS platform systems are incorporated into a wide range of products in historically high-growth markets including mobile devices, automotive electronics, computer peripherals, and notebook and desktop computers. The Eagle platform includes the ETS-88 which is a high performance multi-site production test system designed to test a wide variety of high volume power and precision devices including Silicon Carbide (\"SiC\") and Gallium Nitride (\"GaN\") power devices used in vehicle electrification. The ETS-800, a high performance multi-site production test system, is used to test high complexity power devices in automotive, industrial and consumer applications.\n \n\n\nThe Integrated System Test group is comprised of our system level test (\"SLT\") testers and our hard disk drive (\"HDD\") testers. Our SLT testers for the semiconductor production market are used to test devices following wafer and package test. SLT testers address customer requirements related to factory density, throughput and thermal performance. HDD products address the high throughput and automated manufacturing test requirements of hard disk drive and semiconductor manufacturers. Our HDD products address the client and enterprise storage markets. The client market is driven by the needs of desktop, laptop, and external HDD storage products. The enterprise market is driven by the needs of data centers and cloud storage.\n \n\n\nRobotics\n \n\n\nOur Robotics segment is comprised of two business units: Universal Robots and Mobile Industrial Robots.\n \n\n\nUniversal Robots\n \n\n\nUniversal Robots is a leading provider of collaborative robots (\"cobots\") used across various industries, including automotive, food & beverage, metal & machining, electronics, pharmaceutical, and in education. Founded in 2005 and headquartered in Odense, Denmark, Universal Robots aims to create a world where people work with robots, not like robots. Its mission is simple: “\nAutomation for anyone. Anywhere.”\n\n\nSince introducing the world's first commercially viable cobot in 2008, Universal Robots has sold over 75,000 cobots worldwide and has developed a product portfolio reflecting a range of reaches and payloads, including the UR3e, UR5e, UR10e, UR16e, UR20 and UR30 robots. All models are robust, built to withstand a wide range of industrial environments, and can be easily integrated into existing production setups, providing a number of game-changing benefits:\n\n\n•\nStraightforward programming \n– UR's intuitive software, PolyScope, enables users to program a cobot easily and have an application up and running within a few hours.\n\n\n•\nHigh return on investment\n – cobots require a lower initial investment than traditional robotics and have an average payback time of 12-18 months.\n\n\n•\nVersatile deployment\n – cobots' high degree of flexibility allows customers to change the task and pace of the cobot according to production demands.\n\n\n•\nCollaborative-capable safety functions\n – following a risk assessment, most cobots can seamlessly operate alongside employees, assisting with dull, dirty, and dangerous tasks.\n\n\n•\nCutting-edge precision engineering\n – UR's global team of talented engineers creatively tackles customer challenges, ensuring our cobots are rigorously tested and built for demanding industrial tasks.\n\n\nAn extensive ecosystem has grown around the company's cobot, technology creating innovation and choice for customers and a wide range of components, kits and solutions to suit every application. UR also provides an all-encompassing customer experience including UR Academy - an award-winning training program, available both online and in person in more than 120 training centers worldwide, and three tiers of service offerings carefully designed to accelerate customer success.\n \n\n\n4\n\n\n\n\nTable of Contents\n\n\n \n\n\nUniversal Robots has recently established global Centers of Excellence for Welding, Palletizing, and Machine Tending applications. These centers, led by subject matter experts, serve as knowledge hubs, offering expert recommendations and guidance on the latest trends in the field to UR partners and key customers worldwide.\n\n\nMobile Industrial Robots\n \n\n\nMiR is a leading provider of autonomous mobile robots (\"AMRs\") for the manufacturing and logistics segments. MiR AMRs enhance productivity, offering a high return on investment by streamlining workforce efficiency, reducing lead times, and improving workplace safety. These AMRs operate autonomously, eliminating the need for traditional guidance infrastructure. MiR currently offers three deckload AMR models, each supporting a different payload capacity—MiR250, MiR600, and MiR1350—as well as a pallet jack AMR—MiR1200 Pallet Jack—all managed by our unified fleet management software, MiR Fleet.\n\n\nAll models can be easily integrated into existing production environments. MiR’s products are differentiated by their:\n\n\n•\nEase of Use and Speed of Deployment:\n Our robots are designed for quick deployment and flexibility, allowing customers to adapt tasks based on changing demands.\n\n\n•\nSafe Operations:\n Equipped with 360 safety coverage, our robots navigate around static and dynamic obstacles, ensuring safety in busy environments.\n\n\n•\nReliable Autonomous Navigation:\n MiR robots demonstrate consistent, reliable navigation across large manufacturing and warehouse areas.\n\n\n•\nShort Payback Period:\n With an average payback period of 12–24 months, MiR's products provide a swift return on investment.\n\n\nSystem Test\n \n\n\nOur System Test operating segment is comprised of two business units: Defense/Aerospace and Production Board Test.\n \n\n\nDefense/Aerospace\n \n\n\nWe are a leading provider of high performance test systems, subsystems, instruments and service for the defense and aerospace markets. Our test products are used to ensure the readiness of military and commercial aerospace electronics systems. New programs, such as tactical aircraft and missile systems, as well as upgrade programs, continue to fuel the demand for high performance test systems in this market. Our test products are well-suited to the demands of defense/aerospace electronics manufacturers and repair depots worldwide. Our leadership in this market is underscored by our success with major Department of Defense programs across all U.S. military service branches and many allied defense services worldwide.\n \n\n\nProduction Board Test\n \n\n\nOur test systems are used by electronics manufacturers and OEMs worldwide to perform In-Circuit-Test (“ICT”) and device programming of printed circuit board assemblies. Fast, accurate and cost-effective test capabilities are hallmark features of our Test Station product families. We offer the Test Station in off-line and automated in-line configurations. The automated in-line configurations address the growing requirements for automating production lines for high volume applications, such as automotive electronics, computing, and communications.\n \n\n\nWireless Test\n \n\n\nOur Wireless Test operating segment is a business unit run under the LitePoint brand name providing wireless test solutions for silicon validation, wireless module manufacturing, and wireless end device manufacturing. LitePoint wireless test systems span design verification to high volume manufacturing and are deployed across the entire production chain from wireless chipset suppliers to consumer brands.\n \n\n\nSales and Distribution\n \n\n\nIn each of the years, 2024, 2023 and 2022, our five largest direct customers in aggregate accounted for 36%, 32% and 26% of our consolidated revenues, respectively.\n \n\n\n5\n\n\n\n\nTable of Contents\n\n\n \n\n\nOSAT customers often purchase our test systems based upon recommendations from OEMs, IDMs and Fabless companies. In all cases when an OSAT customer purchases a test system from us, we consider the OSAT as the customer since credit risk, title and risk of loss, among other things, are between Teradyne and the OSAT. In 2024, we estimate consolidated revenues driven by Samsung, a customer of our Semiconductor Test and Wireless Test segments, combining direct and indirect sales, accounted for appropriately 12.5% of our consolidated revenues. In 2023, revenues driven by Texas Instruments Inc., a customer of our Semiconductor Test segment, accounted for 10% of our consolidated revenues. In 2022, we estimate consolidated revenues driven by Qualcomm, a customer of our Semiconductor Test, System Test, and Wireless Test operating segments, combining direct and indirect sales, accounted for approximately 11% of our consolidated revenues. The loss of, or significant decrease in demand from key OEM customers or any of our five largest direct customers, could have a material adverse effect on our business, results of operations and financial condition.\n \n\n\nWe have sales and service offices located throughout North America, Central America, Asia and Europe. We sell in these areas predominantly through a direct sales force, except for Robotics products, which are sold principally through distributors and OEMs. Our manufacturing activities for our test businesses are primarily conducted through subcontractors and outsourced contract manufacturers with significant operations in Malaysia. The manufacturing activities for our Robotics businesses are done primarily in our production facilities in Denmark and the U.S.\n \n\n\nSales to customers outside the United States were 87%, 84%, and 85%, respectively, of our consolidated revenues in 2024, 2023 and 2022. Sales are attributed to geographic areas based on the location of the customer site.\n \n\n\nSee also “",
    "item1a": "Item 1A: \nR\nisk Factors\n \n\n\nThe risks described below are not the only risks that we face. Additional risks and uncertainties not currently known to us or that we currently deem to be immaterial also may materially adversely affect our business, financial condition and/or operating results.\n \n\n\nRisks Associated with Teradyne’s Markets\n \n\n\nOur business is impacted by global and industry-specific economic cycles, which are difficult to predict, and actions we have taken or may take to offset these cycles may not be sufficient.\n \n\n\nCapital equipment providers in the electronics, semiconductor industries and robotics, such as Teradyne, have, in the past, been negatively impacted by both sudden slowdowns in the global economies and recurring cyclicality within those industries. These cycles have resulted in periods of over-supply; a trend we believe will continue to occur. Our business and results of operations depend, in significant part, upon capital expenditures of manufacturers of semiconductors, electronics, and other industrial products, which in turn depend upon the current and anticipated market demand for those products. Disruption or deterioration in economic conditions may reduce customer purchases of our products, thereby reducing our revenues and earnings. In addition, such adverse changes in economic conditions, and resulting slowdowns in the market for our products, may, among other things, result in increased price competition for our products, increased risk of excess and obsolete inventories, increased risk in the collectability of our accounts receivable from our customers, potential reserves for credit losses and write-offs of accounts receivable, increased risk of restructuring charges, and higher operating costs as a percentage of revenues, which, in each case and together, adversely affect our operating results. We are unable to predict the likely duration, frequency and severity of disruptions in financial markets, credit availability, and adverse economic conditions throughout the world, and we cannot ensure that the level of revenues or new orders for a fiscal quarter will be sustained in subsequent quarters. We have taken actions to address the effects of general economic variability and recurring\n \n\n\n9\n\n\n\n\nTable of Contents\n\n\n \n\n\nindustry cyclicality, including implementing cost control and reduction measures. We cannot predict whether these measures will be sufficient to offset global or market-specific disruptions that might affect our businesses and we may need to take additional or different measures in the future.\n \n\n\nWe are subject to intense competition.\n \n\n\nWe face significant competition throughout the world in each of our reportable segments. Some of our competitors have substantial financial and other resources to pursue engineering, manufacturing, marketing and distribution of their products. In addition, we are subject to trade regulations imposed by the United States government, which may not impact some of our competitors. We also face competition from emerging Asian companies and internal development at several of our customers. Some of our competitors have introduced or announced new products with certain performance characteristics that may be considered equal or superior to those we currently offer. We expect our competitors to continue to improve the performance of their current products and to introduce new products or new technologies that provide improved cost of ownership and performance characteristics. New product introductions by competitors could cause a decline in revenues or loss of market acceptance of our products.\n \n\n\nThe market for our products is concentrated, and our business depends, in part, on obtaining orders from a few significant customers.\n\n\nThe market for our products is concentrated with a limited number of significant customers accounting for a substantial portion of the purchases of test equipment. In each of the years, 2024, 2023 and 2022, our five largest direct customers in aggregate accounted for 36%, 32% and 26% of consolidated revenues, respectively.\n \n\n\nWe estimate consolidated revenues driven by Samsung, a customer of our Semiconductor Test and Wireless Test Segments, combining direct sales to that customer with sales to the customer’s OSATs, accounted for 12.5% of our consolidated revenues in 2024.\n \n\n\nCustomer consolidation could affect our operating results.\n\n\nThere has been a trend toward customer consolidation in the semiconductor industry through business combinations, including mergers, asset acquisitions and strategic partnerships. If this trend continues, it could make us more dependent on fewer customers who may be able to exert increased pressure on our prices and other contract terms and could increase the portion of our total sales concentration for any single customer. Customer consolidation activity could also reduce the demand for our products and services if such customers streamline research and development or operations, reduce purchases or delay purchasing decisions. These outcomes could negatively impact our operating results and financial condition.\n\n\nIf we fail to develop new technologies to adapt to our customers’ needs or if our customers fail to accept our new products, our revenues will be adversely affected.\n \n\n\nWe believe that our technological position depends primarily on the technical competence and creative ability of our engineers. In a rapidly evolving market, such as ours, the development or acquisition of new technologies, commercialization of those technologies into products and market acceptance and customer demand for those products are critical to our success. Successful product development or acquisition, introduction and acceptance depend upon a number of factors, including:\n \n\n\n•\nnew product selection;\n\n\n•\nability to meet customer requirements including with respect to safety and cyber security; \n\n\n•\ndevelopment of competitive products by competitors;\n\n\n•\ntimely and efficient completion of product design;\n\n\n•\ntimely and efficient implementation of manufacturing and manufacturing processes;\n\n\n•\ntimely remediation of product performance issues, if any, identified during testing;\n\n\n•\nassembly processes and product performance at customer locations;\n\n\n•\ndifferentiation of our products from our competitors' products;\n\n\n•\nmanagement of customer expectations concerning product capabilities and product life cycles;\n\n\n•\ntransition of customers to new product platforms;\n\n\n10\n\n\n\n\nTable of Contents\n\n\n \n\n\n•\ncompliance with product safety regulations;\n\n\n•\nability to protect products from cyber attacks when used by our customers;\n\n\n•\nability to attract and retain technical talent; and\n\n\n•\ninnovation that does not infringe on the intellectual property rights of third parties.\n\n\nRisks Associated with Operating a Global Business\n \n\n\nWe are subject to risks of operating internationally.\n \n\n\nA significant portion of our consolidated revenues is derived from customers outside the United States. Our international sales and operations are subject to significant risks and difficulties, including:\n \n\n\n•\nunexpected changes in legal and regulatory requirements affecting international markets;\n\n\n•\ncost increases due to inflation;\n\n\n•\nchanges in tariffs and exchange rates;\n\n\n•\nsocial, political and economic instability, acts of terrorism and international conflicts;\n\n\n•\ndisruption caused by health pandemics;\n\n\n•\ndifficulties in protecting intellectual property;\n\n\n•\ndifficulties in accounts receivable collection;\n\n\n•\ncultural differences in the conduct of business;\n\n\n•\ndifficulties in staffing and managing international operations;\n\n\n•\ncompliance with anti-corruption laws;\n\n\n•\ncompliance with data privacy regulations;\n\n\n•\ncompliance with customs and trade regulations; and\n\n\n•\ncompliance with international tax laws and regulations.\n\n\nIn addition, an increasing portion of our products and the products we purchase from our suppliers are sourced or manufactured in foreign locations, including Malaysia and Denmark, and a large portion of the devices our products test are fabricated and tested by foundries and subcontractors in Taiwan, China, Korea and other parts of Asia. As a result, we are subject to a number of economic and other risks, particularly during times of political, health or financial instability in these regions. Disruption of manufacturing or supply sources in these international locations could materially adversely impact our ability to fill customer orders and potentially result in lost business.\n \n\n\nWe are subject to risks associated with doing business in China.\n\n\nIn addition to the risks associated with the tariffs and trade regulations detailed below, we are subject to the following risks associated with doing business in China:\n\n\n•\nadverse changes in Chinese political, economic or social conditions or Chinese laws, regulations or policies, including the imposition of unexpected or confiscatory taxation, restrictions on currency conversion, imports and sources of supply, devaluations of currency, the nationalization or other expropriation of private enterprises, or the reversal of economic reform policies that encourage private economic activity, foreign investments and greater economic decentralization;\n\n\n•\ndiffering economic practices compared to most developed countries, including with respect to the amount of government involvement, control of foreign exchange and allocation of resources;\n\n\n•\nuncertainties presented by the Chinese legal system, which is not fully integrated and continues to rapidly evolve, impeding our ability to interpret certain Chinese laws and regulations, predict and evaluate the outcome of administrative and court proceedings and the level of legal protection to enforce contracts we have entered into in China; and Chinese controls on the convertibility of Renminbi into foreign currencies and, in certain cases, the remittance of currency out of China, restricting our ability to remit sufficient foreign currency to pay dividends or make other payments to us, or otherwise satisfy foreign currency-denominated obligations.\n\n\n11\n\n\n\n\nTable of Contents\n\n\n \n\n\nThe foregoing risks and the ongoing geopolitical tensions and economic uncertainty between the United States and China and the unknown impact of current and future Chinese rules and regulations, may cause increased costs, as well as restrictions on our ability to sell, or a decreased demand from customers to purchase, our products, which could harm our business, financial condition and operating results.\n\n\nThe Israel-Hamas conflict may have a material impact on our Business\n\n\nThe Israel-Hamas conflict could have a negative impact on our future revenue and supply chain, either of which could adversely affect our business and financial results. Our customers in Israel may experience delays in product releases due to impacts to their labor force and impacts on their suppliers because of the conflict, which could materially impact demand for our products. Similarly, our suppliers in Israel may experience delays in providing us with parts due to the conflict. In addition, the global economic uncertainty following the start of the conflict could impact demand for our products.\n\n\nRisks Related to Teradyne’s Finances\n \n\n\nWe may not fully realize the benefits of our acquisitions or strategic alliances.\n \n\n\nIn June 2015, we acquired Universal Robots, in 2018, we acquired Energid and MiR and, in 2019, we acquired Lemsys and AutoGuide. In May 2024, we closed on our strategic partnership agreement with Technoprobe which included Teradyne acquiring 10% of the equity in Technoprobe. We may not be able to realize the benefits of acquiring or successfully growing these businesses. We may continue to acquire additional businesses, form strategic alliances, or create joint ventures with third parties that we believe will complement or augment our existing businesses. We may not be able to realize the expected synergies and cost savings from the integration with our existing operations of other businesses or technologies that we may acquire. In addition, the integration process for our acquisitions may be complex, costly and time consuming and include unanticipated issues, expenses, and liabilities. We may have difficulty in developing, manufacturing, and marketing the products of a newly acquired company in a manner that enhances the performance of our combined businesses or product lines and allows us to realize value from expected synergies. Following an acquisition, we may not achieve the revenue or net income levels that justify the acquisition. Acquisitions may also result in one-time charges (such as acquisition-related expenses, write-offs or restructuring charges) or in the future, impairment of goodwill or acquired intangible assets, or adjustments to contingent consideration liabilities that adversely affect our operating results. Additionally, we may fund acquisitions of new businesses, strategic alliances, or joint ventures by utilizing our cash, incurring debt, issuing shares of our common stock, or by other means. Additionally, we may face restrictions pursuant to the terms of an acquisition or strategic alliance agreement.\n \n\n\nWe may incur higher tax rates than we expect and may have exposure to additional international tax liabilities and costs.\n \n\n\nWe are subject to paying income taxes in the United States and other countries where we operate. Our effective tax rate is dependent on where our earnings are generated and the tax regulations and the interpretation and judgment of administrative tax or revenue authorities in the United States and other countries. We have pursued a global tax strategy that could be adversely affected by the mix of earnings and tax rates in the countries where we operate, changes to tax laws (including but not limited to Pillar Two), tax regulations or an adverse tax ruling by administrative authorities. We are also subject to tax audits in the countries where we operate. Any material change in our tax liability resulting from changes in tax laws, tax regulations, administrative rulings or audits from an administrative tax or revenue authority could negatively affect our financial results.\n \n\n\nAs a multinational corporation, we are subject to income taxes as well as non-income-based taxes, in both the United States and various foreign jurisdictions. In certain foreign jurisdictions, we qualify for tax incentives and tax holidays based on our ability to meet, on a continuing basis, various tests relating to our employment levels, research and development expenditures and other qualification requirements in a particular foreign jurisdiction. While we intend to operate in such a manner to maintain and maximize our tax incentives and tax holidays, no assurance can be given that we have so qualified or that we will qualify for any particular year or jurisdiction. If we fail to qualify or fail to remain qualified for certain foreign tax incentives and tax holidays, we may be subject to further taxation or an increase in our effective tax rate which would adversely impact our financial results. In November 2020, we entered into an agreement with the Singapore Economic Development Board which extended our Singapore tax holiday under substantially similar terms to the agreement which expired on December 31, 2020. The new tax holiday is scheduled to expire on December 31, 2025.\n \n\n\nThe tax savings attributable to the Singapore tax holiday for the years ended December 31, 2024, 2023 and 2022 were $17.1 million or $0.10 per diluted share, $1.4 million or $0.01 per diluted share, and $16.0 million or $0.09 per diluted share, respectively. These tax savings may not be achievable in subsequent years due to changes in Singapore’s tax laws, issuance of new global minimum tax laws, or the expiration of the tax holiday.\n \n\n\n12\n\n\n\n\nTable of Contents\n\n\n \n\n\nIn addition, we may incur additional costs, including headcount expenses, in order to maintain or obtain a foreign tax incentive or tax holiday in a particular foreign jurisdiction.\n \n\n\nWe have significant guarantees, indemnification, and customer confidentiality obligations.\n \n\n\nFrom time to time, we make guarantees to customers regarding the delivery, price and performance of our products and guarantee certain indebtedness, performance obligations or lease commitments of our subsidiary and affiliate companies. We also have agreed to provide indemnification to our officers, directors, employees and agents, to the extent permitted by law, arising from certain events or occurrences, while the officer, director, employee or agent, is or was serving at our request in such capacity. Additionally, we have confidentiality obligations to certain customers and if breached would require the payment of significant penalties. If we become liable under any of these obligations, it could materially and adversely affect our business, financial condition or operating results. For additional information see Note N: “Commitments and Contingencies-Guarantees and Indemnification Obligations” in Notes to Consolidated Financial Statements.\n\n\nWe may discontinue or reduce our quarterly cash dividend or share repurchase program.\n \n\n\nIn January 2014, our Board of Directors initiated a quarterly cash dividend. Since 2014, the Board of Directors has increased our quarterly cash dividend from $0.06 per share to $0.12 per share. Holders of our common stock are only entitled to receive dividends when and if they are declared by our Board of Directors.\n \n\n\nIn January 2021, our Board of Directors approved a $2.0 billion share repurchase program. In 2022 and 2021, we repurchased $752.1 million, and $600.0 million, respectively of common stock. In January 2023, our Board of Directors cancelled the 2021 repurchase program and approved a new $2.0 billion share repurchase program. In 2024, we repurchased $199.4 million of common stock and, in 2023, we repurchased $400.5 million of common stock. We intend to repurchase up to $400 million in 2025. Under the share repurchase program, we may repurchase outstanding shares of our common stock from time to time in the open market and through privately negotiated transactions. Unless terminated earlier by resolution of our Board of Directors, the repurchase program will expire when we have repurchased all shares authorized for repurchase under the share repurchase program.\n\n\nFuture cash dividends and share repurchases are subject to the discretion of our Board of Directors and will depend, among other things, upon our earnings, capital requirements and financial condition. While we have declared a quarterly cash dividend on our common stock and authorized a share repurchase program, we are not required to do either and may reduce or eliminate our cash dividend or share repurchase program in the future. The reduction or elimination of our cash dividend or our share repurchase program could adversely affect the market price of our common stock.\n\n\nWe have incurred indebtedness and may incur additional indebtedness.\n \n\n\nOn May 1, 2020, we entered into a three-year, senior secured revolving credit facility of up to $400.0 million. On December 10, 2021, the credit agreement was amended to extend the maturity date of the credit facility to December 10, 2026. On October 5, 2022, the credit agreement was amended to increase the amount of the credit facility to $750.0 million from $400.0 million. The amended credit agreement provides that, subject to customary conditions, we may seek to obtain from existing or new lenders the available incremental amount under the credit facility, not to exceed the greater of $200.0 million or 15% of consolidated EBIDTA. We could borrow funds under this credit facility at any time for general corporate purposes and working capital. On May 16, 2024, we borrowed $185.0 million under this credit facility, primarily to fund our acquisition of the 10% equity interest in Technoprobe discussed above. By December 31, 2024, we had fully repaid all amounts borrowed under the credit facility. As of February 20, 2025, there are no outstanding borrowings under the credit facility.\n\n\nOur outstanding and any additional indebtedness, among other things, could:\n \n\n\n•\nmake it difficult to make payments on this indebtedness and our other obligations;\n\n\n•\nmake it difficult to obtain any necessary future financing for working capital, capital expenditures, debt service requirements or other purposes;\n\n\n•\nrequire the dedication of a substantial portion of any cash flows from operations to service for indebtedness, thereby reducing the amount of cash flows available for other purposes, including capital expenditures, and\n\n\n•\nlimit our flexibility in planning for or reacting to changes in our business and the industries in which we complete.\n\n\nRestrictive covenants in the agreement governing our senior secured revolving credit facility may restrict our ability to pursue business strategies.\n \n\n\n13\n\n\n\n\nTable of Contents\n\n\n \n\n\nThe agreement governing our senior secured revolving credit facility limits our ability, among other things, to incur additional secured indebtedness; sell, transfer, license or dispose of assets; consolidate or merge; enter into transactions with our affiliates; and incur liens. In addition, our senior secured revolving credit facility contains financial and other restrictive covenants that limit our ability to engage in activities that may be in our long-term best interest, such as, subject to permitted exceptions, making capital expenditures in excess of certain thresholds, making investments, loans and other advances, and prepaying any additional indebtedness while our indebtedness under our senior secured revolving credit facility is outstanding. Our failure to comply with financial and other restrictive covenants could result in an event of default, which if not cured or waived, could result in the lenders requiring immediate payment of all outstanding borrowings or foreclosing on collateral pledged to them to secure the indebtedness.\n \n\n\nWe may not be able to pay our debt and other obligations.\n \n\n\nIf our cash flows are inadequate to meet our obligations, we could face substantial liquidity problems. If we are unable to generate sufficient cash flows or otherwise obtain funds necessary to make required payments on our senior secured revolving credit facility or certain of our other obligations, we would be in default under the terms thereof, which would permit the holders of those obligations to accelerate their maturity and also could cause defaults under future indebtedness we may incur. Any such default could have a material adverse effect on our business, prospects, financial position and operating results.\n \n\n\nForeign currency exchange rates and fluctuations in those rates may affect the Company’s ability to realize projected growth rates in its sales and earnings.\n \n\n\nOur financial statements are denominated in U.S. dollars. While revenues in our test businesses are predominantly in U.S. dollars, the majority of our Robotics revenue is denominated in foreign currencies. Strengthening of the U.S. dollar would negatively affect Robotics revenue growth.\n \n\n\nAdverse developments affecting the financial services industry, including events or risks involving liquidity, defaults or non-performance by financial institutions, could have a material adverse effect on our business, financial condition or results of operations.\n\n\nWe hold cash balances in several large financial institutions significantly in excess of the Federal Deposit Insurance Corporation (\"FDIC\") and global insurance limits. If banks and financial institutions with whom we have banking relationships enter receivership or become insolvent in the future, we may be unable to access, and we may lose some or all of our existing cash, cash equivalents and investments to the extent those funds are not insured or otherwise protected by the FDIC. For example, on March 10, 2023, \nSilicon Valley Bank \n(\"SVB\"), who is a lender in our revolving credit facility and where we maintain certain accounts and cash deposits, was placed into receivership with the FDIC, which resulted in all funds held at SVB being temporarily inaccessible by SVB’s customers. As of March 13, 2023, access to our cash and cash equivalents at SVB was fully restored. There is no guarantee that the FDIC or any other global insurer will provide access to uninsured funds in the future in the event of the closure of any other banks or financial institutions in a timely fashion or at all. Any inability to access or delay in accessing these funds could adversely affect our business, financial position, and liquidity.\n \n\n\n \n\n\nOur stock price has been subject to fluctuations, and will likely continue to be subject to fluctuations, which may be volatile and due to factors beyond our control.\n\n\nThe market price of our common stock is subject to wide fluctuations in response to various factors, some of which are beyond our control. In addition to the factors discussed in this \"Risk Factors\" section and elsewhere in this report, factors that could cause fluctuations in the market price of our common stock include the following:\n\n\n•\nratings changes by any securities analysts who follow our company;\n\n\n•\nannouncements by us or our competitors of significant technical innovations, acquisitions, strategic partnerships, joint ventures, or capital commitments;\n\n\n•\nchanges in operating performance and stock market valuations of other technology companies generally, or those in our industry in particular;\n\n\n•\nchanges in accounting standards, policies, guidelines, interpretations, or principles;\n\n\n•\nactual or anticipated developments in our business or our competitors’ businesses or the competitive landscape generally;\n\n\n•\ndevelopments or disputes concerning our intellectual property or our products and platform capabilities, or third-party proprietary rights;\n\n\n14\n\n\n\n\nTable of Contents\n\n\n \n\n\n•\ncybersecurity attacks or incidents;\n\n\n•\nannounced or completed acquisitions of businesses or technologies by us or our competitors;\n\n\n•\nchanges in our board of directors or management;\n\n\n•\nannounced or completed equity or debt transactions involving our securities;\n\n\n•\nsales of shares of our common stock by us, our officers, directors, or other stockholders; and\n\n\n•\nother events or factors, including those resulting from global and macroeconomic conditions, including heightened inflation, rising interest rates, bank failures, and a potential recession, and speculation regarding the same, as well as public health crises, geopolitical tension, incidents of terrorism, or responses to these events.\n\n\nIn addition, the market for technology stocks and the stock markets in general have experienced extreme price and volume fluctuations. Stock prices of many technology companies have fluctuated in a manner unrelated or disproportionate to the operating performance of those companies. In the past, stockholders have instituted securities class action litigation following periods of market volatility. If we were to become involved in securities litigation, it could subject us to substantial costs, divert resources and the attention of management from our business, and adversely affect our business, results of operations, financial condition, and cash flows. A decline in the value of our common stock, including as a result of one or more factors set forth above, may result in substantial losses for our stockholders.\n\n\nRisks Related to Operations\n \n\n\nOur operating results are likely to fluctuate significantly.\n \n\n\nOur operating results are affected by a wide variety of factors that could materially adversely affect revenues or profitability. The following factors could impact future operations:\n \n\n\n•\na worldwide economic slowdown or disruption in the global financial or industrial markets;\n\n\n•\ncost increases from inflation on materials, employee wages, third party labor, and contract manufacturing;\n\n\n•\ncompetitive pressures on selling prices;\n\n\n•\nour ability to introduce, and the market acceptance of, new products;\n\n\n•\nchanges in product revenues mix resulting from changes in customer demand;\n\n\n•\nthe level of orders received which can be shipped in a quarter because of the tendency of customers to wait until late in a quarter to commit to purchase due to capital expenditure approvals and constraints occurring at the end of a quarter, or the hope of obtaining more favorable pricing from a competitor seeking the business;\n\n\n•\nengineering and development investments relating to new product introductions, and the expansion of manufacturing, outsourcing and engineering operations in Asia; \n\n\n•\nprovisions for excess and obsolete inventory relating to the lack of demand for and the discontinuance of products; \n\n\n•\nimpairment charges for certain long-lived and intangible assets, and goodwill; \n\n\n•\nan increase in the leasing of our products to customers; \n\n\n•\ndisruption caused by health pandemics,\n\n\n•\nthe success of sales channel expansion in Robotics; \n\n\n•\nour ability to expand our global distribution channel for our collaborative and mobile robots; \n\n\n•\nparallel or multi-site testing which could lead to a decrease in the ultimate size of the market for our semiconductor and electronic test products; and \n\n\n•\nthe ability of our suppliers and subcontractors to meet product quality or delivery requirements needed to satisfy customer orders for our products, especially if consolidated revenues increase. \n\n\nAs a result of the foregoing and other factors, we have experienced and may continue to experience material fluctuations in future operating results on a quarterly or annual basis which could materially and adversely affect our business, financial condition, operating results or stock price.\n \n\n\n15\n\n\n\n\nTable of Contents\n\n\n \n\n\nIf our suppliers do not meet product or delivery requirements, we could have reduced revenues and earnings.\n \n\n\nIf any of our suppliers were to cancel contracts or commitments or fail to meet the quality or delivery requirements needed to satisfy customer orders for our products, we could lose time-sensitive customer orders, have significantly decreased revenues and earnings and be subject to contractual penalties, which would have a material adverse effect on our business, results of operations and financial condition. In addition, we rely on contract manufacturers for certain of our products, and our ability to meet customer orders for those products depends upon the timeliness and quality of the work performed by these subcontractors, over whom we do not exercise any control.\n \n\n\nTo a certain extent, we are dependent upon the ability of our suppliers and contract manufacturers to help meet increased product or delivery requirements. It may be difficult for certain suppliers to meet delivery requirements in a period of rapid growth, therefore impacting our ability to meet our customers’ demands.\n \n\n\nOur suppliers are subject to trade regulations, including tariffs and export restrictions imposed by the United States Government and by the governments of other countries. These regulations could impact our suppliers’ ability to provide us with components for our products or could increase the price of those components.\n \n\n\nWe rely on the financial strength of our suppliers. The loss of suppliers either as a result of financial viability, bankruptcy or otherwise could have a material adverse effect on our business, results of operations or financial condition.\n \n\n\nThe global supply shortage of electrical components and inflationary cost increases impact our ability to meet customer demand and could adversely affect our business and financial results.\n \n\n\nThe global supply shortage of electrical components, including semiconductor chips, impacted our supply chain in 2023. As a result, we experienced and may experience in the future, increases in our lead times and costs for certain components for certain products. We may also experience delays in the delivery of some orders placed by our customers. In addition, inflationary pressures have in the past contributed to increased costs for product components along with wage inflation which yielded a minimal impact to the costs of our products, gross margin and profit for the year. In an effort to mitigate these risks, we may in some cases, incur higher costs due to investment in supply chain resiliency and to secure available inventory or have extended or non-cancellable purchase commitments with semiconductor suppliers, which introduces inventory risk if our forecasts prove inaccurate. We have also sourced components from additional suppliers and multi-sourced and pre0ordered components and finished goods inventory in some cases in an effort to reduce the impact of the adverse supply chain conditions we have experienced in the past. However, if we are unable to secure manufacturing capacities from our current or new suppliers and contract manufacturers, on acceptable terms or at all, or successfully manage our purchase commitments and inventory for components, our ability to deliver our products to our customers in the desired quantities, at competitive prices or in a timely manner may be negatively impacted for 2025. We also have been, and may continue to attempt to, offset the effect of these inflationary pressures by increasing the prices of our products. However, we may not be fully able to pass additional costs on to our customers, which could have a negative impact on our results of operations and financial condition.\n\n\nOur operations may be adversely impacted if our outsourced contract manufacturers or service providers fail to perform.\n\n\nWe depend on Flex Ltd. (“Flex”) to manufacture and test our FLEX and J750 family of products from its facility in Malaysia; Plexus Corp. (“Plexus”) to manufacture and test our Magnum products from its facilities in Malaysia and Thailand and our ETS family of products from its facility in Malaysia; SAM Meerkat to manufacture and test our storage test family of products from its facilities in Malaysia and Thailand and on other contract manufacturers to manufacture other products. If for any reason these contract manufacturers cannot provide us with these products in a timely fashion, or at all, we may not be able to sell these products to our customers until we enter a similar arrangement with an alternative contract manufacturer.\n \n\n\nIf we experience a problem with our supply of products from Flex, Plexus, SAM Meerkat, or our other contract manufacturers, it may take us significant time to either manufacture the product or find an alternate contract manufacturer, which could result in substantial expense and disruption to our business.\n \n\n\nWe have also outsourced certain general and administrative functions to reputable service providers, many of which are in foreign countries, sometimes impacting communication with them because of language and time differences. Their presence in foreign countries also increases the risk they could be exposed to political and cybersecurity risk. Additionally, there may be difficulties encountered in coordinating the outsourced operations with existing functions and operations. If we fail in successfully coordinating and managing the outsourced service providers, it may cause an adverse effect on our operations which could have a material adverse effect on our business, results of operations or financial condition.\n \n\n\n16\n\n\n\n\nTable of Contents\n\n\n \n\n\nOur business may suffer if we are unable to attract and retain key employees.\n \n\n\nCompetition for employees with skills we require is intense in the high technology industry. We expect intense competition for employees to continue in 2025. Our success will depend on our ability to attract and retain key technical employees. The loss of one or more key or other employees, a decrease in our ability to attract additional qualified employees, or the delay in hiring key personnel could each have a material adverse effect on our business, results of operations or financial condition.\n \n\n\nOur operations, and the operations of our customers and suppliers, are subject to risks of natural catastrophic events, severe weather, widespread health epidemics, acts of war, terrorist attacks and the threat of domestic and international terrorist attacks, any one of which could result in cancellation of orders, delays in deliveries or other business activities, or loss of customers and could negatively affect our business and results of operations. In certain cases, our insurance policy may be insufficient to cover losses.\n\n\nOur business is international in nature, with our sales, service and administrative personnel and our customers and suppliers located in numerous countries throughout the world. Our operations, and those of our customers and suppliers, are subject to disruption for a variety of reasons, including work stoppages, acts of war, terrorism, health epidemics, fires, earthquakes, hurricanes, typhoons, volcanic eruptions, energy shortages, telecommunication failures, tsunamis, flooding or other natural disasters. Such disruption could materially increase our costs and expenses as well as cause delays in, among other things, shipments of products to our customers, our ability to perform services requested by our customers, or the installation and acceptance of our products at customer sites. Any of these conditions could have a material adverse effect on our business, financial condition or results of operations.\n \n\n\nGlobal climate change can result in natural disasters occurring more frequently, with greater intensity and with less predictability. For example, when our operations in Cebu, Philippines experienced a devastating typhoon, our employees in Cebu succeeded in restoring most of our operations within days despite the severity of the damage in the region. The long-term effects of climate change on the global economy and the semiconductor industry in particular are unclear but could be severe.\n \n\n\nRisks Related to Intellectual Property (“IP”) and Cybersecurity\n \n\n\nThird parties may claim we are infringing their intellectual property and we could suffer significant litigation costs, licensing expenses or be prevented from selling our products.\n \n\n\nWe have been sued for patent infringement and receive notifications from time to time that we may be in violation of patents held by others. An assertion of patent infringement against us, if successful, could have a material adverse effect on our ability to sell our products or it could force us to seek a license to the intellectual property rights of others or alter such products so that they no longer infringe the intellectual property rights of others. A license could be very expensive to obtain or may not be available at all. Similarly, changing our products or processes to avoid infringing the rights of others may be costly or impractical. Additionally, patent litigation could require a significant use of management resources and involve a lengthy and expensive defense, even if we eventually prevail. If we do not prevail, we might be forced to pay significant damages, obtain licenses, modify our products, or stop making our products; each of which could have a material adverse effect on our financial condition, operating results or cash flows.\n \n\n\nIf we are unable to protect our IP, we may lose a valuable asset or may incur costly litigation to protect our rights.\n \n\n\nWe protect the technology that is incorporated in our products in several ways, including through patent, copyright, trademark and trade secret protection and by contractual agreement. However, even with these protections, our IP may still be challenged, invalidated or subject to other infringement actions. While we believe that our IP has value in the aggregate, we do not believe that any single element of our IP is in itself essential. If a significant portion of our IP is invalidated or ineffective, our business could be materially adversely affected.\n \n\n\nA breach of our operational or security systems could negatively affect our business and results of operations.\n \n\n\nWe rely on various information technology networks and systems to process, transmit and store electronic information, including proprietary and confidential data, and to carry out and support a variety of business activities, including manufacturing, research and development, supply chain management, sales and accounting. We have experienced several attempted cyber-attacks of our network. None of the attempted attacks have caused a disruption to our operations or had a material adverse effect on our business or financial results. As a result of the attempts, we have taken further preventive security measures to protect our systems. Despite the preventative security measures we have implemented, we may continue to be vulnerable to attempts by third parties to gain unauthorized access to our networks or sabotage our systems. These attempts, which might be related to criminal hackers, industrial espionage or state-sponsored intrusions, include trying to covertly introduce malware to our computers, networks and systems and impersonating authorized users. In addition, third party suppliers and service providers that we rely on to manage our networks and\n \n\n\n17\n\n\n\n\nTable of Contents\n\n\n \n\n\nsystems and who process and store our proprietary and confidential data, including the data of our customers and suppliers, may also be subject to similar attacks. Employees and contractors may also attempt to gain unauthorized access to our systems and steal proprietary and confidential data. Such attempts could result in the misappropriation, theft, misuse, disclosure or loss or destruction of the intellectual property, or the proprietary, confidential or personal information, of Teradyne or our employees, customers, suppliers or other third parties, as well as damage to or disruptions in our information technology networks and systems. These threats are constantly evolving and expanding, such as through the increased use of artificial intelligence in our products and expanding remote work opportunities for our employees, thereby increasing the difficulty of defending against them or implementing adequate preventative measures. While we seek to detect and investigate all security incidents and to prevent their recurrence, attempts to gain unauthorized access to our information technology networks and systems may be successful, and in some cases, we might be unaware of an incident or its magnitude and effects. A failure in or a breach of our operational or security systems or infrastructure, or those of our suppliers and other service providers, including as a result of cyber-attacks, could have a material adverse effect on our business or financial results, disrupt our business, result in the disclosure or misuse of proprietary or confidential information, damage our reputation, cause losses and increase our costs. We expect to continue to devote significant resources to the security of our information technology networks and systems.\n \n\n\nA breach of the security of our products could negatively affect our business and results of operations.\n \n\n\nWe may be subject to security breaches of certain of our products caused by viruses, illegal break-ins or hacking, sabotage, or acts of vandalism by third parties or our employees or contractors. A breach of our product security systems could have a material adverse effect on our business or financial results, disrupt our business, result in the disclosure or misuse of proprietary or confidential information, damage our reputation, cause losses, and increase our costs. We expect to continue to devote significant resources to the security of our products.\n \n\n\nWe are exposed to risks related to the use of AI tools by us and others.\n\n\nAlthough we are evaluating, and where we believe appropriate, incorporating AI tools into our products and operations, our use of AI tools may subject us to significant competitive, legal, regulatory and other risks, and there can be no assurance that our use of AI tools will enhance our products, business operations or result in a benefit to us. Our competitors may be more successful in their use of AI tools, including by developing superior products or improving their operations with the assistance of AI. Additionally, there could be adverse impacts from flawed algorithms. Our use of AI tools, or our customers uses of our products that incorporate AI, could also result in the loss of confidential information or intellectual property or an inability to claim or enforce intellectual property rights, as well as subject us to risks related to intellectual property infringement or misappropriation, data privacy, cybersecurity, and the unauthorized use of our data. The jurisdictions in which we conduct business have and may adopt laws and regulations related to AI, which could cause us to incur greater compliance costs, limit our use of AI tools, or subject us to legal liabilities.\n \n\n\nRisks Related to Legal and Regulatory Compliance\n \n\n\nThe implementation of tariffs on our products may have a material impact on our business.\n \n\n\nOur business operations and supply chain are global and may be disrupted by the implementation of tariffs.\n \n\n\nIn 2018, the United States Trade Representative imposed a 25% tariff on many lists of products, including certain Teradyne products that are made in China and imported into the United States. On February 1, 2025, President Trump issued an executive order directing the United States to impose an additional 10% tariff on all imports from China effective February 4, 2025.We plan to implement operational changes that mitigate some of the impact of these tariffs on the import of our impacted products into the United States. As a result, the existing tariffs have not had a material adverse effect on our business, financial condition or results of operations. The implementation of additional tariffs by the United States could have a material adverse effect on our business, financial condition or results of operations.\n \n\n\nIn addition to the actions taken by the United States, China has implemented retaliatory tariffs on products made in the United States and imported into China. These tariffs have not yet impacted Teradyne products. However, notwithstanding our efforts, the retaliatory tariffs or other trade restrictions implemented by China and possible future retaliatory actions by China or other nations could disrupt our business operations, sales and supply chain and, therefore, have a material adverse effect on our business, financial condition or results of operations.\n\n\nIn February, 2025, President Trump issued executive orders directing the United States to impose new or additional tariffs on certain imports from Canada, Mexico and China and subsequently announced his intention to pause such tariffs on Canada and Mexico. While we do not believe any tariffs announced to date will have a material adverse effect on our business, financial condition or results of operations, we are still evaluating the potential impact of these tariffs and any additional tariffs implemented by the\n \n\n\n18\n\n\n\n\nTable of Contents\n\n\n \n\n\nTrump administration as well as any retaliatory actions by the impacted countries to our business and financial condition and outlook. The actual impact on any new tariffs is subject to a number of factors including the effective date, duration, amount, scope and nature of the tariffs, any retaliatory actions any impacted country may take, and any mitigating actions that are available.\n\n\nTrade regulations and restrictions impact our ability to manufacture certain products and to sell products to and support certain customers, which may materially adversely affect our sales and results of operations.\n\n\nWe are subject to U.S. laws and regulations that limit and restrict the export of some of our products and services and may restrict our transactions with certain customers, business partners and other persons. In certain circumstances, export control and economic sanctions regulations prohibit the export of certain products, services and technologies, and in other circumstances are required to obtain an export license before exporting the controlled item. We must also comply with export restrictions and laws imposed by other countries affecting trade and investments. We maintain an export compliance program but there are risks that the compliance controls could be circumvented, exposing us to legal liabilities. As further described below, compliance with these laws has not significantly limited our sales over time, but could significantly limit them in the future. Changes in, and responses to, U.S. trade policy could reduce the competitiveness of our products and cause our sales to drop, which could have a material adverse effect on our business, financial condition or results of operations.\n \n\n\nThe U.S. government from time to time has issued export restrictions that prohibit U.S. companies from exporting U.S. manufactured products, foreign manufactured products with more than 25% controlled U.S. content, foreign made product which was produced using U.S. technology, as well as U.S. origin technology. For example, the U.S. Department of Commerce has restricted the access of U.S. origin technologies to certain Chinese semiconductor companies by adding those companies to the Entity List and the Foreign Direct Product Rule (\"FDP\") under U.S. Export Administration Regulations (“EAR”). On May 16, 2019, Huawei and 68 of its affiliates, including HiSilicon, were added to the U.S. Department of Commerce Entity List under EAR. On December 2, 2024, certain of our customers and prospective customers were added to the U.S. Department of Commerce Entity List or FDP under EAR. The addition of certain of these companies to the entity list and FDP has had and will continue to have an adverse impact on our business with these customers. We will take appropriate actions, including filing for licenses with the U.S. Department of Commerce to attempt to minimize the impact of the restrictions on our business.\n\n\nOn April 28, 2020, the U.S. Department of Commerce published new export control regulations for certain U.S. products and technology sold to military end users or for military end-use in China, Russia and Venezuela. The definition of military end user is broad. The regulations went into effect on June 29, 2020. In December 2020, the U.S. Department of Commerce issued a list of companies in China and other countries that it considered to be military end users. Compliance with the new export controls has impacted our ability to sell products to certain customers in China. In addition, while we maintain an export compliance program, our compliance controls could be circumvented, exposing us to legal liabilities. We will continue to assess the impact of these export controls on our business and operations and take appropriate actions to ensure compliance and minimize any disruption. However, we cannot be certain that the actions we take will mitigate all the risks associated with the export controls that may impact our business.\n \n\n\nOn October 7, 2022, the U.S. Department of Commerce published regulations restricting the export to China of advanced semiconductors, supercomputer technology, equipment for the manufacturing of advanced semiconductors and components and technology for the manufacturing in China of certain semiconductor manufacturing equipment. The restrictions impacted our sales to certain companies in China and our manufacturing and development operations in China. We mitigated the impact of these restrictions on our business by obtaining licenses from the U.S. Department of Commerce. On October 17, 2023, the U.S. Department of Commerce released new rules updating the export controls issued on October 7, 2022. The new rules, which took effect on November 17, 2023, significantly limit the impact of the October 7, 2022 restrictions on our business. On December 2, 2024, the U.S. Department of Commerce released additional new rules updating export controls. These regulations may continue to have an adverse impact on certain actual or potential customers and on the global semiconductor industry. To the extent the regulations impact actual and potential customers or disrupt the global semiconductor industry, our business and revenues will be adversely impacted.\n\n\nIn response to the regulations issued by the U.S. Department of Commerce, the Chinese government has passed new laws, including blocking legislation, which may impact our business activities in China. The Company is assessing the potential impact of these new Chinese laws and monitoring relevant laws and regulations issued by the Chinese government. The impact of these new Chinese laws on our business activities in China remains uncertain at this time.\n \n\n\nWe may be subject to product recalls and warranty and product liability claims.\n \n\n\nWe invest significant resources in the design, manufacturing and testing of our products. However, from time to time, we discover design or manufacturing defects in our products after they have been shipped and, as a result, we have incurred development and remediation costs and settled warranty and product liability claims. In addition, when our products contain defects or have reliability, quality or safety issues, we have conducted a product recall which resulted in significant repair or replacement costs and\n \n\n\n19\n\n\n\n\nTable of Contents\n\n\n \n\n\nsubstantial delays in product shipments and may damage our reputation which could make it more difficult to sell our products. We could continue to have warranty and product liability claims or product recalls in the future. Any of these results could have a material adverse effect on our business, results of operations or financial condition.\n \n\n\nWe may incur significant costs of complying with present and future environmental regulations and may incur significant liabilities if we fail to comply with such environmental regulations.\n \n\n\nWe are subject to both domestic and international environmental regulations and statutory strict liability relating to the use, storage, discharge, site cleanup and disposal of hazardous chemicals used in our manufacturing processes. In addition, future regulations in response to global climate change may affect us, our suppliers, and our customers. Such regulations could cause us to incur additional direct costs for compliance, as well as increased indirect costs resulting from our customers and/or suppliers. Future climate change regulations could result in decreased demand for our products. If we fail to comply with present and future regulations, or are required to perform site remediation, we could be subject to future liabilities or cost, including penalties or the suspension of production. Present and future regulations may also:\n \n\n\n•\nrestrict our ability to expand facilities; \n\n\n•\nrestrict our ability to ship certain products; \n\n\n•\nrequire us to modify our operations logistics; \n\n\n•\nrequire us to acquire costly equipment; or\n\n\n•\nrequire us to incur other significant costs and expenses. \n\n\nPursuant to present regulations and agreements, we are conducting groundwater and subsurface assessment and monitoring and are implementing remediation and corrective action plans for facilities located in Massachusetts and New Hampshire which are no longer conducting manufacturing operations. As of December 31, 2024, we have not incurred material costs as a result of the monitoring and remediation steps taken at the Massachusetts and New Hampshire sites.\n \n\n\nThe directive on the Restriction of the Use of Certain Hazardous Substances in Electrical and Electronic Equipment (the “RoHS Directive”) and the directive on Waste Electrical and Electronic Equipment (the “WEEE Directive”) altered the form and manner in which electronic equipment is imported, sold and handled in the European Union. Other jurisdictions, such as China, have followed the European Union’s lead in enacting legislation with respect to hazardous substances and waste removal. Ensuring compliance with the RoHS Directive, the WEEE Directive and similar legislation in other jurisdictions, and integrating compliance activities with our suppliers and customers could result in additional costs and disruption to operations and logistics and thus, could have a negative impact on our business, operations or financial condition.\n \n\n\nWe currently are, and in the future may be, subject to litigation or regulatory proceedings that could have an adverse effect on our business.\n \n\n\nFrom time to time, we may be subject to litigation or other administrative, regulatory or governmental proceedings, including tax audits and resulting claims that could require significant management time and resources and cause us to incur expenses and, in the event of an adverse decision, pay damages or incur costs in an amount that could have a material adverse effect on our financial position or results of operations.\n \n\n\nWe may face risks associated with shareholder activism.\n \n\n\nWe may become subject to campaigns by shareholders advocating corporate actions such as financial restructuring, increased borrowing, special dividends, stock repurchases or divestitures. Such activities could interfere with our ability to execute our business plans, be costly and time-consuming, disrupt our operations, divert the attention of management, or result in our initiating borrowing or increasing our share repurchase plan or dividend, any of which could have an adverse effect on our business or stock price.\n \n\n\nProvisions of our charter and by-laws and Massachusetts law may make a takeover of Teradyne more difficult.\n \n\n\nThere are provisions in our basic corporate documents and under Massachusetts law that could discourage, delay or prevent a change in control, even if a change in control may be regarded as beneficial to some or all of our stockholders.",
    "item1b": "Item 1B: \nUnreso\nlved Staff Comments\n \n\n\nNone.\n \n\n\n20\n\n\n\n\nTable of Contents",
    "item1c": "Item 1C: \nCybersecurity\n \nWe believe cybersecurity is critical to supporting our vision and enabling our strategy. As a producer of leading-edge electronic testing products and maker of advanced robotics, we face a multitude of cybersecurity threats that range from attacks common to most industries, such as ransomware and denial-of-service, to attacks from more advanced, persistent, and highly organized adversaries, including nation state actors, that may target us for our role in critical infrastructure sectors. Our customers, suppliers, and partners face similar cybersecurity threats and, while we have\n not been materially affected\n to date, a cybersecurity incident impacting us or any of these entities could materially adversely affect our operations, performance, and results of operations. These cybersecurity threats and related risks make it imperative that we maintain a strong focus on cybersecurity.\nGovernance\nThe Board of Directors oversees management’s processes for identifying and mitigating risks, including cybersecurity risks, to help align our risk exposure with our strategic objectives. Senior leadership, including our Chief Information Security Officer (\"CISO\"), brief the Audit Committee of the Board of Directors quarterly and the full Board of Directors at least annually on our cybersecurity and information security posture.\n \nThe corporate information security organization, under the CISO, has implemented a governance structure and processes to assess, identify, manage, and report cybersecurity risks. The CISO chairs management’s Cybersecurity Steering Committee, in which current cyber threats, program performance, and ongoing risk mitigations are regularly reviewed\n. Cybersecurity related risks are also \nintegrated\n into our overall enterprise risk management (\"ERM\") process. These risks are included in the risk universe that the ERM function evaluates to assess top enterprise risks on an annual basis and is reviewed and evaluated by the Board of Directors. The Board of Directors is also apprised of cybersecurity issues or incidents deemed to have a moderate or higher business impact as they arise, even if considered immaterial. \nIn the event of a significant incident, we intend to follow our detailed incident response playbooks, which outline the steps to be followed from incident detection through mitigation, recovery and notification, including escalation to functional areas (e.g., legal), and escalation to senior leadership via the Cybersecurity Steering Committee.\n Upon escalation, the Cybersecurity Steering Committee will review all inputs, assess the materiality of the incident, and then brief the Board of Directors on the determination and on how management intends to respond. \nRisk management and strategy\nOur global information security organization, led by our CISO, is responsible for our overall information security strategy\n, policy, security engineering, operations, and cyber threat detection and response\n. \nOur CISO is an experienced cybersecurity senior executive with more than 25 years of experience building and leading cybersecurity, risk management and information technology teams. The information security organization manages and continually enhances a robust enterprise security structure with the goal of preventing \ncybersecurity incidents to the extent feasible, while simultaneously increasing system resilience and deploying highly proficient detection and response capabilities in an effort to minimize the business impact should an incident occur. \nCentral to this organization is our global cyber operations team, which is responsible for the protection, detection, and response capabilities used in the defense of critical data and enterprise computing services. We also have a corporate-wide insider threat detection program to proactively identify external and internal threats and mitigate those threats in a timely manner. Our broader Teradyne employee community also has a key role in our cybersecurity defenses and is immersed in a comprehensive training and awareness curriculum to build and promote a corporate culture supportive of security.\nThird parties also play a role in our cybersecurity. \nWe engage \nthird-party\n services to provide 24x7x365 monitoring, escalation, and response to cyber events.\n In addition to consulting on best practices, we leverage third parties for independent evaluations of our security controls through penetration testing and independent audits. These evaluations include testing both the design and operational effectiveness of security controls. We also share and receive threat intelligence with our industry peers, cybersecurity associations, and our cyber controls vendors.\nWe rely on contract manufacturing organizations and distributors to deliver our products to our customers, and a cybersecurity incident at one of these organizations or a key supplier could materially adversely impact us. We assess third party and supply chain cybersecurity controls through risk monitoring services tailored to align with our risk policy. Notwithstanding the extensive approach we take to cybersecurity, we may not be successful in preventing or mitigating a cybersecurity incident that could have a material adverse effect on us, either directly within our managed environment or indirectly via a third-party partner or supply chain vendor. Periodically we have a recognized independent security expert firm to assess our cyber security maturity along with risks and provide\n \n\n\n21\n\n\n\n\nTable of Contents\n\n\n \n\n\nfeedback on where we should continue to improve to mitigate exposures. We share this review with our Board and develop a security roadmap which incorporates this feedback.\n \nAdditionally, for our business that supports the defense and aerospace sector, we must comply with extensive regulations, including requirements imposed by the Defense Federal Acquisition Regulation Supplement (\"DFARS\") related to adequately safeguarding controlled unclassified information (\"CUI\") and\n reporting cybersecurity incidents to the DoD\n. We have implemented cybersecurity policies and frameworks based on industry and governmental standards to align closely with DoD requirements, instructions, and guidance. Moreover, we are pursuing the necessary controls to support the Cybersecurity Maturity Model Certification (\"CMMC\") program, DoD’s program to ensure members of the defense industrial base meet cybersecurity requirements for handling CUI and federal contract information. We believe we are well positioned to meet the requirements of the CMMC and are preparing for certification once the requirements are effective."
  }
}