{
  "ticker": "TFC",
  "cik": "0000092230",
  "company_name": "TRUIST FINANCIAL CORP",
  "filing_date": "2025-02-25",
  "accession": "0000092230-25-000020",
  "primary_doc": "tfc-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nTruist Financial Corporation is a purpose-driven financial services company committed to inspiring and building better lives and communities. Headquartered in Charlotte, North Carolina, Truist has leading market share in many of the high-growth markets in the U.S. and offers a wide range of products and services through wholesale and consumer businesses, including consumer and small business banking, commercial and corporate banking, investment banking and capital markets, wealth management, payments, and specialized lending businesses.\nTruist Bank, the largest subsidiary of Truist Financial Corporation, was chartered in 1872 and is the oldest bank headquartered in North Carolina. Truist Bank is one of the 10 largest commercial banks in the U.S. and provides banking and trust services for clients through 1,928 offices as of December 31, 2024 and its digital platform.\nProduct and Services\nTruist offers commercial and consumer clients an array of products and services to respond to their financial needs. Examples of these products and services include:\nTable 1: Products and Services\n \nConsumer Services:\n \nWholesale Services:\nAsset management\nAsset based lending\nAutomobile lending\nAsset management\nCredit card lending\nCommercial deposit and treasury services\nConsumer finance\nCommercial lending\nHome equity and other direct retail lending\nFloor plan lending\nHome mortgage lending\nDerivatives\nInvestment brokerage services\nInstitutional trust services\nMobile/online banking\nInsurance premium finance\nPayment solutions\nInternational banking\nPoint-of-sale lending\nInvestment banking and capital markets services\nRetail and small business deposit products\nLeasing\nSmall business lending\nMerchant services\nMortgage warehouse lending\nPayment solutions\nReal estate lending\nSupply chain financing\nWealth management/private banking\nMarket Area\nThe following table details Truist Bank’s deposit market share and branch locations by state:\nTable 2: Deposit Market Share and Branch Locations by State\n \n% of Truist’s Deposits\n(2)\nDeposit Market Share Rank\n(2)\nNumber of Branches\n(3)\nFlorida\n23 \n%\n4th\n441\nGeorgia\n19 \n1st\n202\nVirginia\n15 \n1st\n260\nNorth Carolina\n(1)\n13 \n2nd\n276\nMaryland\n7 \n3rd\n138\nTennessee\n5 \n5th\n98\nPennsylvania\n4 \n12th\n136\nSouth Carolina\n4 \n3rd\n95\nTexas\n3 \n20th\n96\nWest Virginia\n2 \n2nd\n42\nKentucky\n2 \n4th\n53\nWashington, D.C.\n1 \n5th\n18\nAlabama\n1 \n6th\n49\nNew Jersey\n1 \n25th\n20\nOther states\nNA\nNA\n4\n(1)\nDeposit market share rank excludes home office deposits.\n(2)\nSource: FDIC.gov data as of June 30, 2024.\n(3)\nAs of December 31, 2024.\n4   Truist Financial Corporation\nCompetition\nThe financial services industry is intensely competitive and constantly evolving. Management believes that Truist’s purpose, mission, and values, including a caring client-first approach, are a competitive advantage that strengthens the Company’s ability to provide financial products and services to businesses and individuals in its markets. The Company has recently made significant investments to develop its digital platform, including enhancements to its mobile and online applications to meet its clients’ digital expectations. Legislative, regulatory, economic, and technological changes, as well as continued consolidation within the industry, have resulted in increased competition from new and existing market participants, which is expected to continue in the future. Truist competes actively with national, regional, and local financial services providers, including banks, thrifts, credit unions, investment advisers, asset managers, securities brokers and dealers, private-equity funds, hedge funds, mortgage-banking companies, finance companies, and financial technology companies. At the same time, non-banking entities, including financial technology companies, have increased competition by providing financial products and services directly to customers and indirectly through partnerships.\nMany of our competitors have substantial positions nationally or in the markets in which we operate. Some also have greater scale, financial and operational resources, investment capacity, product and service offerings, and brand recognition. Our competitors may be subject to different and, in some cases, less stringent legislative, regulatory, and supervisory regimes than Truist. Certain competitors differ from us in their strategic and tactical priorities and, for example, may be willing to suffer meaningful financial losses in the pursuit of disruptive innovation and client growth or to accept more aggressive business, compliance, and other risks in the pursuit of higher returns and market valuations. Competition affects every aspect of our business, including product and service offerings, rates, pricing and fees, credit limits, and client service. Successfully competing in our markets also depends on our ability to innovate, to invest in technology and infrastructure, to execute transactions reliably and efficiently, to maintain and enhance our reputation, and to attract, retain, and motivate talented teammates, all while effectively managing risks and expenses. We expect that competition will only intensify in the future.\nPurpose, Mission, and Values\nOur purpose is to inspire and build better lives and communities.\nOur mission is to:\n•\nProvide clients with distinctive, secure, and successful experiences through touch and technology;\n•\nCreate an inclusive and energizing environment that empowers teammates to learn, grow, and have meaningful careers; and\n•\nOptimize long-term value for stakeholders through safe, sound, and ethical practices.\nOur values are: \n•\nTrustworthy – we serve with integrity\n•\nCaring – everyone and every moment matters\n•\nOne Team – together we can accomplish anything\n•\nSuccess – when our clients win, we all win\n•\nHappiness – positive energy changes lives\nStrategy\nOur strategic direction is to build the top super regional bank that grows with our clients with care. Our 2025 strategic objectives are to:\n•\nLeverage our capital position by growing and capturing additional share within our high growth markets and existing client base in key focus areas in WB and CSBB and in areas, markets, and client solutions where we have invested significantly and have momentum.\n•\nIn WB, deepen and grow existing client relationships in areas like Payments and Wealth, enhance the client digital experience, continue our momentum in Investment Banking and Trading, and capture more share of the commercial middle market.\n•\nIn CSBB, grow core deposits, deepen existing relationships with Premier clients, enhance the client digital experience, and drive additional fee and loan growth through our differentiated consumer lending solutions.\n•\nContinue to invest in important areas like new and existing talent, technology, risk, and cybersecurity, while maintaining our expense discipline with a goal of driving positive operating leverage.\n•\nMaintain our credit and risk discipline.\n•\nReturn capital to shareholders through our common stock dividend and share repurchase authorization.\nTruist Financial Corporation   5\nAlthough mergers and acquisitions are not a top capital deployment priority for Truist, the Company will assess opportunities when strategic and business objectives, profitability, cultural fit, market and regulatory conditions, capital and liquidity, and risk-management considerations favorably align.\nChallenges and unforeseen events could have an adverse impact on Truist’s financial condition, results of operations, and strategy. See the sections titled “Forward-Looking Statements” and “Risk Factors” for examples of such challenges and events.\nRegulatory and Supervisory Considerations\nWe are subject to significant regulatory frameworks that affect the products and services that we may offer and the manner in which we may offer them, the risks that we may take, the ways in which we may operate, and the corporate and financial actions that we may take.\nVarious governmental agencies and self-regulatory organizations oversee our business activities and therefore supervise and periodically examine us. These agencies and organizations generally have broad authority and discretion in restricting and otherwise affecting our businesses and operations and may take formal or informal supervisory, enforcement, and other actions against us when, in the applicable agency’s or organization’s judgment, our businesses or operations fail to comply with applicable law, comport with safe and sound practices, or meet supervisory expectations.\nThe regulatory and supervisory framework applicable to banking organizations is intended primarily for the protection of depositors and other customers, the DIF, the broader economy, and the stability of the U.S. financial system, rather than for the protection of shareholders and non-deposit creditors. In addition to banking statutes, regulations, and other laws, Truist is subject to various other laws that directly or indirectly affect its business and operations, including its ability to make distributions to shareholders. Governmental agencies and self-regulatory organizations also issue policy statements, interpretive letters, guidance, and other documents and communications that similarly impact Truist. The scope, complexity, intensity, and interpretation of these laws, documents, communications, and actions can vary based on such factors as the state of the economy, the prevailing political environment, and the performance of businesses and operations by us and other financial institutions.\nThe scope of the laws, documents, communications, and actions, including the intensity of the supervision to which the banking industry is subject, have increased in recent years. Regulatory enforcement and fines have also increased across the banking and financial services sector. Truist expects to remain subject to extensive regulation and supervision.\nThis section summarizes some relevant provisions of the principal statutes, regulations, and other laws that apply to us. These descriptions, however, are qualified in their entirety by the full text and judicial or administrative interpretations of those laws. This summary also does not cover all possible or proposed changes in laws applicable to us.\nGeneral\nAs a BHC, Truist is subject to the BHCA and to regulation, supervision, and examination by the FRB. Truist Bank, a North Carolina state-chartered commercial bank that is not a member of the Federal Reserve System, is subject to regulation, supervision, and examination by the NCCOB and the FDIC. Truist Bank and its affiliates are also subject to examination by the CFPB for compliance with most federal consumer financial protection laws.\nTruist and certain of its subsidiaries and affiliates, including those that engage in derivatives transactions, securities underwriting, market making, brokerage, and investment advisory activities, are subject to other federal and state laws and regulations, as well as supervision and examination by other federal and state regulatory agencies and other regulatory authorities, including the SEC, CFTC, FINRA, and NFA. Truist Bank is subject to additional state and federal laws, as well as various regulations, which govern its activities, the investments it may make, and the aggregate amount of loans that may be granted to one borrower.\nExaminations by regulators consider not only compliance with applicable laws, regulations, and supervisory policies of the agency, but also capital levels, asset quality, risk management effectiveness, the ability and performance of management and the Board, the effectiveness of internal controls, earnings, liquidity, and various other factors. Following examinations by banking supervisors, Truist and Truist Bank may receive supervisory findings and ultimately are assigned supervisory ratings. Examination reports, supervisory ratings, and other actions under this supervisory framework, which are considered confidential supervisory information, can impact the conduct, growth, and profitability of Truist’s operations, possibly to a significant degree. Refer to",
    "item1a": "Item 1A, “Risk Factors” for information on risks from cybersecurity threats. We maintain a risk-based cybersecurity framework that is part of our ERM Framework. It is implemented through people, processes, and technology, whereby we assess, identify, and manage material risks from cybersecurity threats, and seek to adapt our risk mitigation activities accordingly.\nFoundationally, our cybersecurity framework is based upon the National Institute of Standards and Technology for Improving Critical Infrastructure Cybersecurity and is also designed to incorporate elements from additional industry standards, such as those of the Federal Financial Institutions Examination Council, to better suit the Company’s cyber risk profile. In addition, our cybersecurity framework incorporates internal and third-party capabilities that drive the development and implementation of our data security strategy, which is designed to reduce cybersecurity risk while enabling Truist’s corporate business objectives.\nProcesses for assessing, identifying, and managing material risks from cybersecurity threats\nWe maintain an Information Security Program that specifies how we execute our cybersecurity framework. The Information Security Program is designed to assess, identify, and manage risks arising from the cybersecurity threats facing Truist.\n Truist maintains cybersecurity and information security policies, procedures, and technologies that are intended to protect our clients’, teammates’ and our own data against unauthorized disclosure, modification, and misuse. These policies, procedures, and technologies cover a broad range of areas, including identification of internal and external threats, access control, data security, protective controls, detection of malicious or unauthorized activity, incident response, and recovery planning.\nFor example, to further mitigate the risks presented by an evolving cyber threat landscape, Truist:\n•\nprovides data protection guidance to clients;\n•\npromotes data protection awareness and accountability through mandatory teammate training; and \n•\nconducts scenario-driven test exercises simulating impacts and consequences developed through analysis of real-world incidents as well as known and anticipated cyber threats. These exercises are designed to assess the viability of Truist’s crisis response and management programs and provide the basis for improvement. \nIn addition, as a key part of the Company’s Information Security Program, Truist participates in the federally recognized Financial Services Information Sharing and Analysis Center, as well as other industry organizations and initiatives that promote industry best practices, such as harmonized cybersecurity standards, cyber readiness, and secure consumer financial data sharing.\nOur Cyber Incident Response Team is responsible for identifying, triaging, and containing cybersecurity threats and incidents, including, to the extent possible, those experienced by third-party service providers. Incidents with potential for higher impacts are routed to an enterprise response function that coordinates the response activities across impacted resource groups and business stakeholders. Through this structure, Truist manages its cyber, business, and legal obligations, including escalation to executive management and the Board, as appropriate, client and regulatory notifications, and remediation activities.\nOur Information Security Program is also designed to help oversee, identify, and mitigate cybersecurity risks associated with our use of third-party service providers.\n \nFollowing an initial assessment of the level of enterprise risk potentially posed by use of the third party, the service provider is then subject to further risk-based assessments on its operational resilience and cybersecurity practices, including disaster recovery and business continuity plans that specify the time frame to resume activities and recover data. In its agreements with third-party service providers, Truist requires service providers to adhere to Truist’s relevant cybersecurity and operational resilience standards, subject to certain exceptions that are managed on a case-by-case basis.\nOur Information Security Program is assessed periodically to test the effectiveness of key controls through cybersecurity maturity measurements, technology risk oversight, compliance risk management testing and monitoring, internal audit review, and regulatory oversight.\nIn addition, Truist maintains disaster recovery plans that are reviewed, modified, and approved annually.\nTruist Financial Corporation   41\nManagement’s role in assessing and managing material risks from cybersecurity threats\nTruist’s Information Security Program is operated and maintained by management, including the CIO, interim CISO, and CRO. These senior officers are responsible for assessing and managing Truist’s cybersecurity risks.\n \nOur Information Security Program also includes processes for escalating and considering the materiality of incidents that impact Truist, including escalation to executive management and the Board, which are periodically tested through tabletop exercises to assess Truist’s preparedness.\n Our cybersecurity framework strategy, which is overseen by the interim CISO, is informed by various risk and control assessments, control testing, external assessments, threat intelligence, and public and private information sharing.\nIn addition, various management committees assess and manage Truist’s cybersecurity risks. These committees promote visibility and awareness of cybersecurity risks and drive action and escalation as needed. The primary management committees involved in Truist’s Information Security Program are the Enterprise Technology Risk Committee and the Technology Risk Oversight Committee, each of which is a sub-committee of the ERC. Truist’s cybersecurity teams that implement the Information Security Program and the risk partners who oversee the program leverage these committees to report on and escalate current or emerging cybersecurity risks or other changes in the business environment which could affect Truist’s risk profile or control environment.\nAs discussed in more detail in the “Risk Management” section of Part II, Item 7, the ERC is a cross-functional executive forum to promote awareness and dialogue on risk matters across the enterprise, including cybersecurity risks, oversee the execution of risk program requirements and sound risk management activities, and enact delegated decision-making authority and oversight routines from the BRC. Our CRO and CIO are members of the ERC. The interim CISO provides updates at every ERC meeting on cybersecurity and information security risk. \nThe Enterprise Technology Risk Committee provides business unit oversight of key management activities, including the Company’s Information Security Program. The Technology Risk Oversight Committee provides oversight of key risk management activities to identify, assess, monitor, mitigate, and report on technology (including core technology, data and cybersecurity) risk across the enterprise. These sub-committees serve as governing forums for monitoring and escalating significant cybersecurity as well as other technology risk matters to the ERC.\nThe members of management that lead our Information Security Program and strategy have extensive experience in technology, cybersecurity, and information security. Our CRO previously served as our interim CIO and has more than 20 years of banking experience spanning a variety of roles in both the commercial and consumer segments, including credit risk, portfolio risk management, model management, acquisition integrations, technology, and vertically integrated operations for revenue producing businesses, including leading operational services across Truist for deposits, payments, credit card, capital markets, consumer and wholesale lending, fraud, and care centers across all products. Our CIO has over 25 years of experience leading technology teams at financial institutions, including in the areas of application development, infrastructure, information technology strategy, risk management, and information security. Following the departure of our CISO in November 2024, the CIO is serving as our interim CISO while our search for a permanent CISO continues. The CIO’s direct reports have on average over 20 years of experience with technology management and information security at financial institutions, including in the areas of governance, operations, application and data protection, access management, and business information security.\nBoard of Directors’ oversight of risks from cybersecurity threats\nOur Board has primary responsibility for the oversight of our enterprise risk management and exercises its oversight function in respect of cybersecurity risk through the BRC. \nThe BRC is responsible for overseeing Truist’s risk management function, including approving and reviewing Truist’s risk management framework and policies, and overseeing management’s implementation of such framework and policies.\n The oversight responsibility of our Board and the BRC is facilitated through management-reporting processes designed to provide visibility to the Board on cybersecurity matters. \nFor example, members of the BRC receive regular reports from our CRO and interim CISO related to information technology and cybersecurity risks to Truist. \nThe BRC meets periodically with risk management advisors and discusses with executive management any cybersecurity recommendations received. \nManagement also discusses urgent cybersecurity developments with the Chairs of the BRC and BTC between Board and committee meetings, as appropriate. The Board annually reviews and approves our Information Security Program and Information Security Policy.\n Additionally, the BTC provides oversight of Truist’s technology strategy, including elements of it that involve cybersecurity.\nTruist provides ongoing development and education to its directors with respect to cybersecurity, including presentations at Board meetings on special topics, such as updates on cybersecurity legislation and regulation. The Board also conducts a cybersecurity tabletop exercise at least every other year to simulate Truist’s analysis and response to hypothetical cybersecurity incidents. In addition, Truist provides directors with a Board Cybersecurity Handbook that provides details on key Truist practices, resources, and protocols relating to cybersecurity protection, response, and preparedness. Finally, as required by the Gramm-Leach-Bliley Act, the Board receives an update at least annually on Truist’s Information Security Program.\n42   Truist Financial Corporation",
    "item1c": "ITEM 1C. CYBERSECURITY\nThe following is a discussion of Truist’s cybersecurity risk management strategy and governance. Refer to the “Risk Management” section of Part II, Item 7 for additional discussion.\nCybersecurity risk management and strategy\nLike other financial services firms, Truist faces an increasingly complex and evolving cybersecurity threat environment. See"
  }
}