{
  "ticker": "TGT",
  "cik": "0000027419",
  "company_name": "TARGET CORP",
  "filing_date": "2025-03-12",
  "accession": "0000027419-25-000018",
  "primary_doc": "tgt-20250201.htm",
  "item_sections": {
    "item1": "Item 1, Business of this Form 10-K\n and \nNote 2\n to the Financial Statements provides additional product category sales information. The collective interaction of a broad array of macroeconomic, competitive, and consumer behavioral factors, as well as sales mix, and transfer of sales to new stores makes further analysis of sales metrics infeasible.\nTD Bank Group offers credit to qualified guests through Target-branded credit cards: the Target Credit Card and the Target MasterCard Credit Card (Target Credit Cards). Additionally, we offer a branded proprietary Target Debit Card and Target Circle Card Reloadable Account. Collectively, we refer to these products as Target Circle Cards. Guests receive a 5 percent discount on virtually all purchases when they use a Target Circle Card at Target. We monitor the percentage of purchases that are paid for using Target Circle Cards (Target Circle Card Penetration) because our internal analysis has indicated that a meaningful portion of incremental purchases on our Target Circle Cards are also incremental sales for Target. For the years ended February 1, 2025, February 3, 2024, and January 28, 2023, total Target Circle Card Penetration was 17.8 percent, 18.6 percent, and 19.8 percent, respectively. See the Customer Loyalty Programs section within \nItem 1. Business on \npage 5\n for information about the rebranding of RedCards. \nGross Margin (GM) Rate\nOur gross margin rate was 28.2 percent in 2024 and 27.5 percent in 2023. The increase reflected the net impact of \n•\nmerchandising activities, including cost improvements which more than offset higher promotional and clearance markdown rates, as well as growth in advertising and marketplace revenues;\n•\nlower book to\n \nphysical inventory adjustments in 2024; and\n•\nhigher supply chain & digital fulfillment costs due to new supply chain facilities coming online and an increase in digital volume.\nSelling, General and Administrative (SG&A) Expense Rate\nOur SG&A expense rate was 20.6 percent in 2024, compared with 20.0 percent in 2023, reflecting the net impact of cost increases across our business, including higher team member pay and benefits and higher general liability expenses, partially offset by the benefit of lower store remodel-related expenses.\nTARGET CORPORATION\n2024 Form 10-K\n28\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF OPERATIONS & OTHER PERFORMANCE FACTORS\nIndex to Financial Statements\nStore Data\nChange in Number of Stores\n2024\n2023\nBeginning store count\n1,956 \n1,948 \nOpened\n23 \n21 \nClosed\n(1)\n(13)\nEnding store count\n1,978 \n1,956 \nNumber of Stores and\nRetail Square Feet\nNumber of Stores\nRetail Square Feet\n \n(a)\nFebruary 1, 2025\nFebruary 3, 2024\nFebruary 1, 2025\nFebruary 3, 2024\n170,000 or more sq. ft.\n273 \n273 \n48,824 \n48,824 \n50,000 to 169,999 sq. ft.\n1,559 \n1,542 \n195,050 \n192,908 \n49,999 or less sq. ft.\n146 \n141 \n4,404 \n4,207 \nTotal\n1,978 \n1,956 \n248,278 \n245,939 \n(a)\nIn thousands; reflects total square feet less office, distribution center, and vacant space.\nOther Performance Factors\nNet Interest Expense\nNet interest expense was $411 million for 2024, compared with $502 million for 2023. The decrease in net interest expense was primarily due to an increase in interest income.\nProvision for Income Taxes\nOur 2024 effective income tax rate was 22.2 percent compared with 21.9 percent in 2023. The increase primarily reflects lower discrete tax benefits compared to the prior year.\nNumerous countries, including certain jurisdictions in which we operate, have enacted legislation to implement the model rules of the Organization for Economic Cooperation and Development Pillar Two framework (Pillar Two), which is designed to ensure large multinational enterprises are subject to a 15 percent global minimum tax on income earned in each jurisdiction in which they operate. We do not expect the enacted rules, which will be applicable to us in 2025, to materially impact our 2025 financial results. \nUnder the Pillar Two framework, any existing deferred tax assets not disclosed in our financial statements will not be available for future use. Accordingly, we are disclosing the existence of gross tax loss carryforwards of $1.1 billion in Canada and $0.2 billion in Luxembourg. The losses are deemed to have a remote possibility of realization; therefore, a deferred tax asset and valuation allowance are not established.\nTARGET CORPORATION\n2024 Form 10-K\n29\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nRECONCILIATION OF NON-GAAP FINANCIAL MEASURES\nIndex to Financial Statements\nReconciliation of Non-GAAP Financial Measures to GAAP Measures\nTo provide additional transparency, we have disclosed non-GAAP adjusted diluted earnings per share (Adjusted EPS). This metric excludes certain items presented below. We believe this information is useful in providing period-to-period comparisons of the results of our operations. This measure is not in accordance with, or an alternative to, generally accepted accounting principles in the U.S. (GAAP). The most comparable GAAP measure is diluted earnings per share. Adjusted EPS should not be considered in isolation or as a substitution for analysis of our results as reported in accordance with GAAP. Other companies may calculate Adjusted EPS differently than we do, limiting the usefulness of the measure for comparisons with other companies.\nReconciliation of Non-GAAP \nAdjusted EPS\n2024\n2023 \n(a)\n2022\n(millions, except per share data)\nPretax\nNet of Tax\nPer Share Amounts\nPretax\nNet of Tax\nPer Share Amounts\nPretax\nNet of Tax\nPer Share Amounts\nGAAP diluted earnings per share\n$\n8.86 \n$\n8.94 \n$\n5.98 \nAdjustments\nOther \n(b)\n— \n— \n— \n— \n— \n— \n$\n20 \n$\n15 \n0.03 \nAdjusted diluted earnings per share\n$\n8.86 \n$\n8.94 \n$\n6.02 \nNote:  Amounts may not foot due to rounding.\n(a)\n2023 consisted of 53 weeks compared with 52 weeks in 2024 and 2022.\n(b)\nOther items unrelated to current period operations, none of which were individually significant.\nEarnings before interest expense and income taxes (EBIT) and earnings before interest expense, income taxes, depreciation, and amortization (EBITDA) are non-GAAP financial measures. We believe these measures provide meaningful information about our operational efficiency compared with our competitors by excluding the impact of differences in tax jurisdictions and structures, debt levels, and for EBITDA, capital investment. These measures are not in accordance with, or an alternative to, GAAP. The most comparable GAAP measure is net earnings. EBIT and EBITDA should not be considered in isolation or as a substitution for analysis of our results as reported in accordance with GAAP. Other companies may calculate EBIT and EBITDA differently, limiting the usefulness of the measures for comparisons with other companies.\nEBIT and EBITDA\n \n \nPercent Change\n(dollars in millions)\n2024\n2023 \n(a)\n2022\n2024/2023\n2023/2022\nNet earnings\n$\n4,091 \n$\n4,138 \n$\n2,780 \n(1.1)\n%\n48.8 \n%\n + Provision for income taxes\n1,170 \n1,159 \n638 \n0.9 \n81.7 \n + Net interest expense\n411 \n502 \n478 \n(18.1)\n5.0 \nEBIT\n$\n5,672 \n$\n5,799 \n$\n3,896 \n(2.2)\n%\n48.8 \n%\n + Total depreciation and amortization \n(b)\n2,981 \n2,801 \n2,700 \n6.4 \n3.8 \nEBITDA\n$\n8,653 \n$\n8,600 \n$\n6,596 \n0.6 \n%\n30.4 \n%\n(a)\n2023 consisted of 53 weeks compared with 52 weeks in 2024 and 2022.\n(b)\nRepresents total depreciation and amortization, including amounts classified within Depreciation and Amortization and within Cost of Sales.\nTARGET CORPORATION\n2024 Form 10-K\n30\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nRECONCILIATION OF NON-GAAP FINANCIAL MEASURES\nIndex to Financial Statements\nWe have also disclosed after-tax ROIC, which is a ratio based on GAAP information, with the exception of the add-back of operating lease interest to operating income. We believe this metric is useful in assessing the effectiveness of our capital allocation over time. Other companies may calculate ROIC differently, limiting the usefulness of the measure for comparisons with other companies.\nAfter-Tax Return on Invested Capital \n(dollars in millions)\nTrailing Twelve Months\nNumerator\nFebruary 1, 2025\nFebruary 3, 2024 \n(a)\nOperating income\n$\n5,566 \n$\n5,707 \n + Net other income\n106 \n92 \nEBIT\n5,672 \n5,799 \n + Operating lease interest \n(b)\n159 \n120 \n - Income taxes \n(c)\n1,297 \n1,295 \nNet operating profit after taxes\n$\n4,534\n \n$\n4,624\n \nDenominator\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nCurrent portion of long-term debt and other borrowings\n$\n1,636 \n$\n1,116 \n$\n130 \n + Noncurrent portion of long-term debt\n14,304 \n14,922 \n16,009 \n + Shareholders' investment\n14,666 \n13,432 \n11,232 \n + Operating lease liabilities \n(d)\n3,935 \n3,608 \n2,934 \n - Cash and cash equivalents\n4,762 \n3,805 \n2,229 \nInvested capital\n$\n29,779 \n$\n29,273 \n$\n28,076 \nAverage invested capital \n(e)\n$\n29,526\n \n$\n28,674\n \nAfter-tax return on invested capital\n15.4\n \n%\n16.1\n \n%\n(a)\nConsisted of 53 weeks.\n(b)\nRepresents the add-back to operating income driven by the hypothetical interest expense we would incur if the property under our operating leases were owned or accounted for as finance leases. Calculated using the discount rate for each lease and recorded as a component of rent expense within Operating Income. Operating lease interest is added back to Operating Income in the ROIC calculation to control for differences in capital structure between us and our competitors.\n(c)\nCalculated using the effective tax rates, which were 22.2 percent and 21.9 percent for the trailing twelve months ended February 1, 2025, and February 3, 2024, respectively. Includes tax effect of $1.3 billion related to EBIT for each of the trailing twelve month periods ended February 1, 2025, and February 3, 2024, and $35 million and $26 million, respectively, related to operating lease interest.\n(d)\nTotal short-term and long-term operating lease liabilities included within Accrued and Other Current Liabilities and Noncurrent Operating Lease Liabilities.\n(e)\nAverage based on the invested capital at the end of the current period and the invested capital at the end of the comparable prior period.\nTARGET CORPORATION\n2024 Form 10-K\n31\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF FINANCIAL CONDITION\nIndex to Financial Statements\nAnalysis of Financial Condition\nLiquidity and Capital Resources\nCapital Allocation\nWe follow a disciplined and balanced approach to capital allocation based on the following priorities, ranked in order of importance: first, we fully invest in opportunities to profitably grow our business, create sustainable long-term value, and maintain our current operations and assets; second, we maintain a competitive quarterly dividend and seek to grow it annually; and finally, we return any excess cash to shareholders by repurchasing shares within the limits of our credit rating goals.\nOur year-end cash and cash equivalents balance increased to $4.8 billion from $3.8 billion in 2023. Our cash and cash equivalents balance includes short-term investments of $3.9 billion and $2.9 billion as of February 1, 2025, and February 3, 2024, respectively. Our investment policy is designed to preserve principal and liquidity of our short-term investments. This policy allows investments in large money market funds or in highly rated direct short-term instruments that mature in 60 days or less. We also place dollar limits on our investments in individual funds or instruments.\nOperating Cash Flows\nCash flows provided by operating activities were $7.4 billion in 2024 compared with $8.6 billion in 2023. The operating cash flow decrease is primarily due to higher income tax payments and the combined impact of inventory and accounts payable activity.\nInventory\nYear-end inventory was $12.7 billion in 2024, compared with $11.9 billion in 2023. The increase in inventory levels reflects \n•\nearlier inventory receipts compared to the prior year, including to support merchandising strategies; and\n•\ninventory investments in select merchandise categories to support sales growth and an improved in-stock position.\nTARGET CORPORATION\n2024 Form 10-K\n32\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF FINANCIAL CONDITION\nIndex to Financial Statements\nCapital Expenditures\nNote:  Amounts may not foot due to rounding.\nCapital expenditures in 2024 reflect investments in our strategic initiatives, including investments in both stores and in our supply chain, enhancing our capabilities and guest experience across stores and digital channels. The decrease in capital expenditures in 2024 compared with 2023 primarily reflects a slowdown in store remodel activities.\nWe expect capital expenditures in 2025 of approximately $4 billion to $5 billion, with the majority focused on store assets, including both new stores and remodels, as well as continued investment in supply chain and technology projects. We expect to open about 20 new stores during 2025 and to resume a faster pace of remodel activities compared with 2024. \nDividends\nWe paid dividends totaling $2.0 billion ($4.44 per share) in 2024 and $2.0 billion ($4.36 per share) in 2023, a per share increase of 1.8 percent. We declared dividends totaling $2.1 billion ($4.46 per share) in 2024 and $2.1 billion ($4.38 per share) in 2023, a per share increase of 1.8 percent. We have paid dividends every quarter since our 1967 initial public offering, and it is our intent to continue to do so in the future.\nShare Repurchases\nDuring 2024, we deployed $1.0 billion to repurchase shares. We did not repurchase any shares during 2023. See \nPart II\n, \nItem 5\n, \nMarket for the Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\n of this Annual Report on Form 10-K and \nNote 20\n to the Financial Statements for more information.\nTARGET CORPORATION\n2024 Form 10-K\n33\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF FINANCIAL CONDITION\nIndex to Financial Statements\nFinancing\nOur financing strategy is to ensure liquidity and access to capital markets, to maintain a balanced spectrum of debt maturities, and to manage our net exposure to floating interest rate volatility. Within these parameters, we seek to minimize our borrowing costs. Our ability to access the long-term debt and commercial paper markets has provided us with ample sources of liquidity. Our continued access to these markets depends on multiple factors, including the condition of debt capital markets, our operating performance, and maintaining strong credit ratings. As of February 1, 2025, our credit ratings were as follows:\nCredit Ratings\nMoody's\nStandard and Poor's\nFitch\nLong-term debt\nA2\nA\nA\nCommercial paper\nP-1\nA-1\nF1\nIf our credit ratings were lowered, our ability to access the debt markets, our cost of funds, and other terms for new debt issuances could be adversely impacted. Each of the credit rating agencies reviews its rating periodically, and there is no guarantee our current credit ratings will remain the same as described above.\nWe have the ability to obtain short-term financing from time to time under our commercial paper program and credit facilities. In October 2024, we obtained a new committed $1.0 billion 364-day unsecured revolving credit facility that will expire in October 2025 and terminated our prior 364-day credit facility. This credit facility and our $3.0 billion unsecured revolving credit facility that will expire in October 2028 provide a liquidity backstop to our commercial paper program. No balances were outstanding under either credit facility at any time during 2024 or 2023. We did not have any balances outstanding under our commercial paper program as of February 1, 2025 or February 3, 2024.\nMost of our long-term debt obligations contain covenants related to secured debt levels. In addition to a secured debt level covenant, our credit facilities also contain a debt leverage covenant. We are, and expect to remain, in compliance with these covenants. Additionally, as of February 1, 2025, no notes or debentures contained provisions requiring acceleration of payment upon a credit rating downgrade, except that certain outstanding notes allow the note holders to put the notes to us if within a matter of months of each other we experience both (i) a change in control and (ii) our long-term credit ratings are either reduced and the resulting rating is non-investment grade, or our long-term credit ratings are placed on watch for possible reduction and those ratings are subsequently reduced and the resulting rating is non-investment grade.\nNote 15\n to the Financial Statements provides additional information.\nFuture Cash Requirements\nWe enter into contractual obligations in the ordinary course of business that may require future cash payments. Such obligations include, but are not limited to, purchase commitments, debt service, leasing arrangements, and liabilities related to deferred compensation and pensions. The \nNotes to the Consolidated Financial Statements\n provide additional information. \nWe believe our sources of liquidity, namely operating cash flows, credit facility capacity, and access to capital markets, will continue to be adequate to meet our contractual obligations, working capital and capital expenditure requirements, finance anticipated expansion and strategic initiatives, fund debt maturities, pay dividends, and execute purchases under our share repurchase program for the foreseeable future.\nCritical Accounting Estimates\nOur consolidated financial statements are prepared in accordance with GAAP, which requires us to make estimates and apply judgments that affect the reported amounts. In the \nNotes to the Consolidated Financial Statements\n, we describe the significant accounting policies used in preparing the consolidated financial statements. Our management has discussed the\n development, selection, and disclosure of our critical accounting estimates with the Audit & Risk Committee of our Board \nof Directors. The following items require significant estimation or judgment:\nTARGET CORPORATION\n2024 Form 10-K\n34\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF FINANCIAL CONDITION\nIndex to Financial Statements\nInventory and cost of sales:\n    The vast majority of our inventory is accounted for under the retail inventory accounting method using the last-in, first-out method (LIFO). Our inventory is valued at the lower of LIFO cost or market. We reduce inventory for estimated losses related to shrink and markdowns. Our shrink estimate is based on historical losses and is adjusted to reflect results of actual physical inventory counts. We generally perform counts at each location annually, with counts taking place throughout the year. A 10 percent increase or decrease in our 2024 year-end inventory shrink reserve would impact our cost of sales by approximately $150 million. Historically, our actual physical inventory count results have shown our estimates to be reasonably accurate. Market adjustments for markdowns are recorded when the salability of the merchandise has diminished. Salability can be impacted by consumer preferences and seasonality, among other factors. We believe the risk of inventory obsolescence is largely mitigated because our inventory typically turns in less than three months. Inventory was $12.7 billion and $11.9 billion as of February 1, 2025, and February 3, 2024, respectively, and is further described in \nNote 8\n to the Financial Statements.\nVendor income:\n    We receive various forms of consideration from our vendors (vendor income), principally earned as a result of volume rebates, promotions, advertising allowances, and markdown allowances. Vendor income is recorded as a reduction of cost of sales except in arrangements where the payment is a reimbursement of specific, incremental, and identifiable costs and recorded as an offset to those costs. Vendor income earned can vary based on a number of factors, including purchase volumes, sales volumes, and our pricing and promotion strategies.\nWe establish a receivable for vendor income that is earned but not yet received. Based on historical trending and data, this receivable is computed by forecasting vendor income collections and estimating the amount earned. The majority of the year-end vendor income receivables are collected within the following fiscal quarter, and we do not believe there is a reasonable likelihood that the assumptions used in our estimate will change significantly. Historically, adjustments to our vendor income receivable have not been material. Vendor income receivable was $543 million and $513 million as of February 1, 2025, and February 3, 2024, respectively. Vendor income is described further in \nNote 4\n to the Financial Statements.\nLong-lived assets:\n    Long-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable. The evaluation is performed primarily at the store level. An impairment loss is recognized when estimated undiscounted future cash flows from the operation and/or eventual disposition of the asset or asset group are less than its carrying amount, and is measured as the excess of its carrying amount over fair value. We estimate fair value by obtaining market appraisals, obtaining valuations from third-party brokers, or using other valuation techniques. We recorded impairments of $68 million, $102 million, and $66 million in 2024, 2023, and 2022, respectively, which are described further in \nNote 10\n to the Financial Statements.\nInsurance/self-insurance:\n    We retain a substantial portion of the risk related to certain general liability, workers' compensation, property loss, and team member medical and dental claims. However, we maintain stop-loss coverage to limit the exposure related to certain risks. Liabilities associated with these losses include estimates of both claims filed and losses incurred but not yet reported. We use actuarial methods which consider a number of factors to estimate our ultimate cost of losses. General liability and workers' compensation liabilities are recorded based on our estimate of their net present value; other liabilities referred to above are not discounted. Our workers' compensation and general liability accrual was $772 million and $650 million as of February 1, 2025, and February 3, 2024, respectively. We believe that the amounts accrued are appropriate; however, our liabilities could be significantly affected if future occurrences or loss developments differ from our assumptions. For example, a 10 percent increase or decrease in average claim costs would have impacted our self-insurance expense by $77 million in 2024. Historically, adjustments to our estimates have not been material. Refer to \nPart II\n, \nItem 7A\n, \nQuantitative and Qualitative Disclosures About Market Risk\n, for further disclosure of the market risks associated with these exposures. We maintain insurance coverage to limit our exposure to certain events, including network security matters. \nTARGET CORPORATION\n2024 Form 10-K\n35\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF FINANCIAL CONDITION & NEW ACCOUNTING PRONOUNCEMENTS\nIndex to Financial Statements\nIncome taxes:\n    We pay income taxes based on the tax statutes, regulations, and case law of the various jurisdictions in which we operate. Significant judgment is required in determining the timing and amounts of deductible and taxable items, and in evaluating the ultimate resolution of tax matters in dispute with tax authorities. The benefits of uncertain tax positions are recorded in our financial statements only after determining it is more likely than not the uncertain tax positions would withstand challenge by taxing authorities. We periodically reassess these probabilities and record any changes in the financial statements as appropriate. Gross uncertain tax positions, including interest and penalties, were $454 million and $366 million as of February 1, 2025, and February 3, 2024, respectively. Although we believe our tax positions are reasonable, the resolution of these matters could be materially different from our assumptions, which would affect our consolidated results of operations and/or operating cash flows. Income taxes are described further in \nNote 18\n to the Financial Statements.\nPension accounting:\n    We maintain a funded qualified defined benefit pension plan, as well as nonqualified and international pension plans that are generally unfunded, for certain current and former team members. The costs for these plans are determined based on actuarial calculations using the assumptions described in the following paragraphs. Eligibility and the level of benefits vary depending on each team member's full-time or part-time status, date of hire, age, length of service, and/or compensation. The benefit obligation and related expense for these plans are determined based on actuarial calculations using assumptions about the expected long-term rate of return, the discount rate, compensation growth rates, mortality, and retirement age. These assumptions, with adjustments made for any significant plan or participant changes, are used to determine the period-end benefit obligation and establish expense for the next year.\nOur 2024 expected long-term rate of return on plan assets of 7.00 percent was determined by the portfolio composition, historical long-term investment performance, and current market conditions. A 1 percentage point decrease in our expected long-term rate of return would increase annual expense by $40 million.\nThe discount rate used to determine benefit obligations is adjusted annually based on the interest rate for long-term high-quality corporate bonds, using yields for maturities that are in line with the duration of our pension liabilities. Our benefit obligation and related expense will fluctuate with changes in interest rates. A 1 percentage point decrease in the weighted average discount rate would increase annual expense by $33 million.\nBased on our experience, we use a graduated compensation growth schedule that assumes higher compensation growth for younger, shorter-service pension-eligible team members than it does for older, longer-service pension-eligible team members.\nPension benefits are further described in \nNote 23\n to the Financial Statements.\nLegal and other contingencies:\n    We believe the accruals recorded in our consolidated financial statements properly reflect loss exposures that are both probable and reasonably estimable. We do not believe any of the currently identified claims or litigation will materially affect our results of operations, cash flows, or financial condition. However, litigation is subject to inherent uncertainties, and unfavorable rulings could occur. If an unfavorable ruling were to occur, it may cause a material adverse impact on the results of operations, cash flows, or financial condition for the period in which the ruling occurs, or future periods. Refer to \nNote 14\n to the Financial Statements for further information on contingencies.\nNew Accounting Pronouncements\nWe do not expect that any recently issued accounting pronouncements will have a material effect on our financial statements.\nTARGET CORPORATION\n2024 Form 10-K\n36\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nFORWARD LOOKING STATEMENTS & QUANTITATIVE AND QUALITATIVE DISCLOSURES\nIndex to Financial Statements\nForward-Looking Statements\nThis report contains forward-looking statements, which are based on our current assumptions and expectations. These statements are typically accompanied by the words \"aim,\" \"anticipate,\" \"believe,\" \"could,\" \"expect,\" \"may,\" \"might,\" \"seek,\" \"will,\" \"would,\" or similar words. The principal forward-looking statements in this report include statements regarding: our future financial and operational performance, our strategy for growth, the adequacy of and costs associated with our sources of liquidity, the funding of debt maturities, the execution of our share repurchase program, our expected capital expenditures and new lease commitments, the expected compliance with debt covenants, the expected impact of new accounting pronouncements, our intentions regarding future dividends, the expected contributions and payments related to our pension plan, the expected return on plan assets, the expected timing and recognition of compensation expenses, the adequacy of our reserves for general liability, workers' compensation, and property loss, the expected outcome of, and adequacy of our reserves for, claims, litigation, and the resolution of tax matters, our expectations regarding our contractual obligations, liabilities, and vendor income, the expected ability to recognize deferred tax assets and liabilities and the timing of such recognition, our expectations regarding arrangements with our partners, and changes in our assumptions and expectations.\nAll such forward-looking statements are intended to enjoy the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995, as amended. Although we believe there is a reasonable basis for the forward-looking statements, our actual results could be materially different. The most important factors which could cause our actual results to differ from our forward-looking statements are set forth in our description of risk factors included in \nPart I\n,",
    "item1a": "Item 1A\n, \nRisk Factors\n to this Form 10-K, which should be read in conjunction with the forward-looking statements in this report. Forward-looking statements speak only as of the date they are made, and we do not undertake any obligation to update any forward-looking statement.\nItem 7A.    Quantitative and Qualitative Disclosures About Market Risk\nAs of February 1, 2025, our exposure to market risk was primarily from interest rate changes on our debt obligations and short-term investments. Our interest rate exposure is primarily due to differences between our floating rate debt obligations, including fixed rate debt hedged using floating rate interest rate swaps, compared to our floating rate short-term investments. As of February 1, 2025, our floating rate short-term investments exceeded our floating rate debt obligations by approximately $1.7 billion. Based on our financial position as of February 1, 2025, the annualized effect of a 1 percentage point increase in floating interest rates on our floating rate short-term investments, net of our floating rate debt obligations, would increase our earnings before income taxes by $17 million. In general, we expect our floating rate debt obligations to be in line with our floating rate short-term investments over time, but that may vary in different interest rate and economic environments. See further description of our debt and derivative instruments in Notes \n15\n and \n16\n to the Financial Statements.\nWe record our general liability and workers' compensation liabilities at net present value; therefore, these liabilities fluctuate with changes in interest rates. Based on our balance sheet position as of February 1, 2025, the annualized effect of a 1 percentage point increase/(decrease) in interest rates would increase/(decrease) earnings before income taxes by $17 million.\nIn addition, we are exposed to market return fluctuations on our qualified defined benefit pension plan. The value of our pension liabilities is inversely related to changes in interest rates. A 1 percentage point decrease in the weighted average discount rate would increase annual expense by $33 million. To protect against declines in interest rates, we hold high-quality, long-duration bonds and derivative instruments in our pension plan trust. As of February 1, 2025, we had hedged 70 percent of the interest rate exposure of our plan liabilities.\nAs more fully described in \nNote 22\n to the Financial Statements, we are exposed to market returns on accumulated team member balances in our nonqualified, unfunded deferred compensation plans. We control the risk of offering the nonqualified plans by making investments in life insurance contracts and prepaid forward contracts on our own common stock that substantially offset our economic exposure to the returns on these plans.\nThere have been no other material changes in our primary risk exposures or management of market risks since the prior year.\nTARGET CORPORATION\n2024 Form 10-K\n37\nFINANCIAL STATEMENTS\nTable of Contents\nINDEX\nIndex to Financial Statements\nItem 8.   Financial Statements and Supplementary Data\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReports of \nManagement and \nIndependent Registered Public Accounting Firm\n39\nConsolidated Statements of Operations\n42\nConsolidated Statements of Comprehensive Income\n43\nConsolidated Statements of Financial Position\n44\nConsolidated Statements of Cash Flows\n45\nConsolidated Statements of Shareholders' Investment\n46\nNotes to Consolidated Financial Statements\n47\nNote 1\nSummary of Accounting Policies\n47\nNote 2\nNet \nS\nales\n48\nNote 3\nCost of Sales and Selling, General, and Administrative Expenses\n49\nNote 4\nConsideration Received from Vendors\n50\nNote 5\nAdvertising Costs\n50\nNote 6\nFair Value Measurements\n50\nNote 7\nCash and Cash Equivalents\n51\nNote 8\nInventory\n51\nNote 9\nOther Current Assets\n52\nNote 10\nProperty and Equipment\n52\nNote 11\nOther Noncurrent Assets\n52\nNote 12\nSupplier Finance Programs\n53\nNote 13\nAccrued and Other Current Liabilities\n53\nNote 14\nCommitments and Contingencies\n54\nNote 15\nCommercial Paper and Long-Term Debt\n55\nNote 16\nDerivative Financial Instruments\n55\nNote 17\nLeases\n56\nNote 18\nIncome Taxes\n59\nNote 19\nOther Noncurrent Liabilities\n61\nNote 20\nShare Repurchase\n61\nNote 21\nShare-Based Compensation\n61\nNote 22\nDefined Contribution Plans\n63\nNote 23\nPension Plans\n63\nNote 24\nAccumulated Other Comprehensive Loss\n67\nNote 25\nSegment Reporting\n68\nTARGET CORPORATION\n2024 Form 10-K\n38\nFINANCIAL STATEMENTS\nTable of Contents\nREPORTS\nIndex to Financial Statements\nReport of Management on the Consolidated Financial Statements\nManagement is responsible for the consistency, integrity, and presentation of the information in the Annual Report. The consolidated financial statements and other information presented in this Annual Report have been prepared in accordance with accounting principles generally accepted in the United States and include necessary judgments and estimates by management.\nTo fulfill our responsibility, we maintain comprehensive systems of internal control designed to provide reasonable assurance that assets are safeguarded and transactions are executed in accordance with established procedures. The concept of reasonable assurance is based upon recognition that the cost of the controls should not exceed the benefit derived. We believe our systems of internal control provide this reasonable assurance.\nThe Board of Directors exercised its oversight role with respect to the Corporation's systems of internal control primarily through its Audit & Risk Committee, which is comprised of independent directors. The Committee oversees the Corporation's systems of internal control, accounting practices, financial reporting and audits to assess whether their quality, integrity, and objectivity are sufficient to protect shareholders' investments.\nIn addition, our consolidated financial statements have been audited by Ernst & Young LLP, independent registered public accounting firm, whose report also appears on this page.\n/s/ Brian C. Cornell\n \n/s/ Jim Lee\nBrian C. Cornell\nChair of the Board and Chief Executive Officer\nMarch 12, 2025\n \nJim Lee\nExecutive Vice President and Chief Financial Officer\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Target Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated statements of financial position of Target Corporation (the Corporation) as of February 1, 2025 and February 3, 2024, the related consolidated statements of operations, comprehensive income, shareholders' investment and cash flows for each of the three years in the period ended February 1, 2025, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Corporation at February 1, 2025 and February 3, 2024, and the results of its operations and its cash flows for each of the three years in the period ended February 1, 2025, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Corporation's internal control over financial reporting as of February 1, 2025, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated March 12, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Corporation's management. Our responsibility is to express an opinion on the Corporation’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Corporation in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nTARGET CORPORATION\n2024 Form 10-K\n39\nFINANCIAL STATEMENTS\nTable of Contents\nREPORTS\nIndex to Financial Statements\nValuation of Vendor Income Receivable\nDescription of the Matter\nAt February 1, 2025, the Corporation’s vendor income receivable totaled $543 million. As discussed in Note 4 of the consolidated financial statements, the Corporation receives consideration for a variety of vendor-sponsored programs, which are primarily recorded as a reduction of cost of sales when earned. The Corporation records a receivable for amounts earned but not yet received.\nAuditing the Corporation's calculation of vendor income receivable was especially challenging due to the inputs required in the vendor receivable model, which include, among others, forecasted vendor income collections and the time period over which the collections have been earned. As a result of the high volume of transactions processed by the Corporation and used in estimating these inputs, auditing the vendor income receivable requires extensive audit effort to address the completeness and accuracy of the information used in the receivable model.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Corporation’s vendor income receivable process, including controls over the inputs described above.\nTo test the estimated vendor income receivable, we performed audit procedures that included, among others, testing the completeness and accuracy of inputs used in the receivable model by verifying for a sample of the vendor-sponsored programs, the nature and source of the inputs used and the terms of the contractual agreements. We recalculated the amount of the vendor income earned based on the inputs and the terms of the contractual agreements. In addition, we recalculated the time period over which the vendor income collections had been earned to assess the accuracy of management’s inputs used in the model. We also performed sensitivity analyses of inputs to evaluate the significance of changes in the receivable that would result from changes to the inputs. Finally, we performed audit procedures over the vendor income collections subsequent to the balance sheet date to support the vendor income receivable at year end.\n/s/ Ernst & Young LLP\nWe have served as the Corporation's auditor since 1931.\nMinneapolis, Minnesota\nMarch 12, 2025\nTARGET CORPORATION\n2024 Form 10-K\n40\nFINANCIAL STATEMENTS\nTable of Contents\nREPORTS\nIndex to Financial Statements\nReport of Management on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f). Under the supervision and with the participation of our management, including our chief executive officer and chief financial officer, we assessed the effectiveness of our internal control over financial reporting as of February 1, 2025, based on the framework in \nInternal Control—Integrated Framework (2013)\n, issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework). Based on our assessment, we conclude that the Corporation's internal control over financial reporting is effective based on those criteria.\nOur internal control over financial reporting as of February 1, 2025, has been audited by Ernst & Young LLP, the independent registered public accounting firm who has also audited our consolidated financial statements, as stated in their report which appears on this page.\n/s/ Brian C. Cornell\n \n/s/ Jim Lee\nBrian C. Cornell\nChair of the Board and Chief Executive Officer\nMarch 12, 2025\n \nJim Lee\nExecutive Vice President and Chief Financial Officer\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Target Corporation\nOpinion on Internal Control Over Financial Reporting\nWe have audited Target Corporation’s internal control over financial reporting as of February 1, 2025, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Target Corporation (the Corporation) maintained, in all material respects, effective internal control over financial reporting as of February 1, 2025, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated statements of financial position of the Corporation as of February 1, 2025 and February 3, 2024, the related consolidated statements of operations, comprehensive income, shareholders' investment and cash flows for each of the three years in the period ended February 1, 2025, and the related notes and our report dated March 12, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Corporation’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Report of Management on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Corporation's internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Corporation in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ \nErnst & Young LLP\n \nMinneapolis, Minnesota\nMarch 12, 2025\nTARGET CORPORATION\n2024 Form 10-K\n41\nFINANCIAL STATEMENTS\nTable of Contents\nIndex to Financial Statements\nConsolidated Statements of Operations\n(millions, except per share data)\n2024\n2023\n2022\nNet sales\n$\n106,566\n \n$\n107,412\n \n$\n109,120\n \nCost of sales\n76,502\n \n77,828\n \n82,306\n \nSelling, general, and administrative expenses\n21,969\n \n21,462\n \n20,581\n \nDepreciation and amortization (exclusive of depreciation included in cost of sales)\n2,529\n \n2,415\n \n2,385\n \nOperating income\n5,566\n \n5,707\n \n3,848\n \nNet interest expense\n411\n \n502\n \n478\n \nNet other income\n(\n106\n)\n(\n92\n)\n(\n48\n)\nEarnings before income taxes\n5,261\n \n5,297\n \n3,418\n \nProvision for income taxes\n1,170\n \n1,159\n \n638\n \nNet earnings\n$\n4,091\n \n$\n4,138\n \n$\n2,780\n \nBasic earnings per share\n$\n8.89\n \n$\n8.96\n \n$\n6.02\n \nDiluted earnings per share\n$\n8.86\n \n$\n8.94\n \n$\n5.98\n \nWeighted average common shares outstanding\n \n \n \nBasic\n460.4\n \n461.5\n \n462.1\n \nDiluted\n461.8\n \n462.8\n \n464.7\n \nAntidilutive shares\n0.5\n \n2.1\n \n1.1\n \nNote:  2023 consisted of 53 weeks compared with 52 weeks in 2024 and 2022.\nSee accompanying \nNotes to Consolidated Financial Statements\n.\nTARGET CORPORATION\n2024 Form 10-K\n42\nFINANCIAL STATEMENTS\nTable of Contents\nIndex to Financial Statements\nConsolidated Statements of Comprehensive Income\n(millions) \n2024\n2023\n2022\nNet earnings\n$\n4,091\n \n$\n4,138\n \n$\n2,780\n \nOther comprehensive income / (loss), net of tax\n \n \n \nPension benefit liabilities \n22\n \n(\n23\n)\n(\n113\n)\nCurrency translation adjustment and cash flow hedges\n(\n20\n)\n(\n18\n)\n247\n \nOther comprehensive income / (loss)\n2\n \n(\n41\n)\n134\n \nComprehensive income\n \n$\n4,093\n \n$\n4,097\n \n$\n2,914\n \nNote:  2023 consisted of 53 weeks compared with 52 weeks in 2024 and 2022.\nSee accompanying \nNotes to Consolidated Financial Statements\n.\nTARGET CORPORATION\n2024 Form 10-K\n43\nFINANCIAL STATEMENTS\nTable of Contents\nIndex to Financial Statements\nConsolidated Statements of Financial Position\n(millions, except footnotes)\nFebruary 1, 2025\nFebruary 3, 2024\nAssets\n \n \nCash and cash equivalents\n$\n4,762\n \n$\n3,805\n \nInventory\n12,740\n \n11,886\n \nOther current assets\n1,952\n \n1,807\n \nTotal current assets\n19,454\n \n17,498\n \nProperty and equipment\n \n \nLand\n6,735\n \n6,547\n \nBuildings and improvements\n38,752\n \n37,066\n \nFixtures and equipment\n8,917\n \n8,765\n \nComputer hardware and software\n3,710\n \n3,428\n \nConstruction-in-progress\n1,185\n \n1,703\n \nAccumulated depreciation\n(\n26,277\n)\n(\n24,413\n)\nProperty and equipment, net\n33,022\n \n33,096\n \nOperating lease assets\n3,763\n \n3,362\n \nOther noncurrent assets\n1,530\n \n1,400\n \nTotal assets\n$\n57,769\n \n$\n55,356\n \nLiabilities and shareholders' investment\n \n \nAccounts payable\n$\n13,053\n \n$\n12,098\n \nAccrued and other current liabilities\n6,110\n \n6,090\n \nCurrent portion of long-term debt and other borrowings\n1,636\n \n1,116\n \nTotal current liabilities\n20,799\n \n19,304\n \nLong-term debt and other borrowings\n14,304\n \n14,922\n \nNoncurrent operating lease liabilities\n3,582\n \n3,279\n \nDeferred income taxes\n2,303\n \n2,480\n \nOther noncurrent liabilities\n2,115\n \n1,939\n \nTotal noncurrent liabilities\n22,304\n \n22,620\n \nShareholders' investment\n \n \nCommon stock\n38\n \n38\n \nAdditional paid-in capital\n6,996\n \n6,761\n \nRetained earnings\n8,090\n \n7,093\n \nAccumulated other comprehensive loss\n(\n458\n)\n(\n460\n)\nTotal shareholders' investment\n14,666\n \n13,432\n \nTotal liabilities and shareholders' investment\n$\n57,769\n \n$\n55,356\n \nCommon Stock\n Authorized \n6,000,000,000\n shares, $\n0.0833\n par value; \n455,566,995\n shares issued and outstanding as of February 1, 2025; \n461,675,441\n shares issued and outstanding as of February 3, 2024.\nPreferred Stock\n Authorized \n5,000,000\n shares, $\n0.01\n par value; \nno\n shares were issued or outstanding during any period presented.\nSee accompanying \nNotes to Consolidated Financial Statements\n.\nTARGET CORPORATION\n2024 Form 10-K\n44\nFINANCIAL STATEMENTS\nTable of Contents\nIndex to Financial Statements\nConsolidated Statements of Cash Flows\n(millions)\n2024\n2023\n2022\nOperating activities\n \n \n \nNet earnings \n$\n4,091\n \n$\n4,138\n \n$\n2,780\n \nAdjustments to reconcile net earnings to cash provided by operations:\n \n \n \nDepreciation and amortization\n2,981\n \n2,801\n \n2,700\n \nShare-based compensation expense\n304\n \n251\n \n220\n \nDeferred income taxes\n(\n180\n)\n298\n \n582\n \nNoncash losses / (gains) and other, net\n26\n \n94\n \n172\n \nChanges in operating accounts:\n \n \n \nInventory\n(\n854\n)\n1,613\n \n403\n \nOther assets\n(\n308\n)\n(\n85\n)\n22\n \nAccounts payable\n1,008\n \n(\n1,216\n)\n(\n2,237\n)\nAccrued and other liabilities\n299\n \n727\n \n(\n624\n)\nCash provided by operating activities\n7,367\n \n8,621\n \n4,018\n \nInvesting activities\n \n \n \nExpenditures for property and equipment\n(\n2,891\n)\n(\n4,806\n)\n(\n5,528\n)\nProceeds from disposal of property and equipment\n3\n \n24\n \n8\n \nOther investments\n28\n \n22\n \n16\n \nCash required for investing activities\n(\n2,860\n)\n(\n4,760\n)\n(\n5,504\n)\nFinancing activities\n \n \n \nAdditions to long-term debt\n741\n \n—\n \n2,625\n \nReductions of long-term debt\n(\n1,139\n)\n(\n147\n)\n(\n163\n)\nDividends paid\n(\n2,046\n)\n(\n2,011\n)\n(\n1,836\n)\nRepurchase of stock\n(\n1,007\n)\n—\n \n(\n2,646\n)\nShares withheld for taxes on share-based compensation\n(\n99\n)\n(\n127\n)\n(\n180\n)\nStock option exercises\n—\n \n—\n \n4\n \nCash required for financing activities\n(\n3,550\n)\n(\n2,285\n)\n(\n2,196\n)\nNet increase / (decrease) in cash and cash equivalents\n957\n \n1,576\n \n(\n3,682\n)\nCash and cash equivalents at beginning of period \n3,805\n \n2,229\n \n5,911\n \nCash and cash equivalents at end of period\n$\n4,762\n \n$\n3,805\n \n$\n2,229\n \nSupplemental information\n \n \n \nInterest paid, net of capitalized interest\n$\n615\n \n$\n605\n \n$\n449\n \nIncome taxes paid\n1,055\n \n374\n \n213\n \nLeased assets obtained in exchange for new finance lease liabilities\n319\n \n104\n \n224\n \nLeased assets obtained in exchange for new operating lease liabilities\n758\n \n1,027\n \n329\n \nNote:  2023 consisted of 53 weeks compared with 52 weeks in 2024 and 2022.\nSee accompanying \nNotes to Consolidated Financial Statements\n.\nTARGET CORPORATION\n2024 Form 10-K\n45\nFINANCIAL STATEMENTS\nTable of Contents\nIndex to Financial Statements\nConsolidated Statements of Shareholders' Investment\n(millions)\nCommon\nStock\nShares\nStock\nPar\nValue\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nAccumulated Other\nComprehensive\nLoss\nTotal\nJanuary 29, 2022\n471.3\n \n$\n39\n \n$\n6,421\n \n$\n6,920\n \n$\n(\n553\n)\n$\n12,827\n \nNet earnings\n— \n— \n— \n2,780\n \n— \n2,780\n \nOther comprehensive income\n— \n— \n— \n— \n134\n \n134\n \nDividends declared\n— \n— \n— \n(\n1,931\n)\n— \n(\n1,931\n)\nRepurchase of stock\n(\n12.5\n)\n(\n1\n)\n119\n \n(\n2,764\n)\n— \n(\n2,646\n)\nShare-based compensation\n1.5\n \n— \n68\n \n— \n— \n68\n \nJanuary 28, 2023\n460.3\n \n$\n38\n \n$\n6,608\n \n$\n5,005\n \n$\n(\n419\n)\n$\n11,232\n \nNet earnings\n— \n— \n— \n4,138\n \n— \n4,138\n \nOther comprehensive loss\n— \n— \n— \n— \n(\n41\n)\n(\n41\n)\nDividends declared\n— \n— \n— \n(\n2,050\n)\n— \n(\n2,050\n)\nShare-based compensation\n1.4\n \n— \n153\n \n— \n— \n153\n \nFebruary 3, 2024\n461.7\n \n$\n38\n \n$\n6,761\n \n$\n7,093\n \n$\n(\n460\n)\n$\n13,432\n \nNet earnings\n— \n— \n— \n4,091\n \n— \n4,091\n \nOther comprehensive income\n— \n— \n— \n— \n2\n \n2\n \nDividends declared\n— \n— \n— \n(\n2,080\n)\n— \n(\n2,080\n)\nRepurchase of stock\n(\n7.2\n)\n(\n1\n)\n— \n(\n1,014\n)\n— \n(\n1,015\n)\nShare-based compensation\n1.1\n \n1\n \n235\n \n— \n— \n236\n \nFebruary 1, 2025\n455.6\n \n$\n38\n \n$\n6,996\n \n$\n8,090\n \n$\n(\n458\n)\n$\n14,666\n \nWe declared $\n4.46\n, $\n4.38\n, and $\n4.14\n dividends per share for the twelve months ended February 1, 2025, February 3, 2024, and January 28, 2023, respectively.\nSee accompanying \nNotes to Consolidated Financial Statements\n.\nTARGET CORPORATION\n2024 Form 10-K\n46\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nNotes to Consolidated Financial Statements\n1. \nSummary of Accounting Policies\nOrganization - \nWe are a general merchandise retailer selling products to our guests through our stores and digital channels.\nWe operate as a single segment that includes all of our operations, which are designed to enable guests to purchase products seamlessly in stores or through our digital channels. Nearly all of our revenues are generated in the United States (U.S.). The vast majority of our long-lived assets are located within the U.S.\nConsolidation - \nThe consolidated financial statements include the balances of Target Corporation and its subsidiaries after elimination of intercompany balances and transactions. All subsidiaries are wholly owned.\n \nUse of estimates - \nThe preparation of our consolidated financial statements in conformity with U.S. generally accepted accounting principles (GAAP) requires management to make estimates and assumptions affecting reported amounts in the consolidated financial statements and accompanying notes. Actual results may differ significantly from those estimates.\nFiscal year - \nOur fiscal year ends on the Saturday nearest January 31. Unless otherwise stated, references to years in this report relate to fiscal years, rather than to calendar years. Fiscal 2024 ended February 1, 2025, and consisted of 52 weeks. Fiscal 2023 ended February 3, 2024, and consisted of 53 weeks. Fiscal 2022 ended January 28, 2023, and consisted of 52 weeks. Fiscal 2025 will end January 31, 2026, and will consist of 52 weeks.\nAccounting policies - \nOur accounting policies are disclosed in the applicable Notes to the Consolidated Financial Statements.\n \nTARGET CORPORATION\n2024 Form 10-K\n47\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\n2. Net Sales\nMerchandise sales represent the vast majority of our revenues. We also earn revenues from a variety of other sources, most notably advertising revenue and credit card profit-sharing income.\nNet Sales\n(millions)\n2024\n2023\n2022\nApparel and accessories \n(a)\n$\n16,505\n \n$\n16,485\n \n$\n17,646\n \nBeauty \n(b)\n13,173\n \n12,538\n \n11,092\n \nFood and beverage \n(c)\n23,828\n \n23,899\n \n22,918\n \nHardlines \n(d)\n15,784\n \n16,162\n \n17,739\n \nHome furnishings and décor \n(e)\n16,699\n \n17,760\n \n19,463\n \nHousehold essentials \n(f)\n18,614\n \n18,746\n \n18,483\n \nOther merchandise sales\n217\n \n213\n \n247\n \nMerchandise sales\n104,820\n \n105,803\n \n107,588\n \nAdvertising revenue \n649\n \n522\n \n404\n \nCredit card profit sharing\n576\n \n667\n \n734\n \nOther\n521\n \n420\n \n394\n \nNet sales\n$\n106,566\n \n$\n107,412\n \n$\n109,120\n \n(a)\nIncludes apparel for women, men, young adults, kids, toddlers, and babies, as well as jewelry, accessories, and shoes.\n(b)\nIncludes skin and bath care, cosmetics, hair care, oral care, deodorant, and shaving products.\n(c)\nIncludes dry and perishable grocery, including snacks, candy, beverages, deli, bakery, meat, produce, and food service (primarily Starbucks) in our stores.\n(d)\nIncludes electronics, including video games and consoles, toys, sporting goods, entertainment, and luggage.\n(e)\nIncludes bed and bath, home décor, school/office supplies, storage, small appliances, kitchenware, greeting cards, party supplies, furniture, lighting, home improvement, and seasonal merchandise.\n(f)\nIncludes household cleaning, paper products, over-the-counter healthcare, vitamins and supplements, baby gear, and pet supplies.\nMerchandise sales\n – We record almost all retail store revenues at the point of sale. Digitally originated sales may include shipping revenue and are recorded upon delivery to the guest or upon guest pickup at the store. Merchandise sales do not include sales tax because we are a pass-through conduit for collecting and remitting sales taxes. Generally, guests may return national brand merchandise within \n90\n days of purchase and owned and exclusive brand merchandise within \none year\n of purchase. Sales are recognized net of expected returns, which we estimate using historical return patterns and our expectation of future returns. As of February 1, 2025, and February 3, 2024, the liability for estimated returns was $\n172\n million and $\n170\n million, respectively.\nWe routinely enter into arrangements with vendors whereby we do not purchase or pay for merchandise until the merchandise is ultimately sold to a guest. Under the vast majority of these arrangements, which represent less than \n5\n percent of consolidated sales, we record revenue and related costs gross. We concluded that we are the principal in these transactions for a number of reasons, most notably because we 1) control the overall economics of the transactions, including setting the sales price and realizing the majority of cash flows from the sale, 2) control the relationship with the customer, and 3) are responsible for fulfilling the promise to provide goods to the customer. Merchandise received under these arrangements is not included in Inventory because the purchase and sale of this inventory are virtually simultaneous.\nRevenue from Target gift card sales is recognized upon gift card redemption, which is typically within one year of issuance. Our gift cards do not expire. Based on historical redemption rates, a small and relatively stable percentage of gift cards will never be redeemed, referred to as \"breakage.\" Estimated breakage revenue is recognized over time in proportion to actual gift card redemptions.\nTARGET CORPORATION\n2024 Form 10-K\n48\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nGift Card Liability Activity\n(millions)\nFebruary 3, 2024\nGift Cards \nIssued During\nCurrent Period\nBut Not\nRedeemed \n(b)\nRevenue\nRecognized\nFrom\nBeginning\nLiability\nFebruary 1, 2025\nGift card liability \n(a)\n$\n1,162\n \n$\n878\n \n$\n(\n831\n)\n$\n1,209\n \n(a)\nIncluded in Accrued and Other Current Liabilities.\n(b)\nNet of estimated breakage.\nGuests receive a \n5\n percent discount on nearly all purchases and receive free shipping at Target.com when they use their Target Debit Card, Target Credit Card, Target MasterCard or Target Circle Card Reloadable Account (collectively, Target Circle Cards). \nTarget Circle program members earn Target Circle Rewards on various transactions. As of February 1, 2025, and February 3, 2024, deferred revenue of $\n19\n million and $\n117\n million, respectively, related to our Target Circle program was included in Accrued and Other Current Liabilities.\nAdvertising revenue\n – Primarily represents revenue related to advertising services provided via our Roundel digital advertising business offering. Roundel services are classified as either Net Sales or as a reduction of Cost of Sales or Selling, General, and Administrative (SG&A) Expenses, depending on the nature of the advertising arrangement. Notes \n3\n and \n5\n provide additional information about items included in Cost of Sales and SG&A Expenses.\nCredit card profit sharing\n – We receive payments under a credit card program agreement with TD Bank Group (TD). Under the agreement, we receive a percentage of the profits generated by the Target Circle credit card receivables in exchange for performing account servicing and primary marketing functions. TD underwrites, funds, and owns Target Circle credit card receivables, controls risk management policies, and oversees regulatory compliance.\nOther\n – Includes commissions earned on third-party sales through our Target Plus third-party digital marketplace, Shipt membership and service revenues, rental income, Target Circle 360 membership revenue, and other miscellaneous revenues.\n3. \nCost of Sales and Selling, General, and Administrative Expenses\nThe following table illustrates the primary items classified in each major expense category:\nCost of Sales\nSelling, General, and Administrative Expenses\nMerchandising cost of sales, including \n•   Merchandise costs\n•   Payment term cash discounts\n•   Import costs\n•   Freight expenses associated with moving\n    merchandise from our vendors to and between our\n    distribution centers and our retail stores\n•   Vendor income that is not reimbursement of\n    specific, incremental, and identifiable costs\n•   Markdowns\n•   Inventory shrink\nSupply chain and digital fulfillment costs, including \n•   Compensation and benefits costs associated with\n    operating our supply chain facilities\n•   Outbound shipping expenses associated with sales to\n    our guests\n•   Compensation and benefit costs associated with \n    shipment of merchandise from stores \n•   Depreciation associated with supply chain facilities\nCompensation and benefit costs for stores and\n    headquarters, except ship from store costs classified\n    as cost of sales\nOccupancy and operating costs of retail and\n    headquarters facilities\nAdvertising, offset by vendor income that is a\n    reimbursement of specific, incremental, and\n    identifiable costs\nPre-opening and exit costs of stores and other facilities\nCredit cards servicing expenses\nCosts associated with accepting third-party bank issued\n    payment cards\nLitigation and defense costs and related insurance\n    recoveries\nOther administrative costs\nNote:  The classification of these expenses varies across the retail industry.\nTARGET CORPORATION\n2024 Form 10-K\n49\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nIn 2024, we reclassified certain expenses related to our advertising and third-party digital marketplace business offerings to conform to the current year presentation. The reclassifications increased Cost of Sales by $\n92\n million and $\n77\n million for 2023 and 2022, respectively, with equal and offsetting decreases to SG&A Expenses. These reclassifications had no impact on Net Sales, Operating Income, Net Earnings, or Earnings Per Share.\n4. \nConsideration Received from Vendors\nWe receive consideration for a variety of vendor-sponsored programs—such as volume rebates, promotions, certain advertising activities, markdown allowances, and for our compliance programs—referred to as \"vendor income.\" Additionally, under our compliance programs, vendors are charged for merchandise shipments that do not meet our requirements (violations), such as late or incomplete shipments. Vendor income is recorded as a reduction of Cost of Sales except in arrangements where the payment is a reimbursement of specific, incremental, and identifiable costs and recorded as an offset to those costs within SG&A Expenses.\nWe establish a receivable for vendor income that is earned but not yet received. Based on historical trending and data, this receivable is computed by forecasting vendor income collections and estimating the amount earned. The majority of year-end vendor income receivables are collected within the following fiscal quarter, and we do not believe there is a reasonable likelihood that the assumptions used in our estimate will change significantly.\n \nNote 9\n provides additional information.\n5\n. \nAdvertising Costs\nAdvertising costs consist primarily of digital advertisements and media broadcast. Digital advertising costs are generally expensed as incurred when the consumer engages with the advertisement through clicks or views, while media broadcast costs are generally expensed at first showing or distribution of the advertisement.\n Advertising costs, net of vendor reimbursements, are recorded in SG&A Expenses and were $\n1.5\n billion in 2024, $\n1.4\n billion in 2023, and $\n1.5\n billion in 2022.\n6. \nFair Value Measurements\nFair value measurements are reported in one of three levels based on the lowest level of significant input used: Level 1 (unadjusted quoted prices in active markets); Level 2 (observable market inputs, other than quoted prices included in Level 1); and Level 3 (unobservable inputs that cannot be corroborated by observable market data).\nFinancial Instruments Measured on a Recurring Basis\nFair Value as of\n(millions)\nClassification\nMeasurement Level\nFebruary 1, 2025\nFebruary 3, 2024\nAssets\n \n \nShort-term investments \n(a)\nCash and Cash Equivalents\nLevel 1\n$\n3,893\n \n$\n2,897\n \nPrepaid forward contracts \n(b)\nOther Current Assets\nLevel 1\n23\n \n25\n \nLiabilities\n \n \nInterest rate swaps \n(c)\nOther Current Liabilities\nLevel 2\n—\n \n3\n \nInterest rate swaps \n(c)\nOther Noncurrent Liabilities\nLevel 2\n125\n \n123\n \n(a)\nCarrying value approximates fair value because maturities are less than three months.\n(b)\nInitially valued at transaction price. Subsequently valued by reference to the market price of Target common stock.\n(c)\nValuations are based on observable inputs to the valuation model (e.g., interest rates and credit spreads). See \nNote 16\n for additional information on interest rate swaps.\nTARGET CORPORATION\n2024 Form 10-K\n50\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nSignificant Financial Instruments Not Measured at Fair Value \n(a)\nAs of February 1, 2025\nAs of February 3, 2024\n(millions)\nCarrying\nAmount\nFair\nValue\nCarrying\nAmount\nFair\nValue\nLong-term debt, including current portion \n(b)\n$\n13,904\n \n$\n12,953\n \n$\n14,151\n \n$\n13,467\n \n(a)\nThe carrying amounts of certain other current assets, commercial paper, accounts payable, and certain accrued and other current liabilities approximate fair value due to their short-term nature.\n(b)\nThe fair value of debt is generally measured using a discounted cash flow analysis based on current market interest rates for the same or similar types of financial instruments and would be classified as Level 2. These amounts exclude commercial paper, unamortized swap valuation adjustments, and lease liabilities.\n7. \nCash and Cash Equivalents\nCash equivalents include highly liquid investments with an original maturity of three months or less from the time of purchase. Cash equivalents also include amounts due from third-party financial institutions for credit and debit card transactions. These receivables typically settle in \nfive days\n or less.\nCash and Cash Equivalents\n(millions)\nFebruary 1, 2025\nFebruary 3, 2024\nCash\n$\n276\n \n$\n288\n \nReceivables from third-party financial institutions for credit and debit card transactions\n593\n \n620\n \nShort-term investments \n3,893\n \n2,897\n \nCash and Cash Equivalents \n(a)\n$\n4,762\n \n$\n3,805\n \n(a)\nWe have access to these funds without any significant restrictions, taxes, or penalties.\nAs of February 1, 2025, and February 3, 2024, we included book overdrafts of $\n157\n million and $\n173\n million, respectively, in Accounts Payable and $\n8\n million and $\n10\n million, respectively, in Accrued and Other Current Liabilities.\n8. \nInventory\nThe vast majority of our inventory is accounted for under the retail inventory accounting method (RIM) using the last-in, first-out (LIFO) method. Inventory is stated at the lower of LIFO cost or market. Inventory cost includes the amount we pay to our suppliers to acquire inventory, freight costs incurred to deliver product to our distribution centers and stores, and import costs, reduced by vendor income and cash discounts. Supply chain operating costs, including compensation and benefits, are expensed in the period incurred. Inventory is also reduced for estimated losses related to shrink and markdowns. The LIFO provision is calculated based on inventory levels, markup rates, and internally measured retail price indices, and was $\n183\n million and $\n153\n million as of February 1, 2025, and February 3, 2024, respectively.\nUnder RIM, inventory cost and the resulting gross margins are calculated by applying a cost-to-retail ratio to the inventory retail value. RIM is an averaging method that has been widely used in the retail industry due to its practicality. The use of RIM will result in inventory being valued at the lower of cost or market because permanent markdowns are taken as a reduction of the retail value of inventory.\nTARGET CORPORATION\n2024 Form 10-K\n51\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\n9. \nOther Current Assets\nOther Current Assets\n(millions)\nFebruary 1, 2025\nFebruary 3, 2024\nAccounts and other receivables\n$\n998\n \n$\n891\n \nVendor income receivable\n543\n \n513\n \nPrepaid expenses\n226\n \n201\n \nOther\n185\n \n202\n \nOther Current Assets\n$\n1,952\n \n$\n1,807\n \n10. \nProperty and Equipment\nProperty and equipment, including assets acquired under finance leases, is depreciated using the straight-line method over estimated useful lives or lease terms if shorter. We amortize leasehold improvements purchased after the beginning of the initial lease term over the shorter of the assets' useful lives or a term that includes the remaining initial lease term, plus any renewals that are reasonably certain at the date the leasehold improvements are acquired. Total depreciation expense, including depreciation expense included in Cost of Sales, was $\n3.0\n billion, $\n2.8\n billion, and $\n2.7\n billion for 2024, 2023, and 2022, respectively. For income tax purposes, accelerated depreciation methods are generally used. Repair and maintenance costs are expensed as incurred. Facility pre-opening costs, including supplies and payroll, are expensed as incurred.\nEstimated Useful Lives\nLife (Years)\nBuildings and improvements\n8\n-\n39\nFixtures and equipment\n2\n-\n15\nComputer hardware and software\n2\n-\n7\nWe review long-lived assets for impairment when performance expectations, events, or changes in circumstances—such as a decision to relocate or close a store, office, or distribution center, discontinue a project, or make significant software changes—indicate that the asset's carrying value may not be recoverable. We recognized impairment losses of $\n68\n million, $\n102\n million, and $\n66\n million during 2024, 2023, and 2022, respectively. For asset groups classified as held for sale, measurement of an impairment loss is based on the excess of the carrying amount of the asset group over its fair value. We estimate fair value by obtaining market appraisals, obtaining valuations from third-party brokers, or using other valuation techniques. Impairments are recorded in SG&A Expenses.\n11. \nOther Noncurrent Assets\nOther Noncurrent Assets\n(millions)\nFebruary 1, 2025\nFebruary 3, 2024\nGoodwill \n(a)\n$\n631\n \n$\n631\n \nCompany-owned life insurance investments, net of loans \n(b)\n540\n \n483\n \nPension asset\n121\n \n57\n \nOther\n238\n \n229\n \nOther Noncurrent Assets\n$\n1,530\n \n$\n1,400\n \n(a)\nNo\n impairments were recorded in 2024, 2023, or 2022 as a result of the annual goodwill impairment tests performed.\n(b)\nNote 22\n provides more information on company-owned life insurance investments.\nTARGET CORPORATION\n2024 Form 10-K\n52\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\n12. \nSupplier Finance Programs\nWe have arrangements with several financial institutions to act as our paying agents to certain vendors. The arrangements also permit the financial institutions to provide vendors with an option, at our vendors' sole discretion, to sell their receivables from Target to the financial institutions. A vendor’s election to receive early payment at a discounted amount from the financial institutions does not change the amount that we must remit to the financial institutions or our payment date, which is up to \n120\n days from the invoice date.\nWe do not pay any fees or pledge any security to these financial institutions under these arrangements. The arrangements can be terminated by either party with notice ranging up to \n120\n days.\nOur outstanding vendor obligations eligible for early payment, which are included within Accounts Payable on our Consolidated Statements of Financial Position, do not represent actual receivables sold by our vendors to the financial institutions, which have historically been lower.\nConfirmed Obligations Outstanding\n(millions)\nFebruary 3, 2024\nInvoices Confirmed During the Year\nConfirmed Invoices Paid During the Year\nFebruary 1, 2025\nVendor obligations eligible for early payment\n$\n3,398\n \n$\n13,806\n \n$\n(\n13,538\n)\n$\n3,666\n \n13. \nAccrued and Other Current Liabilities\nAccrued and Other Current Liabilities\n(millions)\nFebruary 1, 2025\nFebruary 3, 2024\nWages and benefits\n$\n1,597\n \n$\n1,535\n \nGift card liability, net of estimated breakage\n1,209\n \n1,162\n \nReal estate, sales, and other taxes payable\n708\n \n827\n \nDividends payable\n510\n \n508\n \nCurrent portion of operating lease liabilities\n353\n \n329\n \nIncome tax payable\n334\n \n113\n \nWorkers' compensation and general liability \n(a)\n211\n \n192\n \nInterest payable\n126\n \n122\n \nOther\n1,062\n \n1,302\n \nAccrued and Other Current Liabilities\n$\n6,110\n \n$\n6,090\n \n(a)\nWe retain a substantial portion of the risk related to general liability and workers' compensation claims. We estimate our ultimate cost based on analysis of historical data and actuarial estimates. General liability and workers' compensation liabilities are recorded at our estimate of their net present value. \nNote 19\n provides the noncurrent balance of these liabilities.\nTARGET CORPORATION\n2024 Form 10-K\n53\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\n14. \nCommitments and Contingencies\nContingencies\nWe are exposed to claims and litigation arising in the ordinary course of business and use various methods to resolve these matters in a manner that we believe serves the best interest of our shareholders and other constituents. When a loss is probable, we record an accrual based on the reasonably estimable loss or range of loss. When no point of loss is more likely than another, we record the lowest amount in the estimated range of loss and, if material, disclose the estimated range of loss. We do not record liabilities for reasonably possible loss contingencies, but do disclose a range of reasonably possible losses if they are material and we are able to estimate such a range. If we cannot provide a range of reasonably possible losses, we explain the factors that prevent us from determining such a range. Historically, adjustments to our estimates have not been material. We believe the recorded reserves in our consolidated financial statements are adequate in light of the probable and estimable liabilities. We do not believe that any of these identified claims or litigation will be material to our results of operations, cash flows, or financial condition.\nCommitments\nPurchase obligations, which include all legally binding contracts such as merchandise royalties, equipment purchases, marketing-related contracts, software acquisition/license commitments, firm minimum commitments for inventory purchases, and service contracts, were $\n1.2\n billion as of February 1, 2025. These purchase obligations are primarily due within \nthree years\n and recorded as liabilities when goods are received or services are rendered. Real estate obligations, which include legally binding minimum lease payments for leases signed but not yet commenced, and commitments for the purchase, construction, or remodeling of real estate and facilities, were $\n1.5\n billion as of February 1, 2025. These real estate obligations are primarily due within \none year\n, a portion of which are recorded as liabilities.\nWe issue inventory purchase orders in the ordinary course of business, which represent authorizations to purchase that are cancellable by their terms. We do not consider purchase orders to be firm inventory commitments. If we choose to cancel a purchase order, we may be obligated to reimburse the vendor for unrecoverable outlays incurred prior to cancellation.\nWe also issue letters of credit and surety bonds in the ordinary course of business.\n Trade letters of credit totaled $\n1.5\n billion as of February 1, 2025, a portion of which are reflected in Accounts Payable. Standby letters of credit and surety bonds, primarily related to insurance and regulatory requirements, totaled $\n509\n million as of February 1, 2025.\nTARGET CORPORATION\n2024 Form 10-K\n54\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\n15. \nCommercial Paper and Long-Term Debt\nDebt Maturities\n(dollars in millions)\nWeighted-Average Interest Rate at February 1, 2025\nFebruary 1, 2025\nFebruary 3, 2024\nDue 2024\n—\n \n%\n$\n—\n \n$\n1,000\n \nDue 2025-2029\n2.7\n \n4,671\n \n4,666\n \nDue 2030-2034\n4.1\n \n3,965\n \n3,221\n \nDue 2035-2039\n6.8\n \n938\n \n937\n \nDue 2040-2044\n4.0\n \n1,089\n \n1,088\n \nDue 2045-2049\n3.8\n \n1,120\n \n1,119\n \nDue 2050-2054\n3.9\n \n2,121\n \n2,120\n \nTotal notes and debentures\n13,904\n \n14,151\n \nSwap valuation adjustments\n \n(\n125\n)\n(\n126\n)\nFinance lease liabilities\n \n2,161\n \n2,013\n \nLess: Amounts due within one year\n \n(\n1,636\n)\n(\n1,116\n)\nLong-term debt and other borrowings\n \n$\n14,304\n \n$\n14,922\n \nRequired Principal Payments\n(millions)\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal required principal payments\n$\n1,500\n \n$\n2,000\n \n$\n97\n \n$\n81\n \n$\n1,000\n \n$\n9,324\n \nIn September 2024, we issued $\n750\n million of unsecured debt with a fixed rate of \n4.5\n percent that matures in September 2034.\nWe obtain short-term financing from time to time under our commercial paper program. There was \nno\n commercial paper outstanding at any time during the year ended February 1, 2025, or as of February 3, 2024. During the year ended February 3, 2024, the maximum amount outstanding was $\n90\n million, and the average daily amount outstanding was $\n1\n million, at a weighted average annual interest rate of \n4.8\n percent.\nIn October 2024, we obtained a new committed $\n1.0\n billion \n364\n-day unsecured revolving credit facility that will expire in October 2025 and terminated our prior \n364\n-day facility. We also have a committed $\n3.0\n billion unsecured revolving credit facility that will expire in October 2028. \nNo\n balances were outstanding under our credit facilities at any time during 2024 or 2023.\nSubstantially all of our outstanding borrowings are senior, unsecured obligations. Most of our long-term debt obligations contain covenants related to secured debt levels. In addition to a secured debt level covenant, our credit facilities also contain a debt leverage covenant. We are, and expect to remain, in compliance with these covenants, which have no practical effect on our ability to pay dividends.\n16. \nDerivative Financial Instruments\nOur derivative instruments consist of interest rate swaps used to mitigate interest rate risk. As a result, we have counterparty credit exposure to large global financial institutions, which we monitor on an ongoing basis. \nNote 6\n provides the fair value and classification of these instruments.\nUnder our swap agreements, we pay a floating rate equal to the daily Secured Overnight Financing Rate (SOFR) compounded over six months and receive a weighted average fixed rate of \n2.8\n percent. The agreements have a weighted average remaining maturity of \n4.5\n years. As of February 1, 2025, and February 3, 2024, interest rate swaps with notional amounts totaling $\n2.20\n billion and $\n2.45\n billion were designated as fair value hedges, and all were considered to be perfectly effective under the shortcut method during 2024 and 2023.\nTARGET CORPORATION\n2024 Form 10-K\n55\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nEffect of Hedges on Debt\n(millions)\nFebruary 1, 2025\nFebruary 3, 2024\nLong-term debt and other borrowings\nCarrying amount of hedged debt\n$\n2,069\n \n$\n2,316\n \nCumulative hedging adjustments, included in carrying amount\n(\n125\n)\n(\n126\n)\nEffect of Hedges on Net Interest Expense\n(millions)\n2024\n2023\n2022\nGain (loss) on fair value hedges recognized in Net Interest Expense\nInterest rate swaps designated as fair value hedges\n$\n1\n \n$\n(\n52\n)\n$\n(\n151\n)\nHedged debt\n(\n1\n)\n52\n \n151\n \nGain on cash flow hedges recognized in Net Interest Expense\n23\n \n24\n \n4\n \nTotal\n$\n23\n \n$\n24\n \n$\n4\n \n17. \nLeases\nWe lease certain retail stores, supply chain facilities, office space, land, and equipment. Leases with an initial term of 12 months or less are not recorded on the Consolidated Statements of Financial Position; we recognize lease expense for these leases on a straight-line basis over the lease term. We combine lease and nonlease components for new and reassessed leases. \nMost leases include one or more options to renew, with renewal terms that can extend the lease term from \none\n to \n50\n years or more. The exercise of lease renewal options is at our sole discretion. Certain leases also include options to purchase the leased property. The depreciable life of leased assets and leasehold improvements are limited by the expected lease term, unless there is a transfer of title or purchase option reasonably certain of exercise. We use our incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments.\nCertain of our lease agreements require reimbursement of real estate taxes, common area maintenance, and insurance, as well as rental payments based on a percentage of retail sales over contractual levels, and others include rental payments adjusted periodically for inflation. Our lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nWe rent or sublease certain real estate to third parties. Our lease and sublease portfolio consists mainly of operating leases with CVS Pharmacy Inc. (CVS) for space within our stores.\nTARGET CORPORATION\n2024 Form 10-K\n56\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nLeases\n(millions)\nClassification\nFebruary 1, 2025\nFebruary 3, 2024\nAssets\nOperating \nOperating Lease Assets\n$\n3,763\n \n$\n3,362\n \nFinance \nProperty and Equipment, Net \n(a)\n1,557\n \n1,470\n \nTotal leased assets\n$\n5,320\n \n$\n4,832\n \nLiabilities\nCurrent\nOperating\nAccrued and Other Current Liabilities\n$\n353\n \n$\n329\n \nFinance\nCurrent Portion of Long-term Debt and Other Borrowings\n136\n \n119\n \nNoncurrent\nOperating\nNoncurrent Operating Lease Liabilities\n3,582\n \n3,279\n \nFinance\nLong-term Debt and Other Borrowings\n2,025\n \n1,894\n \nTotal lease liabilities\n$\n6,096\n \n$\n5,621\n \n(a)\nFinance lease assets are recorded net of accumulated amortization of $\n857\n million and $\n743\n million as of February 1, 2025, and February 3, 2024, respectively.\nLease Cost\n(millions)\nClassification\n2024\n2023\n2022\nOperating lease cost \n(a)\nSG&A Expenses \n(b)\n$\n641\n \n$\n550\n \n$\n467\n \nFinance lease cost\nAmortization of leased assets\nDepreciation and Amortization \n(b)\n146\n \n136\n \n133\n \nInterest on lease liabilities\nNet Interest Expense\n77\n \n71\n \n68\n \nSublease income \n(c)\nNet Sales\n(\n15\n)\n(\n20\n)\n(\n19\n)\nNet lease cost\n$\n849\n \n$\n737\n \n$\n649\n \n(a)\n2024, 2023, and 2022 include $\n132\n million, $\n115\n million, and $\n101\n million, respectively, of short-term and variable lease costs. \n(b)\nSupply chain-related amounts are included in Cost of Sales.\n(c)\nSublease income excludes rental income from owned properties of $\n48\n million in 2024, and $\n49\n million for each of 2023 and 2022, which is also included in Net Sales.\nTARGET CORPORATION\n2024 Form 10-K\n57\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nMaturity of Lease Liabilities\nOperating \nFinance \n(millions)\nLeases \n(a)\nLeases \n(b)\nTotal\n2025\n$\n510\n \n$\n205\n \n$\n715\n \n2026\n507\n \n203\n \n710\n \n2027\n497\n \n204\n \n701\n \n2028\n469\n \n206\n \n675\n \n2029\n430\n \n204\n \n634\n \nThereafter\n2,800\n \n1,824\n \n4,624\n \nTotal lease payments\n$\n5,213\n \n$\n2,846\n \n$\n8,059\n \nLess: Interest\n1,278\n \n685\n \n \nPresent value of lease liabilities\n$\n3,935\n \n$\n2,161\n \n \n(a)\nOperating lease payments include $\n777\n million related to options to extend lease terms that are reasonably certain of being exercised and exclude $\n186\n million of legally binding minimum lease payments for leases signed but not yet commenced.\n(b)\nFinance lease payments include $\n245\n million related to options to extend lease terms that are reasonably certain of being exercised and exclude $\n128\n million of legally binding minimum lease payments for leases signed but not yet commenced.\n \nLease Term and Discount Rate\nFebruary 1, 2025\nFebruary 3, 2024\nWeighted average remaining lease term (years)\nOperating leases\n11.8\n12.0\nFinance leases\n13.9\n14.6\nWeighted average discount rate\nOperating leases\n4.51\n \n%\n4.22\n \n%\nFinance leases\n3.88\n \n%\n3.69\n \n%\nOther Information\n(millions)\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities\nOperating cash flows from operating leases\n$\n490\n \n$\n479\n \n$\n364\n \nOperating cash flows from finance leases\n76\n \n70\n \n63\n \nFinancing cash flows from finance leases\n139\n \n147\n \n100\n \nTARGET CORPORATION\n2024 Form 10-K\n58\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\n18. \nIncome Taxes\nEarnings before income taxes were $\n5.3\n billion, $\n5.3\n billion, and $\n3.4\n billion during 2024, 2023, and 2022, respectively, including $\n1.1\n billion, $\n1.2\n billion, and $\n1.3\n billion earned by our foreign entities subject to tax outside of the U.S.\nTax Rate Reconciliation\n2024 \n2023 \n2022 \nFederal statutory rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState income taxes, net of the federal tax benefit\n3.7\n \n3.8\n \n3.0\n \nInternational\n(\n1.1\n)\n(\n1.3\n)\n(\n2.1\n)\nExcess tax benefit related to share-based payments\n(\n0.1\n)\n(\n0.3\n)\n(\n1.6\n)\nFederal tax credits\n(\n0.8\n)\n(\n0.8\n)\n(\n1.5\n)\nOther\n(\n0.5\n)\n(\n0.5\n)\n(\n0.1\n)\nEffective tax rate\n22.2\n \n%\n21.9\n \n%\n18.7\n \n%\nProvision for Income Taxes\n(millions)\n2024\n2023\n2022\nCurrent:\n \n \n \nFederal\n$\n1,013\n \n$\n556\n \n$\n(\n84\n)\nState\n236\n \n208\n \n33\n \nInternational\n101\n \n97\n \n107\n \nTotal current\n1,350\n \n861\n \n56\n \nDeferred:\n \n \n \nFederal\n(\n184\n)\n256\n \n501\n \nState\n2\n \n43\n \n82\n \nInternational\n2\n \n(\n1\n)\n(\n1\n)\nTotal deferred\n(\n180\n)\n298\n \n582\n \nTotal provision\n$\n1,170\n \n$\n1,159\n \n$\n638\n \nTARGET CORPORATION\n2024 Form 10-K\n59\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nNet Deferred Tax Asset\n \n/\n \n(Liability)\n(millions)\nFebruary 1, 2025\nFebruary 3, 2024\nGross deferred tax assets:\n \n \nAccrued and deferred compensation\n$\n423\n \n$\n392\n \nAccruals and reserves not currently deductible\n260\n \n256\n \nSelf-insured benefits\n207\n \n180\n \nDeferred occupancy income\n109\n \n118\n \nLease liabilities\n1,600\n \n1,468\n \nOther\n50\n \n92\n \nTotal gross deferred tax assets\n2,649\n \n2,506\n \nGross deferred tax liabilities:\n \n \nProperty and equipment\n(\n2,830\n)\n(\n3,015\n)\nLeased assets\n(\n1,425\n)\n(\n1,276\n)\nInventory\n(\n484\n)\n(\n500\n)\nOther\n(\n203\n)\n(\n187\n)\nTotal gross deferred tax liabilities\n(\n4,942\n)\n(\n4,978\n)\nTotal net deferred tax liability \n(a)\n$\n(\n2,293\n)\n$\n(\n2,472\n)\n(a)\n$\n10\n million and $\n8\n million of the balances as of February 1, 2025, and February 3, 2024, respectively, is included in Other Noncurrent Assets.\nWe file a U.S. federal income tax return and income tax returns in various states and foreign jurisdictions. The U.S. Internal Revenue Service (IRS) is currently auditing certain aspects of the U.S. federal income tax returns for years 2021 through 2023 and has completed exams for years 2020 and prior. With few exceptions, we are no longer subject to state and local or non-U.S. income tax examinations by tax authorities for years before 2019.\nReconciliation of Gross Unrecognized Tax Benefits\n(millions)\n2024\n2023\n2022\nBalance at beginning of period\n$\n352\n \n$\n233\n \n$\n125\n \nAdditions based on tax positions related to the current year\n118\n \n128\n \n115\n \nAdditions for tax positions of prior years\n22\n \n8\n \n21\n \nReductions for tax positions of prior years\n(\n36\n)\n(\n13\n)\n(\n23\n)\nSettlements\n(\n23\n)\n(\n4\n)\n(\n5\n)\nBalance at end of period\n$\n433\n \n$\n352\n \n$\n233\n \nIf we were to prevail on all unrecognized tax benefits recorded, the amount that would benefit the effective tax rate was $\n206\n million, $\n161\n million, and $\n107\n million as of February 1, 2025, February 3, 2024, and January 28, 2023, respectively. In addition, the reversal of accrued interest and penalties would also benefit the effective tax rate. Interest and penalties associated with unrecognized tax benefits are recorded within income tax expense. During 2024, 2023, and 2022, we recorded an expense\n \n/\n \n(benefit) from accrued interest and penalties of $\n13\n million, $\n6\n million, and $(\n4\n) million, respectively. As of February 1, 2025, February 3, 2024, and January 28, 2023, total accrued interest and penalties were $\n21\n million, $\n14\n million, and $\n7\n million, respectively.\nIt is reasonably possible that the amount of the unrecognized tax benefits with respect to our other unrecognized tax positions will increase or decrease during the next twelve months; however, an estimate of the amount or range of the change cannot be made at this time.\nTARGET CORPORATION\n2024 Form 10-K\n60\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\n19. \nOther Noncurrent Liabilities\nOther Noncurrent Liabilities\n(millions)\nFebruary 1, 2025\nFebruary 3, 2024\nDeferred compensation\n$\n628\n \n$\n576\n \nWorkers' compensation and general liability\n561\n \n458\n \nDeferred occupancy income \n(a)\n388\n \n419\n \nIncome and other taxes payable\n338\n \n272\n \nPension benefits\n31\n \n33\n \nOther\n169\n \n181\n \nOther Noncurrent Liabilities\n$\n2,115\n \n$\n1,939\n \n(a)\nTo be amortized evenly through 2038.\n20. \nShare Repurchase\nWe periodically repurchase shares of our common stock under a board-authorized repurchase program through a combination of open market transactions, accelerated share repurchase arrangements, and other privately negotiated transactions with financial institutions.\nShare Repurchase Activity\n(millions, except per share data)\n2024\n2023\n2022\nTotal number of shares purchased\n7.2\n \n—\n \n12.5\n \nAverage price paid per share \n(a)\n$\n141.72\n \n$\n—\n \n$\n211.57\n \nTotal investment \n(a)\n$\n1,015\n \n$\n—\n \n$\n2,646\n \n(a)\n    \nAmounts include applicable excise tax and commissions.\n21. \nShare-Based Compensation\nWe maintain a long-term incentive plan for key team members and non-employee members of our Board of Directors. This plan allows us to grant equity-based compensation awards, including stock options, stock appreciation rights, performance share units, restricted stock units, restricted stock awards, or a combination of awards (collectively, share-based awards). The number of unissued common shares reserved for future grants under this plan was \n24.1\n million\n as of February 1, 2025.\nCompensation expense associated with share-based awards is recognized on a straight-line basis over the required service period and reflects estimated forfeitures. Share-based compensation expense recognized in SG&A Expenses was $\n307\n million, $\n255\n million, and $\n224\n million, and the related income tax benefit was $\n66\n million, $\n56\n million, and $\n52\n million, in 2024, 2023, and 2022, respectively.\nTARGET CORPORATION\n2024 Form 10-K\n61\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nRestricted Stock Units\nWe issue restricted stock units and performance-based restricted stock units generally with \n3\n-year cliff or \n4\n-year graduated vesting from the grant date (collectively restricted stock units) to certain team members. The final number of shares issued under performance-based restricted stock units is based on our total shareholder return relative to a retail peer group over a \n3-year\n performance period. We also regularly issue restricted stock units to our Board of Directors, which vest quarterly in the year they are granted and are settled in shares of Target common stock upon departure from the Board. \nThe fair value for restricted stock units is calculated based on our stock price on the date of grant, incorporating an analysis of the total shareholder return performance measure where applicable.\n The weighted average grant date fair value of restricted stock units was $\n165.21\n, $\n160.91\n, and $\n208.80\n in 2024, 2023, and 2022, respectively.\nRestricted Stock Unit Activity\nTotal Nonvested Units\n \nRestricted\nStock \n(a)\nGrant Date\nFair Value \n(b)\nFebruary 3, 2024\n3,796\n \n$\n171.61\n \nGranted\n2,477\n \n165.21\n \nForfeited\n(\n377\n)\n171.47\n \nVested\n(\n1,347\n)\n167.39\n \nFebruary 1, 2025\n4,549\n \n$\n169.59\n \n(a)\nRepresents the number of shares of restricted stock units, in thousands. For performance-based restricted stock units, assumes attainment of maximum payout rates as set forth in the performance criteria. Applying actual or expected payout rates, the number of outstanding restricted stock units and performance-based restricted stock units as of February 1, 2025, was \n4.47\n million.\n(b)\nWeighted average per unit\n.\nThe expense recognized each period is partially dependent upon our estimate of the number of shares that will ultimately be issued.\n As of February 1, 2025, there was $\n429\n million of total unrecognized compensation expense related to restricted stock units, which is expected to be recognized over a weighted average period of \n2.5\n years. The fair value of restricted stock units vested and converted to shares of Target common stock was $\n225\n million, $\n213\n million, and $\n321\n million in 2024, 2023, and 2022, respectively.\nPerformance Share Units\nWe issue performance share units to certain team members that represent shares potentially issuable in the future. Issuance is based upon our performance, generally relative to a retail peer group, over a \n3-year\n or \n4-year\n performance period on certain measures primarily including sales growth, after-tax return on invested capital, and earnings per share growth. The fair value of performance share units is calculated based on our stock price on the date of grant. The weighted average grant date fair value of performance share units was $\n164.92\n, $\n162.54\n, and $\n216.63\n in 2024, 2023, and 2022, respectively.\nPerformance Share Unit Activity\nTotal Nonvested Units\n \nPerformance\nShare Units \n(a)\nGrant Date\nFair Value \n(b)\nFebruary 3, 2024\n1,494\n \n$\n182.98\n \nGranted\n753\n \n164.92\n \nForfeited\n(\n146\n)\n175.94\n \nVested\n(\n271\n)\n179.31\n \nFebruary 1, 2025\n1,830\n \n$\n177.15\n \n(a)\nRepresents the number of performance share units, in thousands. Assumes attainment of maximum payout rates as set forth in the performance criteria. Applying actual or expected payout rates, the number of outstanding performance share units as of February 1, 2025, was \n0.87\n million.\n(b)\nWeighted average per unit.\nTARGET CORPORATION\n2024 Form 10-K\n62\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nThe expense recognized each period is partially dependent upon our estimate of the number of shares that will ultimately be issued. Future compensation expense for unvested awards could reach a maximum of $\n190\n million assuming payout of all unvested awards. The unrecognized expense is expected to be recognized over a weighted average period of \n1.3\n years. The fair value of performance share units vested and converted to shares of Target common stock was $\n46\n million, $\n127\n million, and $\n178\n million in 2024, 2023, and 2022, respectively.\n22. \nDefined Contribution Plans\nTeam members who meet eligibility requirements can participate in a defined contribution 401(k) plan by investing up to \n80\n percent of their eligible earnings, as limited by statute or regulation. We match \n100\n percent of each team member's contribution up to \n5\n percent of eligible earnings. Company match contributions are made to funds designated by the participant, none of which are based on Target common stock.\nIn addition, we maintain an unfunded, nonqualified deferred compensation plan for a broad management group whose participation in our 401(k) plan is limited by statute or regulation. These team members choose from a menu of crediting rate alternatives that are generally the same as the investment choices in our 401(k) plan, but also includes a fund based on Target common stock. We credit an additional \n2\n percent per year to the accounts of all active participants, excluding executive officers, in part to recognize the risks inherent to their participation in this plan. We also maintain a frozen, unfunded, nonqualified deferred compensation plan covering less than \n50\n participants. Our total liability under these plans was $\n684\n million and $\n627\n million as of February 1, 2025, and February 3, 2024, respectively.\nWe mitigate our risk of offering the nonqualified plans through investing in company-owned life insurance and prepaid forward contracts that substantially offset our economic exposure to the returns of these plans. These investments are general corporate assets and are marked to market with the related gains and losses recognized in the Consolidated Statements of Operations in the period they occur. \nPlan Expenses\n \n \n \n(millions)\n2024\n2023\n2022\n401(k) plan matching contributions expense\n$\n380\n \n$\n373\n \n$\n335\n \nNonqualified deferred compensation plans\n \n \n \nBenefits expense / (income)\n$\n90\n \n$\n59\n \n$\n(\n15\n)\nRelated investment (income) / expense\n(\n62\n)\n(\n43\n)\n40\n \nNonqualified plans net expense\n$\n28\n \n$\n16\n \n$\n25\n \n23. \nPension Plans\nWe have a U.S. qualified defined benefit pension plan covering team members who meet eligibility requirements. This plan is closed to new participants. Active participants accrue benefits under a final average pay feature or a cash balance feature. We also have unfunded, nonqualified pension plans for team members with qualified plan compensation restrictions, as well as international plans. Eligibility and the level of benefits under all plans vary depending on each team member's full-time or part-time status, date of hire, age, length of service, and/or compensation. \nFunded Status\nQualified Plan\nNonqualified and International Plans\n(millions)\n2024\n2023\n2024\n2023\nProjected benefit obligations \n$\n3,225\n \n$\n3,436\n \n$\n64\n \n$\n60\n \nFair value of plan assets\n3,346\n \n3,493\n \n25\n \n21\n \nFunded\n \n/\n \n(underfunded) status\n$\n121\n \n$\n57\n \n$\n(\n39\n)\n$\n(\n39\n)\nTARGET CORPORATION\n2024 Form 10-K\n63\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nContributions and Estimated Future Benefit Payments\nOur pension obligations can be met over time through a combination of company contributions to these plans and earnings on plan assets. In 2024 and 2023, we made \nno\n contributions to our qualified defined benefit pension plan. We are not required to make any contributions to our qualified defined benefit pension plan in 2025. However, depending on investment performance and plan funded status, we may elect to make a contribution.\nEstimated Future Benefit Payments\n(millions)\nPension Benefits\n2025\n$\n266\n \n2026\n197\n \n2027\n237\n \n2028\n244\n \n2029\n251\n \n2030 - 2034\n1,321\n \nCost of Plans\nNet Pension Benefits (Income) / Expense\n(millions)\nClassification\n2024\n2023\n2022\nService cost benefits earned \nSG&A Expenses\n$\n80\n \n$\n79\n \n$\n94\n \nInterest cost on projected benefit obligation\nNet Other Income\n166\n \n166\n \n117\n \nExpected return on assets\nNet Other Income\n(\n279\n)\n(\n269\n)\n(\n234\n)\nAmortization of losses\nNet Other Income\n—\n \n1\n \n61\n \nPrior service cost\nNet Other Income\n8\n \n11\n \n10\n \nTotal\n$\n(\n25\n)\n$\n(\n12\n)\n$\n48\n \nAssumptions\nBenefit Obligation Weighted Average Assumptions\n2024\n2023\nDiscount rate\n5.68\n \n%\n5.20\n \n%\nAverage assumed rate of compensation increase\n3.00\n \n3.00\n \nCash balance plan interest crediting rate\n4.64\n \n4.64\n \nNet Periodic Benefit Expense Weighted Average Assumptions\n2024\n2023\n2022\nDiscount rate\n5.20\n \n%\n4.83\n \n%\n3.30\n \n%\nExpected long-term rate of return on plan assets\n7.00\n \n6.50\n \n5.60\n \nAverage assumed rate of compensation increase\n3.00\n \n3.00\n \n3.00\n \nCash balance plan interest crediting rate\n4.64\n \n4.64\n \n4.64\n \nThe weighted average assumptions used to measure net periodic benefit expense each year are the rates as of the beginning of the year (i.e., the prior measurement date). Our most recent compound annual rate of return on qualified plan assets was \n1.2\n percent, \n3.9\n percent, \n6.3\n percent, and \n5.7\n percent for the \n5-year\n, \n10-year\n, \n15-year\n, and \n20-year\n time periods, respectively.\nThe market-related value of plan assets is used in calculating the expected return on assets. Historical differences between expected and actual returns are deferred and recognized in the market-related value over a \n5-year\n period from the year in which they occur.\n \nTARGET CORPORATION\n2024 Form 10-K\n64\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nWe review the expected long-term rate of return annually and revise it as appropriate. Additionally, we monitor the mix of investments in our portfolio to ensure alignment with our long-term strategy to manage pension cost and reduce volatility in our assets. Our 2024 expected annualized long-term rate of return assumptions were \n7.0\n percent for domestic equity securities, \n7.0\n percent for international equity securities, \n6.0\n percent for long-duration debt securities, \n9.0\n percent for balanced funds, and \n8.0\n percent for other investments. These estimates are a judgmental matter in which we consider the composition of our asset portfolio, our historical long-term investment performance, and current market conditions. \nBenefit Obligation\nChange in Projected Benefit Obligation\nQualified Plan\nNonqualified and International Plans\n(millions)\n2024\n2023\n2024\n2023\nBenefit obligation at beginning of period\n$\n3,436\n \n$\n3,616\n \n$\n60\n \n$\n64\n \nService cost\n72\n \n76\n \n8\n \n3\n \nInterest cost\n164\n \n164\n \n2\n \n2\n \nPlan amendments\n8\n \n11\n \n—\n \n—\n \nActuarial gain \n(a)\n(\n131\n)\n(\n114\n)\n(\n2\n)\n(\n4\n)\nParticipant contributions\n10\n \n4\n \n—\n \n—\n \nBenefits paid\n(\n334\n)\n(\n321\n)\n(\n4\n)\n(\n5\n)\nBenefit obligation at end of period \n(b)\n$\n3,225\n \n$\n3,436\n \n$\n64\n \n$\n60\n \n(a)\nThe actuarial gain was primarily driven by changes in the weighted average discount rate.\n(b)\nAccumulated benefit obligation—the present value of benefits earned to date assuming no future salary growth—is materially consistent with the projected benefit obligation in each period presented.\nTARGET CORPORATION\n2024 Form 10-K\n65\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nPlan Assets\nChange in Plan Assets\nQualified Plan\nNonqualified and International Plans\n(millions)\n2024\n2023\n2024\n2023\nFair value of plan assets at beginning of period\n$\n3,493\n \n$\n3,691\n \n$\n21\n \n$\n17\n \nActual return on plan assets\n177\n \n119\n \n1\n \n1\n \nEmployer contributions\n—\n \n—\n \n7\n \n8\n \nParticipant contributions\n10\n \n4\n \n—\n \n—\n \nBenefits paid\n(\n334\n)\n(\n321\n)\n(\n4\n)\n(\n5\n)\nFair value of plan assets at end of period\n$\n3,346\n \n$\n3,493\n \n$\n25\n \n$\n21\n \nOur asset allocation policy is designed to reduce the long-term cost of funding our pension obligations. The plan invests with both passive and active investment managers depending on the investment. The plan also seeks to reduce the risk associated with adverse movements in interest rates by employing an interest rate hedging program, which includes the use of derivative instruments.\nAsset Category\nCurrent Targeted Allocation\nActual Allocation\n \n2024\n2023\nDomestic equity securities \n(a)\n14\n \n%\n14\n \n%\n12\n \n%\nInternational equity securities\n8\n \n8\n \n8\n \nDebt securities\n50\n \n50\n \n52\n \nBalanced funds\n23\n \n24\n \n24\n \nOther \n(b)\n5\n \n4\n \n4\n \nTotal\n100\n \n%\n100\n \n%\n100\n \n%\n(a)\nEquity securities include our common stock in amounts substantially less than \n1\n percent of total plan assets in both periods presented.\n(b)\nOther assets include private equity, high-yield debt, natural resources and timberland funds, derivative instruments, and real estate.\n \nTARGET CORPORATION\n2024 Form 10-K\n66\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\nFair Value Measurements\nFair Value as of\n(millions)\nMeasurement Level\nJanuary 31, 2025\nJanuary 31, 2024\nCash and cash equivalents\nLevel 1\n$\n6\n \n$\n5\n \nDerivatives\nLevel 2\n—\n \n10\n \nGovernment securities \n(a)\nLevel 2\n488\n \n551\n \nFixed income \n(b)\nLevel 2\n1,163\n \n1,195\n \n1,657\n \n1,761\n \nInvestments valued using NAV per share \n(c)\nFixed income\n6\n \n6\n \nPrivate equity funds\n55\n \n64\n \nCash and cash equivalents\n218\n \n141\n \nCommon collective trusts\n539\n \n623\n \nBalanced funds\n803\n \n825\n \nOther\n93\n \n94\n \nTotal plan assets\n$\n3,371\n \n$\n3,514\n \n(a)\nInvestments in government securities and long-term government bonds.\n(b)\nInvestments in corporate and municipal bonds.\n(c)\nCertain investments that are measured at fair value using the net asset value per share (or its equivalent) practical expedient have not been classified in the fair value hierarchy. The fair value amounts presented in this table are intended to permit reconciliation of the fair value hierarchy to the amounts presented in the statement of financial position.\nPosition\n \nValuation Technique\nCash and cash equivalents\n \nCarrying value approximates fair value.\nDerivatives\nValuations are based on observable inputs to the valuation model (e.g., interest rates and credit spreads). Model inputs are changed only when corroborated by market data. A credit risk adjustment is made on each swap using observable market credit spreads.\nGovernment securities\n and fixed income\n \nValued using matrix pricing models and quoted prices of securities with similar characteristics.\nAmounts Included in Shareholders' Investment\nActuarial gains and losses are recorded in Accumulated Other Comprehensive Loss (AOCI) and amortized using the corridor approach. As of February 1, 2025, and February 3, 2024, pretax net actuarial losses recorded in AOCI totaled $\n939\n million and $\n969\n million, respectively.\n \n24. \nAccumulated Other Comprehensive Loss\nChange in Accumulated Other Comprehensive Loss\n(millions)\nCash Flow\nHedges\nCurrency\nTranslation\nAdjustment\nPension\nTotal\nFebruary 3, 2024\n$\n283\n \n$\n(\n24\n)\n$\n(\n719\n)\n$\n(\n460\n)\nOther comprehensive (loss) / income before reclassifications\n—\n \n(\n3\n)\n22\n \n19\n \nAmounts reclassified\n(\n17\n)\n(a)\n—\n \n—\n \n(\n17\n)\nFebruary 1, 2025\n$\n266\n \n$\n(\n27\n)\n$\n(\n697\n)\n$\n(\n458\n)\n \nNote:  Amounts are net of tax.\n(a)\nRepresents amortization of gains and losses on cash flow hedges, net of $\n6\n million of taxes, which is recorded in Net Interest Expense.\nTARGET CORPORATION\n2024 Form 10-K\n67\nFINANCIAL STATEMENTS\nTable of Contents\nNOTES\nIndex to Financial Statements\n25. \nSegment Reporting\nOur Chief Operating Decision Maker—our Chief Executive Officer—monitors our consolidated operating income and net earnings to evaluate performance and make operating decisions. We operate as a single segment that includes all of our operations, which are designed to enable guests to purchase products seamlessly in stores or through our digital channels. Virtually all of our consolidated revenues are generated in the United States. The vast majority of our properties and equipment are located within the United States.\nBusiness Segment Results\n \n \n \n(millions)\n2024\n2023\n2022\nNet sales\n$\n106,566\n \n$\n107,412\n \n$\n109,120\n \nCost of sales\nMerchandising cost of sales \n(a)\n68,884\n \n70,652\n \n74,436\n \nSupply chain and digital fulfillment costs \n(a)\n7,618\n \n7,176\n \n7,870\n \nTotal cost of sales\n76,502\n \n77,828\n \n82,306\n \nSelling, general and administrative expenses\n21,969\n \n21,462\n \n20,581\n \nDepreciation and amortization (exclusive of depreciation included in cost of sales)\n2,529\n \n2,415\n \n2,385\n \nOperating income\n$\n5,566\n \n$\n5,707\n \n$\n3,848\n \nNet interest expense\n411\n \n502\n \n478\n \nNet other income\n(\n106\n)\n(\n92\n)\n(\n48\n)\nEarnings before income taxes\n5,261\n \n5,297\n \n3,418\n \nProvision for income taxes\n1,170\n \n1,159\n \n638\n \nNet earnings\n$\n4,091\n \n$\n4,138\n \n$\n2,780\n \n(a)\nN\note\n \n3\n provides a description of Merchandising Cost of Sales and Supply Chain and Digital Fulfillment Costs.\nItem 9.    Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable.\nItem 9A.    Controls and Procedures\nChanges in Internal Control Over Financial Reporting\nDuring the most recently completed fiscal quarter, there were no changes which materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nEvaluation of Disclosure Controls and Procedures\nAs of the end of the period covered by this Annual Report, we conducted an evaluation, under supervision and with the participation of management, including the chief executive officer and chief financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures pursuant to Rules 13a-15 and 15d-15 of the Securities Exchange Act of 1934, as amended (Exchange Act). Based upon that evaluation, our chief executive officer and chief financial officer concluded that our disclosure controls and procedures are effective at a reasonable assurance level. Disclosure controls and procedures are defined by Rules 13a-15(e) and 15d-15(e) of the Exchange Act as controls and other procedures that are designed to ensure that information required to be disclosed by us in reports filed with the SEC under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC's rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by us in reports filed under the Exchange Act is accumulated and communicated to our management, including our principal executive and principal financial officers, or persons performing similar functions, as appropriate, to allow timely decisions regarding required disclosure.\nTARGET CORPORATION\n2024 Form 10-K\n68\nSUPPLEMENTAL INFORMATION\nTable of Contents\nIndex to Financial Statements\nFor the Report of Management on Internal Control and the Report of Independent Registered Public Accounting Firm on Internal Control over Financial Reporting, see \nPart II, Item 8, Financial Statements and Supplementary Data\n.\nItem 9B.    Other Information\nOn \nDecember 5, 2024\n, \nChristina Hennington\n, Target’s \nExecutive Vice President and Chief Strategy and Growth Officer,\n \nadopted\n a written plan for the sale of Target common stock that is intended to satisfy the affirmative defense conditions of \nRule 10b5-1(c)\n under the Exchange Act. Ms. Hennington’s written plan covers \n13,514\n shares of Target common stock in the aggregate. It provides for the sale of \n11,965\n shares of Target common stock and also provides for a gift of \n1,549\n shares of Target common stock. This written plan is scheduled to expire on \nApril 2, 2026\n.\nItem 9C.    Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nTARGET CORPORATION\n2024 Form 10-K\n69\nSUPPLEMENTAL INFORMATION\nTable of Contents\nIndex to Financial Statements\nPART III\nCertain information required by Part III is incorporated by reference from Target's definitive Proxy Statement for the Annual Meeting of Shareholders to be held on June 11, 2025 (our Proxy Statement). Except for those portions specifically incorporated in this Form 10-K by reference to the Proxy Statement, no other portions of the Proxy Statement are deemed to be filed as part of this Form 10-K.\nItem 10.   Directors, Executive Officers and Corporate Governance\nThe following sections of the Proxy Statement are incorporated herein by reference:\n•\nItem one—Election of directors\n•\nGeneral information about corporate governance and the Board—\n◦\nCommittees\n◦\nBusiness ethics and conduct\n•\nCompensation Discussion and Analysis—Compensation policies and risk—\nSecurities trading policy\n•\nQuestions and answers about the 2025 Annual Meeting—Access to information—Question 16\n•\nQuestions and answers about the 2025 Annual Meeting—Communications—Question 19\nSee also \nPart I, Item 1, Business\n of this Form 10-K.\nItem 11.   Executive Compensation\nThe following sections of the Proxy Statement are incorporated herein by reference:\n•\nItem one—Election of directors—Director compensation\n•\nCompensation Discussion and Analysis\n•\nCompensation tables (exclusive of Compensation tables—Pay versus performance disclosure)\n•\nCompensation & Human Capital Management Committee Report\nItem 12.   Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following sections of the Proxy Statement are incorporated herein by reference:\n•\nStock ownership information—\n◦\nBeneficial ownership of directors and executive officers\n◦\nBeneficial ownership of Target’s largest shareholders\n•\nCompensation tables—Equity compensation plan information\nItem 13.   Certain Relationships and Related Transactions, and Director Independence\nThe following sections of the Proxy Statement are incorporated herein by reference:\n•\nGeneral information about corporate governance and the Board—\n◦\nCommittees\n◦\nDirector independence\n◦\nPolicy on transactions with related persons\nItem 14.    Principal Accountant Fees and Services\nThe following section of the Proxy Statement is incorporated herein by reference:\n•\nItem two—Ratification of the appointment of Ernst & Young LLP as our independent registered public accounting firm—Audit and non-audit fees\nTARGET CORPORATION\n2024 Form 10-K\n70\nSUPPLEMENTAL INFORMATION\nTable of Contents\nIndex to Financial Statements\nPART IV\nItem 15.    Exhibits, Financial Statement Schedules\nThe following information required under this item is filed as part of this report:\na)    (1) Financial Statements\n•\nConsolidated Statements of Operations\n for the Years Ended February 1, 2025, February 3, 2024, and January 28, 2023\n•\nConsolidated Statements of Comprehensive Income\n for the Years Ended February 1, 2025, February 3, 2024, and January 28, 2023\n•\nConsolidated Statements of Financial Position\n as of February 1, 2025, and February 3, 2024\n•\nConsolidated Statements of Cash Flows\n for the Years Ended February 1, 2025, February 3, 2024, and January 28, 2023\n•\nConsolidated Statements of Shareholders' Investment\n for the Years Ended February 1, 2025, February 3, 2024, and January 28, 2023\n•\nNotes to Consolidated Financial Statements\n•\nReport of Independent Registered Public Accounting Firm on Consolidated Financial Statements\n (PCAOB ID: \n42\n) \n(2) Financial Statement Schedules\nNone.\nOther schedules have not been included either because they are not applicable or because the information is included elsewhere in this Report.\n(3) Exhibits\nSee exhibits listed under part (b) below.\nTARGET CORPORATION\n2024 Form 10-K\n71\nSUPPLEMENTAL INFORMATION\nTable of Contents\nIndex to Financial Statements\nb)    Exhibits \n(1)\n3.1\n \nAmended and Restated Articles of Incorporation of Target Corporation (as amended through June 9, 2010) (filed as Exhibit (3)A to Target's Current Report on Form 8-K on June 10, 2010\n,\n and incorporated herein by reference).\n3.2\n \nBylaws of Target Corporation (as amended and restated through January 1\n5\n, 202\n5\n) (filed as Exhibit 3.2 to Target's Current Report on Form 8-K on January 1\n7\n, 202\n5\n,\n and incorporated herein by reference).\n4.1\n \nIndenture, dated as of August 4, 2000\n,\n between Target Corporation and Bank One Trust Company, N.A. (filed as Exhibit 4.1 to Target's Current Report on Form 8-K on August 10, 2000\n,\n and incorporated herein by reference).\n4.1.1\n \nFirst Supplemental Indenture\n,\n dated as of May 1, 2007\n,\n to Indenture\n,\n dated as of August 4, 2000\n,\n between Target Corporation and The Bank of New York Trust Company, N.A. (as successor in interest to Bank One Trust Company N.A.) (filed as Exhibit 4.1 to Target’s Current Report on Form 8-K on May 1, 2007\n,\n and incorporated herein by reference).\n4.2\n \nDescription of Securities (filed as Exhibit (4)D to Target's Annual Report on Form 10-K for the year ended January 30, 2021\n,\n and incorporated herein by reference).\n10.1\n*\nTarget Corporation Executive Officer Cash Incentive Plan (filed as Exhibit (10)A to Target's Annual Report on Form 10-K for the year ended January 30, 2021\n,\n and incorporated herein by reference).\n10.2\n*\nTarget Corporation Long-Term Incentive Plan (as amended and restated effective June 8, 2011) (filed as Exhibit (10)B to Target's Quarterly Report on Form 10-Q for the quarter ended July 30, 2011\n,\n and incorporated herein by reference).\n10.3\n*\nAmended and Restated Target Corporation 2011 Long-Term Incentive Plan (as amended and restated effective September 1, 2017) (filed as Exhibit (10)C to Target's Quarterly Report on Form 10-Q for the quarter ended July 29, 2017\n,\n and incorporated herein by reference).\n10.3.1\n*\nForm of Price-Vested Stock Option Agreement (filed as Exhibit (10)JJ to Target's Quarterly Report on Form 10-Q for the quarter ended April 29, 2017\n,\n and incorporated herein by reference).\n10.4\n*\nTarget Corporation 2020 Long-Term Incentive Plan (filed as Exhibit (10)D to Target's Current Report on Form 8-K on June 11, 2020\n,\n and incorporated herein by reference).\n10.4.1\n* \nForm of Restricted Stock Unit Agreement\n (filed as Exhibit 10.4.1 to Target's Annual Report on Form 10-K for the year ended February 3, 2024, and incorporated herein by reference\n)\n.\n10.4.2\n* \nForm of Performance-Based Restricted Stock Unit Agreement\n (\nfiled as Exhibit 10.4.\n2\n to Target's Annual Report on Form 10-K for the year ended February 3, 2024, and incorporated herein by reference\n)\n.\n10.4.3\n*\nForm of Performance Share Unit Agreement\n (\nfiled as Exhibit 10.4.\n3\n to Target's Annual Report on Form 10-K for the year ended February 3, 2024, and incorporated herein by reference\n)\n.\n10.4.4\n*\nForm of Non-Employee Director Restricted Stock Unit Agreement (filed as Exhibit (10)Y to Target's Quarterly Report on Form 10-Q for the quarter ended August 1, 2020\n,\n and incorporated herein by reference).\n10.4.5\n* **\nForm of Cliff-Vested Restricted Stock Unit Agreement.\n10.4.6\n* **\nForm of Performance Award Performance Share Unit Agreement.\n10.5\n*\nTarget Corporation SPP I (2022 Plan Statement) (as amended and restated effective May 1, 2022) (filed as Exhibit (10)E to Target's Quarterly Report on Form 10-Q for the quarter ended July 30, 2022\n,\n and incorporated herein by reference).\n10.6\n*\nTarget Corporation SPP II (2022 Plan Statement) (as amended and restated effective May 1, 2022) (filed as Exhibit (10)F to Target's Quarterly Report on Form 10-Q for the quarter ended July 30, 2022\n,\n and incorporated herein by reference).\n10.7\n*\nTarget Corporation SPP III (2014 Plan Statement) (as amended and restated effective January 1, 2014) (filed as Exhibit (10)E to Target's Annual Report on Form 10-K for the year ended February 1, 2014\n,\n and incorporated herein by reference).\n10.7.1\n*\nAmendment to Target Corporation SPP III (2014 Plan Statement) (effective April 3, 2016) (filed as Exhibit (10)NN to Target's Quarterly Report on Form 10-Q for the quarter ended April 30, 2016\n,\n and incorporated herein by reference).\n10.8\n*\nTarget Corporation Officer Deferred Compensation Plan (as amended and restated effective June 8, 2011) (filed as Exhibit (10)F to Target's Quarterly Report on Form 10-Q for the quarter ended July 30, 2011\n,\n and incorporated herein by reference).\n10.9\n* **\nTarget Corporation Officer EDCP (202\n5\n Plan Statement)\n.\nTARGET CORPORATION\n2024 Form 10-K\n72\nSUPPLEMENTAL INFORMATION\nTable of Contents\nIndex to Financial Statements\n10.10\n*\nTarget Corporation Deferred Compensation Plan Directors (filed as Exhibit (10)I to Target's Annual Report on Form 10-K for the year ended February 3, 2007\n,\n and incorporated herein by reference).\n10.11\n*\nTarget Corporation DDCP (2022 Plan Statement) (as amended and restated effective January 1, 2022) (filed as Exhibit (10)L to Target's Quarterly Report on Form 10-Q for the quarter ended October 30, 2021\n,\n and incorporated herein by reference).\n10.12\n*\nTarget Corporation Officer Income Continuation Plan (as amended and restated effective September 1, 2017) (filed as Exhibit (10)L to Target's Quarterly Report on Form 10-Q for the quarter ended July 29, 2017\n,\n and incorporated herein by reference).\n10.13\n*\nTarget Corporation Executive Excess Long Term Disability Plan (as restated effective January 1, 2010) (filed as Exhibit (10)A to Target's Quarterly Report on Form 10-Q for the quarter ended October 30, 2010\n,\n and incorporated herein by reference).\n10.14\n*\nDirector Retirement Program (filed as Exhibit (10)O to Target's Annual Report on Form 10-K for the year ended January 29, 2005\n,\n and incorporated herein by reference).\n10.15\n*\nTarget Corporation Deferred Compensation Trust Agreement (as amended and restated effective January 1, 2009) (filed as Exhibit (10)O to Target's Annual Report on Form 10-K for the year ended January 31, 2009\n,\n and incorporated herein by reference).\n10.15.1\n*\nAmendment\n,\n dated \nas of \nJune 8, 2011\n,\n to Target Corporation Deferred Compensation Trust Agreement (as amended and restated effective January 1, 2009) (filed as Exhibit (10)AA to Target's Quarterly Report on Form 10-Q for the quarter ended July 30, 2011\n,\n and incorporated herein by reference).\n10.15.2\n*\nAmendment\n,\n dated\n as of\n October 25, 2017\n,\n to Target Corporation Deferred Compensation Trust Agreement (as amended and restated effective January 1, 2009) (filed as Exhibit (10)MM to Target's Quarterly Report on Form 10-Q for the quarter ended October 28, 2017\n,\n and incorporated herein by reference).\n10.15.3\n*\nAmendment\n,\n dated \nas of \nDecember 18, 2020\n,\n to Target Corporation Deferred Compensation Trust Agreement (as amended and restated effective January 1, 2009) (filed as Exhibit (10)S to Target's Annual Report on Form 10-K for the year ended January 30, 2021\n,\n and incorporated herein by reference).\n10.16\n*\nForm of Cash Retention Award (filed as Exhibit (10)W to Target’s Annual Report on Form 10-K for the year ended February 2, 2013\n,\n and incorporated herein by reference).\n10.17\n* \n‡\nAircraft Time Sharing Agreement\n, dated\n as of October 4, 2022\n,\n among Target Corporation and Brian C. Cornell (filed as Exhibit (10)BB to Target's Quarterly Report on Form 10-Q for the quarter ended October 29, 2022\n,\n and incorporated herein by reference).\n10.18\n* \nTransition \nAgreement,\n dated \nas of August 12, 2024,\n among Target Corporation, Target Enterprise, Inc., and \nDon H. Liu (filed as Exhibit 10.23 to Target's Quarterly Report on Form 10-Q for the quarter ended November 2, 2024, and incorporated herein by reference).\n10.19\n \nFive-Year Credit Agreement\n,\n dated as of October 18, 2021\n,\n among Target Corporation, Bank of America, N.A., as Administrative Agent, and the Banks listed therein (filed as Exhibit (10)DD to Target's Quarterly Report on Form 10-Q for the quarter ended October 30, 2021\n,\n and incorporated herein by reference).\n10.19.1\n‡\nAmendment No. 1 to Five-Year Credit Agreement\n,\n dated as of October 25, 2022\n,\n among Target Corporation, Bank of America, N.A., as Administrative Agent, and the Banks listed therein (filed as Exhibit (10)EE to Target's Quarterly Report on Form 10-Q for the quarter ended October 29, 2022\n,\n and incorporated herein by reference).\n10.19.2\nAmendment No. 2 to Five-Year Credit Agreement\n,\n dated as of September 20, 2023\n,\n among Target Corporation, Bank of America, N.A., as Administrative Agent, and the Banks listed therein (filed as Exhibit 10.19.2 to Target's Quarterly Report on Form 10-Q for the quarter ended October 28, 2023\n,\n and incorporated herein by reference).\n10.20\n‡\n364-Day Credit Agreement\n,\n dated as of October 1\n5\n, 202\n4,\n among Target Corporation, the Banks listed therein, the Co-Documentation Agents and Syndication Agent listed therein, and Bank of America, N.A., as Administrative Agent (filed as Exhibit 10.20 to Target's Quarterly Report on Form 10-Q for the quarter ended \nNovember 2, 2024,\n and incorporated herein by reference).\n10.21\n** + \n‡\nCredit Card Program Agreement\n,\n dated \nas of \nOctober 22, 2012\n,\n among Target Corporation, Target Enterprise, Inc. and TD Bank USA, N.A.\n10.21.1\n** +\nFirst Amendment\n,\n dated \nas of \nFebruary 24, 2015\n,\n to Credit Card Program Agreement among Target Corporation, Target Enterprise, Inc. and TD Bank USA, N.A.\n10.21.2\n** +\nSecond Amendment\n,\n dated \nas of \nNovember 19, 2019\n,\n to Credit Card Program Agreement among Target Corporation, Target Enterprise, Inc. and TD Bank USA, N.A.\nTARGET CORPORATION\n2024 Form 10-K\n73\nSUPPLEMENTAL INFORMATION\nTable of Contents\nIndex to Financial Statements\n10.21.3\n+\nThird Amendment\n,\n dated\n as of\n November 1, 2022\n,\n to Credit Card Program Agreement among Target Corporation, Target Enterprise, Inc. and TD Bank USA, N.A.\n (filed as Exhibit \n(10)JJ to Target's Quarterly Report on Form 10-Q for the quarter ended October 29, 2022, and incorporated herein by reference\n).\n10.21.4\n+\nLetter Agreement\n,\n dated \nas of \nMarch 8, 2023\n,\n among Target Corporation, Target Enterprise, Inc. and TD Bank USA, N.A. (filed as Exhibit 10.21.4 to Target’s Quarterly Report on Form 10-Q for the quarter ended April 29, 2023\n,\n and incorporated herein by reference).\n10.22\n** + \n‡\nPharmacy Operating Agreement\n,\n dated\n as of\n December 16, 2015\n,\n between Target Corporation and CVS Pharmacy, Inc.\n10.22.1\n** +\nFirst Amendment\n,\n dated\n as of\n November 30, 2016\n,\n to Pharmacy Operating Agreement between Target Corporation and CVS Pharmacy, Inc.\n10.22.2\nSecond Amendment\n,\n dated\n as of\n January 9, 2018\n,\n to Pharmacy Operating Agreement between Target Corporation and CVS Pharmacy, Inc. (filed as Exhibit (10)HH to Target's Annual Report on Form 10-K for the year ended February 3, 2018\n,\n and incorporated herein by reference).\n19.1\n**\nSecurities \nTrading Policy\n21.1\n**\nList of Subsidiaries\n23.1\n**\nConsent of Independent Registered Public Accounting Firm\n24.1\n**\nPowers of Attorney\n31.1\n**\nCertification of the Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\n**\nCertification of the Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\n***\nCertification of the Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\n***\nCertification of the Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n97.1\nTarget Corporation Clawback Policy\n \n(filed as Exhibit 97.1 to Target's Annual Report on Form 10-K for the year ended February 3, 2024, and incorporated herein by reference\n).\n101.INS\n**\nInline XBRL Instance Document\n101.SCH\n**\nInline XBRL Taxonomy Extension Schema\n101.CAL\n**\nInline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF\n**\nInline XBRL Taxonomy Extension Definition Linkbase\n101.LAB\n**\nInline XBRL Taxonomy Extension Label Linkbase\n101.PRE\n**\nInline XBRL Taxonomy Extension Presentation Linkbase\n104\n**\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n____________________________________________________________________\n*    \nManagement contract or compensatory plan or arrangement.\n**    \nFiled herewith.\n***    \nFurnished herewith.\n+    \nCertain portions of this exhibit have been redacted pursuant to Item 601(b)(10)(iv) of Regulation S-K. The Corporation agrees to furnish supplementally an unredacted copy of the exhibit to the Securities and Exchange Commission upon its request.\n‡\n    \nCertain schedules and attachments have been omitted pursuant to Item 601(a)(5) of Regulation S-K. The Corporation agrees to furnish a copy of such schedules and attachments to the Securities and Exchange Commission upon its request.\n(1)\n    \nCertain instruments defining the rights of holders of long-term debt securities of the Corporation have been omitted pursuant to Item 601(b)(4)(iii)(A) of Regulation S-K. The Corporation agrees to furnish copies of any such instruments to the Securities and Exchange Commission upon its request.\nItem 16.    Form 10-K Summary\nNot applicable.\nTARGET CORPORATION\n2024 Form 10-K\n74\nSUPPLEMENTAL INFORMATION\nTable of Contents\nIndex to Financial Statements\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nTARGET CORPORATION\n \nBy:\n/s/ Jim Lee\nDate: March 12, 2025\n \nJim Lee\n \nExecutive Vice President and Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n \n/s/ Brian C. Cornell\nDate: March 12, 2025\nBrian C. Cornell\n \nChair of the Board and Chief Executive Officer\n(Principal Executive Officer)\n \n/s/ Jim Lee\nDate: March 12, 2025\nJim Lee\n \nExecutive Vice President and Chief Financial Officer\n(Principal Financial Officer)\n \n/s/ Matthew A. Liegel\nDate: March 12, 2025\nMatthew A. Liegel \nSenior Vice President, Chief Accounting Officer\nand Controller\n(Principal Accounting Officer)\nDAVID P. ABNEY\nDOUGLAS M. BAKER, JR.\nGEORGE S. BARRETT\nGAIL K. BOUDREAUX\nROBERT L. EDWARDS\nDONALD R. KNAUSS\n \nCHRISTINE A. LEAHY\nMONICA C. LOZANO\nGRACE PUMA\nDERICA W. RICE\nDMITRI L. STOCKTON\n \nConstituting a majority of the Board of Directors\nJim Lee, by signing his name hereto, does hereby sign this document pursuant to powers of attorney duly executed by the Directors named, filed with the Securities and Exchange Commission on behalf of such Directors, all in the capacities and on the date stated.\n \nBy:\n/s/ Jim Lee\nDate: March 12, 2025\nJim Lee\nAttorney-in-fact\nTARGET CORPORATION\n2024 Form 10-K\n75"
  }
}