{
  "ticker": "TJX",
  "cik": "0000109198",
  "company_name": "TJX COMPANIES INC /DE/",
  "filing_date": "2025-04-02",
  "accession": "0000109198-25-000010",
  "primary_doc": "tjx-20250201.htm",
  "item_sections": {
    "item1": "ITEM 16. Form 10-K Summary\n45\nSIGNATURES\n46\n4\nPART I\nITEM 1.  Business\nBUSINESS OVERVIEW\nThe TJX Companies, Inc. (together with its subsidiaries, “TJX,” the “Company,” “we,” or “our”) is the leading off-price apparel and home fashions retailer in the United States and worldwide. We have over 5,000 stores and six branded e-commerce sites that offer a rapidly changing assortment of quality, fashionable, brand name and designer merchandise at prices generally 20% to 60% below full-price retailers’ (including department, specialty, and major online retailers) regular prices on comparable merchandise, every day.\nOur mission is to deliver great value to our customers every day. In our stores and online, we offer consumers our value proposition of brand, fashion, price and quality. Our opportunistic buying strategies and flexible business model differentiate us from traditional retailers. We offer a treasure hunt shopping experience and a rapid turn of inventories relative to traditional retailers. Our goal is to create a sense of excitement and urgency for our customers and encourage frequent customer visits. We acquire merchandise in a variety of ways to support that goal. We reach a broad range of customers across income levels with our value proposition on a wide range of items. Our strategies and operations are synergistic across our retail chains. As a result, we are able to leverage our expertise throughout our business, sharing information, best practices, initiatives and new ideas, and to develop talent across our company. Further, we can leverage the substantial buying power of our businesses with our global vendor relationships.\nIn this report, fiscal 2025 means the 52-week fiscal year ended February 1, 2025; fiscal 2024 means the 53-week fiscal year ended February 3, 2024 and fiscal 2023 means the 52-week fiscal year ended January 28, 2023. Fiscal 2026 means the 52-week fiscal year ending January 31, 2026. Unless otherwise indicated, all store information in this Item 1 is as of February 1, 2025, and references to store square footage are to gross square feet. \nOur Businesses\nWe operate our business in four segments: Marmaxx and HomeGoods, both in the U.S., TJX Canada and TJX International, including Europe and Australia. In addition to our four segments, we operate the Sierra business. The results of Sierra are included with the Marmaxx segment.\nMARMAXX\nOur TJ Maxx and Marshalls chains in the United States (“Marmaxx”) are collectively the largest off-price retailer in the United States with a total of 2,563 stores. We founded TJ Maxx in 1976 and acquired Marshalls in 1995. Both chains sell family apparel (including footwear), accessories (including beauty and jewelry), home fashions (including home basics, decorative accessories and giftware), and other merchandise. We primarily differentiate TJ Maxx and Marshalls through different product assortment, including an expanded assortment of jewelry and accessories and a high-end designer department called The Runway at TJ Maxx and a full line of footwear and a broader men’s offering at Marshalls, as well as varying in-store initiatives. This differentiated shopping experience at TJ Maxx and Marshalls encourages our customers to shop both chains. Marmaxx currently operates two e-commerce sites, tjmaxx.com, launched in 2013, and marshalls.com, launched in 2019.  \nSierra, acquired in 2012 and rebranded from Sierra Trading Post in 2018, is a leading off-price retailer of brand name active and outdoor apparel, footwear, and gear (including sporting goods, snow and water sport, camping, fishing) for the whole family, as well as home fashions and pet. Sierra operates 117 retail stores in the U.S. and sierra.com.\nHOMEGOODS\nOur HomeGoods segment operates HomeGoods and Homesense chains in the U.S. HomeGoods, introduced in 1992, is the leading off-price retailer of home fashions in the U.S. Through its 943 stores, HomeGoods offers an eclectic assortment of home fashions, including furniture, rugs, lighting, soft home, decorative accessories, tabletop and cookware, as well as expanded pet and gourmet food departments. In 2017, we launched our Homesense chain in the U.S. Our 72 Homesense stores complement HomeGoods, offering a differentiated mix and expanded departments, such as large furniture, ceiling lighting, rugs, and an entertaining marketplace. \n5\nTJX CANADA\nOur TJX Canada segment operates the Winners, HomeSense and Marshalls chains in Canada. Winners, acquired by TJX in 1990, operates 307 stores and is the leading off-price family apparel and home fashions retailer in Canada. HomeSense introduced the off-price home fashions concept to Canada in 2001. This chain operates 160 stores and offers an array of home decor, furniture, and seasonal home merchandise. Marshalls, launched in Canada in 2011, operates 109 stores and offers off-price family apparel, footwear, and home fashions. \nTJX INTERNATIONAL\nOur TJX International segment operates the TK Maxx and Homesense chains in Europe and the TK Maxx chain in Australia. Launched in 1994, TK Maxx introduced off-price retail to Europe and remains Europe’s largest major brick-and-mortar off-price retailer of apparel and home fashions. With 655 stores in Europe, TK Maxx operates in the U.K., Ireland, Germany, Poland, Austria and the Netherlands. Through its stores and its e-commerce sites, tkmaxx.com, launched in 2009 and tkmaxx.de and tkmaxx.at, both launched in 2023, TK Maxx offers a merchandise mix similar to TJ Maxx. We brought the off-price home fashions concept to Europe, opening Homesense in the U.K. in 2008 and in Ireland in 2017. Its 75 stores offer a merchandise mix of home fashions similar to that of HomeGoods in the U.S. and HomeSense in Canada. We acquired Trade Secret in Australia in 2015 and re-branded it under the TK Maxx name during 2017. The merchandise offering at TK Maxx in Australia's 84 stores is comparable to TJ Maxx.\nFlexible Business Model\nOur flexible business model, including our opportunistic buying, inventory management, logistics and flexible store layouts, is designed to deliver to our customers a compelling value proposition of fashionable, quality, brand name and designer merchandise at excellent values every day. Our buying and inventory management strategies give us flexibility to adjust our merchandise assortments more frequently than traditional retailers, and the design and operation of our stores and distribution centers support this flexibility. Our buyers have more visibility into consumer, fashion and market trends and pricing when we buy closer to need, which can help us buy better and reduce our markdown exposure. Our selling floor space is flexible, without walls between departments and largely free of permanent fixtures, so we can easily expand and contract departments to accommodate the merchandise we purchase. Our logistics and distribution operations are designed to support our global buying strategies and to facilitate quick, efficient and differentiated delivery of merchandise to our stores, with a goal of delivering the right merchandise to the right stores at the right time.\nOpportunistic Buying\nAs an off-price retailer, our buying practices, which we refer to as opportunistic buying, differentiate us from traditional retailers. Our overall global buying strategy is to acquire merchandise on an ongoing basis that will enable us to offer a desirable and rapidly changing mix of branded, designer and other quality merchandise in our stores at prices below regular prices for comparable merchandise at full-price retailers, including department, specialty, and major online retailers. We seek out and select merchandise from the broad range of opportunities in the market to achieve this end. Our buying organization, which numbers over 1,300 employees (who we refer to as Associates), has buying offices across the globe and executes this opportunistic buying strategy, buying merchandise from more than 100 countries in a variety of ways, depending on market conditions and other factors.\nWe take advantage of opportunities to acquire merchandise at substantial discounts that regularly arise from the production and flow of inventory in the apparel and home fashions marketplace. These opportunities include, among others, closeouts from brands, manufacturers and other retailers; special production direct from brands and factories; order cancellations and manufacturer overruns. Our global buying strategies are intentionally flexible to allow us to react to frequently changing opportunities and trends in the market and to adjust how and what we source as well as when we source it. Our goal is to operate with lean inventory levels compared to conventional retailers to give us the flexibility to seek out and to take advantage of these opportunities as they arise, close to the time the merchandise is needed in our stores and online and when we have more visibility into fashion trends and price. In contrast to traditional retailers, which tend to order most of their goods far in advance of the time the product appears on the selling floor, our merchants generally remain in the marketplace for goods throughout the year, frequently looking for opportunities to buy merchandise. We buy much of our merchandise for the current or immediately upcoming selling season. We also buy some merchandise that is available in the market with the intention of storing it for sale, typically in future selling seasons. We generally make these purchases, referred to as packaway, in response to opportunities to buy merchandise that we believe has the right combination of brand, fashion, price and quality to supplement the product we expect to be available to purchase later for those future seasons. \nWe also acquire some merchandise that we offer under in-house brands or brands that are licensed to us. We develop some of this merchandise ourselves, which allows us to supplement the depth of, or fill gaps in, our expected merchandise assortment. Collectively, these represent a small percentage of our product/merchandise mix.\n6\nManufacturers, retailers and other vendors made up our expansive and changing universe of more than 21,000 vendors across the globe, including thousands of new vendors in fiscal 2025, which provides us substantial and diversified access to merchandise. We have not experienced difficulty in obtaining sufficient quality merchandise for our business in either favorable or difficult retail environments and expect this will continue should we meet or exceed our plans for growth. We believe a number of factors provide us excellent access on an ongoing basis to leading branded merchandise and make us an attractive channel for many vendors in the market. We are typically willing to purchase less-than-full assortments of items, styles and sizes as well as quantities ranging from small to very large; we are able to disperse merchandise across our geographically diverse network of store\ns and to target specific markets; we pay promptly according to our payment terms; our practice is to not ask for typical retail concessions (such as advertising, promotional and markdown allowances), delivery concessions (such as drop shipments to stores or delayed deliveries) or performance-based return privileges; and we have an excellent credit rating.\nInventory Management\nWe offer our customers a rapidly changing selection of merchandise to create a treasure hunt experience in our stores and to encourage frequent customer visits. To achieve this, we seek to turn the inventory in our stores rapidly, regularly offering fresh selections of apparel and home fashions at excellent values. Our specialized inventory planning, purchasing, monitoring and markdown systems, coupled with distribution center storage, processing, handling and shipping systems, enable us to tailor the merchandise in our stores to local preferences and demographics, achieve rapid in-store inventory turnover on a vast array of products and generally sell through most merchandise within the period we planned. We make pricing, markdown and store inventory decisions centrally, using information provided by specialized computer systems designed to move inventory through our stores in a timely and disciplined manner. We invest in our supply chain with the goal of continuing to operate with low inventory levels, to ship more efficiently and quickly, and to more precisely and effectively allocate merchandise to each store. \nPricing\nOur mission is to deliver great value to our customers every day. We do this by offering quality, fashionable, brand name and designer merchandise in our stores with retail prices that are generally 20% to 60% below full-price retailers’ (including department, specialty, and major online retailers) regular prices on comparable merchandise, every day. Our practice is to not \nengage in promotional pricing activity such as sales or coupons. We have generally been able to react to price fluctuations in the wholesale market to maintain our pricing gap relative to prices offered by traditional retailers as well \nas our merchandise margins through various economic cycles.\nLow Cost Operations\nWe operate with a low cost structure compared to many traditional retailers with a prudent focus on expenses throughout our business. Our advertising is generally focused on promoting our retail banners rather than individual products, which contributes to our advertising budget (as a percentage of sales) remaining low compared to many traditional retailers. We design our stores to provide a pleasant, convenient shopping environment without spending heavily on store fixtures. Additionally, our distribution network is designed to run cost effectively.\nCustomer Service/Shopping Experience\nWe strategically renovate and upgrade our stores across our retail banners to enhance our customers’ shopping experience and help drive sales. We train our store Associates to provide friendly and helpful customer service and seek to staff our stores to deliver a positive shopping experience. We believe we offer return policies that are customer friendly. We accept a variety of payment methods including cash, credit cards and debit cards. We also offer TJX-branded credit cards in the U.S. through a bank, but do not own the customer receivables.\nDistribution\nWe operate distribution centers encompassing \napproximately 30 million square feet in six countries\n. These centers are generally large, and built to suit our specific, off-price business model, with a combination of automated systems and manual processes to manage the variety of merchandise we acquire. We ship substantially all of our merchandise to our stores through a network of distribution centers, fulfillment centers and warehouses as well as shipping centers operated in many cases by third parties.\n7\nStore Growth\nExpansion of our business through the addition of new stores continues to be an important part of our global growth strategy. The following table provides store growth information for our divisions for the two most recently completed fiscal years, as well as our estimates of the long-term store growth potential of these divisions in their current geographies:\n  \nApproximate\nAverage Store\nSize (square feet)\nNumber of Stores at Year-End\nEstimated Store\nPotential\n  \nFiscal 2024\nFiscal 2025\nMarmaxx:\nTJ Maxx\n27,000\n1,319 \n1,333\n \nMarshalls\n28,000\n1,197 \n1,230\n \n \nTotal Marmaxx\n \n2,516 \n2,563\n \n3,000 \nHomeGoods:\nHomeGoods\n23,000\n919 \n943\n \nHomesense\n27,000\n55 \n72\n \n \nTotal HomeGoods\n \n974 \n1,015\n \n1,800 \nSierra:\nSierra\n21,000\n95 \n117\n \n325 \nTJX Canada:\nWinners\n27,000\n302 \n307\n \nHomeSense\n24,000\n158 \n160\n \nMarshalls\n27,000\n106 \n109\n \n \nTotal TJX Canada\n \n566 \n576\n \n650 \nTJX International:\nTK Maxx (Europe)\n28,000\n644 \n655\n \nHomesense (Europe)\n19,000\n79 \n75\n \nTK Maxx (Australia)\n21,000\n80 \n84\n \n \nTotal TJX International\n \n803 \n814\n \n1,225 \n(a)\nTJX Total\n \n4,954 \n5,085\n \n7,000 \n(a)\nReflects store growth potential for TK Maxx in current geographies and the expansion into Spain and for Homesense in the United Kingdom and Ireland.    \nSome of our home fashion stores are co-located with one of our apparel stores in a combo or superstore format. We count each of the stores in the combo or superstore format as a separate store.\nCompetition\nThe retail apparel and home fashion business is highly competitive. We compete on numerous factors including brand, fashion, price, quality, selection and freshness; in-store and online shopping experience and service; reputation and store location. We compete with local, regional, national and international department, specialty, off-price, discount, warehouse and outlet stores as well as other retailers that sell apparel, home fashions and other merchandise that we sell, whether in stores, online, or through other media or channels.\nHuman Capital\nAs of February 1, 2025, we had approximately\n 364,000\n Associates, many of whom worked less than 40 hours per week. Approximately 86% of these Associates worked in our retail stores. We hire thousands of temporary employees each year, particularly during the peak back-to-school and holiday seasons. We offer positions at a variety of levels in our stores, distribution and fulfillment centers, and offices, as well as many opportunities for Associates to grow and advance. Many Associates in our distribution centers in the United States and Canada are covered by collective bargaining agreements and other Associates are members of works councils in Europe. Our large, global workforce supports the execution of our flexible business model, including the timing and frequency of store deliveries and the management of a rapidly changing mix of merchandise in over 5,000 retail stores in nine countries and across six e-commerce sites. We believe our Associates are key to our business success.\n8\nWorkplace and Culture\nWe work to foster a strong, supportive, and inclusive culture so that Associates at TJX feel welcome in the Company, valued for their contributions, and engaged with our business mission. We use defined cultural factors and leadership competencies throughout our global business to express our organizational values, such as inclusion, personal integrity, relationship-building and collaboration, and respect for our business model, and to promote consistency in leadership development, including through our Leadership Development Toolkit. We believe our policies and practices, including our open-door philosophy, encourage open and honest communication and Associate engagement with the business.\nInclusion and Diversity (“I&D”)\nAs a global company appealing to a broad customer demographic and with hundreds of thousands of Associates in several geographies, we recognize the importance of diversity to our Company’s culture. Our global workforce reflects a diversity of races, ethnicities, sexual orientations, gender identities, abilities, religions, with a broad range of backgrounds and experience. We are committed to continuing to build and support an inclusive and diverse workplace. Our global strategies include increasing the representation of diverse talent through our talent pipeline; providing leaders with tools to support difference with awareness, fairness, sensitivity, and transparency; and integrating inclusive behaviors, language and practices throughout the business. Over the past several years, with the benefit of information gathered from Associates through our Global Inclusion Surveys, our teams globally have developed and launched many new programs, including recruitment strategies, training and education, Associate-led I&D advisory boards, and additional Associate Resource Groups. \nTraining and Career Development\nOur culture prioritizes Associate development and advancement within our organization and we have many Associates in managerial positions who have been with the Company for more than 10 years. We are highly focused on teaching and mentoring to support the career growth and success of our Associates, and we believe these efforts have promoted retention, stability, and increased expertise in our workforce. Training happens broadly throughout the organization, from informal mentoring and direct training to a range of career and leadership development programs, such as our TJX University for merchandising Associates.\nCompensation and Rewards\nOur compensation programs are designed to pay our Associates competitively in the market and equitably, based on their skills, qualifications, role and abilities. Our approach to compensation across the organization reflects our global total rewards principles, which include sharing in the success of the Company, encouraging teamwork and collaboration across our global workforce, and being fair and equitable. For fiscal 2025, we continued our One TJX approach to annual incentive compensation, with all eligible Associates measured against global TJX performance goals.\nTrademarks\nWe have the right to use our principal trademarks and service marks, which are TJ Maxx, Marshalls, HomeGoods, Winners, Homesense/HomeSense, TK Maxx and Sierra, in relevant countries. We expect our rights in these trademarks and service marks to endure in locations where we use them for as long as we continue to do so.\nSeasonality\nOur business is subject to seasonal influences. In the second half of the year, which includes the back-to-school and year-end holiday seasons, we generally realize higher levels of sales and income.\nSEC Filings and Certifications\nCopies of our annual reports on Form 10-K, proxy statements, quarterly reports on Form 10-Q and current reports on Form 8-K filed with or furnished to the SEC, and any amendments to those documents, are available free of charge on our website, tjx.com, under “SEC Filings,” as soon as reasonably practicable after they are electronically filed with, or furnished to, the SEC. They are also available free of charge from TJX Global Communications, 770 Cochituate Road, Framingham, Massachusetts 01701. The SEC maintains a website containing all reports, proxies, information statements, and all other information (\nwww.sec.gov\n).\nInformation appearing on tjx.com is not a part of, and is not incorporated by reference in, this Form 10-K.\n9\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nThe following are the executive officers of TJX as of April 2, 2025:\nName\nAge\nOffice and Business Experience\nPeter Benjamin\n62\nSenior Executive Vice President, Group President since February 2025. President, Marmaxx from 2023 to February 2025. Executive Vice President, Chief Merchandising Officer, Marmaxx, from 2015 through 2022. Executive Vice President, Chief Operating Officer, Marmaxx, 2012 to 2015. Executive Vice President, Planning and Allocation, Marmaxx 2011 to 2012. Senior Vice President, Planning and Allocation, Marmaxx, 2004 to 2011. Various merchandising positions with TJX from 1990 to 2004.\nKenneth Canestrari\n63\nSenior Executive Vice President, Group President since September 2014. President, HomeGoods from 2012 to September 2014. Executive Vice President, Chief Operating Officer, HomeGoods from 2008 until 2012. Various financial positions with TJX from 1988 to 2008.\nErnie Herrman\n64\nChief Executive Officer since January 2016. Director since October 2015. President since January 2011. Senior Executive Vice President, Group President from 2008 to 2011. President, Marmaxx from 2005 to 2008. Senior Executive Vice President, Chief Operating Officer, Marmaxx from 2004 to 2005. Executive Vice President, Merchandising, Marmaxx from 2001 to 2004. Various merchandising positions with TJX since joining in 1989.\nJohn Klinger\n60\nSenior Executive Vice President and Chief Financial Officer since February 2024. Executive Vice President and Chief Financial Officer from January 2023 to February 2024. Executive Vice President, Corporate Controller from 2019 to January 2023. Senior Vice President, Corporate Controller from 2014 to 2019. Senior Vice President, Divisional Chief Financial Officer, TJX Europe from 2011 to 2014. Vice President, Corporate Finance from 2011 to 2011. Various financial positions with TJX since joining in 2000.\nCarol Meyrowitz\n71\nExecutive Chairman of the Board since January 2016. Chairman of the Board from June 2015 to January 2016. Chief Executive Officer from January 2007 to January 2016. Director since 2006 and President from October 2005 to January 2011. Consultant to TJX from January 2005 to October 2005. Senior Executive Vice President from March 2004 to January 2005. President, Marmaxx from 2001 to 2005 and Executive Vice President of TJX from 2001 to 2004. Various senior management and merchandising positions with Marmaxx and with Chadwick’s of Boston and Hit or Miss, former divisions of TJX, from 1983 to 2001.\nDouglas Mizzi\n65\nSenior Executive Vice President, Group President since February 2018. President, TJX Canada from October 2011 to February 2018. Managing Director TK Maxx, UK from April 2010 to October 2011. Executive Vice President, Chief Operating Officer, WMI from February 2006 to April 2010. Various store operations positions with TJX from 1988 to 2006.\nThe executive officers hold office until the next annual meeting of the Board in June 2025 and until their successors are elected and qualified.\n10",
    "item1a": "Item 1A in this Form 10-K.",
    "item1b": "ITEM 1B.  Unresolved Staff Comments\nNone.",
    "item1c": "ITEM 1C.  Cybersecurity\nRisk Management and Strategy\nAs a global retailer, we are mindful of the ongoing risks to our IT systems and operations from various sources and have implemented processes to monitor and mitigate these risks. \nWe have adopted a cybersecurity program designed to identify, assess, and manage material risks from cybersecurity threats and have integrated cybersecurity risk into our broader enterprise risk management framework.\n We \nincorporate third-party assessments into our risk management program\n using recognized standards that are relevant to our business and we periodically self-assess various functional areas of our organization.\nWe use a variety of strategies and techniques designed to identify cybersecurity risks and reduce the risk of unauthorized access to our organization’s confidential information (including customer, vendor, and Associate data) and critical business systems. This approach includes various assessment activities (e.g. threat actor emulation and penetration testing), tabletop exercises, security awareness and training activities (e.g. simulated phishing campaigns and specialized training for cybersecurity personnel), encryption of certain types of information, and certain controls governing access to TJX facilities and systems, among other threat- and risk-based safeguards. The scope and level of our risk-based initiatives in these areas varies across functions and across the business.\nWe maintain an Information Management Program that is overseen by our Information Management Steering Committee (the “IMSC”), which is a cross-functional group consisting of senior leaders from areas such as IT, Cybersecurity, Risk and Compliance, Privacy, Legal, and Audit. The IMSC is responsible for developing and updating policies to support TJX’s Information Management Program and enhance the overall privacy, information security, and records management posture of our business. \nWithin our Cybersecurity department, our Security Operations Center provides threat detection and incident response capabilities. We also have an incident response plan which describes roles and responsibilities for internal stakeholders in responding to and escalating potential cybersecurity incidents. We periodically test this plan through tabletop exercises with relevant stakeholders across various functions of our business, including members of senior management. \nWe also have processes in place designed to \nidentify and mitigate risks from third party technology and service providers\n, including, as appropriate, pre-contractual due diligence, review of contractual terms addressing cybersecurity and data protection, and periodic re-assessment based on assessed vendor risk.\n \nBoard of Directors Oversight\nOur \nBoard of Directors\n has oversight of the systems and processes established to report and monitor the most significant risks to our business (including those related to cybersecurity) and administers this oversight with respect to cybersecurity directly and through our Audit and Finance Committee.\n Our Board of Directors has oversight of our enterprise risk management program and, in addition, our Audit and Finance Committee reviews IT and cybersecurity risks and related topics with senior management on at least a quarterly basis. Significant cybersecurity risks identified by our Audit and Finance Committee are reported to the Board for review and consideration. Our Board has also had dedicated sessions during Board meetings on specific cybersecurity topics both led by our IT senior leaders and by outside advisors as part of its cybersecurity oversight practices. Additionally, outside of regular Board and committee meetings, the Chair of the IT Subcommittee of the Audit and Finance Committee meets with senior management (including the Chief Information Security Officer (“CISO”) and the Executive Vice President, Chief Information Officer (“CIO”)) on at least a quarterly basis to remain informed of and support our cybersecurity programs, including our assessment of current threats, defensive efforts, and other organizational initiatives.\n23\nManagement’s Role in Managing Risk\nOur information security program is overseen by our \nCISO\n, who has over thirty-five years of cybersecurity, information governance, and IT experience in critical infrastructure, private industry, and government. Our CISO reports to our CIO, who has more than twenty-eight years of global information technology leadership experience.\n \nOur CISO is informed about and monitors the prevention, detection and mitigation of cybersecurity threats through his management of, and participation in, the cybersecurity risk management and strategy processes described above, including the operation of our incident response plan.\nAs discussed in"
  }
}