{
  "ticker": "TMO",
  "cik": "0000097745",
  "company_name": "THERMO FISHER SCIENTIFIC INC.",
  "filing_date": "2025-02-20",
  "accession": "0000097745-25-000010",
  "primary_doc": "tmo-20241231.htm",
  "item_sections": {
    "item1": "Item 1A.\nItem 1.    Business\nDescription of Business\nThermo Fisher Scientific Inc. (also referred to in this document as “Thermo Fisher,” “we,” the “company,” or the “registrant”) is the world leader in serving science. Our Mission is to enable our customers to make the world healthier, cleaner and safer. We serve customers working in pharmaceutical and biotech companies, hospitals and clinical diagnostic labs, universities, research institutions and government agencies, as well as environmental, industrial, research and development, quality and process control settings. Our global team delivers an unrivaled combination of innovative technologies, purchasing convenience and pharmaceutical services through our industry-leading brands, including Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific, Unity Lab Services, Patheon and PPD.\nWe continuously increase our depth of capabilities across our broad portfolio of innovative products and services and leverage our extensive global channels to address our customers’ needs. We do this through organic investments in research and development, capacity and capabilities and through acquisitions. Our goal is to enable our customers to be more productive in an increasingly competitive business environment, enable them to accelerate innovation, solve their challenges and advance their important work.\nBusiness Segments and Products\nWe report our business in four segments – Life Sciences Solutions, Analytical Instruments, Specialty Diagnostics, and Laboratory Products and Biopharma Services.\nLife Sciences Solutions Segment\nThrough our Life Sciences Solutions segment, we provide an extensive portfolio of reagents, instruments and consumables used in biological and medical research, discovery and production of new drugs and vaccines as well as diagnosis of infection and disease. These products and services are used by customers in pharmaceutical, biotechnology, agricultural, clinical, healthcare, academic, and government markets. Life Sciences Solutions includes three primary businesses – Biosciences, Genetic Sciences, and BioProduction.\nOur biosciences business includes reagents, instruments and consumables that help our customers conduct biological and medical research in areas such as molecular biology and protein biology, discover new drugs and vaccines, and enable the diagnosis of infection and disease. Our genetic sciences business combines a wide variety of instruments and related reagents used to provide high-value genomic and proteomic solutions to assist customer decisions in the research, clinical, healthcare and applied markets. Our bioproduction business supports developers and manufacturers of biological-based therapeutics and vaccines with a portfolio of premium solutions and services focused on upstream cell culture, downstream purification, analytics for detection and quantitation of process/product impurities, and a suite of single-use solutions spanning the biologics workflow.\n3\nTHERMO FISHER SCIENTIFIC INC.\nAnalytical Instruments Segment\nThrough our Analytical Instruments segment, we provide a broad offering of instruments and the supporting consumables, software and services that are used for a range of applications. These products and services are used by customers in pharmaceutical, biotechnology, academic, government, environmental and other research and industrial markets, as well as the clinical laboratory. This segment includes three primary businesses – Chromatography and Mass Spectrometry, Chemical Analysis, and Electron Microscopy.\nOur chromatography and mass spectrometry business develops and provides analytical instrumentation for organic and inorganic sample analysis across both applied technologies and scientific research. Our chemical analysis products fall into three main categories: production, process and analytics; field and safety instruments; and environmental and process instruments. Our electron microscopy business serves customers in the life sciences, materials sciences, and semiconductor markets providing leading research tools; and also, in the semiconductor market provides integrated workflows that power research and development and production solutions.\nSpecialty Diagnostics Segment\nOur Specialty Diagnostics segment offers a wide range of diagnostic test kits, reagents, culture media, instruments and associated products to serve customers in healthcare, clinical, pharmaceutical, industrial, and food safety laboratories. Our healthcare products are used to increase the speed and accuracy of diagnoses, which improves patient care in a more cost-efficient manner. This segment has five primary businesses – Clinical Diagnostics, ImmunoDiagnostics, Microbiology, Transplant Diagnostics and our Healthcare Market Channel. \nOur clinical diagnostics products include a broad offering of liquid, ready-to-use and lyophilized immunodiagnostic reagent kits, calibrators, controls, protein detection assays, and instruments.  Such products are used for, among other things, drugs-of-abuse testing, therapeutic drug monitoring, thyroid hormone testing, sepsis screening, serum toxicity, first trimester screening, tumor markers testing, and the diagnosis and monitoring of multiple myeloma. Our immunodiagnostics offerings include developing, manufacturing and marketing complete blood-test systems to support the clinical diagnosis and monitoring of allergy, asthma and autoimmune diseases. Our microbiology offerings include dehydrated and prepared culture media, collection and transport systems, instrumentation and consumables to detect pathogens in blood, diagnostic and rapid direct specimen tests, quality-control products and associated products for the microbiology laboratory. Our transplant diagnostics products include human leukocyte antigen typing and testing for the organ transplant market. Our healthcare market channel offerings include a broad array of consumables, diagnostic kits and reagents, equipment, instruments, solutions and services for hospitals, clinical laboratories, reference laboratories, physicians’ offices and other clinical testing facilities. \nLaboratory Products and Biopharma Services Segment\nOur Laboratory Products and Biopharma Services segment offers virtually everything needed for the laboratory. Our unique combination of self-manufactured and sourced products and extensive service offering enables our customers to focus on their core activities and helps them to be more innovative, productive and cost-efficient. The segment also includes a comprehensive offering of outsourced services used by the pharmaceutical and biotech industries for drug development, clinical research, clinical trials services and commercial drug manufacturing. We serve the pharmaceutical, biotechnology, academic, government and other research and industrial markets, as well as the clinical laboratory market through four key businesses: Laboratory Products, Research and Safety Market Channel, Pharma Services and Clinical Research.\nOur laboratory products include lab consumables, equipment and chemicals that are used for life science research and drug discovery and development to advance the prevention and cure of diseases and enhance quality of life. Our research and safety market channel offers a mix of products that are manufactured by Thermo Fisher, by third parties for us on a private-label basis, and by third parties under their brands but offered for sale through us. Our pharma services business provides the entire spectrum of development, manufacturing and clinical trials services for both small-molecule and large-molecule pharmaceuticals. Our clinical research business offers comprehensive, integrated clinical development and analytical services including all phases of development (i.e., Phases I-IV), peri- and post-approval and site and patient access services.\nSales and Marketing\nWe market and sell our products and services through a direct sales force, customer-service professionals, electronic commerce and third-party distributors. Our global team delivers a combination of innovative technologies, purchasing convenience and pharmaceutical services through our industry-leading brands, including Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific, Unity Lab Services, Patheon and PPD.\nWe have approximately 15,000 sales personnel including highly trained technical specialists who enable us to better meet the needs of our more technical end-users. We also provide customers with product standardization and other supply-chain-management services to reduce procurement costs.\n4\nTHERMO FISHER SCIENTIFIC INC.\nNew Products and Research and Development\nOur business includes the development and introduction of new products and may include entry into new business segments. We anticipate that we will continue to make significant expenditures for research and development as we seek to provide a continuing flow of innovative products to maintain and improve our competitive position.\nResources\nRaw Materials\nOur management team believes that we have a readily available supply of raw materials for all of our significant products from various sources. No single supplier is material, although for reasons of quality assurance, regulatory requirements, cost effectiveness, availability or uniqueness of design, certain materials components may be sourced from a single supplier or a limited number of suppliers that can readily provide such materials or components.\nRaw material and fuel prices are subject to fluctuations due to market conditions. We employ many strategies, including the use of alternative materials, to mitigate the effect of these fluctuations on our results.\nPatents, Licenses and Trademarks\nPatents are important in many aspects of our business. No particular patent, or related group of patents, is so important, however, that its loss would significantly affect our operations as a whole. Where appropriate, we seek patent protection for inventions and developments made by our personnel that are incorporated into our products or otherwise fall within our fields of interest. Patent rights resulting from work sponsored by outside parties do not always accrue exclusively to the company and may be limited by agreements or contracts.\nWe protect some of our technology as trade secrets and, where appropriate, we use trademarks or register trademarks used in connection with products. We also enter into license agreements with others to grant and/or receive rights to intellectual property rights.\nAll trademarks, trade names, product names, graphics and logos of Thermo Fisher contained herein are trademarks or registered trademarks of Thermo Fisher or its subsidiaries, as applicable, in the United States and/or other countries. Solely for convenience, we may refer to trademarks in this Annual Report on Form 10-K without the ™ and ® symbols. Such references are not intended to indicate, in any way, that we will not assert, to the fullest extent permitted by law, our rights to our trademarks. To the extent other trademarks appear in this Annual Report on Form 10-K, they are the property of their respective owners.\nSeasonal Influences\nRevenues in the fourth quarter are historically stronger than in other quarters due to the capital spending patterns of industrial, pharmaceutical and government customers. Sales of seasonal products, such as allergy and flu tests and related diagnostic products, vary quarter to quarter and year to year. \nCompetition\nThe company encounters aggressive and able competition in virtually all of the markets we serve. Because of the diversity of our products and services, we face many different types of competitors and competition. Our competitors include a broad range of manufacturers, third-party distributors and service providers. Competitive climates in many of the markets we serve are characterized by changing technology and customer demands that require continuing research and development. Our success primarily depends on the following factors:\n•\ntechnical performance and advances in technology that result in new products and improved price/performance ratios;\n•\nproduct differentiation, availability and reliability;\n•\nthe depth of our capabilities;\n•\nour reputation among customers as a quality provider of products and services;\n•\ncustomer service and support;\n•\nactive research and application-development programs; and\n•\nrelative prices of our products and services.\n5\nTHERMO FISHER SCIENTIFIC INC.\nGovernment Regulation\nEnvironmental Regulations\nWe are subject to various laws and governmental regulations concerning environmental matters and employee safety and health in the United States and other countries. U.S. federal environmental legislation that affects us includes the Toxic Substances Control Act, the Resource Conservation and Recovery Act, the Clean Air Act, the Clean Water Act, the Safe Drinking Water Act, and the Comprehensive Environmental Response Compensation and Liability Act (CERCLA). We are also subject to regulation by the Occupational Safety and Health Administration (OSHA) concerning employee safety and health matters. The United States Environmental Protection Agency (USEPA), OSHA, and other federal agencies have the authority to promulgate regulations that have an effect on our operations.\nIn addition to these federal laws and regulations, various states have been delegated certain authority under the aforementioned federal statutes and have authority over these matters under state laws. Many state and local governments have adopted environmental and employee safety and health laws and regulations, some of which are similar to federal requirements.\nA number of our operations involve the handling, manufacturing, use or sale of substances that are or could be classified as toxic or hazardous materials within the meaning of applicable laws. Consequently, some risk of environmental harm is inherent in our operations and products, as it is with other companies engaged in similar businesses.\nOur expenses for environmental requirements are incurred generally for ongoing compliance and historical remediation matters. Based on current information, we believe that these compliance costs are not material. For historical remediation obligations, our expenditures relate primarily to the cost of permitting, installing, and operating and maintaining groundwater-treatment systems and other remedial measures.\nOur Fair Lawn and Somerville, New Jersey facilities entered into administrative consent orders with the New Jersey Department of Environmental Protection in 1984 to maintain groundwater-remediation activities at these sites, and are currently under the State’s Licensed Site Remediation Professional Program. As the owner of the Fair Lawn facility, we are listed as a potentially responsible party for remediation within an area called the Fair Lawn Wellfields Superfund Site, and, in 2008, the company and certain other parties entered into a consent order with the USEPA to complete a Remedial Investigation/Feasibility Study. In 2018, the USEPA issued a Record of Decision, setting forth the scope of required remediation work at the site, which includes upgrading a water treatment plant to address constituents such as chlorinated organic compounds, 1,4-dioxane, and perfluorooctanoic acid/perfluorooctane sulfonate (PFOA/PFOS). In 2020, the court approved a consent decree that requires the company and another responsible party to finance and perform the required remediation work with USEPA oversight. In 2023, the design of a groundwater treatment plant was fully approved by USEPA. Construction commenced in 2024, and the plant is expected to be fully operating by April 2025.\nIn 2011, our Life Technologies subsidiary entered into a consent decree with the USEPA and other responsible parties to implement a groundwater remedy at the former Davis Landfill Superfund site in Smithfield, Rhode Island. After years of additional study, in September, 2020, USEPA revised its cleanup plan by selecting an interim remedial approach that includes groundwater treatment followed by additional monitoring of site conditions. Depending on the results of these treatment and monitoring activities over the next several years, USEPA anticipates selecting a final groundwater remedy for the site. In November 2021, the 2011 consent decree was amended to reflect the parties’ obligations to implement USEPA’s interim remedy, for which pre-design work commenced during 2022 and is ongoing.\nWe record accruals for environmental liabilities based on current interpretations of environmental laws and regulations when it is probable that a liability has been incurred and the amount of such liability can be reasonably estimated. We calculate estimates based upon several factors, including reports prepared by environmental specialists and management’s knowledge and experience with these environmental matters. We include in these estimates potential costs for investigation, remediation and operation and maintenance of cleanup sites. Accrued liabilities for environmental matters totaled $81 million at December 31, 2024.\nThese environmental liabilities do not include third-party recoveries to which we may be entitled. We believe that our accrual is adequate for the environmental liabilities we currently expect to incur. As a result, we believe that our ultimate liability with respect to environmental matters will not have a material adverse effect on our financial position, results of operations or cash flows. However, we may be subject to remedial or compliance costs due to future events, such as changes in existing laws and regulations, changes in agency direction or enforcement policies, developments in remediation technologies, changes in the conduct of our operations, and the effect of changes in accounting rules, which could have a material adverse effect on our financial position, results of operations or cash flows. For a discussion of the environmental laws and regulations that the Company’s operations, products and services are subject to and other environmental contingencies, refer to Note 5 to our Consolidated Financial Statements.\n6\nTHERMO FISHER SCIENTIFIC INC.\nOther Laws and Regulations\nOur operations, and some of the products and services we offer, are subject to a number of complex and stringent laws and regulations governing the development, testing, approval, production, handling, transportation and distribution of chemicals, drugs and other similar products, including the operating and security standards of the Food and Drug Administration, the Drug Enforcement Administration, the Bureau of Alcohol, Tobacco, Firearms and Explosives, and various state boards of pharmacy as well as comparable state and foreign agencies. As Thermo Fisher’s businesses also include export and import activities, we are subject to pertinent laws enforced by the U.S. Departments of Commerce, State and Treasury. In addition, our logistics activities must comply with the rules and regulations of the Department of Transportation, the Federal Aviation Administration and similar foreign agencies. While we believe we are in compliance in all material respects with such laws and regulations, any noncompliance could result in substantial fines or otherwise restrict our ability to provide competitive distribution services and thereby have an adverse effect on our financial condition. To date, no such laws or regulations have had a material impact on our operations.\nWe are subject to laws and regulations governing government contracts, and failure to address these laws and regulations or comply with government contracts could harm our business by leading to a reduction in revenues associated with these customers. We have agreements relating to the sale of our products to government entities and, as a result, we are subject to various statutes and regulations that apply to companies doing business with the government. We are also subject to investigation for compliance with the regulations governing government contracts. A failure to comply with these regulations could also result in suspension of these contracts, criminal, civil and administrative penalties or debarment.\nFor a discussion of risks related to changes in governmental regulations, refer to “\nRisk Factors\n” in Part I,",
    "item1a": "Item 1A.\n \nCybersecurity Governance and Oversight\nThe Board of Directors has delegated the oversight of cybersecurity risks to the \nAudit Committee\n.\n Our cybersecurity program is led by the company’s senior vice president, chief information officer, along with our vice president, chief information security officer (CISO). \nManagement provides an operational update to the Audit Committee each quarter.\n In addition, the Audit Committee and our full Board of Directors receive an annual overview of the cybersecurity program, cybersecurity threat landscape, investments, and opportunities to enhance the company’s systems and security of products and operations.\n \nThe company’s corporate IT security team leads the company-wide cybersecurity strategy and advocates to protect the\n company systems, its employees and customers against cybersecurity risks. Through annual internal and external audits, we maintain an ISO/IEC 27001:2013 certification for the management of our cybersecurity program consisting of the following areas: \n•\ncybersecurity program management and governance including risk management; \n•\ncybersecurity operations including security operation centers; \n•\nproduct security; \n•\nsecurity investigations; \n•\ncybersecurity architecture and engineering; and  \n•\nsecurity awareness and training. \nOur senior vice president, chief information officer, vice president, CISO, and vice president, chief product security officer have each served in various roles in IT and information security for over 20 years. These individuals’ knowledge and experience along with the culture and talent of the corporate IT security team organization are instrumental in developing and executing our cybersecurity strategies.\n The CISO meets with senior leadership to review and discuss the cybersecurity program, including emerging cybersecurity risks, threats and industry trends.\nCybersecurity is integrated into the risk management process for the company through various corporate mechanisms, including quarterly business reviews, annual budget planning, and targeted risk-based engagements.",
    "item1b": "Item 1B.    Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.    Cybersecurity\nCybersecurity Risk Management and Strategy \nAs is the case for most large global companies, we are regularly subject to cyberattacks and other cybersecurity incidents and, therefore, we incorporate cybersecurity into our overall risk management process. Our commitment to cybersecurity emphasizes using a risk-based, “defense in depth” approach to assess, educate, block, identify, respond to and recover from cybersecurity threats. Recognizing that no single technology, process or control can effectively prevent or mitigate all risks, we employ a strategy of technologies, processes and controls, all working independently but as part of a cohesive strategy to manage or reduce risk.  \nOur cybersecurity program assists in the management of risks associated with the confidentiality, integrity and availability of data and systems within the company environment to effectively support our business objectives and customer expectations. The program provides guidance to business stakeholders on cybersecurity risks as input into their risk management processes that balance cybersecurity risk with other important risks that may include strategic, regulatory, economic and financial considerations. \nWe seek to routinely refine our cybersecurity approach to adapt to changes in the threat landscape and manage emerging security risks. \nIn order to evaluate risks from cybersecurity threats associated with the company’s use of certain third-party technology providers, we have incorporated a risk-based assessment into the corporate information technology (IT) procurement process designed to assess the security risk of certain third parties providing new technology solutions to our environment.\n \n17\nTHERMO FISHER SCIENTIFIC INC.\nWe believe cybersecurity is the responsibility of every employee, and regularly educate and share best practices with our employees to raise awareness of cybersecurity threats through a security awareness training program, including regular exercises, periodic cyber-event simulations and annual attestation to our Technology Acceptable Use Policy.\n \nWe do not reasonably believe there are currently any cybersecurity incidents that have materially affected or are reasonably likely to materially affect the company or its business strategy, results of operations or financial condition. For more information on the risks related to our IT systems, see “A significant disruption in, or breach in security of, our IT systems or violation of data privacy laws could adversely affect our business or customers that use our products” under the heading “Risk Factors” in Part I,"
  }
}