{
  "ticker": "TPL",
  "cik": "0001811074",
  "company_name": "Texas Pacific Land Corp",
  "filing_date": "2025-02-19",
  "accession": "0001811074-25-000044",
  "primary_doc": "tpl-20241231.htm",
  "item_sections": {
    "item1": "Item 1, “Business — Recent Developments” for further discussion of our acquisition activity during 2024.\nDevelopment of New Solutions for Produced Water and Capital Expenditures\nIn May 2024, we announced our progress towards developing new solutions for produced water in the Permian Basin. Over the last few years, we have been working with a leading industrial technology and manufacturing firm to develop an energy-efficient desalination and treatment process and associated equipment that can recycle produced water into fresh water with quality standards appropriate for surface discharge and beneficial reuse.  During the year ended December 31, 2024, we spent $9.9 million on this energy-efficient desalination and treatment process and equipment, of which $7.4 million was capitalized.  See the discussion in Part I, Item 1, “Business — Business Segments” for additional information.\nAdditionally, during the year ended December 31, 2024, we invested approximately $21.7 million to maintain and/or enhance our water sourcing assets. \nCash Flows from Operating Activities\nFor the years ended December 31, 2024 and 2023, net cash provided by operating activities was $490.7 million and $418.3 million, respectively.  Our cash flow provided by operating activities is primarily from oil, gas and produced water royalties, water and land sales, easements, and other surface-related income.  Cash flow used in operations generally consists of operating expenses associated with our revenue streams, general and administrative expenses and income taxes. \nThe increase in cash flows provided by operating activities for the year ended December 31, 2024 compared to the same period of 2023 was primarily driven by an increase in operating income and changes in working capital requirements.\n \nCash Flows Used in Investing Activities \nFor the years ended December 31, 2024 and 2023, net cash used in investing activities was $471.7 million and $60.3 million, respectively.  Our cash flows used in investing activities are primarily related to acquisitions and capital expenditures related to our water services and operations segment.  Our acquisitions may include land, royalty interests and other similar tangible and intangible assets.\nFor further information regarding acquisitions during the year ended December 31, 2024, see “Acquisition Activity” above.  Capital expenditures for the years ended December 31, 2024 and 2023 were $29.7 million and $15.0 million, respectively.\n23\nTable of \nContents\nCash Flows Used in Financing Activities\nFor the years ended December 31, 2024 and 2023, net cash used in financing activities was $378.1 million and $144.6 million, respectively.  Our cash flows used in financing activities principally consist of activities that return capital to our stockholders such as payments of dividends and repurchases of our Common Stock.\nDuring the year ended December 31, 2024, we paid total dividends of $347.3 million, consisting of cumulative regular cash dividends of $5.11 per share and a special dividend of $10.00 per share.  During the year ended December 31, 2023, we paid total dividends of $100.0 million consisting of cumulative regular cash dividends of $4.33 per share.  We repurchased $29.2 million and $42.4 million of our Common Stock (in each case, including share repurchases not settled at the end of the period) during the years ended December 31, 2024 and 2023, respectively.\nResults of Operations - Consolidated\nThe following table shows our consolidated results of operations and our results of operations by reportable segment for Land and Resource Management (“LRM”) and Water Service and Operations (“WSO”) for the years ended December 31, 2024 and 2023 (in thousands):\n \nYears Ended December 31,\n \n2024\n2023\nLRM\nWSO\nConsolidated\nLRM\nWSO\nConsolidated\nRevenues:\nOil and gas royalties\n$\n373,331 \n$\n— \n$\n373,331 \n$\n357,394 \n$\n— \n$\n357,394 \nWater sales\n— \n150,724 \n150,724 \n— \n112,203 \n112,203 \nProduced water royalties\n— \n104,123 \n104,123 \n— \n84,260 \n84,260 \nEasements and other surface-related income\n63,074 \n10,183 \n73,257 \n67,905 \n3,027 \n70,932 \nLand sales\n4,388 \n— \n4,388 \n6,806 \n— \n6,806 \nTotal revenues\n440,793 \n265,030 \n705,823 \n432,105 \n199,490 \n631,595 \nExpenses:\nSalaries and related employee expenses\n27,493 \n26,128 \n53,621 \n21,945 \n21,439 \n43,384 \nWater service-related expenses\n— \n46,124 \n46,124 \n— \n33,566 \n33,566 \nGeneral and administrative expenses\n25,531 \n8,952 \n34,483 \n39,078 \n7,372 \n46,450 \nDepreciation, depletion and amortization\n10,968 \n14,194 \n25,162 \n3,073 \n11,684 \n14,757 \nAd valorem and other taxes\n7,257 \n38 \n7,295 \n7,382 \n3 \n7,385 \nTotal operating expenses\n71,249 \n95,436 \n166,685 \n71,478 \n74,064 \n145,542 \nOperating income\n369,544 \n169,594 \n539,138 \n360,627 \n125,426 \n486,053 \nOther income, net\n31,707 \n7,976 \n39,683 \n30,384 \n1,124 \n31,508 \nIncome before income taxes\n401,251 \n177,570 \n578,821 \n391,011 \n126,550 \n517,561 \nIncome tax expense\n86,350 \n38,511 \n124,861 \n84,305 \n27,611 \n111,916 \nNet income\n$\n314,901 \n$\n139,059 \n$\n453,960 \n$\n306,706 \n$\n98,939 \n$\n405,645 \nYear Ended December 31, 2024\n \nCompared to\n \nYear Ended December 31, 2023\nConsolidated Revenues and Net Income:\nTotal revenues increased $74.2 million, or 11.8%, to $705.8 million for the year ended December 31, 2024 compared to $631.6 million for the year ended December 31, 2023.  This increase was principally due to the $38.5 million increase in water sales, the $19.9 million increase in produced water royalties and the $15.9 million increase in oil and gas royalty revenue in 2024 over 2023.  Individual revenue line items are discussed below under “Segment Results of Operations.”  Net income of $454.0 million for the year ended December 31, 2024 was 11.9% higher than 2023, principally as a result of the increase in total revenues, partially offset by an increase in operating expenses, as discussed below.\n24\nTable of \nContents\nConsolidated Expenses:\nSalaries and related employee expenses\n.  Salaries and related employee expenses were $53.6 million for the year ended December 31, 2024 compared to $43.4 million for 2023.  The number of employees increased from 100 at December 31, 2023 to 111 as of December 31, 2024, which, when coupled with market compensation adjustments effective at the beginning of 2024, resulted in increased salary and related employee expenses for the year ended December 31, 2024 compared to 2023.  Additionally, contract labor expenses for the year ended December 31, 2024 increased over 2023, principally as a result of the 34.3% increase in water sales over the same period.\nWater service-related expenses\n.  Water service-related expenses increased $12.6 million to $46.1 million for the year ended December 31, 2024 compared to 2023.  Certain types of water service-related expenses, including, but not limited to, treatment, transfer, water purchases, repairs and maintenance, equipment rental, and fuel costs vary from period to period as our customers’ needs and requirements change.  Right of way and other expenses also vary from period to period depending on the location of customer delivery.  The increase in water service-related expenses for the year ended December 31, 2024 was principally related to a 34.3% increase in water sales over 2023, primarily as a result of increased water volumes.  Research and development expenses related to development of a new energy-efficient method of produced water desalination and treatment were $2.5 million and $1.2 million for the years ended December 31, 2024 and 2023, respectively.  For further discussion of this new treatment method, see “Liquidity and Capital Resources — Development of New Solutions for Produced Water and Capital Expenditures” above.\nGeneral and administrative expenses.  \nGeneral and administrative expenses decreased $12.0 million to $34.5 million for the year ended December 31, 2024 from $46.5 million for the same period of 2023.  The decrease in general and administrative expenses during the year ended December 31, 2024 compared to the same period of 2023 was principally related to a reduction in legal and professional fees associated with stockholder matters that occurred during 2023.\nDepreciation, depletion and amortization\n.  Depreciation, depletion and amortization was $25.2 million for the year ended December 31, 2024 compared to $14.8 million for the year ended December 31, 2023.  The increase is principally due to additional depletion expense associated with royalty interests acquired in August 2024 and October 2024, as well as additional amortization expense associated with intangible assets acquired in August 2023 and August 2024.\nOther income, net.\n  Other income, net was $39.7 million and $31.5 million for the years ended December 31, 2024 and 2023, respectively.  The increase in other income, net was primarily related to increased interest income earned on our cash balances during 2024.  Higher interest yields during the year ended December 31, 2024 contributed to the increase in interest income.  Additionally, during the year ended December 31, 2024, we recorded a curtailment and settlement gain of $4.6 million related to the Company’s pension plan.  See further discussion at Note 8, “Pension and Other Postretirement Benefits” in the notes to our consolidated financial statements included under Part II, Item 8, “Financial Statements and Supplementary Data.”\nTotal income tax expense.\n  Total income tax expense was $124.9 million and $111.9 million for the years ended December 31, 2024 and 2023, respectively.  The increase in income tax expense was primarily related to increased operating income resulting from increased consolidated revenues.\nSegment Results of Operations\nWe operate our business in two reportable segments: Land and Resource Management and Water Services and Operations.  We eliminate any inter-segment revenues and expenses, if any, upon consolidation.\n \nWe evaluate the performance of our operating segments separately to monitor the different factors affecting financial results.  The reportable segments presented are consistent with our reportable segments discussed in Note 15, “Business Segment Reporting” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”  We monitor our reporting segments based upon revenue and net income calculated in accordance with accounting principles generally accepted in the United States of America (“GAAP”).\nOur oil and gas royalty revenue, and, in turn, our results of operations for the year ended December 31, 2024 have been impacted by lower average commodity prices compared to 2023.  However, our oil and gas royalty revenues increased for the year ended December 31, 2024 due to increased royalty production.  Additionally, revenues derived from water sales and produced water royalties for the year ended December 31, 2024 were also positively impacted by our active management of our surface and royalty interests in recent years. \n25\nTable of \nContents\nYear Ended December 31, 2024\n \nCompared to\n \nYear Ended December 31, 2023 \nLand and Resource Management\nLand and Resource Management segment revenues increased $8.7 million, or 2.0%, to $440.8 million for the year ended December 31, 2024 as compared to 2023.  The increase in Land and Resource Management segment revenues was related to a $15.9 million increase in oil and gas royalty revenue, partially offset by a decrease in easements and other surface-related income of $4.8 million and a decrease in land sales of $2.4 million for the year ended December 31, 2024 compared to  2023.  \nOil and gas royalties\n.  Oil and gas royalty revenue was $373.3 million for the year ended December 31, 2024 compared to $357.4 million for the year ended December 31, 2023, an increase of 4.5%.  Oil and gas royalties for the year ended December 31, 2023 included an $8.7 million recovery with an operator with respect to unpaid oil and gas royalties for older production periods.  Excluding the impact of the $8.7 million recovery on 2023 revenue, oil and gas royalties for the year ended December 31, 2024 increased $24.6 million due to increased production volumes over 2023.  Our share of production volumes increased to 26.8 thousand Boe per day for the year ended December 31, 2024 compared to 23.5 thousand Boe per day for 2023.  The average realized prices decreased to $39.87 per Boe for the year ended December 31, 2024 from $42.58 per Boe for 2023.\nThe table below provides financial and operational data by royalty stream for the years ended December 31, 2024 and 2023:\nYears Ended December 31,\n2024\n2023\n(2)\nOur share of production volumes \n(1)\n:\nOil (MBbls)\n4,118 \n3,701 \nNatural gas (MMcf)\n17,074 \n14,528 \nNGL (MBbls)\n2,841 \n2,453 \nEquivalents (MBoe)\n9,804 \n8,575 \nEquivalents per day (MBoe/d)\n26.8 \n23.5 \nOil and gas royalties (in thousands):\nOil royalties\n$\n298,074 \n$\n273,304 \nNatural gas royalties\n18,512 \n29,915 \nNGL royalties\n56,745 \n45,510 \nTotal oil and gas royalties\n$\n373,331 \n$\n348,729 \nRealized prices:\nOil ($/Bbl)\n$\n75.80 \n$\n77.33 \nNatural gas ($/Mcf)\n$\n1.17 \n$\n2.23 \nNGL ($/Bbl)\n$\n21.60 \n$\n20.05 \nEquivalents ($/Boe)\n$\n39.87 \n$\n42.58 \n(1)    Commonly used definitions in the oil and gas industry not previously defined: MBbls represents one thousand barrels of crude oil, condensate or NGLs.  Mcf represents one thousand cubic feet of natural gas.  MMcf represents one million cubic feet of natural gas.  MBoe represents one thousand Boe.  MBoe/d represents one thousand Boe per day.\n(2)    The metrics and dollars provided for the year ended December 31, 2023\n \nexclude the impact of the $8.7 million\n recovery\n of oil and gas discussed above.\nEasements and other surface-related income.\n  Easements and other surface-related income was $63.1 million for the year ended December 31, 2024, a decrease of 7.1% compared to $67.9 million for the year ended December 31, 2023.  Easements and other surface-related income includes revenue related to the use and crossing of our land for oil and gas \n26\nTable of \nContents\nexploration and production, renewable energy, and agricultural operations.  The decrease in easements and other surface-related income was principally related to a decrease of $5.1 million in wellbore easements for the year ended December 31, 2024 compared to 2023.  Easements and other surface-related income is dependent on development decisions made by companies that operate in the areas where we own land and is, therefore, unpredictable and may vary significantly from period to period.  See “Permian Basin Activity” above for additional discussion of development activity in the Permian Basin during the year ended December 31, 2024.\nLand sales\n.  Land sales were $4.4 million and $6.8 million for the years ended December 31, 2024 and 2023, respectively.  For the year ended December 31, 2024, we sold 439 acres of land for an aggregate sales price of $4.4 million.  For the year ended December 31, 2023, we sold 18,061 acres of land for an aggregate sales price of approximately $6.8 million.\n \nNet income.\n  Net income for the Land and Resource Management segment increased to $314.9 million for the year ended December 31, 2024 compared to $306.7 million for 2023.  Segment operating income increased $8.9 million for the year ended December 31, 2024 compared to 2023.  The increase was principally due to a $15.9 million increase in oil and gas royalty revenue and a $13.5 million decrease in general and administrative expenses, partially offset by increased depletion expense and salaries and related employee expenses.  Expenses are discussed further above under “Results of Operations — Consolidated.”\n \nWater Services and Operations\n \nWater Services and Operations segment revenues increased 32.9%, to $265.0 million for the year ended December 31, 2024 compared to $199.5 million for 2023.  The increase in Water Services and Operations segment revenues was principally due to increases in water sales revenue and produced water royalties, which are discussed below.  As discussed in “Market Conditions” and “Permian Basin Activity” above, our segment revenues are directly influenced by development decisions made by our customers and the overall activity level in the Permian Basin.  Accordingly, our segment revenues and sales volumes, as further discussed below, will fluctuate from period to period based upon those decisions and activity levels.\n \nWater sales\n.  Water sales revenue increased $38.5 million, or 34.3% to $150.7 million for the year ended December 31, 2024 compared to 2023.  The growth in water sales was principally due to an increase of 31.0% in water sales volumes for the year ended December 31, 2024 compared to the year ended December 31, 2023.\nProduced water royalties.\n  Produced water royalties are royalties received from the transfer or disposal of produced water on our land.  Produced water royalties are contractual and not paid as a matter of right.  We do not operate any saltwater disposal wells. Produced water royalties were $104.1 million  for the year ended December 31, 2024 compared to $84.3 million in 2023.  This increase was principally due to increased produced water volumes for the year ended December 31, 2024 compared to 2023.\nEasements and other surface-related income\n.  Easements and other surface-related income was $10.2 million for the year ended December 31, 2024, an increase of $7.2 million compared to $3.0 million for the year ended December 31, 2023.  The increase in easements and other surface-related income primarily related to an increase in temporary permits for sourced water lines for the year ended December 31, 2024 compared to 2023.\n \nNet income\n.  Net income for the Water Services and Operations segment was $139.1 million for the year ended December 31, 2024 compared to $98.9 million for the year ended December 31, 2023.  Segment operating income increased $44.2 million for the year ended December 31, 2024 compared to 2023.  The increase was principally due to a $65.5 million increase in segment revenues which were partially offset by a $12.6 million increase in water service-related expenses and a $10.9 million increase in income tax expense.  Expenses are discussed further above under “Results of Operations — Consolidated.”\nNon-GAAP Performance Measures\n \nIn addition to amounts presented in accordance with GAAP, we also present certain supplemental non-GAAP performance measurements.  These measurements are not to be considered more relevant or accurate than the measurements presented in accordance with GAAP.  In compliance with the requirements of the SEC, our non-GAAP measurements are reconciled to net income, the most directly comparable GAAP performance measure.  For all non-GAAP measurements, neither the SEC nor any other regulatory body has passed judgment on these non-GAAP measurements.\n27\nTable of \nContents\nEBITDA, Adjusted EBITDA and Free Cash Flow\nEBITDA is a non-GAAP financial measurement of earnings before interest expense, taxes, depreciation, depletion and amortization.  The purpose of presenting EBITDA is to highlight earnings without finance, taxes, and depreciation, depletion and amortization expense, and its use is limited to specialized analysis.  We calculate Adjusted EBITDA as EBITDA plus employee share-based compensation and less pension curtailment and settlement gain.  The pension curtailment and settlement gain is related to a buyout by a third party of defined benefit obligations under our pension plan and the subsequent freezing of our pension plan, both of which occurred in the fourth quarter of 2024.  We have excluded the pension curtailment and settlement gain from the calculation of Adjusted EBITDA as such gain is a non-recurring item and is not related to our core business.  The purpose of presenting Adjusted EBITDA is to highlight earnings without non-cash activity such as share-based compensation and other non-recurring or unusual items, if applicable.  We calculate free cash flow as Adjusted EBITDA less current income tax expense and capital expenditures.  The purpose of presenting free cash flow is to provide an additional measure of operating performance.  We have presented EBITDA, Adjusted EBITDA and free cash flow because we believe that these metrics are useful supplements to net income in analyzing the Company's operating performance.  Our definitions of EBITDA, Adjusted EBITDA and free cash flow may differ from computations of similarly titled measures of other companies.\nThe following table presents a reconciliation of EBITDA, Adjusted EBITDA and free cash flow to net income for the years ended December 31, 2024 and 2023 (in thousands):\nYears Ended December 31,\n2024\n2023\n Net income \n$\n453,960 \n$\n405,645 \n Add: \nIncome tax expense \n124,861 \n111,916 \nDepreciation, depletion and amortization\n25,162 \n14,757 \n EBITDA \n603,983 \n532,318 \n Add (deduct):\nEmployee share-based compensation\n11,364 \n9,124 \nPension curtailment and settlement gain\n(4,616)\n— \nAdjusted EBITDA\n610,731 \n541,442 \nDeduct:\nCurrent income tax expense\n(120,257)\n(110,517)\nCapital expenditures\n(29,423)\n(15,431)\nFree Cash Flow\n$\n461,051 \n$\n415,494 \nOff-Balance Sheet Arrangements\nThe Company has not engaged in any off-balance sheet arrangements.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements.  It is our opinion that we fully disclose our significant accounting policies in the notes to the consolidated financial statements.  Consistent with our disclosure policies, we include the following discussion related to what we believe to be our most critical accounting policies that require our most difficult, subjective or complex judgment and estimates.\n \nAccrual of Oil and Gas Royalties\n \nThe Company accrues oil and gas royalties.  An accrual is necessary due to the time lag between the removal of crude oil and natural gas products from the respective mineral reserve locations and generation of the actual payment by operators.  The oil and gas royalty accrual is based upon historical production volumes, estimates of the timing of future payments and recent market prices for oil and gas.  \n \n28\nTable of \nContents\nRecent Accounting Pronouncements\nFor further information regarding recently issued accounting pronouncements, see Note 2, “Summary of Significant Accounting Policies” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk.\n \nThe Company’s financial instruments consist of cash and cash equivalents (primarily consisting of U.S. Treasury Bills and commercial paper), accounts payable and other liabilities and the carrying amounts of these instruments approximate fair value due to the short-term nature of these instruments.\nItem 8. Financial Statements and Supplementary Data.\n \nThe information required by this Item 8 is included in our consolidated financial statements and the notes thereto commencing on page F-1 of this Annual Report on Form 10-K.\nItem 9.  Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\n \nNot applicable.\n \nItem 9A. Controls and Procedures.\n \nEvaluation of Disclosure Controls and Procedures\nWe conducted an evaluation of the effectiveness of our controls and procedures (as defined in \n \nRules 13a-15(e) and 15d-15(e) of the Exchange Act, referred to herein as “Disclosure Controls”) as of December 31, 2024.  The controls evaluation was performed under the supervision and with the participation of management, including our Chief Executive Officer and Chief Financial Officer.\n \nBased upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our Disclosure Controls  were effective as of December 31, 2024.\nManagement’s Annual Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act using the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in \nInternal Control-Integrated\n \nFramework (2013)\n. \n \nOur internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP.\n \nOur management assessed the effectiveness of our internal control over financial reporting as of December 31, 2024.  Based on this assessment, our Chief Executive Officer and Chief Financial Officer concluded our internal control over financial reporting was effective as of December 31, 2024.\nDeloitte & Touche LLP, our independent registered public accounting firm, has audited our internal control over financial reporting as of December 31, 2024.  Deloitte & Touche LLP's opinion appears on the following page.\nChanges in Internal Control over Financial Reporting\nThere have been no changes during the quarter ended December 31, 2024 in the Company’s internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\n29\nTable of \nContents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of Texas Pacific Land Corporation\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Texas Pacific Land Corporation (the “Company”) as of December 31, 2024, based on criteria established in \nInternal Control \n—\n Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).  In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control \n—\n Integrated Framework (2013)\n issued by COSO. \nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2024, of the Company and our report dated February 19, 2025, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management Representation Letter.  Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit.  We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB.  Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.  Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances.  We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.  A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.  Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nDallas, Texas \nFebruary 19, 2025\n30\nTable of \nContents\nItem 9B.\n \nOther Information.\n \n(c) Rule 10b5-1 \nTrading Arrangements\nOn \nNovember 21, 2024\n, \nMurray Stahl\n, a member of our \nBoard,\n on behalf of himself and accounts managed by Horizon Kinetics Asset Management LLC over which Mr. Stahl has a controlling interest, \nadopted\n a “Rule 10b5-1 trading arrangement,” as defined in Item 408 of Regulation S-K that is intended to satisfy the affirmative defense of Rule 10b5-1(c)  promulgated under the Exchange Act, for the purchase of up to \n783\n shares of Common Stock. This Rule 10b5-1 trading arrangement begins February 24, 2025 and is scheduled to expire on the earlier of (i) \nJune 26, 2025\n or (ii) the acquisition of 783 shares of Common Stock.\nOn \nDecember 13, 2024\n, \nChris Steddum\n, our \nChief Financial Officer\n, on behalf of himself and his spouse, \nadopted\n a “Rule 10b5-1 trading arrangement,” as defined in Item 408 of Regulation S-K that is intended to satisfy the affirmative defense of Rule 10b5-1(c)  promulgated under the Exchange Act, for the sale of up to \n1,000\n shares of Common Stock. This Rule 10b5-1 trading arrangement begins March 14, 2025 and is scheduled to expire on the earlier of (i) \nSeptember 15, 2025\n or (ii) the sale of 1,000 shares of Common Stock.\nItem 9C.\n \nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections.\n \nNot applicable.\n31\nTable of \nContents\nPART III\n \nItem 10. Directors, Executive Officers and Corporate Governance.\n \nDirectors \n \nRhys J. Best\n, \n78\n, serves as non-executive Chair of the Board (the “Chair”) and has been a member of the Board since April 15, 2022.  Mr. Best currently serves on the board of Arcosa Inc. (NYSE: ACA) (since 2018), where he serves as the non-executive Chairman of the Board.  Mr. Best previously served on the board of Cabot Oil and Gas Corp. (from 2008 to 2021, including serving as Lead Director in 2021), his term ending after the company merged with Cimarex Energy in 2021 to form Coterra Energy (NYSE: CTRA).  Mr. Best also previously served on the boards of Commercial Metals Company (NYSE: CMC) (from 2010 to 2022), Crosstex Energy, LP, an integrated, multi-commodity midstream enterprise (NASDAQ: XTEX) (from 2004 to 2014, including serving as Chairman of the Board from 2009 to 2014), MRC Global, Inc., a pipe, valve and fitting distribution business (NYSE: MRC) (from 2008 to 2022, including serving as Chairman of the Board from 2016 to 2022), Trinity Industries, Inc. (NYSE: TRN) (from 2005 to 2018, including serving as Presiding Director from 2012 to 2013), and Austin Industries, an employee-owned construction company (from 2007 to 2018, including serving as Chairman of the Board from 2013 to 2018).  Mr. Best is the former Chairman, President and Chief Executive Officer of Lone Star Technologies, Inc., an energy services and supply company, a role he retired from in 2007 after the successful merger with United States Steel Company (NYSE: X).  In 2014, Mr. Best was recognized as Director of the Year by the National Association of Corporate Directors.  Mr. Best’s qualifications to serve as a director include his extensive business experience, including a senior executive at leading companies in the oil and gas industry, and his public company board and corporate governance experience.\nGeneral Donald G. Cook, USAF (Ret.)\n \n78,\n has been a member of the Board since January 11, 2021. General Cook currently serves on the board of Cybernance, Inc. (since 2016).  General Cook previously served on the boards of Crane Co. (NYSE: CR) (from 2005 to 2022), USAA Federal Savings Bank (from 2007 to 2018), U.S. Security Associates Inc., a Goldman Sachs portfolio company (from 2011 to 2018), and Hawker Beechcraft Inc., another Goldman Sachs portfolio company (from 2007 to 2014).  General Cook served on the board of Burlington Northern Santa Fe Railroad for almost five years until it was sold to Berkshire Hathaway in 2010 in a transaction valued at $44 billion.  He is a former senior consultant for Lockheed Martin Corporation. General Cook also serves as a senior advisor to Portage Point Partners and served as a senior advisor to Alvest, a private French aviation firm, from 2022 to 2023.  In addition to his extensive corporate governance experience, General Cook was the former Chairman of the San Antonio advisory board of the NACD Texas TriCities Chapter, a group recognized as the authority on leading boardroom practices.  General Cook had numerous command and high-level staff assignments during his 36-year career with the U.S. Air Force and retired as a four-star General.  He commanded a flying training wing and two space wings, the 20th Air Force (the nation’s nuclear Intercontinental Ballistic Missile force) and was interim Commander of Air Combat Command during the September 11 attacks.  General Cook served as the Chief of the Senate Liaison Office and on the staff of the House Armed Services Committee in the U.S. House of Representatives.  Prior to his retirement from the Air Force in August 2005, General Cook’s culminating assignment was Commander, Air Education and Training Command at Randolph Air Force Base in Texas, where he was responsible for executing the $8 billion annual budget to recruit, train and educate Air Force personnel, safely implementing the 500,000-hour annual flying hour program and providing for the leadership, welfare, and oversight of 90,000 military and civilian personnel in the command.  He was twice awarded the Distinguished Service Medal for exceptional leadership. General Cook’s qualifications to serve as a director include his extensive experience on multiple public company boards and with corporate governance and executive compensation, as well as his senior leadership experience resulting from his tenure of command in the U.S. Air Force.\nGeneral Cook serves on and is the chair of the Nominating and Corporate Governance Committee and also serves on the Compensation Committee.\nBarbara J. Duganier, 66, \nhas been a member of the Board since January 11, 2021. Ms. Duganier currently serves on the boards of CenterPoint Energy (NYSE: CNP), an electric transmission and distribution, natural gas distribution and energy services company, where she chairs the audit committee and serves on the governance, environmental and sustainability committee, and Arcadis NV (Euronext: ARCADIS) where she serves on the sustainability committee and the audit and risk committee. Ms. Duganier also serves on the boards of two private companies: McDermott International, Ltd. (since 2020), a fully integrated provider of engineering and construction solutions to the energy industry; and Pattern Energy Group LP (since 2021), a private renewable energy company focused on wind, solar, transmission and storage. Ms. Duganier previously served on the boards of the general partner of Buckeye Partners, L.P. (NYSE: BPL), a midstream oil and gas master limited partnership, where she chaired the audit committee until the company’s sale in November 2019; of Noble Energy (NASDAQ: NBL), an exploration and production company, until the company’s sale in October 2020; of West Monroe Partners, a management and technology consulting firm, where she was the lead independent director until the sale of the company in November 2021; and of MRC Global Inc. (NYSE: MRC) (2015-2024), an industrial distributor of pipes, valves and other \n32\nTable of \nContents\nrelated products and services to the energy industry, where, during her term, she chaired the ESG and enterprise risk committee and audit committee. From 2004 to 2013, Ms. Duganier was a Managing Director at Accenture, a multinational professional services company that provides services in strategy, consulting, digital technology, and operations. She held various leadership and management positions in Accenture’s outsourcing business, including Global Chief Strategy Officer and Global Growth and Offering Development Lead. A year prior to joining Accenture, she served as an independent consultant to Duke Energy North America. From 1979 to 2002, Ms. Duganier, who is a licensed certified public accountant in the State of Texas, worked at Arthur Andersen LLP, where she served as an auditor and financial consultant, as well as in various leadership and management roles, including Global Chief  Financial Officer of Andersen Worldwide. Ms. Duganier is the former chairperson of the National Association of Corporate Directors Texas TriCities (NACD TTC) board of directors. Ms. Duganier holds the NACD Director Certification, is an NACD Leadership Fellow, and holds the CERT Cybersecurity Oversight Certification from Carnegie Mellon University.  Ms. Duganier’s extensive executive experience overseeing large organizations, her diverse public company board experience (including the energy industry), and her training and experience as a certified public accountant make her well-qualified to serve on the Board.\nMs. Duganier serves on and is the chair of the Compensation Committee and serves on the Audit Committee and the Strategic Acquisitions Committee.\nDonna E. Epps, 60, \nMs. Epps has been a member of the Board since January 11, 2021. Ms. Epps currently serves on the board of Saia, Inc. (NASDAQ: SAIA) (since 2019), where she serves on the audit committee and the nominating and governance committee, and on the board of Texas Roadhouse, Inc. (NASDAQ: TXRH), where she serves as chair of the audit committee, and as a member of the nominating and governance committee. Ms. Epps was with Deloitte LLP, a multinational professional services network, for over 30 years. Ms. Epps served as an attest Partner of Deloitte LLP from 1998 through 2003 and as a Risk and Financial Advisory Partner of Deloitte LLP from 2004 until her retirement in 2017. During her time at Deloitte LLP, Ms. Epps helped companies develop and implement proactive enterprise risk and compliance programs, focusing on value protection and creation, and provided attest services and financial advisory services in governance, risk and compliance matters to private and public companies across multiple industries. Ms. Epps is currently a licensed certified public accountant in the State of Texas and a member of the North Texas Chapter of the National Association of Corporate Directors Board. Ms. Epps has served as chair of the Girl Scouts of Northeast Texas Board since April 2021.  Ms. Epps’s significant audit, governance, risk, and compliance experience as a provider of attest, financial advisory and other consulting services to private and public companies across multiple industries makes her well-qualified to serve on the Board.\nMs. Epps serves on and is the chair of the Audit Committee and serves on the Nominating and Corporate Governance Committee.\nKarl F. Kurz, 63,\n has been a member of the Board since April 15, 2022. Mr. Kurz is currently a non-executive chairman of the board at American Water Works Co., Inc. (NYSE: AWK) and a member of the board at Devon Energy Corporation (NYSE: DVN) where he serves on the compensation committee and governance, environmental & public policy committee and chairs the reserves committee. Mr. Kurz previously served on the public company boards of SemGroup Corporation (NYSE: SEMG), Western Gas Partners LP (NYSE: WES), WPX Energy Inc. (NYSE: WPX) and Global Geophysical Services Inc. (NYSE: GGS). Mr. Kurz has served on multiple for profit and non-profit boards. Mr. Kurz also has extensive private equity experience that includes serving as an operating advisor at Ares Capital and a partner at CCMP Capital Advisors, where he focused on investments in the oil and gas upstream and midstream sectors. He spent nine years at Anadarko Petroleum Corporation, where he held roles as Chief Operating Officer, Senior Vice President of Northern America Operations and Vice President of Midstream and Marketing.  Mr. Kurz’s qualifications to serve as a director include his extensive business experience, including as an accomplished senior oil and gas industry executive, and his public company board experience in the utility, energy and infrastructure space.\nMr. Kurz serves on and is the chair of the Strategic Acquisitions Committee and serves on the Compensation Committee.\nEric. L Oliver, 65,\n has been a member of the Board since January 11, 2021. Mr. Oliver currently serves as the President of SoftVest Advisors, a registered investment adviser that acts as an investment manager for private fund clients. Mr. Oliver additionally serves as the President of HeartsBluff Music Partners, LLC and Carrizo Springs Music Partners, LLC, both of which are registered investment advisers pursuant to an umbrella registration filed by SoftVest Advisors, LLC. Previously, Mr. Oliver was President of Midland Map Company, LLC, a Permian Basin oil and gas lease and ownership map producer from 1997 until its sale in January of 2019 to Drilling-Info, and was Principal of Geologic Research Centers LLC, a log library providing geological data to the oil and gas industry with a library in Abilene, Texas, sold in 2019. Additionally, Mr. Oliver served on the board of Texas Mutual Insurance Company from 2009 until he retired in July 2021. He has also served as a director on the board of AMEN Properties, Inc. (OTC: AMEN) since July 2001 and was appointed Chairman of the Board in \n33\nTable of \nContents\nSeptember 2002. AMEN Properties directly or indirectly owns certain oil and gas royalty and working interest properties. Mr. Oliver received a B.A. in Chemistry from Abilene Christian University in 1981.  Mr. Oliver’s qualifications to serve as a director include his experience as an oil and gas investor, with over 27 years of experience buying and selling mineral and royalty properties, and over 40 years of experience managing investments with an emphasis in the energy market.\nMr. Oliver serves on the Audit Committee.\nRobert Roosa, 54,\n has been a member of the Board since November 10, 2023. Mr. Roosa is a Partner in Brigham Royalties, and has served as its Chief Executive Officer since January 2023. Mr. Roosa previously served as President of Brigham Minerals, Inc. (NYSE: MNRL) (“Brigham”) from its inception in November 2012 and as its Chief Executive Officer from July 2017 until its acquisition by Sitio Royalties Corp. in December 2022. Mr. Roosa also served as a director of Brigham from May 2018 until 2022. Mr. Roosa served as the President of Anthem Ventures, LLC, a family office, between January 2012 and January 2017. Mr. Roosa held various roles, including Director of Finance and Investor Relations, while at Brigham Exploration Company from 2006 until its sale to Statoil ASA in December 2011. From 2000 to 2006, Mr. Roosa held a series of positions at Exxon Mobil Corporation (NYSE: XOM), an oil and gas company, in the Corporate Treasurer’s Department. Prior to 2000, Mr. Roosa worked for Cooper Industries, an electrical products manufacturing company, in its Corporate Controllers and Audit Groups and with the accounting firm Deloitte & Touche LLP in its audit function. Mr. Roosa graduated from Southern Methodist University with a Master of Business Administration and from the University of Texas at Austin with a Bachelor of Business Administration.  Mr. Roosa brings extensive knowledge of the mineral royalty acquisitions industry and executive experience to the Board. \nMr. Roosa serves on the Audit Committee, the Compensation Committee and the Strategic Acquisitions Committee.\nMurray Stahl, 71,\n Mr. Stahl has been a member of the Board since January 11, 2021. Mr. Stahl is the Chief Executive Officer, Chairman of the Board and Chief Investment Strategist of Horizon Kinetics Holding Corporation (OTC: HKHC), parent company to Horizon Kinetics Asset Management LLC, which he co-founded. He has over 30 years of investing experience and is responsible for overseeing Horizon Kinetics’ proprietary research and chairs the firm’s investment committee, which is responsible for portfolio management decisions across the entire firm. Horizon Kinetics’ investment portfolio includes a 7.1% voting position in LandBridge Company LLC (NYSE: LB) as of December 13, 2024. Mr. Stahl is also the CoPortfolio Manager for a number of registered investment companies, private funds, and institutional separate accounts. Mr. Stahl is the Chairman and Chief Executive Officer of FRMO Corp. (OTC: FRMO) and has been a director since 2001. He is also Chief Investment Officer and a member of the board of RENN Fund, Inc. (NYSE: RCG) (since 2017), the Bermuda Stock Exchange, MSRH, LLC, and the Minneapolis Grain Exchange. He was a member of the board of Winland Electronics, Inc. (from 2015 to 2020) and IL&FS Securities Services Limited (from 2008 to 2020). Prior to co-founding Horizon Kinetics, Mr. Stahl spent 16 years at Bankers Trust Company (from 1978 to 1994) as a senior portfolio manager and research analyst. As a senior fund manager, he was responsible for investing the Utility Mutual Fund, along with three of the bank’s Common Trust Funds: The Special Opportunity Fund, The Utility Fund and The Tangible Assets Fund. He was also a member of the Equity Strategy Group and the Investment Strategy Group, which established asset allocation guidelines for the Private Bank.  Mr. Stahl’s qualifications to serve as a director include his over 30 years of investment experience, including in the energy and minerals space.\nMr. Stahl serves on the Nominating and Corporate Governance Committee and the Strategic Acquisitions Committee.\nMarguerite Woung-Chapman, 59,\n has been a member of the Board since November 10, 2023. Ms. Woung-Chapman serves as a director of Summit Midstream Corporation (NYSE: SMC), a value-driven corporation focused on developing, owning and operating midstream energy infrastructure assets located in unconventional resource basins, primarily shale formations, in the continental United States. She currently serves as chair of their nominating, governance and sustainability committee and as a member of their compensation committee. Ms. Woung-Chapman serves on the board of directors of Chord Energy Corporation (NASDAQ: CHRD), a scaled unconventional U.S. oil producer with a premier Williston Basin acreage position, and serves on the compensation and human resources committee, and as chair of the nominating and governance committee. She was previously a member of the board directors of Oasis Petroleum, Inc. and chair of the board of directors and President of the Council of the Girl Scouts of San Jacinto Council. Ms. Woung-Chapman began her career as a corporate attorney with El Paso Corporation (including its predecessors) and during her tenure from 1991 until 2012, served as Vice President, Legal Shared Services, Corporate Secretary and Chief Governance Officer, among other positions. From 2012 to 2017, Ms. Woung-Chapman served in various capacities at EP Energy Corporation, a private company that subsequently became an NYSE-listed independent oil and gas exploration and production company, including, among others, Senior Vice President, Land Administration, General Counsel and Corporate Secretary. In 2018, Ms. Woung-Chapman served as Senior Vice President, General Counsel and Corporate Secretary of Energy XXI Gulf Coast, Inc., an independent exploration and production company that was engaged in the development, exploitation and acquisition of oil and natural gas properties in the \n34\nTable of \nContents\nU.S. Gulf Coast region until its acquisition by Cox Oil. Ms. Woung-Chapman holds a Bachelor of Science in Linguistics from Georgetown University and a J.D. from the Georgetown University Law Center.  Ms. Woung-Chapman brings valuable expertise in all aspects of management and strategic direction of publicly traded energy companies with a unique combination of experience in corporate governance, regulatory, compliance, corporate and asset transactions, legal and business administration.\nMs. Woung-Chapman serves on the Audit Committee and the Nominating and Corporate Governance Committee.\nTyler Glover, 40,\n has been a member of the Board and served as TPL’s President and Chief  Executive Officer since January 11, 2021. Mr. Glover served as Chief Executive Officer, Co-General Agent and Secretary of the Trust from November 2016 to January 11, 2021. Mr. Glover also currently serves as President and Chief Executive Officer of TPWR, a wholly owned subsidiary of TPL, in which capacity he has acted since its formation in June 2017. Mr. Glover previously served as Assistant General Agent of the Trust from December 2014 to November 2016, and has over 10 years of energy services and land management experience.  Mr. Glover’s qualifications to serve as a director include his extensive energy industry and land management expertise and his deep knowledge of TPL gained through his experience as an officer at the Company, including at the Trust.\nOur directors bring to the Board a wide range of skills, qualifications, experience, perspectives and diverse characteristics that enhance the Board’s ability to carry out its oversight on behalf of our stockholders.  The table below sets forth a summary of the qualifications and experiences that each director brings to the Board, each of which we believe to be relevant to our business.  Because this is a summary, it does not include all of the skills, experiences and qualifications that each director offers.   \nQualifications and Experience\nBest\nCook\nDuganier\nEpps\nGlover\nKurz\nOliver\nRoosa\nStahl\nWoung-Chapman\nPublic Company CEO or COO Experience\nl\nl\nl\nl\nl\nFinancial Oversight/Accounting\nSenior executive level experience in financial accounting and reporting, auditing, corporate financing and/or internal controls or experience in the financial services industry\nl\nl\nl\nl\nl\nl\nIndustry Experience\nExperience as an executive or director in, or in other leadership positions working with the oil and gas industry and knowledge of the risks related to the industry\nl\nl\nl\nl\nl\nl\nl\nl\nPublic Policy/Regulatory\nExperience in or a strong understanding of the regulatory issues facing the oil and gas industry and public policy on a local, state and national level\nl\nl\nl\nl\nl\nHES Experience\nExperience with direct control or accountability for health, environmental, safety and social responsibility management\nl\nl\nl\nl\nl\nl\nl\nRisk Management\nExecutive experience evaluating significant risks and providing effective oversight of risk management processes, including cyber security risk and financial risk\nl\nl\nl\nl\nl\nl\nl\nl\nl\nl\nIndependence\nSatisfies the independence requirements of the NYSE and SEC\nl\nl\nl\nl\nl\nl\nl\nl\nl\nPublic Company Board Experience\nIncluding corporate governance experience\nl\nl\nl\nl\nl\nl\nl\nl\nl\nl\n35\nTable of \nContents\nGender:\nFemale\nMale\n3\n7\nDemographics:\nAfrican American or Black\nNative American\nAsian\nHispanic or Latino\nCaucasian \n2\n7\nTwo or More Races or Ethnicities\n1\nExecutive Officers\nTyler Glover\n, \n40\n, serves as TPL’s President and Chief Executive Officer.  Biographical information for Mr. Glover is included above.\nChris Steddum, 44, \nserves as TPL’s Chief Financial Officer since June 1, 2021.  Prior to that, Mr. Steddum served as Vice President, Finance and Investor Relations of TPL and also served as Vice President, Finance and Investor Relations of the Trust.  Prior to joining the Trust in 2019, Mr. Steddum spent 10 years working in oil and gas investment banking, most recently as a Director at Stifel Financial Corporation from 2016 to 2019, and prior to that served as a Director at GMP Securities from 2014 to 2016.\nMicheal W. Dobbs, 52, \nserves as TPL’s Senior Vice President, Secretary and General Counsel. Mr. Dobbs also served as Senior Vice President and General Counsel of the Trust from August 2020 until January 11, 2021.  Prior to joining the Trust, Mr. Dobbs had been a partner at Kelley Drye & Warren LLP. \nSignificant Employees\nRobert A. Crain\n, \n46\n, serves as Executive Vice President of TPWR, in which capacity he has served since its formation in June 2017.  From 2015 to 2017, Mr. Crain was Water Resources Manager with EOG Resources where he led the development of EOG’s water resource development efforts across multiple basins including the Permian and Eagle Ford.  During his career, he has successfully developed multiple large-scale water sourcing, distribution and treatment systems across multiple platforms and industries.\nStephanie Buffington\n, \n58\n, serves as TPL’s Chief Accounting Officer, in which capacity she has served since June 1, 2021.  From September 2020 through May 2021, Ms. Buffington served as Vice President of Financial Reporting and from December 2017 through September 2021 served as Director of Financial Reporting.  Prior to joining the Company, Ms. Buffington most recently served as Vice President of Financial Reporting at Monogram Residential Trust, Inc., a publicly traded REIT, from 2014 to 2017.  Ms. Buffington has over 25 years of public company experience and began her career at KPMG.  She is a licensed Certified Public Accountant in the State of Texas.\n \nMatters Relating to Our Governance\nCode of Business Conduct and Ethics\nThe Board has adopted a Code of Business Conduct and Ethics applicable to all members of the Board, executive officers and employees.  A copy of the Code of Business Conduct and Ethics is available on the Company’s corporate website at www.TexasPacific.com. We will make any legally required disclosures regarding amendments to, or waivers of, provisions of our Code of Business Conduct and Ethics on our corporate website.\nCommunication with Directors\nThe Board is committed to meaningful engagement with stockholders and other interested persons and welcomes input and suggestions. Information regarding how stockholders can contact the Chair or non-management members of the Board is set forth in our Corporate Governance Guidelines, which are posted on the Company’s corporate website, www.TexasPacific.com. Stockholders and other interested persons who wish to contact the Board may do so by submitting any communications to the Company by mail at 1700 Pacific Avenue, Suite 2900, Dallas, Texas 75201, Attention: Investor \n36\nTable of \nContents\nRelations, with an instruction to forward the communication to a particular director or the Board as a whole. Our Board has created a number of ways for stockholders and other stakeholders to provide input and hear from management, including: \n•\nAttending an annual meeting of stockholders and submitting questions to be addressed during the meeting;\n•\nAttending quarterly earnings calls, investor conferences, and other similar opportunities;\n•\nSending an email to our Investor Relations department at IR@texaspacific.com;\n•\nMailing a letter to us at 1700 Pacific Avenue, Suite 2900, Dallas, Texas 75201, Attention: Investor Relations; and\n•\nRequesting a stockholder engagement meeting via one of the means outlined here.\nOur Investor Relations team, in consultation with the General Counsel, will not forward any communication that it determines in good faith to be frivolous, unduly hostile, threatening, illegal or similarly unsuitable. The General Counsel will maintain a list of each communication that was not forwarded because it was so determined to be unsuitable. Such list shall be delivered to the Board at its quarterly meetings. In addition, each communication that was not forwarded because it was determined to be unsuitable will be retained in the Company’s files and made available at the request of any member of the Board to whom such communication was addressed.\nBoard Leadership Structure\nOur Board is led by the Chair. Mr. Best serves as the Chair and is an independent director. Our Bylaws and Corporate Governance Guidelines each provide that the Chair of the Board may also hold the position of Chief Executive Officer. At this time, the Board believes that separation of the Chair and Chief Executive Officer positions is appropriate and in the best interests of the Company and its stockholders. The Board believes that such separation provides independent leadership for the Board, helps ensure critical and independent thinking with respect to the Company’s strategy and performance and allows our Chief Executive Officer to focus on the Company’s day-to-day business operations. Our Chief Executive Officer also serves as a member of the Board as the management representative. The Company believes this is important to make information and insight directly available to the directors in their deliberations. This structure gives the Company an appropriate, well-functioning balance between non-management and management directors that combines experience, accountability, and effective risk oversight.\nThe duties of the Chair include, among other things:\n•\nChairing Board meetings and meetings of stockholders;\n•\nEstablishing the agenda for each Board meeting;\n•\nLeading executive sessions of the Board;\n•\nHaving authority to call Board meetings;\n•\nApproving meeting schedules for the Board and information distributed to the Board;\n•\nConsulting with the Nominating and Corporate Governance Committee with regard to the membership and performance evaluations of the Board and committee members; and\n•\nPerforming such other duties and responsibilities as may be requested by the Board.\nIn the event the Chair does not qualify as independent, our Corporate Governance Guidelines require the independent directors to select from among themselves a lead independent director. The duties of a lead independent director are set forth in our Corporate Governance Guidelines and include chairing Board meetings in the absence of the Chair, convening and leading executive sessions of the Board, serving as a liaison between the Chair and the independent directors, being available for consultation and director communication with major stockholders as directed by the Board, and performing such other duties and responsibilities as requested by the Board.\nRisk Oversight\nThe Company believes that risk oversight is the responsibility of the Board as a whole and not solely of any one of its committees. The Board recognizes that all companies face a variety of risks, including strategic risk, reputational risk, environmental risk and operational risk. The Board periodically reviews the processes established by management to identify and manage risks and communicates with management about these processes. The Board encourages, and management promotes, a corporate culture that incorporates risk management into our corporate strategy and day-to-day business operations, including with respect to the receipt, retention and treatment of complaints or other expressions of concern received from \n37\nTable of \nContents\nemployees of the Company or other persons. The Board also continuously assesses and analyzes, with the input of management, the most likely areas of future risk to which we may be vulnerable.\nAt the Board committee level, the Audit Committee regularly discusses policies with respect to risk assessment and risk management, the Company’s major litigation and financial risk exposures, compliance, cybersecurity, information technology and the steps management has taken to monitor and control such exposures. The Compensation Committee oversees risks arising from the Company’s compensation and employee benefits plans, policies and programs for its employees. The Nominating and Corporate Governance Committee, with assistance from the Audit Committee and the Compensation Committee, oversees our ESG program and monitors related risks.  The Board and the various committee chairs address any issues identified in such discussions and reviews with management as they arise, and monitor actions, procedures or processes implemented in response.\nOur General Counsel serves as our chief compliance officer, and periodically reviews the effectiveness of the Company’s compliance programs and responds to, and monitors the status and response to, compliance issues that may arise from time to time. The General Counsel reports to the Chief Executive Officer.\nAudit Committee Procedures; Procedures for Approval of Related Person Transactions\nThe Audit Committee meets separately and periodically with the Company’s independent auditor, the Company’s Chief Financial Officer and a representative of the internal audit function to assess certain matters, including the status of the independent audit process, management and the independent auditor’s assessments of the Company’s financial reporting and internal controls and compliance with legal and regulatory requirements, and management’s views as to the competence, performance and independence of the independent auditor.  The Audit Committee oversees the internal audit function, including its structure, personnel, budget, and annual internal audit plans.  In addition, the Audit Committee, as a whole, reviews and meets to discuss the annual audited financial statements and quarterly financial statements with management and the independent auditor.  The Audit Committee makes a recommendation to the Board each year as to whether the annual audited financial statements should be included in the Company’s Annual Report on Form 10-K.\nInformation about the procedures for approval of related person transactions is available below in Part III, Item 13. “Certain Relationships and Related Transactions, and Director Independence — Transactions with Related Persons.”\nQualifications and Nominations of Directors\nThe Nominating and Corporate Governance Committee Charter provides that the Nominating and Corporate Governance Committee screen, recruit and interview individuals that the Nominating and Corporate Governance Committee believes are qualified to become members of the Board, consistent with criteria approved by the Board from time to time, and to recommend to the Board the (a) director nominees to be selected by the Board to stand for election or re-election at the annual meeting of stockholders and (b) director candidates to be appointed by the Board to fill vacancies and newly created directorships.  The Board and Nominating and Corporate Governance Committee determine the minimum qualifications that a director nominee should possess on a case by case basis and typically evaluate candidates based on factors including, but not limited to, a general understanding of finance, corporate governance and strategy, senior leadership experience, public company board experience, an understanding of the Company’s business and industry, diversity of background, perspectives and experiences, character, whether the candidate would satisfy the independence standards of the NYSE Listed Company Manual and the other skills identified in the matrix included in Part III, Item 10, “Directors, Executive Officers and Corporate Governance — Directors” above. The Board and the Nominating and Corporate Governance Committee aim to identify a diverse group of candidates and believe that no single criterion such as gender or minority status is determinative in obtaining diversity on the Board.\nThe Nominating and Corporate Governance Committee reviews periodically the size of the Board and oversees an annual self-evaluation of the Board and its committees.  The Nominating and Corporate Governance Committee may also consider such other factors as it may deem to be in the best interests of the Company and its stockholders.  Whenever the Nominating and Corporate Governance Committee concludes, based on the reviews or considerations described above or due to a vacancy, that a new nominee to the Board is required or advisable, it will consider recommendations from directors, management, stockholders and, if it deems appropriate, consultants retained for that purpose.  In such circumstances, it will evaluate individuals recommended by stockholders in the same manner as nominees recommended from other sources.  Stockholders who wish to nominate an individual for election as a director directly, without going through the Nominating and Corporate Governance Committee, must comply with the procedures in the Bylaws.  The Bylaws are provided on the Company’s corporate website at www.TexasPacific.com.  \n38\nTable of \nContents\nOur Board has adopted a “majority vote policy.”  Under this policy any nominee for director in an uncontested election who does not receive a majority of the votes cast and is an incumbent director is required to promptly tender his or her resignation, subject to acceptance by the Board.  The Nominating and Corporate Governance Committee will make a recommendation to the Board as to whether to accept or reject the tendered resignation or whether other action should be taken.  The Board will then act on the tendered resignation, taking into account the Nominating and Corporate Governance Committee’s recommendation, and publicly disclose its decision regarding the tendered resignation within ninety (90) days from the date of the certification of the election results.  A director who tenders his or her resignation will not participate in the recommendation of the Nominating and Corporate Governance Committee nor the decision of the Board with respect to his or her resignation.\nInsider Trading Policy; Anti-Hedging Policy\nWe have an Insider Trading Policy that sets forth terms, conditions, timing, limitations, and prohibitions with respect to trading in the Company’s securities.  The Insider Trading Policy prohibits all employees, executive officers, directors, agents, consultants and contractors from trading in the Company’s securities while in possession of material nonpublic information.  Such persons are also generally prohibited from hedging, including engaging in publicly-traded options, puts, calls, or other derivative instruments relating to the Company’s securities, or selling the Company’s securities “short.”  The Insider Trading Policy also requires that such persons obtain pre-approval from the Company’s General Counsel for all pledges, and the deposit in margin accounts, of the Company’s securities and the securities of any other company designated by the Company’s General Counsel.  The Insider Trading Policy also restricts directors, officers subject to Section 16 of the Exchange Act, and certain other specifically designated employees from trading in the Company’s securities during certain periods and only after they have obtained pre-clearance for trades in the Company’s securities from the Company’s General Counsel (or, in the case of the General Counsel, the Chief Financial Officer).  While the Company is not subject to the Insider Trading Policy, it does not trade in its securities when it is in possession of material nonpublic information other than pursuant to previously \nadopted\n Rule 10b5-1 trading arrangements.\nClawback Policy\nThe Company has adopted a Clawback Policy in accordance with Section 10D of the Exchange Act and Rule 10D-1 promulgated thereunder (collectively, “Section 10D”).  In the event the Company is required to prepare an accounting restatement of its financial statements due to the Company’s material noncompliance with any financial reporting requirement under the securities laws, including any required accounting restatement to correct an error in previously issued financial statements that is material to the previously issued financial statements, or that would result in a material misstatement if the error were corrected in the current period or left uncorrected in the current period, the Clawback Policy requires that covered executives must reimburse the Company, or forfeit, any excess incentive compensation received by such covered executive during the three completed fiscal years immediately preceding the date on which the Company is required to prepare the restatement.  Executives covered by the Clawback Policy are current and former executive officers, as determined by the Board in accordance with Section 10D and the NYSE Listed Company Manual. Incentive compensation subject to the Clawback Policy includes any cash or equity compensation that is granted, earned or vested based wholly or in part on the attainment of a financial reporting measure as defined in Section 10D.  The amount subject to recovery is the excess of the incentive compensation received based on the erroneous data over the incentive compensation that would have been received had it been based on the restated results.\nBoard of Directors\nThe Board currently consists of ten (10) directors, nine (9) of whom - Mr. Best, Gen. Cook, Ms. Duganier, Ms. Epps, Mr. Kurz, Mr. Oliver, Mr. Roosa, Mr. Stahl and Ms. Woung-Chapman - are considered “independent” under the rules of the SEC and the NYSE.  No director may be deemed independent unless the Board determines that he or she has no material relationship with TPL. Mr. Best serves as the Chair.  In light of Mr. Best’s extensive experience in the energy industry and service on public company boards, the Board believes that he is well-positioned to serve as Chair.\nThe Board meets at least quarterly and the independent directors serving on the Board meet in executive session (\ni.e.\n, without the presence of any non-independent directors and management) immediately following regularly scheduled Board meetings.  During the fiscal year ended December 31, 2024 (the “Last Fiscal Year”), the Board met fourteen (14) times and acted by written consent in lieu of holding a meeting four (4) times.  All of the directors attended at least 86% of the total number of meetings held by the Board and of the committees on which they served during the Last Fiscal Year.  While the Company does not have a policy requiring director attendance at annual meetings of stockholders, each director is expected to attend the Company’s annual meetings of stockholders.  Each member of the Board attended our 2024 annual meeting of stockholders.\n39\nTable of \nContents\nThe Board has four standing committees, consisting of a Nominating and Corporate Governance Committee, an Audit Committee, a Compensation Committee, and a Strategic Acquisitions Committee.  Membership of each committee is shown in the following table.\nName\nAudit Committee\nCompensation Committee\nNominating and Corporate Governance Committee\nStrategic Acquisitions Committee\nRhys J. Best\nDonald G. Cook\nl\n▲\nBarbara J. Duganier\nl\n▲\nl\nDonna E. Epps\n▲\nl\nTyler Glover\nKarl F. Kurz\nl\n▲\nEric L. Oliver\nl\nRobert Roosa\nl\nl\nl\nMurray Stahl\nl\nl\nMarguerite Woung-Chapman\nl\nl\n▲\nChair     \nl\n Member\nNominating and Corporate Governance Committee\n \nThe Nominating and Corporate Governance Committee consists of Donald G. Cook, the chair, Donna E. Epps, Murray Stahl and Marguerite Woung-Chapman.  The committee members have met the independence requirements for service on the Nominating and Corporate Governance Committee in accordance with the NYSE Listed Company Manual.  The Nominating and Corporate Governance Committee is responsible for, among other things, identifying, evaluating and recommending individuals qualified to become members of the Board, and for overseeing corporate governance matters and the Company’s policies and programs concerning social responsibility, including ESG matters.  During the Last Fiscal Year, the Nominating and Corporate Governance Committee held six (6) meetings.\nThe Nominating and Corporate Governance Committee Charter is provided on the Company’s corporate website at www.TexasPacific.com.\n \nAudit Committee and Audit Committee Financial Expert\n \nThe Audit Committee consists of Donna E. Epps, the chair, Barbara J. Duganier, Eric L. Oliver, Robert Roosa and Marguerite Woung-Chapman.  The Board has determined that Ms. Epps, Ms. Duganier, and Mr. Roosa are “audit committee financial experts,” as defined by the rules of the SEC, and each has accounting or related financial management expertise as required under the NYSE Listed Company Manual.  Each member of the Audit Committee is financially literate.  Additionally, the members of the Audit Committee each meet the independence requirements for service on the Audit Committee in accordance with the NYSE  Listed Company Manual and Rule 10A-3 promulgated under the Exchange Act.\nThe Audit Committee is responsible for, among other things, ensuring that the Company has adequate internal controls and is required to meet with the Company’s auditors to review these internal controls and to discuss other financial reporting matters.  The Audit Committee is also responsible for the appointment, pre-approval of work, compensation, and oversight of the auditors and for overseeing enterprise risk management, including oversight of risks from cybersecurity threats. The Audit Committee periodically reviews the Company’s policies and practices for managing cybersecurity risks, including incident response plans, to ensure that such policies and practices are appropriately tailored to the Company’s risk framework. During the Last Fiscal Year, the Audit Committee of the Company held five (5) meetings and acted by written consent in lieu of holding a meeting one (1) time.\nThe Audit Committee Charter is provided on the Company’s corporate website at www.TexasPacific.com. \n40\nTable of \nContents\nCompensation Committee\nThe Compensation Committee consists of Barbara J. Duganier, the chair, Donald G. Cook, Karl F. Kurz and Robert Roosa.  The Board has determined that each member of the Compensation Committee is independent, as defined by the NYSE Listed Company Manual and qualifies as a “non-employee director” for purposes of Rule 16b-3 under the Exchange Act.  The primary functions of the Compensation Committee are to review, approve and recommend corporate goals and objectives relevant to compensation of TPL’s Named Executive Officers (as defined below), review and approve TPL’s compensation plans and review and making recommendations regarding compensation for non-employee directors.  During the Last Fiscal Year, the Compensation Committee held six (6) meetings and acted by written consent in lieu of holding a meeting four (4) times.\nThe Compensation Committee Charter is provided on the Company’s corporate website at www.TexasPacific.com.     \nStrategic Acquisitions Committee\nThe Strategic Acquisitions Committee consists of Karl F. Kurz, the chair, Barbara J. Duganier, Robert Roosa and Murray Stahl. The Strategic Acquisitions Committee is responsible for, among other things, assisting the Board in fulfilling its oversight responsibilities relating to evaluating potential acquisitions by reviewing, analyzing, assessing and, in the case of acquisitions involving cash consideration of $50.0 million or less (subject to an annual cap), approving, potential acquisitions being considered by the Company.  For acquisitions involving consideration of more than $50.0 million reviewed by the Committee, the Strategic Acquisitions Committee must make a recommendation to the Board for approval. The Strategic Acquisitions Committee was established as a standing committee in May 2024. Since its establishment in May of 2024 through the remainder of 2024, the Strategic Acquisitions Committee held four (4) meetings.\nThe Strategic Acquisitions Committee Charter is provided on the Company’s corporate website at www.TexasPacific.com.\nAd Hoc Committees\nFrom time to time, the Board constitutes ad hoc committees, the membership, duties and compensation, if any, of which are determined by the Board.\nItem 11.\n \nExecutive Compensation. \n \nCompensation Discussion and Analysis \nThis Compensation Discussion and Analysis (“CD&A”) provides information on the compensation arrangements for each of TPL’s Chief Executive Officer (principal executive officer), Chief Financial Officer (principal financial officer), up to three other most highly compensated individuals who were serving as an executive officer at the end of the Last Fiscal Year, and up to two other individuals who would have been included as other most highly compensated individuals but who were not serving as executive officers at the end of the Last Fiscal Year, for services rendered to TPL and its subsidiaries in all capacities during the Last Fiscal Year (the “Named Executive Officers”).  The compensation disclosures below reflect Fiscal Year 2024.\nFor Fiscal Year 2024, the following officers represented our Named Executive Officers:\n•\nTyler Glover, our President and Chief Executive Officer\n•\nChris Steddum, our Chief Financial Officer\n•\nMicheal W. Dobbs, our Senior Vice President, Secretary, and General Counsel\n41\nTable of \nContents\nExecutive Summary\nOur business activity is generated from our surface and royalty interest ownership, primarily in the Permian Basin.  Our revenues are derived from oil and gas royalties, water sales, produced water royalties, easements and other surface-related income and land sales.  Due to the nature of our operations and concentration of our ownership in one geographic location, our revenue and net income are subject to substantial fluctuations from quarter to quarter and year to year.  In addition to fluctuations in response to changes in the market price for oil and gas, our financial results are also subject to decisions by the owners and operators of not only the oil and gas wells to which our oil and gas royalty interests relate, but also to other owners and operators in the Permian Basin as it relates to our other revenue streams, principally water sales, produced water royalties, easements and other surface-related revenue.\nBusiness and Financial Performance 2024 Highlights\n•\nWater Service and Operations segment achieved record performance in 2024 for the following:\n◦\nWater sales revenue of $150.7 million\n◦\nProduced water royalties revenue of $104.1 million\n◦\nTotal segment revenues of $265.0 million\n◦\nTotal segment net income of $139.1 million\n•\nNet income of $454.0 million, or $19.75 per share (basic) and $19.72 (diluted)\n•\nRevenues of $705.8 million\n•\nAdjusted EBITDA\n(1)\n of $610.7 million\n•\nFree cash flow\n(1)\n of $461.1 million\n•\nRoyalty production of 26.8 thousand barrels of oil equivalent per day\n•\nClosing price of TPL’s Common Stock increased 111% from December 31, 2023 to $1,105.96 per share as of December 31, 2024.\n•\nTotal cash dividends of $15.11 per share paid during 2024\n•\nThree-for-one stock split effected March 26, 2024\n•\nPublished annual update of ESG disclosure, including metrics for 2023\n(1)    Adjusted EBITDA and free cash flow are non-GAAP performance measures.  Reconciliations of Non-GAAP measures are provided in Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Non-GAAP Performance Measures.”\n \nKey Aspects of 2024 Design\nFollowing a substantial redesign of our compensation programs in 2022, and based on positive feedback from our stockholders, the Compensation Committee generally maintained the overall program structure in 2024.  This program design is based on typical practices among our Reference Group (see below) while reflecting the unique aspects of TPL.  The compensation program design is intended to meet the following objectives:\n•\nAlign executives’ financial interests more closely with stockholders;\n•\nTie a substantial portion of executive compensation with the Company’s performance (both stock price and financial performance) to incorporate risk into the awards, while relying heavily on formulaic incentive compensation;\n•\nIncorporate long-term vesting periods for a substantial portion of executive compensation to help ensure continuity of the management team;\n42\nTable of \nContents\n•\nEnsure transparency for participants and stockholders about how outcomes are determined with an appropriate and competitive level of pay at risk;\n•\nMeet common governance standards for public companies, and assess and control the program to avoid creating undue risk or encouraging excessive risk-tasking by executives; and\n•\nEnsure a competitive compensation program. \nWe believe that our program has an appropriate balance of risk and reward in relation to our overall business strategy and that the balance of compensation elements discourages excessive risk-taking.\nWe have maintained the key aspects of our compensation program for 2025.\nDecision-Making Process\nCompensation Philosophy and Approach\nTPL’s 2024 executive compensation program is designed to recruit and retain an executive team and to reward performance in achieving TPL’s goal of creating stockholder value.  The 2024 executive compensation program consists principally of a salary, an annual cash incentive (sometimes referred to as awards under a non-equity incentive plan), and long-term share-based compensation as discussed below: \nKey Compensation Component\nPurpose\nPhilosophy\nBase Salary\n•\nProvide a competitive level of fixed compensation\n•\nSet at a competitive level annually by the Compensation Committee and the Board, as applicable\n•\nBased on evaluation of executive officers’ performance and contributions and competitive market data\nAnnual Cash Incentive\n•\nAlign executive officer pay with performance\n•\nReward for achievement of annual goals, both financial and non-financial\n•\nEstablish strategic priorities for the year through the strategic portion of the award\n•\nIndividual target levels set at a competitive level based on competitive market data and executive officers’ contribution level\n•\nPayouts heavily influenced by performance against pre-set goals\n•\nPortion of award earned through achievements against strategic priorities\nLong-Term Incentives\n•\nAlign executive pay with long-term stockholder experience through share ownership\n•\nEncourage long-term retention through extended vesting periods\n•\nTie executive pay outcomes to long-term performance through performance-based awards\n•\nIndividual awards set at a competitive level based on competitive market data and executive officers’ contribution level\n•\nAt least 50% of each executive officers’ awards are performance-based\n•\nPerformance tied to long-term share price and financial performance, based on pre-set goals\nAs part of its compensation program, TPL also maintains both a qualified defined benefit pension plan (the “Pension Plan”) and a qualified defined contribution plan which are both available to employees generally, including the Named Executive Officers.  These plans are designed to assist employees in planning for their retirement. The Pension Plan was frozen as of December 31, 2024 and no future benefit accruals will be made.  In conjunction with freezing the Pension Plan, the Board has approved a discretionary contribution to employees’ 401(k) plan for 2025.  See further discussion of the freezing of the \n43\nTable of \nContents\nPension Plan in Note 8, “Pension and Other Postretirement Benefits” in the notes to our consolidated financial statements included under Part II, Item 8, “Financial Statements and Supplementary Data.”\nConsideration of 2024 Say on Pay Vote\nAt our November 2024 annual meeting of stockholders, the majority of our stockholders voted to approve our executive compensation program, with approximately 88% approval among votes cast.  The Compensation Committee viewed this as support of its approach and philosophy and as a basis for continuing with the program described in this CD&A for 2024.\nIn 2024, we reached out to stockholders representing 48% of our outstanding shares of Common Stock and held meetings with stockholders representing 32% of our outstanding shares of Common Stock (measured as of September 3, 2024) to discuss their perspectives on various issues, including executive compensation.  Independent members of our Board participated in and led each of these meetings with stockholders.  The participating members of our Board were joined in these meetings by one or more of the Company’s Chief Executive Officer, Chief Financial Officer, Senior Vice President, Secretary and General Counsel, and Vice President of Finance and Investor Relations.\nFollowing these meetings, the Compensation Committee met with senior management to discuss what we learned during this comprehensive outreach process.  In general, we learned that institutional stockholders were not seeking significant changes to our compensation program.  Many expressed support for our overall compensation philosophy and instead suggested modest changes, including enhancing our proxy statement disclosures and increasing the proportion of performance-based equity that we award over the long term.  \nSome investors expressed concern about the definition of Adjusted EBITDA used for our Adjusted EBITDA margin calculation (calculated as Adjusted EBITDA divided by total revenues), such as the inclusion of interest income and other non-operating or non-recurring items (e.g., legal expenses).  The Compensation Committee includes interest income in calculating Adjusted EBITDA because (i) this approach aligns with TPL’s capital allocation strategy, (ii) the incentive goals established for Adjusted EBITDA margin include an assumed level of interest income and, therefore, its removal would have minimal impact and (iii) TPL is relatively unique in generating a significant amount of net interest income due to its lack of debt and, therefore, interest income is of heightened significance.  The Compensation Committee continues to evaluate the use of Adjusted EBITDA margin as a short-term incentive metric.  With respect to legal expenses, after due consideration, the Compensation Committee determined to not adjust for TPL’s excess legal expenses when calculating Adjusted EBITDA because its adjustment in both the goal and actual results achieved under the 2024 annual incentive plan would have increased the annual cash bonuses earned by the management team even if interest income had been removed from the calculation.\nWe have added new disclosures to our proxy statement intended to provide greater transparency into the functioning of our executive compensation program.  Additionally, we intend to evolve our compensation program over time, and we may make further changes to the structure of our compensation program based on the needs of the Company. \nRole of the Committee\nThe Compensation Committee has the sole authority to determine the compensation of the Named Executive Officers other than the Chief Executive Officer and to make recommendations to the Board, which has the authority to make final decisions, with respect to the compensation of the Chief Executive Officer.  The Compensation Committee is also responsible for developing and overseeing an equity compensation program for the Company generally for other employees, and for making recommendations to the Board with respect to compensation for non-employee directors, with assistance from the Compensation Committee’s independent compensation consultant.\nIn establishing the Named Executive Officers’ compensation for 2024, the Compensation Committee Chair and the full Compensation Committee met multiple times, including with management and/or the Compensation Committee’s independent compensation consultant, to review market practices, evaluate potential alternatives, determine appropriate metrics and goals, and review strategic goals and performance.\nRole of Management\nOur CEO, Mr. Glover, provided recommendations for compensation for his direct reports.  Additionally, the management team provided the Compensation Committee with financial performance information to assist with the assessment of company and individual performance in determining the bonuses for 2024.  The Compensation Committee considered this information in its decision-making process.  No member of management participated in discussions relating to his or her own compensation.\n44\nTable of \nContents\nRole of the Independent Consultant\nSince 2021, the Compensation Committee has used Meridian Compensation Partners (“Meridian”) as its independent compensation consultant to assist the Compensation Committee in fulfilling its responsibilities related to the oversight of TPL’s executive officer and non-employee director compensation.  The Compensation Committee determined that Meridian was independent from management based upon the consideration of various relevant factors, including that Meridian did not provide any services to TPL except advisory services to the Compensation Committee, and that Meridian maintained, and adhered to, policies and procedures that were designed to prevent conflicts of interests.\nThe independent compensation consultant advises the Compensation Committee in the development of pay strategies regarding our executive officers, including our Chief Executive Officer, and non-employee directors.  The Compensation Committee reviews and discusses matters involving executive officer and non-employee director compensation. Following this review, the Compensation Committee makes a determination and/or recommendation to the Board, as applicable under the Compensation Committee’s Charter, regarding, among other things (a) the compensation of the Chief Executive Officer and the compensation of executive officers other than the Chief Executive Officer, in each case including salary, bonus, benefits, incentive awards and perquisites, and (b) compensation for TPL’s non-employee directors. \nBenchmarking Process\nDetermining the 2024 Compensation Program\nAs described below, the Compensation Committee asked Meridian to review market data as part of the process of  establishing 2024 compensation for our Named Executive Officers.  As part of this process, the Compensation Committee noted that TPL is a unique organization in a number of ways:\n•\nIt is the largest publicly-traded mineral royalty focused organization, with a market capitalization more than double the next largest publicly-traded mineral royalty focused organization. The closing price of TPL’s Common Stock increased 111% from December 31, 2023 to December 31, 2024;\n•\nUnlike most mineral royalty focused organizations, TPL also owns and manages a large amount of surface rights; \n•\nThese surface rights allow the creation of additional business lines, such as our water business and SLEM;\n•\nTPL’s legacy assets carry zero basis on the balance sheet; and\n•\nTPL’s financial profile is unusual with no debt, limited book assets, and high margins.  TPL also returns a significant portion of its cash flow to stockholders through dividends and share repurchases.\nAs a result of these unique characteristics, TPL does not have any direct peers.  Instead of reviewing peer group market data, the Compensation Committee asked Meridian to review compensation for a group of comparable reference companies (the “Reference Group”) that may represent our competition for executive talent.  The Reference Group (listed below) represents companies which operate in ancillary businesses such as royalty/non-operating companies (“Royalty/Non-Op”), midstream companies, water companies and E&P companies that have business lines similar to TPL and are similar in market capitalization, enterprise value, and/or Adjusted EBITDA.\n45\nTable of \nContents\n2024 Reference Group\n2025 Reference Group\nRoyalty/Non-Op Companies\nBlack Stone Minerals, L.P.\nP\nP\nFreehold Royalties\nP\nKimbell Royalty Partners\nP\nP\nNorthern Oil & Gas, Inc.\nP\nP\nPrairieSky Royalty Ltd\nP\nP\nSitio Royalties Corp\nP\nP\nMidstream/Water Companies\nAris Water Solutions\nP\nDT Midstream, Inc.\nP\nP\nEnLink Midstream, LLC\nP\nP\nEquitrans Midstream Corporation\nP\nAcquired\nKinetic Holdings\nP\nNuStar Energy L.P.\nP\nAcquired\nSelect Water Solutions\nP\nWestern Midstream Partners, L.P.\nP\nP\nE&P Companies\nCallon Petroleum Co\nP\nAcquired\nCivitas Resources\nP\nMarathon Oil Corp\nP\nAcquired\nMatador Resources Co\nP\nP\nOvintiv\nP\nPermian Resources\nP\nRange Resources Corp\nP\nP\nSM Energy Co\nP\nP\nSouthwestern Energy Co\nP\nAcquired\n2024 Compensation Program\nTPL’s 2024 executive compensation program is designed to reward performance in achieving TPL’s goals of creating stockholder value as detailed below. \nBase Salaries\nOur Named Executive Officers receive a base salary to provide a competitive level of fixed compensation based on each individual’s role, experience, qualifications, and individual performance.  The base salaries as of the end of 2024 for our Named Executive Officers were as follows:\nNamed Executive Officer\nBase Salary as of December 31, 2024\nTyler Glover\n$\n850,000 \nChris Steddum\n$\n525,000 \nMicheal W. Dobbs\n$\n440,000 \nThe base salary for Mr. Glover is unchanged from 2023.  The Compensation Committee increased the base salaries for Mr. Steddum and Mr. Dobbs for 2024 to better align with market data from the Reference Group.\n46\nTable of \nContents\n2024 Annual Incentive Targets \nEach of the Named Executive Officers is eligible to earn an annual cash bonus, based on the target bonus, which is expressed as a percentage of base salary and established based on references to market data as described above.  The target bonuses as a percentage of salary for each of our Named Executive Officers for 2024 is as follows:\nNamed Executive Officer\n2024 Target Bonus as a % of Salary\nTyler Glover\n110%\nChris Steddum\n90%\nMicheal W. Dobbs\n75%\nTarget bonuses as a percentage of base salary were unchanged from 2023.  \nThe Compensation Committee has established a structured annual incentive program, with goals tied to key metrics for the Company, pursuant to which the bonuses discussed above are awarded.  For 2024, the metrics included two performance metrics (Adjusted EBITDA margin and free cash flow/share (“FCF”) as well as several strategic objectives, as outlined below.\n2024\n \nAnnual (Short-Term) Incentive Program Summary\nMetric\nWeight\nRationale\nAdjusted EBITDA Margin %\n25%\nTPL has one of the highest Adjusted EBITDA margins of any company in the oil and gas industry and maintaining high margins is a priority for the management team.\nFCF per Fully Diluted Share\n(1)\n50%\nGenerating FCF is a high priority for TPL, which enables greater returns to stockholders in the form of dividends and share repurchases.\nStrategic Objectives\n25%\nThese objectives were established based on key strategic priorities to ensure long-term success, such as safety and environmental performance, increasing use of TPL’s land, SLEM, and water services, leveraging TPL’s land to explore other non-oil and gas revenue streams and generating an appropriate return on new capital spend.\n(1)\nCalculated as FCF divided by the diluted weighted average number of shares outstanding.\nAs part of its ongoing evaluation of the annual incentive program and after considering feedback from stockholders, the Compensation Committee determined to reduce the weight of Adjusted EBITDA margin in the calculation of the annual cash bonuses our executive officers are eligible to receive for 2024. As a result, the weighting of the metrics used for purposes of the 2024 annual incentive plan was adjusted as follows:\nMetric\n2023 Weight\n2024 Weight\nAdjusted EBITDA Margin\n37.5%\n25.0%\nFCF per Fully Diluted Share\n37.5%\n50.0%\nStrategic Objectives\n25.0%\n25.0%\nGoals for each of the 2024 metrics were established at the beginning of 2024, based on expectations for the year.  The threshold, target, and maximum levels of performance for each performance metric are outlined below.  At threshold, target, and maximum performance levels, 50%, 100%, and 200% of the target bonus would be earned, respectively, for each metric.\nMetric\nWeighting\nThreshold\nTarget\nMaximum\nActual Results \nAdjusted EBITDA Margin %\n25.0%\n78.0%\n83.0%\n88.0%\n86.5%\nFCF per Fully Diluted Share\n50.0%\n$11.00\n$15.67\n$20.33\n$20.03\nTPL’s performance against the pre-established financial goals can be heavily influenced by the impact of changes in commodity prices.  To mitigate this impact, the Committee implemented a commodity adjustment calculation in 2022 and beyond, which uses a collar on commodity prices.  Within the collar range, no adjustment is made for commodity prices.  If \n47\nTable of \nContents\nTPL’s total commodity price realization falls below or rises above the collar range, a floor or cap on prices is applied.  This provides our management team with some exposure to commodity price fluctuations, in line with our stockholders, but limits the exposure with significant changes in commodity prices.  In 2024, the collar for commodity prices ranged from $29.83 per Boe to $47.24 per Boe.  Actual realizations of $39.87 per Boe were within the range of the collar for 2024, thus no adjustment to price per Boe was necessary for determining adjusted EBITDA margin and FCF per fully diluted share.\nBased on final financial results, TPL exceeded the Target level on both of the financial metrics, earning 171% of target on the Adjusted EBITDA margin metric and 194% of target on the FCF per fully diluted share metric.\nThe Compensation Committee also established strategic objectives for the year which were intended to encourage our management team to take action to improve TPL’s long-term opportunities for success, but which did not directly impact financial results in 2024.  The material aspects of the objectives are outlined below. \nStrategic Objectives\nResults\nSafety:\n Maintain a total recordable incident rate (“TRIR”) score at or below the industry average\nNo reported safety incidents; TRIR score is zero\nESG:\n Remain below FY21 Scope 1 Emissions level (assuming no significant acquisitions)\nScope 1 emissions declined 8% compared to 2021 levels resulting from electrification of water facilities\nEnvironmental:\n Zero produced water spills\nZero spills\nActive Management:\n Maintain N. Delaware development market capture rate above TPL acreage ownership\nAchieved lateral feet drilled capture rate of 13% above average ownership level\nGrowth:\n Secure four new SWD permits and execute one new long-term agreement on recently acquired assets\nExceeded the goal of securing four new SWD permits\nCapital Returns:\n Achieve ROIC of 8% for acquisitions and growth capital deployed throughout the year\nActual ROIC results exceeded 8%\nGiven the challenging nature of the strategic objectives and the 2024 actual results, the Compensation Committee scored the strategic objectives at 200% of target.  \nBased on the achievement of all three metrics, bonuses were earned at 189.4% of target for each of the Named Executive Officers, as outlined below:\nNamed Executive Officer\nActual Bonus for 2024\nTyler Glover\n$\n1,771,181 \nChris Steddum\n$\n895,062 \nMicheal W. Dobbs\n$\n625,123 \nFor 2025, the Compensation Committee has approved a change in metrics for the short-term incentive program from Adjusted EBITDA margin to Adjusted EBITDA. As TPL's revenue has grown, it has become more difficult to ensure alignment between maximizing FCF and increasing the Adjusted EBITDA margin.  While maintaining our high Adjusted EBITDA margin remains a priority for TPL management, the Compensation Committee has determined that using Adjusted EBITDA as a metric for the short-term incentive program provides a more appropriate incentive for management.\n2024\n \nLong-Term Incentive Program\nAs part of the program redesign in 2022, the Compensation Committee implemented a long-term incentive plan for key employees at TPL, including Named Executive Officers.  The goals of the long-term incentive plan include:\n•\nAlign executives’ financial interests with stockholders.\n•\nTie executive compensation with long-term performance.\n•\nCreate a retention incentive through a substantial forfeitable balance with long-term vesting.\n•\nProvide a competitive compensation program aligned with typical company practices.\n48\nTable of \nContents\nTo meet the objectives of the program, the Compensation Committee established a long-term incentive program for the Named Executive Officers that uses a combination of PSUs and RSUs.  Each of the primary vehicles is summarized in the table below and described in more detail later in this section.\n \nVehicle\nWeight\nRationale\nPSUs Tied to Relative Total Stockholder Return (“RTSR”) against the XOP Index\n25%\nEarned if TPL performs well against a broad group of energy companies included in the XOP index. The maximum amount can only be earned if TPL is in the top 10% of this index.\nPSUs Tied to Three-Year Cumulative FCF per Fully Diluted Share\n25%\nEarned if TPL meets pre-established goals for generating FCF over the three-year performance period.  Generating FCF enables greater returns to stockholders in the form of dividends and share repurchases.\nTime-Based Restricted Stock Units (RSUs)\n50%\nIncreases alignment between executives’ interests and stockholders through share ownership of our executive team.  Encourages continuity of the management team due to long-term (three-year) vesting provisions.\nPerformance Share Units (PSUs)\nPSUs comprise 50% of our Named Executive Officers’ long-term incentive compensation for 2024.  The Compensation Committee believes that PSUs create alignment between our executive officers and our long-term performance as measured by RTSR against a broad energy industry index (50% of PSUs) and the generation of free cash flow per fully diluted share over a three-year period (50% of PSUs).  These awards vest, if at all, at the end of a three-year performance period.\nThe PSUs tied to RTSR (the “RTSR PSUs”) are intended to measure the performance of TPL’s stock against a broad set of energy industry companies included in the XOP index.  Measuring RTSR against this group helps mitigate the impact of commodity price swings on the measurement of our performance.  While TPL does not have any direct peers, the broad XOP index comprises many of our customers and other companies that are similarly impacted by fluctuations in commodity prices.\nThe RTSR PSUs can be earned between 0% and 200% of the target number of shares based on our RTSR percentile ranking against the constituents of the XOP index as follows:\nPercentile Rank\nShares Earned as a % of Target\n (1)\n90\nth\n or above\n200%\n70\nth \n150%\n50\nth \n100%\n25\nth\n25%\n< 25\nth\n—%\n(1)\nPayouts are interpolated between the points in the table.\nRTSR is measured using an average closing price at the beginning and end of the performance period.  In the case of the 2024 awards, the average closing price over the month of January 2027 will be compared against the average closing price over the month of January 2024, assuming reinvestment of dividends from February 1, 2024 to January 31, 2027.\n \nThe remaining 50% of PSUs (the “FCF PSUs”) measure our cumulative FCF per fully diluted share against our initial targets over a three-year period.  If the Company is able to outperform and generate greater FCF, it will help enable an increase in returns to stockholders through dividends and share repurchases.  By measuring FCF on a per share basis, it requires our management team to ensure any dilution to our stockholders results in sufficiently greater FCF on an absolute basis.\nThe FCF PSUs can be earned between 0% and 200% of the target number of shares based on cumulative FCF per fully diluted share as follows: \n49\nTable of \nContents\nPerformance Level\nCumulative 3 Year FCF/Share\nShares Earned as a % of Target\n (1)\nMaximum\n$63.33/Share\n200%\nTarget\n$50/Share\n100%\nThreshold\n$36.67/Share\n25%\nBelow Threshold\n<$36.67/Share\n—%\n(1)\nPayouts are interpolated between the points in the table.\nRestricted Stock Units (RSUs)\nRSUs made up the other 50% of our Named Executive Officers’ long-term incentive compensation for 2024. Regular grants of RSUs are intended to help build an ownership stake in TPL, thereby further aligning the interests of executives with the interests of TPL stockholders.  The RSUs serve as a retention tool by creating a substantial forfeitable stake in the Company.  The RSUs vest based on continued service to TPL in one-third increments per year, beginning on the first anniversary of the grant date.\n2024 Long-Term Incentive Grants\nIn early 2024, the Compensation Committee established target long-term incentive grant levels for each of its Named Executive Officers based on a review of market data from the Reference Group and consideration of other factors such as experience and expertise, individual and company performance, and potential competitive opportunities for each of our Named Executive Officers.  The target long-term incentive grant levels were established as a percentage of base salary and converted into a number of units based on the stock price on the grant date. \nThe February 2024 awards are summarized in the table below:\nName and Position\nBase Salary\nTarget LTI as % of Base Salary\nTarget LTI Dollar Amount\n (1)\nNumber of PSUs (at Target)\nNumber of RSUs\nTyler Glover\n$\n850,000 \n425 \n%\n$\n3,612,500 \n3,804 \n3,804 \nChris Steddum\n$\n525,000 \n375 \n%\n$\n1,968,750 \n2,076 \n2,076 \nMicheal W. Dobbs\n$\n440,000 \n260 \n%\n$\n1,144,000 \n1,206 \n1,206 \n(1)\nThe Target LTI Dollar Amount does not match the accounting values in the Summary Compensation Table as the accounting value of the  RTSR PSUs is based on a Monte Carlo valuation.\n2024 PSU Vestings\nFollowing the end of the 2022-2024 performance period, the Compensation Committee certified the results of the PSU awards granted to our Named Executive Officers in 2022.  The awards were split between 50% RTSR PSUs and 50% FCF PSUs.  The results for each are presented in the following table:\nPSUs\nThreshold (25% Payout)\nTarget (100% Payout)\nMaximum (200% Payout)\nActual Results\nPercentage of Targeted Shares Earned\nRTSR PSUs\n25\nth\n percentile\n50\nth\n percentile\n90\nth\n percentile\n265 \n%\n200 \n%\nFCF PSUs\n$35.00/share\n$42.50/share\n$50.00/share\n$\n57.58 \n200 \n%\nOther Compensation \nTPL’s Named Executive Officers are eligible to participate in the same benefit programs as are available to all TPL employees generally.  These include both the Pension Plan and a qualified defined contribution plan. These plans are designed to assist employees in planning for their retirement.  There are no supplemental non-qualified programs that are maintained solely for the benefit of our executives. The Pension Plan was frozen as of December 31, 2024 and no future benefit accruals will be made.  See further discussion of the freezing of the Pension Plan in Note 8, “Pension and Other Postretirement Benefits” in the notes to our consolidated financial statements included under Part II, Item 8, “Financial and Supplementary Data.”\n50\nTable of \nContents\nTPL also provides certain executive officers with minimal perquisites, including an automobile allowance.\nOther Governance Features\nStock Ownership Guidelines\nThe Company believes that it is in the best interests of our stockholders for our executive officers, including our Named Executive Officers, to maintain a significant ownership position in TPL to create substantial alignment between our senior management and our stockholders.  Therefore, we have established stock ownership guidelines applicable to all of our executive officers.  The ownership guidelines require each of our executive officers to hold shares of Common Stock with an aggregate value of at least a specified multiple of base salary as follows:\n•\nCEO – 5x base salary\n•\nOther Named Executive Officers – 2x base salary\n•\nOther Executive Officers – 1x base salary\nShares counting towards the guideline include TPL shares held outright and unvested time-based restricted shares, if any.  PSUs and RSUs do not count until earned.  Until and unless each officer has achieved the desired ownership level, he or she is required to retain at least 50% of the after-tax shares received upon vesting of equity awards.  \nEmployment Agreements\nThe Company has entered into employment agreements with each Named Executive Officer following approval from the Compensation Committee.  These employment agreements provide for minimum levels of compensation and provide severance protections for the officer upon a termination of employment without Cause or for Good Reason (each as defined in the applicable agreement).  These agreements help match competitive practices and also include certain restrictive covenants designed to protect the Company.  The provisions of these agreements are summarized under the “Employment Agreements” below.\nAccounting and Tax Considerations\nIn setting the components of our executive compensation program, the Committee considers the impact of the following tax and accounting provisions:\nCode Section 162(m).  \nSection 162(m) of the Internal Revenue Code of 1986, as amended (the “Code”), generally disallows a tax deduction by public companies for compensation over $1 million paid individually to covered employees, as defined in the Code.  Tax deductibility is only one factor considered by the Compensation Committee in making compensation decisions that are in the best interest of TPL and our stockholders.\nFinancial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”) Topic 718, “Stock Compensation” (“ASC Topic 718”).  \nASC Topic 718 requires a public company to measure the cost of employee services received in exchange for an award of equity based on the grant date fair value of the award.  Our equity awards to the Named Executives Officers (and to our other employees) are structured in a manner that is intended to maintain the appropriate accounting treatment.\nCode Section 409A.  \nSection 409A of the Code provides that deferrals of compensation under a nonqualified deferred compensation plan or arrangement are to be included in an individual’s current gross income to the extent that such deferrals are not subject to a substantial risk of forfeiture and have not previously been included in the individual’s gross income, unless certain requirements are met.  We structure our stock plans, change of control agreements, severance plans and agreements and other incentive plans and agreements, each to the extent they are subject to Section 409A, to be in compliance with Section 409A. \nCode Sections 280G and 4999.  \nThe change of control benefits in our Named Executive Officers’ employment agreements provide that, upon a change of control, we will either (i) reduce the amount of severance benefits otherwise payable to the executive officer so that such severance benefits will not be subject to excise tax for purposes of Sections 280G and 4999 of the Code, or (ii) pay the full amount of severance benefits to the executive officer (but with no tax “gross-up”), whichever produces the better after-tax result for the executive officer (often referred to as the “best-of-net” approach).\n51\nTable of \nContents\nRisk Assessment\nThe Compensation Committee has reviewed the relationship between our risk management policies and compensation policies and practices and concluded that we do not have any compensation policies or practices that expose us to risks that are reasonably likely to have a material adverse effect on TPL.\nOther Compensation-Related Policies\nWe have an Insider Trading Policy that sets forth terms, conditions, timing, limitations, and prohibitions with respect to trading in the Company’s securities.  The Insider Trading Policy also generally prohibits executive officers, among others, from hedging, including engaging in publicly-traded options, puts, calls, or other derivative instruments relating to the Company’s securities, or selling the Company’s securities “short.”  The Insider Trading Policy also requires that such persons obtain pre-approval from the Company’s General Counsel for all pledges, and the deposit in margin accounts, of the Company’s securities.  The Insider Trading Policy is discussed further under Part III, Item 10. “Directors, Executive Officers and Corporate Governance \n—\n Matters Relating to Our Governance \n—\n Insider Trading Policy: Anti-Hedging Policy” above.\nWe have adopted a Clawback Policy in accordance with SEC rules and NYSE listing standards that requires covered executives to reimburse the Company, or forfeit, any excess incentive compensation received by them during the three completed fiscal years immediately preceding the date on which the Company is required to prepare an accounting restatement of its financial statements due to the Company’s material noncompliance with any such financial reporting requirement under the securities laws.  The Clawback Policy is discussed further under Part III, Item 10. “Directors, Executive Officers and Corporate Governance \n—\n Matters Relating to Our Governance \n—\n Clawback Policy” above. \nSummary Compensation Table \nThe following table sets forth information concerning compensation for services in all capacities awarded to, earned by, or paid to, the Named Executive Officers:\nName and Position\nYear\nSalary\nStock Awards \n(1)\nNon-Equity Incentive Plan\n (2)\nChange in\nActuarial Present\nValue of\nAccumulated\nBenefits \n(3)\nAll Other\nCompensation\n (4),(5)\nTotal\nTyler Glover\n2024\n$\n850,000 \n$\n4,756,794 \n(6)\n$\n1,771,181 \n$\n— \n$\n35,100 \n$\n7,413,075 \nPresident and Chief Executive Officer\n2023\n$\n850,000 \n$\n3,771,255 \n$\n1,412,785 \n$\n40,477 \n$\n34,200 \n$\n6,108,717 \n2022\n$\n850,000 \n$\n3,766,469 \n$\n1,636,250 \n$\n— \n$\n32,700 \n$\n6,285,419 \nChris Steddum\n2024\n$\n525,000 \n$\n2,595,979 \n(6)\n$\n895,062 \n$\n13,148 \n$\n20,700 \n$\n4,049,889 \nChief Financial Officer\n2023\n$\n500,000 \n$\n1,806,913 \n$\n679,950 \n$\n26,724 \n$\n19,800 \n$\n3,033,387 \n2022\n$\n475,000 \n$\n1,554,798 \n$\n748,125 \n$\n— \n$\n18,300 \n$\n2,796,223 \nMicheal W. Dobbs\n2024\n$\n440,000 \n$\n1,508,069 \n(6)\n$\n625,123 \n$\n23,226 \n$\n20,700 \n$\n2,617,118 \nSenior Vice President, \nSecretary and \nGeneral Counsel\n2023\n$\n420,000 \n$\n1,166,994 \n$\n475,965 \n$\n31,869 \n$\n19,800 \n$\n2,114,628 \n2022\n$\n400,000 \n$\n957,084 \n$\n525,000 \n$\n24,285 \n$\n18,000 \n$\n1,924,369 \n(1)\nAmounts reflect rounding up to full shares upon conversion of approved dollar-denominated awards.  The amounts presented in this column do not reflect compensation actually received by the Named Executive Officers. Rather, the amounts represent the aggregate grant date fair value of RSUs and PSUs granted to the Named Executive Officers in each year reported, in each case computed in accordance with ASC Topic 718, excluding the effect of any estimated forfeitures. A discussion of the assumptions used in the calculation of these amounts is included in Note 9, “Share-Based Compensation” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”\n52\nTable of \nContents\n(2)\nAmounts consist of cash bonuses approved by the Compensation Committee with respect to all Named Executive Officers for the respective year.  Bonuses were accrued as of December 31 of each respective year and paid and/or expected to be paid on or before March 15 of the following year. \n(3)\nRepresents the aggregate change in the actuarial present value of the Named Executive Officer’s accumulated benefit under the Pension Plan over the prior year.  For further information regarding TPL’s pension plan, see Note 8, “Pension and Other Postretirement Benefits” in the notes to our consolidated financial statements included under Part II, in Item 8. “Financial Statements and Supplementary Data.”  For 2024, the actuarial result value of accumulated benefits decreased by $12,109 for Mr. Glover, and as amount is negative it is reported as zero in the table.  For 2022, the actuarial present value of accumulated benefits decreased by $122,716 for Mr. Glover and decreased by $7,421 for Mr. Steddum, and as amounts are negative, are reported as zero in the table.\n(4)\nThe amount presented includes contributions by TPL to the account of the Named Executive Officer under the Company’s defined contribution retirement plan.\n(5)\nThe aggregate value of the perquisites and other personal benefits, if any, received by the Named Executive Officers for all years presented have not been reflected in the table because the amount was below the SEC’s $10,000 threshold for disclosure, except for Mr. Glover, whose perquisites consisted of $14,400 in automobile allowance for each of 2024, 2023, and 2022.\n(6)\nRepresents the aggregate grant date fair value of PSUs and RSUs granted to the Named Executive Officer in February 2024.  The reported grant date fair value of PSUs granted to the Named Executive Officers is based on the probable outcome of the performance conditions.  The maximum grant date fair value of stock awards granted to Mr. Glover, Mr. Steddum and Mr. Dobbs, assuming achievement of the highest level of performance conditions for the PSUs is $4,756,794, $2,595,979 and $1,508,069, respectively.\nGrants of Plan Based Awards During 2024\nThe following table sets forth certain information concerning equity awards granted to our Named Executive Officers during the Last Fiscal Year: \nEstimated Future Payouts Under Non-Equity Incentive Plan Awards\nEstimated Future Payouts Under Equity Incentive Plan Awards\nAll Other Stock Awards: Number of Shares of Stock or Units (#)\n (2)\nGrant Date Fair Value of Stock and Option Awards ($)\n (3)\nName\nAward Type\nGrant Date\nThreshold\n($)\nTarget \n($)\nMaximum \n($)\nThreshold\n(in units)\n (1)\nTarget \n(in units)\n (1)\nMaximum \n(in units)\n (1)\nTyler Glover\nBonus\n(4)\n$\n467,500 \n$\n935,000 \n$\n1,870,000 \nRTSR PSU\nFebruary 13, 2024\n476 \n1,902 \n3,804 \n$\n1,144,135 \nFCF PSU\nFebruary 13, 2024\n476 \n1,902 \n3,804 \n$\n1,806,329 \nRSU\nFebruary 13, 2024\n3,804 \n$\n1,806,329 \nChris Steddum\nBonus\n(4)\n$\n236,250 \n$\n472,500 \n$\n945,000 \nRTSR PSU\nFebruary 13, 2024\n260 \n1,038 \n2,076 \n$\n624,402 \nFCF PSU\nFebruary 13, 2024\n260 \n1,038 \n2,076 \n$\n985,789 \nRSU\nFebruary 13, 2024\n2,076 \n$\n985,789 \nMicheal W. Dobbs\nBonus\n(4)\n$\n165,000 \n$\n330,000 \n$\n660,000 \nRTSR PSU\nFebruary 13, 2024\n151 \n603 \n1,206 \n$\n362,731 \nFCF PSU\nFebruary 13, 2024\n151 \n603 \n1,206 \n$\n572,669 \nRSU\nFebruary 13, 2024\n1,206 \n$\n572,669 \n(1)    These PSUs will vest three years after grant if certain performance metrics are met.  For further discussion of performance metrics, see “2024 Compensation Program — 2024 Annual Long-Term Incentive Program” above and Note 9, “Share-Based Compensation” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”\n53\nTable of \nContents\n(2)    These RSUs will vest in one-third increments over a three-year period, beginning on the first anniversary of the grant date.  For further discussion, see “2024 Compensation Program — 2024 Annual Long-Term Incentive Program” above and Note 9, “Share-Based Compensation” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”\n(3)    Represents the grant date fair value of each equity award computed in accordance with ASC Topic 718, excluding the effect of estimated forfeitures. For RSUs and FCF PSUs, grant date fair value is based upon the closing stock price on the grant date.  For FCF PSUs, grant date fair value reflects the maximum number of units based upon probability analysis as of December 31, 2024.  For RTSR PSUs, grant date fair value is determined using a Monte Carlo simulation model and the value reflected in the table is based upon target units.  A discussion of the assumptions used in the calculation of these amounts is included in Note 9, “Share-Based Compensation” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”\n(4)    The amounts presented in this row represent possible payout amounts under the annual incentive program based on the achievement of the performance goals described above in “2024 Compensation Program — 2024 Annual (Short-Term) Incentive Program Summary.” See the “Non-Equity Incentive Plan Compensation” column in the Summary Compensation Table for actual amounts paid to each Named Executive Officer for the 2024 performance period.\nOutstanding Equity Awards as of December 31, 2024\nThe following table sets forth certain information concerning outstanding equity awards of our Named Executive Officers at the end of the Last Fiscal Year.  All outstanding stock awards reported in this table represent RSUs and PSUs that vest as described in the footnotes to the table.  At the end of the Last Fiscal Year, no options or stock appreciation rights awards have been granted under TPL’s long term incentive plan.\nOutstanding Equity Awards at December 31, 2024\nStock Awards\nName\nAward Type\nNumber of Shares or Units of Stock that have Not Vested (#)\n (1)\nMarket Value of Shares or Units of Stock that have Not Vested ($) \n(2)\nEquity Incentive Plan Awards: Number of Unearned Shares, Units or Other Rights that have Not Vested (#)\n \nEquity Incentive Plan Awards: Market or Payout Value of Unearned Shares, Units or Other Rights that have Not Vested ($)\n (3)\nTyler Glover\nRSU\n6,828 \n$\n7,551,495 \nRTSR PSU\n5,103\n (4)\n$\n5,643,714 \nFCF PSU\n9,543\n(5)\n$\n10,554,176 \nChris Steddum\nRSU\n3,438 \n$\n3,802,290 \nRTSR PSU\n2,448 \n(4)\n$\n2,707,390 \nFCF PSU\n4,578\n (5)\n$\n5,063,085 \nMicheal W. Dobbs\nRSU\n2,073 \n$\n2,292,655 \nRTSR PSU\n1,491\n(4)\n$\n1,648,986 \nFCF PSU\n2,777\n (5)\n$\n3,071,251 \n(1)    Vesting of RSUs will occur as follows: \nFebruary 10, 2025\nFebruary 11, 2025\nFebruary 13, 2025\nFebruary 10, 2026\nFebruary 13, 2026\nFebruary 13, 2027\nTyler Glover\n882\n1,254\n1,266\n888\n1,269\n1,269\nChris Steddum\n423\n516\n690\n423\n693\n693\nMicheal W. Dobbs\n273\n321\n402\n273\n402\n402\n(2)    The market value for RSUs is calculated based upon the closing price of our Common Stock of $1,105.96 per share as of December 31, 2024. \n(3)    The market value for RTSR PSUs and FCF PSUs is calculated based upon the closing price of our Common Stock of  $1,105.96 per share as of December 31, 2024.\n(4)    For RTSR PSUs, the numbers presented represent number of target units.  For further discussion of performance metrics, see “2024 Compensation Program” above.  With respect to the RTSR PSUs granted to Messrs. Glover, Steddum and Dobbs on February 11, 2022, 1,875, 774 and 477 RTSR PSUs, respectively, will vest on February 11, 2025, assuming the target level of performance is achieved. With respect to the RTSR PSUs granted to \n54\nTable of \nContents\nMessrs. Glover, Steddum and Dobbs on February 10, 2023, 1,326, 636 and 411 RTSR PSUs, respectively, will vest on February 10, 2026, assuming the target level of performance is achieved. With respect to the RTSR PSUs granted to Messrs. Glover, Steddum and Dobbs on February 13, 2024, 1,902, 1,038 and 603 RTSR PSUs, respectively, will vest on February 13, 2027, assuming the target level of performance is achieved. \n(5)    For FCF PSUs granted on February 11, 2022, numbers presented represent maximum number of units based upon probability analysis as of December 31, 2024. For FCF PSUs granted on February 10, 2023, numbers presented represent 150% of the target number of units based upon probability analysis as of December 31, 2024. For FCF PSUs granted on February 13, 2024, numbers presented represent maximum number of units based upon probability analysis as of December 31, 2024.  For further discussion of performance metrics, see “2024 Compensation Program” above. With respect to the FCF PSUs granted to Messrs. Glover, Steddum and Dobbs on February 11, 2022, 3,750, 1,548 and 954 FCF PSUs, respectively, will vest on February 11, 2025, assuming the maximum level of performance is achieved. With respect to the FCF PSUs granted to Messrs. Glover, Steddum and Dobbs on February 10, 2023, 1,989, 954 and 617 FCF PSUs, respectively, will vest on February 10, 2026, assuming the 150% level of performance is achieved. With respect to the FCF PSUs granted to Messrs. Glover, Steddum and Dobbs on February 13, 2024, 3,804, 2,076 and 1,206 FCF PSUs, respectively, will vest on February 13, 2027, assuming the maximum level of performance is achieved.\nStock Awards Vested During 2024\nThe following table presents information concerning the vesting of stock, which consisted of RSUs, for our Named Executive Officers during the fiscal year ended December 31, 2024:\nStock Awards Vested During Year Ended  December 31, 2024\nName\nAward Type\nNumber of Shares Acquired on Vesting\nValue Realized on Vesting\n (1)\nTyler Glover\nRSU\n2,130\n$\n1,040,938 \nChris Steddum\nRSU\n939\n$\n458,892 \nMicheal W. Dobbs\nRSU\n588\n$\n287,358 \n(1)    Amounts presented represent the gross number of shares acquired and value received upon vesting of RSUs, without reduction for the number of shares withheld to pay applicable withholding taxes.  The value realized on vesting is based on the closing market price of our Common Stock on the applicable vesting date.\nPay Ratio Disclosure\nAs required by the Dodd-Frank Wall Street Reform and Consumer Protection Act and Regulation S-K, we are providing the following information about the relationship of the annual total compensation of our median employee and the annual total compensation of our Chief Executive Officer during 2024, Mr. Glover.\n \nFor purposes of calculating the 2024 ratio of the total annual compensation of the median employee to the total annual compensation of the Chief Executive Officer, we identified and calculated the elements of the median employee’s compensation using the same methodology reflected in the “Summary Compensation Table” above.  We used December 31, 2024 as the measurement date for identifying the median employee.  Base salary amounts were annualized for any employee who had less than a full year of service during 2024.  Total compensation for Mr. Glover, the Chief Executive Officer, was determined to be $7,413,075 and was approximately 46 times the median annual compensation of all of our employees, excluding the Chief Executive Officer, of $162,405.  For purposes of this calculation, the Company had 110 employees, excluding the Chief Executive Officer.\nEmployment Agreements \nMr. Glover\nOn October 13, 2023, the Company entered into an amended and restated employment agreement with Mr. Glover, its President and Chief Executive Officer (the “Glover Agreement”).  The Glover Agreement became effective as of October 13, 2023 and replaced and superseded the Company’s prior employment agreement with Mr. Glover that became effective on January 1, 2022 (“Prior Glover Agreement”).\nThe term of the Glover Agreement ends on December 31, 2026, with automatic one (1) year extensions unless notice not to renew is given at least 120 days prior to the relevant end date.\nUnder the Glover Agreement, Mr. Glover receives a base salary of $850,000 per annum, subject to annual review, and is eligible for an annual cash bonus (“Bonus”) a target value of at least 100% of such base salary for achievement of specified performance targets.  Mr. Glover is also eligible to receive annual long-term incentive awards (“LTI Awards”) under the Texas \n55\nTable of \nContents\nPacific Land Corporation 2021 Incentive Plan (the “2021 Plan”) as determined by the Board or Compensation Committee, the target amount of which, when added to Mr. Glover’s target Bonus for the year, will be at least 300% of his base salary for the relevant year.  Prior to the effective date of the Glover Agreement, in accordance with the terms of the Prior Glover Agreement, Mr. Glover was entitled to a base salary of $850,000, a Bonus with a target value of at least 100% of base salary, and LTI awards, the target amount of which, when added to the target Bonus, would be at least 300% of base salary.\nThe Glover Agreement provides for payment of severance benefits if Mr. Glover’s employment is terminated by the Company without cause or by Mr. Glover for good reason, provided that Mr. Glover executes a general waiver and release of claims and complies with the restrictive covenants described below. The severance benefits include (i) accrued but unpaid Bonuses, (ii) LTI Award benefits to the extent provided for pursuant to the underlying award and plan documents, (iii) a pro rata Bonus for the year of termination, (iv) monthly payments for up to 18 months of COBRA premiums for continued group health, dental and vision coverage for Mr. Glover and his dependents, and (v) an amount equal to two times the greater of (A) the average of his base salary and Bonus for the preceding three years, or (B) his base salary and target Bonus for the year of termination. If Mr. Glover’s employment is terminated by the Company without cause or by Mr. Glover for good reason within 24 months following a change in control of the Company as defined in the Glover Agreement, then, in lieu of the amount specified in clause (v), Mr. Glover will be entitled to an amount (“Glover CIC Severance Amount”) equal to 2.99 times the greater of (a) the average of his base salary and Bonus for the three years preceding the year in which the change in control occurs, and (b) his base salary and target Bonus for the year in which the change in control occurs. In addition to the foregoing, Mr. Glover will be entitled to (x) a payment equal to the value of his restrictive covenants, which payment shall offset an equal amount of the Glover CIC Severance Amount; (y) 12 months of outplacement services paid for by the Company (not to exceed $30,000); and (z) 12 months of financial planning services paid for by the Company (not to exceed $30,000).  If Mr. Glover’s employment terminates due to death or disability, he or his estate will be entitled to the benefits described in clauses (i), (ii) and (iii) above. Mr. Glover will also be entitled to payment of accrued but unpaid salary, accrued but unused vacation, unsubsidized COBRA benefits, and unreimbursed business expenses, following termination of employment for any reason.\nThe Glover Agreement provides that Mr. Glover is entitled to participate in all benefit plans provided to the Company’s executives of like status from time to time in accordance with the applicable plan, policy or practices of the Company. It also provides for four weeks of annual paid vacation, reimbursement of business expenses, and indemnification rights.\nThe Glover Agreement contains restrictive covenants prohibiting Mr. Glover from disclosing the Company’s confidential information at any time, from competing with the Company in specified counties where the Company does business during his employment, subject to certain exceptions, and for one year thereafter (or six months thereafter if he terminates his employment voluntarily without good reason), and from soliciting the Company’s clients, suppliers and business partners during his employment and for one year thereafter.\nMr. Steddum\nOn October 13, 2023, the Company entered into an amended and restated employment agreement with Mr. Steddum, its Chief Financial Officer (the “Steddum Agreement”). The Steddum Agreement was effective as of October 13, 2023 and replaced and superseded the Company’s prior employment agreement with Mr. Steddum that became effective on January 1, 2022.\nThe term of the Steddum Agreement ends on December 31, 2026, with automatic one (1) year extensions unless notice not to renew is given at least 120 days prior to the relevant end date.\nUnder the Steddum Agreement, Mr. Steddum receives (and prior to the effective date of the Steddum Agreement, Mr. Steddum received) a base salary of $500,000 per annum, subject to annual review, and is eligible for an annual cash Bonus with a target value of up to at least 90% of such base salary for achievement of specified performance targets. Mr. Steddum is (and prior to the effective date of the Steddum agreement was) also eligible to receive annual LTI Awards as determined by the Board or the Compensation Committee, the target amount of which, when added to Mr. Steddum’s target Bonus for the year, will be at least 225% of his base salary for the relevant year. \nThe Steddum Agreement provides for payment of severance benefits if Mr. Steddum’s employment is terminated by the Company without cause or by Mr. Steddum for good reason, provided that Mr. Steddum executes a general waiver and release of claims and complies with the restrictive covenants described below.  The severance benefits include (i) accrued but unpaid Bonuses, (ii) LTI Award benefits to the extent provided for pursuant to the underlying award and plan documents, (iii) a pro rata Bonus for the year of termination, (iv) monthly payments for up to 18 months of COBRA premiums for continued group health, dental and vision coverage for Mr. Steddum and his dependents, and (v) an amount equal to two times the greater \n56\nTable of \nContents\nof (A) the average of his base salary and Bonus for the preceding three years, or (B) his base salary and target Bonus for the year of termination.  If Mr. Steddum’s employment is terminated by the Company without cause or by Mr. Steddum for good reason within 24 months following a change in control of the Company as defined in the Steddum Agreement, then, in lieu of the amount specified in clause (v) of the preceding sentence, Mr. Steddum will be entitled to an amount (“Steddum CIC Severance Amount”) equal to 2.99 times the greater of (a) the average of his base salary and Bonus for the three years preceding the year in which the change in control occurs, and (b) his base salary and target Bonus for the year in which the change in control occurs.  In addition, Mr. Steddum will be entitled to (x) a payment equal to the value of his restrictive covenants, which payment shall offset an equal amount of the Steddum CIC Severance Amount; (y) 12 months of outplacement services paid for by the Company (not to exceed $30,000); and (z) 12 months of financial planning services paid for by the Company (not to exceed $30,000).  If Mr. Steddum’s employment terminates due to death or disability, he or his estate will be entitled to the benefits described in clauses (i), (ii) and (iii) above. Mr. Steddum will also be entitled to payment of accrued but unpaid salary, accrued but unused vacation, unsubsidized COBRA benefits, and unreimbursed business expenses, following termination of employment for any reason.\nThe Steddum Agreement provides that Mr. Steddum is entitled to participate in all benefit plans provided to the Company’s executives of like status from time to time in accordance with the applicable plan, policy or practices of the Company.  It also provides for four weeks of annual paid vacation, reimbursement of business expenses, and indemnification rights.\nThe Steddum Agreement contains restrictive covenants prohibiting Mr. Steddum from disclosing the Company’s confidential information at any time, from competing with the Company in specified counties where the Company does business during his employment, subject to certain exceptions, and for one year thereafter (or six months thereafter if he terminates his employment voluntarily without good reason), and from soliciting the Company’s clients, suppliers and business partners during his employment and for one year thereafter.\nMr. Dobbs\nOn October 13, 2023, the Company entered into a new employment agreement with Mr. Dobbs, its Senior Vice President, Secretary and General Counsel (the “Dobbs Agreement”).  The Dobbs Agreement became effective as of October 13, 2023 and replaced and superseded the Company’s prior employment agreement with Mr. Dobbs that became effective on January 1, 2022.\nThe term of the Dobbs Agreement ends on December 31, 2026, with automatic one (1) year extensions unless notice not to renew is given at least 120 days prior to the relevant end date.\nUnder the Dobbs Agreement, Mr. Dobbs receives (and prior to the effective date of the Dobbs Agreement, Mr. Dobbs received) a base salary of $420,000 per annum, subject to annual review, and is eligible for an annual cash Bonus with a target value of at least 75% of such base salary for achievement of specified performance targets.  Mr. Dobbs is (and prior to the effective date of the Dobbs Agreement was) also eligible to receive annual LTI Awards as determined by the Board or Compensation Committee, the target amount of which, when added to Mr. Dobbs’s target Bonus for the year, will be at least 175% of his base salary for the relevant year.  \nThe Dobbs Agreement provides for payment of severance benefits if Mr. Dobbs’s employment is terminated by the Company without cause or by Mr. Dobbs for good reason, provided that Mr. Dobbs executes a general waiver and release of claims and complies with the restrictive covenants described below.  The severance benefits include (i) accrued but unpaid Bonuses, (ii) LTI Award benefits to the extent provided for pursuant to the underlying award and plan documents, (iii) a pro rata Bonus for the year of termination, (iv) monthly payments for up to 18 months of COBRA premiums for continued group health, dental and vision coverage for Mr. Dobbs and his dependents, and (v) an amount equal to two times the greater of (A) the average of his base salary and Bonus for the preceding three years, or (B) his base salary and target Bonus for the year of termination.  If Mr. Dobbs’s employment is terminated by the Company without cause or by Mr. Dobbs for good reason within 24 months following a change in control of the Company as defined in the Dobbs Agreement, then, in lieu of the amount specified in clause (v), Mr. Dobbs will be entitled to an amount (“Dobbs CIC Severance Amount”) equal to 2.99 times the greater of (a) the average of his base salary and Bonus for the three years preceding the year in which the change in control occurs, and (b) his base salary and target Bonus for the year in which the change in control occurs. In addition, Mr. Dobbs will be entitled to (x) a payment equal to the value of his restrictive covenants, which payment shall offset an equal amount of the Dobbs CIC Severance Amount; (y) 12 months of outplacement services paid for by the Company (not to exceed $30,000); and (z) 12 months of financial planning services paid for by the Company (not to exceed $30,000).  If Mr. Dobbs’s employment terminates due to death or disability, he or his estate will be entitled to the benefits described in clauses (i), (ii) and (iii) above. \n57\nTable of \nContents\nMr. Dobbs will also be entitled to payment of accrued but unpaid salary, accrued but unused vacation, unsubsidized COBRA benefits, and unreimbursed business expenses, following termination of employment for any reason.\nThe Dobbs Agreement provides that Mr. Dobbs is entitled to participate in all benefit plans provided to the Company’s executives of like status from time to time in accordance with the applicable plan, policy or practices of the Company.  It also provides for four weeks of annual paid vacation, reimbursement of business expenses, and indemnification rights.\nThe Dobbs Agreement contains restrictive covenants prohibiting Mr. Dobbs from disclosing the Company’s confidential information at any time, from competing with the Company in specified counties where the Company does business during his employment, subject to certain exceptions, and for one year thereafter (or six months thereafter if he terminates his employment voluntarily without good reason), and from soliciting the Company’s clients, suppliers and business partners during his employment and for one year thereafter.\nThe Glover Agreement, the Steddum Agreement and the Dobbs Agreement each provide that we will either (i) reduce the amount of severance benefits otherwise payable to the executive officer under the applicable agreement so that such severance benefits will not be subject to excise tax for purposes Sections 280G and 4999 of the Code or (ii) pay the full amount of severance benefits payable to the executive officer under the applicable employment agreement (but with no tax “gross-up”), whichever produces the better after-tax result for the executive officer.\nPotential Payments upon Termination or Change in Control\nThe table below presents the estimated value of payments and benefits that each Named Executive Officer would have been entitled to receive if the specified triggering event had occurred on December 31, 2024. Amounts presented for the vesting of equity awards are calculated based on the closing price of our Common Stock on the NYSE on December 31, 2024, which was $1,105.96 per share.\nName\nBenefit\nDeath/Disability ($)\nChange in Control ($)\nTermination without Cause or by NEO for Good Reason within 24 Months of a Change in Control ($)\nTermination without Cause or by NEO for Good Reason ($)\nTyler Glover\nCash severance payment\n (1)\n$\n— \n$\n— \n$\n7,345,649 \n(2)\n$\n4,913,477 \n(3)\nAnnual incentive plan bonus unpaid at end of year\n1,771,181 \n(4)\n— \n1,771,181 \n(4)\n1,771,181 \n(4)\nContinuation of benefits\n— \n— \n49,723 \n(5)\n49,723 \n(5)\nVesting of 2022 RSUs\n (6)\n2,842,447 \n— \n(7)\n2,842,447 \n(7)\n2,842,447 \nVesting of 2022 PSUs\n4,260,263 \n(8)\n4,023,960 \n(9)\n236,303 \n(8)(10)\n4,260,263 \n(8)\nVesting of 2023 RSUs\n (6)\n2,984,561 \n— \n(7)\n2,984,561 \n(7)\n2,984,561 \nVesting of 2023 PSUs\n2,984,561 \n(8)\n1,825,399 \n(9)\n1,159,162 \n(8)(10)\n2,984,561 \n(8)\nVesting of 2024 RSUs\n (6)\n4,264,550 \n— \n(7)\n4,264,550 \n(7)\n4,264,550 \nVesting of 2024 PSUs \n4,264,550 \n(8)\n1,186,092 \n(9)\n3,078,458 \n(8)(10)\n4,264,550 \nOther\n— \n— \n60,000 \n(11)\n— \nTotal\n$\n23,372,113 \n$\n7,035,451 \n$\n23,792,034 \n$\n28,335,313 \n58\nTable of \nContents\nName\nBenefit\nDeath/Disability ($)\nChange in Control ($)\nTermination without Cause or by NEO for Good Reason within 24 Months of a Change in Control ($)\nTermination without Cause or by NEO for Good Reason ($)\nChris Steddum\nCash severance payment\n (1)\n$\n— \n$\n— \n$\n3,810,393 \n(2)\n$\n2,548,758 \n(3)\nAnnual incentive plan bonus unpaid at end of year\n895,062 \n(4)\n— \n895,062 \n(4)\n895,062 \n(4)\nContinuation of benefits\n— \n— \n49,723 \n(5)\n49,723 \n(5)\nVesting of 2022 RSUs\n (6)\n1,172,424 \n— \n(7)\n1,172,424 \n(7)\n1,172,424 \nVesting of 2022 PSUs\n1,758,636 \n(8)\n1,660,934 \n(9)\n97,702 \n(8)(10)\n1,758,636 \n(8)\nVesting of 2023 RSUs\n (6)\n1,428,133 \n— \n(7)\n1,428,133 \n(7)\n1,428,133 \nVesting of 2023 PSUs\n1,431,509 \n(8)\n875,561 \n(9)\n555,948 \n(8)(10)\n1,431,509 \n(8)\nVesting of 2024 RSUs\n (6)\n2,327,341 \n— \n(7)\n2,327,341 \n(7)\n2,327,341 \nVesting of 2024 PSUs\n2,327,341 \n(8)\n647,978 \n(9)\n1,679,363 \n(8)(10)\n2,327,341 \nOther\n— \n— \n60,000 \n(11)\n— \nTotal\n$\n11,340,446 \n$\n3,184,473 \n$\n12,076,089 \n$\n13,938,927 \nMicheal W. Dobbs\nCash severance payment\n (1)\n$\n— \n$\n— \n$\n2,876,468 \n(2)\n$\n1,924,059 \n(3)\nAnnual incentive plan bonus unpaid at end of year\n625,123 \n(4)\n— \n625,123 \n(4)\n625,123 \n(4)\nContinuation of benefits\n— \n— \n49,723 \n(5)\n49,723 \n(5)\nVesting of 2022 RSUs\n (6)\n722,541 \n— \n(7)\n722,541 \n(7)\n722,541 \nVesting of 2022 PSUs\n1,083,811 \n(8)\n1,024,735 \n(9)\n59,076 \n(8)(10)\n1,083,811 \n(8)\nVesting of 2023 RSUs\n (6)\n921,703 \n— \n(7)\n921,703 \n(7)\n921,703 \nVesting of 2023 PSUs\n925,079 \n(8)\n567,202 \n(9)\n357,877 \n(8)(10)\n925,079 \n(8)\nVesting of 2024 RSUs\n (6)\n1,352,010 \n— \n(7)\n1,352,010 \n(7)\n1,352,010 \nVesting of 2024 PSUs\n1,352,010 \n(8)\n376,680 \n(9)\n975,331 \n(8)(10)\n1,352,010 \nOther\n— \n— \n60,000 \n(11)\n— \nTotal\n$\n6,982,277 \n$\n1,968,617 \n$\n7,999,852 \n$\n8,956,059 \n(1)    The amount presented assumes that the Named Executive Officer did not have any accrued but unused vacation as of December 31, 2024.\n(2)    Assumes that, in connection with the change in control, the Named Executive Officer’s employment is terminated by the Company without cause or by the Named Executive Officer for good reason within a 24-month period following a change in control. The amount presented represents a severance payment equal to 2.99 times the three-year average of each Named Executive Officer’s base salary and annual bonus for 2022 through 2024.\n59\nTable of \nContents\n(3)    The amount presented represents a severance payment equal to two times the three-year average of the Named Executive Officer’s base salary and annual bonus for 2021 through 2024.\n(4)    Calculated based on the amount of bonus the Named Executive Officer would have been entitled to receive under the annual incentive plan based on the Company’s actual performance during the 2024 performance period, which is the same bonus amount actually paid to such Named Executive Officer for 2024 and reported in the “Non-Equity Incentive Plan Compensation” column of the Summary Compensation Table.\n(5)    The amount presented represents the aggregate amount payable for continuation of health, dental and vision insurance benefits for 18 months following the date of termination of employment, per the terms of the Glover Agreement, the Steddum Agreement and the Dobbs Agreement, as applicable.\n(6)    The applicable RSU award agreements provide that unvested RSUs will vest in full upon the Named Executive Officer’s death, disability, termination by the Company without cause (including following a change in control, assuming the award remains in effect) or termination by the Named Executive Officer for good reason (including following a change in control, assuming the award remains in effect). The applicable RSU award agreements also provide that, in the event of a change in control, any replacement award shall provide that if the Named Executive Officer is terminated by the Company without cause or for good reason, any unvested RSUs shall become immediately vested at the time of the termination. If no replacement award is granted in connection with a change in control and the Common Stock ceases to be publicly traded after the change in control, any unvested RSUs shall become immediately vested upon the change in control. The amounts presented include accrued but unpaid dividends on the RSUs.\n(7)    The amount presented assumes that, in connection with the change in control, no replacement awards are granted, the applicable RSU award agreements remain in effect and the Common Stock continues to be publicly traded.\n(8)    The applicable PSU award agreements provide that upon the Named Executive Officer’s death, disability, termination by the Company without cause or termination by the Named Executive Officer for good reason, the PSUs shall remain outstanding and eligible for vesting based on the actual achievement of the applicable performance goals. The amount presented assumes the target level of achievement for the applicable performance period and includes accrued but unpaid dividends on the PSUs.\n(9)    The applicable PSU award agreements provide that upon a change in control, a pro-rata number of PSUs will be immediately earned, vested and paid based on (i) for FCF PSUs, target level of achievement for the applicable performance period and (ii) for RTSR PSUs, the higher of (a) actual performance as of the date of the change in control and (b) achievement of an RTSR relative to reference group at the 50th percentile. The amount presented with respect to RTSR PSUs is based on achievement of an RTSR relative to the reference group at the 50th percentile, which was the target performance level as of December 31, 2024. The amount presented includes accrued but unpaid dividends on the PSUs.\n(10)    The amount presented assumes that a pro-rata number of the Named Executive Officer’s PSUs had already been earned, vested and paid in connection with the change in control prior to the Named Executive Officer’s termination as described in footnote 9 above.\n(11)    The amount presented represents the maximum reimbursable amount for outplacement and financial planning services costs under the Glover Agreement, the Steddum Agreement and the Dobbs Agreement, as applicable.\nPension Benefits \nName\nPlan Name\nNumber of Years\nCredited Service\nPresent Value of\nAccumulated Benefit \nPayments During\nLast Fiscal Year \nTyler Glover\nRestated Texas Pacific Land Corporation Employees' Pension Plan\n12.0 \n$\n158,346 \n$\n— \nChris Steddum\nRestated Texas Pacific Land Corporation Employees' Pension Plan\n4.5 \n$\n81,691 \n$\n— \nMicheal W. Dobbs\nRestated Texas Pacific Land Corporation Employees' Pension Plan\n3.0 \n$\n79,380 \n$\n— \nThe Pension Plan is a noncontributory defined benefit pension plan qualified under Section 401 of the Code in which the employees participate.  The remuneration covered by the Pension Plan is Salary, subject to applicable limits prescribed by the Internal Revenue Services.  The Pension Plan provides a normal retirement benefit equal to 1.5% of a participant’s average Salary for the last five years prior to retirement for each year of Credited Service under the Plan.  Credited service is earned from the participant’s date of membership in the Pension Plan, which is generally not the participant’s date of hire by the Company.  For information concerning the valuation method and material assumptions used in quantifying the present value of the Named Executive Officers’ current accrued benefits and the freezing of the Pension Plan effective December 31, 2024, see Note 8, “Pension and Other Postretirement Benefits” in the notes to our consolidated financial statements included under Part II, Item 8 “Financial Statements and Supplementary Data.” \nAs of December 31, 2024, the annual accrued normal retirement benefits are estimated to be $55,980 for Mr. Glover, $22,425 for Mr. Steddum, and $14,700 for Mr. Dobbs.\n \nThe Pension Plan provides for early retirement after 20 years of service with the Company.  Early retirement benefits are calculated in the same manner as the normal retirement benefit, but are reduced by 1/15 for each of the first five years and 1/30 for each of the next five years that benefits commence prior to normal retirement.  If benefits commence more than 10 years prior to normal retirement, the early retirement benefit payable at age 55 is reduced actuarially for the period prior to age 55.  None of the listed participants are currently eligible for early retirement benefits.  The Pension Plan was frozen as of December 31, 2024 and no future benefit accruals will be made.\n60\nTable of \nContents\nDirectors’ Compensation\nThe following table sets forth information concerning compensation paid to our non-employee directors during the year ended December 31, 2024.  Because Mr. Glover is an employee of the Company, he did not receive additional compensation for his service as a director in 2024.  See the Summary Compensation Table included above for additional information regarding the compensation paid to Mr. Glover.\nName\nFees Earned or Paid in Cash \n(1)\nStock Awards\n(2)\nTotal \nRhys J. Best\n$\n243,000 \n$\n125,796 \n$\n368,796 \nDonald G. Cook\n$\n144,000 \n$\n125,796 \n$\n269,796 \nBarbara J. Duganier\n$\n154,000 \n$\n125,796 \n$\n279,796 \nDonna E. Epps\n$\n154,000 \n$\n125,796 \n$\n279,796 \nKarl F. Kurz\n$\n138,000 \n$\n125,796 \n$\n263,796 \nEric L. Oliver\n$\n115,000 \n$\n125,796 \n$\n240,796 \nRobert Roosa\n$\n138,500 \n$\n125,796 \n$\n264,296 \nMurray Stahl\n$\n122,500 \n$\n125,796 \n$\n248,296 \nMarguerite Woung-Chapman\n$\n133,000 \n$\n125,796 \n$\n258,796 \n(1)    From time to time, the Board constitutes ad hoc committees and determines whether any, and if so how much, compensation is paid for such service.  Any such payments made to directors during the year ended December 31, 2024 are reflected in the “Fees Earned or Paid in Cash” column of the table above.\n(2)    Amounts shown represent the aggregate grant date fair value of non-employee director equity compensation, computed in accordance with ASC Topic 718, excluding the effect of estimated forfeitures. A discussion of the assumptions used in the calculation of these amounts is included in Note 9, “Share-Based Compensation” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and  Supplementary Data.” For purposes of non-employee director equity compensation, we did not issue any fractional shares and, as a result, the aggregate grant date fair value of each director’s award is slightly more than $125,000.  As of December 31, 2024, none of the non-employee directors had outstanding equity awards.\nOn an annual basis, all non-employee directors receive a base retainer of $230,000, of which $105,000 is paid in cash and $125,000 is paid in shares of Common Stock unless otherwise determined by the Company, valued at the closing price of the Common Stock on the NYSE on the date of grant of January 1 of each year and are immediately vested on the date of grant.  Directors serving in multiple leadership roles receive incremental compensation for each role, including that committee chairs receive both the committee service fee plus the specified amount for chairing such committee.  Directors are not expected to receive additional compensation for attending regularly scheduled Board or committee meetings.  For directors appointed or elected after January 1 of a given year, the compensation paid to the non-employee directors will be prorated based on the number of days of service. \n61\nTable of \nContents\nOn December 9, 2024, the Board approved increases for non-employee director compensation, beginning with the 2025 fiscal year.  Totals for 2025 are as follows:\n2024\n2025\nAnnual base retainer:\nCash\n$\n105,000 \n$\n105,000 \nShares of common stock\n (1)\n125,000 \n145,000 \nTotal base retainer\n$\n230,000 \n$\n250,000 \nCommittee service (per committee)\n$\n10,000 \n$\n10,000 \nChair Fees:\nBoard Chair\n$\n125,000 \n$\n130,000 \nAudit Committee Chair\n$\n10,000 \n$\n15,000 \nNominating and Corporate Governance Committee Chair\n$\n5,000 \n$\n10,000 \nCompensation Committee Chair\n$\n5,000 \n$\n10,000 \nStrategic Acquisitions Committee Chair\n$\n5,000 \n$\n5,000 \n(1)    Paid in shares of Common Stock, unless otherwise determined by the Company, valued at the closing price of the Common Stock on the NYSE on the date of grant of January 1 of each year and are immediately vested on the date of grant.\nStock Ownership Guidelines\nThe Company believes that it is in the best interests of our stockholders for our directors to maintain a significant ownership position in TPL to create substantial alignment with our stockholders.  Therefore, we have established stock ownership guidelines applicable to our non-employee directors.  The ownership guidelines require each of our non-employee directors to acquire, within five (5) years, and hold shares of Common Stock with an aggregate value of at least five (5) times the base cash retainer.  Shares counting towards the guidelines include TPL shares held outright and unvested time-based restricted shares.\n \nHowever, non-employee directors are permitted to sell shares of Common Stock to facilitate tax obligations in connection with the vesting of restricted shares.  If a non-employee director falls below the applicable multiple due solely to a decline in the value of shares of Common Stock, such non-employee director will not be required to acquire additional shares to meet the applicable multiple.\n \nCompensation\n \nCommittee\n \nInterlocks\n \nand\n \nInsider\n \nParticipation \nOur Compensation Committee consists of Ms. Duganier, the chair, Gen. Cook, Mr. Kurz and Mr. Roosa.  None of Ms. Duganier, Gen. Cook,  Mr. Kurz and Mr. Roosa, the members of the Compensation Committee, was an officer or employee of TPL during the Last Fiscal Year or had any relationship requiring disclosure by the Company pursuant to Item 404 of Regulation S-K.  There are no interlocking relationships requiring disclosure by the Company pursuant to Item 407(e)(4)(iii) of Regulation S-K.\nOn August 27, 2024, we announced the acquisition of oil and gas mineral interests in 4,106 total net royalty acres located in Culberson County, Texas for $120.3 million, net of post-closing adjustments (the “Mineral Interest Acquisitions”).  The Mineral Interest Acquisitions were completed in conjunction with Brigham Royalties Fund I Holdco, L.L.C., a subsidiary of Brigham Royalties.  Robert Roosa, a member of the Board, is a partner in, and serves as the Chief Executive Officer of, Brigham Royalties.  Brigham Royalties originally identified the opportunity and, because of the size and concentration, invited us to participate.  Following the execution of the purchase and sale agreements (totaling 7,416 net royalty acres) related to the Mineral Interest Acquisitions, a 55.4% interest in each was assigned to our subsidiary.\nEach party paid a pro-rata share of the purchase price and closing costs.  We directly paid an aggregate of approximately $1.1 million in commissions to six Brigham Royalties employees, which was equal to the bonuses those employees would have received with respect to the Mineral Interest Acquisitions had they been completed by Brigham Royalties.  Those fees were significantly less than commissions we would have paid to other third parties for similar services.  We performed our own diligence and valuation, and the Mineral Interest Acquisitions were approved by the Audit Committee and full Board with Mr. Roosa abstaining.  We did not pay any fees or commissions to Brigham Royalties or Mr. Roosa in \n62\nTable of \nContents\nconnection with, and we do not have any further relationship with Brigham Royalties with respect to the Mineral Interest Acquisitions.\n \nCompensation Committee Report\nThe Compensation Committee has reviewed and discussed the Compensation Discussion and Analysis section of this Item 11 with management and, based on such review and discussion, recommended that it be included in this Annual Report on Form 10-K.\nRespectfully submitted,\nThe Compensation Committee of the Board of Directors\nBarbara J. Duganier, Chair\nDonald G. Cook\nKarl F. Kurz\nRobert M. Roosa\n63\nTable of \nContents\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\n \nOur Common Stock is listed on the NYSE under the symbol “TPL.”\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following table sets forth certain information, as of December 31, 2024, regarding the shares of our Common Stock authorized for issuance under our equity compensation plans. \nPlan\nNumber of shares of Common Stock issuable upon exercise of outstanding options, warrants or rights\nWeighted average of exercise price of outstanding\nNumber of shares of Common Stock remaining available for future issuance\nTexas Pacific Land Corporation 2021 Incentive Plan approved by stockholders\n (1)\n44,290 \n— \n136,238 \nTexas Pacific Land Corporation 2021 Director Stock and Deferred Compensation Plan approved by stockholders\n— \n— \n24,219 \nEquity compensation plans not approved by stockholders\n— \n— \n— \n(1)    \nIncludes unvested RSUs and PSUs (based on target units). The amount reported in “Weighted-average exercise price of outstanding options, warrants and rights” does not take into account RSUs and PSUs because they have no exercise price.\n2021 Incentive Plan \nWe maintain the 2021 Plan, pursuant to which we may grant to any employee of the Company, an affiliate or a subsidiary nonqualified stock options, incentive stock options, stock appreciation rights, restricted stock, restricted stock units, performance shares, performance units, cash-based awards and other stock-based awards.  The 2021 Plan was approved by our Board on August 11, 2021 and by our stockholders on December 29, 2021, and amended on October 31, 2023, and will expire on December 29, 2031.  The maximum aggregate number of shares of Common Stock that may be issued under the 2021 Plan is 225,000 shares, which may consist, in whole or in part, of authorized and unissued shares (if any), treasury shares, or shares reacquired by the Company in any manner.\nUnless otherwise provided in an award agreement, a severance plan sponsored by the Company, or in an applicable employment agreement, or otherwise determined by the Compensation Committee, upon a change in control of the Company (as defined in the 2021 Plan) the following shall occur:\n•\nFor awards other than performance awards, a replacement award (that is, an award with a value and terms that are at least as favorable as the outstanding award that is being replaced by the replacement award) may be issued;\n•\nFor awards other than performance awards, if a replacement award is not issued and the Company’s Common Stock ceases to be publicly traded after the change in control, such awards shall be immediately vested and exercisable upon such change in control;\n•\nFor unearned performance awards, the award shall be (i) earned on a pro-rata basis at the higher of actual or target performance and (ii) measured as of the end of the calendar quarter before the change in control date or, if the award is stock-price based, as of the effective date of the change in control;\n•\nFor earned but unvested performance awards, the earned award shall be immediately vested and payable as of the change in control; and\n•\nFor awards other than performance awards, if the Company’s Common Stock continues to be publicly traded after change in control, such awards shall continue under their applicable terms, unless otherwise determined by the Compensation Committee.\nNotwithstanding the forgoing, in the case of awards other than performance awards, the Compensation Committee may cancel such awards, and the award holders shall receive shares or cash equal to the difference between the amount stockholders receive for their shares and the purchase price per share, if any, under the award.  Except as may be provided in an employment or severance compensation agreement between the Company and the participant, if, in connection with a change in control, a participant’s payment of any awards will cause the participant to be liable for federal excise tax levied on certain “excess parachute payments,” then either (i) all payments otherwise due or (ii) the reduced payment amount to avoid an excess \n64\nTable of \nContents\nparachute payment, whichever will provide the participant with the greater after-tax economic benefit taking into account any applicable excise tax, shall be paid to the participant. In no event will any participant be entitled to receive any kind of gross-up payment or reimbursement for any excise taxes payable in connection with change in control payments.\n2021 Non-Employee Director Stock and Deferred Compensation Plan \nWe maintain the Texas Pacific Land Corporation 2021 Non-Employee Director and Deferred Compensation Plan (the “2021 Director Plan”), pursuant to which we may grant shares of Common Stock to each of our non-employee directors and our non-employee directors may defer some or all of their directors’ cash fees and stock compensation.  The 2021 Director Plan was approved by our Board on August 11, 2021 and by our stockholders on December 29, 2021, and amended on October 31, 2023, and will expire on December 29, 2031.  The 2021 Director Plan provides for annual grants of shares of Common Stock to each of our non-employee directors.  Shares granted are fully vested upon date of grant unless the Compensation Committee or Board determines otherwise.\nThe maximum aggregate number of shares of Common Stock that may be issued under the 2021 Director Plan is 30,000 shares, and the aggregate fair market value of shares that may be issued to a non-employee director in a calendar year is limited to $500,000.  Shares granted under the 2021 Director Plan may consist, in whole or in part, of authorized and unissued shares (if any), treasury shares, or shares reacquired by the Company in any manner. \nSecurity Ownership of Certain Beneficial Owners\nWe have determined beneficial ownership in accordance with the rules of the SEC.  Under such rules, an individual or entity is generally deemed to beneficially own any shares as to which the individual or entity has sole or shared voting or investment power, including any shares that the individual or entity has the right to acquire within 60 days of February 12, 2025 through the exercise of any stock options, through the vesting/settlement of RSUs, or upon the exercise of other rights.  Shares underlying PSUs will not be deemed beneficially owned by a person even if the PSU may vest within 60 days of February 12, 2025 because the satisfaction of the applicable performance conditions is outside of the person’s control.  For purposes of computing the percentage of outstanding shares of Common Stock held by each person or group of persons named below, any Common Stock that such person or persons has the right to acquire within 60 days of February 12, 2025 is deemed to be outstanding but is not deemed to be outstanding for the purpose of computing the percentage ownership of any other person.\nExcept as indicated in the footnotes below, we believe, based on the information furnished or available to us, that the persons and entities named in the table below have sole voting and investment power with respect to all shares of Common Stock that they beneficially own, subject to community property laws where applicable.  There are no arrangements currently known to us, the operation of which may at a subsequent date result in a change of control of the Company.\nThe following table is based upon 22,984,798 shares of Common Stock outstanding as of February 12, 2025 and shows all holders known to the Company to be the beneficial owner of more than 5% of the outstanding shares of Common Stock as of February 12, 2025:\nName and Address\nNumber of Securities\nBeneficially Owned\nPercent of Class\nHorizon Kinetics Asset Management LLC \n(1)\n470 Park Avenue South, 8th Floor South,\nNew York, New York 10016\n3,578,173\n15.6%\nThe Vanguard Group \n(2)\n100 Vanguard Blvd.\nMalvern, Pennsylvania 19355\n2,454,117\n10.7%\nBlackRock, Inc. \n(3)\n50 Hudson Yards\nNew York, New York 10001\n1,815,331\n7.9%\nState Street Corporation\n (4)\nOne Congress Street, Suite 1,\nBoston, Massachusetts 02114\n1,185,230\n5.2%\n(1)\nThe information set forth is based on Amendment No. 8 to Schedule 13D (the “Schedule 13D”) filed on December 18, 2024 by Horizon Kinetics Asset Management LLC (“Horizon”), a wholly owned subsidiary of Horizon Kinetics Holding Corporation, which indicates that Horizon has sole voting and sole dispositive power with respect to all shares beneficially owned.  Horizon Kinetics Holding Corporation, through its registered investment adviser, Horizon, acts as a discretionary investment manager on behalf of its clients, who maintain beneficial interest in TPL.  Murray Stahl, Chief Executive Officer, Chairman of the Board and Chief Investment Officer of Horizon Kinetics Holding Corporation, is a director of TPL.  The number of shares beneficially owned excludes shares held by portfolio managers and other employees of Horizon personally. \n65\nTable of \nContents\n(2)\nThe information reported is based on Amendment No. 3 to Schedule 13G filed on December 6, 2024 by The Vanguard Group. The Vanguard Group reported sole dispositive power with respect to 2,370,928 shares, shared voting power with respect to 24,770 shares, and shared dispositive power with respect to 83,189 shares.\n(3)\nThe information reported is based on Amendment No. 2 to Schedule 13G filed on February 5, 2025 by BlackRock, Inc. BlackRock, Inc. reported sole voting power with respect to 1,691,275 shares and sole dispositive power with respect to 1,815,331 shares.\n(4)\nThe information reported is based on Schedule 13G filed on February 5, 2025 by State Street Corporation. State Street Corporation reported shared voting power with respect to 858,356 shares and shared dispositive power with respect to 1,185,230 shares.\nStock Ownership Information for Directors and Officers\nThe following table is based upon 22,984,798 shares of Common Stock outstanding as of February 12, 2025 and shows the number of shares of Common Stock beneficially owned directly or indirectly as of February 12, 2025 (i) our current directors, (ii) our Named Executive Officers and (iii) all of our directors and executive officers as a group. Unless otherwise indicated, the address for each director and Named Executive Officer is: c/o Texas Pacific Land Corporation, 1700 Pacific Avenue, Suite 2900, Dallas, Texas 75201.\nName of Beneficial Owner\nNumber of Securities Beneficially Owned\nPercent\nof Class\nDirectors and Named Executive Officers:\nRhys J. Best\n915 \n*\nDonald G. Cook\n844 \n*\nBarbara J. Duganier\n789 \n*\nDonna E. Epps\n789 \n*\nKarl F. Kurz\n690 \n*\nEric L. Oliver\n402,189 \n(1)\n1.8%\nRobert Roosa\n1,305 \n(2)\n*\nMurray Stahl\n163,384 \n(3)\n*\nMarguerite Woung-Chapman\n405 \n*\nTyler Glover\n11,208 \n(4)\n*\nChris Steddum\n4,564 \n(5)\n*\nMicheal W. Dobbs\n2,721 \n(6)\n*\nAll Directors and Executive Officers as a Group (12 persons)\n589,803 \n \n2.6%\n*\nIndicates ownership of less than 1% of the class.\n(1)\nIncludes (i) 1,089 shares held by Eric L. Oliver, (ii) 393,300 shares held by SoftVest, L.P., a Delaware limited partnership (“SoftVest LP”), (iii) 1,050 shares held by trusts administered for the benefit of Mr. Oliver's grandchildren (the “Trust Shares”), and (iv) 6,750 shares owned by Debeck LLC and Debeck Properties LP (together, “Debeck”).  The general partner of SoftVest LP is SoftVest GP I, LLC, a Delaware limited liability company (“SV GP”). SoftVest Advisors, LLC, a Delaware limited liability company (“SoftVest Advisors”) is investment manager of SoftVest LP.  Mr. Oliver is the managing member of SV GP. SoftVest LP, SoftVest Advisors and Mr. Oliver may be deemed to share voting and dispositive power with respect to shares beneficially owned by them.  Mr. Oliver disclaims beneficial ownership of the 393,300 shares of Common Stock held by SoftVest LP for purposes of Section 16 of the Exchange Act, except for his pecuniary interest therein.  Mr. Oliver has sole voting and dispositive power with respect to the Trust Shares and disclaims any pecuniary interest in such shares.  Mr. Oliver controls Debeck and has sole voting and dispositive power with respect to the shares beneficially owned by Debeck, but Mr. Oliver disclaims any pecuniary interest therein.\n(2)\nIncludes (i) 405 shares held by Robert Roosa, (ii) 450 shares held by RSR Resources & Minerals Unvested, LLC, of which Mr. Roosa is the manager, and (iii) 450 shares held by RSR Resources & Minerals Vested, LLC, of which Mr. Roosa is the manager.\n(3)\nIncludes (i) 7,980 shares held by Murray Stahl and (ii) 155,404 shares held indirectly by Mr. Stahl as of December 31, 2024. The shares referenced in (ii) above are managed by Horizon Kinetics Holding Corporation through its registered investment adviser, Horizon. Mr. Stahl, Chief Executive Officer, Chairman of the Board and Chief Investment Officer of Horizon Kinetics Holding Corporation, is a director of TPL, but does not participate in Horizon’s investment decisions with respect to the securities of TPL. Horizon separately reports its position and transactions in the securities of TPL on Forms 4 and Schedule 13D. Mr. Stahl disclaims beneficial ownership in any of the accounts managed by Horizon except to the extent of his pecuniary interest therein.\n(4)\nIncludes 1,266 shares underlying RSUs that will vest within 60 days of February 12, 2025.\n(5)\nIncludes 690 shares underlying RSUs that will vest within 60 days of February 12, 2025.\n(6)\nIncludes 402 shares underlying RSUs that will vest within 60 days of February 12, 2025.\n66\nTable of \nContents\nItem 13.\n \nCertain Relationships and Related Transactions, and Director Independence.\n \nProcedures for Approval of Related Person Transactions\nTPL generally does not engage in transactions in which TPL’s executive officers or directors (or any of their immediate family members) or any of TPL’s stockholders owning 5% or more of TPL’s outstanding shares of Common Stock (or any of their immediate family members) have a material interest.  Should a proposed transaction or series of similar transactions involve any such persons in an amount that exceeds $120,000 in any fiscal year, it will be subject to review and approval by the Audit Committee in accordance with its written policy and procedures adopted by the Board.  Transactions entered into that were not related person transactions at the time that they were consummated, but that later become related person transactions during the course of the transaction, will also be subject to review by the Audit Committee in accordance with a written policy adopted by the Board. \nTransactions with Related Persons\nAs discussed elsewhere in this Annual Report on Form 10-K, on August 27, 2024, the Company announced the Mineral Asset Acquisitions. The Mineral Interest Acquisitions were completed in conjunction with Brigham Royalties Fund I Holdco, L.L.C., a subsidiary of Brigham Royalties. Robert Roosa, a member of the Board, is a partner in, and serves as the Chief Executive Officer of, Brigham Royalties. Brigham Royalties originally identified the opportunity and, because of the size and concentration, invited the Company to participate. Following the execution of the purchase and sale agreements (totaling 7,416 net royalty acres) related to the Mineral Interest Acquisitions, a 55.4% interest in each was assigned to a subsidiary of the Company.\nEach party paid a pro-rata share of the purchase price and closing costs. The Company directly paid an aggregate of approximately $1.1 million in commissions to six Brigham Royalties employees, which was equal to the bonuses those employees would have received with respect to the Mineral Interest Acquisitions had they been completed by Brigham Royalties. Those fees were significantly less than commissions the Company would have paid to other third parties for similar services. The Company performed its own diligence and valuation, and the Mineral Interest Acquisitions were approved by the Audit Committee and full Board with Mr. Roosa abstaining. The Company did not pay any fees or commissions to Brigham Royalties or Mr. Roosa in connection with, and the Company and Brigham Royalties have no further relationship with respect to, the Mineral Interest Acquisitions. Other than as discussed above, there have been no transactions between the Company and a related person that would be reportable under SEC rules or regulations.\n \nIndependence \n \nThe Board has affirmatively determined that all of the directors, other than Mr. Glover, who is employed by TPL, are independent under the rules of the SEC and the NYSE.  \nNo director may be deemed independent unless the Board determines that he or she has no material relationship with TPL, directly or as an officer, stockholder or partner of an organization that has a material relationship with TPL. \n \nItem 14. Principal Accountant Fees and Services.\n \nThe following table presents fees billed to TPL for professional services rendered by our independent registered public accounting firm, Deloitte & Touche LLP (“Deloitte”), for the years ended December 31, 2024 and 2023: \nYears Ended December 31,\n2024\n2023\nType of Fees:\nAudit fees\n$\n975,132 \n$\n694,480 \nAudit-related fees\n— \n— \nTax fees\n— \n— \nAll other fees\n (1)\n2,051 \n2,051 \n$\n977,183 \n$\n696,531 \n(1)\nRepresents fees associated with Deloitte sponsored accounting research tools.\n67\nTable of \nContents\nFor the year ended December 31, 2024, the Audit Committee approved all of the services provided by, and fees paid to, Deloitte. \nThe Audit Committee has established a policy requiring Audit Committee approval of all fees for audit and non-audit services to be provided by TPL’s independent registered public accountants, prior to commencement of such services.  Consideration and approval of fees generally occurs at the Committee’s regularly scheduled meetings or, to the extent that such fees may relate to other matters to be considered at special meetings, at those special meetings.\n68\nTable of Contents\nPART IV\nItem 15.  Exhibits and Financial Statement Schedules.\n \nFinancial Statements\n \nSee “Index to Financial Statements.”\n \nExhibits\nEXHIBIT INDEX\nExhibit\nNumber\n \nExhibit Description\n \n \n \n3.1*\nSecond Amended and Restated Certificate of Incorporation, as amended through November 12, 2024.\n3.2\nThird\n \nA\nmended and Restated Bylaws of Texas Pacific Land Corporation (incorporated by reference to Exhibit 3.2 to our Form 8-K filed on \nNovember 12, 2024\n (File No. 001-39804)).\n4.1*\nDescription of Securities of Texas Pacific Land Corporation.\n10.1†\nForm of Indemnification Agreement by and between Texas Pacific Land Corporation and individual directors or officers (incorporated by reference to Exhibit 10.2 to our Form 8-K filed on January 11, 2021 (File No. 001-39804)).\n10.2†\nAmended and Restated Employment Agreement between Texas Pacific Land Corporation and Tyler Glover, dated October 13, 2023 (incorporated by reference to Exhibit 10.1 to our Current Report on Form 8-K filed on October 13, 2023 (File No. 1-39804)).\n10.3†\nAmended and Restated Employment Agreement between Texas Pacific Land Corporation and Chris Steddum, dated October 13, 2023 (incorporated by reference to Exhibit 10.2 to our Current Report on Form 8-K filed on October 13, 2023 (File No. 1-39804)).\n10.4†\nAmended and Restated Employment Agreement between Texas Pacific Land Corporation and Micheal W. Dobbs, dated October 13, 2023 (incorporated by reference to Exhibit 10.3 to our Current Report on Form 8-K filed on October 13, 2023 (File No. 1-39804)).\n10.6†\n2021 Incentive Plan (incorporated by reference to Exhibit 10.1 to our Registration Statement on Form S-8 filed on December 29, 2021 (File No. 333-261938)).\n10.6.1†\nAmendment No. 1 to 2021 Incentive Plan dated October 31, 2023 (incorporated by reference to Exhibit 10.1 to our Quarterly Report on Form 10-Q filed on November 1, 2023 (File No. 1-39804)).\n10.6.2†\nForm of Restricted Stock Award Agreement (Employees) (incorporated by reference to Exhibit 10.2 to\n our\n Registration Statement on Form S-8 filed on December 29, 2021 (File No. 333-261938)).\n10.6.3†\nForm of Restricted Stock Unit Award Agreement (2021 Grants) (incorporated by reference to Exhibit 10.4 to \nour\n Registration Statement on Form S-8 filed on February 14, 2022 (File No. 001-39804)).\n10.6.4†\nForm of RTSR Performance Unit Award Agreement (2021 Grants) (incorporated by reference to Exhibit 10.5 to \nour\n Registration Statement on Form S-8 filed on February 14, 2022 (File No. 001-39804)).\n10.6.5†\nForm of FCF/Share Performance Unit Award Agreement (2021 Grants) (incorporated by reference to Exhibit 10.6 to \nour \nRegistration Statement on Form S-8 filed on February 14, 2022 (File No. 001-39804)).\n10.6.6†\nForm of Restricted Stock Unit Award Agreement (incorporated by reference to Exhibit 10.1 to \nour\n Current Report on Form 8-K filed on February 13, 2023 (File No. 001-39804)).\n10.6.7†\nForm of RTSR Performance Unit Award Agreement (incorporated by reference to Exhibit 10.2 to \nour\n Current Report on Form 8-K filed on February 13, 2023 (File No. 001-39804)).\n10.6.8†\nForm of FCF/Share Performance Unit Award Agreement (incorporated by reference to Exhibit 10.3 to \nour\n Current Report on Form 8-K filed on February 13, 2023 (File No. 001-39804)).\n10.6.9†\nForm of Restricted Stock Unit Award Agreement (incorporated by reference to Exhibit 10.2 to our Quarterly Report on Form 10-Q filed on November 1, 2023 (File No. 1-39804)).\n10.6.10†\nForm of RTSR Performance Unit Award Agreement (incorporated by reference to Exhibit 10.3 to our Quarterly Report on Form 10-Q filed on November 1, 2023 (File No. 1-39804)).\n10.6.11†\nForm of FCF/Share Performance Unit Award Agreement (incorporated by reference to Exhibit 10.4 to our Quarterly Report on Form 10-Q filed on November 1, 2023 (File No. 1-39804)).\n10.6.12†\nForm of FCF/Share Performance Unit Award Agreement \n(2024) \n(\nincorporated by reference to Exhibit 10.6 to our \nAnnual R\neport on Form 10-K filed on February 21, \n2024\n \n(File N\no. 1-39804)\n)\n.\n10.7†\n2021 Non-Employee Director Stock and Deferred Compensation Plan (incorporated by reference to Exhibit 10.3 to our Registration Statement on Form S-8 filed on December 29, 2021 (File No. 333-261938)).\n69\nTable of Contents\n10.7.1†\nAmendment No. 1 to 2021 Non-Employee Director Stock and Deferred Compensation Plan dated October 31, 2023 (incorporated by reference to Exhibit 10.1 to our Quarterly Report on Form 10-Q filed on November 1, 2023 (File No. 1-39804)).\n10.7.2†\nForm of Restricted Stock Award Agreement (Directors) (incorporated by reference to Exhibit 10.4 to our Registration Statement on Form S-8 filed on December 29, 2021 (File No. 333-261938)).\n10.8\nCooperation Agreement, dated as of July 28, 2023 (incorporated by reference to Exhibit 10.1 to our Current Report on Form 8-K filed on August 1, 2023 (File No. 001-39804)).\n19.1*\nInsider Trading Policy\n21.1*\n \nList of Subsidiaries.\n23.1*\nConsent of Deloitte & Touche LLP.\n23.2*\nConsent of Ryder Scott Company L.P.\n31.1*\n \nCertification of Chief Executive Officer pursuant to Rule 13a-14(a) under the Exchange Act.\n31.2*\n \nCertification of Chief Financial Officer pursuant to Rule 13a-14(a) under the Exchange Act.\n32.1**\n \nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2**\n \nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97.1\nClawback Polic\ny (incorporated by reference to Exhibit 97.1 to our Annual Report on Form 10-K filed on February 21, 2024 (File No. 1-398034)).\n99.1*\nReport of Ryder Scott Company, L.P. as of December 31, 2024\n101*\n \nThe following information from our Annual Report on Form 10-K for the year ended December 31, 2024, formatted in iXBRL (Inline eXtensible Business Reporting Language): (i) Consolidated Balance Sheets; (ii) Consolidated Statements of Income and Total Comprehensive Income; (iii) Consolidated Statements of Equity and (iv) Consolidated Statements of Cash Flows.\n104\nThe cover page from our Annual Report on Form 10-K formatted in iXBRL.\n  \n*\nFiled herewith.\n**  The certifications attached as Exhibits 32.1 and 32.2 are not deemed “filed” with the SEC and are not to be incorporated by reference into any filing of Texas Pacific Land Corporation under the Securities Act or the Exchange Act, whether made before or after the date of this Annual Report on Form 10-K, irrespective of any general incorporation language contained in such filing.\n†     Management compensatory arrangement.\nItem 16.\n \nForm 10-K Summary.\n \nNot applicable. \n70\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on the 19th day of February, 2025.\n \n \n \nTEXAS PACIFIC LAND CORPORATION\n \n \n \n \n \nBy:\n/s/ Tyler Glover\n \n \n \nTyler Glover\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on the 19th day of February, 2025.\n \n \nSignature\n \nTitle(s)\n \n \n \n \n \n/s/ Tyler Glover\n \nPresident, Chief Executive Officer and Director\n \nTyler Glover\n \n (Principal Executive Officer)\n \n \n \n \n \n/s/ Chris Steddum\n \nChief Financial Officer\n \nChris Steddum\n \n(Principal Financial Officer)\n/s/ Stephanie Buffington\nChief Accounting Officer\nStephanie Buffington\n(Principal Accounting Officer)\n \n \n \n/s/ Rhys J. Best\nChair of Board and Director\nRhys J. Best\n \n/s/ Donald G. Cook\n \nDirector\n \nDonald G. Cook\n \n \n \n \n \n \n \n/s/ Barbara J. Duganier\n \nDirector\n \nBarbara J. Duganier\n \n \n/s/ Donna E. Epps\nDirector\nDonna E. Epps\n/s/ Karl F. Kurz\nDirector\nKarl F. Kurz\n/s/ Eric L. Oliver\nDirector\nEric L. Oliver\n/s/ Robert Roosa\nDirector\nRobert Roosa\n/s/ Murray Stahl\nDirector\nMurray Stahl\n/s/ Marguerite Woung-Chapman\nDirector\nMarguerite Woung-Chapman\n71\nTable of Contents\nItem 15(a). Financial Statements.\n \nINDEX TO FINANCIAL STATEMENTS\n \n \n \nConsolidated Financial Statements\nPage\n \n \nReport of Independent Registered Public Accounting Firm\n (PCAOB ID No. \n34\n)\nF-\n2\nConsolidated Balance Sheets – \nDecember 31, 2024\n and \n2023\nF-\n4\n \n \nConsolidated Statements of Income and Total Comprehensive Income – Years Ended \nDecember 31, 2024\n, \n2023\n and \n2022\nF-\n5\n \n \nConsolidated Statements of Equity – Years Ended \nDecember 31, 2024\n, \n2023\n and \n2022\nF-\n6\n \n \nConsolidated Statements of Cash Flows – Years Ended \nDecember 31, 2024\n, \n2023\n and \n2022\nF-\n7\n \n \nNotes to Consolidated Financial Statements\nF-\n8\n \nAll schedules have been omitted because the required information is contained in the consolidated financial statements or related notes, or is not applicable or immaterial.\nF-1\nTable of Contents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of Texas Pacific Land Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Texas Pacific Land Corporation (the “Company”) as of December 31, 2024 and 2023, the related consolidated statements of income and total comprehensive income, equity, and cash flows for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2023, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 19, 2025, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAccrual of Oil and Gas Royalties — Refer to Note 2 to the financial statements\nCritical Audit Matter Description\nThe Company records an accrual for oil and gas royalty revenues in accounts receivable and accrued receivables, net in the accompanying consolidated balance sheet. The accrual is necessary due to the time lag between the production of oil and gas and generation of the actual payment by operators, which is typically one to two months after the production of oil and gas. The determination of the oil and gas royalty accrual involves an analysis of historical production volumes, estimates of the timing of future payments, and recent market prices for oil and gas. The realized transaction prices for oil and gas royalty revenues are subject to national and international economic and political considerations and locational and contractual basis differences. \nGiven the significant judgment in determining future estimated payments based on estimated production volumes, payment timing, and realized prices for oil and gas products made by the Company, performing audit procedures to evaluate the Company’s estimate of accrued oil and gas royalties required a high degree of auditor judgment in evaluating audit evidence and an increased extent of effort.\nF-2\nTable of Contents\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Company’s accrual of oil and gas royalties included the following, among others:\n•\nWe tested the operating effectiveness of internal controls related the Company’s estimate of the accrual of revenues from oil and gas royalties\n•\nWe evaluated the method used by management to develop the estimate considering historical production, payments, and timing of payments\n•\nWe evaluated the Company’s estimation process by performing a retrospective review of variances between accrued revenue estimates and subsequent receipts of payments of oil and gas royalties  \n•\nWe tested the completeness and accuracy of historical production and payment data used in the estimating payments not yet received for production during the current period, and assessed the relevance of historical data to the current period estimate\n•\nWe assessed the estimate of realized prices for oil and gas royalties used in the accrual of oil and gas royalties based on market pricing data and historical price differentials\n/s/ \nDeloitte & Touche LLP\nDallas, Texas\nFebruary 19, 2025\nWe have served as the Company's auditor since 2021.\nF-3\nTable of Contents\nItem 1.\nFinancial Statements\nTEXAS PACIFIC LAND CORPORATION\nCONSOLIDATED\n \nBALANCE SHEETS\n(in thousands, except shares and per share amounts)\n \nDecember 31,\n2024\nDecember 31,\n2023\nASSETS\n \n \nCash and cash equivalents\n$\n369,835\n \n$\n725,169\n \nAccounts receivable and accrued receivables, net\n126,670\n \n128,971\n \nPrepaid expenses and other current assets\n5,318\n \n2,944\n \nTax like-kind exchange escrow\n1,546\n \n5,380\n \nTotal current assets\n503,369\n \n862,464\n \nRoyalty interests acquired, net \n432,401\n \n46,609\n \nReal estate acquired\n143,178\n \n130,024\n \nProperty, plant and equipment, net\n122,578\n \n89,587\n \nIntangible assets, net\n35,188\n \n21,025\n \nReal estate and royalty interests assigned through the Declaration of Trust, no value assigned:\n \n \nLand (surface rights) \n—\n \n—\n \n1/16th and 1/128th nonparticipating perpetual royalty interests\n—\n \n—\n \nOperating lease right-of-use assets\n1,163\n \n1,861\n \nOther assets\n10,143\n \n4,828\n \nTotal assets\n$\n1,248,020\n \n$\n1,156,398\n \nLIABILITIES AND EQUITY\n \n \nAccounts payable and accrued expenses\n$\n26,958\n \n$\n22,501\n \nAd valorem and other taxes payable\n8,418\n \n10,761\n \nIncome taxes payable\n4,388\n \n4,795\n \nUnearned revenue\n6,797\n \n6,330\n \nTotal current liabilities\n46,561\n \n44,387\n \nDeferred taxes payable\n47,401\n \n42,365\n \nUnearned revenue - noncurrent\n20,636\n \n25,006\n \nOperating lease liabilities\n453\n \n1,170\n \nAccrued liabilities - noncurrent\n504\n \n274\n \nTotal liabilities\n115,555\n \n113,202\n \nCommitments and contingencies (Note 13)\n—\n \n—\n \nEquity:\n \n \nPreferred stock, $\n0.01\n par value; \n1,000,000\n shares authorized, \nnone\n outstanding as of December 31, 2024 and 2023\n—\n \n—\n \nCommon stock, $\n0.01\n par value; \n46,536,936\n shares authorized as of December 31, 2024 and 2023, \n22,971,803\n and \n23,007,681\n outstanding as of December 31, 2024 and 2023, respectively\n231\n \n78\n \nTreasury stock, at cost; \n114,273\n and \n86,929\n shares as of December 31, 2024 and 2023, respectively\n(\n168,843\n)\n(\n144,998\n)\nAdditional paid-in capital\n19,900\n \n14,613\n \nAccumulated other comprehensive income\n3,583\n \n1,831\n \nRetained earnings\n1,277,594\n \n1,171,672\n \nTotal equity\n1,132,465\n \n1,043,196\n \nTotal liabilities and equity\n$\n1,248,020\n \n$\n1,156,398\n \nSee accompanying notes to consolidated financial statements.\nF-4\nTable of Contents\nTEXAS PACIFIC LAND CORPORATION\nCONSOLIDATED\n \nSTATEMENTS OF INCOME AND TOTAL COMPREHENSIVE INCOME\n(in thousands, except shares and per share amounts)\n \n \nYears Ended December 31,\n \n2024\n2023\n2022\nRevenues:\n \n \nOil and gas royalties\n$\n373,331\n \n$\n357,394\n \n$\n452,434\n \nWater sales\n150,724\n \n112,203\n \n84,725\n \nProduced water royalties\n104,123\n \n84,260\n \n72,234\n \nEasements and other surface-related income\n73,257\n \n70,932\n \n48,348\n \nLand sales\n4,388\n \n6,806\n \n9,681\n \nTotal revenues\n705,823\n \n631,595\n \n667,422\n \nExpenses:\n \n \nSalaries and related employee expenses\n53,621\n \n43,384\n \n41,402\n \nWater service-related expenses\n46,124\n \n33,566\n \n17,463\n \nGeneral and administrative expenses\n34,483\n \n46,450\n \n22,020\n \nDepreciation, depletion and amortization\n25,162\n \n14,757\n \n15,376\n \nAd valorem and other taxes\n7,295\n \n7,385\n \n8,854\n \nTotal operating expenses\n166,685\n \n145,542\n \n105,115\n \nOperating income\n539,138\n \n486,053\n \n562,307\n \nOther income, net\n39,683\n \n31,508\n \n6,548\n \nIncome before income taxes\n578,821\n \n517,561\n \n568,855\n \nIncome tax expense:\n \n \nCurrent\n120,257\n \n110,517\n \n121,230\n \nDeferred\n4,604\n \n1,399\n \n1,263\n \nTotal income tax expense \n124,861\n \n111,916\n \n122,493\n \nNet income\n$\n453,960\n \n$\n405,645\n \n$\n446,362\n \nAmortization of net actuarial costs, net of income taxes of $(\n182\n), $(\n27\n), and $\n9\n for the years ended December 31, 2024, 2023 and 2022, respectively\n(\n684\n)\n(\n103\n)\n32\n \nNet actuarial (loss) gain on pension plan, net of income taxes of $\n483\n, $(\n157\n), and $\n931\n as of December 31, 2024, 2023 and 2022, respectively\n2,436\n \n(\n582\n)\n3,491\n \nTotal other comprehensive income (loss)\n1,752\n \n(\n685\n)\n3,523\n \nTotal comprehensive income\n$\n455,712\n \n$\n404,960\n \n$\n449,885\n \nNet income per share of common stock\nBasic\n$\n19.75\n \n$\n17.60\n \n$\n19.27\n \nDiluted\n$\n19.72\n \n$\n17.59\n \n$\n19.26\n \nWeighted average number of shares of common stock outstanding\nBasic\n22,986,197\n \n23,044,305\n \n23,165,871\n \nDiluted\n23,019,751\n \n23,059,845\n \n23,180,427\n \nSee accompanying notes to consolidated financial statements.\nF-5\nTable of Contents\nTEXAS PACIFIC LAND CORPORATION\nCONSOLIDATED\n \nSTATEMENTS OF EQUITY\n (in thousands, except shares and per share amounts)\nCommon Stock\nTreasury Stock\nAdditional Paid-in Capital\nAccum.\nOther\nComp.\nInc/(Loss)\nRetained Earnings\nTotal\nEquity\nShares\nAmount\nBalances as of January 1, 2022\n23,234,085\n \n$\n78\n \n$\n(\n15,417\n)\n$\n28\n \n$\n(\n1,007\n)\n$\n668,029\n \n$\n651,711\n \nNet income\n— \n— \n— \n— \n— \n446,362\n \n446,362\n \nRepurchases of common stock\n(\n146,877\n)\n— \n(\n87,900\n)\n— \n— \n— \n(\n87,900\n)\nRegular dividends paid and accrued — $\n4.00\n per share of common stock\n— \n— \n— \n— \n— \n(\n92,737\n)\n(\n92,737\n)\nSpecial dividends paid and accrued — $\n6.67\n per share of common stock\n— \n— \n— \n— \n— \n(\n154,742\n)\n(\n154,742\n)\nShare-based compensation, net of forfeitures\n2,097\n \n— \n940\n \n8,265\n \n— \n(\n773\n)\n8,432\n \nShares exchanged for tax withholdings\n(\n2,268\n)\n— \n(\n1,762\n)\n— \n— \n— \n(\n1,762\n)\nPeriodic pension costs, net of income taxes of $\n940\n— \n— \n— \n— \n3,523\n \n— \n3,523\n \nBalances as of December 31, 2022\n23,087,037\n \n78\n \n(\n104,139\n)\n8,293\n \n2,516\n \n866,139\n \n772,887\n \nNet income\n— \n— \n— \n— \n— \n405,645\n \n405,645\n \nRepurchases of common stock and related excise taxes\n(\n82,857\n)\n— \n(\n42,801\n)\n— \n— \n— \n(\n42,801\n)\nRegular dividends paid and accrued — $\n4.33\n per share of common stock\n— \n— \n— \n— \n— \n(\n99,972\n)\n(\n99,972\n)\nShare-based compensation, net of forfeitures\n6,996\n \n— \n4,006\n \n6,320\n \n— \n(\n140\n)\n10,186\n \nShares exchanged for tax withholdings\n(\n3,495\n)\n— \n(\n2,064\n)\n— \n— \n— \n(\n2,064\n)\nPeriodic pension costs, net of income taxes of $\n184\n— \n— \n— \n— \n(\n685\n)\n— \n(\n685\n)\nBalances as of December 31, 2023\n23,007,681\n \n78\n \n(\n144,998\n)\n14,613\n \n1,831\n \n1,171,672\n \n1,043,196\n \nNet income\n— \n— \n— \n— \n— \n453,960\n \n453,960\n \nIssuance of common stock related to stock split\n— \n153\n \n— \n(\n153\n)\n— \n— \n—\n \nRepurchases of common stock and related excise taxes\n(\n42,902\n)\n— \n(\n29,350\n)\n— \n— \n— \n(\n29,350\n)\nRegular dividends paid and accrued — $\n5.11\n per share of common stock\n— \n— \n— \n— \n— \n(\n117,474\n)\n(\n117,474\n)\nSpecial dividends paid and accrued — $\n10.00\n per share of common stock\n— \n— \n— \n— \n— \n(\n229,834\n)\n(\n229,834\n)\nShare-based compensation, net of forfeitures\n9,972\n \n— \n7,128\n \n5,440\n \n— \n(\n730\n)\n11,838\n \nShares exchanged for tax withholdings\n(\n2,948\n)\n— \n(\n1,623\n)\n— \n— \n— \n(\n1,623\n)\nPeriodic pension costs, net of income taxes of $\n301\n— \n— \n— \n— \n1,752\n \n— \n1,752\n \nBalances as of December 31, 2024\n22,971,803\n \n$\n231\n \n$\n(\n168,843\n)\n$\n19,900\n \n$\n3,583\n \n$\n1,277,594\n \n$\n1,132,465\n \n \nSee accompanying notes to consolidated financial statements.\nF-6\nTable of Contents\nTEXAS PACIFIC LAND CORPORATION\nCONSOLIDATED\n \nSTATEMENTS OF CASH FLOWS\n (in thousands)\n \nYears Ended December 31,\n \n2024\n2023\n2022\nCash flows from operating activities:\n \n \n \nNet income\n$\n453,960\n \n$\n405,645\n \n$\n446,362\n \nAdjustments to reconcile net income to net cash provided by operating activities:\n \n \nDepreciation, depletion and amortization\n25,162\n \n14,757\n \n15,376\n \nShare-based compensation\n12,498\n \n10,343\n \n8,432\n \nPension curtailment/settlement gains\n(\n4,616\n)\n—\n \n—\n \nDeferred taxes\n4,604\n \n1,399\n \n1,263\n \nChanges in operating assets and liabilities:\n \n \n \nReceivables and other assets\n(\n610\n)\n(\n24,457\n)\n(\n13,833\n)\nPrepaid income taxes\n—\n \n4,809\n \n(\n4,809\n)\nIncome taxes payable\n(\n407\n)\n1,628\n \n(\n25,916\n)\nUnearned revenue\n(\n3,903\n)\n5,140\n \n1,938\n \nOperating liabilities, excluding income taxes\n6,327\n \n(\n3,240\n)\n10,015\n \nAd valorem and other taxes payable\n(\n2,343\n)\n2,264\n \n8,321\n \nCash provided by operating activities\n490,672\n \n418,288\n \n447,149\n \nCash flows from investing activities:\n \n \n \nAcquisition of royalty interests, net of post-closing adjustments\n(\n395,577\n)\n(\n3,566\n)\n(\n1,662\n)\nAcquisition of a business\n(\n45,000\n)\n—\n \n—\n \nAcquisition of intangible assets\n—\n \n(\n21,403\n)\n—\n \nAcquisition of real estate\n(\n1,476\n)\n(\n20,320\n)\n(\n633\n)\nPurchase of fixed assets\n(\n29,696\n)\n(\n15,028\n)\n(\n19,212\n)\nProceeds from sale of fixed assets\n—\n \n5\n \n106\n \nCash used in investing activities\n(\n471,749\n)\n(\n60,312\n)\n(\n21,401\n)\nCash flows from financing activities:\n \n \n \nDividends paid\n(\n347,309\n)\n(\n99,972\n)\n(\n247,281\n)\nRepurchases of common stock\n(\n29,159\n)\n(\n42,573\n)\n(\n87,765\n)\nShares exchanged for tax withholdings\n(\n1,623\n)\n(\n2,064\n)\n(\n1,762\n)\nCash used in financing activities\n(\n378,091\n)\n(\n144,609\n)\n(\n336,808\n)\nNet (decrease) increase in cash, cash equivalents and restricted cash\n(\n359,168\n)\n213,367\n \n88,940\n \nCash, cash equivalents and restricted cash, beginning of period\n730,549\n \n517,182\n \n428,242\n \nCash, cash equivalents and restricted cash, end of period\n$\n371,381\n \n$\n730,549\n \n$\n517,182\n \nSupplemental disclosure of cash flow information:\n \n \n \nIncome taxes paid\n$\n120,669\n \n$\n104,079\n \n$\n151,956\n \nSupplemental non-cash investing and financing information:\nNonmonetary exchange of assets\n$\n—\n \n$\n880\n \n$\n4,174\n \n(Decrease) increase in accounts payable related to capital expenditures\n$\n(\n273\n)\n$\n403\n \n$\n(\n245\n)\nAccrued dividends on unvested stock awards\n$\n730\n \n$\n158\n \n$\n198\n \nOperating lease right-of-use assets\n$\n—\n \n$\n—\n \n$\n1,364\n \nSee accompanying notes to consolidated financial statements.\nF-7\nTable of Contents\nTEXAS PACIFIC LAND CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.    \nOrganization and Description of Business\nOrganization\nTexas Pacific Land Corporation (which, together with its subsidiaries as the context requires, may be referred to as “TPL,” the “Company,” “our,” “we,” or “us”) is a Delaware corporation and one of the largest landowners in the State of Texas with approximately \n873,000\n surface acres of land, principally concentrated in the Permian Basin.  Additionally, we own a 1/128th nonparticipating perpetual oil and gas royalty interest (“NPRI”) under approximately \n85,000\n acres of land, a 1/16th NPRI under approximately \n371,000\n acres of land, and approximately \n16,000\n additional net royalty acres (normalized to 1/8th) (“NRA”) for a collective total of approximately \n207,000\n NRA, principally concentrated in the Permian Basin.\nOur revenues are derived from oil and gas royalties, water sales, produced water royalties, easements and other surface-related (“SLEM”) income and land sales.\nOn January 11, 2021, we completed our reorganization from a business trust, Texas Pacific Land Trust (the “Trust”), organized under a Declaration of Trust dated February 1, 1888 (the “Declaration of Trust”), into Texas Pacific Land Corporation, a corporation formed and existing under the laws of the State of Delaware (the “Corporate Reorganization”).\n2.    \nSummary of Significant Accounting Policies\nBasis of Presentation\n \nThe accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (“GAAP”) and include our consolidated accounts and the accounts of our wholly owned subsidiaries.  All intercompany accounts and transactions have been eliminated in consolidation.  Certain prior period amounts have been reclassified to conform with the current year presentation.\nSegment Reporting\nOperating segments are based on components of the Company that engage in business activity that earn revenues and incur expenses and (a) whose operating results are regularly reviewed by our chief operating decision maker (“CODM”) to make decisions about resource allocation and performance and (b) for which discrete financial information is available.  The measure of profit or loss that the CODM uses to assess performance and allocated resources to our reportable segments is Net Income.  Our chief executive officer is the CODM and uses Net Income to evaluate income generated by each segment in his determination of allocating resources to each segment.  As a result, the Company operates two operating segments which represent our reportable segments: Land and Resource Management and Water Services and Operations. The segments enable the alignment of strategies and objectives of TPL and provide a framework for timely and rational allocation of resources within businesses. See Note 15, “Business Segment Reporting” for further information regarding our segments.\nUse of Estimates in the Preparation of Financial Statements\n \nThe preparation of consolidated financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the amounts and disclosures reported in the financial statements and accompanying notes.  Actual results could differ from those estimates.  In the event estimates and/or assumptions prove to be different from actual amounts, adjustments are made in subsequent periods to reflect more current information.\nRevenue Recognition\nOil and\n \nGas\n \nRoyalties\n \nOil and gas royalties are received in connection with royalty interests owned by TPL.  Oil and gas royalties are reported net of production taxes and are recognized as revenue when crude oil and natural gas products are removed from the respective mineral reserve locations.  Oil and gas royalty payments are generally received one to two months after the crude oil and gas products are removed.  An accrual for amounts not received during the month crude oil and natural gas products are removed is included in accounts receivable and accrued receivables, net based on historical trends. \n \nF-8\nTable of Contents\nThe oil and gas royalties which we receive are dependent upon the market prices for oil and gas, and locational and contractual price differences.  The market prices for oil and gas are subject to national and international economic and political conditions and subject to significant price fluctuations.\nTPL has analyzed public reports of drilling activities by the oil companies operating where we have an oil and gas royalty interest in an effort to identify unpaid royalties associated with royalty interests we own.  Rights to certain oil and gas royalties we believe to be due and payable may be subject to dispute with the oil company involved as a result of disagreements with respect to drilling and related engineering information.  Disputed oil and gas royalties are recorded when these contingencies are resolved.\n \nWater\n \nSales\n \nWater sales revenue encompasses the sale and delivery of sourced, produced and treated water to operators and other customers, royalties received related to areas of mutual interest (“AMI”), and royalties received pursuant to legacy agreements with operators.  In certain instances, we enter into agreements with third parties to provide various water services, including but not limited to, the purchase, sale or transfer of water within a specific geographic area, also known as an AMI. Our performance obligation is deemed satisfied upon the delivery of water at which point, revenue is recognized.  In instances where a third party other than the customer is involved in the sale and/or transport of water, such as a revenue share agreement, brokered water sale transaction or third party acquisition of water, the Company will either be acting as the principal or the agent in the water sales transaction.  If the Company is deemed to be acting as a principal, the associated revenues are reported on a gross basis in water sales revenue and the corresponding costs associated with the sale are reported as an operating expense in water service-related expenses in the consolidated income statement.  If the Company is deemed to be acting as an agent, principally in brokered water transactions, the associated water sales revenue is reported net of the corresponding costs associated with the sale and included in the water sales revenue line item on the consolidated income statement.  \nPurchases of water from third parties, transfer costs and treatment expenses associated with water sales are included in water service-related expenses.  \nProduced Water Royalties\nProduced water royalties represent revenue from the transfer and disposal of saltwater from producing oil and gas wells on our land.  Revenue is recognized when the water is transported across or injected into our land.\nEasements and\n \nOther Surface-Related Income\n \nEasement contracts represent contracts which permit companies to install pipelines, electric lines and other equipment on land owned by TPL.  When TPL receives a signed contract and payment, we make available the respective parcel of land to the grantee.  Easement income is recognized upon the execution of the easement agreement, or in the event of a renewal upon receipt of the renewal payment, as at that point in time, we have satisfied our performance obligation and the customer has right of use.\n \nLeases of our surface acreage include, but are not limited to, facility, roadway and surface leases with a typical lease term of \n10\n years and generally require fixed annual payments.  Lease cancellations are allowed under certain circumstances, but initial lease deposits are generally nonrefundable.  The initial lease deposits and annual payments are recorded as unearned revenue upon receipt and amortized over the life of the lease.  Advance lease payments are deferred and amortized over the appropriate accounting period.   \nOther surface-related income includes revenue from permits, material sales, and renewable energy sources.  Revenue from permits is recognized upon execution of the contract and receipt of payment.  Revenue from material sales is recognized upon the removal of materials by the customer.  Revenue from renewable energy sources, such as wind and solar power, generally consist of leases, some of which may include a provision for future royalties once certain circumstances occur.  As discussed above, lease payments are recorded as unearned revenue and amortized over the life of the lease.  Royalties are recognized based upon actual production. \n \nLand\n \nSales and Exchanges\n \nWe consider purchasers of land to be our customers as land management, leasing and sales are normal operating activities for TPL.  Revenue is recognized on land sales when the performance obligation to the purchaser (customer) is complete.  Revenue from land exchanges is recognized based upon the estimated fair value of the consideration exchanged.\nF-9\nTable of Contents\nCash,\n \nCash\n \nEquivalents and Restricted Cash\n \nWe consider investments in bank deposits, money market funds, and other highly-liquid cash investments, such as U.S. Treasury bills and commercial paper, with original maturities of three months or less to be cash equivalents.  Our cash equivalents are considered Level 1 assets in the fair value hierarchy.\nThe following table provides a reconciliation of cash, cash equivalents and restricted cash reported within the consolidated balance sheets that correspond to the same such amounts shown in the consolidated statements of cash flows (in thousands):\nDecember 31,\n2024\nDecember 31,\n2023\nCash and cash equivalents\n$\n369,835\n \n$\n725,169\n \nTax like-kind exchange escrow\n1,546\n \n5,380\n \nTotal cash, cash equivalents and restricted cash shown in the statement of cash flows\n$\n371,381\n \n$\n730,549\n \nReceivables\n \nReceivables consist primarily of royalty income due related to our oil, gas and produced water royalties and trade accounts receivable related to water and material sales.  An allowance is recorded for expected credit losses and is based upon our historical write-off experience, aging of trade accounts receivable and collectability patterns of our customers.\n  The allowance for expected credit loss was approximately $\n0.2\n million as of December 31, 2024 and 2023.\n \nAccrual of Oil and Gas Royalties\nThe Company accrues oil and gas royalties, which are included in accounts receivable and accrued receivables, net.  An accrual is necessary due to the time lag between the removal of crude oil and natural gas products from the respective mineral reserve locations and generation of the actual payment by operators.  The oil and gas royalty accrual is based upon historical production volumes, estimates of the timing of future payments and recent market prices for oil and gas.\n \nAccrued oil and gas royalties included in accounts receivable and accrued receivables, net totaled $\n60.7\n million and $\n52.2\n million as of December 31, 2024 and 2023, respectively.\nFair Value Measurement\n \nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability (exit price) in an orderly transaction between market participants at the measurement date.\n \nThe fair value accounting standards establish a fair value hierarchy for inputs used in measuring fair value that maximizes the use of observable inputs and minimizes the use of unobservable inputs by requiring that the most observable inputs be used when available.  Observable inputs are those that market participants would use in pricing the asset or liability based on market data obtained from independent sources.  Unobservable inputs reflect our assumptions about the inputs market participants would use in pricing the asset or liability developed based on the best information available in the circumstances.  The fair value hierarchy is categorized into three levels based on the inputs used in measuring fair value, as follows:\nLevel 1\n – Inputs are based on unadjusted quoted prices in active markets for identical assets or liabilities that we have the ability to access.  Since inputs are based on quoted prices that are readily and regularly available in an active market, Level 1 inputs require the least amount of judgment.\n \nLevel 2\n – Inputs are based on quoted prices for similar instruments in active markets, or are observable either directly or indirectly.  Inputs are obtained from various sources including financial institutions and brokers.\n \nLevel 3\n – Inputs that are unobservable and significant to the overall fair value measurement.  The degree of judgment exercised by us in determining fair value is greatest for fair value measurements categorized in Level 3.\nWe use the highest level of observable market data if such data is available without undue cost and effort.\nF-10\nTable of Contents\nBusiness Combinations and Asset Acquisitions\nOur acquisition activities generally include acquisitions of royalty interests and/or land (real estate), and at times, may also include acquisitions of intangible assets or other tangible assets.\n \nWhen accounting for acquisition activities, we evaluate whether a transaction meets the definition of a business. We first apply a screen test to determine if substantially all of the fair value of the gross assets acquired is concentrated in a single identifiable asset or group of similar identifiable assets. If the screen test is met, the transaction is accounted for as an asset acquisition.\n \nIf the screen test is not met, we further consider whether the set of assets acquired have, at a minimum, inputs and processes that have the ability to create outputs in the form of revenue. If the assets acquired meet this criteria, the transaction is accounted for as a business combination.\nAcquisitions that qualify as an asset acquisition are accounted for using a cost accumulation model whereby the purchase price of the acquisition is allocated to the assets acquired on a relative fair value basis on the date of acquisition.  Inputs used to determine such fair values are primarily based upon internally developed models, publicly-available drilling information, a risk-adjusted discount rate and/or publicly-available data regarding transactions consummated by other buyers and sellers, as applicable.  These fair values are considered Level 2 and Level 3 assets in the fair value hierarchy.  Any associated acquisition costs are capitalized.\nAcquisitions that qualify as a business combination are accounted for using the acquisition method of accounting. The fair value of consideration transferred for an acquisition is allocated to the assets acquired and liabilities assumed based on their fair value on a nonrecurring basis on the acquisition date and are subject to fair value adjustments under certain circumstances.\n \nThe excess of the consideration transferred over the fair value of assets acquired and liabilities assumed is recorded as goodwill. Conversely, in the event the fair value of assets acquired and liabilities assumed is greater than the consideration transferred, a bargain purchase gain is recognized.\nDetermining the fair value of assets acquired and liabilities assumed requires judgment and often involves the use of significant estimates and assumptions as fair values are not always readily determinable.\n \nDifferent techniques may be used to determine fair values, including market prices (where available), comparisons to transactions involving the acquisition of similar assets and liabilities and the discounted net present value of estimated future cash flows, among others.\n \nWe engage third-party valuation firms when appropriate to assist in the fair value determination of assets acquired and liabilities assumed. Acquisition-related expenses and transaction costs associated with business combinations are expensed as incurred.\n \nWe may adjust the amounts recognized in connection with an acquisition during a measurement period not to exceed one year from the date of acquisition, as a result of subsequently obtaining additional information that existed at the acquisition date.\nRoyalty Interests Acquired\nRoyalty interests acquired represent royalty interests in proved and unproved oil and gas properties. The cost of acquired oil and gas royalties are capitalized and are accounted for under the successful efforts method.  As unproved properties are determined to have proved reserves, the related costs are transferred to proved properties and become subject to depletion at that time.     \nEstimates of crude oil, natural gas, and NGL reserves affect the calculation of depletion and impairment and also the unaudited standardized measure disclosures associated with our oil and gas royalty interests.  We engaged an independent consulting petroleum firm, with assistance from us, to prepare an estimate of proved developed producing reserves, future production and income attributable to our royalty interests as of December 31, 2024.  All reserve estimates involve an assessment of the uncertainty relating to the likelihood that the actual remaining quantities recovered will be greater or less than the estimated quantities determined as of the date the estimate is made.  The uncertainty depends primarily on the amount of reliable geologic and engineering data available at the time of the estimate and the interpretation of such data.  For depletion purposes, and as required by the guidelines and definitions established by the Securities and Exchange Commission (the “SEC”), the reserve estimates were based on the average prices during the 12-month period prior to December 31, 2024 determined as an unweighted arithmetic average of the first day of the month for each month within the period.  Any significant variance in the assumptions could materially affect the estimated quantity of reserves, which could affect the carrying value of our oil and gas royalty interests and/or the rate of depletion related to the oil and gas royalty interests.\nF-11\nTable of Contents\nDepletion of Royalty Interests Acquired\nCapitalized costs for proved oil and gas royalty interests are depleted on a unit-of-production basis over total proved reserves.  For depletion of proved oil and gas properties, interests are grouped in a reasonable aggregation of properties with common geological structural features or stratigraphic conditions.\nReal Estate and Royalty Interests Assigned Through the Declaration of Trust\n \nThe fair market value of the land and royalty interests that were assigned through the Declaration of Trust (referred to as “Assigned” land and royalty interests) was not determined in 1888 when the Trust was formed; therefore, no value is assigned in the accompanying consolidated balance sheets to the Assigned land and royalty interests.  Consequently, in the consolidated statements of income and total comprehensive income, no allowance has been made for depletion and no cost has been deducted from the proceeds of sales of the Assigned land and royalty interests.  Even though the 1888 value of real properties cannot be precisely determined, we have concluded that the effect of this matter is no longer significant to our financial position or results of operations.  Minimal real estate improvements are made to land\nImpairment of Long-Lived Assets \nWe evaluate long-lived assets, including intangible assets with finite lives and royalty interests acquired with proved oil and gas reserves, for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable.\n \nWhen assessing the asset for impairment, we compare the undiscounted future net cash flows to the carrying value to determine recoverability.  If the carrying value exceeds the undiscounted future net cash flows, the fair value of the asset is determined and an impairment is recognized based on the amount by which the carrying value exceeds the fair value.  Fair value is determined primarily by discounted cash flows, supported by available market valuations, if applicable.  \nThe factors used to determine fair value of proved oil and gas royalty interests include estimates of proved reserves, future commodity prices, timing of future production, and a risk-adjusted discount rate.  If pricing conditions decline or are depressed, or if there is a negative impact on one or more of the other components of the calculation, we may incur proved property impairments in future periods.  Factors used in the assessment of fair value of unproved oil and gas royalty interests include, but are not limited to, commodity price outlooks and current and future operator activity in the Permian.\nNo\n impairments were recorded for the years ended December 31, 2024, 2023 or 2022.\nAmortization of Intangible Assets\nIntangible assets are amortized on a straight-line basis over their estimated useful lives ranging from \n13\n to \n20\n years.\nProperty, Plant and Equipment\n \nProperty, plant and equipment is carried at cost less accumulated depreciation.  Maintenance and repair costs are expensed as incurred.  Costs associated with our development of infrastructure for sourcing and treating water are capitalized.\n \nResearch and Development Activities\nResearch and development activities relate to the Company’s initiative to develop an energy-efficient desalination and treatment process for surface discharge and beneficial reuse of produced water. Costs for tangible assets used in these activities that have an alternative future use to the Company are capitalized. All other research and development related expenses are expensed when incurred.\n \nDepreciation Expense\nWe account for depreciation of property, plant and equipment on the straight-line method over the estimated useful lives of the assets.\n \nDepreciable lives by category are as follows:\nRange of Estimated Useful Lives (in years)\nWater wells and other water-related assets\n3\nto\n20\nFurniture, fixtures and equipment\n3\nto\n15\nF-12\nTable of Contents\nLeases\nWe lease certain facilities under operating leases.  A determination of whether a contract contains a lease is made at the inception of the arrangement.  Our leased facilities include our administrative offices located in Dallas and Midland, Texas.\nOur leases generally contain options to extend or terminate the lease.  We reevaluate our leases on a regular basis to consider the economic and strategic incentives of exercising the renewal options, and how they align with our operating strategy.  Therefore, substantially all of the renewal option periods are not included within the lease term and the associated payments are not included in the measurement of the right-of-use asset and lease liability as the options to extend are not reasonably certain at lease commencement.  Short-term leases with an initial term of 12 months or less are not recognized in the right-to-use asset and lease liability on the consolidated balance sheets.\nThe lease liabilities are measured at the lease commencement date and determined using the present value of the minimum lease payments not yet paid and our incremental borrowing rate, which approximates the rate at which we would borrow, on a collateralized basis, over the term of a lease in the applicable currency environment.  The interest rate implicit in the lease is generally not determinable in transactions where we are the lessee.\nFor real estate leases, we account for lease components and non-lease components (such as common area maintenance) as a single lease component.  Certain real estate leases require reimbursement for real estate taxes, common area maintenance and insurance, which are expensed as incurred as variable lease costs.  Certain leases contain fixed lease payments for items such as common area maintenance and parking.  These fixed payments are considered part of the lease payment and included in the right-of-use assets and lease liabilities.  See Note 13, “Commitments and Contingencies” for additional information.\nIncome Taxes\n \nDeferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carry-forwards.  Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled.  The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nWhen tax returns are filed, it is highly certain that some positions taken would be sustained upon examination by the taxing authorities, while others are subject to uncertainty about the merits of the position taken or the amount of the position that would be ultimately sustained.  The benefit of a tax position is recognized in the financial statements in the period during which, based on all available evidence, management believes it is more likely than not that the position will be sustained upon examination, including the resolution of appeals or litigation processes, if any.  Tax positions taken are not offset or aggregated with other positions.  Tax positions that meet the more-likely-than-not recognition threshold are measured as the largest amount of tax benefit that is more than 50% likely of being realized upon settlement with the applicable taxing authority.  The portion of the benefits associated with tax positions taken that exceeds the amount measured as described above is reflected as a liability for unrecognized tax benefits in the accompanying balance sheet along with any associated interest and penalties that would be payable to the taxing authorities upon examination.\n  The liability for unrecognized tax benefits was \nzero\n as of December 31, 2024 and 2023.  We recognize interest and penalties related to unrecognized tax benefits in the provision for income taxes in the consolidated statements of income and total comprehensive income.\n \nShare-Based Compensation\nThe Company utilizes the closing stock price on the date of grant to determine the fair value of stock awards and service-vesting awards, which for the Company includes restricted stock awards (“RSAs”), restricted stock units (“RSUs”), and performance stock units (“PSUs”) with a performance condition.  For PSUs with a market condition, grant date fair value is determined using a Monte Carlo simulation model.  Unvested awards are entitled to dividends or dividend equivalents which are accrued and distributed to award recipients at the time such awards vest.  Dividends are forfeitable if the related award is forfeited.  For RSAs, RSUs and PSUs with performance conditions, forfeitures are recognized in the period in which they occur.  For PSU awards with market conditions, forfeitures are only recognized if the award recipient does not render the required service during the measurement period. \nShare-based compensation expense for restricted stock awards with no requisite service period is recognized in the financial statements immediately on date of grant.  Share-based compensation expense for RSUs and RSAs with a requisite service period is recognized in the financial statements over the awards’ vesting periods using the graded-vesting method.  \nF-13\nTable of Contents\nShare-based compensation expense for PSU awards with performance conditions is recognized ratably over the measurement period at such time as the awards are probable and estimable.  Share-based compensation expense for PSU awards with market conditions is recognized ratably over the measurement period regardless of whether the market condition is satisfied if the service for the award is rendered.  Share-based compensation is reported on the consolidated statements of income and total comprehensive income as a component of salaries and related employee expenses for employee awards and in general and administrative expenses for director awards.\nNet\n \nIncome Per Share \n \nBasic income per share is based on the weighted average number of shares outstanding during the period.  Diluted net income per share is computed based upon the weighted average number of shares outstanding during the period plus unvested  shares issued pursuant to our equity and deferred compensation plans.  See Note 12, “Earnings Per Share.”\nTreasury Stock \nTreasury stock purchases are accounted for under the cost method whereby the entire cost of the shares of the Company’s common stock, par value $\n0.01\n per share (“Common Stock”), acquired is recorded as treasury stock.  The cost associated with issuance of treasury stock is based on the average cost of treasury stock as of the date of issuance.\n \nComprehensive Income (Loss)\n \nComprehensive income (loss) consists of net income and other gains and losses affecting capital that, under GAAP, are excluded from net income.\n \nConcentrations of Credit Risk\n \nWe invest our cash and cash equivalents (which include U.S. Treasury bills, money market funds, and commercial paper with maturities of three months or less) among \nthree\n major financial institutions in an attempt to minimize exposure to risk from any one of these entities.  As of December 31, 2024 and 2023, we had cash and cash equivalents deposited in our financial institutions in excess of federally-insured levels.  We regularly monitor the financial condition of these financial institutions and believe that we are not exposed to any significant credit risk in cash and cash equivalents.\nSignificant Customers\n \nThree customers represented, in the aggregate, \n40.9\n% of TPL’s total revenues for the year ended December 31, 2024.  Three customers represented, in the aggregate, \n42.5\n% of TPL’s total revenues for the year ended December 31, 2023.  Four customers represented, in the aggregate, \n51.8\n% of TPL’s total revenues for the year ended December 31, 2022.\n3.    \nAssets Acquired in a Business Combination\nOn August 20, 2024, we acquired \n4,120\n acres of land along with other surface-related tangible and intangible assets (collectively referred to as the “Acquired Assets”) from an unaffiliated seller for total consideration of $\n45.0\n million, in an all-cash transaction.  There were no liabilities assumed by the Company in this transaction.  The Acquired Assets generate revenue streams across water sales, produced water royalties, and SLEM revenue, and provide additional commercial growth opportunities for the Company to expand water sourcing and produced water opportunities to both new and existing customers.  The Acquired Assets are located in the Midland Basin.   \nF-14\nTable of Contents\nThe Acquired Assets included the following:\nAcquired Assets\nBalance Sheet Classification\nBusiness Segment\n4,120\n acres of land\nReal estate acquired\nLand and Resource Management\nWater sourcing assets, including water pits, water wells, pipes and electrical infrastructure\nProperty, plant and equipment\nWater Services and Operations\nA \n25\n% non-operating working interest in an existing saltwater disposal (“SWD”) system\nProperty, plant and equipment\nWater Services and Operations\nContractual right to a \n10\n% royalty on produced water revenue generated from the SWD system\nIntangible assets\nWater Services and Operations\nContractual right to a \n7.5\n% royalty on revenue generated from nonhazardous oilfield solids waste disposal site\nIntangible assets\nLand and Resource Management\nThe combination of the \n25\n% non-operating working interest and the \n10\n% royalty interest from the SWD system entitles the Company to \n32.5\n% of produced water revenues generated from the SWD system.  As a \n25\n% non-operating working interest owner, the Company is also responsible for its \n25\n% share of operating expenses associated with the SWD system.  The operator of the SWD system is responsible for the day-to-day management and operations.  Of the \n4,120\n acres of land acquired, \n392\n acres are leased to, and operated by, an environmental solution (“ES”) company that operates a nonhazardous oilfield solids waste disposal site.  The ES company pays a \n7.5\n% royalty, on revenue generated, to the Company. The Company reports the royalty received as SLEM revenue.\nThe acquisition was accounted for as a business combination using the acquisition method, and therefore, the Acquired Assets were recorded based on their fair value on a nonrecurring basis on the date of acquisition and are subject to fair value adjustments under certain circumstances.  In determining the fair values of assets acquired, management made estimates, judgements and assumptions.  Inputs used to determine fair values of assets included internally-developed models, risk-adjusted discount rates by asset class, publicly available data on land sales comparisons and other costs analysis.  These fair values are considered Level 3 assets in the fair value hierarchy.  There was no goodwill recorded on this acquisition.  The purchase price allocation was finalized during the year ended December 31, 2024.    \nThe following table presents the allocation of fair value by asset class (in thousands):\nDecember 31,\n2024\nReal estate acquired\n$\n12,100\n \nProperty, plant and equipment\n17,200\n \nIntangible assets\n15,700\n \nTotal consideration and fair value\n$\n45,000\n \nThe Company incurred $\n0.1\n million of transaction-related costs related to this asset acquisition during the year ended December 31, 2024 and such costs are included in general and administrative expenses in the consolidated statements of income. \nFrom August 20, 2024 through December 31, 2024, revenues and operating expenses from the business combination were approximately $\n1.4\n million and $\n1.5\n million, respectively, and are included in our consolidated statements of income.  Pro forma financial information is not disclosed as the acquisition was deemed not to have a material impact on our results of operations.\n \nF-15\nTable of Contents\n4.    \nOil and Gas Royalty Interests\nAs of December 31, 2024 and 2023, we owned the following oil and gas royalty interests (in thousands):\nDecember 31,\n2024\nDecember 31,\n2023\nOil and gas royalty interests:\n1/16th nonparticipating perpetual royalty interests\n (1)\n$\n—\n \n$\n—\n \n1/128th nonparticipating perpetual royalty interests\n (2)\n—\n \n—\n \nRoyalty interests acquired, at cost\n (3)\n447,071\n \n51,494\n \nTotal royalty interests\n447,071\n \n51,494\n \nLess: accumulated depletion\n(\n14,670\n)\n(\n4,885\n)\nRoyalty interests, net\n$\n432,401\n \n$\n46,609\n \n(1)    Nonparticipating perpetual royalty interests in \n370,737\n gross royalty acres as of December 31, 2024 and 2023.\n(2)    Nonparticipating perpetual royalty interests in \n84,934\n gross royalty acres as of December 31, 2024 and 2023.\n(3)    Royalty interest in \n15,897\n and \n4,302\n net royalty acres as of December 31, 2024 and 2023, respectively.\nRoyalty Interests Assigned Through the Declaration of Trust\n \nThe fair market value of the Trust’s Assigned royalty interests was not determined in 1888 when the Trust was formed, and accordingly, the Assigned royalty interests were recorded with no value.  See Note 2, “Summary of Significant Accounting Policies — Real Estate and Royalty Interests Assigned Through the Declaration of Trust” for further information regarding the Assigned royalty interests.  The Assigned royalty interests include 1/16th and 1/128th royalty interests.\nRoyalty Interest Transactions\nFor the year ended December 31, 2024, we completed two separate acquisitions of oil and gas royalty interests, acquiring a total of \n11,596\n NRA for an aggregate purchase price of approximately $\n395.5\n million, net of post-closing adjustments, as further described below.\n•\nIn August 2024, we acquired oil and gas royalty interests in \n4,106\n NRA in Culberson County, Texas for a purchase price of approximately $\n120.3\n million, net of post-closing adjustments, in an all-cash transaction.  The acquisition was accounted for as an asset acquisition, and the allocation of the purchase price was $\n63.5\n million to proved properties and $\n56.8\n million to unproved properties.  The acquisition was completed in conjunction with another entity that assigned a share of its interest in a purchase and sales agreement with an unaffiliated seller to the Company.  Each party paid a pro-rata share of the purchase price and closing costs to the unaffiliated seller.\n•\nIn October 2024, we acquired oil and gas royalty interests in \n7,490\n NRA located primarily in the Midland Basin in Martin, Midland and other counties in Texas and New Mexico, with over \n80\n% of the acquired interests adjacent to or overlapping existing TPL surface and royalty acreage for a purchase price of approximately $\n275.2\n million, net of post-closing adjustments, in an all-cash transaction.  The acquisition was accounted for as an asset acquisition, and the allocation of the purchase price was $\n57.4\n million to proved properties and $\n217.8\n million to unproved properties.  \nFor the year ended December 31, 2023, we acquired oil and gas royalty interests in \n119\n net royalty acres (normalized to 1/8th) for an aggregate purchase price of approximately $\n3.6\n million.\nDepletion expense was $\n9.8\n million, $\n2.0\n million and $\n1.0\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nF-16\nTable of Contents\n5.    \nReal Estate Activity\nAs of December 31, 2024 and 2023, TPL owned the following land and real estate (in thousands, except number of acres):\nDecember 31,\n2024\nDecember 31,\n2023\nNumber of Acres\nNet Book Value\nNumber of Acres\nNet Book Value\nLand (surface rights)\n \n(1)\n798,643\n \n$\n—\n \n798,999\n \n$\n—\n \nReal estate acquired\n74,493\n \n143,178\n \n69,447\n \n130,024\n \nTotal real estate\n873,136\n \n$\n143,178\n \n868,446\n \n$\n130,024\n \n(1)\nReal estate assigned through the Declaration of Trust.\nThe Assigned land held by TPL was recorded with no value at the time of acquisition.  See Note 2, “Summary of Significant Accounting Policies — Real Estate and Royalty Interests Assigned Through the Declaration of Trust” for further information regarding the Assigned land.  Real estate acquired includes land parcels which have either been acquired through foreclosure or transactions with third parties.\nLand Acquisitions\nFor the year ended December 31, 2024, we acquired \n4,120\n acres through a business combination with a fair value of $\n12.1\n million.  See further discussion of the business combination in Note 3, “Assets Acquired in a Business Combination.”  Additionally, we acquired \n1,009\n acres of land for an aggregate purchase price of $\n1.5\n million for the year ended December 31, 2024.\nFor the year ended December 31, 2023, we acquired \n12,141\n acres of land for an aggregate purchase price of $\n20.0\n million.\nLand Sales\nFor the year ended December 31, 2024, we sold \n439\n acres of land for an aggregate sales price of $\n4.4\n million. For the year ended December 31, 2023, we sold \n18,061\n acres of land for an aggregate sales price of $\n6.8\n million. For the year ended December 31, 2022, we sold \n6,392\n acres of land for an aggregate sales price of approximately $\n9.7\n million.\n6.    \nProperty, Plant and Equipment\n \nProperty, plant and equipment, net consisted of the following as of December 31, 2024 and 2023 (in thousands):\n \nDecember 31,\n2024\nDecember 31,\n2023\nProperty, plant and equipment, at cost:\n \n \nWater service-related assets \n(1)\n$\n167,855\n \n$\n136,340\n \nFurniture, fixtures and equipment\n9,932\n \n9,801\n \nOther\n598\n \n598\n \nTotal property, plant and equipment, at cost\n178,385\n \n146,739\n \nLess: accumulated depreciation\n(\n55,807\n)\n(\n57,152\n)\nProperty, plant and equipment, net\n$\n122,578\n \n$\n89,587\n \n(1)\nIncludes $\n17.2\n million of assets acquired in a business combination.  For further information, see Note 3, “Assets Acquired in a Business Combination.”\nDepreciation expense was $\n13.6\n million, $\n12.2\n million and $\n14.2\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nF-17\nTable of Contents\n7.    \nIntangible Assets\nIntangible assets, net consisted of the following as of December 31, 2024 and 2023 (in thousands):\n \nDecember 31,\n2024\nDecember 31,\n2023\nIntangible assets, at cost:\n \n \nSaltwater disposal easement\n$\n17,557\n \n$\n17,557\n \nContracts acquired in a business combination \n(1)\n15,700\n \n—\n \nGroundwater rights acquired\n3,846\n \n3,846\n \nTotal intangible assets, at cost\n (2)\n37,103\n \n21,403\n \nLess: accumulated amortization\n(\n1,915\n)\n(\n378\n)\nIntangible assets, net\n$\n35,188\n \n$\n21,025\n \n(1)\nSee further discussion in Note 3, “Assets Acquired in a Business Combination.”\n(2)\nThe remaining weighted average amortization period for total intangible assets was \n11.8\n years as of December 31, 2024.\n \nAmortization of intangible assets was $\n1.5\n million and $\n0.4\n million for the years ended December 31, 2024 and 2023, respectively.  There was \nno\n amortization of intangible assets for the year ended December 31, 2022.  \nThe estimated future annual amortization expense of intangible assets for each of the next five years and thereafter is as follows (in thousands): \nYear\nEstimated Future Annual Amortization Expense\n2025\n$\n2,342\n \n2026\n2,342\n \n2027\n2,342\n \n2028\n2,342\n \n2029\n2,342\n \n2030 and thereafter\n23,478\n \n8.    \nPension and Other Postretirement Benefits\n \nTPL has a defined contribution plan available to all eligible employees.  Qualifying participants may receive a matching contribution based on the amount participants contribute to the plan up to \n6\n% of their qualifying compensation.  TPL contributed approximately $\n0.9\n million, $\n0.8\n million and $\n0.7\n million to the defined contribution plan for the years ended December 31, 2024, 2023 and 2022, respectively.\n \nThe Restated Texas Pacific Land Corporation Employees’ Pension Plan (the “Pension Plan”) is a noncontributory defined benefit pension plan qualified under Section 401 of the Internal Revenue Code of 1986, as amended (the “Code”), and is available to all eligible employees who have completed \none year\n of continuous service with TPL during which they completed at least \n1,000\n hours of service.  The Pension Plan provides for a normal retirement benefit at age 65.  Contributions to the Pension Plan reflect benefits accrued with respect to participants’ services to date, as well as the amount actuarially determined to pay lifetime benefits to participants and their beneficiaries upon retirement. \n \nDuring 2024, the Company irrevocably transferred $\n3.4\n million of the Pension Plan’s defined benefit obligations and related plan assets to a third-party insurance company in an annuity buyout.  The transaction resulted in no changes to the benefits to be received by the retired and deferred vested participants.  The Company recognized a realized non-cash settlement gain on the annuity buyout of $\n0.7\n million.  The gain is included in other income (expense) on the consolidated statement of income.\nEffective December 31, 2024, the Pension Plan was frozen for benefit accruals and closed to new participants.  This event resulted in a non-cash curtailment gain of $\n3.9\n million for the year ended December 31, 2024.  The gain is included in other income (expense) on the consolidated statement of income.\nF-18\nTable of Contents\nThe following table sets forth the Pension Plan’s changes in benefit obligation, changes in fair value of assets, and funded status as of December 31, 2024 and 2023 using a measurement date of December 31 (in thousands):\n \nDecember 31, 2024\nDecember 31, 2023\nChange in projected benefits obligation:\nProjected benefit obligation at beginning of year\n$\n10,553\n \n$\n8,177\n \nCurtailment gain\n(\n3,864\n)\n—\n \nAnnuity buyout settlement\n(\n3,439\n)\n—\n \nService cost\n1,848\n \n1,537\n \nInterest cost\n503\n \n423\n \nActuarial gain (loss)\n(\n1,812\n)\n658\n \nBenefits paid\n(\n222\n)\n(\n242\n)\n Projected benefit obligation at end of year\n$\n3,567\n \n$\n10,553\n \nChange in Pension Plan assets:\nFair value of Pension Plan assets at beginning of year\n$\n14,201\n \n$\n11,650\n \nAnnuity buyout settlement\n(\n3,439\n)\n—\n \nActual return on Pension Plan assets\n2,071\n \n725\n \nContributions by employer\n—\n \n2,068\n \nBenefits paid\n(\n222\n)\n(\n242\n)\nFair value of Pension Plan assets at end of year\n12,611\n \n14,201\n \nFunded status at end of year\n$\n9,044\n \n$\n3,648\n \n \nThe projected Pension Plan benefit obligation as of December 31, 2024 was impacted by changes in assumptions used as of that date compared to assumptions used as of December 31, 2023.  These changes included an increase in the discount rate from \n5.00\n% as of December 31, 2023 to \n5.75\n% as of December 31, 2024.  The effect of the assumption changes was a decrease in the projected benefit obligation of approximately $\n1.9\n million.\nAmounts recognized on the consolidated balance sheets as of December 31, 2024 and 2023 consisted of (in thousands):\n \nDecember 31, 2024\nDecember 31, 2023\nAssets\n$\n9,044\n \n$\n3,648\n \nLiabilities\n—\n \n—\n \n \n$\n9,044\n \n$\n3,648\n \nThe Pension Plan asset is included in other assets on the consolidated balance sheets.\nAmounts recognized in accumulated other comprehensive income on the consolidated balance sheets consisted of the following as of December 31, 2024 and 2023 (in thousands):\n \nDecember 31, 2024\nDecember 31, 2023\nNet actuarial gain\n$\n4,371\n \n$\n2,319\n \nAmounts recognized in accumulated other comprehensive income, before taxes\n4,371\n \n2,319\n \nIncome tax expense\n(\n918\n)\n(\n488\n)\nAmounts recognized in accumulated other comprehensive income, after taxes\n$\n3,453\n \n$\n1,831\n \nF-19\nTable of Contents\n \nNet periodic pension (benefit) cost for the years ended December 31, 2024, 2023 and 2022 included the following components (in thousands):\nYears Ended December 31,\n \n2024\n2023\n2022\nComponents of net periodic (benefit) cost:\nCurtailment gain\n$\n(\n3,864\n)\n$\n—\n \n$\n—\n \nRealized gain on settlement\n(\n752\n)\n—\n \n—\n \nService cost\n1,848\n \n1,537\n \n2,870\n \nInterest cost\n503\n \n423\n \n336\n \nExpected return on Pension Plan assets\n(\n964\n)\n(\n807\n)\n(\n741\n)\nRecognized actuarial (gain) loss\n(\n114\n)\n(\n130\n)\n41\n \nNet periodic pension (benefit) cost\n$\n(\n3,343\n)\n$\n1,023\n \n$\n2,506\n \n \nService cost, a component of net periodic pension (benefit) cost, is reflected in our consolidated statements of income and total comprehensive income within salaries and related employee expenses.  The other components of net periodic pension (benefit) cost are included in \nother income, net\n on the consolidated statements of income and total comprehensive income.\nOther changes in Pension Plan assets and benefit obligations recognized in other comprehensive (income) loss for the years ended December 31, 2024, 2023 and 2022 were as follows (in thousands): \nYears Ended December 31,\n \n2024\n2023\n2022\nNet actuarial (gain) loss\n$\n(\n2,919\n)\n$\n739\n \n$\n(\n4,422\n)\nRecognized actuarial gain (loss)\n866\n \n130\n \n(\n41\n)\nTotal recognized in other comprehensive (income) loss, before taxes\n$\n(\n2,053\n)\n$\n869\n \n$\n(\n4,463\n)\nTotal recognized in net benefit cost and other comprehensive (income) loss, before taxes\n$\n(\n5,396\n)\n$\n1,892\n \n$\n(\n1,958\n)\n \nTPL reclassified $\n0.6\n million (net of income tax benefit of $\n0.1\n million) out of accumulated other comprehensive loss for net periodic pension (benefit) cost to other income, net for the year ended December 31, 2024, $\n0.5\n million (net of income tax benefit of $\n0.1\n million) for the year ended December 31, 2023 and $\n0.4\n million (net of income tax benefit of $\n0.1\n million) for the year ended December 31, 2022.\nThe following table summarizes the projected benefit obligation in excess of Pension Plan assets and Pension Plan assets in excess of accumulated benefit obligation as of December 31, 2024 and 2023 (in thousands):\n \nDecember 31, 2024\nDecember 31, 2023\nProjected benefit obligation in excess of Pension Plan assets:\nProjected benefit obligation\n$\n3,567\n \n$\n10,553\n \nFair value of Pension Plan assets\n$\n12,611\n \n$\n14,201\n \nPlan assets in excess of accumulated benefit obligation:\nAccumulated benefit obligation\n$\n3,567\n \n$\n6,417\n \nFair value of Pension Plan assets\n$\n12,611\n \n$\n14,201\n \n \nF-20\nTable of Contents\nThe following are weighted-average assumptions used to determine benefit obligations and costs as of December 31, 2024, 2023 and 2022:\nYears Ended December 31,\n \n2024\n2023\n2022\nWeighted average assumptions used to determine benefit obligations as of December 31:\nDiscount rate\n5.75\n \n%\n5.00\n \n%\n5.25\n \n%\nRate of compensation increase\nN/A\n (1)\n7.29\n \n%\n7.29\n \n%\nWeighted average assumptions used to determine benefit costs for the years ended December 31:\nDiscount rate\n5.00\n \n%\n5.25\n \n%\n3.00\n \n%\nExpected return on Pension Plan assets\n7.00\n \n%\n7.00\n \n%\n7.00\n \n%\nRate of compensation increase\n7.29\n \n%\n7.29\n \n%\n7.29\n \n%\n(1)\nAs the Pension plan was frozen effective December 31, 2024, this assumption is not applicable in the calculation of the benefit obligations as of December 31, 2024.\n \nThe expected return on Pension Plan assets assumption of \n7.0\n% was selected by TPL based on historical real rates of return for the current asset mix and an assumption with respect to future inflation.  The rate was determined based on a long-term allocation of about two-thirds fixed income and one-third equity securities; historical real rates of return of about \n2.5\n% and \n8.5\n% for fixed income and equity securities, respectively; and assuming a long-term inflation rate of \n2.5\n%.\n \nThe Pension Plan has a formal investment policy statement. The Pension Plan’s investment objective is balanced income, with a moderate risk tolerance.  This objective emphasizes current income through a \n30.0\n% to \n80.0\n% allocation to fixed income securities, complemented by a secondary consideration for capital appreciation through an equity allocation in the range of \n20.0\n% to \n60.0\n%.  Diversification is achieved through investment in equities and bonds.  The asset allocation is reviewed annually with respect to the target allocations and rebalancing adjustments and/or target allocation changes are made as appropriate.  Our current funding policy is to maintain the Pension Plan’s fully funded status on an ERISA minimum funding basis.\nThe fair values of the Pension Plan assets (all considered Level 1 assets in the fair value hierarchy) are classified by major asset category as of December 31, 2024 and 2023, were as follows (in thousands):  \nDecember 31, 2024\nDecember 31, 2023\nCash and cash equivalents — money markets\n$\n574\n \n$\n1,179\n \nEquities\n8,600\n \n8,182\n \nEquity funds\n1,049\n \n401\n \nFixed income funds\n—\n \n1,000\n \nTaxable bonds\n2,388\n \n3,439\n \nTotal\n$\n12,611\n \n$\n14,201\n \nWhile \nno\n funding requirements are expected for 2025, management intends to fund the Pension Plan for 2025 to the extent of any minimum amount required under ERISA.  \n \nThe following benefit payments, which reflect expected future service, as appropriate, are expected to be paid for the following 10-year period (in thousands):\nF-21\nTable of Contents\n \nYear ending December 31,\nAmount\n2025\n$\n32\n \n2026\n37\n \n2027\n43\n \n2028\n93\n \n2029\n93\n \n2030 to 2034\n611\n \n9.    \nShare-Based Compensation\nThe Company grants share-based compensation to employees under the Texas Pacific Land Corporation 2021 Incentive Plan (the “2021 Plan”) and to its non-employee directors under the 2021 Non-Employee Director Stock and Deferred Compensation Plan (the “2021 Directors Plan” and, with the 2021 Plan, collectively referred to herein as the “Plans”).  In conjunction with the \nthree\n-for-one stock split effected on March 26, 2024, the Plans were adjusted to increase the authorized number of shares that may be issued under the Plans.  As of December 31, 2024, share-based compensation granted under the Plans included RSAs, RSUs and PSUs.  Currently, all awards granted under the Plans are entitled to receive dividends (which are accrued and distributed to award recipients upon vesting) or have dividend equivalent rights.  Dividends and dividend equivalent rights are subject to the same vesting conditions as the awards to which they relate and are forfeitable if the related awards are forfeited.  RSUs granted under the 2021 Plan vest in one-third increments and PSUs granted under the 2021 Plan cliff vest at the end of \nthree years\n if the applicable performance metrics are achieved (as discussed further below).  RSAs granted prior to October 31, 2023 under the 2021 Directors Plan vested on the first anniversary of the award.  Effective October 31, 2023, the 2021 Directors Plan was amended such that RSAs vest in full on the date of grant.\nIncentive Plan for Employees\nThe maximum aggregate number of shares of Common Stock that may be issued under the 2021 Plan is \n225,000\n shares, which may consist, in whole or in part, of authorized and unissued shares (if any), treasury shares, or shares reacquired by the Company in any manner.  As of December 31, 2024, \n136,238\n shares of Common Stock remained available under the 2021 Plan for future grants.\nThe following table summarizes activity related to RSAs and RSUs under the 2021 Plan for the years ended December 31, 2024 and 2023:\nYears Ended December 31,\n2024\n2023\nRestricted Stock Awards \n(1)\nRestricted Stock Units \n(2)\nRestricted Stock Awards \n(1)\nRestricted Stock Units \n(2)\nNumber of RSAs\nWeighted-Average Grant-Date Fair Value per Share\nNumber of RSUs\nWeighted-Average Grant-Date Fair Value per Share\nNumber of RSAs\nWeighted-Average Grant-Date Fair Value per Share\nNumber of RSUs\nWeighted-Average Grant-Date Fair Value per Share\nNonvested at beginning of period\n—\n \n$\n—\n \n18,675\n \n$\n527\n \n4,011\n \n$\n417\n \n16,836\n \n$\n441\n \nGranted\n—\n \n—\n \n12,655\n \n481\n \n—\n \n—\n \n8,544\n \n641\n \nVested\n (3)\n—\n \n—\n \n(\n7,812\n)\n507\n \n(\n3,891\n)\n417\n \n(\n5,592\n)\n441\n \nCancelled and forfeited\n—\n \n—\n \n(\n306\n)\n528\n \n(\n120\n)\n417\n \n(\n1,113\n)\n534\n \nNonvested at end of period\n—\n \n$\n—\n \n23,212\n \n$\n509\n \n—\n \n$\n—\n \n18,675\n \n$\n527\n \n(1)\nAs of December 31, 2023, all RSAs have vested or have been forfeited. No additional RSAs have been granted since December 29, 2021.\n(2)\nRSUs vest in one-third increments over a \nthree-year\n period.\nF-22\nTable of Contents\n(3)\nOf the \n7,812\n RSUs that vested during the year ended December 31, 2024, \n2,948\n RSUs were surrendered by employees to the Company upon vesting to settle tax withholdings.  Of the \n9,483\n RSUs that vested during the year ended December 31, 2023, \n3,495\n RSUs were surrendered by employees to the Company upon vesting to settle tax withholding obligations.\nThe following table summarizes activity related to PSUs under the 2021 Plan for the years ended December 31, 2024 and 2023:\nYears Ended December 31,\n2024\n2023\nNumber of Target PSUs\nWeighted-Average Grant-Date Fair Value per Share\nNumber of Target PSUs\nWeighted-Average Grant-Date Fair Value per Share\nNonvested at beginning of period\n (1)\n12,738\n \n$\n595\n \n7,182\n \n$\n452\n \nGranted \n(2)\n8,340\n \n538\n \n5,556\n \n781\n \nVested\n—\n \n—\n \n—\n \n—\n \nCancelled and forfeited\n—\n \n—\n \n—\n \n—\n \nNonvested at end of period\n21,078\n \n$\n573\n \n12,738\n \n$\n595\n \n(1)\nNonvested PSUs as of January 1, 2024 included \n6,369\n RTSR (as defined below) PSUs and \n6,369\n FCF (as defined below) PSUs.  If the maximum amount of the performance metrics described in the applicable PSU agreements are achieved, the actual number of shares that will ultimately vest pursuant to the PSU agreements will exceed target PSUs by \n100\n% (i.e., a collective \n12,738\n additional shares would be issued).   \n(2)\nThe PSUs were granted on February 13, 2024 and include \n4,170\n RTSR PSUs (based on target) with a grant date fair value of $\n602\n per share and \n4,170\n FCF PSUs (based on target) with a grant date fair value of $\n475\n per share.  If the maximum amount of the performance metrics described in the applicable PSU agreements are achieved, the actual number of shares that will ultimately vest pursuant to the PSU agreements will exceed target PSUs by \n100\n% (i.e., a collective \n8,340\n additional shares would be issued).\nEach PSU has a value equal to \none\n share of Common Stock.  The PSUs will vest \nthree years\n after grant if certain performance metrics are met, as follows: \n50\n% of the PSUs may be earned based on the Company’s relative total stockholder return (“RTSR”) over the applicable \nthree-year\n measurement period compared to the SPDR\n®\n S&P\n®\n Oil & Gas Exploration & Production ETF (“XOP”) Index, and \n50\n% of the PSUs may be earned based on the cumulative free cash flow per share (“FCF”) over the \nthree-year\n vesting period.  As the RTSR PSUs are market-based awards, their grant date fair value was determined using a Monte Carlo simulation model that uses the same input assumptions as the Black-Scholes model to determine the expected potential ranking of the Company against the XOP Index (i.e., the probability of satisfying the market condition defined in the awards).  Expected volatility in the model was estimated based on the volatility of historical stock prices over a period matching the expected term of the awards.  The risk-free interest rate was based on U.S. Treasury yield constant maturities for a term matching the expected term of the awards. The inputs for the Monte Carlo simulation model are designated as Level 2 within the fair value hierarchy.\nEquity Plan for Non-Employee Directors\nThe maximum aggregate number of shares of Common Stock that may be issued under the 2021 Directors Plan is \n30,000\n shares, which may consist, in whole or in part, of authorized and unissued shares (if any), treasury shares, or shares reacquired by the Company in any manner.  As of December 31, 2024, \n24,219\n \nshares of Common Stock remained available under the 2021 Directors Plan for future grants.\nF-23\nTable of Contents\nThe following table summarizes activity related to the RSAs under the 2021 Directors Plan for the years ended December 31, 2024 and 2023:\nYears Ended December 31,\n2024\n2023\nRestricted Stock Awards\nRestricted Stock Awards\nNumber of RSAs\nWeighted-Average Grant-Date Fair Value per Share\nNumber of RSAs\nWeighted-Average Grant-Date Fair Value per Share\nNonvested at beginning of period\n1,134\n \n$\n781\n \n2,097\n \n$\n427\n \nGranted\n \n(1)\n2,160\n \n524\n \n1,458\n \n781\n \nVested\n(\n3,294\n)\n612\n \n(\n2,421\n)\n474\n \nCancelled and forfeited\n—\n \n—\n \n—\n \n—\n \nNonvested at end of period\n—\n \n$\n—\n \n1,134\n \n$\n781\n \n(1)\nRSAs granted prior to October 31, 2023 vest on the first anniversary of the grant date and RSAs granted on or after October 31, 2023 vest in full on the date of grant.\n \nShare-Based Compensation Expense\nThe following table summarizes our share-based compensation expense by line item in the consolidated statements of income (in thousands):\nYears Ended December 31,\n2024\n2023\n2022\nSalaries and related employee expenses (employee awards)\n$\n11,364\n \n$\n9,124\n \n$\n7,583\n \nGeneral and administrative expenses (director awards)\n1,134\n \n1,219\n \n849\n \nTotal share-based compensation expense \n(1)\n$\n12,498\n \n$\n10,343\n \n$\n8,432\n \n(1)\nThe Company recognized a tax benefit of $\n2.6\n million, $\n2.2\n million and $\n1.8\n million related to share-based compensation for the years ended December 31, 2024, 2023 and 2022, respectively.\nAs of December 31, 2024, there was $\n10.5\n million of total unrecognized compensation cost related to unvested share-based compensation arrangements granted under existing share-based plans expected to be recognized over a weighted average period of \n1.0\n year.\n \n10.    \nOther Income, Net\nOther income, net, includes interest earned on our cash balances, and other miscellaneous income (expense).  Miscellaneous income (expense) includes insurance proceeds and gains and losses on disposals of capital assets.\nOther income, net for the years ended December 31, 2024, 2023 and 2022 was as follows (in thousands):\nYears Ended December 31,\n \n2024\n2023\n2022\nOther income, net:\nInterest earned on cash and cash equivalents, net\n$\n32,140\n \n$\n28,630\n \n$\n6,207\n \nCurtailment gain \n(1)\n3,864\n \n—\n \n—\n \nRealized gain on pension settlement \n(1)\n752\n \n—\n \n—\n \nOther employee pension costs\n575\n \n514\n \n363\n \nMiscellaneous other income (expense), net \n(2)\n2,352\n \n2,364\n \n(\n22\n)\nTotal other income, net\n$\n39,683\n \n$\n31,508\n \n$\n6,548\n \nF-24\nTable of Contents\n(1)\nSee Note 8, “Pension and Other Postretirement Benefits” for discussion of curtailment gain and realized gain on pension settlement.\n(2)\nFor the year ended December 31, 2024, miscellaneous income (expense), net includes $\n1.9\n million of proceeds from a settlement with a title company regarding a defect in title to property acquired in a prior year.  For the year ended December 31, 2023, miscellaneous other income (expense), net includes $\n1.4\n million of interest and damages resulting from an arbitration settlement with an operator.  See Note 13, “Commitments and Contingencies” for further information regarding the arbitration.\n \n11.    \nIncome Taxes \nThe income tax provision charged to operations for the years ended December 31, 2024, 2023 and 2022 was as follows (in thousands):\nYears Ended December 31,\n \n2024\n2023\n2022\nCurrent:\nU.S. Federal\n$\n116,323\n \n$\n106,721\n \n$\n117,395\n \nState and local\n3,934\n \n3,796\n \n3,835\n \nCurrent income tax expense\n120,257\n \n110,517\n \n121,230\n \nDeferred expense \n4,604\n \n1,399\n \n1,263\n \nTotal income tax expense\n$\n124,861\n \n$\n111,916\n \n$\n122,493\n \nTotal income tax expense differed from the amounts computed by applying the U.S. Federal income tax rate of 21% for the years ended December 31, 2024, 2023 and 2022 to income before Federal income taxes as a result of the following (in thousands):\nYears Ended December 31,\n \n2024\n2023\n2022\nComputed tax expense at the statutory rate of 21%\n$\n121,552\n \n$\n108,688\n \n$\n119,460\n \nReduction in income taxes resulting from:\nState taxes\n3,182\n \n3,439\n \n3,045\n \nExecutive compensation\n1,803\n \n1,117\n \n1,146\n \nResearch and development credit\n(\n850\n)\n—\n \n—\n \nStatutory depletion\n(\n653\n)\n(\n682\n)\n(\n823\n)\nPrior year tax adjustments\n75\n \n(\n305\n)\n(\n13\n)\nCorrection of historical tax depletion\n—\n \n—\n \n805\n \nEstimated penalties and interest\n—\n \n—\n \n(\n763\n)\nOther, net\n(\n248\n)\n(\n341\n)\n(\n364\n)\nTotal income tax expense\n$\n124,861\n \n$\n111,916\n \n$\n122,493\n \nEffective tax rate\n21.6\n \n%\n21.6\n \n%\n21.5\n \n%\nF-25\nTable of Contents\nThe tax effects of temporary differences that give rise to significant portions of the deferred tax assets and liabilities as of December 31, 2024 and 2023 are as follows (in thousands):\n \nDecember 31, 2024\nDecember 31, 2023\nUnearned revenue\n$\n5,879\n \n$\n6,717\n \nStock compensation\n2,677\n \n2,097\n \nOther\n533\n \n760\n \nTotal deferred tax assets\n9,089\n \n9,574\n \nProperty, plant and equipment\n20,723\n \n17,532\n \nReal estate and royalty interests\n33,581\n \n33,215\n \nPension plan asset\n1,901\n \n767\n \nOther, net\n285\n \n425\n \nTotal deferred tax liabilities\n56,490\n \n51,939\n \nDeferred taxes payable\n$\n(\n47,401\n)\n$\n(\n42,365\n)\nTPL is subject to taxation in the United States, Texas and New Mexico.  TPL is no longer subject to U.S. Federal income tax examination by tax authorities for tax years before 2021.\n \n12.    \nEarnings Per Share\nBasic earnings per share (“EPS”) is computed based on the weighted average number of shares outstanding during the period.  Diluted EPS is computed based upon the weighted average number of shares outstanding during the period plus unvested RSAs and other nonvested awards granted pursuant to our incentive and equity compensation plans.  The computation of diluted EPS reflects the potential dilution that could occur if all outstanding awards under the incentive and equity compensation plans were converted into shares of Common Stock or resulted in the issuance of shares of Common Stock that would then share in the earnings of the Company.  The number of dilutive securities is computed using the treasury stock method.  \nThe following table sets forth the computation of EPS for the years ended December 31, 2024, 2023 and 2022 (in thousands, except number of shares and per share data): \nYears Ended December 31,\n \n2024\n2023\n2022\nNet income\n$\n453,960\n \n$\n405,645\n \n$\n446,362\n \nBasic earnings per share:\nWeighted average shares outstanding for basic earnings per share\n22,986,197\n \n23,044,305\n \n23,165,871\n \nBasic earnings per share\n$\n19.75\n \n$\n17.60\n \n$\n19.27\n \nDiluted earnings per share:\nWeighted average shares outstanding for basic earnings per share\n22,986,197\n \n23,044,305\n \n23,165,871\n \nEffect of dilutive securities:\nStock-based incentive plan\n33,554\n \n15,540\n \n14,556\n \nWeighted average shares outstanding for diluted earnings per share\n23,019,751\n \n23,059,845\n \n23,180,427\n \nDiluted earnings per share\n$\n19.72\n \n$\n17.59\n \n$\n19.26\n \nRSAs are included in the number of shares of Common Stock issued and outstanding, but omitted from the basic earnings per share calculation until such time as the RSAs vest.  Certain stock awards granted are not included in the dilutive securities in the table above as they are anti-dilutive for the year ended December 31, 2023.  There were \nno\n dilutive securities for the year ended December 31, 2024.\nF-26\nTable of Contents\n13.    \nCommitments and Contingencies\nLitigation  \nManagement is not aware of any legal, environmental or other commitments or contingencies that would have a material effect on the Company’s financial condition, results of operations or liquidity as of December 31, 2024, other than as described below.\nPrior to January 1, 2022, ad valorem taxes with respect to our historical royalty interests were paid directly by third parties pursuant to an existing arrangement.  After the completion of our Corporate Reorganization, we received notice from a third party that it no longer intended to pay the ad valorem taxes related to such historical royalty interests.  In order to protect the historical royalty interests from any potential tax liens for non-payment of ad valorem taxes, we have accrued and/or paid such ad valorem taxes since January 1, 2022.  While we intend to seek reimbursement from the third party for such taxes, we are unable to estimate the amount and/or likelihood of such reimbursement, and accordingly, no loss recovery receivable has been recorded as of December 31, 2024.\nLease Commitments \nAs of December 31, 2024 and 2023, we have recorded right-of-use assets of $\n1.2\n million and $\n1.9\n million, respectively, and lease liabilities for $\n1.3\n million and $\n2.0\n million, respectively, primarily related to operating leases in connection with our administrative offices located in Dallas and Midland, Texas.  The office lease agreements require monthly rent payments and expire in December 2025 and July 2027, respectively.  Operating lease expense is recognized on a straight-line basis over the lease term.  Operating lease cost was $\n0.9\n million and $\n0.8\n million for the years ended December 31, 2024 and 2023, respectively. \nWhile certain of our lease agreements contain covenants governing the use of the leased assets or require us to maintain certain levels of insurance, none of our lease agreements include material financial covenants or limitations.  There are no residual value guarantees in our lease commitments.  The weighted-average lease term for our operating lease liabilities is approximately \n23\n months.  The weighted average discount rate of our operating leases is \n4.7\n%.\nFuture minimum lease payments were as follows as of December 31, 2024 (in thousands): \nYear ending December 31,\nAmount\n2025\n$\n826\n \n2026\n316\n \n2027\n187\n \nTotal lease payments\n1,329\n \nLess: imputed interest\n(\n79\n)\nTotal operating lease liabilities\n$\n1,250\n \n \nRent expense for these lease agreements amounted to approximately $\n0.8\n million for each of the years ended December 31, 2024, 2023 and  2022.\n14.    \nEquity\n \nIncrease in Authorized Shares of Common Stock\nAs of December 31, 2023, the Company had authorized shares consisting of \n1,000,000\n shares of preferred stock, par value $\n0.01\n per share (“Preferred Stock”), and \n7,756,156\n shares of Common Stock, par value $\n0.01\n per share.  On March 1, 2024, we filed a Certificate of Amendment to the Second Amended and Restated Certificate of Incorporation of the Company (the “Certificate of Incorporation”) with the Secretary of State of the State of Delaware, pursuant to which the Certificate of Incorporation was amended and restated to provide that the total number of authorized shares of capital stock of the Company be increased to \n47,536,936\n shares of capital stock, consisting of \n1,000,000\n shares of Preferred Stock and \n46,536,936\n shares of Common Stock.\nF-27\nTable of Contents\nCommon Stock Split\nOn March 26, 2024, we effected a \nthree\n-for-one stock split in the form of a stock dividend of \ntwo\n additional shares of Common Stock for every share of Common Stock outstanding to stockholders of record as of March 18, 2024.  All share, RSA, RSU, PSU and per share information has been retroactively adjusted to reflect the stock split.  The shares of Common Stock retained a par value of $\n0.01\n per share.  Accordingly, an amount equal to the par value of the increased shares resulting from the stock split was reclassified from “Additional paid-in capital” to “Common Stock.”  \nDividends  \nFor the year ended December 31, 2024, we paid total regular cash dividends of $\n5.11\n per share of Common Stock and special dividends of $\n10.00\n per share of Common Stock. For the year ended December 31, 2023, we paid total regular cash dividends of $\n4.33\n per share of Common Stock.\nStock Repurchase Program \nOn November 1, 2022, our Board approved a stock repurchase program, which became effective January 1, 2023, to purchase up to an aggregate of $\n250.0\n million of our outstanding Common Stock.  The Company opportunistically repurchases stock under the stock repurchase program with funds generated by cash from operations.  This stock repurchase program may be suspended from time to time, modified, extended or discontinued by the Board at any time.  Purchases under the stock repurchase program may be made through a combination of open market repurchases in compliance with Rule 10b-18 promulgated under the Securities Exchange Act of 1934, as amended, privately negotiated transactions, and/or other transactions at the Company’s discretion, including under a Rule 10b5-1 trading plan implemented by the Company, and are subject to market conditions, applicable legal requirements and other factors.\nFor the year ended December 31, 2024 and 2023, we repurchased shares of our Common Stock in amounts totaling $\n29.2\n million and $\n42.4\n million, respectively.\n \n15.    \nBusiness Segment Reporting\n \nDuring the periods presented, we reported our financial performance based on the following reportable segments: Land and Resource Management and Water Services and Operations.  We eliminate inter-segment revenues and expenses, if any, upon consolidation.  There were no inter-segment revenues for the years ended December 31, 2024, 2023 and 2022.\nThe Land and Resource Management segment encompasses the business of managing our approximately \n873,000\n surface acres of land and our approximately \n207,000\n NRA of oil and gas royalty interests, principally concentrated in the Permian Basin.  The revenue streams of this segment consist primarily of royalties from oil and gas, revenues from easements and commercial leases, and land and material sales.\nThe Water Services and Operations segment encompasses the business of providing a full-service water offering to operators in the Permian Basin.  The revenue streams of this segment primarily consist of revenue generated from sales of sourced and treated water as well as revenue from produced water royalties\n.\nF-28\nTable of Contents\nThe following table presents segment financial results for Land and Resource Management (“LRM”) and Water Service and Operations (“WSO”) and the reconciliation to consolidated (“Cons”) financial results for the years ended December 31, 2024, 2023 and 2022 (in thousands):\n \nYears Ended December 31,\n \n2024\n2023\n2022\nLRM\nWSO\nCons\nLRM\nWSO\nCons\nLRM\nWSO\nCons\nRevenues:\nOil and gas royalties\n$\n373,331\n \n$\n—\n \n$\n373,331\n \n$\n357,394\n \n$\n—\n \n$\n357,394\n \n$\n452,434\n \n$\n—\n \n$\n452,434\n \nWater sales\n—\n \n150,724\n \n150,724\n \n—\n \n112,203\n \n112,203\n \n—\n \n84,725\n \n84,725\n \nProduced water royalties\n—\n \n104,123\n \n104,123\n \n—\n \n84,260\n \n84,260\n \n—\n \n72,234\n \n72,234\n \nEasements and other surface-related income\n63,074\n \n10,183\n \n73,257\n \n67,905\n \n3,027\n \n70,932\n \n44,860\n \n3,488\n \n48,348\n \nLand sales\n4,388\n \n—\n \n4,388\n \n6,806\n \n—\n \n6,806\n \n9,681\n \n—\n \n9,681\n \nTotal revenues\n440,793\n \n265,030\n \n705,823\n \n432,105\n \n199,490\n \n631,595\n \n506,975\n \n160,447\n \n667,422\n \nExpenses:\nSalaries and related employee expenses\n27,493\n \n26,128\n \n53,621\n \n21,945\n \n21,439\n \n43,384\n \n22,054\n \n19,348\n \n41,402\n \nWater service-related expenses\n—\n \n46,124\n \n46,124\n \n—\n \n33,566\n \n33,566\n \n—\n \n17,463\n \n17,463\n \nGeneral and administrative expenses\n25,531\n \n8,952\n \n34,483\n \n39,078\n \n7,372\n \n46,450\n \n14,978\n \n7,042\n \n22,020\n \nDepreciation, depletion and amortization\n10,968\n \n14,194\n \n25,162\n \n3,073\n \n11,684\n \n14,757\n \n2,234\n \n13,142\n \n15,376\n \nAd valorem and other taxes\n7,257\n \n38\n \n7,295\n \n7,382\n \n3\n \n7,385\n \n8,848\n \n6\n \n8,854\n \nTotal operating expenses\n71,249\n \n95,436\n \n166,685\n \n71,478\n \n74,064\n \n145,542\n \n48,114\n \n57,001\n \n105,115\n \nOperating income\n369,544\n \n169,594\n \n539,138\n \n360,627\n \n125,426\n \n486,053\n \n458,861\n \n103,446\n \n562,307\n \nOther income, net\n31,707\n \n7,976\n \n39,683\n \n30,384\n \n1,124\n \n31,508\n \n6,491\n \n57\n \n6,548\n \nIncome before income taxes\n401,251\n \n177,570\n \n578,821\n \n391,011\n \n126,550\n \n517,561\n \n465,352\n \n103,503\n \n568,855\n \nIncome tax expense\n86,350\n \n38,511\n \n124,861\n \n84,305\n \n27,611\n \n111,916\n \n100,311\n \n22,182\n \n122,493\n \nNet income\n$\n314,901\n \n$\n139,059\n \n$\n453,960\n \n$\n306,706\n \n$\n98,939\n \n$\n405,645\n \n$\n365,041\n \n$\n81,321\n \n$\n446,362\n \nInterest income by segment is included in other income, net in the table above.\nThe following tables present capital expenditures, total assets, and property, plant and equipment, net by segment (in thousands):\nYears Ended December 31,\n2024\n2023\n2022\nCapital Expenditures:\nLand and resource management\n$\n279\n \n$\n241\n \n$\n393\n \nWater services and operations\n29,144\n \n15,190\n \n18,574\n \nTotal capital expenditures\n$\n29,423\n \n$\n15,431\n \n$\n18,967\n \nF-29\nTable of Contents\n \nDecember 31, 2024\nDecember 31, 2023\nAssets:\n \n \nLand and resource management\n$\n1,024,188\n \n$\n975,136\n \nWater services and operations\n223,832\n \n181,262\n \nTotal consolidated assets\n$\n1,248,020\n \n$\n1,156,398\n \nProperty, plant and equipment, net:\n \n \nLand and resource management\n$\n4,805\n \n$\n5,322\n \nWater services and operations\n117,773\n \n84,265\n \nTotal consolidated property, plant and equipment, net\n$\n122,578\n \n$\n89,587\n \n \n16.    \nSubsequent Events\n \nWe evaluated events that occurred after the balance sheet date through the date these financial statements were issued, and the following events that met recognition or disclosure criteria were identified:\nDividends Declared \nOn February 18, 2025, our Board declared a quarterly cash dividend of $\n1.60\n per share, payable on March 17, 2025 to stockholders of record at the close of business on March 3, 2025.\n17.    \nSupplemental Oil and Gas Reserve Information (Unaudited)\nThe Company’s oil and natural gas reserves are attributable solely to properties within the United States.\n \nOur Share of Oil and Gas Produced\nWe measure our share of oil and gas produced in barrels of oil equivalent (“Boe”).  One Boe equals one barrel of crude oil, condensate, NGLs (natural gas liquids) or approximately 6,000 cubic feet of gas.  For the years ended December 31, 2024, 2023 and 2022, our share of oil and gas produced was approximately \n26.8\n, \n23.5\n and \n21.3\n thousand Boe per day, respectively.\n \nCapitalized Oil and Natural Gas Costs \nAggregate capitalized costs related to oil and natural gas production activities with applicable accumulated depletion are as follows (in thousands):\nDecember 31, 2024\nDecember 31, 2023\nOil, natural gas and NGL interests\nProved \n$\n150,984\n \n$\n29,222\n \nUnproved \n296,087\n \n22,272\n \nTotal oil, natural gas and NGL interests\n447,071\n \n51,494\n \nAccumulated depletion\n(\n14,670\n)\n(\n4,885\n)\nNet oil, natural gas and NGL interests capitalized\n$\n432,401\n \n$\n46,609\n \nThe Company owns approximately \n207,000\n NRA as of December 31, 2024.  Of our total NRA, approximately \n191,000\n was acquired in 1888 and was recorded with no value.  The remaining approximately \n16,000\n NRA have been acquired over recent years and are included in royalty interests acquired on the consolidated balance sheet.  See additional discussion in Note 4, “Oil and Gas Royalty Interests.”\nF-30\nTable of Contents\nCosts Incurred in Oil and Natural Gas Activities\nCosts incurred in oil, natural gas and NGL acquisition and development activities are as follows (in thousands):\nYears Ended December 31,\n2024\n2023\n2022\nAcquisition costs\nProved\n$\n121,018\n \n$\n3,566\n \n$\n1,258\n \nUnproved \n274,559\n \n—\n \n404\n \nTotal\n$\n395,577\n \n$\n3,566\n \n$\n1,662\n \nResults of Operations from Oil and Natural Gas Producing Activities\nThe following table sets forth the revenues and expenses related to the production and sale of oil and natural gas  (in thousands).  It does not include any general and administrative costs and, therefore, is not necessarily indicative of the net operating results of the Company oil and natural gas operations.\nYears Ended December 31,\n2024\n2023\n2022\nOil and natural gas revenues\n (1)\n$\n373,331\n \n$\n357,394\n \n$\n452,434\n \nAd valorem taxes\n(\n6,952\n)\n(\n7,200\n)\n(\n8,734\n)\nDepletion expense\n(\n9,785\n)\n(\n1,982\n)\n(\n1,027\n)\nIncome tax expense\n(\n76,917\n)\n(\n75,284\n)\n(\n95,307\n)\nResults of operations from oil and natural gas\n$\n279,677\n \n$\n272,928\n \n$\n347,366\n \n(1)\nOil and natural gas revenues are reported net of production taxes.\nF-31\nTable of Contents\nAnalysis of Changes in Oil and Natural Gas PDP Reserves\nProved developed producing (“PDP”) reserves are proved reserves that can be expected to be recovered through existing wells with existing equipment and operating methods, or in which the cost of the required equipment is relatively minor compared to the cost of a new well.  The Company’s oil and gas properties are located in the Permian Basin.\nThe PDP reserve estimates and their associated future net cash flows were prepared by Ryder Scott Company, L.P. (“Ryder Scott”), an independent third-party petroleum engineering firm, as of December 31, 2024.  The reserve report covers only PDP reserves and does not include undeveloped minerals or royalties.  The oil and natural gas PDP reserve estimates represent the Company’s net ownership interest in its proved properties and were estimated in accordance with guidelines established by the SEC.  Since reserve studies were not completed in prior periods and the comparative information herein is based on the reserve report as of December 31, 2024, the Company rolled volumes backward from 2024 to 2021 without revisions in prior estimates for these time frames.\nThe following table presents changes in estimated PDP reserves and was prepared in accordance with the rules and regulations of the SEC:\nCrude Oil and Condensate\n(MBbls)\n(1)\nNatural Gas (MMcf)\n(1)\nNatural Gas Liquids (MBbls)\n(1)\nTotal (MBoe)\n(1)\nNet PDP reserves at January 1, 2022\n14,190\n \n88,579\n \n13,579\n \n42,533\n \nExtensions and discoveries\n5,427\n \n24,441\n \n3,949\n \n13,449\n \nAcquisition of reserves\n17\n \n62\n \n9\n \n37\n \nProduction\n(\n3,401\n)\n(\n13,086\n)\n(\n2,208\n)\n(\n7,791\n)\nNet PDP reserves at December 31, 2022\n16,233\n \n99,996\n \n15,329\n \n48,228\n \nExtensions and discoveries\n6,858\n \n31,196\n \n5,010\n \n17,067\n \nAcquisition of reserves\n89\n \n664\n \n102\n \n302\n \nProduction\n(\n3,701\n)\n(\n14,528\n)\n(\n2,453\n)\n(\n8,575\n)\nNet PDP reserves at December 31, 2023\n19,479\n \n117,328\n \n17,988\n \n57,022\n \nExtensions and discoveries\n5,587\n \n23,483\n \n3,824\n \n13,324\n \nAcquisition of reserves\n2,378\n \n13,317\n \n2,042\n \n6,639\n \nProduction\n(\n4,118\n)\n(\n17,074\n)\n(\n2,841\n)\n(\n9,804\n)\nNet PDP reserves at December 31, 2024\n23,326\n \n137,054\n \n21,013\n \n67,181\n \nNet PDP reserves\nDecember 31, 2022\n16,233\n \n99,996\n \n15,329\n \n48,228\n \nDecember 31, 2023\n19,479\n \n117,328\n \n17,988\n \n57,022\n \nDecember 31, 2024\n23,326\n \n137,054\n \n21,013\n \n67,181\n \n(1)\nCommonly used definitions in the oil and gas industry not previously defined: MBbls represents one thousand barrels of crude oil, condensate or NGLs.  MMcf represents one million cubic feet of natural gas.  MBoe represents one thousand Boe.\nF-32\nTable of Contents\nStandardized Measure of Oil and Gas\nThe standardized measure of discounted future net cash flows before income taxes related to the oil and natural gas PDP reserves of the interests is as follows (in thousands):\nYears Ended December 31,\n2024\n2023\n2022\nFuture cash inflows\n$\n2,566,234\n \n$\n2,150,816\n \n$\n2,662,176\n \nFuture production costs\n(\n191,879\n)\n(\n157,805\n)\n(\n205,483\n)\nFuture income taxes\n(\n423,633\n)\n(\n422,629\n)\n(\n528,926\n)\nFuture net cash flows\n1,950,722\n \n1,570,382\n \n1,927,767\n \nLess: 10% annual discount\n(\n942,086\n)\n(\n748,864\n)\n(\n932,146\n)\nStandard measure of discounted future net cash flows\n$\n1,008,636\n \n$\n821,518\n \n$\n995,621\n \nReserve estimates and future cash flows are based on the average market prices for sales of oil and natural gas adjusted for basis differentials, on the first calendar day of each month during the year.  The average prices used for 2024, 2023 and 2022 were $\n76.32\n, $\n78.21\n and $\n94.14\n per barrel for crude oil and $\n2.13\n, $\n2.64\n and $\n6.36\n per Mcf for natural gas, respectively.  \nFuture production costs are computed primarily by the Company’s petroleum engineers by estimating the expenditures to be incurred in producing the oil and gas PDP reserves at the end of the year, based on year-end costs and assuming continuation of existing economic conditions.  A discount factor of 10% was used to reflect the timing of future net cash flows.  The standardized measure of discounted future net cash flows is not intended to represent the replacement cost or fair value of the properties.  An estimate of fair value would also take into account, among other things, the recovery of reserves not presently classified as proved, anticipated future changes in prices and costs, and a discount factor more representative of the time value of money and the risks inherent in oil and natural gas reserve estimates.  \nChanges in Standardized Measure of Oil and Gas\nChanges in the standardized measure of discounted future net cash flows before income taxes related to the oil and natural gas PDP reserves of the interests are as follows (in thousands):\nYears Ended December 31,\n2024\n2023\n2022\nStandardized measure - beginning of year\n$\n821,518\n \n$\n995,621\n \n$\n616,919\n \nSales, net of production costs\n(\n366,379\n)\n(\n350,194\n)\n(\n443,700\n)\nNet changes of prices and production costs related to future production\n10,003\n \n(\n426,381\n)\n401,411\n \nExtensions and discoveries\n330,825\n \n441,343\n \n486,327\n \nAcquisition of reserves\n125,918\n \n5,827\n \n1,259\n \nNet change in income taxes\n1,424\n \n51,996\n \n(\n103,905\n)\nAccretion of discount\n104,269\n \n126,879\n \n78,618\n \nChanges in timing and other\n(\n18,942\n)\n(\n23,573\n)\n(\n41,308\n)\nStandardized measure - end of year\n$\n1,008,636\n \n$\n821,518\n \n$\n995,621\n \n*****\nF-33"
  }
}