{
  "ticker": "TPR",
  "cik": "0001116132",
  "company_name": "TAPESTRY, INC.",
  "filing_date": "2025-08-14",
  "accession": "0001116132-25-000019",
  "primary_doc": "tpr-20250628.htm",
  "item_sections": {
    "item1": "Item 1. \"Business,\" for further information. \nITEM 3. LEGAL PROCEEDINGS\nSee discussion of legal proceedings in Note 13, \"Commitments and Contingencies,\" in the accompanying consolidated financial statements.\nITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\n29\nPART II\nITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket and Dividend Information\nTapestry, Inc.’s common stock is listed on the New York Stock Exchange and is traded under the symbol “TPR.”\nAs of August 1, 2025, there were 1,765 holders of record of Tapestry’s common stock.\nAny future determination to pay cash dividends will be at the discretion of Tapestry’s Board and will be dependent upon Tapestry’s financial condition, operating results, capital requirements and such other factors as the Board deems relevant.\nPerformance Graph \nThe following graph compares the cumulative total stockholder return (assuming reinvestment of dividends) of the Company's common stock with the cumulative total return of the Standard & Poor's (\"S&P\") 500 Stock Index and the S&P 1500 Apparel, Accessories & Luxury Goods Index over the five-fiscal-year period ending June 28, 2025, the last day of Tapestry’s most recent fiscal year. The graph assumes that $100 was invested on June 27, 2020 at the per share closing price in each of Tapestry’s common stock, the S&P 500 Stock Index and the S&P 1500 Apparel, Accessories & Luxury Goods Index, and that all dividends were reinvested. The stock performance shown in the graph is not intended to forecast or be indicative of future performance.\nFiscal 2020\nFiscal 2021\nFiscal 2022\nFiscal 2023\nFiscal 2024\nFiscal 2025\nTPR\n$100.00\n$339.92\n$251.94\n$360.87\n$374.35\n$779.94\nS&P 1500 Apparel, Accessories & Luxury Goods\n$100.00\n$200.09\n$122.52\n$115.41\n$101.21\n$101.11\nS&P 500\n$100.00\n$146.97\n$131.06\n$155.10\n$193.19\n$221.32\n30\nStock Repurchase Program\nOn May 12, 2022, the Company announced that its Board of Directors (the \"Board\") authorized a common stock repurchase program to repurchase up to $1.50 billion of its outstanding common stock (the \"2022 Share Repurchase Program\"). Purchases of the Company's common stock under this program were executed through open market purchases, including through purchase agreements under Rule 10b5-1. \nOn November 13, 2024, the Board authorized the Company to repurchase up to $2.00 billion of outstanding shares of its common stock (the \"2025 Share Repurchase Program\"). Under the 2025 Share Repurchase Program, the Company may repurchase shares on the open market, in privately negotiated transactions or in other transactions, including accelerated share repurchase programs. On November 21, 2024, the Company entered into accelerated share repurchase agreements (the “ASR Agreements”) with Bank of America, N.A. and Morgan Stanley & Co. LLC (the “Dealers”) to repurchase an aggregate of up to $2.00 billion of the Company’s shares of common stock. Under the ASR Agreements, the Company paid $2.00 billion to the Dealers and received an initial delivery of 28,363,766 shares of the Company's common stock on November 26, 2024. The total number of shares purchased by the Company pursuant to the ASR Agreements will be based on the volume-weighted average price (\"VWAP\") of the Company's common stock on specified dates during the term of each of the ASR Agreements, less a discount, and subject to adjustments pursuant to the terms and conditions of the ASR Agreements. The difference between the initially delivered shares and the total number of shares purchased will be settled in four tranches, no later than the first quarter of fiscal 2026. During the quarter ended March 29, 2025, the Company cash settled $3.0 million related to 43,094 shares of common stock owed for the settlement of one tranche as a result of the increase in the VWAP of the Company's common stock. During the quarter ended June 28, 2025, the Company cash settled $3.6 million related to 49,442 shares of common stock of an additional tranche. \nAs of June 28, 2025, the Company had $800.0 million of additional shares available to be repurchased as authorized under the 2022 Share Repurchase Program and no remaining availability to repurchase shares under the 2025 Share Repurchase Program. There were no shares repurchased during the three months ended June 28, 2025 under the 2022 Share Repurchase Program and the 2025 Share Repurchase Program.\nITEM 6. RESERVED\n31\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of the Company's financial condition and results of operations should be read together with the Company’s consolidated financial statements and notes to those financial statements included elsewhere in this document. When used herein, the terms “the Company,” \"Tapestry,\" “we,” “us” and “our” refer to Tapestry, Inc., including consolidated subsidiaries. References to \"Coach,\" \"Stuart Weitzman,\" \"Kate Spade\" or \"kate spade new york\" refer only to the referenced brand.\nINTRODUCTION\nManagement’s discussion and analysis of financial condition and results of operations (“MD&A”) is provided as a supplement to the accompanying consolidated financial statements and notes thereto to help provide an understanding of our results of operations, financial condition and liquidity. MD&A is organized as follows:\n•\nOverview.\n This section provides a general description of the business and brands as well as the Company’s growth strategy.\n•\nGlobal Economic Conditions and Industry Trends.\n This section includes a discussion on global economic conditions and industry trends that affect comparability that are important in understanding results of operations and financial conditions, and in anticipating future trends.\n•\nResults of Operations\n.\n An analysis of our results of operations in fiscal \n2025\n compared to fiscal \n2024\n.\n•\nNon-GAAP Measures.\n This section includes non-GAAP measures that are useful to investors and others in evaluating the Company’s ongoing operating and financial results in a manner that is consistent with management's evaluation of business performance and understanding how such results compare with the Company’s historical performance.\n•\nFinancial Condition.\n This section includes a discussion on liquidity and capital resources including an analysis of changes in cash flow as well as working capital and capital expenditures.\n•\nCritical Accounting Policies and Estimates. \nThis section includes any critical accounting policies or estimates that impact the Company. \nOVERVIEW\nFiscal 2025, fiscal 2024 and fiscal 2023 were 52-week periods.\nTapestry, Inc. is a house of iconic accessories and lifestyle brands. Our global house of brands unites the magic of Coach and kate spade new york. Each of our brands are unique and independent, while sharing a commitment to innovation and authenticity defined by distinctive products and differentiated customer experiences across channels and geographies. We use our collective strengths to move our customers and empower our communities, to make the fashion industry more sustainable, and to harness the power of an inclusive culture. Individually, our brands are iconic. Together, we can stretch what’s possible.\nThe Company has three reportable segments:\n•\nCoach - \nIncludes global sales of primarily Coach brand products to customers through our DTC, wholesale and licensing businesses.\n•\nKate Spade \n- Includes global sales primarily of kate spade new york brand products to customers through our DTC, wholesale and licensing businesses.\n•\nStuart Weitzman -\n Includes global sales of Stuart Weitzman brand products primarily through our DTC, wholesale and licensing businesses. \n    Each of our brands are unique and independent, while sharing a commitment to innovation and authenticity defined by distinctive products and differentiated customer experiences across business channels and geographies. Our success does not depend solely on the performance of a single business channel, geographic area or brand.\n32\nStuart Weitzman Business Divestiture\nOn February 16, 2025, the Company entered into a Purchase Agreement with Caleres to sell the Stuart Weitzman Business (as defined below). The Purchaser acquired certain assets and liabilities of the Company's global business of designing, manufacturing, promotion, marketing, production, distribution, sales and licensing of Stuart Weitzman branded products (the \"Stuart Weitzman Business\") for total cash consideration of $105.0 million (the \"Purchase Price\"), subject to customary adjustments for cash, indebtedness, net working capital and transaction expenses. The sale was completed on August 4, 2025 (the \"Stuart Weitzman Business Divestiture\"). Refer to Note 5, \"Acquisitions and Divestitures,\" and Note 21, \"Subsequent Events,\" for further information. \nCapri Holdings Limited Acquisition\nOn August 10, 2023, the Company entered into the Merger Agreement by and among the Company, Sunrise Merger Sub, Inc., a direct wholly owned subsidiary of Tapestry, and Capri. In order to finance the Capri Acquisition, on November 27, 2023, the Company issued $4.50 billion of U.S. dollar-denominated senior unsecured notes (the \"Capri Acquisition USD Senior Notes\") and €1.50 billion of Euro-denominated senior unsecured notes (the \"Capri Acquisition EUR Senior Notes\" and, together with the Capri Acquisition USD Senior Notes, the \"Capri Acquisition Senior Notes\") which, together with the $1.40 billion of delayed draw unsecured term loan facilities (the \"Capri Acquisition Term Loan Facilities\") executed on August 30, 2023, complete the expected financing for the Capri Acquisition. On April 22, 2024, the FTC filed a complaint against the Company and Capri in the United States District Court for the Southern District of New York seeking to enjoin the consummation of the Capri Acquisition, and on October 24, 2024, the Court issued its Opinion and Order granting the FTC's request for a preliminary injunction of the Merger, pending an administrative trial on the merits which was scheduled to begin on December 9, 2024. On October 28, 2024, the Company and Capri filed a Notice of Appeal with respect to the October 24, 2024 Opinion and Order. On November 6, 2024, the United States Court of Appeals for the Second Circuit entered an order setting an expedited briefing schedule for the appeal of the decision of the United States District Court of the Southern District of New York granting the preliminary injunction of the merger. On November 13, 2024, the Parties entered into a Termination Agreement (the “Termination Agreement”), pursuant to which the Parties agreed to terminate the Merger Agreement, including all schedules and exhibits thereto and all ancillary agreements contemplated thereby or entered pursuant thereto (the “Termination Date”), effective immediately. Pursuant to the Termination Agreement, the Company agreed to reimburse Capri for its expenses in an amount equal to $45.1 million in cash on November 14, 2024. The Parties also agreed to release each other from claims, demands, damages, actions, causes of action and liability relating to or arising out of the Merger Agreement and the transactions contemplated therein or thereby. Following termination of the Merger Agreement, the Parties and the FTC filed a stipulation withdrawing the appeal to the United States Court of Appeals for the Second Circuit on November 19, 2024 and the Second Circuit dismissed the appeal on November 20, 2024. The Parties and the FTC also filed a Joint Motion to dismiss the complaint in the administrative trial on November 15, 2024 and the FTC dismissed the complaint on December 4, 2024. On November 25, 2024, due to the termination of the Merger Agreement and pursuant to the terms of the indenture governing the Capri Acquisition Senior Notes, as supplemented, the Company redeemed all outstanding Capri Acquisition Senior Notes at a redemption price of 101% of the aggregate principal amount of such Capri Acquisition Senior Notes, plus accrued and unpaid interest to, but excluding, the date of redemption. In addition, the Capri Acquisition Term Loan Facilities were terminated concurrently with the execution of the Termination Agreement on November 13, 2024. Refer to Note 5, \"Acquisitions and Divestitures\" and Note 12, \"Debt\" for further information.\n2025 Growth Strategy\nIn the first quarter of fiscal 2023, the Company introduced the 2025 growth strategy, \nfuture\nspeed, designed to amplify and extend the competitive advantages of its brands, with a focus on four strategic priorities:\n•\nBuilding Lasting Customer Relationships: The Company's brands aim to leverage Tapestry’s transformed business model to drive customer lifetime value through a combination of increased customer acquisition, retention and reactivation.\n•\nFueling Fashion Innovation & Product Excellence: The Company aims to drive sustained growth in core handbags and small leathergoods, while accelerating gains in footwear and lifestyle products.\n•\nDelivering Compelling Omni-Channel Experiences: The Company aims to extend its omni-channel leadership to meet the customer wherever they shop, delivering growth online and in stores.\n•\nPowering Global Growth: The Company aims to support balanced growth across regions, prioritizing North America and China, its largest markets, while capitalizing on opportunities in under-penetrated geographies such as Southeast Asia and Europe.\n33\nThe Company's next investor day will be held in September 2025, during which the Company will present its latest long-term growth strategy.\nGLOBAL ECONOMIC CONDITIONS AND INDUSTRY TRENDS\nThe environment in which we operate is subject to a number of different factors driving global consumer spending. Consumer preferences, macroeconomic conditions, foreign currency fluctuations and geopolitical events continue to impact overall levels of consumer travel and spending on discretionary items, with inconsistent patterns across business channels and geographies.\nWe will continue to monitor the below trends and evaluate and adjust our operating strategies and cost management opportunities to mitigate the related impact on our results of operations, while remaining focused on the long-term growth of our business and protecting the value of our brands.\nFor a detailed discussion of significant risk factors that have the potential to cause our actual results to differ materially from our expectations, see Part I,",
    "item1a": "Item 1A. \"Risk Factors\".\nCurrent Macroeconomic Conditions and Outlook\nCurrency volatility, geopolitical instability and political uncertainty, such as the impact of policies implemented and that may be implemented by the U.S. Presidential Administration, including, but not limited to, changes to trade agreements, tax legislation or duty rates may also contribute to a worsening of the macroeconomic environment or adversely impact our business. \nDuring the second half of fiscal 2025, the U.S. Government announced tariffs on imports from select countries. The majority of the Company's products sold in the U.S. are imported from countries in which these tariffs were announced. As a result of the Company's actions to accelerate inventory purchases and based on current trends of the business, we did not experience a meaningful negative impact to our results of operations in fiscal 2025.\nAt the time of this report, the Company estimates a projected tariff and trade policy impact of approximately 230 basis points to operating margin in fiscal 2026 after consideration of mitigating actions. In addition, there could be further impact to our results of operations in fiscal 2026 and beyond depending on the outcome of trade negotiations. The Company is prepared to take actions to mitigate this negative impact as changes in trade relations, economic and monetary policies are made clear. \nThe macroeconomic environment remained challenging and volatile during fiscal 2025. Several organizations that monitor the world’s economy, including the International Monetary Fund, continue to forecast growth in the global economy. Some of these organizations have recently revised the forecast slightly upwards since the third quarter of fiscal 2025. The forecast is below the historical growth average and is reflective of the current volatile environment, including escalation of trade tensions, tighter monetary and fiscal policies which have continued to moderate inflation, financial market volatility and the negative economic impacts of geopolitical instability in certain regions of the world.\nIn fiscal 2025, the U.S. Dollar has continued to fluctuate as compared to foreign currencies in regions where we conduct our business. During fiscal 2025, this trend has resulted in impacts to our business including, but not limited to, decreased Net sales of $13.4 million, no impact to gross margin and approximately 20 basis point negative impact to operating margin.\nIn response to the current environment, the Company is closely monitoring changes and continues to take strategic actions considering near-term exigencies and remains committed to maintaining the health of the brands and business.\nFiscal 2025 Impairment\nDuring the fourth quarter of fiscal 2025, the Company performed its annual goodwill and indefinite-lived intangible assets impairment analysis. The assessment concluded that the fair values of the Kate Spade reporting unit and indefinite-lived brand intangible asset did not exceed their respective carrying values due to a reduction in both current and future expected cash flows, which includes an estimated impact of cost increases due to changes in tariff and trade policies. As a result, the Company recorded $244.1 million of impairment charges to goodwill for the Kate Spade reporting unit and $610.7 million of impairment charges to indefinite-lived brand intangible assets during the fourth quarter of fiscal 2025. Refer to \"Critical Accounting Policies and Estimates,\" herein, for further information.\nTax Legislation\nOn August 16, 2022, the Inflation Reduction Act of 2022 was signed into law, with tax provisions primarily focused on implementing a 15% corporate alternative minimum tax (“CAMT”) on global adjusted financial statement income and a 1% excise tax on share repurchases. The CAMT was effective at the beginning of fiscal 2024 and did not have a material impact on the Company’s effective tax rate.\n34\nOn December 12, 2022, the E.U. member states also reached an agreement to implement the Organization for Economic Co-operation and Development’s (“OECD”) reform of international taxation known as Global Anti-Base Erosion Rules (“GloBE”), which broadly mirrors the Inflation Reduction Act by imposing a 15% global minimum tax on multinational companies, which was effective on January 1, 2025. Based on the countries in which we do business, these changes did not have a material impact in fiscal 2025. Other countries are also implementing similar legislation with effective dates starting in fiscal 2026, known as Qualifying Domestic Minimum Top-Up Tax (\"QDMTT\"). On June 26, 2025, the U.S. Treasury reached an agreement with the other G7 countries regarding the application of GloBE rules to U.S. parented multinational enterprises (\"U.S. MNEs\"). Most notably, the agreement includes a full exclusion for U.S. MNEs from the Undertaxed Profits Rule and Income Inclusion Rule, which are two of the three taxing mechanisms under GloBE. Given that the third mechanism, QDMTT is still in force, it is unclear what impact if any this agreement will have on the Company. Unless U.S. MNEs are likewise excluded from QDMTT, the Company believes QDMTT would have a negative impact on its effective tax rate in fiscal 2026 and beyond.\nOn July 4, 2025, the One Big Beautiful Bill Act (\"OBBBA\") was enacted. Key income tax-related provisions of the OBBBA include the repeal of mandatory capitalization of research and development expenditures (reinstating full expensing beginning January 2025), permanent extension of 100% bonus depreciation, and revisions to international tax regimes that more closely align with the original application of Tax Cut Jobs Act of 2017. The Company is evaluating the financial implications of the OBBBA and will begin reflecting its effects in the first quarter of fiscal 2026. The Company believes this legislation will not have a material impact on its financial statements but will continue to evaluate as guidance becomes available.\n35\nRESULTS OF OPERATIONS\nFISCAL 2025 COMPARED TO FISCAL 2024 \nThe following table summarizes results of operations for fiscal 2025 compared to fiscal 2024. All percentages shown in the tables below and the related discussion that follows have been calculated using unrounded numbers.\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nVariance\n \n(millions, except per share data)\n \nAmount\n% of\nnet sales\nAmount\n% of\nnet sales\nAmount\n%\nNet sales\n$\n7,010.7\n \n100.0\n \n%\n$\n6,671.2 \n100.0 \n%\n$\n339.5 \n5.1 \n%\nGross profit\n5,288.9\n \n75.4\n \n4,889.5 \n73.3 \n399.4 \n8.2 \nSG&A expenses\n4,873.9\n \n69.5\n \n3,749.4 \n56.2 \n1,124.5 \n30.0 \nOperating income (loss)\n415.0\n \n5.9\n \n1,140.1 \n17.1 \n(725.1)\n(63.6)\nLoss on extinguishment of debt\n120.1\n \n1.7\n \n— \n— \n120.1 \nNM\nInterest expense, net\n85.4\n \n1.2\n \n125.0 \n1.9 \n(39.6)\n(31.7)\nOther expense (income)\n(6.6)\n(0.1)\n3.2 \n— \n(9.8)\nNM\nIncome (loss) before provision for income taxes\n216.1\n \n3.1\n \n1,011.9 \n15.2 \n(795.8)\n(78.7)\nProvision for income taxes\n32.9\n \n0.5\n \n195.9 \n2.9 \n(163.0)\n(83.2)\nNet income (loss)\n183.2\n \n2.6\n \n816.0 \n12.2 \n(632.8)\n(77.6)\nNet income (loss) per share:\n \n \nBasic\n$\n0.84\n \n \n$\n3.56 \n \n$\n(2.72)\n(76.3)\nDiluted\n$\n0.82\n \n \n$\n3.50 \n \n$\n(2.68)\n(76.5)\nNM - Not meaningful\n36\nGAAP to Non-GAAP Reconciliation\nThe Company’s reported results are presented in accordance with accounting principles generally accepted in the United States of America (“GAAP”). The reported results during fiscal 2025 and fiscal 2024 reflect certain items which affect the comparability of our results, as noted in the following tables. Refer to \"Non-GAAP Measures\" herein for further discussion on the Non-GAAP measures.\nFiscal 2025 Items\nFiscal Year Ended June 28, 2025\nItems affecting comparability\n \nGAAP Basis\n(As Reported)\nAcquisition and Divestiture Costs\nOrganizational Efficiency Costs\nImpairment\nNon-GAAP Basis\n(Excluding Items)\n(millions, except per share data) \nCoach\n$\n1,875.3\n \n$\n—\n \n$\n(0.8)\n$\n—\n \n$\n1,876.1\n \nKate Spade\n(769.2)\n—\n \n(5.7)\n(854.8)\n91.3\n \nStuart Weitzman\n(15.4)\n(0.6)\n—\n \n—\n \n(14.8)\nCorporate\n(675.7)\n(111.9)\n(10.7)\n—\n \n(553.1)\nOperating income (loss)\n$\n415.0\n \n$\n(112.5)\n$\n(17.2)\n$\n(854.8)\n$\n1,399.5\n \nNet income (loss)\n$\n183.2\n \n$\n(212.0)\n$\n(13.9)\n$\n(725.1)\n$\n1,134.2\n \nNet income (loss) per diluted common share\n$\n0.82\n \n$\n(0.95)\n$\n(0.06)\n$\n(3.27)\n$\n5.10\n \nIn fiscal 2025, the Company incurred charges as follows:\n•\nAcquisition and Divestiture Costs\n - Includes costs related to the terminated Capri Acquisition and the Stuart Weitzman Business Divestiture. These charges include:\n◦\nCapri Acquisition Costs: \nTotal pre-tax charges of $268.4 million primarily related to:\n▪\nLoss on extinguishment of debt -\n $119.4 million primarily related to redemption premiums, as well as unamortized debt issuance costs and discounts, as a result of the redemption of the Capri Acquisition Senior Notes in fiscal 2025 due to the termination of the Capri Acquisition agreement;\n▪\nSG&A expenses -\n $88.8 million primarily related to expense reimbursement payment made to Capri and professional fees recorded;\n▪\nInterest expense, net -\n $60.2 million of financing related charges which primarily includes the net impact of the Capri Acquisition Senior Notes; and\n◦\nStuart Weitzman Business Divestiture Costs\n: Total pre-tax charges of $23.7 million primarily due to the loss on business held for sale, professional fees, share-based compensation expense and store impairment.\n•\nOrganizational Efficiency Costs\n - Total pre-tax charges of $17.2 million primarily related to severance costs and technology costs.\n•\nImpairment\n - Total pre-tax charges of $854.8 million primarily due to impairment charges on the indefinite-lived brand intangible asset and goodwill for Kate Spade. Refer to Note 14, \"Goodwill and Other Intangible Assets\" for further information.\n    These actions taken together negatively impacted operating income by $984.5 million, increased Loss on extinguishment of debt by $119.4 million, increased interest expense by $60.2 million and reduced the provision for income tax by $213.1 million resulting in a net decrease in net income by $951.0 million or $4.28 per diluted share.\n37\nSupplemental Segment Data\nFiscal Year Ended June 28, 2025\nItems affecting comparability\n \nGAAP Basis\n(As Reported)\nAcquisition and Divestiture Costs\nOrganizational Efficiency Costs\nImpairment\nNon-GAAP Basis\n(Excluding Items)\n(millions) \nCoach\n$\n2,497.2\n \n$\n—\n \n$\n0.8\n \n$\n—\n \n$\n2,496.4\n \nKate Spade\n1,567.2\n \n—\n \n5.7\n \n854.8\n \n706.7\n \nStuart Weitzman\n133.8\n \n0.6\n \n—\n \n—\n \n133.2\n \nCorporate\n675.7\n \n111.9\n \n10.7\n \n—\n \n553.1\n \nSG&A expenses\n$\n4,873.9\n \n$\n112.5\n \n$\n17.2\n \n$\n854.8\n \n$\n3,889.4\n \nFiscal 2024 Items\nFiscal Year Ended June 29, 2024\nItems affecting comparability\n \nGAAP Basis\n(As Reported)\nAcquisition Costs\nNon-GAAP Basis\n(Excluding Items)\n(millions, except per share data) \nCoach\n$\n1,651.1 \n$\n— \n$\n1,651.1 \nKate Spade\n132.6 \n— \n132.6 \nStuart Weitzman\n(21.2)\n— \n(21.2)\nCorporate\n(622.4)\n(109.9)\n(512.5)\nOperating income (loss)\n$\n1,140.1 \n$\n(109.9)\n$\n1,250.0 \nNet income (loss)\n$\n816.0 \n$\n(184.2)\n$\n1,000.2 \nNet income (loss) per diluted common share\n$\n3.50 \n$\n(0.79)\n$\n4.29 \nIn fiscal 2024, the Company incurred charges as follows:\n•\nAcquisition Costs\n - Total pre-tax charges of $226.6 million attributable to the Capri Acquisition. These charges include:\n◦\nInterest expense, net\n: $116.7 million of financing related charges, which primarily includes the net impact of the Capri Acquisition Senior Notes, and the financing fees of the unsecured bridge loan facility in an aggregate principal amount of up to $8.00 billion;\n◦\nSG&A expenses\n: $109.9 million primarily related to professional fees recorded within Corporate. \nThese actions taken together negatively impacted Operating income by $109.9 million, increased Interest expense, net by $116.7 million and reduced the Provision for income taxes by $42.4 million, resulting in a net decrease in Net income by $184.2 million, or $0.79 per diluted share.\nSupplemental Segment Data\nFiscal Year Ended June 29, 2024\nItems affecting comparability\n \nGAAP Basis\n(As Reported)\nAcquisition Costs\nNon-GAAP Basis\n(Excluding Items)\n(millions) \nCoach\n$\n2,224.3 \n$\n— \n$\n2,224.3 \nKate Spade\n738.6 \n— \n738.6 \nStuart Weitzman\n164.1 \n— \n164.1 \nCorporate\n622.4 \n109.9 \n512.5 \nSG&A expenses\n$\n3,749.4 \n$\n109.9 \n$\n3,639.5 \n38\nTapestry, Inc. Summary - Fiscal 2025\nCurrency Fluctuation Effects\nThe change in net sales in fiscal 2025 compared to fiscal 2024 has been presented both including and excluding currency fluctuation effects. All percentages shown in the tables below and the discussion that follows have been calculated using unrounded numbers.\nNet Sales\nFiscal Year Ended\nVariance\nJune 28, 2025\nJune 29, 2024\nAmount\n%\nConstant Currency Change\n(millions)\nCoach\n$\n5,598.5\n \n$\n5,095.3 \n$\n503.2 \n9.9 \n%\n10.1 \n%\nKate Spade\n1,197.1\n \n1,334.4 \n(137.3)\n(10.3)\n(10.1)\nStuart Weitzman \n215.1\n \n241.5 \n(26.4)\n(10.9)\n(10.9)\nTapestry\n$\n7,010.7\n \n$\n6,671.2 \n$\n339.5 \n5.1 \n5.3 \nNet sales in fiscal 2025 increased 5.1% or $339.5 million to $7.01 billion. Excluding the impact of foreign currency, net sales increased by 5.3% or $352.9 million.\n•\nCoach Net Sales\n increased 9.9% or $503.2 million to $5.60 billion in fiscal 2025. Excluding the impact of foreign currency, net sales increased 10.1% or $514.5 million. This increase in net sales was primarily due to an increase of $445.0 million in DTC sales as a result of an increase in both e-commerce and store sales, mainly driven by North America, Europe and Greater China. The increase in net sales was also attributed to a $89.4 million increase in wholesale sales, mainly driven by North America and Greater China.\n•\nKate Spade Net Sales\n decreased 10.3% or $137.3 million to $1.20 billion in fiscal 2025. Excluding the impact of foreign currency, net sales decreased 10.1% or $135.2 million. This decrease in net sales was due to a decrease of $148.7 million in DTC sales as a result of lower store and to a lesser extent, e-commerce sales. The decrease in DTC sales was partially offset by an increase of $10.2 million in wholesale sales.\n•\nStuart Weitzman Net Sales\n decreased 10.9% or $26.4 million to $215.1 million in fiscal 2025. Excluding the impact of foreign currency, net sales decreased 10.9% or $26.4 million.\nGross Profit\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nVariance\n(millions)\nAmount\n% of Net Sales\nAmount\n% of Net Sales\nAmount\n%\nCoach\n$\n4,372.5\n \n78.1\n \n%\n$\n3,875.4 \n76.1 \n%\n$\n497.1 \n12.8 \n%\nKate Spade\n798.0\n \n66.7\n \n871.2 \n65.2 \n(73.2)\n(8.4)\nStuart Weitzman \n118.4\n \n55.1\n \n142.9 \n59.2 \n(24.5)\n(17.1)\nTapestry\n$\n5,288.9\n \n75.4\n \n$\n4,889.5 \n73.3 \n$\n399.4 \n8.2 \nGross profit increased 8.2% or $399.4 million to $5.29 billion in fiscal 2025 from $4.89 billion in fiscal 2024. Gross margin in fiscal 2025 increased 210 basis points to 75.4% as compared to 73.3% in fiscal 2024. This increase in Gross margin was primarily attributed to net pricing improvements. \nThe Company includes inbound product-related transportation costs from our service providers within Cost of sales. The Company, similar to some companies, includes certain transportation-related costs due to our distribution network in SG&A expenses rather than in Cost of sales; for this reason, our gross margins may not be comparable to that of entities that include all costs related to their distribution network in Cost of sales.\n39\nSelling, General and Administrative Expenses\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nVariance\n(millions)\nAmount\n% of Net Sales\nAmount\n% of Net Sales\nAmount\n%\nCoach\n$\n2,497.2\n \n44.6\n \n%\n$\n2,224.3 \n43.7 \n%\n$\n272.9 \n12.3 \n%\nKate Spade\n(1)\n1,567.2\n \nNM\n738.6 \n55.3 \n828.6 \nNM\nStuart Weitzman\n(2)\n \n133.8\n \n62.2\n \n164.1 \n68.0 \n(30.3)\n(18.5)\nCorporate\n(3)(4)\n675.7\n \nNA\n622.4 \nNA\n53.3 \n8.6 \nTapestry\n$\n4,873.9\n \n69.5\n \n$\n3,749.4 \n56.2 \n$\n1,124.5 \n30.0 \nSG&A expenses increased 30.0% or $1.12 billion to $4.87 billion in fiscal 2025 as compared to $3.75 billion in fiscal 2024. As a percentage of net sales, SG&A expenses increased to 69.5% during fiscal 2025 as compared to 56.2% during fiscal 2024. Excluding items affecting comparability of $984.5 million in fiscal 2025, SG&A expenses increased 6.9% or $249.9 million to $3.89 billion from $3.64 billion in fiscal 2024. SG&A as a percentage of net sales increased 90 basis points to 55.4% as compared to 54.5% in fiscal 2024. This increase in SG&A as a percentage of net sales was primarily due to higher marketing spend and higher compensation costs driven by accrued incentive compensation, partially offset by leverage of fixed costs on higher net sales.\n(1)\nIn fiscal 2025, Kate Spade incurred charges affecting comparability of $860.5 million. Excluding those items affecting comparability, SG&A expenses decreased 4.3% or $31.9 million to $706.7 million in fiscal 2025 as compared to $738.6 million in fiscal 2024. SG&A as a percentage of net sales increased 380 basis points to 59.1% in fiscal 2025 as compared to 55.3% in fiscal 2024.\n(2)\nIn fiscal 2025, Stuart Weitzman\n \nincurred charges affecting comparability of $0.6 million. Excluding those items affecting comparability, SG&A expenses decreased 18.9% or $30.9 million to $133.2 million in fiscal 2025 as compared to $164.1 million in fiscal 2024. SG&A as a percentage of net sales decreased 610 basis points to 61.9% in fiscal 2025 as compared to 68.0% in fiscal 2024.\n(3)\nIn fiscal 2025, Corporate incurred charges affecting comparability of $122.6 million. Excluding those items affecting comparability, SG&A expenses increased 7.9% or $40.6 million to $553.1 million in fiscal 2025 as compared to $512.5 million in fiscal 2024.\n(4)\nCorporate expenses, which are included within SG&A expenses discussed above but are not directly attributable to a reportable segment.\nOperating Income (Loss)\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nVariance\n(millions)\nAmount\n% of Net Sales\nAmount\n% of Net Sales\nAmount\n%\nCoach\n$\n1,875.3\n \n33.5\n \n%\n$\n1,651.1 \n32.4 \n%\n$\n224.2 \n13.6 \n%\nKate Spade\n(769.2)\n(64.3)\n132.6 \n9.9 \n(901.8)\nNM\nStuart Weitzman \n(15.4)\n(7.1)\n(21.2)\n(8.8)\n5.8 \n27.8\nCorporate\n(675.7)\nNA\n(622.4)\nNA\n(53.3)\n(8.6)\nTapestry\n$\n415.0\n \n5.9\n \n$\n1,140.1 \n17.1 \n$\n(725.1)\n(63.6)\nOperating income decreased $725.1 million to $415.0 million during fiscal 2025 as compared to $1.14 billion in fiscal 2024. Operating margin was 5.9% in fiscal 2025 as compared to 17.1% in fiscal 2024. Excluding items affecting comparability of $984.5 million in fiscal 2025, operating income increased $149.5 million to $1.40 billion from $1.25 billion in fiscal 2024; and operating margin increased approximately 130 basis points to 20.0% in fiscal 2025 as compared to 18.7% in fiscal 2024. This increase in operating margin was primarily attributed to an increase of 210 basis points in gross margin partially offset by 90 basis points increase in SG&A as a percentage of sales.\n40\n•\nCoach Operating Income\n increased $224.2 million to $1.88 billion in fiscal 2025, resulting in an operating margin increase of 110 basis points to 33.5%, as compared to $1.65 billion and 32.4%, respectively in fiscal 2024. This increase in operating margin was primarily attributed to:\n◦\nGross Margin\n, increased 200 basis points mainly due to net pricing improvements;\n◦\nSG&A expenses as a percentage of net sales\n, increased 90 basis points mainly due to higher marketing spend, partially offset by leverage of fixed costs on higher net sales. \n•\nKate Spade Operating Loss \nincreased $901.8 million to a loss of $769.2 million in fiscal 2025, resulting in an operating margin of (64.3)%, as compared to income of $132.6 million and 9.9%, respectively in fiscal 2024. Excluding items affecting comparability, operating income decreased $41.3 million to $91.3 million in fiscal 2025 from $132.6 million in fiscal 2024; and operating margin decreased 230 basis points to 7.6% in fiscal 2025 as compared to 9.9% in fiscal 2024. This decrease in operating margin was primarily attributed to:\n◦\nGross Margin\n, increased 150 basis points mainly due to lower duty expenses, lower freight costs and net pricing improvements;\n◦\nSG&A expenses as a percentage of net sales\n, increased 380 basis points mainly driven by higher marketing spend, deleverage of fixed costs on lower net sales, partially offset by a decrease in distribution costs.\n•\nStuart Weitzman Operating Loss \ndecreased $5.8 million to a loss of $15.4 million in fiscal 2025, resulting in an operating margin increase of 170 basis points to (7.1)%, as compared to an operating loss of $21.2 million and operating margin of (8.8)% in fiscal 2024. Excluding items affecting comparability, operating loss decreased $6.4 million to a loss of $14.8 million in fiscal 2025 from a loss of $21.2 million in fiscal 2024; and operating margin increased 200 basis points to (6.8)% in fiscal 2025 as compared to (8.8)% in fiscal 2024. \n•\nCorporate Operating Expenses\n increased 8.6% or $53.3 million to $675.7 million in fiscal 2025. Excluding items affecting comparability, Corporate operating expenses increased $40.6 million to $553.1 million from $512.5 million in fiscal 2024. This increase in operating expenses was due to higher compensation costs driven by accrued incentive compensation and higher professional fees, partially offset by lower occupancy costs.\nLoss on Extinguishment of Debt\nLoss on extinguishment of debt increased $120.1 million in fiscal 2025 to $120.1 million as compared to $0.0 million in fiscal 2024. Excluding items affecting comparability, Loss on extinguishment of debt was $0.7 million in fiscal 2025 as compared to $0.0 million in fiscal 2024. \nInterest Expense, net\nInterest expense, net, decreased $39.6 million to $85.4 million in fiscal 2025 as compared to $125.0 million in fiscal 2024. Excluding items affecting comparability, Interest expense, net, increased $16.9 million to $25.2 million from $8.3 million in fiscal 2024. This increase in net interest expense was mainly due to an increase in interest expense as a result of the issuance of the 2030 and 2035 Senior Notes and borrowings under the Existing Revolving Credit Facility, partially offset by a decrease in interest expense as a result of the repayment of the Term Loan due 2027.\nOther Expense (Income)\nOther income increased $9.8 million to Other income of $6.6 million in fiscal 2025 as compared to Other expense of $3.2 million in fiscal 2024. This increase in Other income was related to an increase in foreign exchange gains. \nProvision (Benefit) for Income Taxes\nThe effective tax rate was 15.2% in fiscal 2025 as compared to 19.4% in fiscal 2024. Excluding items affecting comparability, the effective tax rate was 17.8% in fiscal 2025 as compared to 19.2% in fiscal 2024. The decrease in effective tax rate was primarily driven by discrete items recognized in the period, partially offset by geographic mix of earnings.\nNet Income (Loss)\nNet income decreased 77.6% or $632.8 million to $183.2 million in fiscal 2025 as compared to a net income of $816.0 million in fiscal 2024. Excluding items affecting comparability, net income increased 13.4% or $134.0 million to $1.13 billion in fiscal 2025 from $1.00 billion in fiscal 2024. \nNet Income (Loss) per Share\nNet income per diluted share was $0.82 in fiscal 2025 as compared to net income per diluted share of $3.50 in fiscal 2024. Excluding items affecting comparability, net income per diluted share increased $0.81 to $5.10 in fiscal 2025 from $4.29 in fiscal 2024. This change was primarily due to higher net income and a decrease in shares outstanding.\n41\nFISCAL 2024 COMPARED TO FISCAL 2023 \nThe comparison of fiscal 2024 to 2023 has been omitted from this Form 10-K, but can be referenced in our Form 10-K for the fiscal year ended June 29, 2024, filed on August 15, 2024 \nwithin Part II. Item 7. \"Management's Discussion and Analysis of Financial Conditions and Results of Operations\".\nNON-GAAP MEASURES \nThe Company’s reported results are presented in accordance with GAAP. The reported SG&A expenses, Operating income, Interest expense, Provision for income taxes, Net income and earnings per diluted share in fiscal 2025 and fiscal 2024 and the reported Loss on extinguishment of debt in fiscal 2025, reflect certain items affecting comparability, including the impact of Acquisition and Divestiture Costs, Organizational Efficiency Costs and Impairment charges. As a supplement to the Company's reported results, these measures are also reported on a non-GAAP basis to exclude the impact of these items along with a reconciliation to the most directly comparable GAAP measures. \nThe Company incurred Acquisition and Divestiture Costs which consist of non-recurring acquisition and divestiture costs, primarily financing-related expenses and professional fees from the terminated Capri Acquisition as well as costs related to the Stuart Weitzman Business Divestiture, inclusive of the loss on business held for sale, professional fees, share-based compensation expense and store impairment. The Company also incurred Organizational Efficiency Costs which consist of non-recurring costs, primarily from various initiatives aimed at streamlining the organization and optimizing processes. These costs mainly include one-time severance and technology related charges. Impairment charges incurred by the Company consist of non-recurring impairment costs related to Kate Spade indefinite-lived brand intangible assets and goodwill.\nThese non-GAAP performance measures were used by management to conduct and evaluate its business during its regular review of operating results for the periods affected. Management and the Company’s Board utilized these non-GAAP measures to make decisions about the uses of Company resources, analyze performance between periods, develop internal projections and measure management performance. The Company’s internal management reporting excluded these items. In addition, the human resources committee of the Company’s Board uses these non-GAAP measures when setting and assessing achievement of incentive compensation goals.\nThe Company operates on a global basis and reports financial results in U.S. dollars in accordance with GAAP. Fluctuations in foreign currency exchange rates can affect the amounts reported by the Company in U.S. dollars with respect to its foreign revenues and profit. Accordingly, certain material increases and decreases in operating results for the Company and its segments have been presented both including and excluding currency fluctuation effects. These effects occur from translating foreign-denominated amounts into U.S. dollars and comparing to the same period in the prior fiscal year. Constant currency information compares results between periods as if exchange rates had remained constant period-over-period. The Company calculates constant currency revenue results by translating current period revenue in local currency using the prior year period's currency conversion rate.\nWe believe these non-GAAP measures are useful to investors and others in evaluating the Company’s ongoing operating and financial results in a manner that is consistent with management's evaluation of business performance and understanding how such results compare with the Company’s historical performance. Additionally, we believe presenting certain increases and decreases in constant currency provides a framework for assessing the performance of the Company's business outside the United States and helps investors and analysts understand the effect of significant year-over-year currency fluctuations. We believe excluding these items assists investors and others in developing expectations of future performance.\nBy providing the non-GAAP measures, as a supplement to GAAP information, we believe we are enhancing investors’ understanding of our business and our results of operations. The non-GAAP financial measures are limited in their usefulness and should be considered in addition to, and not in lieu of, GAAP financial measures. Further, these non-GAAP measures may be unique to the Company, as they may be different from non-GAAP measures used by other companies.\nFor a detailed discussion on these non-GAAP measures, see the GAAP to Non-GAAP Reconciliation discussions above in this Item 7. \"Management’s Discussion and Analysis of Financial Condition and Results of Operations.\"\n42\nFINANCIAL CONDITION\nCash Flows - Fiscal 2025 Compared to Fiscal 2024 \nFiscal Year Ended\nJune 28,\n2025\nJune 29,\n2024\nChange\n(millions)\nNet cash provided by (used in) operating activities\n$\n1,216.6\n \n$\n1,255.6 \n$\n(39.0)\nNet cash provided by (used in) investing activities\n914.0\n \n(1,041.9)\n1,955.9 \nNet cash provided by (used in) financing activities\n(7,175.2)\n5,214.4 \n(12,389.6)\nEffect of exchange rate changes on cash and cash equivalents\n26.3\n \n(12.2)\n38.5 \nNet increase (decrease) in cash and cash equivalents\n$\n(5,018.3)\n$\n5,415.9 \n$\n(10,434.2)\nThe Company’s cash and cash equivalents decreased by $5.02 billion in fiscal 2025 compared to an increase of $5.42 billion in fiscal 2024, as discussed below.\nNet cash provided by (used in) operating activities\nNet cash provided by operating activities decreased $39.0 million primarily due to lower net income of $632.8 million and changes in operating assets and liabilities of $207.2 million partially offset by a higher impact of non-cash adjustments of $801.0 million primarily related to the impairment of goodwill and intangible assets.\nThe $207.2 million decrease in changes in operating asset and liability balances was primarily driven by the following: \n•\nInventories were a use of cash of $108.2 million in fiscal 2025 compared to a source of cash of $85.8 million in fiscal 2024, primarily driven by increased inventory purchases for Coach to support continued sales growth and pull forward of inventory receipts.\n•\nAccounts payable were a use of cash of $15.0 million in fiscal 2025 as compared to a source of cash of $49.1 million in fiscal 2024, primarily driven by a decrease in professional fees due to higher spending in the prior year related to the Capri Acquisition and timing of other payments, partially offset by an increase in advertising.\n•\nAccounts receivables were a source of cash of $8.8 million in fiscal 2025 as compared to a use of cash of $37.3 million in fiscal 2024, primarily driven by timing of collections.\nNet cash provided by (used in) investing activities\nNet cash provided by investing activities was $914.0 million in fiscal 2025 compared to a use of cash of $1.04 billion in fiscal 2024, resulting in a $1.96 billion increase in net cash provided by investing activities. \nThe $914.0 million source of cash in fiscal 2025 was primarily due to proceeds from maturities and sales of investments of $2.92 billion, partially offset by purchases of investments of $1.89 billion, mainly related to the proceeds of the Capri Acquisition Senior Notes.\nThe $1.04 billion use of cash in fiscal 2024 was primarily due to purchases of investments of $2.71 billion, partially offset by maturities and sales of investments of $1.68 billion, mainly related to the proceeds of the Capri Acquisition Senior Notes.\nNet cash provided by (used in) financing activities\nNet cash used in financing activities was $7.18 billion in fiscal 2025 as compared to a source of cash of $5.21 billion in fiscal 2024, resulting in a $12.39 billion increase in net cash used in financing activities.\nThe $7.18 billion use of cash in fiscal 2025 was primarily due to the repayment of debt of $7.16 billion, which mainly included the Capri Acquisition Senior Notes, use of cash of $2.02 billion under the Company's accelerated share repurchase program partially offset by proceeds from the issuance of debt of $2.25 billion.\nThe $5.21 billion source of cash in fiscal 2024 was primarily due to proceeds from the issuance of the Capri Acquisition Senior Notes of $6.09 billion, partially offset by the repayment of the Term Loan due 2027 of $468.8 million, and dividend payments of $321.4 million.\nEffect of exchange rate changes on cash and cash equivalents\nEffect of exchange rate changes on cash and cash equivalents was an increase of $26.3 million as compared to a decrease of $12.2 million in fiscal 2024.\n43\nCash Flows - Fiscal 2024 Compared to Fiscal 2023 \nThe comparison of fiscal \n2024\n to 2023 has been omitted from this Form 10-K, but can be referenced in our Form 10-K for the fiscal year ended June 29, 2024, filed on August 15, 2024\n within Part II. Item 7. \"Management's Discussion and Analysis of Financial Conditions and Results of Operations\"\n.\nWorking Capital and Capital Expenditures\nThe following table presents our financial condition as of June 28, 2025 and \nJune 29, 2024\n:\nJune 28, 2025\nJune 29, 2024\nChange\n(millions)\nCash and cash equivalents\n(1)\n$\n1,100.0\n \n$\n6,142.0 \n$\n(5,042.0)\nShort-term investments\n(1)\n19.6\n \n1,061.8 \n(1,042.2)\nCurrent debt\n(2)\n(16.7)\n(303.4)\n286.7 \nLong-term debt\n(2)\n(2,377.9)\n(6,937.2)\n4,559.3 \nTotal, net\n$\n(1,275.0)\n$\n(36.8)\n$\n(1,238.2)\n(1)    \nAs of June 28, 2025, approximately 26.2% of our Cash and cash equivalents and Short-term investments were held outside the United States. \n(2)    \nRefer to Note 12, \"Debt\" for discussion of the carrying values of our debt.\nSources of Liquidity\nOur primary sources of liquidity are the cash flows generated from our operations, our cash and cash equivalents and short-term investments, availability under our credit facilities and other available financing options.\nThe following table presents the total availability, borrowings outstanding and remaining availability under our credit facilities as of June 28, 2025:\nTotal Availability\nBorrowings Outstanding\nRemaining Availability\n(millions)\nAmended Revolving Credit Facility\n(1)\n$\n2,000.0\n \n$\n—\n \n$\n2,000.0\n \nChina Credit Facility\n(1)(2)\n34.9\n \n16.7\n \n18.2\n \nTotal\n$\n2,034.9\n \n$\n16.7\n \n$\n2,018.2\n \n(1)    \nRefer to Note 12, \"Debt\" for further information on these instruments.\n(2)     \nThe carrying amounts of the China Credit Facility include the impact of changes in the exchange rate of the United States Dollar against the Renminbi.\nWe believe that our Amended Revolving Credit Facility is adequately diversified with no undue concentrations in any one financial institution. As of June 28, 2025, there were 18 financial institutions participating in the Amended Revolving Credit Facility, with no one participant maintaining a commitment percentage in excess of 10%. We have no reason to believe, at this time, that the participating institutions will be unable to fulfill their obligations to provide financing in accordance with the terms of the facility in the event we elect to draw funds in the foreseeable future.\nWe have the ability to draw on our credit facilities or access other sources of financing options available to us in the credit and capital markets for, among other things, acquisition or integration-related costs, our restructuring initiatives, settlement of a material contingency or a material adverse business or macroeconomic development, as well as for other general corporate business purposes. \n44\nManagement believes that cash flows from operations, access to the credit and capital markets and our credit lines, on-hand cash and cash equivalents and our investments will provide adequate funds to support our operating, capital and debt service requirements for fiscal 2026 and beyond. There can be no assurance that any such capital will be available to the Company on acceptable terms or at all. Our ability to fund working capital needs, planned capital expenditures and scheduled debt payments, as well as to comply with all of the financial covenants under our debt agreements, depends on future operating performance and cash flow. This future operating performance and cash flow are subject to prevailing economic conditions and to financial, business and other factors, some of which are beyond the Company's control.\nStuart Weitzman Business Divestiture\nOn February 16, 2025, the Company entered into a Purchase Agreement to sell the Stuart Weitzman Business for total cash consideration of $105.0 million, subject to customary adjustments. The sale was completed on August 4, 2025. Refer to Note 5, \"Acquisitions and Divestitures,\" and Note 21, \"Subsequent Events,\" for further information. \nSupply Chain Finance\nTo improve our working capital efficiency, we make available to certain suppliers, a voluntary supply chain finance (“SCF”) program that enables our suppliers to sell their receivables from the Company to a global financial institution on a non-recourse basis at a rate that leverages our credit rating. We do not have the ability to refinance or modify payment terms to the global financial institution through the SCF program. No guarantees are provided by the Company or any of our subsidiaries under the SCF program. Refer to Note 3, \"Significant Accounting Policies,\" for additional information.\nCapital Expenditures\nTotal capital expenditures and cloud computing implementation costs were $153.0 million in fiscal 2025. Certain cloud computing implementation costs are recognized within Prepaid expenses and Other assets on the Consolidated Balance Sheets. \nSeasonality\nThe Company's results are typically affected by seasonal trends. During the first fiscal quarter, we typically build inventory for the winter and holiday season. In the second fiscal quarter, working capital requirements are reduced substantially as we generate higher net sales and operating income, especially during the holiday season. \nFluctuations in net sales, operating income and operating cash flows of the Company in any fiscal quarter may be affected by the timing of wholesale shipments and other events affecting retail sales, including weather and macroeconomic events.\nStock Repurchase Program\nOn May 12, 2022, the Company announced that its Board of Directors (the \"Board\") authorized a common stock repurchase program to repurchase up to $1.50 billion of its outstanding common stock (the \"2022 Share Repurchase Program\"). Purchases of the Company's common stock under this program were executed through open market purchases, including through purchase agreements under Rule 10b5-1. \nOn November 13, 2024, the Board authorized the Company to repurchase up to $2.00 billion of outstanding shares of its common stock (the \"2025 Share Repurchase Program\"). Under the 2025 Share Repurchase Program, the Company may repurchase shares on the open market, in privately negotiated transactions or in other transactions, including accelerated share repurchase programs. On November 21, 2024, the Company entered into accelerated share repurchase agreements (the “ASR Agreements”) with Bank of America, N.A. and Morgan Stanley & Co. LLC (the “Dealers”) to repurchase an aggregate of up to $2.00 billion of the Company’s shares of common stock. Under the ASR Agreements, the Company paid $2.00 billion to the Dealers and received an initial delivery of 28,363,766 shares of the Company's common stock on November 26, 2024. The total number of shares purchased by the Company pursuant to the ASR Agreements will be based on the volume-weighted average price (\"VWAP\") of the Company's common stock on specified dates during the term of each of the ASR Agreements, less a discount, and subject to adjustments pursuant to the terms and conditions of the ASR Agreements. The difference between the initially delivered shares and the total number of shares purchased will be settled in four tranches, no later than the first quarter of fiscal 2026. During the quarter ended March 29, 2025, the Company cash settled $3.0 million related to 43,094 shares of common stock owed for the settlement of one tranche as a result of the increase in the VWAP of the Company's common stock. During the quarter ended June 28, 2025, the Company cash settled $3.6 million related to 49,442 shares of common stock of an additional tranche. \nAs of June 28, 2025, the Company had $800.0 million of additional shares available to be repurchased as authorized under the 2022 Share Repurchase Program and no remaining availability to repurchase shares under the 2025 Share Repurchase Program. There were no shares repurchased during the three months ended June 28, 2025 under the 2022 Share Repurchase Program and the 2025 Share Repurchase Program.\n45\nContractual and Other Obligations\nFirm Commitments\nAs of June 28, 2025, the Company's contractual obligations are as follows:\nTotal\nFiscal\n2026\nFiscal\n2027 – 2028\nFiscal\n2029 – 2030\nFiscal 2031\nand Beyond\n(millions)\nCapital expenditure & cloud computing implementation commitments\n$\n34.3 \n$\n31.3 \n$\n3.0 \n$\n— \n$\n— \nInventory purchase obligations\n(1)\n353.0 \n353.0 \n— \n— \n— \nOperating lease obligations\n2,025.3 \n382.7 \n586.5 \n367.9 \n688.2 \nDebt repayment\n(2)\n2,413.3 \n16.7 \n396.6 \n750.0 \n1,250.0 \nInterest on outstanding debt\n(2)(3)\n771.8 \n131.5 \n214.0 \n189.5 \n236.8 \nOther\n222.3 \n101.8 \n111.7 \n8.8 \n— \nTotal\n$\n5,820.0\n \n$\n1,017.0\n \n$\n1,311.8\n \n$\n1,316.2\n \n$\n2,175.0\n \n(1)    \nIncludes inventory purchase obligations related to the Stuart Weitzman Business as of June 28, 2025 of $24.6 million. \n(2)    \nThe principal and interest of the China Credit Facility include the impact of changes in the exchange rate of the United States Dollar against the Renminbi as of June 28, 2025.\n(3)    \nInterest on outstanding debt includes fixed interest expenses for unsecured notes. Refer to Note 12, \"Debt,\" for further information. \nWe expect to fund these firm commitments with operating cash flows generated in the normal course of business and, if necessary, through availability under our credit facilities or other accessible sources of financing. Excluded from the above contractual obligations table is the non-current liability for unrecognized tax benefits of $137.5 million as of June 28, 2025, as we cannot make a reliable estimate of the period in which the liability will be settled, if ever. Besides the firm commitments noted above, the above table excludes other amounts included in current liabilities in the Consolidated Balance Sheets at June 28, 2025 as these items will be paid within one year and certain long-term liabilities not requiring cash payments. \nOff-Balance Sheet Arrangements\nIn addition to the commitments included in the table above, we have outstanding letters of credit, surety bonds and bank guarantees totaling $26.5 million as of June 28, 2025, primarily serving to collateralize our obligation to third parties for duty, leases, insurance claims and materials used in product manufacturing. These letters of credit expire at various dates through calendar 2039.\nWe do not maintain any other off-balance sheet arrangements, transactions, obligations or other relationships with unconsolidated entities that would be expected to have a material current or future effect on our consolidated financial statements. Refer to Note 13, \"Commitments and Contingencies,\" for further information.\n46\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect our results of operations, financial condition and cash flows as well as the disclosure of contingent assets and liabilities as of the date of the Company's financial statements. Actual results could differ from estimates in amounts that may be material to the financial statements. Predicting future events is inherently an imprecise activity and, as such, requires the use of judgment. Actual results could differ from estimates in amounts that may be material to the financial statements. The development and selection of the Company’s critical accounting policies and estimates are periodically reviewed with the Audit Committee.\nThe accounting policies discussed below are considered critical because changes to certain judgments and assumptions inherent in these policies could affect the financial statements. For more information on the Company's accounting policies, please refer to the Notes to Consolidated Financial Statements.\nRevenue Recognition\nRevenue is recognized when the Company satisfies its performance obligations by transferring control of promised products or services to its customers, which may be at a point of time or over time. Control is transferred when the customer obtains the ability to direct the use of and obtain substantially all of the remaining benefits from the products or services. The amount of revenue recognized is the amount of consideration to which the Company expects to be entitled, including estimation of sale terms that may create variability in the consideration. Revenue subject to variability is constrained to an amount which will not result in a significant reversal in future periods when the contingency that creates variability is resolved.\nRetail store and concession shop-in-shop revenues are recognized at the point-of-sale, when the customer obtains physical possession of the products. Digital revenue from sales of products ordered through the Company’s e-commerce sites is recognized upon delivery and receipt of the shipment by its customers and includes shipping and handling charges paid by customers. Retail and digital revenues are recorded net of estimated returns, which are estimated by developing an expected value based on historical experience. Payment is due at the point of sale.\nThe Company recognizes revenue within the wholesale business at the time title passes and risk of loss is transferred to customers, which is generally at the point of shipment of products but may occur upon receipt of the shipment by the customer in certain cases. Wholesale revenue is recorded net of estimates for returns, discounts, end-of-season markdowns, cooperative advertising allowances and other consideration provided to the customer. The Company's historical estimates of these variable amounts have not differed materially from actual results.\nThe Company recognizes licensing revenue over time during the contract period in which licensees are granted access to the Company's trademarks. These arrangements require licensees to pay a sales-based royalty and may include a contractually guaranteed minimum royalty amount. Revenue for contractually guaranteed minimum royalty amounts is recognized ratably over the license year and any excess sales-based royalties are recognized as earned once the minimum royalty threshold is achieved.\nAt June 28, 2025, a 10% change in the allowances for estimated uncollectible accounts, markdowns and returns would not have resulted in a material change in the Company's reserves and net sales.\nInventories\nThe Company holds inventory that is sold through retail and wholesale distribution channels, including e-commerce sites. Substantially all of the Company's inventories are comprised of finished goods and are reported at the lower of cost or net realizable value. Inventory costs include material, conversion costs, freight and duties and are primarily determined on a weighted-average cost basis. The Company reserves for inventory, including slow-moving and aged inventory, based on current product demand, expected future demand and historical experience. A decrease in product demand due to changing customer tastes, buying patterns or increased competition could impact the Company's evaluation of its inventory and additional reserves might be required. Estimates may differ from actual results due to the quantity, quality and mix of products in inventory, consumer and retailer preferences and market conditions. At June 28, 2025, a 10% change in the inventory reserve, would not have resulted in a material change in inventory and cost of sales.\n47\nGoodwill and Other Intangible Assets\nUpon acquisition, the Company estimates and records the fair value of purchased intangible assets, which primarily consists of brands, customer relationships, right-of-use assets and order backlog. Goodwill and certain other intangible assets deemed to have indefinite useful lives, including brand intangible assets, are not amortized, but are assessed for impairment at least annually. Finite-lived intangible assets are amortized over their respective estimated useful lives and, along with other long-lived assets as noted above, are evaluated for impairment periodically whenever events or changes in circumstances indicate that their related carrying values may not be fully recoverable. Estimates of fair value for finite-lived and indefinite-lived intangible assets are primarily determined using discounted cash flows and the multi-period excess earnings method, respectively, with consideration of market comparisons as appropriate. This approach uses significant estimates and assumptions, including projected future cash flows, discount rates and growth rates.\nThe Company generally performs its annual goodwill and indefinite-lived intangible assets impairment analysis using a quantitative approach. The quantitative goodwill impairment test identifies the existence of potential impairment by comparing the fair value of each reporting unit with its carrying value, including goodwill. If the fair value of a reporting unit exceeds its carrying value, the reporting unit's goodwill is considered not to be impaired. If the carrying value of a reporting unit exceeds its fair value, an impairment charge is recognized in an amount equal to that excess. The impairment charge recognized is limited to the amount of goodwill allocated to that reporting unit.\nDetermination of the fair value of a reporting unit and intangible asset is based on management's assessment, considering independent third-party appraisals when necessary. Furthermore, this determination is judgmental in nature and often involves the use of significant estimates and assumptions, which may include projected future cash flows, discount rates, growth rates, and determination of appropriate market comparables and recent transactions. These estimates and assumptions could have a significant impact on whether or not an impairment charge is recognized and the amount of any such charge. \nThe Company performs its annual impairment assessment of goodwill as well as brand intangibles at the beginning of the fourth quarter of each fiscal year. During the fourth quarter of fiscal 2025, the Company performed its annual goodwill and indefinite-lived intangible assets impairment analysis. The assessment concluded that the fair values of the Kate Spade reporting unit and indefinite-lived brand intangible asset did not exceed their respective carrying values due to a reduction in both current and future expected cash flows, which includes an estimated impact of cost increases due to changes in tariff and trade policies. Accordingly, the Company recorded $244.1 million of impairment charges to goodwill for the Kate Spade reporting unit during the fourth quarter of the fiscal year. The Company also recorded an impairment charge of $610.7 million related to the Kate Spade indefinite-lived brand intangible. The Company determined that there was no impairment in fiscal 2024 or fiscal 2023. \nSeveral factors could impact the Kate Spade brand's ability to achieve expected future cash flows, including the optimization of the store fleet productivity, the success of international expansion strategies, the impact of promotional activity, continued economic volatility and potential operational challenges related to the macroeconomic factors, the reception of new collections in all business channels and other initiatives aimed at increasing profitability of the business. If profitability trends decline during fiscal 2026 from those that are expected, it is possible that an interim test, or our annual impairment test, could result in an impairment of these assets. \nBased on the annual assessment in fiscal 2025 of the Coach brand reporting unit, the Company determined the fair values significantly exceeded their respective carrying values, therefore resulting in no impairment.\nValuation of Long-Lived Assets\nLong-lived assets, such as Property and equipment and Operating lease right-of-use (\"ROU\") assets, are evaluated for impairment whenever events or circumstances indicate that the carrying value of the assets may not be recoverable. In evaluating long-lived assets for recoverability, the Company uses its best estimate of future cash flows expected to result from the use of the related asset group and its eventual disposition. To the extent that estimated future undiscounted net cash flows attributable to the asset are less than its carrying value, an impairment loss is recognized equal to the difference between the carrying value of such asset and its fair value, considering external market participant assumptions.\nIn determining future cash flows, the Company takes various factors into account, including the effects of macroeconomic trends such as consumer spending, in-store capital investments, promotional cadence, the level of advertising and changes in merchandising strategy. Since the determination of future cash flows is an estimate of future performance, there may be future impairments in the event that future cash flows do not meet expectations.\nThe Company recorded $\n8.8\n million and $\n6.3\n million of impairment charges within SG&A expense in the Consolidated Statement of Operations in fiscal 2025 and fiscal 2024, respectively.\n48\nShare-Based Compensation\nThe Company recognizes the cost of equity awards to employees and the non-employee Directors based on the grant-date fair value of those awards. The grant-date fair values of share unit awards are based on the fair value of the Company's common stock on the date of grant. The grant-date fair value of stock option awards is determined using the Black-Scholes option pricing model and involves several assumptions, including the expected term of the option, expected volatility and dividend yield. The expected term of options represents the period of time that the options granted are expected to be outstanding and is based on historical experience. Expected volatility is based on historical volatility of the Company’s stock as well as the implied volatility from publicly traded options on the Company's stock. Dividend yield is based on the current expected annual dividend per share and the Company’s stock price. Changes in the assumptions used to determine the Black-Scholes value could result in significant changes in the Black-Scholes value. \nFor stock options and share unit awards, the Company recognizes share-based compensation net of estimated forfeitures and revises the estimates in subsequent periods if actual forfeitures differ from the estimates. The Company estimates the forfeiture rate based on historical experience as well as expected future behavior.\nThe Company grants performance-based share awards to key executives, the vesting of which is subject to the executive’s continuing employment and the Company's or individual's achievement of certain performance goals. On a quarterly basis, the Company assesses actual performance versus the predetermined performance goals and adjusts the share-based compensation expense to reflect the relative performance achievement. Actual distributed shares are calculated upon conclusion of the service and performance periods, and include dividend equivalent shares. If the performance-based award incorporates a market condition, the grant-date fair value of such award is determined using a pricing model, such as a Monte Carlo Simulation.\nA hypothetical 10% change in our stock-based compensation expense would not have a material impact to our fiscal 2025 net income.\nIncome Taxes\nThe Company’s effective tax rate is based on pre-tax income, statutory tax rates, tax laws and regulations and tax planning strategies available in the various jurisdictions in which the Company operates. The Company classifies interest and penalties on uncertain tax positions in the Provision for income taxes. The Company records net deferred tax assets to the extent it believes that it is more likely than not that these assets will be realized. In making such determination, the Company considers all available evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies and recent and expected future results of operation. The Company reduces deferred tax assets by a valuation allowance if, based upon the weight of available evidence, it is more likely than not that some amount of deferred tax assets is not expected to be realized. The Company is not permanently reinvested with respect to earnings of a limited number of foreign entities and has recorded the tax consequences of remitting earnings from these entities. The Company is permanently reinvested with respect to all other earnings. \nThe Company recognizes the impact of tax positions in the financial statements if those positions will more likely than not be sustained on audit, based on the technical merits of the position. Although the Company believes that the estimates and assumptions used are reasonable and legally supportable, the final determination of tax audits could be different than that which is reflected in historical tax provisions and recorded assets and liabilities. Tax authorities periodically audit the Company’s income tax returns, these tax authorities may take a contrary position that could result in a significant impact on the Company's results of operations. Significant management judgment is required in determining the effective tax rate, in evaluating tax positions and in determining the net realizable value of deferred tax assets.\nRefer to Note 15, “Income Taxes,” for further information.\nRecent Accounting Pronouncements\nRefer to Note 3, \"Significant Accounting Policies,\" to the accompanying audited consolidated financial statements for a description of certain recently adopted, issued or proposed accounting standards which may impact our consolidated financial statements in future reporting periods.\n49\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nMarket Risk\nThe market risk inherent in our financial instruments represents the potential loss in fair value, earnings or cash flows, arising from adverse changes in foreign currency exchange rates or interest rates. The Company manages these exposures through operating and financing activities and, when appropriate, through the use of derivative financial instruments. The use of derivative financial instruments is in accordance with the Company's risk management policies, and we do not enter into derivative transactions for speculative or trading purposes.\nThe quantitative disclosures in the following discussion are based on quoted market prices obtained through independent pricing sources for the same or similar types of financial instruments, taking into consideration the underlying terms and maturities and theoretical pricing models. These quantitative disclosures do not represent the maximum possible loss or any expected loss that may occur, since actual results may differ from those estimates.\nForeign Currency Exchange Rate Risk\nForeign currency exposures arise from transactions, including firm commitments and anticipated contracts, denominated in a currency other than the entity’s functional currency, and from foreign-denominated revenues and expenses translated into U.S. dollars. The majority of the Company's purchases and sales involving international parties, excluding international consumer sales, are denominated in U.S. dollars and, therefore, our foreign currency exchange risk is limited. The Company is exposed to risk from foreign currency exchange rate fluctuations resulting from its operating subsidiaries’ transactions denominated in foreign currencies. To mitigate such risk, certain subsidiaries enter into forward currency contracts. As of June 28, 2025 and June 29, 2024, the total notional values of outstanding forward currency contracts designated as cash flow hedges were $735.0 million and $764.6 million, respectively. As a result of the use of derivative instruments, we are exposed to the risk that counterparties to the derivative instruments will fail to meet their contractual obligations. To mitigate the counterparty credit risk, we only enter into derivative contracts with carefully selected financial institutions. The Company also reviews the creditworthiness of our counterparties on a regular basis. As a result of the above considerations, we do not believe that we are exposed to any undue concentration of counterparty credit risk associated with our derivative contracts as of June 28, 2025.\nThe Company is also exposed to transaction risk from foreign currency exchange rate fluctuations with respect to various cross-currency intercompany loans, payables and receivables. This primarily includes exposure to exchange rate fluctuations in the Chinese Renminbi, the Singapore Dollar and the New Taiwan Dollar. To manage the exchange rate risk related to these balances, the Company enters into forward currency contracts. As of June 28, 2025 and June 29, 2024, the total notional values of outstanding forward foreign currency contracts related to these loans, payables and receivables were $157.0 million and $348.2 million, respectively.\nThe fair value of outstanding forward currency contracts included in current assets at June 28, 2025 and June 29, 2024 was $6.8 million and $58.3 million, respectively. The fair value of outstanding foreign currency contracts included in current liabilities at June 28, 2025 and June 29, 2024 was $8.0 million and $4.8 million, respectively. The fair value of these contracts is sensitive to changes in foreign currency exchange rates.\nThe Company is also exposed to foreign currency exchange rate fluctuations with respect to net investment hedges. As of June 28, 2025 and June 29, 2024, we have multiple fixed to fixed cross currency swap foreign exchange and forward foreign exchange agreements with aggregate notional amounts of $1.69 billion and $1.45 billion, respectively, predominately to hedge our net investment in Euro-denominated subsidiaries, Japanese Yen-denominated subsidiaries and Chinese Renminbi-denominated subsidiaries against future volatility in the exchange rates between the United States dollar and their local currencies. The fair values of outstanding derivative contracts related to net investment hedges included in current assets and long-term assets at June 28, 2025 and June 29, 2024 was $15.6 million and $32.2 million, respectively. The fair values of outstanding derivative contracts related to net investment hedges included in current and long-term liabilities at June 28, 2025 and June 29, 2024 was $263.0 million and $139.4 million, respectively. Under the term of the cross currency swap contracts, we will exchange the semi-annual fixed rate payments on United States denominated debt for fixed rate payments of 5.5% to 6.4% in Euros, Japanese Yen and Chinese Renminbi for fixed rate payments of 5.5% to 7.9% in USD.\nWe perform a sensitivity analysis to determine the effects that market risk exposures may have on the fair values of our forward foreign currency exchange contracts and net investment hedges. We assess the risk of loss in the fair values of these contracts that would result from hypothetical changes in foreign currency exchange rates. This analysis assumes a like movement by the foreign currencies in our hedge portfolio against the U.S. Dollar. As of June 28, 2025, a 10% appreciation or depreciation of the U.S. Dollar against the foreign currencies under contract would result in a net increase or decrease, respectively, in the fair value of our derivative portfolio of approximately $294 million. This hypothetical net change in fair value should ultimately be largely offset by the net change in the related underlying hedged items. Refer to Note 10, \"Derivative Investments and Hedging Activities,\" for additional information.\n50\nInterest Rate Risk\nThe Company is exposed to interest rate risk in relation to its indebtedness and investments. Our exposure to changes in interest rates is primarily attributable to debt outstanding under the Amended Revolving Credit Facility. Refer to Note 12, \"Debt,\" for additional information.\nOur exposure to changes in interest rates is primarily attributable to debt outstanding under the $2.00 Billion Amended Revolving Credit Facility. Borrowings under the Amended Revolving Credit Facility bear interest at a rate per annum equal to, at the Company’s option, (i) for borrowings in U.S. Dollars, either (a) an alternate base rate or (b) a term secured overnight financing rate, (ii) for borrowings in Euros, the Euro Interbank Offered Rate, (iii) for borrowings in Pounds Sterling, the Sterling Overnight Index Average Reference Rate and (iv) for borrowings in Japanese Yen, the Tokyo Interbank Offer Rate, plus, in each case, an applicable margin. The applicable margin will be adjusted by reference to a grid (the “Pricing Grid”) based on the ratio of (a) consolidated debt (subject to reduction for certain debt incurred in connection with a pending acquisition or for debt being discharged, satisfied or defeased), to (b) consolidated EBITDAR. Borrowings under the Amended Revolving Credit Facility are subject to interest rate risk due to changes in SOFR. A hypothetical 10% change in the Amended Revolving Credit Facility interest rates would have resulted in an immaterial change in interest expense in fiscal 2025.\nThe Company is exposed to changes in interest rates related to the fair value of the senior unsecured notes.\nThe following table shows the estimated fair values of the senior unsecured notes at June 28, 2025 and June 29, 2024 based on external pricing data, including available quoted market prices of the instruments, and consideration of comparable debt instruments with similar interest rates and trading frequency, among other factors, and are classified as Level 2 measurements within the fair value hierarchy:\nJune 28,\n2025\nJune 29,\n2024\n(millions)\nUSD Senior Notes:\n4.250% Senior Notes due 2025\n$\n—\n \n$\n300.2 \n7.050% Senior Notes due 2025\n—\n \n508.1 \n7.000% Senior Notes due 2026\n—\n \n770.7 \n4.125% Senior Notes due 2027\n393.0\n \n378.2 \n7.350% Senior Notes due 2028\n—\n \n1,036.5 \n5.100% Senior Notes due 2030\n756.8\n \n— \n7.700% Senior Notes due 2030\n—\n \n1,042.9 \n3.050% Senior Notes due 2032\n443.2\n \n402.9 \n7.850% Senior Notes due 2033\n—\n \n1,311.3 \n5.500% Senior Notes due 2035\n748.2\n \n— \nEUR Senior Notes:\n5.350% EUR Senior Notes due 2025\n(1)\n—\n \n543.8 \n5.375% EUR Senior Notes due 2027\n(1)\n—\n \n550.8 \n5.875% EUR Senior Notes due 2031\n(1)\n—\n \n556.4 \n(1)\nThe fair values of the Capri Acquisition EUR Senior\n \nNotes include the impact of changes in the exchange rate of the United States Dollar against the Euro.\nThe interest rate payable on the 4.125% Senior Notes due 2027 will be subject to adjustments from time to time if either Moody’s or S&P or a substitute rating agency downgrades (or downgrades and subsequently upgrades) the credit rating assigned to the respective senior notes of such series. Refer to Note 12, \"Debt\" for further information on these instruments.\nThe Company’s investment portfolio is maintained in accordance with the Company’s investment policy, which defines our investment principles including credit quality standards and limits the credit exposure of any single issuer. The primary objective of our investment activities is the preservation of principal while maximizing interest income and minimizing risk. We do not hold any investments for trading purposes.\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nRefer to “Index to Financial Statements,” appearing at the end of this Annual Report on Form 10-K.\n51\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nWe have evaluated, under the supervision and with the participation of management, including our principal executive and principal financial officers, the effectiveness of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as amended, as of the end of the fiscal year covered by this annual report. Based on that evaluation, our principal executive and principal financial officers have concluded that the Company's disclosure controls and procedures were effective at the reasonable assurance level as of the fiscal year-end covered by this Annual Report on Form 10-K.\nManagement’s Report on Internal Control over Financial Reporting\nThe Company’s management is responsible for establishing and maintaining adequate internal controls over financial reporting as defined in Rule 13a-15(f). The Company’s internal control system was designed to provide reasonable assurance to the Company’s management and Board regarding the preparation and fair presentation of published financial statements. Management evaluated the effectiveness of the Company’s internal control over financial reporting using the criteria set forth by the Committee of Sponsoring Organizations (\"COSO\") of the Treadway Commission in Internal Control — Integrated Framework in 2013. Management, under the supervision and with the participation of the Company’s CEO and CFO, assessed the effectiveness of the Company’s internal control over financial reporting as of June 28, 2025 and concluded that it was effective at the reasonable assurance level.\nThe Company’s independent auditors have issued an audit report on the Company's internal control over financial reporting as of June 28, 2025 as included elsewhere herein.\nChanges in Internal Control over Financial Reporting\nThere were no changes in the Company’s internal control over financial reporting during the fourth quarter of 2025 that were identified in connection with management’s evaluation required by paragraph (d) of Rules 13a-15 and 15d-15 under the Securities Exchange Act of 1934, as amended, that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nITEM 9B. OTHER INFORMATION\nThere was no \nadoption\n, modification or \ntermination\n of any Rule 10b5-1 plan or other trading arrangements by our directors and officers during the quarter ended June 28, 2025. \nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNone.\n52\nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required to be included by Item 10 of Form 10-K will be included in the Proxy Statement for the 2025 Annual Meeting of Stockholders (the \"2025 Proxy Statement\") and such information is incorporated by reference herein. The 2025 Proxy Statement will be filed with the Commission within 120 days after the end of the fiscal year covered by this Form 10-K pursuant to Regulation 14A under the Securities Exchange Act of 1934, as amended. \nITEM 11. EXECUTIVE COMPENSATION\nThe information required by this Item will be included in the 2025 Proxy Statement and is incorporated herein by reference. \nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information under the headings “Securities Authorized for Issuance Under Equity Compensation Plans” and “Tapestry Stock Ownership by Certain Beneficial Owners and Management” in the Company’s Proxy Statement for the 2025 Annual Meeting of Stockholders is incorporated herein by reference.\nThere are no arrangements known to the registrant that may at a subsequent date result in a change in control of the registrant.\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item will be included in the 2025 Proxy Statement and is incorporated herein by reference.\nITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this Item will be included in the 2025 Proxy Statement and is incorporated herein by reference.\n53\nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)\nThe following documents are filed as part of this report:\n(1) Financial Statements. For a list of financial statements filed as part of this report refer to “Index to Consolidated Financial Statements and Supplementary Information” which appears following the signature page below.\n(2) Financial Statement Schedules:\nSchedule II - Valuation and Qualifying Accounts\nAll other financial statement schedules are omitted because they are not applicable or the required information is shown in the Consolidated Financial Statements or Notes thereto included in this Form 10-K.\n(3) Exhibits: \nIn reviewing agreements included as exhibits to this report, please remember they are included to provide you with information regarding their terms and are not intended to provide any other factual or disclosure information about the Company or the other parties to the agreements. The agreements contain representations, warranties, covenants and conditions by or of each of the parties to the applicable agreement. These representations, warranties, covenants and conditions have been made solely for the benefit of the other parties to the applicable agreement and:\n(i) should not in all instances be treated as categorical statements of fact, but rather as a way of allocating the risk to one of the parties if those statements prove to be inaccurate;\n(ii) may have been qualified by disclosures that were made to the other party in connection with the negotiation of the applicable agreement, which disclosures are not necessarily reflected in the agreement;\n(iii) may apply standards of materiality in a way that is different from what may be viewed as material to you or other investors, or under federal securities law; and\n(iv) were made only as of the date of the applicable agreement or such other date or dates as may be specified in the agreement and are subject to more recent developments.\nAccordingly, these representations and warranties may not describe the actual state of affairs as of the date they were made or at any other time. Additional information about the Company may be found elsewhere in this report and the Company’s other public filings, which are available without charge through the SEC’s website at http://www.sec.gov.\nExhibit\n \nDescription\n3.1\nArticles of Incorporation, dated June 1, 2000, which is incorporated herein by reference from Exhibit 3.1 of to the Registrant's Registration Statement on Form S-1 filed on June 16, 2000\n3.2\nArticles Supplementary of Coach, Inc., dated May 3, 2001, which is incorporated herein by reference from Exhibit 3.2 to the Registrant’s Current Report on Form 8-K filed on May 9, 2001\n3.3\nArticles of Amendment of Coach, Inc., dated May 3, 2001, which is incorporated herein by reference from Exhibit 3.3 to the Registrant’s Current Report on Form 8-K filed on May 9, 2001\n3.4\nArticles of Amendment of Coach, Inc., dated May 3, 2002, which is incorporated by reference from Exhibit 3.4 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 29, 2002\n3.5\nArticles of Amendment of Coach, Inc., dated February 1, 2005, which is incorporated by reference from Exhibit 99.1 to the Registrant’s Current Report on Form 8-K filed on February 2, 2005\n3.6\nArticles of Amendment to Charter of \nthe Registrant,\n effective as of October 31, 2017, which is incorporated by reference from Exhibit 3.1 to the Registrant's Current Report on Form 8-K filed on October 31, 2017\n3.7\nBylaws of \nthe Registrant,\n effective as of April 12, 2023, which is incorporated herein by reference from Exhibit 3.1 to the Registrant’s Current Report on Form 8-K filed on April 13, 2023\n4.1\nSpecimen Certificate for Common Stock of \nthe Registrant\n which is incorporated by reference from Exhibit 4.1 to the Registrant's Annual Report on Form 10-K for the fiscal year ended June 30, 2018, filed on August 16, 2018\n4.2\nIndenture, dated as of March 2, 2015, between Coach, Inc. and U.S. Bank National Association, as trustee, which is incorporated herein by reference from Exhibit 4.1 to the Registrant’s Current Report on Form 8-K filed on March 2, 2015\n4.3\nThird Supplemental Indenture, dated as of June 20, 2017, relating to the 4.125% senior unsecured notes due 2027, between Coach, Inc. and U.S. Bank National Association, as trustee, which is incorporated by reference from Exhibit 4.2 to the Registrant's Current Report on Form 8-K, filed on June 20, 2017\n54\nExhibit\n \nDescription\n4.4\nForm of 4.125% senior unsecured notes due 2027 (included in the Third Supplemental Indenture), which is incorporated by reference from Exhibit 4.4 to the Registrant's Current Report on Form 8-K, filed on June 20, 2017\n4.5\nIndenture, dated as of December 1, 2021, between the \nRegistrant\n and U.S. Bank National Association, as trustee, which is incorporated herein by reference from Exhibit 4.1 to the Registrant’s Current Report on Form 8-K filed on December 1, 2021\n4.6\nFirst Supplemental Indenture, dated as of December 1, 2021, relating to the 3.050% senior unsecured notes due 2032, between the \nRegistrant\n and U.S. Bank National Association, as trustee, which is incorporated by reference from Exhibit 4.2 to the Registrant’s Current Report on Form 8-K filed on December 1, 2021\n4.7\nForm of 3.050% senior unsecured notes due 2032 (included in the First Supplemental Indenture), which is incorporated by reference from Exhibit 4.3 to the Registrant’s Current Report on Form 8-K, filed on December 1, 2021\n4.8\nBase Indenture, dated as of December 11, 2024, between the \nRegistrant\n and U.S. Bank Trust Company, National Association, as trustee, which is incorporated by reference from Exhibit 4.1 to the Registrant’s Current Report on Form 8-K, filed on December 11, 2024\n4.9\nFirst Supplemental Indenture, dated as of December 11, 2024, relating to the 5.100% senior unsecured notes due 2030 and the 5.500% senior unsecured notes due 2035, between the \nRegistrant\n and U.S. Bank Trust Company, National Association, as trustee, which is incorporated by reference from Exhibit 4.2 to the Registrant’s Current Report on Form 8-K, filed on December 11, 2024\n4.10\nForm of 5.100% senior unsecured notes due 2030 (included in the First Supplemental Indenture), which is incorporated by reference from Exhibit 4.3 to the Registrant’s Current Report on Form 8-K, filed on December 11, 2024\n4.11\nForm of 5.500% senior unsecured notes due 2035 (included in the First Supplemental Indenture), which is incorporated by reference from Exhibit 4.4 to the Registrant’s Current Report on Form 8-K, filed on December 11, 2024\n4.12\nDescription of Securities, which is incorporated by reference from Exhibit 4.9 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 27, 2020 \n10.1†\nCoach, Inc. Non-Qualified Deferred Compensation Plan for Outside Directors, which is incorporated by reference from Exhibit 10.14 to \nt\nhe Registrant’s Annual Report on Form 10-K for the fiscal year ended June 28, 2003\n10.2†\nAmended and Restated Tapestry, Inc. 2001 Employee Stock Purchase Plan, which is incorporated by reference to Appendix C to the Registrant's Definitive Proxy Statement for the 2016 Annual Meeting of Stockholders filed on September 30, 2016\n10.3†\nCoach, Inc. 2004 Stock Incentive Plan, which is incorporated by reference from Appendix A to the Registrant’s Definitive Proxy Statement for the 2004 Annual Meeting of Stockholders, filed on September 29, 2004\n10.4†\nCoach, Inc. 2010 Stock Incentive Plan, which is incorporated by reference from Appendix A to the Registrant’s Definitive Proxy Statement for the 2010 Annual Meeting of Stockholders, filed on September 24, 2010\n10.5†\nAmendment to the Coach, Inc. 2010 Stock Incentive Plan, which is incorporated herein by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed on September 22, 2014\n10.6†\nCoach, Inc. Amended and Restated 2010 Stock Incentive Plan, which is incorporated herein by reference from Appendix B to the Registrant’s Definitive Proxy Statement for the 2014 Annual Meeting of Stockholders, filed on September 26, 2014\n10.7†\nCoach, Inc. Amended and Restated 2010 Stock Incentive Plan (Amended and Restated as of September 18, 2015), which is incorporated herein by reference from Appendix B to the Registrant’s Definitive Proxy Statement for the 2015 Annual Meeting of Stockholders, filed on September 25, 2015\n10.8†\nCoach Inc. Executive Deferred Compensation Plan, effective as of January 1, 2016, which is incorporated herein by reference from Exhibit 10.10 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 29, 2019\n10.9†\nCoach, Inc. Amended and Restated 2010 Stock Incentive Plan (Amended and Restated as of September 23, 2016), which is incorporated herein by reference from Appendix B to the Registrant's Definitive Proxy Statement for the 2016 Annual Meeting of the Stockholders, filed on September 30, 2016\n10.10†\nCoach, Inc. Amended and Restated 2010 Stock Incentive Plan (Amended and Restated as of September 20, 2017), which is incorporated herein by reference from Appendix B to the Registrant's Definitive Proxy Statement for the 2017 Annual Meeting of the Stockholders, filed on September 29, 2017\n10.11†\nTapestry Inc. 2018 Stock Incentive Plan, which is incorporated herein by reference from Appendix B to the Registrant's Definitive Proxy Statement for the 2018 Annual Meeting of Stockholders, filed on September 28, 2018\n10.12†\nForm of Stock Option Grant Notice and Agreement under the Tapestry, Inc. 2018 Stock Incentive Plan, which is incorporated herein by reference from Exhibit 10.14 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 29, 2019\n55\nExhibit\n \nDescription\n10.13†\nForm of Restricted Stock Unit Award Grant Notice and Agreement under the Tapestry, Inc. 2018 Stock Incentive Plan, which is incorporated herein by reference from Exhibit 10.15 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 29, 2019\n10.14†\nForm of Performance Restricted Stock Unit Agreement Grant Notice and Agreement under the Tapestry, Inc. 2018 Stock Incentive Plan, which is incorporated herein by reference from Exhibit 10.16 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 29, 2019\n10.15†\nForm of Stock Option Grant Notice and Agreement for Outside Directors under the Tapestry, Inc. 2018 Stock Incentive Plan, which is incorporated by reference from Exhibit 10.3 to the Registrant's Quarterly Report on Form-Q for the period ended December 29, 2018\n10.16†\nForm of Restricted Stock Unit Grant Notice and Agreement for Outside Directors under the Tapestry, Inc. 2018 Stock Incentive Plan, which is incorporated by reference from Exhibit 10.4 to the Registrant's Quarterly Report on Form 10-Q for the period ended December 29, 2018\n10.17†\nTapestry, Inc. 2018 Performance-Based Annual Incentive Plan, which is incorporated herein by reference from Exhibit 10.1 to the Registrant's Current Report on Form 8-K, filed on August 10, 2018\n10.18\nRedemption Agreement and Amendment to Limited Liability Company Agreement, dated as of August 1, 2016, by and between Legacy Yards LLC, Coach Legacy Yards LLC and Podium Fund Tower C SPV LLC, which is incorporated by reference from Exhibit 10.1 to the Registrant's Quarterly Report on Form 10-Q for the period ended October 1, 2016\n10.19\nLease Agreement, dated as of August 1, 2016, by and between Coach, Inc. and Legacy Yards Tenant LP, which is incorporated by reference from Exhibit 10.1 to the Registrant's Quarterly Report on Form 10-Q for the period ended October 1, 2016\n10.20\nAmended and Restated Development Agreement, dated as of August 1, 2016, by and between ERY Developer LLC and Coach Legacy Yards LLC, which is incorporated by reference from Exhibit 10.3 to the Registrant's Quarterly Report on Form 10-Q for the period ended October 1, 2016\n10.21\nSublease, dated as of September 13, 2017 between Coach, Inc. and The Guardian Life Insurance Company of America, a New York mutual insurance company, which is incorporated by reference from Exhibit 10.1 to the Registrant's Current Report on Form 8-K, filed on September 14, 2017.\n10.22†\nTapestry, Inc. Severance Pay Plan for Vice Presidents and Above, Amended and Restated effective May 9, 2019, which is incorporated herein by reference from Exhibit 10.38 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 29, 2019\n10.23†\nTapestry, Inc. Special Severance Plan, effective August 12, 2019, which is incorporated herein by reference from Exhibit 10.40 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 29, 2019\n10.24†\nAmended & Restated Tapestry Inc. 2018 Stock Incentive Plan, which is incorporated herein by reference from Appendix B to the Registrant's Definitive Proxy Statement for the 2019 Annual Meeting of Stockholders, filed on September 27, 2019\n10.25\nCredit Agreement, dated as of October 24, 2019, by and among \nthe Registr\nant\n, Bank of America, N.A. as Administrative Agent, JPMorgan Chase Bank, N.A. and HSBC Bank USA, N.A., as Co-Syndication Agents, and the other lenders party thereto, incorporated by reference from Exhibit 10.4 to \nthe Registrant\n's \nQuarterly Report on Form 10-Q filed on November 7, 2019\n10.26\nAmendment No. 1, dated May 19, 2020, to the Credit Agreement, dated as of October 24, 2019 by and among \nthe Registr\nant\n,\n Bank of America, N.A. as Administrative Agent, JPMorgan Chase Bank, N.A. and HSBC Bank USA, N.A., as Co-Syndication Agents, and the other lenders party thereto, which is incorporated herein by reference from Exhibit 10.37 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended June 27, 2020 \n10.27†\nSecond Amended and Restated Tapestry Inc. 2018 Stock Incentive Plan, which is incorporated by reference from Appendix B to the Registrant's Definitive Proxy Statement for the 2020 Annual Meeting of Stockholders, filed on September 25, 2020\n10.28†\nLetter Agreement, dated October 24, 2020 between the Registrant and Joanne Crevoiserat, incorporated by reference from Exhibit 10.5 to the Registrant’s Quarterly Report on Form 10-Q for the fiscal quarter ended September 26, 2020\n10.29\nFirst Amendment to Lease, dated as of March 12, 2021, between Legacy Yards Tenant LP, a Delaware limited partnership and \nthe Registrant\n, incorporated by reference from Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q\n10.30†\nLetter Agreement, dated April 12, 2021, between the Registrant and Todd Kahn, incorporated by reference from Exhibit 10.2 to the Registrant’s Quarterly Report on Form 10-Q\n10.31†\nLetter Agreement, dated April 26, 2021, between the Registrant and Scott Roe, incorporated by reference from Exhibit 10.4 to the Registrant’s Quarterly Report on Form 10-Q\n10.32\nWaiver, dated August 11, 2021, to the Credit Agreement, dated as of October 24, 2019 by and among \nt\nh\ne Registra\nnt, \nTapestry, Inc., Bank of America, N.A. as Administrative Agent, JPMorgan Chase Bank, N.A. and HSBC Bank USA, N.A., as Co-Syndication Agents, and the other lenders party thereto, which is incorporated herein by reference from Exhibit 10.44 to the Registrant’s Annual Report on Form 10-K for the fiscal year ended July 3, 2021\n56\nExhibit\n \nDescription\n10.33\nCredit Agreement dated as of May 11, 2022, among \nthe Registran\nt,\n \nthe foreign subsidiary borrowers from time to time party thereto, the lenders from time to time party thereto, and Bank of America, N.A. as administrative agent, incorporated by reference from Exhibit 1.1 to the Registrant’s Current Report on Form 8-K filed on May 12, 2022\n10.34†\nLetter Agreement, dated August 4, 2022, between the Registrant and Scott Roe, incorporated by reference from Exhibit 10.1 to the Registrant’s Current Report on Form 8-K, filed on August 4, 2022\n10.35*†\nLetter Agreement, dated August 11, 2023, between the Registrant and Denise Kulikowsky\n10.36\nAmendment No. 1, dated as of August 30, 2023, to the Credit Agreement, dated as of May 11, 2022, among the \nRegistrant\n, the lenders party thereto and Bank of America, N.A., as administrative agent, which is incorporated herein by reference from Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q filed on November 9, 2023\n10.37\nTermination Agreement, dated November 13, 2024, by and among the \nRegistrant\n, Sunrise Merger Sub, Inc. and Capri Holdings Limited, incorporated herein by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on November 14, 2024\n10.38\nTerm Loan Credit Agreement dated November 21, 2024 by and among the \nRegistrant\n, Bank of America, N.A., as administrative agent, BofA Securities, Inc. and Morgan Stanley Senior Lending, Inc., as joint lead arrangers and the lenders party thereto, incorporated herein by reference from Exhibit 10.2 to the Registrant’s Current Report on Form 8-K filed on November 22, 2024\n10.39\nForm of ASR Agreement, incorporated herein by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on November 22, 2024\n10.40\nAmendment No. 2, dated as of December 20, 2024, to the Credit Agreement, dated as of May 11, 2022 (as amended by Amendment No. 1, dated as of August 30, 2023) among the \nRegistrant\n, the lenders party thereto and Bank of America, N.A., as administrative agent, which is incorporated herein by reference from Exhibit 10.4 to the Registrant’s Quarterly Report on Form 10-Q filed on February 6, 2025\n10.41\nCredit Agreement dated as of May 22, 2025, among \nthe Registr\nant\n, the foreign subsidiary borrowers from time to time party thereto, the lenders party thereto, and Bank of America, N.A., as administrative agent, which is incorporated herein by reference from Exhibit 10.1 to the Registrant’s Current Report on Form 8-K, filed on May 23, 2025\n19.1\nInsider Trading Policies and Procedures of \nthe Registrant, which is\n inc\norporated by reference from \nExhibit 19.1 to the Registr\nant\n's \nAnnual Report on \nForm 10-K filed on Au\ngust 15\n, 2024\n21.1*\n \nList of Subsidiaries of \nthe Regist\nrant\n23.1*\n \nConsent of Deloitte & Touche LLP\n31.1*\n \nRule 13(a)-14(a)/15(d)-14(a) Certification\n of the Registrant's Chief Executive Officer\n31.2*\nRule 13(a)-14(a)/15(d)-14(a) Certification\n of the Registrant's Chief Financial Officer\n32.1*\n \nSection 1350\n Certification of the Registrant's Chief Executive Officer\n32.2*\nSection 1350\n Certification of the Registrant's Chief Financial Officer\n97.1\nClawback Policy of \nthe Registrant\n.\n \nwhich is incorporated by reference from Exhibit 97.1 to the Registrant’s Annual Report on Form 10-K filed on August 15, 2024\n101.INS*\n \nInline XBRL Instance Document\nNote: the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH*\n \nInline XBRL Taxonomy Extension Schema Document\n101.CAL*\n \nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.LAB*\n \nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE*\n \nInline XBRL Taxonomy Extension Presentation Linkbase Document\n101.DEF*\n \nInline XBRL Taxonomy Extension Definition Linkbase Document\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*    Filed herewith\n†    Management contract or compensatory plan or arrangement.\nITEM 16. FORM 10-K SUMMARY\nNone.\n57\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTAPESTRY, INC.\nDate: August 14, 2025\nBy: \n/s/ Joanne C. Crevoiserat\nName: Joanne C. Crevoiserat\nTitle: Chief Executive Officer, and Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities indicated below on August 14, 2025.\nSignature\n \nTitle\n/s/ Joanne C. Crevoiserat\n \nChief Executive Officer, and Director\nJoanne C. Crevoiserat\n(Principal Executive Officer)\n/s/ Scott A. Roe\n \nChief Financial Officer & Chief Operating Officer\nScott A. Roe\n(Principal Financial Officer)\n/s/ Manesh B. Dadlani\nCorporate Controller\nManesh B. Dadlani\n(Principal Accounting Officer)\n/s/ Anne Gates\n \nIndependent Chair, Board of Directors\nAnne Gates\n/s/ John P. Bilbrey\nDirector\nJohn P. Bilbrey\n/s/ Darrell Cavens\n \nDirector\nDarrell Cavens\n/s/ David Elkins\n \nDirector\nDavid Elkins\n/s/ Johanna W. Faber\n \nDirector\nJohanna W. Faber\n/s/ Thomas R. Greco\n \nDirector\nThomas R. Greco\n/s/ Kevin Hourican\nDirector\nKevin Hourican\n/s/ Alan Lau\n \nDirector\nAlan Lau\n/s/ Pam Lifford\n \nDirector\nPam Lifford\n/s/ Annabelle Yu Long\n \nDirector\nAnnabelle Yu Long\n58\nTAPESTRY, INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS AND SUPPLEMENTARY INFORMATION\nPage \nNumber\nReports of Independent Registered Public Accounting Firm (PCAOB ID No. \n34\n)\n60\nConsolidated Financial Statements:\nConsolidated Balance Sheets\n63\nConsolidated Statements of Operations\n64\nConsolidated Statements of Comprehensive Income\n65\nConsolidated Statements of Stockholders’ Equity\n66\nConsolidated Statements of Cash Flows \n67\nNotes to Consolidated Financial Statements\n68\nFinancial Statement Schedules:\n \nSchedule II — Valuation and Qualifying Accounts\n111\nAll other schedules are omitted because they are not applicable or the required information is shown in the Consolidated Financial Statements or Notes thereto.\n59\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of Tapestry, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Tapestry, Inc. and subsidiaries (the \"Company\") as of June 28, 2025 and June 29, 2024, the related consolidated statements of operations, comprehensive income, stockholders' equity, and cash flows, for each of the three years in the period ended June 28, 2025, and the related notes and the financial statement Schedule II listed in the Index to the Consolidated Financial Statements (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 28, 2025 and June 29, 2024, and the results of its operations and its cash flows for each of the three years in the period ended June 28, 2025, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of June 28, 2025, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated August 14, 2025, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nGoodwill and Indefinite-lived Brand Intangible - Kate Spade - Refer to Notes 3 and 14 to the financial statements\nCritical Audit Matter Description\nThe Company’s evaluation of goodwill and indefinite-lived brand intangible assets for impairment involves the comparison of carrying value to their respective fair values. The determination of the fair values requires management to make significant estimates and assumptions related to forecasts of future cash flows and growth rates, as well as discount rates. Changes in these assumptions could have a significant impact on either the fair values, the amount of any impairment charge, or both. For the year ended June 28, 2025, the Company recorded impairment charges of $244.1 million and $610.7 million related to Kate Spade Reporting Unit and Kate Spade indefinite-lived brand intangible, respectively.\nGiven the significant judgments made by management to estimate the fair value of the Kate Spade operations used in both the brand's goodwill and indefinite-lived brand intangible fair value analyses, and the difference between their fair values and carrying values, performing auditing procedures to evaluate the reasonableness of management’s judgments regarding the business and valuation assumptions utilized in the valuation model, particularly the forecasts of future cash flows and growth rates and the selection of the discount rate, and market multiples required a high degree of auditor judgment and an increased extent of effort, including the need to involve our fair value specialists. \nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the forecasts, discount rates, and market multiples used by management to estimate the fair value of the Reporting Unit included the following, among others:\n60\n•\nWe tested the effectiveness of management’s controls over Kate Spade's goodwill and indefinite-lived brand intangible asset impairment evaluations, including controls over the forecasts of future Kate Spade revenue and profit margin, the selection of the discount rate and market multiples.\n•\nWe evaluated management’s ability to accurately project the forecasts by performing a retrospective review of actual results to management's historical forecasts. \n•\nWe evaluated the reasonableness of management’s projected forecasts by:\n◦\nComparing the forecasts to information included in the Company's communications to the Board of Directors, industry reports, and analyst reports for the Company and certain of its peer companies;\n◦\nComparing the forecasts to historical financial results;\n◦\nEvaluating the impact of changes in the regulatory environment on management's forecasts;\n◦\nConducting inquiries with management; and \n◦\nEvaluating whether the forecasts were consistent with evidence obtained in other areas of the audit\n•\nWith the assistance of our fair value specialists, we evaluated the reasonableness valuation approaches for the Kate Spade Reporting Unit and the Kate Spade indefinite-lived brand intangible asset:\n◦\nTesting the inputs underlying the determination of the discount rate and testing the mathematical accuracy of the calculation;\n◦\nDeveloping a range of independent estimates and comparing those to the discount rate selected by management;\n◦\nEvaluating the reasonableness of the selected methodology to value the Kate Spade indefinite-lived brand intangible;\n◦\nEvaluating the reasonableness of the selected guideline public companies as well as benchmarking the selected multiples against these guidelines public companies;\n◦\nTesting the source information underlying the determination of the market multiples;\n◦\nEvaluating the acceptability of the weighting applied to value indications from different valuation techniques; and\n◦\nEvaluating the implied equity premium and the market value of equity\n•\nWe evaluated the reasonableness of the inputs and the mathematical accuracy of the calculation used to calculate the impairment recorded.\n/s/ \nDELOITTE & TOUCHE LLP\n \nNew York, New York\nAugust 14, 2025\nWe have served as the Company's auditor since 2002.\n61\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of Tapestry, Inc. \nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Tapestry, Inc. and subsidiaries (the “Company”) as of June 28, 2025 based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of June 28, 2025, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements and financial statement schedule as of and for the year ended June 28, 2025, of the Company and our report dated August 14, 2025, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ DELOITTE & TOUCHE LLP\nNew York, New York\nAugust 14, 2025\n62\nTAPESTRY, INC.\nCONSOLIDATED BALANCE SHEETS\nJune 28,\n2025\nJune 29,\n2024\n(millions)\nASSETS\n \nCurrent Assets:\n \n \nCash and cash equivalents\n$\n1,100.0\n \n$\n6,142.0\n \nShort-term investments\n19.6\n \n1,061.8\n \nTrade accounts receivable, less allowances for credit losses of $\n5.7\n and $\n6.9\n, respectively\n239.3\n \n228.2\n \nInventories\n860.7\n \n824.8\n \nIncome tax receivable\n277.3\n \n236.2\n \nPrepaid expenses\n133.8\n \n170.9\n \nOther current assets\n98.5\n \n139.8\n \nAssets held for sale\n176.4\n \n—\n \nTotal current assets\n2,905.6\n \n8,803.7\n \nProperty and equipment, net of accumulated depreciation of $\n1,215.0\n and $\n1,263.3\n, respectively\n489.5\n \n514.7\n \nOperating lease right-of-use assets\n1,331.0\n \n1,314.4\n \nGoodwill\n983.3\n \n1,204.1\n \nIntangible assets\n719.6\n \n1,353.6\n \nDeferred income taxes\n33.8\n \n44.1\n \nOther assets\n117.7\n \n161.7\n \nTotal assets\n$\n6,580.5\n \n$\n13,396.3\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\n \n \nCurrent Liabilities:\n \n \nAccounts payable\n$\n456.1\n \n$\n452.2\n \nAccrued liabilities\n736.9\n \n656.3\n \nCurrent portion of operating lease liabilities\n299.0\n \n299.7\n \nCurrent debt\n16.7\n \n303.4\n \nLiabilities held for sale\n48.2\n \n—\n \nTotal current liabilities\n1,556.9\n \n1,711.6\n \nLong-term debt\n2,377.9\n \n6,937.2\n \nLong-term operating lease liabilities\n1,205.6\n \n1,224.2\n \nDeferred income taxes\n79.8\n \n251.3\n \nOther liabilities\n502.5\n \n375.1\n \nTotal liabilities\n5,722.7\n \n10,499.4\n \nSee Note 13 on commitments and contingencies\nStockholders’ Equity:\n \n \nPreferred stock: (authorized \n25.0\n million shares; $\n0.01\n par value) \nnone\n issued\n—\n \n—\n \nCommon stock: (authorized \n1.00\n billion shares; $\n0.01\n par value) issued and outstanding – \n208.1\n million and \n230.2\n million shares, respectively\n2.1\n \n2.3\n \nAdditional paid-in-capital\n3,673.7\n \n3,762.7\n \nRetained earnings (accumulated deficit)\n(\n2,556.8\n)\n(\n722.2\n)\nAccumulated other comprehensive income (loss)\n(\n261.2\n)\n(\n145.9\n)\nTotal stockholders’ equity\n857.8\n \n2,896.9\n \nTotal liabilities and stockholders’ equity\n$\n6,580.5\n \n$\n13,396.3\n \nSee accompanying Notes.\n63\nTAPESTRY, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFiscal Year Ended\n \nJune 28,\n2025\nJune 29,\n2024\nJuly 1,\n2023\n(millions, except per share data)\nNet sales\n$\n7,010.7\n \n$\n6,671.2\n \n$\n6,660.9\n \nCost of sales\n1,721.8\n \n1,781.7\n \n1,946.0\n \nGross profit\n5,288.9\n \n4,889.5\n \n4,714.9\n \nOther selling, general and administrative expenses\n4,019.1\n \n3,749.4\n \n3,542.5\n \nImpairment of goodwill and intangible assets\n854.8\n \n—\n \n—\n \nOperating income (loss)\n415.0\n \n1,140.1\n \n1,172.4\n \nLoss on extinguishment of debt\n120.1\n \n—\n \n—\n \nInterest expense, net\n85.4\n \n125.0\n \n27.6\n \nOther expense (income)\n(\n6.6\n)\n3.2\n \n1.7\n \nIncome (loss) before provision for income taxes\n216.1\n \n1,011.9\n \n1,143.1\n \nProvision for income taxes\n32.9\n \n195.9\n \n207.1\n \nNet income (loss)\n$\n183.2\n \n$\n816.0\n \n$\n936.0\n \nNet income (loss) per share:\n \n \n \nBasic\n$\n0.84\n \n$\n3.56\n \n$\n3.96\n \nDiluted\n$\n0.82\n \n$\n3.50\n \n$\n3.88\n \nShares used in computing net income (loss) per share:\n \n \n \nBasic\n216.8\n \n229.2\n \n236.4\n \nDiluted\n222.5\n \n233.2\n \n241.3\n \nSee accompanying Notes.\n64\n TAPESTRY, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\nFiscal Year Ended\n \nJune 28,\n2025\nJune 29,\n2024\nJuly 1,\n2023\n(millions)\nNet income (loss)\n$\n183.2\n \n$\n816.0\n \n$\n936.0\n \nOther comprehensive income (loss), net of tax:\n \n \n \nUnrealized gains (losses) on cash flow hedging derivatives, net\n(\n57.2\n)\n22.2\n \n37.2\n \nUnrealized gains (losses) on available-for-sale investments, net\n0.2\n \n(\n0.2\n)\n0.5\n \nForeign currency translation adjustments\n(\n58.3\n)\n22.0\n \n(\n56.7\n)\nOther comprehensive income (loss), net of tax\n(\n115.3\n)\n44.0\n \n(\n19.0\n)\nComprehensive income (loss)\n$\n67.9\n \n$\n860.0\n \n$\n917.0\n \nSee accompanying Notes.\n65\nTAPESTRY, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\nShares of Common Stock\nCommon Stock\nAdditional Paid-in-Capital\nRetained Earnings / (Accumulated Deficit)\nAccumulated Other Comprehensive Income (Loss)\nTotal Stockholders' Equity\n(millions, except per share data)\nBalance at July 2, 2022\n241.2\n \n$\n2.4\n \n$\n3,620.2\n \n$\n(\n1,166.2\n)\n$\n(\n170.9\n)\n$\n2,285.5\n \nNet income (loss)\n— \n— \n— \n936.0\n \n— \n936.0\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n(\n19.0\n)\n(\n19.0\n)\nShares issued, pursuant to stock-based compensation arrangements, net of shares withheld for taxes\n4.0\n \n0.1\n \n(\n16.8\n)\n— \n— \n(\n16.7\n)\nShare-based compensation\n— \n— \n78.8\n \n— \n— \n78.8\n \nRepurchase of common stock, including excise tax\n(\n17.8\n)\n(\n0.2\n)\n— \n(\n703.3\n)\n— \n(\n703.5\n)\nDividends declared ($\n1.20\n per share)\n— \n— \n— \n(\n283.3\n)\n— \n(\n283.3\n)\nBalance at July 1, 2023\n227.4\n \n2.3\n \n3,682.2\n \n(\n1,216.8\n)\n(\n189.9\n)\n2,277.8\n \nNet income (loss)\n— \n— \n— \n816.0\n \n— \n816.0\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n44.0\n \n44.0\n \nShares issued, pursuant to stock-based compensation arrangements, net of shares withheld for taxes\n2.8\n \n— \n(\n5.4\n)\n— \n— \n(\n5.4\n)\nShare-based compensation\n— \n— \n85.9\n \n— \n— \n85.9\n \nRepurchase of common stock, including excise tax\n—\n \n— \n— \n— \n— \n—\n \nDividends declared ($\n1.40\n per share)\n— \n— \n— \n(\n321.4\n)\n— \n(\n321.4\n)\nBalance at June 29, 2024\n230.2\n \n2.3\n \n3,762.7\n \n(\n722.2\n)\n(\n145.9\n)\n2,896.9\n \nNet income (loss)\n— \n— \n— \n183.2\n \n— \n183.2\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n(\n115.3\n)\n(\n115.3\n)\nShares issued, pursuant to stock-based compensation arrangements, net of shares withheld for taxes\n6.3\n \n—\n \n119.6\n \n— \n119.6\n \nShare-based compensation\n— \n— \n91.4\n \n— \n— \n91.4\n \nRepurchase of common stock, including excise tax\n(\n28.4\n)\n(\n0.2\n)\n(\n300.0\n)\n(\n1,718.5\n)\n— \n(\n2,018.7\n)\nDividends declared ($\n1.40\n per share)\n— \n— \n—\n \n(\n299.3\n)\n— \n(\n299.3\n)\nBalance at June 28, 2025\n208.1\n \n$\n2.1\n \n$\n3,673.7\n \n$\n(\n2,556.8\n)\n$\n(\n261.2\n)\n$\n857.8\n \nSee accompanying Notes.\n66\nTAPESTRY, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFiscal Year Ended\n \nJune 28,\n2025\nJune 29,\n2024\nJuly 1,\n2023\n(millions)\nCASH FLOWS PROVIDED BY (USED IN) OPERATING ACTIVITIES\n \n \n \nNet income (loss)\n$\n183.2\n \n$\n816.0\n \n$\n936.0\n \nAdjustments to reconcile net income to net cash provided by (used in) operating activities:\n \n \n \nDepreciation and amortization\n162.9\n \n174.0\n \n182.2\n \nImpairment charges\n854.8\n \n—\n \n—\n \nProvision for bad debt\n3.6\n \n4.3\n \n5.7\n \nLoss on extinguishment of debt\n120.1\n \n—\n \n—\n \nShare-based compensation\n87.3\n \n85.9\n \n78.8\n \nAmortization of cloud computing arrangements\n62.0\n \n55.0\n \n42.0\n \nDeferred income taxes\n(\n139.8\n)\n2.5\n \n41.2\n \nChanges to lease related balances, net\n(\n35.0\n)\n(\n42.6\n)\n(\n36.0\n)\nOther non-cash charges, net\n(\n43.2\n)\n(\n7.4\n)\n(\n15.8\n)\nChanges in operating assets and liabilities:\nTrade accounts receivable\n8.8\n \n(\n37.3\n)\n44.1\n \nInventories\n(\n108.2\n)\n85.8\n \n49.9\n \nAccounts payable\n(\n15.0\n)\n49.1\n \n(\n98.1\n)\nAccrued liabilities\n56.0\n \n91.6\n \n(\n93.0\n)\nOther liabilities\n3.9\n \n(\n21.2\n)\n(\n61.1\n)\nOther assets\n15.2\n \n(\n0.1\n)\n(\n100.7\n)\nNet cash provided by (used in) operating activities\n1,216.6\n \n1,255.6\n \n975.2\n \nCASH FLOWS PROVIDED BY (USED IN) INVESTING ACTIVITIES\nPurchases of investments\n(\n1,886.4\n)\n(\n2,713.0\n)\n(\n6.7\n)\nProceeds from maturities and sales of investments\n2,923.1\n \n1,676.3\n \n154.7\n \nPurchases of property and equipment\n(\n122.7\n)\n(\n108.9\n)\n(\n184.2\n)\nSettlement of net investment hedge\n—\n \n103.7\n \n41.9\n \nNet cash provided by (used in) investing activities\n914.0\n \n(\n1,041.9\n)\n5.7\n \nCASH FLOWS PROVIDED BY (USED IN) FINANCING ACTIVITIES\n \n \n \nPayment of dividends\n(\n299.3\n)\n(\n321.4\n)\n(\n283.3\n)\nRepurchase of common stock\n(\n1,718.7\n)\n—\n \n(\n703.5\n)\nShare repurchase not yet settled\n(\n300.0\n)\n—\n \n—\n \nProceeds from issuance of debt, net of discount\n2,248.1\n \n6,089.5\n \n—\n \nPayment of debt issuance costs\n(\n13.4\n)\n(\n78.3\n)\n—\n \nPayment of debt extinguishment costs\n(\n63.5\n)\n—\n \n—\n \nProceeds from share-based awards\n156.1\n \n27.3\n \n38.8\n \nRepayment of debt\n(\n7,163.3\n)\n(\n468.8\n)\n(\n31.2\n)\nTaxes paid to net settle share-based awards\n(\n36.5\n)\n(\n32.7\n)\n(\n55.6\n)\nProceeds from revolving credit facility\n1,016.5\n \n—\n \n—\n \nRepayment of revolving credit facility\n(\n1,000.0\n)\n—\n \n—\n \nOther financing activities\n(\n1.2\n)\n(\n1.2\n)\n(\n1.1\n)\nNet cash provided by (used in) financing activities\n(\n7,175.2\n)\n5,214.4\n \n(\n1,035.9\n)\nEffect of exchange rate changes on cash and cash equivalents\n26.3\n \n(\n12.2\n)\n(\n8.7\n)\nNet (decrease) increase in cash and cash equivalents, including cash classified within assets held for sale\n(\n5,018.3\n)\n5,415.9\n \n(\n63.7\n)\nLess: net (decrease) increase in cash classified within current assets held for sale\n(\n23.7\n)\n—\n \n—\n \nNet (decrease) increase in cash and cash equivalents\n(\n5,042.0\n)\n5,415.9\n \n(\n63.7\n)\nCash and cash equivalents at beginning of year\n6,142.0\n \n726.1\n \n789.8\n \nCash and cash equivalents at end of year\n$\n1,100.0\n \n$\n6,142.0\n \n$\n726.1\n \nSupplemental information:\n \n \n \nCash paid for income taxes, net\n$\n189.5\n \n$\n200.1\n \n$\n231.9\n \nCash paid for interest\n$\n394.9\n \n$\n262.8\n \n$\n82.6\n \nNon-cash investing activity – property and equipment obligations\n$\n25.7\n \n$\n15.1\n \n$\n11.0\n \n \nSee accompanying Notes.\n67\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\n1. \nNATURE OF OPERATIONS\nTapestry, Inc. (the \"Company\") is a house of iconic accessories and lifestyle brands. Our global house of brands unites the magic of Coach and kate spade new york. Each of our brands are unique and independent, while sharing a commitment to innovation and authenticity defined by distinctive products and differentiated customer experiences across channels and geographies. We use our collective strengths to move our customers and empower our communities, to make the fashion industry more sustainable, and to harness the power of an inclusive culture. Individually, our brands are iconic. Together, we can stretch what’s possible.\nThe Coach, Kate Spade and Stuart Weitzman segments include global sales of products to customers through our direct-to-consumer (\"DTC\"), wholesale and licensing businesses. On February 16, 2025, the Company entered into a sale and purchase agreement (the “Purchase Agreement”) with Caleres, Inc. (the “Purchaser”) to sell the Stuart Weitzman Business (defined below). The sale was completed on August 4, 2025. Refer to Note 5, \"Acquisitions and Divestitures,\" and Note 21, \"Subsequent Events,\" for further information.\n2. \nBASIS OF PRESENTATION AND ORGANIZATION\nFiscal Year\nThe Company’s fiscal year ends on the Saturday closest to June 30. Unless otherwise stated, references to years in the financial statements relate to fiscal years. The fiscal year ended June 28, 2025 (“fiscal 2025”) was a 52-week period. The fiscal year ended June 29, 2024 (“fiscal 2024”) was a 52-week period and the fiscal year ended July 1, 2023 (“fiscal 2023”) was a 52-week period. The fiscal year ending June 27, 2026 (“fiscal 2026”) will be a 52-week period.\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and footnotes thereto. Actual results could differ from estimates in amounts that may be material to the financial statements.\nSignificant estimates inherent in the preparation of the consolidated financial statements include reserves for the realizability of inventory; asset retirement obligations; customer returns, end-of-season markdowns and operational chargebacks; useful lives and impairments of long-lived tangible and intangible assets; accounting for income taxes and related uncertain tax positions; accounting for business combinations; the valuation of stock-based compensation awards and related expected forfeiture rates; reserves for restructuring; and reserves for litigation and other contingencies, amongst others.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and all 100% owned and controlled subsidiaries. All intercompany transactions and balances are eliminated in consolidation.\nAdditionally, GAAP requires the consolidation of all entities for which a Company has a controlling voting interest and all variable interest entities (“VIEs”) for which a Company is deemed to be the primary beneficiary. An entity is generally a VIE if it meets any of the following criteria: (i) the entity has insufficient equity to finance its activities without additional subordinated financial support from other parties, (ii) the equity investors cannot make significant decisions about the entity’s operations or (iii) the voting rights of some investors are not proportional to their obligations to absorb the expected losses of the entity or receive the expected returns of the entity and substantially all of the entity’s activities involve or are conducted on behalf of the investor with disproportionately few voting rights.\n \nShare Repurchases\nThe Company accounts for stock repurchases by allocating the repurchase price to common stock and retained earnings. Under Maryland law, the Company's state of incorporation, there are no treasury shares. All repurchased shares are authorized but unissued shares; these shares may be issued in the future for general corporate and other purposes. The Company may terminate or limit the stock repurchase program at any time. The Company accrues for the shares purchased under the share repurchase plan based on the trade date. Purchases of the Company's common stock may be executed through open market purchases including through purchase agreements under Rule 10b5-1, in privately negotiated transactions or in other transactions, including accelerated share repurchase programs. Excise tax on net share repurchases are recorded in Retained earnings as part of Stockholders' Equity.\n \n68\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\n3. \nSIGNIFICANT ACCOUNTING POLICIES\nCash and Cash Equivalents\nCash and cash equivalents consist of cash balances and highly liquid investments with a maturity of three months or less at the date of purchase.\nInvestments\nShort-term investments consist primarily of high-credit quality U.S. and non-U.S. issued corporate debt securities and U.S. Treasuries and government agency securities with original maturities greater than three months and with maturities within one year of balance sheet date, classified as available-for-sale. Long-term investments typically consist of high-credit quality U.S. and non-U.S. issued corporate debt securities, U.S. Treasuries and government agency securities, classified as available-for-sale, and recorded at fair value, with unrealized gains and losses recorded in other comprehensive income. Dividend and interest income are recognized when earned.\nConcentration of Credit Risk\nFinancial instruments that potentially expose the Company to concentration of credit risk consist primarily of Cash and cash equivalents, investments and accounts receivable. The Company places its cash investments with high-credit quality financial institutions and generally invests primarily in corporate debt securities, money market instruments, U.S. government and agency debt securities, commercial paper and bank deposits placed with major banks and financial institutions. Accounts receivable is generally diversified due to the number of entities comprising the Company's customer base and their dispersion across many geographical regions. The Company believes no significant concentration of credit risk exists with respect to these investments and accounts receivable.\nInventories\nThe Company holds inventory that is sold through retail, including e-commerce, and wholesale distribution channels. Substantially all of the Company's inventories are comprised of finished goods and are reported at the lower of cost or net realizable value. Inventory costs include material, conversion costs, freight and duties and are primarily determined on a weighted-average cost basis. The Company reserves for inventory, including slow-moving and aged inventory, based on current product demand, expected future demand and historical experience. A decrease in product demand due to changing customer tastes, buying patterns or increased competition could impact the Company's evaluation of its inventory and additional reserves might be required.\n \nHeld for Sale\n \nAssets and liabilities to be disposed of by sale (\"disposal groups\") are reclassified into assets and liabilities held for sale on the Company's Consolidated Balance Sheets. This reclassification occurs when all the held for sale criteria have been met. Disposal groups are measured at the lower of carrying value or fair value less costs to sell. Assets held for sale are not depreciated or amortized. The Company assesses the recoverability of its disposal groups each reporting period it remains classified as held for sale and if its carrying value exceeds its fair value, less an estimated cost to sell, a loss on the remeasurement is recorded for the excess. Refer to Note 5, \"Acquisitions and Divestitures,\" for further information.\nProperty and Equipment, Net\nProperty and equipment, net is stated at cost less accumulated depreciation including the impact of \nlong-lived asset impairment\n and disposals. Depreciation is calculated on a straight-line basis over the estimated useful lives of the assets. Buildings are depreciated over \nforty years\n and building improvements are depreciated over \nten\n to \nforty years\n. Machinery and equipment are depreciated over lives of \nfive\n to \nseven years\n, furniture and fixtures are depreciated over lives of \nthree\n to \nten years\n and software and computer equipment is generally depreciated over lives of \nthree\n to \nseven years\n. Implementation costs eligible for capitalization related to cloud computing arrangements that are a service contract are recorded within Prepaid expenses and Other assets in the Consolidated Balance Sheets and amortized as Selling, general and administrative (\"SG&A\") expense in the Consolidated Statement of Operations over the term of the associated hosting arrangement. Leasehold improvements are amortized over the shorter of their estimated useful lives or the related lease terms. Maintenance and repair costs are charged to earnings as incurred while expenditures for major renewals and improvements are capitalized.\n69\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nValuation of Long-Lived Assets\nLong-lived assets, such as Property and equipment and Operating lease right-of-use (\"ROU\") assets are evaluated for impairment whenever events or circumstances indicate that the carrying value of the assets may not be recoverable. In evaluating long-lived assets for recoverability, the Company uses its best estimate of future cash flows expected to result from the use of the related asset group and its eventual disposition. To the extent that estimated future undiscounted net cash flows attributable to the asset are less than its carrying value, an impairment loss is recognized equal to the difference between the carrying value of such asset and its fair value, considering external market participant assumptions. The Company recorded $\n8.8\n million and $\n6.3\n million of impairment charges within SG&A expense in the Consolidated Statement of Operations in fiscal 2025 and fiscal 2024, respectively.\nIn determining future cash flows, the Company takes various factors into account, including the effects of macroeconomic trends such as consumer spending, in-store capital investments, promotional cadence, the level of advertising and changes in merchandising strategy. Since the determination of future cash flows is an estimate of future performance, there may be future impairments in the event that future cash flows do not meet expectations.\nGoodwill and Other Intangible Assets\nUpon acquisition, the Company estimates and records the fair value of purchased intangible assets, which primarily consists of brands, customer relationships, right-of-use assets and order backlog. Goodwill and certain other intangible assets deemed to have indefinite useful lives, including brand intangible assets, are not amortized, but are assessed for impairment at least annually. Finite-lived intangible assets are amortized over their respective estimated useful lives and, along with other long-lived assets as noted above, are evaluated for impairment periodically whenever events or changes in circumstances indicate that their related carrying values may not be fully recoverable. Estimates of fair value for finite-lived and indefinite-lived intangible assets are primarily determined using discounted cash flows and the multi-period excess earnings method, respectively, with consideration of market comparisons when appropriate. This approach uses significant estimates and assumptions, including projected future cash flows, discount rates and growth rates.\nThe Company generally performs its annual goodwill and indefinite-lived intangible assets impairment analysis using a quantitative approach. The quantitative goodwill impairment test identifies the existence of potential impairment by comparing the fair value of each reporting unit with its carrying value, including goodwill. If the fair value of a reporting unit exceeds its carrying value, the reporting unit's goodwill is considered not to be impaired. If the carrying value of a reporting unit exceeds its fair value, an impairment charge is recognized in an amount equal to that excess. The impairment charge recognized is limited to the amount of goodwill allocated to that reporting unit.\nDetermination of the fair value of a reporting unit and intangible asset is based on management's assessment, considering independent third-party appraisals when necessary. Furthermore, this determination is judgmental in nature and often involves the use of significant estimates and assumptions, which may include projected future cash flows, discount rates, growth rates and determination of appropriate market comparables and recent transactions. These estimates and assumptions could have a significant impact on whether or not an impairment charge is recognized and the amount of any such charge. \nThe Company performs its annual impairment assessment of goodwill as well as brand intangibles during the fourth quarter of each fiscal year or if an event occurs that would more likely than not reduce the fair value below its carrying amount. In fiscal 2025, the Company recorded a goodwill impairment charge of $\n244.1\n million related to the Kate Spade reporting unit and an intangible impairment charge of $\n610.7\n million related to the Kate Spade indefinite-lived brand intangible asset within \nImpairment of goodwill and intangible assets\n in the Consolidated Statement of Operations. The Company determined that there was \nno\n impairment in fiscal 2024.\n70\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nSupplier Finance Program\nTo improve our working capital efficiency, the Company makes available to certain suppliers a voluntary supply chain finance (“SCF”) program that enables our suppliers to sell their receivables from the Company to a global financial institution on a non-recourse basis at a rate that leverages our credit rating. The Company does not have the ability to refinance or modify payment terms to the global financial institution through the SCF program. No guarantees are provided by the Company or any of our subsidiaries under the SCF program. The Company’s payment obligations, including the amounts due and payment terms, which generally do not exceed \n90\n days, are not impacted by suppliers’ participation in the program.\n As of June 28, 2025 and June 29, 2024, $\n272.8\n million and $\n294.9\n million, respectively, was related to suppliers eligible to participate in the Company's SCF program. \nA rollforward of the outstanding obligations confirmed as valid under the SCF program, which are presented within \nAccounts payable\n on the Consolidated Balance Sheets, is presented below:\nJune 28,\n2025\nJune 29,\n2024\n(millions)\nObligations outstanding, beginning of year\n$\n294.9\n \n$\n305.4\n \nInvoices added during the year\n1,455.2\n \n1,349.8\n \nInvoices settled during the year\n(\n1,477.3\n)\n(\n1,360.3\n)\nObligations outstanding, end of year\n$\n272.8\n \n$\n294.9\n \nOperating Leases\nThe Company leases retail space, office space, warehouse facilities, fulfillment centers, storage space, machinery, equipment and certain other items under operating leases. These leases may also include rent escalation clauses or lease incentives in the form of construction allowances and rent reduction. In determining the lease term used in the lease right-of-use (\"ROU\") asset and lease liability calculations, the Company considers various factors such as market conditions and the terms of any renewal or termination options that may exist. When deemed reasonably certain, the renewal and termination options are included in the determination of the lease term and calculation of the lease ROU asset and lease liability. The Company is typically required to make fixed minimum rent payments, variable rent payments primarily based on performance (i.e., percentage-of-sales-based payments), or a combination thereof, directly related to its ROU asset. The Company is also often required, by the lease, to pay for certain other costs including real estate taxes, insurance, common area maintenance fees and/or certain other costs, which may be fixed or variable, depending upon the terms of the respective lease agreement. To the extent these payments are fixed, the Company has included them in calculating the lease ROU assets and lease liabilities.\nThe Company calculates lease ROU assets and lease liabilities as the present value of fixed lease payments over the reasonably certain lease term beginning at the commencement date. Per the guidance, the use of the implicit rate to determine the present value of lease payments is required. As the rate implicit in the Company's leases is not readily determinable, the Company uses its incremental borrowing rate based on the information available at the lease commencement date, including the Company's credit rating, credit spread and adjustments for the impact of collateral, lease tenors, economic environment and currency.\nFor operating leases, fixed lease payments are recognized as operating lease cost on a straight-line basis over the lease term. For finance leases and impaired operating leases, the ROU asset is depreciated on a straight-line basis over the remaining lease term, along with recognition of interest expense associated with accretion of the lease liability. For leases with a lease term of 12 months or less (\"short-term lease\"), any fixed lease payments are recognized on a straight-line basis over such term and are not recognized on the Consolidated Balance Sheets. Variable lease cost for both operating and finance leases, if any, is recognized as incurred.\nAsset retirement obligations represent legal obligations associated with the retirement of a tangible long-lived asset. The Company’s asset retirement obligations are primarily associated with leasehold improvements in which the Company is contractually obligated to remove at the end of a lease to comply with the lease agreement. When such an obligation exists, the Company recognizes an asset retirement obligation at the inception of a lease at its estimated fair value. The asset retirement obligation is recorded in current liabilities or non-current liabilities (based on the expected timing of payment of the related costs) and is subsequently adjusted for any changes in estimates. The associated estimated asset retirement costs are capitalized as part of the carrying amount of the long-lived asset and depreciated over its useful life.\n As of the end of fiscal 2025 and fiscal 2024, the Company had asset retirement obligations of $\n58.4\n million and $\n57.7\n million, respectively, primarily classified within Other non-current liabilities in the Company's Consolidated Balance Sheets.\n71\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nRevenue Recognition\nRevenue is recognized when the Company satisfies its performance obligations by transferring control of promised products or services to its customers, which may be at a point of time or over time. Control is transferred when the customer obtains the ability to direct the use of and obtain substantially all of the remaining benefits from the products or services. The amount of revenue recognized is the amount of consideration to which the Company expects to be entitled, including estimation of sale terms that may create variability in the consideration. Revenue subject to variability is constrained to an amount which will not result in a significant reversal in future periods when the contingency that creates variability is resolved.\nRetail store and concession shop-in-shop revenues are recognized at the point-of-sale, when the customer obtains physical possession of the products. Digital revenue from sales of products ordered through the Company’s e-commerce sites is recognized upon delivery and receipt of the shipment by its customers and includes shipping and handling charges paid by customers. Retail and digital revenues are recorded net of estimated returns, which are estimated by developing an expected value based on historical experience. Payment is due at the point of sale.\nThe Company recognizes revenue within the wholesale business at the time title passes and risk of loss is transferred to customers, which is generally at the point of shipment of products but may occur upon receipt of the shipment by the customer in certain cases. Wholesale revenue is recorded net of estimates for returns, discounts, end-of-season markdowns, cooperative advertising allowances and other consideration provided to the customer. The Company's historical estimates of these variable amounts have not differed materially from actual results.\nThe Company recognizes licensing revenue over time during the contract period in which licensees are granted access to the Company's trademarks. These arrangements require licensees to pay a sales-based royalty and may include a contractually guaranteed minimum royalty amount. Revenue for contractually guaranteed minimum royalty amounts is recognized ratably over the license year and any excess sales-based royalties are recognized as earned once the minimum royalty threshold is achieved.\nGift cards issued by the Company are recorded as a liability until they are redeemed, at which point revenue is recognized. The Company also uses historical information to estimate the amount of gift card balances that will never be redeemed and recognizes that amount as revenue over time in proportion to actual customer redemptions if the Company does not have a legal obligation to remit unredeemed gift cards to any jurisdiction as unclaimed property.\nThe Company accounts for sales taxes and other related taxes on a net basis, excluding such taxes from revenue.\nRefer to Note 4, \"Revenue,\" for additional information.\nCost of Sales\nCost of sales consists of inventory costs and other related costs such as reserves for inventory realizability and shrinkage, damages and replacements.\nSelling, General and Administrative (\"SG&A\") Expenses\nSelling expenses include store employee compensation, occupancy costs, depreciation, supply costs, wholesale and retail account administration compensation globally. These expenses are affected by the number of stores open during any fiscal period and store performance, as compensation and rent expenses can vary with sales. Advertising, marketing and design expenses include employee compensation, media space and production, advertising agency fees, new product design costs, public relations and market research expenses. Distribution and customer service expenses include warehousing, order fulfillment, shipping and handling, customer service, employee compensation and bag repair costs. SG&A expenses also include compensation costs for corporate functions, including the executive, finance, human resources, legal and information systems departments, as well as corporate headquarters occupancy costs, consulting fees, loss on remeasurement of the business held for sale and software expenses.\nShipping and Handling\nShipping and handling costs for delivery of products to consumers were $\n222.0\n million, $\n221.1\n million and $\n217.0\n million in fiscal 2025, fiscal 2024 and fiscal 2023, respectively, and are included in SG&A expenses. The Company includes inbound product-related transportation costs from manufacturers within Cost of sales. The balance of the Company's transportation-related costs related to its distribution network is included in SG&A expenses rather than in Cost of sales.\n72\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nAdvertising\nAdvertising costs include expenses related to direct marketing activities, such as digital and other media and production costs.\n In fiscal 2025, fiscal 2024 and fiscal 2023, advertising expenses for the Company totaled $\n744.5\n million, $\n616.8\n million and $\n570.7\n million, respectively, and are included in SG&A expenses. Advertising costs are generally expensed when the advertising first appears.\nShare-Based Compensation\nThe Company recognizes the cost of equity awards to employees and the non-employee Directors based on the grant-date fair value of those awards. The grant-date fair values of share unit awards are based on the fair value of the Company's common stock on the date of grant. The grant-date fair value of stock option awards is determined using the Black-Scholes option pricing model and involves several assumptions, including the expected term of the option, expected volatility and dividend yield. The expected term of options represents the period of time that the options granted are expected to be outstanding and is based on historical experience. Expected volatility is based on historical volatility of the Company’s stock as well as the implied volatility from publicly traded options on the Company's stock. Dividend yield is based on the current expected annual dividend per share and the Company’s stock price. Changes in the assumptions used to determine the Black-Scholes value could result in significant changes in the Black-Scholes value. \nThe Company recognizes share-based compensation net of estimated forfeitures and revises the estimates in subsequent periods if actual forfeitures differ from the estimates. The Company estimates the forfeiture rate based on historical experience as well as expected future behavior.\nThe Company grants performance-based share awards to key executives, the vesting of which is subject to the executive’s continuing employment and the Company's or individual's achievement of certain performance goals. On a quarterly basis, the Company assesses actual performance versus the predetermined performance goals and adjusts the share-based compensation expense to reflect the relative performance achievement. Actual distributed shares are calculated upon conclusion of the service and performance periods and include dividend equivalent shares. If the performance-based award incorporates a market condition, the grant-date fair value of such award is determined using a pricing model, such as a Monte Carlo Simulation.\nIncome Taxes\nThe Company’s effective tax rate is based on pre-tax income, statutory tax rates, tax laws and regulations and tax planning strategies available in the various jurisdictions in which the Company operates. The Company classifies interest and penalties on uncertain tax positions in the Provision for income taxes. The Company records net deferred tax assets to the extent it believes that it is more likely than not that these assets will be realized. In making such determination, the Company considers all available evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies and recent and expected future results of operation. The Company reduces deferred tax assets by a valuation allowance if, based upon the weight of available evidence, it is more likely than not that some amount of deferred tax assets is not expected to be realized. The Company is not permanently reinvested with respect to earnings of a limited number of foreign entities and has recorded the tax consequences of remitting earnings from these entities. The Company is permanently reinvested with respect to all other earnings.\nThe Company recognizes the impact of tax positions in the financial statements if those positions will more likely than not be sustained on audit, based on the technical merits of the position. Although the Company believes that the estimates and assumptions used are reasonable and legally supportable, the final determination of tax audits could be different than that which is reflected in historical tax provisions and recorded assets and liabilities. Tax authorities periodically audit the Company’s income tax returns, these tax authorities may take a contrary position that could result in a significant impact on the Company's results of operations. Significant management judgment is required in determining the effective tax rate, in evaluating tax positions and in determining the net realizable value of deferred tax assets.\nRefer to Note 15, \"Income Taxes,\" herein for further discussion on the Company's income taxes.\n73\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nDerivative Instruments\nThe majority of the Company’s purchases of finished goods are denominated in U.S. dollars, which limits the Company’s exposure to the transactional effects of foreign currency exchange rate fluctuations. However, the Company is exposed to foreign currency exchange risk related to its sale of U.S. dollar inventory to foreign operating subsidiaries in local currency, as well as risk related to various cross-currency intercompany loans and payables, and translation risk. The Company is also exposed to foreign currency risk related to changes in the U.S. dollar value of its net investment in foreign subsidiaries. The Company uses derivative financial instruments to manage these risks. These derivative transactions are in accordance with the Company’s risk management policies. The Company does not enter into derivative transactions for speculative or trading purposes.\nThe Company records all derivative contracts at fair value on the Consolidated Balance Sheets. The fair values of foreign currency derivatives are based on the forward curves of the specific indices upon which settlement is based and include an adjustment for the counterparty's or Company’s credit risk. Judgment is required of management in developing estimates of fair value. The use of different market assumptions or methodologies could affect the estimated fair value.\nFor cash flow derivative instruments that qualify for hedge accounting, the changes in the fair value of these instruments are recognized as a component of Accumulated other comprehensive income (loss) (\"AOCI\") until the hedged item is recognized in earnings. For derivative instruments that are designated as a net investment hedge, the changes in the fair value of the instruments are recognized as a component of AOCI and, upon discontinuation of the hedge, remain in AOCI until the net investment is sold or liquidated.\nEach derivative instrument entered into by the Company that qualifies for hedge accounting is expected to be highly effective at reducing the risk associated with the exposure being hedged. For each derivative that is designated as a hedge, the Company documents the related risk management objective and strategy, including identification of the hedging instrument, the hedged item and the risk exposure, as well as how hedge effectiveness will be assessed over the term of the instrument. The extent to which a hedging instrument has been and is expected to remain highly effective in achieving offsetting changes in fair value or cash flows is assessed and documented by the Company on at least a quarterly basis.\nIf it is determined that a derivative instrument has not been highly effective and will continue not to be highly effective in hedging the designated exposure, hedge accounting is discontinued and further gains (losses) are recognized in earnings within foreign currency gains (losses) or interest income (expense). Upon discontinuance of hedge accounting, the cumulative change in fair value of cash flow derivatives previously recorded in AOCI is recognized in earnings when the related hedged item affects earnings, consistent with the original hedging strategy, unless the forecasted transaction is no longer probable of occurring, in which case the accumulated amount is immediately recognized in earnings within foreign currency gains (losses) or interest income (expense).\nFor foreign currency derivative instruments which are not designated as hedges, the changes in fair value of the instruments are recorded through earnings. These changes generally offset the revaluation of certain underlying assets and liabilities.\nAs a result of the use of derivative instruments, the Company may be exposed to the risk that the counterparties to such contracts will fail to meet their contractual obligations. To mitigate this counterparty credit risk, the Company has a policy of only entering into contracts with carefully selected financial institutions based upon an evaluation of their credit ratings, among other factors.\nThe fair values of the Company’s derivative instruments are recorded on its Consolidated Balance Sheets on a gross basis. For cash flow reporting purposes, the Company classifies proceeds received or amounts paid upon the settlement of a derivative instrument in the same manner as the related item being hedged, primarily within cash from operating activities.\n74\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nHedging Portfolio\nThe Company enters into forward currency contracts primarily to reduce its risks related to exchange rate fluctuations on foreign currency denominated inventory transactions, as well as various cross-currency intercompany loans and payables. This primarily includes exposure to exchange rate fluctuations in the Japanese Yen, the Chinese Renminbi and the Canadian Dollar. To the extent its derivative contracts designated as cash flow hedges are highly effective in offsetting changes in the value of the hedged items, the related gains (losses) are initially deferred in AOCI and subsequently recognized in the Consolidated Statements of Operations as part of the cost of the inventory purchases being hedged within Cost of sales, when the related inventory is sold to a third-party. Current maturity dates range from July 2025 to March 2027. Forward foreign currency exchange contracts which are not designated as hedges of intercompany and other contractual obligations are recognized within Other expense (income) on the Company's Consolidated Statement of Operations. The maturity date of most instruments held as of June 28, 2025 range from August 2025 to September 2025, and such contracts are typically renewed upon maturity if the related balance has not been settled.\nDuring fiscal 2024, the Company also entered into interest rate derivative contracts to reduce its risks related to changes in the benchmark interest rates on its debt obligations. Any premiums related to these instruments were excluded from the Company's measurement of hedge effectiveness and were amortized over the period between the hedge execution and the contract maturity. The related gains (losses) were initially deferred in AOCI and are subsequently recognized in the Consolidated Statements of Operations as interest income (expense) in the same periods during which the hedged interest payments associated with the Company’s borrowings are recorded in earnings. As of June 28, 2025 and June 29, 2024, there were no interest rate derivative contracts outstanding.\nThe Company also enters into cross-currency swaps to reduce its risks related to exchange rate fluctuations on net investments in foreign subsidiaries, including our net investment in Euro-denominated subsidiaries, Japanese Yen-denominated subsidiaries and Chinese Renminbi subsidiaries against future volatility in the exchange rates between the United States dollar and their local currencies. The related gains (losses) are deferred in AOCI until the net investment is sold or liquidated, and current maturity dates range from November 2027 to March 2035.\nForeign Currency\nThe functional currency of the Company's foreign operations is generally the applicable local currency. Assets and liabilities are translated into U.S. dollars using the current exchange rates in effect at the balance sheet date, while revenues and expenses are translated at the weighted-average exchange rates for the period. The resulting translation adjustments are included in the Consolidated Statements of Comprehensive Income as a component of Other comprehensive income (loss) (“OCI”) and in the Consolidated Statements of Equity within AOCI. \nThe Company recognizes gains and losses on transactions that are denominated in a currency other than the respective entity's functional currency in earnings. Foreign currency transaction gains and losses also include amounts realized on the settlement of certain intercompany loans with foreign subsidiaries.\nRecently Adopted Accounting Pronouncements\nIn November 2023, the Financial Accounting Standards Board (the \"FASB\") issued Accounting Standards Update (\"ASU\") No. 2023-07, \"Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\", which expands reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses. The amendments will require public entities to disclose significant segment expenses that are regularly provided to the chief operating decision maker and included within segment profit and loss. The amendments will be effective for the Company's annual reporting periods beginning in fiscal year 2025 and for interim periods beginning in fiscal year 2026, with early adoption permitted, and will be applied retrospectively to all prior periods presented in the financial statements. The Company adopted ASU 2023-07 for fiscal year 2025. The adoption of ASU 2023-07 did not have an impact on the Company's consolidated financial statements other than the new disclosure requirements. Refer to Note 17, \"Segment Information\", for additional information.\nRecently Issued Accounting Pronouncements\nIn December 2023, the FASB issued ASU No. 2023-09, \"Income Taxes (Topic 740): Improvements to Income Tax Disclosures\", which includes amendments that further enhance income tax disclosures, primarily through standardization and disaggregation of rate reconciliation categories and income taxes paid by jurisdiction. The amendments are effective for the Company's annual periods beginning in fiscal year 2026, with early adoption permitted, and should be applied either prospectively or retrospectively. The Company is currently evaluating the ASU to determine its impact on the Company's disclosures.\n75\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nIn November 2024, the FASB issued ASU No. 2024-03, \"Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\", which is intended to improve the disclosures about expenses and address requests from investors for more detailed information about the types of costs and expenses included in certain expense captions presented on the income statement. The amendments will be effective for the Company's annual reporting periods beginning in fiscal year 2028 and for interim periods beginning in fiscal year 2029, with early adoption permitted. The amendments may be applied retrospectively to all prior periods presented in the financial statements or prospectively upon adoption. The Company is currently evaluating the ASU to determine its impact on the Company's disclosures.\n4. \nREVENUE\nThe Company recognizes revenue primarily from sales of the products of its brands through our Direct-to-consumer (\"DTC\") business, which includes our retail stores and e-commerce sites, along with our wholesale business. The Company also generates revenue from royalties related to licensing its trademarks, as well as sales in ancillary business channels. In all cases, revenue is recognized upon the transfer of control of the promised products or services to the customer, which may be at a point in time or over time. Control is transferred when the customer obtains the ability to direct the use of and obtain substantially all of the remaining benefits from the products or services. The amount of revenue recognized is the amount of consideration to which the Company expects to be entitled, including estimation of sale terms that may create variability in the consideration. Revenue subject to variability is constrained to an amount which will not result in a significant reversal in future periods when the contingency that creates variability is resolved.\nThe Company has elected a practical expedient not to disclose the remaining performance obligations that are unsatisfied as of the end of the period related to contracts with an original duration of one year or less or variable consideration related to sales-based royalty arrangements. There are no other contracts with transaction price allocated to remaining performance obligations other than future minimum royalties as discussed above, which are not material.\nOther practical expedients elected by the Company include (i) assuming no significant financing component exists for any contract with a duration of one year or less, (ii) accounting for shipping and handling as a fulfillment activity within SG&A expense regardless of the timing of the shipment in relation to the transfer of control and (iii) excluding sales and value added tax from the transaction price.\nDirect-to-Consumer \nThe Company recognizes revenue in its retail stores, including concession shop-in-shops, at the point-of-sale when the customer obtains physical possession of the products. Digital revenue from sales of products ordered through the Company's e-commerce sites is recognized upon delivery and receipt of the shipment by its customers and includes shipping and handling charges paid by customers. Retail and digital revenues are recorded net of estimated returns, which are estimated by developing an expected value based on historical experience. Payment is due at the point of sale.\nGift cards issued by the Company are recorded as a liability until redeemed by the customer, at which point revenue is recognized. The Company also uses historical information to estimate the amount of gift card balances that will never be redeemed and recognizes that amount as revenue over time in proportion to actual customer redemptions if the Company does not have a legal obligation to remit unredeemed gift cards to any jurisdiction as unclaimed property.\nCertain of the Company's retail operations use sales incentive programs, such as customer loyalty programs and the issuance of coupons. Loyalty programs provide the customer a material right to acquire additional products and give rise to the Company having a separate performance obligation. Additionally, certain products sold by the Company include an assurance warranty that is not considered a separate performance obligation. These programs are immaterial individually and in the aggregate.\nWholesale\nThe Company recognizes revenue within the wholesale channel at the time title passes and risk of loss is transferred to customers, which is generally at the point of shipment of products but may occur upon receipt of the shipment by the customer in certain cases. Payment is generally due \n30\n to \n90\n days after shipment. Wholesale revenue is recorded net of estimates for returns, discounts, end-of-season markdowns, cooperative advertising allowances and other consideration provided to the customer. Discounts are based on contract terms with the customer, while cooperative advertising allowances and other consideration may be based on contract terms or negotiated on a case-by-case basis. Returns and markdowns generally require approval from the Company and are estimated based on historical trends, current season results and inventory positions at the \n76\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nwholesale locations, current market and economic conditions as well as, in select cases, contractual terms. The Company's historical estimates of these variable amounts have not differed materially from actual results.\nLicensing\nThe Company recognizes licensing revenue over time during the contract period in which licensees are granted access to the Company's trademarks. These arrangements require licensees to pay a sales-based royalty and may include a contractually guaranteed minimum royalty amount. Revenue for contractually guaranteed minimum royalty amounts is recognized ratably over the license year and any excess sales-based royalties are recognized as earned once the minimum royalty threshold is achieved. Payments from the customer are generally due quarterly in an amount based on the licensee's sales of goods bearing the licensed trademarks during the period, which may differ from the amount of revenue recorded during the period thereby generating a contract asset or liability. Contract assets and liabilities and contract costs related to the licensing arrangements are immaterial as the licensing business represents approximately \n1\n% of total net sales in the fiscal year ended June 28, 2025.\nDisaggregated Net Sales\nThe following table disaggregates the Company's net sales into geographies that depict how economic factors may impact the revenues and cash flows for the periods presented. \nEach geography presented includes net sales related to the Company's directly operated business channels, global travel retail business and to wholesale customers, including distributors, in locations within the specified geographic area.\nNorth America\nGreater China\n(1)\nOther Asia\n(2)\nOther\n(3)\nTotal\n(millions)\nFiscal 2025\nCoach\n$\n3,429.6\n \n$\n970.2\n \n$\n769.6\n \n$\n429.1\n \n$\n5,598.5\n \nKate Spade\n933.3\n \n43.7\n \n125.1\n \n95.0\n \n1,197.1\n \nStuart Weitzman\n153.6\n \n45.8\n \n0.4\n \n15.3\n \n215.1\n \nTotal\n$\n4,516.5\n \n$\n1,059.7\n \n$\n895.1\n \n$\n539.4\n \n$\n7,010.7\n \nFiscal 2024\nCoach\n$\n3,078.7\n \n$\n902.1\n \n$\n771.4\n \n$\n343.1\n \n$\n5,095.3\n \nKate Spade\n1,074.4\n \n45.3\n \n130.1\n \n84.6\n \n1,334.4\n \nStuart Weitzman\n160.9\n \n65.2\n \n1.4\n \n14.0\n \n241.5\n \nTotal\n$\n4,314.0\n \n$\n1,012.6\n \n$\n902.9\n \n$\n441.7\n \n$\n6,671.2\n \nFiscal 2023\nCoach\n$\n3,037.5\n \n$\n896.7\n \n$\n752.9\n \n$\n273.3\n \n$\n4,960.4\n \nKate Spade\n1,142.8\n \n47.9\n \n140.4\n \n87.8\n \n1,418.9\n \nStuart Weitzman\n180.0\n \n71.2\n \n1.8\n \n28.6\n \n281.6\n \nTotal\n$\n4,360.3\n \n$\n1,015.8\n \n$\n895.1\n \n$\n389.7\n \n$\n6,660.9\n \n(1)\n    Greater China includes mainland China, Taiwan, Hong Kong SAR, and Macao SAR.\n(2)\n    Other Asia includes Japan, Malaysia, Australia, South Korea, Singapore, and other countries primarily within Asia.\n(3)\n    Other sales primarily represents sales in Europe and the Middle East as well as royalties earned from the Company's licensing partners.\n77\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nDeferred Revenue\nDeferred revenue results from cash payments received or receivable from customers prior to the transfer of the promised goods or services and is primarily related to unredeemed gift cards, net of breakage, which have been recognized. Additional deferred revenue may result from sales-based royalty payments received or receivable which exceed the revenue recognized during the contractual period. The balance of such amounts as of June 28, 2025 and June 29, 2024 was $\n38.0\n million and $\n45.5\n million, respectively, which were primarily recorded within Accrued liabilities on the Company's Consolidated Balance Sheets and are generally expected to be recognized as revenue within a year. For the fiscal year ended June 28, 2025, net sales of $\n24.2\n million were recognized from amounts recorded as deferred revenue as of June 29, 2024. For the fiscal year ended June 29, 2024, net sales of $\n27.7\n million were recognized from amounts recorded as deferred revenue as of July 1, 2023.\n5. \nACQUISITIONS AND DIVESTITURES\nStuart Weitzman Business Divestiture\nOn February 16, 2025, the Company entered into a sale and purchase agreement (the “Purchase Agreement”) with Caleres, Inc. (the “Purchaser”) to sell the Stuart Weitzman Business (as defined below). The Purchaser acquired certain assets and liabilities of the Company's global business of designing, manufacturing, promotion, marketing, production, distribution, sales and licensing of Stuart Weitzman branded products (the \"Stuart Weitzman Business\") for total cash consideration of $\n105.0\n million (the \"Purchase Price\"). The Purchase Price is subject to customary adjustments for cash, indebtedness, net working capital and transaction expenses. The sale was completed on August 4, 2025 (the \"Stuart Weitzman Business Divestiture\"). Refer to Note 21, \"Subsequent Events,\" for further information.\nIn fiscal 2025, the Company determined that certain assets and liabilities related to the Company's Stuart Weitzman Business met the criteria for classification as held for sale. The planned sale of the Stuart Weitzman Business does not represent a strategic shift that will have a major effect on the Company's operations and financial results and therefore does not qualify for presentation as a discontinued operation. The assets and liabilities of the Stuart Weitzman Business are recorded at the lower of their carrying values or estimated fair values, less any costs to sell. \nIn fiscal 2025, the Company incurred total pre-tax charges related to the Stuart Weitzman Business Divestiture of $\n23.7\n million primarily due to the loss on remeasurement of the business held for sale, professional fees, share-based compensation expense and store impairment which were recorded in selling, general and administrative (\"SG&A\") expenses mainly within the Corporate segment on the Consolidated Statements of Operations. \nAs of June 28, 2025, the assets and liabilities relating to the Stuart Weitzman Business are presented in the Consolidated Balance Sheet as Assets held for sale and Liabilities held for sale. Long-lived assets classified as held for sale are not depreciated or amortized.\n78\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nThe following table presents the major classes of assets and liabilities that were classified as assets and liabilities held for sale, respectively, in the Consolidated Balance Sheets:\nJune 28, 2025\n(millions)\nAssets held for sale:\nCash and cash equivalents\n$\n23.7\n \nTrade accounts receivable, net\n10.5\n \nInventories\n91.5\n \nPrepaid expenses\n1.7\n \nOther current assets\n8.5\n \nProperty and equipment, net\n7.3\n \nOperating lease right-of-use assets\n25.5\n \nIntangible assets\n18.2\n \nDeferred income taxes\n0.1\n \nOther assets\n2.1\n \nAllowance for reduction of assets held for sale\n(1)\n(\n12.7\n)\nTotal assets held for sale\n$\n176.4\n \nLiabilities held for sale:\nAccounts payable\n$\n8.4\n \nAccrued liabilities\n11.2\n \nCurrent portion of operating lease liabilities\n9.9\n \nLong-term operating lease liabilities\n17.0\n \nOther liabilities\n1.7\n \nTotal liabilities held for sale\n$\n48.2\n \n(1)\nIn connection with the held for sale classification, the Company recognized a $\n12.7\n million pre-tax loss on the remeasurement of the assets and liabilities of the Stuart Weitzman Business. This impairment was charged to a contra asset account, Allowance for reduction of assets held for sale, within Total assets held for sale.\n79\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nCapri Holdings Limited Acquisition\nOn August 10, 2023, the Company entered into an Agreement and Plan of Merger (the \"Merger Agreement\") by and among the Company, Sunrise Merger Sub, Inc., a direct wholly owned subsidiary of Tapestry (\"Merger Sub\"), and Capri Holdings Limited (\"Capri\" and, together with us and Merger Sub, the \"Parties\"), pursuant to which, among other things, Merger Sub would merge with and into Capri (the \"Merger\") with Capri surviving the Merger and continuing as a wholly owned subsidiary of the Company (\"the Capri Acquisition\"). On April 22, 2024, the FTC filed a complaint against the Company and Capri in the United States District Court for the Southern District of New York seeking to enjoin the consummation of the Capri Acquisition, and on October 24, 2024, the Court issued its Opinion and Order granting the FTC's request for a preliminary injunction of the Merger, pending an administrative trial on the merits which was scheduled to begin on December 9, 2024. On October 28, 2024, the Company and Capri filed a Notice of Appeal with respect to the October 24, 2024 Opinion and Order. On November 6, 2024, the United States Court of Appeals for the Second Circuit entered an order setting an expedited briefing schedule for the appeal of the decision of the United States District Court of the Southern District of New York granting the preliminary injunction of the merger. On November 13, 2024, the Parties entered into a Termination Agreement (the “Termination Agreement”), pursuant to which the Parties agreed to terminate the Merger Agreement, including all schedules and exhibits thereto and all ancillary agreements contemplated thereby or entered pursuant thereto (the “Termination Date”), effective immediately. Pursuant to the Termination Agreement, the Company agreed to reimburse Capri for its expenses in an amount equal to $\n45.1\n million in cash on November 14, 2024. The Parties also agreed to release each other from claims, demands, damages, actions, causes of action and liability relating to or arising out of the Merger Agreement and the transactions contemplated therein or thereby. Following termination of the Merger Agreement, the Parties and the FTC filed a stipulation withdrawing the appeal to the United States Court of Appeals for the Second Circuit on November 19, 2024 and the Second Circuit dismissed the appeal on November 20, 2024. The Parties and the FTC also filed a Joint Motion to dismiss the complaint in the administrative trial on November 15, 2024 and the FTC dismissed the complaint on December 4, 2024. \nIn order to finance the Capri Acquisition, on November 27, 2023, the Company issued $\n4.50\n billion of senior unsecured notes (the \"Capri Acquisition USD Senior Notes\") and €\n1.50\n billion of Euro-denominated senior unsecured notes (the \"Capri Acquisition EUR Senior Notes\" and, together with the Capri Acquisition USD Senior Notes, the \"Capri Acquisition Senior Notes\") which, together with the $\n1.40\n billion of delayed draw unsecured term loan facilities (the \"Capri Acquisition Term Loan Facilities\") executed on August 30, 2023, complete the expected financing for the Capri Acquisition. Until the close of the transaction, the Company will maintain the proceeds from the issuance of the Capri Acquisition Senior Notes in Cash and cash equivalents and Short-term investments. Refer to Note 8, \"Investments,\" and Note 11, \"Fair Value Measurements,\" for further detail on our cash equivalents and Short-term investments, and Note 12, \"Debt,\" for further information on our existing debt instruments related to the acquisition.\nIn order to finance the Capri Acquisition, on November 27, 2023, the Company issued $\n4.50\n billion of senior unsecured notes (the \"Capri Acquisition USD Senior Notes\") and €\n1.50\n billion of Euro-denominated senior unsecured notes (the \"Capri Acquisition EUR Senior Notes\" and, together with the Capri Acquisition USD Senior Notes, the \"Capri Acquisition Senior Notes\") which, together with the $\n1.40\n billion of delayed draw unsecured term loan facilities (the \"Capri Acquisition Term Loan Facilities\") executed on August 30, 2023, complete the expected financing for the Capri Acquisition. On November 25, 2024, due to the termination of the Merger Agreement and pursuant to the terms of the indenture governing the Capri Acquisition Senior Notes, as supplemented, the Company redeemed all outstanding Capri Acquisition Senior Notes at a redemption price of \n101\n% of the aggregate principal amount of such Capri Acquisition Senior Notes, plus accrued and unpaid interest to, but excluding, the date of redemption (such redemption, the “Special Mandatory Redemption”). In addition, the Capri Acquisition Term Loan Facilities were terminated concurrently with the execution of the Termination Agreement on November 13, 2024. Refer to Note 12, \"Debt,\" for further information on our debt instruments related to the Capri Acquisition. \nDuring fiscal 2025, the Company incurred $\n268.4\n million in pre-tax expenses primarily related to Loss on extinguishment of debt as a result of the redemption of the Capri Acquisition Senior Notes recorded within Loss on extinguishment of debt on the Consolidated Statement of Operations, financing-related expenses recorded within Interest expense, net on the Consolidated Statement of Operations, expense reimbursement payment made to Capri recorded within SG&A expenses on the Consolidated Statement of Operations and professional fees recorded within SG&A expenses on the Consolidated Statement of Operations. \nDuring fiscal 2024, the Company incurred $\n226.6\n million in pre-tax expenses, primarily related to financing-related expenses recorded within Interest expense, net on the Consolidated Statement of Operations and professional fees recorded within SG&A expenses on the Consolidated Statement of Operations.\n80\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\n6. \nACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS)\nThe components of Accumulated other comprehensive income (loss), as of the dates indicated, are as follows:\nUnrealized Gains (Losses) on Cash Flow Hedging Derivatives\n(1)\nUnrealized Gains (Losses) on Available-for-Sale Investments\nCumulative Translation Adjustment\n(2)\nTotal\n(millions)\nBalances at July 1, 2023\n$\n34.9\n \n$\n—\n \n$\n(\n224.8\n)\n$\n(\n189.9\n)\nOther comprehensive income (loss) before reclassifications\n49.2\n \n0.1\n \n22.0\n \n71.3\n \nLess: amounts reclassified from accumulated other comprehensive income to earnings\n27.0\n \n0.3\n \n—\n \n27.3\n \nNet current-period other comprehensive income (loss)\n22.2\n \n(\n0.2\n)\n22.0\n \n44.0\n \nBalances at June 29, 2024 \n$\n57.1\n \n$\n(\n0.2\n)\n$\n(\n202.8\n)\n$\n(\n145.9\n)\nOther comprehensive income (loss) before reclassifications\n(\n17.6\n)\n2.8\n \n(\n41.5\n)\n(\n56.3\n)\nLess: amounts reclassified from accumulated other comprehensive income to earnings\n39.6\n \n2.6\n \n16.8\n \n59.0\n \nNet current-period other comprehensive income (loss)\n(\n57.2\n)\n0.2\n \n(\n58.3\n)\n(\n115.3\n)\nBalances at June 28, 2025\n$\n(\n0.1\n)\n$\n—\n \n$\n(\n261.1\n)\n$\n(\n261.2\n)\n(1)    \nThe ending balances of AOCI related to cash flow hedges are net of tax of $\n0.7\n million and $(\n2.7\n) million as of June 28, 2025 and June 29, 2024, respectively. The amounts reclassified from AOCI are net of tax of $(\n1.9\n) million and $(\n0.2\n) million as of June 28, 2025 and June 29, 2024, respectively.\n(2)\n    The ending balances of AOCI related to the fair values of instruments designated as hedges of the Company's net investment in certain foreign operations as included in foreign currency translation adjustments are a loss of $\n114.4\n million, net of tax of $\n28.0\n million, and a gain of $\n9.9\n million, net of tax of $(\n6.7\n) million, as of June 28, 2025 and June 29, 2024, respectively.\n81\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\n7. \nSHARE-BASED COMPENSATION\nThe Company maintains several share-based compensation plans which are more fully described below. \nThe following table shows the total compensation cost charged against income for these plans and the related tax benefits recognized in the Consolidated Statements of Operations:\nJune 28, 2025\n(1)\nJune 29, 2024\nJuly 1, 2023\n(millions)\nShare-based compensation expense\n$\n91.4\n \n$\n85.9\n \n$\n78.8\n \nIncome tax benefit related to share-based compensation expense\n18.7\n \n17.5\n \n12.9\n \n(1)\nDuring fiscal year ended June 28, 2025, the Company incurred $\n2.7\n million of share-based compensation expense related to the modification of award terms in connection with the sale of the Stuart Weitzman Business and $\n1.4\n million of share-based compensation expense related to its Organizational Efficiency Costs. Refer to Note 5, \"Acquisitions and Divestitures\" for further information.\nStock-Based Plans\nThe Company maintains the Amended and Restated Tapestry, Inc. 2018 Stock Incentive Plan to award stock options and shares to certain members of management and the outside members of its Board of Directors (“Board”). The Company maintains the 2010 Stock Incentive Plan for awards granted prior to the establishment of the 2018 Stock Incentive Plan. These plans were approved by the Company's stockholders. The exercise price of each stock option equals \n100\n% of the market price of the Company's stock on the date of grant and generally has a maximum term of \nten years\n. Stock options and service-based share awards that are granted as part of the annual compensation process generally vest ratably over \nfour years\n. Stock option and share awards are subject to forfeiture until completion of the vesting period, which ranges from \none\n to \nfour years\n. The Company issues new shares upon the exercise of stock options or vesting of share awards.\n82\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nStock Options\nA summary of stock option activity during the fiscal year ended June 28, 2025 is as follows:\nNumber of\nOptions Outstanding\nWeighted-\nAverage\nExercise\nPrice per Option\nWeighted-\nAverage\nRemaining\nContractual\nTerm\n(in years)\nAggregate\nIntrinsic\nValue\n(millions)\n(millions)\nOutstanding at June 29, 2024\n8.2\n \n$\n32.59\n \nGranted\n1.0\n \n40.71\n \nExercised\n(\n3.8\n)\n32.68\n \nForfeited or expired\n(\n0.2\n)\n34.76\n \nOutstanding at June 28, 2025\n5.2\n \n33.97\n \n6.3\n$\n251.5\n \nVested and expected to vest at June 28, 2025\n5.2\n \n33.93\n \n6.3\n249.8\n \nExercisable at June 28, 2025\n2.9\n \n31.21\n \n4.8\n148.6\n \nThe fair value of each option grant is estimated on the date of grant using the Black-Scholes option pricing model and the following weighted-average assumptions:\nJune 28,\n2025\nJune 29,\n2024\nJuly 1,\n2023\nExpected term (years)\n4.9\n5.0\n4.9\nExpected volatility\n40.9\n \n%\n44.8\n \n%\n48.6\n \n%\nRisk-free interest rate\n3.8\n \n%\n4.5\n \n%\n3.3\n \n%\nDividend yield\n3.4\n \n%\n4.2\n \n%\n3.4\n \n%\nThe expected term of options represents the period of time that the options granted are expected to be outstanding and is based on historical experience. Expected volatility is based on historical volatility of the Company’s stock as well as the implied volatility from publicly traded options on the Company's stock. The risk-free interest rate is based on the zero-coupon U.S. Treasury issue as of the date of the grant. Dividend yield is based on the expected annual dividend per share and the Company’s stock price as of the grant date.\nThe weighted-average grant-date fair value of options granted during fiscal 2025, fiscal 2024 and fiscal 2023 was $\n12.11\n, $\n10.35\n and $\n12.04\n, respectively. The total intrinsic value of options exercised during fiscal 2025, fiscal 2024 and fiscal 2023 was $\n106.9\n million, $\n11.1\n million and $\n19.5\n million, respectively. The total cash received from option exercises was $\n121.3\n million, $\n23.0\n million and $\n34.9\n million in fiscal 2025, fiscal 2024 and fiscal 2023, respectively, and the cash tax benefit realized for the tax deductions from these option exercises was $\n18.4\n million, $\n2.0\n million and $\n3.9\n million, respectively.\nAt June 28, 2025, $\n17.7\n million of total unrecognized compensation cost related to non-vested stock option awards is expected to be recognized over a weighted-average period of \n1.4\n years.\n83\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nService-based Restricted Stock Unit Awards (“RSUs”)\nA summary of service-based RSU activity during the year ended June 28, 2025 is as follows:\nNumber of\nNon-vested\nRSUs\nWeighted-\nAverage Grant- Date Fair Value per RSU\n(millions)\nNon-vested at June 29, 2024\n5.2\n \n$\n32.96\n \nGranted\n1.9\n \n42.39\n \nVested\n(\n2.2\n)\n29.83\n \nForfeited\n(\n0.4\n)\n36.74\n \nNon-vested at June 28, 2025\n4.5\n \n37.62\n \nAt June 28, 2025, $\n90.4\n million of total unrecognized compensation cost related to non-vested share awards is expected to be recognized over a weighted-average period of \n1.3\n years.\nThe weighted-average grant-date fair value of share awards granted during fiscal 2025, fiscal 2024 and fiscal 2023 was $\n42.39\n, $\n34.19\n and $\n35.53\n, respectively. The total fair value of shares vested during fiscal 2025, fiscal 2024 and fiscal 2023 was $\n92.6\n million, $\n95.3\n million and $\n88.0\n million, respectively.\nPerformance-based Restricted Stock Unit Awards (“PRSU”)\nThe Company grants PRSUs to key executives, the vesting of which is subject to the executive’s continuing employment and the Company's achievement of certain performance goals. \nA summary of PRSU activity during the fiscal year ended June 28, 2025 is as follows:\nNumber of\nNon-vested\nPRSUs\nWeighted-\nAverage Grant- Date Fair Value per PRSU\n(millions)\nNon-vested at June 29, 2024\n1.2\n \n$\n36.74\n \nGranted\n0.4\n \n47.73\n \nChange due to performance condition achievement\n—\n \n—\n \nVested\n(\n0.3\n)\n42.31\n \nForfeited\n(\n0.2\n)\n39.58\n \nNon-vested at June 28, 2025\n1.1\n \n$\n36.34\n \nAt June 28, 2025, $\n15.3\n million of total unrecognized compensation cost related to non-vested share awards is expected to be recognized over a weighted-average period of \n1.0\n year.\nThe weighted-average grant-date fair value per share of PRSU awards granted during fiscal 2025, fiscal 2024 and fiscal 2023 was $\n47.73\n, $\n33.99\n and $\n35.46\n, respectively. The total fair value of awards that vested during fiscal 2025, fiscal 2024 and fiscal 2023 was $\n13.4\n million, $\n0.0\n million and $\n60.4\n million, respectively.\nPRSUs are subject to a \ntwo-year\n and \nthree-year\n cliff vesting contingent on the employee's continuing employment and the Company's achievement of the performance goals established at the beginning of the performance period. The fair value of the PRSU's is based on the price of the Company's common stock on the date of grant. \nIn fiscal 2025, fiscal 2024 and fiscal 2023, the cash tax benefit realized for the tax deductions from all RSUs (service and performance-based) was $\n16.7\n million, $\n15.3\n million and $\n29.5\n million, respectively.\n84\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements\nEmployee Stock Purchase Plan\nUnder the 2001 Employee Stock Purchase Plan, eligible employees are permitted to purchase a limited number of Company common shares at \n85\n% of market value. Under this plan, the Company sold \n0.1\n million, \n0.2\n million and \n0.1\n million shares to employees in fiscal 2025, fiscal 2024 and fiscal 2023, respectively. \nCompensation expense is calculated for the fair value of employees’ purchase rights using the Black-Scholes model and the following weighted-average assumptions:\nFiscal Year Ended\n \nJune 28,\n2025\nJune 29,\n2024\nJuly 1,\n2023\nExpected term (years)\n0.5\n0.5\n0.5\nExpected volatility\n35.7\n \n%\n32.5\n \n%\n38.2\n \n%\nRisk-free interest rate\n4.9\n \n%\n5.4\n \n%\n3.3\n \n%\nDividend yield\n2.7\n \n%\n3.9\n \n%\n3.1\n \n%\nThe weighted-average fair value of the purchase rights granted during fiscal 2025, fiscal 2024 and fiscal 2023 was $\n13.48\n, $\n8.45\n and $\n9.30\n, respectively. The Company issues new shares for employee stock purchases.\n8. \nINVESTMENTS\nThe following table summarizes the Company’s primarily U.S. dollar-denominated investments, recorded within the Consolidated Balance Sheets as of June 28, 2025 and June 29, 2024:\nJune 28, 2025\nJune 29, 2024\n \nShort-term\nLong-term\n(2)\nTotal\nShort-term\nLong-term\n(2)\nTotal\n(millions)\nAvailable-for-sale investments:\n \n \n \n \n \n \nCommercial paper\n(1)\n$\n—\n \n$\n—\n \n$\n—\n \n$\n865.2\n \n$\n—\n \n$\n865.2\n \nGovernment securities – U.S.\n(1)\n—\n \n—\n \n—\n \n178.2\n \n—\n \n178.2\n \nTotal Available-for-sale investments\n$\n—\n \n$\n—\n \n$\n—\n \n$\n1,043.4\n \n$\n—\n \n$\n1,043.4\n \nOther:\n \n \n \n \n \n \nTime deposits\n(1)\n—\n \n—\n \n—\n \n0.6\n \n—\n \n0.6\n \nOther\n19.6\n \n1.4\n \n21.0\n \n17.8\n \n1.3\n \n19.1\n \nTotal Investments\n$\n19.6\n \n$\n1.4\n \n$\n21.0\n \n$\n1,061.8\n \n$\n1.3\n \n$\n1,063.1\n \n(1)\nThese securities, as of period end, have maturity dates during their respective following fiscal years and are recorded at fair value.\n(2)\nLong-term investments are presented within Other assets on the Consolidated Balance Sheets.\nThe Company recognized a pre-tax gain of $\n2.6\n million on available-for-sale investments during the fiscal year ended June 28, 2025. These gains are included within Other expense (income) on the Consolidated Statements of Operations. Additionally, the Company has \nno\n material unrealized gains on available-for-sale investments as of June 28, 2025 included within Comprehensive income (loss) on the Consolidated Statements of Comprehensive Income (Loss).\nThere were \nno\n material gross realized and unrealized gains or losses on available-for-sale investments as of the fiscal year ended June 29, 2024.\n85\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\n9. \nLEASES\nThe Company leases retail space, office space, warehouse facilities, fulfillment centers, storage space, machinery, equipment and certain other items under operating leases. The Company's leases have initial terms ranging from \none\n to \ntwenty years\n and may have renewal or early termination options ranging from \none\n to \nten years\n. These leases may also include rent escalation clauses or lease incentives. In determining the lease term used in the lease ROU asset and lease liability calculations, the Company considers various factors such as market conditions and the terms of any renewal or termination options that may exist. When deemed reasonably certain, the renewal and termination options are included in the determination of the lease term and calculation of the lease ROU asset and lease liability. The Company is typically required to make fixed minimum rent payments, variable rent payments primarily based on performance (i.e., percentage-of-sales-based payments), or a combination thereof, directly related to its ROU asset. The Company is also often required, by the lease, to pay for certain other costs including real estate taxes, insurance, common area maintenance fees and/or certain other costs, which may be fixed or variable, depending upon the terms of the respective lease agreement. To the extent these payments are fixed, the Company has included them in calculating the lease ROU assets and lease liabilities.\nThe Company calculates lease ROU assets and lease liabilities as the present value of fixed lease payments over the reasonably certain lease term beginning at the commencement date. The Company is required to use the implicit rate to determine the present value of lease payments. As the rate implicit in the Company's leases is not readily determinable, the Company uses its incremental borrowing rate based on the information available at the lease commencement date, including the Company's credit rating, credit spread and adjustments for the impact of collateral, lease tenors, economic environment and currency.\nFor operating leases, fixed lease payments are recognized as operating lease cost on a straight-line basis over the lease term. For finance leases and impaired operating leases, the ROU asset is depreciated on a straight-line basis over the remaining lease term, along with recognition of interest expense associated with accretion of the lease liability. For leases with a lease term of 12 months or less (\"short-term lease\"), any fixed lease payments are recognized on a straight-line basis over such term and are not recognized on the Consolidated Balance Sheets. Variable lease cost for both operating and finance leases, if any, is recognized as incurred.\nThe Company acts as sublessor in certain leasing arrangements, primarily related to a sublease of a portion of the Company's leased headquarters space as well as certain retail locations. Fixed sublease payments received are recognized on a straight-line basis over the sublease term.\nROU assets, along with any other related long-lived assets, are periodically evaluated for impairment.\n86\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nThe following table summarizes the ROU assets and lease liabilities recorded on \nthe Company's Consolidated Balance Sheets as of \nJune 28, 2025 and June 29, 2024\n:\nJune 28, 2025\nJune 29, 2024\nLocation Recorded on the Consolidated Balance Sheets\n(millions)\nAssets:\nOperating leases\n$\n1,331.0\n \n$\n1,314.4\n \nOperating lease right-of-use assets\nFinance leases \n—\n \n0.6\n \nProperty and equipment, net\nTotal lease assets\n$\n1,331.0\n \n$\n1,315.0\n \nLiabilities:\nOperating leases:\nCurrent lease liabilities\n$\n299.0\n \n$\n299.7\n \nCurrent portion of operating lease liabilities\nLong-term lease liabilities\n1,205.6\n \n1,224.2\n \nLong-term operating lease liabilities\nTotal operating lease liabilities\n$\n1,504.6\n \n$\n1,523.9\n \nFinance leases:\nCurrent lease liabilities\n$\n—\n \n$\n1.2\n \nAccrued liabilities\nLong-term lease liabilities\n—\n \n—\n \nOther liabilities\nTotal finance lease liabilities \n$\n—\n \n$\n1.2\n \nTotal lease liabilities \n$\n1,504.6\n \n$\n1,525.1\n \nThe following table summarizes the composition of net lease costs, primarily recorded within SG&A expenses on the Company's Consolidated Statement of Operations for the fiscal year ended \nJune 28, 2025 and June 29, 2024\n:\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\n(millions)\nFinance lease cost:\nAmortization of right-of-use assets\n$\n1.2\n \n$\n1.2\n \nInterest on lease liabilities\n(1)\n0.1\n \n0.2\n \nTotal finance lease cost\n1.3\n \n1.4\n \nOperating lease cost\n360.6\n \n360.7\n \nShort-term lease cost\n22.8\n \n19.5\n \nVariable lease cost\n204.8\n \n205.3\n \nOperating lease right-of-use impairment\n3.0\n \n—\n \nLess: sublease income\n(\n16.4\n)\n(\n17.8\n)\nTotal net lease cost\n$\n576.1\n \n$\n569.1\n \n(1)    \nInterest on lease liabilities is recorded within Interest expense, net on the Company's Consolidated Statement of Operations.\n87\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nThe following table summarizes certain cash flow information related to the Company's leases for the fiscal year ended June 28, 2025 and June 29, 2024\n:\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\n(millions)\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n414.8\n \n$\n420.4\n \nOperating cash flows from finance leases\n0.1\n \n0.2\n \nFinancing cash flows from finance leases\n1.2\n \n1.2\n \nNon-cash transactions:\nRight-of-use assets obtained in exchange for operating lease liabilities\n327.7\n \n246.2\n \nThe following table provides a maturity analysis of the Company's lease liabilities recorded on the Consolidated Balance Sheets as of June 28, 2025\n:\nJune 28, 2025\nOperating Leases\n(millions)\nFiscal 2026\n$\n372.7\n \nFiscal 2027\n315.2\n \nFiscal 2028\n231.6\n \nFiscal 2029\n178.0\n \nFiscal 2030\n135.9\n \nFiscal 2031 and thereafter\n554.3\n \nTotal lease payments\n1,787.7\n \nLess: imputed interest\n(\n283.1\n)\nTotal lease liabilities\n$\n1,504.6\n \nThe future minimum fixed sublease receipts under non-cancelable operating lease agreements as of June 28, 2025 are as follows:\nJune 28, 2025\n(millions)\nFiscal 2026\n$\n14.8\n \nFiscal 2027\n14.8\n \nFiscal 2028\n14.8\n \nFiscal 2029\n15.3\n \nFiscal 2030\n16.0\n \nFiscal 2031 and thereafter\n96.2\n \nTotal sublease income \n$\n171.9\n \n88\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nThe following table summarizes the weighted-average remaining lease terms and weighted-average discount rates related to the Company's operating leases and finance leases recorded on the Consolidated Balance Sheets as of \nJune 28, 2025 and June 29, 2024\n:\nJune 28, 2025\nJune 29, 2024\nWeighted average remaining lease term (years):\nOperating leases\n7.4\n7.8\nFinance leases\n—\n0.9\nWeighted average discount rate:\nOperating leases\n4.4\n \n%\n4.4\n \n%\nFinance leases\n—\n \n%\n11.3\n \n%\nAdditionally, the Company had approximately $\n237.6\n million of future payment obligations related to executed lease agreements for which the related lease had not yet commenced as of June 28, 2025.\n10. \nDERIVATIVE INSTRUMENTS AND HEDGING ACTIVITIES\nThe following tables provide information related to the Company's derivative instruments recorded on the Company's Consolidated Balance Sheets as of June 28, 2025 and June 29, 2024:\nNotional Value\nDerivative Assets\nDerivative Liabilities\nFair Value\nFair Value\nJune 28, 2025\nJune 29, 2024\nConsolidated Balance Sheet Classification\nJune 28, 2025\nJune 29, 2024\nConsolidated Balance Sheet Classification\nJune 28, 2025\nJune 29, 2024\n(millions)\nDesignated Derivative Hedging Instruments:\nFC - Inventory purchases\n(1)\n$\n735.0\n \n$\n764.6\n \nOther Current Assets\n$\n6.5\n \n$\n58.2\n \nAccrued Liabilities\n$\n7.9\n \n$\n2.2\n \nNet investment hedges\n(2)\n1,690.0\n \n1,450.0\n \nOther Current Assets & Other Assets\n(4)\n15.6\n \n32.2\n \nAccrued Liabilities & Other Liabilities\n(5)\n263.0\n \n139.4\n \nTotal designated hedge instruments\n$\n2,425.0\n \n$\n2,214.6\n \n$\n22.1\n \n$\n90.4\n \n$\n270.9\n \n$\n141.6\n \nUndesignated hedging instruments:\nFC - Intercompany liabilities and loans\n(3)\n157.0\n \n348.2\n \nOther Current Assets\n0.3\n \n0.1\n \nAccrued Liabilities\n0.1\n \n2.6\n \nTotal Hedges\n$\n2,582.0\n \n$\n2,562.8\n \n$\n22.4\n \n$\n90.5\n \n$\n271.0\n \n$\n144.2\n \n(1)\nRepresents forward foreign currency exchange contracts (\"FC\") designated as derivative instruments in cash flow hedging relationships.\n(2)\nRepresents cross currency swap foreign exchange contracts (\"CCS\") and forward foreign exchange contracts (\"FC\") designated as derivative instruments in net investment hedging relationships.\n(3)\nRepresents forward foreign currency exchange contracts (\"FC\") not designated as hedges.\n(4)\nAs of June 28, 2025, the Company recorded $\n15.6\n million within Other Current Assets and $\n0.0 million\n within Other Assets. As of June 29, 2024, the Company recorded $\n11.6\n million within Other Current Assets and $\n20.6\n million within Other Assets.\n89\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\n(5)\nAs of June 28, 2025, the Company recorded $\n6.9\n million within Accrued Liabilities and $\n256.1\n million within Other Liabilities. As of June 29, 2024, the Company recorded $\n2.2\n million within Accrued Liabilities and $\n137.2\n million within Other Liabilities.\nThe following tables provides the pretax impact of gains and losses from the Company's designated derivative instruments on its Consolidated Financial Statements for the fiscal years ended June 28, 2025, June 29, 2024 and July 1, 2023:\nAmount of Gain (Loss) Recognized in OCI on Derivatives\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nJuly 1, 2023\n(millions)\nCash flow hedges:\nInventory purchases\n(1)\n$\n(\n19.1\n)\n$\n59.6\n \n$\n34.7\n \nInterest rates\n(2)\n—\n \n(\n10.4\n)\n—\n \nTotal cash flow hedges\n$\n(\n19.1\n)\n$\n49.2\n \n$\n34.7\n \nOther:\nNet investment hedges\n(3)\n(\n141.3\n)\n74.3\n \n(\n58.7\n)\nTotal other\n(\n141.3\n)\n74.3\n \n(\n58.7\n)\nTotal hedges\n$\n(\n160.4\n)\n$\n123.5\n \n$\n(\n24.0\n)\nAmount of Gain (Loss) Reclassified from Accumulated OCI into Income\nStatement of Operations\nClassification\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nJuly 1, 2023\n(millions)\nCash flow hedges:\nInventory purchases\n(1)\nCost of Sales\n$\n42.4\n \n$\n36.7\n \n$\n(\n6.3\n)\nInterest rates\n(2)\nOther income (expense)\n(\n0.9\n)\n(\n9.5\n)\n—\n \nTotal cash flow hedges\n$\n41.5\n \n$\n27.2\n \n$\n(\n6.3\n)\nOther:\nNet investment hedges\n(3)\nInterest income (expense)\n17.7\n \n2.8\n \n—\n \nTotal other\n17.7\n \n2.8\n \n—\n \nTotal hedges\n$\n59.2\n \n$\n30.0\n \n$\n(\n6.3\n)\n(1)\nRepresents forward foreign currency exchange contracts (\"FC\") designated as derivative instruments in cash flow hedging relationships.\n(2)\nRepresents forward interest rate contracts (\"IC\") designated as derivative instruments in cash flow hedging relationships.\n(3)\nRepresents cross currency swap contracts (\"CCS\") and forward foreign exchange contracts (\"FC\") designated as derivative instruments in net investment hedging relationships, for which the difference between changes in fair value and periodic amortization of excluded components is recorded within AOCI.\nThe Company expects that $\n1.3\n million of net derivative gain related to inventory purchases included in Accumulated other comprehensive income at June 28, 2025 will be reclassified into earnings within the next 12 months. This amount will vary due to fluctuations in foreign currency exchange rates.\nThe Company assesses the cross-currency swaps and forward exchange contracts used as net investment hedges under the spot method. This results in the cross-currency basis spread on the cross-currency swaps and the difference between the spot rate and the forward rate of the forward exchange contract being excluded from the assessment of hedge effectiveness, and recorded as incurred as a reduction in interest expense in the Company’s Consolidated Statements of Operations. Accordingly, the Company recorded net interest income of $\n28.9\n million and $\n28.7\n million during fiscal 2025 and fiscal 2024, respectively.\n90\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\n11. \nFAIR VALUE MEASUREMENTS\nThe Company categorizes its assets and liabilities, based on the priority of the inputs to the valuation technique, into a three-level fair value hierarchy as set forth below. The three levels of the hierarchy are defined as follows:\nLevel 1 — Unadjusted quoted prices in active markets for identical assets or liabilities.\nLevel 2 — Observable inputs other than quoted prices included in Level 1. Level 2 inputs include quoted prices for identical assets or liabilities in non-active markets, quoted prices for similar assets or liabilities in active markets and inputs other than quoted prices that are observable for substantially the full term of the asset or liability.\nLevel 3 — Unobservable inputs reflecting management’s own assumptions about the input used in pricing the asset or liability. The Company does not have any Level 3 investments.\nThe following table shows the fair value measurements of the Company’s financial assets and liabilities at June 28, 2025 and June 29, 2024:\nLevel 1\nLevel 2\n \nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\n(millions)\nAssets:\n \n \n \n \nCash equivalents\n(1)\n$\n225.9\n \n$\n437.4\n \n$\n—\n \n$\n29.7\n \nShort-term investments:\nTime deposits\n(2)\n—\n \n—\n \n—\n \n0.6\n \nCommercial paper\n(2)\n—\n \n—\n \n—\n \n865.2\n \nGovernment securities - U.S.\n(2)\n—\n \n178.2\n \n—\n \n—\n \nOther\n—\n \n—\n \n19.6\n \n17.8\n \nLong-term investments:\nOther\n—\n \n—\n \n1.4\n \n1.3\n \nDerivative Assets:\nInventory-related instruments\n(3)\n—\n \n—\n \n6.5\n \n58.2\n \nNet investment hedges\n(3)\n—\n \n—\n \n15.6\n \n32.2\n \nIntercompany loans and payables\n(3)\n—\n \n—\n \n0.3\n \n0.1\n \nLiabilities:\n \n \n \n \nDerivative liabilities:\nInventory-related instruments\n(3)\n$\n—\n \n$\n—\n \n$\n7.9\n \n$\n2.2\n \nNet investment hedges\n(3)\n—\n \n—\n \n263.0\n \n139.4\n \nIntercompany loans and payables\n(3)\n—\n \n—\n \n0.1\n \n2.6\n \n(1)\nCash equivalents generally consists of money market funds and time deposits with maturities of \nthree months\n or less at the date of purchase. Due to their short-term maturity, management believes that their carrying value approximates fair value.\n(2)\nShort-term investments are recorded at fair value, which approximates their carrying value, and are primarily based upon quoted vendor or broker priced securities in active markets.\n(3)\nThe fair value of these hedges is primarily based on the forward curves of the specific indices upon which settlement is based and includes an adjustment for the counterparty’s or Company’s credit risk.\nRefer to Note 12, \"Debt,\" for the fair value of the Company's outstanding debt instruments. \n91\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nNon-Financial Assets and Liabilities\nThe Company’s non-financial instruments, which primarily consist of goodwill, intangible assets, right-of-use assets and property and equipment, are not required to be measured at fair value on a recurring basis and are reported at carrying value. However, on a periodic basis whenever events or changes in circumstances indicate that their carrying value may not be fully recoverable (and at least annually for goodwill and indefinite-lived intangible assets), non-financial instruments are assessed for impairment and, if applicable, written-down to and recorded at fair value, considering market participant assumptions. The Company determines the fair values of these assets based on Level 3 measurements. Inputs to these fair value measurements included estimates of the amounts and the timing of future discounted cash flows based on historical experience, current trends, market conditions and performance expectations.\nDuring the fiscal year ended June 28, 2025, the Company recorded an impairment of $\n610.7\n million to the Kate Spade indefinite-lived brand intangible and an impairment of $\n244.1\n million to goodwill pertaining to the Kate Spade reporting unit. Refer to Note 14, \"Goodwill and Other Intangible Assets\" for further information.\nDuring the fiscal year ended June 28, 2025, the Company recorded $\n5.8\n million of impairment charges to reduce the carrying amount of certain store assets within property and equipment, net to their estimated fair values. During the fiscal year ended June 29, 2024, the Company recorded $\n6.3\n million of impairment charges to reduce the carrying amount of certain store assets within property and equipment, net to their estimated fair values.\nDuring the fiscal year ended June 28, 2025, the Company recorded $\n3.0\n million of impairment charges to reduce the carrying amount of certain operating lease right-of-use assets to their estimated fair values. During the fiscal year ended June 29, 2024, the Company did \nno\nt have any impairment charges to reduce the carrying amount of certain operating lease right-of-use assets to their estimated fair values\n92\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\n12. \nDEBT\nThe following table summarizes the components of the Company’s outstanding debt:\nJune 28,\n2025\nJune 29,\n2024\n(millions)\nCurrent Debt:\n4.250\n% Senior Notes due 2025\n$\n—\n \n$\n303.4\n \nChina Credit Facility\n(1)\n16.7\n \n—\n \nTotal Current Debt\n$\n16.7\n \n$\n303.4\n \nLong-Term Debt:\n7.050\n% Senior Notes due 2025\n$\n—\n \n$\n500.0\n \n7.000\n% Senior Notes due 2026\n—\n \n750.0\n \n4.125\n% Senior Notes due 2027\n396.6\n \n396.6\n \n7.350\n% Senior Notes due 2028\n—\n \n1,000.0\n \n5.100\n% Senior Notes due 2030\n750.0\n \n—\n \n7.700\n% Senior Notes due 2030\n—\n \n1,000.0\n \n3.050\n% Senior Notes due 2032\n500.0\n \n500.0\n \n7.850\n% Senior Notes due 2033\n—\n \n1,250.0\n \n5.500\n% Senior Notes due 2035\n750.0\n \n—\n \nEUR Senior Notes:\n5.350\n% EUR Senior Notes due 2025\n(2)\n—\n \n535.6\n \n5.375\n% EUR Senior Notes due 2027\n(2)\n—\n \n535.6\n \n5.875\n% EUR Senior Notes due 2031\n(2)\n—\n \n535.6\n \nTotal long-term debt\n2,396.6\n \n7,003.4\n \nLess: Unamortized discount and debt issuance costs on Senior Notes\n(\n18.7\n)\n(\n66.2\n)\nTotal long-term debt, net\n$\n2,377.9\n \n$\n6,937.2\n \n(1)\nThe amount outstanding under the China Credit Facility includes the impact of changes in the exchange rate of the United States Dollar against the Renminbi.\n(2)\nThe carrying amounts of the Capri Acquisition EUR Senior\n \nNotes include the impact of changes in the exchange rate of the United States Dollar against the Euro.\nDuring fiscal 2025, 2024 and 2023 the Company recognized interest expense related to the outstanding debt of $\n271.2\n million, $\n369.6\n million and $\n72.8\n million, respectively. \nDuring fiscal 2025 the Company recognized Loss on extinguishment of debt of $\n120.1\n million, primarily related to redemption premiums, as well as unamortized debt issuance costs and discounts, as a result of the redemption of the Capri Acquisition USD Senior Notes in the second quarter of fiscal 2025. There was \nno\n Loss on extinguishment of debt recognized by the Company during fiscal 2024 and fiscal 2023.\n$\n2.00\n Billion Revolving Credit Facility\nOn May 22, 2025, the Company announced it entered into a definite agreement to refinance and replace the Company's unsecured revolving facility dated May 11, 2022 ( the \"Existing Revolving Credit Facility\") with a new revolving credit facility (the \"Amended Revolving Credit Facility\"), among the Company, as borrower, Bank of America, N.A., as administrative agent (the “Administrative Agent”), and a syndicate of banks and financial institutions (collectively, the “Lenders”), dated as of May 22, 2025. Under the Amended Revolving Credit Facility, the Lenders have made available to the Company a $\n2.00\n billion unsecured revolving credit facility, including sub facilities for letters of credit, with a maturity date of May 22, 2030. \n93\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nBorrowings under the Amended Revolving Credit Facility bear interest at a rate per annum equal to, at the Company’s option, (i) for borrowings in U.S. Dollars, either (a) an alternate base rate or (b) a term secured overnight financing rate, (ii) for borrowings in Euros, the Euro Interbank Offered Rate, (iii) for borrowings in Pounds Sterling, the Sterling Overnight Index Average Reference Rate and (iv) for borrowings in Japanese Yen, the Tokyo Interbank Offer Rate, plus, in each case, an applicable margin. The applicable margin will be adjusted by reference to a grid (the “Pricing Grid”) based on the ratio of (a) consolidated debt (subject to reduction for certain debt incurred in connection with a pending acquisition or for debt being discharged, satisfied or defeased), to (b) consolidated EBITDAR (the “Gross Leverage Ratio”). Additionally, the Company will pay facility fees, calculated at a rate per annum determined in accordance with the Pricing Grid, on the full amount of the Amended Revolving Credit Facility, payable quarterly in arrears, and certain fees with respect to letters of credit that are issued. Borrowings under the Amended Revolving Credit Facility may be used to finance the working capital needs, capital expenditures, permitted investments, share purchases, dividends and other general corporate purposes of the Company and its subsidiaries (which may include commercial paper back-up). During the second quarter of fiscal 2025, the Company executed $\n1.00\n billion of borrowings under the Existing Revolving Credit Facility used to partially fund the share repurchases under the ASR Agreements and for general corporate purposes. Subsequently, on December 11, 2024, the Company issued $\n1.50\n billion of senior unsecured notes (as defined below, the 2030 and 2035 Senior Notes) and the funds were partially used to repay the borrowings under the Existing Revolving Credit Facility on December 11, 2024. There were \nno\n outstanding borrowings on the Amended Revolving Credit Facility as of June 28, 2025.\nTerm Loan Credit Agreement\nDuring the second quarter of fiscal 2025, the Company entered into a $\n750.0\n million senior unsecured term loan facility pursuant to the Term Loan Credit Agreement (the “Term Loan Credit Agreement”) with Bank of America, N.A., as administrative agent, and the lenders party thereto, and appointed BofA Securities, Inc. and Morgan Stanley Senior Lending, Inc. as joint lead arrangers and joint bookrunners, used to partially fund the share repurchases under the ASR Agreements, and for general corporate purposes. Borrowings under the Term Loan Credit Agreement bear interest at a rate per annum equal to, at the Company's option, (i) an alternative base rate or (ii) a rate based on the forward-looking SOFR term rate administered by CME Group Benchmark Administration Limited (or any successor administrator satisfactory to the administrative agent). On November 26, 2024, the Company drew down in full, the $\n750.0\n million loan principal under the Term Loan Credit Agreement. The loan was due to mature \nsix months\n after the date the loan was funded. Subsequently, the Company repaid the borrowings in \ntwo\n tranches with $\n250.0\n million repaid on December 5, 2024 and $\n500.0\n million repaid on December 11, 2024.\n2030 and 2035 Senior Notes\nOn December 11, 2024, the Company issued $\n1.50\n billion of senior unsecured notes, consisting of $\n750.0\n million aggregate principal amount of \n5.100\n% senior unsecured notes due March 11, 2030 at \n99.876\n% of par (the “\n5.100\n% Senior Notes due 2030”) and $\n750.0\n million aggregate principal amount of \n5.500\n% senior unsecured notes due March 11, 2035 at \n99.864\n% of par (the “\n5.500\n% Senior Notes due 2035”, together with the \n5.100\n% Senior Notes due 2030, the \"2030 and 2035 Senior Notes\"). The net proceeds of this offering, together with cash on hand, were used to repay the loans outstanding under the Term Loan Credit Agreement and to repay borrowings under the Existing Revolving Credit Facility. The Company will pay interest semi-annually on the 2030 and 2035 Senior Notes on March 11 and September 11 of each year, commencing on September 11, 2025. \nTerm Loan due 2027\nOn May 11, 2022, pursuant to the Existing Credit Agreement, the Company entered into an unsecured $\n500.0\n million Term Loan (the “Term Loan due 2027”) which was scheduled to mature on May 11, 2027. The Term Loan due 2027 amortizes in an amount equal to \n5.000\n% per annum, with payments made quarterly. Borrowings under the Term Loan due 2027 bear interest at a rate per annum equal to, at the Company’s option, either (i) an alternate base rate or (ii) a term secured overnight financing rate plus, in each case, an applicable margin. The applicable margin will be adjusted by reference to a pricing grid based on the ratio (a) consolidated debt to (b) consolidated EBITDAR. The Company repaid its outstanding borrowings under the Term Loan due 2027 on May 31, 2024.\n94\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\n2025, 2027, 2032 Senior Notes\nIn March 2015, the Company issued $\n600.0\n million aggregate principal amount of \n4.250\n% senior unsecured notes due April 1, 2025 at \n99.445\n% of par (the \"\n4.250\n% Senior Notes due 2025\"). In June 2017, the Company issued $\n600.0\n million aggregate principal amount of \n4.125\n% senior unsecured notes due July 15, 2027 at \n99.858\n% of par (the \n4.125\n% Senior Notes due 2027\"). In December 2021, the Company completed a cash tender offer for $\n296.6\n million and $\n203.4\n million of the outstanding aggregate principal amount under its \n4.250\n% Senior Notes due 2025 and \n4.125\n% Senior Notes due 2027, respectively. In addition, in December 2021, the Company issued $\n500.0\n million aggregate principal amount of \n3.050\n% senior unsecured notes due March 15, 2032 at \n99.705\n% of par (the \"\n3.050\n% Senior Notes due 2032\"). On April 1, 2025, the Company completed the redemption of $\n303.4\n million remaining principal of the \n4.250\n% Senior Notes due 2025. \nChina Credit Facility\nOn May 20, 2024, the Company entered into a short-term credit facility (“China Credit Facility”) with Citibank, which may be used to fund general working capital needs, not to exceed 12 months, and is subject to annual renewal. The China Credit Facility provides the Company with a maximum facility amount of up to RMB \n250.0\n million (approximately $\n35.0\n million), which includes a loan of up to RMB \n85.0\n million (approximately $\n12.0\n million), a bank guarantee facility of up to RMB \n15.0\n million (approximately $\n2.0\n million) and Accounts payable financing of up to RMB \n150.0\n million (approximately $\n21.0\n million). As of June 28, 2025, the Company had RMB \n120.0\n million ($\n16.7\n million) of borrowings outstanding under this facility, which was recorded within Current debt on the Company’s Consolidated Balance Sheets.\nCapri Holdings Limited Acquisition Related Debt Transactions:\nIn order to finance the Capri Acquisition, on November 27, 2023, the Company issued $\n4.50\n billion Capri Acquisition USD Senior Notes and €\n1.50\n billion Capri Acquisition EUR Senior Notes which, together with the $\n1.40\n billion of delayed draw Capri Acquisition Term Loan Facilities executed on August 30, 2023, complete the expected financing for the Capri Acquisition.\nOn November 13, 2024, the Parties entered into a Termination Agreement, pursuant to which it was agreed that the Merger Agreement was terminated, effective immediately. On November 25, 2024, due to the termination of the Merger Agreement and pursuant to the terms of the Indenture, the Company redeemed all outstanding Capri Acquisition Senior Notes at a redemption price of \n101\n% of the aggregate principal amount of such Capri Acquisition USD Senior Notes and Capri Acquisition EUR Senior Notes, plus accrued and unpaid interest to, but excluding, the date of redemption. In addition, the Capri Acquisition Term Loan Credit Agreement was terminated concurrently with the execution of the Termination Agreement on November 13, 2024. Refer to Note 5, \"Acquisitions and Divestitures,\" for further information. A summary of the Capri Holdings Limited acquisition debt related transactions is as follows:\nCapri Acquisition Term Loan Facilities\nOn August 30, 2023, the Company entered into a definitive credit agreement (such agreement, the \"Capri Acquisition Term Loan Credit Agreement\") whereby Bank of America, N.A, as administrative agent, and the other agents party thereto, and a syndicate of banks and financial institutions have committed to lend the Company, subject to the satisfaction or waiver of the conditions set forth in the Capri Acquisition Term Loan Credit Agreement, the Capri Acquisition Term Loan Facilities consisting of a $\n1.05\n billion unsecured term loan facility maturing \nthree years\n after the term loans thereunder are borrowed (the “\nThree-Year\n Term Loan Facility”) and a $\n350.0\n million term loan facility maturing \nfive years\n after the term loans thereunder are borrowed (the “\nFive-Year\n Term Loan Facility”). On November 13, 2024, the Capri Acquisition Term Loan Credit Agreement was terminated concurrently with the execution of the Termination Agreement.\nCapri Acquisition USD Senior Notes\nOn November 27, 2023, the Company issued $\n4.50\n billion aggregate principal amount of the Capri Acquisition USD Senior Notes, consisting of $\n500.0\n million aggregate principal amount of \n7.050\n% senior unsecured notes due November 27, 2025 at \n99.890\n% of par (the “\n7.050\n% Senior Notes due 2025”), $\n750.0\n million aggregate principal amount of \n7.000\n% senior unsecured notes due November 27, 2026 at \n99.803\n% of par (the “\n7.000\n% Senior Notes due 2026”), $\n1.00\n billion aggregate principal amount of \n7.350\n% senior unsecured notes due November 27, 2028 at \n99.724\n% (the “\n7.350\n% Senior Notes due 2028”), $\n1.00\n billion aggregate principal amount of \n7.700\n% Senior Notes due November 27, 2030 at \n99.712\n% of par (the “\n7.700\n% Senior Notes due 2030”) and $\n1.25\n billion aggregate principal amount of our \n7.850\n% Senior Notes due November 27, 2033 at \n99.475\n% (the “\n7.850\n% Senior Notes due 2033”).\n95\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nDue to the termination of the Merger Agreement, on November 25, 2024, the Company redeemed the Capri Acquisition USD Senior Notes with cash on hand at a redemption price equal to \n101\n% of their principal amount. As a result of the redemption prior to their scheduled maturities, the Company was subject to a redemption premium of $\n45.0\n million paid on the Capri Acquisition USD Senior Notes upon such redemption. Additionally, the Company recognized $\n41.2\n million of unamortized debt issuance costs and discounts in connection with the redemption. These redemption premiums, as well as unamortized debt issuance costs and discounts, were recorded as a Loss on extinguishment of debt during the second quarter of fiscal 2025.\nCapri Acquisition EUR Senior Notes\nOn November 27, 2023, the Company issued €\n1.50\n billion aggregate principal amount of the Capri Acquisition EUR Senior Notes, consisting of €\n500.0\n million aggregate principal amount of \n5.350\n% senior unsecured notes due November 27, 2025 at \n99.878\n% of par (the “\n5.350\n% EUR Senior Notes due 2025”), €\n500.0\n million aggregate principal amount of \n5.375\n% senior unsecured notes due November 27, 2027 at \n99.723\n% of par (the \n5.375\n% EUR Senior Notes due 2027”) and €\n500.0\n million aggregate principal amount of our \n5.875\n% senior unsecured notes due November 27, 2031 at \n99.248\n% of par (the “\n5.875\n% EUR Senior Notes due 2031\").\nDue to the termination of the Merger Agreement, on November 25, 2024, the Company redeemed the Capri Acquisition EUR Senior Notes with cash on hand at a redemption price equal to \n101\n% of their principal amount. As a result of the redemption prior to their scheduled maturities, the Company was subject to a redemption premium of $\n16.2\n million paid on the Capri Acquisition EUR Senior Notes upon such redemption. Additionally, the Company recognized $\n13.8\n million of unamortized debt issuance costs and discounts in connection with the redemption. These redemption premiums, as well as unamortized debt issuance costs and discounts, were recorded as a Loss on extinguishment of debt during the second quarter of fiscal 2025.\nDebt Covenants\nUnder the terms of our debt facilities, we must comply with certain restrictions limiting the Company’s ability to among other things: (i) incur certain indebtedness, (ii) create certain liens, (iii) enter into certain sale and leaseback transactions, (iv) make certain investments or payments and (v) merge, or consolidate or transfer, sell or lease all or substantially all of the Company’s assets.\nUnder the Amended Revolving Credit Facility, we are required to comply on a quarterly basis with a maximum net leverage ratio of \n4.00\n:1.00, which may be increased to \n4.50\n:1:00 following the consummation of a material acquisition, subject to certain limitations set forth in the Amended Revolving Credit Facility. As of June 28, 2025, we were in compliance with these restrictions and covenants, have met such financial ratios and have met all debt payment obligations.\n96\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nFair Value Considerations\nThe following table shows the estimated fair values of the senior unsecured notes at June 28, 2025 and June 29, 2024 based on external pricing data, including available quoted market prices of the instruments, and consideration of comparable debt instruments with similar interest rates and trading frequency, among other factors, and are classified as Level 2 measurements within the fair value hierarchy:\nJune 28,\n2025\nJune 29,\n2024\n(millions)\nUSD Senior Notes:\n4.250\n% Senior Notes due 2025\n$\n—\n \n$\n300.2\n \n7.050\n% Senior Notes due 2025\n—\n \n508.1\n \n7.000\n% Senior Notes due 2026\n—\n \n770.7\n \n4.125\n% Senior Notes due 2027\n393.0\n \n378.2\n \n7.350\n% Senior Notes due 2028\n—\n \n1,036.5\n \n5.100\n% Senior Notes due 2030\n756.8\n \n—\n \n7.700\n% Senior Notes due 2030\n—\n \n1,042.9\n \n3.050\n% Senior Notes due 2032\n443.2\n \n402.9\n \n7.850\n% Senior Notes due 2033\n—\n \n1,311.3\n \n5.500\n% Senior Notes due 2035\n748.2\n \n—\n \nEUR Senior Notes:\n5.350\n% EUR Senior Notes due 2025\n(1)\n—\n \n543.8\n \n5.375\n% EUR Senior Notes due 2027\n(1)\n—\n \n550.8\n \n5.875\n% EUR Senior Notes due 2031\n(1)\n—\n \n556.4\n \n(1)\nThe fair values of the Capri Acquisition EUR Senior\n \nNotes include the impact of changes in the exchange rate of the United States Dollar against the Euro.\nDebt Maturities\nAs of June 28, 2025, the debt maturities for the next five fiscal years and thereafter are as follows:\nPrincipal\n(1)\n(millions)\nFiscal Year\n2026\n$\n16.7\n \n2027\n—\n \n2028\n396.6\n \n2029\n—\n \n2030\n750.0\n \n2031 and thereafter\n1,250.0\n \nTotal\n$\n2,413.3\n \n(1)\nThe amount outstanding under the China Credit Facility includes the impact of changes in the exchange rate of the United States Dollar against the Renminbi.\n97\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\n13. \nCOMMITMENTS AND CONTINGENCIES\nStuart Weitzman Business Divestiture\nOn February 16, 2025, the Company entered into the Purchase Agreement to sell the Stuart Weitzman Business. The sale was completed on August 4, 2025. Refer to Note 5, \"Acquisitions and Divestitures\" and Note 21, \"Subsequent Events,\" for further information.\nCapri Holdings Limited Merger Agreement\nOn August 10, 2023, the Company entered into the Merger Agreement. On November 13, 2024, the Company entered into the Termination Agreement, pursuant to which the Merger Agreement was terminated, effective immediately. The Parties also agreed to release each other from claims, demands, damages, actions, causes of action and liability relating to or arising out of the Merger Agreement and the transactions contemplated therein or thereby. Refer to Note 5, \"Acquisitions and Divestitures\" for further information.\nLetters of Credit\nThe Company had standby letters of credit, surety bonds and bank guarantees totaling $\n26.5\n million and $\n28.4\n million outstanding at June 28, 2025 and June 29, 2024, respectively. The agreements, which expire at various dates through calendar 2039, primarily collateralize the Company’s obligation to third parties for duty, leases, insurance claims and materials used in product manufacturing. The Company pays certain fees with respect to letters of credit that are issued.\nOther\nThe Company had other contractual cash obligations as of June 28, 2025, including $\n353.0\n million related to inventory purchase obligations, $\n34.3\n million related to capital expenditure and cloud computing implementation commitments, $\n222.3\n million of other purchase obligations, $\n2.41\n billion of debt repayments and $\n771.8\n million of interest payments on the outstanding debt. Refer to Note 9, \"Leases,\" for a summary of the Company's future minimum rental payments under non-cancelable leases.\nThe Company is involved in various routine legal proceedings as both plaintiff and defendant incident to the ordinary course of its business, including proceedings to protect Tapestry's intellectual property rights, litigation instituted by persons alleged to have been injured by advertising claims or upon premises within the Company’s control, contract disputes, insurance claims and litigation, including wage and hour litigation, with present or former employees.\nAlthough the Company's litigation can result in large monetary awards, such as when a civil jury is allowed to determine compensatory and/or punitive damages, the Company believes that the outcome of all pending legal proceedings in the aggregate will not have a material effect on the Company's business or consolidated financial statements. There have been no material developments with respect to any previously reported proceedings. \nFollowing the previously disclosed termination of the proposed Merger Agreement, dated August 10, 2023, by and among the Company, Merger Sub and Capri, pursuant to which, among other things, Merger Sub would merge with and into Capri (the \"Merger\") with Capri surviving the Merger and continuing as a wholly owned subsidiary of the Company (\"the Capri Acquisition\") \ntwo\n separate putative securities class actions were filed on December 23, 2024 and January 28, 2025, by plaintiff shareholders in the United States District Court for the District of Delaware against Capri and certain of its officers and against Tapestry and certain of its officers, alleging that during the respective class periods (between August 10, 2023 and October 24, 2024), Capri and Tapestry misrepresented and failed to disclose adverse facts about Capri’s business, operations, market dynamics, and the prospects for approval of the Capri Acquisition, which were known to defendants or recklessly disregarded by them. The complaints, which each allege violations of sections 10(b) and 20(a) of the Securities Exchange Act of 1934 and rule 10b-5 promulgated thereunder, seek unspecified compensatory damages, costs and expenses, and equitable relief. On July 14, 2025, the Company moved to dismiss the complaint. The Company intends to vigorously defend itself in these matters.\n14. \nGOODWILL AND OTHER INTANGIBLE ASSETS\nThe Company performs its annual impairment assessment of goodwill as well as brand intangibles at the beginning of the fourth quarter of each fiscal year or if an event occurs that would more likely than not reduce the fair value below its carrying amount.\nDuring the fourth quarter of fiscal 2025, the Company performed its annual goodwill and indefinite-lived intangible assets impairment analysis. The assessment concluded that the fair values of the Kate Spade reporting unit and indefinite-lived brand \n98\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nintangible asset did not exceed their respective carrying values due to a reduction in both current and future expected cash flows, which includes an estimated impact of cost increases due to changes in tariff and trade policies. \nAccordingly, the Company recorded a goodwill impairment charge of $\n244.1\n million related to the Kate Spade reporting unit during the fourth quarter of the fiscal year. The Company also recorded an impairment charge of $\n610.7\n million related to the Kate Spade indefinite-lived brand intangible asset. The goodwill and brand intangible asset impairment charges were recorded within SG&A expenses on the Company's Consolidated Statement of Operations.\nThe estimated fair value of the Company’s reporting units are based on a weighted average of the income and market approaches. The income approach is based on estimated discounted future cash flows, while the market approach is based on earnings multiples of selected guideline companies. The approach, which qualifies as Level 3 in the fair value hierarchy, incorporated a number of significant assumptions and judgments, including, but not limited to, estimated future cash flows, discount rates, income tax rates, terminal growth rates and valuation multiples derived from comparable publicly traded companies. \nGoodwill\nThe change in the carrying amount of the Company’s Goodwill by segment is as follows:\nCoach\nKate Spade\nStuart Weitzman\nTotal\n(millions)\nBalance at July 1, 2023\n$\n597.5\n \n$\n630.0\n \n$\n—\n \n$\n1,227.5\n \nForeign exchange impact\n(\n19.5\n)\n(\n3.9\n)\n—\n \n(\n23.4\n)\nBalance at June 29, 2024\n578.0\n \n626.1\n \n—\n \n1,204.1\n \nImpairment charges\n—\n \n(\n244.1\n)\n—\n \n(\n244.1\n)\nForeign exchange impact\n19.5\n \n3.8\n \n—\n \n23.3\n \nBalance at June 28, 2025\n$\n597.5\n \n$\n385.8\n \n$\n—\n \n$\n983.3\n \nIntangible Assets\nIntangible assets consist of the following:\nJune 28, 2025\nJune 29, 2024\nGross \nCarrying \nAmount\nAccum.\nAmort.\nNet\nGross \nCarrying \nAmount\nAccum.\nAmort.\nNet\n(millions)\nIntangible assets subject to amortization:\nCustomer relationships\n(1)\n$\n45.6\n \n$\n(\n25.1\n)\n$\n20.5\n \n$\n100.3\n \n$\n(\n56.5\n)\n$\n43.8\n \nTotal intangible assets subject to amortization\n45.6\n \n(\n25.1\n)\n20.5\n \n100.3\n \n(\n56.5\n)\n43.8\n \nIntangible assets not subject to amortization:\nTrademarks and trade names\n(2)\n699.1\n \n—\n \n699.1\n \n1,309.8\n \n— \n1,309.8\n \nTotal intangible assets\n$\n744.7\n \n$\n(\n25.1\n)\n$\n719.6\n \n$\n1,410.1\n \n$\n(\n56.5\n)\n$\n1,353.6\n \n(1)\n    \nAs of June 28, 2025, $\n18.2\n million related to the net carrying value of customer relationships of the Stuart Weitzman Business were reclassified to Assets held for sale in the Company's Condensed Consolidated Balance Sheet. Refer to Note 5, \"Acquisitions and Divestitures,\" for further information. \n(2)    \nThe Company recognized a $\n610.7\n million non-cash charge related to the impairment of the Kate Spade indefinite-lived brand intangible asset in fiscal 2025.\nAmortization expense for the Company’s definite-lived intangible assets was $\n5.2\n million and $\n6.5\n million for fiscal 2025 and fiscal 2024, respectively.\n99\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nAs of June 28, 2025, the expected amortization expense for intangible assets is as follows:\n Amortization Expense\n(millions)\nFiscal Year\nFiscal 2026\n$\n3.0\n \nFiscal 2027\n3.0\n \nFiscal 2028\n3.0\n \nFiscal 2029\n3.0\n \nFiscal 2030\n3.0\n \nFiscal 2031 and thereafter\n5.5\n \nTotal\n$\n20.5\n \nThe expected amortization expense above reflects remaining useful life of approximately \n7.0\n years for customer relationships.\n15. \nINCOME TAXES \nThe provisions for income taxes, computed by applying the U.S. statutory rate to income before taxes, as reconciled to the actual provisions were:\nFiscal Year Ended\n \nJune 28, 2025\nJune 29, 2024\nJuly 1, 2023\n \nAmount\nPercentage\nAmount\nPercentage\nAmount\nPercentage\n(millions)\nIncome before provision for income taxes:\n \n \n \n \n \n \nUnited States\n(1)\n$\n(\n655.8\n)\n(\n303.5\n)\n%\n$\n139.0\n \n13.7\n \n%\n$\n421.5\n \n36.9\n \n%\nForeign\n871.9\n \n403.5\n \n872.9\n \n86.3\n \n721.6\n \n63.1\n \nTotal income before provision for income taxes\n$\n216.1\n \n100.0\n \n%\n$\n1,011.9\n \n100.0\n \n%\n$\n1,143.1\n \n100.0\n \n%\nTax expense at U.S. statutory rate\n$\n45.3\n \n21.0\n \n%\n$\n212.5\n \n21.0\n \n%\n$\n240.0\n \n21.0\n \n%\nState taxes, net of federal benefit\n5.5\n \n2.5\n \n18.1\n \n1.8\n \n23.2\n \n2.0\n \nEffects of foreign operations\n(2)\n19.8\n \n9.2\n \n20.5\n \n2.0\n \n4.3\n \n0.4\n \nEffects of tax credits, acquisition costs and reorganization costs\n(\n95.5\n)\n(\n44.2\n)\n(\n64.6\n)\n(\n6.4\n)\n(\n61.3\n)\n(\n5.4\n)\nEffects of impairment\n(3)\n51.3\n \n23.7\n \n—\n \n—\n \n—\n \n—\n \nShare-based compensation\n(\n7.8\n)\n(\n3.6\n)\n2.3\n \n0.2\n \n(\n1.3\n)\n(\n0.1\n)\nOther, net\n14.3\n \n6.6\n \n7.1\n \n0.8\n \n2.2\n \n0.2\n \nTaxes at effective worldwide rates\n$\n32.9\n \n15.2\n \n%\n$\n195.9\n \n19.4\n \n%\n$\n207.1\n \n18.1\n \n%\n(1)\nThe United States jurisdiction includes foreign pre-tax earnings allocated to the Company from its interest in a foreign partnership.\n(2)\nThis includes the tax related to the Global Intangible Low-Taxed Income (\"GILTI\"). The Company has elected to account for the tax associated with GILTI as a period cost, and accordingly, the Company has not recorded deferred taxes associated with GILTI.\n(3)\nThis item represents the effective tax rate impact of the Kate Spade goodwill impairment activity recorded in the U.S. in fiscal 2025. \n100\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nCurrent and deferred tax provision (benefit) was:\nFiscal Year Ended\n \nJune 28, 2025\nJune 29, 2024\nJuly 1, 2023\n \nCurrent\nDeferred\nCurrent\nDeferred\nCurrent\nDeferred\n(millions)\nFederal\n$\n60.6\n \n$\n(\n144.1\n)\n$\n71.0\n \n$\n14.2\n \n$\n111.6\n \n$\n24.7\n \nForeign\n88.8\n \n16.3\n \n103.5\n \n(\n14.6\n)\n48.0\n \n3.6\n \nState\n23.3\n \n(\n12.0\n)\n18.9\n \n2.9\n \n6.3\n \n12.9\n \nTotal current and deferred tax provision (benefit)\n$\n172.7\n \n$\n(\n139.8\n)\n$\n193.4\n \n$\n2.5\n \n$\n165.9\n \n$\n41.2\n \nThe components of deferred tax assets and liabilities were:\nJune 28,\n2025\nJune 29,\n2024\n(millions)\nShare-based compensation\n$\n17.4\n \n$\n20.6\n \nReserves not deductible until paid\n44.4\n \n46.7\n \nEmployee benefits\n41.9\n \n30.1\n \nNet operating loss\n29.2\n \n45.5\n \nOther\n66.9\n \n44.8\n \nInventory\n16.4\n \n17.6\n \nLease liability\n332.1\n \n316.2\n \nGross deferred tax assets\n548.3\n \n521.5\n \nValuation allowance\n17.6\n \n32.1\n \nDeferred tax assets after valuation allowance\n$\n530.7\n \n$\n489.4\n \nGoodwill \n55.5\n \n48.6\n \nOther intangibles\n163.4\n \n308.6\n \nProperty and equipment\n15.2\n \n15.1\n \nForeign investments\n38.7\n \n43.3\n \nRight-of-use\n302.7\n \n279.3\n \nPrepaid expenses\n1.2\n \n1.7\n \nGross deferred tax liabilities\n576.7\n \n696.6\n \nNet deferred tax (liabilities) assets\n$\n(\n46.0\n)\n$\n(\n207.2\n)\nConsolidated Balance Sheets Classification\n \n \nDeferred income taxes – non-current asset\n33.8\n \n44.1\n \nDeferred income taxes – non-current liability\n(\n79.8\n)\n(\n251.3\n)\nNet deferred tax (liabilities) assets\n$\n(\n46.0\n)\n$\n(\n207.2\n)\nSignificant judgment is required in determining the worldwide provision for income taxes, and there are many transactions for which the ultimate tax outcome is uncertain. It is the Company’s policy to establish provisions for taxes that may become payable in future years, including those due to an examination by tax authorities. The Company establishes the provisions based upon management’s assessment of exposure associated with uncertain tax positions. The provisions are analyzed at least quarterly and adjusted as appropriate based on new information or circumstances in accordance with the requirements of ASC 740.\n101\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nA reconciliation of the beginning and ending gross amount of unrecognized tax benefits is as follows:\nJune 28,\n2025\nJune 29,\n2024\nJuly 1,\n2023\n(millions)\nBalance at beginning of fiscal year\n$\n115.8\n \n$\n91.8\n \n$\n96.1\n \nGross increase due to tax positions related to prior periods\n15.9\n \n20.5\n \n4.3\n \nGross decrease due to tax positions related to prior periods\n(\n15.5\n)\n(\n0.9\n)\n(\n7.7\n)\nGross increase due to tax positions related to current period\n4.5\n \n6.5\n \n5.2\n \nDecrease due to lapse of statutes of limitations\n(\n2.4\n)\n(\n2.1\n)\n(\n6.1\n)\nDecrease due to settlements with taxing authorities\n(\n7.6\n)\n—\n \n—\n \nBalance at end of fiscal year\n$\n110.7\n \n$\n115.8\n \n$\n91.8\n \nOf the $\n110.7\n million ending gross unrecognized tax benefit balance as of June 28, 2025, $\n107.1\n million relates to items which, if recognized, would impact the effective tax rate. Of the $\n115.8\n million ending gross unrecognized tax benefit balance as of June 29, 2024, $\n112.1\n million relates to items which, if recognized, would impact the effective tax rate. As of June 28, 2025 and June 29, 2024, gross interest and penalties payable was $\n26.9\n million and $\n19.7\n million, respectively, which are included in Other liabilities. During fiscal 2025, fiscal 2024 and fiscal 2023, the Company recognized gross interest and penalty expense of $\n7.1\n million, gross interest and penalty expense of $\n9.5\n million and gross interest and penalty expense of $\n2.3\n million, respectively.\nThe Company files income tax returns in the U.S. federal jurisdiction, as well as various state and foreign jurisdictions. Tax examinations are currently in progress in select foreign and state jurisdictions that are extending the years open under the statutes of limitation. Fiscal years 2018 to present are open to examination in the U.S. federal jurisdiction, fiscal 2019 to present in select state jurisdictions and fiscal 2018 to present in select foreign jurisdictions. The Company is currently under U.S. federal audit for fiscal 2018 to 2020. The IRS is examining carryback claims to fiscal 2014 through fiscal 2020 as part of Joint Committee procedures for tax refund claims. The Company anticipates that \none\n or more of these audits may be finalized and certain statutes of limitation may expire in the foreseeable future. However, based on the status of these examinations and the average time typically incurred in finalizing audits with the relevant tax authorities, the Company cannot reasonably estimate the impact these audits may have in the next 12 months, if any, to previously recorded uncertain tax positions. The Company accrues for certain known and reasonably anticipated income tax obligations after assessing the likely outcome based on the weight of available evidence. Although the Company believes that the estimates and assumptions used are reasonable and legally supportable, the final determination of tax audits could be different than that which is reflected in historical income tax provisions and recorded assets and liabilities. With respect to all jurisdictions, the Company has made adequate provision for all income tax uncertainties.\nAs of June 28, 2025, the Company had the following tax loss carryforwards available: U.S. state tax loss carryforwards of $\n370.0\n million and tax loss carryforwards of various foreign jurisdictions of $\n38.3\n million. As of June 29, 2024, the Company had the following tax loss carryforwards available: U.S. state tax loss carryforwards of $\n534.5\n million and tax loss carryforwards of various foreign jurisdictions of $\n78.7\n million. The state net operating loss carryforwards generally start to expire in fiscal 2026. The majority of the foreign net operating loss can be carried forward indefinitely. Deferred tax assets, including the deferred tax assets recognized on these net operating losses, have been reduced by a valuation allowance of $\n17.6\n million as of June 28, 2025 and $\n32.1\n million as of June 29, 2024.\nThe Company is not permanently reinvested with respect to the earnings of a limited number of foreign entities and has recorded the tax consequences of remitting earnings from these entities. The Company is permanently reinvested with respect to all other earnings. The total estimated amount of unremitted earnings of foreign subsidiaries as of June 28, 2025 and June 29, 2024 was $\n1.33\n billion and $\n750.0\n million, respectively. The Company intends to distribute $\n1.20\n billion of earnings that were previously subject to U.S. Federal Tax and has recorded a deferred tax liability of $\n2.9\n million during fiscal 2025 for U.S. state taxes and foreign withholding taxes related to the future distribution. Based on the Company's current analysis, there is further unrecognized deferred tax liability of approximately $\n4.0\n million to $\n6.0\n million on the remaining unremitted earnings.\n102\n16. \nDEFINED CONTRIBUTION PLAN\nThe Company maintains the Tapestry, Inc. 401(k) Savings Plan, which is a defined contribution plan. Employees who meet certain eligibility requirements and are not part of a collective bargaining agreement may participate in this program. The annual expense incurred by the Company for this defined contribution plan was $\n13.1\n million, $\n12.7\n million and $\n13.4\n million in fiscal 2025, fiscal 2024 and fiscal 2023, respectively.\n17. \nSEGMENT INFORMATION\nThe Company has \nthree\n reportable segments:\n•\nCoach\n - Includes global sales primarily of Coach brand products to customers through our DTC, wholesale and licensing businesses.\n•\nKate Spade\n - Includes global sales primarily of kate spade new york brand products to customers through our DTC, wholesale and licensing businesses.\n•\nStuart Weitzman - \nIncludes global sales of Stuart Weitzman brand products primarily through our DTC, wholesale and licensing businesses. On February 16, 2025, the Company entered into the Purchase Agreement to sell the Stuart Weitzman Business. The sale was completed on August 4, 2025. Refer to Note 5, \"Acquisitions and Divestitures,\" and Note 21, \"Subsequent Events,\" for further information.\nThe Company's chief operating decision maker (\"CODM\"), who is its Chief Executive Officer, regularly evaluates operating profit of these segments compared to management's expectations in deciding how to allocate resources and assess performance. Segment operating profit is the gross profit of the segment less direct expenses of the segment. Total expenditures for additions to long-lived assets are not disclosed as this information is not regularly provided to the CODM at the segment level.\nIn addition to these reportable segments, the Company has certain corporate expenses that are not directly attributable to its brands (\"Unallocated corporate expenses\"); therefore, they are not allocated to its segments. Such costs primarily include certain overhead expenses related to corporate functions as well as certain administration, corporate occupancy, information technology and depreciation costs.\nOn February 16, 2025, the Company entered into a sale and purchase agreement (the “Purchase Agreement”) with Caleres, Inc. (the “Purchaser”) to sell the Stuart Weitzman Business (as defined below). The Purchaser acquired certain assets and liabilities of the Company's global business of designing, manufacturing, promotion, marketing, production, distribution, sales and licensing of Stuart Weitzman branded products (the \"Stuart Weitzman Business\"). The sale was completed on August 4, 2025 (the \"Stuart Weitzman Business Divestiture\"). Refer to Note 5, \"Acquisitions and Divestitures,\" and Note 21, \"Subsequent Events,\" for further information. \n103\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nThe following table summarizes net sales, significant expenses and operating profit (loss) of each of the Company's segments and reconciliation to the Company's Income (loss) before provision for income taxes for fiscal 2025, fiscal 2024 and fiscal 2023:\nCoach\nKate Spade\nStuart Weitzman\nTotal \n(millions)\nFiscal 2025\nNet sales\n$\n5,598.5\n \n$\n1,197.1\n \n$\n215.1\n \n$\n7,010.7\n \nCost of sales\n(1)\n1,226.0\n \n399.1\n \n96.7\n \n1,721.8\n \nSelling, general and administrative expenses\n(1)\n2,497.2\n \n1,567.2\n \n133.8\n \n4,198.2\n \nTotal segment operating profit (loss):\n$\n1,875.3\n \n$\n(\n769.2\n)\n$\n(\n15.4\n)\n$\n1,090.7\n \nUnallocated corporate expenses\n(2)\n675.7\n \nUnallocated other charges, net\n(3)\n198.9\n \nIncome (loss) before provision for income taxes\n$\n216.1\n \nFiscal 2024\nNet sales\n$\n5,095.3\n \n$\n1,334.4\n \n$\n241.5\n \n$\n6,671.2\n \nCost of sales\n(1)\n1,219.9\n \n463.2\n \n98.6\n \n1,781.7\n \nSelling, general and administrative expenses\n(1)\n2,224.3\n \n738.6\n \n164.1\n \n3,127.0\n \nTotal segment operating profit (loss):\n$\n1,651.1\n \n$\n132.6\n \n$\n(\n21.2\n)\n$\n1,762.5\n \nUnallocated corporate expenses\n(2)\n622.4\n \nUnallocated other charges, net\n(3)\n128.2\n \nIncome (loss) before provision for income taxes\n$\n1,011.9\n \nFiscal 2023\nNet sales\n$\n4,960.4\n \n$\n1,418.9\n \n$\n281.6\n \n$\n6,660.9\n \nCost of sales\n(1)\n1,313.3\n \n518.8\n \n113.9\n \n1,946.0\n \nSelling, general and administrative expenses\n(1)\n2,117.2\n \n785.1\n \n174.4\n \n3,076.7\n \nTotal segment operating profit (loss):\n$\n1,529.9\n \n$\n115.0\n \n$\n(\n6.7\n)\n$\n1,638.2\n \nUnallocated corporate expenses\n(2)\n465.8\n \nUnallocated other charges, net\n(3)\n29.3\n \nIncome (loss) before provision for income taxes\n$\n1,143.1\n \n(1)    \nSignificant expense categories that are regularly provided to the CODM, or easily computable from information that is regularly provided to the CODM. SG&A expenses includes Other selling, general and administrative expenses and Impairment of goodwill and intangible assets\n on the Company's Consolidated Statement of Operations\n.\n(2)\n     Unallocated corporate expenses represent certain corporate expenses that are not directly attributable to a segment.\n(3)    \nIncludes Loss on extinguishment of debt, Interest expense, net and Other expense (income).\n104\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nThe following table summarizes depreciation and amortization expense of each of the Company's segments for fiscal 2025, fiscal 2024, and fiscal 2023:\nFiscal Year Ended\nJune 28, 2025\n(1)\nJune 29,\n2024\nJuly 1,\n2023\n(millions)\nDepreciation and amortization expense\n(2)\n:\n \n \n \nCoach\n$\n91.2\n \n$\n88.0\n \n$\n94.7\n \nKate Spade\n34.1\n \n41.6\n44.2\n \nStuart Weitzman\n6.1\n \n10.6\n10.5\nTotal segment depreciation and amortization expense:\n131.4\n \n140.2\n149.4\nUnallocated corporate\n(3)\n36.0\n \n33.8\n \n32.8\n \nTotal Depreciation and amortization expense:\n$\n167.4\n \n$\n174.0\n \n$\n182.2\n \n(1)    \nFor the fiscal year ended June 28, 2025, depreciation and amortization expense includes $\n2.7\n million of impairment charges in connection with the sale of the Stuart Weitzman Business of which $\n2.1\n million was recorded within Unallocated corporate and $\n0.6\n million was recorded within the Stuart Weitzman segment. For the fiscal year ended June 28, 2025, depreciation and amortization expense includes $\n1.8\n million of costs related to the Company's organizational efficiency efforts recorded within Unallocated corporate. Refer to Note 5, \"Acquisitions and Divestitures,\" for further information. \n(2)\n    Depreciation and amortization expense for the segments includes an allocation of expense related to assets which support multiple segments.\n(3)    \nUnallocated corporate, which is not a reportable segment, represents certain depreciation and amortization costs that are not directly attributable to a segment.\nImpairment charges in fiscal 2025 includes $\n854.8\n million of brand intangible and goodwill impairment charges for the Kate Spade reportable segment. There were \nno\n impairment charges in fiscal 2024 and fiscal 2023. Refer to Note 14, \"Goodwill and Other Intangible Assets,\" for further information. \nThe following table summarizes total assets of each of the Company's segments for fiscal 2025, fiscal 2024, and fiscal 2023:\nFiscal Year Ended\nJune 28,\n2025\nJune 29,\n2024\nJuly 1,\n2023\n(millions)\nTotal assets:\n \n \n \nCoach\n$\n2,497.5\n \n$\n2,238.4\n \n$\n2,272.3\n \nKate Spade\n1,656.6\n \n2,469.2\n \n2,597.3\n \nStuart Weitzman\n(1)\n176.4\n \n232.6\n \n235.8\n \nTotal segment assets:\n4,330.5\n \n4,940.2\n \n5,105.4\n \nUnallocated corporate\n(2)\n2,250.0\n \n8,456.1\n \n2,011.4\n \nTotal assets:\n$\n6,580.5\n \n$\n13,396.3\n \n$\n7,116.8\n \n(1)    \nAs of June 28, 2025, the assets relating to the Stuart Weitzman Business are presented in the Consolidated Balance Sheet as Assets held for sale. Refer to Note 5, \"Acquisitions and Divestitures,\" for further information.\n(2)    \nUnallocated corporate, which is not a reportable segment, represents certain assets that are not directly attributable to a segment.\n105\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nThe following table disaggregates Net sales for each of the Company's product categories by segment in fiscal 2025, fiscal 2024, and fiscal 2023:\n Fiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nJuly 1, 2023\nAmount\n% of total\nsegment net sales\nAmount\n% of total\nsegment net sales\nAmount\n% of total\nsegment net sales\n(millions)\nCoach\nHandbags\n$\n3,223.3\n \n57.6\n \n%\n$\n2,889.9\n \n56.7\n \n%\n$\n2,847.1\n \n57.4\n \n%\nAccessories\n1,539.5\n \n27.5\n \n1,407.9\n \n27.6\n \n1,325.7\n \n26.7\n \nFootwear\n342.5\n \n6.1\n \n326.0\n \n6.4\n \n311.5\n \n6.3\n \nOther\n493.2\n \n8.8\n \n471.5\n \n9.3\n \n476.1\n \n9.6\n \nTotal Coach\n$\n5,598.5\n \n100.0\n \n%\n$\n5,095.3\n \n100.0\n \n%\n$\n4,960.4\n \n100.0\n \n%\nKate Spade\nHandbags\n$\n623.0\n \n52.1\n \n%\n$\n721.0\n \n54.0\n \n%\n$\n779.7\n \n54.9\n \n%\nAccessories\n269.8\n \n22.5\n \n307.0\n \n23.0\n \n324.8\n \n22.9\n \nFootwear\n55.2\n \n4.6\n \n57.4\n \n4.3\n \n57.8\n \n4.1\n \nOther\n249.1\n \n20.8\n \n249.0\n \n18.7\n \n256.6\n \n18.1\n \nTotal Kate Spade\n$\n1,197.1\n \n100.0\n \n%\n$\n1,334.4\n \n100.0\n \n%\n$\n1,418.9\n \n100.0\n \n%\nStuart Weitzman\n(1)\n$\n215.1\n \n100.0\n \n%\n$\n241.5\n \n100.0\n \n%\n$\n281.6\n \n100.0\n \n%\nTapestry\nHandbags\n$\n3,846.3\n \n54.9\n \n%\n$\n3,610.9\n \n54.1\n \n%\n$\n3,626.8\n \n54.4\n \n%\nAccessories\n1,809.3\n \n25.8\n \n1,714.9\n \n25.7\n \n1,650.5\n \n24.8\n \nFootwear\n612.8\n \n8.7\n \n624.9\n \n9.4\n \n650.9\n \n9.8\n \nOther\n742.3\n \n10.6\n \n720.5\n \n10.8\n \n732.7\n \n11.0\n \nTotal Tapestry\n$\n7,010.7\n \n100.0\n \n%\n$\n6,671.2\n \n100.0\n \n%\n$\n6,660.9\n \n100.0\n \n%\n(1)\nThe significant majority of sales for Stuart Weitzman is attributable to footwear and therefore all of Stuart Weitzman net sales are within the Tapestry Footwear category.\n106\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nGeographic Area Information\nGeographic revenue information is based on the location of our customer sale. Geographic long-lived asset information is based on the physical location of the assets at the end of each fiscal year and includes property and equipment, net, right-of-use assets and other assets.\nUnited \nStates\nGreater \nChina\n(2)\nJapan\nOther\n(3)\nTotal\n(millions)\nFiscal 2025\n \n \n \n \nNet sales\n(1)\n$\n4,208.1\n \n$\n1,059.7\n \n$\n514.8\n \n$\n1,228.1\n \n$\n7,010.7\n \nLong-lived assets\n1,431.7\n \n142.3\n \n105.1\n \n257.7\n \n1,936.8\n \nFiscal 2024\nNet sales\n(1)\n$\n3,949.7\n \n$\n1,012.6\n \n$\n554.4\n \n$\n1,154.5\n \n$\n6,671.2\n \nLong-lived assets\n1,533.7\n \n151.8\n \n94.0\n \n210.0\n \n1,989.5\n \nFiscal 2023\nNet sales\n(1)\n$\n4,040.2\n \n$\n1,015.8\n \n$\n569.0\n \n$\n1,035.9\n \n$\n6,660.9\n \nLong-lived assets\n1,662.5\n \n160.3\n \n87.7\n \n213.5\n \n2,124.0\n \n(1)\nIncludes net sales from our global travel retail business in locations within the specified geographic area.\n(2)\nGreater China includes sales in mainland China, Taiwan, Hong Kong SAR, and Macao SAR.\n(3)\nOther includes sales in Europe, Canada, Malaysia, Australia, South Korea, Singapore and other countries primarily in Asia as well as royalties earned from the Company's licensing partners.\n18. \nEARNINGS PER SHARE\nBasic net income per share is calculated by dividing net income by the weighted-average number of shares outstanding during the period. Diluted net income per share is calculated similarly but includes potential dilution from the exercise of stock options and restricted stock units and any other potentially dilutive instruments, only in the periods in which such effects are dilutive under the treasury stock method.\nThe following is a reconciliation of the weighted-average shares outstanding and calculation of basic and diluted earnings per share:\nFiscal Year Ended\n \nJune 28,\n2025\nJune 29,\n2024\nJuly 1,\n2023\n(millions, except per share data)\nNet income (loss)\n$\n183.2\n \n$\n816.0\n \n$\n936.0\n \nWeighted-average basic shares \n216.8\n \n229.2\n \n236.4\n \nDilutive securities:\nEffect of dilutive securities\n5.7\n \n4.0\n \n4.9\n \nWeighted-average diluted shares \n222.5\n \n233.2\n \n241.3\n \nNet income (loss) per share:\n \n \nBasic\n$\n0.84\n \n$\n3.56\n \n$\n3.96\n \nDiluted\n$\n0.82\n \n$\n3.50\n \n$\n3.88\n \nAt June 28, 2025, there were no options to purchase shares of common stock outstanding but not included in the computation of diluted earnings per share with an exercise price greater than the average market price of the common shares.\n107\nTAPESTRY, INC.\nNotes to Consolidated Financial Statements (Continued)\nAt June 29, 2024, options to purchase \n1.3\n million shares of common stock were outstanding but not included in the computation of diluted earnings per share, as these options’ exercise prices, ranging from $\n41.82\n to $\n51.38\n, were greater than the average market price of the common shares.\nAt July 1, 2023, options to purchase \n2.1\n million shares of common stock were outstanding but not included in the computation of diluted earnings per share, as these options’ exercise prices, ranging from $\n41.65\n to $\n56.39\n, were greater than the average market price of the common shares.\nEarnings per share amounts have been calculated based on unrounded numbers. Options to purchase shares of the Company's common stock at an exercise price greater than the average market price of the common stock during the reporting period are anti-dilutive and therefore not included in the computation of diluted net income (loss) per common share. In addition, the Company has outstanding restricted stock unit awards that are issuable only upon the achievement of certain performance goals. Performance-based restricted stock unit awards are included in the computation of diluted shares only to the extent that the underlying performance conditions (and any applicable market condition modifiers) (i) are satisfied as of the end of the reporting period or (ii) would be considered satisfied if the end of the reporting period were the end of the related contingency period and the result would be dilutive under the treasury stock method. As of June 28, 2025, June 29, 2024 and July 1, 2023, there were approximately \n0.7\n million, \n0.8\n million and \n2.7\n million, respectively, of additional shares issuable upon exercise of anti-dilutive options and contingent vesting of performance-based restricted stock unit awards, which were excluded from the diluted share calculations.\n19. \nRELATED PARTIES\nThe Stuart Weitzman brand owns approximately \n50\n% of a factory located in Spain, which is involved in the production of Stuart Weitzman inventory. Payments to this factory represented $\n5.7\n million, $\n12.3\n million and $\n15.2\n million in fiscal 2025, fiscal 2024, and fiscal 2023, respectively. Amounts payable to this factory were not material at June 28, 2025 or June 29, 2024.\n \n108\n20. \nSUPPLEMENTAL BALANCE SHEET INFORMATION\nThe components of certain balance sheet accounts are as follows:\nJune 28,\n2025\nJune 29,\n2024\n(millions)\nProperty and equipment\n \n \nLand and building\n$\n8.1\n \n$\n8.1\n \nMachinery and equipment\n53.0\n \n69.1\n \nSoftware and computer equipment\n564.1\n \n642.8\n \nFurniture and fixtures\n288.1\n \n295.4\n \nLeasehold improvements\n750.4\n \n720.4\n \nConstruction in progress\n40.8\n \n42.2\n \nLess: accumulated depreciation\n(\n1,215.0\n)\n(\n1,263.3\n)\nTotal property and equipment, net\n$\n489.5\n \n$\n514.7\n \nAccrued liabilities\n \n \nPayroll and employee benefits\n$\n224.4\n \n$\n171.3\n \nAccrued rent\n21.7\n \n17.5\n \nAccrued interest\n56.6\n \n104.7\n \nAccrued income taxes\n56.8\n \n49.7\n \nAccrued freight\n38.3\n \n51.5\n \nAccrued marketing\n84.1\n \n33.6\n \nOther accrued liabilities\n255.0\n \n228.0\n \nTotal accrued liabilities\n$\n736.9\n \n$\n656.3\n \nOther liabilities\n \n \nDeferred lease obligation\n$\n29.6\n \n$\n32.2\n \nGross unrecognized tax benefit\n110.7\n \n115.8\n \nLong-term derivative liabilities\n256.1\n \n137.2\n \nOther\n106.1\n \n89.9\n \nTotal other liabilities\n$\n502.5\n \n$\n375.1\n \n109\n21. \nSUBSEQUENT EVENTS\nStuart Weitzman Business Divestiture\nOn August 4, 2025, the Company completed the sale of the Stuart Weitzman Business for $\n105.0\n million, subject to customary adjustments for cash, indebtedness, net working capital and transaction expenses as set forth in the Purchase Agreement. Refer to Note 5, \"Acquisitions and Divestitures,\" for further information.\nStock Repurchase Program\nAs previously disclosed, in November 2024, the Company executed the ASR Agreements to repurchase an aggregate of up to $\n2.00\n billion of the Company’s shares of common stock and received an initial delivery of \n28,363,766\n shares. Under the terms of the ASR Agreements, the Company owes an estimated settlement of approximately $\n200.0\n million. The final payment is expected to be made during the first quarter of fiscal 2026.\n \n110\nTAPESTRY, INC.\nSchedule II — Valuation and Qualifying Accounts\nFor the Fiscal Years Ended June 28, 2025, June 29, 2024 and July 1, 2023\nBalance at Beginning\nof Year\nAdditions Charged to Costs and Expenses\nWrite-offs/\nAllowances Taken\nBalance at\nEnd of Year\n(millions)\nFiscal 2025\n \n \n \n \nAllowance for credit losses\n(1)\n$\n6.9\n \n$\n3.6\n \n$\n(\n3.8\n)\n$\n6.7\n \nAllowance for returns\n(1)\n11.2\n \n17.3\n \n(\n12.8\n)\n15.7\n \nAllowance for markdowns\n(1)\n9.6\n \n17.4\n \n(\n14.8\n)\n12.2\n \nValuation allowance\n32.1\n \n—\n \n(\n14.5\n)\n17.6\n \nTotal\n$\n59.8\n \n$\n38.3\n \n$\n(\n45.9\n)\n$\n52.2\n \nFiscal 2024\n \n \n \n \nAllowance for credit losses\n$\n5.8\n \n$\n4.3\n \n$\n(\n3.2\n)\n$\n6.9\n \nAllowance for returns\n15.3\n \n10.4\n \n(\n14.5\n)\n11.2\n \nAllowance for markdowns\n11.3\n \n14.9\n \n(\n16.6\n)\n9.6\n \nValuation allowance\n34.3\n \n—\n \n(\n2.2\n)\n32.1\n \nTotal\n$\n66.7\n \n$\n29.6\n \n$\n(\n36.5\n)\n$\n59.8\n \nFiscal 2023\n \n \n \n \nAllowance for credit losses\n$\n3.7\n \n$\n5.7\n \n$\n(\n3.6\n)\n$\n5.8\n \nAllowance for returns\n11.2\n \n14.2\n \n(\n10.1\n)\n15.3\n \nAllowance for markdowns\n11.6\n \n17.6\n \n(\n17.9\n)\n11.3\n \nValuation allowance\n51.6\n \n—\n \n(\n17.3\n)\n34.3\n \nTotal\n$\n78.1\n \n$\n37.5\n \n$\n(\n48.9\n)\n$\n66.7\n \n(1)    \nFiscal 2025 balances at end of year for Allowance for credit losses, Allowance for returns and Allowance for markdowns includes balances for the Stuart Weitzman Business of $\n1.0\n million, $\n7.4\n million, and $\n4.2\n million, respectively, which are presented in the Consolidated Balance Sheet as Assets held for sale as of June 28, 2025. Refer to Note 5, \"Acquisitions and Divestitures,\" for further information.\n111"
  }
}