{
  "ticker": "TRMB",
  "cik": "0000864749",
  "company_name": "TRIMBLE INC.",
  "filing_date": "2025-04-25",
  "accession": "0000864749-25-000090",
  "primary_doc": "trmb-20250103.htm",
  "item_sections": {
    "item1": "Item 1\n,\n “Business”\n of this report.\nOur growth strategy is centered on multiple elements:\n•\nExecute on our Connect & Scale strategy; \n•\nDeliver customer outcomes that can enable productivity, quality, safety, transparency, and environmental sustainability; \n•\nFocus on software and services; \n•\nAddress attractive markets with significant growth and profitability potential;\n•\nCapitalize on domain knowledge and technological innovation that benefit a diverse customer base; \n•\nDrive geographic expansion with a localization strategy; \n•\nOptimize go-to-market strategies to best access our markets; and\n•\nPursue strategic and targeted acquisitions, divestitures, joint ventures, and investments. \nOur focus on these growth drivers has led over time to growth in revenue and profitability and an increasingly diversified business model.  We continue to experience a shift toward a more significant mix of recurring revenue as demonstrated by our success in driving annualized recurring revenue (“ARR”) of\n $2,257.8 million, which represents growth of 14% year-over-year \nat the end of \n2024\n.  Excluding the impact of foreign currency, acquisitions, and divestitures, organic ARR growth was \n14%\n.  This\n shift toward recurring revenue h\nas positively impacted our revenue mix, growth, and profitability over time and is leading to improved visibility in our businesses.\n  Our software, services, and recurring revenue represented 76% and 67% of total revenue for 2024 and 2023.  \nAdditionally, we continue to maintain focus on increasing our mix of recurring revenue, which is accelerated by the Transporeon \nacquisition that closed in the second quarter of 2023\n and \nthe Ag divestiture that closed in the second quarter of 2024\n.  \nAs our solutions have expanded, our go-to-market model has also evolved with a balanced mix between direct, distribution, and OEM customers as well as enterprise-level customer relationships.\nThroughout this “Management’s Discussion and Analysis of Financial Condition and Results of Operations” section, we refer to organic revenue growth, which is a non-GAAP measure.  For a full definition of ARR, organic ARR, and organic revenue growth as used in this discussion and analysis, refer to the \n“Supplemental Disclosure of Non-GAAP Financial Measures and Annualized Recurring Revenue”\n found later in this Item 7.\nImpact of Recent Events on Our Business\nAcquisitions and Divestitures\nWe acquire businesses that align with our long-term growth strategies including our strategic product roadmap and, conversely, we divest certain businesses that no longer fit those strategies.  This is demonstrated by the 12 acquisitions and 23 divestitures that we have completed since 2020, including the Transporeon acquisition, the Ag divestiture, and the Mobility divestiture. \nMobility Divestiture\nOn September 14, 2024, we entered into a definitive agreement with Platform Science to sell our Mobility business.  Subsequent to the end of the year 2024, the transaction closed on \nFebruary 8, 2025 resulting in our\n ownership\n, or rights to acquire ownership of \n32.5% of Platform Science’s expanded business with an approximate fair value of $248.7 million.  The approximate fair value was determined based on unobservable inputs, including discounted cash flow projections, market comparables, and an option pricing model.  We received (i) shares of preferred stock of Platform Science, with \n28\nTable of Contents\ncertain liquidation preferences, that represent 28.5% of Platform Science’s expanded business and (ii) warrants allowing us the rights to acquire 4% of Platform Science’s expanded business.  The combined businesses aim to enhance driver experience, fleet safety, efficiency, and compliance by combining two cutting-edge in-cab commercial vehicle ecosystems, which gives customers access to more applications and offerings. \nThe assets and liabilities of Mobility were classified as held for sale beginning in the third quarter of 2024.  A valuation allowance was established to reduce the carrying value of the disposal group assets to the approximate fair value of the consideration we would receive.  As a result, we recorded a pre-tax loss of approximately $32.9 million included within Divestitures gain, net in our Consolidated Statements of Income in 2024.  \nUpon the closing of the transaction in the first quarter of 2025, we derecognized the assets and liabilities that were transferred and recorded our equity investment at its cost.  Mobility was reported as a part of our T&L segment.  See \nNote \n4\n “Divestitures”\n in Item 8 of this report.  \nAg Divestiture\nOn September 28, 2023, we executed a Sale and Contribution Agreement with AGCO that provided for the formation of a joint venture, called PTx Trimble, that operates in the mixed fleet precision agriculture market.  The agreement was amended and restated on March 31, 2024, and the transaction closed on April 1, 2024.  Under the terms of the agreement, we contributed our Ag business, excluding certain GNSS and guidance technologies, in exchange for $1.9 billion in cash proceeds, subject to working capital adjustments.  Following the closing of this transaction, we own 15% and AGCO owns 85% of PTx Trimble.  In addition to forming PTx Trimble, the parties concurrently entered into agreements that include the following: (i) long-term supply agreement for key GNSS and guidance technologies, (ii) technology transfer and license agreement, (iii) trademark license agreement, (iv) master sale and distribution agreement for positioning services, and (v) transition services agreement.  Ag was reported as a part of our Field Systems segment. \nUpon closing of the transaction in the second quarter of 2024, we recognized a pre-tax gain of $1.7 billion.  The gain included $275.6 million for our retained 15% ownership interest in PTx Trimble, an LLC, which is reported as an equity method investment. \nThe formation of PTx Trimble is expected to better serve farmers with factory fit and aftermarket applications in the mixed fleet precision agriculture market to help farmers drive productivity, efficiency, and sustainability.  Additionally, the transaction is expected to (i) simplify our Connect & Scale strategy, (ii) reduce risk of channel transition in the agriculture market, and (iii) enhance our financial profile and flexibility with a resulting higher mix of software, services, and recurring revenue.\nWe repaid $1.0 billion of our variable-rate debt through use of the net proceeds and expect to use the majority of the remaining proceeds after tax to repurchase stock.\nMacroeconomic Conditions\nMacroeconomic conditions continue to present significant challenges globally, driven by geopolitical tensions, tariff and trade policies, exchange rate and interest rate volatility, and persistent inflationary pressures.  The heightened trade tensions and related imposition of tariffs between the United States and its trading partners, the extent and duration of these tariffs, and their impact on global economic conditions remain uncertain and depend on various factors, including international negotiations, policy responses, potential exemptions, and shifts in global supply and demand.  These evolving dynamics may have a negative impact on our business operations.  In response, we are closely monitoring global trade developments and considering ways to mitigate potential impacts on our business.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe preparation of financial statements and related disclosures in conformity with U.S. GAAP requires us to make judgments, assumptions, and estimates that affect the reported amounts of assets, liabilities, revenue, costs of sales, operating expenses, and related disclosures.  We consider the accounting polices described below to be our critical accounting policies.  These critical accounting policies are impacted significantly by judgments, assumptions, and estimates used in the preparation of the consolidated financial statements, and actual results could differ materially from the amounts reported based on these policies.  Our accounting policies are more fully described in \nNote 1 “Description of Business and Accounting Policies”\n in Item 8 of this report. \nRevenue Recognition\nRevenue is recognized upon transfer of control of promised products or services to customers in an amount that reflects the consideration we expect to receive in exchange for those products or services.  Revenue is recognized net of allowance for returns and any taxes collected from customers.  We enter into contracts that may include various combinations of products and services, which are generally capable of being distinct and accounted for as separate performance obligations; however, \n29\nTable of Contents\ndetermining whether products or services are considered distinct performance obligations that should be accounted for separately versus together may sometimes require significant judgment.\nJudgment is required to determine stand-alone selling price (“SSP”) for each performance obligation.  We use a range of amounts to estimate SSP and determine whether there is a discount to be allocated based on the relative SSP of the various products and services.  We estimate SSP considering multiple factors including but not limited to, our internal cost, pricing practices, sales channel, competitive positioning, and overall market and business environments.  As our offerings and markets change, we may be required to reassess our estimated SSP and, as a result, the timing and classification of our revenue could be affected.\nIncome Taxes\nWe are a U.S. based multinational company operating in multiple U.S. and foreign jurisdictions.  Judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes.  We consider many factors when evaluating and estimating our tax positions and tax benefits, which may require periodic adjustments and may not accurately forecast actual tax audit outcomes.  Determining whether an uncertain tax position is effectively settled requires judgment.  Changes in recognition or measurement of our uncertain tax positions would result in the recognition of a tax benefit or an additional charge to the tax provision.\nIncome taxes are accounted for under the liability method, whereby deferred tax assets or liability account balances are calculated at the balance sheet date using current tax laws and rates in effect for the year in which the differences are expected to affect taxable income.  A valuation allowance is recorded to reduce the carrying amounts of deferred tax assets if we believe it is more likely than not such assets will not be realized.\nWe are subject to the periodic examination of our domestic and foreign tax returns by the IRS, state, local, and foreign tax authorities who may challenge our tax positions.  We regularly assess the likelihood of adverse outcomes from these examinations in determining the adequacy of our provision for income taxes.\nBusiness Combinations, Divestitures, and Goodwill and Purchased Intangible Assets \nFor business combinations, we allocate the purchase consideration to the assets acquired and liabilities assumed based on their fair values at the acquisition date.  When determining the fair values, we make significant estimates and assumptions, especially concerning intangible assets.  Critical estimates when valuing intangible assets include expected future cash flows based on consideration of revenue and revenue growth rates and margins, customer attrition rates, future changes in technology and brand awareness, loyalty and position, and discount rates.  Any purchase consideration in excess of the fair values of the net assets acquired is recorded as goodwill.  \nWhen divesting a business, a significant portion of the gain or loss may be impacted by the goodwill allocated to the divested business and the fair value of any equity interests acquired in exchange for the disposal group.  We allocate a portion of the applicable reporting unit’s goodwill to the divested business using the ratio of the fair value of the divested business compared to the fair value of the reporting unit.  The fair value of the reporting units, divested businesses, and acquired equity interests is generally determined using a combination of the discounted cash flow method and the guideline company method.  \nThe significant assumptions used in the discounted cash flow model to estimate the fair values include certain assumptions that form the basis of the forecasted results, specifically, revenue, revenue growth rates, and discount rates.  These significant assumptions are forward looking and could be affected by future economic and market conditions.\nWe evaluate goodwill on an annual basis in our fourth quarter or more frequently if indicators of potential impairment exist.  To determine whether goodwill is impaired, we first assess qualitative factors.  Qualitative factors include but are not limited to macroeconomic conditions, industry and market considerations, cost factors, overall financial performance, or other relevant company-specific events.  If it is determined more likely than not that the fair value of a goodwill reporting unit is less than its carrying amount, we perform a quantitative analysis.  Alternatively, we may bypass the qualitative assessment and perform a quantitative impairment test.\nWhen performing a quantitative approach, we compare the reporting unit’s carrying amount, including goodwill, to the reporting unit's fair value.  The estimation of a reporting unit's fair value involves using estimates and assumptions, including expected future operating performance using risk-adjusted discount rates.  If the reporting unit's carrying amount exceeds its fair value, an impairment loss is recognized.  \nWe review intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of those assets may not be recoverable based on their future cash flows.  The estimated future cash flows are primarily based on assumptions about expected future operating performance. \n30\nTable of Contents\nRESULTS OF OPERATIONS \nOverview\nThe following table shows revenue by category, gross margin and gross margin as a percentage of revenue, operating income and operating income as a percentage of revenue, diluted earnings per share, and annualized recurring revenue compared for the periods indicated:\n \n2024\n2023\nDollar Change\n% Change\n(In millions, except per share amounts) \n \n \nRevenue:\nProduct\n$\n1,284.0 \n$\n1,771.7 \n$\n(487.7)\n(28)%\nSubscription and services\n2,399.3 \n2,027.0 \n372.3 \n18%\nTotal revenue\n$\n3,683.3 \n$\n3,798.7 \n$\n(115.4)\n(3)%\nGross margin\n$\n2,396.3 \n$\n2,332.8 \n$\n63.5 \n3%\nGross margin as a % of revenue\n65.1 \n%\n61.4 \n%\nOperating income\n$\n460.7 \n$\n448.8 \n$\n11.9 \n3%\nOperating income as a % of revenue\n12.5 \n%\n11.8 \n%\nDiluted earnings per share\n$\n6.09 \n$\n1.25 \n$\n4.84 \n387%\nNon-GAAP operating income \n(1)\n$\n937.2 \n$\n934.7 \n$\n2.5 \n—%\nNon-GAAP operating income as a % of revenue \n(1)\n25.4 \n%\n24.6 \n%\nNon-GAAP diluted earnings per share \n(1)\n$\n2.85 \n$\n2.66 \n$\n0.19 \n7%\nAnnualized Recurring Revenue (“ARR”)\n (1)\n$\n2,257.8 \n$\n1,982.3 \n$\n275.5 \n14%\n(1)    \nRefer to\n \n“Supplemental Disclosure of Non-GAAP Financial Measures and Annualized Recurring Revenue”\n of this report for definitions.\nBasis of Presentation\nWe use a 52–53 week fiscal year ending on the Friday nearest to December 31, which for 2024 was January 3, 2025.  2024\n was a \n53\n-week year and \n2023 \nwas a \n52\n-week year\n.  2025 will be a 52-week year.\nYear 2024 Compared with Year 2023\nRevenue\n2024\nChange versus 2023\n% Change\nProduct\nSubscription and Services\nTotal Revenue\nChange in Revenue\n(28)\n%\n18 \n%\n(3)\n%\nAcquisitions\n2 \n%\n2 \n%\n2 \n%\nDivestitures\n(21)\n%\n(1)\n%\n(10)\n%\nOrganic growth\n(9)\n%\n17 \n%\n5 \n%\nOrganic total revenue increased due to the increased mix of subscription and services revenue and the impact of the additional week in fiscal 2024.  \nOrganic product revenue decreased due to lower Ag demand in the first quarter and higher U.S. federal government sales of Surveying hardware in the prior year. \nOrganic subscription and services revenue increased primarily due to strong growth in subscription and software term licenses in all segments, primarily AECO, and to a lesser extent, the impact of the additional week.  \nGross Margin\nGross margin increased due to the organic growth of higher margin software and subscription sales, including the impact of the additional week, partially offset by the divestiture of Ag margin hardware sales.\nGross margin as a percentage of revenue increased due to the organic growth of higher margin software and subscription sales and the divestiture of Ag’s lower margin hardware sales.\n31\nTable of Contents\nOperating Income\nOperating income and operating income as a percentage of revenue increased primarily due to organic growth and associated gross margin expansion and to a lesser extent, the impact of the additional week.  The increase was partially offset by the Ag divestiture and higher acquisition and divestiture transaction costs.\nResearch and Development, Sales and Marketing, and General and Administrative Expense\nThe following table shows research and development (“R&D”), sales and marketing (“S&M”), and general and administrative (“G&A”) expense along with these expenses as a percentage of revenue for the periods indicated:\n \n2024\n2023\nDollar Change\n% Change\n(In millions)\n \n \nResearch and development\n$\n662.3 \n$\n664.3 \n$\n(2.0)\n—%\nPercentage of revenue\n18.0 \n%\n17.5 \n%\nSales and marketing\n$\n603.8 \n$\n583.0 \n$\n20.8 \n4%\nPercentage of revenue\n16.4 \n%\n15.3 \n%\nGeneral and administrative\n$\n547.9 \n$\n487.5 \n$\n60.4 \n12%\nPercentage of revenue\n14.9 \n%\n12.8 \n%\nTotal\n$\n1,814.0 \n$\n1,734.8 \n$\n79.2 \n5%\nR&D expense decreased primarily due to the impact of the divestiture, partially offset by expense related to Transporeon, and to a lesser extent, the impact of the additional week.  We believe that the development and introduction of new solutions are critical to our future success, and we expect to continue the active development of new products.\nS&M expense increased slightly primarily due to higher compensation expense, including commissions, and the impact of the additional week, partially offset by the impact of the Ag divestiture. \nG&A expense increased primarily due to divestiture transaction costs, and to a lesser extent, investments related to our Connect & Scale strategy and the impact of the additional week.  The increase was partially offset by the impact of the Ag divestiture.\nAmortization of Purchased Intangible Assets\nThe following table shows amortization of purchased intangible assets for the periods indicated:\n \n2024\n2023\nDollar Change\n% Change\n(In millions)\n \n \nCost of sales\n$\n93.3 \n$\n108.7 \n$\n(15.4)\n(14)%\nOperating expenses\n105.7 \n103.6 \n2.1 \n2%\nTotal amortization expense of purchased intangibles \n$\n199.0 \n$\n212.3 \n$\n(13.3)\n(6)%\nTotal amortization expense of purchased intangibles as a percentage of revenue\n5 \n%\n6 \n%\nIn 2024, total amortization expense of purchased intangibles decreased primarily due to the expiration of prior years’ acquisition amortization, partially offset by the amortization of intangibles acquired from the Transporeon acquisition, which was not applicable in the first quarter of 2023.\nNon-Operating Income (Expense), Net\nThe following table shows non-operating income (expense), net for the periods indicated:\n \n2024\n2023\nDollar Change\n% Change\n(In millions)\n \n \nDivestitures gain, net\n$\n1,687.9 \n$\n9.2 \n$\n1,678.7 \n18247%\nInterest expense, net\n(90.7)\n(161.0)\n70.3 \n(44)%\n(Loss) income from equity method investments, net\n(48.1)\n28.1 \n(76.2)\n(271)%\nOther (loss) income, net\n(3.9)\n31.9 \n(35.8)\n(112)%\nTotal non-operating income (expense), net\n$\n1,545.2 \n$\n(91.8)\n$\n1,637.0 \n(1783)%\nNon-operating income, net increased primarily due to the Ag divestiture gain and lower interest expense.  These increases were partially offset by lower joint-venture profitability, including $52.7 million of our proportionate share of PTx Trimble’s goodwill impairment and a prior year foreign currency hedging gain associated with the acquisition of Transporeon that was included in Other (loss) income, net.\n32\nTable of Contents\nIncome Tax Provision \nOur provision for income taxes in 2024 increased by $455.8 million compared to 2023, primarily due to the gain from the Ag divestiture.  Our effective income tax rate for 2024 and 2023 were 25.0% and 12.8%.  The increase in the tax rate was primarily due to gains from the Ag divestiture.\nResults by Segment\nWe report our financial performance, including revenue and operating income, based on three reportable segments: AECO, Field Systems, and T&L.\nOur Chief Executive Officer, who is our Chief Operating Decision Maker (“CODM”) views and evaluates operations based on the results of our reportable operating segments under our management reporting system.  These results are not necessarily in conformance with U.S. GAAP.  For additional discussion of our segments, refer to \nNote 7 “\nReporting \nSegment\n \nand Geographic \nInformation”\n in Item 8 of this report.\nThe following table is a summary of revenue and operating income by segment compared for the periods indicated:\n \n2024\n2023\nDollar Change\n% Change\n(In millions)\n \nAECO\nSegment revenue\n$\n1,358.6 \n$\n1,110.5 \n$\n248.1 \n22%\nSegment revenue as a % of total revenue\n37 \n%\n29 \n%\nSegment operating income \n$\n463.6 \n$\n329.0 \n$\n134.6 \n41%\nSegment operating income as a % of segment revenue\n34.1 \n%\n29.6 \n%\nField Systems\nSegment revenue\n$\n1,535.9 \n$\n1,967.9 \n$\n(432.0)\n(22)%\nSegment revenue as a % of total revenue\n42 \n%\n52 \n%\nSegment operating income \n$\n442.0 \n$\n603.5 \n$\n(161.5)\n(27)%\nSegment operating income as a % of segment revenue\n28.8 \n%\n30.7 \n%\nT&L\nSegment revenue\n$\n788.8 \n$\n720.3 \n$\n68.5 \n10%\nSegment revenue as a % of total revenue\n21 \n%\n19 \n%\nSegment operating income \n$\n155.1 \n$\n118.2 \n$\n36.9 \n31%\nSegment operating income as a % of segment revenue\n19.7 \n%\n16.4 \n%\nThe following table is a reconciliation of our consolidated segment operating income to consolidated income before taxes:\n \n2024\n2023\n(In millions)\n \n \nTotal segment operating income\n$\n1,060.7 \n$\n1,050.7 \nUnallocated general corporate expenses\n(123.5)\n(116.0)\nAmortization of purchased intangible assets\n(199.0)\n(212.3)\nAcquisition / divestiture items\n(81.6)\n(72.4)\nStock-based compensation / deferred compensation\n(163.5)\n(151.1)\nRestructuring and other costs\n(32.4)\n(50.1)\nConsolidated operating income\n460.7 \n448.8 \nTotal non-operating income (expense), net\n1,545.2 \n(91.8)\nConsolidated income before taxes\n$\n2,005.9 \n$\n357.0 \nAECO\nChange versus 2023\n2024\n \n% Change\nChange in Revenue - AECO\n22 \n%\nDivestitures\n(1)\n%\nForeign currency exchange\n1 \n%\nOrganic growth\n22 \n%\nOrganic revenue increased due to strong demand for subscription offerings, particularly for Viewpoint, Architecture and Design, and to a lesser extent, MEP and Structures offerings.  Additionally, the increase was driven by the impact of the \n33\nTable of Contents\nadditional week of subscription and term license revenue in the fourth quarter, including Structures annual term license renewals on January 1, 2025.\nOperating income and operating income as a percentage of revenue increased primarily due to strong organic revenue growth and gross margin expansion, partially offset by increased operating expense associated with double digit revenue growth.\nField Systems\nChange versus 2023\n2024\n \n% Change\nChange in Revenue - Field Systems\n(22)\n%\nAcquisitions\n1 \n%\nDivestitures\n(19)\n%\nOrganic growth\n(4)\n%\nOrganic revenue decreased primarily due to higher U.S. federal government sales of Surveying products in the prior year, partially offset by Civil Construction and Advanced Positioning sales growth in the current year.  Additionally, the decrease was due to slower Ag demand in the first quarter of 2024, before the business was divested in the second quarter of 2024.  \nOperating income and operating income as a percentage of revenue decreased primarily due to the impact of the Ag divestiture.\nT&L\nChange versus 2023\n2024\n \n% Change\nChange in Revenue - T&L\n10 \n%\nAcquisitions\n6 \n%\nDivestitures\n(1)\n%\nOrganic growth\n5 \n%\nOrganic revenue increased primarily driven by Transporeon, MAPS, and Enterprise subscription revenue growth, partially offset by lower Mobility sales.\nOperating income and operating income as a percentage of revenue increased primarily due to organic revenue growth and gross margin expansion.  The increase was also driven by the impact of the Transporeon acquisition, which closed in the second quarter of 2023.\n34\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nAt the End of Year\n2024\n2023\nDollar Change\n% Change\n(In millions, except percentages)\n \n \nCash and cash equivalents\n (1)\n$\n747.8 \n$\n238.9 \n$\n508.9 \n213 \n%\nAs a percentage of total assets\n7.9 \n%\n2.5 \n%\nPrincipal balance of outstanding debt\n$\n1,400.0 \n$\n3,080.4 \n$\n(1,680.4)\n(55)\n%\nYears\n2024\n2023\nDollar Change\n% Change\n(In millions)\n \n \nNet cash provided by operating activities\n$\n531.4 \n$\n597.1 \n$\n(65.7)\n(11)\n%\nNet cash provided by (used in) investing activities\n1,861.1 \n(2,068.1)\n3,929.2 \n(190)\n%\nNet cash (used in) provided by financing activities\n(1,864.2)\n1,431.5 \n(3,295.7)\n(230)\n%\nEffect of exchange rate changes on cash and cash equivalents\n(19.4)\n7.4 \n(26.8)\n(362)\n%\nNet increase (decrease) in cash and cash equivalents\n$\n508.9 \n$\n(32.1)\n(1) Includes $9.0 million and $9.1 million of cash and cash equivalents classified as held for sale as of January 3, 2025 and December 29, 2023.\nOperating Activities\nThe decrease in cash provided by operating activities was primarily driven by higher tax payments associated with the Ag divestiture gain, and higher accounts receivable due to the impact of the additional week in the fourth quarter of 2024.  The decrease was partially offset by lower net working capital requirements associated with a greater mix of subscription and services revenue and higher deferred revenue due to the impact of the additional week.\nInvesting Activities\nThe increase in cash provided by investing activities was primarily due to the $1.9 billion of proceeds received from the Ag divestiture in the current year, as compared to the $2.0 billion payment in the prior year for the acquisition of Transporeon. \nFinancing Activities\nThe increase in cash used in financing activities was primarily driven by the $1.7 billion repayment of debt in the current year, as compared to the prior year’s $2.0 billion of proceeds from the issuance of debt for the acquisition of Transporeon, partially offset by the $500.0 million repayment of debt.\nCash and Cash Equivalents\nWe believe that our cash and cash equivalents and available borrowing capacity under our existing lines of credit, along with cash provided by operations, will be sufficient in the foreseeable future to meet our anticipated operating cash needs, including expenditures related to our Connect & Scale strategy, debt service, acquisitions, and any stock repurchases under the stock repurchase program. \nOur 2022 credit facility allows us to borrow up to $1.25 billion, with an option to increase the borrowings up to $1.75 billion with lender approval.  As of January 3, 2025, there was no outstanding debt under the 2022 credit facility.  \nOur 2024 senior notes totaling $400.0 million matured and were paid in December 2024.\nIn the second quarter of 2024, \nwe completed the Ag divestiture and received $1.9 billion of cash proceeds, subject to working capital adjustments.  The total tax payment for the transaction is $367.8 million, of which $122.0 million was paid in 2024, with the remaining amount to be paid in 2025.\n \n We used a portion of the proceeds to repay $1.0 billion of term loans and expect to use the majority of the remaining proceeds after tax to repurchase stock. \nOur material cash requirements include the following contractual and other obligations and cash needs:\nLeases\nWe have operating leases primarily for certain of our major facilities including corporate offices, research and development facilities, and manufacturing facilities.  Operating leases represent undiscounted lease payments and include short-term leases.  At the end of 2024, we had fixed lease payment obligations of $182.1 million, with $39.4 million payable within the next 12 months.  Refer to \nNote 9 “Leases”\n in Item 8 of this report for additional information regarding our leases.\nTax Payable\nAt the end of 2024, we had income taxes payable of $325.0 million, which are payable within the next 12 months.   \n35\nTable of Contents\nIn addition, we have unrecognized tax benefits of $78.2 million included in Other non-current liabilities, including interest and penalties.  At this time, we cannot make a reasonably reliable estimate of the period of cash settlement with tax authorities regarding this liability.  Refer to \nNote 13 “Income Taxes”\n in Item 8 of this report for additional information regarding our taxes.\nOther Purchase Obligations and Commitments\nPurchase obligations and commitments primarily relate to investments in our platform associated with our Connect & Scale strategy and non-cancellable inventory commitments.  At the end of 2024, we had operating purchase obligations and commitments of $470.7 million, with $235.4 million payable within the next 12 months.  Other than the items discussed above, we do not have any off-balance sheet financing arrangements or liabilities.\nDebt\nAt the end of 2024, we had outstanding fixed-rate senior notes with varying maturities for an aggregate principal amount of $1.4 billion.  Future interest payments total $517.7 million, with $78.2 million payable within the next 12 months.  During 2024, we made $1.7 billion in debt payments through the use of the net proceeds from the Ag divestiture and cash on hand.  Refer to \nNote 8 “Debt”\n in Item 8 of this report for additional information regarding our debt.\nStock Repurchase Program\nSubsequent to the end of the year 2024, the Board of Directors authorized a common stock repurchase authorization of up to $1.0 billion, which replaces the existing 2024 Stock Repurchase Program in the first quarter of 2025.  We may repurchase stock from time to time through accelerated stock repurchase programs, open market transactions, privately negotiated transactions, block purchases, tender offers, or other means.  The stock repurchase program does not obligate us to acquire any specific number of shares.  Refer to \nNote 15 “Common Stock Repurchase”\n in Item 8 of this report for additional information regarding our stock repurchase program.\nEFFECT OF NEW ACCOUNTING PRONOUNCEMENTS\nThe impact of recent accounting pronouncements is disclosed in \nNote 1 “Description of Business and Accounting Policies”\n in Item 8 of this report.\nSUPPLEMENTAL DISCLOSURE OF NON-GAAP FINANCIAL MEASURES AND ANNUALIZED RECURRING REVENUE\nTo supplement our consolidated financial information, we included non-GAAP financial measures, which are not meant to be considered in isolation or as a substitute for comparable GAAP.  We believe non-GAAP financial measures provide useful information to investors and others in understanding our “core operating performance”, which excludes (i) the effect of non-cash items and certain variable charges not expected to recur; and (ii) transactions that are not meaningful in comparison to our past operating performance or not reflective of ongoing financial results.  Lastly, we believe that our core operating performance offers a supplemental measure for period-to-period comparisons and can be used to evaluate our historical and prospective financial performance, as well as our performance relative to competitors.\nOrganic revenue growth is a non-GAAP measure that refers to revenue excluding the impacts of (i) foreign currency translation, and (ii) acquisitions and divestitures that closed in the prior 12 months.  We believe organic revenue growth provides useful information in evaluating the results of our business because it excludes items that are not indicative of ongoing performance or impact comparability with the prior year.  We provide reconciliation tables showing the change in revenue growth to organic revenue growth in the “\nResults of Operations\n” section found earlier in this Item 7.\nIn addition to providing non-GAAP financial measures, we disclose ARR to give the investors supplementary indicators of the value of our current recurring revenue contracts.  \nARR represents the estimated annualized value of recurring revenue.  ARR is calculated by taking our subscription and maintenance and support for the current quarter and adding the portion of the contract value of all our term licenses attributable to the current quarter, then dividing that sum by the number of days in the quarter and then multiplying that quotient by 365.  Organic ARR refers to annualized recurring revenue excluding the impacts of (i) foreign currency translation, and (ii) acquisitions and divestitures that closed in the prior 12 months.  ARR and organic ARR should be viewed independently of revenue and deferred revenue as they are performance measures and are not intended to be combined with or to replace either of those items.\n36\nTable of Contents\nThe non-GAAP financial measures, definitions, and explanations to the adjustments to comparable GAAP measures are included below:\nYears\n \n \n2024\n2023\n \n \nDollar\n% of\nDollar\n% of\n(In millions, except per share amounts) \n \nAmount\nRevenue\nAmount\nRevenue\nREVENUE:\nGAAP revenue:\n$\n3,683.3 \n$\n3,798.7 \nGROSS MARGIN:\nGAAP gross margin:\n$\n2,396.3 \n65.1 \n%\n$\n2,332.8 \n61.4 \n%\nAmortization of purchased intangible assets\n(A)\n93.3 \n108.7 \nAcquisition / divestiture items\n(B)\n— \n0.5 \nStock-based compensation / deferred compensation\n(C)\n17.4 \n15.0 \nRestructuring and other costs\n(D)\n3.6 \n(0.1)\nNon-GAAP gross margin:\n$\n2,510.6 \n68.2 \n%\n$\n2,456.9 \n64.7 \n%\nOPERATING EXPENSES:\nGAAP operating expenses:\n$\n1,935.6 \n52.6 \n%\n$\n1,884.0 \n49.6 \n%\nAmortization of purchased intangible assets\n(A)\n(105.7)\n(103.6)\nAcquisition / divestiture items\n(B)\n(81.6)\n(71.9)\nStock-based compensation / deferred compensation\n(C)\n(146.1)\n(136.1)\nRestructuring and other costs\n(D)\n(28.8)\n(50.2)\nNon-GAAP operating expenses:\n$\n1,573.4 \n42.7 \n%\n$\n1,522.2 \n40.1 \n%\nOPERATING INCOME:\nGAAP operating income:\n$\n460.7 \n12.5 \n%\n$\n448.8 \n11.8 \n%\nAmortization of purchased intangible assets\n(A)\n199.0 \n212.3 \nAcquisition / divestiture items\n(B)\n81.6 \n72.4 \nStock-based compensation / deferred compensation\n(C)\n163.5 \n151.1 \nRestructuring and other costs\n(D)\n32.4 \n50.1 \nNon-GAAP operating income:\n$\n937.2 \n25.4 \n%\n$\n934.7 \n24.6 \n%\nNON-OPERATING (EXPENSE) INCOME, NET:\nGAAP non-operating (expense) income, net:\n$\n1,545.2 \n$\n(91.8)\nAcquisition / divestiture items\n(B)\n(1,688.5)\n(36.5)\nDeferred compensation\n(C)\n(4.9)\n(5.8)\nRestructuring and other costs\n(D)\n64.1 \n1.3 \nNon-GAAP non-operating expense, net:\n$\n(84.1)\n$\n(132.8)\n \n \nGAAP and Non-GAAP Tax Rate %\nGAAP and Non-GAAP Tax Rate %\n(G)\n(G)\nINCOME TAX PROVISION:\nGAAP income tax provision:\n$\n501.5 \n25.0 \n%\n$\n45.7 \n12.8 \n%\nNon-GAAP items tax effected\n(E)\n(288.1)\n56.9 \nDifference in GAAP and Non-GAAP tax rate\n(F)\n(64.7)\n35.6 \nNon-GAAP income tax provision:\n$\n148.7 \n17.4 \n%\n$\n138.2 \n17.2 \n%\nNET INCOME:\nGAAP net income:\n$\n1,504.4 \n$\n311.3 \nAmortization of purchased intangible assets\n(A)\n199.0 \n212.3 \nAcquisition / divestiture items\n(B)\n(1,606.9)\n35.9 \nStock-based compensation\n(C)\n158.6 \n145.3 \nRestructuring and other costs\n(D)\n96.5 \n51.4 \nNon-GAAP tax adjustments\n(E) - (F)\n352.8 \n(92.5)\nNon-GAAP net income:\n$\n704.4 \n$\n663.7 \nDILUTED NET INCOME PER SHARE:\nGAAP diluted net income per share:\n$\n6.09 \n$\n1.25 \nAmortization of purchased intangible assets\n(A)\n0.80 \n0.85 \nAcquisition / divestiture items\n(B)\n(6.50)\n0.14 \n37\nTable of Contents\nYears\n \n \n2024\n2023\n \n \nDollar\n% of\nDollar\n% of\n(In millions, except per share amounts) \n \nAmount\nRevenue\nAmount\nRevenue\nStock-based compensation\n(C)\n0.64 \n0.58 \nRestructuring and other costs\n(D)\n0.39 \n0.21 \nNon-GAAP tax adjustments\n(E) - (F)\n1.43 \n(0.37)\nNon-GAAP diluted net income per share:\n$\n2.85 \n$\n2.66 \nADJUSTED EBITDA:\nGAAP operating income:\n$\n460.7 \n12.5 \n%\n$\n448.8 \n11.8 \n%\nAmortization of purchased intangible assets\n(A)\n199.0 \n212.3 \nAcquisition / divestiture items\n(B)\n81.6 \n72.4 \nStock-based compensation\n(C)\n163.5 \n151.1 \nRestructuring and other costs\n(D)\n32.4 \n50.1 \nNon-GAAP operating income:\n937.2 \n25.4 \n%\n934.7 \n24.6 \n%\nDepreciation expense and cloud computing amortization\n49.3 \n46.9 \nIncome from equity method investments, net\n13.9 \n28.1 \nAdjusted EBITDA\n$\n1,000.4 \n27.2 \n%\n$\n1,009.7 \n26.6 \n%\nNon-GAAP Definitions\nNon-GAAP gross margin \nWe define Non-GAAP gross margin as GAAP gross margin, excluding the effects of amortization of purchased intangible assets, acquisition/divestiture items, stock-based compensation, deferred compensation, and restructuring and other costs.\n \nWe believe our investors benefit by understanding our non-GAAP gross margin as a way of understanding how product mix, pricing decisions, and manufacturing costs influence our business. \nNon-GAAP operating expenses\n \nWe define Non-GAAP operating expenses as GAAP operating expenses, excluding the effects of amortization of purchased intangible assets, acquisition/divestiture items, stock-based compensation, deferred compensation, and restructuring and other costs.  We believe this measure is important to investors evaluating our non-GAAP spending in relation to revenue. \nNon-GAAP operating income\nWe define Non-GAAP operating income as GAAP operating income, excluding the effects of amortization of purchased intangible assets, acquisition/divestiture items, stock-based compensation, deferred compensation, and restructuring and other costs.\n \nWe believe our investors benefit by understanding our non-GAAP operating income trends, which are driven by revenue, gross margin, and spending. \nNon-GAAP non-operating expense, net\nWe define Non-GAAP non-operating expense, net as GAAP non-operating income (expense), net, excluding acquisition/divestiture items, deferred compensation, and restructuring and other costs.\n \nWe believe this measure helps investors evaluate our non-operating expense trends. \nNon-GAAP income tax provision\nWe define Non-GAAP income tax provision as GAAP income tax provision, excluding charges and benefits such as net deferred tax impacts resulting from the non-U.S. intercompany transfer of intellectual property, deferred tax impacts from global intangible low-taxed income, and significant reserve releases upon the statute of limitations expirations.  We believe this measure helps investors because it provides for consistent treatment of excluded items in our non-GAAP presentation and a difference in the GAAP and non-GAAP tax rates. \nNon-GAAP net income\nWe define Non-GAAP net income as GAAP net income, excluding the effects of amortization of purchased intangible assets, acquisition/divestiture items, stock-based compensation, restructuring and other costs, and non-GAAP tax adjustments.\n \nThis measure provides a supplemental view of net income trends, which are driven by non-GAAP income before taxes and our non-GAAP tax rate. \n38\nTable of Contents\nNon-GAAP diluted net income per share\nWe define Non-GAAP diluted net income per share as GAAP diluted net income per share, excluding the effects of amortization of purchased intangible assets, acquisition/divestiture items, stock-based compensation, restructuring and other costs, and non-GAAP tax adjustments.\n \nWe believe our investors benefit by understanding our non-GAAP operating performance as reflected in a per share calculation as a way of measuring non-GAAP operating performance by ownership in the Company. \nAdjusted EBITDA\nWe define Adjusted EBITDA as non-GAAP operating income plus depreciation expense, cloud computing amortization, and income from equity method investments, net, excluding our proportionate share of items such as goodwill impairment, amortization of purchased intangibles, stock-based compensation, and restructuring costs.  Other companies may define Adjusted EBITDA differently.  Adjusted EBITDA is a performance measure that we believe offers a useful view of the overall operations of our business because it facilitates operating performance comparisons by removing potential differences caused by variations unrelated to operating performance, such as capital structures (interest expense, net), income taxes, depreciation, amortization of purchased intangibles and cloud computing costs, and income from equity method investments, net.  \nExplanations of Non-GAAP adjustments\n(A).\nAmortization of purchased intangible assets\n.\n  Non-GAAP gross margin and operating expenses exclude the amortization of purchased intangible assets, which primarily represents technology and/or customer relationships already developed.\n(B).\nAcquisition / divestiture items\n.\n  Non-GAAP gross margin and operating expenses exclude costs consisting of external and incremental costs resulting directly from acquisitions, divestitures, and strategic investment activities such as legal, due diligence, integration, and other closing costs, including the acceleration of acquisition stock awards and adjustments to the fair value of earn-out liabilities.  Non-GAAP non-operating expense, net, excludes one-time acquisition/divestiture charges, including foreign currency exchange rate gains/losses related to an acquisition, divestiture gains/losses, and strategic investment\n \ngains/losses.  These are one-time costs that vary significantly in amount and timing and are not indicative of our core operating performance. \n(C).\nStock-based compensation / deferred compensation\n.\n  Non-GAAP gross margin and operating expenses exclude stock-based compensation and income or expense associated with movement in our non-qualified deferred compensation plan liabilities.  Changes in non-qualified deferred compensation plan assets, included in non-operating expense, net, offset the income or expense in the plan liabilities.    \n(D).\nRestructuring and other costs.\n  Non-GAAP gross margin and operating expenses exclude restructuring and other costs comprised of termination benefits related to reductions in employee headcount and closure or exit of facilities, expenses related to the 2023 re-audit, as well as a $20 million\n commitment to donate to the Trimble Foundation that was paid over four quarters ending in the first quarter of 2023.  \nNon-GAAP non-operating expense net, excludes our proportionate share of items recorded in income from equity method investment items, such as goodwill impairment, amortization of purchased intangibles, stock-based compensation, and restructuring costs.    \n(E).\nNon-GAAP items tax effected\n.\n  This amount adjusts the provision for income taxes to reflect the effect of the non-GAAP items (A) through (D) on non-GAAP net income.  \n(F).\nDifference in GAAP and non-GAAP tax rate\n.\n  This amount represents the difference between the GAAP and non-GAAP tax rates applied to the non-GAAP operating income plus the non-GAAP non-operating expense, net. The non-GAAP tax rate excludes charges and benefits such as (i) deferred tax impacts from tax amortization relating to a non-U.S. intercompany transfer of intellectual property, (ii) deferred tax impacts from global intangible low-taxed income, and (iii) significant reserve releases upon statute of limitations expirations.\n(G).\nGAAP and non-GAAP tax rate percentages\n.\n  These percentages are defined as GAAP income tax provision as a percentage of GAAP income before taxes and non-GAAP income tax provision as a percentage of non-GAAP income before taxes.  \n39\nTable of Contents\nItem 7A.  Quantitative and Qualitative Disclosures about Market Risk\nWe are exposed to market risk related to changes in interest rates and foreign currency exchange rates.  We use certain derivative financial instruments to manage these risks.  We do not use derivative financial instruments for speculative purposes.  All financial instruments are used in accordance with policies approved by our board of directors.\nMarket Interest Rate Risk\nOur cash equivalents consisted primarily of interest and non-interest bearing bank deposits as well as bank time deposits.  The main objective of these instruments is safety of principal and liquidity while maximizing return, without significantly increasing risk.  Due to the nature of our cash equivalents—that they are readily convertible to cash—we do not anticipate any material effect on our portfolio due to fluctuations in interest rates.\nForeign Currency Exchange Rate Risk\nWe operate in international markets, which expose us to market risk associated with foreign currency exchange rate fluctuations between the U.S. Dollar and various foreign currencies, the most significant of which is the Euro.  \nHistorically, the majority of our revenue contracts are denominated in U.S. Dollars, with the most significant exception being Europe, where we invoice primarily in Euro.  Additionally, a portion of our expenses, primarily the cost to manufacture, cost of personnel to deliver technical support on our products and professional services, sales and sales support, and research and development, are denominated in foreign currencies, primarily the Euro.\nRevenue resulting from selling in local currencies and costs incurred in local currencies are exposed to foreign currency exchange rate fluctuations, which can affect our operating income.  As exchange rates vary, operating income may differ from expectations.  In 2024, changes in foreign currency exchange rates had a favorable impact of $2.7 million on revenue and $5.9 million on operating income. \nWe enter into foreign currency forward contracts to minimize the short-term impact of foreign currency exchange rate fluctuations on cash, debt, and certain trade and intercompany receivables and payables, primarily denominated in Euro, Canadian Dollars, New Zealand Dollars, British Pound, and Australian Dollars.  These contracts reduce the exposure to fluctuations in foreign currency exchange rate movements, as the gains and losses associated with foreign currency balances are generally offset with the gains and losses on the forward contracts.  We occasionally enter into foreign currency exchange contracts to hedge the purchase price of some of our larger business acquisitions.\nOur foreign currency contracts are marked-to-market through earnings every \nperiod and generally range in maturity from one to two months.  We do not enter into foreign currency contracts for trading purposes.  Foreign currency contracts outstanding at the end of 2024 and 2023 are summarized as follows:\n \nAt the End of 2024\nAt the End of 2023\n \nNominal\nAmount\nFair\nValue\nNominal\nAmount\nFair\nValue\n(In millions)\nForward contracts:\nPurchased\n$\n(624.0)\n$\n(8.2)\n$\n(120.3)\n$\n0.3 \nSold\n24.0 \n— \n50.8 \n(0.3)\n40\nTable of Contents\nIndex to Financial Statements\nItem 8.  Financial Statements and Supplementary Data\nTRIMBLE INC.\nINDEX TO FINANCIAL STATEMENTS\n \nConsolidated Balance Sheets\n42\nConsolidated Statements of Income\n43\nConsolidated Statements of Comprehensive\n Income\n44\nConsolidated Statements of Stockholders’ Equity\n45\nConsolidated Statements of Cash Flows\n46\nNotes to Consolidated Financial Statements\n47\nNote 1. Description of Business and Accounting Policies\n47\nNote 2. Earnings per Share\n52\nNote 3. Acquisitions\n52\nNote 4. Divestitures\n53\nNote 5. Intangible Assets and Goodwill\n55\nNote 6. Certain Balance Sheet Components\n56\nNote 7. Reporting Segment and Geographic Information\n56\nNote 8. Debt\n59\nNote 9. Leases\n60\nNote 10. Commitments and Contingencies\n61\nNote 11. Fair Value Measurements\n61\nNote 12. Deferred Revenue and Remaining Performance Obligations\n61\nNote 13. Income Taxes\n62\nNote 14. Employee Stock Benefit Plans\n64\nNote 15. Common Stock Repurchase\n66\nReports of Independent Registered Public Accounting Firm\n (PCAOB ID: \n42\n)\n67\n41\nTable of Contents\nIndex to Financial Statements\nTRIMBLE INC.\nCONSOLIDATED BALANCE SHEETS\nAt the End of Year\n2024\n2023\n(In millions, except par value)\n \n \nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n738.8\n \n$\n229.8\n \nAccounts receivable, net\n725.8\n \n706.6\n \nInventories\n194.3\n \n235.7\n \nPrepaid expenses\n103.3\n \n89.8\n \nOther current assets\n196.2\n \n147.8\n \nAssets held for sale\n312.0\n \n421.2\n \nTotal current assets\n2,270.4\n \n1,830.9\n \nProperty and equipment, net\n188.4\n \n202.5\n \nOperating lease right-of-use assets\n123.5\n \n124.0\n \nGoodwill\n4,988.4\n \n5,350.6\n \nOther purchased intangible assets, net\n998.1\n \n1,243.5\n \nDeferred income tax assets\n294.4\n \n412.3\n \nEquity investments\n361.0\n \n127.7\n \nOther non-current assets\n264.1\n \n247.8\n \nTotal assets\n$\n9,488.3\n \n$\n9,539.3\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nShort-term debt\n$\n—\n \n$\n530.4\n \nAccounts payable\n161.6\n \n165.3\n \nAccrued compensation and benefits\n227.2\n \n181.2\n \nDeferred revenue\n800.4\n \n663.1\n \nIncome taxes payable\n325.0\n \n39.7\n \nOther current liabilities\n211.2\n \n201.3\n \nLiabilities held for sale\n62.6\n \n48.3\n \nTotal current liabilities\n1,788.0\n \n1,829.3\n \nLong-term debt\n1,390.6\n \n2,536.2\n \nDeferred revenue, non-current\n95.6\n \n98.3\n \nDeferred income tax liabilities\n199.9\n \n287.8\n \nOperating lease liabilities\n123.4\n \n121.9\n \nOther non-current liabilities\n145.5\n \n165.7\n \nTotal liabilities\n3,743.0\n \n5,039.2\n \nCommitments and contingencies (Note 10)\nStockholders’ equity:\nPreferred stock, $\n0.001\n par value; \n3.0\n shares authorized; \nnone\n issued and outstanding\n—\n \n—\n \nCommon stock, $\n0.001\n par value; \n360.0\n shares authorized; \n245.8\n and \n246.5\n shares issued and outstanding at the end of 2024 and 2023\n0.2\n \n0.2\n \nAdditional paid-in-capital\n2,369.4\n \n2,214.6\n \nRetained earnings\n3,757.6\n \n2,437.4\n \nAccumulated other comprehensive loss\n(\n381.9\n)\n(\n152.1\n)\nTotal stockholders' equity\n5,745.3\n \n4,500.1\n \nTotal liabilities and stockholders' equity\n$\n9,488.3\n \n$\n9,539.3\n \nSee accompanying Notes to the Consolidated Financial Statements.\n42\nTable of Contents\nIndex to Financial Statements\nTRIMBLE INC.\nCONSOLIDATED STATEMENTS OF INCOME \n(In millions, except per share amounts) \n2024\n2023\n2022\nRevenue:\nProduct\n$\n1,284.0\n \n$\n1,771.7\n \n$\n1,986.1\n \nSubscription and services\n2,399.3\n \n2,027.0\n \n1,690.2\n \nTotal revenue\n3,683.3\n \n3,798.7\n \n3,676.3\n \nCost of sales:\nProduct\n698.3\n \n875.0\n \n1,040.8\n \nSubscription and services\n495.4\n \n482.2\n \n444.9\n \nAmortization of purchased intangible assets\n93.3\n \n108.7\n \n85.0\n \nTotal cost of sales\n1,287.0\n \n1,465.9\n \n1,570.7\n \nGross margin\n2,396.3\n \n2,332.8\n \n2,105.6\n \nOperating expense:\nResearch and development\n662.3\n \n664.3\n \n542.1\n \nSales and marketing\n603.8\n \n583.0\n \n553.6\n \nGeneral and administrative\n547.9\n \n487.5\n \n422.2\n \nRestructuring\n15.9\n \n45.6\n \n30.2\n \nAmortization of purchased intangible assets\n105.7\n \n103.6\n \n46.6\n \nTotal operating expense\n1,935.6\n \n1,884.0\n \n1,594.7\n \nOperating income \n460.7\n \n448.8\n \n510.9\n \nNon-operating income (expense), net:\nDivestitures gain, net\n1,687.9\n \n9.2\n \n99.0\n \nInterest expense, net\n(\n90.7\n)\n(\n161.0\n)\n(\n71.1\n)\n(Loss) income from equity method investments, net\n(\n48.1\n)\n28.1\n \n31.1\n \nOther (loss) income, net\n(\n3.9\n)\n31.9\n \n(\n0.8\n)\nTotal non-operating income (expense), net\n1,545.2\n \n(\n91.8\n)\n58.2\n \nIncome before taxes\n2,005.9\n \n357.0\n \n569.1\n \nIncome tax provision\n501.5\n \n45.7\n \n119.4\n \nNet income\n$\n1,504.4\n \n$\n311.3\n \n$\n449.7\n \nEarnings per share:\nBasic\n$\n6.13\n \n$\n1.26\n \n$\n1.81\n \nDiluted\n$\n6.09\n \n$\n1.25\n \n$\n1.80\n \nShares used in calculating earnings per share:\nBasic\n245.5\n \n247.9\n \n248.6\n \nDiluted\n247.2\n \n249.1\n \n250.2\n \nSee accompanying Notes to the Consolidated Financial Statements.\n43\nTable of Contents\nIndex to Financial Statements\nTRIMBLE INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n \n \n2024\n2023\n2022\n(In millions)\n \n \nNet income\n$\n1,504.4\n \n$\n311.3\n \n$\n449.7\n \nOther comprehensive income (loss), net of tax\nForeign currency translation adjustments\n(\n227.2\n)\n86.4\n \n(\n81.6\n)\nNet change related to derivatives and other\n(\n2.6\n)\n(\n3.6\n)\n8.4\n \nComprehensive income\n$\n1,274.6\n \n$\n394.1\n \n$\n376.5\n \nSee accompanying Notes to the Consolidated Financial Statements.\n44\nTable of Contents\nIndex to Financial Statements\nTRIMBLE INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n \nCommon stock\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nLoss\nTotal\nStockholders’\nEquity\n \nShares\nAmount\nAdditional Paid-In Capital\n(In millions)\n \n \n \n \n \nBalance at the end of 2021\n250.9\n \n$\n0.3\n \n$\n1,935.6\n \n$\n2,170.5\n \n$\n(\n161.7\n)\n$\n3,944.7\n \nNet income\n449.7\n \n449.7\n \nOther comprehensive loss\n— \n— \n— \n— \n(\n73.2\n)\n(\n73.2\n)\nIssuance of common stock under employee plans, net of tax withholdings\n2.0\n \n— \n29.6\n \n(\n43.2\n)\n— \n(\n13.6\n)\nStock repurchases\n(\n6.0\n)\n(\n0.1\n)\n(\n47.6\n)\n(\n347.0\n)\n— \n(\n394.7\n)\nStock-based compensation\n— \n— \n137.3\n \n— \n— \n137.3\n \nBalance at the end of 2022\n246.9\n \n$\n0.2\n \n$\n2,054.9\n \n$\n2,230.0\n \n$\n(\n234.9\n)\n$\n4,050.2\n \nNet income\n— \n— \n— \n311.3\n \n— \n311.3\n \nOther comprehensive income\n— \n— \n— \n— \n82.8\n \n82.8\n \nIssuance of common stock under employee plans, net of tax withholdings\n2.0\n \n— \n31.6\n \n(\n24.9\n)\n— \n6.7\n \nStock repurchases\n(\n2.4\n)\n— \n(\n21.0\n)\n(\n79.0\n)\n— \n(\n100.0\n)\nStock-based compensation\n— \n— \n149.1\n \n— \n— \n149.1\n \nBalance at the end of 2023\n246.5\n \n$\n0.2\n \n$\n2,214.6\n \n$\n2,437.4\n \n$\n(\n152.1\n)\n$\n4,500.1\n \nNet income\n— \n— \n— \n1,504.4\n \n— \n1,504.4\n \nOther comprehensive loss\n— \n— \n— \n— \n(\n229.8\n)\n(\n229.8\n)\nIssuance of common stock under employee plans, net of tax withholdings\n2.2\n \n— \n28.6\n \n(\n35.1\n)\n— \n(\n6.5\n)\nStock repurchases\n(\n2.9\n)\n— \n(\n26.0\n)\n(\n149.1\n)\n— \n(\n175.1\n)\nStock-based compensation\n— \n— \n152.2\n \n— \n— \n152.2\n \nBalance at the end of 2024\n245.8\n \n$\n0.2\n \n$\n2,369.4\n \n$\n3,757.6\n \n$\n(\n381.9\n)\n$\n5,745.3\n \nSee accompanying Notes to the Consolidated Financial Statements.\n45\nTable of Contents\nIndex to Financial Statements\nTRIMBLE INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS \n(In millions)\n2024\n2023\n2022\nCash flow from operating activities:\nNet income\n$\n1,504.4\n \n$\n311.3\n \n$\n449.7\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n232.0\n \n250.6\n \n171.8\n \nDeferred income taxes\n27.0\n \n(\n104.6\n)\n(\n40.0\n)\nStock-based compensation\n158.6\n \n145.4\n \n120.4\n \nDivestitures gain, net\n(\n1,687.9\n)\n(\n9.2\n)\n(\n99.0\n)\nOther, net\n93.9\n \n11.6\n \n41.7\n \n(Increase) decrease in assets:\n \n \nAccounts receivable, net\n(\n135.1\n)\n(\n36.4\n)\n(\n55.4\n)\nInventories\n11.0\n \n67.6\n \n(\n113.5\n)\nOther current and non-current assets\n(\n116.3\n)\n(\n67.2\n)\n(\n46.3\n)\nIncrease (decrease) in liabilities:\nAccounts payable\n5.7\n \n(\n12.4\n)\n(\n24.8\n)\nAccrued compensation and benefits\n56.5\n \n20.8\n \n(\n54.2\n)\nDeferred revenue\n168.5\n \n26.0\n \n108.6\n \nIncome taxes payable\n265.6\n \n(\n4.0\n)\n(\n38.3\n)\nOther current and non-current liabilities\n(\n52.5\n)\n(\n2.4\n)\n(\n29.5\n)\nNet cash provided by operating activities\n531.4\n \n597.1\n \n391.2\n \nCash flow from investing activities:\nProceeds from divestitures\n1,923.4\n \n17.0\n \n215.4\n \nAcquisitions of businesses, net of cash acquired\n(\n22.0\n)\n(\n2,088.9\n)\n(\n373.5\n)\nPurchases of property and equipment\n(\n33.6\n)\n(\n42.0\n)\n(\n43.2\n)\nOther, net\n(\n6.7\n)\n45.8\n \n(\n25.0\n)\nNet cash provided by (used in) investing activities\n1,861.1\n \n(\n2,068.1\n)\n(\n226.3\n)\nCash flow from financing activities:\nIssuance of common stock, net of tax withholdings\n(\n6.5\n)\n6.7\n \n(\n13.6\n)\nRepurchases of common stock\n(\n175.0\n)\n(\n100.0\n)\n(\n394.7\n)\nProceeds from debt and revolving credit lines\n521.2\n \n3,847.1\n \n814.8\n \nPayments on debt and revolving credit lines\n(\n2,199.4\n)\n(\n2,292.9\n)\n(\n590.2\n)\nOther, net\n(\n4.5\n)\n(\n29.4\n)\n(\n15.3\n)\nNet cash (used in) provided by financing activities\n(\n1,864.2\n)\n1,431.5\n \n(\n199.0\n)\nEffect of exchange rate changes on cash and cash equivalents\n(\n19.4\n)\n7.4\n \n(\n20.6\n)\nNet increase (decrease) in cash and cash equivalents\n508.9\n \n(\n32.1\n)\n(\n54.7\n)\nCash and cash equivalents - beginning of period \n(1)\n238.9\n \n271.0\n \n325.7\n \nCash and cash equivalents - end of period \n(1)\n$\n747.8\n \n$\n238.9\n \n$\n271.0\n \nSupplemental cash flow disclosure:\nCash paid for interest\n$\n140.4\n \n$\n133.7\n \n$\n73.1\n \nCash tax paid, net, excluding tax for the Ag divestiture\n106.1\n \n168.0\n \n197.3\n \nCash tax paid for the Ag divestiture\n122.0\n \n—\n \n—\n \nNon-cash equity investment (Note 4)\n(1) \nIncludes $\n9.0\n million and $\n9.1\n million of cash and cash equivalents classified as held for sale as of January 3, 2025 and December 29, 2023.\nSee accompanying Notes to the Consolidated Financial Statements.\n46\nTable of Contents\nIndex to Financial Statements\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nNOTE 1: DESCRIPTION OF BUSINESS AND ACCOUNTING POLICIES\nTrimble Inc. (“we” or “our” or “us”) is incorporated in the State of Delaware since October 2016.\nWe are a leading provider of technology solutions that enable professionals and field mobile workers to improve or transform their work processes.  We focus on transforming the way the world works by delivering products and services that connect the physical and digital worlds.  We generate revenue primarily through the sale of our hardware, software, subscriptions, maintenance and support, and professional services.\nBasis of Presentation\nThese Consolidated Financial Statements include our results of our consolidated subsidiaries.  Intercompany accounts and transactions have been eliminated.\nWe use a 52–53 week fiscal year ending on the Friday nearest to December 31.  2024\n was a \n53\n-week year and \n2023 and 2022\n were \n52\n-week years \nending on January 3, 2025, December 29, 2023, and December 30, 2022.  Unless otherwise stated, all dates refer to our fiscal year and fiscal periods.\nUse of Estimates \nThe preparation of financial statements in accordance with U.S. GAAP requires us to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes.  Estimates and assumptions are used for (i) revenue recognition, including determining the nature and timing of satisfaction of performance obligations and determining standalone selling price of performance obligations; (ii) inventory valuation; (iii) valuation of investments; (iv) valuation of long-lived assets and their estimated useful lives; (v) goodwill and other long-lived asset impairment analyses; (vi) stock-based compensation; and (vii) income taxes.  We base our estimates on historical experience and various other assumptions we believe to be reasonable\n.  Actual results that we experience may differ materially from our estimates.\nReportable Segments\nAs a result of the Ag divestiture and our Chief Operating Decision Maker’s (“CODM”) revised organizational structure, effective in the first quarter of 2024, we reorganized our businesses under a new segment structure.  This structure brings similar businesses together, which is expected to enhance our ability to achieve scale and growth consistent with our strategy.  We report our financial performance, including revenue and operating income, based on \nthree\n updated segments: (i) Architects, Engineers, Construction and Owners (“AECO”), (ii) Field Systems, and (iii) Transportation and Logistics(“T&L”).  Prior years’ information have been adjusted to reflect the change in segment reporting.\nOur CODM views and evaluates operations based on the results of our reportable operating segments under our management reporting system.\n \nRevenue Recognition \nSignificant Judgments\nRevenue is recognized upon transfer of control of promised products or services to customers in an amount that reflects the consideration we expect to receive in exchange for those products or services.  Revenue is recognized net of allowance for returns and any taxes collected from customers.  We enter into contracts that may include various combinations of products and services, which are generally capable of being distinct and accounted for as separate performance obligations; however, determining whether products or services are considered distinct performance obligations that should be accounted for separately versus together may sometimes require significant judgment.\nJudgment is required to determine SSP for each performance obligation.  We use a range of amounts to estimate SSP and determine whether there is a discount to be allocated based on the relative SSP of the various products and services.  We estimate SSP considering multiple factors including but not limited to, our internal cost, pricing practices, sales channel, competitive positioning, and overall market and business environments.  As our offerings and markets change, we may be required to reassess our estimated SSP and, as a result, the timing and classification of our revenue could be affected.\n47\nTable of Contents\nIndex to Financial Statements\nNature of Goods and Services\nWe generate revenue primarily from products and services and subscriptions; each of which is a distinct performance obligation.  Descriptions are as follows:\nProduct\nProduct revenue includes hardware and perpetual software licenses.\nHardwar\ne is recognized when the control of the product transfers to the customer, which is generally when the product is shipped.  We recognize shipping fees reimbursed by customers as revenue and the cost for shipping as an expense in Cost of sales when control over products has transferred to the customer.\nSoftware\n including perpetual licenses is recognized upon delivery and commencement of the license term.  In general, our contracts do not provide for customer specific acceptances.\nSubscription and Services\nSubscription and services revenue includes SaaS and hosting services, term licenses, hardware and software maintenance, and support and professional services. \nSaaS \nmay be sold with devices used to collect, generate, and transmit data.  SaaS is distinct from the related devices.  SaaS is provided on either a subscription or a consumption basis.\n \n In addition, we may host the software that the customer has separately licensed.  Hosting services are distinct from the underlying software.  Subscription terms generally range from month-to-month to \none\n to \nthree years\n.  Subscription revenue is recognized monthly over the subscription term, commencing from activation.  Revenue related to SaaS on a consumption basis is recognized when the customer utilizes the service based on the quantity of the services consumed.\nTerm license subscriptions \ncontain an on-premise term license component as well as maintenance and support.  Term licenses are distinct and recognized upon transfer and commencement of the subscription license term.  Maintenance and support are recognized ratably over the subscription term.  The subscription term generally ranges from \none\n to \nthree years\n.  \nHardware maintenance and support, commonly called extended warranty, \nentitles the customer to receive replacement parts and repair services.  Extended warranty is separately priced and is recognized on a straight-line basis over the extended service period, which begins after the standard warranty period, ranging from \none\n to \ntwo years\n depending on the product line.\nSoftware maintenance and support\n entitles the customer to receive software product upgrades and enhancements on a when and if available basis and technical support.  Software maintenance is recognized on a straight-line basis commencing upon product delivery over the post-contract support term, which ranges from \none\n to \nthree years\n, with one year being most common.\nProfessional services \ninclude installation, training, configuration, project management, system integrations, customization, data migration/conversion, and other implementation services.  The majority of professional services are not complex, can be provided by other vendors, and are readily available and billed on a time-and-material basis.  Revenue for distinct professional services is recognized over time, based on work performed.\nDeferred Costs to Obtain Customer Contracts\nSales commissions incurred in obtaining contracts that include maintenance or subscription revenue are deferred if the contractual term is greater than a year or if renewals are expected, and the renewal commission is not commensurate with the initial commission.  These commission costs are deferred and amortized over the estimated benefit period, which is either the contract term or the shorter of customer life or product life, which ranges from \nthree\n to \nseven years\n.  \nAt the end of 2024 and 2023, deferred costs to obtain customer contracts were $\n124.3\n million and $\n96.4\n million.  These costs are included in Other non-current assets in the Consolidated Balance Sheets.  Amortization expense related to deferred costs to obtain customer contracts was $\n55.2\n million, $\n39.5\n million, and $\n32.0\n million for 2024, 2023, and 2022.  This expense is included in Sales and marketing expense in our Consolidated Statements of Income.\nAccounts Receivable, Net\nAccounts receivable, net, includes billed and unbilled amounts due from customers.  Unbilled receivables include revenue recognized that exceeds the amount billed to the customer, provided the billing is not contingent upon future performance, and we have the unconditional right to future payment with only the passage of time required.  Both billed and unbilled amounts due are stated at their net estimated realizable value.  \n48\nTable of Contents\nIndex to Financial Statements\nWe maintain an allowance for credit losses to provide for the estimated amount of receivables that will not be collected.  Each reporting period, we evaluate the collectability of our trade accounts receivable based on a number of factors, such as age of the accounts receivable balances, credit quality, historical experience, and current and future economic conditions that may affect a customer’s ability to pay.\n  At the end of 2024 and 2023, the allowances for credit losses were immaterial.\nInventories\nInventories are stated at the lower of cost or net realizable value.  Cost is computed using standard cost, which approximates actual cost.  Adjustments are also made to reduce the cost of inventory for estimated excess or obsolete balances.  Factors influencing these adjustments include declines in demand that impact inventory purchasing forecasts, technological changes, product lifecycle and development plans, component cost trends, product pricing, physical deterioration, and quality issues.  If our estimate used to reserve for excess and obsolete inventory differs from what is expected, we may be required to recognize additional reserves, which would negatively impact our gross margin.\nProperty and Equipment, Net\nProperty and equipment are depreciated using the straight-line method over the shorter of the estimated useful lives or the lease terms when applicable.  Useful lives generally range from \nfour\n to \nsix years\n for machinery and equipment, \nfive\n to \nten years\n for furniture and fixtures, \ntwo\n to \nfive years\n for computer equipment and software, \nthirty-nine years\n for buildings, and the life of the lease for leasehold improvements.  Included in the software category, internal-use software includes certain costs to purchase, develop, and implement the software during the application development phase.\n \nCloud Computing Arrangements\nCosts incurred for certain cloud-based software hosting arrangements are capitalized for application development activities, and for preliminary project and post-implementation activities.  Our capitalized development costs are amortized using the straight-line method over the remaining non-cancellable term of the associated hosting arrangement plus any reasonably certain renewal periods.  The capitalized costs are included in “Prepaid expenses” and “Other non-current assets” in our Consolidated Balance Sheets.\n  Capitalized costs net of accumulated amortization were $\n64.1\n million and $\n58.0\n million at the end of 2024 and 2023.  Amortization expense was $\n16.3\n million, $\n8.7\n million, and $\n4.5\n million in 2024, 2023, and 2022.\nLeases\nWe determine if an arrangement is a lease\n at inception.  Operating leases with lease terms greater than one year are included in Operating lease right-of-use (“ROU”) assets, Other current liabilities, and Operating lease liabilities in our Consolidated Balance Sheets. \nROU assets represent our right to use an underlying asset for the lease term, and lease liabilities represent our obligation to make lease payments arising from the lease.  Operating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term.  Present value is determined by using our incremental borrowing rate based on the estimated rate of interest for collateralized borrowings over a similar term of the lease payments at the commencement date.  The operating lease ROU assets include adjustments made for uneven rents, lease incentives, and lease impairments.  Lease expense for lease payments is recognized on a straight-line basis over the lease term.\nLease agreements that include both lease and non-lease components are accounted for as part of the overall lease arrangement.\n \nBusiness Combinations\nWe allocate the fair value of purchase consideration to the assets acquired and liabilities assumed based on their fair values at the acquisition date.  When determining the fair values, we make significant estimates and assumptions, especially concerning intangible assets.  Critical estimates when valuing intangible assets include expected future cash flows based on consideration of revenue and revenue growth rates and margins, customer attrition rates, future changes in technology and brand awareness, loyalty and position, and discount rates.  Any purchase consideration in excess of the fair values of the net assets acquired is recorded as goodwill.  \nAmounts recorded in a business combination may change during the measurement period, which is a period not to exceed one year from the date of acquisition, as additional information about conditions existing at the acquisition date becomes available.  \nAcquisition costs are expensed as incurred.\nGoodwill \nWe evaluate goodwill on an annual basis or more frequently if indicators of potential impairment exist.  To determine whether goodwill is impaired, we first assess qualitative factors.  Qualitative factors include but are not limited to macroeconomic conditions, industry and market considerations, cost factors, overall financial performance, or other relevant company-specific events.  If it is determined more likely than not that the fair value of a goodwill reporting unit is less than its carrying amount, \n49\nTable of Contents\nIndex to Financial Statements\nwe perform a quantitative analysis.  Alternatively, we may bypass the qualitative assessment and perform a quantitative impairment test.\nWhen performing a quantitative approach, we compare the reporting unit’s carrying amount, including goodwill, to the reporting unit’s fair value.  The estimation of a reporting unit’s fair value involves using estimates and assumptions, including expected future operating performance using risk-adjusted discount rates.  If the reporting unit’s carrying amount exceeds its fair value, an impairment loss is recognized.\n \nIntangible Assets\nIntangible assets acquired in a business combination are recorded at fair value.  Our intangible assets are amortized using the straight-line method over their estimated useful lives, which ra\nnge from \nthree\n to \neleven years\n and have a weighted-average useful life of approximately \nnine years\n.  We write off fully amortized intangible assets when those assets are no longer used.\nWe review intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of those assets may not be recoverable based on their future cash flows.  The estimated future cash flows are primarily based upon assumptions about expected future operating performance.\n \nEquity Investments\nWe have investments in various unconsolidated entities.  These investments represent non-marketable securities and include joint operating ventures and strategic investments.  We use the equity method of accounting for investments in common stock holdings where we have significant influence, such as for our \n15\n% investment in PTx Trimble.  Our proportionate share of income or loss for equity method investments is recorded in income (loss) from equity method investments, net. \nFor all other investments, we use the measurement alternative election.  Under the measurement alternative, investments without readily determinable fair values are measured at cost, less any impairments, plus or minus changes resulting from observable price changes in orderly transactions for identical or similar investments of the same issuer.  To determine if a transaction is deemed a similar investment, we consider the rights and obligations of the investments.  All gains and losses on these investments are recognized in other income (loss), net.  \nWe assess all equity investments for impairment whenever events or changes in circumstances indicate that the carrying value of an investment may not be recoverable. \nWe enter into related party transactions with certain of our investees.  These transactions are recorded based on the nature of the arrangements and primarily include sales and purchases involving GNSS technology and guidance products, positioning services, grade control solutions, and surveying products.  Total related party revenue from our investees was $\n108.8\n million, $\n87.7\n million, and $\n102.3\n million for 2024, 2023, and 2022.\n \nForeign Currency Translation\nAssets and liabilities recorded in foreign currency are translated to U.S. dollars at the exchange rate\ns\n on the balance sheet date.  Revenue and expenses are translated at average monthly exchange rates during the year.  Translation adjustments resulting from this process are recorded to other comprehensive income.\nAdvertising and Promotional Costs\nAdvertising and promotional costs are expensed as incurred.\n  Advertising and promotional expense was approximately $\n57.9\n million, $\n57.3\n million, and $\n50.9\n million for 2024, 2023, and 2022.\nStock-Based Compensation\nStock-based compensation expense is based on the\n measurement \ndate fair value of the awards, net of expected forfeitures.  Expense is generally recognized on a\n straight-line basis over \nthe requisite service period of the stock awards.  The estimate of the forfeiture rate is based on historical experience.\n \nResearch and Development Costs\nResearch and development costs are expensed as incurred.  Development costs for software to be sold subsequent to reaching technical feasibility were not significant and were expensed as incurred.  We offset research and development expense with any unconditional third-party funding earned and retain the rights to any technology developed under such arrangements.\nIncome Taxes\nIncome taxes are accounted for under the liability method, whereby deferred tax assets or liability account balances are calculated at the balance sheet date using current tax laws and rates in effect for the year in which the differences are expected to affect taxable income.  A valuation allowance is recorded to reduce the carrying amounts of deferred tax assets if it is more \n50\nTable of Contents\nIndex to Financial Statements\nlikely than not that such assets will not be realized.  Our valuation allowance is primarily attributable to state research and development credit carryforwards, foreign net operating and capital losses, and our investment in PTx Trimble.  \nRelative to uncertain tax positions, we only recognize a tax benefit if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position.  We consider many factors when evaluating and estimating our tax positions and tax benefits, which may require periodic adjustments and may not accurately forecast actual tax audit outcomes.  Changes in recognition or measurement of our uncertain tax positions would result in the recognition of a tax benefit or an additional charge to the tax provision.  Our practice is to recognize interest and/or penalties related to income tax matters in income tax expense.\nWe are subject to income taxes in the U.S. and numerous other countries and are subject to routine corporate income tax audits in many of these jurisdictions.  We generally believe that positions taken on our tax returns are more likely than not to be sustained upon audit, but tax authorities in some circumstance have, and may in the future, successfully challenge these positions.  Accordingly, our income tax provision includes amounts intended to satisfy assessments that may result from these challenges.  The amounts ultimately paid on resolution of an audit could be materially different from the amounts previously included in our income tax provision and, therefore, could have a material impact on our income tax provision, net income, and cash flows.\nConcentrations of Risk\nCash and cash equivalents are maintained with several financial institutions.  Deposits held with banks may exceed the amount of insurance provided on such deposits.  Generally, these deposits may be redeemed upon demand and are maintained with financial institutions of reputable credit and therefore bear minimal credit risk.\nWe are also exposed to credit risk in our trade receivables, which are derived from sales to end-user customers in diversified industries as well as various resellers.  We perform ongoing credit evaluations of our customers’ financial conditions and limit the amount of credit extended, when deemed necessary, but generally do not require collateral.\nIn addition, we rely on a limited number of suppliers for a number of our critical components.\nGuarantees, Including Indirect Guarantees of Indebtedness of Others\nIn the normal course of business to facilitate sales of our products, we indemnify other parties, including customers, lessors, and parties to other transactions with us with respect to certain matters.  We may agree to hold the other party harmless against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties.  These agreements may limit the time within which an indemnification claim can be made and the amount of the claim.  In connection with divesting some of our businesses or assets, we may also indemnify purchasers for certain matters in the normal course of business, such as breaches of representations, covenants, or excluded liabilities.  In addition, we enter into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents.\nIt is not possible to determine the maximum potential amount under these indemnification agreements due to the limited history of prior indemnification claims and the unique facts and circumstances involved in each particular agreement.  Historically, payments made under these agreements were not material; thus, no liabilities have been recorded for these obligations in the Consolidated Balance Sheets at the end of 2024 and 2023.\nDerivative Financial Instruments\nWe enter into foreign exchange forward contracts to minimize the short-term impact of foreign currency fluctuations on cash and certain trade and intercompany receivables and payables, \nprimarily denominated in \nEuro, Canadian Dollars, New Zealand Dollars, British Pound, and Australian Dollars\n.  T\nhese contracts reduce the exposure to fluctuations in foreign currency exchange rate movements, as the gains and losses associated with foreign currency balances are generally offset with the gains and losses on the forward contracts.  We occasionally enter into foreign currency contracts to minimize the impact of foreign currency fluctuations on the purchase price of pending acquisitions.  We do not enter into foreign currency forward contracts for trading purposes.  \nAt the end of 2024 and 2023, there were \nno\n derivatives outstanding that were accounted for as hedges.\nRecently Issued Accounting Pronouncements Not Yet Adopted\nIn November 2024, the FASB issued Accounting Standards Update (“ASU”) 2024-03, Income Statement - Reporting Comprehensive Income (Topic 220): \nDisaggregation of Income Statement Expenses\n.  The ASU requires additional disclosures by disaggregating the costs and expense line items that are presented on the face of the income statement.  The disaggregation includes: (i) amounts of purchased inventory, employee compensation, depreciation, amortization, and other related costs and expenses; (ii) an explanation of costs and expenses that are not disaggregated on a quantitative basis; and (iii) the definition and \n51\nTable of Contents\nIndex to Financial Statements\ntotal amount of selling expenses.  The ASU is effective for our Annual Report on Form 10-K beginning in 2027 and subsequent interim reports.  Early adoption is permitted.  The ASU should be applied prospectively.  Retrospective application is permitted for all prior periods presented in the financial statements.  We are currently evaluating the impact of adopting this ASU on our financial reporting disclosures.\n \nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740): \nImprovements to Income Tax Disclosures\n.  \nThe ASU updates the annual income tax disclosures by requiring (i) specific categories and greater disaggregation of information in the rate reconciliation, (ii) income taxes paid disaggregated by taxing authority and jurisdiction, and (iii) disclosures of pretax income (or loss) and income tax expense (or benefit).  Additionally, certain existing disclosure requirements are removed.  The ASU is effective for our Annual Report on Form 10-K beginning in 2025 and is applied prospectively.  Early adoption and retrospective application are permitted.  \nWe are currently evaluating the impact of adopting this ASU on our financial reporting disclosures.\nRecently Adopted Accounting Pronouncements\nIn November 2023, the FASB issued ASU 2023-07, Segment Reporting (Topic 280): \nImprovements to Reportable Segment Disclosures\n.  The ASU updates reportable segment disclosure requirements primarily through (i) enhanced disclosures about significant segment expenses and (ii) optional disclosures of more than one measure of segment profit or loss if the CODM uses those measures to assess segment performance and allocate resources.  \nWe adopted the ASU in the fourth quarter of 2024 retrospectively to all our prior periods presented since the beginning of 2022.  See \nNote 7 “Reporting Segment and Geographic Information”\n in Item 8 of this report for additional disclosure, including significant segment expenses.\n \nNOTE 2: EARNINGS PER SHARE\nBasic earnings per share is computed based on the weighted-average number of shares of common stock outstanding during the period.  Diluted earnings per share is computed based on the weighted-average number of shares of common stock outstanding during the period plus additional shares of common stock that would have been outstanding if potentially dilutive securities had been issued.  Potentially dilutive shares of common stock include outstanding stock options, restricted stock units (“RSUs”), contingently issuable shares, and shares to be purchased under our employee stock purchase plan.\nThe following table shows the computation of basic and diluted earnings per share:\n \n2024\n2023\n2022\n(In millions, except per share amounts) \n \n \nNumerator:\nNet income\n$\n1,504.4\n \n$\n311.3\n \n$\n449.7\n \nDenominator:\nWeighted-average shares of common stock outstanding - basic\n245.5\n \n247.9\n \n248.6\n \nEffect of dilutive securities\n1.7\n \n1.2\n \n1.6\n \nWeighted-average shares of common stock outstanding - diluted\n247.2\n \n249.1\n \n250.2\n \nBasic earnings per share\n$\n6.13\n \n$\n1.26\n \n$\n1.81\n \nDiluted earnings per share\n$\n6.09\n \n$\n1.25\n \n$\n1.80\n \nAntidilutive weighted-average shares\n (1)\n1.4\n \n1.9\n \n1.3\n \n(1)    Antidilutive stock-based awards are excluded from the calculation of diluted shares and diluted earnings per share because their impact would increase diluted earnings per share.\nNOTE 3: ACQUISITIONS\nIn 2024, we acquired \none\n business, with total purchase consideration of $\n26.3\n million.  In the aggregate, the businesses acquired contributed less than \n1\n% of our total revenue during 2024.  \nIn 2023, we acquired Transporeon GmbH in an all-cash transaction.  Transporeon is a Germany-based company and leading cloud-based transportation management software platform that connects key stakeholders across the industry lifecycle to positively impact the optimization of global supply chains, which aligns with our Connect & Scale strategy.  Transporeon is reported as part of our T&L segment.\nThe total purchase consideration was €\n1.9\n billion or $\n2.1\n billion, which included the repayment of outstanding Transporeon \n52\nTable of Contents\nIndex to Financial Statements\ndebt of $\n339.6\n million.  In allocating the purchase price, we recorded $\n1,390.1\n million of goodwill, $\n939.8\n million of identifiable intangible assets, $\n9.3\n million of net tangible assets, and $\n256.6\n million of deferred tax liability.\nIn addition to Transporeon, we acquired \ntwo\n businesses in 2023 with total purchase consideration of $\n47.0\n million.  In the aggregate, the \ntwo\n businesses acquired contributed less than \n1\n% of our total revenue during 2023.\nIn \n2022\n, we acquired \ntwo\n businesses, with total purchase consideration of $\n379.5\n million.  The largest acquisition was Bid2Win Software, LLC, a leading provider of estimating and operations solutions for the heavy civil construction industry.  In the aggregate, the businesses acquired contributed less than \n1\n% of our total revenue during 2023.  \nAcquisition costs of\n \n$\n9.1\n million, $\n35.0\n million\n, and \n$\n20.4\n million in 2024, 2023, and \n2022\n, were expensed as incurred and are included in Cost of sales and General and administrative expenses in our Consolidated Statements of Income.\nPro Forma Financial Information\nThe unaudited pro forma financial information presented in the following table was determined by combining the historical financial information of Trimble and Transporeon along with the effects from business combination accounting and the associated debt resulting from this acquisition as if the companies were combined beginning in the first quarter of 2022.  This information is presented for informational purposes only, and it is not necessarily indicative of the operating results that would have occurred if the acquisition had been consummated as of that date.  This information should not be used as a predictive measure of our future financial position, results of operations, or liquidity.\n \nYear of\n \n2023\n2022\n(In millions)\n \nTotal revenue\n$\n3,839.2\n \n$\n3,831.2\n \nNet income\n273.0\n \n308.6\n \nNOTE 4: DIVESTITURES\nMobility \nDivestiture\nOn September 14, 2024, we entered into a definitive agreement with Platform Science to sell our Mobility business.  Subsequent to the end of the year 2024, the transaction closed on \nFebruary 8, 2025 resulting in our\n ownership\n, or rights to acquire ownership of \n32.5\n% of Platform Science’s expanded business, with an approximate fair value of $\n248.7\n million.  The approximate fair value was determined based on unobservable inputs, including discounted cash flow projections, market comparables, and an option pricing model.  We received (i) shares of preferred stock of Platform Science, with certain liquidation preferences, that represent \n28.5\n% of Platform Science’s expanded business and (ii) warrants allowing us the rights to acquire \n4\n% of Platform Science’s expanded business.  The combined businesses aim to enhance driver experience, fleet safety, efficiency, and compliance by combining two cutting-edge in-cab commercial vehicle ecosystems, which will give customers access to more applications and offerings.  \nThe assets and liabilities of Mobility were classified as held for sale beginning in the third quarter of 2024.  A valuation allowance was established to reduce the carrying value of the disposal group assets to the approximate fair value of the consideration we would receive.  As a result, we recorded a pre-tax loss of approximately $\n32.9\n million included within Divestitures gain, net in our Consolidated Statements of Income in 2024.\nUpon the closing of the transaction in the first quarter of 2025, we derecognized the assets and liabilities that were transferred and recorded our equity investment at its cost under the measurement alternative election.  Mobility was reported as a part of our T&L segment. \n53\nTable of Contents\nIndex to Financial Statements\nThe following table presents the major classes of assets and liabilities classified as held for sale at the end of 2024, including the valuation allowance.\nAt the End of Year\n2024\n(In millions)\nCash and cash equivalents\n$\n9.0\n \nAccounts receivable, net\n87.6\n \nInventories, net\n22.8\n \nOther current assets\n8.7\n \nGoodwill\n141.7\n \nOther non-current assets\n65.1\n \nValuation allowance\n(\n22.9\n)\nTotal Assets held for sale\n$\n312.0\n \nAccounts payable\n$\n8.0\n \nDeferred revenue, current\n22.8\n \nOther current liabilities\n20.3\n \nDeferred revenue, non-current\n5.2\n \nOther non-current liabilities\n6.3\n \nTotal Liabilities held for sale\n$\n62.6\n \nAg Divestiture\nOn September 28, 2023, we executed a Sale and Contribution Agreement with AGCO that provided for the formation of a joint venture, called PTx Trimble, that operates in the mixed fleet precision agriculture market.  The agreement was amended and restated on March 31, 2024, and the transaction closed on April 1, 2024.  Under the terms of the agreement, we contributed our Ag business, excluding certain GNSS and guidance technologies, to PTx Trimble, an LLC.  Following the closing of the transaction, we own \n15\n% and AGCO owns \n85\n% of PTx Trimble.  The agreement provides AGCO with a call option and Trimble with a put option with respect to our retained interest in PTx Trimble.  Ag was reported as a part of our Field Systems segment.\nUpon closing of the transaction in the second quarter of 2024, we received $\n1.9\n billion of cash proceeds from AGCO, subject to working capital adjustments.  As a result, we deconsolidated $\n457.3\n million of net assets, including $\n357.4\n million of goodwill, and recognized a pre-tax gain of $\n1.7\n billion.  The gain included $\n275.6\n million for our retained \n15\n% ownership interest in PTx Trimble, which is reported as an equity method investment and represents a non-cash investing activity.  The fair value of our equity method investment was determined by using a combination of the equity value, primarily based on the transaction price, and an option pricing model for a put and call option.  At the end of 2024, the fair value of our equity method investment was $\n222.3\n million, which included a $\n52.7\n million charge for our proportionate share of PTx Trimble’s goodwill impairment in the fourth quarter.\nIn addition to forming PTx Trimble, the parties concurrently entered into agreements that included the following: \n•\na \nseven-year\n renewable supply agreement (the “Supply Agreement”) through which we will provide key GNSS and guidance technologies to PTx Trimble for use in professional agriculture machines sold by AGCO, on an exclusive basis with limited exceptions;\n•\na technology transfer and license agreement to govern the licensing of certain non-divested intellectual property and technology for use by PTx Trimble in the agriculture field and, upon expiration of the Supply Agreement, to govern fixed and variable royalty payments made to us by PTx Trimble;\n•\na trademark license agreement to govern the licensing of certain Trimble trademarks for use by PTx Trimble in the agriculture field;\n•\na master sale and distribution agreement through which PTx Trimble will serve as our channel partner for positioning services in the agriculture market; and\n•\na transition services agreement to provide contract manufacturing services for the divested products for \ntwo years\n following the closing of the transaction.\n54\nTable of Contents\nIndex to Financial Statements\nOther Divestitures\nIn addition to the Mobility divestiture and Ag divestiture, we divested \ntwo\n businesses in 2024 with total proceeds of $\n13.3\n million.\nIn 2023, we divested \nfive\n businesses with total proceeds of $\n18.7\n million.\nIn 2022, we divested \nsix\n businesses with total proceeds of $\n226.3\n million.  The largest divestiture was the sale of Time and Frequency, LOADRITE, Spectra Precision Tools, and SECO accessories businesses to Precisional LLC, an affiliate of The Jordan Company, for $\n205.1\n million in cash, which included a working capital adjustment.\n \nNOTE 5: INTANGIBLE ASSETS AND GOODWILL\nIntangible Assets\nThe following table presents a summary of our intangible assets:\nAt the End of 2024\nAt the End of 2023\n(In millions)\nWeighted-Average Useful Lives (in years)\nGross Carrying\nAmount\nAccumulated\nAmortization\nNet  Carrying\nAmount\nGross Carrying\nAmount\nAccumulated\nAmortization\nNet  Carrying\nAmount\nDeveloped product technology\n7\n$\n819.0\n \n$\n(\n561.2\n)\n$\n257.8\n \n$\n908.5\n \n$\n(\n554.1\n)\n$\n354.4\n \nCustomer relationships\n11\n1,175.5\n \n(\n440.2\n)\n735.3\n \n1,358.4\n \n(\n474.5\n)\n883.9\n \nTrade names and other intellectual properties\n5\n39.0\n \n(\n34.0\n)\n5.0\n \n48.0\n \n(\n42.8\n)\n5.2\n \n$\n2,033.5\n \n$\n(\n1,035.4\n)\n$\n998.1\n \n$\n2,314.9\n \n$\n(\n1,071.4\n)\n$\n1,243.5\n \nAs of the end of 2024 and 2023, $\n182.8\n million and $\n267.8\n million\n of fully amortized intangible assets were written off.\nThe estimated future amortization expense of intangible assets at the end of 2024 was as follows:\n(In millions)\n2025\n$\n163.1\n \n2026\n158.1\n \n2027\n144.8\n \n2028\n130.8\n \n2029\n109.5\n \nThereafter\n291.8\n \nTotal\n$\n998.1\n \nGoodwill\nThe changes in the carrying amount of goodwill by segment for 2024 were as follows:\n \nAECO\nField Systems\nT&L\nTotal\n(In millions)\n \n \n \n \nBalance as of year end 2023\n$\n1,996.9\n \n$\n1,063.5\n \n$\n2,290.2\n \n$\n5,350.6\n \nAdditions due to acquisitions\n16.2\n \n—\n \n—\n \n16.2\n \nAssets held for sale\n—\n \n—\n \n(\n141.7\n)\n(\n141.7\n)\nDecreases due to divestitures\n(\n0.8\n)\n(\n91.5\n)\n—\n \n(\n92.3\n)\nForeign currency translation and other adjustments\n(\n26.2\n)\n(\n13.8\n)\n(\n104.4\n)\n(\n144.4\n)\nBalance as of year end 2024\n$\n1,986.1\n \n$\n958.2\n \n$\n2,044.1\n \n$\n4,988.4\n \n55\nTable of Contents\nIndex to Financial Statements\nNOTE 6: CERTAIN BALANCE SHEET COMPONENTS\nThe components of inventories, net were as follows:\nAt the End of Year\n2024\n2023\n(In millions)\n \n \nInventories:\nRaw materials\n$\n71.7\n \n$\n88.4\n \nWork-in-process\n5.2\n \n3.0\n \nFinished goods\n117.4\n \n144.3\n \nTotal inventories\n$\n194.3\n \n$\n235.7\n \nFinished goods includes\n $\n6.8\n million and $\n11.3\n million at the end of 2024 and 2023 for costs of sales that have been deferred in connection with deferred revenue arrangements.\nThe components of property and equipment, net were as follows:\nAt the End of 2024\nAt the End of 2023\n(In millions)\nGross Carrying\nAmount\nAccumulated\nDepreciation\nNet  Carrying\nAmount\nGross Carrying\nAmount\nAccumulated\nDepreciation\nNet  Carrying\nAmount\nProperty and equipment:\nLand, building, furniture, and leasehold improvements\n$\n238.9\n \n$\n(\n98.8\n)\n$\n140.1\n \n$\n237.4\n \n$\n(\n94.5\n)\n$\n142.9\n \nMachinery and equipment\n147.0\n \n(\n121.8\n)\n25.2\n \n170.0\n \n(\n138.3\n)\n31.7\n \nSoftware\n128.4\n \n(\n118.6\n)\n9.8\n \n131.6\n \n(\n117.7\n)\n13.9\n \nConstruction in progress \n13.3\n \n—\n \n13.3\n \n14.0\n \n—\n \n14.0\n \nTotal property and equipment\n$\n527.6\n \n$\n(\n339.2\n)\n$\n188.4\n \n$\n553.0\n \n$\n(\n350.5\n)\n$\n202.5\n \nDepreciation expense was $\n33.0\n million, $\n38.3\n million, and $\n40.2\n million for 2024, 2023, and 2022.\nThe components of accumulated other comprehensive loss, net of related tax were as follows:\nAt the End of Year\n2024\n2023\n(In millions)\nAccumulated foreign currency translation adjustments\n$\n(\n385.2\n)\n$\n(\n158.0\n)\nGain on cash flow hedge\n4.1\n \n4.7\n \nNet unrealized actuarial (losses) gains\n(\n0.8\n)\n1.2\n \nTotal accumulated other comprehensive loss\n$\n(\n381.9\n)\n$\n(\n152.1\n)\nNOTE 7: REPORTING SEGMENT AND GEOGRAPHIC INFORMATION\nWe determined our operating segments based on how our CODM (our Chief Executive Officer) views and evaluates operations.  Various factors, including market separation and customer-specific applications, go-to-market channels, and products and services, were considered in determining these operating segments.  Our CODM uses segment revenue and operating income to assess segment performance and to allocate resources.  The CODM evaluates segment revenue and operating income by considering periodic forecast-to-actual variances and trends, as well as overall strategic initiatives.  Asset information by segments is not regularly reviewed by the CODM.\nIn each of our segments, we sell many individual products.  For this reason, it is impracticable to segregate and identify revenue for each of the individual products or group of products we sell.  \nOur reportable segments are described below:\n•\nArchitects, Engineers, Construction and Owners (“AECO”)\n.  This segment primarily provides software solutions that sell primarily through a direct channel to customers in the construction industry.\n•\nField Systems\n.  This segment primarily provides hardware and associated software solutions that sell primarily through dealer partner channels.\n•\nTransportation and Logistics (“T&L”)\n.\n  This segment primarily provides solutions for customers working in long haul trucking and freight shipper markets.\n56\nTable of Contents\nIndex to Financial Statements\nThe following reporting segment tables reflect the revenue, costs and expenses, and operating income of our reportable operating segments under our management reporting system.  Segment costs and expenses include directly attributable costs and certain indirect costs allocated to segments, such as facilities, information technology, cloud services, finance, legal, and human resources.  This is consistent with the way the CODM evaluates each of the segment's performance and allocates resources.\n \nReporting Segments\n \nAECO\nField Systems\nT&L\n(In millions)\n \n \n \n2024\nSegment revenue\n$\n1,358.6\n \n$\n1,535.9\n \n$\n788.8\n \nCost of sales\n220.4\n \n666.3\n \n280.2\n \nOperating expense\n674.6\n \n427.6\n \n353.5\n \nOperating income \n$\n463.6\n \n$\n442.0\n \n$\n155.1\n \nOperating income %\n34.1\n \n%\n28.8\n \n%\n19.7\n \n%\n2023\nSegment revenue\n$\n1,110.5\n \n$\n1,967.9\n \n$\n720.3\n \nCost of sales\n213.3\n \n843.4\n \n278.8\n \nOperating expense\n568.2\n \n521.0\n \n323.3\n \nOperating income \n$\n329.0\n \n$\n603.5\n \n$\n118.2\n \nOperating income %\n29.6\n \n%\n30.7\n \n%\n16.4\n \n%\n2022\nSegment revenue\n$\n941.7\n \n$\n2,151.3\n \n$\n583.3\n \nCost of sales\n201.2\n \n997.4\n \n268.2\n \nOperating expense\n481.4\n \n498.0\n \n265.3\n \nOperating income \n$\n259.1\n \n$\n655.9\n \n$\n49.8\n \nOperating income %\n27.5\n \n%\n30.5\n \n%\n8.5\n \n%\nA reconciliation of our total segment operating income to consolidated income before income taxes was as follows:\n \n \n2024\n2023\n2022\n(In millions)\n \n \nTotal segment operating income\n$\n1,060.7\n \n$\n1,050.7\n \n$\n964.8\n \nUnallocated general corporate expenses\n(\n123.5\n)\n(\n116.0\n)\n(\n123.3\n)\nAmortization of purchased intangible assets\n(\n199.0\n)\n(\n212.3\n)\n(\n131.6\n)\nAcquisition / divestiture items\n(\n81.6\n)\n(\n72.4\n)\n(\n32.8\n)\nStock-based compensation / deferred compensation\n(\n163.5\n)\n(\n151.1\n)\n(\n112.0\n)\nRestructuring and other costs\n(\n32.4\n)\n(\n50.1\n)\n(\n54.2\n)\nConsolidated operating income\n460.7\n \n448.8\n \n510.9\n \nTotal non-operating income (expense), net\n1,545.2\n \n(\n91.8\n)\n58.2\n \nConsolidated income before taxes\n$\n2,005.9\n \n$\n357.0\n \n$\n569.1\n \n57\nTable of Contents\nIndex to Financial Statements\nThe disaggregation of revenue by geography is summarized in the tables below.  Revenue is defined as revenue from external customers attributed to countries based on the location of the customer and is consistent with the Reporting Segment tables above.\n \nReporting Segments\n \nAECO\nField Systems\nT&L\nTotal\n(In millions)\n \n \n \n \n2024\nNorth America\n$\n819.8\n \n$\n785.9\n \n$\n473.0\n \n$\n2,078.7\n \nEurope\n375.9\n \n416.0\n \n258.4\n \n1,050.3\n \nAsia Pacific\n125.5\n \n224.8\n \n14.9\n \n365.2\n \nRest of World\n37.4\n \n109.2\n \n42.5\n \n189.1\n \nTotal segment revenue\n$\n1,358.6\n \n$\n1,535.9\n \n$\n788.8\n \n$\n3,683.3\n \n2023\nNorth America\n$\n655.5\n \n$\n892.9\n \n$\n470.1\n \n$\n2,018.5\n \nEurope\n293.7\n \n581.2\n \n201.3\n \n1,076.2\n \nAsia Pacific\n98.1\n \n320.6\n \n10.2\n \n428.9\n \nRest of World\n63.2\n \n173.2\n \n38.7\n \n275.1\n \nTotal segment revenue\n$\n1,110.5\n \n$\n1,967.9\n \n$\n720.3\n \n$\n3,798.7\n \n2022\nNorth America\n$\n554.7\n \n$\n941.6\n \n$\n458.9\n \n$\n1,955.2\n \nEurope\n267.2\n \n684.2\n \n86.5\n \n1,037.9\n \nAsia Pacific\n83.9\n \n321.3\n \n9.9\n \n415.1\n \nRest of World\n35.9\n \n204.2\n \n28.0\n \n268.1\n \nTotal segment revenue\n$\n941.7\n \n$\n2,151.3\n \n$\n583.3\n \n$\n3,676.3\n \nTotal revenue in the United States as included in the Consolidated Statements of Income wa\ns $\n1,911.2\n million, $\n1,855.2\n million, and $\n1,777.4\n million \nin 2024, 2023, and 2022. \n No single customer or country othe\nr than the\n United States accounted for 10% or more of our total revenue \nin 2024, 2023\n, and 2022.  No single customer accounted for 10% or more of our accounts receivable at the end of 2024 and 2023.  \nThe following table presents our physical long-lived assets by geographic area, which consist of property and equipment, net and operating lease right-of-use assets:\nAt the End of Year\n2024\n2023\n(In millions)\n \n \nUnited States\n$\n178.0\n \n$\n179.3\n \nEurope\n96.0\n \n105.6\n \nAsia Pacific and Rest of World\n37.9\n \n41.6\n \nTotal long-lived assets\n$\n311.9\n \n$\n326.5\n \n58\nTable of Contents\nIndex to Financial Statements\nNOTE 8: DEBT\nDebt consisted of the following:\nAt the End of Year\nEffective interest rate\n(In millions, except percentages)\nDate of Issuance\nEnd of 2024\n2024\n2023\nSenior Notes: \n   Senior Notes, \n4.75\n%, due December 2024\nNovember 2014\n$\n—\n \n$\n400.0\n \n   Senior Notes, \n4.90\n%, due June 2028\nJune 2018\n5.04\n%\n600.0\n \n600.0\n \n   Senior Notes, \n6.10\n%, due March 2033\nMarch 2023\n6.13\n%\n800.0\n \n800.0\n \nCredit Facilities:\n2022 Revolving Credit Facility, due March 2027\nSeptember 2022\n—\n \n150.0\n \nTerm Loan, due April 2026\nApril 2023\n—\n \n500.0\n \nTerm Loan, due April 2028\nApril 2023\n—\n \n500.0\n \nUncommitted Credit Facilities, floating rate\n—\n \n130.4\n \nUnamortized discount and issuance costs\n(\n9.4\n)\n(\n13.8\n)\nTotal debt\n$\n1,390.6\n \n$\n3,066.6\n \nLess: Short-term debt\n—\n \n530.4\n \nLong-term debt\n$\n1,390.6\n \n$\n2,536.2\n \nDebt Maturities\n \nAt the end of 2024, our debt maturities based on outstanding principal were as follows (in millions):\nYear Payable\n2025\n$\n—\n \n2026\n—\n \n2027\n—\n \n2028\n600.0\n \n2029\n—\n \nThereafter\n800.0\n \nTotal\n$\n1,400.0\n \nSenior Notes\nAll of our senior notes are unsecured obligations.  Interest on the senior notes is payable semi-annually in June and December of each year for the 2028 senior notes and in March and September for the 2033 senior notes.  For both the 2028 and 2033 senior notes, the interest rate is subject to adjustment from time to time if Moody’s or S&P (or, if applicable, a substitute rating agency) downgrades (or subsequently upgrades) its rating assigned to the notes.\nSenior Notes are unsecured and rank equally in right of payment with all of our other senior unsecured indebtedness.  We may redeem the notes of each series of senior notes at our option in whole or in part at any time at optional redemption prices.  Such indenture also contains covenants limiting our ability to create certain liens, enter into sale and lease-back transactions, and consolidate or merge with or into, or convey, transfer, or lease all or substantially all of our properties and assets, each subject to certain exceptions.\nCredit Facilities\n2022 Credit Facility\nIn 2022, we entered into a \nfive-year\n, unsecured, revolving credit facility in the aggregate principal amount of $\n1.25\n billion.  Subject to approval, we may increase the commitments for revolving loans by an aggregate principal amount of up to $\n500.0\n million.  The variable interest rate and commitment fees are based on our current long-term, senior unsecured debt ratings, our leverage ratio, and certain specified sustainability targets.\nThe 2022 credit facility contains customary covenants, including, among other requirements, limitations that restrict our and our subsidiaries’ ability to create liens and enter into sale and leaseback transactions, and restrictions on the ability of the subsidiaries to incur indebtedness.  The facility contains financial covenants that require the maintenance of maximum leverage \n59\nTable of Contents\nIndex to Financial Statements\nand minimum interest coverage ratios, as well as the timely delivery of quarterly financial reports and compliance certificates.  At the end of 2024, we were in compliance with our debt covenants under a waiver of the financial reporting covenants.\nUncommitted Facilities\n \nAt the end of 2024, we had \ntwo\n $\n75.0\n million and \none\n €\n100.0\n million revolving credit facilities, which are uncommitted.  Generally, these variable-rate uncommitted facilities may be redeemed upon demand.  Borrowings under uncommitted facilities are classified as short-term debt in the Consolidated Balance Sheet.\nNOTE 9: LEASES\nWe have operating leases primarily for certain of our major facilities, including corporate offices, research and development facilities, and manufacturing facilities.  Lease terms range from \n1\n to \n13\n years, and certain leases include options to extend the lease for up to \n10\n years.  We consider options to extend the lease in determining the lease term.\nOperating lease expense consisted of:\n2024\n2023\n2022\n(In millions)\n \nOperating lease expense\n$\n31.4\n \n$\n33.5\n \n$\n36.3\n \nShort-term lease expense and other\n15.0\n \n17.1\n \n14.8\n \nTotal lease expense\n$\n46.4\n \n$\n50.6\n \n$\n51.1\n \nSupplemental cash flow information related to leases was as follows:\n2024\n2023\n2022\n(In millions)\nCash paid for liabilities included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n (1)\n$\n30.3\n \n$\n31.0\n \n$\n35.0\n \nRight-of-use assets obtained in exchange for Operating lease liabilities:\n$\n44.1\n \n$\n47.0\n \n$\n26.3\n \n(1)\nExcludes cash payments for short-term leases, which are not capitalized. \nSupplemental balance sheet information related to leases was as follows:\nAt the End of Year\n2024\n2023\n(In millions)\nOperating lease right-of-use assets\n$\n123.5\n \n$\n124.0\n \nOther current liabilities\n$\n21.2\n \n$\n29.1\n \nOperating lease liabilities\n123.4\n \n121.9\n \n  Total operating lease liabilities\n$\n144.6\n \n$\n151.0\n \nWeighted-average discount rate     \n4.58\n \n%\n4.27\n \n%\nWeighted-average remaining lease term\n7\n years\n7\n years\n60\nTable of Contents\nIndex to Financial Statements\nAt the end of 2024, the maturities of lease liabilities were as follows:\n(In millions)\n2025\n$\n27.2\n \n2026\n28.8\n \n2027\n23.9\n \n2028\n20.6\n \n2029\n18.3\n \nThereafter\n51.1\n \nTotal lease payments\n$\n169.9\n \nLess: imputed interest\n25.3\n \nTotal \n$\n144.6\n \nNOTE 10: COMMITMENTS AND CONTINGENCIES\nCommitments\nAt the end of 2024, we had unconditional purchase obligations of approximately \n$\n470.7\n million as compared to $\n618.9\n million at the end of 2023.  These unconditional purchase obligations primarily represent (i) various non-cancellable agreements with certain service providers with minimum or fixed commitments, and (ii) open non-cancellable purchase orders for material purchases with our inventory vendors.\nLitigation\nFrom time to time, we are involved in litigation arising in the ordinary course of our business.  There are no material legal proceedings, other than ordinary routine litigation incidental to the business, that we or any of our subsidiaries is a party, or that any of our or our subsidiaries’ property is subject.\nNOTE 11: FAIR VALUE MEASUREMENTS\nFair value is measured by using observable or, to the extent necessary, unobservable inputs.  \nFinancial instruments recorded at fair value include our deferred compensation plan.  The fair value was $\n31.0\n million and $\n31.2\n million at the end of 2024 and 2023, and is included in Other non-current assets and Other non-current liabilities on our Consolidated Balance Sheets.  The fair value was measured by using quoted prices in active markets.\nFinancial instruments not recorded at fair value on a recurring basis (debt) had an estimated fair value of $\n1.4\n billion and $\n3.1\n billion at the end of 2024 and 2023.  The fair value of the debt was determined based on observable market prices in less active markets.  The fair values do not indicate the amount we would currently have to pay to extinguish the debt.\nNOTE 12: DEFERRED REVENUE AND REMAINING PERFORMANCE OBLIGATIONS\nDeferred Revenue \nChanges in our deferred revenue during 2024 and 2023 were as follows:\n \n(In millions) \n2024\n2023\nBeginning balance of the period\n$\n761.4\n \n$\n737.6\n \nRevenue recognized from prior year-end\n(\n652.3\n)\n(\n607.8\n)\nBillings net of revenue recognized from current year and other\n786.9\n \n631.6\n \nEnding balance of the period\n$\n896.0\n \n$\n761.4\n \nRemaining Performance Obligations\nAt the end of 2024, approximately $\n1.7\n billion of revenue is expected to be recognized from remaining performance obligations for which goods or services have not been delivered, primarily subscription, software, and software maintenance, and to a lesser extent, hardware and professional services contracts.  We expect to recognize $\n1.2\n billion or \n71\n% of our remaining performance obligations as revenue during the next \n12\n months and the remainder thereafter.\nThe remaining performance obligations exclude $\n0.2\n billion for the Mobility divestiture, which closed on February 8, 2025.\n61\nTable of Contents\nIndex to Financial Statements\nNOTE 13: INCOME TAXES\nIncome before taxes and the provision (benefit) for taxes consisted of the following:\n2024\n2023\n2022\n(In millions)\nIncome before taxes:\nUnited States\n$\n216.4\n \n$\n26.9\n \n$\n117.7\n \nForeign\n1,789.5\n \n330.1\n \n451.4\n \nTotal\n$\n2,005.9\n \n$\n357.0\n \n$\n569.1\n \nProvision (benefit) for taxes:\nU.S. Federal:\nCurrent\n$\n94.1\n \n$\n57.1\n \n$\n98.4\n \nDeferred\n(\n71.2\n)\n(\n92.5\n)\n(\n97.7\n)\n22.9\n \n(\n35.4\n)\n0.7\n \nU.S. State:\nCurrent\n15.6\n \n12.8\n \n12.6\n \nDeferred\n2.1\n \n(\n6.6\n)\n(\n5.0\n)\n17.7\n \n6.2\n \n7.6\n \nForeign:\nCurrent\n364.8\n \n80.4\n \n48.4\n \nDeferred\n96.1\n \n(\n5.5\n)\n62.7\n \n460.9\n \n74.9\n \n111.1\n \nIncome tax provision\n$\n501.5\n \n$\n45.7\n \n$\n119.4\n \nEffective tax rate\n25.0\n \n%\n12.8\n \n%\n21.0\n \n%\nThe difference between the tax provision at the statutory federal income tax rate and the tax provision as a percentage of income before taxes (“effective tax rate”) was as follows:\n2024\n2023\n2022\nStatutory federal income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nIncrease (reduction) in tax rate resulting from:\nForeign income taxed at different rates\n3.4\n \n%\n0.8\n \n%\n4.4\n \n%\nU.S. State income taxes\n0.8\n \n%\n1.0\n \n%\n1.0\n \n%\nStock-based compensation\n0.9\n \n%\n4.8\n \n%\n1.2\n \n%\nOther U.S. taxes on foreign operations\n(\n2.8\n)\n%\n(\n4.4\n)\n%\n(\n3.1\n)\n%\nForeign-derived intangible income\n—\n \n%\n(\n3.9\n)\n%\n(\n0.4\n)\n%\nU.S. Federal research and development credits\n(\n0.8\n)\n%\n(\n5.4\n)\n%\n(\n2.2\n)\n%\nTax reserve releases\n(\n1.0\n)\n%\n(\n2.5\n)\n%\n(\n1.8\n)\n%\nTax on Ag divestiture\n2.1\n \n%\n—\n \n%\n—\n \n%\nOther\n1.4\n \n%\n1.4\n \n%\n0.9\n \n%\nEffective tax rate\n25.0\n \n%\n12.8\n \n%\n21.0\n \n%\nThe increase in 2024 tax rate was primarily due to gains from the Ag divestiture, which impacted the foreign and domestic items in the table above.\n62\nTable of Contents\nIndex to Financial Statements\nDeferred income taxes reflect the net effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes.  \nThe significant components of deferred tax assets and liabilities were as follows:\nAt the End of Year\n2024\n2023\n(In millions)\n \n \nDeferred tax liabilities:\nPurchased intangibles\n$\n311.3\n \n$\n373.6\n \nGlobal intangible low-taxed income\n17.6\n \n105.8\n \nOperating lease right-of-use assets\n29.7\n \n30.2\n \nOther\n26.9\n \n19.7\n \nTotal deferred tax liabilities\n$\n385.5\n \n$\n529.3\n \nDeferred tax assets:\nDepreciation and amortization\n$\n217.6\n \n$\n368.2\n \nCapitalized research and development\n118.2\n \n98.4\n \nOperating lease liabilities\n34.7\n \n36.2\n \nU.S. tax credit carryforwards\n23.1\n \n23.5\n \nExpenses not currently deductible\n26.3\n \n26.5\n \nNet operating loss carryforwards\n24.3\n \n17.9\n \nStock-based compensation\n17.2\n \n16.7\n \nIntercompany prepayments\n—\n \n36.6\n \nOther\n74.6\n \n60.8\n \nTotal deferred tax assets\n536.0\n \n684.8\n \nValuation allowance\n(\n56.0\n)\n(\n31.0\n)\nTotal deferred tax assets\n480.0\n \n653.8\n \nTotal net deferred tax assets\n$\n94.5\n \n$\n124.5\n \nReported as:\nNon-current deferred income tax assets\n$\n294.4\n \n$\n412.3\n \nNon-current deferred income tax liabilities\n(\n199.9\n)\n(\n287.8\n)\nNet deferred tax assets\n$\n94.5\n \n$\n124.5\n \nAt the end of 2024, we have U.S. federal net operating loss carryforwards, or federal NOLs, of approximately\n \n$\n18.9\n million, which will begin to expire in 2036.  At the end of 2024, we have foreign net operating and capital loss carryforwards, or foreign losses, of approximately $\n106.3\n million, which generally have no expiration.  Utilization of our U.S. federal NOLs is subject to annual limitations in accordance with the applicable tax code.  We have determined that it is more likely than not that a portion of the foreign losses will not be realized and, accordingly, a valuation allowance has been established for such amount.\nWe have California research and development credit carryforwards of approximately $\n35.2\n million, which have an indefinite carryforward period.  We believe that it is more likely than not that a significant portion of the California research and development credit carryforwards will not be realized and, accordingly, a valuation allowance has been established for such amount.\nWe have net deferred tax assets of $\n14.4\n million relating to our investment in PTx Trimble.  We believe that it is more likely than not that a significant portion of the net deferred tax assets will not be realized and, accordingly, a valuation allowance has been established for such amount.\nAs a result of the Tax Act, we can repatriate foreign earnings back to the U.S. when needed with minimal U.S. income tax consequences.  We reinvested a large portion of our undistributed foreign earnings in acquisitions and other investments and intend to bring back a portion of foreign cash that was subject to the transition tax and the global intangible low-taxed income tax.  During 2024, we repatriated $\n232.7\n million cash from foreign earnings to the U.S.\n63\nTable of Contents\nIndex to Financial Statements\nThe total amount of unrecognized tax benefits at the end of \n2024\n was \n$\n78.2\n million\n.  A reconciliation of gross unrecognized tax benefits was as follows:\n \n2024\n2023\n2022\n(In millions)\nBeginning balance\n$\n88.3\n \n$\n76.5\n \n$\n64.2\n \nIncrease related to current year tax positions\n11.3\n \n12.4\n \n23.0\n \n(Decrease) increase related to prior years’ tax positions\n(\n1.5\n)\n7.6\n \n(\n0.7\n)\nLapse of statute of limitations\n(\n19.9\n)\n(\n8.2\n)\n(\n10.0\n)\nEnding balance\n$\n78.2\n \n$\n88.3\n \n$\n76.5\n \nTotal unrecognized tax benefits that, if recognized, would affect our effective tax rate were\n \n$\n45.8\n million and $\n59.5\n million at the end of 2024 and 2023.\nWe and our subsidiaries are subject to U.S. federal, state, and foreign income taxes.  We are currently under a U.S. federal income tax audit for our tax year 2021 and have not yet received any assessment.  Our tax years before 2021 are closed for U.S. federal income tax audit purposes.  Our tax years are substantially closed for all state income taxes for audit purposes through 2015.  Non-U.S. income tax matters have been concluded for years through 2008.  We are currently in various stages of multiple year examinations from state and foreign (multiple jurisdictions) taxing authorities.  While we generally believe it is more likely than not that our tax positions will be sustained, it is reasonably possible that future obligations related to these matters could arise.  We believe that our reserves are adequate to cover any potential assessments that may result from the examinations and negotiations. \nAlthough the timing of the resolution and/or closure of audits is not certain, we do not believe that our gross unrecognized tax benefits would materially change in the next twelve months.\nOur practice is to recognize interest and/or penalties related to income tax matters in income tax expense.  Our liability for unrecognized tax benefits including interest and penalties was recorded in Other non-current liabilities on our Consolidated Balance Sheets.  At the end of 2024 and 2023, we accrued $\n8.8\n million and $\n9.9\n million for interest and penalties.\nNOTE 14: EMPLOYEE STOCK BENEFIT PLANS\nAmended and Restated 2002 Stock Plan\nIn September 2024, our stockholders approved an amendment to the 2002 Stock Plan to increase the number of shares of common stock available for issuance by \n10.0\n million shares.  As such, our Amended and Restated 2002 Stock Plan provides for the grant of incentive and non-statutory stock options and Restricted Stock Units (“RSUs”) for up to \n102.6\n million shares.  At the end of \n2024\n, the remaining number of shares available for grant under the Amended and Restated 2002 Stock Plan was \n17.9\n million\n.\nStock-Based Compensation Expense\nThe following table summarizes the components of stock-based compensation expense recognized in our Consolidated Statements of Income for the periods indicated:\n2024\n2023\n2022\n(In millions)\n \n \n \nRestricted stock units\n$\n145.2\n \n$\n132.8\n \n$\n108.7\n \nStock options\n3.4\n \n1.8\n \n1.1\n \nESPP\n10.0\n \n10.8\n \n10.6\n \nTotal stock-based compensation expense\n$\n158.6\n \n$\n145.4\n \n$\n120.4\n \n64\nTable of Contents\nIndex to Financial Statements\nStock-based compensation expense was allocated as follows:\n2024\n2023\n2022\n(In millions)\n \n \n \nCost of sales\n$\n17.0\n \n$\n14.6\n \n$\n12.6\n \nResearch and development\n45.0\n \n40.7\n \n28.0\n \nSales and marketing\n29.3\n \n27.1\n \n24.6\n \nGeneral and administrative\n67.3\n \n63.0\n \n55.2\n \nTotal stock-based compensation expense\n$\n158.6\n \n$\n145.4\n \n$\n120.4\n \nAt the end of 2024, total unamortized stock-based compensation expense was $\n200.2\n million, with a weighted-average recognition period of \n1.7\n years.\nRestricted Stock Units\nWe grant RSUs containing only service conditions and RSUs containing a combination of service, performance, and market conditions (“PSUs”).  RSUs containing only service conditions typically vest ratably over a \nthree-year\n service period.  PSUs are granted to executive officers and other senior employees and vest after a \nthree-year\n service period.  \nThe fair value at the grant date is determined by (a) the closing pr\nice of our common stock for awards containing only service or both service and performance conditions, or (b) the Monte Carlo valuation model for awards containing both service and  market conditions.  \nFor PSUs, the number of shares received at vesting will range from \n0\n% to \n220\n% of the target grant amount based on either  market conditions or performance conditions or, in some cases, both.  Market conditions consider our relative total stockholder return (“TSR”) of our common stock as compared to the TSR of the constituents of the S&P 500 over the vesting period.  Performance conditions consider the achievement of our financial results or metrics over the vesting period.  \n2024 Restricted Stock Units Unvested\nNumber of Units \n(1)\nWeighted Average\nGrant-Date Fair Value per Share\n(In millions, except for per share data)\n \n \nUnvested at the beginning of year\n5.5\n \n$\n58.23\n \nGranted \n(2)\n2.5\n \n65.12\n \nShares vested, net \n(2)\n(\n2.0\n)\n60.13\n \nCancelled and forfeited\n(\n0.6\n)\n61.11\n \nUnvested at the end of year\n5.4\n \n$\n60.37\n \n(1)    Includes \n0.3\n million PSUs granted, \n0.1\n million PSUs vested, \n0.3\n million PSUs cancelled and forfeited, and \n1.1\n million PSUs unvested at the end of the year.  \n(2)    Excludes approximately \n0.1\n million PSUs related to achievement above target levels at the vesting date and approximately \n0.1\n million  PSUs related to shares cancelled due to achievement below target levels.\nThe weighted-average grant date fair value of all RSUs granted during \n2024, 2023, and 2022\n was $\n65.12\n, $\n49.93\n, and $\n73.32\n per share.  The fair value of all RSUs vested during 2024, 2023, and 2022 was $\n126.5\n million, $\n110.1\n million, and $\n108.3\n million.\nEmployee Stock Purchase Plan\nWe have an employee stock purchase plan (“ESPP”) under which our stockholders have approved an aggregate of \n39.0\n million shares of common stock for issuance to eligible employees.  The fair value at the grant date is based on the Black-Scholes valuation model.  The plan permits eligible employees to purchase common stock through payroll deductions at \n85\n% of the lower of the fair market value of the common stock at the beginning or at the end of each offering period, which is \nsix months\n.  Rights to purchase shares are granted during the first and third quarter of each year.  The ESPP terminates on March 15, 2027.  In 2024, 2023, and 2022, \n0.7\n million, \n0.8\n million, and \n0.6\n million shares were issued, representing $\n34.5\n million, $\n35.7\n million, and $\n34.7\n million in cash received for the issuance of stock under the ESPP.  At the end of 2024, the number of shares reserved for future purchases was \n3.9\n million.\n65\nTable of Contents\nIndex to Financial Statements\nNOTE 15: COMMON STOCK REPURCHASE\nOn January 28, 2024, our Board of Directors approved a new stock repurchase program (the “2024 Stock Repurchase Program”) authorizing up to $\n800.0\n million in repurchases of our common stock.  The 2024 Stock Repurchase Program replaced the prior stock repurchase program, which was approved in August 2021 and has been cancelled.  At the end of \n2024\n, there were remaining authorized funds of $\n625.0\n million.  \nDuring \n2024, 2023, and 2022\n, we repurchased approximately \n2.9\n million, \n2.4\n million, and \n6.0\n million shares of common stock in open market purchases at an average price of $\n60.97\n, $\n42.50\n, and $\n65.90\n per share for a total of $\n175.0\n million, $\n100.0\n million\n, and \n$\n394.7\n million.\nStock repurchases are reflected as a decrease to common stock based on par value and additional-paid-in-capital, determined by the average book value per share of outstanding stock, calculated at the time of each individual repurchase transaction.  The excess of the purchase price over this average for each repurchase was charged to retained earnings.  Common stock repurchases under the program were recorded based upon the trade date for accounting purposes. \n As a result of the \n2024\n repurchases under the 2024 Stock Repurchase Program, retained earnings was reduced by $\n149.1\n million in \n2024\n. \nSubsequent to the end of the year 2024, the Board of Directors authorized a common stock repurchase authorization of up to $\n1.0\n billion, which replaces the existing 2024 Stock Repurchase Program in the first quarter of 2025.  \nWe may repurchase stock from time to time through accelerated stock repurchase programs, open market transactions, privately negotiated transactions, block purchases, tender offers, or other means.  The timing and actual number of any stock repurchased will depend on a variety of factors, including market conditions, our stock price, other available uses of capital, applicable legal requirements, and other factors.  This program may be suspended, modified, or discontinued at any time without prior notice.\n66\nTable of Contents\nIndex to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Trimble Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Trimble Inc. (the Company) as of January 3, 2025 and December 29, 2023, the related consolidated statements of income, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended January 3, 2025, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at January 3, 2025 and December 29, 2023, and the results of its operations and its cash flows for each of the three years in the period ended January 3, 2025, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of January 3, 2025, based on criteria established in Internal Control–Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated April 25, 2025 expressed an adverse opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition – Stand-alone Selling Prices of Performance Obligations\nDescription of the Matter\nAs described in Note 1 to the consolidated financial statements, the Company’s contracts with customers require management to make estimates and assumptions used in revenue recognition, including determining standalone selling prices of performance obligations (“SSP”).\nAuditing management’s determination of SSP was challenging and complex due to the disaggregation of the Company’s businesses and product offerings, including disparity in pricing and discounting among the various businesses. Because of the disaggregation and variation in pricing and discounting, the Company must apply judgment and consider all reasonably available information, including but not limited to, pricing practices in customer contracts with multiple goods and services and other observable inputs when estimating SSP. Additionally, auditing management’s estimates of SSP was complex as there were material weaknesses in internal controls over the information and judgments used in the estimation of SSP.\n67\nTable of Contents\nIndex to Financial Statements\nHow We Addressed the Matter in Our Audit\nAfter consideration of the material weaknesses, our audit procedures included, among others, testing a sample of the Company’s estimated standalone selling prices for performance obligations throughout the Company’s disaggregated businesses and product and service offerings. For the sample tested, we evaluated the appropriateness of the Company’s estimates based on the Company’s available pricing and discounting information throughout the disaggregated businesses and product and service offerings and we tested the completeness and accuracy of the data used in management’s SSP methodology, including determination of pricing and discounting practices within the various sales channels. For the sample tested, we also evaluated the Company’s identification and consideration of available information and the use of such information in determining SSP and we tested the accuracy of the Company’s calculations of SSP. In addition, for a sample of transactions, we tested the Company’s allocation of the transaction price among performance obligations based on relative SSP.\nDivestitures – Goodwill allocation and underlying fair value assumptions\nDescription of the Matter\nDuring fiscal year 2024, the Company completed the divestiture of a portion of their Ag business in exchange for $1.9 billion of cash proceeds and a 15% ownership interest in the newly created joint venture, PTx Trimble,  and recognized a pre-tax gain of $1.7 billion. The Company also entered into a definitive agreement to sell their Mobility business in exchange for an equity interest in Platform Science, Inc., and recorded a pre-tax loss of $32.9 million.  These transactions are disclosed in Note 4 to the consolidated financial statements. \nAuditing the Company's accounting for these transactions was complex due to the significant estimation uncertainty in the Company’s determination of the fair value of the corresponding reporting units used to determine the value of goodwill to be allocated to the respective disposal groups, as well as the fair value of the equity interest to be received in exchange for the disposal group for the Mobility divestiture. The significant estimation uncertainty was primarily due to the sensitivity of the respective fair values to the underlying assumptions regarding the future performance of the related businesses. The Company used valuation methods including discounted cash flow models in the determination of fair value. The significant assumptions used in the discounted cash flow model to estimate the fair values included certain assumptions that form the basis of the forecasted results, specifically, revenue, revenue growth rates, and discount rates. These significant assumptions are forward looking and could be affected by future economic and market conditions.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company’s determination of the fair value of the goodwill to be allocated to the disposal group as well as the valuation of the equity interests to be received in exchange for the disposal group for the Mobility divestiture. To test the estimated fair values of the reporting units and corresponding goodwill allocations as well as the fair value of the equity interest to be received in exchange for the disposal group for the Mobility divestiture, we performed audit procedures that included, among others, evaluating the Company's selection of the valuation methodology, evaluating the methods and significant assumptions used by the Company, and evaluating the completeness and accuracy of the underlying data supporting the significant assumptions and estimates. For example, we compared the significant assumptions to current industry, market and economic trends and to the Company's budgets and forecasts, and historical operating results. We involved our valuation specialists to assist with our evaluation of the methodologies used by the Company and significant assumptions included in the fair value estimates. Our procedures also included, among others, developing a range of independent estimates for the discount rates used in the valuation models and comparing those to the discount rates used by management.\n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 1986.\nSan Jose, California\nApril 25, 2025 \n68\nTable of Contents\nIndex to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Trimble Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited Trimble Inc.’s internal control over financial reporting as of January 3, 2025, based on criteria established in Internal Control–Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria).   In our opinion, because of the effect of the material weaknesses described below on the achievement of the objectives of the control criteria, Trimble Inc. (the Company) has not maintained effective internal control over financial reporting as of January 3, 2025, based on the COSO criteria.\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the company’s annual or interim financial statements will not be prevented or detected on a timely basis.  The following material weaknesses have been identified and included in management’s assessment.  Management has identified material weaknesses in certain information technology controls related to certain systems that support the Company’s financial reporting processes.  Management has also identified material weaknesses related to review controls and controls over the completeness and accuracy of information utilized in the performance of controls, which affected the Company’s controls over revenue and related accounts, income taxes, excess and obsolete inventory, and other controls as part of the Company’s reporting and disclosure process.  Additionally, management identified a material weakness in controls over the evaluation of standalone selling prices of performance obligations utilized in the Company’s accounting for revenue. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of January 3, 2025 and December 29, 2023, the related consolidated statements of income, comprehensive income, stockholders’ equity, and cash flows for each of the three years in the period ended January 3, 2025, and the related notes.  These material weaknesses were considered in determining the nature, timing, and extent of audit tests applied in our audit of the 2024 consolidated financial statements, and this report does not affect our report dated April 25, 2025, which expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Annual Report on Internal Control over Financial Reporting.  Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit.  We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB.  Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances.  We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.  A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.  Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ \nErnst & Young LLP\nSan Jose, California\nApril 25, 2025 \n69\nTable of Contents\nItem 9.      Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nItem 9A.  Controls and Procedures\n(a) Evaluation of Disclosure Controls and Procedures\nManagement, including our Chief Executive Officer (“CEO”) and Chief Financial Officer (“CFO”), has evaluated the effectiveness of our disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act), as of the end of the period covered by this report.  Based on such evaluation, our CEO and CFO concluded that our disclosure controls and procedures were not effective as of the end of such period because of the material weaknesses in internal control over financial reporting described below. \nInherent Limitations on Effectiveness of Controls\nManagement does not expect that the internal control over financial reporting will prevent or detect all errors and all fraud.  A control system, no matter how well-designed and operated, can provide only reasonable, not absolute, assurance that the control system’s objectives will be met.  The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\n(b) Management’s Annual Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f).  The internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. GAAP.\nManagement conducted an evaluation of the effectiveness of the internal control over financial reporting based on the Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework).  Based on the assessment by management, it was determined that the Company’s internal control over financial reporting was not effective due to the material weaknesses described below.  \n•\nWe did not design and maintain effective controls over certain information technology general controls (“ITGCs”) for certain business systems related to the Company’s financial reporting processes.  Specifically, the Company did not design sufficient controls to (i) manage user access to systems, (ii) ensure that program changes made to systems were authorized and approved, or (iii) identify and resolve system issues impacting the financial reporting process.  Certain business process controls and IT interfaces that are dependent on the ineffective ITGCs, or that rely on data produced from systems impacted by the ineffective ITGCs, could have been adversely impacted, and were also deemed ineffective.  \n•\nWe did not design and maintain (i) effective review controls, including the retention of evidence to support the design and operating effectiveness of controls and (ii) effective controls over the completeness and accuracy of information produced by the entity utilized in the performance of controls, including the retention of relevant evidence to support the design and operating effectiveness of controls.  These deficiencies primarily affected controls over revenue and related accounts, income taxes and excess and obsolete inventory, and other controls as a part of our reporting and disclosure process.\n•\nWe did not design and maintain effective controls over the evaluation of standalone selling prices of performance obligations utilized in accounting for revenue, including review controls over the establishment and subsequent changes to standard pricing and discounting. \nThe effectiveness of our internal control over financial reporting at the end of 2024 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in their report.\n(c) Remediation of Previously Reported Material Weaknesses\nRemediation Plan for Material Weaknesses\nManagement, with the oversight of the Audit Committee, is currently taking actions to remediate the material weaknesses and is implementing additional processes and controls to address the underlying causes associated with the material weaknesses described above.  These efforts include:\n•\nWe are in the process of finalizing the design and implementation of controls of certain ITGCs for business systems related to the Company’s financial reporting processes.\n•\nWe are in the process of updating our policies and practices related to maintaining evidence of review of business process controls, including the review of information used in the performance of controls.  \n70\nTable of Contents\n•\nWe are in the process of finalizing the design and implementation of controls over the evaluation of standalone selling prices of performance obligations utilized in accounting for revenue, including review controls over pricing and discounting.\nThe material weaknesses will not be considered remediated until the applicable remedial controls operate for a sufficient period of time and management has concluded, through testing, that these controls are operating effectively.  We believe the measures described above will remediate the control deficiencies we have identified and strengthen our internal control over financial reporting.  We are committed to continuing to improve our internal control processes and will continue to review, optimize, and enhance our financial reporting controls and procedures.\nThe process of designing and implementing an effective financial reporting system is a continuous effort that requires us to anticipate and react to changes in our business and the economic and regulatory environments, and to expend significant resources to maintain a financial reporting system that is adequate to satisfy our reporting obligations.  As we continue to evaluate and take actions to improve our internal control over financial reporting, we may determine to take additional actions to address control deficiencies or determine to modify certain of the remediation measures described above.\n(d) Changes in Internal Control over Financial Reporting\nIn addition to the identified material weaknesses noted above, we are implementing a customer relationship management tool across our businesses as a strategic initiative that will replace many legacy systems and that could materially affect our internal control over financial reporting (as such term is defined in Rules 13a - 15(f) and 15d - 15(f) under the Exchange Act).  Other than as described above, there have been no changes that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting during the period for which this report relates. \nItem 9B.  Other Information\nRule 10b5-1 Trading Plan\nDuring the fourth quarter of 2024, none of our directors or executive officers adopted or terminated a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement.  \nWe previously reported in our Quarterly Report on Form 10-Q for the quarter ended March 29, 2024, that \nJennifer Allison\n had \nentered\n into a Rule 10b5-1 trading arrangement on \nFebruary 29, 2024\n for potential sales of \n1,571\n shares between June 3, 2024 and \nJune 2, 2025\n.  The actual number of shares under that trading arrangement was \n3,571\n shares, which have all now been sold, as reported on a Form 4 filed on January 22, 2025.\nItem 9C.  Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n71\nTable of Contents\nPART III\nItem 10.  Directors, Executive Officers and Corporate Governance\nThe information required by this item, insofar as it relates to our directors, will be contained under the captions “Election of Directors” and “Section 16(a) Beneficial Ownership Reporting Compliance” in the Proxy Statement and is incorporated herein by reference.  The information required by this item relating to executive officers is set forth above in Item 1 of this report under the caption “\nInformation about our Executive Officers\n.”\nThe information required by this item insofar as it relates to the nominating and audit committees will be contained in the Proxy Statement under the caption “Board Meetings and Committees; Director Independence.”\nCode of Ethics\nOur Business Ethics and Conduct Policy applies to, among others, our Chief Executive Officer, Chief Financial Officer, Chief Accounting Officer, and other finance organization employees.  We make available our Business Ethics and Conduct Policy free of charge through our website at www.trimble.com under the heading “Corporate Governance - Governance Documents” on the Investor Relations page.\nIf any substantive amendments to the Business Ethics and Conduct Policy are made or any waivers are granted, including any implicit waiver, from a provision of the Business Ethics and Conduct Policy, to its Chief Executive Officer, Chief Financial Officer, or Chief Accounting Officer, we will disclose the nature of such amendment or waiver on our website at www.trimble.com or in a report on Form 8-K.  The contents of these websites are not intended to be incorporated by reference into this report or in any other report or document we file or furnish with the SEC, and any reference to these websites are intended to be inactive textual references only.\nInsider Trading Policy\nWe have adopted an insider trading policy governing transactions in our securities by our directors, employees, contractors, consultants, and other personnel providing services to Trimble, as well as by Trimble itself.  We believe this policy is reasonably designed to promote compliance with insider trading laws, rules and regulations, and the Nasdaq listing standards.  A copy of our insider trading policy is filed as Exhibit 19.1 to this Form 10-K.\nItem 11.  Executive Compensation\nThe information required by this item will be contained in the Proxy Statement under the captions “Executive Compensation” and “Non-Employee Director Compensation” and is incorporated herein by reference.\nItem 12.  Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item will be contained in the Proxy Statement under the caption “Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters” and is incorporated herein by reference.\nItem 13.  Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item will be contained in the Proxy Statement under the caption “Certain Relationships and Related Person Transactions” and is incorporated herein by reference.\nItem 14.  Principal Accounting Fees and Services\nThe information required by this item will be contained in the Proxy Statement under the caption “Principal Accounting Fees and Services” and is incorporated herein by reference.\n72\nTable of Contents\nPART IV\nItem 15.  Exhibits and Financial Statement Schedules\n(1) Financial Statements\nThe following consolidated financial statements required by this item are included in Part II, Item 8 of this report under the caption “Financial Statements and Supplementary Data”.\nPage in this Report\nConsolidated Balance Sheets\n42\nConsolidated Statements of Income\n43\nConsolidated Statements of Comprehensive\n Income\n44\nConsolidated Statements of Stockholders’ Equity\n45\nConsolidated Statements of Cash Flows\n46\nNotes to Consolidated Financial Statements\n47\nReports of Independent Registered Public Accounting Firm\n67\n(2) Financial Statement Schedules\nAll financial statement schedules have been omitted, since the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the consolidated financial statements and accompanying notes included in this report.\n(3) Exhibits\nWe have filed, or incorporated into the report by reference, the exhibits listed on the accompanying Index to Exhibits immediately preceding the signature page of this report.\nItem 16.  Form 10-K Summary\nNone.\n73\nTable of Contents\nINDEX TO\n \nEXHIBITS\nExh. No.\nDescription of Exhibit\nFiled herewith or\nincorporated by reference to:\n2.1\nAmended and Restated Sale and Contribution Agreement, dated March 31, 2024, by and\n \namong the Company, PTx Trimble LLC, and AGCO Corporation\nExh. 10.1 to Form 8-K filed Apr. 1, 2024\n3.1\nCertificate of Incorporation of Trimble Inc.\nExh. 3.1 to Form 8-K filed Oct. 3, 2016\n3.2\nBy-Laws of Trimble Inc., \na\nmended as of May \n30\n, 2024\nExh. 3.1 to Form 8-K filed May 31, 2024\n4.1\nDescription of Securities of Trimble Inc.\nExh. 4.2 to Form 10-K filed Feb. 28, 2020\n4.2(A)\nIndenture, dated as of October 30, 2014, between the Company and U.S. Bank National Association\nExh. 4.2 to Form S-3 filed Oct. 30, 2014\n4.2(B)\nSecond Supplemental Indenture, dated October 1, 2016, between the Company and U.S. Bank National Association\nExh. 4.2 to Form 8-K filed Oct. 3, 2016\n4.2(C)\nThird Supplemental Indenture, dated June 15, 2018, between the Company and U.S. Bank National Association (which includes Form of 4.150% Senior Note due 2023 and Form of 4.900% Senior Note due 2028)\nExh. 4.1 to Form 8-K filed Jun. 15, 2018\n4.2(D)\nFourth Supplemental Indenture, dated March 9, 2023, between the Company and U.S. Bank National Association (which includes Form of 6.100% Senior Note due 2033)\nExh. 4.1 to Form 8-K filed March 9, 2023\n10.1(A)\nCredit Agreement, dated March 24, 2022, by and among Trimble Inc., the borrowing subsidiaries party thereto, the lenders party thereto, and Bank of America, N.A., as administrative agent\nExh. 10.1 to Form 8-K filed Mar. 30. 2022\n10.1(B)\nAmendment No. 1, dated December 27, 2022, to Credit Agreement of March 24, 2022\nExh. 10.2 to Form 8-K filed Dec. 30, 2022\n10.1(C)\nAmendment No. 2, dated April 28, 2023, to Credit Agreement of March 24, 2022\nExh. 10.1 to Form 10-Q filed Aug. 4, 2023\n10.2+\nForm of Indemnification Agreement between the Company and its officers and directors\nExh. 10.1 to Form 8-K filed Nov. 15, 2017\n10.3+\nBoard of Directors Compensation Policy, as amended \nNovember 19, 2024\nFiled herewith\n10.4+\nIncentive Compensation Recoupment Policy, as amended September 24, 2023\nExh. 10.1 to Form 10-Q filed Nov. 3, 2023\n10.5+\nDeferred Compensation Plan, as amended August 26, 2020\nExh. 10.2 to Form 10-Q filed Nov. 6, 2020\n10.6+\nAge and Service Equity Vesting Program\n, as amended \nMay \n1, 2024\nFiled herewith\n10.7(A)+\nEmployee Stock Purchase Plan, as amended March 13, 2017 \nApp. B of Form DEF 14A filed Mar. 23, 2017\n10.7(B)+\nEmployee Stock Purchase Plan - Form of global subscription agreement\nExh. 10.5 to Form 10-Q filed Nov. 10, 2015\n10.8(A)+\n2002 Stock Plan, as amended \nS\neptember 30, 2024\nApp. B of Form DEF 14A filed Apr. 16, 2024\n10.8(B)+\n2002 Stock Plan - Form of stock option agreement (officers, 2023 revision)\nExh. 10.2 to Form 10-Q filed May 3, 2023\n10.8(C)+\n2002 Stock Plan - Form of global restricted stock unit \n(RSU) \naward agreement\nExh. 10.2 to Form 10-Q filed Nov. 10, 2015\n10.8(D)+\n2002 Stock Plan - Performance stock option agreement between the Company and Rob Painter issued January 4, 2020\nExh. 10.9(K) to Form 10-K filed Feb. 28, 2020\n10.8(E)+\n2002 Stock Plan - Form of \nPR\nSU \naward agreement (\nARR\n-TSR\n with modifier\n)\nExh. 10.1 to Form 10-Q filed May 5, 2022\n10.8(F)+\n2002 Stock Plan - Form of PRSU award agreement (ARR with modifier)\nExh. 10.3 to Form 10-Q filed May 3, 2023\n10.8(G)+\n2002 Stock Plan - Form of PRSU award agreement (ARR-TSR with modifier, 2023 revision)\nExh. 10.4 to Form 10-Q filed May 3, 2023\n10.9+\nTrimble OneBonus Plan Description\nExh. 10.1 to Form 8-K filed Feb. 25, 2021\n10.10+\nForm of Change in Control Severance Agreement between the Company and certain Company officers\nFiled herewith\n10.11+\nForm of Executive Severance Agreement between the Company and certain Company officers\nFiled herewith\n10.12+\nChange in Control Severance Agreement between the Company and Robert G. Painter dated January 4, 2020\nExh. 10.15 to Form 10-K filed Feb. 26, 2021\n10.13+\nExecutive Severance Agreement between the Company and Robert G. Painter dated January 4, 2020\nExh. 10.16 to Form 10-K filed Feb. 26, 2021\n74\nTable of Contents\n10.14+\nOffer Letter between the Company and Phillip Sawarynski dated January 29, 2024\nExh. 10.1 to Form 8-K filed Feb. 1, 2024\n19.1\nTrimble Insider Trading Policy\nFiled herewith\n21.1\nSubsidiaries of the Company\nFiled herewith\n23.1\nConsent of Independent Registered Public Accounting Firm\nFiled herewith\n24.1\nPower of Attorney (included on signature page herein)\n31.1\nCertification of CEO pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nFiled herewith\n31.2\nCertification of CFO pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nFiled herewith\n32.1\nCertification of CEO pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nFurnished herewith\n32.2\nCertification of CFO pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nFurnished herewith\n101++\nThe following financial statements from this Annual Report on Form 10-K, formatted in Inline XBRL: (i) Consolidated Balance Sheets, (ii) Consolidated Statements of Income, (iii) Consolidated Statements of Comprehensive Income, (iv) Consolidated Statements of Stockholders' Equity, (v) Consolidated Statements of Cash Flows, and (vi) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags\n104++\nThe cover page from this Annual Report on Form 10-K, formatted in Inline XBRL\n+    Indicates management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report on Form 10–K.\n++    Pursuant to applicable securities laws and regulations, the Company is deemed to have complied with the reporting obligation relating to the submission of interactive data files in such exhibits and is not subject to liability under any anti-fraud provisions of the federal securities laws as long as the Company has made a good faith attempt to comply with the submission requirements and promptly amends the interactive data files after becoming aware that the interactive data files fails to comply with the submission requirements.\n75\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTRIMBLE INC.\nBy:  \n/\nS\n/    ROBERT G. PAINTER\n        \n \nRobert G. Painter,\nPresident and Chief Executive Officer\nApril 25, 2025\n76\nTable of Contents\nPOWER OF ATTORNEY\nKnow all persons by these presents, that each person whose signature appears below constitutes and appoints Robert G. Painter as his attorney-in-fact, with the power of substitution, for him in any and all capacities, to sign any amendments to this Report of this Annual Report on Form 10-K, and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that said attorney-in-fact, or his substitute or substitutes, may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nSignature\n  \nCapacity in which Signed\n \n \n/s/    ROBERT G. PAINTER\nRobert G. Painter\n  \nPresident, Chief Executive Officer, Director\n \nApril 25, 2025\n/s/\n \n   PHILLIP SAWARYNSKI\nPhillip Sawarynski\n  \nChief Financial Officer \n(Principal Financial Officer)\n \nApril 25, 2025\n/s/ \n  \n \nJULIE A. SHEPARD  \n \n    \n \nJulie A. Shepard\n  \nChief Accounting Officer \n(Principal Accounting Officer)\n \nApril 25, 2025\n/s/    JAMES C. DALTON\nJames C. Dalton\nDirector\nApril 25, 2025\n/s/    BORJE EKHOLM\nBörje Ekholm\n  \nDirector\n \nApril 25, 2025\n/s/    KAIGHAM (KEN) GABRIEL\nKaigham (Ken) Gabriel\n  \nDirector\n \nApril 25, 2025\n/s/ \n   MEAGHAN LLOYD \n      \nMeaghan Lloyd\n  \nDirector\n \nApril 25, 2025\n/s/   RON NERSESIAN\nRon Nersesian\nDirector\nApril 25, 2025\n/s/    MARK S. PEEK\nMark S. Peek\n  \nDirector\n \nApril 25, 2025\n/s/    KARA SPRAGUE\nKara Sprague\nDirector\nApril 25, 2025\n/s/    THOMAS W. SWEET\nThomas W. Sweet\nDirector\nApril 25, 2025\n/s/    JOHAN WIBERGH\nJohan Wibergh\n  \nDirector\n \nApril 25, 2025\n77"
  }
}