{
  "ticker": "TROW",
  "cik": "0001113169",
  "company_name": "PRICE T ROWE GROUP INC",
  "filing_date": "2025-02-14",
  "accession": "0001113169-25-000007",
  "primary_doc": "trow-20241231.htm",
  "item_sections": {
    "item1": "ITEM 16.\nForm 10-K Summary\n100\nSIGNATURES\n101\nPage 1\nTable of Contents\n            \n    \nPART I\nItem 1.\nBusiness. \nT. Rowe Price Group, Inc. (\"T. Rowe Price Group\", \"T. Rowe Price\", \"the firm\", \"we\", \"us\", or \"our\") is a financial services holding company that provides global investment advisory services through its subsidiaries to investors worldwide. We are driven by our purpose: to identify and actively invest in opportunities to help people thrive in an evolving world. With more than 85 years of experience, we provide a broad range of investment solutions across equity, fixed income, multi-asset, and alternative capabilities for clients around the world— from individuals to advisors to institutions to retirement plan sponsors. We also provide certain investment advisory clients with related administrative services, including distribution, mutual fund transfer agent, accounting, and shareholder services; participant recordkeeping and transfer agent services for defined contribution retirement plans; brokerage; trust services; and non-discretionary advisory services through model delivery. We take an active, independent approach to investing, offering our dynamic perspective and meaningful partnership, so our clients can feel more confident.\nThe late Thomas Rowe Price, Jr., founded our firm in 1937, and the common stock of T. Rowe Price Associates, Inc. was first offered to the public in 1986. The T. Rowe Price Group, Inc. corporate holding company structure was established in 2000. Our common stock trades on the NASDAQ Global Select Market under the symbol \"TROW\".\nOur core capabilities have enabled us to deliver excellent operating results since our initial public offering. We maintain a strong corporate culture focused on delivering superior long-term investment performance and world-class service to our clients. We distribute our broad array of active investment solutions through a diverse set of distribution channels and vehicles to meet the needs of our clients globally. These vehicles include an array of U.S. mutual funds, collective investment trusts, exchange-traded funds, subadvised funds, separately managed accounts, and other sponsored products. The other sponsored products include: open-ended investment products offered to investors outside the U.S., products offered through variable annuity life insurance plans in the U.S., affiliated private investment funds, business development companies, an interval fund, and collateralized loan obligations. \nThe investment management industry has been evolving and industry participants are facing several challenging trends including passive investments taking market share from traditional active strategies; continued downward fee pressure; demand for new investment vehicles to meet client needs; and an ever-changing regulatory landscape.\nDespite these challenging trends, we believe there are significant opportunities that align to our core capabilities. Our ongoing financial strength and discipline allows us to respond to these opportunities with several strategic, multi-year initiatives that are designed to strengthen our long-term competitive position and to:\n•\nSustain our leadership position in retirement.\n•\nAccess growth of the U.S. wealth management channel through improved vehicle capabilities, technology, specialist sales, and content. \n•\nFocus on further global growth in select high-opportunity countries where we have existing business by investing more in resources, products, and marketing.\n•\nBroaden our reach in the private and alternatives market by leveraging our distribution channels and expanding our investment capabilities.\n•\nEnhance our relationships with clients and renew our individual investor base by investing in our ability to provide exceptional service and unique offerings.\n•\nStrengthen our distribution technology to enhance the digital client experience and client reporting. \n•\nAttract and retain top talent and enable effective hybrid collaboration.\n•\nNurture our brand globally and leverage it effectively across channels and geographies. \n•\nDeliver strong financial results and balance sheet strength for our stockholders over the long term.\nPage 2\nTable of Contents\n            \n    \nASSETS UNDER MANAGEMENT (AUM).\nOur consolidated net revenues and net income are derived largely from investment advisory services provided by our subsidiaries, primarily T. Rowe Price Associates (TRPA), T. Rowe Price Investment Management (TRPIM), Oak Hill Advisors (OHA), and T. Rowe Price International Ltd (TRPIL). Our revenues depend largely on the total value and composition of our assets under management. Accordingly, fluctuations in financial markets and in the composition of assets under management impact our revenues and results of operations. \nAt December 31, 2024, we had $1,606.6 billion in assets under management, an increase of $162.1 billion from the end of 2023. This increase in assets under management was driven by market appreciation, net of distributions not reinvested, of $205.3 billion, offset by net cash outflows of $43.2 billion. \nIn 2024, our target date retirement products experienced net cash inflows of $16.3 billion. The assets under management in our target date retirement products totaled $475.6 billion at December 31, 2024, or 29.6% of our managed assets at December 31, 2024, compared to 28.3% at the end of 2023.\nThe following charts show our AUM (in billions) by asset class, client type, geography, and account type as of December 31 for the prior three years: \nEquity\nInstitutional\n(3)\nFixed Income, including money market\nRetail\n(4)\nMulti-Asset\n(1)\nAlternatives\n(2)\n(1)\nThe underlying AUM of the multi-asset portfolios have been aggregated and presented in this category and not reported in the equity and fixed income rows.\n(2)\nThe alternatives asset class includes strategies authorized to invest more than 50% of its holdings in private credit, leveraged loans, mezzanine, real assets/CRE, structured products, stressed/distressed, non-investment grade CLOs, special situations, business development companies, or that have absolute return as its investment objective. Generally, only those strategies with longer than daily liquidity are included. Unfunded capital commitments of $16.2 billion at December 31, 2024, $11.6 billion at December 31, 2023, and $10.5 billion at December 31, 2022 are not reflected in AUM above.\n(3)\nInstitutional includes assets sourced from institutions along with defined contribution assets that are sourced through intermediaries and our full-service recordkeeping business. \n(4)\nRetail includes assets sourced through our direct-marketed business and financial intermediaries.\nPage 3\nTable of Contents\n            \n    \nUnited States\nU.S. Defined Contribution\nAPAC, EMEA, Canada\nOther Retirement\nOther Accounts\nAdditional information concerning our assets under management, results of operations, and financial condition during the past three years is contained in Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations as well as our consolidated financial statements, which are included in Item 8. of this Form 10-K. \nINVESTMENT MANAGEMENT SERVICES.\nInvestment Capabilities\nWe manage a broad range of investment strategies in equity, fixed income, multi-asset, and alternatives across sectors, styles and regions. Our strategies are designed to meet the varied and changing needs and objectives of investors and are delivered across a range of vehicles. We also offer specialized advisory services, including management of stable value investment contracts, customized multi-asset solutions, and a distribution management service for the disposition of equity securities our clients receive from third-party venture capital investment pools.\nPage 4\nTable of Contents\n            \n    \nThe following tables set forth our broad investment capabilities as of December 31, 2024.\nEquity\nGrowth\nCore\nValue\nConcentrated\nIntegrated (Quantitative & Fundamental)\nImpact\nU.S.:\nAll-Cap, Large-Cap, Mid-Cap, Small-Cap, Sectors\nLarge-Cap, Mid-Cap, Small-Cap\nLarge-Cap, Mid-Cap, Small-Cap\nLarge-Cap (Value)\nLarge-Cap (Growth & Value, Lower Volatility), Multi-Cap, Small-Cap\nLarge-Cap\nGlobal / International:\nAll-Cap, Large-Cap, Small-Cap, Sectors, Regional\nLarge-Cap\nLarge-Cap, Regional\nLarge-Cap, Regional\nLarge-Cap (Core)\nLarge-Cap\nFixed Income\nCash\nLow Duration\nHigh Yield / Bank Loans\nGovernment\nSecuritized\nInvestment Grade Credit\nU.S.:\nTaxable Money, Tax-Exempt Money\nStable Value, Short-Term Bond, Short Duration Income, Ultra-Short Term Bond\nCredit Opportunities, Floating Rate, High Yield\nInflation Protection, Treasury\nSecuritized Credit, CLO, GNMA\nInvestment Grade, Corporate Income Bond\nGlobal / International:\nN/O\nN/O\nEuro High Yield, High Income, Global High Yield\nGlobal Government Bond\nN/O\nEuro Investment Grade Corporate, Global Investment Grade Corporate \nMulti-Sector\nDynamic Suite\nEmerging Markets\nMunicipal\n(Tax-Free)\nImpact\nU.S.:\nQM Bond, Core Bond, Core Plus, Investment Grade Core, Total Return\nN/O\nN/O\nHigh Yield, Intermediate Muni, Intermediate, Long-Term, Short/Intermediate\nN/O\nGlobal / International:\nGlobal Multi-Sector, Global Aggregate, International Bond, Euro Aggregate\nDynamic Credit, Dynamic Global Bond, Dynamic Global Bond Investment Grade, Dynamic Emerging Markets Bond\nBond, Corporate, Corporate High Yield, Investment Grade, Local Currency, Asia Credit\nN/O\nGlobal Impact Credit\nN/O - Not offered\nMulti-Asset\nU.S. / Global / International:\nTarget Date, Custom Target Date\nTarget Allocation\nGlobal Allocation\nGlobal Income\nManaged Volatility\nCustom Solutions\nReal Assets\nRetirement Income\nAlternatives\nU.S. / Global / International:\nPrivate Credit\nLeveraged Loans\nMezzanine\nReal Assets / CRE\nStructured Products\nStressed / Distressed\nCLOs - Non-Investment Grade\nSpecial Situations\nMA Alternatives\nPage 5\nTable of Contents\n            \n    \nOur research staff conducts fundamental and quantitative security analysis primarily from offices located in the U.S. and U.K. with additional staff based in Australia, China, Hong Kong, Japan, and Singapore. We also use research provided by brokerage firms and security analysts in a supportive capacity and information received from private economists, political observers, commentators, government experts, and market analysts. \nWe introduce new strategies, investment vehicles, or other products to complement and expand our investment offerings, to respond to competitive developments in the financial marketplace, and to meet the changing needs of our clients. A new strategy is solely dependent on our belief we have the appropriate investment management expertise and its objective will be useful to investors over a long period. \nWe typically provide seed capital for certain investment products to begin building an investment performance history in advance of the portfolio receiving sustainable client assets. The length of time we hold our seed capital investment will vary for each investment product as it is highly dependent on how long it takes to generate cash flows into the product from unrelated investors or, in the case of certain alternative products, the investment term. Generally, we ensure the investment product has a sustainable level of assets from unrelated shareholders before we consider redemption of our seed capital investment in order to maintain the product's net asset value or its performance record. At December 31, 2024, we had seed capital investments in our products of $1.3 billion. Additionally, we invest our capital in certain alternative products we manage to further align our interest with those of our clients. These investments are commonly referred to as co-investments and totaled $0.3 billion at December 31, 2024.\nWe may also close or limit investments to new investors across investment products in order to maintain the integrity of the investment strategy and to protect the interests of its existing shareholders and investors. At present, the following strategies, which represent about 7% of total assets under management at December 31, 2024, are generally closed to new investors: \nStrategy \nYear closed\nU.S. Small-Cap Core\n2013\nCapital Appreciation\n2014\nDistribution Channels and Products\nWe distribute our products across a diversified client base across five primary distribution channels in three broad geographical regions: Americas; Europe, Middle East and Africa (\"EMEA\"); and Asia Pacific (\"APAC\"). We service clients in 54 countries around the world. Investors domiciled outside the U.S. represented about 9% of total assets under management at the end of 2024.\nThe following table outlines the five distribution channels and products through which our assets under management are sourced as of December 31, 2024.\nPage 6\nTable of Contents\n            \n    \nVehicle\nRetail\nInstitutional\nAmericas financial intermediaries\nEMEA & APAC financial intermediaries\nIndividual U.S. investors on a direct basis\nU.S. Defined Contribution\nInstitutional investors\nU.S. Mutual Funds\nx\nx\nx\nx\nCollective Investment Trusts\nx\nx\nExchange-Traded Funds\nx\nx\nx\nCollege Savings Plans\nx\nx\nModel Portfolios\nx\nx\n   x\n(6)\nSeparately Managed Accounts (SMAs)\n(1)\nx\nx\nSubadvised Accounts\nx\nx\nSeparate Accounts\nx\nx\nx\nSICAVs\n(2)\n / FCPs\n(3)\nx\nx\nCanadian Pooled Funds\nx\nx\nOEICs\n(4)\nx\nx\nJapanese ITMs\n(5)\nx\nx\nAustralian Unit Trusts\nx\nx\nPrivate Funds\nx\nCollateralized Loan Obligations\nx\nBusiness Development Company (BDC)\nx\nx\n(1)\n Includes both model delivery and manager traded SMAs,\n. (2)\nSociété d'Investissement à Capital Variable (Luxembourg), \n(3)\nFonds Commun de Placement (Luxembourg), \n(4)\nOpen-Ended Investment Company (U.K.), \n(5)\nJapanese Investment Trust Management Funds, \n(6) \nProvided through our ActivePlus and Retirement Advisory Service Portfolios. \nINVESTMENT ADVISORY FEES.\nWe derive substantially all of our net revenue from investment advisory fees that are earned pursuant to agreements with our sponsored products and clients. Nearly 57% of our investment advisory fees are earned from our sponsored U.S. mutual funds, with the remaining investment advisory fees earned from our collective investment trusts, subadvised funds, separately managed accounts, and other sponsored products. The other sponsored investment portfolios include: open-ended investment products offered to investors outside the U.S., products offered through variable annuity life insurance plans in the U.S., exchange traded funds, affiliated private investment funds, business development companies, and sponsored collateralized loan obligations.\nOur investment advisory fees are generally computed using the value of assets under management at a contracted annual fee rate or an effective fee rate for those products with a tiered-fee rate structure. For the majority of our revenue, the value of the assets under management used to calculate the fees are based on a daily valuation. The contracted fee rate(s) applied to the fund or account’s assets under management will vary depending on the services provided, the asset class, and vehicle. For example, fee rates are typically higher for equities and alternatives compared to multi-asset and fixed income products. Additionally, fees rates are typically higher for commingled vehicles including U.S. mutual funds, private investment funds and collective investment trusts compared to\n \nseparately managed accounts and subadvised funds. \nInvestment management agreements typically provide the ability for termination upon relatively short notice with little or no penalty. Specifically, our sponsored U.S. mutual fund investment management agreements must be approved, and fees are annually reviewed by the Boards of the respective funds, including a majority of directors who are not interested persons of the funds or of T. Rowe Price Group (as defined in the Investment Company Act of 1940). Additionally, fund shareholders must approve material changes to these investment management agreements. Each agreement automatically terminates in the event of its assignment (as defined in the Investment Company Act) and, generally, either party may terminate the agreement without penalty after a 60-day notice. The termination of one or more of the U.S. mutual fund agreements could have a material adverse effect on our results of operations. \nPage 7\nTable of Contents\n            \n    \nWe also earn performance-based investment advisory fees on certain separately managed accounts and affiliated private investment funds. These performance-based fees are recognized and reported separately in the consolidated income statement when performance returns exceed the stated hurdle at the end of the performance period, which can lead to an uneven recognition pattern in a given year. \nWe distribute certain of our sponsored products outside the U.S. through distribution agents and other financial intermediaries. The fees we earn for distributing and marketing these products are part of the investment advisory fees earned for managing the product assets. We recognize any related distribution fees paid to financial intermediaries in distribution and servicing costs.\nCAPITAL ALLOCATION-BASED INCOME.\nWe recognize income earned from general partner interests in certain affiliated private investment funds that are entitled to a disproportionate allocation of income, also referred to as carried interest. We record our proportionate share of the investment funds' income assuming the funds were liquidated at each reporting date pursuant to each investment fund's governing agreements. The income will fluctuate period-to-period and the realization of accrued carried interest occurs over a number of years. A portion of this income is allocated to certain employees that have non-controlling interests in the entities that hold the general partner's investments.\nADMINISTRATIVE, DISTRIBUTION, AND SERVICING FEES.\nAdministrative Services\nWe provide certain ancillary administrative services to our investment advisory clients. These administrative services are provided by several of our subsidiaries and include mutual fund transfer agent, fund/portfolio accounting, distribution, and shareholder services; recordkeeping services for defined contribution retirement plans investing in our sponsored vehicles and vehicles outside the T. Rowe Price complex; transfer agent services for defined contribution retirement plans investing in our sponsored U.S. mutual funds; brokerage; trust services; and non-discretionary advisory services.\nDistribution and Servicing\nOur subsidiary, T. Rowe Price Investment Services, is the principal distributor of our U.S. mutual funds and contracts with third-party financial intermediaries who distribute these share classes. Certain of the U.S. mutual funds offer Advisor Class and R Class shares that are distributed to investors and defined contribution retirement plans, respectively. These share classes pay 12b-1 fees of 25 and 50 basis points, respectively, out of fund assets, for distribution, administration, and personal services. In addition, U.S. mutual funds offered to investors through variable annuity life insurance plans have a share class that pays a 12b-1 fee of 25 basis points. We pay all of the 12b-1 fees earned to financial intermediaries who source assets under management into these share classes and provide distribution, administration, and personal services on our behalf.\n \nREGULATION.\nAll aspects of our business are subject to extensive federal, state, and foreign laws and regulations. These laws and regulations are primarily intended to benefit or protect our clients and product shareholders. They generally grant supervisory agencies and bodies broad administrative powers, including the power to limit or restrict the conduct of our business if we fail to comply with laws and regulations. Possible sanctions that may be imposed on us, if we fail to comply, include the suspension of individual employees, limitations on engaging in certain business activities for specified periods of time, revocation of our investment adviser and other registrations, censures, and fines. Furthermore, the regulations to which we are subject continue to change over time, resulting in uncertainty for our business as we must adapt to new laws and regulatory regimes and could significantly increase our reporting, disclosure and compliance obligations, including for cybersecurity and climate-related disclosures.\nAs a global company which offers its products to customers in a variety of jurisdictions, our subsidiaries are registered with or licensed by various U.S. and/or non-U.S. regulators. We are subject to various securities/financial services, compliance, corporate governance, disclosure, privacy, cybersecurity, technology, anti-bribery and anti-corruption, anti-money laundering, anti-terrorist financing, and economic, trade and sanctions laws and regulations, both domestically and internationally, as well as to various cross-border rules and regulations, and the data \nPage 8\nTable of Contents\n            \n    \nprotection laws and regulations of numerous jurisdictions, including the General Data Protection Regulation (“GDPR”) of the European Union (“EU”) and the California Consumer Privacy Act (“CCPA”). We also must comply with complex and changing tax regimes in the jurisdictions where we operate our business.\nThe following table shows the securities and financial services regulator to certain of our subsidiaries:\n \nRegulator\nT. Rowe Price Entity\nWithin the U.S.\nSecurities & Exchange Commission\n - T. Rowe Price Associates\n - T. Rowe Price Hong Kong\n - T. Rowe Price International\n - T. Rowe Price Japan\n - T. Rowe Price Australia\n - T. Rowe Price Singapore\n - T. Rowe Price (Canada)\n - T. Rowe Price Advisory Services\n - T. Rowe Price Investment Management\n - Oak Hill Advisors\n - Oak Hill Advisors (Europe)\n - OHA (UK)\n -OHA Private Credit Advisors\n - OHA Private Credit Advisors II\nAll entities above are registered as investment advisers under the Investment Advisers Act of 1940, which imposes substantive regulation around, among other things, fiduciary duties to clients, transactions with clients, effective compliance programs, conflicts of interest, advertising, recordkeeping, reporting, and disclosure requirements.\nState of Maryland, Office of Financial Regulation\n - T. Rowe Price Trust Company\nOutside the U.S.\nFinancial Conduct Authority\n - T. Rowe Price International\n - T. Rowe Price UK\n - Oak Hill Advisors (Europe)\n - OHA (UK)\nSecurities and Futures Commission\n - T. Rowe Price Hong Kong\n - Oak Hill Advisors (Hong Kong)\nMonetary Authority of Singapore\n - T. Rowe Price Singapore\nSeveral provincial securities commissions in Canada\n - T. Rowe Price (Canada)\nCommission de Surveillance du Secteur Financier \n - T. Rowe Price (Luxembourg) Management Sàrl \n - OHA Services Sàrl \nAustralian Securities and Investments Commission\n - T. Rowe Price Australia\n - Oak Hill Advisors (Australia) Pty\nJapan Financial Services Agency\n - T. Rowe Price Japan\nSwiss Financial Market Supervisory Authority\n - T. Rowe Price (Switzerland)\nServing the needs of retirement savers is an important focus of our business. Such activities are subject to regulators such as the U.S. Department of Labor, and applicable laws and regulations including the Employee Retirement Income Security Act of 1974 (\"ERISA\").\nRegistrations\n•\nOur subsidiaries providing transfer agent services, T. Rowe Price Services and T. Rowe Price Retirement Plan Services, are registered under the Securities Exchange Act of 1934.\n \n•\nT. Rowe Price Investment Services (TRPIS) is an SEC registered introducing broker-dealer and member of the Financial Industry Regulatory Authority (\"FINRA\") and the Securities Investor Protection Corporation. This \nPage 9\nTable of Contents\n            \n    \nsubsidiary is the principal underwriter and distributor for our sponsored U.S. mutual funds and exchange-traded funds, and may also offer and make recommendations for certain funds that are not offered to the general public such as privately placed funds. Investors may open a brokerage account with TRPIS in order to buy and sell securities. Pershing, a third-party clearing broker and an affiliate of BNY Mellon, maintains our brokerage’s customer accounts and clears all transactions.\n \n•\nT. Rowe Price Associates and certain subsidiaries are registered as commodity trading advisors and/or commodity pool operators with the Commodity Futures Trading Commission and are members of the National Futures Association. \nNet Capital Requirements\nCertain subsidiaries are subject to net capital requirements, including those of various federal, state, and international regulatory agencies. Each of our subsidiary's net capital, as defined, meets or exceeds all minimum requirements as of December 31, 2024.\n \nFor further discussion of the potential impact of current or proposed legal or regulatory requirements, please see the Legal and Regulatory risk factors included in",
    "item1a": "Item 1A. Risk Factors–Technology Risks” for more information on how a material cybersecurity incident may impact us.",
    "item1b": "Item 1B. Unresolved Staff Comments.\nNone.\nPage 26\nTable of Contents",
    "item1c": "Item 1C. Cybersecurity.\nTechnology is a key component of our business operations, and cybersecurity is a significant consideration for the firm. T. Rowe Price has a holistic firm-wide approach to risk management including material risks from cybersecurity threats. The firm’s overall risk management activities are designed to identify, assess, report, and manage risks that could affect the firm in achieving its objectives and goals. This risk management framework operates across our business lines and integrates business operational resiliency and technology related risks such as cybersecurity threats. \nAs part of the firm’s risk identification and assessment framework, key risks from cybersecurity threats specific to our environment are identified and assessed for adequacy of controls. Management identifies risk inherent to cybersecurity threats, estimates the significance of the risks, assesses the likelihood of their occurrence, establishes acceptable risk tolerance levels, and implements appropriate measures to monitor those risks.\n Action plans may be developed for identified control issues and management is responsible for addressing these issues\n.\n \nAlthough management is responsible for the firm’s day to day cybersecurity operations, the Board of Directors (\"the Board\") oversees the firm’s cybersecurity program. \nThe Board\n does not delegate this responsibility to a committee, nor does the Board identify a cybersecurity expert to consider the firm’s activities and make recommendations or provide advice to the Board. \nInstead, many of our directors have significant technology experience gained through their prior work experience and through their positions on other boards of directors, all of which provides the Board with insight and practical guidance in overseeing the firm’s technology and operations as well as our continuing investment in and development of our cybersecurity program.\n \nOur CEO has ultimate responsibility for developing strategy and overseeing execution to meet the firm’s objectives. The CEO has delegated to our Chief Operating Officer (COO) oversight of this operational execution. The COO has several leaders within the COO organization who develop and oversee the firm’s risk management, technology, and information security practices. These executive leaders play a critical role in cybersecurity risk management and strategy, as further described below. \nThe firm’s Chief Risk Officer (CRO) leads the Enterprise Risk program, providing the framework and tools used by all business teams across the firm, including technology, to identify, assess, and manage risks from cybersecurity threats in coordination with the firm's \nChief Information Security Officer (CISO)\n. The Enterprise Risk team provides guidance and support in identifying, assessing, and monitoring all aspects of risks from cybersecurity threats. The Enterprise Risk function conducts risk assessments for technology and cybersecurity, and coordinates with Internal Audit and Global Compliance to provide risk assurance activities.\nEnterprise Risk is primarily responsible for reporting risks from cybersecurity threats to executive leadership and our Enterprise Risk Management Committee (ERMC). The ERMC supports the efforts of the CRO in providing corporate-wide oversight of our firm’s risk management efforts and provides a path for risk escalation. This committee monitors risk management activities, including cybersecurity matters, and reports periodically and more frequently, as necessary, to our Board of Directors and Audit Committee. For example, at each quarterly meeting the Audit Committee receives an update concerning the company’s cybersecurity metrics. In addition, at least annually the Board receives a technology and cybersecurity update led by the senior management from the company’s technology and information security teams. Cybersecurity risk management practices operate enterprise-wide, across T. Rowe Price legal entities, including Oak Hill Advisors (OHA).\n In addition, OHA has established an independent risk committee, which includes responsibilities for prompt escalation of key risks and incidents such as cybersecurity to the T. Rowe Price CRO.\nT. Rowe Price maintains documented Enterprise Incident Management and Reporting Policies and Procedures, outlining responsibilities and requirements for escalation of various types of incidents, including cybersecurity threats and incidents. Our process is designed to investigate incidents efficiently, identify root cause, communicate with the affected parties as appropriate, spot trends, and recommend improvements to mitigate risk. These procedures incorporate incident materiality determination within senior executive levels and operate firm-wide. \nGlobal Technology and Business Unit management are also responsible for implementing internal controls to manage risks from cybersecurity threats to an appropriate level and in line with the firm’s risk appetite. Cybersecurity risks are managed across all lines of business, requiring support and participation across all levels in the organization. Within Global Technology, Enterprise Security is responsible for maintaining security policies, standards, and guidelines and routinely works with our Enterprise Risk, Compliance, Internal Audit, and other key technology and corporate stakeholders to establish security controls, enforce them, and monitor their adherence on an ongoing basis. Enterprise Security also conducts regular phishing tests and manages annual employee training \nPage 27\nTable of Contents\n            \n    \nfocused on raising awareness, highlighting the important role our employees play in protecting the firm from cybersecurity threats. Business Continuity and Disaster Recovery programs execute regular testing across business and technology teams to demonstrate resilience. The CISO regularly reviews the cybersecurity program and strategy with various risk committees, including the ERMC, Management Committee, and the Audit Committee. This ensures risks from cybersecurity threats are properly managed and our enterprise-wide cybersecurity program is aligned with the business needs and defined risk tolerances or risk appetite.\n \nThe cybersecurity program includes regular assessment on the effectiveness of the firm's risk mitigation strategies. \nAssessments include third-party validation\n to help ensure our internal controls and safeguards adhere to security and compliance standards. We annually undergo external examinations, such as Sarbanes-Oxley relating to financial reporting, System and Organization Controls (SOC) 1, and SOC 2 for key operational Business Units. In addition, we periodically engage with third-party partners to perform an independent evaluation of our cybersecurity program as well as external network penetration testing. This complements our internal assessments, such as application security testing, vulnerability management, and penetration testing. The firm participates in various industry threat intelligence information sharing forums to stay current on evolving cyber risks and threats. The results of these assessments are discussed with and reviewed by the Audit Committee, and shared with the Board, annually.\nWithin the firm's global risk department, governance processes are established, including a formal Supplier Risk Management program overseeing third-party relationships based on documented risk thresholds. The Supplier Risk Management program performs regular assessments, including information security reviews. \nOngoing monitoring is performed through our centralized risk function as well as by business line supplier managers to raise new threats or weaknesses associated with a third-party service. In accordance with our Enterprise Incident Management Policy, any third-party cybersecurity incident is reported and evaluated for further review and impact analysis.\n \nWe have previously been the target of cybersecurity attacks and expect such attempts to continue, potentially with more frequency or sophistication. \nAlthough no cybersecurity incident during the year ended December 31, 2024, resulted in an interruption of our operations, known losses of critical data, nor a material impact on the firm’s strategy, financial condition or results of operations. The scope and impact of any future incident cannot be predicted.\n See “"
  }
}