{
  "ticker": "TSCO",
  "cik": "0000916365",
  "company_name": "TRACTOR SUPPLY CO /DE/",
  "filing_date": "2025-02-20",
  "accession": "0000916365-25-000076",
  "primary_doc": "tsco-20241228.htm",
  "item_sections": {
    "item1": "Item 1.     Business\nOverview\nTractor Supply Company (the “Company” or “Tractor Supply” or “we” or “our” or “us”) is the largest rural lifestyle retailer in the United States (“U.S.”). The Company is focused on supplying the needs of recreational farmers, ranchers, and all those who enjoy living the rural lifestyle (which we refer to as the “\nOut Here\n” lifestyle).  We operate retail stores under the names \nTractor Supply Company \nand\n Petsense by Tractor Supply. \nOur stores are located primarily in towns outlying major metropolitan markets and in rural communities. We also offer an expanded assortment of products through the Tractor Supply mobile application and online at \nTractorSupply.com\n and \nPetsense.com.\n  \nThe Company has one reportable industry segment which is the retail sale of products that support the rural lifestyle. At December 28, 2024, we operated 2,502 retail stores in 49 states (2,296 Tractor Supply retail stores and 206 Petsense by Tractor Supply retail stores). Our Tractor Supply stores typically range in size from 15,000 to 20,000 square feet of inside selling space, along with additional outside selling space (“Side Lot” or “Garden Centers”), and our Petsense by Tractor Supply stores have approximately 5,500 square feet of inside selling space. Our online selling websites and our mobile application offer an extended assortment of products beyond those offered in-store and drive traffic into our stores through our buy online and pickup in-store and ship to store programs. Our retail store locations and digital capabilities provide the convenience to allow our customers to engage with us anytime, anywhere and in any way they choose. \nBusiness Strategy for Tractor Supply Company \nWe believe our sales and earnings growth is the result of executing our multi-year strategy, which includes the following key components:\n \nTarget Market\nWe are dedicated to fulfilling the lifestyle needs of recreational farmers, ranchers, homesteaders, animal and pet owners, and all those who enjoy living the rural lifestyle. Our distinct approach differentiates us from other retailers by concentrating our product assortment on these core customers. We provide a convenient shopping experience both in-store and online, focusing on needs-based, demand-driven product categories. Serving the rural lifestyle market, we act as a trip consolidator for numerous basic maintenance requirements of farm, ranch, and rural customers.\nCustomers\nOur target customers are home, land, pet, animal and livestock owners who generally have above average income and below average cost of living. We seek to serve a customer base that primarily lives in towns outlying major metropolitan markets and in rural communities. This customer base includes recreational farmers, ranchers, and all those who enjoy living a rural inspired lifestyle.  \nCustomer Service\nWe are committed to providing our customers reliable product availability and a convenient, customer-centric experience across shopping channels. In our stores, we believe the ability of our motivated, well-trained team members to provide friendly, responsive and seasoned advice helps our customers find the right products to satisfy their everyday needs, as well as the specialty items needed to complete their rural lifestyle projects. We also engage with our customers through our e-commerce websites and mobile application, which provide the opportunity to allow customers to shop anytime, anywhere, and in any way they choose, while delivering enhanced product information, research, and decision tools that support product selection and informational needs in specific subject areas. Additionally, we maintain a Customer Solutions Center at our Store Support Center located in Brentwood, Tennessee, to support our in-store and online customers, as well as our store team members. We believe this commitment to customer service promotes strong customer loyalty through personalized experiences and provides convenience that our customers expect, which drives repeat shopping experiences.  \n1\nTable of Contents\nWe use a third-party provider to survey and measure our level of customer service.  This process allows customers to provide feedback on their shopping experience.  Based on the third-party provider’s data, we believe our customer satisfaction scores are among the best-in-class.  We carefully evaluate the feedback we receive from our customers and implement improvements at both the Company and the individual store level based on that feedback.\nStore Environment\nOur stores are designed and managed to make shopping an enjoyable experience and to maximize sales and operating efficiencies.  Stores are strategically arranged to provide an open environment for optimal product placement and visual display. In addition, these layouts allow for departmental space to be easily reallocated and visual displays to be changed for seasonal products and promotions. Display and product placement information is routinely sent to stores to ensure quality and uniformity among the stores, and our Field Activity Support Teams (“FAST”) are dedicated to support the stores in creating an enhanced in-store experience for our customers through best-in-class merchandising execution. Our store layouts and visual displays are designed to provide our customers a feeling of familiarity and convenience to enhance the shopping experience. Informative signs are located in key product categories to conveniently assist customers with purchasing decisions and merchandise location.  These signs provide customers with a comparison of product qualities, clear pricing, useful information regarding product benefits, and suggestions for appropriate accessories. Also, our store team members wear highly visible red vests or aprons with name tags, and our customer service and checkout counters are conveniently located near the front of the store. \nOur stores have been equipped with tools such as team member communication devices, wireless internet, and mobile point-of-sale devices that enable our team members to provide an enhanced shopping experience to our customers. \nIn addition, our buy online and pickup in-store and ship to store programs, including curbside pickup, provide convenient access for customers to pick up merchandise from our store locations. We also offer store delivery in all of our Tractor Supply stores to meet our customers' needs.\nWe are in the midst of a multi-year project that began in 2020 to remodel our existing store base, bringing programs to life with new fixtures, layouts and products that truly enhance the customer shopping experience. The site-level space is analyzed category by category and reallocated as needed to align with current merchandising strategies and to drive space productivity. Another space productivity initiative is to transform our Side Lot with an expanded product offering and an enhanced shopping experience. With this investment, the Side Lot space is leveraged to offer a wider product offering in the lawn and garden categories and new categories within the garden center, and offer greater convenience through the expansion of our buy online and pickup in-store and ship to store capabilities for drive-thru pickup.\nMerchandising and Purchasing\nWe offer an extensive assortment of products for all those seeking to enjoy the “\nOut Here”\n lifestyle.  Our product assortment is tailored to meet the needs of our customers in various geographic markets.  Our full line of product offerings includes a broad selection of high quality, reputable brand name and exclusive brand products with approximately 17,000 to 27,000 products per store as well as over 325,000 products online.  No single product accounted for more than 10% of our sales during fiscal 2024. Our comprehensive selection of merchandise is comprised of the following major product categories:\n•\nLivestock, Equine & Agriculture: livestock and equine feed & equipment, poultry, fencing, and sprayers & chemicals; \n•\nCompanion Animal: food, treats and equipment for dogs, cats, and other small animals as well as dog wellness; \n•\nSeasonal & Recreation: tractor & rider, lawn & garden, bird feeding, power equipment, and other recreational products;\n•\nTruck, Tool, & Hardware: truck accessories, trailers, generators, lubricants, batteries, and hardware and tools; and\n•\nClothing, Gift, & Décor: clothing, footwear, toys, snacks, and decorative merchandise.\n2\nTable of Contents\nThe following table indicates the percentage of net sales represented by each of our major product categories during fiscal 2024, 2023, and 2022:\n \nPercent of Net Sales\nFiscal Year\nProduct Category:\n2024\n2023\n2022\nLivestock, Equine & Agriculture\n26 \n%\n27 \n%\n28 \n%\nCompanion Animal\n25 \n25 \n23 \nSeasonal & Recreation\n23 \n22 \n22 \nTruck, Tool, & Hardware\n16 \n16 \n16 \nClothing, Gift, & Décor\n10 \n10 \n11 \nTotal\n100 \n%\n100 \n%\n100 \n%\nNote:\n \nNet sales by major product categories for prior periods have been reclassified to conform to the current year presentation. \nOur buying team continuously reviews and updates our product assortment as necessary to respond to customer needs and to offer new, relevant products. We are focused on providing key products that our customers use on a regular basis for their lifestyle and maintenance needs with emphasis on consumable, usable, and edible (“C.U.E.”) products. Examples of C.U.E. product categories include, but are not limited to, livestock feed and bedding, pet food, bird seed, lubricants, propane, and various seasonal products, such as fertilizer, weed control, mulch, pest control, and twine. \nOur products are sourced through both domestic and international vendors, each of whom are expected to adhere to a code of conduct that guides our relationship.  Our business is not dependent upon any single vendor or particular group of vendors.  We purchase our products from a group of over 1,000 vendors, with no one vendor representing more than 10% of our purchases during fiscal 2024.  Approximately 400 core vendors accounted for 90% of our merchandise purchases during fiscal 2024. We have not experienced any significant difficulty in obtaining satisfactory alternative sources of supply for our products to meet customer demands despite the global supply chain disruptions and delays. We believe that adequate sources of supply exist, but they may cost more or require us to incur higher transportation costs.  \nOur buying teams focus on merchandise procurement, vendor line reviews, and testing of new products and programs.  We also employ a dedicated inventory management team that focuses exclusively on forecasting and inventory replenishment, a committed merchandise planning team that concentrates on assortment planning, and a specialized pricing team that seeks to optimize market-specific pricing for our products. Through the combined efforts of these teams, we continue to focus on improving our overall inventory productivity and in-stock inventory position.\nIntellectual Property \nOur subsidiary, Tractor Supply Co. of Texas, LP (“TSCT”), owns registrations with the U.S. Patent and Trademark Office (“USPTO”) for various service marks including \nTSC\n®\n, \nTractor Supply Co.\n®\n, \nTSC Tractor Supply Co.\n®\n, \nPetsense by Tractor Supply\n®, and the trapezium design for retail services. We consider these service marks, and the accompanying goodwill and name recognition, to be valuable assets of our business. TSCT also owns several other service marks for retail services, some of which have been registered with the USPTO and some of which are the subject of applications for registration pending before the USPTO. \nIn addition to selling products that bear nationally-known manufacturer brands, we also sell products manufactured for us under a number of exclusive brands that we consider to be important to our business. These exclusive brands are manufactured for us by a number of vendors and provide an alternative to the national brands, which helps provide value for our customers and positions us as a destination retailer. \n3\nTable of Contents\nOur exclusive brands represented approximately 29%, 29%, and 30% of our total sales in fiscal 2024, fiscal 2023 and fiscal 2022, respectively. Our exclusive brands include:\n \n4health\n®\n (pet foods and supplies)\n \nPaws & Claws\n® \n(pet foods and supplies)\n \nAmerican Farmworks\n®\n (livestock, farm and ranch\n \nProducer’s Pride\n® \n(livestock and horse feed and supplies)\nequipment)\n \nBit & Bridle\n®\n (apparel and footwear)\n \nRed Shed\n®\n (gifts, collectibles, and outdoor furniture)\n \nBlue Mountain\n® \n(apparel)\n \nRedstone\n® \n(heating products)\n \nC.E. Schmidt\n® \n(apparel and footwear)\n \nRetriever\n®\n (pet foods and supplies)\n \nCountry Lane\n®\n (grooming preparations, animal \n \nRidgecut\n® \n(apparel)\n feed and feed supplements)\n \nCountyline\n®\n (livestock, farm and ranch equipment)\n \nRoyal Wing\n® \n(bird feed and supplies)\n \nCountry Tuff\n®\n (lubricants, fluids and oil treatments)\n \nStrive\n® \n(pet foods)\n \nDumor\n®\n (livestock and horse feed and supplies)\n \nTraveller\n® \n(truck and automotive products)\n \nFarm Table\n®\n (pet food and treats)\n \nTreeline\n® \n(hunting gear and accessories)\n \nGroundwork\n® \n(lawn and garden supplies)\n \nTSC Tractor Supply Co\n® \n(trailers, truck tool boxes and\nanimal bedding)\n \nHuskee\n® \n(outdoor power equipment)\n \nUntamed\n®\n (pet foods)\n \nJobSmart\n®\n (tools)\n \nImpeckables\n® \n(poultry feed, poultry kits and egg\n      incubators)\nThe exclusive brands identified above have been registered as trademarks with the USPTO for certain products and some are the subject of additional applications for registration pending before the USPTO for other products.  \nOur trademark and service mark registrations have various expiration dates; however, provided that we continue to use the marks and file appropriate maintenance and renewal documentation with the USPTO in a timely manner, the registrations are potentially perpetual in duration.  Our patents (both United States and foreign) have expiration dates ranging from April 5, 2027 to November 3, 2043 and protect various elements, designs or functions of farm and ranch equipment, as well as light systems for trucks and other vehicles. \nWe believe our intellectual property, which includes the trademarks and service marks identified above, together with certain trade names, domain names, patents, and copyrights, has significant value and is an important component of our merchandising and marketing strategies.  \nDistribution\nWe currently operate a distribution facility network for supplying stores with merchandise and delivering product ordered through our websites and mobile application.  In fiscal 2024, our Tractor Supply stores received approximately 81% of merchandise through this network while the remaining merchandise shipped directly from our vendors to our stores or customers.  We believe this flow facilitates the prompt and efficient distribution of merchandise that allows us to be a dependable supplier to our customers for their “\nOut Here\n” lifestyle solutions by enhancing in-stock inventory positions, while minimizing freight expense and improving the inventory turn rate.  Our distribution facilities, located in Arizona, Arkansas, Georgia, Indiana, Kentucky, Maryland, Nebraska, New York, Ohio and Texas represent a total distribution center capacity of approximately 7.8 million square feet. We also use third-party operated import centers, mixing centers and pop-up distribution facilities which provide additional distribution capacity. On May 14, 2024, the Company opened its tenth and largest distribution center located in Maumelle, Arkansas, which expanded the distribution center capacity by approximately 1.2 million square feet.\nWe select the locations of our distribution facilities in an effort to minimize logistics costs and optimize the distance from distribution facilities to our stores.  Our distribution centers utilize warehouse and labor management tools that support the planning, control, and processing of inventory.  We manage our inbound and outbound transportation activity in-house through the use of a transportation management system.  We utilize multiple common carriers for store and direct to customer \n4\nTable of Contents\ndeliveries. We manage our transportation costs through carrier negotiations, monitoring of transportation routes, and scheduling of deliveries.\nMarketing\nLeveraging our value-driving offerings from our Neighbor’s Club loyalty program, we utilize an “everyday low price” philosophy to consistently offer our products at competitive prices complemented by limited and strategically planned promotions throughout the year. To drive store traffic, build brand consideration, and position ourselves as a destination retailer, we promote a broad selection of merchandise and our “Life Out Here” brand messaging through digital and social media initiatives, targeted digital video (connected TV and streaming programming), and e-mail.  In addition, our \nNeighbor’s Club\n loyalty program continues to drive strong customer count growth and enhances our ability to engage with our customers, recognize and reward our best customers, drive desired purchase behaviors, and create brand advocacy. Vendors frequently support these specific programs by offering temporary cost reductions, additional funding, and honoring coupons.  Our vendors also provide assistance with product presentation and fixture design, support for in-store events, point-of-purchase materials for customer education, and product knowledge for our team members. \nDigital\nEnsuring that our customers can engage with us in the most convenient manner for them whether in our stores, on our website, on our mobile application, or via our Customer Solutions Center, is a high priority for us. Our goal is to be available anytime, anywhere, and in any way our customers choose to engage with our brand. We provide our customers the opportunity to shop in a manner that fits their lifestyle and is most convenient for them. \nOur focus is on delivering a comprehensive, easy shopping experience, offering the conveniences our customers want and expect by driving a personalized experience by leveraging our Neighbor’s Club Loyalty program.\n  We offer buy online, pickup in-store, and curbside pickup, which provide convenient access for customers to pick up merchandise from our store locations.  Additionally, our online experience offers an expansive product assortment including a direct to consumer assortment. This allows us to extend our aisles beyond our store locations and provides convenient and useful content that is relevant to our customers’ lifestyle. We provide our customers the ability to have products shipped directly to our retail store locations or delivered to their homes or offices.  For select products, we offer same day delivery. We use our distribution facility network as well as our stores to support our e-commerce activities. Our digital commerce (“Digital”) capabilities have further enhanced our in-store shopping experience, allowing us to engage with our customers more effectively, and expanded our target markets outside of our current retail store locations.\nContinuous Improvement\nWe are committed to a continuous improvement program to drive change throughout our organization. Using data analytics and team member engagement, we examine business processes and identify opportunities to reduce costs, drive innovation, and improve effectiveness.  We establish annual goals for productivity and cost improvement. Additionally, we have\n training goals to expand our team’s knowledge and understanding of continuous improvement, which is a key pillar in our culture\n. We have implemented several continuous improvement projects, with team members across our business, to evaluate key operations and implement process changes. Team members are empowered and expected to challenge current paradigms and improve processes.  Management encourages the participation of all team members in the decision-making process, regularly solicits input and suggestions from our team members, and incorporates suggestions into our improvement activities.\nManagement Information and Control Systems\nWe have invested resources in management information and control systems to provide legendary customer service and to deliver the right products in the right place at the right time.  This investment includes use of digital technologies that support the “\nOut Here\n” lifestyle and integrate the customer experience in-store, online, and through our Customer Solutions Center, which offers customers the ability to shop anytime, anywhere, and in any way they choose.  Our key platforms include:\n•\nPoint-of-sale system;\n•\nIn-store mobility;\n•\nE-commerce platform;\n•\nConsumer mobile app;\n•\nReplenishment and allocation systems;\n•\nMerchandising presentation and inventory management tools;\n•\nWarehouse and transportation management systems; \n•\nLabor management tools for stores and supply chain;\n5\nTable of Contents\n•\nPrice optimization system;\n•\nVendor purchase order control system;\n•\nHuman resource information systems;\n•\nBusiness intelligence and analytics tools; and \n•\nCustomer loyalty and campaign management system.  \nThese systems are integrated through an enterprise resource planning (“ERP”) system.  This ERP system tracks merchandise from initial order through ultimate sale and interfaces with our financial systems.\nWe continue to invest in technology to support store, online, and distribution facility expansion and our long-term strategic growth initiatives focused heavily on improving the customer experience across all channels.  We also continue to evaluate and improve the functionality of our systems to maximize their effectiveness.  Such efforts include ongoing hardware and software evaluations, refreshes, and upgrades to support optimal software configurations, and application performance.  We plan to continue to invest in information technology and implement efficiency-driving system enhancements \nsuch as computer vision, labor and task management tools, edge computing and artificial intelligence.\n  We will continue to evaluate the use of emerging technologies to improve productivity \nsuch as robotics, robotic process automation, quantum computing and other technologies.\n  We also maintain and continue to strengthen the security of our information systems to help protect and prevent unauthorized access to personal information of our customers, team members, vendors, and other confidential Company data.  We are endeavoring to adhere to quickly evolving industry privacy laws and standards\n, as well as governance as it applies to artificial intelligence\n.  Critical areas of focus include cloud, end point protection and privacy.  Collectively, these efforts are directed toward improving business processes, maintaining secure, efficient, and stable systems, and enabling the continued growth and success of our business.\nPetsense by Tractor Supply\nPetsense by Tractor Supply is a small-box pet specialty supply retailer focused on meeting the needs of pet owners, primarily in small and mid-sized communities, and offering a variety of pet products and services. At December 28, 2024, we operated a total of 206 Petsense by Tractor Supply stores in 23 states, and an e-commerce website (\nPetsense.com\n). The Petsense name is registered with the USPTO.\nHuman Capital\nWe believe that our team members are the foundation of our business and that their hard work, passion, commitment, and experience drive our success. As a result of our commitment to our team members, we have been recognized by the Great Place to Work Institute as a “\nGreat Place to Work-Certified\n”\n \ncompany for five consecutive years. Additionally, we earned a spot on both the \nNashville Business Journal's\n \nBest Places to Work \n(2023) and \nThe\n \nTennessean's Top Workplaces in Middle Tennessee\n (2023) lists, as well as national lists including \nFortune’s Best Workplaces in Retail \n(2023), \nNewsweek’s America's Greatest Workplaces \n(2023), and \nForbes’ America's Best Large Employers \n(2023). Below are further descriptions of our Company and our focus on the development and support of our team members:\nManagement and Team Members\nAs of December 28, 2024, we employed approxima\ntely \n26,000\n full-time and 26,000\n part-time Tractor Supply and Petsense by Tractor Supply team members and use contractors on an as-needed basis. We typically employ additional part-time team members throughout the year during high sales volume periods. We are not party to any collective bargaining agreements.\nEligible team members participate in one of our various bonus incentive programs, which provide the opportunity to receive additional compensation based upon individual, team, and/or Company performance. In addition to bonus incentive programs, we provide our eligible team members the opportunity to participate in an employee stock purchase plan and a 401(k) retirement savings plan. We offer health insurance for which we share a significant portion of the cost of premiums. We additionally provide our eligible team members with a tuition reimbursement program, paid time off and a six-week parental leave policy for new parents. Our team members also receive a discount on merchandise purchased from the Company. \nWe encourage a promote-from-within environment when internal resources permit. We also provide internal leadership development programs designed to prepare our high-potential team members for greater responsibility. Our current team of district managers and store managers has an average tenure of approximately ten and seven years, respectively. We believe internal promotions, coupled with the hiring of individuals with previous retail experience, provide the management structure necessary to support our long-term strategic growth initiatives. \n6\nTable of Contents\nStore Team Member Learning & Development\nWe seek to hire store team members who live and appreciate the “\nOut Here\n” lifestyle, including recreational farmers, ranchers, homesteaders, animal and pet owners, and all those who enjoy living the rural lifestyle. We endeavor to staff our stores with courteous, highly motivated team members and devote considerable resources to training store team members, often in cooperation with our vendors. Our learning & development programs include:\n•\nA thorough on-boarding process to prepare new team members for their new role;\n•\nProductive workplace environment training that is intended to educate team members on Company policies and procedures covering topics such as harassment, discrimination, and retaliation\n•\nNew store opening training that prepares our store managers to open new stores to Company standards;\n•\nA management training program which covers all aspects of our store operations, including delivering superior service and managing the team member experience;\n•\nStructured training on customer service and selling skills;\n•\nOnline product knowledge training produced in conjunction with key vendors;\n•\nLeadership development programs that prepare leaders to expand their current contributions;\n•\nPeriodic all store team member meetings; and\n•\nAn annual store manager meeting with vendor product presentations.\nWorkplace Health and Safety\nAt Tractor Supply, maintaining a healthy, safe environment for our team members and customers is embedded in our mission and values. Team members are empowered to do the “right thing” and encourage the same of others. We are committed to driving a culture of safety for our team members, customers and communities through role-based training specific to Tractor Supply’s operations, the use of technology to deliver training, and an attitude of continual improvement.\nRespectful Workplace Initiatives\nAt Tractor Supply, we foster a safe, dynamic and productive work environment free of discrimination, harassment and retaliation, supported by our Mission and Values, where everyone is treated with respect and which fosters different perspectives, ideas and innovative thinking. Our Mission and Values have been the foundation of our culture for more than 85 years. All of our team members and customers are highly valued, and we place high importance on considering different viewpoints and caring for and supporting one another.\nGrowth Strategy\nTractor Supply believes we can grow our business by being an integral part of our customers’ lives as the dependable supplier of “\nOut Here\n” lifestyle solutions, creating customer loyalty through personalized experiences, our Neighbor's Club loyalty program and providing convenience that our customers expect at anytime, anywhere, and in any way they choose. Our long-term growth strategy is to: (1) expand and deepen our customer base by providing personal, localized, and memorable customer engagements by leveraging content, social media, and digital shopping experiences, attracting new customers and driving loyalty, (2) evolve customer experiences by digitizing our business processes and furthering our Digital capabilities, (3) offer relevant assortments and services across all channels through exclusive and national brands and continue to grow our total addressable market by introducing new products and services through our test and learn strategy, (4) drive operational excellence and productivity through continuous improvement, increasing space utilization, and implementing advanced supply chain capabilities to support growth, scale and agility, and (5) expand through selective acquisitions, as such opportunities arise, to add complementary businesses and to enhance penetration into new and existing markets to supplement organic growth.\nAchieving this strategy will require a foundational focus on: (1) connecting, empowering and growing our team to enhance our team members' lives and the communities in which they live, enabling them to provide legendary service to our customers, and (2) allocating resources in a disciplined and efficient manner to drive profitable growth and build stockholder value, including leveraging technology and automation, to align our cost structure to support new business capabilities for margin improvement and cost reductions.\nOver the past five years, we have experienced considerable sales growth, resulting in a compounded annual growth rate of approximately 12.2%. We plan to open approximately 90 new Tractor Supply and approximately 10  new Petsense by Tractor Supply stores in fiscal 2025, a selling square footage increase of approximately 4%. In fiscal 2024, we opened 80 new Tractor Supply stores and 11 new Petsense by Tractor Supply stores. In fiscal 2023, we opened 70 new Tractor Supply stores and 13 \n7\nTable of Contents\nnew Petsense by Tractor Supply stores. This represents a selling square footage increase of approximately 2% during fiscal 2024 and 3% during fiscal 2023. \nAt December 28, 2024, we operated 2,502 retail stores in 49 states (2,296 Tractor Supply retail stores and 206 Petsense by Tractor Supply retail stores). Given the size of the communities that we target, we believe there is ample opportunity for new store growth in many existing and new markets. We believe we have developed a proven method for selecting store sites and have significant additional opportunities for new Tractor Supply stores. We also believe that there is opportunity for continued growth for Petsense by Tractor Supply stores. \nApproximately 61% of our stores are in freestanding buildings and 39% are located in shopping centers. We lease approximately 96% of our stores and own the remaining 4%.\nIn addition to new store expansion, we will continue to support our strategic growth through expansion of our distribution network and initiatives including, among others, space productivity and Side Lot improvements to include Garden Centers in certain existing stores as well as continued improvements in technology and infrastructure at our existing stores, and ongoing investments to enhance our Digital capabilities to better serve our customers.\nCompetition\nWe operate in a competitive retail industry. We believe the principal competitive factors include location of stores, fulfillment options, price, quality of merchandise, in-stock inventory consistency, merchandise assortment and presentation, product knowledge, and customer service. We compete with general merchandise retailers, home center retailers, pet retailers, specialty and discount retailers, independently owned retail farm and ranch stores, numerous privately-held regional farm store chains and farm cooperatives, as well as internet-based retailers.  However, we believe we successfully differentiate ourselves from many of these retailers by focusing on our specialized market niche for customers living the rural lifestyle. See further discussion of competition in",
    "item1a": "Item 1A. “Risk Factors—Technology, Data Security, Cybersecurity, Business Continuity and Disaster Recovery Risks” of this Annual Report on Form 10-K.\n24\nTable of Contents",
    "item1b": "Item 1B.     Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.     Cybersecurity\nCybersecurity Risk Management Program\nCybersecurity is among the most critical risks to the Company. For many activities important to its business, the Company depends on the confidentiality, integrity, and availability of information systems and data, some of which are provided or \nmanaged by third parties\n. \nThe Company’s Information Security and Privacy teams\n reduce first and third-party risk by maintaining a proactive security posture aligned with current threats, detecting cybersecurity events and responding quickly, and building procedures to rapidly recover. \nInternal and third-party risks are reviewed, monitored, and managed by the Company’s Cybersecurity and Privacy teams, audited by an Internal Audit team and various external experts, and tracked within an Enterprise Risk Management framework. The Company regularly engages third-party experts to assess the effectiveness of its cybersecurity programs. Biennially, an external independent consultancy team conducts a comprehensive review of the Company’s cybersecurity program using the NIST Cybersecurity Framework. Targeted assessments are conducted regularly by internal and third-party experts to ensure compliance with specific federal and state laws and regulations. Additionally, the Company is assessed annually by an independent third party for compliance with the PCI-DSS standard, for which the Company receives an attestation of compliance.\nThe Company’s processes for identifying and managing first and third-party risks from cybersecurity threats include\n:\n•\nContinuous monitoring of the Company’s systems and network for cybersecurity events;\n•\nRegular testing of the Company’s Security Incident Response Plan, Business Continuity plans, and Disaster Recovery plans;\n•\nRequired annual security training for team members with access to Company email, as well as tailored training for team members in more sensitive roles (and periodic testing to ensure the security training is effective).\n23\nTable of Contents\nThe Company’s security awareness program seeks to create a culture of shared responsibility for the security of sensitive data and systems. This is accomplished through mandatory annual security training for team members with access to Company email as well as tailored training for team members in more sensitive roles. Periodic testing ensures the training is effective. In addition, all team members have access to a variety of training materials on security topics through the Company’s training management system.\nGovernance\nOn behalf of the Board, the Audit Committee provides oversight of the Company’s management of cybersecurity risk. The Audit Committee regularly reviews the Company’s cybersecurity risks, incidents, audits, assessments, crisis readiness, awareness activities, and compliance with cybersecurity and privacy laws and regulations. \nThe Company’s Vice President, Information Security and Privacy, \nbriefs the Audit Committee quarterly\n, and more often, if necessary, on active and emerging cybersecurity threats and efforts to strengthen the Company’s defenses against these threats.\nThe Company’s Information Security and Privacy program and teams are managed by the Vice President, Information Security and Privacy, who reports to the Executive Vice President, Chief Technology, Digital Commerce, and Strategy Officer. The Company’s cybersecurity leaders have more than 25 years of relevant experience and multiple professional certifications.\nAn external managed security services provider and industry-leading security tools continuously monitor the Company’s systems and network for cybersecurity threats. The Company’s cybersecurity teams evaluate the escalated threats, and if necessary, take steps to contain and recover from pervasive threats in accordance with the Company’s Security Incident Response Plan. The plan includes reporting and escalation procedures to inform the Executive Committee, Audit Committee, and full Board, as appropriate to enable them to carry out their oversight responsibilities, and to ensure timely compliance with applicable reporting rules. The Company’s Business Continuity Management and Disaster Recovery plans include procedures for business recovery and are tested regularly.\n \nWe, like many organizations operating in the current climate, face significant cybersecurity threats. To date, no risks from cybersecurity threats or incidents have materially affected us, including our results of operations or financial condition. Notwithstanding our security awareness program, we may not be successful in identifying a cybersecurity threat or preventing or mitigating a cybersecurity incident or vulnerability, which if realized, could materially affect us. Additional information on the cybersecurity risks we face can be found in"
  }
}