{
  "ticker": "TSLA",
  "cik": "0001318605",
  "company_name": "Tesla, Inc.",
  "filing_date": "2025-01-30",
  "accession": "0001628280-25-003063",
  "primary_doc": "tsla-20241231.htm",
  "item_sections": {
    "item1": "Item 1- Business. For discussion related to changes in financial condition and the results of operations for fiscal year 2023-related items, refer to Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for fiscal year 2023, which was filed with the Securities and Exchange Commission on January 29, 2024.\nOverview and 2024 Highlights\nOur mission is to accelerate the world’s transition to sustainable energy. We design, develop, manufacture, lease and sell high-performance fully electric vehicles, solar energy generation systems and energy storage products. We also offer maintenance, installation, operation, charging, insurance, financial and other services related to our products. Additionally, we are increasingly focused on products and services based on AI, robotics and automation.\nIn 2024, we produced approximately 1,773,000 consumer vehicles and delivered approximately 1,789,000 consumer vehicles. We are focused on profitable growth, including by leveraging existing factories and production lines to introduce new and more affordable products, further improving and deploying our FSD (Supervised) capabilities, including future autonomous capabilities through our purpose-built Robotaxi product, Cybercab, reducing costs, increasing vehicle production, utilized capacity and delivery capabilities, improving and developing our vehicles and battery technologies, vertically integrating and localizing our supply chain, and expanding our global infrastructure, including our service and charging infrastructure.\nIn 2024, we deployed 31.4 GWh of energy storage products. We are focused on ramping the production and increasing the market penetration of our energy storage products.\nIn 2024, we recognized total revenues of $97.69 billion, representing an increase of $917 million compared to the prior year. In 2024, our net income attributable to common stockholders was $7.09 billion, representing a decrease of $7.91 billion compared to the prior year, primarily due to the impact of releasing $6.54 billion of our valuation allowance associated with U.S. federal and state deferred tax assets in the fourth quarter of 2023.We continue to ramp production and build and optimize our manufacturing capacity, expand our operations while focusing on further cost reductions and operational efficiencies to enable increased deliveries and deployments of our products, and invest in research and development to accelerate our AI, software, and fleet-based profits for further revenue growth.\nWe ended 2024 with $36.56 billion in cash and cash equivalents and investments, representing an increase of $7.47 billion from the end of 2023. Our cash flows provided by operating activities were $14.92 billion in 2024 compared to $13.26 billion in 2023, representing an increase of $1.67 billion. Capital expenditures amounted to $11.34 billion in 2024 compared to $8.90 billion in 2023, representing an increase of $2.44 billion. Overall growth has allowed our business to generally fund itself, and we will continue investing in a number of capital-intensive projects and research and development in upcoming periods.\n32\nManagement Opportunities, Challenges and Uncertainties and 2025 Outlook\nAutomotive—Production \nThe following is a summary of the status of production of each of our announced vehicle models in production and under development, as of the date of this Annual Report on Form 10-K:\nRegion\nVehicle Model(s)\nProduction Status\nCalifornia\nModel S / Model X\nActive\n \nModel 3 / Model Y\nActive\nShanghai\nModel 3 / Model Y\nActive\nBerlin\nModel Y\nActive\nTexas\nModel Y\nActive\n \nCybertruck\nActive\nCybercab\nIn development\nNevada\nTesla Semi\nPilot production\nTBD \nRoadster\nIn development \nWe are focused on growing our manufacturing capacity, which includes capacity for manufacturing newer vehicle models such as our Cybertruck, Tesla Semi and future vehicles utilizing aspects of our next generation platform, and ramping the production at our Gigafactories to their installed production capacities as well as increasing production rate and efficiency at our current factories. The next phase of production growth will depend on the continued ramp at our factories and be initiated by advances in autonomy and the introduction of new products, including those built on our next generation vehicle platform, as well as our ability to add to our available sources of battery cell supply by manufacturing our own cells that we are developing to have high-volume output, lower capital and production costs and longer range. Our goals are to improve vehicle performance, decrease production costs and increase affordability and customer awareness. \nThese plans are subject to uncertainties inherent in establishing and ramping manufacturing operations, which may be exacerbated by new product and manufacturing technologies we introduce, the number of concurrent international projects, any industry-wide component constraints, labor shortages and any future impact from events outside of our control. For example, during the first quarter of 2024, we experienced a sequential decline in production volumes partially caused by the early phase of the production ramp of the updated Model 3 at our Fremont factory, and factory shutdowns at Gigafactory Berlin-Brandenburg resulting from shipping diversions caused by the Red Sea conflict and an arson attack. In the first quarter of 2025, as we launch our New Model Y worldwide, we may similarly experience delays or declines in production volumes due to simultaneous manufacturing ramps in facilities on three continents. Moreover, we have set ambitious technological targets with our plans for battery cells as well as for iterative manufacturing and design improvements for our vehicles with each new factory.\nAutomotive—Demand, Sales, Deliveries and Infrastructure\nOur cost reduction efforts, cost innovation strategies, and additional localized procurement and manufacturing are key to our vehicles’ affordability and have allowed us to competitively price our vehicles. We will also continue to generate demand by improving our vehicles’ performance and functionality, including through product offerings and features based on artificial intelligence such as Autopilot, FSD (Supervised), and other software, and delivering new vehicles and vehicle options, such as our launch of the updated Model 3 in 2024, and the New Model Y in the first quarter of 2025. In addition, we have been increasing awareness, and expanding our vehicle financing programs, including attractive leasing terms for our customers. \n33\nHowever, we operate in a cyclical industry that is sensitive to shifting consumer trends, political and regulatory uncertainty, including with respect to trade and the environment, all of which can be compounded by inflationary pressures, rising energy prices, interest rate fluctuations and the liquidity of enterprise customers. For example, as inflationary pressures increased across the markets in which we operate, central banks in developed countries raised interest rates rapidly and substantially, which impacted the affordability of vehicle lease and finance arrangements. Further, sales of vehicles in the automotive industry also tend to be cyclical in many markets, which may expose us to increased volatility as we expand and adjust our operations. Moreover, as additional competitors enter the marketplace and help bring the world closer to sustainable transportation, we will have to adjust and continue to execute well to maintain our momentum. Additionally, our suppliers’ liquidity and allocation plans may be affected by current challenges in the North American automotive industry, which could reduce our access to components or result in unfavorable changes to cost. These macroeconomic and industry trends have had, and will likely continue to have, an impact on the pricing of, and order rate for our vehicles, and in turn our operating margin. Changes in government and economic policies, incentives or tariffs may also impact our production, sales, cost structure and the competitive landscape. We will continue to adjust accordingly to such developments, and we believe our ongoing cost reduction, including improved production innovation and efficiency at our newest factories and lower logistics costs, and focus on operating leverage will continue to benefit us in relation to our competitors, while our new products will help enable future growth.\nAs our production increases, we must work constantly to similarly increase vehicle delivery capability so that it does not become a bottleneck on our total deliveries. We are also committed to reducing the percentage of vehicles delivered in the third month of each quarter, which will help to reduce the cost per vehicle. As we expand our manufacturing operations globally, we will also have to continue to increase and staff our delivery, servicing and charging infrastructure accordingly, maintain our vehicle reliability and optimize our Supercharger locations to ensure cost effectiveness and customer satisfaction. In particular, as other automotive manufacturers have announced their adoption of the North American Charging Standard (“NACS”) and agreements with us to utilize our Superchargers, we must correspondingly expand our network in order to ensure adequate availability to meet customer demands. We also remain focused on continued enhancements of the capability and efficiency of our servicing operations.\nEnergy Generation and Storage Demand, Production and Deployment\nThe long-term success of this business is dependent upon incremental volume growth. We continue to increase the production and capabilities of our energy storage products to meet high levels of demand, including the introduction of Powerwall 3 in 2024, and the ramps of our Megafactories in Shanghai and Lathrop, California. For Megapack, energy storage deployments can vary meaningfully quarter to quarter depending on the timing of specific project milestones and logistics. As these product lines grow, we will have to maintain adequate battery cell supply for our energy storage products. At the same time, changes in government and economic incentives or tariffs may also impact our sales, cost structure and the competitive landscape.\nCash Flow and Capital Expenditure Trends \nOur capital expenditures are typically difficult to project beyond the short-term given the number and breadth of our core projects at any given time, and may further be impacted by uncertainties in future global market conditions. We are simultaneously developing and ramping new products, building or ramping manufacturing facilities on three continents, piloting the development and manufacture of new battery cell technologies, expanding our Supercharger network and investing in autonomy and other artificial intelligence enabled training and products, and the pace of our capital spend may vary depending on overall priority among projects, the pace at which we meet milestones, production adjustments to and among our various products, increased capital efficiencies and the addition of new projects. Owing and subject to the foregoing as well as the pipeline of announced projects under development, all other continuing infrastructure growth and varying levels of inflation, we currently expect our capital expenditures to exceed $11.00 billion in 2025 and in each of the following two fiscal years.\nOur business has generally been consistently generating cash flow from operations in excess of our level of capital spend, and with better working capital management resulting in shorter days sales outstanding than days payable outstanding, our sales growth is also generally facilitating positive cash generation. We have and will continue to utilize such cash flows, among other things, to invest in autonomy, do more vertical integration, expand our product roadmap and provide financing options to our customers. At the same time, we are likely to see heightened levels of capital expenditures during certain periods depending on the specific pace of our capital-intensive projects and other potential variables such as rising material prices and increases in supply chain and labor expenses resulting from changes in global trade conditions and labor availability. Overall, we expect our ability to be self-funding to continue as long as macroeconomic factors support current trends in our sales.\n34\nCritical Accounting Policies and Estimates\nThe consolidated financial statements are prepared in accordance with accounting principles generally accepted in the U.S. (“GAAP”). The preparation of the consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, costs and expenses and related disclosures. We base our estimates on historical experience, as appropriate, and on various other assumptions that we believe to be reasonable under the circumstances. Changes in the accounting estimates are reasonably likely to occur from period to period. Accordingly, actual results could differ significantly from the estimates made by our management. We evaluate our estimates and assumptions on an ongoing basis. To the extent that there are material differences between these estimates and actual results, our future financial statement presentation, financial condition, results of operations and cash flows may be affected.\nThe estimates used for, but not limited to, determining significant economic incentive for resale value guarantee arrangements, sales return reserves, resale value guarantee liabilities, income tax, the collectability of accounts and finance receivables, inventory valuation, warranties, fair value of long-lived assets, goodwill, fair value of financial instruments, fair value and residual value of operating lease vehicles and solar energy systems subject to leases could be impacted. We have assessed the impact and are not aware of any specific events or circumstances that required an update to our estimates and assumptions or materially affected the carrying value of our assets or liabilities as of the date of issuance of this Annual Report on Form 10-K. These estimates may change as new events occur and additional information is obtained. Actual results could differ materially from these estimates under different assumptions or conditions.\nRevenue Recognition\nAutomotive Sales\nAutomotive sales revenue includes revenues related to cash and financing deliveries of new vehicles, and specific other features and services that meet the definition of a performance obligation under Accounting Standards Codification 606, \nRevenue from Contracts with Customers \n(“ASC 606”), including access to our FSD (Supervised) features and their ongoing maintenance, internet connectivity, free Supercharging programs and over-the-air software updates. We recognize revenue on automotive sales upon delivery to the customer, which is when the control of a vehicle transfers. Payments are typically received at the point control transfers or in accordance with payment terms customary to the business, except sales we finance for which payments are collected over the contractual loan term. We also recognize a sales return reserve based on historical experience plus consideration for expected future market values, when we offer resale value guarantees or similar buyback terms. Other features and services such as access to our internet connectivity, unlimited free Supercharging and over-the-air software updates are provisioned upon control transfer of a vehicle and recognized over time on a straight-line basis as we have a stand-ready obligation to deliver such services to the customer. Other limited free Supercharging incentives are recognized based on actual usage or expiration, whichever is earlier. We recognize revenue related to these other features and services over the performance period, which is generally the expected ownership life of the vehicle. Revenue related to FSD (Supervised) features is recognized when functionality is delivered to the customer and their ongoing maintenance is recognized over time. For our obligations related to automotive sales, we estimate standalone selling price by considering costs used to develop and deliver the service, third-party pricing of similar options and other information that may be available.\nInventory Valuation\nInventories are stated at the lower of cost or net realizable value. Cost is computed using standard cost for vehicles and energy products, which approximates actual cost on a first-in, first-out basis. We record inventory write-downs for excess or obsolete inventories based upon assumptions about current and future demand forecasts. If our inventory on-hand is in excess of our future demand forecast, the excess amounts are written-off.\nWe also review our inventory to determine whether its carrying value exceeds the net amount realizable upon the ultimate sale of the inventory. This requires us to determine the estimated selling price of our vehicles less the estimated cost to convert the inventory on-hand into a finished product. Once inventory is written-down, a new, lower cost basis for that inventory is established and subsequent changes in facts and circumstances do not result in the restoration or increase in that newly established cost basis.\nShould our estimates of future selling prices or production costs change, additional and potentially material write-downs may be required. A small change in our estimates may result in a material charge to our reported financial results.\n35\nWarranties\nWe provide a manufacturer’s warranty on all new and used vehicles and a warranty on the installation and components of the energy generation and storage systems we sell for periods typically between 10 to 25 years. We accrue a warranty reserve for the products sold by us, which includes our best estimate of the projected costs to repair or replace items under warranties and recalls if identified. These estimates are based on actual claims incurred to date and an estimate of the nature, frequency and costs of future claims. These estimates are inherently uncertain and changes to our historical or projected warranty experience may cause material changes to the warranty reserve in the future. The warranty reserve does not include projected warranty costs associated with our vehicles subject to operating lease accounting and our solar energy systems under lease contracts or PPAs, as the costs to repair these warranty claims are expensed as incurred. The portion of the warranty reserve expected to be incurred within the next 12 months is included within Accrued liabilities and other, while the remaining balance is included within Other long-term liabilities on the consolidated balance sheets. For liabilities that we are entitled to receive indemnification from our suppliers, we record receivables for the contractually obligated amounts on the consolidated balance sheets as a component of Prepaid expenses and other current assets for the current portion and as Other non-current assets for the long-term portion. Warranty expense is recorded as a component of Cost of revenues in the consolidated statements of operations. Due to the magnitude of our automotive business, our accrued warranty balance is primarily related to our automotive segment.\nStock-Based Compensation\nWe use the fair value method of accounting for our stock options and restricted stock units (“RSUs”) granted to employees and for our employee stock purchase plan (the “ESPP”) to measure the cost of employee services received in exchange for the stock-based awards. The fair value of stock option awards with only service and/or performance conditions is estimated on the grant or offering date using the Black-Scholes option-pricing model. The Black-Scholes option-pricing model requires inputs such as the risk-free interest rate, expected term and expected volatility. These inputs are subjective and generally require significant judgment. The fair value of RSUs is measured on the grant date based on the closing fair market value of our common stock. The resulting cost is recognized over the period during which an employee is required to provide service in exchange for the awards, usually the vesting period, which is generally four years for stock options and RSUs and six months for the ESPP. Stock-based compensation expense is recognized on a straight-line basis, net of actual forfeitures in the period.\nFor performance-based awards, stock-based compensation expense is recognized over the expected performance achievement period of individual performance milestones when the achievement of each individual performance milestone becomes probable. \nAs we accumulate additional employee stock-based awards data over time and as we incorporate market data related to our common stock, we may calculate significantly different volatilities and expected lives, which could materially impact the valuation of our stock-based awards and the stock-based compensation expense that we will recognize in future periods. Stock-based compensation expense is recorded in Cost of revenues, Research and development expense and Selling, general and administrative expense in the consolidated statements of operations.\nIncome Taxes\nWe are subject to income taxes in the U.S. and in many foreign jurisdictions. Significant judgment is required in determining our provision for income taxes, our deferred tax assets and liabilities and any valuation allowance recorded against our net deferred tax assets that are not more likely than not to be realized. We monitor the realizability of our deferred tax assets taking into account all relevant factors at each reporting period. In completing our assessment of realizability of our deferred tax assets, we consider our history of income (loss) measured at pre-tax income (loss) adjusted for permanent book-tax differences on a jurisdictional basis, volatility in actual earnings, excess tax benefits related to stock-based compensation in recent prior years, and impacts of the timing of reversal of existing temporary differences. We also rely on our assessment of the Company’s projected future results of business operations, including uncertainty in future operating results relative to historical results, volatility in the market price of our common stock and its performance over time, variable macroeconomic conditions impacting our ability to forecast future taxable income, and changes in business that may affect the existence and magnitude of future taxable income. Our valuation allowance assessment is based on our best estimate of future results considering all available information.\n36\nFurthermore, significant judgment is required in evaluating our tax positions. In the ordinary course of business, there are many transactions and calculations for which the ultimate tax settlement is uncertain. As a result, we recognize the effect of this uncertainty on our tax attributes or taxes payable based on our estimates of the eventual outcome. These effects are recognized when, despite our belief that our tax return positions are supportable, we believe that it is more likely than not that some of those positions may not be fully sustained upon review by tax authorities. We are required to file income tax returns in the U.S. and various foreign jurisdictions, which requires us to interpret the applicable tax laws and regulations in effect in such jurisdictions. Such returns are subject to audit by the various federal, state and foreign taxing authorities, who may disagree with respect to our tax positions. We believe that our consideration is adequate for all open audit years based on our assessment of many factors, including past experience and interpretations of tax law. We review and update our estimates in light of changing facts and circumstances, such as the closing of a tax audit, the lapse of a statute of limitations or a change in estimate. To the extent that the final tax outcome of these matters differs from our expectations, such differences may impact income tax expense in the period in which such determination is made.\nResults of Operations\nRevenues\n \nYear Ended December 31,\n2024 vs. 2023 Change\n2023 vs. 2022 Change\n(Dollars in millions)\n2024\n2023\n2022\n$\n%\n$\n%\nAutomotive sales\n$\n72,480 \n$\n78,509 \n$\n67,210 \n$\n(6,029)\n(8)\n%\n$\n11,299 \n17 \n%\nAutomotive regulatory credits\n2,763 \n1,790 \n1,776 \n973 \n54 \n%\n14 \n1 \n%\nAutomotive leasing\n1,827 \n2,120 \n2,476 \n(293)\n(14)\n%\n(356)\n(14)\n%\nTotal automotive revenues\n77,070 \n82,419 \n71,462 \n(5,349)\n(6)\n%\n10,957 \n15 \n%\nServices and other\n10,534 \n8,319 \n6,091 \n2,215 \n27 \n%\n2,228 \n37 \n%\nTotal automotive & services and other segment revenue\n87,604 \n90,738 \n77,553 \n(3,134)\n(3)\n%\n13,185 \n17 \n%\nEnergy generation and storage segment revenue\n10,086 \n6,035 \n3,909 \n4,051 \n67 \n%\n2,126 \n54 \n%\nTotal revenues\n$\n97,690 \n$\n96,773 \n$\n81,462 \n$\n917 \n1 \n%\n$\n15,311 \n19 \n%\nAutomotive & Services and Other Segment\nAutomotive sales revenue includes revenues related to cash and financing deliveries of new vehicles, including access to our FSD (Supervised) features and their ongoing maintenance, internet connectivity, free Supercharging programs and over-the-air software updates. These deliveries are vehicles that are not subject to lease accounting. \nAutomotive regulatory credits includes sales of regulatory credits to other automotive manufacturers. Our revenue from automotive regulatory credits is directly related to our new vehicle production, sales and pricing negotiated with our customers. We monetize them proactively as new vehicles are sold based on standing arrangements with buyers of such credits, typically as close as possible to the production and delivery of the vehicle or changes in regulation impacting the credits. \nAutomotive leasing revenue includes the amortization of revenue for vehicles under direct operating lease agreements. Additionally, automotive leasing revenue includes direct sales-type leasing programs where we recognize all revenue associated with the sales-type lease upon delivery to the customer.\nServices and other revenue consists of sales of used vehicles, non-warranty maintenance services and collision, part sales, paid Supercharging, insurance services revenue and retail merchandise sales.\n2024 compared to 2023\nAutomotive sales revenue decreased $6.03 billion, or 8%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023, primarily due to lower average selling price on our vehicles driven by overall price reductions and attractive financing options provided in 2024 as well as mix. Additionally, there was a decrease of approximately 22,000 combined Model 3 and Model Y cash deliveries. The decreases were partially offset by an increase of approximately 19,000 deliveries of other models primarily due to our production ramp of Cybertruck. Additionally, we recognized $596 million of FSD (Supervised) revenue due to release of certain features in 2024.\n37\nAutomotive regulatory credits revenue increased $973 million, or 54%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023, driven by demand for credits in North America as other automobile manufacturers scale back on their battery electric vehicle plans.\nAutomotive leasing revenue decreased $293 million, or 14%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023, primarily due to lower direct sales-type leasing deliveries as we have shifted towards providing leasing options through commercial banking partner programs that allow for us to recognize upfront revenue in automotive sales and a decrease in lease buyouts.\nServices and other revenue increased $2.22 billion, or 27%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023, primarily due to increases in sales of used vehicles, non-warranty maintenance services and collision revenue, paid Supercharging revenue, insurance services revenue and part sales revenue.\nEnergy Generation and Storage Segment\nEnergy generation and storage revenue includes sales and leasing of solar energy generation and energy storage products, financing of solar energy generation products, services related to such products and sales of solar energy systems incentives.\n2024 compared to 2023\nEnergy generation and storage revenue increased $4.05 billion, or 67%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023, primarily due to a 16.7 GWh increase in Megapack and Powerwall deployments compared to the prior year.\nCost of Revenues and Gross Margin\nYear Ended December 31,\n2024 vs. 2023 Change\n2023 vs. 2022 Change\n(Dollars in millions)\n2024\n2023\n2022\n$\n%\n$\n%\nCost of revenues\nAutomotive sales\n$\n61,870 \n$\n65,121 \n$\n49,599 \n$\n(3,251)\n(5)\n%\n$\n15,522 \n31 \n%\nAutomotive leasing\n1,003 \n1,268 \n1,509 \n(265)\n(21)\n%\n(241)\n(16)\n%\nTotal automotive cost of revenues\n62,873 \n66,389 \n51,108 \n(3,516)\n(5)\n%\n15,281 \n30 \n%\nServices and other\n9,921 \n7,830 \n5,880 \n2,091 \n27 \n%\n1,950 \n33 \n%\nTotal automotive & services and other segment cost of revenues\n72,794 \n74,219 \n56,988 \n(1,425)\n(2)\n%\n17,231 \n30 \n%\nEnergy generation and storage segment\n7,446 \n4,894 \n3,621 \n2,552 \n52 \n%\n1,273 \n35 \n%\nTotal cost of revenues\n$\n80,240 \n$\n79,113 \n$\n60,609 \n$\n1,127 \n1 \n%\n$\n18,504 \n31 \n%\nGross profit total automotive\n$\n14,197 \n$\n16,030 \n$\n20,354 \nGross margin total automotive\n18.4 \n%\n19.4 \n%\n28.5 \n%\nGross profit total automotive & services and other segment\n$\n14,810 \n$\n16,519 \n$\n20,565 \nGross margin total automotive & services and other segment\n16.9 \n%\n18.2 \n%\n26.5 \n%\nGross profit energy generation and storage segment\n$\n2,640 \n$\n1,141 \n$\n288 \nGross margin energy generation and storage segment\n26.2 \n%\n18.9 \n%\n7.4 \n%\nTotal gross profit\n$\n17,450 \n$\n17,660 \n$\n20,853 \nTotal gross margin\n17.9 \n%\n18.2 \n%\n25.6 \n%\n38\nAutomotive & Services and Other Segment\nCost of automotive sales revenue includes direct and indirect materials, labor costs, manufacturing overhead, including depreciation costs of tooling and machinery, shipping and logistic costs, vehicle connectivity costs, FSD (Supervised) ongoing maintenance costs, allocations of electricity and infrastructure costs related to our Supercharger network and reserves for estimated warranty expenses. Cost of automotive sales revenues also includes adjustments to warranty expense and charges to write down the carrying value of our inventory when it exceeds its estimated net realizable value and to provide for obsolete and on-hand inventory in excess of forecasted demand. Additionally, cost of automotive sales revenue benefits from manufacturing credits earned.\nCost of automotive leasing revenue includes the depreciation of operating lease vehicles, cost of goods sold associated with direct sales-type leases and warranty expense related to leased vehicles. \nCosts of services and other revenue includes cost of used vehicles including refurbishment costs, costs associated with providing non-warranty after-sales services, costs associated with our body shops and part sales, costs of paid Supercharging, costs to provide vehicle insurance and costs of retail merchandise sales.\n2024 compared to 2023\nCost of automotive sales revenue decreased $3.25 billion, or 5%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023 due to a decrease in the average combined cost per unit of our vehicles primarily from lower raw material costs, freight and duties as well as mix, in addition to the volume changes in deliveries year over year as discussed above. The decreases were partially offset by higher costs for Cybertruck.\nCost of automotive leasing revenue decreased $265 million, or 21%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023, primarily due to a decrease in direct sales-type leasing cost of revenue driven by lower deliveries and a decrease in our direct operating lease cost of revenue driven by lower lease buyouts compared to the prior periods.\nCost of services and other revenue increased $2.09 billion, or 27%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023, primarily due to volume increases in used vehicle sales at lower average vehicle acquisition cost, insurance services, paid Supercharging, part sales and non-warranty maintenance services and collision.\nGross margin for total automotive decreased from 19.4% to 18.4% in the year ended December 31, 2024 as compared to the year ended December 31, 2023 due to lower average selling price on our vehicles and Cybertruck ramp, partially offset by lower average combined cost per unit of our vehicles and increases in regulatory credit and FSD (Supervised) revenue, as discussed above.\nGross margin for total automotive & services and other segment decreased from 18.2% to 16.9% in the year ended December 31, 2024 as compared to the year ended December 31, 2023. The changes in gross margin are primarily due to the automotive gross margin factors discussed above.\nEnergy Generation and Storage Segment\nCost of energy generation and storage revenue includes direct and indirect material and labor costs, manufacturing overhead, including depreciation costs of tooling and machinery, freight, warranty expense, and cost of servicing. Cost of energy generation and storage revenue also includes charges to write down the carrying value of our inventory when it exceeds its estimated net realizable value and to provide for obsolete and on-hand inventory in excess of forecasted demand. Additionally, cost of energy generation and storage revenue benefits from manufacturing credits earned. In agreements for solar energy systems and PPAs where we are the lessor, the cost of revenue is primarily comprised of depreciation of the cost of leased solar energy systems, maintenance costs associated with those systems and amortization of any initial direct costs.\n2024 compared to 2023\nCost of energy generation and storage revenue increased $2.55 billion, or 52%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023, primarily due to increases in Megapack and Powerwall deployments, partially offset by increases in IRA manufacturing credits recognized as compared to the prior year.\n39\nGross margin for energy generation and storage increased from 18.9% to 26.2% in the year ended December 31, 2024 as compared to the year ended December 31, 2023, primarily due to margin improvements for our energy storage products driven by cost reductions, including benefits from IRA manufacturing credits, and a higher proportion of our storage business, which operated at a higher gross margin, within the segment as compared to the prior periods.\nResearch and Development Expense\nYear Ended December 31,\n2024 vs. 2023 Change\n2023 vs. 2022 Change\n(Dollars in millions)\n2024\n2023\n2022\n$\n%\n$\n%\nResearch and development\n$\n4,540 \n$\n3,969 \n$\n3,075 \n$\n571 \n14 \n%\n$\n894 \n29 \n%\nAs a percentage of revenues\n5 \n%\n4 \n%\n4 \n%\nResearch and development (“R&D”) expenses consist primarily of personnel costs for our teams in engineering and research, manufacturing engineering and manufacturing test organizations, prototyping expense, contract and professional services and amortized equipment expense.\nR&D expenses increased $571 million, or 14%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023. The overall increases were primarily driven by additional costs year over year related to AI programs. R&D expenses as a percentage of revenue increased from 4% to 5% in the year ended December 31, 2024 as compared to the year ended December 31, 2023 as we continue to expand our product roadmap and technologies.\nSelling, General and Administrative Expense\nYear Ended December 31,\n2024 vs. 2023 Change\n2023 vs. 2022 Change\n(Dollars in millions)\n2024\n2023\n2022\n$\n%\n$\n%\nSelling, general and administrative\n$\n5,150 \n$\n4,800 \n$\n3,946 \n$\n350 \n7 \n%\n$\n854 \n22 \n%\nAs a percentage of revenues\n5 \n%\n5 \n%\n5 \n%\nSelling, general and administrative (“SG&A”) expenses generally consist of personnel and facilities costs related to our stores, marketing, sales, executive, finance, human resources, information technology and legal organizations, as well as fees for professional and contract services and litigation settlements.\nSG&A expenses increased $350 million, or 7%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023 driven by a $171 million increase in facilities related expenses, a $115 million increase in employee and labor costs, including professional services and a $57 million increase in marketing expenses.\nRestructuring and Other\nYear Ended December 31,\n2024 vs. 2023 Change\n2023 vs. 2022 Change\n(Dollars in millions)\n2024\n2023\n2022\n$\n%\n$\n%\nRestructuring and other\n$\n684 \n$\n— \n$\n176 \n$\n684 \nNot meaningful\n$\n(176)\n(100)%\nIn the second quarter of 2024, we initiated and substantially completed certain restructuring actions to reduce costs and improve efficiency. As a result, we recognized $583 million of employee termination expenses in Restructuring and other in our consolidated income statement. These expenses were substantially paid with an immaterial accrual remaining in Accrued liabilities and other in our consolidated balance sheet as of December 31, 2024.\nInterest Income\nYear Ended December 31,\n2024 vs. 2023 Change\n2023 vs. 2022 Change\n(Dollars in millions)\n2024\n2023\n2022\n$\n%\n$\n%\nInterest income\n$\n1,569 \n$\n1,066 \n$\n297 \n$\n503 \n47 \n%\n$\n769 \n259 \n%\nInterest income increased $503 million, or 47%, in the year ended December 31, 2024 as compared to the year ended December 31, 2023, primarily due to higher interest earned on our cash and cash equivalents and short-term investments compared to the prior year due to an increase in our portfolio balance and a higher weighted average interest rate.\n40\nOther Income (Expense), Net\nYear Ended December 31,\n2024 vs. 2023 Change\n2023 vs. 2022 Change\n(Dollars in millions)\n2024\n2023\n2022\n$\n%\n$\n%\nOther income (expense), net\n$\n695 \n$\n172 \n$\n(43)\n$\n523 \n304%\n$\n215 \nNot meaningful\nOther income (expense), net, consists of foreign exchange gains and losses related to our foreign currency-denominated monetary assets and liabilities and fair value remeasurements of our digital assets following the adoption of ASU 2023-08 effective January 1, 2024. See Note 2, \nSummary of Significant Accounting Policies\n, to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K for further details.\nOther income (expense), net, changed favorably by $523 million in the year ended December 31, 2024 as compared to the year ended December 31, 2023 primarily due to remeasurement of our bitcoin digital assets to fair value in 2024 (see above), partially offset by unfavorable fluctuations in foreign currency exchange rates on our intercompany balances. As our intercompany balances are significant in nature and we do not typically hedge foreign currency risk, we can experience significant fluctuations in foreign currency exchange rate gains and losses from period to period.\nProvision for (Benefit from) Income Taxes\nYear Ended December 31,\n2024 vs. 2023 Change\n2023 vs. 2022 Change\n(Dollars in millions)\n2024\n2023\n2022\n$\n%\n$\n%\nProvision for (benefit from) income taxes\n$\n1,837 \n$\n(5,001)\n$\n1,132 \n$\n6,838 \nNot meaningful\n$\n(6,133)\nNot meaningful\nEffective tax rate\n20 \n%\n(50)\n%\n8 \n%\nOur provision for (benefit from) income taxes changed by $6.84 billion in the year ended December 31, 2024 as compared to the year ended December 31, 2023. Our effective tax rate changed to an expense of 20% in the year ended December 31, 2024 from a benefit of 50% in the year ended December 31, 2023. These changes are primarily due to the impact of releasing the valuation allowance on our U.S. deferred tax assets in the fourth quarter of 2023.\nWe monitor the realizability of our deferred tax assets taking into account all relevant factors at each reporting period. In the fourth quarter of 2023, based on the relevant weight of positive and negative evidence, including the amount of our taxable income in recent years which was objective and verifiable, and consideration of our expected future taxable earnings, we concluded that it is more likely than not that most of our U.S. federal and certain state deferred tax assets are realizable and released $6.54 billion of our valuation allowance. As of December 31, 2024, we continue to conclude that it is more likely than not that our deferred tax assets are realizable, except for our California deferred tax assets, U.S. foreign tax credits and certain foreign operating losses.\nSee Note 13, \nIncome Taxes\n, to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K for further details.\nLiquidity and Capital Resources\nWe expect to continue to generate net positive operating cash flow. The cash we generate from our core operations enables us to fund ongoing operations and production, our research and development projects for new products and technologies including our proprietary battery cells, additional manufacturing ramps at existing manufacturing facilities, the construction of future factories, and the continued expansion of our retail and service locations, body shops, Mobile Service fleet, Supercharger, including to support NACS, energy product installation capabilities and autonomy and other artificial intelligence enabled products.\nIn addition, because a large portion of our future expenditures will be to fund our growth, we expect that if needed we will be able to adjust our capital and operating expenditures by operating segment. For example, if our near-term manufacturing operations decrease in scale or ramp more slowly than expected, including due to global economic or business conditions, we may choose to correspondingly slow the pace of our capital expenditures. Finally, we continually evaluate our cash needs and may decide it is best to raise additional capital or seek alternative financing sources to fund the rapid growth of our business, including through drawdowns on existing or new debt facilities or financing funds. Conversely, we may also from time to time determine that it is in our best interests to voluntarily repay certain indebtedness early.\n41\nAccordingly, we believe that our current sources of funds will provide us with adequate liquidity during the 12-month period following December 31, 2024, as well as in the long-term.\nSee the sections below for more details regarding the material requirements for cash in our business and our sources of liquidity to meet such needs.\nMaterial Cash Requirements\nFrom time to time in the ordinary course of business, we enter into agreements with vendors for the purchase of components and raw materials to be used in the manufacture of our products. However, due to contractual terms, variability in the precise growth curves of our development and production ramps, and opportunities to renegotiate pricing, we generally do not have binding and enforceable purchase orders under such contracts beyond the short-term, and the timing and magnitude of purchase orders beyond such period is difficult to accurately project.\nAs discussed in and subject to the considerations referenced in Part II, Item 7, Management's Discussion and Analysis of Financial Condition and Results of Operations—Management Opportunities, Challenges and Uncertainties and 2025 Outlook—Cash Flow and Capital Expenditure Trends in this Annual Report on Form 10-K, we currently expect our capital expenditures to support our projects globally to exceed $11.00 billion in 2025 and in each of the following two fiscal years.\nAs of December 31, 2024, we and our subsidiaries had outstanding $7.91 billion in aggregate principal amount of indebtedness, of which $2.35 billion is current. As of December 31, 2024, our total minimum lease payments was $7.05 billion, of which $1.19 billion is due in the succeeding 12 months. For details regarding our indebtedness and lease obligations, refer to Note 10, \nDebt\n, and Note 11, \nLeases\n, to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nSources and Conditions of Liquidity\nOur sources to fund our material cash requirements are predominantly from our deliveries and servicing of new and used vehicles, sales and installations of our energy storage products, interest income, and proceeds from debt facilities and equity offerings, when applicable.\nAs of December 31, 2024, we had $16.14 billion and $20.42 billion of cash and cash equivalents and short-term investments, respectively. Balances held in foreign currencies had a U.S. dollar equivalent of $2.90 billion and consisted primarily of euros and Chinese yuan. We had $5.00 billion of unused committed credit amounts as of December 31, 2024. For details regarding our indebtedness, refer to Note 10, \nDebt\n, to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nWe continue adapting our strategy to meet our liquidity and risk objectives, such as investing in U.S. government securities and other investments, invest in autonomy, do more vertical integration, expand our product roadmap and provide financing options to our customers.\nSummary of Cash Flows\n \nYear Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nNet cash provided by operating activities\n$\n14,923 \n$\n13,256 \n$\n14,724 \nNet cash used in investing activities\n$\n(18,787)\n$\n(15,584)\n$\n(11,973)\nNet cash provided by (used in) financing activities\n$\n3,853 \n$\n2,589 \n$\n(3,527)\nCash Flows from Operating Activities\nOur cash flows from operating activities are significantly affected by our cash investments to support the growth of our business in areas such as research and development and selling, general and administrative and working capital. Our operating cash inflows include cash from vehicle sales and related servicing, customer lease and financing payments, customer deposits, cash from sales of regulatory credits and energy generation and storage products, and interest income on our cash and investments portfolio. These cash inflows are offset by our payments to suppliers for production materials and parts used in our manufacturing process, operating expenses, operating lease payments and interest payments on our financings.\n42\nNet cash provided by operating activities increased by $1.67 billion to $14.92 billion during the year ended December 31, 2024 from $13.26 billion during the year ended December 31, 2023. This increase was primarily due to favorable changes in net operating assets and liabilities of $2.29 billion, partially offset by a decrease in net income excluding non-cash expenses, gains and losses of $623 million.\nCash Flows from Investing Activities\nNet cash flows from investing activities and their variability across each period related primarily to capital expenditures, which were $11.34 billion and $8.90 billion for the years ended December 31, 2024 and 2023, respectively, mainly for AI-related capital expenditures, global factory expansion and machinery and equipment as we expand and enhance our product roadmap. We also purchased $7.45 billion and $6.62 billion of investments, net of proceeds from maturities and sales, for the years ended December 31, 2024 and 2023, respectively.\nCash Flows from Financing Activities\nNet cash flows from financing activities increased by $1.26 billion to $3.85 billion during the year ended December 31, 2024 from $2.59 billion during the year ended December 31, 2023. The increase was primarily due to a $1.81 billion increase in proceeds from issuances of debt, partially offset by a $1.15 billion increase in repayments of debt. See Note 10, \nDebt\n, to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K for further details regarding our debt obligations. Additionally, there was an increase of $541 million in proceeds from exercises of stock options and other stock issuances compared to the prior year.\nRecent Accounting Pronouncements\nSee Note 2, \nSummary of Significant Accounting Policies\n, to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\n43\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nForeign Currency Risk\nWe transact business globally in multiple currencies and hence have foreign currency risks related to our revenue, costs of revenue and operating expenses denominated in currencies other than the U.S. dollar (primarily the Chinese yuan and euro in relation to our current year operations). In general, we are a net receiver of currencies other than the U.S. dollar for our foreign subsidiaries. Accordingly, changes in exchange rates affect our operating results as expressed in U.S. dollars as we do not typically hedge foreign currency risk.\nWe have also experienced, and will continue to experience, fluctuations in our net income as a result of gains (losses) on the settlement and the re-measurement of monetary assets and liabilities denominated in currencies that are not the local currency (primarily consisting of our intercompany and cash and cash equivalents balances).\nWe considered the historical trends in foreign currency exchange rates and determined that it is reasonably possible that adverse changes in foreign currency exchange rates of 10% for all currencies could be experienced in the near-term. These changes were applied to our total monetary assets and liabilities denominated in currencies other than our local currencies at the balance sheet date to compute the impact these changes would have had on our net income before income taxes. These changes would have resulted in a gain or loss of $1.15 billion at December 31, 2024 and $1.01 billion at December 31, 2023, assuming no foreign currency hedging.\n44\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nIndex to Consolidated Financial Statements\nPage\nReport of Independent Registered Public Accounting Firm\n (PCAOB ID: \n238\n)\n46\nConsolidated Balance Sheets\n48\nConsolidated Statements of Operations\n49\nConsolidated Statements of Comprehensive Income\n50\nConsolidated Statements of Redeemable Noncontrolling Interests and Equity\n51\nConsolidated Statements of Cash Flows\n52\nNotes to Consolidated Financial Statements\n53\n45\nReport of Independent Registered Public Accounting Firm\nTo the\n \nBoard of Directors and Stockholders of Tesla, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Tesla, Inc. and its subsidiaries (the \"Company\") as of December 31, 2024 and 2023, and the related consolidated statements of operations, of comprehensive income, of redeemable noncontrolling interests and equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes (collectively referred to as the \"consolidated financial statements\"). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nChange in Accounting Principle\nAs discussed in Note 2 to the consolidated financial statements, the Company changed the manner in which it accounts for digital assets in 2024.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management’s Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\n46\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAutomotive Warranty Reserve\nAs described in Note 2 to the consolidated financial statements, total accrued warranty, which primarily relates to the automotive segment, was $6,716 million as of December 31, 2024. The Company provides a manufacturer’s warranty on all new and used Tesla vehicles. A warranty reserve is accrued for these products sold, which includes management’s best estimate of the projected costs to repair or replace items under warranty and recalls if identified. These estimates are based on actual claims incurred to date and an estimate of the nature, frequency and costs of future claims. \nThe principal considerations for our determination that performing procedures relating to the automotive warranty reserve is a critical audit matter are (i) the significant judgment by management in determining the automotive warranty reserve for certain Tesla vehicle models; (ii) a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating management’s significant assumptions related to the nature, frequency and costs of future claims for certain Tesla vehicle models; and, (iii) the audit effort involved the use of professionals with specialized skill and knowledge. \nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management’s estimate of the automotive warranty reserve for certain Tesla vehicle models, including controls over management’s significant assumptions related to the nature, frequency and costs of future claims as well as the completeness and accuracy of actual claims incurred to date. These procedures also included, among others, (i) testing the completeness and accuracy of historical vehicle claims processed and testing that such claims were appropriately used by management in the estimation of future claims and (ii) the involvement of professionals with specialized skill and knowledge to assist in evaluating the reasonableness of management’s estimate by (a) developing an independent estimate of the automotive warranty reserve for certain Tesla vehicle models and (b) comparing the independent estimate to management’s estimate. Developing the independent estimate involved evaluating the appropriateness of certain aspects of management’s significant assumptions related to the nature and frequency of future claims.\n/s/ \nPricewaterhouseCoopers LLP\nSan Jose, California\nJanuary 29, 2025\nWe have served as the Company’s auditor since 2005.\n47\nTesla, Inc.\nConsolidated Balance Sheets\n(in millions, except per share data)\nDecember 31,\n2024\nDecember 31,\n2023\nAssets\nCurrent assets\nCash and cash equivalents\n$\n16,139\n \n$\n16,398\n \nShort-term investments\n20,424\n \n12,696\n \nAccounts receivable, net\n4,418\n \n3,508\n \nInventory\n12,017\n \n13,626\n \nPrepaid expenses and other current assets\n5,362\n \n3,388\n \nTotal current assets\n58,360\n \n49,616\n \nOperating lease vehicles, net\n5,581\n \n5,989\n \nSolar energy systems, net\n4,924\n \n5,229\n \nProperty, plant and equipment, net\n35,836\n \n29,725\n \nOperating lease right-of-use assets\n5,160\n \n4,180\n \nDigital assets, net\n1,076\n \n184\n \nIntangible assets, net\n150\n \n178\n \nGoodwill\n244\n \n253\n \nDeferred tax assets\n6,524\n \n6,733\n \nOther non-current assets\n4,215\n \n4,531\n \nTotal assets\n$\n122,070\n \n$\n106,618\n \nLiabilities\nCurrent liabilities\nAccounts payable\n$\n12,474\n \n$\n14,431\n \nAccrued liabilities and other\n10,723\n \n9,080\n \nDeferred revenue\n3,168\n \n2,864\n \nCurrent portion of debt and finance leases\n2,456\n \n2,373\n \nTotal current liabilities\n28,821\n \n28,748\n \nDebt and finance leases, net of current portion\n5,757\n \n2,857\n \nDeferred revenue, net of current portion\n3,317\n \n3,251\n \nOther long-term liabilities\n10,495\n \n8,153\n \nTotal liabilities\n48,390\n \n43,009\n \nCommitments and contingencies (Note 14)\nRedeemable noncontrolling interests in subsidiaries\n63\n \n242\n \nEquity\nStockholders’ equity\nPreferred stock; $\n0.001\n par value; \n100\n shares authorized; \nno\n shares issued and outstanding\n—\n \n—\n \nCommon stock; $\n0.001\n par value; \n6,000\n shares authorized; \n3,216\n and \n3,185\n shares issued and outstanding as of December 31, 2024 and December 31, 2023, respectively\n3\n \n3\n \nAdditional paid-in capital\n38,371\n \n34,892\n \nAccumulated other comprehensive loss\n(\n670\n)\n(\n143\n)\nRetained earnings\n35,209\n \n27,882\n \nTotal stockholders’ equity\n72,913\n \n62,634\n \nNoncontrolling interests in subsidiaries\n704\n \n733\n \nTotal liabilities and equity\n$\n122,070\n \n$\n106,618\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n48\nTesla, Inc.\nConsolidated Statements of Operations\n(in millions, except per share data)\nYear Ended December 31,\n2024\n2023\n2022\nRevenues\nAutomotive sales\n$\n72,480\n \n$\n78,509\n \n$\n67,210\n \nAutomotive regulatory credits\n2,763\n \n1,790\n \n1,776\n \nAutomotive leasing\n1,827\n \n2,120\n \n2,476\n \nTotal automotive revenues\n77,070\n \n82,419\n \n71,462\n \nEnergy generation and storage\n10,086\n \n6,035\n \n3,909\n \nServices and other\n10,534\n \n8,319\n \n6,091\n \nTotal revenues\n97,690\n \n96,773\n \n81,462\n \nCost of revenues\nAutomotive sales\n61,870\n \n65,121\n \n49,599\n \nAutomotive leasing\n1,003\n \n1,268\n \n1,509\n \nTotal automotive cost of revenues\n62,873\n \n66,389\n \n51,108\n \nEnergy generation and storage\n7,446\n \n4,894\n \n3,621\n \nServices and other\n9,921\n \n7,830\n \n5,880\n \nTotal cost of revenues\n80,240\n \n79,113\n \n60,609\n \nGross profit\n17,450\n \n17,660\n \n20,853\n \nOperating expenses\nResearch and development\n4,540\n \n3,969\n \n3,075\n \nSelling, general and administrative\n5,150\n \n4,800\n \n3,946\n \nRestructuring and other\n684\n \n—\n \n176\n \nTotal operating expenses\n10,374\n \n8,769\n \n7,197\n \nIncome from operations\n7,076\n \n8,891\n \n13,656\n \nInterest income\n1,569\n \n1,066\n \n297\n \nInterest expense\n(\n350\n)\n(\n156\n)\n(\n191\n)\nOther income (expense), net\n695\n \n172\n \n(\n43\n)\nIncome before income taxes\n8,990\n \n9,973\n \n13,719\n \nProvision for (benefit from) income taxes\n1,837\n \n(\n5,001\n)\n1,132\n \nNet income\n7,153\n \n14,974\n \n12,587\n \nNet income (loss) attributable to noncontrolling interests and redeemable noncontrolling interests in subsidiaries\n62\n \n(\n23\n)\n31\n \nNet income attributable to common stockholders\n$\n7,091\n \n$\n14,997\n \n$\n12,556\n \n \nNet income per share of common stock attributable to common stockholders\nBasic\n$\n2.23\n \n$\n4.73\n \n$\n4.02\n \nDiluted\n$\n2.04\n \n$\n4.30\n \n$\n3.62\n \nWeighted average shares used in computing net income per share of common stock\nBasic\n3,197\n3,174\n3,130\nDiluted\n3,498\n3,485\n3,475\nThe accompanying notes are an integral part of these consolidated financial statements.\n49\nTesla, Inc.\nConsolidated Statements of Comprehensive Income\n(in millions)\nYear Ended December 31,\n2024\n2023\n2022\nNet income\n$\n7,153\n \n$\n14,974\n \n$\n12,587\n \nOther comprehensive income (loss):\nForeign currency translation adjustment\n(\n539\n)\n198\n \n(\n392\n)\nUnrealized net gain (loss) on investments, net of tax\n12\n \n16\n \n(\n23\n)\nNet loss realized and included in net income    \n—\n \n4\n \n—\n \nComprehensive income\n6,626\n \n15,192\n \n12,172\n \nLess: Comprehensive income (loss) attributable to noncontrolling interests and redeemable noncontrolling interests in subsidiaries\n62\n \n(\n23\n)\n31\n \nComprehensive income attributable to common stockholders\n$\n6,564\n \n$\n15,215\n \n$\n12,141\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n50\nTesla, Inc.\nConsolidated Statements of Redeemable Noncontrolling Interests and Equity\n(in millions)\nRedeemable\nNoncontrolling\nInterests \nCommon Stock\nAdditional\nPaid-In\nCapital\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nRetained\nEarnings\nTotal\nStockholders’\nEquity\nNoncontrolling\nInterests in\nSubsidiaries\nTotal\nEquity\nShares\nAmount\nBalance as of December 31, 2021\n$\n568\n \n3,100\n$\n3\n \n$\n29,803\n \n$\n54\n \n$\n329\n \n$\n30,189\n \n$\n826\n \n$\n31,015\n \nSettlements of warrants\n— \n37\n— \n— \n— \n— \n— \n— \n— \nIssuance of common stock for equity incentive awards\n— \n27\n— \n541\n \n— \n— \n541\n \n— \n541\n \nStock-based compensation\n— \n—\n— \n1,806\n \n— \n— \n1,806\n \n— \n1,806\n \nDistributions to noncontrolling interests\n(\n46\n)\n—\n— \n— \n— \n— \n— \n(\n113\n)\n(\n113\n)\nBuy-outs of noncontrolling interests\n(\n11\n)\n—\n— \n27\n \n— \n— \n27\n \n(\n61\n)\n(\n34\n)\nNet (loss) income\n(\n102\n)\n—\n— \n— \n— \n12,556\n \n12,556\n \n133\n \n12,689\n \nOther comprehensive loss\n— \n—\n— \n— \n(\n415\n)\n— \n(\n415\n)\n— \n(\n415\n)\nBalance as of December 31, 2022\n$\n409\n \n3,164\n$\n3\n \n$\n32,177\n \n$\n(\n361\n)\n$\n12,885\n \n$\n44,704\n \n$\n785\n \n$\n45,489\n \nIssuance of common stock for equity incentive awards\n— \n21\n— \n700\n \n— \n— \n700\n \n— \n700\n \nStock-based compensation\n— \n—\n— \n2,013\n \n— \n— \n2,013\n \n— \n2,013\n \nDistributions to noncontrolling interests\n(\n32\n)\n—\n— \n— \n— \n— \n— \n(\n108\n)\n(\n108\n)\nBuy-outs of noncontrolling interests\n(\n39\n)\n—\n— \n2\n \n— \n— \n2\n \n(\n17\n)\n(\n15\n)\nNet (loss) income\n(\n96\n)\n—\n— \n— \n— \n14,997\n \n14,997\n \n73\n \n15,070\n \nOther comprehensive income\n— \n—\n— \n— \n218\n \n— \n218\n \n— \n218\n \nBalance as of December 31, 2023\n$\n242\n \n3,185\n$\n3\n \n$\n34,892\n \n$\n(\n143\n)\n$\n27,882\n \n$\n62,634\n \n$\n733\n \n$\n63,367\n \nAdjustments for prior periods from adopting ASU 2023-08, net of tax\n— \n—\n— \n— \n— \n236\n \n236\n \n— \n236\n \nSettlements of warrants\n— \n11\n— \n— \n— \n— \n— \n— \n— \nIssuance of common stock for equity incentive awards\n— \n20\n— \n1,241\n \n— \n— \n1,241\n \n— \n1,241\n \nStock-based compensation\n— \n—\n— \n2,199\n \n— \n— \n2,199\n \n— \n2,199\n \nDistributions to noncontrolling interests\n(\n13\n)\n—\n— \n— \n— \n— \n— \n(\n85\n)\n(\n85\n)\nBuy-outs of noncontrolling interests\n(\n172\n)\n—\n— \n39\n \n— \n— \n39\n \n— \n39\n \nNet income\n6\n \n—\n— \n— \n— \n7,091\n \n7,091\n \n56\n \n7,147\n \nOther comprehensive loss\n— \n—\n— \n— \n(\n527\n)\n— \n(\n527\n)\n— \n(\n527\n)\nBalance as of December 31, 2024\n$\n63\n \n3,216\n$\n3\n \n$\n38,371\n \n$\n(\n670\n)\n$\n35,209\n \n$\n72,913\n \n$\n704\n \n$\n73,617\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n51\nTesla, Inc.\nConsolidated Statements of Cash Flows\n(in millions)\nYear Ended December 31,\n2024\n2023\n2022\nCash Flows from Operating Activities\nNet income\n$\n7,153\n \n$\n14,974\n \n$\n12,587\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation, amortization and impairment\n5,368\n \n4,667\n \n3,747\n \nStock-based compensation\n1,999\n \n1,812\n \n1,560\n \nInventory and purchase commitments write-downs\n335\n \n463\n \n177\n \nForeign currency transaction net unrealized (gain) loss\n(\n73\n)\n(\n144\n)\n81\n \nDeferred income taxes\n477\n \n(\n6,349\n)\n(\n196\n)\nNon-cash interest and other operating activities\n172\n \n81\n \n340\n \nDigital assets (gain) loss, net\n(\n589\n)\n—\n \n140\n \nChanges in operating assets and liabilities:\nAccounts receivable\n(\n1,083\n)\n(\n586\n)\n(\n1,124\n)\nInventory\n937\n \n(\n1,195\n)\n(\n6,465\n)\nOperating lease vehicles\n(\n590\n)\n(\n1,952\n)\n(\n1,570\n)\nPrepaid expenses and other assets\n(\n3,273\n)\n(\n2,652\n)\n(\n3,713\n)\nAccounts payable, accrued and other liabilities\n3,588\n \n2,605\n \n8,029\n \nDeferred revenue\n502\n \n1,532\n \n1,131\n \nNet cash provided by operating activities\n14,923\n \n13,256\n \n14,724\n \nCash Flows from Investing Activities\nPurchases of property and equipment excluding finance leases, net of sales\n(\n11,339\n)\n(\n8,898\n)\n(\n7,158\n)\nPurchases of solar energy systems, net of sales\n(\n3\n)\n(\n1\n)\n(\n5\n)\nProceeds from sales of digital assets\n—\n \n—\n \n936\n \nPurchase of intangible assets\n—\n \n—\n \n(\n9\n)\nPurchases of investments\n(\n35,955\n)\n(\n19,112\n)\n(\n5,835\n)\nProceeds from maturities of investments\n28,310\n \n12,353\n \n22\n \nProceeds from sales of investments\n200\n \n138\n \n—\n \nReceipt of government grants\n—\n \n—\n \n76\n \nBusiness combinations, net of cash acquired\n—\n \n(\n64\n)\n—\n \nNet cash used in investing activities\n(\n18,787\n)\n(\n15,584\n)\n(\n11,973\n)\nCash Flows from Financing Activities\nProceeds from issuances of debt\n5,744\n \n3,931\n \n—\n \nRepayments of debt\n(\n2,500\n)\n(\n1,351\n)\n(\n3,364\n)\nProceeds from exercises of stock options and other stock issuances\n1,241\n \n700\n \n541\n \nPrincipal payments on finance leases\n(\n381\n)\n(\n464\n)\n(\n502\n)\nDebt issuance costs\n(\n14\n)\n(\n29\n)\n—\n \nDistributions paid to noncontrolling interests in subsidiaries\n(\n104\n)\n(\n144\n)\n(\n157\n)\nPayments for buy-outs of noncontrolling interests in subsidiaries\n(\n133\n)\n(\n54\n)\n(\n45\n)\nNet cash provided by (used in) financing activities\n3,853\n \n2,589\n \n(\n3,527\n)\nEffect of exchange rate changes on cash and cash equivalents and restricted cash\n(\n141\n)\n4\n \n(\n444\n)\nNet (decrease) increase in cash and cash equivalents and restricted cash\n(\n152\n)\n265\n \n(\n1,220\n)\nCash and cash equivalents and restricted cash, beginning of period\n17,189\n \n16,924\n \n18,144\n \nCash and cash equivalents and restricted cash, end of period\n$\n17,037\n \n$\n17,189\n \n$\n16,924\n \nSupplemental Non-Cash Investing and Financing Activities\nAcquisitions of property and equipment included in liabilities\n$\n1,410\n \n$\n2,272\n \n$\n2,148\n \nSupplemental Disclosures\nCash paid during the period for interest\n$\n277\n \n$\n126\n \n$\n152\n \nCash paid during the period for income taxes, net of refunds\n$\n1,331\n \n$\n1,119\n \n$\n1,203\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n52\nTesla, Inc. \nNotes to Consolidated Financial Statements\nNote 1 – \nOverview\nTesla, Inc. (“Tesla”, the “Company”, “we”, “us” or “our”) was incorporated in the State of Delaware on July 1, 2003 and converted to a Texas corporation on June 13, 2024. We design, develop, manufacture, sell and lease high-performance fully electric vehicles and energy generation and storage systems, and offer services related to our products.\nNote 2 – \nSummary of Significant Accounting Policies\nPrinciples of Consolidation\nThe accompanying consolidated financial statements have been prepared in conformity with GAAP and reflect our accounts and operations and those of our subsidiaries in which we have a controlling financial interest. In accordance with the provisions of ASC 810, \nConsolidation \n(“ASC 810”), we consolidate any variable interest entity (“VIE”) of which we are the primary beneficiary. We have formed VIEs with financing fund investors in the ordinary course of business in order to facilitate the funding and monetization of certain attributes associated with solar energy systems and leases under our direct vehicle leasing programs. The typical condition for a controlling financial interest ownership is holding a majority of the voting interests of an entity; however, a controlling financial interest may also exist in entities, such as VIEs, through arrangements that do not involve controlling voting interests. ASC 810 requires a variable interest holder to consolidate a VIE if that party has the power to direct the activities of the VIE that most significantly impact the VIE’s economic performance and the obligation to absorb losses of the VIE that could potentially be significant to the VIE or the right to receive benefits from the VIE that could potentially be significant to the VIE. We do not consolidate a VIE in which we have a majority ownership interest when we are not considered the primary beneficiary. We have determined that we are the primary beneficiary of all the VIEs (see Note 15\n, Variable Interest Entity Arrangements\n). We evaluate our relationships with all the VIEs on an ongoing basis to ensure that we continue to be the primary beneficiary. All intercompany transactions and balances have been eliminated upon consolidation.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, costs and expenses and related disclosures in the accompanying notes. The estimates used for, but not limited to, determining significant economic incentive for resale value guarantee arrangements, sales return reserves, resale value guarantee liabilities, income taxes, the collectability of accounts and finance receivables, inventory valuation, warranties, fair value of long-lived assets, goodwill, fair value of financial instruments, fair value and residual value of operating lease vehicles and solar energy systems subject to leases could be impacted. We have assessed the impact and are not aware of any specific events or circumstances that required an update to our estimates and assumptions or materially affected the carrying value of our assets or liabilities as of the date of issuance of this Annual Report on Form 10-K. These estimates may change as new events occur and additional information is obtained. Actual results could differ materially from these estimates under different assumptions or conditions.\nReclassifications\nCertain prior period balances have been reclassified to conform to the current period presentation in the consolidated financial statements and the accompanying notes.\n53\nRevenue Recognition\nRevenue by source\nThe following table disaggregates our revenue by major source (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nAutomotive sales\n$\n72,480\n \n$\n78,509\n \n$\n67,210\n \nAutomotive regulatory credits\n2,763\n \n1,790\n \n1,776\n \nEnergy generation and storage sales\n9,564\n \n5,515\n \n3,376\n \nServices and other\n10,534\n \n8,319\n \n6,091\n \nTotal revenues from sales and services\n95,341\n \n94,133\n \n78,453\n \nAutomotive leasing\n1,827\n \n2,120\n \n2,476\n \nEnergy generation and storage leasing\n522\n \n520\n \n533\n \nTotal revenues\n$\n97,690\n \n$\n96,773\n \n$\n81,462\n \nAutomotive Segment\nAutomotive Sales\nAutomotive sales revenue includes revenues related to cash and financing deliveries of new vehicles, and specific other features and services that meet the definition of a performance obligation under ASC 606, including access to our FSD(Supervised) features and their ongoing maintenance, internet connectivity, free Supercharging programs and over-the-air software updates. We recognize revenue on automotive sales upon delivery to the customer, which is when the control of a vehicle transfers. Payments are typically received at the point control transfers or in accordance with payment terms customary to the business, except sales we finance for which payments are collected over the contractual loan term. We also recognize a sales return reserve based on historical experience plus consideration for expected future market values, when we offer resale value guarantees or similar buyback terms. Other features and services such as access to our internet connectivity, unlimited free Supercharging and over-the-air software updates are provisioned upon control transfer of a vehicle and recognized over time on a straight-line basis as we have a stand-ready obligation to deliver such services to the customer. Other limited free Supercharging incentives are recognized based on actual usage or expiration, whichever is earlier. We recognize revenue related to these other features and services over the performance period, which is generally the expected ownership life of the vehicle. Revenue related to FSD (Supervised) features is recognized when functionality is delivered to the customer and their ongoing maintenance is recognized over time. For our obligations related to automotive sales, we estimate standalone selling price by considering costs used to develop and deliver the service, third-party pricing of similar options and other information that may be available.\nAny fees that are paid or payable by us to a customer’s lender when we arrange the financing are recognized upfront as an offset against automotive sales revenue. Costs to obtain a contract mainly relate to commissions for the sale of vehicles. As our contract costs related to automotive sales are typically fulfilled within one year, the costs to obtain a contract are expensed as incurred. Amounts billed to customers related to shipping and handling are classified as automotive sales revenue, and we have elected to recognize the cost for freight and shipping when control over vehicles, parts or accessories have transferred to the customer as an expense in cost of automotive sales revenue. Our policy is to exclude taxes collected from a customer from the transaction price of automotive contracts.\nWe offer resale value guarantees to our commercial banking partners in connection with certain vehicle leasing programs. Under these programs, we originate the lease with our end customer and immediately transfer the lease and the underlying vehicle to our commercial banking partner, with the transaction being accounted for as a sale under ASC 606.\n54\nWe receive upfront payment for the vehicle, do not bear casualty and credit risks during the lease term, and we provide a guarantee capped to a limit if they are unable to sell the vehicle at or above the vehicle’s contractual or determined residual value at the end of the lease term. We estimate a guarantee liability in accordance with ASC 460, \nGuarantees\n and record it within other liabilities on our consolidated balance sheet. On a quarterly basis, we assess the estimated market value of vehicles sold under these programs to determine whether there have been changes to the amount of expected resale value guarantee liabilities. As we accumulate more data related to the resale values of our vehicles or as market conditions change, there may be material changes to their estimated values. The total recorded guarantee liabilities on vehicles sold under these programs were immaterial as of December 31, 2024 and 2023. Our maximum exposure on the guarantees we provide if they are unable to sell the vehicle at or above the vehicle’s contractual residual value at the end of the lease term was $\n1.45\n billion and $\n166\n million as of December 31, 2024 and 2023, respectively.\nDeferred revenue related to the access to our FSD (Supervised) features and their ongoing maintenance, internet connectivity, free Supercharging programs and over-the-air software updates primarily on automotive sales consisted of the following (in millions):\nYear Ended December 31,\n2024\n2023\nDeferred revenue — beginning of period\n$\n3,536\n \n$\n2,913\n \nAdditions\n1,343\n \n1,201\n \nNet changes in liability for pre-existing contracts, \n   including foreign exchange impact\n(\n92\n)\n17\n \nRevenue recognized\n(\n1,188\n)\n(\n595\n)\nDeferred revenue — end of period\n$\n3,599\n \n$\n3,536\n \nDeferred revenue is equivalent to the total transaction price allocated to the performance obligations that are unsatisfied, or partially unsatisfied, as of the balance sheet date. Revenue recognized from the deferred revenue balance as of December 31, 2023 and 2022 was $\n872\n million and $\n469\n million for the years ended December 31, 2024 and 2023, respectively. Of the total deferred revenue balance as of December 31, 2024, we expect to recognize $\n840\n million of revenue in the next \n12\n months. The remaining balance will be recognized at the time of transfer of control of the product or over the performance period as discussed above in Automotive Sales.\nWe have financing receivables on our consolidated balance sheets related to loans we provide for financing our automotive deliveries. As of December 31, 2024 and 2023, we had current net financing receivables of $\n247\n million and $\n242\n million, respectively, in Accounts receivable, net, and $\n821\n million and $\n1.04\n billion, respectively, in Other non-current assets for the long-term portion.\nAutomotive Regulatory Credits\nWe earn tradable credits in the operation of our automotive business under various regulations related to ZEVs, greenhouse gas, fuel economy and clean fuel. We sell these credits to other regulated entities who can use the credits to comply with emission standards and other regulatory requirements.\nPayments for automotive regulatory credits are typically received at the point control transfers to the customer, or in accordance with payment terms customary to the business. We recognize revenue on the sale of automotive regulatory credits, which have negligible incremental costs associated with them, at the time control of the regulatory credits is transferred to the purchasing party. Deferred revenue related to sales of automotive regulatory credits was immaterial as of December 31, 2024 and 2023. Revenue recognized from the deferred revenue balance as of December 31, 2023 and 2022 was immaterial for the years ended December 31, 2024 and 2023. During the year ended December 31, 2022, we had also recognized $\n288\n million in revenue due to changes in regulation which entitled us to additional consideration for credits sold previously. We have elected the practical expedient to omit disclosure of the amount of the transaction price allocated to remaining performance obligations for contracts with an original expected contract length of one year or less. As of December 31, 2024, total transaction price allocated to performance obligations that were unsatisfied or partially unsatisfied for contracts with an original expected length of more than one year was $\n4.68\n billion. Of this amount, we expect to recognize $\n863\n million in the next \n12\n months and the rest over the remaining performance obligation period. Additionally, changes in regulations on automotive regulatory credits may significantly impact our remaining performance obligations and revenue to be recognized under these contracts.\n55\nAutomotive Leasing Revenue\nDirect Vehicle Operating Leasing Program\nWe have outstanding leases under our direct vehicle operating leasing programs in the U.S., Canada and in certain countries in Europe. Qualifying customers are permitted to lease a vehicle directly from Tesla for up to \n48\n months. At the end of the lease term, customers may opt to return the vehicles to us or purchase the vehicles when contractually permitted. We account for these leasing transactions as operating leases. We record leasing revenues to \nautomotive leasing revenue\n on a straight-line basis over the contractual term, and we record the depreciation of these vehicles to cost of automotive leasing revenue. For the years ended December 31, 2024, 2023 and 2022, we recognized $\n1.78\n billion, $\n1.86\n billion and $\n1.75\n billion of direct vehicle leasing revenue, respectively. As of December 31, 2024 and 2023, we had deferred $\n394\n million and $\n458\n million, respectively, of lease-related upfront payments, which will be recognized on a straight-line basis over the contractual terms of the individual leases.\nOur policy is to exclude taxes collected from a customer from the transaction price of automotive contracts.\nDirect Sales-Type Leasing Program\nWe have outstanding direct leases and vehicles financed by us under loan arrangements accounted for as sales-type leases under ASC 842, \nLeases \n(“ASC 842”), in certain countries in Asia and Europe. Our arrangements under these programs can have terms for up to \n72\n months. We recognize all revenue and costs associated with the sales-type lease as automotive leasing revenue and automotive leasing cost of revenue, respectively, upon delivery of the vehicle to the customer. Interest income based on the implicit rate in the lease is recorded to automotive leasing revenue over time as customers are invoiced on a monthly basis. For the years ended December 31, 2024, 2023 and 2022, we recognized $\n12\n million, $\n215\n million and $\n683\n million, respectively, of sales-type leasing revenue and $\n7\n million, $\n164\n million and $\n427\n million, respectively, of sales-type leasing cost of revenue.\nServices and Other Revenue\nServices and other revenue consists of sales of used vehicles, non-warranty maintenance services and collision, part sales, paid Supercharging, insurance services revenue and retail merchandise sales.\nRevenues related to repair, maintenance and vehicle insurance services are recognized over time as services are provided and extended service plans are recognized over the performance period of the service contract as the obligation represents a stand-ready obligation to the customer. We sell used vehicles, services, service plans, vehicle components and merchandise separately and thus use standalone selling prices as the basis for revenue allocation to the extent that these items are sold in transactions with other performance obligations. Payment for used vehicles, services, vehicle components, and merchandise are typically received at the point when control transfers to the customer or in accordance with payment terms customary to the business. Payments received for prepaid plans are refundable upon customer cancellation of the related contracts and are included within Accrued liabilities and other on the consolidated balance sheets. We record in Deferred revenue any non-refundable prepayment amounts that are collected from customers and unearned insurance premiums, which is recognized as revenue ratably over the respective customer contract term. Deferred revenue excluding unearned insurance premiums was not material as of December 31, 2024 and 2023.\nEnergy Generation and Storage Segment\nEnergy Generation and Storage Sales\nEnergy generation and storage sales revenue consists of the sale of solar energy systems and energy storage systems to residential, small commercial, large commercial and utility grade customers. Sales of solar energy systems to residential and small-scale commercial customers consist of the engineering, design and installation of the system. Residential and small-scale commercial customers pay the full purchase price of the solar energy system upfront. Revenue for the design and installation obligation is recognized when control transfers, which is when we install a solar energy system and the system passes inspection by the utility or the authority having jurisdiction. Sales of energy storage systems to residential and small-scale commercial customers consist of the installation of the energy storage system and revenue is recognized when control transfers, which is when the product has been delivered or, if we are performing installation, when installed and commissioned. Payment for such storage systems is made upon invoice or in accordance with payment terms customary to the business.\n56\nFor certain large commercial and utility grade energy storage system sales which consist of the engineering, design and installation of the system, customers make milestone payments that are consistent with contract-specific phases of a project. Revenue from such contracts is recognized over time using the percentage of completion method based on cost incurred as a percentage of total estimated contract costs for energy storage system sales. \nIn instances where there are multiple performance obligations in a single contract, we allocate the consideration to the various obligations in the contract based on the relative standalone selling price method. Standalone selling prices are estimated based on estimated costs plus margin or by using market data for comparable products. Costs to obtain a contract relate mainly to commissions paid to our sales personnel related to the sale of energy storage systems. As our contract costs related to energy storage system sales are typically fulfilled within one year, the costs to obtain a contract are expensed as incurred.\nAs part of certain energy storage system contracts, we may provide the customer with performance guarantees that warrant that the underlying system will meet or exceed the minimum energy performance requirements specified in the contract. If an energy storage system does not meet the performance guarantee requirements, we may be required to pay liquidated damages. Other forms of variable consideration related to our large commercial and utility grade energy storage system contracts include variable customer payments that will be made based on our energy market participation activities. Such guarantees and variable customer payments represent a form of variable consideration and are estimated at contract inception at their most likely amount and updated at the end of each reporting period as additional performance data becomes available. Such estimates are included in the transaction price only to the extent that it is probable a significant reversal of revenue will not occur.\nWe record as deferred revenue any non-refundable amounts that are primarily related to prepayments from customers, which is recognized as revenue as or when the performance obligations are satisfied. As of December 31, 2024 and 2023, deferred revenue related to such customer payments amounted to $\n1.77\n billion and $\n1.60\n billion, respectively, mainly due to contractual payment terms. Revenue recognized from the deferred revenue balance as of December 31, 2023 and 2022 was $\n1.27\n billion and $\n571\n million for the years ended December 31, 2024 and 2023, respectively. We have elected the practical expedient to omit disclosure of the amount of the transaction price allocated to remaining performance obligations for energy generation and storage sales with an original expected contract length of one year or less and the amount that we have the right to invoice when that amount corresponds directly with the value of the performance to date. As of December 31, 2024, total transaction price allocated to performance obligations that were unsatisfied or partially unsatisfied for contracts with an original expected length of more than one year was $\n7.18\n billion. Of this amount, we expect to recognize $\n4.51\n billion in the next \n12\n months and the rest over the remaining performance obligation period. \nWe have financing receivables on our consolidated balance sheets related to loans we provide for financing our energy products. As of December 31, 2024 and 2023, we had current net financing receivables of $\n34\n million and $\n31\n million, respectively, in Accounts receivable, net, and $\n658\n million and $\n578\n million, respectively, in Other non-current assets for the long-term portion.\nEnergy Generation and Storage Leasing\nFor revenue arrangements where we are the lessor under operating lease agreements for energy generation and storage products, we record lease revenue from minimum lease payments, including upfront rebates and incentives earned from such systems, on a straight-line basis over the life of the lease term, assuming all other revenue recognition criteria have been met. The difference between the payments received and the revenue recognized is recorded as deferred revenue or deferred asset on the consolidated balance sheet.\nFor solar energy systems where customers purchase electricity from us under PPAs prior to January 1, 2019, we have determined that these agreements should be accounted for as operating leases pursuant to ASC 840, \nLeases\n. Revenue is recognized based on the amount of electricity delivered at rates specified under the contracts, assuming all other revenue recognition criteria are met.\nWe record as deferred revenue any amounts that are collected from customers, including lease prepayments, in excess of revenue recognized, which is recognized as revenue ratably over the respective customer contract term. As of December 31, 2024 and 2023, deferred revenue related to such customer payments amounted to $\n164\n million and $\n181\n million, respectively. Deferred revenue also includes the portion of rebates and incentives received from utility companies and various local and state government agencies, which is recognized as revenue over the lease term. As of December 31, 2024 and 2023, deferred revenue from rebates and incentives was immaterial.\n57\nWe capitalize initial direct costs from the execution of agreements for solar energy systems and PPAs, which include the referral fees and sales commissions, as an element of solar energy systems, net, and subsequently amortize these costs over the term of the related agreements.\nCost of Revenues\nAutomotive Segment\nAutomotive Sales\nCost of automotive sales revenue includes direct and indirect materials, labor costs, manufacturing overhead, including depreciation costs of tooling and machinery, shipping and logistic costs, vehicle connectivity costs, FSD (Supervised) ongoing maintenance costs, electricity costs for our free Supercharging programs and reserves for estimated warranty expenses. Cost of automotive sales revenues also includes adjustments to warranty expense and charges to write down the carrying value of our inventory when it exceeds its estimated net realizable value and to provide for obsolete and on-hand inventory in excess of forecasted demand. Additionally, cost of automotive sales revenue benefits from manufacturing credits earned, amounting to $\n625\n million and $\n359\n million for the years ended December 31, 2024 and 2023, respectively. \nAutomotive Leasing\nCost of automotive leasing revenue includes the depreciation of operating lease vehicles, cost of goods sold associated with direct sales-type leases and warranty expense related to leased vehicles. \nServices and Other\nCosts of services and other revenue includes cost of used vehicles including refurbishment costs, costs associated with providing non-warranty after-sales services, costs associated with our body shops and part sales, costs of paid Supercharging, costs to provide vehicle insurance and costs of retail merchandise sales.\nEnergy Generation and Storage Segment\nEnergy Generation and Storage\nCost of energy generation and storage revenue includes direct and indirect material and labor costs, manufacturing overhead, including depreciation costs of tooling and machinery, freight, warranty expense, and cost of servicing. Cost of energy generation and storage revenue also includes charges to write down the carrying value of our inventory when it exceeds its estimated net realizable value and to provide for obsolete and on-hand inventory in excess of forecasted demand. Additionally, cost of energy generation and storage revenue benefits from manufacturing credits earned, amounting to $\n756\n million and $\n115\n million for the years ended December 31, 2024 and 2023, respectively. In agreements for solar energy systems and PPAs where we are the lessor, the cost of revenue is primarily comprised of depreciation of the cost of leased solar energy systems, maintenance costs associated with those systems and amortization of any initial direct costs.\nResearch and Development Costs\nResearch and development costs are expensed as incurred.\nIncome Taxes\nWe are subject to income taxes in the U.S. and in many foreign jurisdictions. Income taxes are computed using the asset and liability method, under which deferred tax assets and liabilities are determined based on the difference between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to affect taxable income. Valuation allowances are established when necessary to reduce deferred tax assets to the amount expected to be realized.\n58\nSignificant judgment is required in determining our provision for income taxes, our deferred tax assets and liabilities and any valuation allowance recorded against our net deferred tax assets that are not more likely than not to be realized. We monitor the realizability of our deferred tax assets taking into account all relevant factors at each reporting period. In completing our assessment of realizability of our deferred tax assets, we consider our history of income (loss) measured at pre-tax income (loss) adjusted for permanent book-tax differences on a jurisdictional basis, volatility in actual earnings, excess tax benefits related to stock-based compensation in recent prior years and impacts of the timing of reversal of existing temporary differences. We also rely on our assessment of the Company’s projected future results of business operations, including uncertainty in future operating results relative to historical results, volatility in the market price of our common stock and its performance over time, variable macroeconomic conditions impacting our ability to forecast future taxable income, and changes in business that may affect the existence and magnitude of future taxable income. Our valuation allowance assessment is based on our best estimate of future results considering all available information.\nWe record liabilities related to uncertain tax positions when, despite our belief that our tax return positions are supportable, we believe that it is more likely than not that those positions may not be fully sustained upon review by tax authorities. Accrued interest and penalties related to unrecognized tax benefits are classified as income tax expense.\nThe Tax Cuts and Jobs Act subjects a U.S. shareholder to tax on global intangible low-taxed income (“GILTI”) earned by certain foreign subsidiaries. Under GAAP, we can make an accounting policy election to either treat taxes due on the GILTI inclusion as a current period expense or factor such amounts into our measurement of deferred taxes. We elected the deferred method, under which we recorded the corresponding deferred tax assets and liabilities in our consolidated balance sheets.\nComprehensive Income\nComprehensive income is comprised of net income and other comprehensive income (loss). Other comprehensive income (loss) consists of foreign currency translation adjustments and unrealized net gains and losses on investments that have been excluded from the determination of net income.\nStock-Based Compensation\nWe use the fair value method of accounting for our stock options and RSUs granted to employees and for our ESPP to measure the cost of employee services received in exchange for the stock-based awards. The fair value of stock option awards with only service and/or performance conditions is estimated on the grant or offering date using the Black-Scholes option-pricing model. The Black-Scholes option-pricing model requires inputs such as the risk-free interest rate, expected term and expected volatility. These inputs are subjective and generally require significant judgment. The fair value of RSUs is measured on the grant date based on the closing fair market value of our common stock. The resulting cost is recognized over the period during which an employee is required to provide service in exchange for the awards, usually the vesting period, which is generally \nfour years\n for stock options and RSUs and \nsix months\n for the ESPP. Stock-based compensation expense is recognized on a straight-line basis, net of actual forfeitures in the period.\nFor performance-based awards, stock-based compensation expense is recognized over the expected performance achievement period of individual performance milestones when the achievement of each individual performance milestone becomes probable. \nAs we accumulate additional employee stock-based awards data over time and as we incorporate market data related to our common stock, we may calculate significantly different volatilities and expected lives, which could materially impact the valuation of our stock-based awards and the stock-based compensation expense that we will recognize in future periods. Stock-based compensation expense is recorded in Cost of revenues, Research and development expense and Selling, general and administrative expense in the consolidated statements of operations.\n59\nNoncontrolling Interests and Redeemable Noncontrolling Interests\nNoncontrolling interests and redeemable noncontrolling interests represent third-party interests in the net assets under certain funding arrangements, or funds, that we have entered into to finance the costs of solar energy systems and vehicles under operating leases. We have determined that the contractual provisions of the funds represent substantive profit-sharing arrangements. We have further determined that the methodology for calculating the noncontrolling interest and redeemable noncontrolling interest balances that reflects the substantive profit-sharing arrangements is a balance sheet approach using the hypothetical liquidation at book value (“HLBV”) method. We, therefore, determine the amount of the noncontrolling interests and redeemable noncontrolling interests in the net assets of the funds at each balance sheet date using the HLBV method, which is presented on the consolidated balance sheet as noncontrolling interests in subsidiaries and redeemable noncontrolling interests in subsidiaries. Under the HLBV method, the amounts reported as noncontrolling interests and redeemable noncontrolling interests in the consolidated balance sheet represent the amounts the third parties would hypothetically receive at each balance sheet date under the liquidation provisions of the funds, assuming the net assets of the funds were liquidated at their recorded amounts determined in accordance with GAAP and with tax laws effective at the balance sheet date and distributed to the third parties. The third parties’ interests in the results of operations of the funds are determined as the difference in the noncontrolling interest and redeemable noncontrolling interest balances in the consolidated balance sheets between the start and end of each reporting period, after taking into account any capital transactions between the funds and the third parties. However, the redeemable noncontrolling interest balance is at least equal to the redemption amount. The redeemable noncontrolling interest balance is presented as temporary equity in the mezzanine section of the consolidated balance sheet since these third parties have the right to redeem their interests in the funds for cash or other assets.\nNet Income per Share of Common Stock Attributable to Common Stockholders\nBasic net income per share of common stock attributable to common stockholders is calculated by dividing net income attributable to common stockholders by the weighted-average shares of common stock outstanding for the period. Potentially dilutive shares, which are based on the weighted-average shares of common stock underlying outstanding stock-based awards, warrants and convertible senior notes using the treasury stock method or the if-converted method, as applicable, are included when calculating diluted net income per share of common stock attributable to common stockholders when their effect is dilutive.\nThe following table presents the reconciliation of net income attributable to common stockholders to net income used in computing basic and diluted net income per share of common stock (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nNet income attributable to common stockholders\n$\n7,091\n \n$\n14,997\n \n$\n12,556\n \nLess: Buy-outs of noncontrolling interests\n(\n39\n)\n(\n2\n)\n(\n27\n)\nNet income used in computing basic net income per share of common stock\n7,130\n \n14,999\n \n12,583\n \nLess: Dilutive convertible debt\n—\n \n—\n \n(\n1\n)\nNet income used in computing diluted net income per share of common stock\n$\n7,130\n \n$\n14,999\n \n$\n12,584\n \n60\nThe following table presents the reconciliation of basic to diluted weighted average shares used in computing net income per share of common stock attributable to common stockholders (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nWeighted average shares used in computing net income per share of common stock, basic\n3,197\n3,174\n3,130\nAdd:\nStock-based awards\n292\n298\n310\nConvertible senior notes\n1\n2\n3\nWarrants\n8\n11\n32\nWeighted average shares used in computing net income per share of common stock, diluted\n3,498\n3,485\n3,475\nThe following table presents the potentially dilutive shares that were excluded from the computation of diluted net income per share of common stock attributable to common stockholders, because their effect was anti-dilutive (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nStock-based awards\n15\n12\n4\nCash and Cash Equivalents\nAll highly liquid investments with an original maturity of three months or less at the date of purchase are considered cash equivalents.\n \nRestricted Cash\nWe maintain certain cash balances restricted as to withdrawal or use. Our restricted cash is comprised primarily of cash held to service certain payments under various secured debt facilities, cash held as collateral for sales to lease partners with a resale value guarantee and deposits held for our insurance services. We record restricted cash as other assets in the consolidated balance sheets and determine current or non-current classification based on the expected duration of the restriction.\nOur total cash and cash equivalents and restricted cash, as presented in the consolidated statements of cash flows, was as follows (in millions):\nDecember 31,\n2024\nDecember 31,\n2023\nDecember 31,\n2022\nCash and cash equivalents\n$\n16,139\n \n$\n16,398\n \n$\n16,253\n \nRestricted cash included in prepaid expenses and other current assets\n494\n \n543\n \n294\n \nRestricted cash included in other non-current assets\n404\n \n248\n \n377\n \nTotal as presented in the consolidated statements of cash flows\n$\n17,037\n \n$\n17,189\n \n$\n16,924\n \nInvestments\nOur investments are all designated as available-for-sale and reported at estimated fair value, with unrealized gains and losses recorded in accumulated other comprehensive loss which is included within stockholders’ equity. Available-for-sale marketable securities with maturities greater than three months at the date of purchase are included in short-term investments in our consolidated balance sheets. Interest, dividends, amortization and accretion of purchase premiums and discounts on these investments are included within Interest income in our consolidated statements of operations. Interest income on our short-term investments for the years ended December 31, 2024, 2023 and 2022 was $\n763\n million, $\n388\n million and an \nimmaterial\n amount, respectively. \n61\nThe cost of available-for-sale investments sold is based on the specific identification method. Realized gains and losses on the sale of available-for-sale investments are recorded in Other income (expense), net.\nWe regularly review all of our investments for declines in fair value. The review includes but is not limited to (i) the consideration of the cause of the decline, (ii) any currently recorded expected credit losses and (iii) the creditworthiness of the respective security issuers. The amortized cost basis of our investments approximates its fair value.\nAccounts Receivable and Allowance for Doubtful Accounts\nAccounts receivable primarily include amounts related to receivables from financial institutions and leasing companies offering various financing products to our customers, sales of energy generation and storage products, sales of regulatory credits to other automotive manufacturers and government rebates already passed through to customers. We provide an allowance against accounts receivable for the amount we expect to be uncollectible. We write-off accounts receivable against the allowance when they are deemed uncollectible.\nDepending on the day of the week on which the end of a fiscal quarter falls, our accounts receivable balance may fluctuate as we are waiting for certain customer payments to clear through our banking institutions and receipts of payments from our financing partners, which can take up to approximately two weeks based on the contractual payment terms with such partners. Our accounts receivable balances associated with sales of energy storage products are dependent on billing milestones and payment terms negotiated for each contract, and our accounts receivable balances associated with our sales of regulatory credits are dependent on contractual payment terms. Additionally, government rebates can take up to a year or more to be collected depending on the customary processing timelines of the specific jurisdictions issuing them. These various factors may have a significant impact on our accounts receivable balance from period to period.\n As of December 31, 2024 and 2023, government rebates receivable was $\n315\n million and $\n378\n million, respectively, in Accounts receivable, net for the current portion and an \nimmaterial\n amount and $\n207\n million, respectively, in Other non-current assets for the long-term portion in our consolidated balance sheets.\nFinancing Receivables\nWe provide financing options to our customers for our automotive and energy products. Financing receivables are carried at amortized cost, net of allowance for loan losses. Provisions for loan losses are charged to operations in amounts sufficient to maintain the allowance for loan losses at levels considered adequate to cover expected credit losses on the financing receivables. In determining expected credit losses, we consider our historical level of credit losses, current economic trends, and reasonable and supportable forecasts that affect the collectability of the future cash flows. Interest income on financing receivables is recognized over the loan term as revenue in the consolidated statements of operations.\nWhen originating consumer receivables, we review the credit application, the proposed contract terms, credit bureau information (e.g., FICO score) and other information. Our evaluation emphasizes the applicant’s ability to pay and creditworthiness focusing on payment, affordability, and applicant credit history as key considerations. Generally, all customers in this portfolio have strong creditworthiness at loan origination.\nAfter origination, we review the credit quality of retail financing based on customer payment activity and aging analysis. For all financing receivables, we define “past due” as any payment, including principal and interest, which is at least 31 days past the contractual due date.\n As of December 31, 2024 and 2023, the vast majority of our financing receivables were at current status with an immaterial balance being past due. As of December 31, 2024 and 2023, the majority of our financing receivables, excluding MyPower notes receivable, were originated in 2023 and 2022.\nWe have customer notes receivable under the legacy MyPower loan program, which provided residential customers with the option to finance the purchase of a solar energy system through a \n30-year\n loan and were all originated prior to year 2018. The outstanding balances, net of any allowance for expected credit losses, are presented on the consolidated balance sheets as a component of Prepaid expenses and other current assets for the current portion and as Other non-current assets for the long-term portion. As of December 31, 2024 and 2023, the total outstanding balance of MyPower customer notes receivable, net of allowance for expected credit losses, was $\n248\n million and $\n266\n million, respectively, of which $\n4\n million and $\n5\n million were due in the next 12 months as of December 31, 2024 and 2023, respectively. As of December 31, 2024 and 2023, the allowance for expected credit losses was $\n33\n million and $\n36\n million, respectively. \n62\nConcentration of Risk\nCredit Risk\nFinancial instruments that potentially subject us to a concentration of credit risk consist of cash, cash equivalents, investments, restricted cash, accounts receivable and other finance receivables. Our cash and investments balances are primarily on deposit at high credit quality financial institutions or invested in highly rated, investment-grade securities. These deposits are typically in excess of insured limits. As of December 31, 2024 and 2023, no entity represented 10% or more of our total receivables balance.\nSupply Risk\nWe are dependent on our suppliers, including single source suppliers, and the inability of these suppliers to deliver necessary components of our products in a timely manner at prices, quality levels and volumes acceptable to us, or our inability to efficiently manage these components from these suppliers, could have a material adverse effect on our business, prospects, financial condition and operating results.\nInventory Valuation\nInventories are stated at the lower of cost or net realizable value. Cost is computed using standard cost for vehicles and energy products, which approximates actual cost on a first-in, first-out basis. We record inventory write-downs for excess or obsolete inventories based upon assumptions about current and future demand forecasts. If our inventory on-hand is in excess of our future demand forecast, the excess amounts are written-off.\nWe also review our inventory to determine whether its carrying value exceeds the net amount realizable upon the ultimate sale of the inventory. This requires us to determine the estimated selling price of our vehicles less the estimated cost to convert the inventory on-hand into a finished product. Once inventory is written-down, a new, lower cost basis for that inventory is established and subsequent changes in facts and circumstances do not result in the restoration or increase in that newly established cost basis.\nShould our estimates of future selling prices or production costs change, additional and potentially material write-downs may be required. A small change in our estimates may result in a material charge to our reported financial results.\nOperating Lease Vehicles\nVehicles that are leased as part of our direct vehicle leasing program are classified as operating lease vehicles at cost less accumulated depreciation. We generally depreciate their cost, less residual value, using the straight-line-method to cost of automotive leasing revenue over the contractual period.\n The gross cost of operating lease vehicles as of December 31, 2024 and 2023 was $\n7.03\n billion and $\n7.36\n billion, respectively. Operating lease vehicles on the consolidated balance sheets are presented net of accumulated depreciation of $\n1.45\n billion and $\n1.38\n billion as of December 31, 2024 and 2023, respectively.\nDigital Assets, Net\nWe account for all digital assets held as crypto assets, a subset of indefinite-lived intangible assets in accordance with ASC 350-60,\n Intangibles - Goodwill and Other - Crypto Assets\n. We have ownership of and control over our digital assets and we may use third-party custodial services to secure it. The digital assets are initially recorded at cost and are subsequently remeasured on the consolidated balance sheet at fair value. Periods prior to January 1, 2024 include digital assets at cost, net of impairment losses incurred since their acquisition.\nWe determine and record the fair value of our digital assets in accordance with ASC 820, \nFair Value Measurement \n(“ASC 820”), based on quoted prices on the active exchange(s) that we have determined is the principal market for such assets (Level I inputs). We determine the cost basis of our digital assets using the specific identification of each unit received. Realized and unrealized gains and losses are now recorded to Other income (expense), net in our consolidated statement of operations.\n63\nFor periods prior to January 1, 2024, impairment losses were recognized within \nRestructuring and other\n in the consolidated statements of operations in the period in which the impairment was identified. Also for periods prior to January 1, 2024, gains were not recorded until realized upon sale(s), at which point they were presented net of any impairment losses for the same digital assets held within Restructuring and other. In determining the gain to be recognized upon sale, we calculate the difference between the sales price and carrying value of the digital assets sold immediately prior to sale.\nSee Note 3, \nDigital Assets, Net\n, for further information regarding digital assets.\nSolar Energy Systems, Net\nWe are the lessor of solar energy systems, which are stated at cost less accumulated depreciation. Depreciation of solar energy systems is calculated using the straight-line method over the estimated useful lives of \n30\n to \n35\n years.\n The gross cost of solar energy systems as of December 31, 2024 and 2023 was $\n6.79\n billion and $\n6.87\n billion, respectively. Solar energy systems on the consolidated balance sheets are presented net of accumulated depreciation of $\n1.86\n billion and $\n1.64\n billion as of December 31, 2024 and 2023, respectively.\nProperty, Plant and Equipment, Net\nProperty, plant and equipment, net, including leasehold improvements, are recognized at cost less accumulated depreciation. Depreciation is generally computed using the straight-line method over the estimated useful lives of the respective assets, as follows:\nMachinery, equipment, vehicles and office furniture\n3\n to \n15\n years\nTooling\n4\n to \n7\n years\nBuilding and building improvements\n15\n to \n30\n years\nComputer equipment and software\n3\n to \n6\n years\nAI infrastructure\n5\n to \n30\n years\nLeasehold improvements are depreciated on a straight-line basis over their estimated useful lives. AI infrastructure includes our owned data centers.\nUpon the retirement or sale of our property, plant and equipment, the cost and associated accumulated depreciation are removed from the consolidated balance sheet, and the resulting gain or loss is reflected on the consolidated statement of operations. Maintenance and repair expenditures are expensed as incurred while major improvements that increase the functionality, output or expected life of an asset are capitalized and depreciated ratably over the identified useful life.\nLong-Lived Assets Including Acquired Intangible Assets\nWe review our property, plant and equipment, solar energy systems, long-term prepayments and intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset (or asset group) may not be recoverable. We measure recoverability by comparing the carrying amount to the future undiscounted cash flows that the asset is expected to generate. If the asset is not recoverable, its carrying amount would be adjusted down to its fair value. For the years ended December 31, 2024, 2023 and 2022, we have recognized no material impairments of our long-lived assets.\nIntangible assets with definite lives are amortized on a straight-line basis over their estimated useful lives, which range from \nseven\n to \nthirty years\n.\nGoodwill\nWe assess goodwill for impairment annually in the fourth quarter, or more frequently if events or changes in circumstances indicate that it might be impaired, by comparing its carrying value to the reporting unit’s fair value.\n For the years ended December 31, 2024, 2023, and 2022, we did \nno\nt recognize any impairment of goodwill.\n64\nCapitalization of Software Costs\nWe capitalize costs incurred in the development of internal use software, during the application development stage to Property, plant and equipment, net on the consolidated balance sheets. Costs related to preliminary project activities and post-implementation activities are expensed as incurred. Such costs are amortized on a straight-line basis over their estimated useful life of \nthree\n to \nfive years\n.\nSoftware development costs incurred in development of software to be sold, leased, or otherwise marketed, incurred subsequent to the establishment of technological feasibility and prior to the general availability of the software are capitalized when they are expected to become significant. Such costs are amortized over the estimated useful life of the applicable software once it is made generally available to our customers.\nWe evaluate the useful lives of these assets on an annual basis, and we test for impairment whenever events or changes in circumstances occur that could impact the recoverability of these assets.\n For the years ended December 31, 2024, 2023, and 2022, we have recognized no impairments of capitalized software costs.\nForeign Currency\nWe determine the functional and reporting currency of each of our international subsidiaries and their operating divisions based on the primary currency in which they operate. In cases where the functional currency is not the U.S. dollar, we recognize a cumulative translation adjustment created by the different rates we apply to current period income or loss and the balance sheet. For each subsidiary, we apply the monthly average functional exchange rate to its monthly income or loss and the month-end functional currency rate to translate the balance sheet.\nForeign currency transaction gains and losses are a result of the effect of exchange rate changes on transactions denominated in currencies other than the functional currency of the respective subsidiary. Transaction gains and losses are recognized in Other income (expense), net, in the consolidated statements of operations.\n For the years ended December 31, 2024, 2023 and 2022, we recorded a net foreign currency transaction gain of $\n57\n million, gain of $\n122\n million and loss of $\n89\n million, respectively.\nWarranties\nWe provide a manufacturer’s warranty on all new and used vehicles and a warranty on the installation and components of the energy generation and storage systems we sell for periods typically between \n10\n to \n25\n years. We accrue a warranty reserve for the products sold by us, which includes our best estimate of the projected costs to repair or replace items under warranties and recalls if identified. These estimates are based on actual claims incurred to date and an estimate of the nature, frequency and costs of future claims. These estimates are inherently uncertain and changes to our historical or projected warranty experience may cause material changes to the warranty reserve in the future. The warranty reserve does not include projected warranty costs associated with our vehicles subject to operating lease accounting and our solar energy systems under lease contracts or PPAs, as the costs to repair these warranty claims are expensed as incurred. The portion of the warranty reserve expected to be incurred within the next 12 months is included within Accrued liabilities and other, while the remaining balance is included within Other long-term liabilities on the consolidated balance sheets. For liabilities that we are entitled to receive indemnification from our suppliers, we record receivables for the contractually obligated amounts on the consolidated balance sheets as a component of Prepaid expenses and other current assets for the current portion and as Other non-current assets for the long-term portion. Warranty expense is recorded as a component of Cost of revenues in the consolidated statements of operations. Due to the magnitude of our automotive business, our accrued warranty balance is primarily related to our automotive segment.\n \nAccrued warranty activity consisted of the following (in millions): \nYear Ended December 31,\n2024\n2023\n2022\nAccrued warranty—beginning of period\n$\n5,152\n \n$\n3,505\n \n$\n2,101\n \nWarranty costs incurred\n(\n1,453\n)\n(\n1,225\n)\n(\n803\n)\nNet changes in liability for pre-existing warranties, including expirations and foreign exchange impact\n287\n \n539\n \n522\n \nProvision for warranty\n2,730\n \n2,333\n \n1,685\n \nAccrued warranty—end of period\n$\n6,716\n \n$\n5,152\n \n$\n3,505\n \n65\nCustomer Deposits\nCustomer deposits primarily consist of refundable cash payments from customers at the time they place an order or reservation for a vehicle or an energy product and any additional payments up to the point of delivery or the completion of installation. Customer deposits also include prepayments on contracts that can be cancelled without significant penalties, such as vehicle maintenance plans. Customer deposits are included in Accrued liabilities and other on the consolidated balance sheets until refunded, forfeited or applied towards the customer’s purchase balance.\nGovernment Assistance Programs and Incentives\nGlobally, the operation of our business is impacted by various government programs, incentives, and other arrangements. Government incentives are recorded in our consolidated financial statements in accordance with their purpose as a reduction of expense, or an offset to the related capital asset. The benefit is generally recorded when all conditions attached to the incentive have been met or are expected to be met and there is reasonable assurance of their receipt.\nThe IRA Incentives\nOn August 16, 2022, the IRA was enacted into law and is effective for taxable years beginning after December 31, 2022. The IRA includes multiple incentives to promote clean energy, electric vehicles, battery and energy storage manufacture or purchase, in addition to a new corporate alternative minimum tax of 15% on adjusted financial statement income of corporations with profits greater than $1 billion. Some of these measures are expected to materially affect our consolidated financial statements. For the years ended December 31, 2024 and 2023, the impact from our IRA incentive was primarily a reduction of our costs of revenue in our consolidated statements of operations.\nGigafactory New York—New York State Investment and Lease\nWe have a lease through the Research Foundation for the SUNY Foundation with respect to Gigafactory New York. Under the lease and a related research and development agreement, we are continuing to designate further buildouts at the facility. We are required to comply with certain covenants, including hiring and cumulative investment targets. Under the terms of the arrangement, the SUNY Foundation paid for a majority of the construction costs related to the manufacturing facility and the acquisition and commissioning of certain manufacturing equipment; and we are responsible for any construction or equipment costs in excess of such amount (refer to Note 14, \nCommitments and Contingencies\n). This incentive reduces the related lease costs of the facility within the Energy generation and storage cost of revenues and operating expense line items in our consolidated statements of operations and was not material for any period presented.\nGigafactory Shanghai—Land Use Rights and Economic Benefits\nWe have an agreement with the local government of Shanghai for land use rights at Gigafactory Shanghai. Under the terms of the arrangement, we are required to meet a cumulative capital expenditure target and an annual tax revenue target starting at the end of 2023. In addition, the Shanghai government has granted to our Gigafactory Shanghai subsidiary certain incentives to be used in connection with eligible capital investments at Gigafactory Shanghai (refer to Note 14, \nCommitments and Contingencies\n). Incentives that offset costs of our facilities are recorded as a reduction of the cost of the capital investment within the Property, plant and equipment, net line item in our consolidated balance sheets and incentives related to our manufacturing operations are recorded as an offset to cost of revenues in our consolidated statements of operations. For the years ended December 31, 2024 and 2023, the amounts received were immaterial.\nNevada Tax Incentives\nIn connection with the construction of Gigafactory Nevada, we entered into agreements in 2014 with the State of Nevada and Storey County in Nevada that provide abatements for specified taxes, discounts to the base tariff energy rates and transferable tax credits of up to $\n195\n million in consideration of capital investment and hiring targets that were met at Gigafactory Nevada.\n66\nGigafactory Texas Tax Incentives\nIn connection with the construction of Gigafactory Texas, we entered into a \n20-year\n agreement in 2020 with Travis County in Texas pursuant to which we would receive grant funding equal to \n70\n-\n80\n% of property taxes paid by us to Travis County and a separate \n10-year\n agreement in 2020 with the Del Valle Independent School District in Texas pursuant to which a portion of the taxable value of our property would be capped at a specified amount, in each case subject to our meeting certain minimum economic development metrics through our construction and operations at Gigafactory Texas. This incentive is recorded as a reduction of the related expenses within the Cost of automotive revenues and operating expense line items of our consolidated statements of operations.\n For the years ended December 31, 2024, 2023 and 2022, the grant funding related to property taxes paid were immaterial.\nDefined Contribution Plan\nWe have a 401(k) savings plan in the U.S. that is intended to qualify as a deferred salary arrangement under Section 401(k) of the Internal Revenue Code and a number of savings plans internationally. Under the 401(k) savings plan, participating employees may elect to contribute up to \n90\n% of their eligible compensation, subject to certain limitations. Beginning in January 2022, we began to match \n50\n% of each employee’s contributions up to a maximum of \n6\n% (capped at $\n3,000\n) of the employee’s eligible compensation, vested upon one year of service.\n During the years ended December 31, 2024, 2023 and 2022, we recognized $\n107\n million, $\n99\n million and $\n91\n million, respectively, of expenses related to employer contributions for the 401(k) savings plan.\nRecent Accounting Pronouncements\nRecently issued accounting pronouncements not yet adopted\nIn December 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) No. 2023-09, Improvements to Income Tax Disclosures (Topic 740). The ASU requires disaggregated information about a reporting entity’s effective tax rate reconciliation as well as additional information on income taxes paid. The ASU is effective on a prospective basis for annual periods beginning after December 15, 2024. Early adoption is also permitted for annual financial statements that have not yet been issued or made available for issuance. This ASU will likely result in the required additional disclosures being included in our consolidated financial statements, once adopted.\nIn November 2024, the FASB issued ASU No. 2024-03, Disaggregation of Income Statement Expenses (Subtopic 220-40). The ASU requires the disaggregated disclosure of specific expense categories, including purchases of inventory, employee compensation, depreciation, and amortization, within relevant income statement captions. This ASU also requires disclosure of the total amount of selling expenses along with the definition of selling expenses. The ASU is effective for annual periods beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027. Adoption of this ASU can either be applied prospectively to consolidated financial statements issued for reporting periods after the effective date of this ASU or retrospectively to any or all prior periods presented in the consolidated financial statements. Early adoption is also permitted. This ASU will likely result in the required additional disclosures being included in our consolidated financial statements, once adopted. We are currently evaluating the provisions of this ASU.\nRecently adopted accounting pronouncements\nIn November 2023, the FASB issued ASU No. 2023-07, Improvements to Reportable Segment Disclosures (Topic 280). This ASU updates reportable segment disclosure requirements by requiring disclosures of significant reportable segment expenses that are regularly provided to the Chief Operating Decision Maker (“CODM”) and included within each reported measure of a segment's profit or loss. This ASU also requires disclosure of the title and position of the individual identified as the CODM and an explanation of how the CODM uses the reported measures of a segment’s profit or loss in assessing segment performance and deciding how to allocate resources. The ASU is effective for annual periods beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024. We adopted this ASU retrospectively on December 31, 2024. Refer to Note 17, \nSegment Reporting and Information about Geographic Areas\n for the inclusion of the new required disclosures.\n67\nASU 2023-08\nIn December 2023, the FASB issued ASU No. 2023-08, Accounting for and Disclosure of Crypto Assets (Subtopic 350-60) (“new crypto assets standard”). The new crypto assets standard requires certain crypto assets to be measured at fair value separately on the balance sheet with changes reported in the statement of operations each reporting period. The new crypto assets standard also enhances the other intangible asset disclosure requirements by requiring the name, cost basis, fair value, and number of units for each significant crypto asset holding. The new crypto assets standard is effective for annual periods beginning after December 15, 2024, including interim periods within those fiscal years. Adoption of the new crypto assets standard requires a cumulative-effect adjustment to the opening balance of retained earnings as of the beginning of the annual reporting period in which an entity adopts the amendments. Early adoption is also permitted, including adoption in an interim period. However, if the new crypto assets standard is early adopted in an interim period, an entity must adopt the new crypto assets standard as of the beginning of the fiscal year that includes the interim period. We adopted the new crypto assets standard on a modified retrospective approach effective January 1, 2024.\n Refer to Note 3, \nDigital Assets, Net \nfor the inclusion of the new required disclosures. \nThe cumulative effect of the changes made on our January 1, 2024 consolidated balance sheet for the adoption of the new crypto assets standard was as follows (in millions):\nBalances at\n December 31, 2023\nAdjustments from Adoption of the New Crypto Assets Standard\nBalances at\n January 1, 2024\nAssets\nDigital assets, net\n$\n184\n \n$\n303\n \n$\n487\n \nDeferred tax assets\n6,733\n \n(\n67\n)\n6,666\n \nStockholders' equity\nRetained earnings\n27,882\n \n236\n \n28,118\n \nNote 3 – \nDigital Assets, Net\nDuring the years ended December 31, 2024 and 2023, we purchased and/or received immaterial amounts of digital assets. During the years ended December 31, 2023 and 2022, we recorded an \nimmaterial\n amount and $\n204\n million of impairment losses on digital assets, respectively. \nThe table below summarizes the amounts shown on our consolidated balance sheet as of December 31, 2024 (in millions except units of digital assets).\n \nDecember 31, 2024\n \nUnits\nCost Basis\nFair Value\nDigital assets held:\nBitcoin\n11,509\n$\n386\n \n$\n1,074\n \nOther\n1\n \n2\n \nTotal\n387\n \n1,076\n \nThe following table provides details of the activities related to our digital assets for the year ended December 31, 2024 (in millions):\nBeginning balance at fair value\n$\n487\n \nUnrealized gains, net\n589\nEnding balance\n$\n1,076\n \nThe following tables present summarized unaudited quarterly financial statement data for those impacted line items based on the Company’s adoption of the new crypto assets standard as described in Note 2, \nSummary of Significant Accounting Policies\n (in millions, except per share data):\n68\nAs of:\nConsolidated Balance Sheets (unaudited):\nMarch 31, 2024\nJune 30, 2024\nSeptember 30, 2024\nDigital assets, net\nBefore adoption\n$\n184\n \n$\n184\n \n$\n184\n \nAdjustments\n638\n \n538\n \n545\n \nAs adjusted\n$\n822\n \n$\n722\n \n$\n729\n \nDeferred tax assets\nBefore adoption\n$\n6,769\n \n$\n6,692\n \n$\n6,486\n \nAdjustments\n(\n141\n)\n(\n119\n)\n(\n120\n)\nAs adjusted\n$\n6,628\n \n$\n6,573\n \n$\n6,366\n \nThree Months Ended\nCondensed Consolidated Statements of Operations (unaudited):\nMarch 31, 2024\nJune 30, 2024\nSeptember 30, 2024\nOther income (expense), net\nBefore adoption\n$\n108\n \n$\n20\n \n$\n(\n270\n)\nAdjustments\n335\n \n(\n100\n)\n7\n \nAs adjusted\n$\n443\n \n$\n(\n80\n)\n$\n(\n263\n)\nProvision for (benefit from) income taxes\nBefore adoption\n$\n409\n \n$\n393\n \n$\n601\n \nAdjustments\n74\n \n(\n22\n)\n1\n \nAs adjusted\n$\n483\n \n$\n371\n \n$\n602\n \nNet income attributable to common stockholders\nBefore adoption\n$\n1,129\n \n$\n1,478\n \n$\n2,167\n \nAdjustments\n261\n \n(\n78\n)\n6\n \nAs adjusted\n$\n1,390\n \n$\n1,400\n \n$\n2,173\n \nNet income per share of common stock attributable to common stockholders\nBasic\nBefore adoption\n$\n0.37\n \n$\n0.46\n \n$\n0.68\n \nAdjustments\n0.08\n \n(\n0.02\n)\n—\n \nAs adjusted\n$\n0.45\n \n$\n0.44\n \n$\n0.68\n \nDiluted\nBefore adoption\n$\n0.34\n \n$\n0.42\n \n$\n0.62\n \nAdjustments\n0.07\n \n(\n0.02\n)\n—\n \nAs adjusted\n$\n0.41\n \n$\n0.40\n \n$\n0.62\n \nThe unaudited impact of adoption for the three months ended December 31, 2024 was to increase Digital assets, net by $\n347\n million, with a corresponding increase in Other income (expense), net and decrease our Deferred tax assets by $\n77\n million with a corresponding increase in our Provision for (benefit from) income taxes, thus contributing $\n270\n million to Net income attributable to common stockholders. These amounts contributed $\n0.08\n to both basic and diluted net income attributable to common stockholders per share of common stock for the three months ended December 31, 2024.\nThere were no impairment losses recorded for any period during the year ended December 31, 2024. As a result, the unaudited interim balances of Digital assets, net did not change throughout the year ended December 31, 2024 prior to the adoption of the new crypto assets standard, which was adopted as of January 1, 2024.\nNote 4 – \nGoodwill and Intangible Assets\nGoodwill decreased $\n9\n million within the automotive segment from $\n253\n million as of December 31, 2023 to $\n244\n million as of December 31, 2024. There were \nno\n accumulated impairment losses as of December 31, 2024 and 2023.\n69\nThe net carrying value of our intangible assets decreased from $\n178\n million as of December 31, 2023 to $\n150\n million as of December 31, 2024 mainly from amortization.\nNote 5 – \nFair Value of Financial Instruments\nASC 820 states that fair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or a liability. The three-tiered fair value hierarchy, which prioritizes which inputs should be used in measuring fair value, is comprised of: (Level I) observable inputs such as quoted prices in active markets; (Level II) inputs other than quoted prices in active markets that are observable either directly or indirectly and (Level III) unobservable inputs for which there is little or no market data. The fair value hierarchy requires the use of observable market data when available in determining fair value. Our assets and liabilities that were measured at fair value on a recurring basis were as follows (in millions):\n \nDecember 31, 2024\nDecember 31, 2023\n \nFair Value\nLevel I\nLevel II\nLevel III\nFair Value\nLevel I\nLevel II\nLevel III\nCertificates of deposit and time deposits\n$\n12,767\n \n$\n—\n \n$\n12,767\n \n$\n—\n \n$\n6,996\n \n$\n—\n \n$\n6,996\n \n$\n—\n \nCommercial paper\n3,919\n \n—\n \n3,919\n \n—\n \n470\n \n—\n \n470\n \n—\n \nU.S. government securities\n3,620\n \n—\n \n3,620\n \n—\n \n5,136\n \n—\n \n5,136\n \n—\n \nCorporate debt securities\n118\n \n—\n \n118\n \n—\n \n480\n \n—\n \n480\n \n—\n \nMoney market funds\n1,753\n \n1,753\n \n—\n \n—\n \n109\n \n109\n \n—\n \n—\n \nDigital assets\n1,076\n \n1,076\n \n—\n \n—\n \nNot applicable\nTotal\n$\n23,253\n \n$\n2,829\n \n$\n20,424\n \n$\n—\n \n$\n13,191\n \n$\n109\n \n$\n13,082\n \n$\n—\n \nAll of our money market funds and digital assets are classified within Level I of the fair value hierarchy because they were valued using quoted prices in active markets. Our U.S. government securities, certificates of deposit, commercial paper, time deposits and corporate debt securities are classified within Level II of the fair value hierarchy and the market approach was used to determine fair value of these investments.\nOur cash, cash equivalents and investments classified by security type as of December 31, 2024 and 2023 consisted of the following (in millions):\n \nDecember 31, 2024\n \nAdjusted Cost\nGross Unrealized Gains\nGross Unrealized Losses \nFair Value\nCash and Cash Equivalents\nShort-Term Investments\nCash\n$\n14,386\n \n$\n—\n \n$\n—\n \n$\n14,386\n \n$\n14,386\n \n$\n—\n \nCertificates of deposit and time deposits\n12,767\n \n—\n \n—\n \n12,767\n \n—\n \n12,767\n \nCommercial paper\n3,908\n \n11\n \n—\n \n3,919\n \n—\n \n3,919\n \nU.S. government securities\n3,618\n \n3\n \n(\n1\n)\n3,620\n \n—\n \n3,620\n \nCorporate debt securities\n117\n \n1\n \n—\n \n118\n \n—\n \n118\n \nMoney market funds\n1,753\n \n—\n \n—\n \n1,753\n \n1,753\n \n—\n \nTotal cash, cash equivalents and short-term investments\n$\n36,549\n \n$\n15\n \n$\n(\n1\n)\n$\n36,563\n \n$\n16,139\n \n$\n20,424\n \n70\n \nDecember 31, 2023\n \nAdjusted Cost\nGross Unrealized Gains\nGross Unrealized Losses \nFair Value\nCash and Cash Equivalents\nShort-Term Investments\nCash\n$\n15,903\n \n$\n—\n \n$\n—\n \n$\n15,903\n \n$\n15,903\n \n$\n—\n \nCertificates of deposit and time deposits\n6,995\n \n1\n \n—\n \n6,996\n \n—\n \n6,996\n \nU.S. government securities\n5,136\n \n1\n \n(\n1\n)\n5,136\n \n277\n \n4,859\n \nCorporate debt securities\n485\n \n1\n \n(\n6\n)\n480\n \n—\n \n480\n \nCommercial paper\n470\n \n—\n \n—\n \n470\n \n109\n \n361\n \nMoney market funds\n109\n \n—\n \n—\n \n109\n \n109\n \n—\n \nTotal cash, cash equivalents and short-term investments\n$\n29,098\n \n$\n3\n \n$\n(\n7\n)\n$\n29,094\n \n$\n16,398\n \n$\n12,696\n \nAs of December 31, 2024, the vast majority of our short-term investments had contractual maturity dates within one year.\nDisclosure of Fair Values\nOur financial instruments that are not re-measured at fair value include accounts receivable, financing receivables, other receivables, accounts payable, accrued liabilities, customer deposits and debt. The carrying values of these financial instruments materially approximate their fair values.\nNote 6 – \nInventory\nOur inventory consisted of the following (in millions):\n \nDecember 31,\n2024\nDecember 31,\n2023\nRaw materials\n$\n5,242\n \n$\n5,390\n \nWork in process\n1,532\n \n2,016\n \nFinished goods (1)\n3,940\n \n5,049\n \nService parts\n1,303\n \n1,171\n \nTotal\n$\n12,017\n \n$\n13,626\n \n(1)\nFinished goods inventory includes products-in-transit to fulfill customer orders, new vehicles, used vehicles and energy products available for sale.\nWe write-down inventory for any excess or obsolete inventory or when we believe that the net realizable value of inventory is less than the carrying value. During the years ended December 31, 2024, 2023 and 2022, we recorded write-downs of $\n190\n million, $\n233\n million and $\n144\n million, respectively, in Cost of revenues in the consolidated statements of operations.\n \n71\nNote 7 – \nProperty, Plant and Equipment, Net\nOur property, plant and equipment, net, consisted of the following (in millions):\nDecember 31,\n2024\nDecember 31,\n2023\nMachinery, equipment, vehicles and office furniture\n$\n18,339\n \n$\n16,309\n \nLand and buildings\n10,677\n \n9,498\n \nAI infrastructure\n5,152\n \n1,510\n \nTooling\n3,883\n \n3,129\n \nLeasehold improvements\n3,688\n \n3,136\n \nComputer equipment, hardware and software\n2,902\n \n2,409\n \nConstruction in progress\n6,783\n \n5,791\n \n \n51,424\n \n41,782\n \nLess: Accumulated depreciation\n(\n15,588\n)\n(\n12,057\n)\nTotal\n$\n35,836\n \n$\n29,725\n \nConstruction in progress is primarily comprised of ongoing construction and expansion of our facilities, equipment and tooling related to the manufacturing of our products as well as AI-related assets which have not yet been placed in service. Completed assets are transferred to their respective asset classes and depreciation begins when an asset is ready for its intended use.\nDepreciation expense during the years ended December 31, 2024, 2023 and 2022 was $\n4.12\n billion, $\n3.33\n billion and $\n2.42\n billion, respectively.\nNote 8 – \nAccrued Liabilities and Other\n \nOur accrued liabilities and other current liabilities consisted of the following (in millions):\nDecember 31,\n2024\nDecember 31,\n2023\nAccrued purchases (1)\n$\n2,253\n \n$\n2,721\n \nAccrued warranty reserve, current portion\n1,917\n \n1,546\n \nPayroll and related costs\n1,532\n \n1,325\n \nTaxes payable (2)\n1,367\n \n1,204\n \nCustomer deposits\n993\n \n876\n \nOperating lease liabilities, current portion\n807\n \n672\n \nSales return reserve, current portion\n305\n \n219\n \nOther current liabilities\n1,549\n \n517\n \nTotal\n$\n10,723\n \n$\n9,080\n \n(1)\nAccrued purchases primarily reflects receipts of goods and services for which we had not yet been invoiced. As we are invoiced for these goods and services, this balance will reduce and accounts payable will increase.\n(2)\nTaxes payable primarily includes value added tax, income tax, sales tax, property tax and use tax payables.\n72\nNote 9 – \nOther Long-Term Liabilities\n \nOur other long-term liabilities consisted of the following (in millions):\nDecember 31,\n2024\nDecember 31,\n2023\nOperating lease liabilities\n$\n4,603\n \n$\n3,671\n \nAccrued warranty reserve\n4,799\n \n3,606\n \nOther non-current liabilities\n1,093\n \n876\n \nTotal other long-term liabilities\n$\n10,495\n \n$\n8,153\n \nNote 10 – \nDebt\nThe following is a summary of our debt and finance leases as of December 31, 2024 (in millions):\n \nNet Carrying Value\nUnpaid\nPrincipal\nBalance\nUnused\nCommitted\nAmount (1)\nContractual\nInterest Rates\nContractual\nMaturity Date\n \nCurrent\nLong-Term\nRecourse debt:\n  \n \nRCF Credit Agreement\n—\n \n—\n \n—\n \n5,000\n \nNot applicable\nJanuary 2028\nOther\n4\n \n3\n \n7\n \n—\n \n4.70\n-\n5.75\n%\nMarch 2025\n-\nJanuary 2031\nTotal recourse debt\n4\n \n3\n \n7\n \n5,000\n \nNon-recourse debt:\nAutomotive Asset-backed Notes\n2,255\n \n2,059\n \n4,329\n \n—\n \n3.45\n-\n6.57\n%\nSeptember 2025\n-\nJune 2035\nChina Working Capital Facility\n—\n \n2,740\n \n2,740\n \n—\n \n1.92\n \n%\nApril 2025\n (2)\nEnergy Asset-backed Notes\n54\n \n434\n \n493\n \n—\n \n4.80\n-\n6.25\n%\nDecember 2025-June 2050\nCash Equity Debt\n30\n \n299\n \n338\n \n—\n \n5.25\n-\n5.81\n%\nJuly 2033\n-\nJanuary 2035\nTotal non-recourse debt\n2,339\n \n5,532\n \n7,900\n \n—\n \nTotal debt\n2,343\n \n5,535\n \n$\n7,907\n \n$\n5,000\n \nFinance leases\n113\n \n222\n \nTotal debt and finance leases\n$\n2,456\n \n$\n5,757\n \nThe following is a summary of our debt and finance leases as of December 31, 2023 (in millions):\nNet Carrying Value\nUnpaid\nPrincipal\nBalance\nUnused\nCommitted\nAmount (1)\nContractual\nInterest Rates\nContractual\nMaturity Date\nCurrent\nLong-Term\nRecourse debt:\n  \n \n2024 Notes\n$\n37\n \n$\n—\n \n$\n37\n \n$\n—\n \n2.00\n \n%\nMay 2024\nRCF Credit Agreement\n—\n \n—\n \n—\n \n5,000\n \nNot applicable\nJanuary 2028\nOther\n—\n \n7\n \n7\n \n28\n \n4.70\n-\n5.75\n%\nMarch 2025\n-\nJanuary 2031\nTotal recourse debt\n37\n \n7\n \n44\n \n5,028\n \nNon-recourse debt:\nAutomotive Asset-backed Notes\n1,906\n \n2,337\n \n4,259\n \n—\n \n0.60\n-\n6.57\n%\nJuly 2024\n-\nMay 2031\nCash Equity Debt\n28\n \n330\n \n367\n \n—\n \n5.25\n-\n5.81\n%\nJuly 2033\n-\nJanuary 2035\nEnergy Asset-backed Notes\n4\n \n8\n \n13\n \n—\n \n4.80\n \n%\nDecember 2026\nTotal non-recourse debt\n1,938\n \n2,675\n \n4,639\n \n—\n \nTotal debt\n1,975\n \n2,682\n \n$\n4,683\n \n$\n5,028\n \nFinance leases\n398\n \n175\n \nTotal debt and finance leases\n$\n2,373\n \n$\n2,857\n \n(1)\nThere are no restrictions on draw-down or use for general corporate purposes with respect to any available committed funds under our RCF Credit Agreement, except certain specified conditions prior to draw-down. Refer to the section below for the terms of the facility.\n(2)\nThe contractual maturity date of the China Working Capital Facility is April 2025, renewable until March 2026 at our discretion. As we have the intent and ability to refinance the loan on a long-term basis, we recorded it in Debt and finance leases, net of current portion in the consolidated balance sheets.\n73\nRecourse debt refers to debt that is recourse to our general assets. Non-recourse debt refers to debt that is recourse to only assets of our subsidiaries. The differences between the unpaid principal balances and the net carrying values are due to debt discounts or deferred issuance costs. As of December 31, 2024, we were in material compliance with all financial debt covenants.\n2024 Notes\nDuring the second quarter of 2024, the 2024 Notes reached maturity and were fully settled. Additionally, in 2024, we fully settled the warrants entered into in connection with the issuance of the 2024 Notes, resulting in the issuance of \n11.4\n million shares of our common stock.\nCredit Agreement\nIn January 2023, we entered into a \n5-year\n senior unsecured revolving credit facility (the “RCF Credit Agreement”) with a syndicate of banks. The RCF Credit Agreement contains \ntwo\n optional \none-year\n extensions and has a total commitment of up to $\n5.00\n billion, which could be increased up to $\n7.00\n billion under certain circumstances. The underlying borrowings may be used for general corporate purposes. Borrowed funds accrue interest at a variable rate equal to: (i) for dollar-denominated loans, at our election, (a) Term SOFR (the forward-looking secured overnight financing rate) plus \n0.10\n%, or (b) an alternate base rate; (ii) for loans denominated in pounds sterling, SONIA (the sterling overnight index average reference rate); or (iii) for loans denominated in euros, an adjusted EURIBOR (euro interbank offered rate); in each case, plus an applicable margin. The applicable margin will be based on the rating assigned to our senior, unsecured long-term indebtedness (the “Credit Rating”) from time to time. The fee for undrawn amounts is variable based on the Credit Rating and is currently \n0.125\n% per annum.\nAutomotive Asset-backed Notes\nFrom time to time, we transfer receivables and/or beneficial interests related to certain vehicles (either leased or financed) into special purpose entities (“SPEs”) and issue Automotive Asset-backed Notes, backed by these automotive assets to investors. The SPEs are consolidated in the financial statements. The cash flows generated by these automotive assets are used to service the principal and interest payments on the Automotive Asset-backed Notes and satisfy the SPEs’ expenses, and any remaining cash is distributed to the owners of the SPEs. We recognize revenue earned from the associated customer lease or financing contracts in accordance with our revenue recognition policy. The SPEs’ assets and cash flows are not available to our other creditors, and the creditors of the SPEs, including the Automotive Asset-backed Note holders, have no recourse to our other assets.\nIn 2024, we transferred beneficial interests related to certain leased vehicles and/or financing receivables into SPEs and issued $\n2.45\n billion in aggregate principal amount of Automotive Asset-backed Notes, with terms similar to our other previously issued Automotive Asset-backed Notes. The proceeds from the issuance, net of debt issuance costs, were $\n2.44\n billion.\nEnergy Asset-backed Notes\nIn 2024, we transferred certain financing receivables into an SPE and issued $\n499\n million in aggregate principal amount of Energy Asset-backed Notes, backed by these financing receivables. The proceeds from issuance, net of debt issuance costs, were $\n494\n million. The SPE is wholly owned by us and is consolidated in the financial statements. The cash flows generated by these financing receivables are used to service the principal and interest payments on the Energy Asset-backed Notes and satisfy the SPE’s expenses, and any remaining cash is distributed to us. The SPE’s assets and cash flows are not available to our other creditors, and the creditors of the SPE, including the Energy Asset-backed Notes holders, have no recourse to our other assets.\nCash Equity Debt\nIn connection with the cash equity financing deals closed in 2016, our subsidiaries issued $\n502\n million in aggregate principal amount of debt that bears interest at fixed rates. This debt is secured by, among other things, our interests in certain financing funds and is non-recourse to our other assets.\n74\nChina Working Capital Facility\nIn April 2024, one of our subsidiaries entered into a loan agreement (the “China Working Capital Facility”) with lenders in China for an unsecured revolving facility of up to RMB \n20.00\n billion to be used for certain production expenditures as well as repayment of certain finance facilities. Borrowed funds bear interest at a rate equal to the Loan Prime Rate published by the People’s Bank of China minus \n1.18\n%. The China Working Capital Facility is non-recourse to our assets.\nPledged Assets\nAs of December 31, 2024 and 2023, we had pledged or restricted $\n5.16\n billion and $\n4.64\n billion of our assets (consisting principally of operating lease vehicles, financing receivables, restricted cash, and equity interests in certain SPEs) as collateral for our outstanding debt.\nSchedule of Principal Maturities of Debt\nThe future scheduled principal maturities of debt as of December 31, 2024 were as follows (in millions):\nRecourse debt\nNon-recourse debt\nTotal\n2025\n$\n4\n \n$\n2,349\n \n$\n2,353\n \n2026\n—\n \n4,116\n \n4,116\n \n2027\n—\n \n699\n \n699\n \n2028\n—\n \n243\n \n243\n \n2029\n—\n \n95\n \n95\n \nThereafter\n3\n \n398\n \n401\n \nTotal\n$\n7\n \n$\n7,900\n \n$\n7,907\n \nNote 11 – \nLeases\nWe have entered into various operating and finance lease agreements for certain of our offices, manufacturing and warehouse facilities, retail and service locations, data centers, equipment, vehicles, and solar energy systems, worldwide. We determine if an arrangement is a lease, or contains a lease, at inception and record the lease in our financial statements upon lease commencement, which is the date when the underlying asset is made available for use by the lessor.\nWe have lease agreements with lease and non-lease components, and have elected to utilize the practical expedient to account for lease and non-lease components together as a single combined lease component, from both a lessee and lessor perspective with the exception of direct sales-type leases and production equipment classes embedded in supply agreements. From a lessor perspective, the timing and pattern of transfer are the same for the non-lease components and associated lease component and, the lease component, if accounted for separately, would be classified as an operating lease.\nWe have elected not to present short-term leases on the consolidated balance sheet as these leases have a lease term of 12 months or less at lease inception and do not contain purchase options or renewal terms that we are reasonably certain to exercise. All other lease assets and lease liabilities are recognized based on the present value of lease payments over the lease term at commencement date. Because most of our leases do not provide an implicit rate of return, we used our incremental borrowing rate based on the information available at lease commencement date in determining the present value of lease payments.\nOur leases, where we are the lessee, often include options to extend the lease term for up to \n10\n years. Some of our leases also include options to terminate the lease prior to the end of the agreed upon lease term. For purposes of calculating lease liabilities, lease terms include options to extend or terminate the lease when it is reasonably certain that we will exercise such options. \n75\nLease expense for operating leases is recognized on a straight-line basis over the lease term as cost of revenues or operating expenses depending on the nature of the leased asset. Certain operating leases provide for annual increases to lease payments based on an index or rate. We calculate the present value of future lease payments based on the index or rate at the lease commencement date for new leases. Differences between the calculated lease payment and actual payment are expensed as incurred. Amortization of finance lease assets is recognized over the lease term as cost of revenues or operating expenses depending on the nature of the leased asset. Interest expense on finance lease liabilities is recognized over the lease term within Interest expense in the consolidated statements of operations.\nThe balances for the operating and finance leases where we are the lessee are presented as follows (in millions) within our consolidated balance sheets:\nDecember 31, 2024\nDecember 31, 2023\nOperating leases:\n \n \nOperating lease right-of-use assets\n$\n5,160\n \n$\n4,180\n \n \nAccrued liabilities and other\n$\n807\n \n$\n672\n \nOther long-term liabilities\n4,603\n \n3,671\n \nTotal operating lease liabilities\n$\n5,410\n \n$\n4,343\n \n \nFinance leases:\n \n \nSolar energy systems, net\n$\n21\n \n$\n23\n \nProperty, plant and equipment, net\n350\n \n601\n \nTotal finance lease assets\n$\n371\n \n$\n624\n \n \nCurrent portion of long-term debt and finance leases\n$\n113\n \n$\n398\n \nLong-term debt and finance leases, net of current portion\n222\n \n175\n \nTotal finance lease liabilities\n$\n335\n \n$\n573\n \nThe components of lease expense are as follows (in millions) within our consolidated statements of operations:\nYear Ended December 31,\n2024\n2023\n2022\nOperating lease expense:\n \n \n \nOperating lease expense (1)\n$\n1,500\n \n$\n1,153\n \n$\n798\n \n \nFinance lease expense:\nAmortization of leased assets\n$\n409\n \n$\n506\n \n$\n493\n \nInterest on lease liabilities\n21\n \n45\n \n72\n \nTotal finance lease expense\n$\n430\n \n$\n551\n \n$\n565\n \n \nTotal lease expense\n$\n1,930\n \n$\n1,704\n \n$\n1,363\n \n(1)\nIncludes short-term leases and variable lease costs, which are immaterial.\n76\nOther information related to leases where we are the lessee is as follows:\nDecember 31, 2024\nDecember 31, 2023\nWeighted-average remaining lease term:\nOperating leases\n7.9\n years\n7.4\n years\nFinance leases\n4.4\n years\n2.3\n years\n \nWeighted-average discount rate:\nOperating leases\n5.3\n \n%\n5.6\n \n%\nFinance leases\n4.7\n \n%\n5.5\n \n%\nSupplemental cash flow information related to leases where we are the lessee is as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash outflows from operating leases\n$\n1,450\n \n$\n1,084\n \n$\n754\n \nOperating cash outflows from finance leases (interest payments)\n$\n21\n \n$\n47\n \n$\n75\n \nLeased assets obtained in exchange for finance lease liabilities\n$\n144\n \n$\n10\n \n$\n58\n \nLeased assets obtained in exchange for operating lease liabilities\n$\n1,808\n \n$\n2,170\n \n$\n1,059\n \nAs of December 31, 2024, the maturities of our operating and finance lease liabilities (excluding short-term leases) are as follows (in millions):\n \nOperating\nLeases\nFinance\nLeases\n2025\n$\n1,066\n \n$\n122\n \n2026\n958\n \n84\n \n2027\n843\n \n69\n \n2028\n742\n \n27\n \n2029\n642\n \n22\n \nThereafter\n2,428\n \n45\n \nTotal minimum lease payments\n6,679\n \n369\n \nLess: Interest\n1,269\n \n34\n \nPresent value of lease obligations\n5,410\n \n335\n \nLess: Current portion\n807\n \n113\n \nLong-term portion of lease obligations\n$\n4,603\n \n$\n222\n \nAs of December 31, 2024, we have excluded from the table above additional operating leases that have not yet commenced with aggregate rent payments of $\n1.10\n billion. These operating leases will commence between fiscal year 2025 and 2026 with lease terms of \n2\n years to \n20\n years.\n77\nOperating Lease and Sales-type Lease Receivables\nWe are the lessor of certain vehicle and solar energy system arrangements as described in Note 2, \nSummary of Significant Accounting Policies\n. As of December 31, 2024, maturities of our operating lease and sales-type lease receivables from customers for each of the next five years and thereafter were as follows (in millions):\nOperating\nLeases\nSales-type\nLeases\n2025\n$\n1,265\n \n$\n177\n \n2026\n777\n \n185\n \n2027\n454\n \n93\n \n2028\n240\n \n27\n \n2029\n200\n \n2\n \nThereafter\n1,290\n \n—\n \nGross lease receivables\n$\n4,226\n \n$\n484\n \nThe above table does not include vehicle sales to customers or leasing partners with a resale value guarantee as the cash payments were received upfront. For our solar PPA arrangements, customers are charged solely based on actual power produced by the installed solar energy system at a predefined rate per kilowatt-hour of power produced. The future payments from such arrangements are not included in the above table as they are a function of the power generated by the related solar energy systems in the future. \nNet Investment in Sales-type Leases\nNet investment in sales-type leases, which is the sum of the present value of the future contractual lease payments, is presented on the consolidated balance sheets as a component of Prepaid expenses and other current assets for the current portion and as Other non-current assets for the long-term portion. Lease receivables relating to sales-type leases are presented on the consolidated balance sheets as follows (in millions):\nDecember 31, 2024\nDecember 31, 2023\nGross lease receivables\n$\n484\n \n$\n780\n \nUnearned interest income\n(\n38\n)\n(\n78\n)\nAllowance for expected credit losses\n(\n6\n)\n(\n6\n)\nNet investment in sales-type leases\n$\n440\n \n$\n696\n \n \nReported as:\nPrepaid expenses and other current assets\n$\n152\n \n$\n189\n \nOther non-current assets\n288\n \n507\n \nNet investment in sales-type leases\n$\n440\n \n$\n696\n \nNote 12 – \nEquity Incentive Plans\nIn June 2019, we adopted the 2019 Equity Incentive Plan (the “2019 Plan”). The 2019 Plan provides for the grant of stock options, restricted stock, RSUs, stock appreciation rights, performance units and performance shares to our employees, directors and consultants. Stock options granted under the 2019 Plan may be either incentive stock options or nonstatutory stock options. Incentive stock options may only be granted to our employees. Nonstatutory stock options may be granted to our employees, directors and consultants. Generally, our stock options and RSUs vest over \nfour years\n and our stock options are exercisable over a maximum period of \n10\n years from their grant dates. Vesting typically terminates when the employment or consulting relationship ends.\nAs of December 31, 2024, \n113.0\n million shares were reserved and available for issuance under the 2019 Plan.\n78\nThe following table summarizes our stock option and RSU activity for the year ended December 31, 2024:\nStock Options\nRSUs\nNumber of\nOptions\n(in thousands) \nWeighted-\nAverage\nExercise\nPrice\nWeighted-\nAverage\nRemaining\nContractual\nLife (years)\nAggregate\nIntrinsic\nValue\n(in billions)\nNumber\nof RSUs\n(in thousands) \nWeighted-\nAverage\nGrant\nDate Fair\nValue\nBeginning of period\n344,021\n$\n35.11\n \n19,088\n$\n225.01\n \nGranted\n14,979\n$\n235.22\n \n12,045\n$\n223.98\n \nExercised or released\n(\n10,469\n)\n$\n82.04\n \n(\n7,515\n)\n$\n206.02\n \nCancelled\n(\n3,996\n)\n$\n205.61\n \n(\n4,957\n)\n$\n221.15\n \nEnd of period\n344,535\n$\n40.41\n \n3.51\n$\n125.22\n \n18,661\n$\n233.02\n \nVested and expected to vest, December 31, 2024\n344,215\n$\n40.23\n \n3.50\n$\n125.16\n \n18,409\n$\n232.99\n \nExercisable and vested, December 31, 2024\n323,847\n$\n27.75\n \n3.14\n$\n121.79\n \nThe weighted-average grant date fair value per share of RSUs granted in the years ended December 31, 2024, 2023 and 2022 was $\n223.98\n, $\n228.33\n and $\n239.85\n, respectively. The aggregate release date fair value of RSUs in the years ended December 31, 2024, 2023 and 2022 was $\n1.75\n billion, $\n2.50\n billion and $\n4.32\n billion, respectively.\nThe aggregate intrinsic value of options exercised during the years ended December 31, 2024, 2023, and 2022 was $\n1.77\n billion, $\n1.33\n billion and $\n1.90\n billion, respectively.\nESPP\nOur employees are eligible to purchase our common stock through payroll deductions of up to \n15\n% of their eligible compensation, subject to any plan limitations. The purchase price would be \n85\n% of the lower of the fair market value on the first and last trading days of each \nsix-month\n offering period. During the years ended December 31, 2024, 2023 and 2022, under the ESPP we issued \n2.2\n million, \n2.1\n million and \n1.4\n million shares, respectively. As of December 31, 2024, there were \n95.5\n million shares available for issuance under the ESPP.\nFair Value Assumptions\nWe use the fair value method in recognizing stock-based compensation expense. Under the fair value method, we estimate the fair value of each stock option award with service or service and performance conditions and the ESPP on the grant date generally using the Black-Scholes option pricing model. \nThe weighted-average assumptions used in the Black-Scholes model for stock options are as follows:\nYear Ended December 31,\n2024\n2023\n2022\nRisk-free interest rate\n3.92\n \n%\n3.90\n \n%\n3.11\n \n%\nExpected term (in years)\n4.3\n4.5\n4.1\nExpected volatility\n59\n \n%\n63\n \n%\n63\n \n%\nDividend yield\n0.0\n \n%\n0.0\n \n%\n0.0\n \n%\nGrant date fair value per share\n$\n114.29\n \n$\n121.62\n \n$\n114.51\n \nThe fair value of RSUs with service or service and performance conditions is measured on the grant date based on the closing fair market value of our common stock. The risk-free interest rate is based on the U.S. Treasury yield for zero-coupon U.S. Treasury notes with maturities approximating each grant’s expected life. We use our historical data in estimating the expected term of our employee grants. The expected volatility is based on the average of the implied volatility of publicly traded options for our common stock and the historical volatility of our common stock.\n79\nOther Performance-Based Grants\nFrom time to time, the Compensation Committee of our Board of Directors grants certain employees performance-based RSUs and stock options.\nAs of December 31, 2024, we had unrecognized stock-based compensation expense of $\n490\n million under these grants to purchase or receive an aggregate \n5.0\n million shares of our common stock. For awards probable of achievement, we estimate the unrecognized stock-based compensation expense of $\n421\n million will be recognized over a weighted-average period of \n4.0\n years.\nFor the years ended December 31, 2024, 2023 and 2022, stock-based compensation expense related to these grants, net of forfeitures, were \nnot\n material.\nSummary Stock-Based Compensation Information\nThe following table summarizes our stock-based compensation expense by line item in the consolidated statements of operations (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nCost of revenues\n$\n776\n \n$\n741\n \n$\n594\n \nResearch and development\n832\n \n689\n \n536\n \nSelling, general and administrative\n389\n \n382\n \n430\n \nRestructuring and other\n$\n2\n \n$\n—\n \n$\n—\n \nTotal\n$\n1,999\n \n$\n1,812\n \n$\n1,560\n \nOur income tax benefits recognized from stock-based compensation arrangements were \nimmaterial\n while we were under full valuation allowances on our U.S. deferred tax assets during the year ended December 31, 2022. With the release of the valuation allowance associated with our federal and certain state deferred tax assets in 2023, income tax benefits recognized from stock-based compensation expense during the years ended December 31, 2024 and 2023 were $\n371\n million and $\n326\n million, respectively. During the years ended December 31, 2024, 2023 and 2022, stock-based compensation expense capitalized to our consolidated balance sheets was $\n198\n million, $\n199\n million and $\n245\n million, respectively. As of December 31, 2024, we had $\n5.79\n billion of total unrecognized stock-based compensation expense related to non-performance awards, which will be recognized over a weighted-average period of \n3.0\n years.\nNote 13 – \nIncome Taxes\nOur income before provision for (benefit from) income taxes for the years ended December 31, 2024, 2023 and 2022 was as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nDomestic\n$\n2,292\n \n$\n3,196\n \n$\n5,524\n \nNoncontrolling interest and redeemable noncontrolling interest\n62\n \n(\n23\n)\n31\n \nForeign\n6,636\n \n6,800\n \n8,164\n \nIncome before income taxes\n$\n8,990\n \n$\n9,973\n \n$\n13,719\n \n80\nA provision for (benefit from) income taxes of $\n1.84\n billion, $(\n5.00\n) billion and $\n1.13\n billion has been recognized for the years ended December 31, 2024, 2023 and 2022, respectively. \nThe components of the provision for (benefit from) income taxes for the years ended December 31, 2024, 2023 and 2022 consisted of the following (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nCurrent:\nFederal\n$\n—\n \n$\n48\n \n$\n—\n \nState\n45\n \n57\n \n62\n \nForeign\n1,315\n \n1,243\n \n1,266\n \nTotal current\n1,360\n \n1,348\n \n1,328\n \nDeferred:\nFederal\n831\n \n(\n5,246\n)\n26\n \nState\n(\n49\n)\n(\n653\n)\n1\n \nForeign\n(\n305\n)\n(\n450\n)\n(\n223\n)\nTotal deferred\n477\n \n(\n6,349\n)\n(\n196\n)\nTotal provision for (benefit from) income taxes\n$\n1,837\n \n$\n(\n5,001\n)\n$\n1,132\n \n81\nThe reconciliation of taxes at the federal statutory rate to our provision for (benefit from) income taxes for the years ended December 31, 2024, 2023 and 2022 was as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nTax at statutory federal rate\n$\n1,887\n \n$\n2,094\n \n$\n2,881\n \nState tax, net of federal benefit\n8\n \n(\n372\n)\n51\n \nExcess tax benefits related to stock-based compensation\n(\n267\n)\n(\n288\n)\n(\n745\n)\nNontaxable manufacturing credit\n(\n291\n)\n(\n101\n)\n—\n \nForeign income rate differential\n(\n545\n)\n(\n816\n)\n(\n923\n)\nU.S. tax credits\n(\n317\n)\n(\n593\n)\n(\n276\n)\nGILTI and Subpart F inclusion\n882\n \n670\n \n1,279\n \nUnrecognized tax benefits\n144\n \n183\n \n252\n \nChange in valuation allowance\n163\n \n(\n5,962\n)\n(\n1,532\n)\nOther\n173\n \n184\n \n145\n \nProvision for (benefit from) income taxes\n$\n1,837\n \n$\n(\n5,001\n)\n$\n1,132\n \nDeferred tax assets (liabilities) as of December 31, 2024 and 2023 consisted of the following (in millions):\nDecember 31,\n2024\nDecember 31,\n2023\nDeferred tax assets:\nNet operating loss carry-forwards\n$\n1,295\n \n$\n2,826\n \nResearch and development credits\n1,735\n \n1,358\n \nOther tax credits and attributes\n1,325\n \n827\n \nDeferred revenue\n1,101\n \n1,035\n \nInventory and warranty reserves\n1,769\n \n1,258\n \nOperating lease right-of-use liabilities\n1,186\n \n930\n \nCapitalized research and development costs\n2,448\n \n1,344\n \nDeferred GILTI tax assets\n691\n \n760\n \nOther\n412\n \n436\n \nTotal deferred tax assets\n11,962\n \n10,774\n \nValuation allowance\n(\n1,224\n)\n(\n892\n)\nDeferred tax assets, net of valuation allowance\n10,738\n \n9,882\n \nDeferred tax liabilities:\nDepreciation and amortization\n(\n2,658\n)\n(\n2,122\n)\nOperating lease right-of-use assets\n(\n1,097\n)\n(\n859\n)\nOther\n(\n561\n)\n(\n249\n)\nTotal deferred tax liabilities\n(\n4,316\n)\n(\n3,230\n)\nDeferred tax assets (liabilities), net of valuation allowance\n$\n6,422\n \n$\n6,652\n \n82\nAs of December 31, 2024, we maintained valuation allowances of $\n1.22\n billion for deferred tax assets that are not more likely than not to be realized, which primarily included our California deferred tax assets, U.S. foreign tax credits and certain foreign operating losses. The valuation allowance on our net deferred tax assets increased by $\n332\n million during the year ended December 31, 2024, and decreased by $\n6.46\n billion and $\n1.73\n billion during the years ended December 31, 2023 and 2022, respectively. The valuation allowance increase during the year ended December 31, 2024 was primarily due to the changes of our California deferred tax assets, U.S. foreign tax credits and certain foreign operating losses. The change in valuation allowance during the year ended December 31, 2023 was primarily due to the release of our valuation allowance with respect to our U.S. federal and certain state deferred tax assets. In the fourth quarter of 2023, based on the relevant weight of positive and negative evidence, including the amount of our taxable income in recent years which was objective and verifiable, and consideration of our expected future taxable earnings, we concluded that it is more likely than not that most of our U.S. federal and certain state deferred tax assets are realizable and released the valuation allowance on these deferred tax assets. The valuation allowance change during the years ended December 31, 2022 was primarily due to changes in our U.S. deferred tax assets and liabilities. Our deferred tax assets without a valuation allowance are more likely than not to be realized given the expectation of future earnings in the respective jurisdictions.\nAs of December 31, 2024, we had $\n4.34\n billion of federal and $\n8.59\n billion of state net operating loss carry-forwards available to offset future taxable income, an immaterial amount of which, if not utilized, will begin to expire in 2026 for federal and 2025 for state purposes. Federal and state laws can impose substantial restrictions on the utilization of net operating loss and tax credit carry-forwards in the event of an “ownership change,” as defined in Section 382 of the Internal Revenue Code. We have determined that no significant limitation would be placed on the utilization of our net operating loss and tax credit carry-forwards due to prior ownership changes or expirations.\nAs of December 31, 2024, we had federal research and development tax credits of $\n1.48\n billion, federal renewable energy tax credits of $\n1.01\n billion, and state research and development tax credits of $\n1.06\n billion. Most of our state research and development tax credits were in the state of California. If not utilized, some of the federal tax credits may expire in various amounts beginning in 2035. However, California research and development tax credits can be carried forward indefinitely. \nAs of December 31, 2024, we intend to indefinitely reinvest our foreign earnings and cash unless such repatriation results in no or minimal tax costs. We have recorded the taxes associated with the foreign earnings we intend to repatriate in the future. For the earnings we intend to indefinitely reinvest, \nno\n deferred tax liabilities for foreign withholding or other taxes have been recorded. The estimated amount of such unrecognized withholding tax liability associated with the indefinitely reinvested earnings is approximately $\n309\n million.\nUncertain Tax Positions\nThe changes to our gross unrecognized tax benefits were as follows (in millions):\nDecember 31, 2021\n$\n531\n \nIncreases in balances related to prior year tax positions\n136\n \nDecreases in balances related to prior year tax positions\n(\n12\n)\nIncreases in balances related to current year tax positions\n222\n \nDecreases in balances related to expiration of the statute of limitations\n(\n7\n)\nDecember 31, 2022\n870\n \nIncreases in balances related to prior year tax positions\n59\n \nDecreases in balances related to settlement with tax authorities\n(\n6\n)\nIncreases in balances related to current year tax positions\n255\n \nDecreases in balances related to expiration of the statute of limitations\n(\n4\n)\nDecember 31, 2023\n1,174\n \nIncreases in balances related to prior year tax positions\n51\n \nDecreases in balances related to prior year tax positions\n(\n27\n)\nIncreases in balances related to current year tax positions\n227\n \nDecreases in balances related to settlement with tax authorities\n(\n4\n)\nDecreases in balances related to expiration of the statute of limitations\n(\n4\n)\nDecember 31, 2024\n$\n1,417\n \n83\nWe include interest and penalties related to unrecognized tax benefits in income tax expense. We recognized net interest and penalties related to unrecognized tax benefits in provision for (benefit from) income taxes line of our consolidated statements of operations of $\n23\n million, $\n17\n million and $\n27\n million for the years ended December 31, 2024, 2023 and 2022, respectively. As of December 31, 2024, and 2023, we have accrued $\n69\n million and $\n47\n million, respectively, related to interest and penalties on our unrecognized tax benefits. Unrecognized tax benefits of $\n1.14\n billion, if recognized, would affect our effective tax rate. \nWe file income tax returns in the U.S. and various state and foreign jurisdictions. We are currently under examination by the Internal Revenue Service (“IRS”) for the years 2015 to 2018. Additional tax years within the periods 2004 to 2014 and 2019 to 2023 remain subject to examination for federal income tax purposes. All net operating losses and tax credits generated to date are subject to adjustment for U.S. federal and state income tax purposes. Our returns for 2004 and subsequent tax years remain subject to examination in U.S. state and foreign jurisdictions.\nGiven the uncertainty in timing and outcome of our tax examinations, an estimate of the range of the reasonably possible change in gross unrecognized tax benefits within twelve months cannot be made at this time.\nNote 14 – \nCommitments and Contingencies \nOperating Lease Arrangement in Buffalo, New York\nWe have an operating lease arrangement through the Research Foundation for the SUNY Foundation with respect to Gigafactory New York. Under the lease and a related research and development agreement, we are continuing to further develop the facility. \nUnder this agreement, we are obligated to, among other things, meet employment targets as well as specified minimum numbers of personnel in the State of New York and in Buffalo, New York and spend or incur $\n5.00\n billion in combined capital, operational expenses, costs of goods sold and other costs in the State of New York during the \n10\n-year period beginning April 30, 2018. On an annual basis during the initial lease term, as measured on each anniversary of such date, if we fail to meet these specified investment and job creation requirements, it may result in our incurring financial liabilities in the form of “program payments” which would not be expected to have a material adverse effect to our financial operations, the termination of our lease at Gigafactory New York, and/or the need to adjust certain of our operations.\nIn 2021, an amendment was executed to extend our overall agreement to spend or incur $\n5.00\n billion in combined capital, operational expenses, costs of goods sold and other costs in the State of New York through December 31, 2029. As of December 31, 2024, we have met and expect to meet the requirements under this arrangement, as may be modified and discussed from time to time, based on our current and anticipated level of operations. \nOperating Lease Arrangement in Shanghai, China\nWe have an operating lease arrangement for an initial term of \n50\n years with the local government of Shanghai for land use rights where we have been constructing Gigafactory Shanghai. Under the terms of the arrangement, we are required to spend RMB \n14.08\n billion in capital expenditures by the end of 2023, which was achieved in 2023, and to generate RMB \n2.23\n billion of annual tax revenues starting at the end of 2023. As of December 31, 2024 and 2023, we had met and expect to meet the tax revenue requirements based on our current level of spend and sales.\n84\nLegal Proceedings \nLitigation Relating to 2018 CEO Performance Award\nOn June 4, 2018, a purported Tesla stockholder filed a putative class and derivative action in the Delaware Court of Chancery against Elon Musk and the members of Tesla’s board of directors as then constituted, alleging corporate waste, unjust enrichment and that such board members breached their fiduciary duties by approving the stock-based compensation plan awarded to Elon Musk in 2018 (the “2018 CEO Performance Award”). Trial was held November 14-18, 2022. On January 30, 2024, the Court issued an opinion finding that the 2018 CEO Performance Award should be rescinded. Plaintiff’s counsel filed a brief seeking a fee award of \n29,402,900\n Tesla shares, plus expenses of $\n1,120,115.50\n. Tesla opposed the fee request, and at Tesla’s 2024 Annual Meeting of Stockholders, \n72\n% of the disinterested voting shares of Tesla, excluding shares owned by Mr. Musk and Kimbal Musk, voted to ratify the 2018 CEO Performance Award. Because Tesla’s disinterested stockholders voted to ratify the 2018 CEO Performance Award, Mr. Musk and the other director defendants, joined by Tesla, filed a brief seeking to revise the Court’s January 30, 2024 opinion. On December 2, 2024, the Court issued an opinion denying the motion to revise the Court’s January 30, 2024 opinion and awarded Plaintiff’s counsel fees in the amount of $\n345\n million. A final judgment was entered by the Court, and the director defendants and Tesla appealed the decisions to the Delaware Supreme Court.\nLitigation Related to Directors’ Compensation\nOn June 17, 2020, a purported Tesla stockholder filed a derivative action in the Delaware Court of Chancery, purportedly on behalf of Tesla, against certain of Tesla’s current and former directors regarding compensation awards granted to Tesla’s directors, other than Elon Musk, between 2017 and 2020. The suit asserts claims for breach of fiduciary duty and unjust enrichment and seeks declaratory and injunctive relief, unspecified damages and other relief. Defendants filed their answer on September 17, 2020.\nOn July 14, 2023, the parties filed a Stipulation and Agreement of Compromise and Settlement, which does not involve an admission of any wrongdoing by any party. Pursuant to the terms of the agreement, Tesla provided notice of the proposed settlement to stockholders of record as of July 14, 2023. The Court held a hearing regarding the settlement on October 13, 2023, after which it took the settlement and plaintiff counsels’ fee request under advisement. On January 8, 2025, the Court approved the settlement and awarded Plaintiff’s counsel fees in the amount of approximately $\n176\n million. A final judgment was entered by the Court on January 13, 2025. Tesla intends to appeal the Court’s fee award on or before the appeal deadline of February 12, 2025. The settlement is not expected to have an adverse impact on our results of operations, cash flows or financial position.\nLitigation Relating to Potential Going Private Transaction\nBetween August 10, 2018 and September 6, 2018, \nnine\n purported stockholder class actions were filed against Tesla and Elon Musk in connection with Mr. Musk’s August 7, 2018 Twitter post that he was considering taking Tesla private. On January 16, 2019, Plaintiffs filed their consolidated complaint in the United States District Court for the Northern District of California and added as defendants the members of Tesla’s board of directors. The consolidated complaint asserts claims for violations of the federal securities laws and seeks unspecified damages and other relief. The parties stipulated to certification of a class of stockholders, which the court granted on November 25, 2020. Trial started on January 17, 2023, and on February 3, 2023, a jury rendered a verdict in favor of the defendants on all counts. After trial, plaintiffs filed a motion for judgment as a matter of law and a motion for new trial, which the Court denied and judgement was entered in favor of defendants on July 11, 2023. On November 6, 2024, the United States Court of Appeals for the Ninth Circuit affirmed the district court’s dismissal of all claims.\nBetween October 17, 2018 and March 8, 2021, \nseven\n derivative lawsuits were filed in the Delaware Court of Chancery, purportedly on behalf of Tesla, against Mr. Musk and the members of Tesla’s board of directors, as constituted at relevant times, in relation to statements made and actions connected to a potential going private transaction, with certain of the lawsuits challenging additional Twitter posts by Mr. Musk, among other things. Several of those actions were consolidated, and all have been stayed. In addition to these cases, \ntwo\n derivative lawsuits were filed on October 25, 2018 and February 11, 2019 in the U.S. District Court for the District of Delaware, purportedly on behalf of Tesla, against Mr. Musk and the members of the Tesla board of directors as then constituted. Those cases have also been consolidated and stayed. \n85\nOn October 21, 2022, a lawsuit was filed in the Delaware Court of Chancery by a purported shareholder of Tesla alleging, among other things, that board members breached their fiduciary duties in connection with their oversight of the Company’s 2018 settlement with the SEC, as amended. Among other things, the plaintiff seeks reforms to the Company’s corporate governance and internal procedures, unspecified damages, and attorneys’ fees. The lawsuit has been stayed pending resolution of a motion to consolidate certain derivative lawsuits in the Delaware Court of Chancery referenced below.\nOn November 15, 2021, JPMorgan Chase Bank filed a lawsuit against Tesla in the Southern District of New York alleging breach of a stock warrant agreement that was entered into as part of a convertible notes offering in 2014. Tesla denied any wrongdoing and filed multiple counterclaims. On November 27, 2024, the parties agreed to settle their claims.\nCertain Derivative Lawsuits in Delaware \nBefore converting from a Delaware to Texas corporation on June 13, 2024, three separate derivative actions brought by purported Tesla stockholders were filed in the Delaware Court of Chancery on May 24, June 10 and June 13, 2024, purportedly on behalf of Tesla, against current and former directors regarding topics involving Elon Musk and others, X Corp. (formerly Twitter) and x.AI. These suits assert various claims, including breach of fiduciary duty and breach of contract, and seek unspecified damages and other relief. On August 6, 2024, the plaintiffs in these three actions moved to consolidate the matters into a single case. The Court consolidated two of the three cases. \nLitigation and Investigations Relating to Alleged Discrimination and Harassment\nOn February 9, 2022, the California Civil Rights Department (“CRD,” formerly “DFEH”) filed a civil complaint against Tesla in Alameda County, California Superior Court, alleging systemic race discrimination, hostile work environment and pay equity claims, among others. CRD’s amended complaint seeks monetary damages and injunctive relief. The case is currently in discovery. Trial is scheduled for September 15, 2025. \nAdditionally, on June 1, 2022 the Equal Employment Opportunity Commission (“EEOC”) issued a cause finding against Tesla that closely parallels the CRD’s allegations. On September 28, 2023, the EEOC filed a civil complaint against Tesla in the United States District Court for the Northern District of California asserting claims for race harassment and retaliation and seeking, among other things, monetary and injunctive relief.\nOn June 16, 2022, \ntwo\n Tesla stockholders filed separate derivative actions in the U.S. District Court for the Western District of Texas, purportedly on behalf of Tesla, against certain of Tesla’s current and former directors. Both suits assert claims for breach of fiduciary duty, unjust enrichment, and violation of the federal securities laws in connection with alleged race and gender discrimination and sexual harassment. Among other things, plaintiffs seek declaratory and injunctive relief, unspecified damages payable to Tesla, and attorneys’ fees. On July 22, 2022, the Court consolidated the \ntwo\n cases and on September 6, 2022, plaintiffs filed a consolidated complaint. On November 7, 2022, the defendants filed a motion to dismiss the case and on September 15, 2023, the Court dismissed the action but granted plaintiffs leave to file an amended complaint. On November 2, 2023, plaintiff filed an amended complaint purportedly on behalf of Tesla, against Elon Musk. On December 19, 2023, the defendants moved to dismiss the amended complaint, which the Court granted on April 12, 2024, with leave for plaintiffs to amend. On May 15, 2024, plaintiffs filed a second amended consolidated complaint purportedly on behalf of Tesla, against Mr. Musk. On July 1, 2024, the defendants moved to dismiss the second amended consolidated complaint. \n86\nOther Litigation Related to Our Products and Services\nWe are also subject to various lawsuits that seek monetary and other injunctive relief. These lawsuits include proposed class actions and other consumer claims that allege, among other things, purported defects and misrepresentations related to our products and services. For example, on September 14, 2022, a proposed class action was filed against Tesla, Inc. and related entities in the U.S. District Court for the Northern District of California, alleging various claims about the Company’s driver assistance technology systems under state and federal law. This case was later consolidated with several other proposed class actions, and a Consolidated Amended Complaint was filed on October 28, 2022, which seeks damages and other relief on behalf of all persons who purchased or leased from Tesla between January 1, 2016, to the present. On October 5, 2022, a proposed class action complaint was filed in the U.S. District Court for the Eastern District of New York asserting similar state and federal law claims against the same defendants. On September 30, 2023, the Court dismissed this action with leave to amend the complaint. On November 20, 2023, the plaintiff moved to amend the complaint, which Tesla opposed. On August 8, 2024, the Court denied the plaintiff’s motion for leave to file an amended complaint and entered judgment for Tesla. On September 5, 2024, the plaintiff filed a notice of appeal to United States Court of Appeals for the Second Circuit, and the parties are briefing the matter. On March 22, 2023, the plaintiffs in the Northern District of California consolidated action filed a motion for a preliminary injunction to order Tesla to (1) cease using the term “Full Self-Driving Capability” (FSD Capability), (2) cease the sale and activation of FSD Capability and deactivate FSD Capability on Tesla vehicles, and (3) provide certain notices to consumers about proposed court-findings about the accuracy of the use of the terms Autopilot and FSD Capability. Tesla opposed the motion. On September 30, 2023, the Court denied the request for a preliminary injunction, compelled four of five plaintiffs to arbitration, and dismissed the claims of the fifth plaintiff with leave to amend the complaint. On October 31, 2023, the remaining plaintiff in the Northern District of California action filed an amended complaint, which Tesla moved to dismiss, and on May 15, 2024, the Court granted in part and denied in part Tesla’s motion. On October 2, 2023, a similar proposed class action was filed in San Diego County Superior Court in California. Tesla subsequently removed the San Diego County case to federal court and on January 8, 2024, the federal court granted Tesla’s motion to transfer the case to the U.S. District Court for the Northern District of California. Tesla moved to compel arbitration, which the plaintiff did not oppose, and on June 27, 2024, the Court stayed the case pending arbitration.\nOn February 27, 2023, a proposed class action was filed in the U.S. District Court for the Northern District of California against Tesla, Inc., Elon Musk and certain current and former Company executives. The complaint alleges that the defendants made material misrepresentations and omissions about the Company’s Autopilot and FSD Capability technologies and seeks money damages and other relief on behalf of persons who purchased Tesla stock between February 19, 2019, and February 17, 2023. An amended complaint was filed on September 5, 2023, naming only Tesla, Inc. and Elon Musk as defendants. On November 6, 2023, Tesla moved to dismiss the amended complaint. On September 30, 2024, the Court granted Tesla’s motion to dismiss without prejudice. On November 26, 2024, the court issued a final judgment in Tesla’s favor, and on December 23, 2024, the plaintiffs filed a notice of appeal to the United States Court of Appeals for the Ninth Circuit. \nOn March 14, 2023, a proposed class action was filed against Tesla, Inc. in the U.S. District Court for the Northern District of California. Several similar complaints were also filed in the same court and these cases have now all been consolidated. These complaints allege that Tesla violates federal antitrust and warranty laws through its repair, service, and maintenance practices and seeks, among other relief, damages for persons who paid Tesla for repairs services or Tesla compatible replacement parts from March 2019 to March 2023. On July 17, 2023, these plaintiffs filed a consolidated amended complaint. On September 27, 2023, the court granted Tesla’s motion to compel arbitration as to three of the plaintiffs, and on November 17, 2023, the court granted Tesla’s motion to dismiss without prejudice. The plaintiffs filed a Consolidated Second Amended Complaint on December 12, 2023, which Tesla moved to dismiss. Plaintiffs also appealed the court’s arbitration order, which was denied. On June 17, 2024, the Court granted in part and denied in part Tesla’s motion to dismiss the Consolidated Second Amended Complaint. \nThe Company intends to vigorously defend itself in these matters; however, we cannot predict the outcome or impact. We are unable to reasonably estimate the possible loss or range of loss, if any, associated with these claims, unless noted.\n87\nCertain Investigations and Other Matters\nWe regularly receive requests for information, including subpoenas, from regulators and governmental authorities such as the National Highway Traffic Safety Administration, the National Transportation Safety Board, the Securities and Exchange Commission (“SEC”), the Department of Justice (“DOJ”), and various local, state, federal, and international agencies. The ongoing requests for information include topics such as operations, technology (e.g., vehicle functionality, vehicle incidents, Autopilot and FSD Capability), compliance, finance, data privacy, and other matters related to Tesla’s business, its personnel, and related parties. We routinely cooperate with such formal and informal requests for information, investigations, and other inquiries. To our knowledge no government agency in any ongoing investigation has concluded that any wrongdoing occurred. We cannot predict the outcome or impact of any ongoing matters. Should the government decide to pursue an enforcement action, there exists the possibility of a material adverse impact on our business, results of operation, prospects, cash flows, financial position or brand.\nWe are also subject to various other legal proceedings, risks and claims that arise from the normal course of business activities. For example, during the second quarter of 2023, a foreign news outlet reported that it obtained certain misappropriated data including, purportedly non-public Tesla business and personal information. Tesla has made notifications to potentially affected individuals (current and former employees) and regulatory authorities and we are working with certain law enforcement and other authorities. On August 5, 2023, a putative class action was filed in the United States District Court for the Northern District of California, purportedly on behalf of all U.S. individuals impacted by the data incident, followed by several additional lawsuits, that each assert claims under various state laws and seeks monetary damages and other relief. If an unfavorable ruling or development were to occur in these or other possible legal proceedings, risks and claims, there exists the possibility of a material adverse impact on our business, results of operations, prospects, cash flows, financial position or brand.\nLetters of Credit\nAs of December 31, 2024, we had $\n448\n million of unused letters of credit outstanding.\nNote 15 – \nVariable Interest Entity Arrangements\nWe have entered into various arrangements with investors to facilitate the funding and monetization of our solar energy systems and vehicles. In particular, our wholly owned subsidiaries and fund investors have formed and contributed cash and assets into various financing funds and entered into related agreements. We have determined that the funds are VIEs and we are the primary beneficiary of these VIEs by reference to the power and benefits criterion under ASC 810. We have considered the provisions within the agreements, which grant us the power to manage and make decisions that affect the operation of these VIEs, including determining the solar energy systems and the associated customer contracts to be sold or contributed to these VIEs, redeploying solar energy systems and managing customer receivables. We consider that the rights granted to the fund investors under the agreements are more protective in nature rather than participating.\nAs the primary beneficiary of these VIEs, we consolidate in the financial statements the financial position, results of operations and cash flows of these VIEs, and all intercompany balances and transactions between us and these VIEs are eliminated in the consolidated financial statements. Cash distributions of income and other receipts by a fund, net of agreed upon expenses, estimated expenses, tax benefits and detriments of income and loss and tax credits, are allocated to the fund investor and our subsidiary as specified in the agreements.\nGenerally, our subsidiary has the option to acquire the fund investor’s interest in the fund for an amount based on the market value of the fund or the formula specified in the agreements.\nUpon the sale or liquidation of a fund, distributions would occur in the order and priority specified in the agreements.\nPursuant to management services, maintenance and warranty arrangements, we have been contracted to provide services to the funds, such as operations and maintenance support, accounting, lease servicing and performance reporting. In some instances, we have guaranteed payments to the fund investors as specified in the agreements. A fund’s creditors have no recourse to our general credit or to that of other funds. Certain assets of the funds have been pledged as collateral for their obligations.\n88\nThe aggregate carrying values of the VIEs’ assets and liabilities, after elimination of any intercompany transactions and balances, in the consolidated balance sheets were as follows (in millions):\nDecember 31,\n2024\nDecember 31,\n2023\nAssets\n \n \nCurrent assets\n \n \nCash and cash equivalents\n$\n49\n \n$\n66\n \nAccounts receivable, net\n18\n \n13\n \nPrepaid expenses and other current assets\n276\n \n361\n \nTotal current assets\n343\n \n440\n \nOperating lease vehicles, net\n392\n \n—\n \nSolar energy systems, net\n2,310\n \n3,278\n \nOther non-current assets\n183\n \n369\n \nTotal assets\n$\n3,228\n \n$\n4,087\n \nLiabilities\n \n \nCurrent liabilities\n \n \nAccrued liabilities and other\n$\n32\n \n$\n67\n \nDeferred revenue\n6\n \n6\n \nCurrent portion of debt and finance leases\n2,114\n \n1,564\n \nTotal current liabilities\n2,152\n \n1,637\n \nDeferred revenue, net of current portion\n71\n \n99\n \nDebt and finance leases, net of current portion\n1,834\n \n2,041\n \nTotal liabilities\n$\n4,057\n \n$\n3,777\n \nNote 16 – \nRelated Party Transactions\nTesla periodically does business with certain entities with which its CEO and directors are affiliated, such as x.AI, SpaceX, The Boring Company, X Corp. and Redwood Materials, in accordance with our Related Person Transactions Policy. Such transactions have not had to date, and are not currently expected to have, a material impact on our consolidated financial statements.\n89\nNote 17 – \nSegment Reporting and Information about Geographic Areas\nOur Chief Executive Officer, as the CODM, organizes our company, manages resource allocations and measures performance among \ntwo\n operating and reportable segments: (i) automotive and (ii) energy generation and storage. The automotive segment includes the design, development, manufacturing, sales and leasing of electric vehicles as well as sales of automotive regulatory credits. Additionally, the automotive segment is also comprised of services and other, which includes sales of used vehicles, non-warranty maintenance services and collision, part sales, paid Supercharging, insurance services revenue and retail merchandise sales. The energy generation and storage segment includes the design, manufacture, installation, sales and leasing of solar energy generation and energy storage products and related services and sales of solar energy systems incentives. \nOur CODM does not evaluate operating segments using asset or liability information. The CODM uses gross profit to allocate operating and capital resources and assesses performance of each segment by comparing actual gross profit results to historical results and previously forecasted financial information. The following table presents revenues, cost of revenues and gross profit by reportable segment (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nAutomotive segment\n \n \nRevenues\n$\n87,604\n \n$\n90,738\n \n$\n77,553\n \nCost of revenues (1)\n$\n72,794\n \n$\n74,219\n \n$\n56,988\n \nGross profit\n$\n14,810\n \n$\n16,519\n \n$\n20,565\n \nEnergy generation and storage segment\n \n \nRevenues\n$\n10,086\n \n$\n6,035\n \n$\n3,909\n \nCost of revenues (2)\n$\n7,446\n \n$\n4,894\n \n$\n3,621\n \nGross profit\n$\n2,640\n \n$\n1,141\n \n$\n288\n \n(1)\nDepreciation and amortization included in Cost of revenues for the automotive segment for the years ended December 31, 2024, 2023 and 2022 was $\n3.68\n billion, $\n3.45\n billion and $\n2.81\n billion, respectively.\n(2)\nDepreciation and amortization included in Cost of revenues for the energy generation and storage segment for the years ended December 31, 2024, 2023 and 2022 was $\n377\n million, $\n343\n million and $\n331\n million, respectively.\nThe following table presents revenues by geographic area based on the sales location of our products (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nUnited States\n$\n47,725\n \n$\n45,235\n \n$\n40,553\n \nChina\n20,944\n \n21,745\n \n18,145\n \nOther international\n29,021\n \n29,793\n \n22,764\n \nTotal\n$\n97,690\n \n$\n96,773\n \n$\n81,462\n \nThe following table presents long-lived assets by geographic area (in millions):\nDecember 31,\n2024\nDecember 31,\n2023\nUnited States\n$\n32,461\n \n$\n26,629\n \nGermany\n4,175\n \n4,258\n \nOther international\n4,124\n \n4,067\n \nTotal\n$\n40,760\n \n$\n34,954\n \n90\nThe following table presents inventory by reportable segment (in millions):\nDecember 31,\n2024\nDecember 31,\n2023\nAutomotive\n$\n9,988\n \n$\n11,139\n \nEnergy generation and storage\n2,029\n \n2,487\n \nTotal\n$\n12,017\n \n$\n13,626\n \nNote 18 – \nRestructuring and Other\nIn the second quarter of 2024, we initiated and substantially completed certain restructuring actions to reduce costs and improve efficiency. As a result, we recognized $\n583\n million of employee termination expenses in Restructuring and other in our consolidated income statement. These expenses were substantially paid with an immaterial accrual remaining in Accrued liabilities and other in our consolidated balance sheet as of December 31, 2024.\nDuring the year ended December 31, 2022, we recorded an \nimpairment loss\n of $\n204\n million as well as realized gains of $\n64\n million in connection with converting our holdings of digital assets into fiat currency. We also recorded other expenses of $\n36\n million during the second quarter of the year ended December 31, 2022, related to employee terminations.\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and our Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures pursuant to Rule 13a-15 under the Securities Exchange Act of 1934, as amended (the “Exchange Act”). In designing and evaluating the disclosure controls and procedures, our management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. In addition, the design of disclosure controls and procedures must reflect the fact that there are resource constraints and that our management is required to apply its judgment in evaluating the benefits of possible controls and procedures relative to their costs.\nBased on this evaluation, our Chief Executive Officer and our Chief Financial Officer concluded that, as of December 31, 2024, our disclosure controls and procedures were designed at a reasonable assurance level and were effective to provide reasonable assurance that the information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and our Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosures.\nManagement’s Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a process designed by, or under the supervision of, our Chief Executive Officer and Chief Financial Officer to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that (1) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\n91\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”). Our management concluded that our internal control over financial reporting was effective as of December 31, 2024.\nOur independent registered public accounting firm, PricewaterhouseCoopers LLP, has audited the effectiveness of our internal control over financial reporting as of December 31, 2024, as stated in their report which is included herein.\nLimitations on the Effectiveness of Controls\nBecause of inherent limitations, internal control over financial reporting may not prevent or detect misstatements and projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control over Financial Reporting\nThere was no change in our internal control over financial reporting that occurred during the quarter ended December 31, 2024, which has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nITEM 9B. OTHER INFORMATION\nNone of the Company’s directors or officers \nadopted\n, modified or \nterminated\n a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement during the Company’s fiscal quarter ended December 31, 2024, as such terms are defined under Item 408(a) of Regulation S-K, except as follows:\nOn \nDecember 6, 2024\n, \nIra Ehrenpreis\n, one of our \ndirectors\n, \nadopted\n a Rule 10b5-1 trading arrangement for the potential exercise of options to purchase \n761,961\n shares of our common stock, and the subsequent sale of our common stock subject to certain conditions, in amounts sufficient to cover tax withholding obligations and yield aggregate net proceeds to Mr. Ehrenpreis of $15 million, after payment of commissions and fees. The arrangement's expiration date is \nJune 3, 2025\n.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n92\nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item 10 of Form 10-K will be included in our 2025 Proxy Statement to be filed with the Securities and Exchange Commission in connection with the solicitation of proxies for our 2025 Annual Meeting of Stockholders and is \nincorporated herein\n by reference. The 2025 Proxy Statement will be filed with the Securities and Exchange Commission within 120 days after the end of the fiscal year to which this report relates.\nITEM 11. EXECUTIVE COMPENSATION\nThe information required by this Item 11 of Form 10-K will be included in our 2025 Proxy Statement and is incorporated herein by reference.\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item 12 of Form 10-K will be included in our 2025 Proxy Statement and is incorporated herein by reference.\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information required by this Item 13 of Form 10-K will be included in our 2025 Proxy Statement and is incorporated herein by reference.\nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item 14 of Form 10-K will be included in our 2025 Proxy Statement and is incorporated herein by reference.\n93\nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n1.\nFinancial statements (see \nIndex to Consolidated Financial Statements\n in Part II, Item 8 of this report)\n2.\nAll financial statement schedules have been omitted since the required information was not applicable or was not present in amounts sufficient to require submission of the schedules, or because the information required is included in the consolidated financial statements or the accompanying notes\n3.\nThe exhibits listed in the following \nIndex to Exhibits\n are filed or incorporated by reference as part of this report\nINDEX TO EXHIBITS\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n3.1\nCertificate of Formation of the Re\ngistrant \n10-Q\n001-34756\n3.1\nJuly 24, 2024\n3.2\nBylaws of the Registrant.\n10-Q\n001-34756\n3.2\nJuly 24, 2024\n4.1\nSpecimen common stock certificate of the Registrant.\n—\n—\n—\n—\nX\n4.2\nFifth Amended and Restated Investors’ Rights Agreement, dated as of August 31, 2009, between Registrant and certain holders of the Registrant’s capital stock named therein.\nS-1\n333-164593\n4.2\nJanuary 29, 2010\n4.3\nAmendment to Fifth Amended and Restated Investors’ Rights Agreement, dated as of May 20, 2010, between Registrant and certain holders of the Registrant’s capital stock named therein.\nS-1/A\n333-164593\n4.2A\nMay 27, 2010\n4.4\nAmendment to Fifth Amended and Restated Investors’ Rights Agreement between Registrant, Toyota Motor Corporation and certain holders of the Registrant’s capital stock named therein.\nS-1/A\n333-164593\n4.2B\nMay 27, 2010\n4.5\nAmendment to Fifth Amended and Restated Investor’s Rights Agreement, dated as of June 14, 2010, between Registrant and certain holders of the Registrant’s capital stock named therein.\nS-1/A\n333-164593\n4.2C\nJune 15, 2010\n4.6\nAmendment to Fifth Amended and Restated Investor’s Rights Agreement, dated as of November 2, 2010, between Registrant and certain holders of the Registrant’s capital stock named therein.\n8-K\n001-34756\n4.1\nNovember 4, 2010\n4.7\nWaiver to Fifth Amended and Restated Investor’s Rights Agreement, dated as of May 22, 2011, between Registrant and certain holders of the Registrant’s capital stock named therein.\nS-1/A\n333-174466\n4.2E\nJune 2, 2011\n94\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n4.8\nAmendment to Fifth Amended and Restated Investor’s Rights Agreement, dated as of May 30, 2011, between Registrant and certain holders of the Registrant’s capital stock named therein.\n8-K\n001-34756\n4.1\nJune 1, 2011\n4.9\nSixth Amendment to Fifth Amended and Restated Investors’ Rights Agreement, dated as of May 15, 2013 among the Registrant, the Elon Musk Revocable Trust dated July 22, 2003 and certain other holders of the capital stock of the Registrant named therein.\n8-K\n001-34756\n4.1\nMay 20, 2013\n4.10\nWaiver to Fifth Amended and Restated Investor’s Rights Agreement, dated as of May 14, 2013, between the Registrant and certain holders of the capital stock of the Registrant named therein.\n8-K\n001-34756\n4.2\nMay 20, 2013\n4.11\nWaiver to Fifth Amended and Restated Investor’s Rights Agreement, dated as of August 13, 2015, between the Registrant and certain holders of the capital stock of the Registrant named therein.\n8-K\n001-34756\n4.1\nAugust 19, 2015\n4.12\nWaiver to Fifth Amended and Restated Investors’ Rights Agreement, dated as of May 18, 2016, between the Registrant and certain holders of the capital stock of the Registrant named therein.\n8-K\n001-34756\n4.1\nMay 24, 2016\n4.13\nWaiver to Fifth Amended and Restated Investors’ Rights Agreement, dated as of March 15, 2017, between the Registrant and certain holders of the capital stock of the Registrant named therein.\n8-K\n001-34756\n4.1\nMarch 17, 2017\n4.14\nWaiver to Fifth Amended and Restated Investors’ Rights Agreement, dated as of May 1, 2019, between the Registrant and certain holders of the capital stock of the Registrant named therein.\n8-K\n001-34756\n4.1\nMay 3, 2019\n4.15\nIndenture, dated as of May 22, 2013, by and between the Registrant and U.S. Bank National Association.\n8-K\n001-34756\n4.1\nMay 22, 2013\n4.16\nIndenture, dated as of October 15, 2014, between SolarCity and U.S. Bank National Association, as trustee.\nS-3ASR(1)\n333-199321\n4.1\nOctober 15, 2014\n4.17\nTenth Supplemental Indenture, dated as of March 9, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.00% Solar Bonds, Series 2015/6-10.\n8-K(1)\n001-35758\n4.3\nMarch 9, 2015\n95\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n4.18\nEleventh Supplemental Indenture, dated as of March 9, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.75% Solar Bonds, Series 2015/7-15.\n8-K(1)\n001-35758\n4.4\nMarch 9, 2015\n4.19\nFifteenth Supplemental Indenture, dated as of March 19, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C4-10.\n8-K(1)\n001-35758\n4.5\nMarch 19, 2015\n4.20\nSixteenth Supplemental Indenture, dated as of March 19, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C5-15.\n8-K(1)\n001-35758\n4.6\nMarch 19, 2015\n4.21\nTwentieth Supplemental Indenture, dated as of March 26, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C9-10.\n8-K(1)\n001-35758\n4.5\nMarch 26, 2015\n4.22\nTwenty-First Supplemental Indenture, dated as of March 26, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C10-15.\n8-K(1)\n001-35758\n4.6\nMarch 26, 2015\n4.23\nTwenty-Sixth Supplemental Indenture, dated as of April 2, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C14-10.\n8-K(1)\n001-35758\n4.5\nApril 2, 2015\n4.24\nThirtieth Supplemental Indenture, dated as of April 9, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C19-10.\n8-K(1)\n001-35758\n4.5\nApril 9, 2015\n4.25\nThirty-First Supplemental Indenture, dated as of April 9, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C20-15.\n8-K(1)\n001-35758\n4.6\nApril 9, 2015\n4.26\nThirty-Fifth Supplemental Indenture, dated as of April 14, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C24-10.\n8-K(1)\n001-35758\n4.5\nApril 14, 2015\n4.27\nThirty-Sixth Supplemental Indenture, dated as of April 14, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C25-15.\n8-K(1)\n001-35758\n4.6\nApril 14, 2015\n96\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n4.28\nThirty-Eighth Supplemental Indenture, dated as of April 21, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C27-10.\n8-K(1)\n001-35758\n4.3\nApril 21, 2015\n4.29\nThirty-Ninth Supplemental Indenture, dated as of April 21, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C28-15.\n8-K(1)\n001-35758\n4.4\nApril 21, 2015\n4.30\nForty-Third Supplemental Indenture, dated as of April 27, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C32-10.\n8-K(1)\n001-35758\n4.5\nApril 27, 2015\n4.31\nForty-Fourth Supplemental Indenture, dated as of April 27, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C33-15.\n8-K(1)\n001-35758\n4.6\nApril 27, 2015\n4.32\nForty-Eighth Supplemental Indenture, dated as of May 1, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.00% Solar Bonds, Series 2015/12-10.\n8-K(1)\n001-35758\n4.5\nMay 1, 2015\n4.33\nForty-Ninth Supplemental Indenture, dated as of May 1, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.75% Solar Bonds, Series 2015/13-15.\n8-K(1)\n001-35758\n4.6\nMay 1, 2015\n4.34\nFifty-Second Supplemental Indenture, dated as of May 11, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C36-10\n.\n8-K(1)\n001-35758\n4.4\nMay 11, 2015\n4.35\nFifty-Third Supplemental Indenture, dated as of May 11, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C37-15.\n8-K(1)\n001-35758\n4.5\nMay 11, 2015\n4.36\nFifty-Seventh Supplemental Indenture, dated as of May 18, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C40-10.\n8-K(1)\n001-35758\n4.4\nMay 18, 2015\n4.37\nFifty-Eighth Supplemental Indenture, dated as of May 18, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C41-15.\n8-K(1)\n001-35758\n4.5\nMay 18, 2015\n97\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n4.38\nSixty-First Supplemental Indenture, dated as of May 26, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C44-10.\n8-K(1)\n001-35758\n4.4\nMay 26, 2015\n4.39\nSixty-Second Supplemental Indenture, dated as of May 26, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C45-15.\n8-K(1)\n001-35758\n4.5\nMay 26, 2015\n4.40\nSeventieth Supplemental Indenture, dated as of June 16, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C52-10.\n8-K(1)\n001-35758\n4.4\nJune 16, 2015\n4.41\nSeventy-First Supplemental Indenture, dated as of June 16, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C53-15.\n8-K(1)\n001-35758\n4.5\nJune 16, 2015\n4.42\nSeventy-Fourth Supplemental Indenture, dated as of June 22, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C56-10.\n8-K(1)\n001-35758\n4.4\nJune 23, 2015\n4.43\nSeventy-Fifth Supplemental Indenture, dated as of June 22, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C57-15\n.\n8-K(1)\n001-35758\n4.5\nJune 23, 2015\n4.44\nEightieth Supplemental Indenture, dated as of June 29, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C61-10.\n8-K(1)\n001-35758\n4.5\nJune 29, 2015\n4.45\nEighty-First Supplemental Indenture, dated as of June 29, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C62-15.\n8-K(1)\n001-35758\n4.6\nJune 29, 2015\n4.46\nNinetieth Supplemental Indenture, dated as of July 20, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C71-10.\n8-K(1)\n001-35758\n4.5\nJuly 21, 2015\n4.47\nNinety-First Supplemental Indenture, dated as of July 20, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C72-15.\n8-K(1)\n001-35758\n4.6\nJuly 21, 2015\n98\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n4.48\nNinety-Fifth Supplemental Indenture, dated as of July 31, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.00% Solar Bonds, Series 2015/20-10.\n8-K(1)\n001-35758\n4.5\nJuly 31, 2015\n4.49\nNinety-Sixth Supplemental Indenture, dated as of July 31, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.75% Solar Bonds, Series 2015/21-15.\n8-K(1)\n001-35758\n4.6\nJuly 31, 2015\n4.50\nOne Hundred-and-Fifth Supplemental Indenture, dated as of August 10, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C81-10.\n8-K(1)\n001-35758\n4.5\nAugust 10, 2015\n4.51\nOne Hundred-and-Eleventh Supplemental Indenture, dated as of August 17, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C87-15.\n8-K(1)\n001-35758\n4.6\nAugust 17, 2015\n4.52\nOne Hundred-and-Sixteenth Supplemental Indenture, dated as of August 24, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C92-15.\n8-K(1)\n001-35758\n4.6\nAugust 24, 2015\n4.53\nOne Hundred-and-Twenty-First Supplemental Indenture, dated as of August 31, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C97-15.\n8-K(1)\n001-35758\n4.6\nAugust 31, 2015\n4.54\nOne Hundred-and-Twenty-Eighth Supplemental Indenture, dated as of September 14, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C101-10.\n8-K(1)\n001-35758\n4.5\nSeptember 15, 2015\n4.55\nOne Hundred-and-Twenty-Ninth Supplemental Indenture, dated as of September 14, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C102-15.\n8-K(1)\n001-35758\n4.6\nSeptember 15, 2015\n4.56\nOne Hundred-and-Thirty-Third Supplemental Indenture, dated as of September 28, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C106-10.\n8-K(1)\n001-35758\n4.5\nSeptember 29, 2015\n99\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n4.57\nOne Hundred-and-Thirty-Fourth Supplemental Indenture, dated as of September 28, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C107-15.\n8-K(1)\n001-35758\n4.6\nSeptember 29, 2015\n4.58\nOne Hundred-and-Thirty-Eighth Supplemental Indenture, dated as of October 13, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C111-10.\n8-K(1)\n001-35758\n4.5\nOctober 13, 2015\n4.59\nOne Hundred-and-Forty-Third Supplemental Indenture, dated as of October 30, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.00% Solar Bonds, Series 2015/25-10.\n8-K(1)\n001-35758\n4.5\nOctober 30, 2015\n4.60\nOne Hundred-and-Forty-Fourth Supplemental Indenture, dated as of October 30, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.75% Solar Bonds, Series 2015/26-15.\n8-K(1)\n001-35758\n4.6\nOctober 30, 2015\n4.61\nOne Hundred-and-Forty-Eighth Supplemental Indenture, dated as of November 4, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C116-10.\n8-K(1)\n001-35758\n4.5\nNovember 4, 2015\n4.62\nOne Hundred-and-Fifty-Third Supplemental Indenture, dated as of November 16, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C121-10.\n8-K(1)\n001-35758\n4.5\nNovember 17, 2015\n4.63\nOne Hundred-and-Fifty-Fourth Supplemental Indenture, dated as of November 16, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C122-15.\n8-K(1)\n001-35758\n4.6\nNovember 17, 2015\n4.64\nOne Hundred-and-Fifty-Eighth Supplemental Indenture, dated as of November 30, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C126-10.\n8-K(1)\n001-35758\n4.5\nNovember 30, 2015\n4.65\nOne Hundred-and-Fifty-Ninth Supplemental Indenture, dated as of November 30, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C127-15.\n8-K(1)\n001-35758\n4.6\nNovember 30, 2015\n100\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n4.66\nOne Hundred-and-Sixty-Third Supplemental Indenture, dated as of December 14, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C131-10.\n8-K(1)\n001-35758\n4.5\nDecember 14, 2015\n4.67\nOne Hundred-and-Sixty-Fourth Supplemental Indenture, dated as of December 14, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C132-15.\n8-K(1)\n001-35758\n4.6\nDecember 14, 2015\n4.68\nOne Hundred-and-Sixty-Eighth Supplemental Indenture, dated as of December 28, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 4.70% Solar Bonds, Series 2015/C136-10.\n8-K(1)\n001-35758\n4.5\nDecember 28, 2015\n4.69\nOne Hundred-and-Sixty-Ninth Supplemental Indenture, dated as of December 28, 2015, by and between SolarCity and the Trustee, related to SolarCity’s 5.45% Solar Bonds, Series 2015/C137-15.\n8-K(1)\n001-35758\n4.6\nDecember 28, 2015\n4.70\nOne Hundred-and-Seventy-Third Supplemental Indenture, dated as of January 29, 2016, by and between SolarCity and the Trustee, related to SolarCity’s 5.00% Solar Bonds, Series 2016/4-10.\n8-K(1)\n001-35758\n4.5\nJanuary 29, 2016\n4.71\nOne Hundred-and-Seventy-Fourth Supplemental Indenture, dated as of January 29, 2016, by and between SolarCity and the Trustee, related to SolarCity’s 5.75% Solar Bonds, Series 2016/5-15.\n8-K(1)\n001-35758\n4.6\nJanuary 29, 2016\n4.72\nDescription of Registrant’s Securities\n—\n—\n—\n—\nX\n10.1**\nForm of Indemnification Agreement between the Registrant and its directors and officers.\nS-1/A\n333-164593\n10.1\nJune 15, 2010\n10.2**\n2003 Equity Incentive Plan.\nS-1/A\n333-164593\n10.2\nMay 27, 2010\n10.3**\nForm of Stock Option Agreement under 2003 Equity Incentive Plan.\nS-1\n333-164593\n10.3\nJanuary 29, 2010\n10.4**\nAmended and Restated 2010 Equity Incentive Plan.\n10-K\n001-34756\n10.4\nFebruary 23, 2018\n10.5**\nForm of Stock Option Agreement under 2010 Equity Incentive Plan.\n10-K\n001-34756\n10.6\nMarch 1, 2017\n10.6**\nForm of Restricted Stock Unit Award Agreement under 2010 Equity Incentive Plan.\n10-K\n001-34756\n10.7\nMarch 1, 2017\n101\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n10.7**\nAmended and Restated 2010 Employee Stock Purchase Plan, effective as of February 1, 2017.\n10-K\n001-34756\n10.8\nMarch 1, 2017\n10.8**\n2019 Equity Incentive Plan.\nS-8\n333-232079\n4.2\nJune 12, 2019\n10.9**\nForm of Stock Option Agreement under 2019 Equity Incentive Plan.\nS-8\n333-232079\n4.3\nJune 12, 2019\n10.10**\nForm of Restricted Stock Unit Award Agreement under 2019 Equity Incentive Plan.\nS-8\n333-232079\n4.4\nJune 12, 2019\n10.11**\nEmployee Stock Purchase Plan, effective as of June 12, 2019.\nS-8\n333-232079\n4.5\nJune 12, 2019\n10.12**\n2012 SolarCity Equity Incentive Plan and form of agreements used thereunder.\nS-1(1)\n333-184317\n10.3\nOctober 5, 2012\n10.13**\nOffer Letter between the Registrant and Elon Musk dated October 13, 2008.\nS-1\n333-164593\n10.9\nJanuary 29, 2010\n10.14**\nPerformance Stock Option Agreement between the Registrant and Elon Musk dated January 21, 2018.\nDEF 14A\n001-34756\nAppendix A\nFebruary 8, 2018\n10.15\nIndemnification Agreement, effective as of June 23, 2020, between Registrant and Elon R. Musk.\n10-Q\n001-34756\n10.4\nJuly 28, 2020\n10.16\nForm of Call Option Confirmation relating to 1.25% Convertible Senior Notes Due March 1, 2021.\n8-K\n001-34756\n10.3\nMarch 5, 2014\n10.17†\nSupply Agreement between Panasonic Corporation and the Registrant dated October 5, 2011.\n10-K\n001-34756\n10.50\nFebruary 27, 2012\n10.18†\nAmendment No. 1 to Supply Agreement between Panasonic Corporation and the Registrant dated October 29, 2013.\n10-K\n001-34756\n10.35A\nFebruary 26, 2014\n10.19\nAgreement between Panasonic Corporation and the Registrant dated July 31, 2014.\n10-Q\n001-34756\n10.1\nNovember 7, 2014\n10.20†\nGeneral Terms and Conditions between Panasonic Corporation and the Registrant dated October 1, 2014.\n8-K\n001-34756\n10.2\nOctober 11, 2016\n10.21\nLetter Agreement, dated as of February 24, 2015, regarding addition of co-party to General Terms and Conditions, Production Pricing Agreement and Investment Letter Agreement between Panasonic Corporation and the Registrant.\n10-K\n001-34756\n10.25A\nFebruary 24, 2016\n102\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n10.22†\nInvestment Letter Agreement between Panasonic Corporation and the Registrant dated October 1, 2014.\n10-Q\n001-34756\n10.4\nNovember 7, 2014\n10.23\nAmendment to Gigafactory Documents, dated April 5, 2016, by and among the Registrant, Panasonic Corporation, Panasonic Corporation of North America and Panasonic Energy Corporation of North America.\n10-Q\n001-34756\n10.2\nMay 10, 2016\n10.24††\n2019 Pricing Agreement (Japan Cells) with respect to 2011 Supply Agreement, executed September 20, 2019, by and among the Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation and SANYO Electric Co., Ltd.\n10-Q\n001-34756\n10.6\nOctober 29, 2019\n10.25††\n2020 Pricing Agreement (Gigafactory 2170 Cells), entered into on June 9, 2020, by and among Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation and Panasonic Corporation of North America\n.\n10-Q\n001-34756\n10.3\nJuly 28, 2020\n10.26††\n2021 Pricing Agreement (Japan Cells) with respect to 2011 Supply Agreement, executed December 29, 2020, by and among the Registrant, Tesla Motors Netherlands B.V., Panasonic Corporation of North America and SANYO Electric Co., Ltd.\n10-K\n001-34756\n10.39\nFebruary 8, 2021\n10.27††\nAmended and Restated Factory Lease, executed as of March 26, 2019, by and between the Registrant and Panasonic Energy North America, a division of Panasonic Corporation of North America, as tenant.\n10-Q\n001-34756\n10.3\nJuly 29, 2019\n10.28††\nLease Amendment, executed September 20, 2019, by and among the Registrant, Panasonic Corporation of North America, on behalf of its division Panasonic Energy of North America, with respect to the Amended and Restated Factory Lease, executed as of March 26, 2019.\n10-Q\n001-34756\n10.7\nOctober 29, 2019\n10.29††\nSecond Lease Amendment, entered into on June 9, 2020, by and between the Registrant and Panasonic Energy of North America, a division of Panasonic Corporation of North America, with respect to the Amended and Restated Factory Lease dated January 1, 2017\n.\n10-Q\n001-34756\n10.1\nJuly 28, 2020\n10.30†\nAgreement for Tax Abatement and Incentives, dated as of May 7, 2015, by and between Tesla Motors, Inc. and the State of Nevada, acting by and through the Nevada Governor’s Office of Economic Development.\n10-Q\n001-34756\n10.1\nAugust 7, 2015\n103\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n10.31\nAmended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of September 2, 2014, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.\n10-Q(1)\n001-35758\n10.16\nNovember 6, 2014\n10.32\nFirst Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of October 31, 2014, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.\n10-K(1)\n001-35758\n10.16a\nFebruary 24, 2015\n10.33\nSecond Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of December 15, 2014, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.\n10-K(1)\n001-35758\n10.16b\nFebruary 24, 2015\n10.34\nThird Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of February 12, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.\n10-Q(1)\n001-35758\n10.16c\nMay 6, 2015\n10.35\nFourth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of March 30, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, Inc.\n10-Q(1)\n001-35758\n10.16d\nMay 6, 2015\n10.36\nFifth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of June 30, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.\n10-Q(1)\n001-35758\n10.16e\nJuly 30, 2015\n104\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n10.37\nSixth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of September 1, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.\n10-Q(1)\n001-35758\n10.16f\nOctober 30, 2015\n10.38\nSeventh Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of October 9, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC\n.\n10-Q(1)\n001-35758\n10.16g\nOctober 30, 2015\n10.39\nEighth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of October 26, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.\n10-Q(1)\n001-35758\n10.16h\nOctober 30, 2015\n10.40\nNinth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of December 9, 2015, by and between The Research Foundation For The State University of New York, on behalf of the College of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.\n10-K(1)\n001-35758\n10.16i\nFebruary 10, 2016\n10.41\nTenth Amendment to Amended and Restated Agreement For Research & Development Alliance on Triex Module Technology, effective as of March 31, 2017, by and between The Research Foundation For The State University of New York, on behalf of the Colleges of Nanoscale Science and Engineering of the State University of New York, and Silevo, LLC.\n10-Q\n001-34756\n10.8\nMay 10, 2017\n10.42\nEleventh Amendment to Amended and Restated Agreement for Research & Development Alliance on Triex Module Technology, effective as of July 22, 2020, among the Research Foundation for the State University of New York, Silevo, LLC and Tesla Energy Operations, Inc\n.\n10-Q\n001-34756\n10.6\nJuly 28, 2020\n105\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n10.43\nTwelfth Amendment to Amended and Restated Agreement for Research & Development Alliance on Triex Module Technology, effective as of May 1, 2021, among the Research Foundation for the State University of New York, Silevo, LLC and Tesla Energy Operations, Inc\n.\n10-Q\n001-34756\n10.1\nOctober 25, 2021\n10.44††\nGrant Contract for State-Owned Construction Land Use Right, dated as of October 17, 2018, by and between Shanghai Planning and Land Resource Administration Bureau, as grantor, and Tesla (Shanghai) Co., Ltd., as grantee (English translation).\n10-Q\n001-34756\n10.2\nJuly 29, 2019\n10.45\nCredit Agreement, dated as of January 20, 2023, among Tesla, Inc., the Lenders and Issuing Banks from time to time party thereto, Citibank, N.A., as Administrative Agent and Deutsche Bank Securities, Inc., as Syndication Agent\n10-K\n001-34756\n10.59\nJanuary 31, 2023\n19\nInsider Trading Policy\n—\n—\n—\n—\nX\n21.1\nList of Subsidiaries of the Registrant\n—\n—\n—\n—\nX\n23.1\nConsent of PricewaterhouseCoopers LLP, Independent Registered Public Accounting Firm\n—\n—\n—\n—\nX\n31.1\nRule 13a-14(a) / 15(d)-14(a) Certification of Principal Executive Officer\n—\n—\n—\n—\nX\n31.2\nRule 13a-14(a) / 15(d)-14(a) Certification of Principal Financial Officer\n—\n—\n—\n—\nX\n32.1*\nSection 1350 Certifications\n—\n—\n—\n—\nX\n97\nTesla, Inc. Clawback Policy\n10-K\n001-34756\n97\nJanuary 29, 2024\n101.INS\nInline XBRL Instance Document\n—\n—\n—\n—\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n—\n—\n—\n—\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n—\n—\n—\n—\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n—\n—\n—\n—\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n—\n—\n—\n—\nX\n106\nExhibit\nNumber\nIncorporated by Reference\nFiled\nHerewith\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n—\n—\n—\n—\nX\n104\nCover Page Interactive Data File (formatted as inline XBRL with applicable taxonomy extension information contained in Exhibits 101)\n*\nFurnished herewith\n**\nIndicates a management contract or compensatory plan or arrangement\n†\nConfidential treatment has been requested for portions of this exhibit\n††\nPortions of this exhibit have been redacted in compliance with Regulation S-K Item 601(b)(10).\n(1)\nIndicates a filing of SolarCity\n(2)\nIndicates a filing of Maxwell Technologies, Inc. \nITEM 16. FORM 10-K SUMMARY\nNone.\n107\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTesla, Inc.\n \nDate: January 29, 2025\n/s/ Elon Musk\nElon Musk\nChief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n \n \n \n/s/ Elon Musk\nChief Executive Officer and Director (Principal Executive Officer)\nJanuary 29, 2025\nElon Musk\n \n/s/ Vaibhav Taneja\nChief Financial Officer (Principal Financial Officer and Principal Accounting Officer)\nJanuary 29, 2025\nVaibhav Taneja\n \n \n \n \n \n/s/ Robyn Denholm\nDirector\nJanuary 29, 2025\nRobyn Denholm\n \n \n \n \n \n/s/ Ira Ehrenpreis\nDirector\nJanuary 29, 2025\nIra Ehrenpreis\n \n \n \n \n \n/s/ Joseph Gebbia\nDirector\nJanuary 29, 2025\nJoseph Gebbia\n \n \n \n \n \n/s/ James Murdoch\nDirector\nJanuary 29, 2025\nJames Murdoch\n/s/ Kimbal Musk\nDirector\nJanuary 29, 2025\nKimbal Musk\n \n \n \n/s/ JB Straubel\nDirector\nJanuary 29, 2025\nJB Straubel\n \n \n \n \n \n/s/ Kathleen Wilson-Thompson\nDirector\nJanuary 29, 2025\nKathleen Wilson-Thompson\n \n \n108"
  }
}