{
  "ticker": "TT",
  "cik": "0001466258",
  "company_name": "Trane Technologies plc",
  "filing_date": "2025-02-06",
  "accession": "0001466258-25-000039",
  "primary_doc": "tt-20241231.htm",
  "item_sections": {
    "item1": "Item 1, \"Business - Asbestos-Related Matters,\" Part I,",
    "item1a": "Item 1A, \"Risk Factors - Risks Related to Litigation,\" Part I, Item 3, \"Legal Proceedings,\" and Part II, Item 8, Consolidated Financial Statements, and Note 20, \"Commitments and Contingencies.\"\n29\nTable of Contents\nTrends and Economic Events\nWe are a global corporation with worldwide operations. As a global business, our operations are affected by worldwide, regional and industry-specific economic factors as well as geopolitical, environmental and social factors wherever we operate or do business. Our geographic diversity and the breadth of our products and services portfolios have helped mitigate the impact of any one industry or the economy of any single country on our consolidated operating results.\nGiven our broad range of products manufactured and geographic markets served, management uses a variety of factors to predict the outlook for the Company. We monitor key competitors and customers in order to gauge relative performance and the outlook for the future. We regularly perform detailed evaluations of the different market segments we serve to proactively detect trends and to adapt our strategies accordingly, including potential triggers and actions to be taken under recessionary scenarios. In addition, we believe our backlog and order levels are indicative of future revenue and thus are a key measure of anticipated performance.\nWe expect conditions to remain mixed across our served end markets and geographies. Overall Commercial HVAC markets in Americas and EMEA remain strong due to demand for our differentiated customer driven solutions and the benefits of installing energy efficient products and decarbonizing the built environment. In Asia, markets are more dynamic, with weak macro-economic conditions driving soft demand in China and more stable macro-economic conditions driving modest demand in the rest of Asia. Transport refrigeration markets are experiencing lower demand as freight rates remain low, particularly in the United States. Residential markets in the United States have improved in 2024 but are undergoing a regulatory transition which could bring short-term variation in demand, and uncertainties remain from economic risks and higher interest rates.\nWe continue to see material and wage inflation impact our cost structure. Our performance may be impacted by future developments that are uncertain. Geopolitical risks and macroeconomic events could cause disruptions to operations, supply chains, end markets, financial markets and overall economic conditions which could negatively impact our business.\nWe believe we have a solid foundation of global brands that are highly differentiated in all of our major product lines. Our geographic mix, diversity of our portfolio, and our large installed product base, provide growth opportunities from replacement demand and within our service revenue streams. Additionally, we are investing substantial resources to innovate and develop new products and services which we expect to drive future growth.\n30\nTable of Contents\nResults of Operations\nNon-GAAP Financial Measures\nOrganic Revenue\n \nWe define organic revenue as net revenues adjusted for the impact of currency, acquisitions and divestitures\n. \nOrganic revenue is not defined under U.S. Generally Accepted Accounting Principles (GAAP) and may not be comparable to similarly-titled measures used by other companies and should not be considered a substitute for revenue as determined in accordance with GAAP.\n \nSelected references are made to revenue growth on an organic basis so that certain financial results can be viewed without the impacts of fluctuations in foreign currency rates and acquisitions, thereby providing comparisons of operating performance from period to period of the business that we have owned during both periods presented. We believe organic revenue growth provides investors with useful supplemental information about our revenues in both periods presented.\nSegment Adjusted EBITDA\nWe define Segment Adjusted EBITDA as net earnings excluding interest expense, income taxes, depreciation and amortization, restructuring, non-cash adjustments for contingent consideration, merger and acquisition-related costs, unallocated corporate expenses, discontinued operations and other non-recurring items. Segment Adjusted EBITDA, and ratios based on it, are used in the development of annual operating plans, including capital expenditure and operational budgets, and in measuring performance against targets for purposes of incentive compensation. Segment Adjusted EBITDA also provides a useful tool for assessing the operating performance and comparability between periods and our ability to generate cash because it excludes the impact of certain non-cash or non-recurring items that can vary significantly from period to period. Segment Adjusted EBITDA is not defined under GAAP and may not be comparable to similarly-titled measures used by other companies and should not be considered a substitute for net earnings or other results as determined in accordance with GAAP.\n \nSegment Adjusted Operating Income\nWe define Segment Adjusted Operating Income as operating income adjusted to exclude restructuring costs, merger and acquisition-related costs, non-cash adjustments for contingent consideration and other non-recurring items. Segment Adjusted Operating Income, and ratios based on it, are used to provide a comprehensive view of segment profitability and evaluate efficient returns on assets. Segment Adjusted Operating Income also provides a useful tool for assessing the comparability between periods because it eliminates non-recurring items that can vary from period to period. Segment Adjusted Operating Income is not defined under GAAP and may not be comparable to similarly-titled measures used by other companies and should not be considered a substitute for net earnings or other results as determined in accordance with GAAP.\nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023 - Consolidated Results\nDollar amounts in millions\n2024\n2023\nPeriod Change\n2024\n % of revenues\n2023\n % of revenues\nNet revenues\n$\n19,838.2 \n$\n17,677.6 \n$\n2,160.6 \nCost of goods sold\n(12,757.7)\n(11,820.4)\n(937.3)\n64.3%\n66.9%\nGross profit\n7,080.5 \n5,857.2 \n1,223.3 \n35.7%\n33.1%\nSelling and administrative expenses\n(3,580.4)\n(2,963.2)\n(617.2)\n18.1%\n16.7%\nOperating income\n3,500.1 \n2,894.0 \n606.1 \n17.6%\n16.4%\nInterest expense\n(238.4)\n(234.5)\n(3.9)\nOther income/(expense), net\n(19.9)\n(92.2)\n72.3 \n \n \nEarnings before income taxes\n3,241.8 \n2,567.3 \n674.5 \nProvision for income taxes\n(627.6)\n(498.4)\n(129.2)\n \n \nEarnings from continuing operations\n2,614.2 \n2,068.9 \n545.3 \nDiscontinued operations, net of tax\n(24.7)\n(27.2)\n2.5 \n \n \nNet earnings\n$\n2,589.5 \n$\n2,041.7 \n$\n547.8 \n31\nTable of Contents\nNet Revenues\nNet revenues\n for the year ended December 31, 2024 increased by 12.2%, or $2,160.6 million, compared with the same period of 2023.\nThe components of the period change were as follows:\nVolume\n9.4 \n%\nPricing\n2.3 \n%\nOrganic revenue \n(1)\n11.7 \n%\nAcquisitions\n1.0 \n%\nCurrency translation\n(0.5)\n%\nTotal \n12.2 \n%\n(1) \nRepresents a non-GAAP measure. For more information, see \"Non-GAAP Financial Measures.\"\nThe increase in \nNet revenues\n was primarily driven by higher volumes as a result of stronger end-customer demand within our Americas and EMEA segments, realization of price increases and incremental revenue from acquisitions, partially offset by an unfavorable impact from foreign currency translation. Refer to \"Results by Segment\" below for a discussion of \nNet revenues\n by segment.\nGross Profit Margin\nGross profit margin for the year ended December 31, 2024 increased 260 basis points to 35.7% compared to 33.1% for the same period of 2023 primarily due to gross productivity and price realization, partially offset by inflation.\nSelling and Administrative Expenses\nSelling and administrative expenses \nfor the year ended December 31, 2024 increased by 20.8%, or $617.2 million, compared with the same period of 2023. The increase in \nSelling and administrative expenses\n was primarily driven by an increase in human capital costs related to investing in our people, higher sales commissions, incremental selling and administrative expenses of acquired businesses and higher levels of business reinvestment. Additionally, non-cash adjustments to contingent consideration reduced \nSelling and administrative expenses \nfor the years ended December 31, 2024 and December 31, 2023 by $25.0 million and $49.3 million, respectively. \nSelling and administrative expenses\n as a percentage of \nNet revenues\n for the year ended December 31, 2024 increased 140 basis points from 16.7% to 18.1%.\nInterest Expense\nInterest expense\n for the year ended December 31, 2024 increased by 1.7% or $3.9 million compared with the same period of 2023 primarily due to the issuance of $500 million of 5.100% Senior Notes due in 2034. The increase in interest expense was partially offset by an increase in interest income from short-term investments purchased with proceeds from the debt issuance, which is reported in \nOther (income)/expense, net\n. We had no commercial paper outstanding as of December 31, 2024.\nProvision for Income Taxes\nThe 2024 effective tax rate was 19.4% which was lower than the U.S. Statutory rate of 21% due to excess tax benefits from employee share-based payments and earnings in non-U.S. jurisdictions, which, in aggregate have a lower effective tax rate, and includes the impact of the Organisation for Economic Co-operation and Development (OECD) tax reform initiative (Pillar Two), partially offset by U.S. state and local taxes. Revenues from non-U.S. jurisdictions accounted for approximately 26% of our total 2024 revenues, such that a material portion of our pretax income was earned and taxed outside the U.S. at rates up to 38%. When comparing the results of multiple reporting periods, among other factors, the mix of earnings between U.S. and foreign jurisdictions can cause variability in our overall effective tax rate.\nThe 2023 effective tax rate was 19.4% which was lower than the U.S. Statutory rate of 21% due to a $30.3 million reduction in valuation allowances primarily related to deferred tax assets associated with both foreign tax credits and operations of international subsidiaries. Additional items that impact the effective tax rate are excess tax benefits from employee share-based payments and earnings in non-U.S. jurisdictions, which in aggregate have a lower effective tax rate offset by an impairment of an equity investment, and U.S. state and local taxes.  Revenues from non-U.S. jurisdictions accounted for approximately 28% of our total 2023 revenues, such that a material portion of our pretax income was earned and taxed outside the U.S. at rates up to 38%. When comparing the results of multiple reporting periods, among other factors, the mix of earnings between U.S. and foreign jurisdictions can cause variability in our overall effective tax rate.\n32\nTable of Contents\nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023 - Segment Results\nWe operate under three reportable segments designed to create deep customer focus and relevance in markets around the world. Intercompany sales between segments are immaterial.\n•\nOur Americas segment innovates for customers in North America and Latin America. The Americas segment encompasses commercial heating, cooling and ventilation systems, building controls and solutions, and energy services and solutions; residential heating and cooling; and transport refrigeration systems and solutions. \n•\nOur EMEA segment innovates for customers in the Europe, Middle East and Africa region. The EMEA segment encompasses heating, cooling and ventilation systems, services and solutions for commercial buildings, and transport refrigeration systems and solutions.\n•\nOur Asia Pacific segment innovates for customers throughout the Asia Pacific region. The Asia Pacific segment encompasses heating, cooling and ventilation systems, services and solutions for commercial buildings and transport refrigeration systems and solutions.\nThe following discussion compares our results for each of our three reportable segments for the year ended December 31, 2024 compared to the year ended December 31, 2023.\nDollar amounts in millions\n2024\n2023\n% Change\nAmericas\nNet revenues\n$\n15,903.2 \n$\n13,832.0 \n15.0 \n%\nSegment Adjusted EBITDA\n3,318.3 \n2,669.6 \n24.3 \n%\nSegment Adjusted EBITDA as a percentage of net revenues\n20.9 \n%\n19.3 \n%\nEMEA\nNet revenues\n$\n2,556.7 \n$\n2,401.2 \n6.5 \n%\nSegment Adjusted EBITDA\n505.1 \n464.7 \n8.7 \n%\nSegment Adjusted EBITDA as a percentage of net revenues\n19.8 \n%\n19.4 \n%\nAsia Pacific\nNet revenues\n$\n1,378.3 \n$\n1,444.4 \n(4.6)\n%\nSegment Adjusted EBITDA\n329.3 \n321.3 \n2.5 \n%\nSegment Adjusted EBITDA as a percentage of net revenues\n23.9 \n%\n22.2 \n%\nTotal Net revenues\n$\n19,838.2 \n$\n17,677.6 \n12.2 \n%\nTotal Segment Adjusted EBITDA\n4,152.7 \n3,455.6 \n20.2 \n%\nTotal Segment Adjusted EBITDA as a percentage of net revenues\n20.9 \n%\n19.5 \n%\n33\nTable of Contents\nAmericas\nNet revenues\n for the year ended December 31, 2024 increased by 15.0% or $2,071.2 million, compared with the same period of 2023.\nThe components of the period change were as follows:\nVolume\n11.6 \n%\nPricing\n2.7 \n%\nOrganic revenue \n(1)\n14.3 \n%\nAcquisitions\n1.0 \n%\nCurrency translation\n(0.3)\n%\nTotal \n15.0 \n%\nThe increase in \norganic revenue\n was primarily driven by higher volumes led by strong demand within both our Commercial HVAC and Residential HVAC businesses and realization of price increases for both equipment and services within our Commercial HVAC business, partially offset by softer transport markets.  \nThe increase in revenue from acquisitions primarily relates to Helmer Scientific Inc (Helmer) acquired in the second quarter of 2023, Nuvolo Technologies Corporation (Nuvolo) acquired in the fourth quarter of 2023 and a Commercial HVAC sales channel acquisition in the third quarter of 2024. \nSegment Adjusted EBITDA margin for the year ended December 31, 2024 increased by 160 basis points to 20.9% compared to 19.3% for the same period of 2023 primarily due to price realization, gross productivity and higher volumes, partially offset by inflation and continued business reinvestment.\nEMEA\nNet revenues\n for the year ended December 31, 2024 increased by 6.5% or $155.5 million, compared with the same period of 2023.\nThe components of the period change were as follows:\nVolume\n4.9 \n%\nPricing\n0.9 \n%\nOrganic revenue \n(1)\n5.8 \n%\nAcquisitions\n1.3 \n%\nCurrency translation\n(0.6)\n%\nTotal \n6.5 \n%\nThe increase in \norganic revenue \nwas primarily driven by strong customer demand within our Commercial HVAC business and realization of price increases within both our Commercial HVAC and Transport Refrigeration businesses.\nThe increase in revenue from acquisitions primarily relates to MTA acquired in the second quarter of 2023.\nSegment Adjusted EBITDA margin for the year ended December 31, 2024 increased by 40 basis points to 19.8% compared to 19.4% for the same period of 2023 primarily due to favorable productivity and price, partially offset by inflation, continued business reinvestment and loss from a devaluation of the Egyptian pound.\nAsia Pacific\nNet revenues\n for the year ended December 31, 2024 decreased by 4.6% or $66.1 million, compared with the same period of 2023.\nThe components of the period change were as follows:\nVolume\n(4.2)\n%\nPricing\n1.2 \n%\nOrganic revenue \n(1)\n(3.0)\n%\nCurrency translation\n(1.6)\n%\nTotal\n(4.6)\n%\n34\nTable of Contents\nThe decrease in \norganic revenue \nwas primarily driven by lower volumes in China, partially offset by realization of price increases within our Commercial HVAC business and higher volumes in the rest of Asia. \nSegment Adjusted EBITDA margin for the year ended December 31, 2024 increased by 170 basis points to 23.9% compared to 22.2% for the same period of 2023 primarily due to gross productivity and price realization, partially offset by lower volumes, inflation and continued business reinvestment.  \nLiquidity and Capital Resources\nWe assess our liquidity in terms of our ability to generate cash to fund our operating, investing and financing activities. In doing so, we review and analyze our current cash on hand, the number of days our sales are outstanding, inventory turns, capital expenditure commitments and income tax payments. Our cash requirements primarily consist of the following:\n•\nFunding of working capital\n•\nDebt service requirements\n•\nFunding of capital expenditures\n•\nDividend payments\n•\nFunding of acquisitions, joint ventures and equity investments\n•\nShare repurchases\nOur primary sources of liquidity include cash balances on hand, cash flows from operations, proceeds from debt offerings, commercial paper, and borrowing availability under our existing credit facilities. We earn a significant amount of our operating income in jurisdictions where it is deemed to be permanently reinvested. Our most prominent jurisdiction of operation is the U.S. We expect existing cash and cash equivalents available to the U.S. operations, the cash generated by our U.S. operations, our committed credit lines as well as our expected ability to access the capital and debt markets will be sufficient to fund our U.S. operating and capital needs for at least the next twelve months and thereafter for the foreseeable future. In addition, we expect existing non-U.S. cash and cash equivalents and the cash generated by our non-U.S. operations will be sufficient to fund our non-U.S. operating and capital needs for at least the next twelve months and thereafter for the foreseeable future. The maximum aggregate amount of unsecured commercial paper notes available to be issued, on a private placement basis, under the commercial paper program is $2.0 billion, of which we had no outstanding balance as of December 31, 2024.\nAs of December 31, 2024, we had $1,590.1 million of cash and cash equivalents on hand, of which $1,423.0 million was held by non-U.S. subsidiaries. Cash and cash equivalents held by our non-U.S. subsidiaries are generally available for use in our U.S. operations via intercompany loans, equity infusions or via distributions from direct or indirectly owned non-U.S. subsidiaries for which we do not assert permanent reinvestment. In general, repatriation of cash to the U.S. can be completed with no significant incremental U.S. tax. However, to the extent that we repatriate funds from non-U.S. subsidiaries for which we assert permanent reinvestment to fund our U.S. operations, we would be required to accrue and pay applicable non-U.S. taxes. As of December 31, 2024, we currently have no plans to repatriate funds from subsidiaries for which we assert permanent reinvestment.\nShare repurchases are made in accordance with our balanced capital allocation strategy, subject to market conditions and regulatory requirements. In February 2022, our Board of Directors authorized the repurchase of up to $3.0 billion of our ordinary shares (2022 Authorization) and in December 2024, our Board of Directors authorized the repurchase of up to an additional $5.0 billion of our ordinary shares (2024 Authorization) upon the conclusion of the 2022 Authorization. During the year ended December 31, 2024, we repurchased and canceled approximately $1.3 billion of ordinary shares, leaving $1.2 billion remaining under the 2022 Authorization and $5.0 billion remaining under the 2024 Authorization. Additionally, during the period after December 31, 2024 through January 31, 2025, we repurchased approximately $100 million of our ordinary shares under the 2022 Authorization.\nWe expect to pay a competitive and growing dividend. Since the launch of Trane Technologies in March 2020, we have increased our quarterly dividend per share by 58%, from $0.53 to $0.84 per ordinary share, or $2.12 to $3.36 per share annualized. All four 2024 quarterly dividends were paid during the year ended December 31, 2024. In February 2025, our Board of Directors declared an increase in our quarterly share dividend by 12%, from $0.84 to $0.94 per ordinary share, or $3.36 to $3.76 per share annualized starting in the first quarter of 2025. \nWe continue to actively manage and strengthen our business portfolio to meet the current and future needs of our customers. We achieve this partly through engaging in research and development and sustaining activities and partly through acquisitions. Sustaining activities include costs incurred to reduce production costs, improve existing products, create custom solutions for customers and provide support to our manufacturing facilities. Each year, we make investments in new product development and new technology innovation as they are key factors in achieving our strategic objectives as a leader in the climate sector. In addition, we make investments in technology and business for our operational sustainability programs. Our research and development and sustaining costs account for approximately 2% of annual\n Net revenues. \n35\nTable of Contents\nIn pursuing our business strategy, we routinely conduct discussions, evaluate targets and enter into agreements regarding possible acquisitions, divestitures, joint ventures and equity investments. We have acquired several businesses, entered into joint ventures and invested in companies that complement existing products and services further enhancing our product portfolio. We deployed capital of approximately $197 million and $881 million to acquisitions and equity investments completed during the years ended December 31, 2024 and December 31, 2023, respectively. In 2024, we committed capital of approximately $470 million attributable to acquisitions and equity investments that were signed in 2024 and were closed in 2024 or in January 2025.\nWe incur costs associated with restructuring initiatives intended to result in improved operating performance, profitability and working capital levels. Actions associated with these initiatives may include workforce reductions, improving manufacturing productivity, realignment of management structures and rationalizing certain assets. We believe that our existing cash balances, anticipated cash flow from operations, committed credit lines and access to the capital markets will be sufficient to fund share repurchases, dividends, research and development, sustaining activities,\n \nbusiness portfolio changes and ongoing restructuring actions.\nCertain of our subsidiaries entered into Funding Agreements with Aldrich and Murray pursuant to which those subsidiaries are obligated, among other things, to pay the costs and expenses of Aldrich and Murray during the pendency of the Chapter 11 cases to the extent distributions from their respective subsidiaries are insufficient to do so and to provide an amount for the funding for a trust established pursuant to section 524(g) of the Bankruptcy Code, to the extent that the other assets of Aldrich and Murray are insufficient to provide the requisite trust funding. During the third quarter of 2021, Aldrich and Murray filed a motion with the Bankruptcy Court to create a $270.0 million qualified settlement fund (QSF). The funds held in the QSF would be available to provide funding for the Section 524(g) Trust upon effectiveness of the Plan. On January 27, 2022, the Bankruptcy Court granted the request to fund the QSF, which was funded on March 2, 2022.\nLiquidity\nThe following table contains several key measures of our financial condition and liquidity at the periods ended December 31:\nIn millions\n2024\n2023\nCash and cash equivalents\n$\n1,590.1 \n$\n1,095.3 \nShort-term borrowings and current maturities of long-term debt\n452.2 \n801.9 \nLong-term debt\n4,318.1 \n3,977.9 \nTotal debt\n4,770.3 \n4,779.8 \nTotal Trane Technologies plc shareholders' equity\n7,457.4 \n6,995.2 \nTotal equity\n7,486.9 \n7,017.0 \nDebt-to-total capital ratio\n38.9 \n%\n40.5 \n%\nDebt and Credit Facilities\nAs of December 31, 2024, our short-term obligations primarily consist of current maturities of $157.2 million that mature in June 2025 and $295.0 million of fixed rate debentures that contain a put feature that the holders may exercise on each anniversary of the issuance date. If exercised, we are obligated to repay in whole or in part, at the holder's option, the outstanding principal amount (plus accrued and unpaid interest) of the debentures held by the holder. In accordance with notice requirements as specified in the offering documents, holders had the option to exercise puts up to $37.2 million for settlement in February 2025 but did not exercise such option. In accordance with notice requirements as specified in the offering documents, holders will have the option to exercise puts up to $257.8 million for settlement in November 2025. We also maintain a commercial paper program which is used for general corporate purposes. Under the program, the maximum aggregate amount of unsecured commercial paper notes available to be issued, on a private placement basis, is $2.0 billion as of December 31, 2024. We had no commercial paper outstanding at December 31, 2024 and December 31, 2023. See Note 7, \"Debt and Credit Facilities,\" to the Consolidated Financial Statements for additional information regarding the terms of our short-term obligations.\nOur long-term obligations primarily consist of long-term debt with final maturity dates ranging between 2026 and 2049. In addition, we maintain two $1.0 billion senior unsecured revolving credit facilities, one of which matures in June 2026 and the other which matures in April 2027. The facilities provide support for our commercial paper program and can be used for working capital and other general corporate purposes. Total commitments of $2.0 billion were unused at December 31, 2024 and December 31, 2023. See Note 7, \"Debt and Credit Facilities,\" to the Consolidated Financial Statements and further below in \nSupplemental Guarantor Financial Information\n for additional information regarding the terms of our long-term obligations and their related guarantees.\n36\nTable of Contents\nCash Flows\nThe following table reflects the major categories of cash flows for the years ended December 31, respectively. For additional details, please see the Consolidated Statements of Cash Flows in the Consolidated Financial Statements.\nIn millions\n2024\n2023\nNet cash provided by continuing operating activities\n$\n3,177.7 \n$\n2,426.8 \nNet cash used in continuing investing activities\n(562.9)\n(1,172.2)\nNet cash used in continuing financing activities\n(2,020.6)\n(1,350.3)\nOperating Activities\nNet cash provided by continuing operating activities for the year ended December 31, 2024 was $3,177.7 million, of which net income provided $2,938.8 million after adjusting for non-cash transactions. Net cash provided by continuing operating activities for the year ended December 31, 2023 was $2,426.8 million, of which net income provided $2,499.6 million after adjusting for non-cash transactions. The year-over-year increase in net cash from continuing operating activities was primarily due to higher net earnings and an improved cash conversion cycle. \nInvesting Activities\nCash flows from investing activities represents inflows and outflows regarding the purchase and sale of assets. Primary activities associated with these items include capital expenditures, proceeds from the sale of property, plant and equipment, acquisitions, funding of joint ventures and other equity investments and purchases and sales of short-term investments. During the year ended December 31, 2024, net cash used in investing activities from continuing operations was $562.9 million. The primary drivers of the usage were attributable to capital expenditures of $370.6 million and acquisitions of businesses of $180.3 million, net of cash acquired. During the year ended December 31, 2023, net cash used in investing activities from continuing operations was $1,172.2 million. The primary drivers of the usage was attributable to acquisition of businesses, which totaled $862.8 million, net of cash acquired, and capital expenditures of $300.7 million.\nFinancing Activities\nCash flows from financing activities represent inflows and outflows that account for external activities affecting equity and debt. Primary activities associated with these actions include paying dividends to shareholders, repurchasing our own shares, net proceeds from debt issuances and proceeds from shares issued in connection with incentive plans. During the year ended December 31, 2024, net cash used in financing activities from continuing operations was $2,020.6 million. The primary drivers of the outflow related to the repurchase of $1,280.8 million in ordinary shares and dividends paid to ordinary shareholders of $757.5 million. In addition, we received $498.5 million in proceeds from the issuance of 5.100% Senior Notes due 2034, which was offset by the redemption of $500.0 million of 3.550% Senior Notes that matured in November 2024. During the year ended December 31, 2023, net cash used in financing activities from continuing operations was $1,350.3 million. The primary drivers of the outflow related to dividends paid to ordinary shareholders of $683.7 million and the repurchase of $669.3 million in ordinary shares. In addition, we received $699.1 million in proceeds from the issuance of 5.250% Senior Notes due March 2033 which was offset by the redemption of $700.0 million of Senior Notes due June 2023. \n37\nTable of Contents\nFree Cash Flow\nFree cash flow is a non-GAAP measure and defined as \nNet cash provided by (used in) continuing operating activities \nadjusted for\n \ncapital expenditures, cash payments for restructuring, legacy legal liability, transformation costs and merger and acquisition (M&A) related costs less insurance settlements on property claims and an adjustment for our special three-year Outperformance Incentive Program. This measure is useful to management and investors because it is consistent with management's assessment of our operating cash flow performance. The most comparable GAAP measure to free cash flow is\n Net cash provided by (used in) continuing operating activities\n. Free cash flow may not be comparable to similarly-titled measures used by other companies and should not be considered a substitute for \nNet cash provided by (used in) continuing operating activities\n in accordance with GAAP.\nA reconciliation of \nNet cash provided by (used in) continuing operating activities\n to free cash flow the years ended December 31 is as follows:\nIn millions\n2024\n2023\nNet cash provided by (used in) continuing operating activities\n$\n3,177.7 \n$\n2,426.8 \nCapital expenditures\n(370.6)\n(300.7)\nCash payments for restructuring\n8.6 \n12.3 \nLegacy legal liability\n2.7 \n— \nTransformation costs paid\n— \n3.9 \nM&A transaction costs\n1.7 \n18.9 \nInsurance settlements on property claims\n— \n(10.0)\nAdjustment for Outperformance Incentive Program \n(2)\n(31.1)\n— \nFree cash flow \n(1)\n$\n2,789.0 \n$\n2,151.2 \n(1) \nRepresents a non-GAAP measure. \n(2) \nThe Company implemented a special three-year Outperformance Incentive Program during the year ended December 31, 2024 that provides additional incentive-based cash compensation to eligible participants based primarily on the achievement of outsized revenue performance beyond what is achievable under the Company’s existing short-term incentive programs. Performance is measured over three annual periods representing the years ended December 31, 2024, 2025 and 2026. Cash payments related to performance achieved will be made in the quarter ended March 31, 2027. This adjustment represents amounts earned in the respective performance period that will be paid during the quarter ended March 31, 2027. \nPension Plans\nOur investment objective in managing defined benefit plan assets is to ensure that all present and future benefit obligations are met as they come due. We seek to achieve this goal while trying to mitigate volatility in plan funded status, contribution and expense by better matching the characteristics of the plan assets to that of the plan liabilities. We use a dynamic approach to asset allocation to increase fixed income assets as the plan's funded status improves. We monitor plan funded status and asset allocation regularly in addition to investment manager performance. In addition, we monitor the impact of market conditions on our defined benefit plans on a regular basis. None of our defined benefit pension plans have experienced a significant impact on their liquidity due to market volatility. See Note 11, \"Pension and Postretirement Benefits Other Than Pensions,\" to the Consolidated Financial Statements for additional information regarding pensions.\nCapital Resources\nBased on historical performance and current expectations, we believe our cash and cash equivalents balance, the cash generated from our operations, our committed credit lines and our expected ability to access capital markets, including our commercial paper program, will satisfy our working capital needs, capital expenditures, dividends, share repurchases, upcoming debt maturities, and other liquidity requirements associated with our operations for the foreseeable future.\nCapital expenditures were $370.6 million, $300.7 million and $291.8 million for the years ended December 31, 2024, 2023 and 2022, respectively. Our investments continue to improve manufacturing productivity, expand capacity, reduce costs, provide environmental enhancements, upgrade information technology infrastructure and security and advanced technologies for existing facilities. The capital expenditure program for 2025 is estimated to be approximately 2.0% of revenues, including amounts approved in prior periods. Many of these projects are subject to review and cancellation at our option without incurring substantial charges.\nFor financial market risk impacting the Company, see Part II, Item 7A, \"Quantitative and Qualitative Disclosure About Market Risk.\"\n38\nTable of Contents\nCapitalization\nFinancing rates and conditions associated with future borrowings under our commercial paper program or term debt offerings will be affected by general financing conditions and our credit ratings. On April 10, 2024, Moody's announced that it upgraded our long-term credit rating from Baa1 to A3 and put the Company on positive outlook. On October 31, 2024, Standard and Poor's announced that it revised our long-term credit rating from BBB+ stable to BBB+ positive. As of December 31, 2024, our credit ratings were as follows:\n \nShort-term\nLong-term\nMoody's\nP-2\nA3\nStandard and Poor's\nA-2\nBBB+\nThe credit ratings set forth above are not a recommendation to buy, sell or hold securities and may be subject to revision or withdrawal by the assigning rating organization. Each rating should be evaluated independently of any other rating.\nOur public debt does not contain financial covenants and our revolving credit lines have a debt-to-total capital covenant of 65%. As of December 31, 2024, our debt-to-total capital ratio was significantly beneath this limit.\nContractual Obligations\nOur contractual cash obligations include required payments of long-term debt principal and interest, purchase obligations and expected obligations under our pension and postretirement benefit plans. In addition, we have required payments of operating leases, income taxes and expected obligations under the Funding agreement, environmental and product liability matters. For additional information regarding leases, income taxes, including unrecognized tax benefits, and contingent liabilities, see Note 10 \"Leases,\" Note 16 \"Income Taxes\" and Note 20 \"Commitments and Contingencies,\" respectively, to the Consolidated Financial Statements. Our material cash requirements include the following contractual and other obligations.\nDebt\nAt December 31, 2024, we had outstanding aggregate long-term debt principal payments of $4,802.2 million, with $452.2 million payable within 12 months. The amount payable within 12 months includes $295.0 million of debt redeemable at the option of the holder. The scheduled maturities of these bonds range between 2027 and 2028. Future interest payments on long-term debt total $2,348.6 million, with $220.5 million payable within 12 months. See Note 7, \"Debt and Credit Facilities,\" to the Consolidated Financial Statements for additional information regarding debt.\nPurchase Obligations\nPurchase obligations include commitments under legally enforceable contracts or purchase orders. At December 31, 2024, we had purchase obligations of $1,161.2 million, which are primarily payable within 12 months.\nPensions\nIt is our objective to contribute to the pension plans to ensure adequate funds are available in the plans to make benefit payments to plan participants and beneficiaries when required. We currently expect that we will contribute approximately $30 million to our enterprise plans worldwide in 2025. The timing and amounts of future contributions are dependent upon the funding status of the plans, which is expected to vary as a result of changes in interest rates, returns on underlying assets, and other factors. See Note 11, \"Pensions and Postretirement Benefits Other Than Pensions,\" to the Consolidated Financial Statements for additional information regarding pensions.\nPostretirement Benefits Other than Pensions\nWe fund postretirement benefit costs principally on a pay-as-you-go basis as medical costs are incurred by covered retiree populations. Benefit payments, which are net of expected plan participant contributions and Medicare Part D subsidy, are expected to be approximately $29 million in 2025. See Note 11, \"Pensions and Postretirement Benefits Other Than Pensions,\" to the Consolidated Financial Statements for additional information regarding postretirement benefits other than pensions.\n39\nTable of Contents\nSupplemental Guarantor Financial Information\nTrane Technologies plc (Plc or Parent Company) and certain of its 100% directly or indirectly owned subsidiaries provide guarantees of public debt issued by other 100% directly or indirectly owned subsidiaries of Plc. The following table shows our guarantor relationships as of December 31, 2024:\nParent, issuer or guarantors\nNotes issued\nNotes guaranteed\nTrane Technologies plc (Plc)\nNone\nAll registered notes and debentures\nTrane Technologies Irish Holdings Unlimited Company (TT Holdings)\nNone\nAll notes issued by TTFL and TTC HoldCo\nTrane Technologies Global Holding II Company (TT Global II)\nNone\nAll notes issued by TTFL and TTC HoldCo\nTrane Technologies Lux International Holding Company S.à.r.l. (TT International)\nNone\nAll notes issued by TTFL and TTC HoldCo\nTrane Technologies Americas Holding Corporation (TT Americas)\nNone\nAll notes issued by TTFL and TTC HoldCo\nTrane Technologies Financing Limited\n(TTFL)\n3.500% Senior Notes due 2026\n3.800% Senior Notes due 2029\n5.250% Senior Notes due 2033\n5.100% Senior Notes due 2034\n4.650% Senior Notes due 2044\n4.500% Senior Notes due 2049\nAll notes and debentures issued by TTC HoldCo and TTC\nTrane Technologies HoldCo Inc. (TTC HoldCo)\n3.750% Senior Notes due 2028\n5.750% Senior Notes due 2043\n4.300% Senior Notes due 2048\nAll notes issued by TTFL\nTrane Technologies Company LLC (TTC)\n7.200% Debentures due 2025\n6.480% Debentures due 2025\nPuttable debentures due 2027-2028\nAll notes issued by TTFL and TTC HoldCo\nEach subsidiary debt issuer and guarantor is owned 100% directly or indirectly by the Parent Company. Each guarantee is full and unconditional, and provided on a joint and several basis. There are no significant restrictions of the Parent Company, or any guarantor, to obtain funds from its subsidiaries, such as provisions in debt agreements that prohibit dividend payments, loans or advances to the parent by a subsidiary. The following tables present summarized financial information for the Parent Company and subsidiary debt issuers and guarantors on a combined basis (together, \"obligor group\") after elimination of intercompany transactions and balances based on the Company's legal entity ownerships and guarantees outstanding at December 31, 2024. Our obligor groups as of December 31, 2024 were as follows: Obligor group 1 consists of Plc, TT Holdings, TT Global II, TT International, TT Americas, TTFL, TTC HoldCo and TTC; Obligor group 2 consists of Plc, TTFL and TTC.\n40\nTable of Contents\nSummarized Statements of Earnings\nYear ended December 31, 2024\nIn millions\nObligor group 1\nObligor group 2\nNet revenues\n$\n— \n$\n— \nGross profit (loss)\n— \n— \nIntercompany interest and fees\n1,232.3 \n2,956.9 \nEarnings (loss) from continuing operations\n844.1 \n2,071.4 \nDiscontinued operations, net of tax\n(20.9)\n(23.7)\nNet earnings (loss)\n823.2 \n2,047.7 \nLess: Net earnings attributable to noncontrolling interests\n— \n— \nNet earnings (loss) attributable to Trane Technologies plc\n$\n823.2 \n$\n2,047.7 \nSummarized Balance Sheet\nDecember 31, 2024\nIn millions\nObligor group 1\nObligor group 2\nASSETS\nIntercompany receivables\n$\n265.6 \n$\n4,363.2 \nCurrent assets\n413.8 \n4,469.0 \nIntercompany notes receivable\n500.0 \n4,900.0 \nNoncurrent assets\n1,320.0 \n5,603.5 \nLIABILITIES\nIntercompany payables\n5,290.2 \n2,530.3 \nCurrent liabilities\n6,305.0 \n3,490.0 \nIntercompany notes payable\n4,000.0 \n4,000.0 \nNoncurrent liabilities\n9,014.6 \n7,650.2 \nCritical Accounting Estimates\nManagement's Discussion and Analysis of Financial Condition and Results of Operations are based upon our Consolidated Financial Statements, which have been prepared in accordance with U.S. GAAP. The preparation of financial statements in conformity with those accounting principles requires management to use judgment in making estimates and assumptions based on the relevant information available at the end of each period. These estimates and assumptions have a significant effect on reported amounts of assets and liabilities, revenue and expenses as well as the disclosure of contingent assets and liabilities because they result primarily from the need to make estimates and assumptions on matters that are inherently uncertain. Actual results may differ from these estimates. If updated information or actual amounts are different from previous estimates, the revisions are included in our results for the period in which they become known.\nThe following is a summary of certain accounting estimates and assumptions made by management that we consider critical.\n•\nGoodwill and indefinite-lived intangible assets – We have significant goodwill and indefinite-lived intangible assets on our balance sheet related to acquisitions. These assets are tested and reviewed annually during the fourth quarter for impairment or when there is a significant change in events or circumstances that indicate that the fair value of an asset is more likely than not less than the carrying amount of the asset. In addition, an interim impairment test is completed upon a triggering event or when there is a reorganization of reporting structure or disposal of all or a portion of a reporting unit.\nThe determination of estimated fair value requires us to make assumptions about estimated cash flows, including profit margins, long-term forecasts, discount rates and terminal growth rates. We developed these assumptions based on the market and geographic risks unique to each reporting unit. The estimates of fair value are based on the best information available as of the date of the assessment, which primarily incorporates management assumptions about expected future cash flows.\nAnnual Goodwill Impairment Test\nImpairment of goodwill is tested at the reporting unit level. The test compares the carrying amount of the reporting unit to its estimated fair value. If the estimated fair value of a reporting unit exceeds its carrying amount, goodwill of the \n41\nTable of Contents\nreporting unit is not impaired. To the extent that the carrying value of the reporting unit exceeds its estimated fair value, an impairment loss would be recognized for the amount by which the reporting unit's carrying amount exceeds its fair value, not to exceed the carrying amount of goodwill in that reporting unit.\nAs quoted market prices are not available for our reporting units, the calculation of their estimated fair value is determined using three valuation techniques: a discounted cash flow model (an income approach), a market-adjusted multiple of earnings or revenues (a market approach), and a similar transactions method (also a market approach). The discounted cash flow approach relies on our estimates of future cash flows and explicitly addresses factors such as timing, revenue growth rates, and margins, with due consideration given to forecasting risk. The market-adjusted multiple of earnings or revenues approach reflects the market's expectations for future growth and risk, with adjustments to account for differences between the guideline publicly traded companies and the subject reporting units. The similar transactions method considers prices paid in transactions that have recently occurred in our industry or in related industries. These valuation techniques are weighted 50%, 40% and 10%, respectively.\nUnder the income approach, we assumed a forecasted cash flow period of five to ten years with discount rates ranging from 8.5% to 15.5% and a terminal growth rate of 3.5% to 4.0%. Under the guideline public company method, we used multiples of earnings before interest, taxes, depreciation and amortization (EBITDA) or revenues based on the market information of comparable companies. Additionally, we compared the estimated aggregate fair value of our reporting units to our overall market capitalization. The excess of the estimated fair value over carrying value (expressed as a percentage of carrying value) for most reporting units exceeded 400%. The estimated fair value of one reporting unit formed upon the acquisition of Nuvolo in November 2023 was approximately equal to its carrying value. As of December 31, 2024, this reporting unit had $313.0 million of goodwill. A significant increase in the discount rate, decrease in the long-term growth rate, or substantial reductions in our end markets and volume assumptions could have a negative impact on the estimated fair value of this reporting unit.\nOther Indefinite-lived intangible assets\nOther intangible assets with indefinite useful lives are tested for impairment on an annual basis. The fair value of intangible assets with indefinite useful lives is determined on a relief from royalty methodology (income approach) which is based on the implied royalty paid, at an appropriate discount rate, to license the use of an asset rather than owning the asset. The present value of the after-tax cost savings (i.e., royalty relief) indicates the estimated fair value of the asset. Any excess of the carrying value over the estimated fair value would be recognized as an impairment loss equal to that excess.\nIn testing our other indefinite-lived intangible assets for impairment, we forecasted revenues for a period of five years with discount rates ranging from 8.5% to 14.0%, terminal growth rates of 3.5%, and royalty rates ranging from 1.0% to 4.5%. For significant indefinite-lived intangible assets, the excess of the estimated fair value over carrying value (expressed as a percentage of carrying value) exceeded 400%. A significant increase in the discount rate, decrease in the long-term growth rate, decrease in the royalty rate or substantial reductions in our end markets and volume assumptions could have a negative impact on the estimated fair values of any of our tradenames.\n•\nBusiness combinations - Acquisitions that meet the definition of a business combination are recorded using the acquisition method of accounting. We include the operating results of acquired entities from their respective dates of acquisition. We recognize and measure the identifiable assets acquired, liabilities assumed, including contingent consideration relating to potential earnout provisions and any non-controlling interest as of the acquisition date fair value. The valuation of intangible assets is determined using an income approach methodology. We use assumptions to value the intangible assets including projected cash flows, including revenue growth rates and margins, customer attrition rates, royalty rates, tax rates and discount rates. The excess, if any, of total consideration transferred in a business combination over the fair value of identifiable assets acquired, liabilities assumed, and any non-controlling interest is recognized as goodwill. Costs incurred as a result of a business combination other than costs related to the issuance of debt or equity securities are recorded in the period the costs are incurred.\nContingent consideration\nWe assess any contingent consideration included in the consideration paid of a business combination. The value recorded is based on estimates of future financial projections on revenue under various potential scenarios, in which a Monte Carlo simulation model runs many iterations based on comparable companies' revenue growth rates and their implied revenue volatilities. These cash flow projections are discounted with a risk adjusted rate. Each quarter until such contingent amounts are earned, the fair value of the liability is evaluated at each reporting period and adjusted as a component of operating expenses based on changes to the underlying assumptions. The estimates used to determine the fair value of the contingent consideration liability are subject to significant judgment, specifically revenue growth rates, implied revenue volatilities and discount rates.\n42\nTable of Contents\n•\nRevenue recognition – Revenue is recognized when control of a good or service promised in a contract (i.e., performance obligation) is transferred to a customer. Control is obtained when a customer has the ability to direct the use of and obtain substantially all of the remaining benefits from that good or service. A majority of our revenues are recognized at a point-in-time as control is transferred at a distinct point in time per the terms of a contract. However, a portion of our revenues are recognized over time as the customer simultaneously receives control as we perform work under a contract. For these arrangements, the cost-to-cost input method is used as it best depicts the transfer of control to the customer that occurs as we incur costs.\nThe transaction price allocated to performance obligations reflects our expectations about the consideration we will be entitled to receive from a customer. To determine the transaction price, variable and non-cash consideration are assessed as well as whether a significant financing component exists. We include variable consideration in the estimated transaction price when it is probable that significant reversal of revenue recognized would not occur when the uncertainty associated with variable consideration is subsequently resolved. We consider historical data in determining our best estimates of variable consideration, and the related accruals are recorded using the expected value method.\nWe enter into sales arrangements that contain multiple goods and services. For these arrangements, each good or service is evaluated to determine whether it represents a distinct performance obligation and whether the sales price for each obligation is representative of standalone selling price. If available, we utilize observable prices for goods or services sold separately to similar customers in similar circumstances to evaluate relative standalone selling price. List prices are used if they are determined to be representative of standalone selling prices. Where necessary, we ensure that the total transaction price is then allocated to the distinct performance obligations based on the determination of their relative standalone selling price at the inception of the arrangement.\nWe recognize revenue for delivered goods or services when the delivered good or service is distinct, control of the good or service has transferred to the customer, and only customary refund or return rights related to the goods or services exist. For extended warranties and long-term service agreements, revenue for these distinct performance obligations are recognized over time on a straight-line basis over the respective contract term.\n•\nIncome taxes – Deferred tax assets and liabilities are determined based on temporary differences between financial reporting and tax bases of assets and liabilities, applying enacted tax rates expected to be in effect for the year in which the differences are expected to reverse. We recognize future tax benefits, such as net operating losses and tax credits, to the extent that realizing these benefits is considered in our judgment to be more likely than not. We regularly review the recoverability of our deferred tax assets considering our historic profitability, projected future taxable income, timing of the reversals of existing temporary differences and the feasibility of our tax planning strategies. Where appropriate, we record a valuation allowance with respect to a future tax benefit.\nThe provision for income taxes involves a significant amount of management judgment regarding interpretation of relevant facts and laws in the jurisdictions in which we operate. Future changes in applicable laws, projected levels of taxable income, and tax planning could change the effective tax rate and tax balances recorded by us. In addition, tax authorities periodically review income tax returns filed by us and can raise issues regarding our filing positions, timing and amount of income or deductions, and the allocation of income among the jurisdictions in which we operate. A significant period of time may elapse between the filing of an income tax return and the ultimate resolution of an issue raised by a revenue authority with respect to that return. We believe that we have adequately provided for any reasonably foreseeable resolution of these matters. We will adjust our estimate if significant events so dictate. To the extent that the ultimate results differ from our original or adjusted estimates, the effect will be recorded in the provision for income taxes in the period that the matter is finally resolved.\n•\nEmployee benefit plans – We provide a range of benefits to eligible employees and retirees, including pensions, postretirement and postemployment benefits. Determining the cost associated with such benefits is dependent on various actuarial assumptions including discount rates, expected return on plan assets, compensation increases, mortality, turnover rates and healthcare cost trend rates. Actuarial valuations are performed to determine expense in accordance with GAAP. Actual results may differ from the actuarial assumptions and are generally accumulated and amortized into earnings over future periods. We review our actuarial assumptions at each measurement date and make modifications to the assumptions based on current rates and trends, if appropriate. The discount rate, the rate of compensation increase and the expected long-term rates of return on plan assets are determined as of each measurement date. We believe that the assumptions utilized in recording our obligations under our plans are reasonable based on input from our actuaries, outside investment advisors and information as to assumptions used by plan sponsors.\n43\nTable of Contents\nChanges in any of the assumptions can have an impact on the net periodic pension cost or postretirement benefit cost. Estimated sensitivities to the expected 2025 net periodic pension cost of a 0.25% rate decline in the two basic assumptions are as follows: the decline in the discount rate would increase expense by $0.2 million and the decline in the estimated return on assets would increase expense by $4.8 million. A 0.25% rate decrease in the discount rate for postretirement benefits would increase expected 2025 net periodic postretirement benefit cost by $0.3 million.\nRecent Accounting Pronouncements\nSee Note 2, \"Summary of Significant Accounting Policies\" to the Consolidated Financial Statements for a discussion of recent accounting pronouncements.\nItem 7A.\n    \nQUANTITATIVE AND QUALITATIVE DISCLOSURE ABOUT MARKET RISK\nWe are exposed to fluctuations in currency exchange rates, interest rates and commodity prices which could impact our results of operations and financial condition. \nForeign Currency Exposures\nWe have operations throughout the world that manufacture and sell products in various international markets. As a result, we are exposed to movements in exchange rates of various currencies against the U.S. dollar as well as against other currencies throughout the world.\nMany of our non-U.S. operations have a functional currency other than the U.S. dollar, and their results are translated into U.S. dollars for reporting purposes. Therefore, our reported results will be higher or lower depending on the weakening or strengthening of the U.S. dollar against the respective foreign currency. Our largest concentration of revenues from non-U.S. operations as of December 31, 2024 are in Euros and Chinese Yuan. A hypothetical 10% unfavorable change in the average exchange rate used to translate \nNet revenues\n for the year ended December 31, 2024 from either Euros or Chinese Yuan-based operations into U.S. dollars would result in a decline of approximately $170 million and $60 million, respectively.\nWe use derivative instruments to partially hedge those material exposures that cannot be naturally offset. The instruments utilized are viewed as risk management tools, primarily involve little complexity and are not used for trading or speculative purposes. To minimize the risk of counterparty non-performance, derivative instrument agreements are made only through major financial institutions with significant experience in such derivative instruments.\nWe evaluate our exposure to changes in currency exchange rates on our foreign currency derivatives using a sensitivity analysis. The sensitivity analysis is a measurement of the potential loss in fair value based on a percentage change in exchange rates. Based on the currency derivative instruments in place at December 31, 2024, a hypothetical change in fair value of those derivative instruments assuming a 10% adverse change in exchange rates would result in an unrealized loss of $15.5 million, as compared with $6.5 million at December 31, 2023. These amounts, when realized, would be offset by changes in the fair value of the underlying transactions.\nCommodity Price Exposures    \nWe are exposed to volatility in the prices of commodities used in some of our products and we use commodity hedge contracts in the financial derivatives market and fixed price purchase contracts to manage this exposure. Commodity risks are systematically managed pursuant to policy guidelines. As a cash flow hedge, gains and losses resulting from the hedging instruments mitigate a portion of our exposures to changes in commodity prices. The maturities of the commodity hedge contracts coincide with the expected purchase of the commodities. Based on the commodity derivative instruments in place at December 31, 2024, a hypothetical change in fair value of those derivative instruments assuming a 10% decrease in commodity prices would result in an unrealized loss of $12.7 million, as compared with $8.2 million at December 31, 2023. These amounts, when realized, would be offset by changes in the fair value of the underlying commodity purchases.\nInterest Rate Exposure\nOur debt portfolio mainly consists of fixed-rate instruments, and therefore any fluctuation in market interest rates is not expected to have a material effect on our results of operations.\n44\nTable of Contents\nItem 8.\n      \nFINANCIAL STATEMENTS\n(a)\nThe following Consolidated Financial Statements and the report thereon of PricewaterhouseCoopers LLP dated February 6, 2025, are presented in this Annual Report on Form 10-K beginning on page F-1.\nConsolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm\nConsolidated Statements of Earnings\n for the years ended December 31, 2024, 2023 and 2022\nConsolidated Statements of Comprehensive Income\n for the years ended December 31, 2024, 2023 and 2022\nConsolidated Balance Sheets\n at December 31, 2024 and 2023\nConsolidated Statements of Equity\n for the years ended December 31, 2024, 2023 and 2022\nConsolidated Statements of Cash Flows\n for the years ended December 31, 2024, 2023 and 2022\nNotes to Consolidated Financial Statements\nItem 9.\n      \nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL\n \nDISCLOSURE\nNone.\nItem 9A.\n    \nCONTROLS AND PROCEDURES\n(a)\nEvaluation of Disclosure Controls and Procedures\nThe Company's management, including its Chief Executive Officer and Chief Financial Officer, have conducted an evaluation of the effectiveness of the Company's disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)), as of the end of the period covered by this Annual Report on Form 10-K. Based on that evaluation, the Chief Executive Officer and Chief Financial Officer concluded as of December 31, 2024, that the Company's disclosure controls and procedures were effective in ensuring that information required to be disclosed by the Company in reports that it files or submits under the Exchange Act has been recorded, processed, summarized and reported, within the time periods specified in the Commission's rules and forms, and that such information has been accumulated and communicated to the Company's management including its Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\n(b)\nManagement's Report on Internal Control Over Financial Reporting\nThe Company's management is responsible for establishing and maintaining adequate internal control over financial reporting as such term is defined under Exchange Act Rules 13a-15(f) and 15d-15(f). Internal control over financial reporting is a process designed by, or under the supervision of, the Chief Executive Officer and Chief Financial Officer and effected by the Company's Board of Directors to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nManagement has assessed the effectiveness of internal control over financial reporting as of December 31, 2024. In making its assessment, management has utilized the criteria set forth by the Committee of Sponsoring Organizations (COSO) of the Treadway Commission in Internal Control - Integrated Framework (2013). Management concluded that based on its assessment, the Company's internal control over financial reporting was effective as of December 31, 2024.\nThe effectiveness of the Company's internal control over financial reporting as of December 31, 2024 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which appears herein.\n(c)\nChanges in Internal Control Over Financial Reporting\nThere were no changes in internal control over financial reporting (as defined by Rules 13a-15(f) and 15d-15(f) under the Exchange Act) that occurred during the quarter ended December 31, 2024 that have materially affected, or are reasonably likely to materially affect, the Company's internal control over financial reporting.\n45\nTable of Contents\nItem 9B.\n    \nOTHER INFORMATION\nSecurities Trading Plans of Directors and Executive Officers\nOur director compensation program, which consists of an annual cash retainer and grant of restricted stock units (RSUs), is designed to compensate non-employee directors fairly for work required for a company of our size and scope and to align their interests with the long-term interests of our shareholders. Similarly, a portion of the compensation of our executive officers (as defined in SEC Rule 16a-1(f)) is delivered in the form of our Long-Term Incentive Program (LTI), which is comprised of stock options, RSUs and performance share units (PSUs). We believe compensating our directors and executive officers with a mix of equity-based awards effectively links compensation to long-term shareholder value creation, Environmental, Social, and Governance (ESG), and financial results.\nSubject to the satisfaction of our share ownership requirements, our directors and executive officers may, from time to time, engage in transactions to sell some of the shares granted to them as part of our director and executive compensation programs after such shares vest following the expiration of any time-based restrictions or achievement of certain pre-established performance goals. In addition, our directors and executive officers may also, from time to time, engage in other transactions involving our securities, which may entail the purchase or sale of our common stock outside of these compensation programs on an open-market basis.\nAll transactions in our securities by our directors and executive officers must occur in accordance with our Insider Trading Policy, which, among other things, requires that such transactions be in accordance with applicable U.S. federal securities laws that prohibit trading while in possession of material nonpublic information. Rule 10b5-1 of the Securities Exchange Act provides an affirmative defense that enables prearranged transactions in securities in a manner that avoids concerns about initiating transactions at a future date while possibly in possession of material nonpublic information. Our insider trading policy permits our directors and executive officers to enter trading plans designed to prearrange transactions in our securities in accordance with Rule 10b5-1.\nDuring the fourth quarter of 2024, none of our directors or executive officers adopted or terminated a \"non-Rule 10b5-1 trading arrangement,\" as defined in Item 408(a) of Regulation S-K. The following table describes contracts, instructions or written plans for the sale or purchase of our securities adopted or terminated by our directors and executive officers during the fourth quarter of 2024, each of which is intended to satisfy the affirmative defense conditions of Rule 10b5-1(c), referred to as Rule 10b5-1 trading plans:\nName and Title\nAction\nDate of Action\nScheduled Expiration Date\n(1)\nAggregate Number of Securities to be Purchased or Sold\n(2)\nPaul A. Camuti\n(3)\nExecutive Vice President and Chief Technology and Sustainability Officer\nAdopt\n11/13/2024\n5/2/2025\nSale of up to \n14,270\n(4)\n shares of common stock\nDonald E. Simmons\nGroup President, Americas\nAdopt\n10/31/2024\n5/10/2025\nSale of up to \n24,358\n(5)\n shares of common stock\n(1)\n In each case a trading plan may also expire prior to the scheduled expiration date if all transactions under the trading plan are completed before the scheduled expiration date.\n(2)\n Aggregate number of shares in this column includes shares that may be forfeited or withheld to satisfy exercise price and tax obligations at the time of vesting.\n(3)  \nMr. Camuti retired on December 31, 2024.\n(4)  \nThis figure includes a grant of 4,487 unvested PSUs that are expected to vest during the term of the Rule 10b5-1 trading plans, which are assumed to vest at 100% of the target award amount. The actual number of PSUs that may vest can vary between 0% - 200% of the target award amount, subject to the achievement of certain performance conditions as set forth in the PSU award agreement.\n(5) \n \nThis figure includes a grant of 2,991 unvested PSUs that are expected to vest during the term of the Rule 10b5-1 trading plans, which are assumed to vest at 100% of the target award amount. The actual number of PSUs that may vest can vary between 0% - 200% of the target award amount, subject to the achievement of certain performance conditions as set forth in the PSU award agreement\n.\nItem 9C.\n    \nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable.\n46\nTable of Contents\nPART III\nItem 10.\n      \nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information regarding our executive officers is included in Part I under the caption \"Executive Officers of Registrant.\"\nThe other information required by this item is incorporated herein by reference to the information contained under the headings \"Item 1. Election of Directors,\" \"Delinquent Section 16(a) Rep\norts (to the extent reported therein)\"\n and \"Corporate Governance\" in our definitive proxy statement for the 2025 annual general meeting of shareholders (2025 Proxy Statement).\nItem 11.\n      \nEXECUTIVE COMPENSATION\nThe other information required by this item is incorporated herein by reference to the information contained under the headings \"Compensation Discussion and Analysis,\" \"Compensation of Directors,\" \"Executive Compensation,\" \"Human Resources and Compensation Committee Report\" and \"Human Resources and Compensation Committee Interlocks and Insider Participation\" in our 2025 Proxy Statement.\nItem 12.\n      \nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED\n \n STOCKHOLDER MATTERS\nThe other information required by this item is incorporated herein by reference to the information contained under the headings \"Security Ownership of Certain Beneficial Owners and Management\" and \"Equity Compensation Plan Information\" in our 2025 Proxy Statement.\nItem 13.\n      \nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe other information required by this item is incorporated herein by reference to the information contained under the headings \"Corporate Governance\" and \"Certain Relationships and Related Person Transactions\" in our 2025 Proxy Statement.\nItem 14.\n    \nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this item is incorporated herein by reference to the information contained under the caption \"Fees of the Independent Auditors\" in our 2025 Proxy Statement.\n47\nTable of Contents\nPART IV\nItem 15.\n    \nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) 1.\nFinancial Statements\nSee Item 8.\n2.\nFinancial Statement Schedules\nSchedules have been omitted because the required information is not applicable or because the required information is included elsewhere in this Annual Report on Form 10-K.\n3.\nExhibits\nThe exhibits listed on the accompanying index to exhibits are filed as part of this Annual Report on Form 10-K.\n48\nTable of Contents\nTRANE TECHNOLOGIES PLC\nINDEX TO EXHIBITS\n(Item 15(a))\nDescription\nPursuant to the rules and regulations of the Securities and Exchange Commission (\"SEC\"), Trane Technologies plc (the \"Company\") has filed certain agreements as exhibits to this Annual Report on Form 10-K. These agreements may contain representations and warranties by the parties. These representations and warranties have been made solely for the benefit of the other party or parties to such agreements and (i) may have been qualified by disclosures made to such other party or parties, (ii) were made only as of the date of such agreements or such other date(s) as may be specified in such agreements and are subject to more recent developments, which may not be fully reflected in our public disclosure, (iii) may reflect the allocation of risk among the parties to such agreements and (iv) may apply materiality standards different from what may be viewed as material to investors. Accordingly, these representations and warranties may not describe our actual state of affairs at the date hereof and should not be relied upon.\nOn July 1, 2009, Ingersoll-Rand Company Limited, a Bermuda company, completed a reorganization to change the jurisdiction of incorporation of the parent company from Bermuda to Ireland. As a result, Ingersoll-Rand plc replaced Ingersoll-Rand Company Limited as the ultimate parent company effective July 1, 2009. All references related to the Company prior to July 1, 2009 relate to Ingersoll-Rand Company Limited. On March 2, 2020, Ingersoll-Rand plc changed its name to Trane Technologies plc.\n(a) Exhibits\nExhibit No.\nDescription\n  \nMethod of Filing\n2.1\nAgreement and Plan of Merger, dated as of April 30, 2019, by and among the Company, Gardner Denver Holdings, Inc., Ingersoll-Rand U.S. HoldCo, Inc. and Charm Merger Sub Inc.\nIncorporated by reference to Exhibit 2.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on May 6, 2019.\n2.2\nSeparation and Distribution Agreement, dated as of April 30, 2019, by and between Ingersoll-Rand plc and Ingersoll-Rand U.S. HoldCo, Inc.\nIncorporated by reference to Exhibit 2.2 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on May 6, 2019).\n3.1\nConstitution of the Company, as amended and restated on June 2, 2016\n  \nIncorporated by reference to Exhibit 3.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on June 7, 2016.\n3.2\nAmendment to the Constitution of the Company dated March 2, 2020\nIncorporated by reference to Exhibit 3.2 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\nThe Company and its subsidiaries are parties to several long-term debt instruments under which, in each case, the total amount of securities authorized does not exceed 10% of the total assets of the Company and its subsidiaries on a consolidated basis.\n  \nPursuant to paragraph 4 (iii)(A) of Item 601 (b) of Regulation S-K, the Company agrees to furnish a copy of such instruments to the Securities and Exchange Commission upon request.\n4.1\nIndenture, dated as of June 20, 2013, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Company Limited and Ingersoll-Rand International Holding Limited, as guarantors and The Bank of New York Mellon, as Trustee.\nIncorporated by reference to Exhibit 4.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on June 26, 2013.\n4.2\nFirst Supplemental Indenture, dated as of June 20, 2013, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Company Limited and Ingersoll-Rand International Holding Limited, as guarantors and The Bank of New York Mellon, as Trustee, relating to the 2.875% Senior Notes due 2019.\nIncorporated by reference to Exhibit 4.2 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on June 26, 2013.\n49\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n4.3\nSecond Supplemental Indenture, dated as of June 20, 2013, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Company Limited and Ingersoll-Rand International Holding Limited, as guarantors and The Bank of New York Mellon, as Trustee, relating to the 4.250% Senior Notes due 2023.\nIncorporated by reference to Exhibit 4.3 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on June 26, 2013.\n4.4\nThird Supplemental Indenture, dated as of June 20, 2013, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Company Limited and Ingersoll-Rand International Holding Limited, as guarantors and The Bank of New York Mellon, as Trustee, relating to the 5.750% Senior Notes due 2043.\nIncorporated by reference to Exhibit 4.4 to the Company'  s Form 8-K (File No. 001-34400) filed with the SEC on June 26, 2013. \n4.5\nFourth Supplemental Indenture, dated as of November 20, 2013, among Ingersoll-Rand Global Holding Company Limited, a Bermuda company, Ingersoll-Rand Company Limited, a Bermuda company, Ingersoll-Rand International Holding Limited, a Bermuda company, Ingersoll-Rand plc, an Irish public limited company, Ingersoll-Rand Company, a New Jersey corporation, and The Bank of New York Mellon, as Trustee, to the Indenture dated as of June 20, 2013.\nIncorporated by reference to Exhibit 4.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on November 26, 2013.\n4.6\nFifth Supplemental Indenture, dated as of October 28, 2014, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand Company, as co-obligor, Ingersoll-Rand plc, Ingersoll-Rand Company Limited, Ingersoll-Rand International Holding Limited, Ingersoll-Rand Luxembourg Finance S.A., as guarantors, and The Bank of New York Mellon, as Trustee, to an Indenture, dated as of June 20, 2013.\nIncorporated by reference to Exhibit 4.5 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on October 29, 2014.\n4.7\nSixth Supplemental Indenture, dated as of December 18, 2015, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand Company, as co-obligor, Ingersoll-Rand plc, Ingersoll-Rand International Holding Limited, Ingersoll-Rand Luxembourg Finance S.A., and Ingersoll-Rand Lux International Holding Company S.à.r.l. as guarantors, and The Bank of New York Mellon, as Trustee, to an Indenture, dated as of June 20, 2013. \n \nIncorporated by reference to Exhibit 4.21 to the Company's Form 10-K for the fiscal year ended 2015 (File No. 001-34400) filed with the SEC on February 12, 2016.\n4.8\nSeventh Supplemental Indenture, dated as of April 5, 2016, by and among Ingersoll-Rand Global Holding company Limited, as issuer, Ingersoll-Rand Company, as co-obligor, Ingersoll-Rand plc, Ingersoll-Rand International Holding Limited, Ingersoll-Rand Luxembourg Finance S.A., Ingersoll-Rand Lux International Holding Company S.à r.l., and Ingersoll-Rand Irish Holdings Unlimited Company, as guarantors, and The Bank of New York Mellon, as Trustee, to an indenture, dated as of June 20, 2013.\nIncorporated by reference to Exhibit 4.19 to the Company's Form 10-K for the fiscal year ended 2016 (File No. 001-34400) filed with the SEC on February 13, 2017.\n50\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n4.9\nEighth Supplemental Indenture, dated as of May 1, 2020, by and among Ingersoll-Rand Global Holding Company Limited, Ingersoll-Rand Company, Trane Technologies plc, Trane Technologies Luxembourg Finance S.A., Trane Technologies Lux International Holding Company S.à.r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., and The Bank of New York Mellon, as Trustee, to an indenture dated as of June 20, 2013.\nIncorporated by reference to Exhibit 4.9 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.10\nNinth Supplemental Indenture, dated as of May 1, 2020, by and among Ingersoll-Rand Global Holding Company Limited, Ingersoll-Rand Company, Trane Technologies plc, Trane Technologies Luxembourg Finance S.A., Trane Technologies Lux International Holding Company S.à.r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., and The Bank of New York Mellon, as Trustee, to an indenture dated as of June 20, 2013.\nIncorporated by reference to Exhibit 4.10 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.11\nTenth Supplemental Indenture, dated as of May 1, 2020, by and among Trane Technologies HoldCo Inc., Ingersoll-Rand Global Holding Company Limited, Ingersoll-Rand Company, Trane Technologies plc, Trane Technologies Luxembourg Finance S.A., Trane Technologies Lux International Holding Company S.à.r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Company LLC, and The Bank of New York Mellon, as Trustee, to an indenture dated as of June 20, 2013.\nIncorporated by reference to Exhibit 4.11 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.12\nEleventh Supplemental Indenture, dated as of May 1, 2020, by and among Trane Technologies HoldCo Inc., Ingersoll-Rand Global Holding Company Limited, Ingersoll-Rand Company, Trane Technologies plc, Trane Technologies Luxembourg Finance S.A., Trane Technologies Lux International Holding Company S.à.r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Company LLC, and The Bank of New York Mellon, as Trustee, to an indenture dated as of June 20, 2013.\nIncorporated by reference to Exhibit 4.12 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.13\nTwelfth Supplemental Indenture, dated as of April 30, 2021, by and among Trane Technologies HoldCo Inc., Trane Technologies Company LLC, Trane Technologies Global Holding Company Limited, Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company and Trane Technologies Financing Limited and The Bank of New York Mellon, as Trustee.\n \nIncorporated by reference to Exhibit 4.13 to the Company's 2021 Form 10-K (File No. 001-34400) filed with the SEC on February 7, 2022.\n4.14\nThirteenth Supplemental Indenture, dated as of November 20, 2023, by and among Trane Technologies HoldCo Inc., Trane Technologies Company LLC, Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company,Trane Technologies Financing Limited, Trane Technologies Americas Holding Corporation, and Trane Technologies Global Holding II Company Limited, and The Bank of New York Mellon, as Trustee.  \nIncorporated by reference to Exhibit 4.14 to the Company's 2023 Form 10-K (File No. 001-34400) filed with the SEC on February 8, 2024.\n51\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n4.15\nIndenture, dated as of October 28, 2014, by and among Ingersoll-Rand Luxembourg Finance S.A., as issuer, and Ingersoll-Rand plc, Ingersoll-Rand Company Limited, Ingersoll-Rand International Holding Limited, Ingersoll-Rand Company and Ingersoll-Rand Global Holding Company Limited, as guarantors, and The Bank of New York Mellon, as Trustee.\nIncorporated by reference to Exhibit 4.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on October 29, 2014.   \n4.16\nFirst Supplemental Indenture, dated as of October 28, 2014, by and among Ingersoll-Rand Luxembourg Finance S.A., as issuer, and Ingersoll-Rand plc, Ingersoll-Rand Company Limited, Ingersoll-Rand International Holding Limited, Ingersoll-Rand Company and Ingersoll-Rand Global Holding Company Limited, as guarantors, and The Bank of New York Mellon, as Trustee, relating to the 2.625% Senior Notes due 2020.\nIncorporated by reference to Exhibit 4.2 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on October 29, 2014.\n4.17\nSecond Supplemental Indenture, dated as of October 28, 2014, by and among Ingersoll-Rand Luxembourg Finance S.A., as issuer, and Ingersoll-Rand plc, Ingersoll-Rand Company Limited, Ingersoll-Rand International Holding Limited, Ingersoll-Rand Company and Ingersoll-Rand Global Holding Company Limited, as guarantors, and The Bank of New York Mellon, as Trustee, relating to the 3.550% Senior Notes due 2024.\nIncorporated by reference to Exhibit 4.3 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on October 29, 2014.\n4.18\nThird Supplemental Indenture, dated as of October 28, 2014, by and among Ingersoll-Rand Luxembourg Finance S.A., as issuer, and Ingersoll-Rand plc, Ingersoll-Rand Company Limited, Ingersoll-Rand International Holding Limited, Ingersoll-Rand Company and Ingersoll-Rand Global Holding Company Limited, as guarantors, and The Bank of New York Mellon, as Trustee, relating to the 4.650% Senior Notes due 2044.\nIncorporated by reference to Exhibit 4.4 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on October 29, 2014.\n4.19\nFourth Supplemental Indenture, dated as of December 18, 2015, by and among Ingersoll-Rand Luxembourg Finance S.A., as issuer, and Ingersoll-Rand plc, Ingersoll-Rand International Holding Limited, Ingersoll-Rand Company, Ingersoll-Rand Global Holding Company Limited, and Ingersoll-Rand Lux International Holding Company S.à.r.l. as guarantors, and The Bank of New York Mellon, as Trustee.\nIncorporated by reference to Exhibit 4.27 to the Company's Form 10-K for the fiscal year ended 2015 (File No. 001-34400) filed with the SEC on February 12, 2016.\n4.20\nFifth Supplemental Indenture, dated as of April 5, 2016, by and among Ingersoll-Rand Luxembourg Finance S.A., as Issuer, and Ingersoll-Rand plc, Ingersoll-Rand Company Limited, Ingersoll-Rand Company, Ingersoll-Rand International Holding Limited, Ingersoll-Rand Lux International Holding Company S.à r.l., Ingersoll-Rand Irish Holdings Unlimited Company, as guarantors, and The Bank of New York Mellon, as Trustee.\nIncorporated by reference to Exhibit 4.25 to the Company's Form 10-K for the fiscal year ended 2016 (File No. 001-34400) filed with the SEC on February 13, 2017.\n4.21\nSixth Supplemental Indenture, dated as of May 1, 2020, by and among Trane Technologies Luxembourg Finance S.A., Trane Technologies plc, Ingersoll-Rand Global Holding Company Limited, Ingersoll-Rand Company, Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., and the Bank of New York Mellon, as Trustee. \nIncorporated by reference to Exhibit 4.19 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n52\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n4.22\nSeventh Supplemental Indenture, dated as of May 1, 2020, by and among Trane Technologies Luxembourg Finance S.A., Trane Technologies plc, Ingersoll-Rand Global Holding Company Limited, Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., Trane Technologies Company LLC, and the Bank of New York Mellon, as Trustee.\nIncorporated by reference to Exhibit 4.20 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.23\nEighth Supplemental Indenture, dated as of May 1, 2020, by and among Trane Technologies Luxembourg Finance S.A., Trane Technologies plc, Ingersoll-Rand Global Holding Company Limited, Trane Technologies Lux International Holding Company S.à.r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., Trane Technologies Company LLC, and the Bank of New York Mellon, as Trustee.\nIncorporated by reference to Exhibit 4.21 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.24\nNinth Supplemental Indenture, dated as of May 1, 2020, by and among Trane Technologies Luxembourg Finance S.A., Trane Technologies plc, Ingersoll-Rand Global Holding Company Limited, Trane Technologies Lux International Holding Company S.à.r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., Trane Technologies Company LLC, and the Bank of New York Mellon, as Trustee.\nIncorporated by reference to Exhibit 4.22 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.25\nTenth Supplemental Indenture dated as of April 30, 2021, by and among Trane Technologies Financing Limited, Trane Technologies Global Holding Company Limited, Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., and Trane Technologies Company LLC and The Bank of New York Mellon, as Trustee.\n \nIncorporated by reference to Exhibit 4.24 to the Company's 2021 Form 10-K (File No. 001-34400) filed with the SEC on February 7, 2022.\n4.26\nEleventh Supplemental Indenture dated as of November 20, 2023, by and among Trane Technologies Financing Limited, Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., Trane Technologies Company LLC, Trane Technologies Americas Holding Corporation, and Trane Technologies Global Holding II Company Limited, and The Bank of New York Mellon, as Trustee.\nIncorporated by reference to Exhibit 4.26 to the Company's 2023 Form 10-K (File No. 001-34400) filed with the SEC on February 8, 2024.\n4.27\nIndenture, dated as of February 21, 2018, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Luxembourg Finance S.A., Ingersoll-Rand Lux International Holding Company S.à r.l., Ingersoll-Rand Irish Holdings Unlimited Company and Ingersoll-Rand Company, as guarantors, and Wells Fargo Bank, National Association, as Trustee.\nIncorporated by reference to Exhibit 4.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on February 26, 2018. \n53\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n4.28\nFirst Supplemental Indenture, dated as of February 21, 2018, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Luxembourg Finance S.A., Ingersoll-Rand Lux International Holding Company S.à r.l., Ingersoll-Rand Irish Holdings Unlimited Company and Ingersoll-Rand Company, as guarantors, and Wells Fargo Bank, National Association, as Trustee, relating to the 2.900% Senior Notes due 2021.\nIncorporated by reference to Exhibit 4.2 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on February 26, 2018.\n4.29\nSecond Supplemental Indenture, dated as of February 21, 2018, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Luxembourg Finance S.A., Ingersoll-Rand Lux International Holding Company S.à r.l., Ingersoll-Rand Irish Holdings Unlimited Company and Ingersoll-Rand Company, as guarantors, and Wells Fargo Bank, National Association, as Trustee, relating to the 3.750% Senior Notes due 2028.\nIncorporated by reference to Exhibit 4.4 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on February 26, 2018.\n4.30\nThird Supplemental Indenture, dated as of February 21, 2018, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Luxembourg Finance S.A., Ingersoll-Rand Lux International Holding Company S.à r.l., Ingersoll-Rand Irish Holdings Unlimited Company and Ingersoll-Rand Company, as guarantors, and Wells Fargo Bank, National Association, as Trustee, relating to the 4.300% Senior Notes due 2048.\nIncorporated by reference to Exhibit 4.6 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on February 26, 2018.\n4.31\nFourth Supplemental Indenture, dated as of March 21, 2019, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Luxembourg Finance S.A., Ingersoll-Rand Lux International Holding Company S.à r.l., Ingersoll-Rand Irish Holdings Unlimited Company and Ingersoll-Rand Company, as guarantors, and Wells Fargo Bank, National Association, as Trustee, relating to the 3.500% Senior Notes due 2026.\nIncorporated by reference to Exhibit 4.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on March 26, 2019.\n4.32\nFifth Supplemental Indenture, dated as of March 21, 2019, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Luxembourg Finance S.A., Ingersoll-Rand Lux International Holding Company S.à r.l., Ingersoll-Rand Irish Holdings Unlimited Company and Ingersoll-Rand Company, as guarantors, and Wells Fargo Bank, National Association, as Trustee, relating to the 3.800% Senior Notes due 2029.\nIncorporated by reference to Exhibit 4.3 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on March 26, 2019.\n4.33\nSixth Supplemental Indenture, dated as of March 21, 2019, by and among Ingersoll-Rand Global Holding Company Limited, as issuer, Ingersoll-Rand plc, Ingersoll-Rand Luxembourg Finance S.A., Ingersoll-Rand Lux International Holding Company S.à r.l., Ingersoll-Rand Irish Holdings Unlimited Company and Ingersoll-Rand Company, as guarantors, and Wells Fargo Bank, National Association, as Trustee, relating to the 4.500% Senior Notes due 2049.\nIncorporated by reference to Exhibit 4.5 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on March 26, 2019.\n54\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n4.34\nSeventh Supplemental Indenture, dated as of May 1, 2020, by and among Ingersoll-Rand Global Holding Company Limited, Trane Technologies Luxembourg Finance S.A., Trane Technologies plc, Ingersoll-Rand Company, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc. and Wells Fargo Bank, National Association, as Trustee. \nIncorporated by reference to Exhibit 4.30 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.35\nEighth Supplemental Indenture, dated as of May 1, 2020, by and among Ingersoll-Rand Global Holding Company Limited, Trane Technologies Luxembourg Finance S.A., Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., Trane Technologies Company LLC and Wells Fargo Bank, National Association, as Trustee.\nIncorporated by reference to Exhibit 4.31 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.36\nNinth Supplemental Indenture, dated as of May 1, 2020, by and among Ingersoll-Rand Global Holding Company Limited, Trane Technologies Luxembourg Finance S.A., Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., Trane Technologies Company LLC and Wells Fargo Bank, National Association, as Trustee.\nIncorporated by reference to Exhibit 4.32 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.37\nTenth Supplemental Indenture, dated as of May 1, 2020, by and among Ingersoll-Rand Global Holding Company Limited, Trane Technologies Luxembourg Finance S.A., Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc., Trane Technologies Company LLC and Wells Fargo Bank, National Association, as Trustee.\nIncorporated by reference to Exhibit 4.33 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n4.38\nEleventh Supplemental Indenture dated as of April 30, 2021, by and among Trane Technologies Financing Limited, Trane Technologies Global Holding Company Limited, Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies HoldCo Inc. and Trane Technologies Company LLC and Wells Fargo Bank, National Association.\nIncorporated by reference to Exhibit 4.36 to the Company's 2021 Form 10-K (File No. 001-34400) filed with the SEC on February 7, 2022.\n4.39\nTwelfth Supplemental Indenture dated as of November 20, 2023, by and among Trane Technologies Financing Limited, Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holding Unlimited Company, Trane Technologies HoldCo Inc., Trane Technologies Company LLC, Trane Technologies Americas Holding Corporation, and Trane Technologies Global Holding II Company Limited, and Computershare Trust Company, N.A. acting as Trustee.\nIncorporated by reference to Exhibit 4.39 to the Company's 2023 Form 10-K (File No. 001-34400) filed with the SEC on February 8, 2024.\n55\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n4.41\nIndenture, dated as of March 3, 2023, by and among Trane Technologies Financing Limited, as issuer, Trane Technologies plc, Trane Technologies Global Holding Company Limited, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Company LLC and Trane Technologies HoldCo Inc., as guarantors, and Computershare Trust Company, N.A., as Trustee, relating to the 5.250% Senior Notes due 2033.\nIncorporated by reference to Exhibit 4.1 to the Company's 2023 Form 8-K (File No. 001-34400) filed with the SEC on March 3, 2023.\n4.42\nSupplemental Indenture, dated as of March 3, 2023, by and among Trane Technologies Financing Limited, as issuer, Trane Technologies plc, Trane Technologies Global Holding Company Limited, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Company LLC and Trane Technologies HoldCo Inc., as guarantors, and Computershare Trust Company, N.A., as Trustee, relating to the 5.250% Senior Notes due 2033.\nIncorporated by reference to Exhibit 4.2 to the Company's 2023 Form 8-K (File No. 001-34400) filed with the SEC on March 3, 2023.\n4.43\nSecond Supplemental Indenture, dated as of November 20, 2023, by and among Trane Technologies Financing Limited, as issuer, Trane Technologies plc, Trane Technologies Global Holding Company Limited, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Company LLC and Trane Technologies HoldCo Inc., as guarantors, Trane Technologies Americas Holding Corporation and Trane Technologies Global Holding II Company Limited, as New Guarantors and Computershare Trust Company, N.A., as Trustee, relating to the 5.250% Senior Notes due 2033.\nIncorporated by reference to Exhibit 4.43 to the Company's 2023 Form 10-K (File No. 001-34400) filed with the SEC on February 8, 2024.\n4.44\nIndenture, dated as of June 13, 2024, by and among Trane Technologies Financing Limited, as issuer, Trane Technologies plc, Trane Technologies Global Holding II Company Limited, Trane Technologies Americas Holding Corporation, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Company LLC and Trane Technologies HoldCo Inc., as guarantors, and Computershare Trust Company, N.A., as Trustee, relating to the 5.100% Senior Notes due 2034.\nIncorporated by reference to Exhibit 4.1 to the Company's 2023 Form 8-K (File No. 001-34400) filed with the SEC on June 13, 2024.\n4.45\nSupplemental Indenture, dated as of June 13, 2024, by and among Trane Technologies Financing Limited, as issuer, Trane Technologies plc, Trane Technologies Global Holding II Company Limited, Trane Technologies Americas Holding Corporation, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Company LLC and Trane Technologies HoldCo Inc., as guarantors, and Computershare Trust Company, N.A., as Trustee, relating to the 5.100% Senior Notes due 2034.\nIncorporated by reference to Exhibit 4.2 to the Company's 2023 Form 8-K (File No. 001-34400) filed with the SEC on June 13, 2024.\n4.46\nDescription of Registrant\n'\ns Securities \nFiled herewith.\n10.1*\nForm of Global Stock Option Award Agreement (January 2025).\n  \nFiled herewith.\n56\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n10.2*\nForm of Global Restricted Stock Unit Award Agreement (January 2025).\n  \nFiled herewith.\n10.3*\nForm of Global Performance Stock Unit Award Agreement (January 2025).\n  \nFiled herewith.\n10.4\nCredit Agreement dated June 18, 2021 among Trane Technologies Holdco Inc.\n, Trane Technologies Global Holding Company Limited and Trane Technologies Financing Limited, Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l.,\n Trane \nTechnologies\n Irish Holdings Unlimited Company, Trane Technologies Company LLC, JPMorgan Chase Bank, N.A., as Administrative Agent, Citibank, N.A., as Syndication Agent, J.P. Morgan Securities LLC and BNP Paribas, as Sustainability Structuring Agents, Deutsche Bank Securities Inc., Goldman Sachs Bank USA, MUFG Bank, Ltd. and U.S. Bank National Association as Documentation Agents, and JPMorgan Chase Bank, N.A., Citibank, N.A., BofA Securities, Inc., BNP Securities Corp. and Mizuho Bank, Ltd., as joint lead arrangers and joint bookrunners, and certain lending institutions from time to time parties thereto\n.\nIncorporated by reference to Exhibit 10.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on June 24, 2021.\n10.5\nFirst Amendment dated as of June 30, 2022, to the Credit Agreement dated as of June 18, 2021, among Trane Technologies Holdco Inc, Trane Technologies Global Holding Company Limited, Trane Technologies Financing Limited and JPMorgan Chase Bank N.A.  as Administrative Agent.\nIncorporated by reference to Exhibit 10.3 to the Company's Q2 2022 Form 10-Q (File No. 001-34400) filed with the SEC on August 3, 2022.\n10.6\nSecond Amendment dated as of September 20, 2023 dated as of September 20, 2023, to the Credit Agreement dated as of June 18, 2021 (as amended by that First Amendment dated as of June 30, 2022, the “Existing Credit Agreement” and as amended by this Amendment, the “Amended Credit Agreement”), among Trane Technologies Holdco Inc.,  a  Delaware corporation (“Trane Holdco”), Trane Technologies Global Holding Company Limited,  a  Delaware corporation (“Trane Global”), Trane Technologies Financing Limited.\nIncorporated by reference to Exhibit 10.1 to the Company's Q3 2023 Form 10-Q (file No. 001-34400) filed with the SEC on November 1, 2023.\n10.7\nConsent and Third Amendment dated as of November 20, 2023, to the Credit Agreement dated as of June 18, 2021, among Trane Technologies Holdco Inc., Trane Technologies Global Holding Company Limited, and Trane Technologies Financing Limited, as Borrowers; Trane Technologies PLC, as Guarantor; and JPMorgan Chase Bank N.A. as Administrative Agent.\nIncorporated by reference to Exhibit 10.7 to the Company's 2023 Form 10-K (File No. 001-34400) filed with the SEC on February 8, 2024.\n57\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n10.8\nCredit Agreement dated April 25, 2022 among Trane Technologies Holdco Inc., Trane Technologies Global Holding Company Limited and Trane Technologies Financing Limited, Trane Technologies plc, Trane Technologies Lux International Holding Company S.à r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Company LLC, JPMorgan Chase Bank, N.A., as Administrative Agent, Citibank, N.A., as Syndication Agent, J.P. Morgan Securities LLC and BNP Paribas, as Sustainability Structuring Agents, Bank of America, N.A., BNP Paribas, Deutsche Bank Securities Inc., Goldman Sachs Bank USA, MUFG Bank, Ltd. and U.S. Bank, N.A., as Documentation Agents, and JPMorgan Chase Bank, N.A., Citibank, N.A., BofA Securities, Inc., BNP Securities Corp. and Mizuho Bank, Ltd., as joint lead arrangers and joint bookrunners, and certain lending institutions from time to time parties thereto.\nIncorporated by reference to Exhibit 10.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on April 28, 2022.\n10.9\nFirst Amendment dated as of September 20, 2023 September 20, 2023, to the Credit Agreement dated as of April 25, 2022 (the “Existing Credit Agreement” and as amended by this Amendment, the “Amended Credit Agreement”), among Trane Technologies Holdco Inc., a Delaware corporation (“Trane  Holdco”),  Trane Technologies Global Holding Company Limited, a Delaware corporation (“Trane  Global”),  Trane Technologies Financing Limited.\nIncorporated by reference to Exhibit 10.2 to the Company's Q3 2023 Form 10-Q (file No. 001-34400) filed with the SEC on November 1, 2023.\n10.10\nConsent and Second Amendment dated as of November 20, 2023, to the Credit Agreement dated as of April 25, 2022, among Trane Technologies Holdco Inc., Trane Technologies Global Holding Company Limited,  Trane Technologies Financing Limited, as Borrowers; Trane Technologies PLC, as Guarantor; and JPMorgan Chase Bank N.A. as Administrative Agent.\nIncorporated by reference to Exhibit 10.10 to the Company's 2023 Form 10-K (File No. 001-34400) filed with the SEC on February 8, 2024.\n10.11\nDeed Poll Indemnity of Trane Technologies plc dated August 2, 2022\nIncorporated by reference to Exhibit 10.1 to the Company's Q2 2022 Form 10-Q (File No. 001-34400) filed with the SEC on August 3, 2022.\n10.12\nDeed Poll Indemnity of Trane Technologies Lux International Holding company S.à r.l. dated August 2, 2022\nIncorporated by reference to Exhibit 10.2 to the Company's Q2 2022 Form 10-Q (File No. 001-34400) filed with the SEC on August 3, 2022.\n10.13*\nTrane Technologies Incentive Stock Plan of 2013 (amended and restated as of March 2, 2020).\n  \nIncorporated by reference to Exhibit 10.9 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n10.14*\nTrane Technologies Incentive Stock Plan of 2018 (amended and restated as of March 2, 2020).\nIncorporated by reference to Exhibit 10.10 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n10.15*\nTrane Technologies Executive Deferred Compensation Plan (as amended and restated effective May 4, 2020).\nIncorporated by reference to Exhibit 10.11 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n10.16*\nTrane Technologies Executive Deferred Compensation Plan II (as amended and restated effective May 4, 2020).\n  \nIncorporated by reference to Exhibit 10.13 to the Company's 2021 Form 10-K (File No. 001-34400) filed with the SEC on February 7, 2022.\n10.17*\nTrane Technologies Director Deferred Compensation and Stock Award Plan (as amended and restated effective March 2, 2020).\nIncorporated by reference to Exhibit 10.13 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n58\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n10.18*\nTrane Technologies Director Deferred Compensation and Stock Award Plan II (as amended and restated effective March 2, 2020).\nIncorporated by reference to Exhibit 10.14 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n10.19*\nTrane Technologies Supplemental Employee Savings Plan (amended and restated effective May 4, 2020).\n  \nIncorporated by reference to Exhibit 10.15 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n10.20*\nTrane Technologies Supplemental Employee Savings Plan II (effective January 1, 2005 and amended and restated through May 4, 2020).\n  \nIncorporated by reference to Exhibit 10.16 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n10.21*\nTrane Inc. Deferred Compensation Plan (as amended and restated as of May 4, 2020, except where otherwise stated).\n  \nIncorporated by reference to Exhibit 10.17 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n10.22*\nTrane Technologies Supplemental Pension Plan (Amended and Restated Effective May 4, 2020).\nIncorporated by reference to Exhibit 10.18 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n10.23*\nTrane Technologies Supplemental Pension Plan II (Amended and Restated Effective May 4, 2020). \nIncorporated by reference to Exhibit 10.19 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n10.24*\nTrane Technologies Key Management Supplemental Program (Effective January 1, 2005 and Amended and Restated effective May 4, 2020).\nIncorporated by reference to Exhibit 10.22 to the Company's 2021 Form 10-K (File No. 001-34400) filed with the SEC on February 7, 2022.\n10.25*\nDescription of Annual Incentive Matrix Program.\nIncorporated by reference to Exhibit 10.23 to the Company's 2021 Form 10-K (File No. 001-34400) filed with the SEC on February 7, 2022.\n10.26*\nAmendment One to the Trane Technologies Key Management Supplemental Program (effective October 11, 2022).\nIncorporated by reference to Exhibit 10.23 to the Company's 2022 Form 10-K (File No. 001-34400) filed with the SEC on February 10, 2023. \n10.27*\nTrane Inc. Deferred Compensation Plan (as Amended and Restated as of May 4, 2020). \nIncorporated by reference to Exhibit 10.24 to the Company's 2022 Form 10-K (File No. 001-34400) filed with the SEC on February 10, 2023.\n10.28*\nForm of Tier 1 Change in Control Agreement (New Officers on or after May 19, 2009).\nIncorporated by reference to Exhibit 10.32 to the Company's Form 10-Q for the period ended June 30, 2009 (File No. 001-34400) filed with the SEC on August 6, 2009.\n10.29*\nForm of Tier 2 Change in Control Agreement (New Officers on or after May 19, 2009).\nIncorporated by reference to Exhibit 10.33 to the Company's Form 10-Q for the period ended June 30, 2009 (File No. 001-34400) filed with the SEC on August 6, 2009.\n10.30*\nAmended and Restated Major Restructuring Severance Plan (as amended and restated effective May 4, 2020).\nIncorporated by reference to Exhibit 10.27 to the Company's 2020 Form 10-K (File No. 001-34400) filed with the SEC on February 9, 2021.\n10.31*\nDavid S. Regnery Letter, dated as of September 1, 2017.\nIncorporated by reference to Exhibit 10.44 to the Company's Form 10-K for the year ended December 31, 2018 (File No. 001-34400) filed with the SEC on February 12, 2019. \n10.32*\nDavid S. Regnery Letter, dated as of December 9, 2019.\nIncorporated by reference to Exhibit 10.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on December 11, 2019. \n10.33*\nDavid S. Regnery Letter, dated as of June 3, 2021.\nIncorporated by reference to Exhibit 10.1 to the Company's Form 8-K (Filed No. 001-34400) filed with the SEC on June 4, 2021.\n10.34*\nChristopher J. Kuehn Letter, dated as of December 10, 2019.\nIncorporated by reference to Exhibit 10.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on December 10, 2019.\n59\nTable of Contents\nExhibit No.\nDescription\n  \nMethod of Filing\n10.35*\nPaul A. Camuti Letter, dated December 5, 2019.\nIncorporated by reference to Exhibit 10.42 to the Company's 2021 Form 10-K (File No. 001-34400) filed with the SEC on February 7, 2022.\n10.36*\nMark Majocha Offer Letter dated October 12, 2022\nIncorporated by reference to Exhibit 10.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on October 14, 2022.\n10.37*\nBeth Elwell Offer Letter dated January 4, 2024\nIncorporated by reference to Exhibit 10.1 to the Company's Form 8-K (File No. 001-34400) filed with the SEC on January 10, 2024.\n10.38*\nMauro Atalla Offer Letter dated January 6, 2025\nFiled herewith.\n19\nInsider Trading Policy\nFiled herewith.\n21\nList of Subsidiaries of Trane Technologies plc.\nFiled herewith.\n22.1\nList of Guarantors and Subsidiary Issuers of Guaranteed Securities.\nFiled herewith.\n23.1\nConsent of Independent Registered Public Accounting Firm.\nFiled herewith.\n31.1\nCertification of Chief Executive Officer Pursuant to Rule 13a-14(a) or Rule 15d-14(a), as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n  \nFiled herewith.\n31.2\nCertification of Chief Financial Officer Pursuant to Rule 13a-14(a) or Rule 15d-14(a), as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n  \nFiled herewith.\n32\nCertifications of Chief Executive Officer and Chief Financial Officer Pursuant to Rule 13a-14(b) or Rule 15d-14(b) and 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n  \nFurnished herewith.\n97.1\nTrane Technologies plc Clawback / Recoupment Policy \nFiled herewith. \n97.2\nTrane Technologies Financing Limited Clawback / Recoupment Policy\nFiled herewith.\n101\nThe following materials from the Company's Annual Report on Form 10-K for the year ended December 31, 2024, formatted in iXBRL (Inline Extensible Business Reporting Language): (i) the Consolidated Statements of Earnings, (ii) the Consolidated Statements of Comprehensive Income, (iii) the Consolidated Balance Sheets, (iv) the Consolidated Statements of Equity, (v) the Consolidated Statements of Cash Flows, and (vi) Notes to Consolidated Financial Statements.\n  \nFurnished herewith.\n104\nCover Page Interactive Data File (embedded within the iXBRL document and contained in Exhibit 101).\nFiled herewith.\n* Management contract or compensatory plan or arrangement.\nItem 16.\n \nFORM 10-K SUMMARY\nNot applicable.\n60\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTRANE TECHNOLOGIES PLC\n(Registrant)\n \nBy:\n/s/ David S. Regnery\nDavid S. Regnery\nChair of the Board and Chief Executive Officer (Principal Executive Officer)\nDate:\nFebruary 6, 2025\n61\nTable of Contents\nPursuant to the requirement of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n \nSignature\n  \nTitle\n \nDate\n/s/ David S. Regnery\n  \nChair of the Board and Chief Executive Officer (Principal Executive Officer)\n \nFebruary 6, 2025\n(David S. Regnery)\n/s/ Christopher J. Kuehn\n  \nExecutive Vice President and Chief Financial Officer (Principal Financial Officer)\n \nFebruary 6, 2025\n(Christopher J. Kuehn)\n/s/ Elizabeth Elwell\n  \nVice President and Chief Accounting Officer (Principal Accounting Officer)\n \nFebruary 6, 2025\n(Elizabeth Elwell)\n/s/ Kirk E. Arnold\n  \nDirector\n \nFebruary 6, 2025\n(Kirk E. Arnold)\n/s/ Ana P. Assis\nDirector\nFebruary 6, 2025\n(Ana P. Assis)\n/s/ Ann C. Berzin\n  \nDirector\n \nFebruary 6, 2025\n(Ann C. Berzin)\n/s/ April Miller Boise\nDirector\nFebruary 6, 2025\n(April Miller Boise)\n/s/ Gary D. Forsee\n  \nDirector\n \nFebruary 6, 2025\n(Gary D. Forsee)\n/s/ Mark R. George\n  \nDirector\n \nFebruary 6, 2025\n(Mark R. George)\n/s/ John A. Hayes\n  \nDirector\n \nFebruary 6, 2025\n(John A. Hayes)\n/s/ Linda P. Hudson\nDirector\nFebruary 6, 2025\n(Linda P. Hudson)\n/s/ Myles P. Lee\n  \nDirector\nFebruary 6, 2025\n(Myles P. Lee)\n/s/ Melissa N. Schaeffer\nDirector\nFebruary 6, 2025\n(Melissa N. Schaeffer)\n/s/ John P. Surma\nDirector\nFebruary 6, 2025\n (John P. Surma)\n62\nTable of Contents\nTRANE TECHNOLOGIES PLC\nIndex to Consolidated Financial Statements\n \nReport of Independent Registered Public Accounting Firm\n (PCAOB ID \n238\n)\nF-\n2\nConsolidated Statements of Earnings\nF-\n5\nConsolidated Statements of Comprehensive Income\nF-\n6\nConsolidated Balance Sheets\nF-\n7\nConsolidated Statements of Equity\nF-\n8\nConsolidated Statements of Cash Flows\nF-\n9\nNotes to Consolidated Financial Statements\nF-\n10\nF-1\nTable of Contents\nReport of Independent Registered Public Accounting Firm \nTo the Board of Directors and Shareholders of Trane Technologies plc\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Trane Technologies plc and its subsidiaries (the \"Company\") as of December 31, 2024 and 2023 and the related consolidated statements of earnings, of comprehensive income, of equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes (collectively referred to as the \"consolidated financial statements\"). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework \n(2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework \n(2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management's Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company's consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nF-2\nTable of Contents\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that (i) relate to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition from Contracts with Customers\nAs described in Notes 2 and 12 to the consolidated financial statements, the Company recognized $19.8 billion of consolidated net revenue for the year ended December 31, 2024. Revenue is recognized when control of a good or service promised in a contract (i.e., performance obligation) is transferred to a customer. Control is obtained when a customer has the ability to direct the use of and obtain substantially all of the remaining benefits from that good or service. A majority of the Company's revenue is recognized at a point-in-time as control is transferred at a distinct point in time per the terms of a contract. However, a portion of the Company's revenue is recognized over-time as the customer simultaneously receives control as the Company performs work under a contract. For these arrangements, management uses the cost-to-cost input method as it best depicts the transfer of control to the customer that occurs as the Company incurs costs. The transaction price allocated to performance obligations reflects the Company's expectations about the consideration it will be entitled to receive from a customer. To determine the transaction price, management assesses variable and noncash consideration as well as whether a significant financing component exists.\nThe principal considerations for our determination that performing procedures relating to revenue recognition from contracts with customers is a critical audit matter are the high degree of auditor effort in performing procedures and evaluating audit evidence related to the Company's revenue recognition of point-in-time and over-time contracts with customers.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process on the Company's point-in-time and over-time contracts with customers. These procedures also included, among others (i) evaluating revenue transactions on a sample basis by obtaining and inspecting evidence of an arrangement with a customer, evidence of goods delivered or services provided and evidence of consideration received in exchange for transferring those goods or services, and (ii) evaluating the completeness and accuracy of data provided by management.\nAnnual Goodwill Impairment Test – Nuvolo Reporting Unit \nAs described in Notes 2 and 5 to the consolidated financial statements, the Company's consolidated goodwill balance was $6,128 million as of December 31, 2024, of which $313 million relates to one reporting unit formed upon the acquisition of Nuvolo in November 2023. Management tests goodwill for impairment annually during the fourth quarter or whenever there is a significant change in events or circumstances that indicate that the fair value of the asset is more likely than not less than the carrying amount of the asset. Impairment of goodwill is tested at the reporting unit level. The test compares the carrying amount of the reporting unit to its estimated fair value. If the estimated fair value of a reporting unit exceeds its carrying amount, goodwill of the reporting unit is not impaired. To the extent that the carrying value of the reporting unit exceeds its estimated fair value, an impairment loss would be recognized for the amount by which the reporting unit's carrying amount exceeds its fair value, not to exceed the carrying amount of goodwill in that reporting unit. As disclosed by management, because quoted market prices are not available for the Company's reporting units, the calculation of their estimated fair value is determined using three valuation techniques: a discounted cash flow model (an income approach), a market-adjusted multiple of earnings or revenues (a market approach), and a similar transactions method (also a market approach). The discounted cash flow approach relies on management's estimates of future cash flows and explicitly addresses factors such as timing, revenue growth rates, and margins, with due consideration given to forecasting risk. The market-adjusted multiple of earnings or revenues approach reflects the market's expectations for future growth and risk, with adjustments to account for differences between the guideline publicly traded companies and the Company's reporting units. The similar transactions method considers prices paid in transactions that have recently occurred in the reporting unit's industry or in related industries. These valuation techniques are weighted 50%, 40% and 10%, respectively. Under the income approach, management's assumptions include the revenue growth rate and discount rate. Under the guideline public company method, the Company used multiples of earnings before interest, taxes, depreciation and amortization (EBITDA) or revenues based on the market information of comparable companies.\nThe principal considerations for our determination that performing procedures relating to the goodwill impairment assessment of the Nuvolo reporting unit is a critical audit matter are (i) the significant judgment by management when developing the fair value estimate of the Nuvolo reporting unit; (ii) a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating management's significant assumptions related to revenue growth rate and discount rate used in the  \nF-3\nTable of Contents\ndiscounted cash flow valuation model; and (iii) the audit effort involved the use of professionals with specialized skill and knowledge. \nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management's goodwill impairment test, including controls over the valuation of the Nuvolo reporting unit. These procedures also included, among others (i) testing management's process for developing the fair value estimate of the Nuvolo reporting unit; (ii) evaluating the appropriateness of the valuation techniques used by management; (iii) testing the completeness and accuracy of underlying data used in the discounted cash flow model and market-adjusted multiple of revenues valuation approach; and (iv) evaluating the reasonableness of the significant assumptions used by management related to revenue growth rate and discount rate used in the discounted cash flow valuation model. Evaluating management's assumptions related to revenue growth rate involved evaluating whether the assumptions used by management were reasonable considering (i) the current performance of the Nuvolo reporting unit; (ii) the consistency with external market and industry data; and (iii) whether these assumptions were consistent with evidence obtained in other areas of the audit. Professionals with specialized skill and knowledge were used to assist in evaluating (i) the appropriateness of the valuation techniques and (ii) the reasonableness of the discount rate assumption.\n/s/ \nPricewaterhouseCoopers LLP\nCharlotte, North Carolina\nFebruary 6, 2025\nWe have served as the Company's auditor since at least 1906. We have not been able to determine the specific year we began serving as auditor of the Company.\nF-4\nTable of Contents\nTrane Technologies plc\nConsolidated Statements of Earnings\nIn millions, except per share amounts\nFor the years ended December 31,\n2024\n2023\n2022\nNet revenues\nProducts\n$\n13,314.5\n \n$\n11,975.4\n \n$\n10,930.8\n \nServices\n6,523.7\n \n5,702.2\n \n5,060.9\n \n19,838.2\n \n17,677.6\n \n15,991.7\n \nCosts and expenses\nCost of products sold\n(\n8,927.9\n)\n(\n8,414.2\n)\n(\n7,935.2\n)\nCost of services sold\n(\n3,829.8\n)\n(\n3,406.2\n)\n(\n3,091.7\n)\nSelling and administrative expenses\n(\n3,580.4\n)\n(\n2,963.2\n)\n(\n2,545.9\n)\nOperating income\n3,500.1\n \n2,894.0\n \n2,418.9\n \nInterest expense\n(\n238.4\n)\n(\n234.5\n)\n(\n223.5\n)\nOther income/(expense), net\n(\n19.9\n)\n(\n92.2\n)\n(\n23.3\n)\nEarnings before income taxes\n3,241.8\n \n2,567.3\n \n2,172.1\n \nProvision for income taxes\n(\n627.6\n)\n(\n498.4\n)\n(\n375.9\n)\nEarnings from continuing operations\n2,614.2\n \n2,068.9\n \n1,796.2\n \nDiscontinued operations, net of tax\n(\n24.7\n)\n(\n27.2\n)\n(\n21.5\n)\nNet earnings\n2,589.5\n \n2,041.7\n \n1,774.7\n \nLess: Net earnings from continuing operations attributable to noncontrolling interests\n(\n21.6\n)\n(\n17.8\n)\n(\n18.2\n)\nNet earnings attributable to Trane Technologies plc\n$\n2,567.9\n \n$\n2,023.9\n \n$\n1,756.5\n \nAmounts attributable to Trane Technologies plc ordinary shareholders:\nContinuing operations\n$\n2,592.6\n \n$\n2,051.1\n \n$\n1,778.0\n \nDiscontinued operations\n(\n24.7\n)\n(\n27.2\n)\n(\n21.5\n)\nNet earnings\n$\n2,567.9\n \n$\n2,023.9\n \n$\n1,756.5\n \nEarnings (loss) per share attributable to Trane Technologies plc ordinary shareholders:\nBasic:\nContinuing operations\n$\n11.46\n \n$\n8.97\n \n$\n7.65\n \nDiscontinued operations\n(\n0.11\n)\n(\n0.12\n)\n(\n0.10\n)\nNet earnings\n$\n11.35\n \n$\n8.85\n \n$\n7.55\n \nDiluted:\nContinuing operations\n$\n11.35\n \n$\n8.89\n \n$\n7.57\n \nDiscontinued operations\n(\n0.11\n)\n(\n0.12\n)\n(\n0.09\n)\nNet earnings\n$\n11.24\n \n$\n8.77\n \n$\n7.48\n \nSee accompanying notes to Consolidated Financial Statements.\nF-5\nTable of Contents\nTrane Technologies plc\nConsolidated Statements of Comprehensive Income\nIn millions\nFor the years ended December 31,\n2024\n2023\n2022\nNet earnings\n$\n2,589.5\n \n$\n2,041.7\n \n$\n1,774.7\n \nOther comprehensive income (loss):\nCurrency translation\n(\n201.6\n)\n72.5\n \n(\n202.7\n)\nCash flow hedges\nUnrealized net gains (losses) arising during period\n(\n6.8\n)\n(\n4.4\n)\n(\n24.3\n)\nNet (gains) losses reclassified into earnings\n1.0\n \n13.5\n \n10.2\n \nTax (expense) benefit\n1.4\n \n(\n1.6\n)\n2.5\n \nTotal cash flow hedges, net of tax\n(\n4.4\n)\n7.5\n \n(\n11.6\n)\nPension and OPEB adjustments:\nPrior service costs for the period\n—\n \n—\n \n(\n3.3\n)\nNet actuarial gains (losses) for the period\n(\n0.1\n)\n16.8\n \n54.2\n \nAmortization reclassified into earnings\n5.4\n \n7.4\n \n21.6\n \nNet curtailment and settlement losses reclassified into earnings\n(\n1.0\n)\n1.4\n \n15.0\n \nCurrency translation and other\n11.0\n \n(\n3.7\n)\n12.7\n \nTax (expense) benefit\n(\n3.2\n)\n(\n6.2\n)\n(\n16.1\n)\nTotal pension and OPEB adjustments, net of tax\n12.1\n \n15.7\n \n84.1\n \nOther comprehensive income (loss), net of tax\n(\n193.9\n)\n95.7\n \n(\n130.2\n)\nComprehensive income, net of tax\n$\n2,395.6\n \n$\n2,137.4\n \n$\n1,644.5\n \nLess: Comprehensive income attributable to noncontrolling interests\n(\n21.0\n)\n(\n18.1\n)\n(\n16.6\n)\nComprehensive income attributable to Trane Technologies plc\n$\n2,374.6\n \n$\n2,119.3\n \n$\n1,627.9\n \nSee accompanying notes to Consolidated Financial Statements.\nF-6\nTable of Contents\nTrane Technologies plc\nConsolidated Balance Sheets\nIn millions, except share amounts\nDecember 31,\n2024\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n1,590.1\n \n$\n1,095.3\n \nAccounts and notes receivable, net\n3,090.2\n \n2,956.8\n \nInventories\n1,971.5\n \n2,152.1\n \nOther current assets\n686.0\n \n665.7\n \nTotal current assets\n7,337.8\n \n6,869.9\n \nProperty, plant and equipment, net\n2,024.5\n \n1,772.2\n \nGoodwill\n6,127.9\n \n6,095.3\n \nIntangible assets, net\n3,308.2\n \n3,439.8\n \nOther noncurrent assets\n1,348.3\n \n1,214.7\n \nTotal assets\n$\n20,146.7\n \n$\n19,391.9\n \nLIABILITIES AND EQUITY\nCurrent liabilities:\nAccounts payable\n$\n2,148.0\n \n$\n2,025.2\n \nAccrued compensation and benefits\n678.4\n \n591.7\n \nAccrued expenses and other current liabilities\n2,790.3\n \n2,634.7\n \nShort-term borrowings and current maturities of long-term debt\n452.2\n \n801.9\n \nTotal current liabilities\n6,068.9\n \n6,053.5\n \nLong-term debt\n4,318.1\n \n3,977.9\n \nPostemployment and other benefit liabilities\n561.9\n \n596.9\n \nDeferred and noncurrent income taxes\n586.6\n \n703.7\n \nOther noncurrent liabilities\n1,124.3\n \n1,042.9\n \nTotal liabilities\n12,659.8\n \n12,374.9\n \nEquity:\nTrane Technologies plc shareholders' equity\nOrdinary shares, $\n1.00\n par value (\n248,971,153\n and \n251,673,874\n shares issued at December 31, 2024 and 2023, respectively)\n249.0\n \n251.7\n \nOrdinary shares held in treasury, at cost (\n24,497,206\n and \n24,500,713\n shares at December 31, 2024 and 2023, respectively)\n(\n1,719.3\n)\n(\n1,719.4\n)\nRetained earnings\n9,791.8\n \n9,133.7\n \nAccumulated other comprehensive income (loss)\n(\n864.1\n)\n(\n670.8\n)\nTotal Trane Technologies plc shareholders' equity\n7,457.4\n \n6,995.2\n \nNoncontrolling interest\n29.5\n \n21.8\n \nTotal equity\n7,486.9\n \n7,017.0\n \nTotal liabilities and equity\n$\n20,146.7\n \n$\n19,391.9\n \nSee accompanying notes to Consolidated Financial Statements.\nF-7\nTrane Technologies plc\nConsolidated Statements of Equity\nTrane Technologies plc shareholders' equity\nIn millions, except per share amounts\nTotal\nequity\nOrdinary shares\nOrdinary shares held in treasury, at cost\nCapital in\nexcess of\npar value\nRetained\nearnings\nAccumulated other\ncomprehensive\nincome (loss)\nNoncontrolling Interest\nAmount at par value\nShares\nBalance at December 31, 2021\n$\n6,273.1\n \n$\n259.7\n \n259.7\n \n$\n(\n1,719.4\n)\n$\n—\n \n$\n8,353.2\n \n$\n(\n637.6\n)\n$\n17.2\n \nNet earnings\n1,774.7\n \n—\n \n— \n— \n—\n \n1,756.5\n \n—\n \n18.2\n \nOther comprehensive income (loss)\n(\n130.2\n)\n—\n \n— \n— \n—\n \n—\n \n(\n128.6\n)\n(\n1.6\n)\nShares issued under incentive stock plans\n2.6\n \n1.1\n \n1.1\n \n— \n1.5\n \n—\n \n—\n \n—\n \nRepurchase of ordinary shares\n(\n1,200.2\n)\n(\n7.5\n)\n(\n7.5\n)\n—\n \n(\n45.4\n)\n(\n1,147.3\n)\n—\n \n—\n \nShare-based compensation\n54.3\n \n—\n \n— \n— \n56.2\n \n(\n1.9\n)\n—\n \n—\n \nDividends declared to noncontrolling interest\n(\n14.5\n)\n— \n— \n— \n— \n— \n— \n(\n14.5\n)\nCash dividends declared ($\n2.68\n per share)\n(\n620.7\n)\n—\n \n— \n— \n— \n(\n620.7\n)\n—\n \n—\n \nAcquisition/divestiture of noncontrolling interests\n(\n15.1\n)\n— \n— \n— \n(\n12.4\n)\n— \n— \n(\n2.7\n)\nSeparation of Ingersoll Rand Industrial\n(\n18.9\n)\n—\n \n— \n— \n—\n \n(\n18.9\n)\n—\n \n—\n \nOther\n0.1\n \n—\n \n— \n— \n0.1\n \n—\n \n—\n \n—\n \nBalance at December 31, 2022\n$\n6,105.2\n \n$\n253.3\n \n253.3\n \n$\n(\n1,719.4\n)\n$\n—\n \n$\n8,320.9\n \n$\n(\n766.2\n)\n$\n16.6\n \nNet earnings\n2,041.7\n \n—\n \n— \n— \n—\n \n2,023.9\n \n—\n \n17.8\n \nOther comprehensive income (loss)\n95.7\n \n—\n \n— \n—\n \n—\n \n95.4\n \n0.3\n \nShares issued under incentive stock plans\n79.3\n \n1.7\n \n1.7\n \n— \n77.6\n \n—\n \n—\n \n—\n \nRepurchase of ordinary shares\n(\n669.3\n)\n(\n3.3\n)\n(\n3.3\n)\n—\n \n(\n142.1\n)\n(\n523.9\n)\n—\n \n—\n \nShare-based compensation\n61.6\n \n—\n \n— \n— \n64.3\n \n(\n2.7\n)\n—\n \n—\n \nDividends declared to noncontrolling interest\n(\n12.9\n)\n—\n \n— \n— \n—\n \n—\n \n—\n \n(\n12.9\n)\nCash dividends declared ($\n3.00\n per share)\n(\n684.5\n)\n—\n \n— \n— \n—\n \n(\n684.5\n)\n—\n \n—\n \nOther\n0.2\n \n— \n— \n— \n0.2\n \n—\n \n— \n— \nBalance at December 31, 2023\n$\n7,017.0\n \n$\n251.7\n \n251.7\n \n$\n(\n1,719.4\n)\n$\n—\n \n$\n9,133.7\n \n$\n(\n670.8\n)\n$\n21.8\n \nNet earnings\n2,589.5\n \n—\n \n— \n— \n—\n \n2,567.9\n \n—\n \n21.6\n \nOther comprehensive income (loss)\n(\n193.9\n)\n—\n \n— \n—\n \n—\n \n(\n193.3\n)\n(\n0.6\n)\nShares issued under incentive stock plans\n46.9\n \n1.2\n \n1.2\n \n0.1 \n45.6\n \n—\n \n—\n \n—\n \nRepurchase of ordinary shares\n(\n1,280.8\n)\n(\n3.9\n)\n(\n3.9\n)\n—\n \n(\n128.6\n)\n(\n1,148.3\n)\n—\n \n—\n \nShare-based compensation\n80.1\n \n—\n \n— \n— \n82.9\n \n(\n2.8\n)\n—\n \n—\n \nDividends declared to noncontrolling interest\n(\n13.3\n)\n—\n \n— \n— \n—\n \n—\n \n—\n \n(\n13.3\n)\nCash dividends declared ($\n3.36\n per share)\n(\n758.7\n)\n—\n \n— \n— \n—\n \n(\n758.7\n)\n—\n \n—\n \nOther\n0.1\n \n—\n \n— \n— \n0.1\n \n—\n \n—\n \n—\n \nBalance at December 31, 2024\n$\n7,486.9\n \n$\n249.0\n \n249.0\n \n$\n(\n1,719.3\n)\n$\n—\n \n$\n9,791.8\n \n$\n(\n864.1\n)\n$\n29.5\n \nSee accompanying notes to Consolidated Financial Statements.\nF-8\nTable of Contents\nTrane Technologies plc\nConsolidated Statements of Cash Flows\nIn millions\nFor the years ended December 31,\n2024\n2023\n2022\nCash flows from operating activities:\nNet earnings\n$\n2,589.5\n \n$\n2,041.7\n \n$\n1,774.7\n \nDiscontinued operations, net of tax\n24.7\n \n27.2\n \n21.5\n \nAdjustments for non-cash transactions:\nDepreciation and amortization\n379.4\n \n348.1\n \n323.6\n \nPension and other postretirement benefits\n40.6\n \n51.0\n \n55.6\n \nStock settled share-based compensation\n82.9\n \n64.3\n \n56.3\n \nOther non-cash items, net\n(\n178.3\n)\n(\n32.7\n)\n17.1\n \nChanges in other assets and liabilities, net of the effects of acquisitions:\nAccounts and notes receivable\n(\n180.6\n)\n(\n110.1\n)\n(\n345.4\n)\nInventories\n162.5\n \n(\n96.4\n)\n(\n466.7\n)\nOther current and noncurrent assets\n(\n162.4\n)\n(\n152.3\n)\n(\n116.8\n)\nAccounts payable\n100.9\n \n(\n125.3\n)\n317.9\n \nOther current and noncurrent liabilities\n318.5\n \n411.3\n \n60.9\n \nNet cash provided by (used in) continuing operating activities\n3,177.7\n \n2,426.8\n \n1,698.7\n \nNet cash provided by (used in) discontinued operating activities\n(\n32.1\n)\n(\n37.2\n)\n(\n194.7\n)\nNet cash provided by (used in) operating activities\n3,145.6\n \n2,389.6\n \n1,504.0\n \nCash flows from investing activities:\nCapital expenditures\n(\n370.6\n)\n(\n300.7\n)\n(\n291.8\n)\nAcquisitions of businesses, net of cash acquired\n(\n180.3\n)\n(\n862.8\n)\n(\n234.7\n)\nProceeds from sale of property, plant and equipment\n4.7\n \n9.2\n \n9.7\n \nPurchases of short-term investments\n(\n450.0\n)\n—\n \n—\n \nProceeds from short-term investments\n450.0\n \n—\n \n—\n \nOther investing activities, net\n(\n16.7\n)\n(\n17.9\n)\n(\n23.0\n)\nNet cash provided by (used in) continuing investing activities\n(\n562.9\n)\n(\n1,172.2\n)\n(\n539.8\n)\nNet cash provided by (used in) discontinued investing activities\n—\n \n—\n \n(\n0.6\n)\nNet cash provided by (used in) investing activities\n(\n562.9\n)\n(\n1,172.2\n)\n(\n540.4\n)\nCash flows from financing activities:\nShort-term borrowings (payments), net\n—\n \n(\n1.9\n)\n—\n \nProceeds from long-term debt\n498.5\n \n699.2\n \n—\n \nPayments of long-term debt\n(\n507.5\n)\n(\n754.6\n)\n(\n9.6\n)\nNet proceeds from (payments of) debt\n(\n9.0\n)\n(\n57.3\n)\n(\n9.6\n)\nDebt issuance costs\n(\n4.6\n)\n(\n6.4\n)\n(\n2.1\n)\nDividends paid to ordinary shareholders\n(\n757.5\n)\n(\n683.7\n)\n(\n620.2\n)\nDividends paid to noncontrolling interests\n(\n13.3\n)\n(\n12.9\n)\n(\n14.5\n)\nProceeds (payments) from shares issued under incentive plans, net\n46.9\n \n79.3\n \n2.6\n \nRepurchase of ordinary shares\n(\n1,280.8\n)\n(\n669.3\n)\n(\n1,200.2\n)\nSettlement related to special cash payment\n—\n \n—\n \n(\n6.2\n)\nOther financing activities, net\n(\n2.3\n)\n—\n \n(\n2.0\n)\nNet cash provided by (used in) financing activities\n(\n2,020.6\n)\n(\n1,350.3\n)\n(\n1,852.2\n)\nEffect of exchange rate changes on cash and cash equivalents\n(\n67.3\n)\n7.7\n \n(\n50.1\n)\nNet increase (decrease) in cash and cash equivalents\n494.8\n \n(\n125.2\n)\n(\n938.7\n)\nCash and cash equivalents – beginning of period\n1,095.3\n \n1,220.5\n \n2,159.2\n \nCash and cash equivalents – end of period\n$\n1,590.1\n \n$\n1,095.3\n \n$\n1,220.5\n \nCash paid during the year for:\nInterest\n$\n233.3\n \n$\n217.4\n \n$\n218.0\n \nIncome taxes, net of refunds\n$\n710.5\n \n$\n523.6\n \n$\n321.3\n \nSee accompanying notes to Consolidated Financial Statements.\nF-9\nTable of Contents\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1.  \nDESCRIPTION OF COMPANY\nTrane Technologies plc, a public limited company, incorporated in Ireland in 2009, and its consolidated subsidiaries (collectively we, our, the Company or Trane Technologies) is a global climate innovator. The Company brings sustainable and efficient solutions to buildings, homes and transportation through the Company's strategic brands, Trane\n®\n and Thermo King\n®\n, and its environmentally responsible portfolio of products, services and connected intelligent controls. The Company generates revenue and cash primarily through the design, manufacture, sales and service of solutions for Heating, Ventilation and Air Conditioning (HVAC), transport refrigeration, and custom refrigeration solutions.\nNOTE 2.  \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nA summary of significant accounting policies used in the preparation of the accompanying Consolidated Financial Statements follows:\nBasis of Presentation: \nThe accompanying Consolidated Financial Statements reflect the consolidated operations of the Company and have been prepared in accordance with U.S. Generally Accepted Accounting Principles (GAAP) as defined by the Financial Accounting Standards Board (FASB) within the FASB Accounting Standards Codification (ASC). Intercompany accounts and transactions have been eliminated. \nThe results of operations and cash flows of all discontinued operations have been separately reported as discontinued operations for all periods presented. The Company recorded certain income and expenses associated with asbestos liabilities and corresponding insurance recoveries within \nDiscontinued operations, net of tax\n, as they related to previously divested businesses, except for amounts associated with the predecessor of the Murray Boiler LLC (Murray) asbestos liabilities and corresponding insurance recoveries, which were recorded within continuing operations. See Note 20, \"Commitments and Contingencies\" for more information regarding asbestos-related matters.\nThe Consolidated Financial Statements include all majority-owned subsidiaries of the Company. A noncontrolling interest in a subsidiary is considered an ownership interest in a majority-owned subsidiary that is not attributable to the parent. The Company includes \nNoncontrolling interest\n as a component of \nTotal equity\n in the Consolidated Balance Sheets and the \nNet earnings attributable\n to \nnoncontrolling interests\n are presented as an adjustment from \nNet earnings\n used to arrive at \nNet earnings attributable to Trane Technologies plc\n in the Consolidated Statements of Earnings.\nUse of Estimates:\n \nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosures of contingent assets and liabilities at the date of the financial statements as well as the reported amounts of revenues and expenses during the reporting period. Estimates are based on several factors including the facts and circumstances available at the time the estimates are made, historical experience, risk of loss, general economic conditions and trends, and the assessment of the probable future outcome. Actual results could differ from those estimates. Estimates and assumptions are reviewed periodically, and the effects of changes, if any, are reflected in the Consolidated Statements of Earnings in the period that they are determined.\nCurrency Translation:\n \nAssets and liabilities of non-U.S. subsidiaries, where the functional currency is not the U.S. dollar, have been translated at year-end exchange rates, and income and expense accounts have been translated using average exchange rates throughout the year. Adjustments resulting from the process of translating an entity's financial statements into the U.S. dollar have been recorded in the equity section of the Consolidated Balance Sheets within \nAccumulated other comprehensive income (loss)\n. Transactions that are denominated in a currency other than an entity's functional currency are subject to changes in exchange rates with the resulting gains and losses recorded within \nOther income/(expense), net.\nCash and Cash Equivalents: \nCash and cash equivalents include cash on hand, demand deposits and all highly liquid investments with original maturities at the time of purchase of three months or less. The Company maintains amounts on deposit at various financial institutions, which may at times exceed federally insured limits. However, management periodically evaluates the credit-worthiness of those institutions and has not experienced any losses on such deposits.\nF-10\nTable of Contents\nAllowance for Credit Losses\n: \nThe Company maintains an allowance for credit losses which represents the best estimate of expected loss inherent in the Company's accounts receivable portfolio. This estimate is based upon a two-step policy that results in the total recorded allowance for credit losses. The first step is to record a portfolio reserve based on the aging of the outstanding accounts receivable portfolio and the Company's historical experience with the Company's end markets, customer base and products. The second step is to create a specific reserve for significant accounts as to which the customer's ability to satisfy their financial obligation to the Company is in doubt due to circumstances such as bankruptcy, deteriorating operating results or financial position. In these circumstances, management uses its judgment to record an allowance based on the best estimate of expected loss, factoring in such considerations as the market value of collateral, if applicable. Actual results could differ from those estimates. These estimates and assumptions are reviewed periodically, and the effects of changes, if any, are reflected in the Consolidated Statements of Earnings in the period that they are determined. The Company's allowance for credit losses was $\n56.6\n million and $\n44.8\n million as of December 31, 2024 and 2023, respectively.\nInventories: \nDepending on the business, U.S. inventories are stated at the lower of cost or market using the last-in, first-out (LIFO) method or the lower of cost and net realizable value (NRV) using the first-in, first-out (FIFO) method. Non-U.S. inventories are stated at the lower of cost and NRV using the FIFO method. At both December 31, 2024 and 2023, approximatel\ny \n59\n% of all inventory utilized the LIFO method.\nProperty, Plant and Equipment: \nProperty, plant and equipment are stated at cost, less accumulated depreciation. Assets placed in service are recorded at cost and depreciated using the straight-line method over the estimated useful life of the asset except for leasehold improvements, which are depreciated over the shorter of their economic useful life or their lease term. \nThe range of useful lives used to depreciate property, plant and equipment is as follows:\nBuildings\n10\nto\n50\nyears\nMachinery and equipment\n2\nto\n12\nyears\nSoftware\n2\nto\n7\nyears\nMajor expenditures for replacements and significant improvements that increase asset values and extend useful lives are also capitalized. Capitalized costs are amortized over their estimated useful lives using the straight-line method. Repairs and maintenance expenditures that do not extend the useful life of the asset are charged to expense as incurred. The carrying amounts of assets that are sold or retired and the related accumulated depreciation are removed from the accounts in the year of disposal, and any resulting gain or loss is reflected within current earnings.\nThe Company assesses the recoverability of the carrying value of its property, plant and equipment whenever events or changes in circumstances indicate that the carrying amount of the asset group may not be recoverable. Recoverability is measured by a comparison of the carrying amount of the asset group to the future net undiscounted cash flows expected to be generated by the asset group. If the undiscounted cash flows are less than the carrying amount of the asset group, an impairment loss is recognized for the amount by which the carrying value of the asset group exceeds the fair value of the asset group.\nGoodwill and Intangible Assets: \nThe Company records as goodwill the excess of the purchase price over the fair value of the net assets acquired in a business combination. Measurement period adjustments may be recorded once a final valuation has been performed. Goodwill and other indefinite-lived intangible assets are tested and reviewed annually for impairment during the fourth quarter or whenever there is a significant change in events or circumstances that indicate that the fair value of the asset is more likely than not less than the carrying amount of the asset. In addition, an interim impairment test is completed upon a triggering event or when there is a reorganization of reporting structure or disposal of all or a portion of a reporting unit.\nImpairment of goodwill is tested at the reporting unit level. The test compares the carrying amount of the reporting unit to its estimated fair value. If the estimated fair value of a reporting unit exceeds its carrying amount, goodwill of the reporting unit is not impaired. To the extent that the carrying value of the reporting unit exceeds its estimated fair value, an impairment loss would be recognized for the amount by which the reporting unit's carrying amount exceeds its fair value, not to exceed the carrying amount of goodwill in that reporting unit.\nIntangible assets such as customer-related intangible assets and other intangible assets with finite useful lives are amortized on a straight-line basis over their estimated economic lives. \nThe weighted-average useful lives approximate the following:\nCustomer relationships\n15\nyears\nOther\n8\nyears\nThe Company assesses the recoverability of the carrying value of its intangible assets with finite useful lives whenever events or changes in circumstances indicate that the carrying amount of the asset group may not be recoverable. Recoverability is measured by a comparison of the carrying amount of an asset group to the future net undiscounted cash flows expected to be generated by the asset group. If the undiscounted cash flows are less than the carrying amount of the asset group, an impairment loss is recognized for the amount by which the carrying value of the asset group exceeds the fair value of the asset group.\nF-11\nTable of Contents\nBusiness Combinations: \nAcquisitions that meet the definition of a business combination are recorded using the acquisition method of accounting. The Company includes the operating results of acquired entities from their respective dates of acquisition. The Company recognizes and measures the identifiable assets acquired, liabilities assumed, including contingent consideration relating to earnout provisions, and any non-controlling interest as of the acquisition date fair value. The excess, if any, of total consideration transferred in a business combination over the fair value of identifiable assets acquired, liabilities assumed and any non-controlling interest is recognized as goodwill. Costs incurred as a result of a business combination other than costs related to the issuance of debt or equity securities are recorded in the period the costs are incurred. Additionally, at each reporting period, contingent consideration is remeasured to fair value, with changes recorded in \nSelling and administrative expenses\n in the Consolidated Statements of Earnings.\nEquity Investments:\n \nPartially-owned equity affiliates generally represent 20-50% ownership interests in equity investments where the Company demonstrates significant influence, but does not have a controlling financial interest. Partially-owned equity affiliates are accounted for under the equity method.\nThe Company invests in companies that complement existing products and services further enhancing its product portfolio. The Company records equity investments for which it does not have significant influence and without a readily determinable fair value at cost with adjustments for observable changes in price or impairment as permitted by the measurement alternative. Investments for which the measurement alternative has been elected are assessed for impairment upon a triggering event. Equity investments without a readily determinable fair value were $\n87.7\n million and $\n69.9\n million for the years ended  December 31, 2024 and December 31, 2023, respectively.\nEmployee Benefit Plans\n: \nThe Company provides a range of benefits, including pensions, postretirement and postemployment benefits to eligible current and former employees. Determining the cost associated with such benefits is dependent on various actuarial assumptions, including discount rates, expected return on plan assets, compensation increases, mortality, turnover rates, and healthcare cost trend rates. Actuaries perform the required calculations to determine expense in accordance with GAAP. Actual results may differ from the actuarial assumptions and are generally accumulated into \nAccumulated other comprehensive income (loss)\n and amortized into \nNet earnings\n over future periods. The Company reviews its actuarial assumptions at each measurement date and makes modifications to the assumptions based on current rates and trends, if appropriate.\nLoss Contingencies: \nLiabilities are recorded for various contingencies arising in the normal course of business. The Company has recorded reserves in the financial statements related to these matters, which are developed using input derived from actuarial estimates and historical and anticipated experience data depending on the nature of the reserve, and in certain instances with consultation of legal counsel, internal and external consultants and engineers. Subject to the uncertainties inherent in estimating future costs for these types of liabilities, the Company believes its estimated reserves are reasonable and does not believe the final determination of the liabilities with respect to these matters would have a material effect on the financial condition, results of operations, liquidity or cash flows of the Company for any year.\n \nEnvironmental Costs:\n \nThe Company is subject to laws and regulations relating to protecting the environment. Environmental expenditures relating to current operations are expensed or capitalized as appropriate. Expenditures relating to existing conditions caused by past operations, which do not contribute to current or future revenues, are expensed. Liabilities for remediation costs are recorded when they are probable and can be reasonably estimated, generally no later than the completion of feasibility studies or the Company's commitment to a plan of action. The assessment of this liability, which is calculated based on existing remediation technology, does not reflect any offset for possible recoveries from insurance companies, and is not discounted\n.\nProduct Warranties: \nStandard product warranty accruals are recorded at the time of sale and are estimated based upon product warranty terms and historical experience. The Company assesses the adequacy of its liabilities and will make adjustments as necessary based on known or anticipated warranty claims, or as new information becomes available.\n \nThe Company's extended warranty liability represents the deferred revenue associated with its extended warranty contracts and is amortized into revenue on a straight-line basis over the life of the contract, unless another method is more representative of the costs incurred. The Company assesses the adequacy of its liability by evaluating the expected costs under its existing contracts to ensure these expected costs do not exceed the extended warranty liability.\nIncome Taxes:\n \nDeferred tax assets and liabilities are determined based on temporary differences between financial reporting and tax bases of assets and liabilities, applying enacted tax rates expected to be in effect for the year in which the differences are expected to reverse. The Company recognizes future tax benefits, such as net operating losses and tax credits, to the extent that realizing these benefits is considered in its judgment to be more likely than not. The Company regularly reviews the recoverability of its deferred tax assets considering its historic profitability, projected future taxable income, timing of the reversals of existing temporary differences and the feasibility of its tax planning strategies. Where appropriate, the Company records a valuation allowance with respect to a future tax benefit.\nF-12\nTable of Contents\nRevenue Recognition: \nRevenue is recognized when control of a good or service promised in a contract (i.e., performance obligation) is transferred to a customer. Control is obtained when a customer has the ability to direct the use of and obtain substantially all of the remaining benefits from that good or service. The majority of the Company's revenue is recognized at a point-in-time as control is transferred at a distinct point in time per the terms of a contract. However, a portion of the Company's revenue is recognized over-time as the customer simultaneously receives control as the Company performs work under a contract. For these arrangements, the cost-to-cost input method (percentage of completion) is used as it best depicts the transfer of control to the customer that occurs as the Company incurs costs. See Note 12, \"Revenue\" to the Consolidated Financial Statements for additional information regarding revenue recognition.\nResearch and Development Costs: \nThe Company conducts research and development activities focused on product and system sustainability improvements such as increasing energy efficiency, developing products that allow for use of lower global warming potential refrigerants, reducing material content in products, and designing products for circularity. These expenditures are expensed when incurred. For the years ended December 31, 2024, 2023 and 2022, these expenditures amounted to $\n309.6\n million, $\n252.3\n million and $\n211.2\n million, respectively.\nRecent Accounting Pronouncements\nThe FASB ASC is the sole source of authoritative GAAP other than the Securities and Exchange Commission (SEC) issued rules and regulations that apply only to SEC registrants. The FASB issues an Accounting Standard Update (ASU) to communicate changes to the codification. The Company considers the applicability and impact of all ASU's. ASU's not listed below were assessed and determined to be either not applicable or are not expected to have a material impact on the consolidated financial statements.\nRecently Adopted Accounting Pronouncements\nIn November 2023, the FASB issued ASU 2023-07, \"Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\" (ASU 2023-07) which requires public entities to disclose information about their reportable segments' oversight and significant expenses on an interim and annual basis. The ASU is effective for fiscal years beginning after December 15, 2023 and interim periods within fiscal years beginning after December 15, 2024. The Company adopted this, as required, for the year ended December 31, 2024. See Note 19, \"Business Segment Information\" for more information regarding the Company's segment disclosures.\nIn September 2022, the FASB issued ASU 2022-04, \"Liabilities - Supplier Finance Program (Subtopic 405-50): Disclosure of Supplier Program Finance Obligations,\" which requires that a company that enters into a supplier finance program disclose sufficient information about the program to allow a user of financial statements to understand the program's nature, activity during the period, changes from period to period, and potential magnitude. To achieve that objective, the Company should disclose qualitative and quantitative information about its supplier finance programs. The Company adopted this standard on January 1, 2023, except for the amendment on roll forward information which is effective for fiscal years beginning after December 15, 2023. See Note 8, \"Supplier Financing Arrangements\" for more information regarding the Company's supplier financing program.\nIn November 2021, the FASB issued ASU 2021-10, \"Government Assistance (Topic 832): Disclosures by Business Entities about Government Assistance\" (ASU 2021-10), which requires additional disclosures regarding government grants and cash contributions. The additional disclosures required by this update include information about the nature of the transactions and the related accounting policy used to account for the transaction, the financial statement line items affected by the transactions and the amounts applicable to each financial statement line item and significant terms and conditions of the transactions, including commitments and contingencies. ASU 2021-10 is effective for annual periods beginning after December 15, 2021 with early adoption permitted. The Company adopted this standard on January 1, 2022 with no material impact on its Consolidated Financial Statements.\nAccounting Pronouncements Issued but not yet Adopted\nIn November 2024, the FASB issued ASU 2024-03, \"Income Statement-Reporting Comprehensive Income-Expense Disaggregation Disclosures (Subtopic 220-40)\" (ASU 2024-03) which requires additional disaggregated disclosures in the notes to financial statements for certain categories of expenses that are included on the face of the income statement. The ASU is effective for fiscal years beginning after December 15, 2026 and interim periods beginning after December 15, 2027. Early adoption is permitted. The Company does not currently expect to adopt this ASU before the required effective date. The Company is evaluating the impact of the standard on its financial statement disclosures.\nF-13\nTable of Contents\nIn December 2023, the FASB issued ASU 2023-09, \"Improvements to Income Tax Disclosures (Topic 740)\" (ASU 2023-09) which improves the transparency of income tax disclosures by requiring consistent categories and greater disaggregation of information in the rate reconciliation and income taxes paid disaggregated by jurisdiction. The ASU is effective for annual periods beginning after December 15, 2024. Early adoption is permitted. The Company does not currently expect to adopt this ASU before the required effective date. The Company is evaluating the impact of the standard on its financial statement disclosures.\nIn October 2023, the FASB issued ASU 2023-06, \"Disclosure Improvements: Codification Amendments in Response to SEC's Disclosure Update and Simplification Initiative\" (ASU 2023-06) to amend a variety of disclosure requirements in the ASC. The effective date for each amendment will be the date on which the SEC's removal of that related disclosure from Regulation S-X or Regulation S-K becomes effective. Early adoption is prohibited. Upon adoption, this ASU is not expected to have a material impact on its financial statement disclosures.\nNOTE 3.  \nINVENTORIES\nAt December 31, the major classes of inventory were as follows:\nIn millions\n2024\n2023\nRaw materials\n$\n612.3\n \n$\n605.1\n \nWork-in-process\n374.4\n \n385.1\n \nFinished goods\n1,153.5\n \n1,332.3\n \n2,140.2\n \n2,322.5\n \nLIFO reserve\n(\n168.7\n)\n(\n170.4\n)\nTotal\n$\n1,971.5\n \n$\n2,152.1\n \nThe Company performs periodic assessments to determine the existence of obsolete, slow-moving and non-saleable inventories and records necessary provisions to reduce such inventories to the lower of cost and NRV. Reserve balances, primarily related to obsolete and slow-moving inventories, were $\n163.7\n million and $\n143.5\n million at December 31, 2024 and December 31, 2023, respectively.\nNOTE 4.  \nPROPERTY, PLANT AND EQUIPMENT\nAt December 31, the major classes of property, plant and equipment were as follows:\nIn millions\n2024\n2023\nLand\n$\n41.1\n \n$\n42.3\n \nBuildings\n935.8\n \n832.8\n \nMachinery and equipment\n2,478.2\n \n2,224.4\n \nSoftware\n752.5\n \n721.4\n \n4,207.6\n \n3,820.9\n \nAccumulated depreciation\n(\n2,183.1\n)\n(\n2,048.7\n)\nTotal\n$\n2,024.5\n \n$\n1,772.2\n \nDepreciation expense for the years ended December 31, 2024, 2023 and 2022 was $\n194.0\n million, $\n178.3\n million and $\n176.5\n million, which includes amounts for software amortization of $\n38.2\n million, $\n36.5\n million and $\n42.1\n million, respectively.\nF-14\nTable of Contents\nNOTE 5.  \nGOODWILL\nThe changes in the carrying amount of goodwill are as follows:\n \nIn millions\nAmericas\nEMEA\nAsia Pacific\nTotal\nNet balance as of December 31, 2022\n$\n4,226.8\n \n$\n714.9\n \n$\n562.0\n \n$\n5,503.7\n \nAcquisitions \n(1)\n453.7\n \n112.8\n \n—\n \n566.5\n \nMeasurement period adjustments\n(\n8.7\n)\n10.0\n \n(\n0.1\n)\n1.2\n \nCurrency translation\n3.5\n \n31.3\n \n(\n10.9\n)\n23.9\n \nNet balance as of December 31, 2023\n4,675.3\n \n869.0\n \n551.0\n \n6,095.3\n \nAcquisitions \n(1)\n102.4\n \n—\n \n—\n \n102.4\n \nMeasurement period adjustments\n(\n2.2\n)\n1.8\n \n—\n \n(\n0.4\n)\nCurrency translation\n(\n6.4\n)\n(\n49.2\n)\n(\n13.8\n)\n(\n69.4\n)\nNet balance as of December 31, 2024\n$\n4,769.1\n \n$\n821.6\n \n$\n537.2\n \n$\n6,127.9\n \n(1)\n Refer to Note 17, \"Acquisitions and Divestitures\" for more information regarding acquisitions.\nThe net goodwill balances at December 31, 2024, 2023 and 2022 include $\n2,496.0\n million of accumulated impairment, primarily related to the Americas segment. The accumulated impairment relates entirely to a charge recorded in 2008.\nNOTE 6.  \nINTANGIBLE ASSETS\nThe following table sets forth the gross amount and related accumulated amortization of the Company's intangible assets at December 31:\n2024\n2023\nIn millions\nGross carrying amount\nAccumulated amortization\nNet carrying amount\nGross carrying amount\nAccumulated amortization\nNet carrying amount\nCustomer relationships\n$\n2,418.4\n \n$\n(\n1,875.4\n)\n$\n543.0\n \n$\n2,384.4\n \n$\n(\n1,731.4\n)\n$\n653.0\n \nOther\n423.1\n \n(\n267.1\n)\n156.0\n \n419.6\n \n(\n243.1\n)\n176.5\n \nTotal finite-lived intangible assets\n$\n2,841.5\n \n$\n(\n2,142.5\n)\n$\n699.0\n \n$\n2,804.0\n \n$\n(\n1,974.5\n)\n$\n829.5\n \nTrademarks (indefinite-lived)\n2,609.2\n \n— \n2,609.2\n \n2,610.3\n \n— \n2,610.3\n \nTotal\n$\n5,450.7\n \n$\n(\n2,142.5\n)\n$\n3,308.2\n \n$\n5,414.3\n \n$\n(\n1,974.5\n)\n$\n3,439.8\n \nIntangible asset amortization expense for 2024, 2023 and 2022 was $\n180.7\n million, $\n165.2\n million and $\n142.7\n million, respectively.\nFuture estimated amortization expense on existing intangible assets in the next five years as of December 31, 2024 amounts to approximately:\nIn millions\n2025\n$\n156\n \n2026\n102\n \n2027\n73\n \n2028\n54\n \n2029\n52\n \nF-15\nTable of Contents\nNOTE 7.  \nDEBT AND CREDIT FACILITIES\nAt December 31, \nShort-term borrowings and current maturities of long-term debt\n consisted of the following:\nIn millions\n2024\n2023\nDebentures with put feature\n$\n295.0\n \n$\n295.0\n \n3.550\n% Senior Notes due 2024\n—\n \n499.4\n \n7.200\n% Debentures due 2025\n7.5\n \n7.5\n \n6.480\n% Senior Notes due 2025\n149.7\n \n—\n \nTotal\n$\n452.2\n \n$\n801.9\n \nThe Company's short-term obligations primarily consist of debentures with put features and current maturities of long-term debt. The weighted-average interest rate for \nShort-term borrowings and current maturities of long-term debt\n at December 31, 2024 and 2023 was \n6.4\n% and \n4.6\n%, respectively.\nCommercial Paper Program\nThe Company uses borrowings under its commercial paper program for general corporate purposes. The maximum aggregate amount of unsecured commercial paper notes available to be issued, on a private placement basis, under the commercial paper program is $\n2.0\n billion as of December 31, 2024. Under the commercial paper program, the Company may issue notes from time to time through Trane Technologies HoldCo Inc. or Trane Technologies Financing Limited. Each of Trane Technologies plc, Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Lux International Holding Company S.à.r.l., Trane Technologies Americas Holding Corporation, Trane Technologies Global Holding II Company Limited, Trane Technologies Company LLC, Trane Technologies HoldCo Inc. and Trane Technologies Financing Limited provided irrevocable and unconditional guarantees for any notes issued under the commercial paper program. The Company had no outstanding balance under its commercial paper program as of December 31, 2024 and December 31, 2023.\nDebentures with Put Feature\nAt both December 31, 2024 and December 31, 2023, the Company had $\n295.0\n million of fixed rate debentures outstanding which contain a put feature that the holders may exercise on each anniversary of the issuance date. If exercised, the Company is obligated to repay in whole or in part, at the holder's option, the outstanding principal amount of the debentures plus accrued interest. If these options are not exercised, the final contractual maturity dates would range between 2027 and 2028. Holders who had the option to exercise puts up to $37.2 million for settlement in February 2024 and $257.8 million for settlement in November 2024 did not exercise such option. During the year ended December 31, 2023, $45.8 million put options were exercised. \nF-16\nTable of Contents\nAt December 31,\n long-term debt\n excluding current maturities consisted of:\nIn millions\n2024\n2023\n7.200\n% Debentures due 2025\n$\n—\n \n$\n7.5\n \n6.480\n% Debentures due 2025\n—\n \n149.7\n \n3.500\n% Senior Notes due 2026\n399.4\n \n398.9\n \n3.750\n% Senior Notes due 2028\n547.9\n \n547.3\n \n3.800\n% Senior Notes due 2029\n747.1\n \n746.4\n \n5.250\n% Senior Notes due 2033\n694.0\n \n693.3\n \n5.100\n% Senior Notes due 2034\n494.3\n \n—\n \n5.750\n% Senior Notes due 2043\n495.7\n \n495.4\n \n4.650\n% Senior Notes due 2044\n296.7\n \n296.6\n \n4.300\n% Senior Notes due 2048\n296.7\n \n296.6\n \n4.500\n% Senior Notes due 2049\n346.3\n \n346.2\n \nTotal\n$\n4,318.1\n \n$\n3,977.9\n \nScheduled maturities of \nlong-term debt,\n including current maturities, as of December 31, 2024 are as follows:\nIn millions\n2025\n$\n452.2\n \n2026\n399.4\n \n2027\n—\n \n2028\n547.9\n \n2029\n747.1\n \nThereafter\n2,623.7\n \nTotal\n$\n4,770.3\n \nIssuance of Senior Notes\nIn June 2024, the Company, through its wholly-owned subsidiary Trane Technologies Financing Limited, issued $\n500.0\n million aggregate principal amount of 5.100% Senior Notes due 2034. The notes are guaranteed by each of Trane Technologies plc, Trane Technologies Global Holding II Company Limited, Trane Technologies Americas Holding Corporation, Trane Technologies Lux International Holding Company S.a.r.l., Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Company LLC and Trane Technologies Holdco Inc. The Company has the option to redeem the notes in whole or in part at any time prior to their stated maturity date at redemption prices set forth in the indenture agreement. The notes are subject to certain customary covenants, however, none of these covenants are considered restrictive to the Company's operations. The net proceeds from the offering were used to purchase short-term investments of $\n450.0\n million that matured in October 2024. The net proceeds of the short-term investments were used to fund the repayment of the $\n500.0\n million aggregate principal amount of the outstanding 3.550% Senior Notes that matured in November 2024, including payment of fees, expenses, and accrued interest in connection therewith.\nOther Credit Facilities\nThe Company maintains two $\n1.0\n billion senior unsecured revolving credit facilities, one of which matures in June 2026 and the other which matures in April 2027 (collectively, the Facilities), through its wholly-owned subsidiaries, Trane Technologies HoldCo Inc. and Trane Technologies Financing Limited (collectively, the Borrowers). The Facilities include Environmental, Social, and Governance (ESG) metrics related to two of the Company's sustainability commitments: greenhouse gas intensity and participation of women in management. The Company's annual performance against these ESG metrics may result in price adjustments to the commitment fee and applicable interest rate.\nThe Facilities provide support for the Company's commercial paper program and can be used for working capital and other general corporate purposes. Trane Technologies plc, Trane Technologies Irish Holdings Unlimited Company, Trane Technologies Lux International Holding Company S.à.r.l., Trane Technologies Americas Holding Corporation, Trane Technologies Global Holding II Company Limited, and Trane Technologies Company LLC each provide irrevocable and unconditional guarantees for these Facilities. In addition, each Borrower will guarantee the obligations under the Facilities of the other Borrowers. Total commitments of $\n2.0\n billion were unused at December 31, 2024 and December 31, 2023.\nF-17\nTable of Contents\nFair Value of Debt\nThe fair value of the Company's debt instruments at December 31, 2024 and December 31, 2023 was $\n4.6\n billion and $\n4.7\n billion, respectively. The Company measures the fair value of its debt instruments for disclosure purposes based upon observable market prices quoted on public exchanges for similar assets. These fair value inputs are considered Level 2 within the fair value hierarchy. See Note 9, \"Fair Value Measurements\" for information on the fair value hierarchy.\nNOTE 8. \nSUPPLIER FINANCING ARRANGEMENTS\nThe Company has an agreement with a U.S. financial institution that allows its suppliers to sell their receivables to the financial institution at the sole discretion of both the supplier and the financial institution on terms that are negotiated between them. The Company may not always be notified when its suppliers sell receivables under this program.\nThe Company's obligations to its suppliers, including the amounts due and scheduled payment dates, are not impacted by the suppliers' decisions to sell their receivables under the program. The payment terms that the Company has with participating suppliers under these programs are generally up to 120 days. The changes in the supplier financing program for the year ended December 31, 2024 were as follows:\nIn millions\nBalance outstanding at beginning of year\n$\n246.0\nInvoices confirmed during year\n1,026.2\nConfirmed invoices paid during year\n(\n999.4\n)\nBalance outstanding at end of year\n$\n272.8\nAmounts due to suppliers participating in the\n supplier financing program are presented within \nAccounts payable\n in the Consolidated Balance Sheet.\nNOTE 9.  \nFAIR VALUE MEASUREMENTS\nFair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The fair value hierarchy that prioritizes information used in developing assumptions when pricing an asset or liability is as follows:\n•\nLevel 1:\n Observable inputs such as quoted prices in active markets;\n•\nLevel 2:\n Inputs, other than quoted prices in active markets, that are observable either directly or indirectly; and\n•\nLevel 3:\n Unobservable inputs where there is little or no market data, which requires the reporting entity to develop its own assumptions.\nObservable market data is required to be used in making fair value measurements when available. When inputs used to measure fair value fall within different levels of the hierarchy, the level within which the fair value measurement is categorized is based on the lowest level input that is significant to the fair value measurement.\nF-18\nTable of Contents\nThe following table presents the Company's fair value hierarchy for those assets and liabilities measured at fair value on a recurring basis as of December 31, 2024:\nIn millions\nFair Value\nFair value measurements\nLevel 1\nLevel 2\nLevel 3\nAssets:\nDerivative instruments\n$\n2.5\n \n$\n—\n \n$\n2.5\n \n$\n—\n \nLiabilities:\nDerivative instruments\n8.9\n \n—\n \n8.9\n \n—\n \nContingent consideration\n61.2\n \n—\n \n—\n \n61.2\n \nThe following table presents the Company's fair value hierarchy for those assets and liabilities measured at fair value on a recurring basis as of December 31, 2023:\nIn Millions\nFair Value\nFair value measurements\nLevel 1\nLevel 2\nLevel 3\nAssets:\nDerivative instruments\n$\n4.1\n \n$\n—\n \n$\n4.1\n \n$\n—\n \nLiabilities:\nDerivative instruments\n4.8\n \n—\n \n4.8\n \n—\n \nContingent consideration\n90.3\n \n—\n \n—\n \n90.3\n \nDerivative instruments include forward foreign currency contracts and instruments related to non-functional currency balance sheet exposures and commodity swaps. The fair value of the foreign exchange derivative instruments are determined based on a pricing model that uses spot rates and forward prices from actively quoted currency markets that are readily accessible and observable. The fair value of the commodity derivatives is valued under a market approach using published prices, where applicable, or dealer quotes.\nThe carrying values of cash and cash equivalents, short-term investments, accounts receivable and accounts payable are a reasonable estimate of their fair value due to the short-term nature of these instruments. There have been no transfers between levels of the fair value hierarchy.\nThe Company agreed to two contingent consideration arrangements in connection with the acquisition of Nuvolo Technologies Corporation (Nuvolo) in November 2023. The first contingent consideration arrangement, payable of up to $\n90.0\n million in cash, is based on the attainment of key revenue targets from November 2, 2023 through April 4, 2025. If the first contingent consideration targets are met, a second contingent consideration arrangement with no maximum earnout is available to the sellers based on revenues in excess of the initial targets attained from a specified customer contract through April 4, 2025.\nThe Company agreed to a contingent consideration arrangement in connection with the acquisition of Farrar Scientific Corporation in October 2021, conditioned on the attainment of key financial targets during the period of January 1, 2022 through December 31, 2024. These targets were not met and no payment was made.\nEach quarter, the Company evaluates the fair value of the liability as assumptions change and any non-cash adjustments are recorded in \nSelling and administrative expenses\n in the Consolidated Statements of Earnings. Contingent consideration related to acquisitions are measured at fair value using Level 3 unobservable inputs. The fair value of the contingent consideration is determined using the Monte Carlo simulation model based on revenue projections during the earnout period, implied revenue volatility and a risk adjusted discount rate.\nThe changes in the fair value of the Company's Level 3 liabilities during the years ended December 31, 2024 and 2023 are as follows:\nIn millions\n2024\n2023\nBalance at beginning of period\n$\n90.3\n \n$\n49.3\n \nFair value of contingent consideration recorded in connection with acquisitions\n—\n \n90.3\n \nChange in fair value of contingent consideration\n(\n25.0\n)\n(\n49.3\n)\nMeasurement period adjustment\n(\n4.1\n)\n—\n \nBalance at end of period\n$\n61.2\n \n$\n90.3\n \nF-19\nTable of Contents\nThe following inputs and assumptions were used in the Monte Carlo simulation model to estimate the fair value of the contingent consideration at December 31, 2024:\n2024\n2023\nDiscount rate (risk adjusted)\n8.55%-8.58\n%\n8.14%-8.48\n%\nVolatility \n14.80\n \n%\n16.20\n \n%\nRefer to Note 17, \"Acquisitions and Divestitures\" for more information regarding the contingent consideration\n.\nCertain assets are measured at fair value on a non-recurring basis. The Company's equity investments without a readily available fair value are accounted for using the measurement alternative and are measured at fair value when observable transactions of identical or similar securities occurs, or due to an impairment. When indicators of impairment exist or observable price changes of qualified transactions occur, the respective equity investment would be classified within Level 3 of the fair value hierarchy due to the absence of quoted market prices, the inherent lack of liquidity and unobservable inputs used to measure fair value that require management's judgment.\n \nNOTE 10.  \nLEASES\nThe Company's lease portfolio includes various contracts for real estate, vehicles, information technology and other equipment. At contract inception, the Company determines a lease exists if the contract conveys the right to control an identified asset for a period of time in exchange for consideration. Control is considered to exist when the lessee has the right to obtain substantially all of the economic benefits from the use of an identified asset as well as the right to direct the use of that asset. If a contract is considered to be a lease, the Company recognizes a lease liability based on the present value of the future lease payments, with an offsetting entry to recognize a right-of-use asset. Options to extend or terminate a lease are included when it is reasonably certain an option will be exercised. As a majority of the Company's leases do not provide an implicit rate within the lease, an incremental borrowing rate is used which is based on information available at the commencement date.\nThe following table includes a summary of the Company's lease portfolio and Balance Sheet classification:\nIn millions\nClassification\nDecember 31,\n2024\nDecember 31,\n2023\nAssets\nOperating lease right-of-use assets \n(1)\nOther noncurrent assets\n$\n602.6\n \n$\n513.1\n \nLiabilities\nOperating lease current\nOther current liabilities\n173.5\n \n155.4\n \nOperating lease noncurrent\nOther noncurrent liabilities\n441.2\n \n367.3\n \nWeighted average remaining lease term\n5.0\n years\n5.0\n years\nWeighted average discount rate\n4.6\n \n%\n4.5\n \n%\n(1)\n Prepaid lease payments and lease incentives are recorded as part of the right-of-use asset. The net impact was $\n12.1\n million and $\n9.6\n million at December 31, 2024 and December 31, 2023, respectively.\nThe Company accounts for each separate lease component of a contract and its associated non-lease component as a single lease component. In addition, the Company utilizes a portfolio approach for the vehicle, information technology and equipment asset classes as the application of the lease model to the portfolio would not differ materially from the application of the lease model to the individual leases within the portfolio.\nThe following table includes lease costs and related cash flow information for the years ended December 31:\nIn millions\n2024\n2023\nOperating lease expense\n$\n197.8\n \n$\n187.8\n \nVariable lease expense\n35.6\n \n31.0\n \nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n195.4\n \n185.3\n \nRight-of-use assets obtained in exchange for new operating lease liabilities\n244.9\n \n179.2\n \nOperating lease expense is recognized on a straight-line basis over the lease term. In addition, the Company has certain leases that contain variable lease payments which are based on an index, a rate referenced in the lease or on the actual usage of the \nF-20\nTable of Contents\nleased asset. These payments are not included in the right-of-use asset or lease liability and are expensed as incurred as variable lease expense.\nMaturities of lease obligations were as follows:\nIn millions\nDecember 31,\n2024\nOperating leases:\n2025\n$\n202.6\n \n2026\n172.5\n \n2027\n124.5\n \n2028\n84.0\n \n2029\n47.2\n \nAfter 2029\n90.7\n \nTotal lease payments\n$\n721.5\n \nLess: Interest\n(\n106.8\n)\nPresent value of lease liabilities\n$\n614.7\n \nNOTE 11.  \nPENSIONS AND POSTRETIREMENT BENEFITS OTHER THAN PENSIONS\nThe Company sponsors several U.S. defined benefit and defined contribution plans covering substantially all of the Company's U.S. employees. Additionally, the Company has many non-U.S. defined benefit and defined contribution plans covering eligible current and retired non-U.S. employees. Postretirement benefits other than pensions (OPEB) provide healthcare benefits and, in some instances, life insurance benefits for certain eligible current and retired employees.\nPension Plans\nThe non-contributory defined benefit pension plans covering non-collectively bargained U.S. employees provide benefits on a final average pay formula while plans for most collectively bargained U.S. employees provide benefits on a flat dollar benefit formula or a percentage of pay formula. The non-U.S. pension plans generally provide benefits based on earnings and years of service. The Company also maintains additional other supplemental plans for officers and other key or highly compensated employees.\nF-21\nTable of Contents\nThe following table details information regarding the Company's pension plans at December 31:\nIn millions\n2024\n2023\nChange in benefit obligations:\nBenefit obligation at beginning of year\n$\n2,412.5\n \n$\n2,386.1\n \nService cost\n32.1\n \n34.4\n \nInterest cost\n112.9\n \n119.6\n \nEmployee contributions\n1.0\n \n1.0\n \nActuarial (gains) losses\n (1)\n(\n94.5\n)\n63.7\n \nBenefits paid\n(\n179.3\n)\n(\n187.9\n)\nCurrency translation\n(\n19.4\n)\n22.0\n \nCurtailments, settlements and special termination benefits\n(\n7.0\n)\n(\n2.4\n)\nOther, including expenses paid\n(\n19.2\n)\n(\n24.0\n)\nBenefit obligation at end of year\n$\n2,239.1\n \n$\n2,412.5\n \nChange in plan assets:\nFair value at beginning of year\n$\n2,145.7\n \n$\n2,051.6\n \nActual return on assets\n26.7\n \n192.2\n \nCompany contributions\n58.9\n \n93.5\n \nEmployee contributions\n1.0\n \n1.0\n \nBenefits paid\n(\n179.3\n)\n(\n187.9\n)\nCurrency translation\n(\n16.1\n)\n22.9\n \nSettlements\n(\n7.0\n)\n(\n2.4\n)\nOther, including expenses paid\n(\n19.7\n)\n(\n25.2\n)\nFair value of assets end of year\n$\n2,010.2\n \n$\n2,145.7\n \nNet unfunded liability\n$\n(\n228.9\n)\n$\n(\n266.8\n)\nAmounts included in the balance sheet:\nOther noncurrent assets\n$\n65.2\n \n$\n52.5\n \nAccrued compensation and benefits\n(\n15.6\n)\n(\n10.8\n)\nPostemployment and other benefit liabilities\n(\n278.5\n)\n(\n308.5\n)\nNet amount recognized\n$\n(\n228.9\n)\n$\n(\n266.8\n)\n(1) \nActuarial (gains) losses primarily resulted from changes in discount rates.\nIt is the Company's objective to contribute to the pension plans to ensure adequate funds, and no less than required by law, are available in the plans to make benefit payments to plan participants and beneficiaries when required. However, certain plans are not or cannot be funded due to either legal, accounting, or tax requirements in certain jurisdictions. As of December 31, 2024, approximately \nseven\n percent of the Company's projected benefit obligation relates to plans that cannot be funded.\nThe pretax amounts recognized in \nAccumulated other comprehensive income (loss)\n were as follows:\nIn millions\nPrior service benefit (cost)\nNet actuarial gains (losses)\nTotal\nDecember 31, 2023\n$\n(\n18.0\n)\n$\n(\n485.8\n)\n$\n(\n503.8\n)\nCurrent year changes recorded to AOCI\n—\n \n3.2\n \n3.2\n \nAmortization reclassified to earnings\n3.0\n \n15.0\n \n18.0\n \nSettlements/curtailments reclassified to earnings\n—\n \n1.0\n \n1.0\n \nCurrency translation and other\n0.2\n \n1.9\n \n2.1\n \nDecember 31, 2024\n$\n(\n14.8\n)\n$\n(\n464.7\n)\n$\n(\n479.5\n)\nF-22\nTable of Contents\nWeighted-average assumptions used to determine the benefit obligation at December 31 were as follows:\n2024\n2023\nDiscount rate:\nU.S. plans\n5.62\n \n%\n5.16\n \n%\nNon-U.S. plans\n4.75\n \n%\n4.18\n \n%\nRate of compensation increase:\nU.S. plans\n4.03\n \n%\n4.02\n \n%\nNon-U.S. plans\n4.08\n \n%\n4.07\n \n%\nThe accumulated benefit obligation for all defined benefit pension plans was $\n2,201.3\n million and $\n2,372.2\n million at December 31, 2024 and 2023, respectively. The projected benefit obligation, accumulated benefit obligation, and fair value of plan assets for pension plans with accumulated benefit obligations more than plan assets were $\n1,833.3\n million, $\n1,808.8\n million and $\n1,541.5\n million, respectively, as of December 31, 2024, and $\n1,928.6\n million, $\n1,902.3\n million and $\n1,611.0\n million, respectively, as of December 31, 2023.\nPension benefit payments are expected to be paid as follows:\nIn millions\n2025\n$\n191.9\n \n2026\n190.3\n \n2027\n207.5\n \n2028\n178.1\n \n2029\n172.5\n \n2030-2034\n864.5\n \nThe components of the Company's net periodic pension benefit costs for the years ended December 31 include the following:\nIn millions\n2024\n2023\n2022\nService cost\n$\n32.1\n \n$\n34.4\n \n$\n47.5\n \nInterest cost\n112.9\n \n119.6\n \n70.3\n \nExpected return on plan assets\n(\n117.8\n)\n(\n120.3\n)\n(\n103.8\n)\nNet amortization of:\nPrior service costs (benefits)\n3.0\n \n3.6\n \n3.9\n \nPlan net actuarial (gains) losses\n15.0\n \n16.2\n \n23.3\n \nNet periodic pension benefit cost\n45.2\n \n53.5\n \n41.2\n \nNet curtailment and settlement losses\n1.0\n \n1.4\n \n15.0\n \nNet periodic pension benefit cost after net curtailment and settlement losses\n$\n46.2\n \n$\n54.9\n \n$\n56.2\n \nAmounts recorded in continuing operations:\n   Operating income\n$\n28.0\n \n$\n29.6\n \n$\n43.2\n \n   Other income/(expense), net\n11.5\n \n18.6\n \n9.2\n \nAmounts recorded in discontinued operations\n6.7\n \n6.7\n \n3.8\n \nTotal\n$\n46.2\n \n$\n54.9\n \n$\n56.2\n \nPension benefit cost for 2025 is projected to be approximately $\n53\n million.\nF-23\nTable of Contents\nWeighted-average assumptions used to determine net periodic pension cost for the years ended December 31 were as follows:\n2024\n2023\n2022\nDiscount rate:\nU.S. plans\nService cost\n5.12\n \n%\n5.48\n \n%\n3.06\n \n%\nInterest cost\n5.08\n \n%\n5.35\n \n%\n2.36\n \n%\nNon-U.S. plans\nService cost\n4.38\n \n%\n4.82\n \n%\n2.07\n \n%\nInterest cost\n4.18\n \n%\n4.65\n \n%\n1.62\n \n%\nRate of compensation increase:\nU.S. plans\n4.02\n \n%\n4.25\n \n%\n4.00\n \n%\nNon-U.S. plans\n4.07\n \n%\n4.23\n \n%\n4.00\n \n%\nExpected return on plan assets:\nU.S. plans\n6.00\n \n%\n6.25\n \n%\n4.00\n \n%\nNon-U.S. plans\n4.69\n \n%\n5.02\n \n%\n2.50\n \n%\nThe expected long-term rate of return on plan assets reflects the average rate of returns expected on the funds invested or to be invested to provide for the benefits included in the projected benefit obligation. The expected long-term rate of return on plan assets is based on what is achievable given the plan's investment policy, the types of assets held and target asset allocations. The expected long-term rate of return is determined as of the measurement date. The Company reviews each plan and its historical returns and target asset allocations to determine the appropriate expected long-term rate of return on plan assets to be used.\nThe Company's objective in managing its defined benefit plan assets is to ensure that all present and future benefit obligations are met as they come due. It seeks to achieve this goal while trying to mitigate volatility in plan funded status, contribution, and expense by better matching the characteristics of the plan assets to that of the plan liabilities. The Company utilizes a dynamic approach to asset allocation whereby a plan's allocation to fixed income assets increases as the plan's funded status improves. The Company monitors plan funded status and asset allocation regularly in addition to investment manager performance.\nF-24\nTable of Contents\nThe fair values of the Company's pension plan assets at December 31, 2024 by asset category were as follows:\n \nFair value measurements\nNet asset value\nTotal\nfair value\nIn millions\nLevel 1\nLevel 2\nLevel 3\nCash and cash equivalents\n$\n6.5\n \n$\n30.0\n \n$\n—\n \n$\n—\n \n$\n36.5\n \nEquity investments:\nRegistered mutual funds – equity specialty\n—\n \n—\n \n—\n \n73.7\n \n73.7\n \nCommingled funds – equity specialty\n—\n \n—\n \n—\n \n244.2\n \n244.2\n \n—\n \n—\n \n—\n \n317.9\n \n317.9\n \nFixed income investments:\nU.S. government and agency obligations\n—\n \n384.1\n \n—\n \n—\n \n384.1\n \nCorporate and non-U.S. bonds\n—\n \n1,001.9\n \n—\n \n—\n \n1,001.9\n \nAsset-backed and mortgage-backed securities\n—\n \n14.9\n \n—\n \n—\n \n14.9\n \nRegistered mutual funds – fixed income specialty\n—\n \n—\n \n—\n \n91.7\n \n91.7\n \nCommingled funds – fixed income specialty\n—\n \n—\n \n—\n \n81.0\n \n81.0\n \nOther fixed income\n(a)\n—\n \n—\n \n31.5\n \n—\n \n31.5\n \n—\n \n1,400.9\n \n31.5\n \n172.7\n \n1,605.1\n \nDerivatives\n—\n \n(\n0.5\n)\n—\n \n—\n \n(\n0.5\n)\nOther\n(b)\n—\n \n—\n \n86.2\n \n—\n \n86.2\n \nTotal assets at fair value\n$\n6.5\n \n$\n1,430.4\n \n$\n117.7\n \n$\n490.6\n \n$\n2,045.2\n \nReceivables and payables, net\n(\n35.0\n)\nNet assets available for benefits\n \n \n \n$\n2,010.2\n \nThe fair values of the Company's pension plan assets at December 31, 2023 by asset category were as follows:\n \nFair value measurements\nNet asset value\nTotal\nfair value\nIn millions\nLevel 1\nLevel 2\nLevel 3\nCash and cash equivalents\n$\n4.7\n \n$\n43.9\n \n$\n—\n \n$\n—\n \n$\n48.6\n \nEquity investments:\nRegistered mutual funds – equity specialty\n—\n \n—\n \n—\n \n78.7\n \n78.7\n \nCommingled funds – equity specialty\n—\n \n—\n \n—\n \n262.4\n \n262.4\n \n—\n \n—\n \n—\n \n341.1\n \n341.1\n \nFixed income investments:\nU.S. government and agency obligations\n—\n \n355.7\n \n—\n \n—\n \n355.7\n \nCorporate and non-U.S. bonds\n—\n \n1,079.5\n \n—\n \n—\n \n1,079.5\n \nAsset-backed and mortgage-backed securities\n—\n \n12.5\n \n—\n \n—\n \n12.5\n \nRegistered mutual funds – fixed income specialty\n—\n \n—\n \n—\n \n96.1\n \n96.1\n \nCommingled funds – fixed income specialty\n—\n \n—\n \n—\n \n75.0\n \n75.0\n \nOther fixed income\n(a)\n—\n \n—\n \n31.2\n \n—\n \n31.2\n \n—\n \n1,447.7\n \n31.2\n \n171.1\n \n1,650.0\n \nDerivatives\n—\n \n5.9\n \n—\n \n—\n \n5.9\n \nOther\n(b)\n—\n \n—\n \n89.7\n \n—\n \n89.7\n \nTotal assets at fair value\n$\n4.7\n \n$\n1,497.5\n \n$\n120.9\n \n$\n512.2\n \n$\n2,135.3\n \nReceivables and payables, net\n10.4\n \nNet assets available for benefits\n \n \n \n$\n2,145.7\n \n(a)\nThis class includes group annuity and guaranteed interest contracts.\n(b)\nThis investment comprises the Company's non-significant, non-US pension plan assets. It primarily includes insurance contracts.\nF-25\nTable of Contents\nCash equivalents are valued using a market approach with inputs including quoted market prices for either identical or similar instruments. Fixed income securities are valued through a market approach with inputs including, but not limited to, benchmark yields, reported trades, broker quotes and issuer spreads. Commingled funds are valued at their daily net asset value (NAV) per share or the equivalent. NAV per share or the equivalent is used for fair value purposes as a practical expedient. NAVs are calculated by the investment manager or sponsor of the fund. Refer to Note 9, \"Fair Value Measurements\" for additional information related to the fair value hierarchy. There have been no significant transfers between levels of the fair value hierarchy.\nThe Company made required and discretionary contributions to its pension plans of $\n58.9\n million in 2024, $\n93.5\n million in 2023, and $\n90.5\n million in 2022 and currently projects that it will contribute approximately $\n30\n million to its plans worldwide in 2025. The Company's policy allows it to fund an amount, which could be in excess of or less than the pension cost expensed, subject to the limitations imposed by current tax regulations. However, the Company anticipates funding the plans in 2025 in accordance with contributions required by funding regulations or the laws of each jurisdiction.\nMost of the Company's U.S. employees are covered by defined contribution plans. Employer contributions are determined based on criteria specific to the individual plans and amounted to approximately $\n188\n million, $\n165\n million and $\n138\n million in 2024, 2023 and 2022, respectively. The Company's contributions relating to non-U.S. defined contribution plans and other non-U.S. benefit plans were $\n38.6\n million, $\n30.9\n million and $\n33.8\n million in 2024, 2023 and 2022, respectively.\nMultiemployer Pension Plans\nThe Company also participates in a number of multiemployer defined benefit pension plans related to collectively bargained U.S. employees of Trane. The Company's contributions are determined by the terms of the related collective-bargaining agreements. These multiemployer plans pose different risks to the Company than single-employer plans, including:\n1.\nThe Company's contributions to multiemployer plans may be used to provide benefits to all participating employees of the plan, including employees of other employers.\n2.\nIn the event that another participating employer ceases contributions to a plan, the Company, together with other remaining participating employers, may be responsible for any unfunded obligations of the employer that ceased making contributions.\n3.\nIf the Company chooses to withdraw from any of the multiemployer plans or if a partial withdrawal occurs, the Company may be required to pay a withdrawal liability, based on the underfunded status of the plan.\nAs of December 31, 2024, the Company does not participate in any multiemployer plans that are individually significant.\nPostretirement Benefits Other Than Pensions\nThe Company sponsors several postretirement plans that provide healthcare benefits and, in some instances, life insurance benefits for eligible current and retired employees. These plans are unfunded and have no plan assets; instead they are funded by the Company on a pay-as-you-go basis in the form of direct benefit payments. Generally, postretirement health benefits are contributory, with contributions adjusted annually. Life insurance plans for retirees are primarily non-contributory.\nThe following table details changes in the Company's postretirement plan benefit obligations for the years ended December 31:\nIn millions\n2024\n2023\nBenefit obligation at beginning of year\n$\n241.3\n \n$\n266.4\n \nService cost\n1.2\n \n1.4\n \nInterest cost\n11.5\n \n13.3\n \nActuarial (gains) losses\n(\n5.6\n)\n(\n7.4\n)\nBenefits paid, net of Medicare Part D subsidy\n(\n25.3\n)\n(\n32.4\n)\nBenefit obligations at end of year\n$\n222.7\n \n$\n241.3\n \nThe benefit plan obligations are reflected in the Consolidated Balance Sheets as follows:\nIn millions\nDecember 31, 2024\nDecember 31, 2023\nAccrued compensation and benefits\n$\n(\n27.9\n)\n$\n(\n29.3\n)\nPostemployment and other benefit liabilities\n(\n194.8\n)\n(\n212.0\n)\nTotal\n$\n(\n222.7\n)\n$\n(\n241.3\n)\nF-26\nTable of Contents\nThe pre-tax amounts recognized in \nAccumulated other comprehensive income (loss)\n were as follows:\nIn millions\nPrior service benefit (cost)\nNet actuarial gains (losses)\nTotal\nBalance at December 31, 2023\n$\n(\n2.7\n)\n$\n114.9\n \n$\n112.2\n \nCurrent year changes recorded to AOCI\n—\n \n5.6\n \n5.6\n \nAmortization reclassified to earnings\n0.6\n \n(\n13.2\n)\n(\n12.6\n)\nBalance at December 31, 2024\n$\n(\n2.1\n)\n$\n107.2\n \n$\n105.1\n \nThe components of net periodic postretirement benefit cost for the years ended December 31 were as follows:\nIn millions\n2024\n2023\n2022\nService cost\n$\n1.2\n \n$\n1.4\n \n$\n1.8\n \nInterest cost\n11.5\n \n13.3\n \n6.9\n \nNet amortization of:\nPrior service costs (benefits)\n0.6\n \n0.6\n \n—\n \nPlan net actuarial (gains) losses\n(\n13.2\n)\n(\n13.0\n)\n(\n5.6\n)\nNet periodic postretirement benefit cost\n$\n0.1\n \n$\n2.3\n \n$\n3.1\n \nAmounts recorded in continuing operations:\n   Operating income\n$\n1.2\n \n$\n1.4\n \n$\n1.8\n \n   Other income/(expense), net\n0.1\n \n1.4\n \n1.4\n \nAmounts recorded in discontinued operations\n(\n1.2\n)\n(\n0.5\n)\n(\n0.1\n)\nTotal\n$\n0.1\n \n$\n2.3\n \n$\n3.1\n \nNet periodic postretirement benefit cost (credit) for 2025 is projected to be $(\n0.3\n) million. The amount expected to be recognized in net periodic postretirement benefits cost in 2025 for net actuarial gains is approximately $\n13\n million.\nWeighted-average assumptions used to determine net periodic benefit cost for the years ended December 31 were as follows:\n2024\n2023\n2022\nDiscount rate:\nBenefit obligations at December 31\n5.57\n \n%\n5.17\n \n%\n5.51\n \n%\nNet periodic benefit cost\nService cost\n5.19\n \n%\n5.54\n \n%\n2.82\n \n%\nInterest cost\n5.12\n \n%\n5.38\n \n%\n2.33\n \n%\nAssumed health-care cost trend rates at December 31:\nCurrent year medical inflation\n6.51\n \n%\n6.28\n \n%\n6.50\n \n%\nUltimate inflation rate\n5.00\n \n%\n5.00\n \n%\n5.00\n \n%\nYear that the rate reaches the ultimate trend rate\n2030\n2029\n2028\nBenefit payments for postretirement benefits, which are net of expected plan participant contributions and Medicare Part D subsidy, are expected to be paid as follows:\nIn millions\n2025\n$\n28.5\n \n2026\n26.8\n \n2027\n25.1\n \n2028\n23.7\n \n2029\n22.0\n \n2030—2034\n88.3\n \nF-27\nTable of Contents\nNOTE 12.  \nREVENUE\nPerformance Obligations\nA performance obligation is a distinct good, service or a bundle of goods and services promised in a contract. The Company identifies performance obligations at the inception of a contract and allocates the transaction price to individual performance obligations to faithfully depict the Company's performance in transferring control of the promised goods or services to the customer.\nThe following are the primary performance obligations identified by the Company:\nEquipment\n. The Company principally generates revenue from the sale of equipment to customers and recognizes revenue at a point in time when control transfers to the customer. Transfer of control is generally determined based on the shipping terms of the contract.  \nContracting and installation\n. The Company enters into various construction-type contracts to design, deliver and build integrated solutions to meet customer specifications. These transactions provide services that range from the development and installation of new HVAC systems to the design and integration of critical building systems to optimize energy efficiency and overall performance. These contracts have a typical term of less than one year and are considered a single performance obligation as multiple combined goods and services promised in the contract represent a single output delivered to the customer. Revenues associated with contracting and installation contracts are recognized over time with progress towards completion measured using the cost-to-cost input method (percentage of completion) as the basis to recognize revenue and an estimated profit. To-date efforts for work performed corresponds with and faithfully depicts transfer of control to the customer.\nServices and maintenance\n. The Company provides various levels of preventative and/or repair and maintenance type service agreements for its customers. The typical length of a contract is between 12 months and 60 months. Revenues associated with these performance obligations are primarily recognized over time on a straight-line basis over the life of the contract as the customer simultaneously receives and consumes the benefit provided by the Company. However, if historical evidence indicates that the cost of providing these services on a straight-line basis is not appropriate, revenue is recognized over the contract period in proportion to the costs expected to be incurred while performing the service. Revenues for certain repair services that do not meet the criteria for over time revenue recognition and sales of parts are recognized at a point in time.\nExtended warranties\n. The Company enters into various warranty contracts with customers related to its products. A standard warranty generally warrants that a product is free from defects in workmanship and materials under normal use and conditions for a certain period of time. The Company's standard warranty is not considered a distinct performance obligation as it does not provide services to customers beyond assurance that the covered product is free of initial defects. An extended warranty provides a customer with additional time that the Company is liable for covered incidents associated with its products. Extended warranties are purchased separately and can last up to five years. As a result, they are considered separate performance obligations for the Company. Revenue associated with these performance obligations is primarily recognized over time on a straight-line basis over the life of the contract as the customer simultaneously receives and consumes the benefit provided by the Company. However, if historical evidence indicates that the cost of providing these services on a straight-line basis is not appropriate, revenue is recognized over the contract period in proportion to the costs expected to be incurred while performing the service. Refer to Note 20, \"Commitments and Contingencies,\" for more information related to product warranties.\nThe transaction price allocated to performance obligations reflects the Company's expectations about the consideration it will be entitled to receive from a customer. To determine the transaction price, variable and non-cash consideration are assessed as well as whether a significant financing component exists. The Company includes variable consideration in the estimated transaction price when it is probable that significant reversal of revenue recognized would not occur when the uncertainty associated with variable consideration is subsequently resolved. The Company considers historical data in determining its best estimates of variable consideration, and the related accruals are recorded using the expected value method.\nFor projects financed through energy savings, the Company provides financial guarantees for in-process work and financial commitments with end dates varying from the current fiscal year through the completion of such transactions that could be triggered in the event of nonperformance. Additionally, for completed energy savings contracts, the Company has ongoing performance guarantees related to the customers' realization of committed energy savings that are evaluated during the measurement and verification portion of contracting and installation agreements. These performance guarantees represent variable consideration and are estimated as part of the overall transaction price. As of December 31, 2024, the Company has outstanding performance guarantees of approximately $\n1\n billion related to completed energy savings contracts that extend from 2025-2049. Since 1995, the Company has recognized an immaterial amount in adjustments to the overall transaction price of energy savings contracts as a result of these performance guarantees.\nThe Company enters into sales arrangements that contain multiple goods and services. For these arrangements, each good or service is evaluated to determine whether it represents a distinct performance obligation and whether the sales price for each obligation is representative of standalone selling price. If available, the Company utilizes observable prices for goods or \nF-28\nTable of Contents\nservices sold separately to similar customers in similar circumstances to evaluate relative standalone selling price. List prices are used if they are determined to be representative of standalone selling prices. Where necessary, the Company ensures that the total transaction price is then allocated to the distinct performance obligations based on the determination of their relative standalone selling price at the inception of the arrangement.\nThe Company recognizes revenue for delivered goods or services when the delivered good or service is distinct, control of the good or service has transferred to the customer, and only customary refund or return rights related to the goods or services exist. The Company excludes from revenues taxes it collects from a customer that are assessed by a government authority.\nDisaggregated Revenue\nNet revenues\n by geography and major type of good or service for the years ended at December 31 were as follows:\nIn millions\n2024\n2023\n2022\nAmericas\n     Equipment\n$\n10,608.2\n \n$\n9,259.7\n \n$\n8,575.1\n \n     Services\n5,295.0\n \n4,572.3\n \n4,065.7\n \nTotal Americas\n$\n15,903.2\n \n$\n13,832.0\n \n$\n12,640.8\n \nEMEA\nEquipment\n$\n1,780.3\n \n$\n1,700.5\n \n$\n1,420.9\n \nServices\n776.4\n \n700.7\n \n613.6\n \nTotal EMEA\n$\n2,556.7\n \n$\n2,401.2\n \n$\n2,034.5\n \nAsia Pacific\n     Equipment\n$\n926.0\n \n$\n1,015.2\n \n$\n934.8\n \n     Services\n452.3\n \n429.2\n \n381.6\n \nTotal Asia Pacific\n$\n1,378.3\n \n$\n1,444.4\n \n$\n1,316.4\n \nTotal Net revenues\n$\n19,838.2\n \n$\n17,677.6\n \n$\n15,991.7\n \nRevenue from goods and services transferred to customers at a point in time accounted for approximately \n80\n%, \n81\n% and \n82\n% of the Company's revenue for the years ended December 31, 2024, 2023 and 2022, respectively.\nContract Balances\nThe opening and closing balances of contract assets and contract liabilities arising from contracts with customers for the period ended December 31, 2024 and December 31, 2023 were as follows:\nIn millions\nLocation on Consolidated Balance Sheet\n2024\n2023\nContract assets - current\nOther current assets\n$\n427.3\n \n$\n458.4\n \nContract liabilities - current\nAccrued expenses and other current liabilities\n1,310.9\n \n1,301.2\n \nContract liabilities - noncurrent\nOther noncurrent liabilities\n294.0\n \n247.2\n \nThe timing of revenue recognition, billings and cash collections results in accounts receivable, contract assets, and customer advances and deposits (contract liabilities) on the Consolidated Balance Sheets. In general, the Company receives payments from customers based on a billing schedule established in its contracts. Contract assets relate to the conditional right to consideration for any completed performance under the contract when costs are incurred in excess of billings under the percentage of completion methodology. Accounts receivable are recorded when the right to consideration becomes unconditional. Contract liabilities relate to payments received in advance of performance under the contract or when the Company has a right to consideration that is unconditional before it transfers a good or service to the customer. Contract liabilities are recognized as revenue as (or when) the Company performs under the contract. During the years ended December 31, 2024 and 2023, changes in contract asset and liability balances were not materially impacted by any other factors.\nApproximately \n72\n% of the contract liability balance at December 31, 2023 was recognized as revenue during the year ended December 31, 2024. Additionally, approximately \n18\n% of the contract liability balance at December 31, 2024 was classified as noncurrent and not expected to be recognized as revenue in the next 12 months.\nF-29\nTable of Contents\n NOTE 13.  \nEQUITY\nThe authorized share capital of Trane Technologies plc is \n1,185,040,000\n shares, consisting of (1) \n1,175,000,000\n ordinary shares, par value $\n1.00\n per share, (2) \n40,000\n ordinary shares, par value EUR \n1.00\n and (3) \n10,000,000\n preference shares, par value $\n0.001\n per share. There were \nno\n Euro-denominated ordinary shares or preference shares outstanding at December 31, 2024 or 2023.\nThe changes in ordinary shares and treasury shares for the year ended December 31, 2024 were as follows:\nIn millions\nOrdinary shares issued\nOrdinary shares held in treasury\nDecember 31, 2023\n251.7\n \n24.5\n \nShares issued under incentive plans\n1.2\n \n—\n \nRepurchase of ordinary shares\n(\n3.9\n)\n—\n \nDecember 31, 2024\n249.0\n \n24.5\n \nShare repurchases are made from time to time in accordance with management's capital allocation strategy, subject to market conditions and regulatory requirements. Shares acquired and canceled upon repurchase are accounted for as a reduction of \nOrdinary Shares \nand \nCapital in excess of par value\n, or \nRetained earnings\n to the extent \nCapital in excess of par value\n is exhausted. Shares acquired and held in treasury are presented separately on the balance sheet as a reduction to \nEquity\n and recognized at cost.\nIn February 2022, the Company's Board of Directors authorized a share repurchase program of up to $\n3.0\n billion of its ordinary shares (2022 Authorization) and in December 2024, the Board of Directors authorized a share repurchase program of up to an additional $\n5.0\n billion of the Company's ordinary shares (2024 Authorization) upon the conclusion of the 2022 Authorization. During the year ended December 31, 2024, the Company repurchased and canceled approximately $\n1.3\n billion of its ordinary shares, leaving $\n1.2\n billion remaining under the 2022 Authorization and $\n5.0\n billion remaining under the 2024 Authorization. Additionally, during the period after December 31, 2024 through January 31, 2025 the Company repurchased approximately $\n100\n million of its ordinary shares under the 2022 Authorization.\nAccumulated Other Comprehensive Income (Loss)\nThe changes in \nAccumulated other comprehensive income (loss) \nwere as follows:\nIn millions\nDerivative Instruments\nPension and OPEB Items\nForeign Currency Translation\nTotal\nDecember 31, 2022\n$\n(\n4.5\n)\n$\n(\n214.1\n)\n$\n(\n547.6\n)\n$\n(\n766.2\n)\nOther comprehensive income (loss) attributable to Trane Technologies plc\n7.5\n \n15.2\n \n72.7\n \n95.4\n \nDecember 31, 2023\n$\n3.0\n \n$\n(\n198.9\n)\n$\n(\n474.9\n)\n$\n(\n670.8\n)\nOther comprehensive income (loss) attributable to Trane Technologies plc\n(\n4.4\n)\n12.1\n \n(\n201.0\n)\n(\n193.3\n)\nDecember 31, 2024\n$\n(\n1.4\n)\n$\n(\n186.8\n)\n$\n(\n675.9\n)\n$\n(\n864.1\n)\nThe amounts of \nOther comprehensive income (loss) attributable to noncontrolling interests\n for 2024, 2023 and 2022 were $(\n0.6\n) million, $(\n0.2\n) million and $(\n1.9\n) million, respectively, related to currency translation. Additionally, \nOther comprehensive income (loss) attributable to noncontrolling interests\n for 2024, 2023, and 2022 includes $\n0.0\n million, $\n0.5\n million, and $\n0.3\n million, respectively, related to pension and postretirement obligation adjustments.\nF-30\nTable of Contents\nNOTE 14.  \nSHARE-BASED COMPENSATION\nThe Company accounts for share-based compensation plans under the fair-value-based method. The Company's share-based compensation plans include programs for stock options, restricted stock units (RSUs), performance share units (PSUs), and deferred compensation. Under the Company's incentive share plan, the total number of ordinary shares authorized by the shareholders is \n23.0\n million, of which \n10.5\n million remains available as of December 31, 2024 for future incentive awards.\nCompensation Expense\nShare-based compensation expense related to continuing operations is included in \nSelling and administrative expenses\n. \nThe following table summarizes the expenses recognized:\nIn millions\n2024\n2023\n2022\nStock options\n$\n17.9\n \n$\n16.1\n \n$\n14.1\n \nRSUs\n27.3\n \n23.5\n \n19.7\n \nPSUs\n36.4\n \n23.2\n \n20.7\n \nDeferred compensation\n3.9\n \n4.3\n \n1.2\n \nPre-tax expense\n85.5\n \n67.1\n \n55.7\n \nTax benefit\n(\n20.7\n)\n(\n16.3\n)\n(\n13.5\n)\nAfter-tax expense\n$\n64.8\n \n$\n50.8\n \n$\n42.2\n \nAmounts recorded in continuing operations\n$\n64.8\n \n$\n50.8\n \n$\n42.6\n \nAmounts recorded in discontinued operations\n—\n \n—\n \n(\n0.4\n)\nTotal\n$\n64.8\n \n$\n50.8\n \n$\n42.2\n \nGrants issued during the years ended December 31 were as follows:\n2024\n2023\n2022\nNumber Granted\nWeighted-average fair value per award\nNumber Granted\nWeighted-average fair value per award\nNumber Granted\nWeighted-average fair value per award\nStock options\n268,922\n \n$\n79.09\n \n425,444\n \n$\n47.53\n \n430,496\n \n$\n35.96\n \nRSUs\n112,227\n \n$\n287.84\n \n214,425\n \n$\n184.35\n \n139,730\n \n$\n165.07\n \nPerformance shares\n (1)\n161,978\n \n$\n332.85\n \n208,046\n \n$\n207.23\n \n195,930\n \n$\n170.31\n \n(1)\n The number of performance shares represents the maximum award level.\n \nStock Options / RSUs\nEligible participants may receive (i) stock options, (ii) RSUs or (iii) a combination of both stock options and RSUs. The fair value of each of the Company's stock option and RSU awards is expensed on a straight-line basis over the required service period, which is generally the \n3\n-year vesting period. Beginning with the 2024 grant year, for stock options and RSUs granted to retirement eligible employees, the Company recognizes expense over the period during which an employee is required to provide service in exchange for the award, which is generally 12 months. For awards granted to retirement eligible employees prior to 2024, the Company recognized expense for the fair value at the grant date.\nThe average fair value of the stock options granted is determined using the Black Scholes option pricing model. \nThe following assumptions were used during the year ended December 31:\n2024\n2023\n2022\nDividend yield\n1.11\n \n%\n1.50\n \n%\n1.60\n \n%\nVolatility\n29.99\n \n%\n29.37\n \n%\n28.23\n \n%\nRisk-free rate of return\n4.00\n \n%\n3.62\n \n%\n1.56\n \n%\nExpected life in years\n4.8\n4.8\n4.8\nF-31\nTable of Contents\nA description of the significant assumptions used to estimate the fair value of the stock option awards is as follows:\n•\nDividend yield\n - The Company determines the dividend yield based upon the expected quarterly dividend payments as of the grant date and the current fair market value of the Company's shares.\n•\nVolatility\n - The expected volatility is based on a weighted average of the Company's implied volatility and the most recent historical volatility of the Company's shares commensurate with the expected life.\n•\nRisk-free rate of return\n - The Company applies a yield curve of continuous risk-free rates based upon the published US Treasury spot rates on the grant date.\n•\nExpected life\n \nin years \n- The expected life of the Company's stock option awards represents the weighted-average of the actual period since the grant date for all exercised or canceled options and an expected period for all outstanding options.\nChanges in options outstanding under the plans for the years 2024, 2023 and 2022 were as follows:\nShares\nsubject\nto option\nWeighted-\naverage\nexercise price\nAggregate\nintrinsic\nvalue (millions)\nWeighted-\naverage\nremaining life (years)\nDecember 31, 2021\n4,411,000\n \n$\n83.39\n \nGranted\n430,496\n \n167.93\n \nExercised\n(\n633,962\n)\n66.06\n \nCancelled\n(\n57,050\n)\n137.38\n \n \n \nDecember 31, 2022\n4,150,484\n \n$\n94.06\n \nGranted\n425,444\n \n182.27\n \nExercised\n(\n1,382,846\n)\n80.67\n \nCancelled\n(\n21,365\n)\n168.18\n \n \n \nDecember 31, 2023\n3,171,717\n \n$\n111.23\n \nGranted\n268,922\n \n278.57\n \nExercised\n(\n914,667\n)\n86.25\n \nCancelled\n(\n17,842\n)\n227.59\n \n \n \nOutstanding December 31, 2024\n2,508,130\n \n$\n137.46\n \n$\n581.8\n \n5.4\nExercisable December 31, 2024\n1,815,960\n \n$\n107.50\n \n$\n475.5\n \n4.4\nAt December 31, 2024, there was $\n12.3\n million of total unrecognized compensation cost from stock option arrangements granted under the plan, which is primarily related to unvested shares of non-retirement eligible employees. The aggregate intrinsic value of options exercised during the years ended December 31, 2024 and 2023 was $\n210.2\n million and $\n159.8\n million, respectively. Generally, stock options expire ten years from their date of grant.\nF-32\nTable of Contents\nThe following table summarizes RSU activity for the years 2024, 2023 and 2022:\nRSUs\nWeighted-\naverage grant\ndate fair value\nOutstanding and unvested at December 31, 2021\n371,030\n \n$\n118.88\n \nGranted\n139,730\n \n165.07\n \nVested\n(\n202,172\n)\n107.29\n \nCancelled\n(\n13,935\n)\n136.89\n \nOutstanding and unvested at December 31, 2022\n294,653\n \n$\n147.88\n \nGranted\n214,425\n \n184.35\n \nVested\n(\n154,134\n)\n134.87\n \nCancelled\n(\n13,153\n)\n173.28\n \nOutstanding and unvested at December 31, 2023\n341,791\n \n$\n175.65\n \nGranted\n112,227\n \n287.84\n \nVested\n(\n134,791\n)\n164.69\n \nCancelled\n(\n10,448\n)\n214.39\n \nOutstanding and unvested at December 31, 2024\n308,779\n \n$\n219.89\n \nAt December 31, 2024, there was $\n25.2\n million of total unrecognized compensation cost from RSU arrangements granted under the plan, which is related to unvested shares of non-retirement eligible employees.\nPerformance Shares\nThe Company has a Performance Share Program (PSP) for key employees. The program provides awards in the form of PSUs based on performance against pre-established objectives. The annual target award level is expressed as a number of the Company's ordinary shares based on the fair market value of the Company's stock on the date of grant. All PSUs are settled in the form of ordinary shares.\nPSU awards are earned based \n50\n% upon a performance condition, measured by relative Cash Flow Return on Invested Capital (CROIC) to the S&P 500 Industrials Index over a 3-year performance period, and \n50\n% upon a market condition, measured by the Company's relative total shareholder return (TSR) as compared to the TSR of the S&P 500 Industrials Index over a \n3\n-year performance period. Beginning with the 2024 grant year, for PSUs granted to retirement eligible employees, the Company recognizes the expense over the period during which an employee is required to provide service in exchange for the award, which is 12 months. For awards granted to retirement eligible employees prior to 2024, the expense was recognized over the 3-year performance period. The fair value of the market condition is estimated using a Monte Carlo simulation model in a risk-neutral framework based upon historical volatility, risk-free rates and correlation matrix.\nF-33\nTable of Contents\nThe following table summarizes PSU activity for the maximum number of shares that may be issued for the years 2024, 2023 and 2022:\nPSUs\nWeighted-average grant date fair value\nOutstanding and unvested at December 31, 2021\n801,956\n \n$\n131.14\n \nGranted\n195,930\n \n170.31\n \nVested\n(\n346,540\n)\n89.70\n \nForfeited\n(\n42,320\n)\n164.21\n \nOutstanding and unvested at December 31, 2022\n609,026\n \n$\n165.02\n \nGranted\n208,046\n \n207.23\n \nVested\n(\n237,586\n)\n147.33\n \nForfeited\n(\n20,526\n)\n186.32\n \nOutstanding and unvested at December 31, 2023\n558,960\n \n$\n187.47\n \nGranted\n161,978\n \n332.85\n \nVested\n(\n184,060\n)\n182.48\n \nForfeited\n(\n21,072\n)\n226.31\n \nOutstanding and unvested at December 31, 2024\n515,806\n \n$\n233.32\n \nAt December 31, 2024, there was $\n14.7\n million of total unrecognized compensation cost from PSU arrangements based on current performance, which is related to unvested shares. This compensation will be recognized over the required service period, which is generally the three-year vesting period.\nDeferred Compensation\nThe Company allows key employees to defer a portion of their eligible compensation into a number of investment choices, including its ordinary share equivalents. Any amounts invested in ordinary share equivalents will be settled in ordinary shares of the Company at the time of distribution.\nNOTE 15.  OTHER INCOME/(EXPENSE), NET\nThe components of \nOther income/(expense), net\n for the years ended December 31, 2024, 2023 and 2022 were as follows:\nIn millions\n2024\n2023\n2022\nInterest income\n$\n35.9\n \n$\n15.4\n \n$\n9.2\n \nForeign currency exchange loss\n(\n24.1\n)\n(\n20.1\n)\n(\n17.9\n)\nOther components of net periodic benefit credit/(cost)\n(\n11.6\n)\n(\n20.0\n)\n(\n10.6\n)\nOther activity, net\n(\n20.1\n)\n(\n67.5\n)\n(\n4.0\n)\nOther income/(expense), net\n$\n(\n19.9\n)\n$\n(\n92.2\n)\n$\n(\n23.3\n)\nOther income/(expense), net\n includes the results from activities other than core business operations such as interest income and foreign currency gains and losses on transactions that are denominated in a currency other than an entity's functional currency. The increase in interest income for the year ended December 31, 2024 primarily relates to interest from short-term investments purchased in the second quarter of 2024 with proceeds from the issuance of Senior Notes due 2034 as discussed in Note 7.  In addition, the Company includes the components of net periodic benefit credit/(cost) for pension and post retirement obligations other than the service cost component. During the year ended December 31, 2022 the Company recorded a $\n15.0\n million settlement charge for a compensation related payment to a retired executive within \nother components of net periodic benefit credit/(cost)\n.\nOther activity, net includes items associated with legacy legal matters, such as asbestos-related activities related to Murray. Refer to Note 20, \"Commitments and Contingencies\" for more information regarding asbestos-related matters. During the year ended December 31, 2023, the Company recorded within other activity, net an impairment of an equity investment of $\n52.2\n million.\n \nF-34\nTable of Contents\nNOTE 16.  \nINCOME TAXES\nCurrent and deferred provision for income taxes\nEarnings before income taxes\n for the years ended December 31 were taxed within the following jurisdictions:\nIn millions\n2024\n2023\n2022\nUnited States\n$\n1,871.9\n \n$\n1,690.7\n \n$\n1,312.3\n \nNon-U.S.\n1,369.9\n \n876.6\n \n859.8\n \nTotal\n$\n3,241.8\n \n$\n2,567.3\n \n$\n2,172.1\n \nThe components of the \nProvision for income taxes\n for the years ended December 31 were as follows:\nIn millions\n2024\n2023\n2022\nCurrent tax expense (benefit):\nUnited States\n$\n500.4\n \n$\n377.6\n \n$\n180.4\n \nNon-U.S.\n256.3\n \n174.3\n \n127.7\n \nTotal:\n756.7\n \n551.9\n \n308.1\n \nDeferred tax expense (benefit):\nUnited States\n(\n128.2\n)\n(\n18.8\n)\n66.5\n \nNon-U.S.\n(\n0.9\n)\n(\n34.7\n)\n1.3\n \nTotal:\n(\n129.1\n)\n(\n53.5\n)\n67.8\n \nTotal tax expense (benefit):\nUnited States\n372.2\n \n358.8\n \n246.9\n \nNon-U.S.\n255.4\n \n139.6\n \n129.0\n \nTotal\n$\n627.6\n \n$\n498.4\n \n$\n375.9\n \nThe \nProvision for income taxes\n differs from the amount of income taxes determined by applying the applicable U.S. statutory income tax rate to pretax income, as a result of the following differences:\n \nPercent of pretax income\n2024\n2023\n2022\nStatutory U.S. rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nIncrease (decrease) in rates resulting from:\nNon-U.S. tax rate differential\n(\n1.5\n)\n(\n1.9\n)\n(\n2.8\n)\nTax on U.S. subsidiaries on non-U.S. earnings \n(a)\n(\n0.3\n)\n(\n0.4\n)\n0.3\n \nState and local income taxes \n(b)\n2.3\n \n3.2\n \n1.1\n \nValuation allowances \n(c)\n(\n0.9\n)\n(\n1.2\n)\n(\n0.7\n)\nStock based compensation\n(\n1.3\n)\n(\n1.2\n)\n(\n0.8\n)\nOther adjustments\n0.1\n \n(\n0.1\n)\n(\n0.8\n)\nEffective tax rate\n19.4\n \n%\n19.4\n \n%\n17.3\n \n%\n(a)\nNet of foreign tax credits\n(b)\nNet of changes in state valuation allowances\n(c)\nPrimarily federal and non-U.S., excludes state valuation allowances\nOn December 18, 2023, Ireland enacted legislation related to the 15% minimum tax element of the Organisation for Economic Co-operation and Development's (OECD) tax reform initiative, commonly referred to as \"Pillar Two,\" effective January 1, 2024. The Company has included the impacts of enacted legislative changes and continues to monitor additional guidance as it becomes available. The effects of Pillar Two are included in the 'Non-US tax rate differential' line in the table above.\nTax incentives, in the form of tax holidays, have been granted to the Company in certain jurisdictions to encourage industrial development. The expiration of these tax holidays varies by country. The tax holidays are conditional on the Company meeting certain employment and investment thresholds. The most significant tax holidays relate to the Company's qualifying locations in China, Puerto Rico and Panama. The benefit for the tax holidays for the years ended December 31, 2024, 2023 and 2022 was $\n51.1\n million, $\n51.9\n million and $\n52.5\n million, respectively.\nF-35\nTable of Contents\nDeferred tax assets and liabilities\nA summary of the deferred tax accounts at December 31 were as follows:\nIn millions\n2024\n2023\nDeferred tax assets:\nInventory and accounts receivable\n$\n12.1\n \n$\n11.8\n \nDepreciable and amortizable assets\n2.0\n \n1.4\n \nOperating lease liabilities\n145.0\n \n122.4\n \nPostemployment and other benefit liabilities\n254.6\n \n239.2\n \nProduct liability\n6.1\n \n7.3\n \nOther reserves and accruals\n223.9\n \n198.6\n \nNet operating losses and credit carryforwards\n220.9\n \n287.4\n \nOther\n39.9\n \n41.4\n \nGross deferred tax assets\n904.5\n \n909.5\n \nLess: deferred tax valuation allowances\n(\n110.3\n)\n(\n164.0\n)\nDeferred tax assets net of valuation allowances\n$\n794.2\n \n$\n745.5\n \nDeferred tax liabilities:\nInventory and accounts receivable\n$\n(\n22.6\n)\n$\n(\n15.3\n)\nDepreciable and amortizable assets\n(\n978.5\n)\n(\n1,073.2\n)\nOperating lease right-of-use assets\n(\n142.2\n)\n(\n120.2\n)\nPostemployment and other benefit liabilities\n(\n13.8\n)\n(\n13.0\n)\nOther reserves and accruals\n(\n2.5\n)\n(\n2.2\n)\nUndistributed earnings of foreign subsidiaries\n(\n36.0\n)\n(\n35.5\n)\nOther\n(\n3.2\n)\n0.7\n \nGross deferred tax liabilities\n(\n1,198.8\n)\n(\n1,258.7\n)\nNet deferred tax assets (liabilities)\n$\n(\n404.6\n)\n$\n(\n513.2\n)\nAt December 31, 2024, no deferred taxes have been provided for earnings of certain of the Company's subsidiaries, since these earnings have been and under current plans will continue to be permanently reinvested in these subsidiaries. These earnings amount to approximately $\n2\n billion which if distributed would result in additional taxes, which may be payable upon distribution, of approximately $\n316\n million.\nAt December 31, 2024, the Company had the following operating loss, capital loss and tax credit carryforwards available to offset taxable income in prior and future years:\nIn millions\nAmount\nExpiration\nPeriod\nU.S. Federal net operating loss carryforwards\n$\n67.7\n \n2025-Unlimited\nU.S. Federal credit carryforwards\n77.1\n \n2026-2043\nU.S. State net operating loss carryforwards\n2,224.1\n \n2025-Unlimited\nU.S. State credit carryforwards\n26.0\n \n2025-Unlimited\nNon-U.S. net operating loss carryforwards\n379.7\n \n2025-Unlimited\nNon-U.S. credit carryforwards\n8.0\n \n2025\nThe U.S. state net operating loss carryforwards were incurred in various jurisdictions. The non-U.S. net operating loss carryforwards were incurred in various jurisdictions, predominantly in Belgium, Brazil, Luxembourg, and Spain.\nF-36\nTable of Contents\nActivity associated with the Company's valuation allowance is as follows:\nIn millions\n2024\n2023\n2022\nBeginning balance\n$\n164.0\n \n$\n199.8\n \n$\n258.6\n \nIncrease to valuation allowance\n2.8\n \n24.3\n \n5.9\n \nDecrease to valuation allowance\n(\n44.4\n)\n(\n57.8\n)\n(\n65.1\n)\nWrite off against valuation allowance\n(\n10.9\n)\n(\n2.2\n)\n—\n \nAcquisition and purchase accounting\n—\n \n1.3\n \n—\n \nAccumulated other comprehensive income (loss)\n(\n1.2\n)\n(\n1.4\n)\n0.4\n \nEnding balance\n$\n110.3\n \n$\n164.0\n \n$\n199.8\n \nDuring 2024, the Company recorded a $\n30.4\n million reduction in valuation allowances primarily related to deferred tax assets associated with both foreign tax credits and operations of international subsidiaries. Additional reductions in the valuation allowance related to deferred tax assets associated with foreign tax credits could be recognized in future periods if foreign source income exceeds current projections for the periods 2025 through 2027, the remainder of the carryforward period.\nDuring 2023, the Company recorded a $\n30.3\n million reduction in valuation allowances primarily related to deferred tax assets associated with both foreign tax credits and operations of international subsidiaries. \nDuring 2022, the Company recorded a $\n48.2\n million reduction in valuation allowances primarily related to certain net state deferred tax assets resulting from U.S. legal entity restructurings and deferred tax assets associated with foreign tax credits as a result of an increase in the 2022 year and projected foreign source income. \nUnrecognized tax benefits\nThe Company has total unrecognized tax benefits of $\n86.5\n million and $\n84.9\n million as of December 31, 2024, and December 31, 2023, respectively. The amount of unrecognized tax benefits that, if recognized, would affect the continuing operations effective tax rate are $\n47.8\n million as of December 31, 2024. \nA reconciliation of the beginning and ending amount of unrecognized tax benefits is as follows:\nIn millions\n2024\n2023\n2022\nBeginning balance\n$\n84.9\n \n$\n82.4\n \n$\n65.2\n \nAdditions based on tax positions related to the current year\n4.6\n \n3.6\n \n3.9\n \nAdditions based on tax positions related to prior years\n8.1\n \n0.6\n \n22.5\n \nReductions based on tax positions related to prior years\n(\n2.8\n)\n(\n0.5\n)\n(\n5.9\n)\nReductions related to settlements with tax authorities\n(\n2.5\n)\n(\n1.4\n)\n(\n0.9\n)\nReductions related to lapses of statute of limitations\n(\n3.5\n)\n(\n1.0\n)\n(\n0.6\n)\nTranslation (gain) loss\n(\n2.3\n)\n1.2\n \n(\n1.8\n)\nEnding balance\n$\n86.5\n \n$\n84.9\n \n$\n82.4\n \nThe Company records interest and penalties associated with the uncertain tax positions within its Provision for income taxes. The Company had reserves associated with interest and penalties, net of tax, of $\n13.9\n million and $\n16.0\n million at December 31, 2024 and December 31, 2023, respectively. For the years ended December 31, 2024 and December 31, 2023, the Company recognized $\n0.4\n million and $\n0.2\n million tax expense, respectively, in interest and penalties, net of tax in continuing operations related to these uncertain tax positions.\nThe total amount of unrecognized tax benefits relating to the Company's tax positions is subject to change based on future events including, but not limited to, the settlements of ongoing audits and/or the expiration of applicable statutes of limitations. Although the outcomes and timing of such events are highly uncertain, it is reasonably possible that the balance of gross unrecognized tax benefits, excluding interest and penalties, could potentially be reduced by up to approximately $\n35\n million during the next \n12\n months.\nF-37\nTable of Contents\nThe provision for income taxes involves a significant amount of management judgment regarding interpretation of relevant facts and laws in the jurisdictions in which the Company operates. Future changes in applicable laws, projected levels of taxable income and tax planning could change the effective income tax rate and tax balances recorded by the Company. In addition, tax authorities periodically review income tax returns filed by the Company and can raise issues regarding its filing positions, timing and amount of income or deductions, and the allocation of income among the jurisdictions in which the Company operates. A significant period of time may elapse between the filing of an income tax return and the ultimate resolution of an issue raised by a revenue authority with respect to that return. In the normal course of business the Company is subject to examination by taxing authorities throughout the world, including such major jurisdictions as Belgium, Brazil, Canada, China, France, Germany, Ireland, Italy, Luxembourg, Mexico, Singapore, Spain, the Netherlands, the United Kingdom and the United States. These examinations on their own, or any subsequent litigation related to the examinations, may result in additional income taxes or penalties against the Company. If the ultimate result of these audits differ from original or adjusted estimates, they could have a material impact on the Company's income tax provision. In general, the examination of the Company's U.S. federal tax returns is complete for years prior to 2016. The Company's U.S. federal income tax returns for 2016 to 2019 are currently under examination by the Internal Revenue Service (IRS). In general, the examination of the Company's material non-U.S. income tax returns is complete or effectively settled for the years prior to 2013, with certain matters prior to 2013 being resolved through appeals and litigation and also unilateral procedures as provided for under double tax treaties.\nNOTE 17.  ACQUISITIONS AND DIVESTITURES\nAcquisitions \nFiscal Year 2024\nDuring the third quarter of 2024, the Company acquired two businesses, both reported within the Americas segment from the date of acquisition. One acquisition was a Commercial HVAC distributor with sales and service business in the United States. The second acquisition was a technology-focused acquisition that expands the Company's product offerings in the Transport Refrigeration business. The aggregate cash paid, net of cash acquired, totaled $\n174.5\n million and was financed through cash on hand. Intangible assets associated with these acquisitions totaled $\n51.6\n million and primarily relate to customer relationships. The excess purchase price over the estimated fair value of net assets acquired was recognized as goodwill and totaled $\n96.3\n million. We expect the majority of the goodwill recognized for these acquisitions to be deductible for tax purposes. The values assigned to individual assets acquired and liabilities assumed are preliminary based on management's current best estimate and subject to change as certain matters are finalized. \nThe fair values of the customer relationship intangible assets were determined using the multi-period excess earnings method based on discounted projected net cash flows associated with the net earnings attributable to the acquired customer relationships. These projected cash flows are estimated over the remaining economic life of the intangible asset and are considered from a market participant perspective. Key assumptions include projected cash flows, including revenue growth rates and margins and customer attrition rates. The customer relationships had a weighted-average useful life of \n12\n years. The Company has not included pro forma financial information as the overall pro forma impact was deemed not material.\nFiscal Year 2023\nOn May 2, 2023, the Company acquired 100% of MTA S.p.A (MTA) for $\n224.4\n million, net of cash acquired, financed through commercial paper and cash on hand. MTA is a leading industrial process cooling technology business which brings complementary, high-performing solutions to the comprehensive Commercial HVAC product and services portfolios in the EMEA and Americas segments. Intangible assets associated with this acquisition totaled $\n93.3\n million and primarily relate to customer relationships. The excess purchase price over the estimated fair value of net assets acquired was recognized as goodwill and totaled $\n114.6\n million, inclusive of the impact of measurement period adjustments\n. \nThe goodwill resulting from the acquisition is not deductible for tax purposes. The results of the acquisition are reported within the EMEA and Americas segments from the date of acquisition.\nOn May 12, 2023, the Company acquired 100% of Helmer Scientific Inc (Helmer), a precision temperature cooling company in the life sciences vertical within the Americas segment. The aggregate cash paid, net of cash acquired, totaled $\n266.4\n million and was financed through commercial paper and cash on hand. Intangible assets associated with this acquisition totaled $\n95.7\n million and primarily relate to customer relationships. The excess purchase price over the estimated fair value of net assets acquired was recognized as goodwill and totaled $\n130.5\n million, inclusive of the impact of measurement period adjustments. For income tax purposes, the acquisition was treated as an asset purchase and the goodwill will be deductible for tax purposes. The results of the acquisition are reported within the Americas segment from the date of acquisition.\nOn November 2, 2023, the Company acquired 100% of Nuvolo, a global leader in modern, cloud-based enterprise asset management and connected workplace software and solutions. The results of the acquisition are reported within the Americas segment from the date of acquisition.\nF-38\nTable of Contents\nThe Company paid $\n352.6\n million in initial cash consideration, financed through cash on hand, and agreed to two additional contingent consideration arrangements. The first contingent consideration arrangement, payable of up to $\n90.0\n million in cash, is based on the attainment of revenue targets from November 2, 2023 through April 4, 2025. If the first contingent consideration targets are met, a second contingent consideration arrangement related to a specified customer contract is available to the sellers, with no maximum earnout, based on revenues attained from that specified customer contract through April 4, 2025. The total purchase price for the acquisition was expected to be $\n442.9\n million, comprised of the upfront cash consideration of $\n352.6\n million paid on November 2, 2023 and the fair value of the contingent consideration arrangements at the acquisition-date of $\n90.3\n million. See Note 9, \"Fair Value Measurements\" to the Consolidated Financial Statements for additional information regarding fair value of contingent consideration.\nIntangible assets associated with the Nuvolo acquisition totaled $\n141.0\n million and primarily relate to developed technology and customer relationships. The excess purchase price over the estimated fair value of net assets acquired was recognized as goodwill and totaled $\n313.1\n million, inclusive of measurement period adjustments. The goodwill is primarily attributable to the fair value of market share and revenue growth from Nuvolo. The benefit of access to the workforce is an additional element of goodwill. The goodwill created in the acquisition is not deductible for tax purposes. \nThe amounts assigned to the major identifiable intangible asset classifications for the 2023 acquisitions were as follows:\nIn millions\nWeighted-average useful life (in years) \nFair value\nCustomer relationships\n13\n189.9\nDeveloped technology\n9\n107.1\nOther\n6\n33.0\nTotal intangible assets\n$\n330.0\n \nThe valuation of intangible assets was determined using an income approach methodology. The Company estimated a portion of the fair value of the customer relationships intangible assets using an excess earnings model and a portion using the with and without method. The Company estimated a portion of the fair value of the developed technology intangible asset using a relief from royalty approach and a portion using an excess earnings model. These fair value measurements were based on significant inputs not observable in the market and thus represent a Level 3 measurement. Key assumptions include projected cash flows, including revenue growth rates and margins, customer attrition rates, royalty rates and discount rates attributable to each intangible asset. \nThe Company has not included pro forma financial information as the 2023 pro forma impact was deemed not material. \nFiscal Year 2022\nOn October 31, 2022, the Company acquired 100% of AL-KO Air Technology (AL-KO) for $\n111.7\n million, net of cash acquired, financed through cash on hand, and inclusive of the impact of measurement period adjustments. AL-KO designs, engineers, manufactures, sells, installs, and services air handling and extraction systems in commercial applications. Intangible assets associated with this acquisition totaled $\n49.4\n million and primarily relate to customer relationships. The excess purchase price over the estimated fair value of net assets acquired was recognized as goodwill and totaled $\n48.5\n million, inclusive of the impact of measurement period adjustments. The results of operations of AL-KO are reported within the EMEA and Asia Pacific segments from the date of acquisition.\nOn April 1, 2022, the Company acquired a Commercial HVAC independent dealer, reported within the Americas segment from the date of acquisition, to support the Company's ongoing strategy to expand its distribution network and service area. The aggregate cash paid, net of cash acquired, totaled $\n110.0\n million and was financed through cash on hand. Intangible assets associated with this acquisition totaled $\n52.7\n million and primarily relate to customer relationships. The excess purchase price over the estimated fair value of net assets acquired was recognized as goodwill and totaled $\n42.5\n million.\nF-39\nTable of Contents\nThe amounts assigned to the major identifiable intangible asset classifications for the 2022 acquisitions were as follows:\nIn millions\nWeighted-average useful life (in years) \nFair value\nCustomer relationships\n15\n$\n82.9\n \nOther\n6\n19.2\n \nTotal intangible assets\n$\n102.1\n \nThe valuation of intangible assets was determined using an income approach methodology. The fair value of the customer relationship intangible assets was determined using the excess earnings method based on discounted projected net cash flows associated with the net earnings attributable to the acquired customer relationships. These projected cash flows are estimated over the remaining economic life of the intangible asset and are considered from a market participant perspective. Key assumptions used in estimating future cash flows included projected revenue growth rates and customer attrition rates. The projected future cash flows are discounted to present value using an appropriate discount rate.\nThe Company has not included pro forma financial information as the 2022 pro forma impact was deemed not material. \nDivestitures\nThe Company has retained obligations from previously sold businesses that primarily include ongoing expenses for postretirement benefits, product liability, legal costs and asbestos-related activities of Aldrich. \nThe components of \nDiscontinued operations, net of tax \nfor the years ended December 31 were as follows:\nIn millions\n2024\n2023\n2022\nPre-tax earnings (loss) from discontinued operations\n(\n36.2\n)\n(\n34.7\n)\n(\n26.9\n)\nTax benefit (expense)\n11.5\n \n7.5\n \n5.4\n \nDiscontinued operations, net of tax\n$\n(\n24.7\n)\n$\n(\n27.2\n)\n$\n(\n21.5\n)\nFor the years ended December 31, 2024 and 2023, pre-tax earnings (loss) from discontinued operations included a charge of $\n19.9\n million and $\n20.2\n million, respectively, to support Aldrich's ongoing legal costs in accordance with the Company's Funding Agreement. Refer to Note 20, \"Commitments and Contingencies,\" for more information regarding the deconsolidation and asbestos-related matters.\nNOTE 18.  \nEARNINGS PER SHARE (EPS)\nBasic EPS is calculated by dividing\n Net earnings attributable to Trane Technologies plc\n by the weighted-average number of ordinary shares outstanding for the applicable period. Diluted EPS is calculated after adjusting the denominator of the basic EPS calculation for the effect of all potentially dilutive ordinary shares, which in the Company's case, includes shares issuable under share-based compensation plans. \nThe following table summarizes the weighted-average number of ordinary shares outstanding for basic and diluted earnings per share calculations:\nIn millions\n2024\n2023\n2022\nWeighted-average number of basic shares outstanding\n226.2\n \n228.6\n \n232.6\n \nShares issuable under incentive share plans\n2.2\n \n2.1\n \n2.3\n \nWeighted-average number of diluted shares outstanding\n228.4\n \n230.7\n \n234.9\n \nAnti-dilutive shares\n—\n \n0.4\n \n0.8\n \nDividends declared per ordinary share\n$\n3.36\n \n$\n3.00\n \n$\n2.68\n \nNOTE 19.  \nBUSINESS SEGMENT INFORMATION\nThe Company operates under three reportable segments designed to create deep customer focus and relevance in markets around the world. Intercompany sales between segments are immaterial.\n•\nThe Company's Americas segment innovates for customers in North America and Latin America. The Americas segment encompasses commercial heating, cooling and ventilation systems, building controls and solutions, and energy services and solutions; residential heating and cooling; and transport refrigeration systems and solutions.\n•\nThe Company's EMEA segment innovates for customers in the Europe, Middle East and Africa region. The EMEA segment encompasses heating, cooling and ventilation systems, services and solutions for commercial buildings, and transport refrigeration systems and solutions.\nF-40\nTable of Contents\n•\nThe Company's Asia Pacific segment innovates for customers throughout the Asia Pacific region. The Asia Pacific segment encompasses heating, cooling and ventilation systems, services and solutions for commercial buildings, and transport refrigeration systems and solutions.\nThe Company's chief operating decision maker (CODM), the Chief Executive Officer, uses two profitability measures, \nSegment Adjusted EBITDA\n and \nSegment Adjusted Operating Income\n, in assessing segment performance and deciding how to allocate resources:\n•\nSegment Adjusted EBITDA\n represents net earnings excluding interest expense, income taxes, depreciation and amortization, restructuring, non-cash adjustments for contingent consideration, merger and acquisition-related costs, unallocated corporate expenses, discontinued operations and other non-recurring transactions. Segment Adjusted EBITDA also provides a useful tool for assessing the operating performance and comparability between periods and our ability to generate cash because it excludes the impact of certain non-cash or non-recurring items that can vary significantly from period to period. Segment Adjusted EBITDA is used in the development of annual operating plans, including capital expenditure and operational budgets, and in measuring performance against targets for purposes of incentive compensation.\n•\nSegment Adjusted Operating Income\n represents operating income adjusted to exclude restructuring costs, merger and acquisition-related costs, non-cash adjustments for contingent consideration and other non-recurring items. Segment Adjusted Operating Income, and ratios based on it, are used to provide a comprehensive view of segment profitability and evaluate efficient returns on assets.\nSegment Adjusted EBITDA and Segment Adjusted Operating Income are not defined under GAAP and may not be comparable to similarly titled measures used by other companies and should not be considered a substitute for net earnings or other results reported in accordance with GAAP. Measures of total assets by reportable segment are not provided to the CODM. Therefore, asset information by segment is not disclosed.\nA summary of results by reportable segment for the years ended December 31 were as follows:\nIn millions\n2024\n2023\n2022\nAmericas\nSegment revenues\n$\n15,903.2\n \n$\n13,832.0\n \n$\n12,640.8\n \nSegment cost of goods sold\n(\n10,249.9\n)\n(\n9,262.4\n)\n(\n8,714.1\n)\nSegment selling and administrative expenses\n(\n2,614.2\n)\n(\n2,123.7\n)\n(\n1,857.7\n)\nSegment Adjusted Operating Income\n$\n3,039.1\n \n$\n2,445.9\n \n$\n2,069.0\n \nSegment depreciation and amortization\n299.8\n \n258.8\n \n256.8\n \nSegment other income/(expense), net\n(\n20.6\n)\n(\n35.1\n)\n0.5\n \nSegment Adjusted EBITDA\n$\n3,318.3\n \n$\n2,669.6\n \n$\n2,326.3\n \nEMEA\nSegment revenues\n$\n2,556.7\n \n$\n2,401.2\n \n$\n2,034.5\n \nSegment cost of goods sold\n(\n1,641.8\n)\n(\n1,584.4\n)\n(\n1,408.7\n)\nSegment selling and administrative expenses\n(\n442.1\n)\n(\n392.3\n)\n(\n315.5\n)\nSegment Adjusted Operating Income\n$\n472.8\n \n$\n424.5\n \n$\n310.3\n \nSegment depreciation and amortization\n43.5\n \n40.5\n \n28.8\n \nSegment other income/(expense), net\n(\n11.2\n)\n(\n0.3\n)\n(\n1.0\n)\nSegment Adjusted EBITDA\n$\n505.1\n \n$\n464.7\n \n$\n338.1\n \nAsia Pacific\nSegment revenues\n$\n1,378.3\n \n$\n1,444.4\n \n$\n1,316.4\n \nSegment cost of goods sold\n(\n843.2\n)\n(\n935.2\n)\n(\n886.9\n)\nSegment selling and administrative expenses\n(\n226.3\n)\n(\n208.4\n)\n(\n197.8\n)\nSegment Adjusted Operating Income\n$\n308.8\n \n$\n300.8\n \n$\n231.7\n \nSegment depreciation and amortization\n17.9\n \n18.3\n \n17.2\n \nSegment other income/(expense), net\n2.6\n \n2.2\n \n(\n0.6\n)\nSegment Adjusted EBITDA\n$\n329.3\n \n$\n321.3\n \n$\n248.3\n \nF-41\nTable of Contents\nIn millions\n2024\n2023\n2022\nReconciliation of Segment Adjusted EBITDA and Segment Adjusted Operating Income to earnings before income taxes\nTotal Segment Adjusted EBITDA\n$\n4,152.7\n \n$\n3,455.6\n \n$\n2,912.7\n \nTotal Segment depreciation and amortization\n(\n361.2\n)\n(\n317.6\n)\n(\n302.9\n)\nTotal Segment other income/(expense), net\n29.1\n \n33.2\n \n1.2\n \nTotal Segment Adjusted Operating Income\n3,820.6\n \n3,171.2\n \n2,611.0\n \nRestructuring costs\n(\n5.0\n)\n(\n15.1\n)\n(\n20.7\n)\nNon-cash adjustments for contingent consideration\n25.0\n \n49.3\n \n46.9\n \nInsurance settlements on property claims\n—\n \n10.0\n \n25.0\n \nAcquisition inventory step-up and backlog amortization\n—\n \n(\n18.5\n)\n(\n1.2\n)\nUnallocated corporate expenses\n(\n340.5\n)\n(\n302.9\n)\n(\n242.1\n)\nInterest expense\n(\n238.4\n)\n(\n234.5\n)\n(\n223.5\n)\nOther income/(expense), net\n(\n19.9\n)\n(\n92.2\n)\n(\n23.3\n)\nEarnings before income taxes\n$\n3,241.8\n \n$\n2,567.3\n \n$\n2,172.1\n \nCapital Expenditures\nAmericas\n$\n244.7\n \n$\n217.2\n \n$\n230.5\n \nEMEA\n36.6\n \n31.9\n \n25.9\n \nAsia Pacific\n16.1\n \n14.3\n \n11.2\n \nCapital expenditures from reportable segments\n$\n297.4\n \n$\n263.4\n \n$\n267.6\n \nCorporate capital expenditures\n73.2\n \n37.3\n \n24.2\n \nTotal capital expenditures\n$\n370.6\n \n$\n300.7\n \n$\n291.8\n \nAt December 31, a summary of long-lived assets by geographic area were as follows:\nIn millions\n2024\n2023\nUnited States\n$\n1,936.0\n \n$\n1,618.6\n \nNon-U.S.\n691.1\n \n666.7\n \nTotal\n$\n2,627.1\n \n$\n2,285.3\n \nNOTE 20.  \nCOMMITMENTS AND CONTINGENCIES\nThe Company is involved in various litigation, claims and administrative proceedings, including those related to the bankruptcy proceedings for Aldrich Pump LLC (Aldrich) and Murray Boiler LLC (Murray) and environmental and product liability matters. The Company records accruals for loss contingencies when it is both probable that a liability will be incurred and the amount of the loss can be reasonably estimated. Amounts recorded for identified contingent liabilities are estimates, which are reviewed periodically and adjusted to reflect additional information when it becomes available. Subject to the uncertainties inherent in estimating future costs for contingent liabilities, except as expressly set forth in this note, management believes that any liability which may result from these legal matters would not have a material adverse effect on the financial condition, results of operations, liquidity or cash flows of the Company.\nAsbestos-Related Matters\nCertain indirect wholly-owned subsidiaries and former companies of the Company have been named as defendants in asbestos-related lawsuits in state and federal courts. In virtually all of the suits, a large number of other companies have also been named as defendants. The vast majority of those claims were filed against predecessors of Aldrich and Murray and generally allege injury caused by exposure to asbestos contained in certain historical products sold by predecessors of Aldrich or Murray, primarily pumps, boilers and railroad brake shoes. None of the Company's existing or previously-owned businesses were a producer or manufacturer of asbestos.\nOn June 18, 2020, Aldrich and Murray filed voluntary petitions for relief under Chapter 11 of the Bankruptcy Code to resolve equitably and permanently all current and future asbestos related claims in a manner beneficial to claimants and to Aldrich and Murray. As a result of the Chapter 11 filings, all asbestos-related lawsuits against Aldrich and Murray have been stayed due to the imposition of a statutory automatic stay applicable in Chapter 11 bankruptcy cases. In addition, at the request of Aldrich and Murray, the Bankruptcy Court has entered an order temporarily staying all asbestos-related claims against the Trane Companies that relate to claims against Aldrich or Murray (except for asbestos-related claims for which the exclusive remedy is provided \nF-42\nTable of Contents\nunder workers' compensation statutes or similar laws). On August 23, 2021, the Bankruptcy Court entered its findings of facts and conclusions of law and order declaring that the automatic stay applies to certain asbestos related claims against the Trane Companies and enjoining such actions. As a result, all asbestos-related lawsuits against Aldrich, Murray and the Trane Companies remain stayed.\nThe goal of these Chapter 11 filings is to resolve equitably and permanently all current and future asbestos-related claims in a manner beneficial to claimants and to Aldrich and Murray through court approval of a plan of reorganization that would create a trust pursuant to section 524(g) of the Bankruptcy Code, establish claims resolution procedures for all current and future asbestos-related claims against Aldrich and Murray and channel such claims to the trust for resolution in accordance with those procedures. Aldrich and Murray intend to seek an agreement with representatives of the asbestos claimants on the terms of a plan for the establishment of such a trust.\nPrior to the Petition Date, predecessors of each of Aldrich and Murray had been litigating asbestos-related claims brought against them. No such claims have been paid since the Petition Date, and it is not contemplated that any such claims will be paid until the end of the Chapter 11 cases.\nFrom an accounting perspective, the Company no longer has control over Aldrich and Murray as of the Petition Date as their activities are subject to review and oversight by the Bankruptcy Court. Therefore, Aldrich and its wholly-owned subsidiary 200 Park and Murray and its wholly-owned subsidiary ClimateLabs were deconsolidated as of the Petition Date and their respective assets and liabilities were derecognized from the Company's Consolidated Financial Statements. Amounts derecognized in 2020 primarily related to the legacy asbestos-related liabilities and asbestos-related insurance recoveries and $\n41.7\n million of cash.\nUpon deconsolidation in 2020, the Company recorded its retained interest in Aldrich and Murray at fair value within \nOther noncurrent assets \nin the Consolidated Balance Sheets. In determining the fair value of its equity investment, the Company used a market-adjusted multiple of earnings valuation technique. As a result, the Company recorded an aggregate equity investment of $\n53.6\n million as of the Petition Date.\nSimultaneously, the Company recognized a liability of $\n248.8\n million within \nOther noncurrent liabilities\n in the Consolidated Balance Sheets related to its obligation under the Funding Agreements. The liability was based on asbestos-related liabilities and insurance-related assets balances previously recorded by the Company prior to the Petition Date.\nAs a result of the deconsolidation, the Company recognized an aggregate loss of $\n24.9\n million in its Consolidated Statements of Earnings during the year ended December 31, 2020. A gain of $\n0.9\n million related to Murray and its wholly-owned subsidiary ClimateLabs was recorded within \nOther income/ (expense), net\n and a loss of $\n25.8\n million related to Aldrich and its wholly-owned subsidiary 200 Park was recorded within \nDiscontinued operations, net of tax\n. Additionally, the deconsolidation resulted in an investing cash outflow of $\n41.7\n million in the Company's Consolidated Statements of Cash Flows, of which $\n10.8\n million was recorded within continuing operations during the year ended December 31, 2020.\nOn August 26, 2021, the Company announced that Aldrich and Murray reached an agreement in principle with the court-appointed legal representative of future asbestos claimants (the FCR) in the bankruptcy proceedings. The agreement in principle includes the key terms for the permanent resolution of all current and future asbestos claims against Aldrich and Murray pursuant to a plan of reorganization (the Plan). Under the agreed terms, the Plan would create a trust pursuant to section 524(g) of the Bankruptcy Code and establish claims resolution procedures for all current and future claims against Aldrich and Murray (Asbestos Claims). On the effective date of the Plan, Aldrich and Murray would fund the trust with $\n545.0\n million, comprised of $\n540.0\n million in cash and a promissory note to be issued by Aldrich and Murray to the trust in the principal amount of $\n5.0\n million, and the Asbestos Claims would be channeled to the trust for resolution in accordance with the claims resolution procedures. Following the effective date of the Plan, Aldrich and Murray would have no further obligations with respect to the Asbestos Claims. The FCR has agreed to support such Plan. The agreement in principle with the FCR is subject to final documentation and is conditioned on arrangements acceptable to Aldrich and Murray with respect to their asbestos insurance assets. It is currently contemplated that the asbestos insurance assets of Aldrich and Murray would be contributed to the trust, and that, in consideration of their cash contribution to the trust, Aldrich and Murray would have the exclusive right to pursue, collect and retain all insurance reimbursements available in connection with the resolution of Asbestos Claims by the trust. The committee representing current asbestos claimants (the ACC) is not a party to the agreement in principle. Any settlement and its implementation in a plan of reorganization is subject to the approval of the Bankruptcy Court, and there can be no assurance that the Bankruptcy Court will approve the agreement on the terms proposed.\nOn September 24, 2021, Aldrich and Murray filed the Plan with the Bankruptcy Court. The Plan is supported by, and reflects the agreement in principle reached with the FCR. On the same date, in connection with the Plan, Aldrich and Murray filed a motion with the Bankruptcy Court to create a $\n270.0\n million trust intended to constitute a \"qualified settlement fund\" within the meaning of the Treasury Regulations under Section 468B of the Internal Revenue Code (QSF). The funds held in the QSF would be available to provide funding for the Section 524(g) Trust upon effectiveness of the Plan.\nF-43\nTable of Contents\nDuring the year ended December 31, 2021, in connection with the agreement in principle reached by Aldrich and Murray with the FCR and the motion to create a $\n270.0\n million QSF, the Company recorded a charge of $\n21.2\n million to increase its Funding Agreement liability to $\n270.0\n million. The corresponding charge was bifurcated between \nOther income/ (expense), net \nof\n \n$\n7.2\n million relating to Murray and discontinued operations of $\n14.0\n million relating to Aldrich.\nOn January 27, 2022, the Bankruptcy Court granted the request to fund the QSF, which was funded on March 2, 2022, resulting in an operating cash outflow of $\n270.0\n million reported in the Company's Consolidated Statements of Cash Flows, of which $\n91.8\n million was allocated to continuing operations and $\n178.2\n million was allocated to discontinued operations for the year ended December 31, 2022. On April 18, 2022, the Bankruptcy Court entered an order granting Aldrich and Murray's request to seek to estimate their aggregate liability for all current and future asbestos-related personal injury claims. Aldrich and Murray are pursuing discovery and related matters in connection with the estimation proceedings.\nOn October 18, 2021, the ACC filed a motion seeking standing to pursue and investigate on behalf of the bankruptcy estates of Aldrich and Murray, claims arising from or related to the 2020 Corporate Restructuring. Also on October 18, 2021, the ACC filed a complaint seeking to substantively consolidate the bankruptcy estates of Aldrich and Murray with certain of the Company's subsidiaries. On December 20, 2021, Aldrich, Murray and certain of the Company's subsidiaries filed motions to dismiss the ACC's substantive consolidation complaint. On April 14, 2022, the Bankruptcy Court granted the ACC's standing motion and denied the motions to dismiss the substantive consolidation complaint. On June 18, 2022, the ACC filed complaints against the Company and other related parties asserting various claims and causes of action arising from or related to the 2020 Corporate Restructuring. The Company is vigorously opposing and defending against these claims.\nOn April 6, 2023, certain individual claimants filed a motion to dismiss the Chapter 11 cases (Claimant Motion to Dismiss). Subsequently, on May 15, 2023, the ACC filed its own motion to dismiss the Chapter 11 cases (ACC Motion to Dismiss, and, together with the Claimant Motion to Dismiss, the Motions to Dismiss). Aldrich, Murray and the FCR filed responses in opposition to the Motions to Dismiss, and the Company filed papers joining in Aldrich and Murray's opposition. A hearing on the Motions to Dismiss was held on July 14, 2023. On December 28, 2023, the Bankruptcy Court entered an order denying the Motions to Dismiss. On January 11, 2024, the ACC and the individual claimants filed motions with the United States District Court for the District of North Carolina (the District Court) seeking leave to appeal the order denying the Motions to Dismiss and to certify the appeals directly to the Court of Appeals for the Fourth Circuit. At a hearing on February 9, 2024, the Bankruptcy Court granted the motions to certify direct appeals to the Fourth Circuit. On April 17, 2024, the Fourth Circuit entered an order denying the petitions for direct appeal. On May 1, 2024, the ACC and the individual claimants filed petitions with the Fourth Circuit seeking rehearing \nen banc. \nAldrich and Murray opposed the petitions and the Fourth Circuit denied the petitions by order dated May 15, 2024. On May 28, 2024, Aldrich and Murray filed their response with the District Court in opposition to the Motions for Leave to Appeal. The FCR filed its response to the Motions for Leave to Appeal on May 29, 2024. \nOn January 23, 2023, an individual claimant filed a motion to lift the automatic order to pursue its asbestos suit against Aldrich and Murray notwithstanding the Chapter 11 cases (the Stay Relief Motion).  Aldrich and Murray, the FCR, and certain non-debtor affiliates each opposed the Stay Relief Motion.  The Bankruptcy Court denied the Stay Relief Motion after holding a hearing on March 30, 2023.  The Bankruptcy Court entered an order memorializing its March oral ruling on November 13, 2024. The individual claimant filed a notice with the Bankruptcy Court appealing the order denying the Stay Relief Motion to the District Court on November 27, 2024.\nIt is not possible to predict how the District Court will rule on these pending motions, whether an appellate court will affirm or reverse the Bankruptcy Court orders denying the Motions to Dismiss and the Stay Relief Motion, whether the Bankruptcy Court will approve the terms of the Plan, what the extent of the asbestos liability will be or how long the Chapter 11 cases will last. The ACC and the individual claimants filed their replies in support of the Motions for Leave to Appeal on June 11, 2024. The Chapter 11 cases remain pending as of February 6, 2025.\nFurthermore, in connection with the 2020 Corporate Restructuring, Aldrich, Murray and their respective subsidiaries entered into several agreements with subsidiaries of the Company to ensure they each have access to services necessary for the effective operation of their respective businesses and access to capital to address any liquidity needs that arise as a result of working capital requirements or timing issues. In addition, the Company regularly transacts business with Aldrich and its wholly-owned subsidiary 200 Park and Murray and its wholly-owned subsidiary ClimateLabs. As of the Petition Date, these entities are considered related parties and post deconsolidation activity between the Company and them are reported as third party transactions and are reflected within the Company's Consolidated Statements of Earnings. Since the Petition Date, there were no material transactions between the Company and these entities other than as described above.\nF-44\nTable of Contents\nEnvironmental Matters\nThe Company continues to be dedicated to environmental and sustainability programs to minimize the use of natural resources, reduce the utilization and generation of hazardous materials from our manufacturing processes and remediate identified environmental concerns. As to the latter, the Company is currently engaged in site investigations and remediation activities to address environmental cleanup from past operations at current and former manufacturing facilities.\nIt is the Company's policy to establish environmental reserves for investigation and remediation activities when it is probable that a liability has been incurred and a reasonable estimate of the liability can be made. Estimated liabilities are determined based upon existing remediation laws and technologies. Inherent uncertainties exist in such evaluations due to unknown environmental conditions, changes in government laws and regulations, and changes in cleanup technologies. The environmental reserves are updated on a routine basis as remediation efforts progress and new information becomes available.\nThe Company is sometimes a party to environmental lawsuits and claims and has received notices of potential violations of environmental laws and regulations from the Environmental Protection Agency and similar state and international authorities. It has also been identified as a potentially responsible party (PRP) for cleanup costs associated with off-site waste disposal at federal Superfund and state remediation sites. In most instances at multi-party sites, the Company's share of the liability is not material.\nIn estimating its liability at multi-party sites, the Company has assumed it will not bear the entire cost of remediation of any site to the exclusion of other PRPs who may be jointly and severally liable. The ability of other PRPs to participate has been taken into account, based on the Company's understanding of the parties' financial condition and probable contributions on a per site basis.\nReserves for environmental matters are classified as \nAccrued expenses and other current liabilities\n or \nOther noncurrent liabilities\n based on their expected term. As of December 31, 2024 and 2023, the Company has recorded reserves for environmental matters of $\n52.4\n million and $\n47.5\n million, respectively. Of these amounts, $\n40.3\n million and $\n38.9\n million, respectively, relate to investigation and remediation of properties and multi-waste disposal sites related to businesses formerly owned by the Company.\nWarranty Liability\nStandard product warranty accruals are recorded at the time of sale and are estimated based upon product warranty terms and historical experience. The Company assesses the adequacy of its liabilities and will make adjustments as necessary based on known or anticipated warranty claims, or as new information becomes available.\nThe changes in the standard product warranty liability for the years ended December 31, were as follows:\nIn millions\n2024\n2023\nBalance at beginning of period\n$\n373.9\n \n$\n323.6\n \nReductions for payments\n(\n182.3\n)\n(\n146.5\n)\nAccruals for warranties issued during the current period\n229.9\n \n187.0\n \nChanges to accruals related to preexisting warranties\n(\n3.9\n)\n9.1\n \nTranslation\n(\n3.0\n)\n0.7\n \nBalance at end of period\n$\n414.6\n \n$\n373.9\n \nStandard product warranty liabilities are classified as\n Accrued expenses and other current liabilities \nor \nOther noncurrent liabilities\n based on their expected term. The Company's total current standard product warranty reserve at December 31, 2024 and December 31, 2023 was $\n185.3\n million and $\n157.6\n million, respectively.\nF-45\nTable of Contents\nWarranty Deferred Revenue\nThe Company's extended warranty liability represents the deferred revenue associated with its extended warranty contracts and is amortized into \nNet revenues\n on a straight-line basis over the life of the contract, unless another method is more representative of the costs incurred. The Company assesses the adequacy of its liability by evaluating the expected costs under its existing contracts to ensure these expected costs do not exceed the extended warranty liability.\nThe changes in the extended warranty liability for the years ended December 31, were as follows:\nIn millions\n2024\n2023\nBalance at beginning of period\n$\n349.4\n \n$\n317.7\n \nAmortization of deferred revenue for the period\n(\n134.6\n)\n(\n118.6\n)\nAdditions for extended warranties issued during the period\n194.6\n \n148.6\n \nChanges to accruals related to preexisting warranties\n3.0\n \n0.9\n \nTranslation\n(\n2.0\n)\n0.8\n \nBalance at end of period\n$\n410.4\n \n$\n349.4\n \nThe extended warranty liability is classified as \nAccrued expenses and other current liabilities\n or \nOther noncurrent liabilities\n based on the timing of when the deferred revenue is expected to be amortized into \nNet revenues\n. The Company's total current extended warranty liability at December 31, 2024 and December 31, 2023 was $\n143.5\n million and $\n123.8\n million, respectively. For the years ended December 31, 2024, 2023 and 2022, the Company incurred costs of $\n68.7\n million, $\n54.3\n million and $\n54.8\n million, respectively, related to extended warranties.\nNOTE 21.  SUBSEQUENT EVENTS\nThe Company completed the acquisition of two businesses in January 2025. One acquisition is a Commercial HVAC distributor with sales and service business in Belgium and Luxembourg. The results of the acquisition will be reported within the EMEA segment. The second acquisition is a building management platform for HVAC optimization, using advanced artificial intelligence technologies. The results of the acquisition will be reported within the Americas segment. The results of the acquisitions will be included in our consolidated financial statements as of the date of the acquisitions. \nF-46"
  }
}