{
  "ticker": "TTD",
  "cik": "0001671933",
  "company_name": "Trade Desk, Inc.",
  "filing_date": "2025-02-21",
  "accession": "0001671933-25-000029",
  "primary_doc": "ttd-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business\nOverview\nThe Trade Desk, Inc. (the “Company,” “we,” “our,” or “The Trade Desk”) offers a self-service, cloud-based ad-buying platform that empowers our clients to plan, manage, optimize and measure more expressive data-driven digital advertising campaigns. Our platform allows clients to execute integrated campaigns across ad formats and channels, including connected television (“CTV”) and other video, display, audio, and native, on a multitude of devices, such as televisions, streaming devices, mobile devices, computers and digital-out-of-home devices. Our platform’s integrations with major inventory, publisher and data partners provide ad buyers reach and decisioning capabilities, and our enterprise application programming interfaces (“APIs”) enable our clients to customize and expand platform functionality.\nOur clients are advertising agencies, advertisers and other service providers for agencies or advertisers, with whom we enter into ongoing master services agreements (“MSAs”). We generate revenue by charging our clients a platform fee generally based on a percentage of our clients’ total platform spend and from providing value-added services and data to support their advertising campaigns.\nThe Trade Desk was originally incorporated in 2009 and is a Nevada corporation. We are headquartered in Ventura, California.\nOur Industry\nWe believe that several trends in the advertising industry, happening in parallel, will result in programmatic advertising — the buying and selling of advertising inventory using algorithmic software that automates the process — being the predominant means by which companies reach consumers online and through connected devices.\nSome of the key industry trends are:\nMedia is Increasingly Digital.\n Media is increasingly digital as a result of advances in technology and changes in consumer behavior. This shift has enabled unprecedented options for advertisers to target and measure their advertising campaigns across nearly every media channel and connected device. The digital advertising market is a significant and growing part of the total advertising market. As media becomes increasingly digital, decisions based on consumer and behavioral data are more prevalent. \nFragmentation of Audience.\n As digital media grows, audience fragmentation is accelerating. A growing “long tail” of mobile applications, social media platforms, streaming services and websites presents a challenge for advertisers trying to reach a large audience. Additionally, the number of devices used by individual consumers has increased. Both of these fragmentation trends are opportunities for technology companies that can consolidate and simplify media buying options for advertisers and agencies.\nEmergence of CTV. \nWe are witnessing a generational shift from linear television to CTV as Internet and television programming converge. New technologies support seamless delivery of streaming video content, accelerating consumers’ demand to watch what they want, when they want and where they want. We believe that this increased demand for CTV will bring about new opportunities for content owners and advertisers to connect with consumers, including through ad-supported subscription models, and will further drive the shift towards data-driven advertising. \nIncreased Use of Data and Measurement.\n Advances in software and hardware, and the ubiquitous use of the Internet, have enabled the generation of user data at an unprecedented scale. Data vendors and other organizations are able to collect this user data across a wide range of Internet properties and connected devices, aggregate it and combine it with other data sources. This data is pseudonymized and made available within seconds based on specific parameters and attributes. Advertisers can integrate this targeting data with their own data or an agency’s proprietary data relating to client attributes, the advertisers’ own store locations and other related characteristics. Through the use of these types of data sources, together with measurement features, including real-time feedback on consumer reactions to the ads, programmatic advertising increases the value of impressions for advertisers and inventory owners, and viewers receive more relevant ads. At the same time, new laws, enforcement of existing laws, and self-regulatory rules regarding the collection, use, and disclosure of personal information continue to impact these practices.\n5\nTable of Contents\nAutomation of Ad Buying.\n The growing complexity of digital advertising and the laws and rules that govern it have increased the need for automation. Technology that enables fast, accurate and cost-effective decision making through the application of computer algorithms that use extensive data sets has become critical for the success of digital advertising campaigns. Using programmatic inventory buying tools, advertisers are able to automate their campaigns, providing them with better price discovery on an impression-by-impression basis. As a result, advertisers are able to bid on and purchase the advertising inventory they value the most, pay less for advertising inventory they do not value as much and abstain from buying advertising inventory that does not fit their campaign parameters. \nDigital Advertising Ecosystem\nThe digital advertising ecosystem is divided into buyers, sellers and marketplaces, which can be further segmented on the basis of whether participants provide services or technology. We believe that participants on the buy side or sell side should be advocates for their buyers or sellers, while those in the marketplace business should act as a referee or have market-driven incentives to protect or enhance the integrity of the marketplace. \nWhat We Do\nWe empower ad buyers by providing a self‑service cloud-based ad-buying platform that enables them to plan, manage, optimize and measure data‑driven digital advertising campaigns. Our platform allows clients to execute integrated campaigns across various advertising channels and formats, including CTV and other video, display, audio and native, on a multitude of devices, including televisions, streaming devices, mobile devices, computers and digital-out-of-home devices.\n•\nWe Are Focused on the Buy Side.\n We focus on buyers since they control the advertising budgets. The supply of digital advertising inventory exceeds demand, and accordingly, we believe it is a buyer’s market. We also believe that by aligning our core offerings with buyers, we are able to avoid conflicts of interest that exist when serving both the buy side and sell side. We provide and are developing additional offerings and features that work with publishers and supply-side partners to help ensure access to quality advertising inventory and to enable improved evaluation of such inventory and better decisioning capabilities for buyers of advertising. This focus allows us to build trust with clients, many of whom leverage their proprietary data on our platform. That trust and ability to use their own data on our platform, without worrying about it being used by other participants, enables our clients and their advertisers to achieve better results. This trust provides us with the benefit of long-term and stable relationships with our clients.\n•\nWe Are an Enabler, Not a Disruptor.\n Through our platform and related offerings, we enable advertisers, agencies and other service providers that participate in the digital advertising ecosystem. Advertisers are able to use our platform directly or through their agencies of choice.\n•\nWe Are Data Driven.\n Our platform was founded on the principle that data-driven decisions will be the future of advertising. We built a data-management platform first, before building our ad-buying technology. While data from third-party data providers improves campaign performance, our clients’ success often relies largely on our ability to ingest proprietary data directly from advertisers and agencies to enable intelligent decisioning that optimizes advertising campaigns. Given our independent buy-side focused approach and our strict protocols governing the ingestion of client first-party data into our data management platform, our clients trust us with their most granular and expressive data. Our technology platform enables effective use of such data, allowing our clients to run precisely targeted advertising campaigns that help maximize their return on advertising investments. Additionally, we are able to better optimize campaigns by using the data streams that we capture across different devices, so that data from one channel can be used to inform another (subject to appropriate consumer choices). The breadth of data that we make available on our data marketplace from numerous data sources across channels gives our clients a holistic view of their target audiences, enabling more effective targeting across different channels. Finally, the depth of data we make available, such as various types of retail data, including in-store purchase data, gives our clients the ability to engage in more precise attribution and closed-loop measurement.\n•\nWe Do Not Arbitrage Advertising Inventory.\n To further align our interests with those of our clients, we do not buy advertising inventory in order to resell it to our clients for a profit. Instead, we provide our clients with a platform that allows them to manage their omnichannel advertising campaigns, on a self-service basis with robust reporting. With our platform, our clients control their campaign spend and can access and choose from many inventory sources. \n6\nTable of Contents\n•\nWe Have Ongoing Relationships with Clients.\n We derive substantially all of our revenue from ongoing MSAs with our clients, rather than episodic insertion orders. We believe this approach strengthens our relationships with our clients and helps us grow their use of our platform over the long term, providing us with a highly scalable business model.\n•\nWe Are a Clear Box, Not a Black Box.\n Our platform is transparent and shows our clients their spend on advertising inventory, value-added services and data; the platform fee; and detailed performance metrics on their advertising campaigns. Our clients directly access and execute campaigns on our platform and control all facets of inventory purchasing decisions. Clients also receive detailed, real-time reporting on all their advertising campaigns. By providing transparent information on our platform, we enable our clients to continually compare results and target their budgets toward the most effective advertising inventory, data providers and channels.\n•\nWe Are an Open Platform.\n Clients can customize and build their own features on top of our platform. For example, clients may use our APIs to design their own user interface, bulk manage advertising campaigns and link other systems, including ad servers or reporting tools. By using our APIs or by working with our engineering team, clients can invest their own resources to build their own proprietary tools for reporting, campaign strategy, custom algorithms, proprietary data use or other use cases. Our open platform approach enables our advertising agency and service provider clients to provide differentiated offerings to their clients, which we believe leads to long-term relationships and increased use of our platform. \nOur Platform\nAt the core of our platform is our bid-factor-based architecture that allows users to define desirable factors and the value associated with those factors. Based on these factors, our platform can compute the value of impressions in real time and bid only for optimal impressions. Because of the granularity of the bid factors, users of our platform can rapidly create billions of different bid permutations with only a few clicks. This expressiveness enables better targeting, pricing and campaign results.\nOur platform is powerful and user friendly:\n•\nEasy to Use, Open and Customizable.\n Our platform includes easy-to-use tools and interfaces that help our users focus on managing the key elements of their campaigns. Our platform also enables clients to integrate custom features and interfaces for their own use through our APIs.\n•\nExpressiveness.\n Our platform allows clients to easily define and manage advertising campaigns with multiple targeting parameters that could result in quadrillions of permutations, which we refer to as expressiveness. We believe that expressiveness provides clients with the ability to target audiences with an extremely high level of precision and thus obtain higher returns on their advertising spend.\n•\nIntegrated, Omnichannel and Cross Device.\n Our platform provides integrated access to a wide range of omnichannel inventory and data sources, as well as third-party services such as ad servers, ad-verification services and survey vendors. Our platform’s integration of these sources and services enables our clients to deploy their budgets through a wide variety of channels, device types and formats, targeted in their desired manner, all through a single platform.\nSome of the key features of our platform are:\n•\nAuto Optimization.\n We provide auto-optimization features that allow buyers to automate their campaigns and support them with computer-generated modeling and decision making. In addition, by giving clients full reporting, budgeting and bidding transparency, clients can take control of targeting variables when desired, and apply algorithmic automation when appropriate.\n•\nAdvanced Reporting and Analytics Tools.\n We provide a comprehensive view of consumers’ interactions with the ads purchased through our platform with robust reporting of performance insights across multiple variables, such as audience characteristics, ad format, site category, website, device, creative type and geography. Better reporting results in better learning, enabling better campaign optimization and outcomes.\n•\nData Management and Measurement Tools.\n Our platform enables clients to optimize campaigns with numerous highly relevant data sets, including from an extensive selection of third-party vendors, in a \n7\nTable of Contents\nseamless and easy manner. We also empower our clients with an extensive set of measurement capabilities, both through a number of proprietary benchmarking tools and indices, and through integrations with a broad selection of third-party measurement partners.\n•\nArtificial Intelligence.\n Koa, our \npredictive algorithmic tool, utilizes artificial intelligence to process complex data sets and make recommendations for campaign optimizations. These recommendations help platform users make data-driven decisions without sacrificing control or transparency and empower users to choose which optimizations make the most sense for their campaigns. Koa’s artificial intelligence capabilities are used across various aspects of the platform, including predictive clearing, ad impression relevance scoring, measurement and forecasting, budget optimization and key performance indicator scoring.\n•\nInformed Media Planning. \nOur platform enables clients to use audience insights and strategic goals to help optimize campaign planning, with the ability\n to generate, analyze and launch data-driven, programmatic media plans. Our tools analyze the actions of existing core audiences with the data we see across the open Internet to deliver fully transparent, performance-focused and ready-to-activate campaigns.\n•\nPrivate Marketplace Support.\n For clients who wish to transact directly with individual publishers, we offer a comprehensive user interface for discovering and transacting via a wide variety of private contracts. Additionally, we offer a solution for advertisers to access publisher inventory via a direct tag in a publisher’s ad server where there is no other programmatic access to such publisher’s inventory.\nOur platform enables advertisers and agencies to:\n•\npurchase digital media programmatically on various media exchanges and sell-side platforms, as well as directly from publishers;\n•\nacquire and use third-party data to optimize and measure digital advertising campaigns;\n•\nintegrate and deploy their proprietary first-party data within our platform to optimize campaign efficacy;\n•\nmonitor and manage ongoing digital advertising campaigns on a real-time basis;\n•\nlink digital campaigns to offline sales results or other business objectives;\n•\naccess other services such as our data management platform and publisher management platform marketplace; and\n•\nuse our user interface and APIs to customize and expand platform functionality.\nOur Technology\nThe core elements of our technology are:\n•\nScalable Architecture.\n Our platform infrastructure is hosted in data centers around the world. Our core bidding architecture is easily adaptable to a variety of inventory formats, allowing our platform to communicate with many different inventory sources.\n•\nPredictive Models.\n We use campaign data captured by our platform to build predictive models around user characteristics, such as demographic, purchase intent or interest data. Data from our platform is continually fed back into these models, which enables them to improve over time as the use of our platform increases.\n•\nPerformance Optimization.\n During campaign execution, our optimization engine continually scores a variety of attributes of each impression, such as website, industry vertical or geography, for their likelihood to achieve campaign performance goals. Our bidding engine then shifts bids and budgets in real time to deliver optimal performance. Additionally, our platform enables clients to set multiple, simultaneous optimization goals for their advertising.\n•\nReal-time Analytics.\n Our platform continuously collects data regarding inventory availability. Real-time campaign delivery and spend totals are used to manage campaign budgets and goal caps, as well as campaign reporting. This data is fed back into our optimization engine to improve campaign performance and into machine-learning models for user demographic predictive modeling.\n8\nTable of Contents\nOur Growth Strategy\nThe key elements of our long-term growth strategy include:\n•\nIncrease Our Share of Existing Clients’ Digital Advertising Spend.\n Many advertisers are moving a greater percentage of their advertising budgets to programmatic channels. We believe that this shift will provide us with the opportunity to capture a larger share of the overall advertising spend by our existing clients. Additionally, we plan to promote additional services, data, and incentive plans to our clients, helping us grow our business.\n•\nGrow Our Client Base.\n We have extensive relationships with many advertising agencies, advertisers and other service providers, and we believe that, given the decentralized nature of the advertising industry, we have the opportunity to expand our relationships with new and existing clients. We expect to continue making investments to grow our sales and client service team to support this strategy.\n•\nExpand Our Omnichannel Capabilities.\n We believe offering clients capabilities across all media channels and devices enables advertisers to manage highly effective omnichannel campaigns, where data from each channel can inform decisions in other channels. We believe these capabilities will continue to further strengthen our relationships with our clients. We intend to continue investing in innovation across all channels, including the integration of new inventory sources within CTV and other video, display, audio and native. \n•\nExtend Our Reach in CTV.\n Television is the largest category of advertising spend, and we believe that the future of television is CTV, the streaming of media and video on demand through subscription and ad-supported streaming services. We plan to continue investing significant resources in technology, sales and support staff related to our CTV growth initiatives.\n•\nEnsure Access to Quality Inventory. \nOur continued success depends on our ability to secure increasing amounts of attractive, high-quality inventory on reasonable terms for our clients. As part of such efforts, we have developed and plan to continue to enhance OpenPath, our offering intended to give clients access to quality inventory through a simplified, direct connection to publishers, and we may develop additional features or offerings to help our clients evaluate the quality and cost of inventory. Because the amount, quality and cost of inventory available to us can change at any time, we intend to continue making investments to maintain and grow our available inventory and ensure its quality.\n•\nFurther Enhance Identity Solutions, Including Unified ID 2.0. \nWe continue to develop and enhance Unified ID 2.0, an open-source identity framework that operates by transforming email addresses or phone numbers into an advertising identifier (a “UID2”) that is designed to not directly identify the individual. Subject to appropriate guardrails, participants in Unified ID 2.0 can then use this UID2 in connection with our platform and other services, including ad buying and reporting. We have worked to cultivate industry-wide support and collaboration for the Unified ID 2.0 approach, and we intend to continue these efforts. EUID, a European-focused version of Unified ID 2.0, was released in a limited beta in 2023.\n•\nContinue to Innovate in Technology, Data and Measurement.\n We intend to continue innovating and improving the technology underlying our platform and enhancing its features and functionalities, including the development of new or improved value-added services or the inclusion of additional data. We view data and measurement as key competitive advantages, and we will continue to invest resources in growing and enhancing our data and measurement offerings.\n•\nExpand Our International Presence.\n Many of our clients serve advertisers on a global basis, and we intend to expand our presence outside of the United States to serve the needs of those advertisers in additional geographies. As we expand relationships with our existing clients, we are investing in select regions in Europe and Asia. In particular, we believe that the United Kingdom (“U.K.”), Germany, France, China, Japan, India and Australia may represent substantial growth opportunities, and we are investing in developing our business in those and other markets.\nOur Clients\nOur clients consist of purchasers of programmatic advertising inventory, value-added services and data. Our clients are advertising agencies, advertisers or groups within advertising agencies that have independent relationships with us, manage budgets independently of one another, are based in different jurisdictions and are served by unique Trade Desk teams. Many of these advertising agencies are owned by holding companies, where decision making is decentralized such \n9\nTable of Contents\nthat purchasing decisions are made, and relationships with advertisers are located, at the agency, local branch or division level. \nOur clients typically enter into MSAs with us that give users constant access to our platform. Our MSAs, some of which may include joint business plans and other incentive programs, do not contain any material commitments on behalf of clients to use our platform to purchase ad inventory, value-added services or data. Generally, these MSAs have one-year terms that renew automatically for additional one-year periods, unless earlier terminated, and are terminable at any time upon 60 days’ notice by either party.\nOur clients are loyal, as reflected by our client retention rate of over 95% in each of the last eleven years. In addition, our clients typically grow their use of our platform and related offerings over time.\nIf all of our individual client contractual relationships were aggregated at the holding company level, one holding company would have represented more than 10% of our gross billings in 2024 and 2023. We generally do not have contractual relationships with holding companies; rather, in most cases we enter into separate contracts and billing relationships with various of their individual agencies and account for those agencies as separate clients. \nOur Advertising Inventory and Data Suppliers\nWe believe that we are an important business partner for suppliers of programmatic advertising inventory and data as we represent one of the largest sources of buy-side demand within the digital advertising industry.\nWe obtain digital advertising inventory from over 220 directly integrated ad exchanges, publishers and supply-side platforms, providing us with access to a breadth of programmatic advertising inventory across televisions, streaming devices, mobile devices, computers and digital-out-of-home devices. \nWe believe that our data marketplace represents an important distribution channel for third-party data vendors. As of December 31, 2024, we have integrated our platform with more than 350 third-party data vendors whose products are available for purchase through our platform.\nSales and Marketing\nGiven our self-service business model, we focus on supporting, advising and training our clients to use our platform independently as soon as they are ready to transact. \nOnce a new client has access to our platform, they work closely with our client service teams, which onboard the new client and provide continuous support throughout the early campaigns. Typically, once a client has gained some initial experience, it will move to a fully self-service model and request support as needed.\nTo help train our clients, suppliers and other digital media participants, we have created an e-learning program called The Trade Desk Edge Academy. We believe that this initiative is an important component in our strategy of enabling rapid onboarding to our platform.\nOur marketing efforts are focused on increasing awareness for our brand, executing thought-leadership initiatives, supporting our sales team and generating new leads. We seek to accomplish these objectives by presenting at industry conferences, hosting client conferences, publishing white papers and research, engaging in public relations activities, expanding our social media presence and launching advertising campaigns.\nTechnology and Development\nRapid innovation is a core driver of our business success and our corporate culture. We prioritize and align our product roadmap with our clients’ needs, and we aim to refresh our platform weekly. Our development teams are intentionally lean and nimble in nature, providing for transparency and accountability.\nWe expect technology and development expense to increase as we continue to invest in the development of our platform and related offerings to support additional platform features and functionality, increase the number of advertising inventory and data suppliers and support anticipated increases in volume of advertising spend by our clients on our platform. We also intend to invest in technology to further automate our business processes. \n10\nTable of Contents\nSeasonality\nIn the advertising industry, companies commonly experience seasonal fluctuations in revenue. For example, many advertisers allocate the largest portion of their budgets to the fourth quarter of the calendar year in order to coincide with increased holiday purchasing. Historically, the fourth quarter of the year reflects our highest level of advertising activity and the first quarter reflects the lowest level of such activity. We expect our revenue to continue to fluctuate based on seasonal factors that affect the advertising industry as a whole.\nOur Competition\nOur industry is highly competitive and fragmented. We compete with other demand-side platform providers, some of which are smaller, privately held companies and others are divisions of large, well-established companies such as Google and Amazon. We believe that we compete primarily based on the performance, capabilities and transparency of our platform as well as our focus on the buy side. We believe we are differentiated from our competitors in the following areas:\n•\nwe are an independent technology company focused on serving advertising agencies, advertisers and others on the buy side of our industry;\n•\nour client relationships are based on MSAs as opposed to campaign-specific insertion orders;\n•\nour platform provides comprehensive access to a wide range of inventory types and third-party data vendors; \n•\nour platform allows clients to build proprietary advantages by integrating custom features and interfaces for their own use through our APIs; and\n•\nour technology provides highly expressive targeting.\nIn addition, we believe new entrants would find it difficult to gain direct access to inventory providers, given their limited scale and the costs that additional integrations impose on inventory providers.\nOur Human Capital\nWe believe our values of vision, agility, grit, openness, generosity and being full hearted are an important component of our success. Behind all our innovations are the talented people around the world who bring them to life. To continue to produce such innovations, we believe it is crucial that we continue to attract and retain top talent. We strive to make The Trade Desk a diverse and inclusive workplace, where our people feel they belong, with opportunities for our employees to grow and develop their careers, supported by strong compensation, benefits and health and wellness programs, and by programs that build connections between our employees and their communities. To ensure we live our values and our culture stays unique and strong, our board of directors and executive team has put significant focus on our human capital resources.\nAs of December 31, 2024, we had 3,522 full-time employees in 20 countries. Regionally, North America, Asia Pacific (“APAC”) and Europe, Middle East and Africa (“EMEA”) make up approximately 64%, 17% and 19% of our workforce, respectively.\nDiversity and Inclusion\nWe are committed to fostering a culture of inclusion and belonging in which all employees are empowered to bring their whole, authentic selves to work every day. At The Trade Desk, we believe in the people who work for us, and we prioritize diversity and inclusion as part of our investment in our people. Our goal is to create a culture where we value, respect and provide fair treatment and opportunities for all employees. Team members are encouraged to come to their managers with questions, feedback or concerns, and we conduct various internal surveys that gauge employee sentiment in areas like career development, culture, manager performance and inclusivity. Our leaders review the survey feedback, if applicable, and other concerns raised by team members and work with their teams to take action.\nWe demonstrate this commitment through a strategy of education, celebration, donations to the community, diversification of our talent and the creation of forums for internal dialogue and listening. As of December 31, 2024, our global leadership team is 68% male and 32% female. \n11\nTable of Contents\nTalent Development\nDespite our rapid growth, we still cherish our roots as a startup and our company culture of ownership. We empower employees to develop their skills and abilities by acting on great ideas regardless of their role or function, which translates into personal investment in building our organization. We work to provide an environment where talented individuals and teams can thrive in fulfilling careers.\nTo set our global team up for success, we define key competencies for roles that are aligned with our values and extend to all levels of leadership regardless of experience and role. We encourage everyone to create individual development plans leveraging competency frameworks tied into their chosen career path, outlining a specific plan and actions to increase proficiency or learn new skills. We seek to provide a wide range of learning and development opportunities in both individual and group settings with formal, social and experiential learning. \nCompensation and Benefits\nWe provide compensation and benefits programs to help meet the needs of our employees and reward their efforts and contributions. We seek fairness in total compensation with reference to external comparisons, internal comparisons and the relationship between management and non-management compensation. \nIn addition to salaries, we provide competitive compensation programs commensurate with our peers and industry. Such compensation and benefit programs may include bonuses, equity awards, 401(k) plans, healthcare and insurance benefits, health savings and flexible spending accounts, paid time off, family leave, family care resources, employee assistance programs and tuition assistance, among many others. Such programs and our overall compensation packages seek to facilitate retention of key personnel.\nHealth, Safety and Wellness\nThe success of our business is fundamentally connected to the well being of our people. Accordingly, we are committed to the health, safety and wellness of our employees. We provide our employees and their families with access to a variety of innovative, flexible and convenient health and wellness programs. We utilize a hybrid work model that includes both in-person work and working from home, which we determined was in the best interests of our employees. We continue to evolve our programs to meet our employees’ health and wellness needs. \nDevelopment of International Markets\nWe have been increasing our focus on markets outside the United States to serve the global needs of our clients. We believe that the global opportunity for programmatic advertising is significant and will continue to expand as publishers and advertisers outside the United States seek to adopt the benefits that programmatic advertising provides. To capitalize on this opportunity, we intend to continue investing in our presence internationally. Our growth and the success of our initiatives in newer markets will depend on the continued adoption of our platform by our existing clients, as well as new clients, in these markets. Information about our geographic gross billings is set forth in \nNote 12—Segment and Geographic Information\n of “\nItem 8. Financial Statements and Supplementary Data\n” in this Annual Report on Form 10-K.\nIntellectual Property\nThe protection of our technology and intellectual property is an important component of our success. We rely on intellectual property laws, including trade secret, copyright, patent and trademark laws in the United States and abroad, and use contracts, confidentiality procedures, non-disclosure agreements, employee disclosure and invention assignment agreements and other contractual rights to protect our intellectual property. We have a small number of patents; however, historically, we have not patented our proprietary technology in order to keep our technology architecture, trade secrets and engineering roadmap private. Our patent applications may not result in the issuance of any patents, and our issued patents may not actually provide adequate defensive protection or competitive advantages to us.\nCollection and Use of Data; Privacy and Data Protection Legislation and Regulation\nTo power our platform, we and our clients currently use pseudonymous data about Internet and mobile app users to manage and execute digital advertising campaigns in a variety of ways, including delivering advertisements to end users based on information such as their geographic locations, the type of device they are using, their interests as inferred from their web browsing or app usage activity or their relationships with our clients. Such data is passed to us from third parties, \n12\nTable of Contents\nincluding original equipment manufacturers, application providers, data providers and publishers, as well as our advertiser clients. We do not use this data to discover the identity of individuals, and we currently contractually prohibit clients, data providers and inventory suppliers from importing data that directly identifies individuals onto our ad buying platform. In connection with certain offerings, including Unified ID 2.0 and EUID, we do allow users of those services to disclose some directly identifying information, such as phone number and email address, to us for purposes of transforming that information into pseudonymous identifiers to use on our platform. We also take in email addresses and phone numbers to operationalize the opt-out portal we offer in connection with Unified ID 2.0 and EUID, as well as in connection with a single-sign on tool we offer to publishers, known as OpenPass.\nOur ability, and the ability of other advertising technology companies, to collect, augment, analyze, use and share data relies upon the ability to uniquely identify devices across websites and applications, and to collect data about user interactions with those devices for purposes such as serving relevant ads and measuring the effectiveness of ads. The processes used to identify devices and similar and associated technologies are governed by U.S. and foreign laws and regulations and are dependent upon their implementation within the industry ecosystem. Such laws, regulations, and industry standards change frequently, including those relating to the level of consumer notice, consent and/or choice required when a company uses data for certain purposes, including targeted advertising, or employs cookies or other electronic tools to collect data about interactions with users online. \nIn the United States, both federal and state legislation govern activities such as the collection and use of personal data, and data privacy in the advertising technology industry has frequently been subject to review by the Federal Trade Commission (the “FTC”), U.S. Congress, and individual states. Relying on Section 5 of the FTC Act, which prohibits companies from engaging in “unfair” or “deceptive” trade practices, the FTC actively pursues alleged violations of representations concerning privacy protections and acts that allegedly violate individuals’ privacy interests. In addition, increasing consumer concern over data privacy in recent years has led to a myriad of enacted and proposed legislation and regulation both at the federal and state levels, some of which has affected and will continue to affect our operations and those of clients, inventory sources and other industry partners. \nMany states have adopted omnibus consumer privacy laws, a number of which are already enforceable, while others will take effect over the coming years. Other states are considering similar legislation. These state laws define “personal information” broadly enough to include many online identifiers provided by individuals’ devices, applications, and protocols (such as IP addresses, mobile application identifiers and unique cookie identifiers), individuals’ location data and hashed versions of email addresses and phone numbers. In many respects, these state laws focus significantly on advertising activities, mandating that businesses that engage in certain advertising uses of consumer personal information to offer and honor an opt-out of such activities, including, in some states, through browser or device-based preference signals. (Terminology varies slightly among some of the state laws, referring to such practices as “processing for targeted advertising” or “sales” or “sharing” of personal information, but the opt-out requirement exists under each state’s law.) These state privacy laws also provide consumers other rights, such as to access, correct or delete their personal information (subject to certain limitations), opt out of certain processing of their personal information and impose special rules on the collection of data from minors, as well as transparency and data governance obligations. Importantly, as a consequence of the obligations under these laws, the availability of data within our platform, our related offerings and the advertising ecosystem more broadly may decline, potentially making our platform and services less valuable to our clients.\nThe requirement under certain states’ laws to honor users’ requests to opt out of certain disclosures and uses of data for advertising purposes through preference signals, such as the Global Privacy Control (“GPC”) or similar signals, reflects a broader attention that privacy advocates, the media and some government regulators, have devoted to digital advertising in recent years. If the use of the GPC or similar technical signals is adopted by many Internet users, is imposed by additional states or by federal or foreign legislation, or is agreed upon by standard setting groups, we may have to change our business practices, our clients may reduce their use of our platform and services, and our business could be harmed. \nAs our business is global, our activities are also subject to foreign legislation and regulation. In Europe, including the U.K. and the European Union (the “EU”) and the European Economic Area (the “EEA”) and the countries of Iceland, Liechtenstein and Norway, separate laws and regulations (and member states’ implementations thereof) govern the processing of personal data, and these laws and regulations continue to impact us. The General Data Protection Regulation (“EU GDPR”) and the United Kingdom General Data Protection Regulation and Data Protection Act 2018 (the “UK GDPR”) (the EU GDPR and UK GDPR are hereinafter referred to collectively as the GDPR), which apply to us, define “personal data” broadly. Together with related laws, such as the ePrivacy Directive, we and our clients and inventory partners face enhanced data protection obligations, both as controllers of such data and as service providers processing the \n13\nTable of Contents\ndata. These laws also provide certain rights, such as access and deletion, to the individuals about whom the personal data relates, and require consent for certain activities. IAB Europe previously collaborated with the digital advertising industry to create a user-facing framework (the Transparency and Control Framework, or “TCF”) for establishing and managing legal bases under the GDPR and other U.K. and EU privacy laws including the ePrivacy Directive (discussed below). Although the TCF is actively in use, its viability as a compliance mechanism is under review by the European authorities and we cannot predict its effectiveness over the long term (as further detailed in the Risk Factors section). Maintaining compliance with the requirements of European privacy laws and regulations, including monitoring and adjusting to rulings and interpretations that affect our approach to compliance, requires significant time, resources and expense, and may lead to significant changes in our business operations, as will the effort to monitor whether additional changes to our business practices and our backend configuration are needed, all of which may increase operating costs, or limit our ability to operate or expand our business.\nAdditionally, in the EU, the EU Directive 2002/58/EC (as amended by Directive 2009/136/EC), commonly referred to as the ePrivacy or Cookie Directive, directs EU member states to ensure that accessing information on an Internet user’s computer, such as through a cookie and other similar technologies, is allowed only if the Internet user has been informed about such access, and provided consent. A replacement for the ePrivacy Directive is currently under discussion by EU member states to complement and bring electronic communication services in line with the EU GDPR and force a harmonized approach across EU member states. Although it remains under debate, the proposed ePrivacy Regulation may further raise the bar for the use of cookies, and the fines and penalties for breach may be significant. We cannot yet determine the impact such future laws, regulations and standards may have on our business.\nTo address the transfer of personal data from the EEA, Switzerland and U.K. to the United States, we rely upon, and are currently certified under, the EU-U.S. and Swiss-U.S. Data Privacy Frameworks (“DPF”) and the U.K. Extension to the EU-U.S. DPF. The European Commission adopted an adequacy decision for the DPF in July 2023, replacing the prior Privacy Shield Framework, as an adequate mechanism by which EU companies may pass personal data to the United States However, the DPF is already subject to legal challenge in Europe. Whether and how other European mechanisms for adequate data transfer, such as standard contractual clauses, can be used to transfer personal data to the United States remains in question. If all or some jurisdictions within the EU or the U.K. determine that the latest standard contractual clauses cannot be used to transfer personal data to the United States and if the DPF is ultimately struck down in a manner similar to the Privacy Shield Framework, then, we could be left with no reasonable option for the lawful cross-border transfer of personal data. In such circumstance, continuing to transfer personal data from the EU to the United States could lead to governmental enforcement actions, litigation, fines and penalties or adverse publicity. Such consequences could have an adverse effect on our reputation and business, such as by requiring us to establish systems to maintain certain data in the EU, which may involve substantial expense and cause us to divert resources from other aspects of our operations, all of which may harm our business. Other jurisdictions have adopted or are considering cross-border or data residency restrictions, which could reduce the amount of data we can collect or process and, as a result, significantly impact our business.\nIn addition, the online advertising ecosystem is subject to best practices and self-regulatory standards, such as those promulgated by the Network Advertising Initiative, or NAI, the Digital Advertising Alliance, or DAA, and their international counterparts.\nAvailable Information\nWe file Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, proxy statements and related amendments, exhibits and other information with the SEC. You may access and read our filings without charge through the SEC’s website at www.sec.gov or through our website at http://investors.thetradedesk.com, as soon as reasonably practicable after such materials are electronically filed with or furnished to the SEC pursuant to Section 13(a) or 15(d) of the Exchange Act.\nWebsite addresses referred to in this Annual Report on Form 10-K are not intended to function as hyperlinks, and the information contained on our website is not incorporated into, and does not form a part of this Annual Report on Form 10-K or any other report or documents we file with or furnish to the SEC.",
    "item1a": "Item 1A. Risk Factors\n” for a discussion of various risks related to cybersecurity.\nGovernance\nOur board of directors has delegated oversight of all risk assessment and risk management activities to the audit committee. The audit committee provides strategic oversight of management’s risk management practices, including cybersecurity.\n \nRegular and ad hoc reporting from management, such as the executive risk committee (as described below), to the audit committee may include information about the prevention, detection, mitigation and remediation of material cybersecurity incidents, if any.\n \nOur executive risk committee, which is comprised of our Chief Financial Officer, Chief Legal Officer and Senior Vice President, Engineering Operations, oversees the cybersecurity risk assessment and mitigation activities and receives regular reports from our cybersecurity team regarding the nature, timing and extent of incidents that occur across the Company’s internal environments and those disclosed by \nthird-party service providers\n, if applicable.\n Our cybersecurity team is comprised of technically skilled professionals with computer science, cybersecurity assurance or other cybersecurity degrees and professional experience in monitoring, detecting, mitigating and preventing cybersecurity incidents and testing cybersecurity processes. The executive risk committee has expertise in the pertinent financial, legal, regulatory, operational and technical areas to assess the impact of cybersecurity risks and incidents across the business and oversee our response to and disclosure of such incidents. In particular, our Senior Vice President, Engineering Operations brings decades of technical experience to our executive risk committee along with technical education in computer engineering.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity\nRisk Management and Strategy\nManagement has implemented a program to protect the confidentiality, integrity and availability of our information systems and to identify, assess, manage and report on material risks from cybersecurity threats. The program is \n39\nTable of Contents\nmanaged by an in-house cybersecurity team, and the program includes risk management and mitigation processes, such as malware protection, access management, technical vulnerability management and security incident response among other processes and technical safeguards; communication with third-party providers of services regarding their information security practices and disclosed cybersecurity incidents; \nthe use of third-party service providers, as appropriate, for monitoring and mitigating cybersecurity threats and conducting penetration tests\n; education and training across the organization to mitigate cybersecurity threats to employees and our company; the maintenance of cybersecurity breach insurance; and disaster recovery and business continuity arrangements to minimize the potential impact to our operations in the event of a cybersecurity incident.\nThe cybersecurity program is aligned with our enterprise risk framework.\n Members of our cybersecurity, enterprise risk management, engineering, finance and legal teams collaboratively assess the degree of risk to our business and operations from cybersecurity threats and incidents to develop incident response plans and risk mitigation practices. Risk is assessed across the potential technological, operational, financial, legal, regulatory and reputational impacts to our company, including the materiality of cybersecurity incidents pursuant to SEC disclosure rules.\n \nAlthough we follow guidance from various standards related to cybersecurity and engage third-party attestation services to test controls relevant to our business, this does not imply that we meet any particular technical standards, specifications or requirements.\nWe have not identified risks from known cybersecurity threats, including as a result of prior cybersecurity incidents, that have materially affected or are reasonably likely to materially affect us, including our business strategy, financial condition or results of operations.\n However, we remain subject to unknown or future cybersecurity threats that could materially affect us, including our business strategy, financial condition or results of operations. See “"
  }
}