{
  "ticker": "TXT",
  "cik": "0000217346",
  "company_name": "TEXTRON INC",
  "filing_date": "2025-02-06",
  "accession": "0000217346-25-000017",
  "primary_doc": "txt-20241228.htm",
  "item_sections": {
    "item1": "Item 1. Business. A discussion of our financial condition and operating results for 2024 compared with 2023 is provided below, while a discussion of 2023 compared with 2022 can be found in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of our Annual Report on Form 10-K for the year ended December 30, 2023. \nIn November 2023, the Financial Accounting Standards Board issued Accounting Standard Update (ASU) No. 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which requires a public entity to disclose, on an annual and interim basis, significant segment expenses and other segment items that are regularly provided to the Chief Operating Decision Maker. The new standard is effective for fiscal years beginning after December 15, 2023. We adopted ASU 2023-07 in the fourth quarter of 2024 and have recast management’s discussion and analysis of the results of operations of our company to include a discussion of the additional expense categories. In connection with the adoption of this standard, research and development costs previously included within Cost of products sold are now reported on a separate line in our Consolidated Statements of Operations. Prior period amounts have been recast to conform to the new presentation.\nThe following discussion should be read in conjunction with our Consolidated Financial Statements and related Notes included in Item 8. Financial Statements and Supplementary Data.\nConsolidated Results of Operations\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues\n$\n13,702\n$\n13,683\n$\n12,869\n—%\n6%\nCost of sales\n11,200\n10,835\n10,199\n3%\n6%\nGross margin as a percentage of Manufacturing revenues\n18.0%\n20.5%\n20.4%\nResearch and development costs\n491\n570\n601\n(14)%\n(5)%\nSelling and administrative expense\n1,156\n1,225\n1,186\n(6)%\n3%\nInterest expense, net\n97\n77\n107\n26%\n(28)%\nSpecial charges\n78\n126\n—\n(38)%\n100%\nNon-service components of pension and postretirement income, net\n263\n237\n240\n11%\n(1)%\n20\nTable of Contents\nRevenues\nRevenues increased $19 million in 2024, compared with 2023, largely due to the following factors:\n•\nHigher Bell revenues of $432 million, largely reflecting higher military aircraft and support revenues of $347 million, primarily due to higher volume on the FLRAA program, partially offset by lower volume on the V-22 program.\n•\nLower Industrial revenues of $326 million, due to lower revenues of $263 million at Textron Specialized Vehicles, principally in the powersports and personal transportation vehicles product lines due to reduced demand in their end markets, and lower revenues of $63 million at Kautex.\n•\nLower Textron Aviation revenues of $89 million, reflecting lower volume and mix of $270 million, principally a result of the strike discussed in the Segment Analysis section below, partially offset by higher pricing of $181 million in both the aircraft and aftermarket parts and services product lines.   \nCost of Sales  \nCost of sales includes cost of products and services sold for the Manufacturing group. In 2024, cost of sales increased $365 million, 3%, compared with 2023. The increase in cost was largely due to a $299 million impact from inflation and higher LIFO inventory provision and a $38 million inventory valuation charge to write down inventory to its net realizable value at Textron Specialized Vehicles as discussed in Note 15 to the Consolidated Financial Statements on page \n62\n.\nConsolidated gross margin as a percentage of Manufacturing revenues decreased 250 basis points in 2024, compared with 2023, primarily due to lower gross margin at the Bell segment, largely due to the mix of contracts discussed above, and at the Textron Aviation segment, reflecting the mix of aircraft sold and manufacturing inefficiencies, largely due to the strike. In addition, higher LIFO inventory provision and the inventory valuation charge noted above accounted for 80 basis points of the decrease. \nResearch and Development Costs\nResearch and development costs decreased $79 million, 14%, in 2024, compared with 2023, largely reflecting the winddown of the Future Attack Reconnaissance Aircraft Program at the Bell segment, partially offset by a $17 million increase at the Textron eAviation segment, largely due to development efforts on hybrid and electric propulsion aircraft. \nSelling and Administrative Expense\nSelling and administrative expense decreased $69 million, 6%, in 2024, compared with 2023, primarily reflecting lower compensation expense, which included lower shared-based and incentive compensation and savings from restructuring activities.\nInterest Expense, Net\nInterest expense, net includes interest expense for both the Finance and Manufacturing borrowing groups, with interest on intercompany borrowings eliminated, and interest income earned on cash and equivalents for the Manufacturing borrowing group. In 2024, interest expense, net increased $20 million, 26%, compared with 2023, primarily due to an increase in the weighted-average interest rate of our debt and $7 million in lower interest income. For 2024, 2023 and 2022, gross interest expense totaled $146 million, $133 million and $129 million, respectively. \nSpecial Charges\nSpecial charges of $78 million and $126 million in 2024 and 2023, respectively, include restructuring activities and asset impairment charges as described in Note 15 to the Consolidated Financial Statements on page \n62\n.\nNon-service Components of Pension and Postretirement Income, Net\nNon-service components of pension and postretirement income, net increased by $26 million, 11%, in 2024, compared with 2023. The increase is based on our annual valuation at the end of 2023 and is primarily driven by the impact of actual pension asset returns that exceeded our expected return on plan assets.\nIncome Taxes\n2024\n2023\n2022\nEffective tax rate\n12.5%\n15.2%\n15.2%\nIn 2024, the effective tax rate of 12.5% was lower than the U.S. federal statutory tax rate of 21%, largely due to the favorable impact of research and development credits and the effective settlement of certain tax positions in the fourth quarter of 2024, which is discussed in Note 16 to the Consolidated Financial Statements on page \n63\n. In 2023, the effective tax rate of 15.2% was lower than the U.S. federal statutory tax rate of 21%, largely due to the favorable impact of research and development credits and tax deductions for foreign-derived intangible income.  \nFor a full reconciliation of our effective tax rate to the U.S. federal statutory tax rate, see Note 16 to the Consolidated Financial Statements on page \n63\n.\n21\nTable of Contents\nSegment Analysis\nWe operate in, and report financial information for, the following six operating segments: Textron Aviation, Bell, Textron Systems, Industrial, Textron eAviation and Finance. Segment profit is an important measure used for evaluating performance and for decision-making purposes. Segment profit for the manufacturing segments excludes the non-service components of pension and postretirement income, net; LIFO inventory provision; intangible asset amortization; interest expense, net for Manufacturing group; certain corporate expenses; gains/losses on major business dispositions; special charges and the inventory valuation charge to write down production-related powersports inventory. The operating costs used to derive segment profit for our manufacturing segments includes cost of sales, research and development costs and selling and administrative expense. The cost of sales discussed in this Segment Analysis section excludes the LIFO inventory provision, intangible asset amortization and the inventory valuation charge discussed above that are reported within Cost of products sold or Cost of services sold on the Consolidated Statement of Operations. The measurement for the Finance segment includes interest income and expense along with intercompany interest income and expense. \nIn our discussion of comparative results for the Manufacturing group, material changes in revenues and segment profit for our commercial businesses typically are expressed in terms of product line revenues, including volume and mix and pricing; foreign exchange; acquisitions and dispositions; inflation; manufacturing efficiency; and changes in research and development costs and selling and administrative expense. For revenues, volume and mix represents changes in revenues from increases or decreases in the number of units delivered or services provided and the composition of products and/or services sold. For segment profit, volume and mix represents a change due to the number of units delivered or services provided and the composition of products and/or services sold at different profit margins. Pricing represents changes in unit pricing. Foreign exchange is the change resulting from translating foreign-denominated amounts into U.S. dollars at exchange rates that are different from the prior period. Revenues generated by acquired businesses are reflected in Acquisitions for a twelve-month period, while reductions in revenues and segment profit from the sale of businesses are reflected as Dispositions. Inflation represents higher material, wages, benefits, pension service cost or other costs. Manufacturing efficiency includes changes in material, labor and overhead variances to standards, typically due to scrap rates, labor efficiency or inefficiencies, facility usage and other manufacturing productivity inputs.\nApproximately 25% of our 2024 revenues were derived from contracts with the U.S. Government, including those under the U.S. Government-sponsored foreign military sales program. For our segments that contract with the U.S. Government, material changes in revenues related to these contracts are expressed in terms of volume. Changes in segment profit for these contracts are typically expressed in terms of volume and mix and contract performance, which includes cumulative catch-up adjustments associated with a) revisions to the transaction price that may reflect contract modifications or changes in assumptions related to award fees and other variable consideration or b) changes in the total estimated costs at completion due to improved or deteriorated operating performance.\nTextron Aviation\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues:\nAircraft\n$\n3,374\n$\n3,577\n$\n3,387\n(6)%\n6%\nAftermarket parts and services\n1,910\n1,796\n1,686\n6%\n7%\nTotal revenues\n5,284\n5,373\n5,073\n(2)%\n6%\nCost of sales\n4,102\n4,116\n3,905\n—%\n5%\nResearch and development costs\n208\n199\n191\n5%\n4%\nSelling and administrative expense\n408\n409\n417\n—%\n(2)%\nSegment profit\n$\n566\n$\n649\n$\n560\n(13)%\n16%\nProfit margin\n10.7%\n12.1%\n11.0%\nBacklog\n$\n7,845\n$\n7,169\n$\n6,387\n9%\n12%\nTextron Aviation’s revenues decreased $89 million, 2%, in 2024, compared with 2023, reflecting lower volume and mix of $270 million, which was principally a result of the strike discussed below, partially offset by higher pricing of $181 million. Aircraft revenues decreased $203 million, 6%, due to lower volume and mix, largely from Citation jet and commercial turboprop deliveries, partially offset by higher pricing. We delivered 151 Citation jets and 127 commercial turboprops in 2024, compared with 168 Citation jets and 153 commercial turboprops in 2023.  Aftermarket parts and services revenues increased $114 million, 6%, due to higher pricing and volume.\n22\nTable of Contents\nOn September 21, 2024, the IAM District 70, Local Lodge 774 called a strike against Textron Aviation. The strike impacted approximately 5,000 of Textron Aviation’s employees at the manufacturing, parts and distribution and service center facilities in Wichita. On October 20, 2024, Textron Aviation and the IAM reached an agreement on a new five-year labor contract. The strike had a significant adverse impact on Textron Aviation’s ability to meet its production and delivery schedules in the third quarter and continuing into the fourth quarter of 2024. As a result, our revenues and profit were unfavorably impacted in the second half of 2024 by delayed aircraft deliveries and manufacturing inefficiencies associated with the labor disruption and the recovery of operating activities.\nTextron Aviation’s cost of sales decreased $14 million in 2024, compared with 2023. The impact of lower volume and mix on our cost of sales was offset by $127 million of inflation and $43 million in manufacturing inefficiencies, largely reflecting idle facilities costs resulting from the strike discussed above. \nTextron Aviation’s segment profit decreased $83 million, 13%, in 2024, compared with 2023, primarily due to lower volume and mix and the manufacturing inefficiencies discussed above, partially offset by higher pricing, net of inflation. \nTextron Aviation’s backlog increased $676 million, 9%, in 2024, reflecting orders in excess of deliveries. \nBell\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues:\nMilitary aircraft and support programs\n$\n2,048\n$\n1,701\n$\n1,740\n20%\n(2)%\nCommercial helicopters, parts and services\n1,531\n1,446\n1,351\n6%\n7%\nTotal revenues\n3,579\n3,147\n3,091\n14%\n2%\nCost of sales\n2,899\n2,392\n2,316\n21%\n3%\nResearch and development costs\n97\n192\n266\n(49)%\n(28)%\nSelling and administrative expense\n213\n243\n227\n(12)%\n7%\nSegment profit\n$\n370\n$\n320\n$\n282\n16%\n13%\nProfit margin\n10.3%\n10.2%\n9.1%\nBacklog\n$\n7,469\n$\n4,780\n$\n4,781\n56%\n—%\nBell’s military aircraft and support programs include a development contract for the U.S. Army's FLRAA program, as well as production, upgrade, and support contracts for the V-22 tiltrotor aircraft and H-1 helicopters. The FLRAA program represents an increasing portion of Bell’s revenues as development activities have ramped. In August 2024, the U.S. Army announced approval of Milestone B for the FLRAA program, establishing it as a program of record and transitioning it to the Engineering and Manufacturing Development phase. In the second half of 2024, Bell was awarded contracts totaling approximately $3.0 billion for this phase of the program. \nBell’s military and support programs revenues increased $347 million, 20%, in 2024, compared with 2023, primarily due to higher volume on the FLRAA program, partially offset by lower volume on the V-22 program. Commercial helicopters, parts and services increased $85 million, 6%. We delivered 172 commercial helicopters in 2024, compared with 171 commercial helicopters in 2023.\nBell's cost of sales increased $507 million, 21%, in 2024, compared with 2023, primarily due to the higher volume and mix discussed above. \nBell's research and development costs decreased $95 million, 49%, in 2024, compared with 2023, largely due to the winddown of the Future Attack Reconnaissance Aircraft Program. \nSelling and administrative expense decreased at Bell by $30 million, 12%, in 2024, compared with 2023, primarily due to a gain on a legal settlement recorded in the first quarter of 2024 and lower bid and proposal costs.\nBell’s segment profit increased $50 million, 16%, in 2024, compared with 2023, primarily due to lower research and development costs, as described above, partially offset by an unfavorable impact from mix as volume increased on lower margin FLRAA development activities while volume decreased on higher margin V-22 program revenues. \nBacklog increased $2.7 billion, 56%, at Bell due to orders in excess of revenues recognized and deliveries, largely related to the FLRAA program discussed above. \n23\nTable of Contents\nTextron Systems\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues\n$\n1,241\n$\n1,235\n$\n1,172\n—%\n5%\nCost of sales\n929\n925\n878\n—%\n5%\nResearch and development costs\n51\n53\n53\n(4)%\n—%\nSelling and administrative expense\n107\n110\n109\n(3)%\n1%\nSegment profit\n$\n154\n$\n147\n$\n132\n5%\n11%\nProfit margin\n12.4%\n11.9%\n11.3%\nBacklog\n$\n2,594\n$\n1,950\n$\n2,098\n33%\n(7)%\nTextron Systems revenues and segment profit increased $6 million and $7 million, respectively, in 2024, compared with 2023. The impact on volume related to the cancellation of the Shadow program in the first quarter of 2024 was largely offset by higher volume on the Ship-to-Shore Connector program. \nTextron Systems’ backlog increased $644 million, 33%, in 2024, compared with 2023, reflecting orders in excess of revenues recognized and deliveries, which included new contract awards for the Ship-to-Shore Connector program.\nIndustrial\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues:\nKautex\n$\n1,891\n$\n1,954\n$\n1,771\n(3)%\n10%\nTextron Specialized Vehicles\n1,624\n1,887\n1,694\n(14)%\n11%\nTotal revenues\n3,515\n3,841\n3,465\n(8)%\n11%\nCost of sales\n2,993\n3,221\n2,959\n(7)%\n9%\nResearch and development costs\n72\n80\n71\n(10)%\n13%\nSelling and administrative expense\n299\n312\n280\n(4)%\n11%\nSegment profit\n$\n151\n$\n228\n$\n155\n(34)%\n47%\nProfit margin\n4.3%\n5.9%\n4.5%\nIndustrial segment revenues decreased $326 million, 8%, in 2024, compared with 2023, largely due to lower volume and mix. Textron Specialized Vehicles' revenues decreased $263 million, 14%, reflecting lower volume, principally in the powersports and personal transportation vehicles products due to reduced demand in their end markets. Kautex revenues decreased $63 million, 3%, largely due to lower volume.\nIndustrial's cost of sales decreased $228 million, 7%, in 2024 compared with 2023, primarily reflecting the impact of lower volume and mix. \nSegment profit for the Industrial segment decreased $77 million, 34%, in 2024, compared with 2023, largely due to a $105 million impact from lower volume and mix, partially offset by $22 million in manufacturing efficiencies and $21 million in lower selling and administrative expense and research and development costs, largely due to cost reduction activities.\nTextron eAviation\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues\n$\n33 \n$\n32 \n$\n16 \n3%\n100%\nCost of sales\n29 \n35 \n18 \n(17)%\n94%\nResearch and development costs\n63 \n46 \n20 \n37%\n130%\nSelling and administrative expense\n17 \n14 \n2 \n21%\n600%\nSegment loss\n$\n(76)\n$\n(63)\n$\n(24)\n21%\n163%\nTextron eAviation segment revenues increased $1 million, 3%, in 2024, compared with 2023. Research and development costs increased $17 million, 37%, largely due to the ramp up of development efforts on hybrid and electric propulsion aircraft. Segment loss increased $13 million in 2024, compared with 2023, primarily reflecting the higher research and development costs.     \n24\nTable of Contents\nFinance\n(In millions)\n2024\n2023\n2022\nRevenues\n$\n50 \n$\n55 \n$\n52 \nSelling and administrative expense\n(4)\n(6)\n8 \nInterest expense, net\n19 \n15 \n13 \nSegment profit\n$\n35 \n$\n46 \n$\n31 \nFinance segment revenues decreased $5 million and segment profit decreased $11 million in 2024, compared with 2023. Selling and administrative expense included recoveries of $10 million and $18 million in 2024 and 2023, respectively. The decrease in segment profit was primarily due to $8 million in lower recoveries of credit losses.  \nLiquidity and Capital Resources\nOur financings are conducted through two separate borrowing groups.  The Manufacturing group consists of Textron consolidated with its majority-owned subsidiaries that operate in the Textron Aviation, Bell, Textron Systems, Industrial and Textron eAviation segments. The Finance group, which also is the Finance segment, consists of Textron Financial Corporation and its consolidated subsidiaries. We designed this framework to enhance our borrowing power by separating the Finance group. Our Manufacturing group operations include the development, production and delivery of tangible products and services, while our Finance group provides financial services. Due to the fundamental differences between each borrowing group’s activities, investors, rating agencies and analysts use different measures to evaluate each group’s performance. To support those evaluations, we present balance sheet and cash flow information for each borrowing group within the Consolidated Financial Statements.\nAssessment of Liquidity and Significant Future Cash Requirements\nKey information that is utilized in assessing our liquidity is summarized below:\n(Dollars in millions)\nDecember 28,\n2024\nDecember 30,\n2023\nManufacturing group\nCash and equivalents\n$\n1,386\n$\n2,121\nDebt\n3,247\n3,526\nShareholders’ equity\n7,204\n6,987\nCapital (debt plus shareholders’ equity)\n10,451\n10,513\nNet debt (net of cash and equivalents) to capital\n21%\n17%\nDebt to capital\n31%\n34%\nFinance group\nCash and equivalents\n$\n55\n$\n60\nDebt\n341\n348\nWe believe that our calculations of debt to capital and net debt to capital are useful measures as they provide a summary indication of the level of debt financing (i.e., leverage) that is in place to support our capital structure, as well as to provide an indication of our capacity to add further leverage.   \nWe expect to have sufficient cash to meet our needs based on our existing cash balances, the cash we expect to generate from our manufacturing operations and the availability of our existing credit facility. In addition to our manufacturing operating cash requirements, future material cash outlays include our contractual combined debt and interest payments for the Manufacturing group of $473 million in 2025, $457 million in 2026, $444 million in 2027 and $2.5 billion thereafter, and for the Finance group of $46 million in 2025, $20 million in 2026, $69 million in 2027 and $507 million thereafter. \nFor the Manufacturing group, we also have purchase obligations that require material future cash outlays totaling $2.7 billion in 2025, $501 million in 2026 and $355 million thereafter. Purchase obligations include undiscounted amounts committed under contracts or purchase orders for goods and services with defined terms as to price, quantity and delivery dates, as well as property, plant and equipment. Approximately 28% of our purchase obligations represent purchase orders issued for goods and services to be delivered under firm contracts with the U.S. Government for which we have full recourse under customary contract termination clauses. \n25\nTable of Contents\nCredit Facilities and Other Sources of Capital\nTextron has a senior unsecured revolving credit facility for an aggregate principal amount of $1.0 billion, of which $100 million is available for the issuance of letters of credit. We may elect to increase the aggregate amount of commitments under the facility to up to $1.3 billion by designating an additional lender or by an existing lender agreeing to increase its commitment. The facility expires in October 2027 and provides for two one-year extensions at our option with the consent of lenders representing a majority of the commitments under the facility. At December 28, 2024 and December 30, 2023, there were no amounts borrowed against the facility and there were $9 million of outstanding letters of credit issued under the facility.\nWe also maintain an effective shelf registration statement filed with the Securities and Exchange Commission that allows us to issue an unlimited amount of public debt and other securities. On March 1, 2024, we repaid our $350 million 4.30% Notes due March 2024.\nManufacturing Group Cash Flows\nCash flows from continuing operations for the Manufacturing group as presented in our Consolidated Statements of Cash Flows are summarized below:\n(In millions)\n2024\n2023\n2022\nOperating activities\n$\n1,008 \n$\n1,270 \n$\n1,461 \nInvesting activities\n(288)\n(345)\n(511)\nFinancing activities\n(1,438)\n(776)\n(875)\nCash flows from operating activities were $1.0 billion in 2024, compared with $1.3 billion in 2023. The $262 million decrease in cash flows was largely due to changes in working capital and lower earnings, partially offset by $157 million in lower net tax payments. Net income tax payments were $181 million and $338 million in 2024 and 2023, respectively. Pension contributions were $44 million and $45 million in 2024 and 2023, respectively. \nIn 2024 and 2023, investing cash flows included capital expenditures of $364 million and $402 million, respectively, partially offset by net proceeds from corporate-owned life insurance policies of $85 million and $40 million, respectively. \nCash flows used by financing activities in 2024 included $1.1 billion of cash paid to repurchase an aggregate of 12.9 million shares of our common stock under the 2023 share repurchase plan described below and payments on long-term debt of $361 million. In 2023, cash flows used by financing activities included $1.2 billion of cash paid to repurchase an aggregate of 16.2 million shares of our common stock, partially offset by $348 million of net proceeds from the issuance of long-term debt.  \nIn July 2023, Textron's Board of Directors approved a program for the repurchase of up to 35 million shares of our common stock. This share repurchase program allows us to continue our practice of repurchasing shares to offset the impact of dilution from stock-based compensation and benefit plans and for opportunistic capital management purposes. The repurchase program has no expiration date and there were 15.6 million shares remaining under the program at December 28, 2024. \nDividend payments to shareholders totaled $12 million and $16 million in 2024 and 2023, respectively. Due to the timing of our fiscal year-end, we made three dividend payments in 2024, compared with four dividend payments in 2023.\nFinance Group Cash Flows\nThe cash flows from continuing operations for the Finance group as presented in our Consolidated Statements of Cash Flows are summarized below:\n(In millions)\n2024\n2023\n2022\nOperating activities\n$\n8 \n$\n14 \n$\n(7)\nInvesting activities\n3 \n11 \n100 \nFinancing activities\n(16)\n(37)\n(216)\nThe Finance group’s cash flows from investing activities primarily included collections on finance receivables totaling $133 million and $169 million in 2024 and 2023, respectively, partially offset by finance receivable originations of $130 million and $160 million, respectively. Cash flows used in financing activities included payments on long-term and nonrecourse debt of $16 million and $37 million in 2024 and 2023, respectively.  \n26\nTable of Contents\nConsolidated Cash Flows\nThe consolidated cash flows from continuing operations, after elimination of activity between the borrowing groups, are summarized below:\n(In millions)\n2024\n2023\n2022\nOperating activities\n$\n1,015 \n$\n1,267 \n$\n1,490 \nInvesting activities\n(284)\n(317)\n(447)\nFinancing activities\n(1,454)\n(813)\n(1,091)\nConsolidated cash flows from operating activities were $1.0 billion in 2024, compared with $1.3 billion in 2023. The decrease of $252 million in cash flows was largely due to changes in working capital and lower earnings, partially offset by $161 million in lower net tax payments. Net income tax payments were $191 million and $352 million in 2024 and 2023, respectively. Pension contributions were $44 million and $45 million in 2024 and 2023, respectively. \nIn 2024 and 2023, investing cash flows included capital expenditures of $364 million and $402 million, respectively, partially offset by net proceeds from corporate-owned life insurance policies of $85 million and $40 million, respectively. \nCash flows used by financing activities in 2024 included $1.1 billion of share repurchases and payments on long-term debt of $377 million. In 2023, cash flows used by financing activities included $1.2 billion of share repurchases, partially offset by $348 million of net proceeds from the issuance of long-term debt.   \nCaptive Financing and Other Intercompany Transactions\nThe Finance group provides financing primarily to purchasers of new and pre-owned Textron Aviation aircraft and Bell helicopters manufactured by our Manufacturing group, otherwise known as captive financing. In the Consolidated Statements of Cash Flows, cash received from customers is reflected as operating activities when received from third parties. However, in the cash flow information provided for the separate borrowing groups, cash flows related to captive financing activities are reflected based on the operations of each group. For example, when product is sold by our Manufacturing group to a customer and is financed by the Finance group, the origination of the finance receivable is recorded within investing activities as a cash outflow in the Finance group’s statement of cash flows. Meanwhile, in the Manufacturing group’s statement of cash flows, the cash received from the Finance group on the customer’s behalf is recorded within operating cash flows as a cash inflow. Although cash is transferred between the two borrowing groups, there is no cash transaction reported in the consolidated cash flows at the time of the original financing. These captive financing activities, along with all significant intercompany transactions, are reclassified or eliminated from the Consolidated Statements of Cash Flows.\nReclassification adjustments included in the Consolidated Statements of Cash Flows on page \n36\n are summarized below:\n(In millions)\n2024\n2023\n2022\nReclassification adjustments from investing activities to operating activities:\nFinance receivable originations for Manufacturing group inventory sales\n$\n(109)\n$\n(160)\n$\n(92)\nCash received from customers\n108 \n143 \n127 \nOther\n— \n— \n1 \nTotal reclassification adjustments from investing activities to operating activities\n$\n(1)\n$\n(17)\n$\n36 \nUnder a Support Agreement between Textron and TFC, Textron is required to maintain a controlling interest in TFC. The agreement, as amended in December 2015, also requires Textron to ensure that TFC maintains fixed charge coverage of no less than 125% and consolidated shareholders' equity of no less than $125 million. There were no cash contributions required to be paid to TFC in 2024 and 2023 to maintain compliance with the support agreement.\nCritical Accounting Estimates\nTo prepare our Consolidated Financial Statements to be in conformity with generally accepted accounting principles, we must make complex and subjective judgments in the selection and application of accounting policies. The accounting policies that we believe are most critical to the portrayal of our financial condition and results of operations are listed below. We believe these policies require our most difficult, subjective and complex judgments in estimating the effect of inherent uncertainties. This section should be read in conjunction with Note 1 to the Consolidated Financial Statements on page \n38\n, which includes other significant accounting policies.\n27\nTable of Contents\nRevenue Recognition\nA substantial portion of our revenues is related to long-term contracts with the U.S. Government, including those under the U.S. Government-sponsored foreign military sales program, for the design, development, manufacture or modification of aerospace and defense products as well as related services. We generally use the cost-to-cost method to measure progress for these contracts because it best depicts the transfer of control to the customer that occurs as we incur costs on our contracts.  Under this measure, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the estimated costs at completion of the performance obligation, and revenue is recorded proportionally as costs are incurred.\nDue to the number of years it may take to complete these contracts and the scope and nature of the work required to be performed on the contracts, the estimation of total transaction price and costs at completion is complicated and subject to many variables and, accordingly, is subject to change. In estimating total costs at completion, we are required to make numerous assumptions related to the complexity of design and related development work to be performed; engineering requirements; product performance; subcontractor performance; availability and cost of materials; labor productivity, availability and cost; overhead and capital costs; manufacturing efficiencies; the length of time to complete the contract (to estimate increases in wages and prices for materials); and costs of satisfying offset obligations, among other variables. Our cost estimation process is based on the professional knowledge and experience of engineers and program managers along with finance professionals. We review and update our cost projections quarterly or more frequently when circumstances significantly change. When our estimate of the total costs to be incurred on a contract exceeds the estimated total transaction price, a provision for the entire loss is recorded in the period in which the loss is determined.\nAt the outset of each contract, we estimate an initial profit booking rate considering the risks surrounding our ability to achieve the technical requirements (e.g., a newly developed product versus a mature product), schedule (e.g., the number and type of milestone events), and costs by contract requirements in the initial estimated costs at completion. Profit booking rates may increase during the performance of the contract if we successfully retire risks surrounding the technical, schedule and cost aspects of the contract. Conversely, the profit booking rate may decrease if we are not successful in retiring the risks; and, as a result, our estimated costs at completion increase. All estimates are subject to change during the performance of the contract and, therefore, may affect the profit booking rate.\nChanges in our estimate of the total expected cost or in the transaction price for a contract typically impact our profit booking rate. We utilize the cumulative catch-up method of accounting to recognize the impact of these changes on our profit booking rate for a contract. Under this method, the inception-to-date impact of a profit adjustment on a contract is recognized in the period the adjustment is identified. The impact of our cumulative catch-up adjustments on segment profit recognized in prior periods is presented below:\n(In millions)\n2024\n2023\n2022\nGross favorable\n$\n122 \n$\n106 \n$\n101 \nGross unfavorable\n(91)\n(62)\n(117)\nNet adjustments\n$\n31 \n$\n44 \n$\n(16)\nDue to the significance of judgment in the estimation process described above, it is likely that materially different revenues and/or cost of sales amounts could be recorded if we used different assumptions or if the underlying circumstances were to change. Our earnings could be reduced by a material amount resulting in a charge to earnings if (a) total estimated contract costs are significantly higher than expected due to changes in customer specifications prior to contract amendment, (b) total estimated contract costs are significantly higher than previously estimated due to cost overruns or inflation, (c) there is a change in engineering efforts required during the development stage of the contract or (d) we are unable to meet contract milestones.\nGoodwill\nWe evaluate the recoverability of goodwill annually in the fourth quarter or more frequently if events or changes in circumstances indicate a potential impairment of a reporting unit. We calculate the fair value of each reporting unit using discounted cash flows. These cash flows incorporate assumptions for revenue growth rates and operating margins that are based on our strategic plans and long-range planning forecasts, which include our best estimates of current and forecasted market conditions, cost structure and anticipated net cost reductions. The long-term revenue growth rate we use to determine the terminal value of the business is based on our assessment of its minimum expected terminal growth rate, as well as its past historical growth and broader economic considerations such as gross domestic product, inflation and the maturity of the markets we serve. The discount rates utilized in this analysis are based on each reporting unit’s weighted average cost of capital, which takes into account the relative weights of each component of capital structure (equity and debt) and represents the expected cost of new capital, adjusted as appropriate to consider the risk inherent in future cash flows of the respective reporting unit. We believe this approach yields a discount rate that is consistent with an implied rate of return that an independent investor or market participant would require for an investment in a company having similar risks and business characteristics to the reporting unit being assessed.\n28\nTable of Contents\nBased on our annual impairment review, the fair value calculated using the estimates discussed above exceeded the carrying value by an adequate amount for each reporting group. Accordingly, we do not believe that there is a reasonable possibility that any units might fail the impairment test in the foreseeable future.\nRetirement Benefits\nWe sponsor funded and unfunded domestic and international pension plans for certain of our employees. Beginning on January 1, 2010, we initiated actions to commence the closure of the pension plans to new entrants. We provide employees hired subsequent to these closures with defined contribution benefits. Our pension benefit obligations are calculated based on actuarial valuations. Key assumptions used in determining these obligations and related expenses or benefits include the expected long-term rates of return on plan assets and discount rates. We also make assumptions regarding employee demographic factors such as retirement patterns, mortality, turnover and rate of compensation increases.  We evaluate and update these assumptions annually.\nTo determine the weighted-average expected long-term rate of return on plan assets, we consider the current and expected asset allocation, as well as historical and expected returns on each plan asset class.  A lower expected rate of return on plan assets will decrease pension income.  For 2024 and 2023, the assumed expected long-term rate of return on plan assets used in calculating pension income was 7.16% and 7.14%, respectively. For 2024, the assumed rate of return for our domestic plans, which represent approximately 90% of our total pension assets, was 7.25%. Net periodic benefit income is sensitive to changes in the expected long-term rate of return on plan assets. \nThe discount rate enables us to state expected future benefit payments as a present value on the measurement date, reflecting the current rate at which the pension liabilities could be effectively settled. This rate should be in line with rates for high-quality fixed income investments available for the period to maturity of the pension benefits, which fluctuate as long-term interest rates change.  A lower discount rate increases the present value of the benefit obligations and generally decreases pension income.  In 2024, the weighted-average discount rate used in calculating pension income was 5.19%, compared with 5.51% in 2023.  For our domestic plans, the assumed discount rate was 5.25% in 2024, compared with 5.55% in 2023. A change of 50 basis-points higher or lower, with all other assumptions held constant, in this weighted-average discount rate in 2024 would have changed our pension income for our domestic plans by approximately $10 million.\n29\nTable of Contents\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\nForeign Currency Exchange Risk\nOur financial results are affected by changes in foreign currency exchange rates in the various countries in which our products are manufactured and/or sold.  For our manufacturing operations, we manage our foreign currency transaction exposures by entering into foreign currency exchange contracts. These contracts generally are used to fix the local currency cost of purchased goods or services or selling prices denominated in currencies other than the functional currency. The notional amount of outstanding foreign currency exchange contracts was $464 million and $478 million at December 28, 2024 and December 30, 2023, respectively.  We also may hedge exposures to certain of our foreign currency assets and earnings by funding those asset positions with debt in the same foreign currency so the exposures are naturally offset.  \nInterest Rate Risk\nOur financial results are affected by changes in interest rates. As part of managing this risk, we seek to achieve a prudent balance between floating- and fixed-rate exposures. We continually monitor our mix of these exposures and adjust the mix, as necessary. For our Finance group, we generally limit our risk to changes in interest rates with a strategy of matching floating-rate assets with floating-rate liabilities.  This strategy includes the use of interest rate swap agreements. We had interest rate swap agreements with a total notional amount of $289 million at December 28, 2024 and $210 million at December 30, 2023, which effectively converted certain floating-rate debt to a fixed-rate equivalent.\nQuantitative Risk Measures\nIn the normal course of business, we enter into financial instruments for purposes other than trading. The financial instruments that are subject to market risk include finance receivables (excluding leases), debt (excluding finance lease obligations) and foreign currency exchange contracts. To quantify the market risk inherent in these financial instruments, we utilize a sensitivity analysis that includes a hypothetical change in fair value assuming a 10% decrease in interest rates and a 10% strengthening in foreign exchange rates against the U.S. dollar. The fair value of these financial instruments is estimated using discounted cash flow analysis and indicative market pricing as reported by leading financial news and data providers.\nAt the end of each year, the table below provides the carrying and fair values of these financial instruments along with the sensitivity of fair value to the hypothetical changes discussed above. This sensitivity analysis is most likely not indicative of actual results in the future.\nDecember 28, 2024\nDecember 30, 2023\n(\nIn millions\n)\nCarrying\nValue*\nFair\nValue*\nSensitivity of\nFair Value\nto a 10%\nChange\nCarrying\nValue*\nFair\nValue*\nSensitivity of\nFair Value\nto a 10%\nChange\nManufacturing group\nForeign currency exchange risk\nForeign currency exchange contracts\n$\n(14)\n$\n(14)\n$\n31 \n$\n1 \n$\n1 \n$\n30 \nInterest rate risk\nDebt\n(3,164)\n(2,989)\n(49)\n(3,520)\n(3,342)\n(54)\nFinance group\nInterest rate risk\nFinance receivables\n439 \n454 \n9 \n417 \n423 \n9 \nDebt\n(341)\n(311)\n— \n(348)\n(293)\n(1)\n* The value represents an asset or (liability).\n30\nTable of Contents\nItem 8. Financial Statements and Supplementary Data\nOur Consolidated Financial Statements and the related report of our independent registered public accounting firm thereon are included in this Annual Report on Form 10-K on the pages indicated below:\nPage\nConsolidated Statements of Operations for each of the years in the three-year period ended \nDecember 28, 2024\n32\nConsolidated Statements of Comprehensive Income for each of the years in the three-year period ended \nDecember 28, 2024\n33\nConsolidated Balance Sheets as of \nDecember 28, 2024\n and \nDecember 30, 2023\n34\nConsolidated Statements of Shareholders’ Equity for each of the years in the three-year period ended \nDecember 28, 2024\n35\nConsolidated Statements of Cash Flows for each of the years in the three-year period ended \nDecember 28, 2024\n36\nNotes to the Consolidated Financial Statements\nNote 1.\nSummary of Significant Accounting Policies\n38\nNote \n2\n.\nGoodwill and Intangible Assets\n44\nNote \n3\n.\nAccounts Receivable and Finance Receivables\n44\nNote \n4\n.\nInventories\n46\nNote \n5\n.\nProperty, Plant and Equipment, Net\n46\nNote \n6\n.\nAccounts Payable and \nLiabilities\n46\nNote \n7\n.\nLeases\n47\nNote \n8\n.\nDebt and Credit Facilities\n48\nNote \n9\n.\nDerivative Instruments and Fair Value Measurements\n49\nNote 1\n0\n.\nShareholders’ Equity\n50\nNote 1\n1\n.\nSegment \nFinancial Information\n52\nNote 1\n2\n.\nRevenues\n54\nNote 1\n3\n.\nShare-Based Compensation\n56\nNote 1\n4\n.\nRetirement Plans\n58\nNote 1\n5\n.\nSpecial Charges\n62\nNote 1\n6\n.\nIncome Taxes\n63\nNote 1\n7\n.\nCommitments and Contingencies\n66\nNote 1\n8\n.\nSupplemental Cash Flow Information\n66\nReport of Independent Registered Public Accounting Firm\n \n67\nSupplementary Information:\nSchedule II – Valuation and Qualifying Accounts\n69\nAll other schedules are omitted either because they are not applicable or not required or because the required information is included in the financial statements or notes thereto.\n31\nTable of Contents\nConsolidated Statements of Operations\nFor each of the years in the three-year period ended December 28, 2024 \n(In millions, except per share data)\n2024\n2023\n2022\nRevenues\nManufacturing product revenues\n$\n11,375\n \n$\n11,573\n \n$\n10,945\n \nManufacturing service revenues\n2,277\n \n2,055\n \n1,872\n \nFinance revenues\n50\n \n55\n \n52\n \nTotal revenues\n13,702\n \n13,683\n \n12,869\n \nCosts, expenses and other\nCost of products sold\n9,403\n \n9,206\n \n8,787\n \nCost of services sold\n1,797\n \n1,629\n \n1,412\n \nResearch and development costs\n491\n \n570\n \n601\n \nSelling and administrative expense\n1,156\n \n1,225\n \n1,186\n \nInterest expense, net\n97\n \n77\n \n107\n \nSpecial charges\n78\n \n126\n \n—\n \nNon-service components of pension and postretirement income, net\n(\n263\n)\n(\n237\n)\n(\n240\n)\nTotal costs, expenses and other\n12,759\n \n12,596\n \n11,853\n \nIncome from continuing operations before income taxes\n943\n \n1,087\n \n1,016\n \nIncome tax expense\n118\n \n165\n \n154\n \nIncome from continuing operations\n825\n \n922\n \n862\n \nLoss from discontinued operations\n(\n1\n)\n(\n1\n)\n(\n1\n)\nNet income\n$\n824\n \n$\n921\n \n$\n861\n \nBasic Earnings per share\nContinuing operations\n$\n4.38\n \n$\n4.62\n \n$\n4.05\n \nDiscontinued operations\n—\n \n(\n0.01\n)\n—\n \nBasic Earnings per share\n$\n4.38\n \n$\n4.61\n \n$\n4.05\n \nDiluted Earnings per share\nContinuing operations\n$\n4.34\n \n$\n4.57\n \n$\n4.01\n \nDiscontinued operations\n(\n0.01\n)\n(\n0.01\n)\n—\n \nDiluted Earnings per share\n$\n4.33\n \n$\n4.56\n \n$\n4.01\n \nSee Notes to the Consolidated Financial Statements.\n32\nTable of Contents\nConsolidated Statements of Comprehensive Income\nFor each of the years in the three-year period ended December 28, 2024 \n(In millions)\n2024\n2023\n2022\nNet income\n$\n824\n \n$\n921\n \n$\n861\n \nOther comprehensive income (loss), net of tax\nPension and postretirement benefits adjustments, net of reclassifications\n419\n \n(\n82\n)\n283\n \nForeign currency translation adjustments, net of reclassifications\n(\n71\n)\n45\n \n(\n103\n)\nDeferred gains (losses) on hedge contracts, net of reclassifications\n(\n8\n)\n5\n \n(\n3\n)\nTotal other comprehensive income (loss), net of tax\n340\n \n(\n32\n)\n177\n \nComprehensive income\n$\n1,164\n \n$\n889\n \n$\n1,038\n \nSee Notes to the Consolidated Financial Statements.\n33\nTable of Contents\nConsolidated Balance Sheets\n(In millions, except share data)\nDecember 28,\n2024\nDecember 30,\n2023\nAssets\nManufacturing group\nCash and equivalents\n$\n1,386\n \n$\n2,121\n \nAccounts receivable, net\n949\n \n868\n \nInventories\n4,071\n \n3,914\n \nOther current assets\n687\n \n857\n \nTotal current assets\n7,093\n \n7,760\n \nProperty, plant and equipment, net\n2,529\n \n2,477\n \nGoodwill\n2,288\n \n2,295\n \nOther assets\n4,248\n \n3,663\n \nTotal Manufacturing group assets\n16,158\n \n16,195\n \nFinance group\nCash and equivalents\n55\n \n60\n \nFinance receivables, net\n603\n \n585\n \nOther assets\n22\n \n16\n \nTotal Finance group assets\n680\n \n661\n \nTotal assets\n$\n16,838\n \n$\n16,856\n \nLiabilities and shareholders’ equity\nLiabilities\nManufacturing group\nCurrent portion of long-term debt\n$\n357\n \n$\n357\n \nAccounts payable\n943\n \n1,023\n \nOther current liabilities\n3,094\n \n2,998\n \nTotal current liabilities\n4,394\n \n4,378\n \nOther liabilities\n1,945\n \n1,904\n \nLong-term debt\n2,890\n \n3,169\n \nTotal Manufacturing group liabilities\n9,229\n \n9,451\n \nFinance group\nOther liabilities\n64\n \n70\n \nDebt\n341\n \n348\n \nTotal Finance group liabilities\n405\n \n418\n \nTotal liabilities\n9,634\n \n9,869\n \nShareholders’ equity\nCommon stock (\n184.0\n million and \n195.0\n million shares issued, respectively, \n    and \n183.0\n million and \n192.9\n million shares outstanding, respectively)\n23\n \n24\n \nCapital surplus\n1,960\n \n1,910\n \nTreasury stock\n(\n82\n)\n(\n165\n)\nRetained earnings\n5,607\n \n5,862\n \nAccumulated other comprehensive loss\n(\n304\n)\n(\n644\n)\nTotal shareholders’ equity\n7,204\n \n6,987\n \nTotal liabilities and shareholders’ equity\n$\n16,838\n \n$\n16,856\n \nSee Notes to the Consolidated Financial Statements.\n34\nTable of Contents\nConsolidated Statements of Shareholders’ Equity\n(In millions, except per share data)\nCommon\nStock\nCapital\nSurplus\nTreasury\nStock\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nLoss\nTotal\nShareholders’\nEquity\nBalance at January 1, 2022\n$\n28\n \n$\n1,863\n \n$\n(\n157\n)\n$\n5,870\n \n$\n(\n789\n)\n$\n6,815\n \nNet income\n— \n— \n— \n861\n \n— \n861\n \nOther comprehensive income\n— \n— \n— \n— \n177\n \n177\n \nDividends declared ($\n0.08\n per share)\n— \n— \n— \n(\n17\n)\n— \n(\n17\n)\nShare-based compensation activity\n— \n144\n \n— \n— \n— \n144\n \nPurchases of common stock\n— \n— \n(\n867\n)\n— \n— \n(\n867\n)\nRetirement of treasury stock\n(\n2\n)\n(\n127\n)\n940\n \n(\n811\n)\n— \n—\n \nBalance at December 31, 2022\n26\n \n1,880\n \n(\n84\n)\n5,903\n \n(\n612\n)\n7,113\n \nNet income\n— \n— \n— \n921\n \n— \n921\n \nOther comprehensive loss\n— \n— \n— \n— \n(\n32\n)\n(\n32\n)\nDividends declared ($\n0.08\n per share)\n— \n— \n— \n(\n16\n)\n— \n(\n16\n)\nShare-based compensation activity\n— \n179\n \n— \n— \n— \n179\n \nPurchases of common stock, including excise tax*\n— \n— \n(\n1,178\n)\n— \n— \n(\n1,178\n)\nRetirement of treasury stock\n(\n2\n)\n(\n149\n)\n1,097\n \n(\n946\n)\n— \n—\n \nBalance at December 30, 2023\n24\n \n1,910\n \n(\n165\n)\n5,862\n \n(\n644\n)\n6,987\n \nNet income\n— \n— \n— \n824\n \n— \n824\n \nOther comprehensive income\n— \n— \n— \n— \n340\n \n340\n \nDividends declared ($\n0.08\n per share)\n— \n— \n— \n(\n16\n)\n— \n(\n16\n)\nShare-based compensation activity\n1\n \n199\n \n— \n— \n— \n200\n \nPurchases of common stock, including excise tax*\n— \n— \n(\n1,131\n)\n— \n— \n(\n1,131\n)\nRetirement of treasury stock\n(\n2\n)\n(\n149\n)\n1,214\n \n(\n1,063\n)\n— \n—\n \nBalance at December 28, 2024\n$\n23\n \n$\n1,960\n \n$\n(\n82\n)\n$\n5,607\n \n$\n(\n304\n)\n$\n7,204\n \n*\nIncludes amounts accrued for excise tax imposed on common share repurchases that totaled $\n9\n million in 2024 and $\n10\n million in 2023.\nSee Notes to the Consolidated Financial Statements.\n35\nTable of Contents\nConsolidated Statements of Cash Flows\nFor each of the years in the three-year period ended December 28, 2024 \nConsolidated\n(In millions)\n2024\n2023\n2022\nCash flows from operating activities\nIncome from continuing operations\n$\n825\n \n$\n922\n \n$\n862\n \nAdjustments to reconcile income from continuing operations to net cash provided by \n    operating activities of continuing operations:\nNon-cash items:\nDepreciation and amortization\n382\n \n395\n \n397\n \nDeferred income taxes\n(\n48\n)\n(\n192\n)\n(\n220\n)\nAsset impairments and powersports inventory charge\n41\n \n88\n \n2\n \nOther, net\n102\n \n90\n \n94\n \nChanges in assets and liabilities:\nAccounts receivable, net\n(\n96\n)\n(\n9\n)\n(\n26\n)\nInventories\n(\n194\n)\n(\n359\n)\n(\n55\n)\nOther assets\n205\n \n267\n \n35\n \nAccounts payable\n(\n69\n)\n2\n \n235\n \nOther liabilities\n95\n \n276\n \n270\n \nIncome taxes, net\n(\n26\n)\n4\n \n18\n \nPension, net\n(\n225\n)\n(\n202\n)\n(\n165\n)\nCaptive finance receivables, net\n(\n1\n)\n(\n17\n)\n35\n \nOther operating activities, net\n24\n \n2\n \n8\n \nNet cash provided by operating activities of continuing operations\n1,015\n \n1,267\n \n1,490\n \nNet cash used in operating activities of discontinued operations\n(\n1\n)\n(\n1\n)\n(\n2\n)\nNet cash provided by operating activities\n1,014\n \n1,266\n \n1,488\n \nCash flows from investing activities\nCapital expenditures\n(\n364\n)\n(\n402\n)\n(\n354\n)\nNet cash used in business acquisitions\n(\n13\n)\n(\n1\n)\n(\n202\n)\nNet proceeds from corporate-owned life insurance policies\n85\n \n40\n \n23\n \nProceeds from sale of property, plant and equipment\n4\n \n18\n \n22\n \nFinance receivables repaid\n25\n \n26\n \n20\n \nFinance receivables originated\n(\n21\n)\n—\n \n—\n \nOther investing activities, net\n—\n \n2\n \n44\n \nNet cash used in investing activities\n(\n284\n)\n(\n317\n)\n(\n447\n)\nCash flows from financing activities\nDecrease in short-term debt\n(\n1\n)\n—\n \n(\n14\n)\nNet proceeds from long-term debt\n—\n \n348\n \n—\n \nPrincipal payments on long-term debt and nonrecourse debt\n(\n377\n)\n(\n44\n)\n(\n234\n)\nPurchases of Textron common stock\n(\n1,122\n)\n(\n1,168\n)\n(\n867\n)\nProceeds from exercise of stock options\n88\n \n73\n \n44\n \nDividends paid\n(\n12\n)\n(\n16\n)\n(\n17\n)\nOther financing activities, net\n(\n30\n)\n(\n6\n)\n(\n3\n)\nNet cash used in financing activities\n(\n1,454\n)\n(\n813\n)\n(\n1,091\n)\nEffect of exchange rate changes on cash and equivalents\n(\n16\n)\n10\n \n(\n32\n)\nNet increase (decrease) in cash and equivalents\n(\n740\n)\n146\n \n(\n82\n)\nCash and equivalents at beginning of year\n2,181\n \n2,035\n \n2,117\n \nCash and equivalents at end of year\n$\n1,441\n \n$\n2,181\n \n$\n2,035\n \nSee Notes to the Consolidated Financial Statements.\n36\nTable of Contents\nConsolidated Statements of Cash Flows continued\nFor each of the years in the three-year period ended December 28, 2024 \nManufacturing Group\nFinance Group\n(In millions)\n2024\n2023\n2022\n2024\n2023\n2022\nCash flows from operating activities\nIncome from continuing operations\n$\n796\n \n$\n884\n \n$\n835\n \n$\n29\n \n$\n38\n \n$\n27\n \nAdjustments to reconcile income from continuing operations to net cash \n    provided by (used in) operating activities of continuing operations:\nNon-cash items:\nDepreciation and amortization\n382\n \n395\n \n396\n \n—\n \n—\n \n1\n \nDeferred income taxes\n(\n46\n)\n(\n188\n)\n(\n200\n)\n(\n2\n)\n(\n4\n)\n(\n20\n)\nAsset impairments and powersports inventory charge\n41\n \n88\n \n2\n \n—\n \n—\n \n—\n \nOther, net\n115\n \n110\n \n103\n \n(\n13\n)\n(\n20\n)\n(\n9\n)\nChanges in assets and liabilities:\nAccounts receivable, net\n(\n96\n)\n(\n9\n)\n(\n26\n)\n—\n \n—\n \n—\n \nInventories\n(\n194\n)\n(\n359\n)\n(\n55\n)\n—\n \n—\n \n—\n \nOther assets\n205\n \n261\n \n34\n \n—\n \n6\n \n1\n \nAccounts payable\n(\n69\n)\n2\n \n235\n \n—\n \n—\n \n—\n \nOther liabilities\n100\n \n281\n \n277\n \n(\n5\n)\n(\n5\n)\n(\n7\n)\nIncome taxes, net\n(\n25\n)\n5\n \n18\n \n(\n1\n)\n(\n1\n)\n—\n \nPension, net\n(\n225\n)\n(\n202\n)\n(\n165\n)\n—\n \n—\n \n—\n \nOther operating activities, net\n24\n \n2\n \n7\n \n—\n \n—\n \n—\n \nNet cash provided by (used in) operating activities of continuing operations\n1,008\n \n1,270\n \n1,461\n \n8\n \n14\n \n(\n7\n)\nNet cash used in operating activities of discontinued operations\n(\n1\n)\n(\n1\n)\n(\n2\n)\n—\n \n—\n \n—\n \nNet cash provided by (used in) operating activities\n1,007\n \n1,269\n \n1,459\n \n8\n \n14\n \n(\n7\n)\nCash flows from investing activities\nCapital expenditures\n(\n364\n)\n(\n402\n)\n(\n354\n)\n—\n \n—\n \n—\n \nNet cash used in business acquisitions\n(\n13\n)\n(\n1\n)\n(\n202\n)\n—\n \n—\n \n—\n \nNet proceeds from corporate-owned life insurance policies\n85\n \n40\n \n23\n \n—\n \n—\n \n—\n \nProceeds from sale of property, plant and equipment\n4\n \n18\n \n22\n \n—\n \n—\n \n—\n \nFinance receivables repaid\n—\n \n—\n \n—\n \n133\n \n169\n \n147\n \nFinance receivables originated\n—\n \n—\n \n—\n \n(\n130\n)\n(\n160\n)\n(\n92\n)\nOther investing activities, net\n—\n \n—\n \n—\n \n—\n \n2\n \n45\n \nNet cash provided by (used in) investing activities\n(\n288\n)\n(\n345\n)\n(\n511\n)\n3\n \n11\n \n100\n \nCash flows from financing activities\nDecrease in short-term debt\n(\n1\n)\n—\n \n(\n14\n)\n—\n \n—\n \n—\n \nNet proceeds from long-term debt\n—\n \n348\n \n—\n \n—\n \n—\n \n—\n \nPrincipal payments on long-term debt and nonrecourse debt\n(\n361\n)\n(\n7\n)\n(\n18\n)\n(\n16\n)\n(\n37\n)\n(\n216\n)\nPurchases of Textron common stock\n(\n1,122\n)\n(\n1,168\n)\n(\n867\n)\n—\n \n—\n \n—\n \nProceeds from exercise of stock options\n88\n \n73\n \n44\n \n—\n \n—\n \n—\n \nDividends paid\n(\n12\n)\n(\n16\n)\n(\n17\n)\n—\n \n—\n \n—\n \nOther financing activities, net\n(\n30\n)\n(\n6\n)\n(\n3\n)\n—\n \n—\n \n—\n \nNet cash used in financing activities\n(\n1,438\n)\n(\n776\n)\n(\n875\n)\n(\n16\n)\n(\n37\n)\n(\n216\n)\nEffect of exchange rate changes on cash and equivalents\n(\n16\n)\n10\n \n(\n32\n)\n—\n \n—\n \n—\n \nNet increase (decrease) in cash and equivalents\n(\n735\n)\n158\n \n41\n \n(\n5\n)\n(\n12\n)\n(\n123\n)\nCash and equivalents at beginning of year\n2,121\n \n1,963\n \n1,922\n \n60\n \n72\n \n195\n \nCash and equivalents at end of year\n$\n1,386\n \n$\n2,121\n \n$\n1,963\n \n$\n55\n \n$\n60\n \n$\n72\n \nSee Notes to the Consolidated Financial Statements.\n37\nTable of Contents\nNotes to the Consolidated Financial Statements\nNote 1. \nSummary of Significant Accounting Policies\nPrinciples of Consolidation and Financial Statement Presentation\nOur Consolidated Financial Statements include the accounts of Textron Inc. and its majority-owned subsidiaries. Our financings are conducted through \ntwo\n separate borrowing groups. The Manufacturing group consists of Textron Inc. consolidated with its majority-owned subsidiaries that operate in the Textron Aviation, Bell, Textron Systems, Industrial and Textron eAviation segments. The Finance group, which also is the Finance segment, consists of Textron Financial Corporation (TFC) and its consolidated subsidiaries. We designed this framework to enhance our borrowing power by separating the Finance group. Our Manufacturing group operations include the development, production and delivery of tangible goods and services, while our Finance group provides financial services. Due to the fundamental differences between each borrowing group’s activities, investors, rating agencies and analysts use different measures to evaluate each group’s performance. To support those evaluations, we present balance sheet and cash flow information for each borrowing group within the Consolidated Financial Statements.\nOur Finance group provides financing primarily to purchasers of new and pre-owned Textron Aviation aircraft and Bell helicopters manufactured by our Manufacturing group, otherwise known as captive financing. In the Consolidated Statements of Cash Flows, cash received from customers is reflected as operating activities when received from third parties. However, in the cash flow information provided for the separate borrowing groups, cash flows related to captive financing activities are reflected based on the operations of each group. For example, when product is sold by our Manufacturing group to a customer and is financed by the Finance group, the origination of the finance receivable is recorded within investing activities as a cash outflow in the Finance group’s statement of cash flows. Meanwhile, in the Manufacturing group’s statement of cash flows, the cash received from the Finance group on the customer’s behalf is recorded within operating cash flows as a cash inflow. Although cash is transferred between the \ntwo\n borrowing groups, there is no cash transaction reported in the consolidated cash flows at the time of the original financing. These captive financing activities, along with all significant intercompany transactions, are reclassified or eliminated in consolidation.\nCollaborative Arrangements\nOur Bell segment has a strategic alliance agreement with a third-party company to provide engineering, development and test services related to the V-22 aircraft, as well as to produce the V-22 aircraft, under a number of separate contracts with the U.S. Government (V-22 Contracts). The alliance created by this agreement is not a legal entity and has no employees, no assets and no true operations. This agreement creates contractual rights and does not represent an entity in which we have an equity interest. We account for this alliance as a collaborative arrangement with Bell and the third-party company reporting costs incurred and revenues generated from transactions with the U.S. Government in each company’s respective income statement. Neither Bell nor the third-party company is considered to be the principal participant for the transactions recorded under this agreement. Profits on cost-plus contracts are allocated between Bell and the third-party company on a \n50\n%-50% basis. Negotiated profits on fixed-price contracts are also allocated \n50\n%-50%; however, Bell and the third-party company are each responsible for their own cost overruns and are entitled to retain any cost underruns. Based on the contractual arrangement established under the alliance, Bell accounts for its rights and obligations under the specific requirements of the V-22 Contracts allocated to Bell under the work breakdown structure. We account for all of our rights and obligations, including warranty, product and any contingent liabilities, under the specific requirements of the V-22 Contracts allocated to us under the agreement. Revenues and cost of sales reflect our performance under the V-22 Contracts with revenues recognized using the cost-to-cost method.  We include all assets used in performance of the V-22 Contracts that we own and all liabilities arising from our obligations under the V-22 Contracts in our Consolidated Balance Sheets.\nUse of Estimates\nWe prepare our financial statements in conformity with generally accepted accounting principles, which require us to make estimates and assumptions that affect the amounts reported in the financial statements. Actual results could differ from those estimates. Our estimates and assumptions are reviewed periodically, and the effects of changes, if any, are reflected in the Consolidated Statements of Operations in the period that they are determined.\nRevenue Recognition\nRevenue is recognized when control of the product or service promised under the contract is transferred to the customer either at a point in time (e.g., upon delivery) or over time (e.g., as we perform under the contract). We account for a contract when it has approval and commitment from both parties, the rights and payment terms of the parties are identified, the contract has commercial substance and collectability of consideration is probable. Contracts are reviewed to determine whether there is one or multiple performance obligations. A performance obligation is a promise to transfer a distinct product or service to a customer and represents the unit of accounting for revenue recognition. For contracts with multiple performance obligations, the expected consideration, or the transaction price, is allocated to each performance obligation identified in the contract based on the relative standalone selling price of each performance obligation. Revenue is then recognized for the transaction price allocated to the \n38\nTable of Contents\nperformance obligation when control of the promised product or service underlying the performance obligation is transferred. Contract consideration is not adjusted for the effects of a significant financing component when, at contract inception, the period between when control transfers and when the customer will pay for that good or service is one year or less.\nRevenue is classified as product or service revenue based on the predominant attributes of each performance obligation.   \nCommercial Contracts\nThe majority of our contracts with commercial customers have a single performance obligation as there is only one product or service promised or the promise to transfer the product or service is not distinct or separately identifiable from other promises in the contract. Revenue is primarily recognized at a point in time, which is generally when the customer obtains control of the asset upon delivery and customer acceptance. Contract modifications that provide for additional distinct products or services at the standalone selling price are treated as separate contracts.\nFor commercial fixed-wing aircraft, we contract with our customers to sell fully outfitted aircraft, which may include configuration options. The aircraft typically represents a single performance obligation and revenue is recognized upon customer acceptance and delivery. For commercial helicopters, our customers generally contract with us for fully functional basic configuration aircraft and control is transferred upon customer acceptance and delivery. At times, customers may separately contract with us for the installation of accessories and customization to the basic aircraft. If these contracts are entered into at or near the same time of the basic aircraft contract, we assess whether the contracts meet the criteria to be combined. For contracts that are combined, the basic aircraft and the accessories and customization are typically considered to be distinct, and therefore, are separate performance obligations. For these contracts, revenue is recognized on the basic aircraft upon customer acceptance and transfer of title and risk of loss, and on the accessories and customization, upon delivery and customer acceptance. We utilize observable prices to determine the standalone selling prices when allocating the transaction price to these performance obligations.\nThe transaction price for our commercial contracts reflects our estimate of returns, rebates and discounts, which are based on historical, current and forecasted information. Amounts billed to customers for shipping and handling are included in the transaction price and generally are not treated as separate performance obligations as these costs fulfill a promise to transfer the product to the customer. Taxes collected from customers and remitted to government authorities are recorded on a net basis.\nWe primarily provide standard warranty programs for products in our commercial businesses for periods that typically range from \none year\n to \nfive years\n. These assurance-type programs typically cannot be purchased separately and do not meet the criteria to be considered a performance obligation.\nU.S. Government Contracts\nOur contracts with the U.S. Government generally include the design, development, manufacture or modification of aerospace and defense products and related support services. These contracts, which also include those under the U.S. Government-sponsored foreign military sales program, accounted for approximately \n25\n% of total revenues in 2024.  The customer typically contracts with us to provide a significant service of integrating a complex set of tasks and components into a single project or capability, which often results in the delivery of multiple units. Accordingly, the entire contract is accounted for as one performance obligation. In certain circumstances, a contract may include both production and support services, such as logistics and parts plans, which are considered to be distinct in the context of the contract and represent separate performance obligations. When a contract is separated into more than one performance obligation, we generally utilize the expected cost plus a margin approach to determine the standalone selling prices when allocating the transaction price.\nOur contracts are frequently modified for changes in contract specifications and requirements. Most of our contract modifications with the U.S. Government are for products and services that are not distinct from the existing contract due to the significant integration service provided in the context of the contract and are accounted for as part of that existing contract. The effect of these contract modifications on our estimates is recognized using the cumulative catch-up method of accounting.\nContracts with the U.S. Government generally contain clauses that provide lien rights to work-in-process along with clauses that allow the customer to unilaterally terminate the contract for convenience, pay us for costs incurred plus a reasonable profit and take control of any work-in-process. Due to the continuous transfer of control to the U.S. Government, we recognize revenue over the time that we perform under the contract. Selecting the method to measure progress towards completion requires judgment and is based on the nature of the products or service to be provided. We generally use the cost-to-cost method to measure progress for our contracts because it best depicts the transfer of control to the customer that occurs as we incur costs on our contracts.  Under this measure, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the estimated costs at completion of the performance obligation, and revenue is recorded proportionally as costs are incurred.  \n39\nTable of Contents\nThe transaction price for our contracts represents our best estimate of the consideration we will receive and includes assumptions regarding variable consideration as applicable. Certain of our long-term contracts contain incentive fees or other provisions that can either increase or decrease the transaction price. These variable amounts generally are awarded upon achievement of certain performance metrics, program milestones or cost targets and can be based upon customer discretion. We include estimated amounts in the transaction price to the extent it is probable that a significant reversal of cumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is resolved. Our estimates of variable consideration and determination of whether to include estimated amounts in the transaction price are based largely on an assessment of our anticipated performance, historical performance, and all other information that is reasonably available to us.\nTotal contract cost is estimated utilizing current contract specifications and expected engineering requirements. Contract costs typically are incurred over a period of several years, and the estimation of these costs requires substantial judgment. Our cost estimation process is based on the professional knowledge and experience of engineers and program managers along with finance professionals. We review and update our projections of costs quarterly or more frequently when circumstances significantly change.  \nApproximately \n58\n% of our 2024 revenues with the U.S. Government were under fixed-price and fixed-price incentive contracts. Under the typical payment terms of these contracts, the customer pays us either performance-based or progress payments. Performance-based payments represent interim payments of up to \n90\n% of the contract price based on quantifiable measures of performance or on the achievement of specified events or milestones. Progress payments are interim payments of up to \n80\n% of costs incurred as the work progresses. Because the customer retains a small portion of the contract price until completion of the contract, these contracts generally result in revenue recognized in excess of billings. Amounts billed and due from our customers are classified in Accounts receivable, net. The portion of the payments retained by the customer until final contract settlement is not considered a significant financing component because the intent is to protect the customer. For cost-type contracts, we are generally paid for our actual costs incurred within a short period of time.\nFinance Revenues\nFinance revenues primarily include interest on finance receivables, finance lease earnings and portfolio gains/losses. We recognize interest using the interest method, which provides a constant rate of return over the terms of the receivables. Accrual of interest income is suspended if credit quality indicators suggest full collection of principal and interest is doubtful. In addition, we automatically suspend the accrual of interest income for accounts that are contractually delinquent by more than \nthree months\n unless collection is not doubtful. Cash payments on nonaccrual accounts, including finance charges, generally are applied to reduce the net investment balance. Once we conclude that the collection of all principal and interest is no longer doubtful, we resume the accrual of interest and recognize previously suspended interest income at the time either a) the loan becomes contractually current through payment according to the original terms of the loan, or b) if the loan has been modified, following a period of performance under the terms of the modification.\nContract Estimates\nFor contracts where revenue is recognized over time, we recognize changes in estimated contract revenues, costs and profits using the cumulative catch-up method of accounting. This method recognizes the cumulative effect of changes on current and prior periods with the impact of the change from inception-to-date recorded in the current period. Anticipated losses on contracts are recognized in full in the period in which the losses become probable and estimable.\n \nIn 2024 and 2023, our cumulative catch-up adjustments increased segment profit by $\n31\n million and $\n44\n million, respectively, and net income by $\n24\n million and $\n34\n million, respectively ($\n0.12\n and $\n0.17\n per diluted share, respectively). In 2022, our cumulative catch-up adjustments decreased segment profit by $\n16\n million and net income by $\n12\n million ($\n0.06\n per diluted share). Revenue was increased by $\n32\n million and $\n42\n million in 2024 and 2023, respectively, and reduced by $\n25\n million in 2022, related to changes in profit booking rates for performance obligations satisfied in prior periods.\nContract Assets and Liabilities\nContract assets arise from contracts when revenue is recognized over time and the amount of revenue recognized exceeds the amount billed to the customer. These amounts are included in contract assets until the right to payment is no longer conditional on events other than the passage of time and are included in Other current assets in the Consolidated Balance Sheets. Contract liabilities, which are primarily included in Other current liabilities, include deposits, largely from our commercial aviation customers, and billings in excess of revenue recognized.  \nThe incremental costs of obtaining a contract with a customer that is expected to be recovered is expensed as incurred when the period to be benefitted is one year or less.\n40\nTable of Contents\nAccounts Receivable, Net\nAccounts receivable, net includes amounts billed to customers where the right to payment is unconditional. We maintain an allowance for credit losses for our commercial accounts receivable to provide for the estimated amount that will not be collected, even when the risk of loss is remote. The allowance is measured on a collective pool basis when similar risk characteristics exist and is established as a percentage of accounts receivable. We have identified pools with similar risk characteristics, based on customer and industry type and geographic location. The percentage is based on all available and relevant information including age of outstanding receivables and collateral value, if any, historical payment experience and loss history, current economic conditions, and, when reasonable and supportable factors exist, management’s expectation of future economic conditions. For amounts due from the U.S. Government, we have not established an allowance for credit losses as we have zero loss expectation based on a long history of no credit losses and the explicit guarantee of a sovereign entity.\nCash and Equivalents\nCash and equivalents consist of cash and short-term, highly liquid investments with original maturities of three months or less.\nInventories\nInventories are stated at the lower of cost or estimated realizable value. The majority of our inventories are valued using the last-in, first-out (LIFO) method, while the remaining inventories are generally valued using the first-in, first-out (FIFO) method.\nProperty, Plant and Equipment\nProperty, plant and equipment are recorded at cost and are depreciated primarily using the straight-line method. We capitalize expenditures for improvements that increase asset values and extend useful lives.  Property, plant and equipment are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the asset may not be recoverable. If the carrying value of the asset exceeds the sum of the undiscounted expected future cash flows, the asset is written down to fair value.\n \nGoodwill and Intangible Assets\nGoodwill represents the excess of the consideration paid for the acquisition of a business over the fair values assigned to intangible and other net assets of the acquired business. Goodwill and intangible assets deemed to have indefinite lives are not amortized but are subject to an annual impairment test. We evaluate the recoverability of these assets in the fourth quarter of each year or more frequently if events or changes in circumstances, such as declines in sales, earnings or cash flows, or material adverse changes in the business climate, indicate a potential impairment.\nFor our goodwill impairment test, we calculate the fair value of each reporting unit using discounted cash flows.  A reporting unit represents the operating segment unless discrete financial information is prepared and reviewed by segment management for businesses one level below that operating segment, in which case such component is the reporting unit.  In certain instances, we have aggregated components of an operating segment into a single reporting unit based on similar economic characteristics. The discounted cash flows incorporate assumptions for revenue growth rates, operating margins and discount rates that represent our best estimates of current and forecasted market conditions, cost structure, anticipated net cost reductions, and the implied rate of return that we believe a market participant would require for an investment in a business having similar risks and characteristics to the reporting unit being assessed. The fair value of our indefinite-lived intangible assets is primarily determined using the relief of royalty method based on forecasted revenues and royalty rates. If the estimated fair value of the reporting unit or indefinite-lived intangible asset exceeds the carrying value, there is no impairment. Otherwise, an impairment loss is recognized for the amount by which the carrying value exceeds the estimated fair value.\nAcquired intangible assets with finite lives are subject to amortization. These assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the asset may not be recoverable. Amortization of these intangible assets is recognized over their estimated useful lives using a method that reflects the pattern in which the economic benefits of the intangible assets are consumed or otherwise realized. The majority of our intangible assets are amortized based on the cash flow streams used to value the assets, with the remaining assets amortized using the straight-line method.\nFinance Receivables\nFinance receivables primarily include loans provided to purchasers of new and pre-owned Textron Aviation aircraft and Bell helicopters. Finance receivables are generally recorded at the amount of outstanding principal less allowance for credit losses.\nWe establish an allowance for credit losses to cover probable but specifically unknown losses existing in the portfolio. This allowance is established as a percentage of finance receivables categorized by pools with similar risk characteristics, such as collateral or customer type and geographic location. The percentage is based on a combination of factors, including historical loss experience, current delinquency and default trends, collateral values, current economic conditions, and, when reasonable and supportable factors exist, management’s expectation of future economic conditions. \n41\nTable of Contents\nFor those finance receivables that do not have similar risk characteristics, including larger balance accounts specifically identified as impaired, a reserve is established against the carrying amount either based on comparing the expected future cash flows that are discounted at the finance receivable's effective interest rate, or based on the fair value of the underlying collateral if the finance receivable is collateral dependent. The expected future cash flows consider collateral value; financial performance and liquidity of our borrower; existence and financial strength of guarantors; estimated recovery costs, including legal expenses; and costs associated with the repossession and eventual disposal of collateral. When there is a range of potential outcomes, we perform multiple discounted cash flow analyses and weight the potential outcomes based on their relative likelihood of occurrence. The evaluation of our portfolio is inherently subjective, as it requires estimates, including the amount and timing of future cash flows expected to be received on impaired finance receivables and the estimated fair value of the underlying collateral, which may differ from actual results. While our analysis is specific to each individual account, critical factors included in this analysis include industry valuation guides, age and physical condition of the collateral, payment history, and existence and financial strength of guarantors.\nFinance receivables are charged off at the earlier of the date the collateral is repossessed or when management no longer deems the receivable collectible.  Repossessed assets are recorded at their fair value, less estimated cost to sell.\nPension and Postretirement Benefit Obligations\nWe maintain various pension and postretirement plans for our employees globally. Our pension plans include significant benefit obligations, which are calculated based on actuarial valuations. Key assumptions used in determining these obligations and related expenses include expected long-term rates of return on plan assets, discount rates and healthcare cost projections. We evaluate and update these assumptions annually in consultation with third-party actuaries and investment advisors. We also make assumptions regarding employee demographic factors such as retirement patterns, mortality, turnover and rate of compensation increases.\nFor our year-end measurement, our defined benefit plan assets and obligations are measured as of the month-end date closest to our fiscal year-end. We recognize the overfunded or underfunded status of our pension and postretirement plans in the Consolidated Balance Sheets and recognize changes in the funded status of our defined benefit plans in comprehensive income (loss) in the year in which they occur.  To the extent actuarial gains and losses exceed 10% of the higher of the market-related value of assets or the benefit obligation in a year, the excess is recognized as a component of accumulated other comprehensive income (loss) and is amortized into net periodic pension cost over the remaining service period of the active participants.  For plans in which all or almost all of the plan’s participants are inactive, the amortization period is the remaining life expectancy of the inactive participants.  This determination is made on a plan-by-plan basis.\n \nDerivatives and Hedging Activities\nWe are exposed to market risk primarily from changes in currency exchange rates and interest rates. We do not hold or issue derivative financial instruments for trading or speculative purposes.  To manage the volatility relating to our exposures, we net these exposures on a consolidated basis to take advantage of natural offsets.  For the residual portion, we enter into various derivative transactions pursuant to our policies in areas such as counterparty exposure and hedging practices.  Credit risk related to derivative financial instruments is considered minimal and is managed by requiring high credit standards for counterparties and through periodic settlements of positions.\nAll derivative instruments are reported at fair value in the Consolidated Balance Sheets.  Designation to support hedge accounting is performed on a specific exposure basis.  For financial instruments qualifying as cash flow hedges, we record changes in the fair value of derivatives (to the extent they are effective as hedges) in other comprehensive income (loss), net of deferred taxes. Changes in fair value of derivatives not qualifying as hedges are recorded in earnings.\nForeign currency denominated assets and liabilities are translated into U.S. dollars.  Adjustments from currency rate changes are recorded in the cumulative translation adjustment account in shareholders’ equity until the related foreign entity is sold or substantially liquidated.\n  \nLeases\nWe identify leases by evaluating our contracts to determine if the contract conveys the right to use an identified asset for a stated period of time in exchange for consideration. Specifically, we consider whether we can control the underlying asset and have the right to obtain substantially all of the economic benefits or outputs from the asset.  For our contracts that contain both lease components (e.g., fixed payments including rent, real estate taxes and insurance costs) and non-lease components (e.g., common-area maintenance costs or other goods/services), we allocate the consideration in the contract to each component based on its standalone price. Leases with terms greater than 12 months are classified as either operating or finance leases at the commencement date.  For these leases, we capitalize the lesser of a) the present value of the minimum lease payments over the lease term, or b) the fair value of the asset, as a right-of-use asset with an offsetting lease liability. The discount rate used to calculate the present value of the minimum lease payments is typically our incremental borrowing rate, as the rate implicit in the lease is generally not known or determinable. The lease term includes any noncancelable period for which we have the right to use the asset and may include options to extend or terminate the lease when it is reasonably certain that we will exercise the \n42\nTable of Contents\noption.  Operating leases are recognized as a single lease cost on a straight-line basis over the lease term, while finance lease cost is recognized separately as amortization and interest expense.\n  \nProduct Liabilities\nWe accrue for product liability claims and related defense costs when a loss is probable and reasonably estimable.  Our estimates are generally based on the specifics of each claim or incident and our best estimate of the probable loss using historical experience.\nEnvironmental Liabilities and Asset Retirement Obligations\nLiabilities for environmental matters are recorded on a site-by-site basis when it is probable that an obligation has been incurred and the cost can be reasonably estimated. We estimate our accrued environmental liabilities using currently available facts, existing technology, and presently enacted laws and regulations, all of which are subject to a number of factors and uncertainties. Our environmental liabilities are not discounted and do not take into consideration possible future insurance proceeds or significant amounts from claims against other third parties.\nWe have incurred asset retirement obligations primarily related to costs to remove and dispose of underground storage tanks and asbestos materials used in insulation, adhesive fillers and floor tiles. Currently, there is no legal requirement to remove these items  and there is no plan to remodel the related facilities or otherwise cause the impacted items to require disposal. Since these asset retirement obligations are not probable, there is \nno\n related liability recorded in the Consolidated Balance Sheets.\nWarranty Liabilities\nFor our assurance-type warranty programs, we estimate the costs that may be incurred and record a liability in the amount of such costs at the time product revenues are recognized.  Factors that affect this liability include the number of products sold, historical costs per claim, length of warranty period, contractual recoveries from vendors and historical and anticipated rates of warranty claims, including production and warranty patterns for new models.  We assess the adequacy of our recorded warranty liability periodically and adjust the amounts as necessary. Additionally, we may establish a warranty liability related to the issuance of aircraft service bulletins for aircraft no longer covered under the limited warranty programs.\nResearch and Development Costs\nOur customer-funded research and development costs are charged directly to the related contracts, which primarily consist of U.S. Government contracts. In accordance with government regulations, we recover a portion of company-funded research and development costs through overhead rate charges on our U.S. Government contracts.  Research and development costs that are not reimbursable under a contract with the U.S. Government or another customer are charged to expense as incurred.\nIncome Taxes\nThe provision for income tax expense is calculated on reported income before income taxes based on current tax law and includes, in the current period, the cumulative effect of any changes in tax rates from those used previously in determining deferred tax assets and liabilities. Tax laws may require items to be included in the determination of taxable income at different times from when the items are reflected in the financial statements. Deferred tax balances reflect the effects of temporary differences between the financial reporting carrying amounts of assets and liabilities and their tax bases, as well as from net operating losses and tax credit carryforwards, and are stated at enacted tax rates in effect for the year taxes are expected to be paid or recovered.\nDeferred tax assets represent tax benefits for tax deductions or credits available in future years and require certain estimates and assumptions to determine whether it is more likely than not that all or a portion of the benefit will not be realized. The recoverability of these future tax deductions and credits is determined by assessing the adequacy of future expected taxable income from all sources, including the future reversal of existing taxable temporary differences, taxable income in carryback years, estimated future taxable income and available tax planning strategies. Should a change in facts or circumstances lead to a change in judgment about the ultimate recoverability of a deferred tax asset, we record or adjust the related valuation allowance in the period that the change in facts and circumstances occurs, along with a corresponding increase or decrease in income tax expense.  \nWe record tax benefits for uncertain tax positions based upon management’s evaluation of the information available at the reporting date.  To be recognized in the financial statements, the tax position must meet the more-likely-than-not threshold that the position will be sustained upon examination by the tax authority based on technical merits assuming the tax authority has full knowledge of all relevant information. For positions meeting this recognition threshold, the benefit is measured as the largest amount of benefit that meets the more-likely-than-not threshold to be sustained. We periodically evaluate these tax positions based on the latest available information.  For tax positions that do not meet the threshold requirement, we recognize net tax-related interest and penalties for continuing operations in income tax expense.\n43\nTable of Contents\nNote 2. \nGoodwill and Intangible Assets\nGoodwill \nThe changes in the carrying amount of goodwill by segment are as follows:\n(In millions)\nTextron\nAviation\nBell\nTextron\nSystems\nIndustrial\nTextron eAviation\nTotal\nBalance at December 31, 2022\n$\n633\n \n$\n37\n \n$\n1,010\n \n$\n465\n \n$\n138\n \n$\n2,283\n \nForeign currency translation\n—\n \n—\n \n—\n \n5\n \n7\n \n12\n \nBalance at December 30, 2023\n633\n \n37\n \n1,010\n \n470\n \n145\n \n2,295\n \nAcquisitions\n—\n \n—\n \n—\n \n—\n \n10\n \n10\n \nForeign currency translation\n(\n1\n)\n—\n \n—\n \n(\n7\n)\n(\n9\n)\n(\n17\n)\nBalance at December 28, 2024\n$\n632\n \n$\n37\n \n$\n1,010\n \n$\n463\n \n$\n146\n \n$\n2,288\n \nIntangible Assets\nOur intangible assets are summarized below:\nDecember 28, 2024\nDecember 30, 2023\n(Dollars in millions)\nWeighted-Average\nAmortization\nPeriod (in years)\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nTrade names and trademarks\n18\n$\n199\n \n$\n(\n11\n)\n$\n188\n \n$\n200\n \n$\n(\n9\n)\n$\n191\n \nPatents and technology\n15\n509\n \n(\n360\n)\n149\n \n510\n \n(\n333\n)\n177\n \nCustomer relationships and \n   contractual agreements\n15\n356\n \n(\n331\n)\n25\n \n357\n \n(\n326\n)\n31\n \nTotal\n$\n1,064\n \n$\n(\n702\n)\n$\n362\n \n$\n1,067\n \n$\n(\n668\n)\n$\n399\n \nTrade names and trademarks in the table above include $\n169\n million of indefinite-lived intangible assets at both December 28, 2024 and December 30, 2023. Amortization expense totaled $\n34\n million, $\n39\n million and $\n52\n million, in 2024, 2023 and 2022, respectively. Amortization expense is estimated to be approximately $\n32\n million, $\n29\n million, $\n27\n million, $\n26\n million and $\n25\n million in 2025, 2026, 2027, 2028 and 2029, respectively.\nNote 3. \nAccounts Receivable and Finance Receivables\nAccounts Receivable\nAccounts receivable is composed of the following:\n(In millions)\nDecember 28,\n2024\nDecember 30,\n2023\nCommercial\n$\n738\n \n$\n831\n \nU.S. Government contracts\n230\n \n63\n \n968\n \n894\n \nAllowance for credit losses\n(\n19\n)\n(\n26\n)\nTotal\n$\n949\n \n$\n868\n \nFinance Receivables\nFinance receivables are presented in the following table:\n(In millions)\nDecember 28,\n2024\nDecember 30,\n2023\nFinance receivables\n$\n622\n \n$\n609\n \nAllowance for credit losses\n(\n19\n)\n(\n24\n)\nTotal finance receivables, net\n$\n603\n \n$\n585\n \nFinance receivables primarily includes loans provided to purchasers of new and pre-owned Textron Aviation aircraft and Bell helicopters. These loans generally have initial terms ranging from \nfive years\n to \ntwelve years\n and amortization terms ranging from \nfive years\n to \nfifteen years\n; the average loan balance was $\n2.0\n million at December 28, 2024. Loans generally require the customer to pay a significant down payment, along with periodic scheduled principal payments that reduce the outstanding balance through the term of the loan. Our finance receivables are diversified across geographic region and borrower industry. At December 28, \n44\nTable of Contents\n2024, \n58\n% of our finance receivables were distributed internationally and \n42\n% throughout the U.S., compared with \n57\n% and \n43\n%, respectively, at December 30, 2023. \nFinance Receivable Portfolio Quality\nWe internally assess the quality of our finance receivables based on a number of key credit quality indicators and statistics such as delinquency, loan balance to estimated collateral value and the financial strength of individual borrowers and guarantors.  Because many of these indicators are difficult to apply across an entire class of receivables, we evaluate individual loans on a quarterly basis and classify these loans into three categories based on the key credit quality indicators for the individual loan. These three categories are performing, watchlist and nonaccrual.\nWe classify finance receivables as nonaccrual if credit quality indicators suggest full collection of principal and interest is doubtful. In addition, we automatically classify accounts as nonaccrual once they are contractually delinquent by more than \nthree months\n unless collection of principal and interest is not doubtful. Accounts are classified as watchlist when credit quality indicators have deteriorated as compared with typical underwriting criteria, and we believe collection of full principal and interest is probable but not certain. All other finance receivables that do not meet the watchlist or nonaccrual categories are classified as performing.\nWe measure delinquency based on the contractual payment terms of our finance receivables.  In determining the delinquency aging category of an account, any/all principal and interest received is applied to the most past-due principal and/or interest amounts due. If a significant portion of the contractually due payment is delinquent, the entire finance receivable balance is reported in accordance with the most past-due delinquency aging category.\nFinance receivables categorized based on the credit quality indicators and by delinquency aging category are summarized as follows:\n(Dollars in millions)\nDecember 28,\n2024\nDecember 30,\n2023\nPerforming\n$\n612\n \n$\n571\n \nWatchlist\n—\n \n23\n \nNonaccrual\n10\n \n15\n \nNonaccrual as a percentage of finance receivables\n1.61\n%\n2.46\n%\nCurrent and less than 31 days past due\n$\n609\n \n$\n589\n \n31-60 days past due\n13\n \n16\n \n61-90 days past due\n—\n \n—\n \nOver 90 days past due\n—\n \n4\n \n60+ days contractual delinquency as a percentage of finance receivables\n—\n%\n0.66\n%\nAt December 28, 2024, \n44\n% of our performing finance receivables were originated since the beginning of 2022 and \n26\n% were originated from 2019 to 2021 with the remainder prior to 2019. For finance receivables categorized as nonaccrual, \n100\n% were originated prior to 2021. \nOn a quarterly basis, we evaluate individual larger balance accounts for impairment.  A finance receivable is considered impaired when it is probable that we will be unable to collect all amounts due according to the contractual terms of the loan agreement based on our review of the credit quality indicators described above. Impaired finance receivables include both nonaccrual accounts and accounts for which full collection of principal and interest remains probable, but the account’s original terms have been, or are expected to be, significantly modified.  If the modification specifies an interest rate equal to or greater than a market rate for a finance receivable with comparable risk, the account is not considered impaired in years subsequent to the modification. Our impaired finance receivables were insignificant at December 28, 2024 and December 30, 2023.\n45\nTable of Contents\nNote 4. \nInventories\nInventories are composed of the following:\n(In millions)\nDecember 28,\n2024\nDecember 30,\n2023\nFinished goods\n$\n1,138\n \n$\n1,072\n \nWork in process\n1,769\n \n1,736\n \nRaw materials and components\n1,164\n \n1,106\n \nTotal\n$\n4,071\n \n$\n3,914\n \nAt December 28, 2024, \n69\n% of inventories were valued using the LIFO method, compared with \n68\n% at December 30, 2023. Inventories valued at LIFO cost would have been higher by approximately $\n877\n million and $\n701\n million, at December 28, 2024 and December 30, 2023, respectively, if they had been valued using the FIFO method.\n \nNote 5. \nProperty, Plant and Equipment, Net\nOur Manufacturing group’s property, plant and equipment, net is composed of the following:\n(Dollars in millions)\nUseful Lives\n(in years)\nDecember 28,\n2024\nDecember 30,\n2023\nLand, buildings and improvements\n2\n-\n40\n$\n2,364\n \n$\n2,229\n \nMachinery and equipment\n1\n-\n20\n5,636\n \n5,495\n \n8,000\n \n7,724\n \nAccumulated depreciation and amortization\n(\n5,471\n)\n(\n5,247\n)\nTotal\n$\n2,529\n \n$\n2,477\n \nThe Manufacturing group's depreciation expense totaled $\n344\n million, $\n353\n million and $\n340\n million in 2024, 2023 and 2022, respectively.\nNote 6. \nAccounts Payable and Liabilities\nAccounts Payable\nSupplier Financing Arrangement\nWe have a financing arrangement with one of our suppliers that extends payment terms for up to \n190\n days from the receipt of goods and provides for the supplier to be paid by a financial institution earlier than maturity. In June 2024, the maximum amount available under the financing arrangement was increased by $\n25\n million to $\n200\n million. This financing arrangement expires in April 2027. At December 28, 2024 and December 30, 2023, the amount due under the supplier financing arrangement was $\n50\n million and $\n125\n million, respectively. During 2024, the amounts added under this arrangement totaled $\n247\n million and the amounts settled totaled $\n322\n million.\nOther Current Liabilities\nThe other current liabilities of our Manufacturing group are summarized below:\n(In millions)\nDecember 28,\n2024\nDecember 30,\n2023\nContract liabilities\n$\n1,734\n \n$\n1,595\n \nSalaries, wages and employer taxes\n456\n \n466\n \nCurrent portion of warranty and product repair and maintenance program liabilities\n177\n \n215\n \nOther\n727\n \n722\n \nTotal\n$\n3,094\n \n$\n2,998\n \n46\nTable of Contents\nWarranty Liability\nChanges in our current and non-current warranty liability are as follows:\n(In millions)\n2024\n2023\n2022\nBalance at beginning of year\n$\n172\n \n$\n149\n \n$\n127\n \nProvision\n79\n \n76\n \n73\n \nSettlements\n(\n72\n)\n(\n69\n)\n(\n60\n)\nAdjustments*\n(\n6\n)\n16\n \n9\n \nBalance at end of year\n$\n173\n \n$\n172\n \n$\n149\n \n* Adjustments include changes to prior year estimates, new issues on prior year sales, currency translation adjustments and acquisitions.\nNote 7. \nLeases\nWe primarily lease certain manufacturing plants, offices, warehouses, training and service centers at various locations worldwide that are classified as either operating or finance leases. Our leases have remaining lease terms up to \n24\n years, which include options to \nextend\n the lease term for periods up to \n20\n years when it is reasonably certain the option will be exercised. \nOperating lease cost totaled $\n74\n million, $\n69\n million and $\n69\n million in 2024, 2023 and 2022, respectively. Cash paid for operating lease liabilities approximated the lease expense and is classified in cash flows from operating activities. Noncash transactions related to operating leases totaled $\n49\n million, $\n54\n million and $\n58\n million in 2024, 2023 and 2022, respectively, reflecting the recognition of operating lease assets and liabilities for new or extended leases. In 2024, non-cash transactions included the recognition of a $\n72\n million asset and liability related to a new finance lease that matures in 2028. Finance lease, variable and short-term lease costs were not significant. \nBalance sheet and other information related to our leases is as follows: \n(Dollars in millions)\nDecember 28,\n2024\nDecember 30,\n2023\nOperating leases:\nOther assets\n$\n360\n \n$\n371\n \nOther current liabilities\n55\n \n55\n \nOther liabilities\n316\n \n326\n \nWeighted-average remaining lease term (in years)\n10.0\n10.3\nWeighted-average discount rate\n4.84\n%\n4.70\n%\nFinance leases:\nProperty, plant and equipment, less accumulated amortization\n \n  of $\n9\n million and $\n8\n million, respectively\n$\n95\n \n$\n20\n \nLong-term debt, including current portion\n97\n \n23\n \nWeighted-average remaining lease term (in years)\n5.9\n14.9\nWeighted-average discount rate\n6.72\n%\n4.55\n%\nAt December 28, 2024, maturities of our operating lease liabilities on an undiscounted basis totaled $\n69\n million for 2025, $\n56\n million for 2026, $\n47\n million for 2027, $\n45\n million for 2028, $\n40\n million for 2029 and $\n220\n million thereafter.\n47\nTable of Contents\nNote 8. \nDebt and Credit Facilities\nOur debt is summarized in the table below:\n(In millions)\nDecember 28,\n2024\nDecember 30,\n2023\nManufacturing group\n4.30\n% due 2024\n$\n—\n \n$\n350\n \n3.875\n% due 2025\n350\n \n350\n \n4.00\n% due 2026\n350\n \n350\n \n3.65\n% due 2027\n350\n \n350\n \n3.375\n% due 2028\n300\n \n300\n \n3.90\n% due 2029\n300\n \n300\n \n3.00\n% due 2030\n650\n \n650\n \n2.45\n% due 2031\n500\n \n500\n \n6.10\n% due 2033\n350\n \n350\n \nOther (weighted-average rate of \n5.87\n% and \n2.44\n%, respectively)\n97\n \n26\n \nTotal Manufacturing group debt\n$\n3,247\n \n$\n3,526\n \nLess: Current portion of long-term debt\n(\n357\n)\n(\n357\n)\nTotal Long-term debt\n$\n2,890\n \n$\n3,169\n \nFinance group\nVariable-rate note due 2025 (weighted-average rate of \n5.70\n% and \n6.72\n%, respectively)\n$\n25\n \n$\n25\n \nFixed-rate note due 2027 (\n4.40\n%)\n50\n \n50\n \nFloating Rate Junior Subordinated Notes due 2067 (\n6.52\n% and \n7.38\n%, respectively)\n264\n \n264\n \nOther\n2\n \n9\n \nTotal Finance group debt\n$\n341\n \n$\n348\n \nThe following table shows required principal payments during the next five years on debt outstanding at December 28, 2024:\n(In millions)\n2025\n2026\n2027\n2028\n2029\nManufacturing group\n$\n357\n \n$\n355\n \n$\n355\n \n$\n375\n \n$\n301\n \nFinance group\n26\n \n1\n \n50\n \n—\n \n—\n \nTotal\n$\n383\n \n$\n356\n \n$\n405\n \n$\n375\n \n$\n301\n \nTextron has a senior unsecured revolving credit facility for an aggregate principal amount of $\n1.0\n billion, of which $\n100\n million is available for the issuance of letters of credit. We may elect to increase the aggregate amount of commitments under the facility to up to $\n1.3\n billion by designating an additional lender or by an existing lender agreeing to increase its commitment. The facility expires in October 2027 and provides for \ntwo\n \none-year\n extensions at our option with the consent of lenders representing a majority of the commitments under the facility.  At December 28, 2024 and December 30, 2023, there were \nno\n amounts borrowed against the facility and there were $\n9\n million of outstanding letters of credit issued under the facility.\nFloating Rate Junior Subordinated Notes\nThe Finance group’s $\n264\n million of Floating Rate Junior Subordinated Notes are unsecured and rank junior to all of its existing and future senior debt. The notes mature on \nFebruary 15, 2067\n; however, we have the right to redeem the notes at par at any time and we are obligated to redeem the notes beginning on \nFebruary 15, 2042\n.  In 2023, TFC repurchased $\n8\n million of these notes. Interest is variable at the \nthree-month CME Term Secured Overnight Financing Rate\n + \n1.99661\n%.\nSupport Agreement\nUnder a Support Agreement between Textron and TFC, Textron is required to maintain a controlling interest in TFC. The agreement, as amended in December 2015, also requires Textron to ensure that TFC maintains fixed charge coverage of no less than \n125\n% and consolidated shareholders' equity of no less than $\n125\n million. There were \nno\n cash contributions required to be paid to TFC in 2024, 2023 and 2022 to maintain compliance with the support agreement.\n48\nTable of Contents\nNote 9. \nDerivative Instruments and Fair Value Measurements\nWe measure fair value at the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date.  We prioritize the assumptions that market participants would use in pricing the asset or liability into a three-tier fair value hierarchy.  This fair value hierarchy gives the highest priority (Level 1) to quoted prices in active markets for identical assets or liabilities and the lowest priority (Level 3) to unobservable inputs in which little or no market data exist, requiring companies to develop their own assumptions.  Observable inputs that do not meet the criteria of Level 1, which include quoted prices for similar assets or liabilities in active markets or quoted prices for identical assets and liabilities in markets that are not active, are categorized as Level 2.  Level 3 inputs are those that reflect our estimates about the assumptions market participants would use in pricing the asset or liability based on the best information available in the circumstances.  Valuation techniques for assets and liabilities measured using Level 3 inputs may include methodologies such as the market approach, the income approach or the cost approach and may use unobservable inputs such as projections, estimates and management’s interpretation of current market data.  These unobservable inputs are utilized only to the extent that observable inputs are not available or cost effective to obtain.\nAssets and Liabilities Recorded at Fair Value on a Recurring Basis\nWe manufacture and sell our products in a number of countries throughout the world, and, therefore, we are exposed to movements in foreign currency exchange rates. We primarily utilize foreign currency exchange contracts with maturities of no more than \nthree years\n to manage this volatility. These contracts qualify as cash flow hedges and are intended to offset the effect of exchange rate fluctuations on forecasted sales, inventory purchases and overhead expenses. Net gains and losses recognized in earnings and Accumulated other comprehensive loss on cash flow hedges, including gains and losses related to hedge ineffectiveness, were not significant in the periods presented.  \nOur foreign currency exchange contracts are measured at fair value using the market method valuation technique.  The inputs to this technique utilize current foreign currency exchange forward market rates published by third-party leading financial news and data providers.  These are observable data that represent the rates that the financial institution uses for contracts entered into at that date; however, they are not based on actual transactions, so they are classified as Level 2. At December 28, 2024 and December 30, 2023, we had foreign currency exchange contracts with notional amounts upon which the contracts were based of $\n464\n million and $\n478\n million, respectively.  At December 28, 2024, the fair value amounts of our foreign currency exchange contracts were a $\n5\n million asset and a $\n19\n million liability.  At December 30, 2023, the fair value amount of our foreign currency exchange contracts was a $\n4\n million asset and a $\n3\n million liability.\nOur Finance group enters into interest rate swap agreements to mitigate certain exposures to fluctuations in interest rates. By using these contracts, we are able to convert floating-rate cash flows to fixed-rate cash flows.  These agreements are designated as cash flow hedges. The fair value of these interest rate swap agreements is determined using values published by third-party leading financial news and data providers. These values are observable data that represent the value that financial institutions use for contracts entered into at that date, but are not based on actual transactions, so they are classified as Level 2.  The fair value of our outstanding interest rate swap agreements was an $\n8\n million and a $\n4\n million asset at December 28, 2024 and December 30, 2023, respectively.\nAt December 28, 2024, our Finance group had interest rate swap agreements related to its Floating Rate Junior Subordinated Notes for an aggregate notional amount of $\n264\n million that effectively converts the variable-rate interest for these Notes to a weighted-average fixed rate of \n5.20\n%. These agreements have maturities ranging from August 2025 to August 2029. In 2024, we also entered into a new swap agreement related to these Notes with a notional amount of $\n30\n million and a weighted-average fixed rate of \n5.10\n%; this agreement has a forward start date of August 15, 2025 and matures on August 15, 2030. At December 30, 2023, interest rate swap agreements related to these Notes had an aggregate notional amount of $\n185\n million with a weighted-average fixed rate of \n5.17\n%.  At December 28, 2024 and December 30, 2023, we had an interest rate swap agreement with a notional amount of $\n25\n million that matures in June 2025 and effectively converts variable-rate interest on a term loan to a fixed rate of \n4.13\n%.\n49\nTable of Contents\nAssets and Liabilities Not Recorded at Fair Value\nThe carrying value and estimated fair value of our financial instruments that are not reflected in the financial statements at fair value are as follows:\nDecember 28, 2024\nDecember 30, 2023\n(In millions)\nCarrying\nValue\nEstimated\nFair Value\nCarrying\nValue\nEstimated\nFair Value\nManufacturing group\nDebt, excluding leases\n$\n(\n3,164\n)\n$\n(\n2,989\n)\n$\n(\n3,520\n)\n$\n(\n3,342\n)\nFinance group\nFinance receivables, excluding leases\n439\n \n454\n \n417\n \n423\n \nDebt\n(\n341\n)\n(\n311\n)\n(\n348\n)\n(\n293\n)\nFair value for the Manufacturing group debt is determined using market observable data for similar transactions (Level 2).  The fair value for the Finance group debt was determined primarily based on discounted cash flow analyses using observable market inputs from debt with similar duration, subordination and credit default expectations (Level 2). Fair value estimates for finance receivables were determined based on internally developed discounted cash flow models primarily utilizing significant unobservable inputs (Level 3), which include estimates of the rate of return, financing cost, capital structure and/or discount rate expectations of current market participants combined with estimated loan cash flows based on credit losses, payment rates and expectations of borrowers’ ability to make payments on a timely basis.\nNote 10. \nShareholders’ Equity\nCapital Stock\nWe have authorization for \n15\n million shares of preferred stock with a par value of $\n0.01\n and \n500\n million shares of common stock with a par value of $\n0.125\n.  \nOutstanding common stock activity is presented below:\n(In thousands)\n2024\n2023\n2022\nBalance at beginning of year\n192,898\n \n206,161\n \n216,935\n \nShare repurchases\n(\n12,890\n)\n(\n16,169\n)\n(\n13,075\n)\nShare-based compensation activity\n2,956\n \n2,906\n \n2,301\n \nBalance at end of year\n182,964\n \n192,898\n \n206,161\n \nEarnings Per Share\nWe calculate basic and diluted earnings per share (EPS) based on net income, which approximates income available to common shareholders for each period.  Basic EPS is calculated using the two-class method, which includes the weighted-average number of common shares outstanding during the period and restricted stock units to be paid in stock that are deemed participating securities as they provide nonforfeitable rights to dividends.  Diluted EPS considers the dilutive effect of all potential future common stock, including stock options.\nThe weighted-average shares outstanding for basic and diluted EPS are as follows:\n(In thousands)\n2024\n2023\n2022\nBasic weighted-average shares outstanding\n188,318\n \n199,719\n \n212,809\n \nDilutive effect of stock options\n1,989\n \n2,055\n \n2,164\n \nDiluted weighted-average shares outstanding\n190,307\n \n201,774\n \n214,973\n \nIn 2024, 2023 and 2022, stock options to purchase \n0.9\n million, \n1.5\n million and \n1.0\n million shares, respectively, of common stock were excluded from the calculation of diluted weighted-average shares outstanding as their effect would have been anti-dilutive.\n50\nTable of Contents\nAccumulated Other Comprehensive Loss\nThe components of Accumulated other comprehensive loss are presented below:\n(In millions)\nPension and\nPostretirement\nBenefits\nAdjustments\nForeign\nCurrency\nTranslation\nAdjustments\nDeferred\nGains (Losses)\non Hedge\nContracts\nAccumulated\nOther\nComprehensive\nLoss\nBalance at December 31, 2022\n$\n(\n516\n)\n$\n(\n94\n)\n$\n(\n2\n)\n$\n(\n612\n)\nOther comprehensive loss before reclassifications\n(\n82\n)\n45\n \n(\n1\n)\n(\n38\n)\nReclassified from Accumulated other comprehensive loss\n—\n \n—\n \n6\n \n6\n \nBalance at December 30, 2023\n$\n(\n598\n)\n$\n(\n49\n)\n$\n3\n \n$\n(\n644\n)\nOther comprehensive income before reclassifications\n418\n \n(\n74\n)\n(\n9\n)\n335\n \nReclassified from Accumulated other comprehensive loss\n1\n \n3\n \n1\n \n5\n \nBalance at December 28, 2024\n$\n(\n179\n)\n$\n(\n120\n)\n$\n(\n5\n)\n$\n(\n304\n)\nOther Comprehensive Income (Loss)\nThe before and after-tax components of other comprehensive income (loss) are presented below:\n2024\n2023\n2022\n(In millions)\nPre-Tax\nAmount\nTax\n(Expense)\nBenefit\nAfter-\nTax\nAmount\nPre-Tax\nAmount\nTax\n(Expense)\nBenefit\nAfter-\nTax\nAmount\nPre-Tax\nAmount\nTax\n(Expense)\nBenefit\nAfter-\nTax\nAmount\nPension and postretirement benefits \n  adjustments:\nUnrealized gains (losses)\n$\n568\n \n$\n(\n136\n)\n$\n432\n \n$\n(\n102\n)\n$\n25\n \n$\n(\n77\n)\n$\n285\n \n$\n(\n67\n)\n$\n218\n \nAmortization of net actuarial (gain) loss*\n(\n5\n)\n1\n \n(\n4\n)\n(\n7\n)\n2\n \n(\n5\n)\n83\n \n(\n20\n)\n63\n \nAmortization of prior service cost*\n8\n \n(\n3\n)\n5\n \n8\n \n(\n3\n)\n5\n \n8\n \n(\n2\n)\n6\n \nRecognition of prior service cost\n(\n19\n)\n5\n \n(\n14\n)\n(\n7\n)\n2\n \n(\n5\n)\n(\n4\n)\n—\n \n(\n4\n)\nPension and postretirement benefits \n  adjustments, net\n552\n \n(\n133\n)\n419\n \n(\n108\n)\n26\n \n(\n82\n)\n372\n \n(\n89\n)\n283\n \nForeign currency translation adjustments:\nForeign currency translation adjustments\n(\n74\n)\n—\n \n(\n74\n)\n45\n \n—\n \n45\n \n(\n103\n)\n—\n \n(\n103\n)\nOther\n3\n \n—\n \n3\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nForeign currency translation adjustments, net\n(\n71\n)\n—\n \n(\n71\n)\n45\n \n—\n \n45\n \n(\n103\n)\n—\n \n(\n103\n)\nDeferred gains (losses) on hedge contracts:\nCurrent deferrals\n(\n11\n)\n2\n \n(\n9\n)\n(\n2\n)\n1\n \n(\n1\n)\n(\n7\n)\n4\n \n(\n3\n)\nReclassification adjustments\n2\n \n(\n1\n)\n1\n \n8\n \n(\n2\n)\n6\n \n—\n \n—\n \n—\n \nDeferred gains (losses) on hedge\n  contracts, net\n(\n9\n)\n1\n \n(\n8\n)\n6\n \n(\n1\n)\n5\n \n(\n7\n)\n4\n \n(\n3\n)\nTotal\n$\n472\n \n$\n(\n132\n)\n$\n340\n \n$\n(\n57\n)\n$\n25\n \n$\n(\n32\n)\n$\n262\n \n$\n(\n85\n)\n$\n177\n \n* These components of other comprehensive income (loss) are included in the computation of net periodic pension cost. See Note 14 for additional information.\n51\nTable of Contents\nNote 11. \nSegment Financial Information\nWe operate in, and report financial information for, the following \nsix\n operating segments: Textron Aviation, Bell, Textron Systems, Industrial, Textron eAviation and Finance. The accounting policies of the segments are the same as those described in Note 1.\nTextron Aviation products and services include Cessna Citation jets, Beechcraft and Cessna turboprop aircraft, military trainer and defense aircraft, piston engine aircraft, advanced flight training devices, aftermarket parts and maintenance, inspection and repair services. Textron Aviation has a diverse customer base including fractional aircraft businesses, charter and fleet operators, corporate aviation, individual buyers, training schools, airlines, and special mission, military and government operators.\nBell products and services include development of a next generation tiltrotor aircraft, the V-22 tiltrotor aircraft, advanced military helicopters, and aftermarket parts and support services to the U.S. and non-U.S. governments. Bell also supplies commercial helicopters and aftermarket parts and services to corporate, private, law enforcement, utility, public safety and emergency medical helicopter operators, and U.S. and foreign governments.\nTextron Systems products and services include electronic systems and solutions, advanced marine craft, piston aircraft engines, live military air-to-air and air-to-ship training, weapons and related components, unmanned aircraft systems, and both manned and unmanned armored and specialty vehicles for U.S. and international military, government and commercial customers.\nIndustrial products and markets include the following:\n•\nKautex products include blow-molded plastic fuel systems, including conventional plastic fuel tanks and pressurized fuel tanks for hybrid vehicle applications, clear-vision systems, plastic tanks for selective catalytic reduction systems and battery systems for use in electric vehicles, from hybrid to full battery-powered, that are sold to automobile OEMs; and\n•\nTextron Specialized Vehicles products include golf cars, off-road utility vehicles, powersports products, light transportation vehicles, aviation ground support equipment, professional turf-maintenance equipment and specialized turf-care vehicles that are marketed primarily to golf courses and resorts, government agencies and municipalities, consumers, outdoor enthusiasts, and commercial and industrial users.\nThe Textron eAviation segment is focused on research and development initiatives related to sustainable aviation solutions and also manufactures a family of light aircraft and gliders with both electric and combustion engines.  \nThe Finance segment provides financing primarily to purchasers of new and pre-owned Textron Aviation aircraft and Bell helicopters.\nIn November 2023, the Financial Accounting Standards Board issued Accounting Standard Update (ASU) No. 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which requires a public entity to disclose, on an annual and interim basis, significant segment expenses and other segment items that are regularly provided to the Chief Operating Decision Maker (CODM). The new standard is effective for fiscal years beginning after December 15, 2023. We adopted ASU 2023-07 in the fourth quarter of 2024. In connection with the adoption of this standard, research and development costs previously included within Cost of products sold are now reported on a separate line in our Consolidated Statements of Operations. Prior period amounts have been recast to conform to the new presentation.\nTextron’s CODM is its Chairman and Chief Executive Officer, Scott Donnelly. Mr. Donnelly utilizes segment profit to evaluate the performance of the segments to establish management's compensation and for decision-making purposes, including the allocation of capital resources between segments. Segment profit for the manufacturing segments excludes the non-service components of pension and postretirement income, net; LIFO inventory provision; intangible asset amortization; interest expense, net for Manufacturing group; certain corporate expenses; gains/losses on major business dispositions; special charges; and the inventory valuation charge to write down production-related powersports inventory discussed in Note 15. The measurement for the Finance segment includes interest income and expense along with intercompany interest income and expense. \n52\nTable of Contents\nOur revenues and expenses by segment are provided below:\n(in millions)\nTextron Aviation\nBell\nTextron Systems\nIndustrial\nTextron eAviation\nFinance\nTotal\n2024\nRevenues\n$\n5,284\n \n$\n3,579\n \n$\n1,241\n \n$\n3,515\n \n$\n33\n \n$\n50\n \n$\n13,702\n \nCosts and expenses:\nCost of sales\n4,102\n \n2,899\n \n929\n \n2,993\n \n29\n \n—\n \n10,952\n \nResearch and development costs\n208\n \n97\n \n51\n \n72\n \n63\n \n—\n \n491\n \nSelling and administrative expense\n408\n \n213\n \n107\n \n299\n \n17\n \n(\n4\n)\n1,040\n \nInterest expense, net\n—\n \n—\n \n—\n \n—\n \n—\n \n19\n \n19\n \nSegment profit (loss)\n$\n566\n \n$\n370\n \n$\n154\n \n$\n151\n \n$\n(\n76\n)\n$\n35\n \n$\n1,200\n \n2023\nRevenues\n$\n5,373\n \n$\n3,147\n \n$\n1,235\n \n$\n3,841\n \n$\n32\n \n$\n55\n \n$\n13,683\n \nCosts and expenses:\nCost of sales\n4,116\n \n2,392\n \n925\n \n3,221\n \n35\n \n—\n \n10,689\n \nResearch and development costs\n199\n \n192\n \n53\n \n80\n \n46\n \n—\n \n570\n \nSelling and administrative expense\n409\n \n243\n \n110\n \n312\n \n14\n \n(\n6\n)\n1,082\n \nInterest expense, net\n—\n \n—\n \n—\n \n—\n \n—\n \n15\n \n15\n \nSegment profit (loss)\n$\n649\n \n$\n320\n \n$\n147\n \n$\n228\n \n$\n(\n63\n)\n$\n46\n \n$\n1,327\n \n2022\nRevenues\n$\n5,073\n \n$\n3,091\n \n$\n1,172\n \n$\n3,465\n \n$\n16\n \n$\n52\n \n$\n12,869\n \nCosts and expenses:\nCost of sales\n3,905\n \n2,316\n \n878\n \n2,959\n \n18\n \n—\n \n10,076\n \nResearch and development costs\n191\n \n266\n \n53\n \n71\n \n20\n \n—\n \n601\n \nSelling and administrative expense\n417\n \n227\n \n109\n \n280\n \n2\n \n8\n \n1,043\n \nInterest expense, net\n—\n \n—\n \n—\n \n—\n \n—\n \n13\n \n13\n \nSegment profit (loss)\n$\n560\n \n$\n282\n \n$\n132\n \n$\n155\n \n$\n(\n24\n)\n$\n31\n \n$\n1,136\n \nA reconciliation of segment profit to income from continuing operations before income taxes is presented below:\n(in millions)\n2024\n2023\n2022\nSegment profit\n$\n1,200\n \n$\n1,327\n \n$\n1,136\n \nUnallocated amounts:\nCorporate expenses and other, net\n(\n116\n)\n(\n143\n)\n(\n143\n)\nInterest expense, net for Manufacturing group\n(\n78\n)\n(\n62\n)\n(\n94\n)\nLIFO inventory provision\n(\n176\n)\n(\n107\n)\n(\n71\n)\nIntangible asset amortization\n(\n34\n)\n(\n39\n)\n(\n52\n)\nSpecial charges*\n(\n78\n)\n(\n126\n)\n—\n \nInventory charge*\n(\n38\n)\n—\n \n—\n \nNon-service components of pension and postretirement income, net\n263\n \n237\n \n240\n \nIncome from continuing operations before income taxes\n$\n943\n \n$\n1,087\n \n$\n1,016\n \n* See Note 15 for additional information.\n53\nTable of Contents\nOther information by segment is provided below:\nAssets\nCapital Expenditures\nDepreciation and Amortization\n(In millions)\nDecember 28,\n2024\nDecember 30,\n2023\n2024\n2023\n2022\n2024\n2023\n2022\nTextron Aviation\n$\n4,624\n \n$\n4,542\n \n$\n136\n \n$\n138\n \n$\n138\n \n$\n164\n \n$\n160\n \n$\n152\n \nBell\n2,992\n \n2,869\n \n122\n \n119\n \n80\n \n86\n \n89\n \n90\n \nTextron Systems\n2,036\n \n2,008\n \n40\n \n48\n \n57\n \n48\n \n41\n \n49\n \nIndustrial\n2,378\n \n2,520\n \n62\n \n91\n \n78\n \n70\n \n89\n \n93\n \nTextron eAviation\n286\n \n287\n \n4\n \n4\n \n1\n \n7\n \n7\n \n2\n \nFinance\n680\n \n661\n \n—\n \n—\n \n—\n \n—\n \n—\n \n1\n \nCorporate\n3,842\n \n3,969\n \n—\n \n2\n \n—\n \n7\n \n9\n \n10\n \nTotal\n$\n16,838\n \n$\n16,856\n \n$\n364\n \n$\n402\n \n$\n354\n \n$\n382\n \n$\n395\n \n$\n397\n \nAt December 28, 2024 and December 30, 2023, \n86\n% and \n85\n%, respectively, of our property, plant and equipment, net was located in the United States.\n \nNote 12. \nRevenues\nDisaggregation of Revenues\nOur revenues disaggregated by major product type are presented below:\n(In millions)\n2024\n2023\n2022\nAircraft\n$\n3,374\n \n$\n3,577\n \n$\n3,387\n \nAftermarket parts and services\n1,910\n \n1,796\n \n1,686\n \nTextron Aviation\n$\n5,284\n \n$\n5,373\n \n$\n5,073\n \nMilitary aircraft and support programs\n2,048\n \n1,701\n \n1,740\n \nCommercial helicopters, parts and services\n1,531\n \n1,446\n \n1,351\n \nBell\n$\n3,579\n \n$\n3,147\n \n$\n3,091\n \nTextron Systems\n$\n1,241\n \n$\n1,235\n \n$\n1,172\n \nFuel systems and functional components\n1,891\n \n1,954\n \n1,771\n \nSpecialized vehicles\n1,624\n \n1,887\n \n1,694\n \nIndustrial\n$\n3,515\n \n$\n3,841\n \n$\n3,465\n \nTextron eAviation\n$\n33\n \n$\n32\n \n$\n16\n \nFinance\n$\n50\n \n$\n55\n \n$\n52\n \nTotal revenues\n$\n13,702\n \n$\n13,683\n \n$\n12,869\n \n54\nTable of Contents\nOur revenues for our segments by customer type and geographic location are presented below:\n(In millions)\nTextron\nAviation\nBell\nTextron\nSystems\nIndustrial\nTextron eAviation\nFinance\nTotal\n2024\nCustomer type:\nCommercial\n$\n4,985\n \n$\n1,490\n \n$\n292\n \n$\n3,482\n \n$\n33\n \n$\n50\n \n$\n10,332\n \nU.S. Government\n299\n \n2,089\n \n949\n \n33\n \n—\n \n—\n \n3,370\n \nTotal revenues\n$\n5,284\n \n$\n3,579\n \n$\n1,241\n \n$\n3,515\n \n$\n33\n \n$\n50\n \n$\n13,702\n \nGeographic location:\nUnited States\n$\n4,019\n \n$\n2,644\n \n$\n1,112\n \n$\n1,865\n \n$\n19\n \n$\n17\n \n$\n9,676\n \nEurope\n371\n \n85\n \n45\n \n693\n \n11\n \n5\n \n1,210\n \nOther international\n894\n \n850\n \n84\n \n957\n \n3\n \n28\n \n2,816\n \nTotal revenues\n$\n5,284\n \n$\n3,579\n \n$\n1,241\n \n$\n3,515\n \n$\n33\n \n$\n50\n \n$\n13,702\n \n2023\nCustomer type:\nCommercial\n$\n5,155\n \n$\n1,407\n \n$\n282\n \n$\n3,819\n \n$\n32\n \n$\n55\n \n$\n10,750\n \nU.S. Government\n218\n \n1,740\n \n953\n \n22\n \n—\n \n—\n \n2,933\n \nTotal revenues\n$\n5,373\n \n$\n3,147\n \n$\n1,235\n \n$\n3,841\n \n$\n32\n \n$\n55\n \n$\n13,683\n \nGeographic location:\nUnited States\n$\n3,873\n \n$\n2,228\n \n$\n1,103\n \n$\n2,067\n \n$\n17\n \n$\n17\n \n$\n9,305\n \nEurope\n432\n \n149\n \n54\n \n766\n \n11\n \n2\n \n1,414\n \nOther international\n1,068\n \n770\n \n78\n \n1,008\n \n4\n \n36\n \n2,964\n \nTotal revenues\n$\n5,373\n \n$\n3,147\n \n$\n1,235\n \n$\n3,841\n \n$\n32\n \n$\n55\n \n$\n13,683\n \n2022\nCustomer type:\nCommercial\n$\n4,959\n \n$\n1,284\n \n$\n274\n \n$\n3,450\n \n$\n16\n \n$\n52\n \n$\n10,035\n \nU.S. Government\n114\n \n1,807\n \n898\n \n15\n \n—\n \n—\n \n2,834\n \nTotal revenues\n$\n5,073\n \n$\n3,091\n \n$\n1,172\n \n$\n3,465\n \n$\n16\n \n$\n52\n \n$\n12,869\n \nGeographic location:\nUnited States\n$\n3,520\n \n$\n2,242\n \n$\n1,054\n \n$\n1,862\n \n$\n7\n \n$\n17\n \n$\n8,702\n \nEurope\n579\n \n139\n \n42\n \n699\n \n6\n \n3\n \n1,468\n \nOther international\n974\n \n710\n \n76\n \n904\n \n3\n \n32\n \n2,699\n \nTotal revenues\n$\n5,073\n \n$\n3,091\n \n$\n1,172\n \n$\n3,465\n \n$\n16\n \n$\n52\n \n$\n12,869\n \nRemaining Performance Obligations\nOur remaining performance obligations, which is the equivalent of our backlog, represent the expected transaction price allocated to our contracts that we expect to recognize as revenue in future periods when we perform under the contracts.  These remaining obligations exclude unexercised contract options and potential orders under ordering-type contracts such as Indefinite Delivery, Indefinite Quantity contracts. At December 28, 2024, we had $\n17.9\n billion in remaining performance obligations of which we expect to recognize revenues of approximately \n76\n% through 2026, an additional \n19\n% through 2028, and the balance thereafter.  \nContract Assets and Liabilities\nAssets and liabilities related to our contracts with customers are reported on a contract-by-contract basis at the end of each reporting period. At December 28, 2024 and December 30, 2023, contract assets totaled $\n345\n million and $\n513\n million, respectively, and contract liabilities totaled $\n1.9\n billion and $\n1.8\n billion, respectively, reflecting timing differences between revenues recognized, billings and payments from customers. During 2024, 2023 and 2022, we recognized revenues of $\n1.1\n billion, $\n953\n million and $\n873\n million, respectively, that were included in the contract liability balance at the beginning of each year.\n \n55\nTable of Contents\nNote 13. \nShare-Based Compensation\nIn April 2024, our shareholders approved our 2024 Long-Term Incentive Plan (the 2024 Plan), which replaced our 2015 Long-Term Incentive Plan (the 2015 Plan). Under the 2024 Plan, consistent with the 2015 Plan, we have authorization to provide awards to selected employees and non-employee directors in the form of stock options, restricted stock, restricted stock units, stock appreciation rights, performance stock, performance share units and other awards. A maximum of \n10\n million shares is authorized for issuance for all purposes under the 2024 Plan plus any shares that become available upon cancellation, forfeiture or expiration of awards granted under the 2015 Plan. Under the 2024 Plan, the maximum number of shares that may be issued pursuant to awards payable in shares, such as restricted stock, restricted stock units, performance stock, performance share units, or other awards is \n3.127\n million, plus any shares that become available upon cancellation, forfeiture or expiration of such awards which were granted under the 2015 Plan. For 2024, 2023 and 2022, the awards granted under these plans primarily included stock options, restricted stock units and performance share units.\nShare-based compensation costs are reflected primarily in selling and administrative expense.  \nCompensation expense included in net income for our share-based compensation plans is as follows:\n(In millions)\n2024\n2023\n2022\nCompensation expense\n$\n66\n \n$\n94\n \n$\n66\n \nIncome tax benefit\n(\n16\n)\n(\n23\n)\n(\n16\n)\nTotal compensation expense included in net income\n$\n50\n \n$\n71\n \n$\n50\n \nCompensation cost for awards subject only to service conditions that vest ratably is recognized on a straight-line basis over the requisite service period for each separately vesting portion of the award utilizing an estimated forfeiture rate.  Our awards include continued vesting provisions for retirement eligible employees. Upon reaching retirement eligibility, the service requirement for these individuals is considered to have been satisfied and compensation expense for future awards is recognized on the date of the grant.\nAs of December 28, 2024, we had not recognized $\n27\n million of total compensation costs associated with unvested awards subject only to service conditions. We expect to recognize compensation expense for these awards over a weighted-average period of approximately \ntwo years\n.  We typically grant stock appreciation rights to selected non-U.S. employees.  At December 28, 2024, outstanding stock appreciation rights totaled \n391,414\n with a weighted-average exercise price of $\n64.09\n and a weighted-average remaining contractual life of \n6.1\n years; these units had an intrinsic value of $\n6\n million, compared to $\n12\n million at December 30, 2023.\nStock Options\nStock option compensation expense was $\n25\n million, $\n23\n million and $\n22\n million in 2024, 2023 and 2022, respectively. Options to purchase our shares have a maximum term of \nten years\n and generally vest ratably over a \nthree-year\n period. Stock option compensation cost is calculated under the fair value approach using the Black-Scholes option-pricing model to determine the fair value of options granted on the date of grant. The expected volatility used in this model is based on historical volatilities and implied volatilities from traded options on our common stock. The expected term is based on historical option exercise data, which is adjusted to reflect any anticipated changes in expected behavior.\nWe grant options annually on the first day of March. \nThe assumptions used in our option-pricing model for these grants and the weighted-average fair value for these options are as follows:\n2024\n2023\n2022\nFair value of options at grant date\n$\n27.69\n$\n23.83\n$\n19.95\nDividend yield\n0.1\n%\n0.1\n%\n0.1\n%\nExpected volatility\n27.2\n%\n29.4\n%\n29.2\n%\nRisk-free interest rate\n4.3\n%\n4.2\n%\n1.9\n%\nExpected term (in years)\n4.8\n4.8\n4.8\n56\nTable of Contents\nThe stock option activity during 2024 is provided below:\n(Options in thousands)\nNumber of\nOptions\nWeighted-\nAverage\nExercise Price\nOutstanding at beginning of year\n7,515\n \n$\n54.25\n \nGranted\n1,094\n \n88.01\n \nExercised\n(\n1,904\n)\n(\n46.95\n)\nForfeited or expired\n(\n56\n)\n(\n77.72\n)\nOutstanding at end of year\n6,649\n \n$\n61.70\n \nExercisable at end of year\n4,585\n \n$\n53.37\n \nAt December 28, 2024, our outstanding options had an aggregate intrinsic value of $\n115\n million and a weighted-average remaining contractual life of \n5.7\n years.  Our exercisable options had an aggregate intrinsic value of $\n109\n million and a weighted-average remaining contractual life of \n4.5\n years at December 28, 2024.  The total intrinsic value of options exercised during 2024, 2023 and 2022 was $\n78\n million, $\n50\n million and $\n32\n million, respectively.\nRestricted Stock Units\nWe issue restricted stock units that include the right to receive dividend equivalents and are settled in either cash or stock.  Beginning in 2020, new grants of restricted stock units vest in full on the third anniversary of the grant date.  Restricted stock units granted prior to 2020 vest one-third each in the third, fourth and fifth year following the year of the grant. Compensation cost is determined using the fair value of these units based on the trading price of our common stock. For units payable in stock, we use the trading price on the grant date, while units payable in cash are remeasured using the price at each reporting period date.  \nThe 2024 activity for restricted stock units is provided below:\nUnits Payable in Stock\nUnits Payable in Cash\n(Shares/Units in thousands)\nNumber of\nShares\nWeighted-\nAverage Grant\nDate Fair Value\nNumber of\nUnits\nWeighted-\nAverage Grant\nDate Fair Value\nOutstanding at beginning of year, nonvested\n396\n \n$\n61.73\n \n810\n \n$\n63.06\n \nGranted\n110\n \n89.45\n \n221\n \n88.69\n \nVested\n(\n175\n)\n(\n53.16\n)\n(\n373\n)\n(\n52.50\n)\nForfeited\n—\n \n—\n \n(\n27\n)\n(\n74.80\n)\nOutstanding at end of year, nonvested\n331\n \n$\n75.50\n \n631\n \n$\n77.75\n \nThe fair value of the restricted stock unit awards that vested and/or amounts paid under these awards is as follows:\n(In millions)\n2024\n2023\n2022\nFair value of awards vested\n$\n42\n \n$\n45\n \n$\n25\n \nCash paid\n33\n \n34\n \n17\n \nPerformance Share Units\nThe fair value of share-based compensation awards accounted for as liabilities includes performance share units, which are generally paid in cash in the first quarter of the year following vesting. Performance share units are subject to performance goals set at the beginning of the \nthree-year\n performance period and vest at the end of the performance period. These units are remeasured to fair value at the end of each reporting period based on the trading price of our common stock and the number of units, as adjusted based on assumptions with respect to performance on the relevant metrics.\nThe 2024 activity for our performance share units is as follows:\n(Units in thousands)\nNumber of\nUnits\nWeighted-\nAverage Grant\nDate Fair Value\nOutstanding at beginning of year, nonvested\n366\n \n$\n72.23\n \nGranted\n194\n \n88.68\n \nVested\n(\n166\n)\n(\n71.07\n)\nOutstanding at end of year, nonvested\n394\n \n$\n80.81\n \n57\nTable of Contents\nThe fair value of the performance share units that vested and/or amounts paid under these awards is as follows:\n(In millions)\n2024\n2023\n2022\nFair value of awards vested\n$\n13\n \n$\n19\n \n$\n19\n \nCash paid\n35\n \n27\n \n15\n \nNote 14. \nRetirement Plans\nWe provide defined-contribution benefits to eligible employees, as well as some remaining defined-benefit pension and other post-retirement benefits covering certain of our U.S. and Non-U.S. employees. Substantially all of our employees are covered by defined contribution plans.  The largest of these plans, the Textron Savings Plan, is a qualified 401(k) plan subject to the Employee Retirement Income Security Act of 1974 (ERISA).  Our defined contribution plans cost $\n164\n million, $\n154\n million and $\n140\n million in 2024, 2023 and 2022, respectively.  We also provide postretirement benefits other than pensions for certain retired employees in the U.S. that include healthcare, dental care, Medicare Part B reimbursement and life insurance.\nA portion of our U.S. employees participate in the legacy defined benefit pension plans which were closed to new participants beginning on January 1, 2010.  These legacy plans include the Textron Master Retirement Plan (TMRP), the Bell Helicopter Textron Master Retirement Plan, and the CWC Castings Division of Textron Inc. Hourly-Rated Employees' Pension Plan, which are each subject to the provisions of ERISA and provide a minimum guaranteed benefit to participants. The primary factors affecting the benefits earned by participants in our pension plans are employees’ years of service and compensation levels. Employees hired subsequent to the closure of these plans receive an additional annual cash contribution to their Textron Savings Plan account based on their eligible compensation of up to \n4\n%.\nPeriodic Benefit Cost (Income)\nThe components of net periodic benefit cost (income) and other amounts recognized in other comprehensive income (loss) (OCI) are as follows:\nPension Benefits\nPostretirement Benefits\nOther than Pensions\n(In millions)\n2024\n2023\n2022\n2024\n2023\n2022\nNet periodic benefit cost (income)\nService cost\n$\n69\n \n$\n67\n \n$\n108\n \n$\n1\n \n$\n2\n \n$\n2\n \nInterest cost\n362\n \n364\n \n272\n \n7\n \n8\n \n6\n \nExpected return on plan assets\n(\n635\n)\n(\n610\n)\n(\n609\n)\n—\n \n—\n \n—\n \nAmortization of prior service cost (credit)\n9\n \n11\n \n13\n \n(\n1\n)\n(\n3\n)\n(\n5\n)\nAmortization of net actuarial loss (gain)\n3\n \n1\n \n87\n \n(\n8\n)\n(\n8\n)\n(\n4\n)\nNet periodic benefit cost (income)*\n$\n(\n192\n)\n$\n(\n167\n)\n$\n(\n129\n)\n$\n(\n1\n)\n$\n(\n1\n)\n$\n(\n1\n)\nOther changes in plan assets and benefit obligations recognized in OCI\nCurrent year actuarial loss (gain)\n$\n(\n561\n)\n$\n109\n \n$\n(\n246\n)\n$\n(\n7\n)\n$\n(\n7\n)\n$\n(\n39\n)\nCurrent year prior service cost\n19\n \n7\n \n4\n \n—\n \n—\n \n—\n \nAmortization of net actuarial gain (loss)\n(\n3\n)\n(\n1\n)\n(\n87\n)\n8\n \n8\n \n4\n \nAmortization of prior service credit (cost)\n(\n9\n)\n(\n11\n)\n(\n13\n)\n1\n \n3\n \n5\n \nTotal recognized in OCI, before taxes\n$\n(\n554\n)\n$\n104\n \n$\n(\n342\n)\n$\n2\n \n$\n4\n \n$\n(\n30\n)\nTotal recognized in net periodic benefit cost (income) and OCI\n$\n(\n746\n)\n$\n(\n63\n)\n$\n(\n471\n)\n$\n1\n \n$\n3\n \n$\n(\n31\n)\n* Excludes the cost associated with the defined contribution component that is included in certain of our U.S.-based defined benefit pension plans, of  $\n10\n million in 2024, and $\n11\n million for both 2023 and 2022.\n58\nTable of Contents\nObligations and Funded Status\nAll of our plans are measured as of our fiscal year-end. \nThe changes in the projected benefit obligation and in the fair value of plan assets, along with our funded status, are as follows:\nPension Benefits\nPostretirement Benefits\nOther than Pensions\n(In millions)\nDecember 28, 2024\nDecember 30, 2023\nDecember 28, 2024\nDecember 30, 2023\nChange in projected benefit obligation\nProjected benefit obligation at beginning of year\n$\n7,205\n \n$\n6,848\n \n$\n136\n \n$\n150\n \nService cost\n69\n \n67\n \n1\n \n2\n \nInterest cost\n362\n \n364\n \n7\n \n8\n \nPlan participants’ contributions\n—\n \n—\n \n3\n \n3\n \nActuarial losses (gains)\n(\n392\n)\n330\n \n(\n7\n)\n(\n7\n)\nBenefits paid\n(\n454\n)\n(\n444\n)\n(\n19\n)\n(\n20\n)\nPlan amendment\n19\n \n7\n \n—\n \n—\n \nForeign exchange rate changes and other\n(\n21\n)\n33\n \n—\n \n—\n \nProjected benefit obligation at end of year\n$\n6,788\n \n$\n7,205\n \n$\n121\n \n$\n136\n \nChange in fair value of plan assets\nFair value of plan assets at beginning of year\n$\n8,413\n \n$\n7,943\n \nActual return on plan assets\n806\n \n832\n \nEmployer contributions\n34\n \n36\n \nBenefits paid\n(\n454\n)\n(\n444\n)\nForeign exchange rate changes and other\n(\n27\n)\n46\n \nFair value of plan assets at end of year\n$\n8,772\n \n$\n8,413\n \nFunded status at end of year\n$\n1,984\n \n$\n1,208\n \n$\n(\n121\n)\n$\n(\n136\n)\nActuarial losses (gains) for 2024 and 2023 were largely the result of changes in the discount rate utilized.\nAmounts recognized in our balance sheets are as follows:\nPension Benefits\nPostretirement Benefits\nOther than Pensions\n(In millions)\nDecember 28, 2024\nDecember 30, 2023\nDecember 28, 2024\nDecember 30, 2023\nNon-current assets\n$\n2,311\n \n$\n1,569\n \n$\n—\n \n$\n—\n \nCurrent liabilities\n(\n29\n)\n(\n28\n)\n(\n15\n)\n(\n17\n)\nNon-current liabilities\n(\n298\n)\n(\n333\n)\n(\n106\n)\n(\n119\n)\nRecognized in Accumulated other comprehensive loss, pre-tax:\nNet loss (gain)\n167\n \n730\n \n(\n69\n)\n(\n69\n)\nPrior service cost (credit)\n52\n \n42\n \n(\n1\n)\n(\n3\n)\nThe accumulated benefit obligation for all defined benefit pension plans was $\n6.5\n billion and $\n6.9\n billion at December 28, 2024 and December 30, 2023, respectively, which included $\n316\n million and $\n336\n million, respectively, in accumulated benefit obligations for unfunded plans where funding is not permitted or in foreign environments where funding is not feasible.\nPension plans with accumulated benefit obligation exceeding the fair value of plan assets are as follows:\n(In millions)\nDecember 28, 2024\nDecember 30, 2023\nAccumulated benefit obligation\n$\n316\n \n$\n336\n \nFair value of plan assets\n—\n \n—\n \nPension plans with projected benefit obligation exceeding the fair value of plan assets are as follows:\n(In millions)\nDecember 28, 2024\nDecember 30, 2023\nProjected benefit obligation\n$\n327\n \n$\n652\n \nFair value of plan assets\n—\n \n292\n \n59\nTable of Contents\nAssumptions\nThe weighted-average assumptions we use for our pension and postretirement plans are as follows:\nPension Benefits\nPostretirement Benefits\nOther than Pensions\n2024\n2023\n2022\n2024\n2023\n2022\nNet periodic benefit cost\nDiscount rate\n5.19\n%\n5.51\n%\n2.99\n%\n5.40\n%\n5.70\n%\n2.80\n%\nExpected long-term rate of return on assets\n7.16\n%\n7.14\n%\n7.10\n%\nRate of compensation increase\n3.97\n%\n3.97\n%\n3.95\n%\nBenefit obligations at year-end\nDiscount rate\n5.73\n%\n5.19\n%\n5.51\n%\n5.75\n%\n5.40\n%\n5.70\n%\nRate of compensation increase\n3.97\n%\n3.97\n%\n3.97\n%\nInterest crediting rate for cash balance plans\n5.25\n%\n5.25\n%\n5.25\n%\nOur assumed healthcare cost trend rate for both the medical and prescription drug cost was \n6.50\n% in 2024 and \n6.50\n% in 2023. We expect this rate to gradually decline to \n4.75\n% by \n2031\n where we assume it will remain.  \nPension Assets\nThe expected long-term rate of return on plan assets is determined based on a variety of considerations, including the established asset allocation targets and expectations for those asset classes, historical returns of the plans’ assets and other market considerations. We invest our pension assets with the objective of achieving a total rate of return over the long term that will be sufficient to fund future pension obligations and to minimize future pension contributions. We are willing to tolerate a commensurate level of risk to achieve this objective based on the funded status of the plans and the long-term nature of our pension liability. Risk is controlled by maintaining a portfolio of assets that is diversified across a variety of asset classes, investment styles and investment managers. Where possible, investment managers are prohibited from owning our securities in the portfolios that they manage on our behalf.\nFor U.S. plan assets, which represent the majority of our plan assets, asset allocation target ranges are established consistent with our investment objectives, and the assets are rebalanced periodically.  For Non-U.S. plan assets, allocations are based on expected cash flow needs and assessments of the local practices and markets.  \nOur target allocation ranges are as follows:\nU.S. Plan Assets\nDomestic equity securities\n17\n \n%\nto\n33\n%\nInternational equity securities\n6\n \n%\nto\n17\n%\nGlobal equities\n5\n \n%\nto\n17\n%\nDebt securities\n27\n \n%\nto\n38\n%\nReal estate\n7\n \n%\nto\n13\n%\nPrivate investment partnerships\n7\n \n%\nto\n13\n%\nNon-U.S. Plan Assets\nEquity securities\n55\n \n%\nto\n75\n%\nDebt securities\n25\n \n%\nto\n45\n%\nReal estate\n—\n \n%\nto\n13\n%\n60\nTable of Contents\nThe fair value of our pension plan assets by major category and valuation method is as follows:\nDecember 28, 2024\nDecember 30, 2023\n(In millions)\nLevel 1\nLevel 2\nLevel 3\nNot\nSubject to\nLeveling\nLevel 1\nLevel 2\nLevel 3\nNot\nSubject to\nLeveling\nCash and equivalents\n$\n159\n \n$\n1\n \n$\n—\n \n$\n—\n \n$\n231\n \n$\n1\n \n$\n—\n \n$\n—\n \nEquity securities:\nDomestic\n3,151\n \n—\n \n—\n \n307\n \n2,754\n \n—\n \n—\n \n299\n \nInternational\n1,028\n \n—\n \n—\n \n290\n \n1,061\n \n—\n \n—\n \n281\n \nMutual funds\n194\n \n—\n \n—\n \n— \n117\n \n—\n \n—\n \n— \nDebt securities:\nNational, state and local governments\n899\n \n60\n \n—\n \n13\n \n679\n \n142\n \n—\n \n88\n \nCorporate debt\n46\n \n618\n \n—\n \n148\n \n164\n \n610\n \n—\n \n90\n \nPrivate investment partnerships\n—\n \n—\n \n—\n \n974\n \n—\n \n—\n \n—\n \n1,000\n \nReal estate\n—\n \n—\n \n479\n \n405\n \n—\n \n—\n \n508\n \n388\n \nTotal\n$\n5,477\n \n$\n679\n \n$\n479\n \n$\n2,137\n \n$\n5,006\n \n$\n753\n \n$\n508\n \n$\n2,146\n \nCash and equivalents, equity securities and debt securities include commingled funds, which represent investments in funds offered to institutional investors that are similar to mutual funds in that they provide diversification by holding various equity and debt securities. Generally, the fair value of the majority of the commingled funds is determined and published by the fund's investment managers and is the basis for current transactions, therefore, they are categorized as Level 1 in the table above. Certain commingled funds, consisting of underlying equity and fixed income securities, are stated at their Net Asset Value (NAV) per share because such investments do not have readily determinable fair values and, therefore, are not subject to leveling within the fair value hierarchy. The NAV is the total value of the fund divided by the number of the fund’s shares outstanding. Debt securities are valued based on same day actual trading prices, if available.  If such prices are not available, we use a matrix pricing model with historical prices, trends and other factors.\nPrivate investment partnerships represents interests in funds which invest in equity, debt and other financial assets.  These funds are generally not publicly traded so the interests therein are valued using income and market methods that include cash flow projections and market multiples for various comparable investments. Real estate includes owned properties and limited partnership interests in real estate partnerships. Owned properties are valued using certified appraisals at least every \nthree years\n that are updated at least annually by the real estate investment manager based on current market trends and other available information. These appraisals generally use the standard methods for valuing real estate, including forecasting income and identifying current transactions for comparable real estate to arrive at a fair value.  Limited partnership interests in real estate partnerships are valued similarly to private investment partnerships, with the general partner using standard real estate valuation methods to value the real estate properties and securities held within their portfolios.  Neither private investment nor real estate partnerships are subject to leveling within the fair value hierarchy.\nThe table below presents a reconciliation of the fair value measurements for owned real estate properties, which use significant unobservable inputs (Level 3):\n(In millions)\n2024\n2023\nBalance at beginning of year\n$\n508\n \n$\n569\n \nUnrealized losses, net\n(\n25\n)\n(\n60\n)\nRealized gains, net\n16\n \n10\n \nPurchases, sales and settlements, net\n(\n20\n)\n(\n11\n)\nBalance at end of year\n$\n479\n \n$\n508\n \n61\nTable of Contents\nEstimated Future Cash Flow Impact\nDefined benefits under salaried plans are based on salary and years of service.  Hourly plans generally provide benefits based on stated amounts for each year of service.  Our funding policy is consistent with applicable laws and regulations.  In 2025, we expect to contribute approximately $\n50\n million to our pension plans. Benefit payments provided below reflect expected future employee service, as appropriate, and are expected to be paid, net of estimated participant contributions. These payments are based on the same assumptions used to measure our benefit obligation at the end of 2024. While pension benefit payments primarily will be paid out of qualified pension trusts, we will pay postretirement benefits other than pensions out of our general corporate assets. \nBenefit payments that we expect to pay on an undiscounted basis are as follows:\n(In millions)\n2025\n2026\n2027\n2028\n2029\n2030-2034\nPension benefits\n$\n459\n \n$\n467\n \n$\n476\n \n$\n484\n \n$\n491\n \n$\n2,510\n \nPostretirement benefits other than pensions\n16\n \n15\n \n14\n \n13\n \n13\n \n50\n \nNote 15. \nSpecial Charges\nSpecial charges recorded in 2024 and 2023 by segment and type of cost are as follows:\n(In millions)\nSeverance\nCosts\nContract\nTerminations\nand Other\nAsset\nImpairments\nTotal\n2024\nIndustrial\n$\n37\n \n$\n32\n \n$\n3\n \n$\n72\n \nBell\n1\n \n—\n \n—\n \n1\n \nTextron Systems\n5\n \n—\n \n—\n \n5\n \nTotal special charges\n$\n43\n \n$\n32\n \n$\n3\n \n$\n78\n \n2023\nIndustrial\n$\n21\n \n$\n—\n \n$\n87\n \n$\n108\n \nBell\n13\n \n—\n \n—\n \n13\n \nTextron Systems\n5\n \n—\n \n—\n \n5\n \nTotal special charges\n$\n39\n \n$\n—\n \n$\n87\n \n$\n126\n \nIn the fourth quarter of 2023, we initiated a restructuring plan to reduce operating expenses through headcount reductions at the Industrial, Bell and Textron Systems segments. In the Industrial segment, the plan included headcount reductions at Textron Specialized Vehicles, resulting from lower demand for certain of our powersports products, and at Kautex, due to reduced demand for fuel systems from European automotive manufacturers. In the Bell and Textron Systems segments, the plan included targeted headcount reductions to improve the segments’ cost structures and realign their workforces as these segments transition from legacy production contracts to more development, engineering focused contracts. In April 2024, the plan was expanded for the Bell and Textron Systems segments to include headcount reductions resulting from the cancellations of the Future Attack Reconnaissance Aircraft and Shadow programs in 2024. \nIn December 2024, we approved additional actions under the 2023 plan at Textron Specialized Vehicles related to an indefinite pause in production of its powersports products. During 2024, the consumer end market demand for powersports products continued to remain soft. As a result, and in conjunction with its annual operating plan process, Textron Specialized Vehicles began to pause production of powersports products as Textron's management reviews strategic alternatives for the business. Upon completion of limited production runs to satisfy customer commitments, production of powersports products will be paused indefinitely in the first half of 2025. \nIn 2024, we recorded special charges totaling $\n78\n million as a result of the above restructuring actions. Since inception of the 2023 plan, we have incurred $\n204\n million in \nspecial charges\n including severance costs of $\n82\n million, which included $\n58\n million at the Industrial segment, $\n14\n million at the Bell segment and $\n10\n million at the Textron Systems segment; and contract termination and other costs of $\n32\n million and asset impairment charges of $\n90\n million at the Industrial segment. Headcount reductions since inception of the plan are expected to total approximately \n1,800\n positions, representing \n5\n% of our global workforce. We expect the plan to be substantially completed and the majority of the $\n71\n million restructuring reserve to be paid in the first half of 2025. \nIn the fourth quarter of 2024 and in connection with the actions taken under the restructuring plan at Textron Specialized Vehicles, we recorded an inventory valuation charge of  $\n38\n million, which is recorded in Cost of products sold, to write down production-related powersports inventory to its net realizable value.\n62\nTable of Contents\nIn 2023, as a result of the lower demand described above, we recognized asset impairment charges of $\n75\n million at Textron Specialized Vehicles related to both fixed and intangible assets and $\n12\n million of fixed asset impairment charges at Kautex. The fair value of these assets was determined utilizing a discounted cash flow methodology that reflected the impact of lower anticipated demand for the powersports and fuel systems products on future revenues and profit.\nRestructuring Reserve\nOur restructuring reserve activity is summarized below:\n(In millions)\nSeverance\nCosts\nContract\nTerminations\nand Other\nTotal\nBalance at December 31, 2022\n$\n5\n \n$\n7\n \n$\n12\n \nProvision for 2023 restructuring plan\n39\n \n—\n \n39\n \nCash paid\n(\n3\n)\n(\n2\n)\n(\n5\n)\nForeign currency translation\n1\n \n—\n \n1\n \nBalance at December 30, 2023\n$\n42\n \n$\n5\n \n$\n47\n \nProvision for 2023 restructuring plan\n49\n \n32\n \n81\n \nCash paid\n(\n46\n)\n(\n3\n)\n(\n49\n)\nReversals\n(\n6\n)\n—\n \n(\n6\n)\nForeign currency translation\n(\n2\n)\n—\n \n(\n2\n)\nBalance at December 28, 2024\n$\n37\n \n$\n34\n \n$\n71\n \nNote 16. \nIncome Taxes\nWe conduct business globally and, as a result, file numerous consolidated and separate income tax returns within and outside the U.S.  For all of our U.S. subsidiaries, we file a consolidated federal income tax return.  \nIncome from continuing operations before income taxes is as follows:\n(In millions)\n2024\n2023\n2022\nU.S.\n$\n739\n \n$\n905\n \n$\n810\n \nNon-U.S.\n204\n \n182\n \n206\n \nIncome from continuing operations before income taxes\n$\n943\n \n$\n1,087\n \n$\n1,016\n \nIncome tax expense is summarized as follows:\n(In millions)\n2024\n2023\n2022\nCurrent expense:\nFederal\n$\n84\n \n$\n267\n \n$\n272\n \nState\n21\n \n18\n \n33\n \nNon-U.S.\n61\n \n72\n \n69\n \n166\n \n357\n \n374\n \nDeferred expense (benefit):\nFederal\n(\n34\n)\n(\n181\n)\n(\n182\n)\nState\n(\n24\n)\n1\n \n(\n29\n)\nNon-U.S.\n10\n \n(\n12\n)\n(\n9\n)\n(\n48\n)\n(\n192\n)\n(\n220\n)\nIncome tax expense\n$\n118\n \n$\n165\n \n$\n154\n \n63\nTable of Contents\nThe following table reconciles the U.S. Federal statutory income tax rate to our effective income tax rate:\n2024\n2023\n2022\nU.S. Federal statutory income tax rate\n21.0\n%\n21.0\n%\n21.0\n%\nIncrease (decrease) resulting from:\nState income taxes, net of federal tax benefit\n(\n0.2\n)\n1.4\n0.3\nNon-U.S. tax rate differential and foreign tax credits\n2.1\n1.5\n1.8\nResearch and development tax credits\n(\n5.4\n)\n(\n4.7\n)\n(\n5.0\n)\nUncertain tax positions release for 2012 to 2017 IRS audit\n(\n2.9\n)\n—\n—\nForeign-derived intangible income deduction\n(\n1.7\n)\n(\n3.2\n)\n(\n2.5\n)\nOther, net\n(\n0.4\n)\n(\n0.8\n)\n(\n0.4\n)\nEffective income tax rate\n12.5\n%\n15.2\n%\n15.2\n%\nUnrecognized Tax Benefits\nOur unrecognized tax benefits represent tax positions for which reserves have been established, with unrecognized state tax benefits reflected net of applicable federal tax benefits. If our unrecognized tax benefits were recognized in future periods, they would favorably impact our effective tax rate. \nA reconciliation of these unrecognized tax benefits is as follows:\n(In millions)\n2024\n2023\n2022\nBalance at beginning of year\n$\n222\n \n$\n231\n \n$\n207\n \nAdditions for tax positions related to current year\n17\n \n16\n \n24\n \nAdditions for tax positions of prior years\n4\n \n3\n \n—\n \nReductions for tax positions of prior years\n—\n \n(\n28\n)\n—\n \nReductions for settlements\n(\n28\n)\n—\n \n—\n \nBalance at end of year\n$\n215\n \n$\n222\n \n$\n231\n \nIn November 2024, we received a Revenue Agent Report (RAR) from the Internal Revenue Service (IRS) for the tax years 2012 to 2017 that proposed adjustments related to research and development tax credits generated on amended returns filed in 2019 and 2021. We disagree with the proposed adjustments and are vigorously contesting them through the IRS’s Office of Appeals and, if necessary, will continue with legal proceedings. We believe it is more likely than not that we will prevail on our refund claim for these credits. As of December 28, 2024, we believe our allowance for uncertain tax positions related to this matter is adequate. We do not expect a final resolution to this matter in the next twelve months. In connection with the RAR for these years, other tax positions were effectively settled, resulting in a benefit upon the reversal of $\n27\n million of uncertain tax positions in the fourth quarter of 2024.  \nWe are currently under examination by the IRS for the tax years 2018 to 2021. In the normal course of business, we are subject to examination by tax authorities throughout the world. We are generally no longer subject to state and local income tax examinations for years before 2019 and non-U.S. income tax examinations for years before 2012.\n64\nTable of Contents\nDeferred Taxes\nThe significant components of our net deferred tax assets/(liabilities) are provided below:\n(In millions)\nDecember 28,\n2024\nDecember 30,\n2023\nCapitalized research and development expenditures\n$\n631\n \n$\n520\n \nAccrued liabilities (a)\n224\n \n228\n \nU.S. operating loss and tax credit carryforwards (b)\n212\n \n216\n \nObligation for pension and postretirement benefits\n109\n \n123\n \nDeferred compensation\n94\n \n103\n \nOperating lease liabilities \n93\n \n102\n \nNon-U.S. operating loss and tax credit carryforwards (c)\n88\n \n73\n \nPrepaid pension benefits\n(\n562\n)\n(\n387\n)\nProperty, plant and equipment, principally depreciation\n(\n198\n)\n(\n211\n)\nAmortization of goodwill and other intangibles\n(\n184\n)\n(\n185\n)\nOperating lease right-of-use assets\n(\n90\n)\n(\n99\n)\nValuation allowance on deferred tax assets\n(\n82\n)\n(\n82\n)\nOther leasing transactions, principally leveraged leases\n(\n42\n)\n(\n47\n)\nOther, net\n(\n32\n)\n(\n5\n)\nDeferred taxes, net\n$\n261\n \n$\n349\n \n(a)\nAccrued liabilities include warranty reserves, self-insured liabilities and interest.\n(b)\nAt December 28, 2024, U.S. operating loss and tax credit carryforward benefits of $\n166\n million expire through 2044 if not utilized and $\n46\n million may be carried forward indefinitely.\n(c)\nAt December 28, 2024, non-U.S. operating loss and tax credit carryforward benefits of $\n80\n million may be carried forward indefinitely.\nWe believe earnings during the period when the temporary differences become deductible will be sufficient to realize the related future income tax benefits. For those jurisdictions where the expiration date of tax carryforwards or the projected operating results indicate that realization is not more than likely, a valuation allowance is provided.\nThe following table presents the breakdown of our deferred taxes:\n(In millions)\nDecember 28,\n2024\nDecember 30,\n2023\nManufacturing group:\nDeferred tax assets, net of valuation allowance\n$\n394\n \n$\n443\n \nDeferred tax liabilities\n(\n96\n)\n(\n56\n)\nFinance group – Deferred tax liabilities\n(\n37\n)\n(\n38\n)\nNet deferred tax asset\n$\n261\n \n$\n349\n \nNon-U.S. and U.S. state income taxes have not been provided for on basis differences in certain investments, primarily as a result of unremitted earnings in foreign subsidiaries that are indefinitely reinvested, totaling $\n1.8\n billion at December 28, 2024 and  $\n1.6\n billion at December 30, 2023. Should these earnings be distributed in the future in the form of dividends or otherwise, we would be subject to withholding and local taxes to various non-U.S. jurisdictions and U.S. states. Determination of the deferred tax liability associated with indefinitely reinvested earnings is not practicable due to multiple factors, including the complexity of non-U.S. tax laws and tax treaty interpretations, exchange rate fluctuations, and the uncertainty of available credits or exemptions.\n65\nTable of Contents\nNote 17. \nCommitments and Contingencies\nWe are subject to actual and threatened legal proceedings and other claims arising out of the conduct of our business, including proceedings and claims relating to commercial and financial transactions; government contracts; alleged lack of compliance with applicable laws and regulations; disputes with suppliers, production partners or other third parties; product liability; patent and trademark infringement; employment disputes; and environmental, health and safety matters. Some of these legal proceedings and claims seek damages, fines or penalties in substantial amounts or remediation of environmental contamination. As a government contractor, we are subject to audits, reviews and investigations to determine whether our operations are being conducted in accordance with applicable regulatory requirements. Under federal government procurement regulations, certain claims brought by the U.S. Government could result in our suspension or debarment from U.S. Government contracting for a period of time. On the basis of information presently available, we do not believe that existing proceedings and claims will have a material effect on our financial position or results of operations.\nIn the ordinary course of business, we enter into standby letter of credit agreements and surety bonds with financial institutions to meet various performance and other obligations.  These outstanding letter of credit arrangements and surety bonds aggregated to approximately $\n336\n million and $\n338\n million at December 28, 2024 and December 30, 2023, respectively.\nEnvironmental Remediation\nAs with other industrial enterprises engaged in similar businesses, we are involved in a number of remedial actions under various federal and state laws and regulations relating to the environment that impose liability on companies to clean up, or contribute to the cost of cleaning up, sites on which hazardous wastes or materials were disposed or released.  Our accrued environmental liabilities relate to installation of remediation systems, disposal costs, U.S. Environmental Protection Agency oversight costs, legal fees, and operating and maintenance costs for both currently and formerly owned or operated facilities.  Circumstances that can affect the reliability and precision of the accruals include the identification of additional sites, environmental regulations, level of cleanup required, technologies available, number and financial condition of other contributors to remediation and the time period over which remediation may occur. We believe that any changes to the accruals that may result from these factors and uncertainties will not have a material effect on our financial position or results of operations.\nBased upon information currently available, we estimate that our potential environmental liabilities are within the range of $\n40\n million to $\n145\n million. At December 28, 2024, \nenvironmental reserves\n of $\n72\n million have been established to address these specific estimated liabilities. We estimate that we will likely pay our accrued environmental remediation liabilities over the next \nten years\n and have classified $\n16\n million as current liabilities. In 2024, 2023 and 2022, to evaluate and remediate contaminated sites, we incurred expense, net of recoveries received, of $\n9\n million, $\n8\n million and $\n9\n million, respectively.\nNote 18. \nSupplemental Cash Flow Information\nOur cash payments and receipts are as follows:\n(In millions)\n2024\n2023\n2022\nInterest paid:\nManufacturing group\n$\n124\n \n$\n110\n \n$\n110\n \nFinance group\n18\n \n12\n \n13\n \nNet income taxes paid:\nManufacturing group\n181\n \n338\n \n332\n \nFinance group\n10\n \n14\n \n24\n \n66\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Textron Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying Consolidated Balance Sheets of Textron Inc. (the Company) as of December 28, 2024 and December 30, 2023, the related Consolidated Statements of Operations, Comprehensive Income, Shareholders’ Equity and Cash Flows for each of the three years in the period ended December 28, 2024, and the related notes and the financial statement schedule listed in the Index at Item 8 (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 28, 2024 and December 30, 2023 and the results of its operations and its cash flows for each of the three years in the period ended December 28, 2024, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 28, 2024, based on criteria established in Internal Control – Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 Framework) and our report dated February 6, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition - Estimates at Completion for Select Long Term Contracts\nDescription of the Matter\nAs described in Note 1 to the consolidated financial statements, revenues under long-term contracts with the U.S. Government are generally recognized over time using the cost-to-cost method of accounting. Under this method, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the estimated costs at completion, and revenue is recorded proportionally as costs are incurred. Contract costs, which are estimated utilizing current contract specifications and expected engineering requirements, typically are incurred over a period of several years, and the estimation of these costs at completion requires substantial judgment. The Company’s cost estimation process is based on professional knowledge and experience of engineers and program managers along with finance professionals. The Company updates its projections of costs quarterly or more frequently when circumstances significantly change. When adjustments are required, any changes from prior estimates are recognized using the cumulative catch-up method with the impact of the change from inception-to-date of the contract recorded in the current period and required disclosure is provided in the consolidated financial statements. Anticipated losses on contracts are recognized in full in the period in which losses become probable and estimable.\n67\nTable of Contents\nAuditing the Company’s estimated costs at completion for select long-term contracts was complex due to the judgment involved in evaluating management’s assumptions and key estimates over the duration of these long-term contracts. The estimated costs at completion for the select long-term contracts consider risks surrounding the Company’s ability to achieve the technical requirements and specifications of the contract, schedule, and other cost elements of the contract, and depend on whether the Company is able to successfully retire risks surrounding such aspects of the contract.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of the controls related to the Company’s revenue recognition process, including controls over management’s review of the estimated costs at completion for the select long-term contracts and related key assumptions and management’s review that the data underlying the estimated costs at completion was complete and accurate.\nTo test the accuracy of the Company’s estimated costs at completion for the select long-term contracts, our audit procedures included, among others, evaluating the key assumptions used by management to determine such estimate. This included evaluating the historical accuracy of management’s estimates by comparing planned costs to actual costs incurred to date. We also tested the completeness and accuracy of the underlying data back to source documents and contracts.\nDefined Benefit Pension Obligations\nDescription of the Matter\nAs described in Note 14 to the consolidated financial statements, at December 28, 2024, the aggregate qualified defined benefit pension obligation was $6.8 billion and the fair value of pension plan assets was $8.8 billion, resulting in a net pension asset of $2.0 billion. As explained in Note 1 to the consolidated financial statements, the Company updates the estimates used to measure the defined benefit pension assets and obligations annually in the fourth quarter or more frequently upon the occurrence of certain events.\nAuditing the defined benefit pension obligations was complex and required the involvement of specialists as a result of the judgmental nature of certain actuarial assumptions including the discount rate and expected return on plan assets used in the measurement process.  These assumptions have a significant effect on the projected benefit obligation.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of the controls that address the risks of material misstatement relating to the measurement and valuation of the defined benefit pension obligation.  For example, we tested controls over management’s review of the defined benefit pension obligation actuarial calculations, the significant actuarial assumptions, and the data inputs provided to the actuaries.\nTo test the defined benefit pension obligation, our audit procedures included, among others, evaluating the methodology used, the significant actuarial assumptions discussed above, and the underlying data used by management and its actuaries.  We compared the actuarial assumptions used by management to historical trends and evaluated the change in the defined benefit pension obligation from the prior year due to the change in service cost, interest cost, benefit payments, actuarial gains and losses, contributions, and plan amendments, as applicable.  In addition, we involved an actuarial specialist to assist in evaluating management’s methodology for determining the discount rate that reflects the maturity and duration of the benefit payments and is used to measure the defined benefit pension obligation. As part of this assessment, we compared the projected cash flows to prior year and compared the current year benefits paid to the prior year projected cash flows. We also tested the completeness and accuracy of the underlying data, including the participant data provided to the Company’s actuaries.  Lastly, to evaluate the expected return on plan assets, we assessed whether management’s assumption is consistent with a range of returns for a portfolio of comparative investments.\n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 1957.\nBoston, Massachusetts\nFebruary 6, 2025\n68\nTable of Contents\nSchedule II — Valuation and Qualifying Accounts\n(In millions)\n2024\n2023\n2022\nAllowance for credit losses on accounts receivable\nBalance at beginning of year\n$\n26\n \n$\n24\n \n$\n24\n \nProvision (reversal) for credit losses\n(\n4\n)\n7\n \n2\n \nDeductions from reserves*\n(\n3\n)\n(\n5\n)\n(\n2\n)\nBalance at end of year\n$\n19\n \n$\n26\n \n$\n24\n \nAllowance for credit losses on finance receivables\nBalance at beginning of year\n$\n24\n \n$\n24\n \n$\n25\n \nReversal for credit losses\n(\n14\n)\n(\n18\n)\n(\n4\n)\nCharge-offs\n(\n1\n)\n—\n \n—\n \nRecoveries\n10\n \n18\n \n3\n \nBalance at end of year\n$\n19\n \n$\n24\n \n$\n24\n \nInventory FIFO reserves\nBalance at beginning of year\n$\n390\n \n$\n350\n \n$\n370\n \nCharged to costs and expenses\n57\n \n63\n \n21\n \nDeductions from reserves*\n(\n15\n)\n(\n23\n)\n(\n41\n)\nBalance at end of year\n$\n432\n \n$\n390\n \n$\n350\n \n*\n \nDeductions primarily include amounts written off on uncollectible accounts (less recoveries), inventory disposals, changes to prior year estimates and currency translation adjustments.\nItem 9. Changes In and Disagreements With Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A. Controls and Procedures\nDisclosure Controls and Procedures\nWe performed an evaluation of the effectiveness of our disclosure controls and procedures as of December 28, 2024. The evaluation was performed with the participation of senior management of each business segment and key Corporate functions, under the supervision of our Chairman, President and Chief Executive Officer (CEO) and our Executive Vice President and Chief Financial Officer (CFO). Based on this evaluation, the CEO and CFO concluded that our disclosure controls and procedures were operating and effective as of December 28, 2024.\nChanges in Internal Controls Over Financial Reporting\nThere were no changes in our internal control over financial reporting during the fourth quarter of the fiscal year covered by this report that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting for Textron Inc. as such term is defined in Exchange Act Rules 13a-15(f). Our internal control structure is designed to provide reasonable assurance, at appropriate cost, that assets are safeguarded and that transactions are properly executed and recorded. The internal control structure includes, among other things, established policies and procedures, an internal audit function, the selection and training of qualified personnel as well as management oversight.\nWith the participation of our management, we performed an evaluation of the effectiveness of our internal control over financial reporting based on criteria established in Internal Control – Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 Framework). Based on our evaluation under the 2013 Framework, we have concluded that Textron Inc. maintained, in all material respects, effective internal control over financial reporting as of December 28, 2024.\nThe independent registered public accounting firm, Ernst & Young LLP (PCAOB ID: \n42\n), has audited the Consolidated Financial Statements of Textron Inc. and has issued an attestation report on Textron’s internal controls over financial reporting as of December 28, 2024, as stated in its report, which is included herein.\n69\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Textron Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited Textron Inc.’s internal control over financial reporting as of December 28, 2024, based on criteria established in Internal Control— Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 Framework), (the COSO criteria). In our opinion, Textron, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 28, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Consolidated Balance Sheets of the Company as of December 28, 2024 and December 30, 2023, and the related Consolidated Statements of Operations, Comprehensive Income, Shareholders' Equity and Cash Flows for each of the three years in the period ended December 28, 2024, and the related notes and the financial statement schedule listed in the Index at Item 8 of the Company and our report dated February 6, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nBoston, Massachusetts\nFebruary 6, 2025\n70\nTable of Contents\nItem 9B. Other Information \n(a)\nAs previously announced, Mr. Frank Connor will retire effective February 28, 2025 after having served as our CFO for fifteen years. During his tenure Mr. Connor has made significant contributions across Textron to drive financial and operational excellence. As part of his 2025 duties, Mr. Connor will oversee the completion of the Company’s post year-end financial reporting and related activities and will effect an orderly transition of the CFO role to Mr. Rosenberg and other succession planning within the finance organization.  On February 5, 2025, the Organization and Compensation Committee approved Mr. Connor’s 2025 compensation to be set at $1,000,000, taking into account Mr. Connor’s expected duties through his retirement. Mr. Connor’s 2024 total target compensation was $6,300,000.”\n(b)\nNone of our directors or executive officers \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or \nadopted\n or \nterminated\n a “non-Rule 10b5-1 trading arrangement” (as such terms are defined in Item 408 of Regulation S-K) during the quarter ended December 28, 2024.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nThe information appearing under “ELECTION OF DIRECTORS – Nominees for Director,” \"SECURITY OWNERSHIP – Delinquent Section 16(a) Reports,” “CORPORATE GOVERNANCE – Board Committees – \nAudit Committee\n,” “– Corporate Governance Guidelines and Policies,” “– Code of Ethics,” and “– Insider Trading Policies and Procedures,” in the Proxy Statement for our 2025 Annual Meeting of Shareholders is incorporated by reference into this Annual Report on Form 10-K.\nInformation regarding our executive officers is contained in Part I of this Annual Report on Form 10-K.\nItem 11. Executive Compensation\nThe information appearing under “CORPORATE GOVERNANCE – Compensation of Directors,” “COMPENSATION COMMITTEE REPORT,” “COMPENSATION DISCUSSION AND ANALYSIS” and “EXECUTIVE COMPENSATION” in the Proxy Statement for our 2025 Annual Meeting of Shareholders is incorporated by reference into this Annual Report on Form 10-K.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information appearing under “SECURITY OWNERSHIP” and “EXECUTIVE COMPENSATION – Equity Compensation Plan Information” in the Proxy Statement for our 2025 Annual Meeting of Shareholders is incorporated by reference into this Annual Report on Form 10-K.\nItem 13. Certain Relationships and Related Transactions and Director Independence\nThe information appearing under “CORPORATE GOVERNANCE – Director Independence” and “EXECUTIVE COMPENSATION – Transactions with Related Persons” in the Proxy Statement for our 2025 Annual Meeting of Shareholders is incorporated by reference into this Annual Report on Form 10-K.\nItem 14. Principal Accountant Fees and Services\nThe information appearing under “RATIFICATION OF APPOINTMENT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM – Fees to Independent Auditors” in the Proxy Statement for our 2025 Annual Meeting of Shareholders is incorporated by reference into this Annual Report on Form 10-K.\n71\nTable of Contents\nPART IV\nItem 15. Exhibits and Financial Statement Schedules\nFinancial Statements and Schedules — See Index on Page \n31\n.\nExhibits\n3.1A\nRestated Certificate of Incorporation of Textron as filed with the Secretary of State of Delaware on April 29, 2010. Incorporated by reference to Exhibit 3.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended April 3, 2010. (SEC File No. 1-5480)\n3.1B\nCertificate of Amendment of Restated Certificate of Incorporation of Textron Inc., filed with the Secretary of State of Delaware on April 27, 2011. Incorporated by reference to Exhibit 3.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended April 2, 2011. (SEC File No. 1-5480)\n3.2\nAmended and Restated By-Laws of Textron Inc., effective \nFebruary 21,\n \n2024\n. Incorporated by reference to Exhibit 3.\n1\n to Textron’s Current Report on Form 8-K filed on \nFebruary 23, 2024\n.\n4.1A\nSupport Agreement dated as of May 25, 1994, between Textron Inc. and Textron Financial Corporation. Incorporated by reference to Exhibit 4.1 to Textron’s Annual Report on Form 10-K for the fiscal year ended December 31, 2011. (SEC File No. 1-5480)\n4.1B\nAmendment to Support Agreement, dated as of December 23, 2015, by and between Textron Inc. and Textron Financial Corporation. Incorporated by reference to Exhibit 4.1B to Textron’s Annual Report on Form 10-K for the fiscal year ended January 2, 2016\n.\n (SEC File No. 1-5480).\n4.2\nDescription of registrant’s securities. \nNOTE:\nInstruments defining the rights of holders of certain issues of long-term debt of Textron have not been filed as exhibits because the authorized principal amount of any one of such issues does not exceed 10% of the total assets of Textron and its subsidiaries on a consolidated basis. Textron agrees to furnish a copy of each such instrument to the Commission upon request.\nNOTE:\nExhibits 10.1 through 10.16 below are management contracts or compensatory plans, contracts or agreements.\n10.1A\nTextron Inc. 20\n24\n Long-Term Incentive Plan\n.\n10.1B\nForm of Stock-Settled Restricted Stock Unit (with Dividend Equivalents) Grant Agreement for Non-Employee Directors under the 2024 Long-Term Incentive Plan. Incorporated by reference to Exhibit 10.2 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended Ju\nne\n 29, 2024.\n10.2A\nAmended and Restated Textron Inc. Short-Term Incentive Plan. Incorporated by reference to Exhibit 10.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended October 3, 2020.\n10.2B\nAmendment No. 1 to Amended and Restated Textron Inc. Short-Term Incentive Plan. Incorporated by reference to Exhibit 10.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended September 30, 2023\n.\n10.3A\nTextron Inc. 2015 Long-Term Incentive Plan. Incorporated by reference to Exhibit 10.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended July 4, 2015\n.\n (SEC File No. 1-5480)\n10.3B\nAmendment No. 1 to Textron Inc. 2015 Long-Term Incentive Plan. Incorporated by reference to Exhibit 10.2 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended September 30, 2023\n.\n10.3C\nAmendment No. 2 to Textron Inc. 2015 Long-Term Incentive Plan.\n10.3D\nForm of Non-Qualified Stock Option Agreement under 2015 Long-Term Incentive Plan. Incorporated by reference to Exhibit 10.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended April 2, 2016\n.\n (SEC File No. 1-5480)\n72\nTable of Contents\n10.3E\nForm of Performance Share Unit Grant Agreement under 2015 Long-Term Incentive Plan. Incorporated by reference to Exhibit 10.2 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended April 4, 2020.\n10.3F\nForm of Stock-Settled Restricted Stock Unit (with Dividend Equivalents) Grant Agreement under 2015 Long-Term Incentive Plan. Incorporated by reference to Exhibit 10.1 to Textron's Quarterly Report on Form 10-Q for the fiscal quarter ended April 4, 2020. \n10.4\nTextron Spillover Savings Plan, effective October 5, 2015. Incorporated by reference to Exhibit 10.4 to Textron’s Annual Report on Form 10-K for the fiscal year ended January 2, 2016 (SEC File No. 1-5480).\n10.5A\nTextron Spillover Pension Plan, As Amended and Restated Effective January 3, 2010, including Appendix A (as amended and restated effective January 3, 2010), Defined Benefit Provisions of the Supplemental Benefits Plan for Textron Key Executives (As in effect before January 1, 2007). Incorporated by reference to Exhibit 10.4 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended April 3, 2010. (SEC File No. 1-5480)\n10.5B\nAmendments to the Textron Spillover Pension Plan, dated October 12, 2011. Incorporated by reference to Exhibit 10.5B to Textron’s Annual Report on Form 10-K for the fiscal year ended December 31, 2011. (SEC File No. 1-5480)\n10.5C\nSecond Amendment to the Textron Spillover Pension Plan, dated October 7, 2013. Incorporated by reference to Exhibit 10.5C to Textron’s Annual Report on Form 10-K for the fiscal year ended December 28, 2013. (SEC File No. 1-5480)\n10.6\nDeferred Income Plan for Textron Executives, Effective October 5, 2015. Incorporated by reference to Exhibit 10.6 to Textron’s Annual Report on Form 10-K for the fiscal year ended January 2, 2016 (SEC File No. 1-5480).\n10.7A\nDeferred Income Plan for Non-Employee Directors, As Amended and Restated Effective January 1, 2009, including Appendix A, Prior Plan Provisions (As in effect before January 1, 2008). Incorporated by reference to Exhibit 10.9 to Textron’s Annual Report on Form 10-K for the fiscal year ended January 3, 2009. (SEC File No. 1-5480)\n10.7B\nAmendment No. 1 to Deferred Income Plan for Non-Employee Directors, as Amended and Restated Effective January 1, 2009, dated as of November 6, 2012. Incorporated by reference to Exhibit 10.8B to Textron’s Annual Report on Form 10-K for the fiscal year ended December 29, 2012. (SEC File No. 1-5480)\n10.7C\nAmendment No. 2 to Deferred Income Plan for Non-Employee Directors, as Amended and Restated Effective January 1, 2009. Incorporated by reference to Exhibit 10.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended April 1, 2017.\n10.7D\nAmendment No. 3 to Deferred Income Plan for Non-Employee Directors, as Amended and Restated Effective January 1, 2009. Incorporated by reference to Exhibit 10.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended September 29, 2018.\n10.7E\nAmendment No. 4 to Deferred Income Plan for Non-Employee Directors, as Amended and Restated Effective January 1, 2009. Incorporated by reference to Exhibit 10.7E to Textron's Annual Report on Form 10-K for the fiscal year ended January 4, 2020.\n10.8A\nSeverance Plan for Textron Key Executives, As Amended and Restated Effective January 1, 2010. Incorporated by reference to Exhibit 10.10 to Textron’s Annual Report on Form 10-K for the fiscal year ended January 2, 2010. (SEC File No. 1-5480)\n10.8B\nFirst Amendment to the Severance Plan for Textron Key Executives, dated October 26, 2010. Incorporated by reference to Exhibit 10.10B to Textron’s Annual Report on Form 10-K for the fiscal year ended January 1, 2011. (SEC File No. 1-5480)\n73\nTable of Contents\n10.8C\nSecond Amendment to the Severance Plan for Textron Key Executives, dated March 24, 2014. Incorporated by reference to Exhibit 10.5 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended March 29, 2014. (SEC File No. 1-5480)\n10.9\nForm of Indemnity Agreement between Textron and its executive officers. Incorporated by reference to Exhibit 10.9 to Textron’s Annual Report on Form 10-K for the fiscal year ended December 30, 2017\n10.10\nForm of Indemnity Agreement between Textron and its non-employee directors (approved by the Nominating and Corporate Governance Committee of the Board of Directors on July 21, 2009 and entered into with all non-employee directors, effective as of August 1, 2009 or as of such later date as the director joined the Board). Incorporated by reference to Exhibit 10.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended October 3, 2009. (SEC File No. 1-5480)\n10.11A\nLetter Agreement between Textron and Scott C. Donnelly, dated June 26, 2008. Incorporated by reference to Exhibit 10.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended June 28, 2008. (SEC File No. 1-5480)\n10.11B\nAmendment to Letter Agreement between Textron and Scott C. Donnelly, dated December 16, 2008, together with Addendum No.1 thereto, dated December 23, 2008. Incorporated by reference to Exhibit 10.15B to Textron’s Annual Report on Form 10-K for the fiscal year ended January 3, 2009. (SEC File No. 1-5480)\n10.11C\nAmended and Restated Hangar License and Services Agreement, made and entered into as of October 1, 2015, between Textron Inc. and Mr. Donnelly’s limited liability company. Incorporated by reference to Exhibit 10.2 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended October 3, 2015 (SEC File No. 1-5480).\n10.11D\nAircraft Dry Lease Agreement, made and entered into as of December 18, 2018, between Mr. Donnelly’s limited liability company and Textron Inc. Incorporated by reference to Exhibit 10.11D to Textron's Annual Report on Form 10-K for the fiscal year ended December 29, 2018.\n10.12A\nLetter Agreement between Textron and Frank Connor, dated July 27, 2009. Incorporated by reference to Exhibit 10.2 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended October 3, 2009. (SEC File No. 1-5480)\n10.12B\nAmended and Restated Hangar License and Services Agreement, made and entered into on July 24, 2015, between Textron Inc. and Mr. Connor’s limited liability company. Incorporated by reference to Exhibit 10.3 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended October 3, 2015 (SEC File No. 1-5480).\n10.13\nLetter Agreement between Textron and Julie G. Duffy, dated July 27, 2017. Incorporated by reference to Exhibit 10.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended September 30, 2017.\n10.14A\nLetter Agreement between Textron and E. Robert Lupone, dated December 22, 2011. Incorporated by reference to Exhibit 10.17 to Textron’s Annual Report on Form 10-K for the fiscal year ended December 31, 2011. (SEC File No. 1-5480)\n10.14B\nAmendment to letter agreement between Textron and E. Robert Lupone, dated July 27, 2012. Incorporated by reference to Exhibit 10.5 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended September 29, 2012. (SEC File No. 1-5480)\n10.15\nTextron Inc. 2015 Long-Term Incentive Plan Equity Program for Non-Employee Directors. Incorporated by reference to Exhibit 10.15 to Textron's Annual Report on Form 10-K for the fiscal year ended January 4, 2020\n.\n10.16\nDirector Compensation.\n74\nTable of Contents\n10.17\nCredit Agreement, dated as of October 21, 2022, among Textron, the Lenders listed therein, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A. and Citibank, N.A., as Syndication Agents, and MUFG Bank, Ltd., as Documentation Agent. Incorporated by reference to Exhibit 10.1 to Textron’s Quarterly Report on Form 10-Q for the fiscal quarter ended October 1, 2022.\n19\nPolicy on T\nr\nading in Textron Securities.\n21\nCertain subsidiaries of Textron. Other subsidiaries, which considered in the aggregate do not constitute a significant subsidiary, are omitted from such list.\n23\nConsent of Independent Registered Public Accounting Firm.\n24\nPower of attorney.\n31.1\nCertification of Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification of Chief Executive Officer Pursuant to 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification of Chief Financial Officer Pursuant to 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97\nTextron Inc. Recovery Policy. Incorporated by reference to Exhibit 97 to Textron’s Annual Report on Form 10-K for the fiscal year ended December 30, 2023.\n101\nThe following materials from Textron Inc.’s Annual Report on Form 10-K for the year ended December 28, 2024, formatted in Inline XBRL (eXtensible Business Reporting Language): (i) the Consolidated Statements of Operations, (ii) the Consolidated Statements of Comprehensive Income (iii) the Consolidated Balance Sheets, (iv) the Consolidated Statements of Shareholders’ Equity, (v) the Consolidated Statements of Cash Flows, (vi) the Notes to the Consolidated Financial Statements, and (vii) Schedule II – Valuation and Qualifying Accounts.\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\nItem 16. Form 10-K Summary\nNot applicable.\n75\nTable of Contents\nSignatures\nPursuant to the requirement of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized on this 6th day of February 2025.\nTEXTRON INC.\nRegistrant\nBy:\n/s/ Frank T. Connor\nFrank T. Connor\nExecutive Vice President and Chief Financial Officer\n76\nTable of Contents\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below on this 6th day of February 2025 by the following persons on behalf of the registrant and in the capacities indicated:\nName\nTitle\n/s/ Scott C. Donnelly\nScott C. Donnelly\nChairman, President and Chief Executive Officer\n(principal executive officer)\n*\nRichard F. Ambrose\nDirector\n*\nKathleen M. Bader\nDirector\n*\nR. Kerry Clark\nDirector\n*\nMichael X. Garrett\nDirector\n*\nDeborah Lee James\nDirector\n*\nThomas A. Kennedy\nDirector\n*\nLionel L. Nowell III\nDirector\n*\nJames L. Ziemer\nDirector\n*\nMaria T. Zuber\nDirector\n/s/ Frank T. Connor\nFrank T. Connor\nExecutive Vice President and Chief Financial Officer\n(principal financial officer)\n/s/ Mark S. Bamford\nMark S. Bamford\nVice President and Corporate Controller\n(principal accounting officer)\n*By:\n/s/ Jayne M. Donegan\nJayne M. Donegan, Attorney-in-fact\n77"
  }
}