{
  "ticker": "TYL",
  "cik": "0000860731",
  "company_name": "TYLER TECHNOLOGIES INC",
  "filing_date": "2025-02-19",
  "accession": "0000860731-25-000007",
  "primary_doc": "tyl-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n44\nSignatures\n45\n2\nPART I\nITEM 1.    BUSINESS.\nDESCRIPTION OF BUSINESS\nTyler Technologies, Inc. (“Tyler” or “Company”) is a leading provider of integrated software and technology management solutions for the public sector. Our solutions empower local, state, and federal government entities to create smarter, safer, and stronger communities. We offer the broadest range of software solutions and services designed for every level of public sector government agency. Our solutions deliver mission-critical technology to support the essential functions of government, including public safety, justice, public health, taxation and budgeting, infrastructure and land use, outdoor recreation, utility and civic services, regulation, K-12 education, and social services. We provide both the back-office systems-of-record that serve the operational needs of specific government agencies, as well as platform technology solutions that are designed to integrate with our back-office solutions and be deployed and connected across many agencies. Examples of transformative platform technologies include our market-leading payments platform, data platform, low-code application development platform, and digital resident experience solutions.\nWe maintain deep, long-term relationships with state and local government agencies, including dedicated state-level offices in the 29 states in which we have enterprise contracts. Our professional information technology (“IT”) services include cloud-based software deployment, data conversion, and training. We also provide continuing client support services to ensure product performance and reliability, providing us with long-term client relationships and a significant base of recurring revenue.\nMARKET OVERVIEW\nThe federal, state, and local public sector market is one of the largest and most decentralized IT markets in the country, consisting of hundreds of federal agencies, all 50 states, approximately 3,000 counties, 36,000 cities and towns, and 12,600 school districts. This market is also comprised of approximately 40,000 special districts and other agencies, each with specialized delegated responsibilities and unique information management requirements. \nToday, government agencies play an essential role in all aspects of society, including providing protection and security, delivering public services, ensuring public health, effectively administrating public resources, developing and enforcing regulations, and maintaining engagement with the public. In an increasingly digital world, constituents expect more transparency, frictionless service, and better online experiences from public entities. As a result, government entities recognize the increasing value of information management systems and services to, among other things, improve transactional revenue collection, provide transparency and increased access to information, and streamline the delivery of services to their constituents. Government bodies recognize “digital government” is not just a modern convenience, but a requirement for good governance. From integrated public safety and justice information systems to systems that integrate tax, finance, infrastructure, and land use processes, many jurisdictions have benefited significantly from the implementation of jurisdiction-wide systems that allow different agencies or government offices to share data and provide a more comprehensive approach to information management.\nAgencies at all levels of government face challenges in attracting and retaining the staff necessary to support their IT operations. As a result, they seek to establish long-term relationships with reliable providers of high-quality IT products and services such as Tyler. \nAlthough governments often face budgetary constraints in their operations, their primary revenue sources are usually property, business, and sales tax revenue, as well as transactional fees and service charges, which historically tend to be relatively stable. Government agencies increasingly rely on digital payment solutions to streamline the collection and distribution of government funds. In addition, the acquisition of modern technology typically enables governments to operate more efficiently and securely and often provides a measurable return on investment that justifies the purchase of software and related services. \nTyler management believes we compete based on several key factors, including: \n•\nThe breadth, depth, and quality of our product and service offerings \n•\nDeep industry expertise with proven implementation success \n•\nTechnological innovation \n•\nName recognition, reputation, and references \n•\nValue and return-on-investment \n•\nFinancial strength and stability \n3\nPRODUCTS AND SERVICES\nWe provide a comprehensive and flexible suite of products and services that addresses the information technology needs of cities, counties, states, schools, federal agencies, and other government entities. \nWe design, develop, market, and support a broad range of software solutions to serve mission-critical “back-office” functions of the public sector. Many of our back-office software applications integrate with our transformative platform solutions, such as our unified payments platform, data and insights platform, and digital public engagement solutions that allow for real-time public access to a variety of information or that allow the public to transact business with governments online.  \nEach of our core software solutions consists of several fully integrated applications. In some of the product areas, such as financial management and education and property appraisal and tax, we offer multiple solutions designed to meet the needs of different sized governments. \nA description of our primary suites of products and services follows:\nPlatform & Transformative Technology Solutions \nOur platform and transformative technology solutions create the foundation for government innovation and enhance our clients’ ability to connect with constituents, conduct business, collect and disburse funds, safeguard systems, and leverage data to its fullest. Many of these solutions are integrated into our products, while others can be leveraged as add-on solutions. Our platform & transformative technology solutions include: \n•\nCybersecurity: Augments government agencies’ resources with access to advanced expertise for program design, 24/7 threat detection and response, customized employee training, vulnerability testing, and more. \n•\nData & Insights: Allows agencies to transform data into insights about financial, operational, and strategic outcomes by making it easier to surface meaningful data for informing government decisions and citizens. \n•\nDigital Solutions: Provides a seamless cross-department experience so that agencies can deliver a unified citizen experience and achieve better outcomes while helping workers and policymakers share, communicate, and leverage data more effectively.\n•\nPayments: The leading platform for public sector payments that processes nearly half a billion transactions annually and covers the entire payments life cycle, including billing, presentment, merchant onboarding, collections, reconciliation, and disbursements.\n•\nPlatform Technologies: A low-code application development platform purpose-built for the public sector. Enables government workers to quickly build solutions and applications that suit their needs.\n \n•\nOutdoor Recreation: Designed specifically for local, state, and federal outdoor agencies, our solutions encompass campsite reservations, activity registrations, licensing sales and renewals, and real-time data for conservation and park management. \nPublic Administration Solutions \nOur public administration solutions connect the dots between departments, agencies, municipalities, and states to deliver the core business functions of the public sector. By making it easier to manage the business side of the public sector, agencies can focus on delivering the resources and services required to make their community a place where people want to live. Our public administration solutions include: \n•\nCivic Services: Business management and community development solutions manage permitting, enforcement, health and safety inspections, compliance, maintenance and work orders, 311 requests, and more. \n•\nERP: Integrates core financial applications with human resources, revenue management, tax billing, utilities, asset management, and payment processing. \n•\nProperty & Recording: Manages all aspects of the property tax life cycle, including appraisal services, valuation, tax billing and collections, assessment administration, and land and official records.\n•\nRegulatory: Permitting, licensing and regulatory management help local, state, and federal government agencies and departments of any size simplify every aspect of regulatory compliance. \n4\nCourts & Public Safety Solutions\nOur integrated courts and public safety solutions are used at the municipal, county, state, and federal levels to help courts, prosecutors, defenders, jails, sheriff’s offices, police departments, and probation officers keep their communities safe. Our courts and public safety solutions include:\n•\nCorrections: Connects courts, public safety, and supervision agencies to ensure safer and more efficient operations for correctional facilities.\n•\nCourts & Justice: Provides case management and shares data with all justice partners by connecting courts, prosecutors, public defenders, and the filing community. \n•\nPublic Safety: Provides real-time information and instant data sharing across jurisdictions and promotes intelligence-led responses so that help arrives faster and more prepared while complying with state and federal reporting mandates.\nK-12 Education Solutions \nOur integrated school solutions enable districts to operate as a single system across campuses and functions. By bringing data together and making it accessible as needed to administrators, teachers, students, bus drivers, and parents, we are able to improve everyone’s ability to support the educational journey. Our K–12 Education solutions include: \n•\nSchool ERP: Manages K-12 schools’ most essential business functions by integrating financial, budgeting, and procurement data. Our suite of human resource management tools helps schools efficiently manage payroll and employee information and hire and retain qualified teachers, staff, and substitutes. \n•\nStudent Transportation: Manages every aspect of the student transportation operation with integrated software and telematic hardware solutions to help ensure operational efficiency and cost-effectiveness.\nHealth & Human Services Solutions\nOur integrated solutions enable health and human service agencies to leverage data and optimize operations to better maintain the well-being of communities. Our health & human services solutions include: \n•\nEnvironmental Health: Streamlines the process of issuing permits, performing health inspections, running reports, and investigating complaints.  \n•\nDisability & Benefits: Helps programs and agencies administer benefits and makes it easier to manage the complexity of services like medical cannabis regulation, veterans’ benefits, vocational rehabilitation, workers’ compensation, and more. \nRevenues\nWe derive our revenues from three primary sources:\n•\nSubscription-based services\n•\nMaintenance and support\n•\nProfessional services\nSubscription-Based Services\nSubscriptions revenue consists of revenues derived from our SaaS arrangements and transaction-based fees. We are able to provide the majority of our software products through our SaaS model. The clients who choose this model typically do not wish to maintain, update and operate these systems directly, or make up-front capital expenditures to implement these advanced technologies. The contract terms for these arrangements range from one to 10 years but are typically contracted for periods of generally one to three years. The majority of our SaaS or hosting arrangements include additional professional services as well as maintenance and support services. \nTransaction-based fees primarily relate to digital government services, online payment solutions (which are sometimes offered with the assistance of third-party vendors), and online dispute resolution solutions. Digital government services consist of websites and applications that allow consumers, such as businesses and citizens, to access government information, complete transactions and make electronic payments. Our online payments solution covers the entire payments life cycle, including billing, presentment, merchant onboarding, collections, reconciliation, and disbursements. We also provide electronic document filing solutions (“e-filing”) that simplify the filing and management of court related documents for courts and law offices.\n5\nMaintenance and Support\nSupport is provided to clients over the phone or via the Internet through help desks staffed by our client support representatives. For more complicated issues, our staff, with the clients’ permission, can log on to clients’ systems remotely. We maintain our clients’ software largely through releases that contain improvements and incremental additions of features and functionality, along with updates necessary because of legislative or regulatory changes.\nNearly all of our on-premises software clients contract with us for maintenance and support, which provides us with a significant source of recurring revenue. We generally provide maintenance and support for our on-premises clients under annual, or in some cases multi-year, contracts, with a typical fee based on a percentage of the software product’s license fee. These fees can generally be increased on renewal and may also increase as new license fees increase. Maintenance and support fees are generally paid annually in advance. Most maintenance contracts automatically renew unless the client or Tyler gives notice of termination prior to expiration. Similar maintenance and support services are provided to our SaaS clients and are included in their subscription fees, which are classified as subscription-based revenue.\nProfessional Services\nWe provide a variety of professional services to clients who utilize our software products. Our clients contract with us for installation, training, and data conversion services in connection with their implementation of Tyler’s software solutions, whether through a SaaS arrangement or on-premise software license. The complete implementation process for a typical system includes planning, design, data conversion, set-up and testing. At the culmination of the implementation process, an implementation team is generally onsite at the client’s facility or available via remote video conferencing to help ensure the smooth go-live with the new system. Implementation fees are charged separately to clients on either a fixed-fee or hourly charge basis, depending on the contract.\nBoth in connection with the installation of new systems and on an ongoing basis, we provide extensive training services and programs related to our products and services. Training can be provided in our training centers, onsite at clients’ locations, at meetings and conferences, or remotely, and can be customized to meet clients’ requirements. The vast majority of our clients contract with us for training services, both to improve their employees’ proficiency and productivity and to fully utilize the functionality of our systems. Training services are generally billed on an hourly or daily basis, along with travel and other expenses.\nOur other sources of revenue include software licenses and royalties and computer hardware equipment, which represent 3% and 4% of total revenues for the twelve months ended December 31, 2024 and 2023, respectively.\nSTRATEGY\nOur objective is to grow our revenues and earnings organically, supplemented by focused strategic acquisitions. The key components of our business strategy are to:\n•\nProvide high quality, value–added products and services to our clients\n. We compete on the basis of, among other things, delivering to clients our deep domain expertise in government operations through the high value products and services in the market. We believe we have achieved a reputation as a premium product and service provider to the public sector market.\n•\nContinue to expand our product and service offerings\n. While we already have what we believe to be the broadest line of software products for the public sector, we continually strive to upgrade our core software applications and expand our complementary product and service offerings to respond to technological advancements and the changing needs of our clients. We regularly add new products and services to our portfolio through internal product development as well as acquisitions. We believe that the addition of new features and applications enhances the market appeal of our core products. We have also broadened our offerings of consulting and business process reengineering services.\n•\nAccelerate our move to the cloud\n. We have offered most of our core products in both an on-premises license model and a cloud-based subscription model for several years and have seen a steady increase in the percentage of new software clients choosing our cloud model in recent years. Beginning in late 2019, we moved our approach to sales from “cloud-neutral” to “cloud-first,” with an increasing preference to provide our solutions in the cloud. We are making significant investments in optimizing our products to be deployed efficiently in the public cloud. Over a multi-year period we have been transitioning from hosting clients in Tyler’s proprietary data centers to utilizing Amazon Web Services (“AWS”) for cloud hosting. \n6\n•\nExpand our client base\n. We seek to establish long-term relationships with new clients primarily through our sales and marketing efforts. While we currently have clients in all 50 states, Canada, the Caribbean, the United Kingdom, Australia, and other international locations, some of our solutions have not fully achieved nationwide geographic penetration. We intend to continue to expand into new geographic markets by adding sales staff and targeting marketing efforts by solutions in those areas. We also intend to continue to expand our client base to include larger jurisdictions. While our traditional market focus has primarily been on small and mid-sized governments, our increased size and market presence, together with the technological advances and improved scalability of certain of our solutions, are allowing us to achieve increasing success in selling to larger clients. We also expect to expand our presence in international markets by leveraging our leadership position in the United States through the disciplined pursuit of selected opportunities in other countries.\n•\nExpand our existing client relationships\n. Our existing client base offers significant opportunities for additional sales of solutions and services that we currently offer, but that existing clients do not fully utilize. Add-on sales to existing clients typically involve lower sales and marketing expense than sales to new clients. In particular, since the acquisition of NIC Inc. (“NIC”) in April 2021, we have been successfully selling Tyler software products into NIC’s client base and in turn providing NIC’s payment services to Tyler’s client base. We expect those opportunities to continue to expand.\n•\nGrow recurring revenues\n. We have a large recurring revenue base from subscription-based services and maintenance and support, which generated revenues of $1.8 billion, or 84% of total revenues, in 2024. We have historically experienced very low client turnover (approximately 2% annually), and recurring revenues continue to grow as the installed client base increases. Subscription-based revenues have been our fastest growing revenue category over the past five years, increasing from $350.6 million in 2020 to $1.3 billion in 2024. We monitor Annualized Recurring Revenue (“ARR”), which is calculated based on quarter-to-date end total recurring revenues multiplied by four. ARR was $1.86 billion and $1.61 billion as of December 31, 2024, and 2023, respectively. ARR increased approximately 15% compared to the prior period primarily due to an increase in subscriptions revenue resulting from an ongoing shift toward SaaS arrangements.\n•\nMaximize economies of scale and take advantage of financial leverage in our business\n. We seek to build and maintain a larger client base to create economies of scale, enabling us to provide value-added products and services to our clients while expanding our operating margins. In addition, we believe that we have a marketing and administrative infrastructure in place that can be leveraged to accommodate significant long-term growth without proportionately increasing sales and marketing and general and administrative expenses.\n•\nAttract and retain highly qualified employees\n. We believe that the depth and quality of our management and staff is one of our significant strengths, and that the ability to retain such employees is crucial to our continued growth and success. We believe that our stable management team, financial strength and growth opportunities, as well as our leadership position in the public sector market, enhance our attractiveness as an employer for highly skilled employees.\n•\nPursue strategic acquisitions\n. We selectively pursue strategic acquisitions that provide us with one or more of the following:\n◦\nNew products and services to complement our existing offerings\n◦\nEntry into new markets related to the public sector\n◦\nNew clients and/or geographic expansion\n•\nEstablish strategic alliances\n. We have a strategic collaboration agreement with AWS for cloud hosting services, which brings together Tyler, the nation’s largest software company exclusively focused on the public sector, and AWS, the broadest and deepest cloud platform. Specifically, the agreement with AWS provides the framework for development, training and collaboration in order to support next-generation applications that have the scalability, resiliency, and security AWS offers. AWS is assisting us in accelerating innovation and the development of strategic initiatives. These initiatives bring the most advanced cloud-native services to Tyler clients to help improve the flow of information and provide a better experience for state, local, and federal governments.\n7\nSALES, MARKETING AND CLIENTS\nWe market our products and services primarily through direct sales and marketing personnel located throughout the United States. Other in-house sales staff focus on add-on sales, professional services and support. For certain products, we also utilize a partner network for both sales and professional services, primarily in the state and federal markets. \nSales of new systems are typically generated from referrals from other government offices or departments within a county or municipality, referrals from other local governments, relationships established between sales representatives and county or local officials, contacts at trade shows, direct mailings, and direct contact from prospects already familiar with us. We are active in numerous national, state, county, and local government associations and participate in annual meetings, trade shows, and educational events.\nClients consist primarily of federal, state, county and municipal agencies, school districts and other local government offices. In counties, clients include the auditor, treasurer, tax assessor/collector, county clerk, district clerk, county and district court judges, probation officers, sheriff, and county appraiser. At municipal government sites, clients include directors from various departments, including administration, finance, utilities, public works, code enforcement, personnel, purchasing, taxation, municipal court and police. At the state and federal levels, clients include Chief Information Officers and agency heads. \nCOMPETITION\nWe compete with numerous local, regional, and national firms that provide or offer some or many of the same solutions and services that we provide. Many of these competitors are smaller companies that may offer less expensive solutions than ours. Many of these firms operate within a specific geographic area and/or in a narrow product or service niche. We also compete with national firms, some of which have greater financial and technical resources than we do, including Oracle Corporation, Infor, SAP AG, Workday, Inc., CentralSquare Technologies, Thomson Reuters Corporation, Motorola Solutions, Inc., Axon Enterprise, Inc., and Constellation Software, Inc. In addition, we sometimes compete with consulting and systems integration firms, which develop custom systems, primarily for larger governments. We also occasionally compete with central internal information service departments of governments, which requires us to persuade the end-user department to discontinue service by its own personnel and outsource the service to us.\nWe compete on a variety of factors, including price, service, name recognition, reputation, technological capabilities, and the ability to configure products and services to address the individual requirements of the client. Our ability to offer an integrated system of applications for several offices or departments is often a competitive advantage. Governmental units often are required to seek competitive proposals through a request for proposal process, and some prospective clients use consultants to assist them with the proposal and vendor selection process.\nSUPPLIERS\nSubstantially all of the computers, peripherals, printers, scanners, operating system software, office automation software, and other equipment necessary for the implementation and provision of our software systems and services are presently available from several third-party sources. Hardware is purchased on original equipment manufacturer or distributor terms at discounts from retail. We have not experienced any significant supply problems.\nSEASONALITY\nTransaction-based fees are generally the result of multi-year contracts with our clients that result in fees generated by payment transactions and digital government services and are collected on a recurring basis during the contract term. Transaction-based fees are historically highest in the second quarter, which coincides with peak outdoor recreation seasons and statutory filing deadlines in many jurisdictions, and lowest in the fourth quarter due to fewer business days and lower transaction volumes around holidays. \nINTELLECTUAL PROPERTY, PROPRIETARY RIGHTS, AND LICENSES\nWe regard certain features of our internal operations, software, and documentation as confidential and proprietary and rely on a combination of contractual restrictions, trade secret laws and other measures to protect our proprietary intellectual property. We generally do not rely on patents. We typically license our software products under non-exclusive license agreements, which are generally non-transferable and have a perpetual term.\n8\nHUMAN CAPITAL RESOURCES\nHuman Capital\nOur experienced, collaborative team is one of the most significant contributors to our success in empowering the public sector to create smarter, safer, and stronger communities. Our effectiveness in attracting and developing talented team members, many of whom spend the majority of their careers at Tyler serving our public sector clients, demonstrates our commitment to providing a welcoming and safe workplace, with a strong culture, compensation and benefits, and continual growth opportunities for our team members. \nAs of December 31, 2024, we had approximately 7,400 team members. Approximately 94% of our team members work in one of our 54 U.S. offices or remotely in the U.S.\n \nApproximately 450 of our team members are in Canada, the Philippines, or India. Race and gender reporting are based on information provided by team members. We define leadership as positions which are one or two levels removed from our CEO with management responsibility. The tables below represent our workforce demographics as of December 31, 2024:\nRace:\nWhite\nAsian\nBlack or African  American\nHispanic or Latino\nTwo or more races\nNative  Americans and Other Pacific Islanders\nNot specified\nOverall\n69.6%\n7.7%\n4.7%\n4.9%\n2.1%\n0.5%\n10.5%\nLeadership\n84.0%\n6.3%\n2.9%\n3.1%\n1.4%\n0.4%\n1.9%\nGender:\nMale\nFemale\nNon-Binary\nNot specified\nOverall\n60.6%\n37.1%\n2.0%\n0.3%\nLeadership\n62.1%\n37.9%\n—%\n—%\nWe believe our efforts in managing and supporting our workforce are effective, as evidenced by current levels of applicants, team member tenure, high levels of engagement reported through survey feedback from Tyler team members, and low team member turnover.\nOur team continues to work collaboratively with and for our clients and partners across multiple work arrangements: fully office-based, fully remote and a blended approach of office-based and remote work. Prior to COVID, approximately 40% of team members worked remotely, primarily in sales and professional services roles. As of December 31, 2024, approximately 55% of team members work remotely and 45% of team members are either partially or fully office-based. Collaboration is an important part of our culture.  We are dedicated to creating opportunities for our team members to connect in person, enhancing both our partially and fully office-based presence, while maintaining the flexibility that supports their productivity and well-being. \nVoluntary workforce turnover (rolling 12-month attrition) was 8% as of December 31, 2024 and 2023, which was similar to pre COVID levels of turnover at Tyler that consistently outperform industry levels. The average tenure of our team members continues to be approximately eight years, and approximately 30% of our employees have been employed by Tyler for more than ten years. The most frequent factor cited by team members leaving Tyler in 2024 was career opportunities. While 27% of positions filled in 2024 were filled by existing Tyler team members, we continue to invest in talent development and making career opportunities clear to team members, as discussed in further detail below.\nInvestments in Talent\nWe are committed to providing Tyler team members with career growth opportunities and the training and resources necessary to continually strengthen their skills. Our talent assessment and development programs are designed to provide managers and individual contributors with the resources needed to achieve career goals,\n \nstrengthen management skills and effectively lead their teams.\nFor example, in 2024:\n•\nDivision presidents and corporate function executives conducted annual leadership assessment and talent reviews with their HR leaders and leadership teams to identify development priorities within their teams.\n•\nThe executive team, in partnership with HR, updated the leadership competencies required to execute our Tyler 2030 vision and beyond. The competencies were integrated into key people processes, including performance evaluations and 360 feedback assessments. They also served as the foundation for a new leadership framework to build a pipeline of talent from new leaders through executive level leadership.\n9\n•\nNearly 250 Tyler managers participated in our nine-month Tyler Manager Development program which includes more than 50 hours of interactive, experiential learning focused on developing skills managers need to lead a high performing team. The program also includes multiple leadership assessments, including 360-degree feedback, and a dedicated mentor to support their development. To date, 50% of Tyler managers have participated in the program.\n•\nTyler enhanced our investment in our enterprise-wide mentoring platform to support mentoring relationships for targeted skill building and formal mentoring engagements.\n•\nTyler team members completed over 25,000 hours of Tyler-sponsored leadership training, professional development, and compliance training to support continuous learning and career development.\n•\nAs we continue our multi-year investment in developing cloud skills across the Tyler workforce, 657 Tyler team members participated in approximately 13,000 hours of AWS cloud training, resulting in 99 AWS certifications and 227 accreditations completed.\nOversight and Management \nOur human resources team is tasked with leading and supporting our organization in managing employment-related matters, including recruiting and hiring, onboarding and training, compensation planning, and talent management and development. Our executive team is responsible for periodically reviewing team member programs and initiatives, including healthcare and other benefits, as well as our management development and succession planning practices. Management periodically reports to the Board of Directors and its committees regarding human capital measures and results that guide how we attract, retain and develop a workforce to enable our business strategies. \nHealth & Safety\nWe continually invest in the well-being of Tyler team members and their families, providing a range of resources in support of mental and emotional, financial, and physical health and wellness.\nInclusion\nOne of Tyler’s stated core values is inclusion, which we define as respecting and valuing each other. To organize our efforts on this particular value, we operate Tyler Together, with strategic pillars focused on our culture, career development, and community impact. In \n2024,\n achievements included:\n•\nImproved metrics in our talent attraction and retention efforts;\n•\nExtending equity grants to a broader segment of our workforce, with over 20% of \n2024\n grantees representing first-time grantees; and\n•\nThe re-launch or first-time launch of Employee Resource Groups (“ERGs”) including Tyler Women, Tyler Military Veterans, and the Tyler LGBTQ+ Network, each with defined business objectives.\nINTERNET WEBSITE AND AVAILABILITY OF PUBLIC FILINGS\nWe file annual, quarterly, current and other reports, proxy statements and other information with the Securities and Exchange Commission, or SEC, pursuant to the Securities Exchange Act. You may read and copy any materials we file with the SEC at the SEC’s Public Reference Room by calling the SEC at 1-800-732-0330. The SEC maintains an Internet site that contains reports, proxy and other information statements, and other information regarding issuers, including us, that file electronically with the SEC. The address of this site is http://www.sec.gov.\nWe also maintain a website at www.tylertech.com. We make available free of charge through this site our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Forms 4 and 5, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after we electronically file such material with, or furnish it to the SEC. In addition, copies of our annual report will be made available, free of charge, upon written request.\nOur “Code of Business Conduct and Ethics” is also available on our website. We intend to satisfy the disclosure requirements regarding amendments to, or waivers from, a provision of our Code of Business Conduct and Ethics by posting such information on our website.\n10",
    "item1a": "Item 1A, “Risk Factors,” for a discussion of cybersecurity risks.",
    "item1b": "ITEM 1B.    UNRESOLVED STAFF COMMENTS.\nNot applicable.",
    "item1c": "ITEM 1C.    CYBERSECURITY.\nTyler is committed to remaining vigilant in an ever-changing security environment. Our public sector clients are attractive, data-rich targets for threat actors. We partner closely with our clients to assist them in following evolving best practices, and constantly evaluate our own policies and procedures to help ensure that we are implementing safeguards that protect their data and ours.\nThe same cybersecurity threats that predominate across most industries challenge Tyler and our clients as well. These threats range from crude phishing attempts to distributed denial-of-service disruptions to sophisticated malware and ransomware, among others. The evolving use of artificial intelligence increases the risk of cyberattacks and data breaches, which themselves can evolve more rapidly when artificial intelligence is used to facilitate the attack. We are acutely aware that these same threats exist for our acquisition targets, our suppliers, and our third-party business partners, and a cybersecurity incident or vulnerability experienced by any of these entities could also materially and/or adversely impact our business operations and/or performance, both operational and financial, and could harm our reputation and/or competitive position. In addition, vulnerabilities in our clients’ on-premises infrastructure have in the past and may in the future be exploited by bad actors, with the resulting impacts being linked to or attributed to, correctly or incorrectly, our software or services, which could also harm our business, reputation, and future financial results, even if our software or services were not the cause of the exploitation. Given the criticality of a strong cybersecurity posture, we continuously and conscientiously invest in our security infrastructure, tooling, and related resources. \nCyber Risk Management Strategy \nThe Board of Directors is responsible for overseeing Tyler’s senior management in the execution of its risk-management responsibilities and for assessing Tyler’s overall approach to risk management. The Board exercises these responsibilities periodically as part of its meetings and through its committees, each of which examines various components of enterprise risk. \nThe Audit Committee oversees management of financial risks, as well as Tyler’s policies with respect to risk assessment and risk management, including but not limited to information security risk.\n \nTyler’s \nChief Information Security Office (“CISO”)\n leads the information security responsibility at Tyler. \nHe has spent his career in information security, joining Tyler in 2018 and previously working in the payments and semiconductor manufacturing industries. He is a Certified Information Systems Security Professional (“CISSP”) and a Certified Data Privacy Solutions Engineer (“CDPSE”).\nThe CISO reports directly to Tyler’s Chief Operations Officer (“COO”), who in turn reports to the President & Chief Executive Officer. Tyler believes this organizational structure provides a holistic and collaborative approach to cybersecurity risk management, as the COO also oversees Tyler’s information technology, technology, and cloud operations teams, with whom the CISO works regularly and closely. The CISO also has a dotted line to the Chair of the Audit Committee.\n \nThe CISO leads a full-time Security Risk & Compliance team that assesses, identifies and manages material risks from cybersecurity threats and oversees our Information Security Risk Management Program. These efforts include the identification, assessment, and treatment of potential harms to Tyler’s technology, data, and intellectual property. The team continually monitors the potential for harm to help manage the level of risk.\nTo help protect client information and Tyler data, Tyler leverages both internal and external resources, including third-party assessments and threat intelligence services, to work to identify and respond to information security risks. For example:\nInternal Resources\n: Our full-time information security team focuses on managing incoming security risks and developing preventative responses to potential future risks, using tools targeted at people, processes, and technology. These efforts include security training for all employees at hire and on an annual basis thereafter, unannounced security testing (particularly on topics such as phishing), and periodic security alert messages for education or urgent security communications. \nWe repeatedly test our software during the development cycle, including internal assessments of our flagship solutions. We work closely with Tyler’s Data Privacy Officer and her team to educate Tyler team members on complementary privacy-by-design principles. We continuously iterate on access management policies for both technological and physical resources.\n21\nTyler staffs an internal incident response team designed to launch when a potential or suspected security incident is reported to or identified by Tyler. That team is composed of a multi-disciplinary group of Tyler team members, including representatives from the security, privacy, communications, and relevant business unit teams, as well as outside threat intelligence, forensic and legal advisors that are called on as needed. The incident response team’s goal is to confirm, contain, mitigate, and remediate the incident, as applicable, and to conduct a “lessons learned” process when the incident response is completed. \nTo help ensure disaster recovery and business continuity, Tyler maintains a business continuity plan with comprehensive procedures designed to recover Tyler and client assets quickly and effectively following a service disruption. Tyler’s policies and procedures with respect to disaster recovery, as well as its process to help recover critical technology platforms, data center infrastructure, and operations, are updated regularly, tested annually, and reviewed by third-party auditors. We also partner with our Internal Audit team to regularly assess and respond to evolving risk management findings.\nExternal resources:\n Tyler leverages third-party assessments, intelligence services, audits, and reporting obligations to provide additional layers of accountability, monitoring and testing. This includes a bug reporting program that we publish that invites any third party to report a security vulnerability they have identified. We also use a Qualified Security Assessor to perform an annual Payment Card Industry Data Security Standards assessment that tests our credit card data controls, and we undergo an annual System & Organizational Control audit to generate a report of our key compliance controls and objectives, among other things. Given our technology in the courts and public safety markets, we also manage compliance with Criminal Justice Information Systems security standards that are established by the Federal Bureau of Investigation (“FBI”), and we partner with our clients and third-party Criminal Justice Information Services (“CJIS”) compliance consultants to ensure that we adhere to the requirements applicable to us. \nTechnology\n: Tyler also utilizes technology to help harden our environment from internal and external threats. We leverage a third-party endpoint detection management solution and threat intelligence software, as well as web-filtering tools, a multi-factor authentication tool, and related tools that support our “defense-in-depth” strategy. These tools are operated by subject-matter experts that report to the CISO, and Tyler employees are educated on the tooling to the extent applicable. \nThird Parties\n: Our management of third-party security risks is an area of heightened focus for us. Over the past several years, we have worked to formalize our security due diligence process for each acquisition target, such that security is a formally embedded component of our due diligence and typically involves our independent testing of the target technology prior to closing the acquisition. Where a vulnerability or risk is identified, we generally require remediation by the target or attempt to ensure a remediation path post-closing, with contractual protections and liability parameters set forth in the purchase agreement.\nWe strive to enhance our vendor risk analysis, with a goal of universalizing the use of form cybersecurity questionnaires and/or security addenda where applicable. We consider the results of a security and privacy review of material vendor contracts, as well as our material contracts with business partners. Our goal is to proactively identify and manage potential security risks and vulnerabilities, and to clearly articulate the responsibility – whether shared, divided, flow-down, or otherwise – of Tyler, our acquisition targets, our vendors, and/or our business partners. We expect third parties – including our clients – to report cybersecurity incidents to us so that we can assess the impact of the incident on us.\n \nCybersecurity Governance\nIn 2022, we formalized a multi-layered security governance structure, with the goal of ensuring that responsibilities are clear, information is effectively communicated, priorities are coordinated, and proper oversight is provided. Each “layer” of the governance structure has unique meeting, reporting, and action cadences to help ensure consistent communication between our security working groups, our leadership team, and our Board of Directors. \nOn at least a quarterly basis, \nTyler’s CISO provides a formal report to the Audit Committee and to the Board of Directors. Our Audit Committee Chair and CISO also communicate on an as-needed basis between those quarterly reports.\n In 2022, Tyler’s Lead Independent Director completed the requirements to receive the CERT Certificate in Cybersecurity Oversight from the Software Engineering Institute at Carnegie Mellon University. Another Tyler director possesses more than 38 years of Department of Defense experience in cyberspace operations and major computer network architectures.\nTyler’s governance practices are supported by several segments of Tyler’s senior leadership, management, and teams. This includes security working groups and a security governance committee. The security governance committee, which meets on a quarterly basis to review the threat landscape and security initiatives at Tyler, is led by the CISO and includes senior leadership from Tyler’s legal and operational teams, as well as the president of each of Tyler’s three operating groups and Tyler’s President & CEO. \n22\nOperationalizing Cybersecurity Risk Management\nWe firmly believe – and communicate regularly – that all Tyler team members have a vital role to play in cybersecurity risk management. We identify their responsibilities as falling into three key areas: \n•\nParticipating in training to identify and promptly report risks;\n•\nStaying informed by reading all pertinent information and security communications; and\n•\nActively engaging in ongoing training initiatives.\nWe observe Cybersecurity Awareness month with interactive weekly training, workshops, and additional resources on strong cybersecurity practices. In addition to Cybersecurity Awareness month, additional cybersecurity training and awareness initiatives occur throughout the calendar year, including annual security compliance training; a monthly Cybersecurity Awareness Series composed of articles and training highlighting current cybersecurity concerns; company-wide communication as necessary to alert team members of potential threats; and weekly security-related videos with opportunities to win prizes through participation. We track participation in training events and boast high participation rates, with continuous reflection on strategies for driving participation yet higher.\nIn 2022, we expanded our Security Champions Program to identify a resource on our various application teams who proactively operationalizes security best practices on their team. This program helps to ensure that security measures are built into our programs from development to deployment. We have over 100 security champions who can collaboratively advocate security tools throughout the lifecycle of our applications. \nMeasuring Cybersecurity Risks\nIn order to evaluate whether a cybersecurity risk is material to Tyler, we take a multi-disciplinary approach to assessing qualitative and quantitative factors. The cross-functional team includes senior leadership from Tyler’s information security, legal, finance, and accounting teams, as well as senior leadership from the impacted business unit(s).\nWhen an incident is reported, Tyler assembles its incident response team and initiates its incident response process as soon as possible. Working with the incident response team, the CISO aims to take an initial measurement of qualitative and quantitative metrics, typically within 24 hours of the incident report, to help determine whether Tyler’s Chief Financial Officer (“CFO”) and Chief Accounting Officer (“CAO”) should be engaged to do a deeper analysis of quantitative factors. The CFO and CAO are expected to engage with the Company’s Chief Legal Officer (“CLO”), Chief Administrative Officer (“CAdO”), and Audit Committee Chair to evaluate, holistically, not just the quantitative factors but the qualitative factors as well. If that team determines that the incident may represent a risk of national security, the CLO may contact the US attorney general for a disclosure delay of up to 30 days, or if applicable the team may coordinate to prepare and publish a Form 8-K, if management believes the materiality threshold has been reached. Whether or not the incident is deemed material, the incident response team will monitor the incident on an ongoing basis to attempt to ensure containment, mitigation, and remediation, as well as to monitor for evolving factors that subsequently push the incident to a materiality threshold that requires disclosure and reporting.\nQuantitative metrics for evaluating a security incident include the potential or actual financial loss, the costs of impacted data records, remediation costs, and/or third-party expenses. Qualitative factors include potential or actual impacts to Tyler’s reputation and/or competitiveness, disruptions to Tyler’s business, and/or risk of litigation or regulatory action. In evaluating an incident, Tyler also works to assess whether the incident is related to another recent incident and whether the incident may represent a threat to national security. Tyler does not expect an incident to rise to that level unless Tyler infrastructure is deemed “critical infrastructure” by the Cybersecurity and Infrastructure Security Agency (“CISA”).\nNotwithstanding these ongoing efforts and our multi-layered approach to cybersecurity, we may not be successful in preventing or mitigating a cybersecurity incident that could have a material adverse effect on us. \nWhile Tyler maintains cybersecurity insurance, the costs related to cybersecurity threats or disruptions may not be fully insured.\n \nPlease see"
  }
}