{
  "ticker": "UAL",
  "cik": "0000100517",
  "company_name": "United Airlines Holdings, Inc.",
  "filing_date": "2025-02-27",
  "accession": "0000100517-25-000046",
  "primary_doc": "ual-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business of this Form 10-K to enhance the understanding of our results of operations, financial condition and cash flows.\nThis section generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 are not included in this Form 10-K and can be found in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed with the SEC on February 29, 2024 (the \"2023 Annual Report\").\nExecutive Summary\nOverview\nUnited Airlines Holdings, Inc. (together with its consolidated subsidiaries, \"UAL\" or the \"Company\") is a holding company and its wholly-owned subsidiary is United Airlines, Inc. (together with its consolidated subsidiaries, \"United\"). \nAs UAL consolidates United for financial statement purposes, disclosures that relate to activities of United also apply to UAL, unless otherwise noted. United's operating revenues and operating expenses comprise nearly 100% of UAL's revenues and operating expenses. In addition, United comprises approximately the entire balance of UAL's assets, liabilities and operating cash flows. When appropriate, UAL and United are named specifically for their individual contractual obligations and related disclosures and any significant differences between the operations and results of UAL and United are separately disclosed and explained. We sometimes use the words \"we,\" \"our,\" \"us,\" and the \"Company\" in this report for disclosures that relate to all of UAL and United.\nOur current expectations described below are forward-looking statements and our actual results and timing may vary materially based on various factors that include, but are not limited to, those discussed below under \"Strategy,\" \"Economic and Market Factors,\" \"Governmental Actions,\" \n\"Cautionary Statement Regarding Forward-Looking Statements\" and in Part I,",
    "item1a": "Item 1A. Risk Factors, and under \"Economic and Market Factors\" and \"Governmental Actions\" in Part II, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations, of this report, as well as other risks and uncertainties set forth from time to time in the reports we file with the SEC.\nThe foregoing list sets forth many, but not all, of the factors that could impact our ability to achieve results described in any forward-looking statements. Investors should understand that it is not possible to predict or identify all such factors and should not consider this list to be a complete statement of all potential risks and uncertainties. It is routine for our internal projections and expectations to change as the year or each quarter in the year progresses, and therefore it should be clearly understood that the internal projections, beliefs and assumptions upon which we base our expectations may change. For instance, we regularly monitor future demand and booking trends and adjust capacity, as needed. As such, our actual flown capacity may differ materially from currently published flight schedules or current estimations.\n47\nTable of Contents\nITEM 7A.    QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nWe are exposed to market risk resulting from changes in currency exchange rates and interest rates. These risks, along with other business risks, impact our cost of capital. It is our policy to manage our debt structure and foreign exchange exposure in order to manage capital costs, control financial risks and maintain financial flexibility over the long term. In managing market risks, we may employ derivatives according to documented policies and procedures, including interest rate swaps, interest rate locks, foreign currency exchange contracts and combined interest rate foreign currency contracts (cross-currency swaps). We do not use derivatives for trading or speculative purposes. We do not foresee significant changes in the strategies we use to manage market risk in the near future. All of our financial instruments are subject to counterparty credit risk considered as part of the overall fair value measurement.\nInterest Rates.\n Our net income is affected by fluctuations in interest rates (e.g. interest expense on variable rate debt and interest income earned on short-term investments). The Company's policy is to manage interest rate risk through a combination of fixed and variable rate debt. The following table summarizes information related to the Company's interest rate market risk at December 31, 2024 (in millions):\nVariable rate debt\nCarrying value of variable rate debt\n$\n8,420 \nImpact of 100 basis point increase on projected interest expense for the following year\n64 \nFixed rate debt\nCarrying value of fixed rate debt\n16,233 \nFair value of fixed rate debt\n15,930 \nImpact of 100 basis point increase in market rates on fair value\n(449)\nThe Company has $8.5 billion in variable rate debt which includes increased cost provisions due to any reduced returns with respect to the loans due to any change in capital requirements or increased costs that the lenders incur in carrying these loans as a result of any change in law and $5.3 billion of these loans, from non-U.S. entities, could be affected by changes in tax laws. \nA change in market interest rates would also impact interest income earned on our cash, cash equivalents and short-term investments. Assuming our cash, cash equivalents and short-term investments remain at their average 2024 levels, a 100 basis point increase in interest rates would result in a corresponding increase in the Company's interest income of approximately $144 million during 2025.\nCommodity Price Risk (Aircraft Fuel).\n The price of aircraft fuel can significantly affect the Company's operations, results of operations, financial position and liquidity.\nOur operational and financial results can be significantly impacted by changes in the price and availability of aircraft fuel. To provide adequate supplies of fuel, the Company routinely enters into purchase contracts that are customarily indexed to market prices for aircraft fuel, and the Company generally has some ability to cover short-term fuel supply and infrastructure disruptions at some major demand locations. The Company's current strategy is to not enter into transactions to hedge fuel price volatility, although the Company regularly reviews its policy based on market conditions and other factors. A one-dollar change in the price of a barrel of aircraft fuel would change the Company's 2025 projected fuel expense by approximately $112 million.\nForeign Currency. \nThe Company generates revenues and incurs expenses in numerous foreign currencies. Changes in foreign currency exchange rates impact the Company's results of operations through changes in the dollar value of foreign currency-denominated operating revenues and expenses. Some of the Company's more significant foreign currency exposures include the Canadian dollar, European euro, Japanese yen, Chinese renminbi, Brazilian real and Mexican peso. The Company's current strategy is to not enter into transactions to hedge its foreign currency exposure, although the Company regularly reviews its policy based on market conditions and other factors.\nThe result of a uniform 1% strengthening in the value of the U.S. dollar from December 31, 2024 levels relative to each of the currencies in which the Company has foreign currency exposure would result in a decrease in pre-tax income of approximately $14 million for the year ending December 31, 2025. This sensitivity analysis was prepared based upon projected 2025 foreign currency-denominated revenues and expenses as of December 31, 2024.\n48\nTable of Contents\nITEM 8.    FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA. \nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\n \nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID:\n \n42\n)\n50\nUnited Airlines Holdings, Inc.:\nStatements of Consolidated Operations\n54\nStatements of Consolidated Comprehensive Income (Loss)\n55\nConsolidated Balance Sheets \n56\nStatements of Consolidated Cash Flows \n57\nStatement of Consolidated Stockholders' Equity\n58\nUnited Airlines, Inc.:\nStatements of Consolidated Operations\n59\nStatements of Consolidated Comprehensive Income (Loss)\n60\nConsolidated Balance Sheets \n61\nStatements of Consolidated Cash Flows\n62\nStatement of Consolidated Stockholder's Equity\n63\nCombined Notes to Consolidated Financial Statements\n64\nNote 1 - Basis of Presentation and Significant Accounting Policies\n64\nNote 2 - Revenue\n Recognition\n68\nNote 3 - Common Stockholders' Equity and Preferred Securities \n71\nNote 4 - Earnings Per Share\n72\nNote 5 - Share-Based Compensation Plans\n72\nNote 6 - Accumulated Other Comprehensive Income (Loss) (\"AOCI\")\n74\nNote 7 - Income Taxes\n74\nNote 8 - Pension, Postretirement and Other Employee Benefit Plans\n75\nNote 9 - Fair Value Measurements, Investments and Notes Receivable\n81\nNote 10 - Debt\n83\nNote 11 - Leases\n84\nNote 12 - Commitments, Contingencies \nand Guarantees\n86\nNote 13 - Special Charges\n89\n49\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of United Airlines Holdings, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of United Airlines Holdings, Inc. (the \"Company\") as of December 31, 2024 and 2023, the related statements of consolidated operations, comprehensive income (loss), stockholders' equity and cash flows, for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the \"consolidated financial statements\"). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (\"PCAOB\"), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated February 27, 2025, expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. \nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that is communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n50\nTable of Contents\nIndefinite-lived Intangible Asset (China Route Authority) Impairment Analysis\nDescription of the Matter\nAs discussed in Note 1 of the consolidated financial statements, indefinite-lived assets are reviewed for impairment on an annual basis as of October 1, or more frequently if events or circumstances indicate that the asset may be impaired. For the Company's China route authority, the Company performed a quantitative assessment which involved determining the fair value of the asset and comparing that amount to the asset’s carrying value. At December 31, 2024, the carrying value of the Company's China route authority indefinite-lived intangible asset (the China intangible asset) was $1.0 billion.\nAuditing management's annual China intangible asset impairment test was complex and highly judgmental due to the significant estimation required in determining the fair value of the asset. The fair value estimate was sensitive to significant assumptions such as forecasted revenues, margin and an overall discount rate, each of which is affected by expectations about future market or economic conditions. As a result of the subjectivity of the assumptions, adverse changes to management's estimates could reduce the underlying cash flows used to estimate fair value and trigger impairment charges.\nWe Addressed the Matter in Our Audit\nWe tested the Company's design and operating effectiveness of internal controls that address the risk of material misstatement relating to the estimate of fair value of the China intangible asset used in the annual impairment test. This included testing controls over management's review of the significant assumptions used in the discounted cash flow methodology, including forecasted revenues, margin and the overall discount rate.\nTo test the estimated fair value of the Company's China intangible asset, we performed audit procedures that included, among others, assessing the fair value methodology used by management and evaluating the significant assumptions used in the valuation model. We compared significant assumptions to current industry, market and economic trends, and to the Company's historical results. We assessed the historical accuracy of management's estimates and performed sensitivity analyses of significant assumptions to evaluate the changes in the fair value of the China intangible asset that would result from changes in assumptions. We also involved a valuation specialist to assist in our evaluation of the Company's overall discount rate.\n/s/ Ernst & Young LLP\nWe have served as the Company's auditor since 2009.\nChicago, Illinois\nFebruary 27, 2025\n51\nTable of Contents\n    \nReport of Independent Registered Public Accounting Firm\n    \nTo the Stockholder and the Board of Directors of United Airlines, Inc.\n \nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of United Airlines, Inc. (the \"Company\") as of December 31, 2024 and 2023, the related statements of consolidated operations, comprehensive income (loss), stockholder's equity and cash flows, for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the \"consolidated financial statements\"). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. \nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n52\nTable of Contents\nIndefinite-lived Intangible Asset (China Route Authority) Impairment Analysis\nDescription of the Matter\nAs discussed in Note 1 of the consolidated financial statements, indefinite-lived assets are reviewed for impairment on an annual basis as of October 1, or more frequently if events or circumstances indicate that the asset may be impaired. For the Company's China route authority, the Company performed a quantitative assessment which involved determining the fair value of the asset and comparing that amount to the asset's carrying value. At December 31, 2024, the carrying value of the Company's China route authority indefinite-lived intangible asset (the China intangible asset) was $1.0 billion.\nAuditing management's annual China intangible asset impairment test was complex and highly judgmental due to the significant estimation required in determining the fair value of the asset. The fair value estimate was sensitive to significant assumptions such as forecasted revenues, margin and an overall discount rate, each of which is affected by expectations about future market or economic conditions. As a result of the subjectivity of the assumptions, adverse changes to management's estimates could reduce the underlying cash flows used to estimate fair value and trigger impairment charges.\nWe Addressed the Matter in Our Audit\nWe tested the Company's design and operating effectiveness of internal controls that address the risk of material misstatement relating to the estimate of fair value of the China intangible asset used in the annual impairment test. This included testing controls over management's review of the significant assumptions used in the discounted cash flow methodology, including forecasted revenues, margin and the overall discount rate.\nTo test the estimated fair value of the Company's China intangible asset, we performed audit procedures that included, among others, assessing the fair value methodology used by management and evaluating the significant assumptions used in the valuation model. We compared significant assumptions to current industry, market and economic trends, and to the Company's historical results. We assessed the historical accuracy of management's estimates and performed sensitivity analyses of significant assumptions to evaluate the changes in the fair value of the China intangible asset that would result from changes in assumptions. We also involved a valuation specialist to assist in our evaluation of the Company's overall discount rate.\n/s/ Ernst & Young LLP\nWe have served as the Company's auditor since 2009.\nChicago, Illinois\nFebruary 27, 2025\n53\nTable of Contents\nUNITED AIRLINES HOLDINGS, INC.\nSTATEMENTS OF CONSOLIDATED OPERATIONS\n(In millions, except per share amounts)\n \n \nYear Ended December 31,\n \n2024\n2023\n2022\nOperating revenue:\nPassenger revenue\n$\n51,829\n \n$\n49,046\n \n$\n40,032\n \nCargo\n1,743\n \n1,495\n \n2,171\n \nOther operating revenue\n3,491\n \n3,176\n \n2,752\n \nTotal operating revenue\n57,063\n \n53,717\n \n44,955\n \nOperating expense:\nSalaries and related costs\n16,678\n \n14,787\n \n11,466\n \nAircraft fuel\n11,756\n \n12,651\n \n13,113\n \nLanding fees and other rent\n3,437\n \n3,076\n \n2,576\n \nAircraft maintenance materials and outside repairs\n3,063\n \n2,736\n \n2,153\n \nDepreciation and amortization\n2,928\n \n2,671\n \n2,456\n \nRegional capacity purchase\n2,516\n \n2,400\n \n2,299\n \nDistribution expenses\n2,231\n \n1,977\n \n1,535\n \nAircraft rent\n193\n \n197\n \n252\n \nSpecial charges\n112\n \n949\n \n140\n \nOther operating expenses\n9,053\n \n8,062\n \n6,628\n \nTotal operating expense\n51,967\n \n49,506\n \n42,618\n \nOperating income\n5,096\n \n4,211\n \n2,337\n \nNonoperating income (expense):\nInterest expense\n(\n1,629\n)\n(\n1,956\n)\n(\n1,778\n)\nInterest income\n726\n \n827\n \n298\n \nInterest capitalized\n227\n \n182\n \n105\n \nUnrealized gains (losses) on investments, net\n(\n199\n)\n27\n \n20\n \nMiscellaneous, net\n(\n53\n)\n96\n \n8\n \nTotal nonoperating expense, net\n(\n928\n)\n(\n824\n)\n(\n1,347\n)\nIncome before income taxes\n4,168\n \n3,387\n \n990\n \nIncome tax expense\n1,019\n \n769\n \n253\n \nNet income\n$\n3,149\n \n$\n2,618\n \n$\n737\n \nEarnings per share, basic\n$\n9.58\n \n$\n7.98\n \n$\n2.26\n \nEarnings per share, diluted\n$\n9.45\n \n$\n7.89\n \n$\n2.23\n \nThe accompanying Combined Notes to Consolidated Financial Statements are an integral part of these statements.\n54\nTable of Contents\nUNITED AIRLINES HOLDINGS, INC.\nSTATEMENTS OF CONSOLIDATED COMPREHENSIVE INCOME (LOSS)\n(In millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNet income\n$\n3,149\n \n$\n2,618\n \n$\n737\n \nOther comprehensive income (loss), net of tax:\nEmployee benefit plans\n247\n \n(\n261\n)\n1,145\n \nInvestments and other\n3\n \n24\n \n(\n28\n)\nTotal other comprehensive income (loss), net of tax\n250\n \n(\n237\n)\n1,117\n \nTotal comprehensive income, net\n$\n3,399\n \n$\n2,381\n \n$\n1,854\n \nThe accompanying Combined Notes to Consolidated Financial Statements are an integral part of these statements.\n55\nTable of Contents\nUNITED AIRLINES HOLDINGS, INC.\nCONSOLIDATED BALANCE SHEETS\n(In millions, except shares)\nAt December 31,\nASSETS\n2024\n2023\nCash and cash equivalents\n$\n8,769\n \n$\n6,058\n \nShort-term investments\n5,706\n \n8,330\n \nReceivables, net\n2,163\n \n1,898\n \nAircraft fuel, spare parts and supplies, net\n1,572\n \n1,561\n \nPrepaid expenses and other\n673\n \n640\n \nTotal current assets\n18,883\n \n18,487\n \nOperating property and equipment, net\n42,908\n \n39,815\n \nOperating lease right-of-use assets\n3,815\n \n3,914\n \nGoodwill\n4,527\n \n4,527\nIntangible assets, net\n2,683\n \n2,725\nInvestments in affiliates and other, net\n1,267\n \n1,636\nTotal noncurrent assets\n55,200\n \n52,617\n \nTotal assets\n$\n74,083\n \n$\n71,104\n \nLIABILITIES AND STOCKHOLDERS' EQUITY\nAccounts payable\n$\n4,193\n \n$\n3,835\n \nAccrued salaries and benefits\n3,289\n \n2,940\n \nAdvance ticket sales\n7,561\n \n6,704\n \nFrequent flyer deferred revenue\n3,403\n \n3,095\n \nCurrent maturities of long-term debt, finance leases, and other financial liabilities\n3,453\n \n4,247\nCurrent maturities of operating leases\n467\n \n576\n \nOther\n948\n \n806\n \nTotal current liabilities\n23,314\n \n22,203\n \nLong-term debt, finance leases, and other financial liabilities\n25,203\n \n27,413\n \nLong-term obligations under operating leases\n4,510\n \n4,503\n \nFrequent flyer deferred revenue\n4,038\n \n4,048\n \nPension and postretirement benefit liability\n1,233\n \n1,605\n \nDeferred income taxes\n1,580\n \n594\n \nOther\n1,530\n \n1,414\n \nTotal noncurrent liabilities\n38,094\n \n39,577\n \nCommitments and Contingencies\nStockholders' equity:\nPreferred stock\n—\n \n—\n \nCommon stock at par, $\n0.01\n par value; authorized \n1,000,000,000\n shares; outstanding \n327,899,771\n and \n328,018,739\n shares at December 31, 2024 and 2023, respectively\n4\n \n4\n \nAdditional capital invested\n8,980\n \n8,992\n \nStock held in treasury, at cost\n(\n3,377\n)\n(\n3,441\n)\nRetained earnings\n6,880\n \n3,831\n \nAccumulated other comprehensive income (loss)\n188\n \n(\n62\n)\nTotal stockholders' equity\n12,675\n \n9,324\n \nTotal liabilities and stockholders' equity\n$\n74,083\n \n$\n71,104\n \n56\nTable of Contents\nUNITED AIRLINES HOLDINGS, INC. \nSTATEMENTS OF CONSOLIDATED CASH FLOWS\n(In millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nOperating Activities:\nNet income\n$\n3,149\n \n$\n2,618\n \n$\n737\n \nAdjustments to reconcile net income to net cash provided by (used in) operating activities -\nDeferred income tax\n935\n \n756\n \n248\n \nDepreciation and amortization\n2,928\n \n2,671\n \n2,456\n \nOperating and non-operating special charges, non-cash portion\n158\n \n84\n \n16\n \nUnrealized (gains) losses on investments\n199\n \n(\n27\n)\n(\n20\n)\nAmortization of debt discount and debt issuance costs\n166\n \n139\n \n156\n \nOther operating activities\n9\n \n6\n \n218\n \nChanges in operating assets and liabilities -\n(Increase) decrease in receivables\n280\n \n(\n100\n)\n(\n158\n)\nIncrease in prepaids and other assets\n(\n166\n)\n(\n463\n)\n(\n86\n)\nIncrease (decrease) in advance ticket sales\n857\n \n(\n851\n)\n1,200\n \nIncrease in frequent flyer deferred revenue\n298\n \n468\n \n393\n \nIncrease in accounts payable\n178\n \n572\n \n796\n \nIncrease in other liabilities\n454\n \n1,038\n \n110\n \nNet cash provided by operating activities\n9,445\n \n6,911\n \n6,066\n \nInvesting Activities:\nCapital expenditures, net of flight equipment purchase deposit returns\n(\n5,615\n)\n(\n7,171\n)\n(\n4,819\n)\nPurchases of short-term and other investments\n(\n5,809\n)\n(\n9,470\n)\n(\n11,232\n)\nProceeds from sale of short-term and other investments\n8,661\n \n10,519\n \n2,084\n \nProceeds from sale of property and equipment\n109\n \n39\n \n207\n \nOther, net\n3\n \n(\n23\n)\n(\n69\n)\nNet cash used in investing activities\n(\n2,651\n)\n(\n6,106\n)\n(\n13,829\n)\nFinancing Activities:\nProceeds from issuance of debt and other financial liabilities, net of discounts and fees\n6,139\n \n2,388\n \n736\n \nPayments of long-term debt, finance leases and other financial liabilities\n(\n10,138\n)\n(\n4,248\n)\n(\n4,011\n)\nRepurchases of common stock\n(\n162\n)\n—\n \n—\n \nOther, net\n(\n21\n)\n(\n32\n)\n(\n74\n)\nNet cash used in financing activities\n(\n4,182\n)\n(\n1,892\n)\n(\n3,349\n)\nNet increase (decrease) in cash, cash equivalents and restricted cash\n2,612\n \n(\n1,087\n)\n(\n11,112\n)\nCash, cash equivalents and restricted cash at beginning of year\n6,334\n \n7,421\n \n18,533\n \nCash, cash equivalents and restricted cash at end of year\n$\n8,946\n \n$\n6,334\n \n$\n7,421\n \nInvesting and Financing Activities Not Affecting Cash:\nProperty and equipment acquired through the issuance of debt, finance leases and other\n$\n406\n \n$\n777\n \n$\n19\n \nRight-of-use assets acquired through operating leases\n577\n \n552\n \n137\n \nLease modifications and lease conversions\n290\n \n546\n \n(\n84\n)\nInvestment interests received in exchange for goods and services\n18\n \n33\n \n103\n \nCash Paid During the Period for:\nInterest\n$\n1,494\n \n$\n1,848\n \n$\n1,573\n \nIncome taxes\n88\n \n7\n \n8\n \nThe accompanying Combined Notes to Consolidated Financial Statements are an integral part of these statements.\n57\nTable of Contents\nUNITED AIRLINES HOLDINGS, INC. \nSTATEMENTS OF CONSOLIDATED STOCKHOLDERS' EQUITY\n(In millions)\n \n \nCommon\nStock\nAdditional\nCapital Invested\nTreasury Stock\nRetained Earnings\nAccumulated\nOther Comprehensive Income (Loss)\nTotal\nShares\nAmount\nBalance at December 31, 2021\n323.8\n \n$\n4\n \n$\n9,156\n \n$\n(\n3,814\n)\n$\n625\n \n$\n(\n942\n)\n$\n5,029\n \nNet income\n— \n— \n— \n— \n737\n \n— \n737\n \nOther comprehensive income\n— \n— \n— \n— \n— \n1,117\n \n1,117\n \nStock-settled share-based compensation\n— \n— \n86\n \n— \n— \n— \n86\n \nStock issued for share-based awards, net of shares withheld for tax\n3.1\n \n— \n(\n256\n)\n280\n \n(\n97\n)\n— \n(\n73\n)\nBalance at December 31, 2022\n326.9\n \n4\n \n8,986\n \n(\n3,534\n)\n1,265\n \n175\n \n6,896\n \n      Net income\n— \n— \n— \n— \n2,618\n \n— \n2,618\n \nOther comprehensive loss\n— \n— \n— \n— \n— \n(\n237\n)\n(\n237\n)\nStock-settled share-based compensation\n— \n— \n77\n \n— \n— \n— \n77\n \nProceeds from exercise of stock options\n— \n— \n1\n \n— \n— \n— \n1\n \nStock issued for share-based awards, net of shares withheld for tax\n1.1\n \n— \n(\n72\n)\n93\n \n(\n52\n)\n— \n(\n31\n)\nBalance at December 31, 2023\n328.0\n \n4\n \n8,992\n \n(\n3,441\n)\n3,831\n \n(\n62\n)\n9,324\n \n      Net income\n— \n— \n— \n— \n3,149\n \n— \n3,149\n \nOther comprehensive income\n— \n— \n— \n— \n— \n250\n \n250\n \nStock-settled share-based compensation\n— \n— \n135\n \n— \n— \n— \n135\n \nRepurchases of common stock\n(\n3.0\n)\n— \n— \n(\n162\n)\n— \n— \n(\n162\n)\nShare issued for settlement of Warrants\n2.0\n \n— \n(\n96\n)\n150\n \n(\n54\n)\n— \n—\n \nStock issued for share-based awards, net of shares withheld for tax\n0.9\n \n— \n(\n51\n)\n76\n \n(\n46\n)\n— \n(\n21\n)\nBalance at December 31, 2024\n327.9\n \n$\n4\n \n$\n8,980\n \n$\n(\n3,377\n)\n$\n6,880\n \n$\n188\n \n$\n12,675\n \nThe accompanying Combined Notes to Consolidated Financial Statements are an integral part of these statements.\n58\nTable of Contents\nUNITED AIRLINES, INC. \nSTATEMENTS OF CONSOLIDATED OPERATIONS\n(In millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nOperating revenue:\nPassenger revenue\n$\n51,829\n \n$\n49,046\n \n$\n40,032\n \nCargo\n1,743\n \n1,495\n \n2,171\n \nOther operating revenue\n3,491\n \n3,176\n \n2,752\n \nTotal operating revenue\n57,063\n \n53,717\n \n44,955\n \nOperating expense:\nSalaries and related costs\n16,678\n \n14,787\n \n11,466\n \nAircraft fuel\n11,756\n \n12,651\n \n13,113\n \nLanding fees and other rent\n3,437\n \n3,076\n \n2,576\n \nAircraft maintenance materials and outside repairs\n3,063\n \n2,736\n \n2,153\n \nDepreciation and amortization\n2,928\n \n2,671\n \n2,456\n \nRegional capacity purchase\n2,516\n \n2,400\n \n2,299\n \nDistribution expenses\n2,231\n \n1,977\n \n1,535\n \nAircraft rent\n193\n \n197\n \n252\n \nSpecial charges\n112\n \n949\n \n140\n \nOther operating expenses\n9,050\n \n8,059\n \n6,626\n \nTotal operating expense\n51,964\n \n49,503\n \n42,616\n \nOperating income\n5,099\n \n4,214\n \n2,339\n \nNonoperating income (expense):\nInterest expense\n(\n1,629\n)\n(\n1,956\n)\n(\n1,778\n)\nInterest income\n726\n \n827\n \n298\n \nInterest capitalized\n227\n \n182\n \n105\n \nUnrealized gains (losses) on investments, net\n(\n199\n)\n27\n \n20\n \nMiscellaneous, net\n(\n53\n)\n96\n \n8\n \nTotal nonoperating expense, net\n(\n928\n)\n(\n824\n)\n(\n1,347\n)\nIncome before income taxes\n4,171\n \n3,390\n \n992\n \nIncome tax expense\n1,020\n \n770\n \n253\n \nNet income\n$\n3,151\n \n$\n2,620\n \n$\n739\n \nThe accompanying Combined Notes to Consolidated Financial Statements are an integral part of these statements.\n59\nTable of Contents\nUNITED AIRLINES, INC. \nSTATEMENTS OF CONSOLIDATED COMPREHENSIVE INCOME (LOSS)\n(In millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNet income\n$\n3,151\n \n$\n2,620\n \n$\n739\n \nOther comprehensive income (loss), net of tax:\nEmployee benefit plans\n247\n \n(\n261\n)\n1,145\n \nInvestments and other\n3\n \n24\n \n(\n28\n)\nTotal other comprehensive income (loss), net of tax\n250\n \n(\n237\n)\n1,117\n \nTotal comprehensive income, net\n$\n3,401\n \n$\n2,383\n \n$\n1,856\n \nThe accompanying Combined Notes to Consolidated Financial Statements are an integral part of these statements.\n60\nTable of Contents\nUNITED AIRLINES, INC. \nCONSOLIDATED BALANCE SHEETS\n(In millions, except shares)\nAt December 31,\nASSETS\n2024\n2023\nCash and cash equivalents\n$\n8,769\n \n$\n6,058\n \nShort-term investments\n5,706\n \n8,330\n \nReceivables, net\n2,163\n \n1,898\n \nAircraft fuel, spare parts and supplies, net\n1,572\n \n1,561\n \nPrepaid expenses and other\n673\n \n640\n \nTotal current assets\n18,883\n \n18,487\n \nOperating property and equipment, net\n42,908\n \n39,815\n \nOperating lease right-of-use assets\n3,815\n \n3,914\n \nGoodwill\n4,527\n \n4,527\n \nIntangible assets, net\n2,683\n \n2,725\n \nInvestments in affiliates and other, net\n1,267\n \n1,636\n \nTotal noncurrent assets\n55,200\n \n52,617\n \nTotal assets\n$\n74,083\n \n$\n71,104\n \nLIABILITIES AND STOCKHOLDER'S EQUITY\nAccounts payable\n$\n4,193\n \n$\n3,835\n \nAccrued salaries and benefits\n3,289\n \n2,940\n \nAdvance ticket sales\n7,561\n \n6,704\n \nFrequent flyer deferred revenue\n3,403\n \n3,095\n \nCurrent maturities of long-term debt, finance leases, and other financial liabilities\n3,453\n \n4,247\n \nCurrent maturities of operating leases\n467\n \n576\n \nOther\n949\n \n808\n \nTotal current liabilities\n23,315\n \n22,205\n \nLong-term debt, finance leases, and other financial liabilities\n25,203\n \n27,413\n \nLong-term obligations under operating leases\n4,510\n \n4,503\n \nFrequent flyer deferred revenue\n4,038\n \n4,048\n \nPension and postretirement benefit liability\n1,233\n \n1,605\n \nDeferred income taxes\n1,610\n \n622\n \nOther\n1,530\n \n1,414\n \nTotal noncurrent liabilities\n38,124\n \n39,605\n \nCommitments and Contingencies\nStockholder's equity:\nCommon stock at par, \n0.01\n par value; authorized \n1,000\n shares; issued and outstanding \n1,000\n shares at December 31, 2024 and 2023\n—\n \n—\n \nAdditional capital invested\n617\n \n482\n \nRetained earnings\n9,487\n \n6,336\n \nAccumulated other comprehensive income (loss)\n188\n \n(\n62\n)\nPayable to parent\n2,352\n \n2,538\n \nTotal stockholder's equity\n12,644\n \n9,294\n \nTotal liabilities and stockholder's equity\n$\n74,083\n \n$\n71,104\n \n \n61\nTable of Contents\nUNITED AIRLINES, INC. \nSTATEMENTS OF CONSOLIDATED CASH FLOWS\n(In millions)\nYear Ended December 31,\n2024\n2023\n2022\nOperating Activities:\nNet income\n$\n3,151\n \n$\n2,620\n \n$\n739\n \nAdjustments to reconcile net income to net cash provided by (used in) operating activities -\nDeferred income tax\n937\n \n757\n \n248\n \nDepreciation and amortization\n2,928\n \n2,671\n \n2,456\n \nOperating and non-operating special charges, non-cash portion\n158\n \n84\n \n16\n \nUnrealized (gains) losses on investments\n199\n \n(\n27\n)\n(\n20\n)\nAmortization of debt discount and debt issuance costs\n166\n \n139\n \n156\n \nOther operating activities\n9\n \n7\n \n218\n \nChanges in operating assets and liabilities -\n(Increase) decrease in receivables\n280\n \n(\n100\n)\n(\n158\n)\nIncrease in intercompany receivables\n(\n186\n)\n(\n33\n)\n(\n76\n)\nIncrease in prepaids and other assets\n(\n166\n)\n(\n463\n)\n(\n86\n)\nIncrease (decrease) in advance ticket sales\n857\n \n(\n851\n)\n1,200\n \nIncrease in frequent flyer deferred revenue\n298\n \n468\n \n393\n \nIncrease in accounts payable\n178\n \n572\n \n796\n \nIncrease in other liabilities\n453\n \n1,035\n \n110\n \nNet cash provided by operating activities\n9,262\n \n6,879\n \n5,992\n \nInvesting Activities:\nCapital expenditures, net of flight equipment purchase deposit returns\n(\n5,615\n)\n(\n7,171\n)\n(\n4,819\n)\nPurchases of short-term and other investments\n(\n5,809\n)\n(\n9,470\n)\n(\n11,232\n)\nProceeds from sale of short-term and other investments\n8,661\n \n10,519\n \n2,084\n \nProceeds from sale of property and equipment\n109\n \n39\n \n207\n \nOther, net\n3\n \n(\n23\n)\n(\n69\n)\nNet cash used in investing activities\n(\n2,651\n)\n(\n6,106\n)\n(\n13,829\n)\nFinancing Activities:\nProceeds from issuance of debt and other financial liabilities, net of discounts and fees\n6,139\n \n2,388\n \n736\n \nPayments of long-term debt, finance leases and other financial liabilities\n(\n10,138\n)\n(\n4,248\n)\n(\n4,011\n)\nNet cash used in financing activities\n(\n3,999\n)\n(\n1,860\n)\n(\n3,275\n)\nNet increase (decrease) in cash, cash equivalents and restricted cash\n2,612\n \n(\n1,087\n)\n(\n11,112\n)\nCash, cash equivalents and restricted cash at beginning of year\n6,334\n \n7,421\n \n18,533\n \nCash, cash equivalents and restricted cash at end of year\n$\n8,946\n \n$\n6,334\n \n$\n7,421\n \nInvesting and Financing Activities Not Affecting Cash:\nProperty and equipment acquired through the issuance of debt, finance leases and other\n$\n406\n \n$\n777\n \n$\n19\n \nRight-of-use assets acquired through operating leases\n577\n \n552\n \n137\n \nLease modifications and lease conversions\n290\n \n546\n \n(\n84\n)\nInvestment interests received in exchange for goods and services\n18\n \n33\n \n103\n \nCash Paid During the Period for:\nInterest\n$\n1,494\n \n$\n1,848\n \n$\n1,573\n \nIncome taxes\n88\n \n7\n \n8\n \nThe accompanying Combined Notes to Consolidated Financial Statements are an integral part of these statements.\n62\nTable of Contents\nUNITED AIRLINES, INC. \nSTATEMENTS OF CONSOLIDATED STOCKHOLDER'S EQUITY \n(In millions)\n \n \nAdditional\nCapital\nInvested\nRetained Earnings\nAccumulated\nOther\nComprehensive\nIncome (Loss)\n(Receivable from) Payable to Related Parties, Net\nTotal\nBalance at December 31, 2021\n$\n317\n \n$\n2,977\n \n$\n(\n942\n)\n$\n2,646\n \n$\n4,998\n \nNet income\n— \n739\n \n— \n— \n739\n \nOther comprehensive income\n— \n— \n1,117\n \n— \n1,117\n \nStock-settled share-based compensation\n86\n \n— \n— \n— \n86\n \nOther\n— \n— \n— \n(\n75\n)\n(\n75\n)\nBalance at December 31, 2022\n403\n \n3,716\n \n175\n \n2,571\n \n6,865\n \nNet income\n— \n2,620\n \n— \n— \n2,620\n \nOther comprehensive loss\n— \n— \n(\n237\n)\n— \n(\n237\n)\nStock-settled share-based compensation\n77\n \n— \n— \n— \n77\n \nOther\n2\n \n— \n— \n(\n33\n)\n(\n31\n)\nBalance at December 31, 2023\n482\n \n6,336\n \n(\n62\n)\n2,538\n \n9,294\n \nNet income\n— \n3,151\n \n— \n— \n3,151\n \nOther comprehensive income\n— \n— \n250\n \n— \n250\n \nStock-settled share-based compensation\n135\n \n— \n— \n— \n135\n \nImpact of UAL share repurchase\n— \n— \n— \n(\n162\n)\n(\n162\n)\nOther\n— \n— \n— \n(\n24\n)\n(\n24\n)\nBalance at December 31, 2024\n$\n617\n \n$\n9,487\n \n$\n188\n \n$\n2,352\n \n$\n12,644\n \nThe accompanying Combined Notes to Consolidated Financial Statements are an integral part of these statements.\n63\nTable of Contents\nUNITED AIRLINES HOLDINGS, INC.\nUNITED AIRLINES, INC.\nCOMBINED NOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - BASIS OF PRESENTATION AND \nSIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation \nUnited Airlines Holdings, Inc. (together with its consolidated subsidiaries, \"UAL\" or the \"Company\") is a holding company incorporated in Delaware and its wholly-owned subsidiary is United Airlines, Inc. (together with its consolidated subsidiaries, \"United\"). As UAL consolidates United for financial statement purposes, disclosures that relate to activities of United also apply to UAL, unless otherwise noted. United comprises substantially all of UAL's operating revenues, operating expenses, assets, liabilities and operating cash flows. When appropriate, UAL and United are named specifically for their individual contractual obligations and related disclosures and any significant differences between the operations and results of UAL and United are separately disclosed and explained.\nThe Company’s consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). The Company consolidates variable interest entities where it has been determined that the Company is the primary beneficiary of those entities' operations. All significant intercompany accounts and transactions have been eliminated in consolidation. Certain prior period amounts have been reclassified to conform to the current period presentation.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the amounts reported in these financial statements and accompanying notes. Actual results could differ from those estimates.\nSegments\n \nOperating segments are defined as components of an enterprise with separate financial information, which are evaluated regularly by the chief operating decision maker (\"CODM\") and are used in resource allocation and performance assessments. \nT\nhe Company manages it operations as \none\n segment. Managing the Company as \none\n segment allows management the opportunity to maximize the value of its route network and maximize the Company's consolidated financial results. The Company deploys its aircraft across its route network through a single route scheduling system to maximize its value. The Company's chief executive officer is its CODM. When making resource allocation decisions for the network, the Company's CODM evaluates flight profitability data, which considers aircraft type and route economics. The CODM assesses performance of the Company and makes resource allocation decisions based on net income as reported in the Company's statement of consolidated operations. The measure of segment assets is reported on the consolidated balance sheet as Total assets. Within the statement of consolidated operations, Other expenses represent various purchased services related to the operations of the airline such as ground handling, passenger services, food and beverage offerings, navigation fees, personnel-related costs and information technology projects.\nSignificant Accounting Policies\nCash and Cash Equivalents and Restricted Cash. \nHighly liquid investments with a maturity of three months or less on their acquisition date are classified as cash and cash equivalents. Restricted cash is classified as current or noncurrent in the consolidated balance sheets based on the expected timing of return of the assets to the Company or payment to an outside party. The restricted cash balances primarily include collateral associated with the senior secured notes (the \"MileagePlus Senior Secured Notes\") secured by substantially all of the assets of Mileage Plus Holdings, LLC (\"MPH\"), a direct wholly-owned subsidiary of United, collateral for letters of credit and collateral associated with facility leases and certain insurance-related obligations.\nThe following table provides a reconciliation of cash, cash equivalents and restricted cash reported within the consolidated balance sheets that sum to the total of the same such amounts shown in the statements of consolidated cash flows (in millions):\n64\nTable of Contents\nAt December 31,\n2024\n2023\n2022\nCurrent assets:\nCash and cash equivalents\n$\n8,769\n \n$\n6,058\n \n$\n7,166\n \nRestricted cash in Prepaid expenses and other\n11\n \n31\n \n45\n \nNoncurrent assets:\nRestricted cash in Investments in affiliates and other, net\n166\n \n245\n \n210\n \nTotal cash, cash equivalents and restricted cash\n$\n8,946\n \n$\n6,334\n \n$\n7,421\n \nInvestments.\n \nHighly liquid investments with maturities of greater than three months, but not beyond one year, at the time of purchase are classified as short-term investments and are stated at fair value. Investments with maturities beyond one year when purchased are classified as short-term investments if they are expected to be available to support our short-term liquidity needs. Our short-term investments in debt securities are classified as available-for-sale and are stated at fair value. Realized gains and losses on sales of these investments are reflected in Interest income in the statements of consolidated operations. Unrealized gains and losses on available-for-sale debt securities are reflected as a component of accumulated other comprehensive income (loss). Equity investments are accounted for under the equity method if we are able to exercise significant influence over the investee. Equity investments for which we do not have significant influence are recorded at fair value or at cost, if fair value is not readily determinable, with adjustments for observable changes in price or impairments (referred to as the measurement alternative). Changes in fair value are recorded in Unrealized gains (losses) on investments, net in the statements of consolidated operations. See Note 9 of this report for additional information related to investments.\nAccounts Receivable. \nAccounts receivable primarily consist of amounts due from credit card companies, non-airline partners, and cargo customers. We provide an allowance for credit losses expected to be incurred. We base our allowance on various factors including, but not limited to, aging, payment history, write-offs, macro-economic indicators and other credit monitoring indicators.\n Credit loss expense and write-offs related to trade receivables were not material for the years ended December 31, 2024, 2023 and 2022.\nAircraft Fuel, Spare Parts and Supplies.\n \nThe Company accounts for aircraft fuel, spare parts and supplies at average cost and provides an obsolescence allowance for aircraft spare parts with an assumed residual value of 10% of original cost.\n Allowance for obsolescence was $\n739\n million and $\n689\n million at December 31, 2024 and 2023, respectively. Obsolescence expense was $\n175\n million, $\n102\n million, and $\n73\n million for the years ended December 31, 2024, 2023 and 2022, respectively, and is included in Depreciation and amortization expense in the statements of consolidated operations.\nProperty and Equipment.\n \nThe Company records additions to owned operating property and equipment at cost when acquired. Costs related to modifications that enhance the operating performance or extend the useful lives of airframes or engines are capitalized as property and equipment. We periodically receive credits in connection with the acquisition of aircraft and engines as well as contractual damages related to delays in delivery or operating performance issues. These credits are generally deferred and are recognized as a reduction to the cost of the related equipment.\nDepreciation and amortization is recognized on a straight-line basis over the assets' estimated useful lives. Leasehold improvements are amortized over the shorter of the remaining term of the lease or the estimated useful life of the related asset.\n \nThe estimated useful lives of property and equipment are as follows:\n \nEstimated Useful Life (in years)\nAircraft, spare engines and related rotable parts\n25\n to \n30\nAircraft seats\n10\n to \n15\nBuildings\n25\n to \n45\nOther property and equipment\n3\n to \n15\nComputer software\n5\n to \n15\nBuilding improvements\n1\n to \n40\nOperating property and equipment, net at December 31 was as follows (in millions):\n65\nTable of Contents\n2024\n2023\nFlight equipment\n$\n52,696\n \n$\n48,448\n \nOther property and equipment\n11,908\n \n10,527\n \nPurchase deposits for flight equipment\n3,427\n \n3,550\n \nTotal operating property and equipment\n68,031\n \n62,525\n \nLess—Accumulated depreciation and amortization\n(\n25,123\n)\n(\n22,710\n)\nTotal operating property and equipment, net\n$\n42,908\n \n$\n39,815\n \nAs of December 31, 2024 and 2023, the Company had a carrying value of computer software of $\n456\n million and $\n453\n million, respectively. For the years ended December 31, 2024, 2023 and 2022, the Company's amortization expense related to computer software was $\n155\n million, $\n168\n million and $\n166\n million, respectively. Aircraft, spare engines and related rotable parts were assumed to have residual values of approximately 10% of original cost, and other categories of property and equipment were assumed to have no residual value.\nLeases. \nThe Company enters into various leases as a lessee for assets including, but not limited to, airport facilities, airport gates, hanger sites, administrative offices, aircraft, and various other facilities and equipment to support its operations. The Company determines if an arrangement contains a lease at inception. A lease exists when the arrangement conveys the right to control the use of an identified asset over the lease term. Upon lease commencement, the Company records a lease liability for the obligation to make lease payments and right-of-use (\"ROU\") asset for the right to use the underlying asset for the lease term in the consolidated balance sheets. The lease liability is measured at the commencement date based on the present value of lease payments not yet paid over the lease term, which includes extension and renewal options that are reasonably certain of being exercised, discounted using an incremental borrowing rate that reflects the term of the lease and the particular economic environment at lease commencement. The ROU asset is based on the lease liability, adjusted for lease prepayments, lease incentives received, and the lessee's initial direct costs. The Company does not record a right-of-use asset or lease liability for leases with an initial term of 12 months or less. Lease and non-lease components are combined for all classes of underlying assets, except for capacity purchase agreements (\"CPAs\") which contain embedded leases for regional aircraft. For these CPAs, the Company allocates consideration to the lease and non-lease components based on their relative standalone values. Many of the Company's leases include variable lease payments, which are not included in the measurement of the right-of-use asset and lease liability. Finance lease right-of-use assets are presented together with Operating property and equipment on the consolidated balance sheets and the related amortization is included in Depreciation and amortization expense.\nLong-Lived Asset Impairments.\n \nThe Company evaluates the carrying value of long-lived assets subject to amortization whenever events or changes in circumstances indicate that an impairment may exist. For purposes of this testing, the Company has generally identified the aircraft fleet type as the lowest level of identifiable cash flows for its mainline fleet and the contract level for its regional fleet under CPAs. An impairment charge is recognized when the asset's carrying value exceeds its net undiscounted future cash flows. The amount of the charge is the difference between the asset's carrying value and fair market value.\nIntangible Assets.\n \nThe Company has finite-lived and indefinite-lived intangible assets, including goodwill. Finite-lived intangible assets are amortized over their estimated useful lives. Goodwill and indefinite-lived intangible assets are not amortized but are assessed for impairment on an annual basis as of October 1, or more frequently if events or circumstances indicate that the asset may be impaired. The Company typically determines fair value using either market or a variation of the income approach valuation techniques. These measurements include the following key assumptions: (1) forecasted revenues, expenses, margin and cash flows, (2) terminal period growth rate, (3) an estimated weighted average cost of capital, (4) asset-specific risk factor and (5) a tax rate. These assumptions are consistent with those that hypothetical market participants would use. We recognize an impairment when the fair value of an intangible asset is less than its carrying value. \nFor the Company's China route authority, the Company performed a quantitative assessment which involved determining the fair value of the asset and comparing that amount to the asset's carrying value. For all other intangible assets, the Company performed a qualitative assessment of whether it was more likely than not that an impairment had occurred. To determine fair value of the China route authority, the Company used a discounted cash flow method. Key assumptions used in the valuation model included forecasted revenues, margin and an overall discount rate. These assumptions are inherently uncertain as they relate to future events and circumstances.\nThe following table presents information about the Company's goodwill and other intangible assets at December 31 (in millions):\n66\nTable of Contents\n2024\n2023\nGross \nCarrying\nAmount\nAccumulated\nAmortization\nGross \nCarrying\nAmount\nAccumulated\nAmortization\nGoodwill\n$\n4,527\n \n$\n4,527\n \nIndefinite-lived intangible assets\nChina route authority\n$\n1,020\n \n$\n1,020\n \nAirport slots\n564\n \n574\n \nTradenames and logos\n593\n \n593\n \nAlliances\n404\n \n404\n \nTotal\n$\n2,581\n \n$\n2,591\n \nFinite-lived intangible assets\nFrequent flyer database\n$\n1,177\n \n$\n1,092\n \n$\n1,177\n \n$\n1,068\n \nHubs\n145\n \n138\n \n145\n \n131\n \nOther\n143\n \n133\n \n307\n \n296\n \nTotal\n$\n1,465\n \n$\n1,363\n \n$\n1,629\n \n$\n1,495\n \nAmortization expense in 2024, 2023 and 2022 was $\n32\n million, $\n37\n million and $\n41\n million, respectively. Projected amortization expense in 2025, 2026, 2027, 2028 and 2029 is $\n28\n million, $\n18\n million, $\n11\n million, $\n10\n million and $\n8\n million, respectively.\nLabor Costs.\n \nThe Company records expenses associated with new or amendable labor agreements when the amounts are probable and estimable. These could include costs associated with retro-active lump sum cash payments made in conjunction with the ratification of labor agreements. To the extent these upfront costs are in lieu of future pay increases, they would be capitalized and amortized over the term of the labor agreements. If not, these amounts would be expensed.\nShare-Based Compensation.\n \nThe Company measures the cost of employee services received in exchange for an award of equity instruments based on the grant date fair value of the award. The resulting cost is recognized over the period during which an employee is required to provide service in exchange for the award, which is usually the vesting period. Obligations for cash-settled restricted stock units (\"RSUs\") are remeasured at fair value throughout the requisite service period at the close of the reporting period based upon UAL's stock price. In addition to the service requirement, certain RSUs have performance metrics that must be achieved prior to vesting. These awards are accrued based on the expected level of achievement at each reporting period. An adjustment is recorded each reporting period to adjust compensation expense based on the then current level of expected performance achievement for the performance-based awards. See Note 5 of this report for additional information on UAL's share-based compensation plans.\nMaintenance and Repairs\n. \nThe cost of maintenance and repairs, including the cost of minor replacements, is charged to expense as incurred, except for costs incurred under our power-by-the-hour (\"PBTH\") engine maintenance agreements. PBTH contracts transfer certain risk to third-party service providers and fix the amount we pay per flight hour or per cycle to the service provider in exchange for maintenance and repairs under a predefined maintenance program. Under PBTH agreements, the Company recognizes expense at a level rate per engine hour, unless the level of service effort and the related payments during the period are substantially consistent, in which case the Company recognizes expense based on the amounts paid.\nAdvertising.\n \nAdvertising costs, which are included in Other operating expenses, are expensed as incurred.\n Advertising expenses were $\n235\n million, $\n221\n million and $\n165\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nThird-Party Business. \nThe Company has third-party business activity that includes ground handling, maintenance services, flight academy and frequent flyer award non-travel redemptions. Third-party business revenue is recorded in Other operating revenue. Expenses associated with these third-party business activities are recorded in Other operating expenses, except for non-travel mileage redemption. Non-travel mileage redemption expenses are recorded to Other operating revenue.\nUncertain Income Tax Positions.\n \nThe Company has recorded reserves for income taxes and associated interest that may become payable in future years. Although management believes that its positions taken on income tax matters are reasonable, the Company nevertheless established tax and interest reserves in recognition that various taxing authorities may challenge certain of the positions taken by the Company, potentially resulting in additional liabilities for taxes and interest. The Company's uncertain tax position reserves are reviewed periodically and are adjusted as events occur that affect its estimates, such as the \n67\nTable of Contents\navailability of new information, the lapsing of applicable statutes of limitation, the conclusion of tax audits, the measurement of additional estimated liability, the identification of new tax matters, the release of administrative tax guidance affecting its estimates of tax liabilities, or the rendering of relevant court decisions. The Company records penalties and interest relating to uncertain tax positions as part of income tax expense in its statements of consolidated operations.\n See Note 7 of this report for additional information on UAL's uncertain tax positions.\nFair Value Measurements. \nThe Company measures certain financial assets and liabilities at fair value on a recurring basis, and certain non-financial assets and liabilities on a nonrecurring basis. The Company uses valuation techniques to measure fair value that maximize the use of observable inputs and minimize the use of unobservable inputs. These inputs are prioritized as follows:\n•\nLevel 1 - Unadjusted quoted prices in active markets for assets or liabilities identical to those to be reported at fair value\n•\nLevel 2 - Other inputs that are observable directly or indirectly, such as quoted prices for similar assets or liabilities or market-corroborated inputs\n•\nLevel 3 - Unobservable inputs for which there is little or no market data and which require us to develop our own assumptions about how market participants would price the assets or liabilities.\n \nRecently Issued Accounting Standards\nIncome Taxes.\n In December 2023, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") No. 2023-09, \"Income Taxes (Topic 740): Improvements to Income Tax Disclosures.\" This ASU enhances disclosures related to income taxes, including the rate reconciliation and information on income taxes paid. This ASU becomes effective for us on January 1, 2025. We are assessing the impact of this ASU and upon adoption may be required to include certain additional disclosures.\nExpense Disaggregation.\n In November 2024, the FASB issued ASU No. 2024-03, \"Income Statement-Reporting Comprehensive Income-Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses.\" This ASU requires disclosing disaggregated information about certain income statement expense captions but does not change the presentation of expense information or expense captions reported on the face of the income statement. This ASU is effective for annual reporting periods beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027; early adoption is permitted. We are assessing the impact of this ASU and upon adoption may be required to include certain additional disclosures.\nNOTE 2 - \nREVENUE RECOGNITION\nPassenger Revenue\n. \nPassenger revenue is recognized when transportation is provided.\nPassenger tickets and related ancillary services sold by the Company for flights are purchased primarily via credit card transactions, with payments collected by the Company in advance of the performance of related services. The Company initially records ticket sales in its Advance ticket sales liability, deferring revenue recognition until the travel occurs. For travel that has more than one flight segment, the Company deems each segment as a separate performance obligation and recognizes revenue for each segment as travel occurs. Tickets sold by other airlines where the Company provides the transportation are recognized as passenger revenue at the estimated value to be billed to the other airline when travel is provided. Differences between amounts billed and the actual amounts may be rejected and rebilled or written off if the amount recorded was different from the original estimate. When necessary, the Company records a reserve against its billings and payables with other airlines based on historical experience.\nThe Company sells certain tickets with connecting flights with one or more segments operated by its other airline partners. For segments operated by its other airline partners, the Company has determined that it is acting as an agent on behalf of the other airlines as they are responsible for their portion of the contract (i.e. transportation of the passenger). The Company, as the agent, recognizes revenue within Other operating revenue at the time of the travel for the net amount representing commission to be retained by the Company for any segments flown by other airlines.\nRefundable tickets expire after \none year\n from the date of issuance. Non-refundable tickets generally expire on the date of the intended travel, unless the date is extended by notification from the customer on or before the intended travel date.\nUnited initially capitalizes the costs of selling airline travel tickets and then recognizes those costs as Distribution expense at the time of travel. Costs to sell a ticket include credit card fees, travel agency and other commissions paid, as well as global distribution systems booking fees.\n68\nTable of Contents\nAdvance ticket sales.\n Advance ticket sales represent the Company's liability to provide air transportation in the future. All tickets sold at any given point in time have travel dates through the next \n12\n months. The Company defers amounts related to future travel in its Advance ticket sales liability account.\nEstimate of tickets not expected to be used (\"ticket breakage\").\n The Company estimates the value of Advance ticket sales that will expire unused and recognizes revenue and any changes in estimates in proportion to the usage of the related tickets. To determine ticket breakage, the Company uses its historical experience with expired tickets and certificates and other facts, such as recent aging trends, program changes and modifications that could affect the ultimate expiration patterns.\nIn the years ended December 31, 2024, 2023 and 2022, the Company recognized approximately $\n5.3\n billion, $\n5.7\n billion and $\n3.3\n billion, respectively, of passenger revenue for tickets that were included in Advance ticket sales at the beginning of those periods.\nRevenue by geography.\n \nThe Company further disaggregates its operating revenue by principal geographic region for the years ended December 31 is presented in the table below (in millions):\n2024\n2023\n2022\nDomestic (U.S. and Canada)\n$\n34,067\n \n$\n32,400\n \n$\n28,474\n \nAtlantic\n11,097\n \n10,982\n \n9,072\n \nPacific\n6,462\n \n5,267\n \n2,927\n \nLatin America\n5,437\n \n5,068\n \n4,482\n \nTotal\n$\n57,063\n \n$\n53,717\n \n$\n44,955\n \nThe Company attributes revenue among the geographic areas based upon the origin and destination of each flight segment. The Company's operations involve an insignificant level of revenue-producing assets in geographic regions as the overwhelming majority of the Company's revenue-producing assets (primarily U.S. registered aircraft) can be deployed in any of its geographic regions.\nAncillary services.\n \nThe Company charges fees, separately from ticket sales, for certain ancillary services that are directly related to passengers' travel, such as baggage fees, premium seat fees, inflight amenity fees, and other ticket-related fees. These ancillary fees are part of the travel performance obligation and, as such, are recognized as passenger revenue when the travel occurs.\n The Company recorded $\n4.5\n billion, $\n4.1\n billion and $\n3.4\n billion of ancillary fees within passenger revenue in the years ended December 31, 2024, 2023 and 2022, respectively.\nTicket Taxes. \nCertain governmental taxes are imposed on the Company's ticket sales through a fee included in ticket prices. The Company collects these fees and remits them to the appropriate government agency. These fees are excluded from the contract transaction price and are therefore not included in passenger revenue. We record a liability when amounts are collected and reduce the liability when payments are made to the appropriate taxing authority.\n \nFrequent Flyer Program\n. \nUnited's MileagePlus loyalty program builds customer loyalty by offering awards, benefits and services to program participants. Members in this program earn miles for travel on United, United Express, Star Alliance members and certain other airlines that participate in the program. Members can also earn miles by purchasing goods and services from our network of non-airline partners. We have contracts to sell miles to these partners with the terms extending from approximately \none\n to \nfive years\n. These partners include domestic and international credit card issuers, retail merchants, hotels, car rental companies and our participating airline partners. Miles can be redeemed for free (other than taxes and government-imposed fees), discounted or upgraded air travel and non-travel awards.\nMiles earned in conjunction with travel.\n When frequent flyers earn miles for flights, the Company recognizes a portion of the ticket sales as revenue when the travel occurs and defers a portion of the ticket sale representing the value of the related miles as a separate performance obligation. The Company determines the estimated selling price of travel and miles as if each element is sold on a separate basis. The total consideration from each ticket sale is then allocated to each of these elements, individually, on a pro-rata basis. At the time of travel, the Company records the portion allocated to the miles to Frequent flyer deferred revenue on the Company's consolidated balance sheet and subsequently recognizes it into revenue when miles are redeemed for air travel and non-air travel awards.\nEstimate of miles not expected to be redeemed (\"breakage\")\n. The Company's breakage model is based on the assumption that the likelihood that an account will redeem its miles can be estimated based on a consideration of the account's historical behavior. The Company uses a statistical model to estimate the probability that an account will redeem its current miles balance and reviews its breakage estimates annually. The Company's estimate of the expected breakage of miles requires management judgment. Changes to breakage assumptions, or to program rules and program redemption opportunities, may result in material \n69\nTable of Contents\nchanges to the deferred revenue balance as well as recognized revenues from the program. We recognize breakage proportionally as the remaining miles are redeemed.\nEstimated selling price of miles\n. The Company's estimated selling price of miles is based on an equivalent ticket value, which incorporates the expected redemption of miles, as the best estimate of selling price for these miles. The equivalent ticket value is based on the prior 12 months' weighted average equivalent ticket value of similar fares as those used to settle award redemptions while taking into consideration such factors as redemption pattern, cabin class, loyalty status and geographic region. The estimated selling price of miles is adjusted by breakage that considers a number of factors, including redemption patterns of various customer groups.\nCo-Brand agreement\n. United's most significant contract to sell MileagePlus miles is with its co-branded credit card partner JPMorgan Chase Bank USA, N.A. (\"Chase\"). Chase awards miles to MileagePlus members based on their credit card activity. United identified the following significant separately identifiable performance obligations in this contract (the \"Co-Brand Agreement\"):\n•\nMileagePlus miles awarded – United has a performance obligation to provide MileagePlus cardholders with miles to be used for air travel and non-travel award redemptions. The Company records Passenger revenue related to the travel awards when the transportation is provided and records Other operating revenue related to the non-travel awards when the goods or services are delivered. The Company records the cost associated with non-travel awards in Other operating revenue, as an agent.\n•\nMarketing – United has a performance obligation to provide Chase access to United's customer list and the use of United's brand. Marketing revenue is recorded to Other operating revenue as miles are delivered to Chase.\n•\nAdvertising – United has a performance obligation to provide advertising in support of the MileagePlus card in various customer contact points such as United's website, email promotions, direct mail campaigns, airport advertising and in-flight advertising. Advertising revenue is recorded to Other operating revenue as miles are delivered to Chase.\n•\nOther travel-related benefits – United's performance obligations are comprised of various items such as waived bag fees, seat upgrades and lounge passes. Lounge passes are recorded to Other operating revenue as customers use the lounge passes. Bag fees and seat upgrades are recorded to Passenger revenue at the time of the associated travel.\nWe account for all the payments received under the Co-Brand Agreement by allocating them to the separately identifiable performance obligations. The fair value of the separately identifiable performance obligations is determined using management's estimated selling price of each component. The objective of using the estimated selling price based methodology is to determine the price at which we would transact a sale if the product or service were sold on a stand-alone basis. Accordingly, we determine our best estimate of selling price by considering multiple inputs and methods including, but not limited to, discounted cash flows, brand value, volume discounts, published selling prices, number of miles awarded and number of miles redeemed. The Company estimated the selling prices and volumes over the term of the Co-Brand Agreement, at the inception of the contract, in order to determine the allocation of proceeds to each of the components to be delivered.\nFrequent flyer deferred revenue.\n Miles in MileagePlus members' accounts are combined into one homogeneous pool and are thus not separately identifiable, for award redemption purposes, between miles earned in the current period and those in their beginning balance. Of the miles expected to be redeemed, the Company expects the majority of these miles to be redeemed within \ntwo years\n. The current portion of the Frequent flyer deferred revenue is based on expected redemptions in the next 12 months.\n \nThe table below presents a roll forward of Frequent flyer deferred revenue (in millions):\n2024\n2023\nBalance at January 1\n$\n7,143\n \n$\n6,675\n \nMiles earned\n3,563\n \n3,297\n \nTravel miles redeemed\n(\n3,150\n)\n(\n2,723\n)\nNon-travel miles redeemed\n(\n115\n)\n(\n106\n)\nBalance at December 31\n$\n7,441\n \n$\n7,143\n \nIn the years ended December 31, 2024, 2023 and 2022, the Company recognized, in Other operating revenue, $\n2.9\n billion, $\n2.7\n billion and $\n2.4\n billion, respectively, related to the marketing, advertising, non-travel miles redeemed (net of related costs) and other travel-related benefits of the mileage revenue associated with our various partner agreements including, but not limited to, our Co-Brand Agreement. The portion related to the MileagePlus miles awarded of the total amounts received from our various partner agreements is deferred and presented in the table above as an increase to Total Frequent flyer deferred revenue.\n70\nTable of Contents\nCargo Revenue. \nCargo revenue is recognized when shipments arrive at their destination.\n \nNOTE 3 - \nCOMMON STOCKHOLDERS' EQUITY AND PREFERRED SECURITIES \nCommon stock. \nOn October 15, 2024, the Company announced that its Board of Directors (the \"Board\") authorized a new share repurchase program, allowing for purchases of up to $\n1.5\n billion in the aggregate of outstanding UAL common stock and certain Warrants (as defined below) issued in connection with the Coronavirus Aid, Relief, and Economic Security Act (the \"CARES Act\"), subject to a limit of $\n500\n million in the aggregate through 2024. During the quarter ended December 31, 2024, the Company repurchased \n997,076\n shares of UAL common stock at an average price of $\n81.26\n for a total investment of approximately $\n81\n million as part of the program. As of February 24, 2025, the dollar value of shares that may yet be purchased under the program is approximately $\n1.3\n billion. Unless suspended or terminated earlier by the Board, this program has no set expiration date and will therefore terminate when the Company has completed all purchases authorized under the program. The specific timing and number of shares of UAL common stock or Warrants purchased will be determined by the Company's management at its discretion and will vary based on the capital needs of the business, the market price of UAL common stock, general market conditions, securities law limitations and other factors. The purchases may be effected through a combination of one or more open market and privately negotiated transactions (including under trading plans intended to comply with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\")) as well as transactions structured through investment banking institutions and other derivative transactions (including through one or more accelerated share repurchase programs).\nIn August 2024, the Company also repurchased, through open market repurchases, following the exercise of the Warrants described below, \n2,043,906\n shares of UAL common stock, which was recorded as an approximately $\n82\n million increase to stock held in treasury, at cost. These share repurchases were executed outside of a publicly announced plan or program using cash resources.\nAs of December 31, 2024, approximately \n3.5\n million shares of UAL's common stock were reserved for future issuance related to the issuance of equity-based awards under the Company's incentive compensation plans. \nPreferred stock.\n As of December 31, 2024, UAL had \ntwo\n shares of junior preferred stock (par value $\n0.01\n per share) outstanding. In addition, UAL is authorized to issue \n250\n million shares of preferred stock (without par value) under UAL's amended and restated certificate of incorporation.\nWarrants. \nIn 2020 and 2021, the Company issued to the United States Department of the Treasury (the \"U.S. Treasury\") warrants (\"Warrants\") to purchase \n9,928,349\n shares of UAL common stock in connection with the Payroll Support Program (\"PSP\") established under Division A, Title IV, Subtitle B of the CARES Act, the Payroll Support Program Extension established under Division N, Title IV, Subtitle A of the Consolidated Appropriations Act, 2021 (\"PSP2\"), the Payroll Support Program 3 established under Title VII, Subtitle C of the American Rescue Plan Act of 2021 (\"PSP3\"), and the Airline Loan Program established under Division A, Title IV, Subtitle A of the CARES Act. In August 2024, the holder of the Warrants exercised \n6,414,635\n, or \n65\n%, of the Warrants, with an exercise price of $\n31.50\n, in a net share settlement for \n2,043,906\n shares of UAL common stock. \nAs of December 31, 2024, the Company had the below Warrants outstanding:\nWarrant Description\nNumber of Shares of UAL Common Stock\nExercise Price\nExpiration Dates\nPSP2 Warrants\n2,011,924\n$\n43.26\n \n1/15/2026\n—\n4/29/2026\nPSP3 Warrants\n1,501,790\n53.92\n \n4/29/2026\n—\n6/10/2026\nTotal\n3,513,714\n \n71\nTable of Contents\nNOTE 4 - \nEARNINGS PER SHARE\nThe computations of UAL's basic and diluted earnings per share are set forth below for the years ended December 31 (in millions, except per share amounts):\n2024\n2023\n2022\nEarnings available to common stockholders\n$\n3,149\n \n$\n2,618\n \n$\n737\n \nBasic weighted-average shares outstanding\n328.6\n \n327.8\n \n326.4\n \nDilutive effect of stock Warrants (a)\n1.7\n \n2.2\n \n1.5\n \nDilutive effect of employee stock awards\n2.9\n \n1.9\n \n2.2\n \nDiluted weighted-average shares outstanding\n333.2\n \n331.9\n \n330.1\n \nEarnings per share, basic\n$\n9.58\n \n$\n7.98\n \n$\n2.26\n \nEarnings per share, diluted\n$\n9.45\n \n$\n7.89\n \n$\n2.23\n \nPotentially dilutive securities (b)\nStock Warrants (a)\n—\n \n1.5\n \n3.5\n \nEmployee stock awards\n0.3\n \n0.6\n \n0.7\n \n(a) See Note 3 of this report for additional information about these Warrants.\n(b) Weighted-average potentially dilutive securities outstanding excluded from the computation of diluted earnings per share because the securities would have had an antidilutive effect.\nNOTE 5 - \nSHARE-BASED COMPENSATION PLANS\nUAL maintains share-based compensation plans for our management employees and our non-employee directors. These plans provide for grants of nonqualified stock options; incentive stock options (within the meaning of Section 422 of the Internal Revenue Code of 1986); stock appreciation rights (\"SARs\"); restricted stock; RSUs; performance units; cash incentive awards and other equity-based and equity-related awards. An award (other than an option, SAR or cash incentive award) may provide the holder with dividends or dividend equivalents.\nAll awards are recorded as either equity or a liability in the Company's consolidated balance sheets. Share-based compensation expense is recorded in Salaries and related costs. \nDuring 2024, UAL granted share-based compensation awards pursuant to the United Airlines Holdings, Inc. 2021 Incentive Compensation Plan. These share-based compensation awards included approximately \n3.7\n million RSUs consisting of approximately \n2.0\n million time-vested RSUs and approximately \n1.7\n million performance-based RSUs. The time-vested RSUs vest pro-rata, a majority of which vest on February 28th of each year, over a \nthree-year\n period from the date of grant. Performance-based awards vest either pro-rata, one-third each year, over a \nthree-year\n period from the date of grant or all at once upon continuous employment with the Company over a \nthree-year\n period. Payout under the performance-based awards can range from \n0\n% to \n300\n% depending on the achievement level of certain financial and strategic goals. RSUs are generally equity awards settled in stock for domestic employees and liability awards settled in cash for international employees. The cash payments are based on the \n20\n-day average closing price of UAL common stock immediately prior to the vesting date. \nThe following table provides information related to UAL's share-based compensation plan cost for the years ended December 31 (in millions):\nCompensation cost\n2024\n2023\n2022\nRSUs  \n$\n141\n \n$\n78\n \n$\n87\n \nStock options \n1\n \n2\n \n2\n \nTotal  \n$\n142\n \n$\n80\n \n$\n89\n \nThe table below summarizes UAL's unearned compensation and weighted-average remaining period to recognize costs for all outstanding share-based awards that are probable of being achieved as of December 31, 2024 (in millions, except as noted): \n72\nTable of Contents\nUnearned Compensation\nWeighted-Average\nRemaining Period \n(in years)\nRSUs  \n$\n110\n \n1.5\nStock options \n2\n \n2.2\nTotal\n$\n112\n \nRestricted stock units.\n \nThe table below summarizes UAL's RSU activity for the years ended December 31 (shares in millions):\nLiability Awards\nEquity Awards\nRSUs\nRSUs\nWeighted-\nAverage\nGrant Price\nOutstanding at December 31, 2021\n0.2\n \n4.4\n \n$\n53.63\n \nGranted\n0.1\n \n2.3\n \n31.96\n \nAdditional issuance due to achievement of performance metrics\n—\n \n1.6\n \n58.17\n \nVested\n(\n0.2\n)\n(\n4.8\n)\n56.00\n \nForfeited\n—\n \n(\n0.2\n)\n53.03\n \nOutstanding at December 31, 2022\n0.1\n \n3.3\n \n37.88\n \nGranted\n0.1\n \n2.5\n \n43.42\n \nVested\n(\n0.1\n)\n(\n1.6\n)\n44.03\n \nForfeited\n—\n \n(\n0.1\n)\n36.90\n \nOutstanding at December 31, 2023\n0.1\n \n4.1\n \n38.86\n \nGranted \n0.1\n \n3.6\n \n46.65\n \nVested \n(\n0.1\n)\n(\n2.3\n)\n39.37\n \nForfeited \n—\n \n(\n0.3\n)\n43.28\n \nOutstanding at December 31, 2024 \n0.1\n \n5.1\n \n43.89\n \nThe fair value of RSUs that vested in 2024, 2023 and 2022 was approximately $\n91\n million, $\n76\n million and $\n274\n million, respectively. \nAs of December 31, 2024, UAL had recorded a liability of approximately $\n8\n million related to its cash-settled RSUs. UAL paid approximately $\n2\n million, $\n3\n million and $\n7\n million related to its cash-settled RSUs during 2024, 2023 and 2022, respectively.\n73\nTable of Contents\nNOTE 6 - \nACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS) (\"AOCI\") \nThe table below presents the components of the Company's AOCI, net of tax (in millions): \nPension and \nOther \nPostretirement \nLiabilities\nInvestments and Other\nDeferred Taxes (a)\n \n \nTotal\nBalance at December 31, 2021\n$\n(\n847\n)\n$\n—\n \n$\n(\n95\n)\n$\n(\n942\n)\nChanges in value\n1,474\n \n(\n35\n)\n(\n321\n)\n1,118\n \nAmounts reclassified to earnings\n(\n1\n)\n(b)\n—\n \n—\n \n(\n1\n)\nBalance at December 31, 2022\n626\n \n(\n35\n)\n(\n416\n)\n175\n \nChanges in value\n(\n199\n)\n31\n \n38\n \n(\n130\n)\nAmounts reclassified to earnings\n(\n138\n)\n(b)\n—\n \n31\n \n(\n107\n)\nBalance at December 31, 2023\n289\n \n(\n4\n)\n(\n347\n)\n(\n62\n)\nChanges in value\n417\n \n4\n \n(\n94\n)\n327\n \nAmounts reclassified to earnings\n(\n99\n)\n(b)\n—\n \n22\n \n(\n77\n)\nBalance at December 31, 2024\n$\n607\n \n$\n—\n \n$\n(\n419\n)\n$\n188\n \n(a)\nIncludes approximately $\n285\n million of deferred income tax expense that will not be recognized in net income until the related pension and postretirement benefit obligations are fully extinguished. We consider all income sources, including other comprehensive income, in determining the amount of tax benefit allocated to results from operations.\n(b)\nThis AOCI component is included in the computation of net periodic pension and other postretirement costs, specifically the following components: amortization of unrecognized (gain) loss, amortization of prior service credit and other. See Note 8 of this report for additional information on pensions and other postretirement liabilities.\nNOTE 7 - \nINCOME TAXES \nThe income tax provision differed from amounts computed at the statutory federal income tax rate and consisted of the following significant components (in millions)\n:\n2024\n2023\n2022\nIncome tax provision at statutory rate\n$\n875\n \n$\n711\n \n$\n208\n \nState income tax provision, net of federal income tax benefit\n56\n \n46\n \n13\n \nNondeductible employee meals\n16\n \n15\n \n12\n \nNondeductible transportation fringe benefit\n16\n \n13\n \n10\n \nValuation allowance\n29\n \n(\n21\n)\n(\n10\n)\nOther, net\n27\n \n5\n \n20\n \nIncome tax expense\n$\n1,019\n \n$\n769\n \n$\n253\n \nCurrent\n$\n84\n \n$\n13\n \n$\n5\n \nDeferred\n935\n \n756\n \n248\n \nIncome tax expense\n$\n1,019\n \n$\n769\n \n$\n253\n \nTemporary differences and carryforwards that give rise to deferred tax assets and liabilities at December 31, 2024 and 2023 were as follows (in millions): \n74\nTable of Contents\n \nUAL\nUnited\n2024\n2023\n2024\n2023\nDeferred income tax asset (liability):\nFederal and state net operating loss (\"NOL\") carryforwards\n$\n2,149\n \n$\n2,644\n \n$\n2,119\n \n$\n2,616\n \nDeferred revenue\n1,865\n \n1,845\n \n1,865\n \n1,845\n \nEmployee benefits, including pension, postretirement and medical \n608\n \n695\n \n608\n \n695\n \nOperating lease liabilities\n1,110\n \n1,134\n \n1,110\n \n1,134\n \nOther financial liabilities\n517\n \n414\n \n517\n \n414\n \nInterest expense carryforward\n467\n \n579\n \n467\n \n579\n \nOther\n565\n \n575\n \n565\n \n575\n \nLess: Valuation allowance\n(\n208\n)\n(\n179\n)\n(\n208\n)\n(\n179\n)\nTotal deferred tax assets \n$\n7,073\n \n$\n7,707\n \n$\n7,043\n \n$\n7,679\n \nDepreciation\n$\n(\n7,171\n)\n$\n(\n6,782\n)\n$\n(\n7,171\n)\n$\n(\n6,782\n)\nOperating lease right-of-use asset\n(\n863\n)\n(\n887\n)\n(\n863\n)\n(\n887\n)\nIntangibles\n(\n619\n)\n(\n632\n)\n(\n619\n)\n(\n632\n)\nTotal deferred tax liabilities\n$\n(\n8,653\n)\n$\n(\n8,301\n)\n$\n(\n8,653\n)\n$\n(\n8,301\n)\nNet deferred tax asset (liability)\n$\n(\n1,580\n)\n$\n(\n594\n)\n$\n(\n1,610\n)\n$\n(\n622\n)\nUnited and its domestic consolidated subsidiaries file a consolidated federal income tax return with UAL. Under an intercompany tax allocation policy, United and its subsidiaries compute, record and pay UAL for their own tax liabilities as if they were separate companies filing separate returns. In determining their own tax liabilities, United and each of its subsidiaries take into account all tax credits or benefits generated and utilized as separate companies and they are each compensated for the aforementioned tax benefits on an annual basis.\nThe Company's federal and state NOL and tax credit carryforwards relate to prior years' NOLs and credits, which may be used to reduce tax liabilities in future years. These tax benefits are mostly attributable to federal pre-tax NOL carryforwards of $\n9.7\n billion ($\n2.0\n billion tax effected) for UAL. If not utilized, $\n0.1\n billion of these federal pre-tax NOLs will expire in 2029. The remaining $\n9.6\n billion of NOLs has no expiration date. State pre-tax NOLs of $\n3.0\n billion ($\n0.2\n billion tax effected) expire over a \n1\n to \n20\n-year period. State tax credits of $\n58\n million will expire over a \n1\n to \n15-year\n period.\nAs of December 31, 2024, the Company has recorded $\n179\n million of valuation allowance against its capital loss deferred tax assets. Capital losses have a limited carryforward period of five years, and they can be utilized only to the extent of capital gains. The Company does not anticipate generating sufficient capital gains to utilize the losses before they expire, therefore, a valuation allowance is necessary as of December 31, 2024. Additionally, the Company recorded a valuation allowance of $\n29\n million on certain state deferred tax assets primarily due to state NOLs that have short expiration periods.\nThe Company's unrecognized tax benefits related to uncertain tax positions were $\n70\n million, $\n66\n million and $\n58\n million at December 31, 2024, 2023 and 2022, respectively. All of the uncertain tax positions would affect the Company's effective tax rate if recognized. The changes in unrecognized tax benefits relating to settlements with taxing authorities, unrecognized tax benefits as a result of tax positions taken during a prior period and unrecognized tax benefits relating from a lapse of the statute of limitations were immaterial during 2024, 2023 and 2022. The Company does not expect significant increases or decreases in their unrecognized tax benefits within the next 12 months. There are no material amounts included in the balance at December 31, 2024 for tax positions for which the ultimate deductibility is highly certain but for which there is uncertainty about the timing of such deductibility.\nThe Company's federal income tax returns for tax years after 2000 remain subject to examination by the Internal Revenue Service and state taxing jurisdictions.\nNOTE 8 - \nPENSION, POSTRETIREMENT AND OTHER EMPLOYEE BENEFIT PLANS\nThe following summarizes the significant pension and other postretirement plans of United:\nPension Plans.\n \nUnited maintains \ntwo\n primary defined benefit pension plans, one covering certain pilot employees and another covering certain U.S. non-pilot employees. Each of these plans provides benefits based on a combination of years of benefit \n75\nTable of Contents\naccruals service and an employee's final average compensation. Additional benefit accruals are frozen under the plan covering certain pilot employees and for management and administrative employees covered under the non-pilot plan. Benefit accruals for certain non-pilot employees continue. United maintains additional defined benefit pension plans, which cover certain international employees.\nOther Postretirement Plans.\n \nUnited maintains postretirement medical programs which provide medical benefits to certain retirees and eligible dependents, as well as life insurance benefits to certain retirees participating in the plan. Benefits provided are subject to applicable contributions, co-payments, deductibles and other limits as described in the specific plan documentation.\nActuarial assumption changes are reflected as a component of the net actuarial (gain) loss. The 2024 actuarial gains were mainly related to discount rate changes in 2024. Actuarial (gains) losses will be amortized over the average remaining service life of the covered active employees.\nThe following tables set forth the reconciliation of the beginning and ending balances of the benefit obligation and plan assets, the funded status and the amounts recognized in these financial statements for the defined benefit and other postretirement plans (in millions):\nPension Benefits\nYear Ended December 31, 2024\nYear Ended December 31, 2023\nAccumulated benefit obligation:\n$\n3,752\n \n$\n3,910\n \nChange in projected benefit obligation:\nProjected benefit obligation at beginning of year\n$\n4,550\n \n$\n4,181\n \nService cost\n135\n \n124\n \nInterest cost\n229\n \n217\n \nActuarial (gain) loss\n(\n460\n)\n204\n \nBenefits paid\n(\n135\n)\n(\n177\n)\nOther\n(\n4\n)\n1\n \nProjected benefit obligation at end of year\n$\n4,315\n \n$\n4,550\n \nChange in plan assets:\nFair value of plan assets at beginning of year\n$\n3,599\n \n$\n3,467\n \nActual income on plan assets\n132\n \n281\n \nEmployer contributions\n5\n \n22\n \nBenefits paid\n(\n135\n)\n(\n177\n)\nOther\n—\n \n6\n \nFair value of plan assets at end of year\n$\n3,601\n \n$\n3,599\n \nFunded status—Net amount recognized\n$\n(\n714\n)\n$\n(\n951\n)\nPension Benefits\nDecember 31, 2024\nDecember 31, 2023\nAmounts recognized in the consolidated balance sheets consist of:\nNoncurrent asset\n$\n22\n \n$\n21\n \nCurrent liability\n(\n7\n)\n(\n4\n)\nNoncurrent liability\n(\n729\n)\n(\n968\n)\nTotal liability\n$\n(\n714\n)\n$\n(\n951\n)\nAmounts recognized in accumulated other comprehensive income (loss) consist of:\nNet actuarial gain (loss)\n$\n95\n \n$\n(\n242\n)\nTotal accumulated other comprehensive gain (loss)\n$\n95\n \n$\n(\n242\n)\n76\nTable of Contents\nOther Postretirement Benefits\nYear Ended December 31, 2024\nYear Ended December 31, 2023\nChange in benefit obligation:\nBenefit obligation at beginning of year\n$\n746\n \n$\n788\n \nService cost\n5\n \n4\n \nInterest cost\n38\n \n42\n \nPlan participants' contributions\n65\n \n67\n \nBenefits paid\n(\n163\n)\n(\n177\n)\nActuarial (gain) loss\n(\n101\n)\n22\n \nBenefit obligation at end of year\n$\n590\n \n$\n746\n \nChange in plan assets:\nFair value of plan assets at beginning of year\n$\n46\n \n$\n48\n \nActual return on plan assets\n1\n \n1\n \nEmployer contributions\n96\n \n107\nPlan participants' contributions\n65\n \n67\n \nBenefits paid\n(\n163\n)\n(\n177\n)\nFair value of plan assets at end of year\n45\n \n46\n \nFunded status—Net amount recognized\n$\n(\n545\n)\n$\n(\n700\n)\nOther Postretirement Benefits\nDecember 31, 2024\nDecember 31, 2023\nAmounts recognized in the consolidated balance sheets consist of:\nCurrent liability\n$\n(\n41\n)\n$\n(\n63\n)\nNoncurrent liability\n(\n504\n)\n(\n637\n)\nTotal liability\n$\n(\n545\n)\n$\n(\n700\n)\nAmounts recognized in accumulated other comprehensive income (loss) consist of:\nNet actuarial gain\n$\n383\n \n$\n309\n \nPrior service credit\n129\n \n222\n \nTotal accumulated other comprehensive income\n$\n512\n \n$\n531\n \nThe following information relates to all pension plans with an accumulated benefit obligation and a projected benefit obligation in excess of plan assets at December 31 (in millions): \n2024\n2023\nProjected benefit obligation\n$\n4,179\n \n$\n4,407\n \nAccumulated benefit obligation\n3,617\n \n3,767\n \nFair value of plan assets\n3,443\n \n3,435\n \n77\nTable of Contents\nNet periodic benefit cost (credit) for the years ended December 31 included the following components (in millions):\n2024\n2023\n2022\nPension Benefits\nOther Postretirement Benefits\nPension Benefits\nOther Postretirement Benefits\nPension Benefits\nOther Postretirement Benefits\nService cost\n$\n135\n \n$\n5\n \n$\n124\n \n$\n4\n \n$\n204\n \n$\n9\n \nInterest cost\n229\n \n38\n \n217\n \n42\n \n188\n \n30\n \nExpected return on plan assets\n(\n276\n)\n(\n1\n)\n(\n251\n)\n(\n1\n)\n(\n306\n)\n(\n1\n)\nAmortization of unrecognized actuarial (gain) loss\n19\n \n(\n26\n)\n8\n \n(\n38\n)\n120\n \n(\n14\n)\nAmortization of prior service (credits) cost\n—\n \n(\n93\n)\n1\n \n(\n112\n)\n—\n \n(\n112\n)\nOther\n1\n \n—\n \n3\n \n—\n \n5\n \n—\n \nNet periodic benefit cost (credit)\n$\n108\n \n$\n(\n77\n)\n$\n102\n \n$\n(\n105\n)\n$\n211\n \n$\n(\n88\n)\nService cost is recorded in Salaries and related costs on the statement of consolidated operations. All other components of net periodic benefit costs are recorded in Miscellaneous, net on the statement of consolidated operations. \nThe Company's expected Net periodic benefit cost (credit) for 2025 is as follows (in millions):\nPension Benefits\nOther Postretirement Benefits\nNet periodic benefit cost (credit)\n$\n91\n \n$\n(\n81\n)\nThe assumptions used for the benefit plans were as follows:\nPension Benefits\nAssumptions used to determine benefit obligations\n2024\n2023\nDiscount rate\n5.67\n \n%\n5.04\n \n%\nRate of compensation increase\n3.85\n \n%\n3.84\n \n%\nAssumptions used to determine net expense\nDiscount rate\n5.04\n \n%\n5.20\n \n%\nExpected return on plan assets\n7.97\n \n%\n7.53\n \n%\nRate of compensation increase\n3.84\n \n%\n3.83\n \n%\nOther Postretirement Benefits\nAssumptions used to determine benefit obligations\n2024\n2023\nDiscount rate\n5.70\n \n%\n5.43\n \n%\nAssumptions used to determine net expense\nDiscount rate\n5.43\n \n%\n5.66\n \n%\nExpected return on plan assets\n3.00\n \n%\n3.00\n \n%\nHealth care cost trend rate assumed for next year\n6.75\n \n%\n7.00\n \n%\nRate to which the cost trend rate is assumed to decline (ultimate trend rate in 2033)\n4.50\n \n%\n4.50\n \n%\nThe Company used the Society of Actuaries' PRI-2012 Private Retirement Plans Mortality Tables projected generationally using the Society of Actuaries' MP-2021 projection scale.\nThe Company selected the 2024 discount rate for substantially all of its plans by using a hypothetical portfolio of high-quality bonds at December 31, 2024 that would provide the necessary cash flows to match projected benefit payments.\nWe develop our expected long-term rate of return assumption for our defined benefit plans based on historical experience and by evaluating input from the trustee managing the plans' assets.\n \nOur expected long-term rate of return on plan assets for these plans is based on a target allocation of assets, which is based on our goal of earning the highest rate of return while maintaining risk at acceptable levels. The plans strive to have assets sufficiently diversified so that adverse or unexpected results from one \n78\nTable of Contents\nsecurity class will not have an unduly detrimental impact on the entire portfolio. \nPlan fiduciaries regularly review our actual asset allocation and the pension plans' investments are periodically rebalanced to our targeted allocation when considered appropriate. United's plan assets are allocated within the following guidelines:\n \n Percent of Total\nExpected Long-Term\nRate of Return\nEquity securities\n27\n - \n55\n \n%\n9\n \n%\nFixed-income securities\n33\n - \n61\n \n7\n \n \nAlternatives\n7\n - \n25\n \n \n7\n \n \nThe table below shows the impacts of a change in certain assumptions on the 2025 net periodic benefit cost and the benefit obligations at December 31, 2024 (in millions):\nPension Benefits\nOther Postretirement Benefits\nImpact on Benefit Obligation at December 31, 2024\n100 basis points decrease in the weighted average discount rate\n$\n745\n \n$\n38\n \nImpact on 2025 Net Periodic Benefit Cost\n100 basis points decrease in the weighted average discount rate (a)\n$\n83\n \n$\n—\n \n100 basis points decrease in the expected long-term rate of return on plan assets\n35\n \n—\n \n(a) In general, as discount rates increase, the impact of changes in discount rates decreases. Therefore, these sensitivities cannot be extrapolated for larger increases or decreases in the discount rate. In addition, benefit cost is affected by other factors including, but not limited to, investment performance, contributions, demographic experience and other assumption changes.\nFair Value Information\n.\n Assets and liabilities measured at fair value are based on the following valuation techniques:\nMarket approach. \nPrices and other relevant information generated by market transactions involving identical or comparable assets and liabilities.\nIncome approach.\n Techniques to convert future amounts to a single current value based on market expectations (including present value techniques, option-pricing and excess earnings models).\nThe following tables present information about United's pension and other postretirement plan assets at December 31 (in millions):\n2024\n2023\nPension Plan Assets:\nTotal\nLevel 1\nLevel 2\nLevel 3\nAssets Measured at NAV(a)\nTotal\nLevel 1\nLevel 2\nLevel 3\nAssets Measured at NAV(a)\nEquity securities funds\n$\n1,231\n \n$\n92\n \n$\n4\n \n$\n150\n \n$\n985\n \n$\n1,265\n \n$\n74\n \n$\n3\n \n$\n134\n \n$\n1,054\n \nFixed-income securities\n1,359\n \n—\n \n100\n \n1\n \n1,258\n \n1,325\n \n—\n \n411\n \n3\n \n911\n \nAlternatives\n762\n \n—\n \n—\n \n116\n \n646\n \n779\n \n—\n \n—\n \n136\n \n643\n \nOther investments\n249\n \n14\n \n153\n \n2\n \n80\n \n230\n \n13\n \n87\n \n3\n \n127\n \nTotal\n$\n3,601\n \n$\n106\n \n$\n257\n \n$\n269\n \n$\n2,969\n \n$\n3,599\n \n$\n87\n \n$\n501\n \n$\n276\n \n$\n2,735\n \nOther Postretirement Benefit Plan Assets:\nDeposit administration fund\n$\n45\n \n$\n—\n \n$\n—\n \n$\n45\n \n$\n—\n \n$\n46\n \n$\n—\n \n$\n—\n \n$\n46\n \n$\n—\n \n(a) In accordance with the relevant accounting standards, certain investments that are measured at fair value using the net asset value (\"NAV\") per share (or its equivalent) have not been classified in the fair value hierarchy. These investments are commingled funds that invest in equity securities and fixed-income instruments including bonds, debt securities, and other similar instruments issued by various U.S. and non-U.S. public- or private-sector entities. Redemption periods for these investments range from daily to semiannually.\nEquity and Fixed-Income. \nEquities include investments in both developed market and emerging market equity securities. Fixed-income includes primarily U.S. and non-U.S. government fixed-income securities and non-U.S. corporate fixed-income securities, as well as securitized debt securities.\n79\nTable of Contents\nDeposit Administration Fund. \nThis investment is a stable value investment product structured to provide investment income.\nAlternatives. \nAlternative investments consist primarily of investments in hedge funds, real estate and private equity interests.\nOther investments. \nOther investments consist of primarily cash equivalents, as well as insurance contracts.\nThe following table presents reconciliation of United's benefit plan assets measured at fair value using unobservable inputs (Level 3) for the years ended December 31, 2024 and 2023 (in millions):\n2024\n2023\nBalance at beginning of year\n$\n322\n \n$\n333\n \nActual income (loss) on plan assets:\nSold during the year\n1\n \n(\n50\n)\nHeld at year end\n6\n \n55\n \nPurchases, sales, issuances and settlements (net)\n(\n15\n)\n(\n16\n)\nBalance at end of year\n$\n314\n \n$\n322\n \nFunding requirements for tax-qualified defined benefit pension plans are determined by government regulations. The Company expects to make required contributions to its tax-qualified defined benefit pension plans in 2025. In 2025, employer anticipated contributions to all of United's pension and postretirement plans are at least $\n141\n million and approximately $\n80\n million, respectively.\nThe estimated future benefit payments, net of expected participant contributions, in United's pension plans and other postretirement benefit plans for the next ten years, as of December 31, 2024, are as follows (in millions):\nPension\nOther Postretirement\n2025\n$\n311\n \n$\n88\n \n2026\n328\n \n79\n \n2027\n348\n \n70\n \n2028\n372\n \n66\n \n2029\n371\n \n62\n \nYears 2030 – 2034\n1,863\n \n218\n \nDefined Contribution Plans.\n United offers several defined contribution plans to its employees. Depending upon the employee group, employer contributions consist of matching contributions and/or non-elective employer contributions. United's employer contribution percentages to its primary 401(k) defined contribution plans vary from \n1\n% to \n17\n% of eligible earnings depending on the terms of each plan. United recorded expenses for its primary 401(k) defined contribution plans of $\n1.2\n billion, $\n960\n million and $\n756\n million in the years ended December 31, 2024, 2023 and 2022, respectively.\nMulti-Employer Plans.\n \nUnited's participation in the IAM National Pension Plan (\"IAM Plan\") for the annual period ended December 31, 2024 is outlined in the table below. The risks of participating in these multi-employer plans are different from single-employer plans, as United may be subject to additional risks that others do not meet their obligations, which in certain circumstances could revert to United, or if a withdrawal from a multi-employer plan occurs for United. The IAM Plan reported $\n570\n million in employers' contributions for the year ended December 31, 2023. For 2023, the Company's contributions to the IAM Plan represented more than 5% of total contributions to the IAM Plan. The 2024 information is not available as the applicable Form 5500 is not final for the plan year.\n80\nTable of Contents\nPension Fund\nIAM National Pension Fund (\"IAM Fund\")\nEIN/ Pension Plan Number\n51-6031295 — 002\nPension Protection Act Zone Status (2024 and 2023)\nCritical (2024 and 2023). A plan is in \"critical\" status if the funded percentage is less than 65 percent. On April 17, 2019, the IAM National Pension Fund Board of Trustees voluntarily elected for the IAM Fund to be in critical status effective for the plan year beginning January 1, 2019 to strengthen the IAM Fund's financial health. The IAM Fund's funded percentage was \n86.5\n% as of January 1, 2023.\nFIP/RP Status Pending/Implemented\nA \n10\n-year Rehabilitation Plan effective, January 1, 2022, was adopted on April 17, 2019 that requires the Company to make an additional contribution of \n2.5\n% of the hourly contribution rate, compounded annually for the length of the Rehabilitation Plan, effective June 1, 2019.\nUnited's Contributions\n$\n95\n million, $\n87\n million and $\n75\n million in the years ended December 31, 2024, 2023 and 2022, respectively.\nSurcharge Imposed\nNo\nExpiration Date of Collective Bargaining Agreement\nN/A\nProfit Sharing. \nSubstantially all of our employees are eligible to participate in our profit sharing plan. Under the plan, for each year in which our adjusted pre-tax profit (which is calculated as pre-tax profit, excluding unusual, special or non-recurring charges, profit sharing expense and share-based compensation) exceeds a certain amount, a specified portion of that profit will be distributed to eligible employees. The Company recorded profit sharing and related payroll tax expense of $\n713\n million, $\n681\n million and $\n133\n million in \n2024, 2023 and \n2022, respectively. Profit sharing expense is recorded as a component of Salaries and related costs in the Company's statements of consolidated operations.\nNOTE 9 - \nFAIR VALUE MEASUREMENTS, INVESTMENTS AND NOTES RECEIVABLE\nFair Value Measurement.\n \nThe table below presents the fair value of financial assets and liabilities measured at fair value, based on the inputs described in Note 1, on a recurring basis in the Company's financial statements as of December 31 (in millions):\n2024\n2023\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nCash and cash equivalents\n$\n8,769\n \n$\n8,769\n \n$\n—\n \n$\n—\n \n$\n6,058\n \n$\n6,058\n \n$\n—\n \n$\n—\n \nRestricted cash - current (Note 1)\n11\n \n11\n \n—\n \n—\n \n31\n \n31\n \n—\n \n—\n \nRestricted cash - non-current (Note 1)\n166\n \n166\n \n—\n \n—\n \n245\n \n245\n \n—\n \n—\n \nShort-term investments:\nU.S. government and agency notes\n2,280\n \n—\n \n2,280\n \n—\n \n8,257\n \n—\n \n8,257\n \n—\n \nCertificates of deposit placed through an account registry service (\"CDARS\")\n59\n \n—\n \n59\n \n—\n \n73\n \n—\n \n73\n \n—\n \nCorporate debt\n3,127\n \n—\n \n3,127\n \n—\n \n—\n \n—\n \n—\n \n—\n \nOther fixed-income securities\n240\n \n—\n \n240\n \n—\n \n—\n \n—\n \n—\n \n—\n \nLong-term investments:\nEquity securities\n71\n \n71\n \n—\n \n—\n \n177\n \n177\n \n—\n \n—\n \nInvestments presented in the table above have the same fair value as their carrying value.\nShort-term investments\n — \nT\nhe short-term investments shown in the table above are classified as available-for-sale and have remaining maturities of less than \ntwo years\n.\nLong-term investments: Equity securities\n — Represents equity and equity-linked securities (such as vested warrants) that make up United's investments in Azul Linhas Aéreas Brasileiras S.A., Archer Aviation Inc., Eve Holding, Inc., Mesa Air Group, Inc. (\"Mesa\"). United concluded that Mesa is a variable interest entity as of December 31, 2024. United holds a variable interest in Mesa in the form of an approximately \n10\n% equity interest and several loans to Mesa, but United is not the primary beneficiary because it does not have power to direct the activities that most significantly impact Mesa's economic performance.\n81\nTable of Contents\nOther fair value information -\n \nThe table below presents the carrying values and estimated fair values of financial instruments not presented in the tables above as of December 31 (in millions). Carrying amounts include any related discounts, premiums and issuance costs:\n2024\n2023\nCarrying Amount\nFair Value\nCarrying Amount\nFair Value\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nLong-term debt\n$\n24,653\n \n$\n24,423\n \n$\n—\n \n$\n17,300\n \n$\n7,123\n \n$\n29,075\n \n$\n28,302\n \n$\n—\n \n$\n22,543\n \n$\n5,759\n \nFair value of the financial instruments included in the tables above was determined as follows:\nDescription\nFair Value Methodology\nCash and cash equivalents and\nRestricted cash (current and non-current)\nThe carrying amounts of these assets approximate fair value.\nShort-term and Long-term investments\nFair value is based on (a) the trading prices of the investment or similar\ninstruments or (b) broker quotes obtained by third-party valuation services.\nLong-term debt \nFair values are based on either market prices or the discounted amount of future cash flows using our current incremental rate of borrowing for similar liabilities.\nEquity Method Investments. \nAs of December 31, 2024, United holds investments, accounted for using the equity method, with a combined carrying value of approximately $\n241\n million. Significant equity method investments are described below:\n•\nRepublic Airways Holdings Inc. United holds a \n19\n% minority interest in Republic Airways Holdings Inc., which is the parent company of Republic Airways Inc. (\"Republic\"). Republic currently operates \n66\n regional aircraft under CPAs with United that have terms through 2036.\n•\nCommuteAir LLC. United owns a \n40\n% minority ownership stake in CommuteAir LLC. CommuteAir currently operates \n57\n regional aircraft under a CPA that has a term through 2026.\n•\nUnited Airlines Ventures Sustainable Flight Fund (the \"Fund\"). United holds, through its corporate venture capital arm, United Airlines Ventures, Ltd., a \n33\n% ownership interest in the Fund. The Fund is an investment vehicle designed to invest in start-ups developing technologies focused on decarbonizing aviation and its associated energy supply chains, including through research and production, and technologies associated with sustainable aviation fuel (SAF).\nOther Investments.\n United has equity investments in Abra Group Limited, a multinational airline holding company, JetSuiteX, Inc., an independent air carrier doing business as JSX, as well as a number of companies with emerging technologies and sustainable solutions. None of these investments have readily determinable fair values. We account for these investments at cost less impairment, adjusted for observable price changes in orderly transactions for an identical or similar investment of the same issuer. As of December 31, 2024, the carrying value of these investments was $\n264\n million.\nNotes Receivable.\n As of December 31, 2024, the Company has $\n72\n million of notes receivable, net of allowance for credit losses, the majority of which is from certain of its regional carriers. The current portions of the notes receivable are recorded in Receivables, net. The long-term portions of the notes receivable are recorded in Investments in affiliates and other, net on the Company's consolidated balance sheet.\n82\nTable of Contents\nNOTE 10 - \nDEBT\n(In millions)\nMaturity Dates\nInterest Rate(s) at December 31, 2024\nAt December 31,\n2024\n2023\nEquipment Notes (a)\n2025\n—\n2037\n2.70\n \n%\n—\n6.51\n \n%\n$\n12,983\n \n$\n12,508\n \nMileagePlus Senior Secured Notes\n2027\n6.50\n%\n1,900\n \n2,660\n \nMileagePlus Term Loan Faci\nlity\nn/a\nn/a\n—\n \n2,100\n \n2026 and 2029 Notes\n2026\n—\n2029\n4.38\n \n%\n—\n4.63\n \n%\n4,000\n \n4,000\n \n2021 Term Loan\ns\nn/a\nn/a\n—\n \n3,870\n \n2024 Term Loans (b)\n2031\n6.63\n%\n2,082\n \n—\n \nUnsecured\nNotes\n2025\n4.88\n%\n315\n \n596\n \nPSP Notes (c)\n2030\n—\n2031\n1.00\n%\n3,181\n \n3,181\n \nOther unsecured debt\n2027\n—\n2029\n4.00\n \n%\n—\n5.75\n \n%\n376\n \n437\n \n24,837\n \n29,352\n \nLess: unamortized debt discount, premiums and debt issuance costs \n(\n184\n)\n(\n277\n)\nLess: current portion of long-term debt\n(\n2,973\n)\n(\n4,018\n)\nLong-term debt, net\n$\n21,680\n \n$\n25,057\n \n(a)\nFinancing includes variable rate debt based on the Secured Overnight Financing Rate (\"SOFR\") (or another index rate), generally subject to a floor, plus a specified margin of \n0.64\n% to \n2.00\n%.\n(b)\nFinancing includes variable rate debt based on SOFR (or another index rate), subject to a floor, plus a specified margin of \n2.00\n%.\n(c)\nThe PSP Notes include $\n1.50\n billion of indebtedness evidenced by a \n10\n-year senior unsecured promissory note with Treasury provided under PSP, $\n0.9\n billion of indebtedness evidenced by a \n10\n-year senior unsecured promissory note issued to Treasury pursuant to PSP2 and $\n0.8\n billion of indebtedness evidenced by a \n10\n-year senior unsecured promissory note issued to Treasury pursuant to PSP3. These PSP Notes have a rate of \n1.00\n% in years 1 through 5, and a rate of the SOFR plus \n2.00\n% in years 6 through 10.\nThe table below presents the Company's contractual principal payments (not including debt discount or debt issuance costs) as of December 31, 2024 under then-outstanding long-term debt agreements (in millions):\n2025\n2026\n2027\n2028\n2029\nAfter 2029\nTotal\nContractual principal payments\n$\n2,973\n \n$\n4,793\n \n$\n2,326\n \n$\n1,791\n \n$\n2,892\n \n$\n10,062\n \n$\n24,837\n \nOn July 2, 2024, the Company voluntarily prepaid in full the $\n1.8\n billion outstanding principal balance of the secured term loan facility, secured ratably with the MileagePlus Senior Secured Notes, by substantially all of the assets of MPH (the \"MileagePlus Term Loan\"), in addition to all accrued and unpaid interest and fees under the term loan facility and terminated all commitments thereunder. In 2023, United prepaid $\n1.0\n billion of the outstanding principal amount under the 2021 Term Loans. See Note 13 for information related to charges recorded as a result of these prepayments.\nOn February 15, 2024, the Company entered into an Amended and Restated Revolving Credit and Guaranty Agreement (the \"Revolving Credit Facility\"), increasing the borrowing capacity by $\n1.115\n billion, bringing the total amount available under the Revolving Credit Facility to $\n2.865\n billion, which may be drawn upon until February 15, 2029, in the case of any Revolving Loans (as defined in the Revolving Credit Facility) made by the Extending Lenders (as defined in the Revolving Credit Facility), and until April 21, 2025, in the case of any Revolving Loans made by the 2024 Non-Extending Lenders (as defined in the Revolving Credit Facility). On April 16, 2024, the Company further increased the revolving loan commitments of the Extending Lenders by $\n100\n million for a total amount available thereunder of $\n2.965\n billion. Following such increase, and after the extension of the maturity of $\n150\n million from April 21, 2025 to February 15, 2029, the revolving loan commitments of the Extending Lenders equal $\n2.95\n billion and the revolving loan commitments of the 2024 Non-Extending Lenders equal $\n15\n million. As of December 31, 2024, we had $\n2.965\n billion undrawn and available under the Revolving Credit Facility. The Revolving Loans, if any, bear interest at a variable rate equal to Term SOFR (as defined in the Revolving Credit Facility), generally subject to a floor, plus a credit adjustment spread described in the Revolving Credit Facility, or, at United's election, another rate based on certain market interest rates, also generally subject to a floor, in each case plus a variable margin ranging from \n3.00\n% to \n3.50\n%, in the case of Term SOFR loans, and \n2.00\n% to \n2.50\n%, in the case of loans at other market rates.\n83\nTable of Contents\nOn February 22, 2024, the Company also entered into Amendment No. 2 to Term Loan Credit and Guaranty Agreement (as amended, the \"Term Loan Facility\" and, together with the Revolving Credit Facility, the \"2024 Loan Facilities\") and (i) used available cash in an amount equal to $\n1.37\n billion to partially prepay the term loans under a 2021 term loan facility and (ii) borrowed the entire term loan commitment available under the Term Loan Facility in an amount equal to $\n2.5\n billion and used the proceeds of such terms loans (the \"2024 Term Loans\") to prepay in full the remaining outstanding principal balance under the existing term loan facility. The 2024 Term Loans bear interest at a variable rate equal to Term SOFR (subject to a floor of \n0.0\n%); or, at United's election, another rate based on certain market interest rates (subject to a floor of \n1.0\n%), in each case plus a margin of \n2.75\n%, in the case of Term SOFR loans, and \n1.75\n%, in the case of loans at other market rates. The remaining balance of the 2024 Term Loans will mature and be due and payable on February 22, 2031. On November 1, 2024, the Company made an optional prepayment of $\n400\n million on its 2024 Term Loans and lowered its margin to \n2.00\n%, in the case of Term SOFR loans, and \n1.00\n%, in the case of loans at other market rates.\nThe 2024 Loan Facilities are secured on a senior basis by continuing security interests granted by United to the Collateral Trustee for the benefit of the lenders under the 2024 Loan Facilities, among other parties, on the following (the \"Collateral\"), subject to certain exclusions: (i) all of United's route authorities granted by the U.S. Department of Transportation to operate scheduled service between any international airport located in the United States and any international airport located in any country other than the United States (except Cuba), (ii) United's rights to substantially all of its landing and take-off slots at foreign and domestic airports, including at John F. Kennedy International Airport, LaGuardia Airport and Ronald Reagan Washington National Airport, and (iii) United's rights to use or occupy space at airport terminals, each to the extent necessary at the relevant time for servicing scheduled air carrier service authorized by an applicable route authority. The Collateral securing the 2024 Loan Facilities also presently secures on a senior basis (i) the Company's \n4.375\n% senior secured notes due 2026, and (ii) the Company's \n4.625\n% senior secured notes due 2029.\nOn \nAugust 5, 2024, the Company and Wilmington Trust, National Association, as subordination agent and pass through trustee (the \"Trustee\") under certain pass through trusts newly formed by the Company, entered into the Note Purchase Agreement (the \"Note Purchase Agreement\"). The Note Purchase Agreement provides for the issuance by the Company of equipment notes (the \"Equipment Notes\") in the aggregate principal amount of approximately \n$\n1.4\n billion\n secured by \n48\n Boeing aircraft delivered new from the manufacturer from October 2010 to December 2023 (collectively, the \"Aircraft\"). Pursuant to the Note Purchase Agreement, on August 5, 2024, the Trustee purchased Equipment Notes issued under a trust indenture and mortgage (each, an \"Indenture\" and, collectively, the \"Indentures\") with respect to each Aircraft entered into by the Company and Wilmington Trust, National Association, as mortgagee. Each Indenture provides for the issuance of Equipment Notes in \ntwo\n series: Series AA, bearing interest at the rate of \n5.450\n% per annum, and Series A, bearing interest at the rate of \n5.875\n% per annum, in aggregate principal amounts equal to \n$\n969\n million\n and \n$\n385\n million\n, respectively. The Equipment Notes were purchased by the Trustee, using the proceeds from the sale of Pass Through Certificates, Series 2024-1AA, and Pass Through Certificates, Series 2024-1A, issued by two pass through trusts newly-formed by the Company. The interest on the Equipment Notes is payable semi-annually on each February 15 and August 15, beginning on February 15, 2025. The principal payments on the Equipment Notes are scheduled on February 15 and August 15 of each year, beginning on February 15, 2025 for certain Equipment Notes and August 15, 2025 for the remaining Equipment Notes. The final payments on the Equipment Notes will be due on or prior to February 15, 2037. \nIn addition to the Equipment Notes described above, United borrowed $\n1.4\n billion aggregate principal amount from financial institutions to finance the purchase of aircraft. The notes evidencing these borrowings, which are secured by the related aircraft, mature between 2034 and 2036 and bear interest equal to Term SOFR plus a margin with variable rates ranging from \n6.17\n% to \n6.51\n%.\nOur debt agreements contain customary terms and conditions as well as various affirmative, negative and financial covenants that, among other things, limit our ability under certain circumstances to create liens on collateral, make certain dividends, stock repurchases, restricted investments and other restricted payments, and consolidate, merge, sell, or otherwise dispose of all or substantially all of our assets. Our debt agreements also contain events of default customary for similar financings including, in certain cases, cross-payment default and cross-acceleration to other material indebtedness. Certain of our debt agreements contain financial covenants that require the Company to maintain at least $\n2.0\n billion of unrestricted liquidity at all times, which includes unrestricted cash, certain liquid and short-term investments and any undrawn amounts under any revolving credit facility, and to maintain a minimum ratio of appraised value of collateral to the outstanding debt secured by such collateral on a senior basis of \n1.6\n to 1.0, tested semi-annually. As of December 31, 2024, the Company was in compliance with its debt covenants under these agreements.\n \nNOTE 11 - \nLEASES\nUnited leases aircraft, airport passenger terminal space, aircraft hangars and related maintenance facilities, cargo terminals, other airport facilities, other commercial real estate, office and computer equipment and vehicles, among other items. Certain of these leases include provisions for variable lease payments which are based on several factors, including, but not limited to, \n84\nTable of Contents\nrelative leased square footage, available seat miles, enplaned passengers, passenger facility charges, terminal equipment usage fees, departures, and airports' annual operating budgets. Due to the variable nature of these payments, they are not included in the calculation of the right-of-use asset and lease liability.\nLease Cost\n. \nThe Company's lease cost for the years ended December 31 included the following components (in millions):\n2024\n2023\n2022\nOperating lease cost\n$\n855\n \n$\n925\n \n$\n941\n \nVariable and short-term lease cost\n3,592\n \n3,028\n \n2,603\n \nAmortization of finance lease assets\n62\n \n52\n \n72\n \nInterest on finance lease liabilities\n16\n \n20\n \n13\n \nSublease income\n(\n35\n)\n(\n39\n)\n(\n33\n)\nTotal lease cost\n$\n4,490\n \n$\n3,986\n \n$\n3,596\n \nLease Terms and Commitments\n. United's leases include aircraft leases for aircraft that are directly leased by United and aircraft that are operated by regional carriers on United's behalf under CPAs (but excluding aircraft owned by United) and non-aircraft leases. Aircraft operating leases relate to leases of \n66\n mainline and \n219\n regional aircraft while finance leases relate to leases of \n8\n mainline and \n21\n regional aircraft. United's aircraft leases have remaining lease terms of \n1\n month to \n12\n years with expiration dates ranging from 2025 through 2036. Under the terms of most aircraft leases, United has the right to purchase the aircraft at the end of the lease term, in some cases at fair market value, and in others, at a percentage of cost.\nIn addition, United also has \n66\n leases of Boeing 737 MAX, Boeing 787 and Airbus A321neo aircraft under various sale-leaseback transactions. These transactions did not qualify as a sale under the applicable accounting guidance,\n \nand, as such, the associated aircraft remain on the Company's consolidated balance sheet as part of Operating property and equipment, net. The related obligations are recorded in \nCurrent maturities of long-term debt, finance leases, and other financial liabilities\n and \nLong-term debt, finance leases, and other financial liabilities\n. These aircraft leases have remaining lease terms of \n9\n months to \n12\n years with expiration dates ranging from 2025 through 2037.\nNon-aircraft leases have remaining lease terms of \n1\n month to \n32\n years.\nThe table below summarizes the Company's scheduled future minimum lease payments under operating and finance leases, recorded on the balance sheet, as of December 31, 2024 (in millions):\nOperating Leases\nFinance Leases\n2025\n$\n757\n \n$\n232\n \n2026\n731\n \n33\n \n2027\n926\n \n21\n \n2028\n742\n \n11\n \n2029\n546\n \n5\n \nAfter 2029\n3,081\n \n4\n \nMinimum lease payments\n6,783\n \n306\n \nImputed interest\n(\n1,806\n)\n(\n15\n)\nPresent value of minimum lease payments\n4,977\n \n291\n \nLess: current maturities of lease obligations\n(\n467\n)\n(\n223\n)\nLong-term lease obligations\n$\n4,510\n \n$\n68\n \n85\nTable of Contents\nThe table below presents the Company's future contractual lease payments at December 31, 2024 under then-outstanding sale and leaseback agreements that did not qualify as a sale under the applicable accounting guidance (in millions):\nOther Financial Liabilities\n2025\n$\n453\n \n2026\n320\n \n2027\n610\n \n2028\n283\n \n2029\n280\n \nAfter 2029\n3,232\n \n5,178\n \nImputed interest\n(\n1,466\n)\nCurrent maturities of other financial liabilities\n(\n257\n)\nOther financial liabilities\n$\n3,455\n \nIn November 2024, at the request of United, the City of Houston, Texas issued special facility revenue bonds in the par amount of approximately $\n1.1\n billion (the \"IAH SFRBs\") to fund a portion of the costs of construction, reconfiguration and redevelopment of portions of Terminal B at George Bush Intercontinental Airport. The IAH SFRBs have interest rates ranging from \n5.25\n% to \n5.50\n% per annum, payable semiannually, commencing in July 2025 through the July 2039 maturity date of the IAH SFRBs. United will account for the lease payments related to these IAH SFRBs as an operating lease recognized as a right-of-use asset and lease liability on the Company's balance sheet.\nAs of December 31, 2024, we had entered into leases with rental obligations of approximately $\n5.7\n billion for several mainline aircraft, regional aircraft under CPAs, airport facilities, including the lease associated with the IAH SFRBs described above, and office space, none of which had commenced as of such date. These leases will commence between 2025 and 2027 with lease terms of up to \n27\n years.\nOur lease agreements do not provide a readily determinable implicit rate nor is it available to us from our lessors. Instead, we estimate United's incremental borrowing rate based on information available at lease commencement in order to discount lease payments to present value. \nThe table below presents additional information related to our leases as of December 31:\n2024\n2023\nWeighted-average remaining lease term - operating leases\n11\n years\n10\n years\nWeighted-average remaining lease term - finance leases\n2\n years\n2\n years\nWeighted-average remaining lease term - other financial liabilities\n10\n years\n10\n years\nWeighted-average discount rate - operating leases\n5.9\n \n%\n5.8\n \n%\nWeighted-average discount rate - finance leases\n5.9\n \n%\n6.3\n \n%\nWeighted-average interest rate - other financial liabilities\n5.3\n \n%\n5.3\n \n%\nThe table below presents supplemental cash flow information related to leases during the year ended December 31 (in millions):\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows for operating leases\n$\n851\n \n$\n874\n \n$\n919\n \nOperating cash flows for finance leases\n15\n \n21\n \n13\n \nFinancing cash flows for finance leases\n269\n \n311\n \n124\n \nNOTE 12 - \nCOMMITMENTS, CONTINGENCIES, AND GUARANTEES    \nPurchase Commitments. \nThe table below summarizes United's firm commitments as of December 31, 2024, which include aircraft and related spare engines, aircraft improvements and non-aircraft capital commitments (in billions): \n86\nTable of Contents\n2025\n2026\n2027\n2028\n2029\nAfter 2029\nTotal\nPurchase commitments\n$\n9.6\n \n$\n6.0\n \n$\n4.7\n \n$\n6.5\n \n$\n8.1\n \n$\n19.5\n \n$\n54.4\n \nAircraft commitments included in the table above are based on contractual scheduled aircraft deliveries. The amount and timing of these commitments could change to the extent that: (i) the Company and the aircraft manufacturers, with whom the Company has existing orders for new aircraft, agree to modify (or further modify) the contracts governing those orders, (ii) rights are exercised pursuant to the relevant agreements to cancel deliveries or modify the timing of deliveries, or (iii) the aircraft manufacturers are unable to deliver in accordance with the terms of those orders.\nRegional CPAs. \nUnited has contractual relationships with various regional carriers to provide regional aircraft service branded as United Express. Under these CPAs, the Company pays the regional carriers contractually agreed fees (carrier costs) for operating these flights plus a variable rate adjustment based on agreed performance metrics, subject to annual adjustments. The fees are based on specific rates multiplied by specific operating statistics (e.g., block hours, departures), as well as fixed monthly amounts. Under these CPAs, the Company is also responsible for all fuel costs incurred, as well as landing fees and other costs, which are either passed through by the regional carrier to the Company without any markup or directly incurred by the Company. In some cases, the Company owns some or all of the aircraft subject to the CPA and leases such aircraft to the regional carrier. United's CPAs are for \n412\n regional aircraft as of December 31, 2024, and the CPAs have terms expiring through 2036. Aircraft operated under CPAs include aircraft leased directly from the regional carriers and those owned by United and operated by the regional carriers.\nUnited recorded approximately $\n1.1\n billion, $\n1.1\n billion and $\n0.9\n billion in expenses related to its CPAs with its regional carriers in which United is a minority shareholder, for the years ended December 31, 2024, 2023 and 2022, respectively. United had prepaid assets and accounts and notes receivables with combined carrying values of $\n52\n million and $\n84\n million with these companies, as of December 31, 2024 and 2023, respectively. There were $\n110\n million and $\n122\n million of liabilities due to these companies as of December 31, 2024 and 2023, respectively. The CPAs with these related parties were executed in the ordinary course of business.\nOur future commitments under our CPAs are dependent on numerous variables, and are, therefore, difficult to predict. The most important of these variables is the number of scheduled block hours. Although we are not required to purchase a minimum number of block hours under certain of our CPAs, we have set forth below estimates of our future payments under the CPAs based on our assumptions. The actual amounts we pay to our regional operators under CPAs could differ materially from these estimates. United's estimates of its future payments under all of the CPAs do not include the portion of the underlying obligation for any aircraft leased to a regional carrier or deemed to be leased from other regional carriers and facility rent that are disclosed as part of operating leases in Note 11. For purposes of calculating these estimates, we have assumed (1) the number of block hours flown is based on our anticipated level of flight activity or at any contractual minimum utilization levels if applicable, whichever is higher, (2) that we will reduce the fleet as rapidly as contractually allowed under each CPA, (3) that aircraft utilization, stage length and load factors will remain constant, (4) that each carrier's operational performance will remain at recent historic levels and (5) an annual projected inflation rate. \nThese amounts exclude variable pass-through costs such as fuel and landing fees, among others. Based on these assumptions as of December 31, 2024, our estimated future payments through the end of the terms of our CPAs are presented in the table below (in billions):\n2025\n2026\n2027\n2028\n2029\nAfter 2029\nTotal\nFuture commitments under CPAs\n$\n2.7\n \n$\n2.8\n \n$\n2.1\n \n$\n1.8\n \n$\n1.4\n \n$\n4.1\n \n$\n14.9\n \nAs of December 31, 2024, United had \n207\n call options to purchase regional jet aircraft being operated by certain of its regional carriers with contract dates extending until 2036. These call options are exercisable upon wrongful termination or breach of contract, among other conditions.\nLegal and Environmental. \nThe Company has certain contingencies resulting from litigation and claims incident to the ordinary course of business. As of December 31, 2024, management believes, after considering a number of factors, including (but not limited to) the information currently available, the views of legal counsel, the nature of contingencies to which the Company is subject and prior experience, that \nits defenses and assertions in pending legal proceedings have merit and t\nhe ultimate disposition of any pending matter will not materially affect the Company's financial position, results of operations or cash flows. The Company records liabilities for legal and environmental claims when it is probable that a loss has been incurred and the amount is reasonably estimable. These amounts are recorded based on the Company's assessments of the likelihood of their eventual disposition. \n87\nTable of Contents\nGuarantees and Indemnifications.\n In the normal course of business, the Company enters into numerous real estate leasing and aircraft financing arrangements that have various guarantees included in the contracts. These guarantees are primarily in the form of indemnities under which the Company typically indemnifies the lessors and any tax/financing parties against liabilities that arise out of or relate to the use, operation or maintenance of the leased premises or financed aircraft. Currently, the Company believes that any future payments required under these guarantees or indemnities would be immaterial, as most liabilities and related indemnities are covered by insurance (subject to deductibles). Additionally, certain real estate leases include indemnities for any environmental liability that may arise out of or relate to the use of the leased premises.\nAs of December 31, 2024, United is the guarantor of approximately $\n2.9\n billion in aggregate principal amount of tax-exempt special facility revenue bonds and interest thereon. These bonds, which in most instances are issued by various airport municipalities, are payable solely from rentals paid under long-term agreements with the respective governing bodies. The leasing arrangements associated with these obligations are accounted for as operating leases and the related obligations are included in our lease related disclosures in Note 11. All of these bonds mature between 2027 and 2041.\nAs of December 31, 2024, United had $\n396\n million of surety bonds securing various insurance related obligations with expiration dates through 2028.\nIncreased Cost Provisions.\n In United's financing transactions that include loans in which United is the borrower, United typically agrees to reimburse lenders for any reduced returns with respect to the loans due to any change in capital requirements and, in the case of loans with respect to which the interest rate is based on SOFR, for certain other increased costs that the lenders incur in carrying these loans as a result of any change in law, subject, in most cases, to obligations of the lenders to take certain limited steps to mitigate the requirement for, or the amount of, such increased costs. At December 31, 2024, the Company had $\n8.5\n billion of floating rate debt with remaining terms of up to approximately \n12\n years that are subject to these increased cost provisions. In several financing transactions involving loans from non-U.S. entities, with remaining terms of up to approximately \n12\n years and an aggregate balance of $\n5.3\n billion, the Company bears the risk of any change in tax laws that would subject loan payments thereunder to non-U.S. entities to withholding taxes, subject to customary exclusions.\nFuel Consortia. \nUnited participates in numerous fuel consortia with other air carriers at major airports to reduce the costs of fuel distribution and storage. Interline agreements govern the rights and responsibilities of the consortia members and provide for the allocation of the overall costs to operate the consortia based on usage. The consortia (and in limited cases, the participating carriers) have entered into long-term agreements to lease certain airport fuel storage and distribution facilities that are typically financed through various debt obligations. In general, each consortium lease agreement requires the consortium to make lease payments in amounts sufficient to pay the maturing principal and interest payments on these debt obligations. As of December 31, 2024, approximately $\n2.7\n billion principal amount of such loans was secured by significant fuel facility leases in which United participates, as to which United and each of the signatory airlines has provided indirect guarantees of the debt. As of December 31, 2024, the Company's contingent exposure was approximately $\n504\n million principal amount of such obligations based on its recent consortia participation. The Company's contingent exposure could increase if the participation of other air carriers decreases. The guarantees will expire when these obligations are paid in full, which ranges from 2027 to 2056. The Company concluded it was not necessary to record a liability for these indirect guarantees.\nCredit Card Processing Agreements. \nThe Company has agreements with financial institutions that process customer credit card transactions for the sale of air travel and other services. Under certain of the Company's credit card processing agreements, the financial institutions in certain circumstances have the right to require that the Company maintain a reserve equal to a portion of advance ticket sales that has been processed by that financial institution, but for which the Company has not yet provided the air transportation. Such financial institutions may require additional cash or other collateral reserves to be established or additional withholding of payments related to receivables collected if the Company does not maintain certain minimum levels of unrestricted cash, cash equivalents and short-term investments (collectively, \"Unrestricted Liquidity\"). The Company's current level of Unrestricted Liquidity is substantially in excess of these minimum levels.\nLabor Negotiations.\n As of December 31, 2024, United, including its subsidiaries, had approximately \n107,300\n employees. Approximately \n82\n% of United's employees were represented by various U.S. labor organizations.\n88\nTable of Contents\nNOTE 13 - \nSPECIAL CHARGES\nFor the years ended December 31, operating and nonoperating special charges and unrealized (gains) losses on investments in the statements of consolidated operations consisted of the following (in millions):\n2024\n2023\n2022\n(Gains) losses on sale of assets and other special charges\n$\n112\n \n$\n135\n \n$\n140\n \nLabor contract ratification bonuses\n—\n \n814\n \n—\n \nTotal operating special charges\n112\n \n949\n \n140\n \nNonoperating unrealized (gains) losses on investments, net\n199\n \n(\n27\n)\n(\n20\n)\nNonoperating debt extinguishment and modification fees\n128\n \n11\n \n7\n \nTotal nonoperating special charges and unrealized (gains) losses on investments, net\n327\n \n(\n16\n)\n(\n13\n)\nTotal operating and nonoperating special charges and unrealized (gains) losses on investments, net\n439\n \n933\n \n127\n \nIncome tax benefit, net of valuation allowance\n(\n54\n)\n(\n214\n)\n(\n33\n)\nTotal operating and nonoperating special charges and unrealized (gains) losses on investments, net of income taxes\n$\n385\n \n$\n719\n \n$\n94\n \nOperating and nonoperating special charges and unrealized (gains) losses on investments included the following: \nDuring 2024, the Company recorded $\n128\n million of charges related to the prepayment in full of the outstanding principal balance of the MileagePlus Term Loan in July 2024, the refinancing of its 2021 term loans in February 2024 and a partial prepayment of the 2024 Term Loans.\nDuring 2023, the Company recorded $\n814\n million of expense associated with the agreements with its employees represented by the Air Line Pilots Association, the International Association of Machinists and Aerospace Workers and other labor unions.\n89\nTable of Contents\nITEM 9.    CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone.\nITEM 9A.    CONTROLS AND PROCEDURES\nEvaluation of Disclosure Control and Procedures\nUAL and United each maintain controls and procedures that are designed to ensure that information required to be disclosed in the reports filed or submitted by UAL and United to the SEC is recorded, processed, summarized and reported, within the time periods specified by the SEC's rules and forms, and is accumulated and communicated to management including the Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. The management of UAL and United, including the Chief Executive Officer and Chief Financial Officer, performed an evaluation to conclude with reasonable assurance that UAL's and United's disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act were designed and operating effectively to report the information each company is required to disclose in the reports they file with the SEC on a timely basis. Based on that evaluation, the Chief Executive Officer and the Chief Financial Officer of UAL and United have concluded that as of December 31, 2024, disclosure controls and procedures were effective. \nManagement's Reports on Internal Control Over Financial Reporting\nUAL and United Management's Reports on Internal Control Over Financial Reporting are included herein.\nErnst & Young LLP, an independent registered public accounting firm, has audited the Company's financial statements included in this Form 10-K and issued its report on the effectiveness of the Company's internal control over financial reporting as of December 31, 2024, which is included herein.\nChanges in Internal Control over Financial Reporting during the Quarter Ended December 31, 2024 \nDuring the three months ended December 31, 2024, there was no change in UAL's or United's internal control over financial reporting that materially affected, or is reasonably likely to materially affect, their internal control over financial reporting. \n90\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of United Airlines Holdings, Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited United Airlines Holdings, Inc.'s (the \"Company\") internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the \"COSO criteria\"). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (\"PCAOB\"), the 2024 consolidated financial statements and our report dated February 27, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company's management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management's Reports on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company's internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ \nErnst & Young LLP\nChicago, Illinois\nFebruary 27, 2025 \nUnited Airlines Holdings, Inc. Management Report on Internal Control Over Financial Reporting \n91\nTable of Contents\nFebruary 27, 2025 \nTo the Stockholders of United Airlines Holdings, Inc. \nChicago, Illinois \nThe management of United Airlines Holdings, Inc. (\"UAL\") is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Because of its inherent limitations, our internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision and with the participation of management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the design and operating effectiveness of our internal control over financial reporting as of December 31, 2024. In making this assessment, management used the framework set forth in Internal Control—Integrated Framework (2013 Framework)\n \nissued by the Committee of the Sponsoring Organizations of the Treadway Commission. Based on this evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our internal control over financial reporting was effective as of December 31, 2024.\nOur independent registered public accounting firm, Ernst & Young LLP, who audited UAL's consolidated financial statements included in this Form 10-K, has issued a report on UAL's internal control over financial reporting, which is included herein.\nUnited Airlines, Inc. Management Report on Internal Control Over Financial Reporting \nFebruary 27, 2025\nTo the Stockholder of United Airlines, Inc. \nChicago, Illinois \nThe management of United Airlines, Inc. (\"United\") is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). United's internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Because of its inherent limitations, United's internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision and with the participation of management, including United's Chief Executive Officer and Chief Financial Officer, United conducted an evaluation of the design and operating effectiveness of its internal control over financial reporting as of December 31, 2024. In making this assessment, management used the framework set forth in Internal Control—Integrated Framework (2013 Framework) issued by the Committee of the Sponsoring Organizations of the Treadway Commission. Based on this evaluation, United's Chief Executive Officer and Chief Financial Officer concluded that its internal control over financial reporting was effective as of December 31, 2024.\nThis annual report does not include an attestation report of United's registered public accounting firm regarding internal control over financial reporting. Management's report was not subject to attestation by United's registered public accounting firm pursuant to the rules of the Securities and Exchange Commission that permit United to provide only management's report in this annual report.\n92\nTable of Contents\nITEM 9B.    OTHER INFORMATION.\n(a)\nNone.\n(b)\nDuring the three months ended December 31, 2024, no director or \"officer\" (as defined in Rule 16a-1(f) under the Exchange Act) of the Company or United informed the Company or United of the \nadoption\n, modification or \ntermination\n of a \"Rule 10b5-1 trading arrangement\" or a \"non-Rule 10b5-1 trading arrangement,\" as each term is defined in Item 408(a) of Regulation S-K under the Exchange Act.\nITEM 9C.    DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III\nITEM 10.    DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nReference is made to the 2025 Proxy Statement with respect to information about UAL's directors under the principal heading \"Item 1 – Election of Directors\", including under the subheadings \"Director Biographical information\" and \"Director Qualifications\", and information about UAL's corporate governance under the subheadings \"Board Selection and Election\" and \"How the Board is Organized\" under the principal heading \"Board and Corporate Governance Matters\" in the 2025 Proxy Statement, which is incorporated herein by reference and made a part hereof in response to the information required by Item 10 with respect to UAL.\nThe information required by Item 10 with respect to UAL's and United's executive officers has been included in Part I of this Form 10-K under the caption \"Information about Our Executive Officers\" and is incorporated herein by reference and made a part hereof in response to the information required by Item 10 with respect to UAL.\nReference is made to information with respect to UAL's non-compliance with Section 16(a) of the Exchange Act, if applicable, under the subheading \"Delinquent Section 16(a) Reports\" under the principal heading \"Securities Ownership\" in the 2025 Proxy Statement, which is incorporated herein by reference and made a part hereof in response to the information required by Item 10 with respect to UAL.\nCode of Ethics.\n The Company has a code of ethics, the \"Code of Ethics and Business Conduct,\" for its directors, officers and employees. The code serves as a \"Code of Ethics\" as defined by SEC regulations, and as a \"Code of Conduct\" under Nasdaq Listing Rule 5610. The code is available on the Company's investor relations website at ir.united.com. Waivers granted to certain officers from compliance with or future amendments to the code will be disclosed on the Company's investor relations website in accordance with Item 5.05 of Form 8-K.\nInsider Trading Policy\n. The Company has \nadopted an insider trading policy\n that governs the purchase, sale and any other dispositions of the Company’s securities by the Company’s directors, officers and employees and by UAL itself. The Company believes that this policy is reasonably designed to promote compliance with insider trading laws, rules and regulations, as well as the Nasdaq listing standards. A copy of the United Airlines Holdings, Inc. Securities Trading Policy is filed as Exhibit 19.1 to this report.\nInformation required by this item with respect to United is omitted pursuant to General Instruction I(2)(c) of Form 10-K.\nITEM 11.    EXECUTIVE COMPENSATION.\nReference is made to the 2025 Proxy Statement with respect to information about UAL's executive and director compensation and certain related matters, which is incorporated herein by reference and made a part hereof in response to the information required by Item 11 with respect to UAL.\nInformation required by this item with respect to United is omitted pursuant to General Instruction I(2)(c) of Form 10-K.\n \nITEM 12.    SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nReference is made to the 2025 Proxy Statement with respect to the security ownership of certain beneficial owners and management and certain equity compensation plan information, which is incorporated herein by reference and made a part hereof in response to the information required by Item 12 with respect to UAL.\nInformation required by this item with respect to United is omitted pursuant to General Instruction I(2)(c) of Form 10-K.\n93\nTable of Contents\nITEM 13.     CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nReference is made to the 2025 Proxy Statement with respect to information about certain relationships and related transactions and director independence, which is incorporated herein by reference and made a part hereof in response to the information required by Item 13 with respect to UAL.\nInformation required by this item with respect to United is omitted pursuant to General Instruction I(2)(c) of Form 10-K.\nITEM 14.    PRINCIPAL ACCOUNTANT FEES AND SERVICES. \nThe Audit Committee has adopted a policy on pre-approval of services of the Company's independent registered public accounting firm. As a wholly-owned subsidiary of UAL, United's audit services are determined by UAL. The policy provides that the Audit Committee shall pre-approve all audit and non-audit services to be provided to UAL and its subsidiaries and affiliates by its independent auditors. The process by which this is carried out is as follows: \nFor recurring services, the Audit Committee reviews and pre-approves the independent registered public accounting firm's annual audit services in conjunction with the annual appointment of the outside auditors. The reviewed materials include a description of the services along with related fees. The Audit Committee also reviews and pre-approves other classes of recurring services along with fee thresholds for pre-approved services. In the event that the additional services are required prior to the next scheduled Audit Committee meeting, pre-approvals of additional services follow the process described below. \nAny requests for audit, audit-related, tax and other services not contemplated with the recurring services approval described above must be submitted to the Audit Committee for specific pre-approval and services cannot commence until such approval has been granted. Normally, pre-approval is provided at regularly scheduled meetings. However, the authority to grant specific preapproval between meetings, as necessary, has been delegated to the Chair of the Audit Committee. The Chair must update the Audit Committee at the next regularly scheduled meeting of any services that were granted specific pre-approval.\nOn a periodic basis, the Audit Committee reviews the status of services and fees incurred year-to-date and a list of newly pre-approved services since its last regularly scheduled meeting. The Audit Committee has considered whether the 2024 and 2023 non-audit services provided by Ernst & Young LLP, the Company's independent registered public accounting firm, are compatible with maintaining auditor independence and concluded that such services were compatible with maintaining Ernst & Young LLP's independence. \nAll of the services in 2024 and 2023 under the Audit Fees, Audit Related Fees, Tax Fees and All Other Fees categories below have been approved by the Audit Committee pursuant to paragraph (c)(7) of Rule 2-01 of Regulation S-X of the Exchange Act.\nThe aggregate fees billed for professional services rendered by the Company's independent auditors in 2024 and 2023 are as follows (in thousands):\nService\n2024\n2023\nAudit Fees\n$\n4,768 \n$\n4,467 \nTax Fees\n42 \n38 \nTotal Fees\n$\n4,810 \n$\n4,505 \nAudit Fees.\n For 2024 and 2023, audit fees consist primarily of the audit and quarterly reviews of the consolidated financial statements and the audit of the effectiveness of internal control over financial reporting of the Company and its wholly-owned subsidiaries. Audit fees also include the audit of the consolidated financial statements of United Airlines, attestation services required by statute or regulation, comfort letters, consents, assistance with and review of documents filed with the SEC, and accounting and financial reporting consultations and research work necessary to comply with generally accepted auditing standards.\nTax Fees.\n Tax fees for 2024 and 2023 relate to professional services provided for research and consultations regarding tax accounting and tax compliance matters and review of U.S. and international tax impacts of certain transactions, exclusive of tax services rendered in connection with the audit.\n94\nTable of Contents\nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES.\n(a)\nList of documents filed as part of this report:\n(1)\nFinancial Statements\n. The financial statements required by this item are listed in Part II, Item 8, \nFinancial Statements and Supplementary Data\n herein.\n(2)\nFinancial Statement Schedules.\n Financial statement schedules are not included herein as they are not applicable, not required or the required information is shown in the consolidated financial statements or notes thereto.\n(b)\nExhibits.\n The exhibits required by this item are provided in the Exhibit Index.\nITEM 16. FORM 10-K SUMMARY.\nNone.\nEXHIBIT INDEX\nExhibit No.\nRegistrant\nExhibit\nArticles of Incorporation and Bylaws\n3.1\nUAL\nAmended and Restated Certificate of Incorporation of United Airlines Holdings, Inc. (filed as Exhibit 3.1 to UAL's Form 8-K filed June 27, 2019 and incorporated herein by reference)\n3.2\nUAL\nAmended and Restated Bylaws of United Airlines Holdings, Inc. (filed as Exhibit 3.1 to UAL's Form 8-K filed December 1\n8\n, 2024 and incorporated herein by reference)\n3.3\nUAL\nCertificate of Designation of the Series A Junior Participating Serial Preferred Stock of United Airlines Holdings, Inc. (filed as Exhibit 3.1 to UAL's Registration Statement on Form 8-A filed December 7, 2020 and incorporated herein by reference)\n3.4\nUnited\nAmended and Restated Certificate of Incorporation of United Airlines, Inc. (filed as Exhibit 3.1 to UAL's Form 8-K filed April 3, 2013 and incorporated herein by reference)\n3.5\nUnited\nAmended and Restated By-laws of United Airlines, Inc. (filed as Exhibit 3.2 to UAL's Form 8-K filed April 3, 2013 and incorporated herein by reference)\nInstruments Defining Rights of Security Holders, Including Indentures\n4.1\nUAL\nUnited\nIndenture, dated as of May 7, 2013, among United Continental Holdings, Inc., United Airlines, Inc. and The Bank of New York Mellon Trust Company, N.A., as Trustee (filed as Exhibit 4.1 to UAL's Form 8-K filed on May 10, 2013 and incorporated herein by reference)\n4.2\nUAL\nUnited\nThird Supplemental Indenture, dated as of January 26, 2017, among United Continental Holdings, Inc., United Airlines, Inc. and The Bank of New York Mellon Trust Company, N.A., as Trustee, providing for the issuance of 5.000% Senior Notes due 2024 (filed as Exhibit 4.2 to UAL's Form 8-K filed January 27, 2017 and incorporated herein by reference)\n4.3\nUAL\nUnited\nForm of 5.000% Senior Notes due 2024 (filed as Exhibit A to Exhibit 4.2 to UAL's Form 8-K filed January 27, 2017 and incorporated herein by reference)\n4.4\nUAL\nUnited\nForm of Notation of Note Guarantee (filed as Exhibit B to Exhibit 4.2 to UAL's Form 8-K filed January 27, 2017 and incorporated herein by reference)\n95\nTable of Contents\n4.5\nUAL\nUnited\nFourth Supplemental Indenture, dated as of September 29, 2017, among United Continental Holdings, Inc., United Airlines, Inc. and The Bank of New York Mellon Trust Company, N.A., as Trustee, providing for the issuance of 4.250% Senior Notes due 2022 (filed as Exhibit 4.2 to UAL's Form 8-K filed October 4, 2017 and incorporated herein by reference)\n4.6\nUAL\nUnited\nForm of 4.250% Senior Notes due 2022 (filed as Exhibit A to Exhibit 4.2 to UAL's Form 8-K filed October 4, 2017 and incorporated herein by reference)\n4.7\nUAL\nUnited\nForm of Notation of Note Guarantee (filed as Exhibit B to Exhibit 4.2 to UAL's Form 8-K filed October 4, 2017 and incorporated herein by reference)\n4.8\nUAL\nUnited\nFifth Supplemental Indenture, dated as of May 9, 2019, among United Continental Holdings, Inc., United Airlines, Inc. and The Bank of New York Mellon Trust Company, N.A., as Trustee (filed as Exhibit 4.2 to UAL's Form 8-K filed May 10, 2019 and incorporated herein by reference)\n4.9\nUAL\nUnited\nForm of 4.875% Senior Notes due 2025 (filed as Exhibit A to Exhibit 4.2 to UAL's Form 8-K filed May 10, 2019 and incorporated herein by reference)\n4.10\nUAL\nUnited\nForm of Notation of Note Guarantee (filed as Exhibit B to Exhibit 4.2 to UAL's Form 8-K filed May 10, 2019 and incorporated herein by reference)\n4.11\nUAL\nUnited\nPromissory Note, dated as of April 20, 2020, among United Airlines Holdings, Inc., United Airlines, Inc., as guarantor, and the United States Department of the Treasury (filed as Exhibit 4.1 to UAL's Form 8-K filed April 23, 2020 and incorporated herein by reference)\n4.12\nUAL\nWarrant Agreement (including Form of Warrant), dated as of April 20, 2020, between United Airlines Holdings, Inc. and the United States Department of the Treasury (filed as Exhibit 4.2 to UAL's Form 8-K filed April 23, 2020 and incorporated herein by reference)\n4.13\nUAL\nUnited\nIndenture (including Form of 6.50% Senior Secured Notes due 2027), dated as of July 2, 2020, by and among Mileage Plus Holdings, LLC, Mileage Plus Intellectual Property Assets, Ltd., the guarantors named therein and Wilmington Trust, National Association, as trustee and collateral custodian, governing the 6.50% Senior Secured Notes due 2027 (filed as Exhibit 4.1 to UAL's Form 8-K filed July 2, 2020 and incorporated herein by reference)\n4.14\nUAL\nUnited\nWarrant Agreement, dated as of September 28, 2020, between United Airlines Holdings, Inc. and The United States Department of the Treasury (filed as Exhibit 4.1 to UAL's Form 8-K filed September 30, 2020 and incorporated herein by reference)\n4.15\nUAL\nForm of Warrant (filed as Exhibit 4.2 to UAL's Form 8-K filed September 30, 2020 and incorporated herein by reference)\n4.16\nUAL\nUnited\nPromissory Note, dated as of January 15, 2021, among United Airlines Holdings, Inc., United Airlines, Inc., as guarantor, and the United States Department of the Treasury (filed as Exhibit 4.1 to UAL's Form 8-K filed January 20, 2021 and incorporated herein by reference)\n4.17\nUAL\nWarrant Agreement, dated as of January 15, 2021, between United Airlines Holdings, Inc. and the United States Department of the Treasury (filed as Exhibit 4.2 to UAL's Form 8-K filed January 20, 2021 and incorporated herein by reference)\n4.18\nUAL\nForm of Warrant (filed as Annex B to Exhibit 4.2 to UAL's Form 8-K filed January 20, 2021 and incorporated herein by reference)\n96\nTable of Contents\n4.19\nUAL\nUnited\nIndenture, dated as of April 21, 2021, among United Airlines, Inc., United Airlines Holdings, Inc. and Wilmington Trust, National Association, as trustee and as collateral trustee (filed as Exhibit 4.1 to UAL's Form 8-K filed April 22, 2021 and incorporated herein by reference)\n4.20\nUAL\nUnited\nForm of 4.375% Senior Secured Notes due 2026 (filed as Exhibit A to Exhibit 4.1 to UAL's Form 8-K filed April 22, 2021 and incorporated herein by reference)\n4.21\nUAL\nUnited\nForm of Notation of Guarantee (filed as Exhibit E to Exhibit 4.1 to UAL's Form 8-K filed April 22, 2021 and incorporated herein by reference)\n4.22\nUAL\nUnited\nForm of 4.625% Senior Secured Notes due 2029 (filed as Exhibit A to Exhibit 4.1 to UAL's Form 8-K filed April 22, 2021 and incorporated herein by reference)\n4.23\nUAL\nUnited\nForm of Notation of Guarantee (filed as Exhibit E to Exhibit 4.1 to UAL's Form 8-K filed April 22, 2021 and incorporated herein by reference)\n4.24\nUAL\nUnited\nPromissory Note, dated as of April 29, 2021, among United Airlines Holdings, Inc., United Airlines, Inc., as guarantor, and the United States Department of the Treasury (filed as Exhibit 4.1 to UAL's Form 8-K filed April 30, 2021 and incorporated herein by reference)\n4.25\nUAL\nWarrant Agreement, dated as of April 29, 2021, between United Airlines Holdings, Inc. and the United States Department of the Treasury (filed as Exhibit 4.2 to UAL's Form 8-K filed April 30, 2021 and incorporated herein by reference)\n4.26\nUAL\nForm of Warrant (filed as Annex B to Exhibit 4.2 to UAL's Form 8-K filed April 30, 2021 and incorporated herein by reference)\n4.27\nUAL\nTax Benefits Preservation Plan, dated as of December 4, 2020, by and between United Airlines Holdings, Inc. and Computershare Trust Company, N.A., as rights agent (which includes the Form of Rights Certificate as Exhibit B thereto) (filed as Exhibit 4.1 to UAL's Registration Statement on Form 8-A filed December 7, 2020 and incorporated herein by reference)\n4.28\nUAL\nAmendment No. 1 to Tax Benefits Preservation Plan, dated as of January 21, 2021, by and between United Airlines Holdings, Inc. and Computershare Trust Company, N.A\n., as rights agent\n (filed as Exhibit 4.18 to UAL's Form 10-K for the year ended December 31, 2020 and incorporated herein by reference)\n4.29\nUAL\nAmendment No. 2 to Tax Benefits Preservation Plan, dated as of December 4, 2023, by and between United Airlines Holdings, Inc. and Computershare Trust Company, N.A., as rights agent (\nfiled as\n Exhibit 4.3 to UAL\n'\ns Form 8-A/A filed on December 4, 2023 and incorporated herein by reference)\n4.30\nUAL\nAmendment No. 3 to Tax Benefits Preservation Plan, dated as of April 22, 2024, by and between United Airlines Holdings, Inc. and Computershare Trust Company, N.A., as rights agent (filed as Exhibit 4.4 to UAL\n'\ns Form 8-A/A filed on April 23, 2024 and incorporated herein by reference)\n4.31\nUAL\nUnited\nDescription of the Registrant's Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934\nMaterial Contracts\n97\nTable of Contents\n†10.1\nUAL\nAgreement, dated as of April 19, 2016, by and among PAR Capital Management, Inc., Altimeter Capital Management, LP, United Continental Holdings, Inc. and the other signatories listed on the signature page thereto (filed as Exhibit 10.1 to UAL's Form 8-K filed April 20, 2016 and incorporated herein by reference)\n†10.2\nUAL\nUnited Airlines Holdings, Inc. Profit Sharing Plan (amended and restated effective January 1, 2024)\n†10.3\nUAL\nUnited\nStock Option Award Notice, dated as of December 4, 2019, to J. Scott Kirby pursuant to the United Continental Holdings, Inc. 2017 Incentive Compensation Plan (filed as Exhibit 10.2 to UAL's Form 8-K filed December 6, 2019 and incorporated herein by reference)\n†10.4\nUAL\nForm of Stock Option Award Notice pursuant to the United Continental Holdings, Inc. 2008 Incentive Compensation Plan (filed as Exhibit 10.1 to UAL's Form 10-Q for the quarter ended September 30, 2016 and incorporated herein by reference)\n†10.5\nUAL\nUnited Continental Holdings, Inc. Officer Travel Policy (filed as Exhibit 10.24 to UAL's Form 10-K for the year ended December 31, 2010 and incorporated herein by reference)\n†10.6\nUAL\nUAL Corporation 2008 Incentive Compensation Plan (filed as Appendix A to UAL's Definitive Proxy Statement filed April 25, 2008 and incorporated herein by reference) (now named the United Continental Holdings, Inc. 2008 Incentive Compensation Plan)\n†10.7\nUAL\nFirst Amendment to the UAL Corporation 2008 Incentive Compensation Plan (changing the name to United Continental Holdings, Inc. 2008 Incentive Compensation Plan) (filed as Annex A to UAL's Definitive Proxy Statement filed April 26, 2013 and incorporated herein by reference)\n†10.8\nUAL\nSecond Amendment to the United Continental Holdings, Inc. 2008 Incentive Compensation Plan (filed as Exhibit 10.19 to UAL's Form 10-K for the year ended December 31, 2016 and incorporated herein by reference)\n†10.9\nUAL\nUnited Air Lines, Inc. Management Cash Direct & Cash Match Program (amended and restated effective January 1, 2016) (filed as Exhibit 10.28 to UAL's Form 10-K for the year ended December 31, 2018 and incorporated herein by reference)\n†10.10\nUAL\nUnited Continental Holdings, Inc. Executive Severance Plan (amended and restated effective December 6, 2023)\n†10.11\nUAL\nUnited Continental Holdings, Inc. 2017 Incentive Compensation Plan (filed as Exhibit 10.1 to UAL's Form 8-K filed May 30, 2017 and incorporated herein by reference)\n†10.12\nUAL\nForm of Restricted Stock Unit Award Notice pursuant to the United Continental Holdings, Inc. 2017 Incentive Compensation Plan (filed as Exhibit 10.6 to UAL's Form 10-Q for the quarter ended June 30, 2017 and incorporated herein by reference)\n†10.13\nUAL\nForm of Stock Option Award Notice pursuant to the United Continental Holdings, Inc. 2017 Incentive Compensation Plan (filed as Exhibit 10.7 to UAL's Form 10-Q for the quarter ended June 30, 2017 and incorporated herein by reference)\n†10.14\nUAL\nUnited Airlines Holdings, Inc. 2006 Director Equity Incentive Plan (as amended and restated, effective May 24, 2023) (filed as Exhibit 10.2 to UAL's Form 8-K filed May 30, 2023 and incorporated herein by reference)\n98\nTable of Contents\n†10.15\nUAL\nForm of Share Unit Award Notice pursuant to the United Continental Holdings, Inc. 2006 Director Equity Incentive Plan (for awards granted on or after June 2011) (filed as Exhibit 10.9 to UAL's Form 10-Q for the quarter ended June 30, 2014 and incorporated herein by reference)\n†10.16\nUAL\nUnited Airlines Holdings, Inc. Amended and Restated 2021 Incentive Compensation Plan (filed as Exhibit 10.1 to UAL's Form 8-K filed May 28, 2021 and incorporated herein by reference)\n†10.17\nUAL\nFirst Amendment to United Airlines Holdings, Inc. Amended and Restated 2021 Incentive Compensation Plan (filed as Exhibit 10.1 to UAL's Form 8-K filed May 30, 2023 and incorporated herein by reference)\n†10.18\nUAL\nSecond Amendment to the United Airlines Holdings, Inc. Amended and Restated 2021 Incentive Compensation Plan (filed as Exhibit 10.1 to UAL's Form 8-K filed May 29, 2024 and incorporated herein by reference)\n†10.19\nUAL\nForm of Restricted Stock Unit Award Notice pursuant to the 2021 Incentive Compensation Plan\n†10.20\nUAL\nForm of Performance-Based RSU Award Notice pursuant to the 2021 Incentive Compensation Plan\n†10.21\nUAL\nForm of Short-term Incentive Award Notice pursuant to the United Airlines Holdings, Inc. 2021 Incentive Compensation Plan (filed as Exhibit 10.1 to UAL's Form 10-Q for the quarter ended March 31, 2022 and incorporated herein by reference)\n†10.22\nUAL\nForm of Performance-Based RSU Award Notice pursuant to the United Airlines Holdings, Inc. 2021 Incentive Compensation Plan (filed as Exhibit 10.2 to UAL's Form 10-Q for the quarter ended March 31, 2022 and incorporated herein by reference)\n†10.23\nUAL\nForm of Cash Transformation Incentive Award Notice pursuant to the United Airlines Holdings, Inc. 2021 Incentive Compensation Plan\n†10.24\nUAL\nUnited\nForm of Retirement and Transition Agreement (filed as Exhibit 10.25 to UAL's Form 10-K for the year ended December 31, 2023 and incorporated herein by reference)\n^10.25\nUAL\nUnited\nAmended and Restated A350-900 Purchase Agreement, dated as of September 1, 2017, including letter agreements related thereto, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.1 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.26\nUAL\nUnited\nAmendment No. 1, dated as of July 18, 2019, to the Amended and Restated A350-900 Purchase Agreement, dated as of September 1, 2017, including letter agreements related thereto, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.1 to UAL's Form 10-Q for the quarter ended September 30, 2019 and incorporated herein by reference)\n^10.27\nUAL\nUnited\nAmendment No. 2, dated as of December 3, 2019, to the Amended and Restated A350-900 Purchase Agreement, dated as of September 1, 2017, including letter agreements related thereto, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.42 to UAL's Form 10-K for the year ended December 31, 2019 and incorporated herein by reference)\n^10.28\nUAL\nUnited\nAmendment No. 3, dated as of December 8, 2022, to the Amended and Restated A350-900 Purchase Agreement, dated as of September 1, 2017, including letter agreements related thereto, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.35 to UAL’s Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n99\nTable of Contents\n^10.29\nUAL\nUnited\nAmendment No. 4 to the Amended and Restated A350-900 Purchase Agreement between Airbus S.A.S. and United Airlines, Inc., effective as of September 29, 2023 (filed as Exhibit 10.36 to UAL’s Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.30\nUAL\nUnited\nAmendment No. 5, dated as of December 26, 2024, to the Amended and Restated A350-900 Purchase Agreement, dated as of September 1, 2017, including letter agreements related thereto, between Airbus S.A.S. and United Airlines, Inc\n.\n^10.31\nUAL\nUnited\nAircraft General Terms Agreement, dated as of October 10, 1997, by and among Continental Airlines, Inc. and The Boeing Company (filed as Exhibit 10.2 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.32\nUAL\nUnited\nPurchase Agreement No. PA-03776, dated as of July 12, 2012, between The Boeing Company and United Continental Holdings, Inc. (filed as Exhibit 10.3 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.33\nUAL\nUnited\nSupplemental Agreement No. 1 to Purchase Agreement No. 03776, dated as of June 17, 2013, between The Boeing Company and United Continental Holdings, Inc. (filed as Exhibit 10.4 to UAL's Form 10-Q for the quarter ended September 30, 2023\n \nand incorporated herein by reference)\n^10.34\nUAL\nUnited\nPurchase Agreement Assignment to Purchase Agreement No. 03776, dated as of October 23, 2013, between United Continental Holdings, Inc. and United Airlines, Inc. (filed as Exhibit 10.5 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.35\nUAL\nUnited\nSupplemental Agreement No. 2 to Purchase Agreement No. 03776, dated as of January 14, 2015, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.6 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.36\nUAL\nUnited\nSupplemental Agreement No. 3 to Purchase Agreement No. 03776, dated as of May 26, 2015, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.7 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.37\nUAL\nUnited\nSupplemental Agreement No. 4 to Purchase Agreement No. 03776, dated as of June 12, 2015, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.8 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.38\nUAL\nUnited\nSupplemental Agreement No. 5 to Purchase Agreement No. 03776, dated as of January 20, 2016, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.9 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.39\nUAL\nUnited\nSupplemental Agreement No. 6 to Purchase Agreement No. 03776, dated as of February 8, 2016, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.10 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.40\nUAL\nUnited\nSupplemental Agreement No. 7 to Purchase Agreement No. 03776, dated as of December 27, 2016, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.11 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.41\nUAL\nUnited\nSupplemental Agreement No. 8 to Purchase Agreement No. 03776, dated as of June 7, 2017, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.12 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n100\nTable of Contents\n^10.42\nUAL\nUnited\nSupplemental Agreement No. 9 to Purchase Agreement No. 03776, dated as of June 15, 2017, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.13 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.43\nUAL\nUnited\nSupplemental Agreement No. 10 to Purchase Agreement No. 03776, dated as of May 15, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.14 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.44\nUAL\nUnited\nSupplemental Agreement No. 11 to Purchase Agreement No. 03776, dated as of September 25, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.15 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.45\nUAL\nUnited\nSupplemental Agreement No. 12 to Purchase Agreement No. 03776, dated as of December 12, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.16 to UAL's Form 10-Q for the year ended September 30, 2023 and incorporated herein by reference)\n^10.46\nUAL\nUnited\nSupplemental Agreement No. 13 to Purchase Agreement No. 03776, dated as of March 20, 2020, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.7 to UAL's Form 10-Q for the quarter ended March 31, 2020 and incorporated herein by reference)\n^10.47\nUAL\nUnited\nSupplemental Agreement No. 14 to Purchase Agreement No. 03776, dated as of June 30, 2020, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.5 to UAL's Form 10-Q for the quarter ended June 30, 2020 and incorporated herein by reference)\n^10.48\nUAL\nUnited\nSupplemental Agreement No. 15 to Purchase Agreement No. 03776, dated as of February 26, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.17 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.49\nUAL\nUnited\nSupplemental Agreement No. 16 to Purchase Agreement No. 03776, dated as of June 27, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.1 to UAL's Form 10-Q for the quarter ended June 30, 2021 and incorporated herein by reference)\n^10.50\nUAL\nUnited\nSupplemental Agreement No. 17 to Purchase Agreement No. 03776, dated as of August 12, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.1 to UAL's Form 10-Q for the quarter ended September 30, 2021 and incorporated herein by reference)\n^10.51\nUAL\nUnited\nSupplemental Agreement No. 18 to Purchase Agreement No. 03776, dated as of September 8, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.2 to UAL's Form 10-Q for the quarter ended September 30, 2021 and incorporated herein by reference)\n^10.52\nUAL\nUnited\nSupplemental Agreement No. 19 to Purchase Agreement No. 03776, dated as of November 30, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.53 to UAL's Form 10-K for the year ended December 31, 2021 and incorporated herein by reference)\n^10.53\nUAL\nUnited\nSupplemental Agreement No. 20 to Purchase Agreement No. 03776, dated as of June 30, 2022, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.1 to UAL's Form 10-Q for the quarter ended June 30, 2022 and incorporated herein by reference)\n^10.54\nUAL\nUnited\nSupplemental Agreement No. 21 to Purchase Agreement No. 03776, dated as of December 15, 2023, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.55 to UAL's Form 10-K for the year ended December 31, 2023 and incorporated herein by reference)\n^10.55\nUAL\nUnited\nLetter Agreement No. 6-1162-KKT-080R2, dated as of December 12, 2022, among The Boeing Company, United Airlines Holdings, Inc. and United Airlines, Inc. (filed as Exhibit 10.59 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n101\nTable of Contents\n^10.56\nUAL\nUnited\nPurchase Agreement No. 3860, dated as of September 27, 2012, between The Boeing Company and United Air Lines, Inc. (filed as Exhibit 10.18 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.57\nUAL\nUnited\nSupplemental Agreement No. 1 to Purchase Agreement No. 3860, dated June 17, 2013, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.19 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.58\nUAL\nUnited\nSupplemental Agreement No. 2 to Purchase Agreement No. 3860, dated December 16, 2013, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.20 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.59\nUAL\nUnited\nSupplemental Agreement No. 3 to Purchase Agreement No. 3860, dated as of July 22, 2014, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.21 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.60\nUAL\nUnited\nSupplemental Agreement No. 4 to Purchase Agreement No. 3860, dated as of January 14, 2015, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.22 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.61\nUAL\nUnited\nSupplemental Agreement No. 5 to Purchase Agreement No. 3860, dated as of April 30, 2015, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.23 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.62\nUAL\nUnited\nSupplemental Agreement No. 6 to Purchase Agreement No. 3860, dated as of December 31, 2015, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.24 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.63\nUAL\nUnited\nSupplemental Agreement No. 7 to Purchase Agreement No. 3860, dated as of March 7, 2016, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.25 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.64\nUAL\nUnited\nLetter Agreement to Purchase Agreement No. 3860, dated as of May 5, 2016, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.26 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.65\nUAL\nUnited\nSupplemental Agreement No. 8, including exhibits and side letters, to Purchase Agreement No. 3860, dated as of June 15, 2017, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.27 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.66\nUAL\nUnited\nLetter Agreement No. UAL-LA-1604287 to Purchase Agreement Nos. 3776, 3784 and 3860, dated December 27, 2016, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.28 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.67\nUAL\nUnited\nSupplemental Agreement No. 9 to Purchase Agreement No. 3860, dated as of May 31, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.29 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.68\nUAL\nUnited\nSupplemental Agreement No. 10 to Purchase Agreement No. 3860, dated as of November 1, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.30 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.69\nUAL\nUnited\nSupplemental Agreement No. 11 to Purchase Agreement No. 3860, dated as of December 12, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.31 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n102\nTable of Contents\n^10.70\nUAL\nUnited\nSupplemental Agreement No. 12 to Purchase Agreement No. 3860, dated as of February 26, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.32 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.71\nUAL\nUnited\nA320 Family Purchase Agreement, dated as of December 3, 2019, between Airbus S.A.S. and United Airlines, Inc. including letter agreements related thereto, and subsequent letter agreements related thereto dated February 20, 2020 (filed as Exhibit 10.2 to UAL's Form 10-Q for the quarter ended June 30, 2021 and incorporated herein by reference)\n^10.72\nUAL\nUnited\nAmendment No. 1 to the A320 Family Purchase Agreement, dated as of December 3, 2020, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.3 to UAL's Form 10-Q for the quarter ended June 30, 2021 and incorporated herein by reference)\n^10.73\nUAL\nUnited\nAmendment No. 2 to the A320 Family Purchase Agreement, dated as of June 27, 2021, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.4 to UAL's Form 10-Q for the quarter ended June 30, 2021 and incorporated herein by reference)\n^10.74\nUAL\nUnited\nAmendment No. 3 to the A320 Family Purchase Agreement, dated as of October 29, 2021, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.73 to UAL's Form 10-K for the year ended December 31, 2021 and incorporated herein by reference)\n^10.75\nUAL\nUnited\nAmendment No. 4 to the A320 Family Purchase Agreement, dated as of July 1, 2022, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.76 to UAL's Form 10-K for the year ended December 31, 2023 and incorporated herein by reference)\n \n^10.76\nUAL\nUnited\nAmendment No. 5 to the A320 Family Purchase Agreement, effective as of September 30, 2023, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.37 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.77\nUAL\nUnited\nAmendment No. 6 to the A320 Family Purchase Agreement, dated as of July 16, 2024, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.1 to UAL's Form 10-Q for the quarter ended September 30, 2024 and incorporated herein by reference)\n^10.78\nUAL\nUnited\nAmended and Restated Letter Agreement No. 2, dated as of July 1, 2022, between Airbus S.A.S. and United Airlines, Inc. (filed as Exhibit 10.78 to UAL's Form 10-K for the year ended December 31, 2023 and incorporated herein by reference)\n \n^10.79\nUAL\nUnited\nPurchase Agreement No. 04761, dated as of May 15, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.5 to UAL's Form 10-Q for the quarter ended June 30, 2021 and incorporated herein by reference)\n^10.80\nUAL\nUnited\nSupplemental Agreement No. 1 to Purchase Agreement No. 04761, dated as of September 25, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.6 to UAL's Form 10-Q for the quarter ended June 30, 2021 and incorporated herein by reference)\n^10.81\nUAL\nUnited\nSupplemental Agreement No. 2 to Purchase Agreement No. 04761, dated as of December 12, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.7 to UAL's Form 10-Q for the quarter ended June 30, 2021 and incorporated herein by reference)\n^10.82\nUAL\nUnited\nSupplemental Agreement No. 3 to Purchase Agreement No. 04761, dated as of March 20, 2020, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.8 to UAL's Form 10-Q for the quarter ended June 30, 2021 and incorporated herein by reference)\n^10.83\nUAL\nUnited\nSupplemental Agreement No. 4 to Purchase Agreement No. 04761, dated as of June 30, 2020, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.9 to UAL's Form 10-Q for the quarter ended June 30, 2021 and incorporated herein by reference)\n103\nTable of Contents\n^10.84\nUAL\nUnited\nSupplemental Agreement No. 5 to Purchase Agreement No. 04761, dated as of February 26, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.33 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.85\nUAL\nUnited\nSupplemental Agreement No. 6 to Purchase Agreement No. 04761, dated as of June 27, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.11 to UAL's Form 10-Q for the quarter ended June 30, 2021 and incorporated herein by reference)\n^10.86\nUAL\nUnited\nSupplemental Agreement No. 7 to Purchase Agreement No. 04761, dated as of August 12, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.3 to UAL's Form 10-Q for the quarter ended September 30, 2021 and incorporated herein by reference)\n^10.87\nUAL\nUnited\nSupplemental Agreement No. 8 to Purchase Agreement No. 04761, dated as of September 8, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.4 to UAL's Form 10-Q for the quarter ended September 30, 2021 and incorporated herein by reference)\n^10.88\nUAL\nUnited\nSupplemental Agreement No. 9 to Purchase Agreement No. 04761, dated as of November 30, 2021, between The Boeing Company and United Airlines (filed as Exhibit 10.83 to UAL's Form 10-K for the year ended December 31, 2021 and incorporated herein by reference)\n^10.89\nUAL\nUnited\nSupplemental Agreement No. 10 to Purchase Agreement No. 04761, dated as of June 30, 2022, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.2 to UAL's Form 10-Q for the quarter ended June 30, 2022 and incorporated herein by reference)\n^10.90\nUAL\nUnited\nSupplemental Agreement No. 11 to Purchase Agreement Number 04761, dated as of November 29, 2022, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.90 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.91\nUAL\nUnited\nSupplemental Agreement No. 12 to Purchase Agreement No. 04761, dated as of December 12, 2022, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.91 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.92\nUAL\nUnited\nSupplemental Agreement No. 13 to Purchase Agreement No. 04761, dated as of December 15, 2023, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.92 to UAL's Form 10-K for the year ended December 31, 2023 and incorporated herein by reference)\n^10.93\nUAL\nUnited\nPurchase Agreement No. 04815, dated as of May 31, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.92 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.94\nUAL\nUnited\nSupplemental Agreement No. 1 to Purchase Agreement Number 04815, dated as of September 25, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.93 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.95\nUAL\nUnited\nSupplemental Agreement No. 2 to Purchase Agreement Number 04815, dated as of November 1, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.94 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.96\nUAL\nUnited\nSupplemental Agreement No. 3 to Purchase Agreement Number 04815, dated as of December 12, 2018, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.95 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.97\nUAL\nUnited\nSupplemental Agreement No. 4 to Purchase Agreement Number 04815, dated as of April 26, 2019, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.96 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n104\nTable of Contents\n^10.98\nUAL\nUnited\nSupplemental Agreement No. 5 to Purchase Agreement Number 04815, dated as of October 31, 2019, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.97 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.99\nUAL\nUnited\nSupplemental Agreement No. 6 to Purchase Agreement Number 04815, dated as of February 7, 2020, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.98 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.100\nUAL\nUnited\nSupplemental Agreement No. 7 to Purchase Agreement Number 04815, dated as of March 20, 2020, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.99 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.101\nUAL\nUnited\nSupplemental Agreement No. 8 to Purchase Agreement Number 04815, dated as of June 30, 2020, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.100 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.102\nUAL\nUnited\nSupplemental Agreement No. 9 to Purchase Agreement Number 04815, dated as of February 26, 2021, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.101 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.103\nUAL\nUnited\nSupplemental Agreement No. 10 to Purchase Agreement Number 04815, dated as of August 25, 2022, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.102 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.104\nUAL\nUnited\nSupplemental Agreement No. 11 to Purchase Agreement Number 04815, dated as of September 27, 2022, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.103 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.105\nUAL\nUnited\nSupplemental Agreement No. 12 to Purchase Agreement Number 04815, dated as of December 12, 2022, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.104 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.106\nUAL\nUnited\nSupplemental Agreement No. 13 to Purchase Agreement No. 04815, dated as of September 28, 2023, between The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.34 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.107\nUAL\nUnited\nSupplemental Agreement No. 14 to Purchase Agreement No. 04815, dated as of October 24, 2024, between The Boeing Company and United Airlines, Inc.\n^10.108\nUAL\nUnited\nUnited Letter Agreement No. 22004762, dated as of December 12, 2022, to Purchase Agreement No. 03860, dated as of June 15, 2017, and Purchase Agreement No. 04815, dated as of May 31, 2018, between the Boeing Company and United Airlines, Inc. (filed as Exhibit 10.105 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.109\nUAL\nUnited\nUnited Letter Agreement No. 22004729, dated as of December 12, 2022, to Purchase Agreement No. 03860, dated as of June 15, 2017, Purchase Agreement No. 04815, dated as of May 31, 2018, and Purchase Agreement No. 02484, dated as of December 29, 2004, among The Boeing Company and United Airlines, Inc. (filed as Exhibit 10.106 to UAL's Form 10-K for the year ended December 31, 2022 and incorporated herein by reference)\n^10.110\nUAL\nUnited\nLetter Agreement No. 22004729R1, dated as of September 28, 2023, between The Boeing Company and United Airlines, Inc. (related to Purchase Agreement Nos. 03860, 04815 and 02484) (filed as Exhibit 10.35 to UAL's Form 10-Q for the quarter ended September 30, 2023 and incorporated herein by reference)\n^10.111\nUAL\nUnited\nLetter Agreement No. UAL-NM-2404793, dated as of October 24, 2024, between The Boeing Company and United Airlines, Inc. (related to Purchase Agreement No. 04815)\n105\nTable of Contents\n^10.112\nUAL\nUnited\nAmended and Restated Credit and Guaranty Agreement, dated as of March 29, 2017, among United Airlines, Inc., as borrower, United Continental Holdings, Inc., as parent and a guarantor, the subsidiaries of United Continental Holdings, Inc. from time to time party thereto other than the borrower party thereto from time to time, as guarantors, the lenders from time to time party thereto and JPMorgan Chase Bank, N.A., as administrative agent (filed as Exhibit 10.1 to UAL's Form 8-K filed April 3, 2017 and incorporated herein by reference)\n10.113\nUAL\nUnited\nFirst Amendment, dated as of November 15, 2017, to Amended and Restated Credit Guaranty Agreement (filed as Exhibit 10.219 to UAL's Form 10-K for the year ended December 31, 2017 and incorporated herein by reference)\n10.114\nUAL\nUnited\nSecond Amendment, dated as of May 16, 2018, to Amended and Restated Credit Guaranty Agreement (filed as Exhibit 10.1 to UAL's Form 10-Q for the quarter ended June 30, 2018 and incorporated herein by reference)\n10.115\nUAL\nUnited\nIncrease Joinder to the Amended and Restated Revolving Credit and Guaranty Agreement, dated as of April 16, 2024, among United Airlines, Inc., United Airlines Holdings, Inc., the lenders party thereto, JPMorgan Chase Bank, N.A., as administrative agent, and Wilmington Trust, National Association, as collateral trustee (filed as Exhibit 10.4 to UAL's Form 10-Q for the quarter ended June 30, 2024 and incorporated herein by reference)\n10.116\nUAL\nUnited\nPayroll Support Program Agreement, dated as of April 20, 2020, between United Airlines, Inc. and the United States Department of the Treasury (filed as Exhibit 10.1 to UAL's Form 8-K filed April 23, 2020 and incorporated herein by reference)\n*10.117\nUAL\nUnited\nCredit Agreement, dated as of July 2, 2020, by and among Mileage Plus Holdings, LLC, Mileage Plus Intellectual Property Assets, Ltd., the guarantors named therein, the lenders named therein, the lead arrangers named therein, Goldman Sachs Bank USA, as administrative agent, and Wilmington Trust, National Association, as master collateral agent and collateral administrator (filed as Exhibit 10.1 to UAL's Form 8-K filed July 2, 2020 and incorporated herein by reference)\n10.118\nUAL\nUnited\nLoan and Guarantee Agreement, dated as of September 28, 2020, among United, as borrower, United Airlines Holdings, Inc., as parent and guarantor, the subsidiaries of United Airlines Holdings, Inc. other than United Airlines, Inc. party thereto from time to time, as guarantors, The United States Department of the Treasury, as lender, and The Bank of New York Mellon, as administrative agent and collateral agent (filed as Exhibit 10.1 to UAL's Form 8-K filed September 30, 2020 and incorporated herein by reference)\n*10.119\nUAL\nUnited\nRestatement Agreement, dated as of November 6, 2020, to that certain Loan and Guarantee Agreement, dated as of September 28, 2020, among United Airlines, Inc., United Airlines Holdings, Inc., the guarantors party thereto from time to time, The United States Department of the Treasury, as initial lender, and the Bank of New York Mellon, as administrative agent and collateral agent (and including the Loan and Guarantee Agreement dated as of September 28, 2020, and as amended and restated as of November 6, 2020, among United Airlines, Inc., as Borrower, the guarantors party thereto from time to time, The United States Department of the Treasury and The Bank of New York Mellon, as administrative agent) (filed as Exhibit 10.73 to UAL's Form 10-K for the year ended December 31, 2020 and incorporated herein by reference)\n10.120\nUAL\nUnited\nSecond Amendment to Loan and Guarantee Agreement, dated as of December 8, 2020, to the Loan and Guarantee Agreement, among United Airlines, Inc., United Airlines Holdings, Inc., the guarantors party thereto, the United State Department of the Treasury, as initial lender and a lender, and The Bank of New York Treasury, as administrative agent (filed as Exhibit 10.74 to UAL's Form 10-K for the year ended December 31, 2020 and incorporated herein by reference)\n10.121\nUAL\nUnited\nPayroll Support Program Extension Agreement, dated as of January 15, 2021, between United Airlines, Inc. and the United States Department of the Treasury (filed as Exhibit 10.1 to UAL's Form 8-K filed January 20, 2021 and incorporated herein by reference)\n106\nTable of Contents\n10.122\nUAL\nUnited\nTerm Loan Credit and Guaranty Agreement, dated as of April 21, 2021, among United Airlines, Inc., United Airlines Holdings, Inc., each of the several banks and other financial institutions or entities from time to time party thereto, as lenders, JPMorgan Chase Bank, N.A., as administrative agent, and Wilmington Trust, National Association, as collateral trustee (filed as Exhibit 10.1 to UAL's Form 8-K filed April 22, 2021 and incorporated herein by reference)\n10.123\nUAL\nUnited\nAmendment No. 2 to Term Loan Credit and Guaranty Agreement, dated as of February 22, 2024, among United Airlines, Inc., United Airlines Holdings, Inc., and JPMorgan Chase Bank, N.A., as fronting lender and replacement lender and as administrative agent (filed as Exhibit 10.2 to UAL's Form 8-K filed February 22, 2024 and incorporated herein by reference)\n10.124\nUAL\nUnited\nPayroll Support Program 3 Agreement, dated as of April 29, 2021, between United Airlines, Inc. and the United States Department of the Treasury (filed as Exhibit 10.1 to UAL's Form 8-K filed April 30, 2021 and incorporated herein by reference)\n10.125\nUAL\nUnited\nAmended and Restated Revolving Credit and Guaranty Agreement, dated as of February 15, 2024, among United Airlines, Inc., United Airlines Holdings, Inc., each of the several banks and other financial institutions or entities from time to time party thereto, as lenders, JPMorgan Chase Bank, N.A., as administrative agent, and Wilmington Trust, National Association, as collateral trustee (filed as Exhibit 10.1 to UAL's Form 8-K filed February 22, 2024 and incorporated herein by reference)\n^10.126\nUAL\nUnited\nLetter Agreement No. 2401454, dated as of April 14, 2024, between The Boeing Company and United Airlines, Inc. (related to Purchase Agreement Nos. 03776 and 04761) (filed as Exhibit 10.2 to UAL's Form 10-Q for the quarter ended June 30, 2024 and incorporated herein by reference)\n^10.127\nUAL\nUnited\nLetter Agreement No. 2401633, dated as of April 14, 2024, between The Boeing Company and United Airlines, Inc. (related to Purchase Agreement Nos. 03776 and 04761) (filed as Exhibit 10.3 to UAL's Form 10-Q for the quarter ended June 30, 2024 and incorporated herein by reference)\nInsider Trading Policies and Procedures\n19\nUAL\nUnited Airlines Holdings, Inc. Securities Trading Policy\nList of Subsidiaries\n21\nUAL\nUnited\nList of United Airlines Holdings, Inc. and United Airlines, Inc. Subsidiaries\nConsents of Experts and Counsel\n23.1\nUAL\nConsent of Independent Registered Public Accounting Firm (Ernst & Young LLP) for United Airlines Holdings, Inc.\n23.2\nUnited\nConsent of Independent Registered Public Accounting Firm (Ernst & Young LLP) for United Airlines, Inc.\nRule 13a-14(a)/15d-14(a) Certifications\n31.1\nUAL\nCertification of the Principal Executive Officer of United Airlines Holdings, Inc. pursuant to 15 U.S.C. 78m(a) or 78o(d) (Section 302 of the Sarbanes-Oxley Act of 2002)\n31.2\nUAL\nCertification of the Principal Financial Officer of United Airlines Holdings, Inc. pursuant to 15 U.S.C. 78m(a) or 78o(d) (Section 302 of the Sarbanes-Oxley Act of 2002)\n107\nTable of Contents\n31.3\nUnited\nCertification of the Principal Executive Officer of United Airlines, Inc. pursuant to 15 U.S.C. 78m(a) or 78o(d) (Section 302 of the Sarbanes-Oxley Act of 2002)\n31.4\nUnited\nCertification of the Principal Financial Officer of United Airlines, Inc. pursuant to 15 U.S.C. 78m(a) or 78o(d) (Section 302 of the Sarbanes-Oxley Act of 2002)\nSection 1350 Certifications\n32.1\nUAL\nCertification of the Chief Executive Officer and Chief Financial Officer of United Airlines Holdings, Inc. pursuant to 18 U.S.C. 1350 (Section 906 of the Sarbanes-Oxley Act of 2002)\n32.2\nUnited\nCertification of the Chief Executive Officer and Chief Financial Officer of United Airlines, Inc. pursuant to 18 U.S.C. 1350 (Section 906 of the Sarbanes-Oxley Act of 2002)\nPolicy Relating to Recovery of Erroneously Awarded Compensation\n97\nUAL\nUnited Airlines Holdings, Inc. Compensation Clawback Policy (filed as Exhibit 97.1 to UAL's Form 10-K for the year ended December 31, 2023 and incorporated herein by reference)\nInteractive Data File\n101\nUAL\nUnited\nThe following financial statements from the combined Annual Report of UAL and United on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL: (i) Statements of Consolidated Operations, (ii) Statements of Consolidated Comprehensive Income (Loss), (iii) Consolidated Balance Sheets, (iv) Statements of Consolidated Cash Flows, (v) Statements of Consolidated Stockholders' Equity (Deficit) and (vi) Combined Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags.\n104\nUAL\nUnited\nCover Page Interactive Data File - the cover page XBRL tags are embedded within the Inline XBRL document\n†    Indicates management contract or compensatory plan or arrangement. Pursuant to Item 601(b)(10), United is permitted to omit certain compensation-related exhibits from this report and therefore only UAL is identified as the registrant for purposes of those items.\n^    Portions of the referenced exhibit have been omitted pursuant to Item 601(b) of Regulation S-K.\n*    Exhibits and schedules have been omitted pursuant to Item 601(a)(5) of Regulation S-K and will be furnished on a supplemental basis to the Securities and Exchange Commission upon request.\n108\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, each registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \n \nUNITED AIRLINES HOLDINGS, INC.\nUNITED AIRLINES, INC.\n(Registrants)\nBy:\n/s/ Michael Leskinen\n \nMichael Leskinen\nExecutive Vice President and Chief Financial Officer\nDate:\nFebruary 27, 2025\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of United Airlines Holdings, Inc. and in the capacities and on the date indicated.\n \nSignature                     \nCapacity                         \n \n \n/s/ J. Scott Kirby\nChief Executive Officer, Director\nJ. Scott Kirby\n(Principal Executive Officer)\n \n \n/s/ Michael Leskinen\nExecutive Vice President and Chief Financial Officer\nMichael Leskinen\n(Principal Financial Officer)\n \n \n/s/ Brigitte Bokemeier\nVice President and Controller\nBrigitte Bokemeier\n(Principal Accounting Officer)\n \n \n/s/ Rosalind G. Brewer\nDirector\nRosalind G. Brewer\n/s/ Michelle Freyre\nDirector\nMichelle Freyre\n \n/s/ Matthew Friend\nDirector\nMatthew Friend\n/s/ Barney Harford\nDirector\nBarney Harford\n/s/ Michele J. Hooper\nDirector\nMichele J. Hooper\n \n/s/ Walter Isaacson\nDirector\nWalter Isaacson\n109\nTable of Contents\n/s/ Richard Johnsen\nDirector\nRichard Johnsen\n/s/ Brian Noyes\nDirector\nBrian Noyes\n/s/ Edward M. Philip\nDirector\nEdward M. Philip\n/s/ Edward L. Shapiro\nDirector\nEdward L. Shapiro\n \n/s/ Laysha Ward\nDirector\nLaysha Ward\n/s/ James M. Whitehurst\nDirector\nJames M. Whitehurst\n \nDate:\nFebruary 27, 2025\n110\nTable of Contents\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of United Airlines, Inc. and in the capacities and on the date indicated.\nSignature                     \nCapacity                         \n \n \n/s/ J. Scott Kirby\nChief Executive Officer, Director\nJ. Scott Kirby\n(Principal Executive Officer)\n \n \n/s/ Michael Leskinen\nExecutive Vice President and Chief Financial Officer, Director\nMichael Leskinen\n(Principal Financial Officer)\n \n \n/s/ Brigitte Bokemeier\nVice President and Controller\nBrigitte Bokemeier\n(Principal Accounting Officer)\n \n \n/s/ Brett J. Hart\nDirector\nBrett J. Hart\n \nDate:\nFebruary 27, 2025\n111"
  }
}