{
  "ticker": "UBER",
  "cik": "0001543151",
  "company_name": "Uber Technologies, Inc",
  "filing_date": "2025-02-14",
  "accession": "0001543151-25-000008",
  "primary_doc": "uber-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nOverview\nUber Technologies, Inc. (“Uber,” the “Company,” “we,” “our,” or “us”) is a technology platform that uses a massive network, leading technology, operational excellence and product expertise to power movement from point A to point B. We develop and operate proprietary technology applications supporting a variety of offerings on our platform (“platform(s)” or “Platform(s)”). We connect consumers (“Rider(s)”) with independent providers of ride services (“Mobility Driver(s)”) for ridesharing services, and connect Riders and other consumers (“Eater(s)”) with restaurants, grocers and other stores (collectively, “Merchants”) with delivery service providers (“Couriers”) for meal preparation, grocery and other delivery services. Riders and Eaters are collectively referred to as “end-user(s)” or “consumer(s).” Mobility Drivers and Couriers are collectively referred to as “Driver(s).” We also connect consumers with public transportation networks. We use this same network, technology, operational excellence and product expertise to connect shippers (“Shipper(s)”) with carriers (“Carrier(s)”) in the freight industry by providing Carriers with the ability to book a shipment, transportation management and other logistics services. Uber is also developing technologies designed to provide new solutions to solve everyday problems.\nOur technology is available in over 70 countries around the world, principally in the United States (“U.S.”) and Canada, Latin America, Europe (excluding Russia), the Middle East, Africa, and Asia Pacific (“APAC”, excluding China and Southeast Asia).\nOur Segments\nAs of December 31, 2024, we had three operating and reportable segments: Mobility, Delivery and Freight. Mobility, Delivery and Freight platform offerings each address large, fragmented markets.\nMobility\nOur Mobility offering connects consumers with a wide range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and more—helping customers go almost anywhere they need. We believe our global leadership position—and the vast amount of marketplace data that comes along with it—means that we have the best technical and data platform to innovate faster than other companies with similar products. \nWe believe our scale and global availability allows our Mobility segment to offer better consumer experiences to riders in a variety of vehicle types, providing consumers with higher reliability and Drivers with better earnings opportunities. Mobility also includes activity related to our financial partnerships products and advertising.\nDelivery\nOur Delivery offering allows consumers to search for and discover the best of local commerce—from restaurants to grocery, alcohol, convenience and other retailers—order a meal or other items, and either pick-up at the restaurant or have it delivered. We refer to the grocery, alcohol, convenience, and retail categories collectively as Grocery & Retail. After launching our Delivery app, Uber Eats, over nine years ago, we believe our Delivery offering increases consumer engagement with the Uber platform overall, which in turn results in broader reach for our Merchants who can attract Uber Eats consumers from Uber without increasing their own costs. For Drivers, we believe the Delivery offering leverages, and has expanded, our earner base by increasing utilization and earnings across the network. We also believe it attracts new Drivers to the platform who do not have access to Mobility-qualified vehicles. Over the last several years, our Delivery business has expanded to include Uber Direct, our white-label Delivery-as-a-Service offering to retailers and restaurants around the world, as well as advertising opportunities.\nFreight\nWe believe that Freight is revolutionizing the logistics industry. Freight powers a managed transportation and logistics network and connects Shippers and Carriers in a digital marketplace to move shipments while leveraging our proprietary technology, brand awareness, and experience revolutionizing industries. Freight provides an on-demand platform to automate and accelerate logistics transactions end-to-end while providing visibility and control of logistics networks. Freight connects Carriers with Shippers’ shipments available on our platform, and gives Carriers upfront, transparent pricing and the ability to book a shipment with the touch of a button. Freight serves Shippers ranging from small- and medium-sized businesses to global enterprises. By leveraging logistics solutions expertise and value-add solutions, Freight enables Shippers to create and tender shipments, secure capacity on demand with real-time pricing, and track those shipments from pickup to delivery. Freight operations are principally based in North America and Europe. We believe that all of these factors represent significant efficiency improvements over traditional transportation management and freight brokerage providers.\n4\nPlatform Synergies\nOur Platform\nThe foundation of our platform is our massive network, leading technology, operational excellence, and product expertise. Together, these elements power movement from point A to point B.\nMassive Network\nOur massive, efficient, and intelligent network consists of tens of millions of Drivers, consumers, Merchants, Shippers and Carriers, as well as underlying data, technology, and shared infrastructure. Our network becomes smarter with every trip. In more than 15,000 cities around the world (as of December 31, 2024), our network powers movement at the touch of a button for millions, and we hope eventually billions, of people.\nLeading Technology\nWe have built proprietary marketplace, routing, and payments technologies. Marketplace technologies are the core of our deep technology advantage and include demand prediction, matching and dispatching, and pricing technologies. Our technologies make it extremely efficient to launch new businesses and operationalize existing ones.\nOperational Excellence\nOur regional on-the-ground operations teams use their extensive market-specific knowledge to rapidly launch and scale products in cities, support Drivers, consumers, Merchants, Shippers, and Carriers, and build and enhance relationships with cities and regulators.\nProduct Expertise\nOur products are built with the expertise that allows us to set the standard for powering movement on-demand, provide platform users with a contextual, intuitive interface, continually evolve features and functionality, and deliver safety and trust.\nWe intend to continue to invest in new platform offerings that we believe will further strengthen our platform and existing offerings.\nWe believe that all of these synergies serve the customer experience, enabling us to attract new platform users and to deepen engagement with existing platform users. Both of these dynamics grow our network scale and liquidity, which further increases the value of our platform-to-platform users. For example, Delivery attracts new consumers to our network—for the three months ended December 31, 2024, approximately 61% of first-time Delivery consumers were new to our platform. Additionally, for the three months ended December 31, 2024, consumers who used both Mobility and Delivery generated 11.4 Trips per month on average, compared to 5.2 Trips per month on average for consumers who used a single offering in cities where both Mobility and Delivery were offered. We believe that these trends will improve as we further leverage the power of our platform.\nMembership\nWith our platform, we are making it even easier for our consumers to unlock convenience—Uber One is our single cross-platform membership program that brings together the best of Uber. Uber One members have access to discounts, special pricing, priority service, and exclusive perks across our rides, delivery and grocery and retail offerings. Uber One is available in over 30 countries. Our Eats Pass membership program continues to remain available in select cities as a subscription offering. Our membership programs are designed to make utilizing our suite of products a seamless and rewarding experience for our consumers. As of December 31, 2024, Uber One member base reached 30 million. \nAdvertising\nWe are also utilizing our data and scale to offer marketplace-centric advertising to connect merchants and brands with our platform network and unlocking cross-platform advertising formats. During October 2022, we officially launched Uber’s advertising division and introduced Uber Journey Ads, an engaging way for brands to connect with consumers throughout the entire ride process. We now offer a model that enables brands to partner with Uber on a variety of advertising options on the Uber and Uber Eats apps, and beyond, while connecting with consumers in brand-safe and captivating ways. We also provide comprehensive reporting and analysis, which helps brands fine-tune their understanding of consumers and create more impactful campaigns as they connect with consumers at relevant points throughout their journeys and transactions. We believe that our advertising further strengthens the power of our platform and will continue to do so as we onboard more advertisers.\nCompetitive Environment\nWe compete on a global basis in highly fragmented markets. We face significant competition in each of the mobility and delivery industries globally and in the logistics industry in the United States and Canada from existing, well-established, and low-cost alternatives, and in the future we expect to face competition from new market entrants given the low barriers to entry that characterize these industries. As we and our competitors introduce new products and offerings, and as existing products evolve, we expect to become subject to additional competition. While we work to expand globally and introduce new products and offerings across a range of industries, many of our competitors remain focused on a limited number of products or on a narrow geographic scope, allowing them to develop specialized expertise and employ resources in a more targeted manner than we do. The competition we face in each of our offerings includes:\n5\n•\nMobility\n. Our Mobility offering competes with personal vehicle ownership and usage, which accounts for the majority of passenger miles in the markets that we serve, and traditional transportation services, including taxicab companies and taxi-hailing services, livery and other car services. In addition, public transportation can be a superior substitute to our Mobility offering and in many cases, offers a faster and lower-cost travel option in many cities. We also compete with other ridesharing companies for Drivers and Riders, including Bolt, Didi, Grab, Lyft, and Ola.\n•\nDelivery\n. Our Delivery offering competes with numerous companies in the meal, grocery and other delivery space in various regions for drivers, consumers, and merchants, including DoorDash, Deliveroo, Glovo, Instacart, Gopuff, Rappi, iFood, Delivery Hero, Just Eat Takeaway, and Amazon. Our Delivery offering also competes with restaurants and other merchants, including those that offer their own delivery and/or take-away, meal kit delivery services, grocery delivery services, and traditional grocers.\n•\nFreight\n. Our Freight offering competes with global and North American freight brokers and managed transportation providers such as C.H. Robinson, Total Quality Logistics, RXO, XPO, Echo Global Logistics, DHL, and NEXT Trucking.\nGovernment Regulation\nWe operate in a particularly complex legal and regulatory environment. Our business is subject to a variety of U.S. federal, state, local and foreign laws, rules, and regulations, including those related to Internet activities, privacy, cybersecurity, data protection, intellectual property, competition, consumer protection, payments, labor and employment, transportation services, transportation network companies, licensing regulations and taxation. These laws and regulations are constantly evolving and may be interpreted, applied, created, or amended, in a manner that could harm our business. Examples of certain laws and regulations we are subject to are described below. For further discussion of risks relating to government regulation, see our risk factors, including the risk factors in the section titled “Legal and Regulatory Risks Related to Our Business” in Part I,",
    "item1a": "Item 1A of this Annual Report on Form 10-K.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable.",
    "item1c": "ITEM 1C. CYBERSECURITY\nSafeguarding our critical networks and the information that platform users share with us is vital to our business. One key way that Uber addresses this need is through its cybersecurity program, which includes a cybersecurity risk management program.\nUber’s \nChief Information Security Officer (“CISO”)\n is responsible for the cybersecurity program, which is coordinated and primarily executed by the global organization of engineers focused on risk management using the NIST Framework (Govern, Identify, Protect, Detect, Respond, and Recover) and activities such as automation, secure development, and advanced analytics and monitoring.\n \nThe CISO has served in such role since February 2021 and has more than 20+ years of engineering and/or cybersecurity experience, including previously as CISO and Deputy Chief Technology Officer at a Fortune 500 company.\nThe cybersecurity program is also supported by Uber’s Chief Privacy Officer and Associate General Counsel, Privacy & Cybersecurity (“CPO”), who has served in that role since August 2018. The CPO has over three decades of experience as a legal advisor to multinational corporations, including serving as Chief Privacy & Security Counsel for a Fortune 100 technology company prior to her role at Uber.\nThe cybersecurity program is supported by other members of Uber’s senior management team as well, including the Chief Legal Officer, Chief Architect Officer, and Global Data Protection Officer. Uber’s Board of Directors oversees the cybersecurity program through regular updates. \nThis cybersecurity program is a critical component of Uber’s enterprise risk management program, through which Uber reviews business, cybersecurity, information technology, privacy, legal, and geopolitical risks, among others. \nThe cybersecurity program is designed to assess, identify, and manage risks from cybersecurity threats.\nKey elements of this program include: \n•\nOversight and Governance.\n \nUber’s Board oversees the cybersecurity program, and Uber’s risk profile with respect to cybersecurity matters, through regular reports and reviews.\n \nThese include presentations by the \nCISO\n to the Board and Audit Committee on an alternating quarterly basis, quarterly reports of certain cybersecurity incidents to the Board, and annual reports by the CPO to the Board.\nThe CISO also provides quarterly updates to Uber’s senior management regarding cybersecurity risks, as well as interim updates during regular meetings with Uber’s engineering, product and internal audit leadership. The CISO and CPO also jointly chair Uber’s Privacy and Cybersecurity Council, which provides a venue for cross-functional insight and input into the cybersecurity program and our privacy program as they relate to Uber’s business operations.\n•\nInternally conducted environment and vulnerability assessments.\n These include regular assessments performed by Uber’s security engineering teams. The findings from these assessments are reported to Uber’s senior management, including the CISO, and the Board or Audit Committee. In addition, our internal audit function periodically conducts additional reviews and assessments, which are reported to the Audit Committee. We also conduct table-top exercises to simulate the response to cybersecurity incidents; participants may include, among others, the CISO, the CPO, and representatives from communications, investor relations, finance and legal.\n•\nIndependent \nthird-party\n audits and assessments by industry-leading firms.\n As a global organization, Uber undergoes annual audits to maintain its certification as a Payment Card Industry Data Security Standard (PCI DSS 4.0) Level 1 Merchant and Service provider. Uber also undergoes annual audits to maintain its ISO 27001 certification for its core mobility, delivery, and enterprise businesses, and SOC 2 attestations that vary depending on the Uber product. \n45\n•\nCyber incident management.\n This includes efforts by Uber’s security engineering team, at the direction of the CISO, to review potential incidents identified by Uber’s internal teams, Uber’s third-party service providers or external researchers through Uber’s Bug Bounty program; identify those which represent potential or actual threats to Uber’s systems, data or users; investigate and mitigate the cause and impact of such incidents; and implement safeguards to help prevent recurrence. Uber’s CPO and legal team support such efforts, including in connection with legal or disclosure obligations triggered in connection with any such incidents.\n \n•\nThird Party Risk Management.\n Uber performs due diligence regarding its third-party suppliers, service providers and business partners. This includes requiring submission of evidence demonstrating third parties’ ability to meet Uber’s cybersecurity and data handling requirements. In addition, Uber’s third-party suppliers and service providers who process Uber personal data are contractually obligated to notify Uber if they experience certain incidents impacting Uber personal data.\nFor a discussion regarding risks from cybersecurity threats, see our risk factors, including the risk factors titled “—\nWe have experienced, and may experience security or privacy breaches or other unauthorized or improper access to, use of, disclosure of, alteration of or destruction of our proprietary or confidential data, employee data, or platform user data, which could cause loss of revenue, harm to our brand, business disruption, and significant liabilities”\n, “—Cyberattacks, including computer malware, ransomware, viruses, denial of service attacks, spamming, phishing and social engineering attacks could harm our reputation, business, and operating results”, “—We currently are subject to a number of inquiries, investigations, and requests for information from the DOJ, other federal, state and local government agencies and other foreign government agencies, the adverse outcomes of which could harm our business” and “—We face risks related to our collection, use, transfer, disclosure, and other processing of data, which could result in investigations, inquiries, litigation, fines, legislative and regulatory action, and negative press about our privacy and data protection practices” in Part I,"
  }
}