{
  "ticker": "ULTA",
  "cik": "0001403568",
  "company_name": "Ulta Beauty, Inc.",
  "filing_date": "2025-03-27",
  "accession": "0001558370-25-003810",
  "primary_doc": "ulta-20250201x10k.htm",
  "item_sections": {
    "item1": "Item 1.\n   Business\nOverview\nUlta Beauty is the largest specialty beauty retailer in the United States and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products, and salon services. Key aspects of our business include:\nOne-of-a-kind Assortment.\n We offer guests a differentiated assortment of approximately 29,000 products from approximately 600 established and emerging beauty brands across a variety of categories and price points. We offer a wide selection of beauty and wellness categories, from mass to\n \nprestige price points, across cosmetics, fragrance, haircare, skincare, bath and body products, professional hair products, and salon styling tools.\nStore Footprint.\n We operate more than 1,400 stores predominantly located in convenient, high-traffic locations. With a bright and open store environment, we make it easy for guests to discover new products and services. Our store design, fixtures, and open layout provide the flexibility to respond to consumer trends and changes in our merchandising strategy. We also offer beauty services in nearly every store, including a full-service hair salon and a Benefit\nTM\n Brow Bar. In addition to our free-standing locations, through our partnership with Target Corporation we have more than 600 Ulta Beauty at Target shop-in-shops which provide guests with a highly-curated, prestige beauty assortment in a unique and elevated presentation in 1,000 square feet of dedicated space within certain Target locations.\nLeading Digital Experiences. \nThrough our website, Ulta.com, and our mobile applications, we offer guests convenient, immersive, and personalized digital experiences. Our digital channels enable always-on shopping and discovery, and our diverse fulfillment options, including buy online pick-up in store, buy online pick-up curbside, ship from store, ship from distribution center, and same-day delivery, provide guests with value and convenience. In addition to e-commerce platforms, we offer guests a variety of unique digital experiences, including virtual try-on and skin analysis tools, which leverage augmented reality capabilities and artificial intelligence tools to provide guests with personalized experiences. \nBest-in-Class Loyalty Program. \nOur best-in-class loyalty program, Ulta Beauty Rewards, enables members to earn points for every dollar spent on products and beauty services at Ulta Beauty, through purchases on our private label and co-branded credit cards, and purchases at Ulta Beauty at Target. In addition to unique membership benefits, members can redeem points for discounts on any product or service at Ulta Beauty. With more than 95% of total sales coming from members, we are uniquely positioned with a deep understanding of our customers and their preferences, enabling us to personalize experiences, recommendations, and promotions through our Customer Relationship Management (CRM) platform and support our brand partners’ growth. \nGreat Guest Experiences. \nWe cultivate human connection with warm and welcoming guest experiences across all of our channels. Our knowledgeable and approachable store associates, our differentiated service offerings, and our efforts to create relevant, compelling digital content are competitive advantages and enable us to build strong engagement with guests.\nWe were founded in 1990 as a beauty retailer at a time when prestige, mass, and salon products were sold through distinct channels — department stores for prestige products; drug stores and mass merchandisers for mass products; and salons and authorized retail outlets for professional hair care products. We developed a unique specialty retail concept that offers a broad range of brands and price points, select beauty services, and a convenient and welcoming shopping environment. We define our target consumer as a beauty enthusiast, a consumer who is passionate about the beauty category, uses beauty for self-expression, experimentation, and self-investment, and has high expectations for the shopping experience. We estimate there are approximately 140 million beauty enthusiasts in the U.S.\n4\n\n\nTable of Contents\nThe following description of our business should be read in conjunction with the information contained in our Management’s Discussion and Analysis of Financial Condition and Results of Operations included in Item 7 and our Financial Statements and Supplementary Data included in Item 8 of this Annual Report on Form 10-K.\nOur strategy\nWe target beauty enthusiasts across multiple demographics and shopping behaviors. Beauty enthusiasts have a deep emotional connection with beauty, and historically, this connection has not diminished in softer economic environments. Our proprietary consumer research confirms engagement with the beauty category remains strong. Strong engagement paired with increasing use of social media and the convergence of beauty and wellness has invited even more consumers into the beauty category and expanded the addressable market. At the same time, the beauty landscape is evolving and guest expectations are rising, which will require continued innovation and investment to further our leadership position. \nReflecting our understanding about how the consumer and beauty category are evolving, in 2024 we refreshed our strategic framework. Through a focus on four foundational areas, our strategies are designed to position Ulta Beauty as the destination for beauty enthusiasts for a lifetime, drive market share leadership in beauty and wellness, and deliver long-term profitable growth. \nAssortment: Curating the best of all things beauty and wellness for all beauty enthusiasts. \nBeauty enthusiasts enjoy the experience of discovering and trying new products and consider beauty very much part of their self-care and wellness journey. Reflecting these insights, our objective is to engage and continuously delight beauty enthusiasts with a curated, differentiated beauty and wellness assortment. We intend to drive product newness through a differentiated portfolio of exclusive, emerging and established brands, including Ulta Beauty Collection, and accelerate our leadership position in wellness with an expanded assortment and elevated experience.\nExperience: Fostering authentic, empowering human connections that inspire, delight and engage guests at every touchpoint. \nThe guest experience is central to driving guest love and loyalty. Our consumer research suggests there are several important experience elements that are most critical to the beauty enthusiast including: creating a welcoming and inclusive environment, providing trusted guidance, offering convenience and ease, and delivering fun and immersion. To deliver on these critical needs and foster authentic, empowering human connections that inspire, delight and engage guests at every touchpoint, we intend to enhance the in-store experience by investing in our best-in-class store associates and stylists, distinct service offerings, and signature events and heighten omnichannel satisfaction, meeting every guest where they are with a robust suite of offerings and increased convenience.\nLoyalty: Building lifelong loyalty and brand love through member growth and personalization.\n To understand longer-term shifts in consumer values, perceptions, and behaviors, as well as of-the-moment insights, we have developed a robust consumer research capability. In addition, with more than 95% of total sales coming from our 44.6 million active Ulta Beauty Rewards loyalty program members, we have unique insights about customer preferences and behavior. Based on our proprietary insights, we know beauty enthusiasts have an emotional, personal, and deep connection with beauty. Social media contributes to this connection, and we expect the influence and reach of beauty will continue to grow as engagement with social platforms increases. To build lifelong loyalty and brand love, we intend to deepen guest engagement through community building and advanced personalization with the goal of expanding our loyalty program from approximately 44 million to 50 million members by 2028 by reaching new segments of beauty enthusiasts.\nAccess: Engaging our guests wherever they want to shop by expanding our reach through seamless and immersive omnichannel experiences. \n Beauty enthusiasts continue to demonstrate their commitment to and preference for the in-person shopping experience, while also embracing the use of online shopping to supplement discovery and convenience. We have built a powerful omnichannel ecosystem that enables guests to shop in ways most convenient to them, whether in stores, on our app or website, or through our partnership with Ulta Beauty at Target.  In addition, we have increased our fulfillment options, providing guests with choice, convenience, and speed. To achieve our objective of engaging our guests by expanding our reach, we intend to accelerate new store openings, targeting more than 1,800 stores over the long term; elevate digital engagement by fueling discovery through continued innovation and streamlining the shopping experience; and grow beyond our traditional channels through our partnership with Target Corporation and through international expansion in Mexico and the Middle East.\n \n5\n\n\nTable of Contents\nCulture and Talent: Underpinning our strategy with exceptional people, culture, and execution.\n \nWe have developed and nurtured a guest and associate-centric, values-based, and high-performance culture. We are focused on reenergizing the core tenets of our culture on how we lead with a winning mindset and how we live our values to care for our guests and for each other. We have talented associates and leaders, and we value and encourage collaboration and enterprise thinking. To support our growth and enhance the guest experience, we will continue to attract, develop and retain talent at all levels and in all functional areas, and we will continue to work to create an environment that positions our associates to fully contribute and have opportunities for growth. We have achieved our success through strong operational execution. \nOur market\nWe operate within the large and growing U.S. beauty products and salon services industry. In 2024, this market represented approximately $186 billion in sales, according to forecasted Euromonitor International and IBIS World Inc. In 2024, the beauty products industry totaled approximately $118 billion and included cosmetics, haircare, fragrance, bath and body, skincare, salon styling tools, and other toiletries. We estimate that Ulta Beauty had only a 9% share of the $118 billion beauty product industry. Within this market, we compete across all major categories as well as a range of price points by offering prestige, mass, and salon products. In 2024, the salon services industry totaled approximately $68 billion and included hair, skin, and nail services. We estimate that Ulta Beauty had less than 1% share of this industry. We have full-service hair salons in substantially every store and operate brow bars in most of our stores, as well as makeup and ear piercing services through our salons. In addition, we offer skin services in approximately 150 locations.\nCompetition\nOur major competitors for prestige and mass products include traditional department stores, specialty stores, grocery stores, drug stores, mass merchandisers, and the online capabilities of national retailers and brands, as well as pure-play e-commerce companies and online marketplaces. The market for salon services and products is highly fragmented. Our competitors for salon services and products include chain and independent salons.\nOur retail channels\nWe are committed to meeting guests where and how they want to shop and strive to offer guests a compelling, personalized shopping experience through our stores, digital platforms, and partnerships.\nStores\nOur member data and customer research suggests our guests prefer to transact in physical stores, where they can discover and interact with products and other beauty enthusiasts. In our fiscal year ended February 1, 2025 (fiscal 2024), 75% of our loyalty members transacted with us solely in one of our stores. Our retail stores are predominantly located in convenient, high-traffic locations such as power strip centers. Our typical store is approximately 10,000 square feet, including approximately 950 square feet dedicated to our full-service salon. We also have a smaller footprint store prototype ranging between approximately 5,000 and 7,500 square feet which provides increased flexibility to enter smaller markets or shopping centers.\nWe offer a full range of beauty services in our stores, focusing on hair, makeup, brow, and skin services. The vast majority of our stores include an open and modern salon area, with most of our stores offering brow services on the salon floor. In addition, stores offering skin services include a skin treatment room or dedicated skin treatment area on the sales floor. The salon features a concierge desk, approximately five to ten stations, and a shampoo and hair color processing area. We employ highly skilled, licensed professional stylists and estheticians who offer services as well as educational experiences, including consultations, styling lessons, makeup applications, skincare services, and at-home care recommendations. \n6\n\n\nTable of Contents\nIn addition to opening new stores, we also remodeled and relocated certain stores, as shown in the following table:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal year ended\n​\n    \nFebruary 1,\n   \nFebruary 3,\n    \nJanuary 28,\n​\n​\n2025\n​\n2024\n​\n2023\nTotal stores beginning of period\n​\n 1,385\n​\n 1,355\n​\n 1,308\nStores opened\n​\n 66\n​\n 33\n​\n 47\nStores closed\n​\n (6)\n​\n (3)\n​\n –\nTotal stores end of period\n​\n 1,445\n​\n 1,385\n​\n 1,355\n​\n​\n​\n​\n​\n​\n​\nTotal square footage\n​\n 15,110,170\n​\n 14,515,593\n​\n 14,200,403\nAverage square footage per store\n​\n 10,457\n​\n 10,481\n​\n 10,480\n​\n​\n​\n​\n​\n​\n​\nStores remodeled\n​\n 41\n​\n 18\n​\n 20\nStores relocated\n​\n 2\n​\n 7\n​\n 12\n​\nOur real estate vision is to make Ulta Beauty accessible and convenient to more consumers across a variety of markets and is a key driver of how we plan to expand our market share over time. We believe that over the long term, we have the potential to grow our store footprint to more than 1,800 freestanding Ulta Beauty stores in the United States. \nWe leverage a variety of insights to identify the best new store locations and optimize our current store locations, including beauty market share information and insights from our loyalty members. This insight-led, analytical approach to site selection has resulted in a high performing real estate portfolio. The average investment required to open a new Ulta Beauty store is approximately $2.1 million, which includes capital investments, net of landlord contributions, pre-opening expenses, and initial inventory, net of payables. Our net investment required to open new stores and the net sales generated by new stores may vary depending on a number of factors, including geographic location and store size. \nOur traditional layout is organized by price point, with prestige makeup and skincare on one side of the store and mass makeup and skincare on the other. As part of our ongoing efforts to enhance and evolve our in-store experience to engage our guests, we also have a layout in select stores that brings together like categories with intuitive adjacencies to magnify our differentiated assortment. This additional layout features elevated gondolas to showcase key, iconic, and service brands and Beauty Bars that offer our brow and makeup services, support in-store events, and highlight beauty-in-action. In addition, select store layouts may vary due to square footage or location. \n​\nDigital platform\n \nIn addition to store expansion, we continue to expand our digital capabilities as more of our guests choose to engage with us across physical and digital platforms. In fiscal 2024, 18% of our loyalty members shopped both in Ulta Beauty stores and through our digital platforms. Our omnichannel guests are extremely valuable, historically spending nearly three times as much as retail-only guests.\nOur e-commerce platform has two key roles: generating direct channel sales and profits by engaging our guests in an interactive, enjoyable way that reinforces the Ulta Beauty brand; and driving traffic to our stores, website, and native applications. As part of our digital store transformation, we recently completed a large-scale upgrade of our digital and e-commerce infrastructure to enable us to deliver immersive commerce experiences and position our e-commerce business for growth and scalability. We continue to develop and add new website and mobile features and functionality, marketing programs, new products and brands, and omnichannel integration points. In 2024, we launched Ulta Beauty Community, an online destination where beauty enthusiasts can connect and engage with one another over their shared joy for all things beauty. We continue to grow our digital business by providing our guests with a unique, rich online experience, with personalized recommendations, expanded assortments, engaging experiences, including virtual try-on and analysis capabilities, and social media content. \nWe continue to improve our order fulfillment capabilities with increased speed of delivery through existing distribution centers, fast fulfillment center (e-commerce only), market fulfillment centers, and select retail stores, through more \n7\n\n\nTable of Contents\nefficient processes designed for e-commerce order fulfillment. In addition to ship to home order fulfillment, we offer guests “Buy Online, Pick-up in Store,” “Curbside Pickup,” and “Store 2 Door,” which provides the ability for customers to order in-store and have products delivered to their homes. In addition, we offer same-day delivery for e-commerce orders in virtually all markets. \nPartnerships\nTo expand loyalty member engagement and introduce new guests to Ulta Beauty, we have a partnership with Target Corporation to create Ulta Beauty at Target, a “shop-in-shop” concept that offers a curated assortment of more than 60 established and emerging prestige brands across a variety of categories. Co-designed by Ulta Beauty and Target, the Ulta Beauty at Target shop is intended to reflect the Ulta Beauty experience with a unique and elevated presentation in 1,000 square feet of dedicated space separate but adjacent to Target’s core beauty department. The shop is staffed by Target team members who are trained by Ulta Beauty to provide recommendations and answer product questions. Members in our loyalty program, Ulta Beauty Rewards, can earn points for purchases made in the Ulta Beauty at Target shop.  Loyalty points can only be redeemed in Ulta Beauty stores, on Ulta.com or through our mobile applications. As of February 1, \n2025, Ulta Beauty at Target was available in over 600 Target locations and on target.com.  Over time, we believe Ulta Beauty at Target could be in up to 800 Target locations, in addition to our freestanding Ulta Beauty stores.\nWe are committed to growing our business outside of the U.S. through international expansion in Mexico and the Middle East. In Mexico, we have a joint venture partnership with Grupo Axo, an experienced operator of global brands to launch and operate Ulta Beauty in Mexico beginning in 2025. In the Middle East, we entered into a franchise partnership with Alshaya Group, a leading international franchise operator, whereby Alshaya will license the Ulta Beauty brand name and operating model in the Middle East.\nMerchandising \nOverview\nWe offer one of the most extensive product and brand selections in our industry, including a broad assortment of branded and private label beauty and wellness products in cosmetics, fragrance, haircare, skincare, bath and body products, and salon styling tools. Across our stores, Ulta.com and our mobile applications, we offer approximately 29,000 products from approximately 600 well-established and emerging beauty and wellness brands across all categories and price points, including Ulta Beauty’s own private label, Ulta Beauty Collection. Our merchandising team continually monitors beauty and wellness trends, sales trends, and new product launches to keep Ulta Beauty’s product assortment fresh and relevant and to ensure that our assortment reflects the diversity of our guests. We believe our broad selection of merchandise, from moderately-priced brands to higher-end luxury brands, creates a unique shopping experience for our guests.\nIn addition to our partners’ brands, we believe our recently relaunched private label brand, Ulta Beauty Collection, is a strategically important opportunity for growth and profit contribution. Our objective is to provide quality, trend-right private label products to continue to strengthen our guests’ perception of Ulta Beauty, and serve as an important pillar of the Conscious Beauty at Ulta Beauty\n®\n program. Ulta Beauty manages the full development cycle of these products from concept through production to deliver differentiated packaging and formulas that enhance our brand image. Ulta Beauty Collection has been certified in the Clean Ingredients and Cruelty Free pillars within the Conscious Beauty at Ulta Beauty\n®\n program. We also offer products such as Tarte Double Duty Beauty cosmetics and IT Brushes for Ulta that are permanently exclusive to Ulta Beauty. Similarly, we offer a number of brands and products that are exclusive for a limited period of time or are offered in advance of our competitors, such as Morphe, Peach & Lily, and R.E.M Beauty. Ulta Beauty Collection and permanent Ulta Beauty exclusive products represented approximately 4% of our net sales in fiscal 2024. Both permanent and temporary exclusive products represented approximately 9% of our net sales in fiscal 2024.\nCategories\nWe offer a balanced portfolio across six primary categories: (1) cosmetics; (2) skincare; (3) haircare; (4) fragrance; (5) services; and (6) other, which includes other revenue sources such as the private label and co-branded credit card \n8\n\n\nTable of Contents\nprograms, royalties derived from the partnership with Target Corporation, and deferred revenue related to the loyalty program and gift card breakage. \nThe following table sets forth the approximate percentage of net sales attributed to each category for the periods presented: \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal year ended\n​\n​\nFebruary 1,\n​\nFebruary 3,\n​\nJanuary 28,\n(Percentage of net sales)\n​\n2025\n​\n2024\n​\n2023\nCosmetics\n​\n39%\n  \n41%\n  \n42%\nSkincare\n​\n23%\n​\n22%\n​\n20%\nHaircare\n​\n19%\n​\n20%\n​\n22%\nFragrance\n​\n13%\n​\n11%\n​\n11%\nServices\n​\n4%\n​\n4%\n​\n3%\nOther\n​\n2%\n​\n2%\n​\n2%\n​\n​\n100%\n​\n100%\n​\n100%\n​\nOrganization\n​\nOur merchandising team consists of a Chief Merchandising and Digital Officer who oversees the Senior Vice President of Cosmetics, Fragrance and Private Label and the Senior Vice President of Haircare, Skincare, Bodycare and Wellness, who in turn oversee category Vice Presidents who in turn oversee Divisional Merchandise Managers and their teams of buyers. Our Chief Merchandising and Digital Officer also oversees our e-commerce business and our centralized merchandise planning and forecasting group to ensure consistent execution across our omnichannel platforms and our planogram team. \nIn stores, we present products in an open-sell environment using centrally produced planograms (detailed schematics showing product placement in the store) and promotional merchandising planners. Our planogram team assists the merchants and inventory teams to keep new products flowing into stores on a timely basis. All major product categories undergo planogram revisions on a regular basis, and adjustments are made to assortment mix and product placement based on current sales trends. Our visual marketing team works with our merchandising team to develop strategic placement of promotional merchandise, functional and educational signage, and creative product presentation standards in all of our stores. All stores receive centrally produced promotional merchandising planners to ensure consistent implementation of our marketing programs.\nPlanning and allocation\nWe have developed a disciplined approach to buying and a dynamic inventory planning and allocation process to support our merchandising strategy. We centrally manage product replenishment to our stores through our merchandise planning group. This group serves as a strategic partner to, and provides financial oversight of, the merchandising team. The merchandising team creates a sales forecast by category for the year. Our merchandise planning group creates an open-to-buy plan, approved by senior executives, for each product category. The open-to-buy plan is updated weekly with point-of-sale (POS) data, receipts, and inventory levels and is used throughout the year to balance buying opportunities and inventory return on investment. We believe this structure maximizes our buying opportunities while maintaining organizational and financial control. POS data is used to calculate sales forecasts and to determine replenishment levels. We determine promotional product replenishment levels using sales history from similar or comparable events. To ensure our inventory remains productive, our planning and replenishment group, along with senior executives, monitor the levels of clearance and aged inventory in our stores on a weekly basis. \nBrand partnerships\nWe have strong, active relationships with our brand partners. Our top ten brand partners, such as L’Oréal and Estée Lauder Companies, among others, represented 54% and 55% of our total net sales in fiscal 2024 and our fiscal year \n9\n\n\nTable of Contents\nended February 3, 2024 (fiscal 2023), respectively. We believe our brand partners view us as a significant distribution channel for growth and brand enhancement, and we work closely with them to market both new and existing brands.\nAll brand partners and respective subcontractors and their facilities are subject to the applicable Ulta Vendor Standards, which set forth the ethical, legal, social, and workplace standards to meet in order to do business with Ulta Beauty. In addition to complying with Ulta Vendor Standards, many brand partners have committed to help advance our mission to \nmaintain the beauty of our environment \nand\n minimize our impact on the world around us by offering sustainable packaging. We have made a commitment that 50% of packaging from products sold at our stores will be recyclable, refillable, or made from recycled or bio-sourced materials by the end of fiscal 2025.  \nMarketing and advertising\nWe employ a multi-faceted marketing strategy to increase brand awareness, drive traffic to our stores, website, and mobile applications, acquire new loyalty program members, improve guest retention, increase frequency of shopping, and increase spend per member. We communicate with our guests and prospective guests through multiple vehicles, including print advertising, digital and social media, television and radio. These vehicles highlight the breadth of our selection of prestige, mass and salon beauty products, new products and services, and special offers, as well as build an emotional connection with guests. Our comprehensive public relations strategy enhances Ulta Beauty’s reputation as a beauty destination, increases brand awareness, and drives awareness of new products, in-store events, and new store openings.\nThe Ulta Beauty Rewards loyalty program is an important tool to increase retention of existing guests and to enhance their loyalty to the Ulta Beauty brand. Our CRM platform enables sophisticated analysis of the customer data in our loyalty member database as well as greater personalization of our marketing campaigns, digital experiences, and day-to-day communications. Our data demonstrates that loyalty members spend more per visit as compared to non-members. Ulta Beauty Rewards enables customers to earn points based on their purchases at Ulta Beauty stores, through our digital platforms, and at Ulta Beauty at Target. Points earned are valid for at least one year and may be redeemed on any product we sell or service we provide in Ulta Beauty stores or through our digital platforms. To enhance our loyalty program, we offer co-branded and private label credit cards. The credit cards drive higher wallet share and greater loyalty from our rewards members, provide increased consumer insights, and offer attractive economics. \nWe are directing a growing percentage of our marketing expense towards digital, social media, and streaming advertising. We believe these channels are highly effective in communicating with existing guests, as well as driving consideration amongst those who have not yet shopped with us. In social media channels, influencers and affiliates play an important role in beauty, and we engage talent from our UB Collective, our affiliate program, and Ulta Beauties, our associate ambassador program to support our marketing efforts. Our digital marketing strategy includes search engine optimization, paid search, mobile advertising, social media, display advertising, and other digital marketing channels. Digital marketing, coupled with our national TV and radio advertising, has helped us increase brand awareness and consideration among those not familiar with Ulta Beauty, which we believe has resulted in new guests. \nRetail media network\nWe have a deep understanding of our Ulta Beauty Rewards loyalty members and their preferences. This unique understanding, combined with our ongoing investment in data analytics and CRM capabilities, enables us to create personalized experiences and value for our guests and has unlocked new ways for us to support our brand partners and drive additional vendor income. In 2022, we launched our retail media network, UB Media, to transform the way our brand partners can connect with beauty enthusiasts. UB Media offers brands a suite of media and advertising capabilities that aim to personalize guest engagement and drive the acquisition of new guests.\n​\n10\n\n\nTable of Contents\nStaffing and operations\nRetail stores\nOur current Ulta Beauty store format is typically staffed with a general manager, a services manager, and three associate managers, along with approximately 28 full- and part-time associates, including approximately four to eight prestige advisors and five to ten licensed salon professionals. The management team in each store reports to the General Manager. The General Manager oversees all store activities including salon management, inventory management, merchandising, cash management, scheduling, hiring, and guest services. Members of store management receive bonuses depending on their position and based upon various performance metrics. Each General Manager reports to a District Manager, who in turn reports to a Regional Vice President of Operations, who in turn reports to a Senior Vice President of Stores, who in turn reports to the Chief Retail Officer, who in turn reports to the Chief Executive Officer. Each store team receives additional support from time to time from recruiting specialists for the retail and salon operations, regionally based talent development managers, a field loss prevention team, service district educators and service district leaders, and brand partners.\nUlta Beauty stores are open seven days a week, typically eleven hours a day, Monday through Saturday, and seven hours on Sunday. Our stores have extended hours during the holiday season. \nSalon services\nA typical salon is staffed with five to ten licensed salon professionals, including six or more stylists, and select stores have an esthetician. Our most productive salons have a guest coordinator and an assistant manager. Our services district educators and brand partner education classes create a comprehensive educational program for approximately 7,500 Ulta Beauty salon professionals.\nSupply chain\nOur vision is to build and operate a dynamic and agile end-to-end supply chain that improves operational efficiency, performance, and guest experience to fuel organizational growth effectively. This includes enhanced systems and processes as well as a modernized distribution center network to support our new store and e-commerce growth. We operate four regional distribution centers and two market fulfillment centers that support both stores and e-commerce demand, and one fast fulfillment center that supports e-commerce orders only. Market fulfillment centers are smaller than our regional distribution centers and focus on our most productive products enabling us to improve service and responsiveness, especially in markets with high store and population density. In addition, approximately 500 stores fulfill e-commerce orders as part of our ship-from-store program.\nInventory is shipped from our suppliers to our distribution centers, market fulfillment centers and fast fulfillment center. We replenish our stores with such products primarily in eaches (i.e., less-than-case quantities), which allows us to ship less than an entire case when only one or two of a particular product is required. Our distribution centers, market fulfillment centers, and fast fulfillment center use warehouse management software systems to manage inventory to support product purchase decisions. Product is delivered to stores using a broad network of contract and local pool (final mile) carriers.\nHuman capital management\nWe believe our associates, with their combined skills, knowledge, experiences, and commitment to serving our guests, are among our most important resources and are critical to our continued success. We strive to make Ulta Beauty a great place to work by leading with our hearts, caring for each other in everything we do, and demonstrating integrity, authenticity and inclusivity in our daily actions.  \n​\n11\n\n\nTable of Contents\nThe following table sets forth the approximate number of associates employed as of February 1, 2025: \n​\n​\n​\n​\n​\n​\n​\n​\nFull-time\n​\n​\n​\n​\n​\n 20,000\nPart-time\n​\n​\n​\n​\n​\n 38,000\nTotal associates\n​\n​\n​\n​\n​\n 58,000\n​\n​\n​\n​\n​\n​\n​\nWe have no collective bargaining agreements and have not experienced any work stoppages. We believe we have good relationships with our associates.\nDiversity, equity, and inclusion\nThe beauty industry is inherently diverse, and because of that, we embed inclusion efforts through a cross-functional approach, led by our Chief Executive Officer, to ensure teams remain energized and motivated to lead in this critical space. At Ulta Beauty, our mission is to make beauty accessible, inclusive, and empowering for everyone. Ulta Beauty believes that everyone deserves to feel good in their own skin. We believe that when you are free to be your full self, you feel like you belong. As a values-driven company, we believe we have a responsibility to drive inclusivity and a sense of belonging for our guests and associates. We accomplish this through evolving our assortment to ensure we offer relevant products to our diverse customer base, inclusive recruitment strategies, dedicating time to celebrate diversity and inclusion, and encouraging associates to build personal habits through everyday inclusive actions.\nIn addition, we aim to ensure that all in-store experiences are equitable, fair, and unbiased. We take action to support this goal by providing quarterly trainings for in-store associates and providing weekly learning opportunities to focus on guest perspectives and reinforce key takeaways. We offer similar training across the organization to help key decision-makers and associates in their own learning journeys and support our Champion Diversity value and inclusion competency. \nThe following table sets forth key metrics as of February 1, 2025:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nBoard of\n​\n​\n​\nAll Other\n​\n​\nDirectors\n​\nLeadership\n​\nAssociates\nWomen\n​\n64%\n​\n67%\n​\n91%\nMen\n​\n36%\n​\n33%\n​\n9%\nPeople of color\n​\n36%\n​\n28%\n​\n57%\n​\nOversight and management\nWe strive to make sure that our associates are at the heart of every decision we make. The Chief Human Resources Officer, along with the entire executive team, is responsible for developing and executing the Company’s human capital strategy. This includes the attraction, acquisition, development, and engagement of talent and the design of associate compensation and benefits programs. Our human capital objectives and initiatives, including the risks related to compensation policies and practices, management development and leadership succession, inclusion practices, and implementation and compliance monitoring of our code of business conduct, are also overseen by individual Board committees as described in our corporate governance guidelines.\nWe believe open and honest two-way communication is critical to maintaining strong associate engagement. We regularly conduct an associate engagement survey to determine associates’ satisfaction with their roles, their leaders, and the Company as a whole, which our executive team reviews and monitors. Our leadership team also hosts roundtable sessions, as well as additional forums, including department town halls, store and distribution center visits, and other small group gatherings, to dive deeper on specific topics.\nTraining and development\nOur success is dependent, in part, on our ability to attract, train, retain, and motivate qualified associates at all levels of the organization. We are committed to continually developing our associates and providing career advancement \n12\n\n\nTable of Contents\nopportunities. Our associates and management teams are essential to our store expansion strategy. We use a combination of existing managers, promoted associates, and outside hires to support our new stores. The majority of our promotions are internal. As we continue to promote and develop from within, we are building a bench of associates and leaders who understand our business well and support our values-driven culture.\nAll of our associates participate in an interactive new-hire orientation through which each associate becomes acquainted with Ulta Beauty’s mission, vision, and values. Through our learning management system and our digital workplace system, we provide continuing education to associates throughout their careers at Ulta Beauty. Additionally, our leadership development program prepares promising future leaders for new levels of responsibility.\nCompensation and benefits\nOur commitment to our associates and their well-being is one of our highest priorities. We have assembled a suite of benefits that affirms and supports all that our associates contribute every day, including\n:\n●\nHealth care coverage is offered to those who work more than 30 hours a week in any position. Coverage extends to eligible dependents, including spouses, domestic partners, and children under the age of 26. We offer \ncomprehensive medical plans that empower associates to choose the coverage that best suits them;\n●\n401(k) plan with up to a 4% company match;\n●\nDisability and life insurance;\n●\nCompany-paid short-term disability pay at 80% of pay;\n●\nAdditional insurance options, including legal, pet, home, and auto;\n●\nTuition reimbursement program;\n●\nPaid time off, including an extended illness bank; and\n●\nDiscounts on retail products and salon services.\nIn addition, we believe wellness, like beauty, is more than skin deep, so we offer mental health resources, such as counseling services and access to mobile applications, financial wellness planning and guidance, and health mobile applications and educational resources for soon-to-be parents.\nThe Ulta Beauty Charitable Foundation supports the Associate Relief Program to assist associates facing unforeseen financial hardship. The Associate Relief Program provides short-term financial support to reimburse medical bills or support temporary housing. \nSustainability\nWe strive to operate in an environmentally responsible manner. Our retail stores are focused on energy reduction efforts by maintaining safe indoor air for all customers while products are being used in our salons, using adequate energy-efficient lighting, managing the in-store temperatures, and making efficient use of water needed for our salon services. In addition, we will continue to look for ways to reduce our carbon footprint by investments in renewable energy credits and working with our brand partners to identify ways to work together to reduce Scope 3 emissions.  \n​\nInformation technology \nWe are committed to using technology to enhance our competitive position. We intend to leverage our technology infrastructure and systems to gain operational efficiencies through more effective use of our systems, people, and processes. In fiscal 2024, we completed several multi-year strategic investment projects to upgrade key elements of our technology infrastructure including upgrading our enterprise resource planning platform and refreshing our POS system in all stores, transitioning our digital store to a new architecture,  and building a modern ecosystem for future analytics and data-driven decisioning capabilities. Collectively, we expect these investments to provide a flexible and scalable operating environment allowing for greater business efficiency and enhancing the guest experience. We will continue to make investments in our information systems to facilitate growth and enhance our competitive position. Also see “Cybersecurity” included as part of",
    "item1c": "Item 1C.  Cybersecurity\nWe depend on a variety of information systems and technologies to maintain and improve our competitive position and to manage the operations of our business, including supply chain, merchandising, point of sale, e-commerce, marketing, finance, accounting, and human resources. Our core business systems consist mostly of purchased software programs that integrate together with our internally developed software solutions across a company-wide network that connects all corporate users, stores, and our distribution center infrastructure. \nWe manage data security and privacy at the highest levels.\n \nThe Company’s Board of Directors oversees an enterprise-wide approach to risk management (ERM), designed to support the achievement of organizational objectives, including strategic objectives, to improve long-term organizational performance and enhance stockholder value. Management is responsible for the Company’s day-to-day risk management activities and processes, and our Board’s role is to engage in informed oversight of, and provide guidance\n \nwith respect to, such risk management activities and processes. The Company’s \ncybersecurity policies, standards, and practices are fully integrated into the Company’s ERM program\n and are based on recognized frameworks established by the National Institute of Standards and Technology, the International Organization for Standardization and other applicable industry standards. In general, the Company seeks to address cybersecurity risks through a comprehensive, proactive cross-functional approach that is focused on preserving the confidentiality, security, and availability of the information that the Company collects and stores by identifying, preventing, and mitigating cybersecurity threats and effectively responding to cybersecurity incidents if they occur.\n​\nRisk Management and Strategy\n​\nAs one of the critical elements of the Company’s overall ERM approach, the Company’s cybersecurity program is focused on the following key areas:\nCollaborative Approach.\n The Company has implemented a comprehensive, cross-functional approach to identifying, preventing, and mitigating cybersecurity threats and incidents, while also implementing controls and procedures that provide for the prompt identification and escalation of certain cybersecurity incidents so that decisions regarding the public disclosure and reporting of such incidents can be made by management in a timely manner.\nTechnical Safeguards.\n The Company’s Security Operations Center, led by our Vice President IT Risk Management (Chief Information Security Officer), constantly and proactively monitors our network and application landscape for threats and anomalies. The Security Operations Center deploys technical safeguards that are designed to protect the Company’s information systems from cybersecurity threats, including firewalls, intrusion prevention and detection systems, anti-malware functionality and access controls, which are evaluated and improved through vulnerability assessments and cybersecurity threat intelligence.\n \nIncident Response Plan\n. The Company has established and maintains a comprehensive incident response plan that addresses the Company’s response to a cybersecurity incident. \nThird-Party Risk Management.\n \nThe Company maintains a comprehensive, risk-based approach to identifying and overseeing cybersecurity risks presented by third parties, including vendors, service providers, and other external users of the Company’s systems, as well as the systems of third parties that could adversely impact our business in the event of a cybersecurity incident affecting those third-party systems.\nTraining.\n All Ulta Beauty associates have a role as stewards of Company data, and we educate them on how to keep data safe. As part of the Company’s annual security awareness training and regular training around phishing, we train associates on how to keep devices and data safe in public places; how to avoid security threats and phishing scams; how to maintain a secure workplace; and everyday practices that help maintain the security of corporate digital devices, data and systems.\nThe Company engages in the periodic assessment and testing of the Company’s policies, standards, processes, and practices that are designed to address cybersecurity threats and incidents. We assess ourselves against the National Institute of Standards and Technology Cybersecurity Framework, Payment Card Industry Data Security Standard and management’s defined technology controls to support internal controls over financial reporting. These efforts include a \n26\n\n\nTable of Contents\nwide range of activities, including audits, assessments, tabletop exercises, threat modeling, vulnerability testing, and other exercises focused on evaluating the effectiveness of our cybersecurity measures and planning. The \nCompany regularly engages third parties to perform assessments on our cybersecurity measures\n, including information security maturity assessments, audits, and independent reviews of our information security control environment and operating effectiveness, including network penetration assessments. The results of such assessments, audits, and reviews are reported to the Audit Committee of the Board and the Board of Directors, and the Company adjusts its cybersecurity policies, standards, processes, and practices as necessary based on the information provided by these assessments, audits, and reviews.\nIn the last three fiscal years, the Company has not experienced any material cybersecurity incidents, and expenses incurred from cybersecurity incidents were immaterial. \nCybersecurity threats, including as a result of any previous cybersecurity incidents, have not materially affected or are not reasonably likely to materially affect the Company\n, including its business strategy, results of operations or financial condition. Also see “Information Security, Cybersecurity, Data Privacy, Regulatory and Legal Risks” included as part of",
    "item1a": "Item 1A. Risk Factors of this Annual Report on Form 10-K, which disclosures are incorporated by reference herein.\n​\nGovernance\n​\nThe Company’s Board of Directors is actively engaged in oversight of cybersecurity, and it is part of the responsibilities of our Audit Committee\n. \nThe Company’s Chief Technology and Transformation Officer (CTTO) and President and Chief Executive Officer keep the Board informed on cybersecurity and privacy matters throughout the year\n, which address a wide range of topics including recent developments, evolving standards, vulnerability assessments, third-party and independent reviews, the threat environment, technological trends, and information security considerations arising with respect to the Company’s peers and third parties. The Board and the Audit Committee also receive prompt and timely information regarding any cybersecurity incident that meets established reporting thresholds, as well as ongoing updates regarding any such incident until it has been addressed.\nThe Company’s cybersecurity risk management and strategy processes, which are discussed in greater detail above, are led by \nour CTTO and our Vice President IT Risk Management\n. The Company’s CTTO works collaboratively across the Company to implement a program designed to protect the Company’s information systems from cybersecurity threats and to promptly respond to any cybersecurity incidents in accordance with the Company’s incident response plans. To facilitate the success of the Company’s cybersecurity risk management program, we have a unified and centrally coordinated team, led by our Vice President IT Risk Management, that is responsible for implementing and maintaining centralized cybersecurity and data protection practices in close coordination with senior leadership and other teams across Ulta Beauty. \nReporting to our Vice President IT Risk Management are a number of trained cybersecurity professionals. In addition to our extensive in-house cybersecurity capabilities, at times we also engage consultants, auditors, or other third parties to assist with assessing, identifying, and managing cybersecurity risks.\nThe Company’s CTTO leads the core elements of Ulta Beauty’s IT and Digital functions, including IT infrastructure, systems and security, digital experience and operations, and consumer technology. He has served in various roles in information technology and information security for over 30 years, including serving as the Global Chief Technology Officer of a large public company prior to joining the Company. The Vice President IT Risk Management leads our information risk management organization responsible for overseeing the Company’s information security program. She has over 25 years of industry experience, including serving in similar roles leading and overseeing cybersecurity programs at other public companies.\n​\n27\n\n\nTable of Contents",
    "item1b": "Item 1B.   Unresolved Staff Comments\nNone.\n25\n\n\nTable of Contents"
  }
}