{
  "ticker": "UNP",
  "cik": "0000100885",
  "company_name": "UNION PACIFIC CORP",
  "filing_date": "2025-02-07",
  "accession": "0000100885-25-000042",
  "primary_doc": "unp-20241231.htm",
  "item_sections": {
    "item1": "Item 1. \nBusiness\nGENERAL\nUnion Pacific Railroad Company is the principal operating company of Union Pacific Corporation. One of America's most recognized companies, Union Pacific Railroad Company connects 23 states in the western two-thirds of the country by rail, providing a critical link in the global supply chain. The Railroad’s diversified business mix includes Bulk, Industrial, and Premium. Union Pacific serves many of the fastest-growing U.S. population centers, operates from all major West Coast and Gulf Coast ports to Eastern gateways, connects with Canada's rail systems, and is the only railroad serving all six major Mexico gateways. Union Pacific provides value to its roughly 10,000 customers by delivering products in a safe, reliable, fuel-efficient, and environmentally responsible manner.\nUnion Pacific Corporation was incorporated in Utah in 1969 and maintains its principal executive offices at 1400 Douglas Street, Omaha, NE 68179. The telephone number at that address is (402) 544-5000. The common stock of Union Pacific Corporation is listed on the New York Stock Exchange (NYSE) under the symbol “UNP”.\nFor purposes of this report, unless the context otherwise requires, all references herein to \"Union Pacific\", “UPC”, “Corporation”, “Company”, “we”, “us”, and “our” shall mean Union Pacific Corporation and its subsidiaries, including Union Pacific Railroad Company, which we separately refer to as “UPRR” or the “Railroad”.\nSTRATEGY\nSafety, Service, and Operational Excellence supports the Company's long-term initiative to Grow its freight volumes. Together as a team, the Company will focus on achieving the best safety record in the industry, being known for superior service, grounded in operational excellence, which, in turn, drives growth. \nSafety\n is paramount and, as our first area of focus, sets the foundation for achieving the Company's objectives. The mindset and culture are built around a personal commitment by all employees to prioritize safety so everyone goes home safely.\nService\n is all about delivering what we sold our customers. We work with our customers to understand the service they need to win in their markets and then drive how we win together. We commit to these service levels and do it with excellence.\nOperational Excellence\n is about operating efficiently and productively. We will drive value with our available resources but also maintain a buffer so our service is resilient, managing the inevitable ups and downs that come with weather, fluctuating volumes, and securing growth.\nGrowth\n is the outcome of executing our strategy to be the industry leader in both safety and service resulting in improved margins and greater cash generation, creating long term enterprise value. The expected outcome of successfully executing our strategy will be an industry leading operating ratio and return on invested capital.\nAs we work to transform our railroad, our core values continue to guide us. Our passion for performance will help us win; our high ethical standards ensure we win in a way that supports all of our stakeholders; and our teamwork ensures we win together.\nOPERATIONS\nThe Railroad, along with its subsidiaries and rail affiliates, is our one reportable operating segment. Although we provide and analyze revenues by commodity group, we treat the financial results of the Railroad as one segment due to the integrated nature of our rail network. Additional information regarding our business and operations, including revenues, financial information and data, and other information regarding environmental matters, is presented in Risk Factors,",
    "item1a": "Item 1A of this report.\nGovernance\nThe Board of Directors has delegated primary oversight of the Company’s cybersecurity risk to the Audit Committee, which receives updates on cybersecurity risks, risk mitigation initiatives, and incidents at each regularly scheduled Audit Committee meeting from the CIO, CISO, and other members of management, as needed. When making decisions regarding director appointments and committee assignments, the Board of Directors takes into consideration the cybersecurity experience of directors and director candidates and strives to maintain cybersecurity expertise on the Board of Directors and Audit Committee. We have protocols by which certain cybersecurity incidents are reported to the \nAudit Committee and Board of Directors.\nAt the management level, our \nCIO, CISO, and Deputy CISO\n, each of whom has extensive cybersecurity knowledge and skills gained from over 28 years, 29 years, and 20 years of relevant work experience, respectively, head the Internal Cybersecurity Team that is responsible for implementing and maintaining cybersecurity and data protection practices across our business, with our CIO reporting directly to our Chief Executive Officer.\n \nOur CISO and Deputy CISO receive reports on cybersecurity threats from a number of experienced information security professionals for various parts of our business on an ongoing \n16\nTable of \nContents\nbasis and, in conjunction with other management personnel, regularly consult on risk management measures implemented by the Company to identify and mitigate data protection and cybersecurity risks.\nIn addition, our Risk and Compliance Committee (RCC) is responsible for oversight and support of the Company’s Enterprise Risk Management and Compliance and Ethics programs and is comprised of the Executive Leadership Team and the Senior Vice President and Chief Accounting, Risk, and Compliance Officer (Compliance Officer). The RCC also created a subcommittee, the Enterprise Risk Management Committee (ERMC), who is charged with continually monitoring, evaluating, and managing enterprise risks. The ERMC includes the Compliance Officer, General Auditor, Vice President Law - Finance, Compliance and Commercial Litigation, Vice President and Chief Safety Officer, CISO, Vice President - Strategy and Corporate Development, and Assistant Vice President - Executive Services. The RCC and ERMC both meet throughout the year and receive periodic updates on cybersecurity from the CISO.",
    "item1b": "Item 1B. \nUnresolved Staff Comments\nNone.",
    "item1c": "Item 1C. \nCybersecurity\nRisk Management and Strategy\nThe Company is subject to cybersecurity threats that could have a material adverse impact on our results of operations, financial condition, and liquidity. See also our discussion in the Risk Factors in"
  }
}