{
  "ticker": "UPS",
  "cik": "0001090727",
  "company_name": "UNITED PARCEL SERVICE INC",
  "filing_date": "2025-02-18",
  "accession": "0001090727-25-000019",
  "primary_doc": "ups-20241231.htm",
  "item_sections": {
    "item1": "Item 1.\nBusiness\nOverview\nUnited Parcel Service, Inc. (\"UPS\"), founded in 1907, is a global package delivery and logistics provider. We offer a broad range of industry-leading products and services through our extensive global presence, serving over 200 countries and territories. Our services include transportation and delivery through our integrated air and ground network, distribution, contract logistics, ocean freight, airfreight, customs brokerage and insurance. In 2024, we delivered an average of 22.4 million packages per day, totaling 5.7 billion packages during the year. Total revenue in 2024 was $91.1 billion.\nStrategy\nOur strategy focuses on growing in the parts of our market that value our end-to-end network, including healthcare, business to business (“B2B”), small- and medium-sized businesses (“SMBs”), and international. We are continuing our journey to execute our \nCustomer First, People Led, Innovation Driven\n strategy. \nCustomer First\n is about reducing friction in the customer experience by anticipating and solving for customers' needs. We are focused on providing differentiated value through our capabilities and service. We strive to enable our customers to better compete and succeed by delivering what they tell us matters the most: speed, ease and service reliability.\nPeople Led\n focuses on our employee experience and how likely an employee is to recommend UPS employment to a friend or family member. We know successful outcomes are built from a strong culture and sense of partnership. We believe that when we take care of our people, they will take care of our customers. \nInnovation Driven\n is our focus on leveraging technology to optimize the volume that flows through our network. We continually seek to improve the productivity and efficiency of our global integrated network by using technology to move from a scanning to a sensing network, including using RFID technology in our\n Smart Package Smart Facilities\n.\n1\nIn the first quarter of 2025, we entered into an agreement in principle with our largest customer to significantly reduce the volume we deliver for them. We are making a deliberate shift to increase our focus on growing higher yielding volume. For additional information on the expected operational and financial impacts of this agreement, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”.\nCompetitive Strengths\nOur competitive strengths include:\nGlobal Smart Logistics Network\n. We believe that our integrated global air and ground network is the most extensive in the industry. We provide all types of package services (air, ground, domestic, international, commercial and residential) through a single pickup and delivery network that can be configured to meet customers' needs. Our sophisticated systems, including our RFID-enabled \nSmart Package Smart Facility\n technology, enable us to optimize network efficiency, asset utilization and enhance end-to-end visibility.\nGlobal Presence\n. We serve more than 200 countries and territories. We have a significant presence in all of the world’s major economies, allowing us to effectively and efficiently operate around the world.\nCutting-Edge Technologies\n. We are a global leader in developing technologies that help customers enhance their shipping and logistics business processes to lower costs, improve service and increase efficiency. We offer a variety of digital tools and capabilities that enable customers to integrate UPS functionality into their distribution channels, intended to deepen customer relationships. These tools allow customers to send, manage and track their shipments, and also provide their customers with value-added data about their shipments.\nBroad Portfolio of Services\n. Our service portfolio allows customers of all sizes to choose their most appropriate option. Increasingly, our customers benefit from UPS capabilities and solutions that integrate our services beyond package delivery. We continue to invest in specialized capabilities like our cold chain and thermal monitoring technologies, which we believe allow us to better serve our healthcare customers.\nCustomer Relationships\n. We focus on building and maintaining long-term customer relationships. We believe value-added services beyond package delivery and connecting our small package, supply chain, digital and on-demand services across our customer base, are important to customer retention and growth.\nBrand Equity\n. We have built a leading and trusted brand that stands for service quality, reliability and innovation. Our vehicles and the professional courtesy of our drivers are major contributors to our brand equity.\nDistinctive Culture\n. We believe that the dedication of our employees comes in large part from our strong, purpose-driven culture that fosters trust, partnership and empowerment. We encourage our people to bring their unique perspectives, background, talents and skills to work every day. \nFinancial Strength\n. Our financial strength allows us to continue to pursue strategic opportunities that facilitate our growth. This includes investing in digital technology, acquisitions, transportation equipment, facilities and employee development to generate value for shareholders. We seek to maintain a strong credit rating to give us additional flexibility in running the business.\nProducts and Services; Reporting Segments \nWe have two reporting segments: U.S. Domestic Package and International Package. Our remaining businesses are reported as Supply Chain Solutions. U.S. Domestic Package and International Package are together referred to as our global small package operations.\nGlobal Small Package\nOur global small package operations provide time-definite delivery services for express letters, documents, packages and palletized freight via air and ground services. These services are supported by numerous shipping, visibility and billing technologies including our Digital Access Program, which embeds our shipping solutions directly into leading e-commerce platforms, enabling us to reach SMBs and e-commerce markets more broadly.\nWe combine all packages within our single, global network, unless dictated by specific service commitments. This enables efficiently scheduled pick ups for any service level. Our network provides unique operational and capital efficiencies that also have a smaller environmental impact than single service network designs.\n2\nWe offer same-day pickup of air and ground packages seven days a week through a broad variety of network access points including, UPS drop boxes, UPS Access Point locations and The UPS Store locations. UPS drivers can also directly accept packages. \nWe offer a portfolio of returns services in approximately 150 countries. These returns services are driven by the continued prevalence of e-commerce that has increased our customers' needs for efficient and reliable returns and are designed to promote efficiency and a friction-free consumer experience.\nOur global air operations hub is located in Louisville, Kentucky, and is supported by air hubs across the United States (\"U.S.\") and internationally. We operate international air hubs in Germany, China, Hong Kong, Canada and Florida (for Latin America and the Caribbean). This design enables cost-effective package processing using fewer, larger and more fuel-efficient aircraft.\nU.S. Domestic Package\nWe are a leader in time-definite, guaranteed small package delivery services in the United States. We offer a full spectrum of U.S. domestic air and ground package transportation services. Our U.S. ground fleet serves all business and residential zip codes in the contiguous United States. \n•\nOur air portfolio offers time-definite, same-day, next-day, two-day and three-day delivery alternatives as well as air cargo services.\n•\nOur ground network enables customers to ship using our day-definite ground service. We deliver approximately 16 million ground packages per day, most within one to three business days.\n•\nUPS SurePost provides residential ground service for customers with non-urgent, lightweight residential shipments. Through 2024, final delivery was often provided by the United States Postal Service (\"USPS\"). Beginning January 1, 2025, in order to have more control over our ability to provide our customers industry-leading service, we have insourced this product. For additional information, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”.\nInternational Package\nInternational Package consists of our small package operations in Europe, the Indian sub-continent, Middle East and Africa (together \"EMEA\"), Canada and Latin America (together \"Americas\") and Asia. We offer a wide selection of guaranteed day- and time-definite international shipping services.\nFor international package shipments that do not require express services, UPS Worldwide Expedited offers a reliable, deferred, day-definite service option. For cross-border ground package delivery, we offer UPS Standard delivery services within Europe, between the U.S. and Canada, and between the U.S. and Mexico. Worldwide Economy offers a contract-only, e-commerce solution for non-urgent, cross-border shipments. UPS Worldwide Express Freight is a premium international service for urgent, palletized shipments over 150 pounds.\nSupply Chain Solutions\nSupply Chain Solutions consists of our forwarding, logistics, digital and other businesses. Serving more than 200 countries and territories, we strategically seek to provide integration across increasingly complex, specialized and fragmented supply chains.\nForwarding\nWe are one of the largest U.S. domestic airfreight carriers and airfreight forwarders globally. We offer a portfolio of guaranteed and non-guaranteed global airfreight services. Additionally, as one of the world’s leading non-vessel operating common carriers, we provide ocean freight full container load, less-than-container load and multimodal transportation services between most major ports around the world. We also provide customs brokerage as well as various related services. \nIn September 2024, we completed the divestiture of our truckload brokerage business (\"Coyote\"). For additional information on this divestiture, see note 8 to the audited, consolidated financial statements.\nLogistics\nOur global logistics and distribution business provides value-added fulfillment and transportation management services. We operate both multi-client and dedicated facilities across our network, many of which are strategically located near UPS air \n3\nand ground transportation hubs to support rapid delivery to business and consumer markets. We continue to invest in facility automation to enhance operational efficiency.\nWe offer world-class technology, deep expertise and a highly sophisticated suite of healthcare logistics services. With a strategic focus on serving the unique, priority-handling needs of healthcare and life sciences customers, we continue to increase our complex cold-chain logistics capabilities both in the U.S. and internationally. In furtherance of this strategy, we have continued to grow organically, making investments in facilities to expand our network, and inorganically, including through the acquisitions of Frigo-Trans and Biotech & Pharma Logistics in January 2025.\nDigital and other Supply Chain Solutions businesses\nOur digital businesses leverage technology to enable a range of on-demand services. Roadie, our crowdsourced delivery platform, offers the convenience of same-day delivery and efficient service for packages that are not compatible with our small package network. Happy Returns offers innovative end-to-end return services that leverage The UPS Store network. We also offer integrated supply chain and high-value shipment insurance solutions through UPS Capital, as well as a range of services through our other Supply Chain Solutions businesses. We believe these services better enable us to meet customers' needs and deepen customer relationships.\nHuman Capital\nOur success is dependent upon our people, working together with a shared purpose. As we seek to capture new opportunities and pursue growth, we are focused on maintaining the culture we have cultivated over our nearly 118-year history and incorporating the new perspectives we need to take the business into the future.\nTo assist with employee recruitment and retention, we continue to review the competitiveness of our employee value proposition, including benefits and pay, training, talent development and advancement opportunities. For additional information on the importance of our human capital efforts, see \"Risk Factors - Business and Operating Risks -\n \nFailure to attract or retain qualified employees could materially adversely affect us\" and \"- Strikes, work stoppages or slowdowns by our employees could materially adversely affect us\".\nWe have approximately 490,000 employees (excluding temporary seasonal employees), of which 406,000 are in the U.S. and 84,000 are located internationally. Our global workforce includes approximately 78,000 management employees (38% of whom are part-time) and 412,000 hourly employees (50% of whom are part-time). More than 75% of our U.S. employees are represented by unions, primarily those employees handling or transporting packages. Many of these employees are employed under a national master agreement and various supplemental agreements with local unions affiliated with the International Brotherhood of Teamsters (\"Teamsters\"). Our national master agreement with the Teamsters expires on July 31, 2028. In addition, approximately 3,300 of our pilots are represented by the Independent Pilots Association (\"IPA\"). Our agreement with the IPA becomes amendable September 1, 2025. We have approximately 1,900 airline mechanics who are covered by a collective bargaining agreement with Teamsters Local 2727 which becomes amendable November 1, 2026. In addition, approximately 3,000 of our auto and maintenance mechanics who are not represented by the IBT are employed under a collective bargaining agreement with the International Association of Machinists and Aerospace Workers (\"IAM\"). In July 2024, the IAM ratified a new collective bargaining agreement that will expire on July 31, 2029.\nDuring 2024, we executed under our \"Fit to Serve\" initiative, intended to right-size our business and create a more efficient operating model to enhance responsiveness to changing market dynamics. During 2024, we reduced our workforce by approximately 14,000 positions, primarily within management. Fit to Serve is expected to conclude in 2025.\nIn January 2025, we announced a reconfiguration of our U.S. network and \nEfficiency Reimagined\n initiatives. We expect these actions to result in decreases in the size of our operational and management workforce. For additional information on the expected operational and financial impacts of these initiatives, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”.\nOversight and management\nOur board, directly and through the Compensation and Human Capital Committee, is responsible for oversight of human capital matters. Effective oversight is accomplished through a variety of methods and processes including regular updates and discussions around human capital transformation efforts, technology initiatives impacting the workforce, health and safety matters, employee survey results related to culture and other matters, hiring and retention, employee backgrounds, labor relations and contract negotiations, compensation and benefits, succession planning and employee training initiatives.\n4\nIn addition, the Compensation and Human Capital Committee charter includes oversight responsibility for performance and talent management, workforce representation, work culture and employee development and retention. We believe the board’s oversight of these matters helps identify and mitigate exposure to labor and human capital management risks and is part of the broader framework that guides how we attract, retain and develop a workforce that aligns with our values and strategies.\nAdditional information on our human capital efforts is contained in our annual sustainability report, which describes our activities that support our commitment to acting responsibly and contributing to society. This report is available under the heading \"Our Impact\" at www.about.ups.com.\nCollective bargaining\nWe bargain in good faith with the unions that represent our employees. We frequently engage union leaders at the national level and at local chapters throughout the United States. We participate in works councils and associations outside the U.S., which allows us to respond to emerging issues abroad. This work helps our operations to build and maintain productive relationships with our employees. For additional information regarding employees employed under collective bargaining agreements, see note 6 to the audited, consolidated financial statements.\nEmployee health and safety\nWe seek to provide industry-leading employee health, safety and wellness programs across our workforce. UPS's Comprehensive Health and Safety Program (\"CHSP\") is an occupational health and safety system tailored to our varied operational environments. \nOur CHSP covers a wide array of roles, from package handling to administration, and spans geographical boundaries to include sorting facilities, mobile logistics, administrative offices, and other locations worldwide. UPS conducts audits to assess specific risks and hazards, including equipment safety, workplace environment, and emergency response protocols. We monitor our safety performance through various measurable targets, including recordable injury frequency, lost time injury frequency and the number of recorded auto accidents.\nCustomers\nBuilding and maintaining long-term customer relationships through superior service is a competitive strength of UPS. In 2024, we served 1.6 million shipping customers and more than 10.1 million delivery recipients daily. For the year ended December 31, 2024, one customer, Amazon.com, Inc. and its affiliates, represented approximately 11.8% of our consolidated revenues, substantially all of which was within our U.S. Domestic Package segment. In the first quarter of 2025, we entered into an agreement in principle with this customer that will provide for a reduction in their volume by more than 50% by June 2026. For additional information on the expected operational and financial impacts arising from this agreement, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”. For additional information on this and other customers, see \"Risk Factors - Business and Operating Risks - Changes in our relationships with any of our significant customers, including the loss or reduction in business from one or more of them, could have a material adverse effect on us\" and note 14 to the audited, consolidated financial statements.\nCompetition\nWe offer a broad array of transportation and logistics services and compete with many local, regional, national and international logistics providers as well as national postal services. We believe our strategy, network and competitive strengths position us well to compete in the marketplace. For additional information on our competitive environment, see \"Risk Factors - Business and Operating Risks - Our industry is rapidly evolving. We expect to continue to face significant competition, which could materially adversely affect us\".\nGovernment Regulation\nWe are subject to numerous laws and regulations in the countries in which we operate. Continued compliance with increasingly stringent laws, regulations and policies in the U.S. and in the other countries in which we operate may result in materially increased costs, or we could be subject to substantial fines or possible revocation of our authority to conduct our operations.\n5\nAir Operations\nThe U.S. Department of Transportation (\"DOT\"), the Federal Aviation Administration (\"FAA\") and the U.S. Department of Homeland Security, through the Transportation Security Administration (\"TSA\"), have primary regulatory authority over our air transportation services. \nThe DOT’s authority primarily relates to economic aspects of air transportation, such as operating authority, insurance requirements, pricing, non-competitive practices, interlocking relations and cooperative agreements. The DOT also regulates international routes, fares, rates and practices and is authorized to investigate and take action against discriminatory treatment of U.S. air carriers abroad. International operating rights for U.S. airlines are usually subject to bilateral agreements between the U.S. and foreign governments or, in the absence of such agreements, by principles of reciprocity. We are also subject to current and potential aviation, health, customs and immigration regulations imposed by governments in other countries in which we operate, including registration and license requirements and security regulations. We have international route operating rights granted by the DOT and we may apply for additional authorities when those operating rights are available and are required for the efficient operation of our international network. The efficiency and flexibility of our international air transportation network is subject to DOT and foreign government regulations and operating restrictions.\nThe FAA’s authority primarily relates to operational, technical and safety aspects of air transportation, including certification, aircraft operating procedures, transportation of hazardous materials, record keeping standards and maintenance activities and personnel. In addition, we are subject to non-U.S. government regulation of aviation rights involving non-U.S. jurisdictions and non-U.S. customs regulation.\nUPS's aircrew, dispatch and aircraft maintenance certification, training, programs and procedures, including aircraft inspection and repair at periodic intervals, are approved for all aircraft and carrier operations under FAA regulations. The future cost of changes and repairs pursuant to these programs and procedures may fluctuate according to aircraft condition, age and the enactment of additional FAA regulatory requirements.\nThe TSA regulates various security aspects of air cargo transportation. Our airport and off-airport locations, as well as our personnel, facilities and procedures involved in air cargo transportation must comply with TSA regulations.\nWe participate in the Civil Reserve Air Fleet (\"CRAF\") program. Our participation in this program allows the U.S. Department of Defense (\"DOD\") to requisition specified UPS aircraft for military use during a national defense emergency. The DOD is required to compensate us for any use of aircraft under the CRAF program. In addition, participation in the CRAF program entitles us to bid for other U.S. Government opportunities including small package and airfreight. \nGround Operations\nOur ground transportation of packages in the U.S. is subject to regulation by the DOT and its agency, the Federal Motor Carrier Safety Administration (the \"FMCSA\"). Ground transportation also falls under state jurisdiction with respect to the regulation of operations, safety and insurance. Our ground transportation of hazardous materials in the U.S. is subject to regulation by the DOT's Pipeline and Hazardous Materials Safety Administration. We also must comply with safety and fitness regulations promulgated by the FMCSA, including those relating to drug and alcohol testing and hours of service for drivers. Ground transportation of packages outside of the U.S. is subject to similar regulatory schemes in the countries in which we transport those packages.\nThe Postal Reorganization Act of 1970 created the USPS as an independent establishment of the executive branch of the federal government, and created the Postal Rate Commission, an independent agency, to recommend postal rates. The Postal Accountability and Enhancement Act of 2006 amended the 1970 Act to give the re-named Postal Regulatory Commission revised oversight authority over many aspects of the USPS, including postal rates, product offerings and service standards. As a result of recent changes in the USPS operating model, in January 2025 we announced that we have begun delivering 100% of our SurePost volume. We sometimes participate in proceedings before the Postal Regulatory Commission in an attempt to facilitate compliance with fair competition requirements for competitive services.\nOur ground operations are also subject to compliance with various cargo-security and transportation regulations issued by the U.S. Department of Homeland Security, including regulation by the TSA in the U.S., and similar regulations issued by foreign governments in other countries.\nCustoms\nWe are subject to the customs laws regarding the import and export of shipments in the countries in which we operate, including those related to the filing of documents on behalf of client importers and exporters. Our activities in the U.S., \n6\nincluding customs brokerage and freight forwarding, are subject to regulation by the Bureau of Customs and Border Protection, the TSA, the U.S. Federal Maritime Commission and the DOT. Our international operations are subject to similar regulatory structures in their respective jurisdictions. \nFor additional information, see \"Risk Factors – Business and Operating    Risks – We maintain significant physical operations. Increases in operational security requirements impose substantial costs on us and we could be the target of an attack or have a security breach, which could materially adversely affect us\".\nEnvironmental\nWe are subject to U.S. and international federal, state and local environmental laws and regulations across all of our operations. These laws and regulations cover a variety of matters such as disclosures, operations and processes, including, but not limited to: properly storing, handling and disposing of waste materials; appropriately managing waste water and storm water; monitoring and maintaining the integrity of underground storage tanks; complying with laws regarding clean air, including those governing emissions; protecting against and appropriately responding to spills and releases and communicating the presence of reportable quantities of hazardous materials to local responders. We maintain site- and activity-specific environmental compliance and pollution prevention programs to address our environmental responsibilities and remain compliant. In addition, we maintain numerous programs which seek to minimize waste and prevent pollution within our operations.\nPursuant to the Federal Aviation Act, the FAA - with the assistance of the Environmental Protection Agency - is authorized to establish standards governing aircraft noise. Our aircraft fleet complies with current noise standards of the federal aviation regulations. Our international operations are also subject to noise regulations in certain other countries in which we operate. \nFor additional information, see \"Risk Factors – Regulatory and Legal Risks – Increasingly stringent regulations related to climate change, including reporting obligations, could materially increase our operating costs\". \nCommunications and Data Protection\nAs we use radio and other communication facilities in our operations, we are subject to the Federal Communications Act of 1934, as amended. In addition, the Federal Communications Commission regulates and licenses our activities pertaining to satellite communications. \nWe are subject to a variety of evolving laws and regulations in the U.S. and abroad regarding privacy, cybersecurity, data protection and data security, including the European Union General Data Protection Regulation and China's Personal Information Protection Law. There has recently been increased regulatory and enforcement focus on data protection in the U.S. (at both the state and federal level) and in other countries. \nFor additional information, see \"Risk Factors – Business and Operating Risks – A significant cybersecurity incident, or increased data protection regulations, could materially adversely affect us\".\nHealth and Safety\nWe are subject to numerous federal, state and local laws and regulations governing employee health and safety, both in the U.S. and in other countries. Compliance with changing laws and regulations from time to time, including those promulgated by the U.S. Occupational Safety and Health Administration and state agencies, could result in materially increased operating costs and capital expenditures, and negatively impact our ability to attract and retain employees.\nFor additional information on governmental regulations and their potential impact on us generally, see \"Risk Factors – Regulatory and Legal Risks\".\nWhere You Can Find More Information\nWe maintain websites for business and customer matters at \nwww.ups.com\n, and for investor relations matters at \nwww.investors.ups.com\n. Our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to those reports filed with or furnished to the SEC pursuant to Section 13(a) of the Securities Exchange Act of 1934 are made available free of charge on our investor relations website under the heading \"Investors - SEC Filings\" as soon as reasonably practical after we electronically file or furnish the reports to the SEC. \nOur Code of Business Conduct, which applies to all of our directors, officers and employees, including our principal executive and financial officers, our Corporate Governance Guidelines and the charters for our Audit, Compensation and \n7\nHuman Capital, Risk, and Nominating and Corporate Governance Committees are also available on our investor relations website under the heading \"Investors – Corporate Governance\". In the event that we make changes in, or provide waivers from, the provisions of the Code of Business Conduct that the SEC requires us to disclose, we intend to disclose these events within four business days following the date of the amendment or waiver under that heading on our investor relations website.\nOur sustainability reporting, which describes our activities that support our commitment to acting responsibly and contributing to society, is available under the heading \"Our Impact\" at \nwww.about.ups.com\n.\nWe provide the addresses to our websites solely for information. We do not intend for any addresses to be active links or to otherwise incorporate the contents of any website into this or any other report we file with the SEC.\nDisclosures Required Pursuant to Section 13(r) of the Securities Exchange Act of 1934\nThe Company had no reportable transactions during the quarter ended December 31, 2024. The information provided pursuant to Section 13(r) of the Exchange Act in Item 5 of Part II of the Company's \nQuarterly Report on Form 10-Q\n for the quarter ended September 30, 2024 is incorporated by reference herein.\n8",
    "item1a": "Item 1A.\nRisk Factors\nOur business, financial condition and results of operations are and will remain subject to numerous risks and uncertainties. You should carefully consider the following risk factors, which may have materially affected or could materially affect us, including impacting our business, financial condition, results of operations, stock price, credit rating or reputation. You should read these risk factors in conjunction with \"Management’s Discussion and Analysis of Financial Condition and Results of Operations\" in Item 7 and our \"Financial Statements and Supplementary Data\" in Item 8. These are not the only risks we face. We could also be affected by other unknown events, factors, uncertainties, or risks that we do not currently consider to be material.\nBusiness and Operating Risks\nChanges in general economic conditions, in the U.S. and internationally, may adversely affect us.\nWe conduct operations in over 200 countries and territories. Our operations are subject to national and international economic factors, as well as the local economic environments in which we operate. Changes in general economic conditions are beyond our control, and it may be difficult for us to adjust our business model. For example, we are affected by industrial production, inflation, unemployment, consumer spending and retail activity levels. We have been, and may in the future be, materially affected by adverse developments in these aspects of the economy. We have also been, and may in the future be, adversely impacted by changes in general economic conditions resulting from geopolitical uncertainty and/or conflicts in or arising from the countries and regions where we operate, including the European Union, Ukraine, the Russian Federation, the Middle East and the Trans-Pacific region. Changes in general economic conditions, or our inability to accurately forecast these changes or mitigate the impact of these conditions on our business, could materially adversely affect us.\nOur industry is rapidly evolving. We expect to continue to face significant competition, which could materially adversely affect us.\nOur industry continues to rapidly evolve, including demands for faster deliveries, increased visibility into shipments and development of other services. We expect to continue to face significant local, regional, national and international competition. Competitors include the U.S. and international postal services, various motor carriers, express companies, freight forwarders, air couriers, large transportation companies, e-commerce companies and other retailers that continue to make significant investments in their own technology and logistics capabilities, some of whom are currently our customers. We also face competition from start-ups and other smaller companies that combine technologies with flexible labor solutions such as crowdsourcing. New and emerging technologies are also creating additional sources of competition. Competitors have cost, operational and organizational structures that differ from ours and may offer services or pricing terms that we are not willing to offer. Additionally, from time to time we have raised, and may in the future raise, prices and our customers may not be willing to accept these higher prices. If we do not appropriately respond to competitive pressures, including retaining or replacing volume lost to competitors or maintaining our profitability, we could be materially adversely affected.\nIndustry growth, or lack thereof, may further increase competition. As a result, opportunities for growth could be limited or competitors may improve their financial capacity and strengthen their competitive positions. Business combinations could also result in competitors providing a wider variety of services and products at competitive prices, which could also materially adversely affect us.\nChanges in our relationships with any of our significant customers, including the loss or reduction in business from one or more of them, could have a material adverse effect on us.\n For the year ended December 31, 2024, one customer, Amazon.com, Inc. and its affiliates, accounted for 11.8% of our consolidated revenues. In the first quarter of 2025, we entered into an agreement in principle with this customer that will provide for a reduction in their volume by more than 50% by June 2026. In connection therewith, we are making certain business and operational changes intended to match our workforce to our activity and eliminate our stranded costs. In the event we are not able to successfully reduce our costs in connection therewith, our profitability could be materially impacted. For additional information on the expected operational and financial impacts arising from this agreement, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”.\nSome of our other larger customers can account for a relatively significant portion of our volume and revenues in a particular quarter or year. Customer impact on our revenue and profitability can vary based on a number of factors, including: contractual volume amounts; pricing terms; product launches; e-commerce or other industry trends, including those related to the holiday season; business combinations and the overall growth of a customer's underlying business; as well as any disruptions to their businesses. Customers could choose, and have in the past chosen, to divert all or a portion of their business \n9\nwith us to one of our competitors, demand pricing concessions, request enhanced services that increase our costs, or develop their own logistics capabilities. In addition, certain of our significant customer contracts include termination rights of either party upon the occurrence of certain events or without cause upon advance notice to the other party. If all or a portion of our business relationships with one or more significant customers were to terminate or significantly change, this could materially adversely affect us.\nFailure to attract or retain qualified employees could materially adversely affect us.\nWe depend on the skills and continued service of our large workforce. We also regularly hire a large number of part-time and seasonal workers. We must be able to attract, develop and retain a large and diverse global workforce. If we are unable to hire, properly train or retain qualified employees, we could experience higher labor costs, reduced revenues, further increased workers' compensation and automobile liability claims costs, regulatory noncompliance, customer losses and diminution of our brand value or company culture, which could materially adversely affect us. Our ability to control labor costs has in the past been, and is expected to continue to be, subject to numerous factors, including labor-related contractual obligations, turnover, training costs, regulatory changes, market pressures, inflation, unemployment levels and healthcare and other benefit costs.\nIn addition, we continue to strive to lower our cost to serve, including labor costs, through various strategic initiatives. Our inability to continue to retain experienced and motivated employees through the execution of these initiatives may also materially adversely affect us.\nStrikes, work stoppages or slowdowns by our employees could materially adversely affect us.\nMany of our U.S. employees are employed under a national master agreement and various supplemental agreements with local unions affiliated with the International Brotherhood of Teamsters (the \"Teamsters\"). Our national master agreement with the Teamsters runs through July 31, 2028. Our airline pilots, airline mechanics, ground mechanics and certain other employees are employed under other collective bargaining agreements that expire at various times. In addition, some of our international employees are employed under collective bargaining or similar agreements. Other employees may choose to organize in the future. Actual or threatened strikes, work stoppages or slowdowns by our employees could adversely affect our ability to meet our customers' needs. As a result, customers have in the past reduced, and in the future may reduce, their business or stop doing business with us if they believe that such actions or threatened actions may adversely affect our ability to provide services. We may permanently lose customers if we are unable to provide uninterrupted service, and this could materially adversely affect us. The terms of collective bargaining agreements also may affect our competitive position and results of operations. Furthermore, our actions or responses to any such negotiations, labor disputes, strikes or work stoppages could negatively impact how our brand is perceived and our reputation and could have adverse effects on our business, including our results of operations.\nWe maintain significant physical operations. Increases in operational security requirements impose substantial costs on us and we could be the target of an attack or have a security breach, which could materially adversely affect us.\nAs a result of concerns about global terrorism and physical security, various governments have adopted and may adopt additional heightened security requirements, resulting in significantly increased operating costs. Regulatory and legislative requirements may change periodically in response to evolving threats. We cannot determine the effect that any new requirements will have on our operations, cost structure or operating results, and new rules or other future security requirements may significantly increase our operating costs and reduce operating efficiencies. Compliance with security requirements or our own security measures may not prevent attacks or security breaches, which could materially adversely affect one or more of our operations, or our business.\nA significant cybersecurity incident, or increased data protection regulations, could materially adversely affect us.\nWe rely on information technology networks and systems and other operational technologies, including the internet and a number of internally-developed systems and applications, as well as certain technology systems from third-party vendors (collectively referred to as \"IT\"), to operate our business. For example, we rely on these technologies to receive package level information in advance of the physical receipt of packages, move and track packages through our operations, efficiently plan deliveries, execute billing processes, provide information to package recipients, manage employee data and track and report financial and operational data. Our franchise locations and subsidiaries also rely on IT systems to manage their business processes and activities.\nIT and other systems (ours, as well as those of our franchisees, acquired businesses, and third-party service providers) have been and will continue in the future to be susceptible to damage, disruptions and shutdowns due to programming errors, defects or other vulnerabilities, power outages, hardware failures, misconfigurations, computer viruses, cyber-attacks, encryption caused by ransomware or malware attacks, exfiltration of data, attacks by foreign governments, state-sponsored \n10\nactors, or criminal groups, theft, misconduct by employees or other insiders, telecommunications failures, misuse, human errors or other catastrophic events. In recent periods, the frequency and sophistication of cyber-attacks have increased and are expected to continue to increase, including as a result of state-sponsored cybersecurity attacks during periods of geopolitical conflict, such as the ongoing conflicts in Ukraine and the Middle East. In addition, the rapid evolution and increased adoption of artificial intelligence technologies may intensify our cybersecurity risks. Accordingly, we may be unable to anticipate these techniques or to implement adequate measures to recognize, detect or prevent the occurrence of any of the events described above. In addition, our security processes, protocols and standards may not prove to be sufficient, effective or may not be complied with, either intentionally or inadvertently. To date, we have not experienced a material cybersecurity incident. However, cybersecurity incidents have in the past and may in the future expose us, our customers, employees, franchisees, service providers or others, to loss, disclosure or misuse of proprietary information and sensitive or confidential data or result in disruptions to our operations or those of our customers, franchisees, service providers or others.\n \nFor example, cyber criminals have in the past gained access, and are expected to continue to try to gain access to customer accounts. The type of activity includes fraudulently inserting, diverting and misappropriating items being transported in our network, fraudulently charging shipment fees to customer or franchisee accounts, and fraudulently sending text messages to recipients purporting to be from UPS. The occurrence of any of the events described above could result in material disruptions in our business, the loss of existing or potential customers, damage to our brand and reputation, additional regulatory scrutiny, litigation and other potential material liability. We also may not discover the occurrence of any of the events described above for a significant period of time after the event occurs. Additionally, it may take considerable time for us to investigate and evaluate the full impact of incidents, particularly for sophisticated attacks. These factors may inhibit our ability to provide prompt, full, and reliable information about the incident to our customers, regulators and the public.\nWe utilize and interact with the IT networks and systems of third parties for many aspects of our business, including related to our customers, franchisees and service providers such as cloud service providers and third-party delivery services. These third parties have access to information we maintain about our company, operations, customers, employees and vendors, or operating systems that are critical to or can significantly impact our business operations. These third parties are subject to risks described above, and other risks, that could damage, disrupt or close down their networks or systems. Security processes, protocols and standards that we implement and contractual provisions requiring security measures that we impose on such third parties, may not be sufficient or effective at preventing such events or may not be adhered to. These events have in the past and could in the future result in unauthorized access to, or disruptions or denials of access to, misuse or disclosure of, information or systems that are important to us, including proprietary information, sensitive or confidential data, and other information about our operations, customers, employees and suppliers, including personal information.\nWe have invested and expect to continue to invest in IT security initiatives, IT risk management and disaster recovery capabilities. The costs and operational consequences of implementing, maintaining and enhancing further data or system protection measures could increase significantly to overcome increasingly frequent, complex and sophisticated cyber threats and regulatory requirements.\nIn addition, our customers’ confidence in our ability to protect data and systems and to provide services consistent with their expectations could be impacted, further disrupting our operations. While we maintain cyber insurance, we cannot be certain that our coverage will be adequate for liabilities actually incurred, that insurance will continue to be available to us on economically reasonable terms, or at all, or that any insurer will not deny coverage as to any future claim.\nAlthough to date we are unaware of any material data breach or cybersecurity incident, including an information system disruption, we cannot provide any assurances that such material events and impacts will not occur in the future. Our efforts to deter, identify, mitigate and/or eliminate future breaches or cybersecurity incidents may require significant additional effort and expense and may not be successful.\nIn addition, there has recently been heightened regulatory and enforcement focus relating to the collection, use, retention, transfer, and processing of personal data in the U.S. (at both the state and federal level) and internationally, including the EU’s General Data Protection Regulation, the California Privacy Rights Act, the Virginia Consumer Data Protection Act, and other similar laws that have been or are expected to be enacted by other jurisdictions. In addition, China and certain other jurisdictions have enacted more stringent data localization requirements. An actual or alleged failure to comply with applicable data protection laws, regulations, or other data protection standards has in the past and may in the future expose us to litigation, fines, sanctions, or other penalties, which could harm our reputation and adversely affect our business, results of operations, and financial condition. The regulatory environment is increasingly challenging, based on discretionary factors, and difficult to predict. Consequently, compliance with applicable regulations in the various jurisdictions in which we do business may present material obligations and risks to our business, including significantly expanded compliance burdens, costs, and enforcement risks which are expected to increase over time; require us to make extensive system or operational changes; or adversely affect the cost or attractiveness of the services we offer.\n11\nFailure to maintain our brand image and corporate reputation could materially adversely affect us.\nOur success depends in part on our reputation and our ability to maintain the image of the UPS brand. Service quality issues, actual or perceived, could tarnish the image of our brand and may cause customers not to use UPS services. Also, adverse publicity or public sentiment surrounding labor relations, safety matters, environmental, sustainability and governance concerns, physical or cyber security matters, political activities and similar matters, or attempts to connect our company to such issues, either in the U.S. or elsewhere, could materially adversely affect us. For example, damage to our reputation or loss of brand equity could require the allocation of resources to rebuild our reputation and restore the value of our brand. The proliferation of social media may increase the likelihood, speed, and magnitude of negative brand events.\nGlobal climate change could materially adversely affect us. \nThe effects of climate change present financial and operational risks to our business, both directly and indirectly. We have publicly stated our intention to reduce our carbon emissions, including our goal to achieve carbon neutrality in our global operations by 2050 and our other short- and mid-term environmental sustainability goals. \nOur ability to meet our goals will depend in part on significant technological advancements, many of which are outside of our control. This includes the development and availability of reliable, affordable and low emission energy solutions, including sustainable aviation fuel and alternative fuel and battery electric vehicles. There can be no assurances that our goals and strategic plans to achieve those goals will be successful, that the related costs will not be higher than expected, that the necessary technological advancements will occur in the timeframe we expect, or at all, that the severity of and or the pace of negative climate-related effects will not accelerate faster than expected, or that proposed regulation or deregulation related to climate change will not have a negative competitive impact, any one of which could have a material adverse effect on our capital expenditures or other expenses, revenue or results of operations. \nFurthermore, methodologies for reporting climate-related information may change and previously reported information may be adjusted to reflect new reporting protocols or regulations. Other changes could include improvements in the availability and quality of third-party data, changing assumptions, changes in the nature and scope of our operations and other changes in circumstances. Our processes and controls for reporting climate-related information across our operations are evolving along with multiple disparate standards for identifying, measuring and reporting sustainability metrics, including disclosures that may be required by the SEC, European and other regulators. Such standards may change over time, which could result in significant revisions to our current goals, reported progress in achieving such goals, or our ability to achieve such goals in the future. Changes in regulation or technology impacting our business could require us to write down the carrying value of assets, which could result in material impairment charges.\nMoreover, we may determine that it is in our best interests to prioritize other business, social, governance or sustainable investments over the achievement of our current goals based on economic, regulatory or social factors, business strategy or other factors. If we do not meet these goals or there is perception that we failed to meet these goals, then, in addition to regulatory and legal risks related to compliance, we could incur adverse publicity and reaction, which could adversely impact our reputation, and in turn adversely impact our results of operations.\nSevere weather or other natural or man-made disasters could materially adversely affect us.\nThe increased severity or frequency of certain weather conditions (including as a result of climate change) or other natural or man-made disasters, including storms, floods, fires, wind gusts, earthquakes, rising temperatures, epidemics, pandemics, conflicts, civil or political unrest, or terrorist attacks, have in the past and may in the future disrupt our business. Customers may reduce shipments, supply chains may be disrupted, demand may be negatively impacted, property may be damaged, employees may be injured, or our costs to operate our business may increase, any of which could have a material adverse effect on us. Any such event affecting one of our major facilities could result in a significant interruption in or disruption of our business. To the extent that weather conditions or other disasters become more frequent or severe, disruptions to our business and those of our customers and costs to repair damaged facilities or maintain or resume operations could increase. Furthermore, as a result of the impact of climate change on the frequency or severity of weather conditions and other disasters, insurance providers may reduce the availability or increase the cost of insurance.\nEconomic, political, or social developments and other risks associated with international operations could materially adversely affect us.\nWe have significant international operations and, as a result, we are exposed to changing economic, political and social developments in a number of countries, all of which are beyond our control. Emerging markets are often more volatile than those in other countries, and any broad-based downturn in these markets could reduce our revenues and materially adversely \n12\naffect our business, financial condition and results of operations. We are subject to many laws governing our international operations, including those that prohibit improper payments to government officials and commercial customers, govern our environmental impact or labor matters, restrict where we can do business, regulate our shipments to certain countries and limit information that we can provide to non-U.S. governments. Our failure to manage and anticipate these and other risks associated with our international operations could materially adversely affect us.\nOur inability to effectively integrate any acquired businesses and realize the anticipated benefits of any acquisitions, joint ventures or strategic alliances could materially adversely affect us.\nFrom time to time we acquire businesses, form joint ventures and enter into strategic alliances. Whether we realize the anticipated benefits from these transactions depends, in part, upon successful integration between the businesses involved, the performance of the underlying operations, capabilities or technologies and the management of the acquired operations. Accordingly, our financial results could be materially adversely affected by our failure to effectively integrate acquired operations, unanticipated performance or other issues or transaction-related charges.\nFinancial Risks\nChanging fuel and energy prices, including gasoline, diesel and jet fuel, and interruptions in supplies of these commodities could materially adversely affect us.\nFuel and energy costs have a significant impact on our operations. We require significant quantities of fuel for our aircraft and delivery vehicles and are exposed to the risks associated with variations in the market price for petroleum products, including gasoline, diesel and jet fuel. We seek to mitigate our exposure to changing fuel prices through our pricing strategy and have in the past and may in the future utilize hedging transactions. There can be no assurance that this strategy will be effective. If we are unable to maintain or increase our fuel surcharges, higher fuel costs could materially adversely impact our operating results. Even if we are able to offset changes in fuel costs with surcharges, high fuel surcharges have in the past, and may in the future result in a shift from our higher-yielding products to lower-yielding products or an overall reduction in volume, revenue and profitability. Moreover, we could experience a disruption in energy supplies as a result of new or increased regulation, war or other conflicts, weather-related events or natural disasters, actions by producers (including as part of their own sustainability efforts) or other factors beyond our control, which could have a material adverse effect on us.\nChanges in foreign currency exchange rates or interest rates may have a material adverse effect on us.\nWe conduct business in a number of countries, with a significant portion of our revenue derived from operations outside the United States. Our international operations are affected by changes in the exchange rates for local currencies, in particular the Euro, British Pound Sterling, Canadian Dollar, Chinese Renminbi and Hong Kong Dollar.\nWe are exposed to changes in interest rates, primarily on our short-term debt and that portion of our long-term debt that carries floating interest rates. Additionally, changes in interest rates impact the valuation of our pension and postretirement benefit obligations and the related costs recognized in the statements of consolidated income. The impact of changes in interest rates on our pension and postretirement benefit obligations and costs, and on our debt, is discussed further in Part I, \"Item 7 - Critical Accounting Estimates,\" and Part II, \"Item 7A - Quantitative and Qualitative Disclosures about Market Risk\", respectively, of this report.\nWe monitor and manage foreign currency exchange rate and interest rate exposures, and use derivative instruments to mitigate the impact of changes in these rates on our financial condition and results of operations; however, changes in foreign currency exchange rates and interest rates cannot always be predicted or effectively hedged, and may have a material adverse effect on us.\nOur business requires significant capital and other investments; if we do not accurately forecast our future investment needs, we could be materially adversely affected.\nOur business requires significant capital investments, including in aircraft, vehicles, technology, facilities and sortation and other equipment. In addition to forecasting our capital investment requirements, we adjust other elements of our operations and cost structure in response to economic and regulatory conditions. These investments support both our existing business and anticipated growth. Forecasting amounts, types and timing of investments involves many factors which are subject to uncertainty and may be beyond our control, such as technological changes, general economic trends, revenues, profitability, changes in governmental regulation and competition. If we do not accurately forecast our future capital investment needs, we could under- or over-invest, or have excess capacity or insufficient capacity, any of which could negatively affect our revenues and profitability.\n13\nEmployee health and retiree health and pension benefit costs represent a significant expense to us; further cost increases could materially adversely affect us.\nOur employee health, retiree health and pension benefit expenses are significant. In recent years, we have experienced increases in some of these costs, in particular, increases in healthcare costs in excess of the rate of inflation and discount rates that we use to value our company-sponsored defined benefit plan obligations. Increasing healthcare costs, volatility in investment returns and discount rates, as well as changes in laws, regulations and assumptions used to calculate retiree health and pension benefit expenses, may materially adversely affect our business, financial condition, or results of operations, and have required, and may in the future require significant contributions to our benefit plans. Our national master agreement with the Teamsters includes provisions that are designed to mitigate certain healthcare expenses, but there can be no assurance that our efforts will be successful or that these efforts will not materially adversely affect us.\nWe participate in various trustee-managed multiemployer pension and health and welfare plans for employees covered under collective bargaining agreements. As part of the overall collective bargaining process for wage and benefit levels, we have agreed to contribute certain amounts to the multiemployer benefit plans during the contract period. The multiemployer benefit plans set benefit levels and are responsible for benefit delivery to participants. Future contribution amounts to multiemployer benefit plans will be determined through collective bargaining. However, in future collective bargaining negotiations, we could agree to make significantly higher future contributions to one or more of these plans. At this time, we are unable to determine the amount of additional future contributions, if any, or whether any material adverse effect on us could result from our participation in these plans.\nInsurance and claims expense could materially adversely affect us.\nWe have a combination of both self-insurance and high-deductible insurance programs for the risks arising out of our business and operations, including claims exposure resulting from cargo loss, cyber-attacks, personal injury, property damage, aircraft and related liabilities, business interruption and workers' compensation. Self-insured workers' compensation, automobile and general liabilities are determined using actuarial estimates of the aggregate liability for claims incurred and an estimate of incurred but not reported claims, on an undiscounted basis. Our accruals for insurance reserves reflect certain actuarial assumptions and management judgments, which are subject to a high degree of variability. If the number, severity or cost of claims for which we retain risk continues to increase, our financial condition and results of operations could be materially adversely affected. If we lose our ability to, or decide not to, self-insure these risks, our insurance cost could materially increase and we may find it difficult to obtain adequate levels of insurance coverage.\nChanges in markets and our business plans have resulted, and may in the future result, in substantial impairments of the carrying value of our assets, thereby reducing our net income.\nWe regularly assess the carrying values of our assets relative to their estimated fair values. If the carrying value of an asset exceeds its estimated fair value, we may be required to incur charges to reduce the carrying value thereof. The determination of fair value is dependent on a significant number of estimates and assumptions that could be impacted by a variety of factors, including changes in business strategy, revenue, expenses, government regulations, including regulation related to climate change, costs of capital and economic or market conditions. The use of different estimates or assumptions could also result in different estimates of fair value. Our estimates of fair value have resulted from time to time, and may in the future result, in substantial impairments of our assets. For example, during the year ended December 31, 2023, as a result of a number of factors including changes in business strategy and challenging macroeconomic conditions such as increases in the risk-free interest rate and volatility of the stock prices of market comparables, we incurred impairment charges of $125 and $111 million in respect of goodwill and indefinite-lived intangible assets, respectively. While we did not identify any impairment of goodwill during 2024, certain of our reporting units experienced a decrease in the excess of their estimated fair values over their respective carrying values. Additional decreases could result in goodwill or other impairment charges, which could be material. We have been and may be required in the future to recognize impairments of long-lived assets, including definite-lived intangible assets, property, plant and equipment and leases. Furthermore, we have been and may be required in the future to recognize increased depreciation and amortization charges if we determine the useful lives or salvage values of our assets are less than we originally estimated. Changes in our business plans, including anticipated changes to our network in 2025, have previously and may in the future lead to revisions in our estimates of useful lives or salvage values of our assets. Such charges have in the past, and may in the future, reduce our net income, potentially materially.\nWe may have significant additional tax liabilities that could materially adversely affect us.\nWe are subject to income taxes in the U.S. and many foreign jurisdictions. Significant judgment is required in determining our worldwide provision for income taxes. There are many transactions and calculations where the ultimate tax determination is uncertain.\n14\nWe are regularly under audit by tax authorities in many jurisdictions. Economic and political pressures to increase tax revenue may make resolving tax disputes more difficult. The final determination of tax audits and any related litigation could be materially different from our historical income tax provisions and accruals. In addition, changes in U.S. federal and state or international tax laws, other fundamental law changes currently being considered by many countries, and changes in taxing jurisdictions’ administrative interpretations, decisions, policies and positions may materially adversely impact our tax expense and cash flows.\nRegulatory and Legal Risks\nIncreasingly complex and stringent laws, regulations and policies could materially increase our operating costs.\nWe are subject to complex and stringent aviation, transportation, environmental, security, labor, employment, safety, privacy, disclosure and data protection and other governmental laws, regulations and policies, both in the U.S. and internationally. In addition, we are impacted by laws, regulations and policies that affect global trade, including tariff and trade policies, export requirements, embargoes, sanctions, taxes, monetary policies and other restrictions and charges. Trade discussions and arrangements between the U.S. and various of its trading partners are fluid, and existing and future trade agreements are, and are expected to continue to be, subject to a number of uncertainties, including the imposition of new tariffs or adjustments and changes to the products covered by existing tariffs. The impact of new laws, regulations and policies or decisions or interpretations by authorities applying those laws and regulations, cannot be predicted. Compliance with any new laws, regulations or policies may increase our operating costs or require significant capital expenditures. Any failure to comply with applicable laws, regulations or policies in the U.S. or other countries could result in substantial fines or possible revocation of our authority to conduct our operations, which could materially adversely affect us. For example, as previously disclosed, the SEC recently investigated our controls and practices surrounding impairment analyses in connection with the divestiture of UPS Freight in April 2021. On November 22, 2024, we entered into a settlement with the SEC, without admitting or denying the SEC’s findings in connection with alleged violations of Section 17(a)(2) and (3) of the Securities Act of 1933 (and related provisions), resolving the investigation. Under the terms of the settlement, we agreed to pay a civil penalty, and agreed to remedial actions, training and process changes.\nIncreasingly stringent regulations related to climate change, including reporting obligations, could materially increase our operating costs.\nRegulation and required disclosures of greenhouse gas (\"GHG\") emissions and related matters exposes us to potentially significant new taxes, fees, disclosure and compliance obligations and other costs. Compliance with such regulation, and any increased or additional regulation, or the associated costs is further complicated by the fact that various countries and regions may adopt different approaches to climate change regulation and disclosures.\nIn the U.S., Congress has considered but, to date, not passed various bills that would regulate GHG emissions. Nevertheless, we believe some form of federal climate change legislation is possible in the future. Even in the absence of such legislation, the Environmental Protection Agency could determine to regulate GHG emissions, especially aircraft or diesel engine emissions, and this could impose substantial costs on us.\nInternational regulations also continue to increase and could materially increase our operating costs. For example, the ReFuelEU Aviation initiative, a European regulation, mandates jet fuel suppliers in Europe supply a target percentage of sustainable aviation fuel (“SAF”) at airports inside the European Union. The SAF target percentage starts at 2% in 2025 and increases to 70% by 2050. The cost of SAF can be higher than conventional jet fuel, and these suppliers can pass this cost along to purchasers, which can increase our operating costs, potentially significantly. In addition, the Carbon Offsetting and Reduction Scheme for International Aviation (\"CORSIA\"), a global, market-based emissions offset program to encourage carbon-neutral growth began a voluntary pilot phase in 2021, with mandatory participation scheduled to begin in 2027. Details regarding implementation of CORSIA continue to develop, and compliance may increase our operating costs, potentially significantly.\nIn addition, in January 2025, the President of the U.S. signed an executive order indicating that the U.S. would withdraw from the Paris Climate Accords. The effect that the withdrawal may have on future U.S. policy regarding GHG emissions, on CORSIA and on other GHG regulation remains uncertain. The extent to which other countries implement those accords could also have a material adverse effect on us.\nIncreased regulation relating to GHG emissions in the U.S. or abroad, especially aircraft, gasoline or diesel engine emissions, could, among other things, increase the cost of fuel and other energy we purchase and the capital costs associated with updating or replacing our aircraft or vehicles prematurely. We cannot predict the impact any future regulation will have on our cost structure or our operating results. It is likely that such regulation could significantly increase our operating costs and \n15\nthat we may not be willing or able to pass such costs along to our customers. Moreover, even without such regulation, increased awareness and any adverse publicity in the global marketplace about the GHGs emitted by companies in the airline and transportation industries could harm our reputation and reduce customer demand for our services, especially our air services.\nFurthermore, many countries, as well as U.S. states, in which we operate or are subject to regulation have adopted, or are expected to adopt, additional requirements relating to the disclosure of GHG emissions and related matters. In many cases these requirements differ and may conflict from country to country. Compliance with these disclosure requirements may increase our operating costs or require significant management time and attention. Any failure to comply with applicable disclosure regulations in the U.S. (at either the federal or state level) or other countries could result in substantial fines or other penalties, which could materially adversely affect us.\nWe may be subject to various claims and lawsuits that could result in significant expenditures which may materially adversely affect us.\nThe nature of our business exposes us to the potential for various claims and litigation related to labor and employment, personal injury, property damage, business practices, environmental liability and other matters. Any material litigation or a catastrophic accident or series of accidents could result in significant expenditures and have a material adverse effect on us.",
    "item1b": "Item 1B.\nUnresolved Staff Comments\nNone.\nInformation About Our Executive Officers\nFor information about our executive officers, see Part III, \"Item 10. Directors, Executive Officers and Corporate Governance\".\n16",
    "item1c": "Item 1C.     \nCybersecurity\nThe Board regularly discusses our most significant risks and how these risks are being managed. \nThe Board has appointed a \nRisk Committee\n, consisting entirely of independent directors, whose responsibilities include assisting the Board in overseeing management’s identification and evaluation of strategic enterprise risks, including risks associated with privacy, technology, information security, cybersecurity and cyber incident response and business continuity.\n The Risk Committee regularly updates the \nBoard\n on these activities.\n \nThe Risk Committee oversees the Company’s approach to cybersecurity risk assessment and mitigation by, among other things, (i) reviewing the Company’s cybersecurity insurance program, (ii) reviewing the Company’s cybersecurity budget, (iii) discussing the results of various internal cybersecurity audits and \nperiodic independent third-party assessments\n of the Company’s cybersecurity programs, (iv) being briefed on cybersecurity matters by outside experts, and (v) receiving regular updates from the Company’s Chief Information Security Officer (“CISO”) and others on cybersecurity risks, operational metrics, compliance and regulatory developments, training programs, risk mitigation activities, key projects and industry developments. The Company's Chief Legal and Compliance Officer (\"CLCO\"), Chief Digital and Technology Officer (\"CDTO\"), CISO and Vice President of Compliance and Internal Audit participate in Risk Committee meetings and meet individually with the Risk Committee on a periodic basis to discuss and address relevant matters, including the Company’s approach to cybersecurity risk assessment and mitigation.\n The CISO reports to the CDTO, who in turn reports to the Chief Executive Officer (\"CEO\"). \nThe CISO has more than thirty years of IT experience, has served many years in various information security management roles and has multiple cybersecurity certifications.\nThe Company maintains an enterprise risk management process designed to identify potential events that may affect the achievement of the Company's objectives or have a material adverse effect on the Company.\n Cybersecurity is among the risks considered as a part of this process. The Company's management, including the CISO, also participates on the Company's Information Security & Privacy Governance Council (“ISPGC”). The ISPGC meets periodically to consider information security and privacy matters.\nThe Company utilizes various technical and qualitative processes to assist in identifying, assessing and managing cybersecurity risks. The Company's processes include periodic discussions and risk reviews with management. These processes also include, depending on facts and circumstances, internal audits, third-party assessments, post-remediation reviews, engagements with independent third-party service providers and key governmental agencies, regular employee training, an incident response plan and backup and recovery plans. Our periodic engagements with independent third-party service providers are designed to provide qualitative and technical cybersecurity assessments. The Company has a corporate-level cybersecurity team, led by the CISO, that, among other responsibilities, receives and reviews reports regarding potential threats, trends and remediation strategies. The cybersecurity team evaluates threat intelligence and information obtained from various sources, including internal, public or private sources, government agencies and external consultants. Certain of the Company's subsidiaries have separate cybersecurity teams that, along with the corporate-level cybersecurity team, play a role in the Company's efforts to monitor, identify, assess and manage cybersecurity risks.\nThe Company interacts with the information technology networks and systems of third parties for many aspects of our business. \nWe consider and evaluate cybersecurity risks associated with the use of independent third-party service providers.\n To help UPS understand and mitigate potential cybersecurity risks related to third parties, we generally utilize measures such as vendor risk assessments, periodic technical assessments of third-party vendors' controls and contracts governing the use of and access to our data and compliance with our security requirements.\nWe maintain an Incident Response Plan that includes processes and procedures for reviewing and responding to cybersecurity incidents. We periodically test our readiness to respond to a cybersecurity incident through various scenario-based drills. The Incident Response Plan includes processes for escalation to the CISO, the Executive Leadership Team, including the CEO, the Risk Committee and the Board, and a process for consideration of whether a cybersecurity incident is material and may require disclosure in SEC filings.\nFor additional information on cybersecurity risks and the impact they may have on our business strategy, results of operations or financial condition see \"Risk Factors – Business and Operating Risks – A significant cybersecurity incident, or increased data protection regulations, could materially adversely affect us\".\n17"
  }
}