{
  "ticker": "USB",
  "cik": "0000036104",
  "company_name": "US BANCORP \\DE\\",
  "filing_date": "2025-02-21",
  "accession": "0000036104-25-000016",
  "primary_doc": "usb-20241231.htm",
  "item_sections": {
    "item1": "Item 1.  Business \nForward-Looking Statements \nThe following information appears in accordance with the Private Securities Litigation Reform Act of 1995: This report contains forward-looking statements about U.S. Bancorp (“U.S. Bancorp” or the “Company”). Statements that are not historical or current facts, including statements about beliefs and expectations, are forward-looking statements and are based on the information available to, and assumptions and estimates made by, management as of the date hereof. These forward-looking statements cover, among other things, future economic conditions and the anticipated future revenue, expenses, financial condition, asset quality, capital and liquidity levels, plans, prospects and operations of U.S. Bancorp. Forward-looking statements often use words such as “anticipates,” “targets,” “expects,” “hopes,” “estimates,” “projects,” “forecasts,” “intends,” “plans,” “goals,” “believes,” “continue” and other similar expressions or future or conditional verbs such as “will,” “may,” “might,” “should,” “would” and “could.” \nForward-looking statements involve inherent risks and uncertainties that could cause actual results to differ materially from those set forth in forward-looking statements, including the following risks and uncertainties: \n•\nDeterioration in general business and economic conditions or turbulence in domestic or global financial markets, which could adversely affect U.S. Bancorp’s revenues and the values of its assets and liabilities, reduce the availability of funding to certain financial institutions, lead to a tightening of credit, and increase stock price volatility; \n•\nTurmoil and volatility in the financial services industry, including failures or rumors of failures of other depository institutions, which could affect the ability of depository institutions, including U.S. Bank National Association (\"USBNA\"), to attract and retain depositors, and could affect the ability of financial services providers, including U.S. Bancorp, to borrow or raise capital; \n•\nIncreases in Federal Deposit Insurance Corporation (“FDIC”) assessments, including due to bank failures;\n•\nActions taken by governmental agencies to stabilize the financial system and the effectiveness of such actions; \n•\nUncertainty regarding the content, timing and impact of changes to regulatory capital, liquidity and resolution-related requirements applicable to large banking organizations in response to adverse developments affecting the banking sector; \n•\nChanges to statutes, regulations, or regulatory policies or practices, including capital and liquidity requirements, and the enforcement and interpretation of such laws and regulations, and U.S. Bancorp’s ability to address or satisfy those requirements and other requirements or conditions imposed by regulatory entities; \n•\nChanges in trade policy, including the imposition of tariffs or the impacts of retaliatory tariffs;\n•\nChanges in interest rates; \n•\nIncreases in unemployment rates; \n•\nDeterioration in the credit quality of U.S. Bancorp's loan portfolios or in the value of the collateral securing those loans; \n•\nChanges in commercial real estate occupancy rates;\n•\nRisks related to originating and selling mortgages, including repurchase and indemnity demands, and related to U.S. Bancorp’s role as a loan servicer; \n•\nImpacts of current, pending or future litigation and governmental proceedings; \n•\nIncreased competition from both banks and non-banks;\n•\nEffects of climate change and related physical and transition risks; \n•\nChanges in customer behavior and preferences and the ability to implement technological changes to respond to customer needs and meet competitive demands; \n•\nBreaches in data security; \n•\nFailures or disruptions in or breaches of U.S. Bancorp’s operational, technology or security systems or infrastructure, or those of third parties, including as a result of cybersecurity incidents; \n•\nFailures to safeguard personal information; \n•\nImpacts of pandemics, natural disasters, terrorist activities, civil unrest, international hostilities and geopolitical events; \n•\nImpacts of supply chain disruptions, rising inflation, slower growth or a recession; \n•\nFailure to execute on strategic or operational plans; \n1\n•\nEffects of mergers and acquisitions and related integration; \n•\nEffects of critical accounting policies and judgments; \n•\nEffects of changes in or interpretations of tax laws and regulations; \n•\nManagement’s ability to effectively manage credit risk, market risk, operational risk, compliance risk, strategic risk, interest rate risk, liquidity risk and reputation risk; and \n•\nThe risks and uncertainties more fully discussed in the section entitled “Risk Factors” of the 2024 Annual Report. \nFactors other than these risks also could adversely affect U.S. Bancorp’s results, and the reader should not consider these risks to be a complete set of all potential risks or uncertainties. Readers are cautioned not to place undue reliance on any forward-looking statements. Forward-looking statements speak only as of the date hereof, and U.S. Bancorp undertakes no obligation to update them in light of new information or future events. \nGeneral Business Description\nU.S. Bancorp is a financial services holding company headquartered in Minneapolis, Minnesota, serving millions of local, national and global customers. U.S. Bancorp is registered as a bank holding company under the Bank Holding Company Act of 1956 (the “BHC Act”), and has elected to be treated as a financial holding company under the BHC Act. The Company provides a full range of financial services, including lending and depository services, cash management, capital markets, and trust and investment management services. It also engages in credit card services, merchant and ATM processing, mortgage banking, insurance, brokerage and leasing. \nU.S. Bancorp’s banking subsidiary, USBNA, is engaged in the general banking business, principally in domestic markets, and holds all of the Company’s consolidated deposits of $518.3 billion at December 31, 2024. USBNA provides a wide range of products and services to individuals, businesses, institutional organizations, governmental entities and other financial institutions. Commercial and consumer lending services are principally offered to customers within the Company’s domestic markets, to domestic customers with foreign operations and to large national customers operating in specific industries targeted by the Company, such as healthcare, utilities, oil and gas, and state and municipal government. Lending services include traditional credit products as well as credit card services, lease financing and import/export trade, asset-backed lending, agricultural finance and other products. Depository services include checking accounts, savings accounts and time certificate contracts. Ancillary services such as capital markets, treasury management and receivable lock-box collection are provided to corporate and governmental entity customers. U.S. Bancorp’s bank and trust subsidiaries provide a full range of asset management and fiduciary services for individuals, estates, foundations, business corporations and charitable organizations. \nOther U.S. Bancorp non-banking subsidiaries offer investment and insurance products to the Company’s customers principally within its domestic markets, and fund administration services to a broad range of mutual and other funds. \nBanking and investment services are provided through a network of branches and banking offices across the United States, primarily in the Midwest and West regions, including 2,165 branches across 26 states as of December 31, 2024. A significant percentage of consumer transactions are completed using USBNA's digital banking services, both online and through its digital app. The Company operates a network of 4,489 ATMs as of December 31, 2024, and provides 24-hour, seven day a week telephone customer service. Mortgage banking services are provided through banking offices and loan production offices throughout the Company’s domestic markets. Lending products may be originated through banking offices, indirect correspondents, brokers or other lending sources. The Company is also one of the largest providers of corporate and purchasing card services and corporate trust services in the United States. The Company’s subsidiaries provide domestic merchant processing services directly to merchants, as well as similar merchant services in Canada and segments of Europe. The Company also provides corporate trust and fund administration services in Europe. These foreign operations are not significant to the Company. \nBusiness Segments\nThe Company’s major business segments are Wealth, Corporate, Commercial and Institutional Banking, Consumer and Business Banking, Payment Services, and Treasury and Corporate Support. \nWealth, Corporate, Commercial and Institutional Banking provides core banking, specialized lending, transaction and payment processing, capital markets, asset management, and brokerage and investment related services to wealth, middle market, large corporate, commercial real estate, government and institutional clients.\nConsumer and Business Banking comprises consumer banking, small business banking and consumer lending. Products and services are delivered through banking offices, telephone servicing and sales, online services, direct mail, ATMs, mobile devices, distributed mortgage loan officers, and intermediary relationships including auto dealerships, mortgage banks, and strategic business partners.\nPayment Services includes consumer and business credit cards, stored-value cards, debit cards, corporate, government and purchasing card services and merchant processing.\n2\nTreasury and Corporate Support includes the Company’s investment portfolios, funding, capital management, interest rate risk management, income taxes not allocated to the business lines, including most investments in tax-advantaged projects, and the residual aggregate of those expenses associated with corporate activities that are managed on a consolidated basis.\nAdditional information regarding the Company’s business segments can be found on pages 54 to 56 of the Company’s 2024 Annual Report under the heading “Business Segment Financial Review,” which is incorporated herein by reference. \nHuman Capital\nThe Company’s success depends, in large part, on its ability to attract, develop and retain skilled employees. The Company recognizes that supporting, engaging and continuously upskilling its workforce is key to meeting evolving corporate and customer needs. To further those efforts, the Company is committed to supporting employees’ professional development through programs that promote engagement, learning and productivity and providing pay that is competitive and fair, as well as other benefits and programs that promote wellness. As of December 31, 2024, the Company employed a total of 70,263 employees globally. The Company’s current workforce strategy is focused on promoting in-person engagement across more than 20 corporate hub locations, its branch network and business centers to support the Company’s business and customer needs. \nHuman Capital Governance\n The Company’s Board of Directors oversees the Company’s human capital management, including through its Compensation and Human Resources Committee. The Company’s Chief Human Resources Officer regularly reports to the Board’s Compensation and Human Resources Committee on human capital matters such as human resource practices and programs, including employee benefits and compensation programs.\nTalent Strategy\n As part of its efforts to develop and retain skilled employees, the Company remains focused on monitoring employee sentiment and engagement. The Company’s employee surveying programs enable the Company to collect quantitative and qualitative feedback from employees on an ongoing basis. The Company offers various mentorship and leadership development opportunities that enable participants to enhance key skills and work experiences.\nAs part of its talent strategy, the Company strives to support continuous employee learning and development. The Company provides several talent development opportunities for employees to enhance skills that are critical in the current and future working environment and empowers employees to discover ways to thrive and grow in their careers. The Company has introduced and enhanced several learning programs in 2024, including the Product Academy, Foundational Leadership and Skill of the Month. The Company also launched the Skills Academy, a learning platform focused on the development of skills for all employees. In 2024, the Company also held a Development Day, highlighting the importance of self-development and the Company’s commitment to supporting learning. The Company conducts job skills and customer interaction training for its frontline employees that focuses on building skills to serve all the Company's customers. In addition, every employee is automatically included in the Company’s Development Network that provides all employees with opportunities to network, learn, develop leadership skills and contribute to the Company and its communities. Succession planning and talent development processes remain a top priority for the Company along with continuous improvements to its training and development programs. During 2024, employees completed over 1.8 million hours of training through the Company’s enterprise learning programs to better support their professional development and customer and business needs.\nCompensation, Health & Wellness Programs \nMaintaining competitive compensation and benefits practices is a continued focus for the Company, with periodic peer and benchmarking reviews used to assist with competitive alignment and employee retention. As part of the Company's efforts to enhance pay transparency, all open positions in the United States have a disclosed compensation range.\nThe Company provides its employees with comprehensive benefits programs, including competitive healthcare, retirement, leave, recognition, wellness, disability, life insurance, time-off and educational assistance programs, based on the Company’s recognition that such benefits are important to attract and retain employees. In addition to its competitive 401(k) matching program, the Company maintains an active cash balance pension program for its U.S. employees, including newly hired employees.\nCompetition \nThe financial services industry is highly competitive. The Company competes with other commercial banks, savings and loan associations, mutual savings banks, finance companies, mortgage banking companies, credit unions, investment companies, credit card companies and a variety of other financial services, advisory and technology companies. The financial services industry continues to undergo rapid technological change with frequent introductions of new technology-driven products and services, including innovative ways that customers can make payments or manage their accounts, such as through the use of mobile payments, digital wallets or digital currencies. In recent years, competition has increased from institutions not subject to the same regulatory restrictions as domestic banks and bank holding companies, including by financial technology companies, or “fintechs,” which may offer bank-like products or services that compete directly with the Company’s products and services. Competition is based on a number of factors, including, among others, customer service, quality and range of products and services offered, price, reputation, interest rates on loans and deposits, lending limits and customer convenience, including the ability to address customer needs by using technology to provide products and services that customers want to adopt. The Company’s ability to continue to compete effectively also depends in large part on its ability to attract new employees and retain \n3\nand motivate existing employees, while managing compensation and other costs. For additional information relating to how the Company attracts and retains employees, see “Human Capital” above. \nGovernment Policies \nThe operations of the Company’s various businesses are affected by federal and state laws and legislative changes and by policies of various regulatory authorities of the United States and the numerous states and foreign countries in which they operate. These laws, rules and policies include, for example, statutory maximum legal lending rates, domestic monetary policies of the Board of Governors of the Federal Reserve System (the “Federal Reserve”), United States fiscal policy, international currency regulations and monetary policies and capital adequacy and liquidity constraints imposed by bank regulatory agencies. \nSupervision and Regulation \nU.S. Bancorp and its subsidiaries are subject to the extensive regulatory framework applicable to bank holding companies (“BHCs”) and their subsidiaries. This regulatory framework is intended primarily for the protection of depositors, the deposit insurance fund (the “DIF”) of the FDIC, consumers, the stability of the financial system in the United States, and the health of the national economy, and not for investors in the Company. \nThis section summarizes certain provisions of the principal laws and regulations applicable to the Company and its subsidiaries. The descriptions are not intended to be complete and are qualified in their entirety by reference to the full text of the statutes and regulations described below. \nGeneral\n As a BHC, the Company is subject to regulation under the BHC Act and to inspection, examination and supervision by the Federal Reserve. USBNA and its subsidiaries are subject to regulation, examination and supervision primarily by the Office of the Comptroller of the Currency (the “OCC”) and also by the FDIC, the Federal Reserve, and the Consumer Financial Protection Bureau (the “CFPB”). The Company and its subsidiaries are also subject to regulation and examination by the Securities and Exchange Commission (the “SEC”) and the Commodities Futures Trading Commission (the “CFTC”) in certain areas. \nSupervision and regulation by the responsible bank regulatory agencies generally include comprehensive annual reviews of all major aspects of the Company’s and USBNA’s business and condition, regular on-site examinations, and imposition of periodic reporting requirements and limitations on investments and certain types of activities. If an applicable regulatory agency deems the Company to be operating in a manner that is inconsistent with safe and sound banking practices, such agency can require the entry into informal or formal supervisory agreements, including board resolutions, memoranda of understanding, written agreements and consent or cease and desist orders, pursuant to which the Company would be required to take identified corrective actions to address cited concerns and to refrain from taking certain actions. Supervision and examinations are confidential, and the outcomes of these actions generally are not made public. \nBanking and other financial services statutes, regulations and policies are continually under review by the United States Congress, state legislatures and federal and state regulatory agencies. In addition to laws and regulations, state and federal bank regulatory agencies may issue policy statements, interpretive letters and similar written guidance applicable to the Company and its subsidiaries. Any change in the statutes, regulations or regulatory policies applicable to the Company, including changes in their interpretation or implementation, could have a material effect on its business or organization. \nThe change in the U.S. presidential administration and control of the U.S. Senate will likely result in changing federal regulatory priorities. Further, legal challenges to regulations have become more prevalent, adding to the uncertainty in the applicability of new or proposed laws and regulations. As federal government agencies shift priorities, states are likely to shift as well (including in certain states, as a response to a perceived void in federal regulation). Any shifts in state or federal regulatory priorities may result in increased compliance costs and regulatory risks. Failure to comply with any new law or regulation could result in litigation, regulatory enforcement actions and harm to the Company's reputation. \nAs a BHC with over $100 billion in total consolidated assets, the Company is subject to the Dodd-Frank Act’s enhanced prudential standards, as applied to “Category III” institutions under the federal banking regulators’ rules that tailor how enhanced prudential standards apply to large U.S. banking organizations (the “Tailoring Rules”). The Tailoring Rules also apply certain enhanced prudential standards to its subsidiary depository institution, USBNA, as described in more detail below. The Company will continue to be subject to the regulatory capital and liquidity requirements applicable to Category III institutions until otherwise required under the Tailoring Rules (i.e., until the Company’s total average consolidated assets for the then most recent four quarters equal $700 billion or more or the amount of the Company’s average cross-jurisdictional activities for the then most recent four quarters equals $75 billion or more). \nSupervisory Ratings\n Federal banking regulators regularly examine the Company and its insured depository institution subsidiary, USBNA. Following those exams, the Company (under the Federal Reserve’s Large Financial Institution Rating System) and USBNA (under the CAMELS rating system) are assigned supervisory ratings. Disclosure of these ratings to third parties is not allowed without permission of the issuing regulator. A downgrade in these ratings could limit the Company’s ability to pursue acquisitions or conduct other expansionary activities for a period of time, require new or additional regulatory approvals before engaging in certain other business activities or investments, affect USBNA’s deposit insurance assessment rates, limit the Company's access to funding through government-sponsored liquidity programs, and impose additional recordkeeping and corporate governance requirements, as well as generally increase regulatory scrutiny of the Company. \n4\nBHC Activities\n The Company is a BHC under the BHC Act and has elected to be a financial holding company (“FHC”). BHCs that qualify and elect to be treated as FHCs may engage in, and affiliate with financial companies engaging in, a broader range of activities than would otherwise be permitted for a BHC. \nIf an FHC or a depository institution controlled by an FHC ceases to be well-capitalized or well-managed, the Federal Reserve may impose corrective capital and managerial requirements on the FHC and may place limitations on its ability to conduct all of the business activities that FHCs are generally permitted to conduct and its ability to make certain acquisitions. See “Permissible Business Activities” below. Disclosure of any failure to meet these standards is not allowed without permission of the Federal Reserve. If the failure to meet these standards persists, the FHC may be required to divest its depository institution subsidiaries or cease all activities other than those activities that may be conducted by BHCs that are not FHCs. In addition, if a depository institution controlled by an FHC does not receive a Community Reinvestment Act (“CRA”) rating of at least “satisfactory” at its most recent examination, the Federal Reserve will prohibit the FHC from conducting new business activities that FHCs are generally permitted to conduct and from making certain acquisitions. \nThe Federal Reserve also requires BHCs to meet certain applicable capital and management standards. Failure by the Company to meet these standards could limit the Company from engaging in any new activity or acquiring other companies without the prior approval of the Federal Reserve. \nPermissible Business Activities\n As an FHC, the Company may affiliate with securities firms and insurance companies and engage in other activities that are financial in nature or incidental or complementary to activities that are financial in nature. “Financial in nature” activities include securities underwriting, dealing and market making; sponsoring mutual funds and investment companies; insurance underwriting and agency; merchant banking; and activities that the Federal Reserve, in consultation with the Secretary of the United States Treasury, determines to be financial in nature or incidental to such financial activity. “Complementary activities” are activities that the Federal Reserve determines upon application to be complementary to a financial activity and that do not pose a safety and soundness risk. \nThe Company generally is not required to obtain Federal Reserve approval to acquire a company engaged in activities that are financial in nature or incidental to activities that are financial in nature, as long as the Company meets the capital, managerial and CRA requirements to qualify as an FHC. However, the Company is required to receive approval for an acquisition in which the total consolidated assets to be acquired exceed $10 billion. FHCs are also required to obtain the approval of the Federal Reserve before they may acquire more than five percent of the voting shares or substantially all of the assets of an unaffiliated BHC, bank or savings association. In addition, banks must receive approval before they may acquire, merge with, acquire substantially all of the assets of or assume any deposits of a bank or savings association and may be required to receive approval for acquisitions of other companies. \nInterstate Banking\n A BHC may acquire banks in states other than its home state, subject to any state requirement that the bank has been organized and operating for a minimum period of time (not to exceed five years). Also, such an acquisition is not permitted if the BHC controls, prior to or following the proposed acquisition, more than 10 percent of the total amount of deposits of insured depository institutions nationwide or, if the acquisition is the BHC’s initial entry into the state, more than 30 percent of the deposits of insured depository institutions in the state (or any lesser or greater amount set by the state). Banks may merge across state lines to create interstate branches and are permitted to establish new branches in another state to the same extent as banks chartered by that state. \nRegulatory Approval for Acquisitions\n In determining whether to approve a proposed bank acquisition, federal bank regulators will consider a number of factors, including the effect of the acquisition on competition, financial condition and future prospects (including current and projected capital ratios and levels); the competence, experience and integrity of management and its record of compliance with laws and regulations; the convenience and needs of the communities to be served (including the acquiring institution’s record of compliance under the CRA); the effectiveness of the acquiring institution in combating money laundering activities; and the extent to which the transaction would result in greater or more concentrated risks to the stability of the United States banking or financial system. In addition, approval of interstate transactions requires that the acquiror satisfy regulatory standards for well-capitalized and well-managed institutions.  \nSource of Strength\n The Company is required to act as a source of strength to USBNA, and to commit capital and financial resources to support USBNA in circumstances where the Company might not otherwise do so. Under these requirements, the Federal Reserve may in the future require the Company to provide financial assistance to USBNA, should it experience financial distress. Capital loans by the Company to USBNA would be subordinate in right of payment to deposits and certain other debts of USBNA. \nOCC Heightened Standards\n USBNA is subject to the OCC’s guidelines establishing heightened standards for large national banks, which establish minimum standards for the design and implementation of a risk governance framework for banks. The OCC may take action against institutions that fail to meet these standards. \nEnhanced Prudential Standards\n Under the Dodd-Frank Act, as modified by the Economic Growth, Regulatory Relief and Consumer Protection Act and the Tailoring Rules, large bank holding companies, such as the Company, are subject to certain enhanced prudential standards based on the banking organization’s size and certain “risk-based indicators.” The prudential standards include enhanced risk-based capital and leverage requirements, enhanced liquidity requirements, enhanced risk \n5\nmanagement and risk committee requirements, a requirement to submit a resolution plan, single-counterparty credit limits and stress tests. Certain of the enhanced prudential standards applicable to the Company are described below in further detail. \nDividend Restrictions\n The Company is a legal entity separate and distinct from its subsidiaries. Typically, the majority of the Company’s operating funds are received in the form of dividends paid to the Company by USBNA. Federal law imposes limitations on the payment of dividends by national banks. In general, dividends payable by USBNA and the Company’s trust bank subsidiaries, as national banking associations, are limited by rules that compare dividends to net income for periods defined by regulation. \nThe OCC, the Federal Reserve and the FDIC also have authority to prohibit or limit the payment of dividends by the banking organizations they supervise (including the Company and USBNA) if, in the banking regulator’s opinion, payment of a dividend would constitute an unsafe or unsound practice in light of the financial condition of the banking organization. \nIn addition, the Federal Reserve’s final rule implementing the stress capital buffer (“SCB”) provides that a BHC must receive prior approval for any dividend, stock repurchase or other capital distribution, other than a capital distribution on a newly issued capital instrument, if the BHC is required to resubmit its capital plan. The rule also provides that a BHC must resubmit its capital plan if, among other things, the BHC determines there has been or will be a material change in the BHC’s risk profile, financial condition, or corporate structure since the BHC last submitted its capital plan. \nCapital Requirements \nThe Company is subject to certain regulatory risk-based capital and leverage requirements under capital rules adopted by the Federal Reserve, and USBNA is subject to substantially similar rules adopted by the OCC. These rules implement the Basel Committee’s framework for strengthening the regulation, supervision and risk management of banks (“Basel III”), as well as certain provisions of the Dodd-Frank Act. These quantitative calculations are minimums, and the Federal Reserve and OCC may determine that a banking organization, based on its size, complexity or risk profile, must maintain a higher level of capital in order to operate in a safe and sound manner. \nUnder the Tailoring Rules, the Company and USBNA are each currently subject to “Category III” standards, and are “standardized approach” banking organizations that are subject to rules that provide for simplified capital requirements relating to the threshold deductions for mortgage servicing assets, deferred tax assets arising from temporary differences that a banking organization could not realize through net operating loss carry backs, and investments in the capital of unconsolidated financial institutions, as well as the inclusion of minority interests in regulatory capital. Growth in total consolidated assets (including assets obtained in acquisitions) or cross-jurisdictional activity (as defined in the Tailoring Rules) could affect the Company’s continued classification as a “Category III” institution, which could result in the Company and its insured depository institution subsidiary becoming “advanced approaches” banking organizations, a requirement to recognize elements of accumulated other comprehensive income in regulatory capital, as well as other more stringent capital, liquidity, and other regulatory requirements. \nUnder the United States Basel III-based capital rules, the Company is subject to a minimum common equity tier 1 (“CET1”) capital ratio (CET1 capital to risk-weighted assets) of 4.5 percent, a minimum tier 1 capital ratio of 6.0 percent and a minimum total capital ratio of 8.0 percent. At December 31, 2024, the Company exceeded these minimum capital ratio requirements. The Company is also subject to the SCB, which is based on the results of the Federal Reserve’s supervisory stress tests and the Company’s planned common stock dividends, and, if deployed by the Federal Reserve, up to a 2.5 percent common equity tier 1 countercyclical capital buffer. These additional requirements must be satisfied entirely with capital that qualifies as CET1. Although the Federal Reserve has not to date raised the countercyclical capital buffer above zero percent, the countercyclical capital buffer could change in the future. The SCB generally is assigned on an annual basis and becomes effective on October 1 of each year, subject to a 2.5 percent floor, and may vary over time. As of December 31, 2024, the SCB applicable to the Company is 3.1 percent, an increase from the SCB of 2.5 percent that applied to the Company at December 31, 2023. If the Federal Reserve were to raise the countercyclical capital buffer, or if the SCB applicable to the Company were to exceed 3.1 percent, this would also change the effective minimum capital ratios to which the Company is subject. For USBNA, the buffer requirement consists of the static capital conservation buffer equal to 2.5 percent of risk-weighted assets. \nBanking organizations that fail to meet the effective minimum ratios will be subject to constraints on capital distributions, including dividends and share repurchases, and certain discretionary executive compensation, with the severity of the constraints depending on the extent of the shortfall and “eligible retained income” (defined as the greater of (i) net income for the four preceding quarters, net of distributions and associated tax effects not reflected in net income; and (ii) the average of all net income over the preceding four quarters). \nUnited States banking organizations are also subject to a minimum tier 1 leverage ratio of 4.0 percent. As a Category III banking organization, the Company is also subject to a minimum Supplementary Leverage Ratio (“SLR”) of 3.0 percent that takes into account both on-balance sheet and certain off-balance sheet exposures. At December 31, 2024, the Company exceeded the applicable minimum tier 1 leverage ratio and SLR requirements. \nIn July 2023, the U.S. federal bank regulatory authorities proposed a rule implementing the Basel Committee’s finalization of the post-crisis regulatory capital reforms, commonly referred to as “Basel III Endgame.” The proposal would set stricter criteria for the use of internal models by replacing the market risk rule with the “Fundamental Review of the Trading Book,” and would introduce new standardized approaches for credit risk, operational risk and credit valuation adjustment risk, which would replace the current models-based approaches. In addition, under the proposed rule, also subject to a phase-in period, Category III banking institutions, such as the Company, would no longer be permitted to opt out of including certain components of accumulated other comprehensive income in regulatory capital, which would result in unrealized gains and losses on available-\n6\nfor-sale securities being included in the calculation of the Company’s regulatory capital ratios. The Company continues to evaluate the potential effects of the proposed rule, and the effects on the Company will depend on the final form of any rulemaking.\nIn 2020, the United States federal banking agencies adopted a rule that allowed banking organizations, including the Company and USBNA, to elect to delay temporarily the estimated effects of adopting the current expected credit loss accounting standard (“CECL”) on regulatory capital until January 2022 and subsequently to phase in the effects through January 2025. Through the 2024 stress test cycle, the Federal Reserve has not yet incorporated CECL into the calculation of the allowance for credit losses in supervisory stress tests, and the Federal Reserve issued guidance in October 2024 to indicate that it will maintain the current framework for allowance for credit losses in the supervisory stress test through the 2025 stress test cycle. For further discussion of CECL, see Notes 1 and 5 of the Notes to Consolidated Financial Statements in the 2024 Annual Report. The Company and USBNA elected to delay and subsequently phase in the regulatory capital impact of CECL in accordance with this rule. \nFor additional information regarding the Company’s regulatory capital, see “Capital Management” in the 2024 Annual Report. \nComprehensive Capital Analysis and Review\n As required by the Federal Reserve’s Comprehensive Capital Analysis and Review (“CCAR”) rules, the Company submits a capital plan to the Federal Reserve on an annual basis. As part of the CCAR process, the Federal Reserve evaluates the Company’s plans to make capital distributions, including by repurchasing stock or making dividend payments, under a number of macroeconomic and Company-specific assumptions based on the Company’s and the Federal Reserve’s stress tests described under “Stress Testing” below. These capital plans consist of a number of mandatory elements, including an assessment of a company’s sources and uses of capital over a nine-quarter planning horizon assuming both expected and stressful conditions; a detailed description of a company’s process for assessing capital adequacy; and a demonstration of a company’s ability to maintain capital above each minimum regulatory capital ratio (without taking the buffers into account) under expected and stressful conditions. \nStress Testing\n The Federal Reserve’s CCAR framework and the Dodd-Frank Act stress testing framework require BHCs subject to Category III standards such as the Company to conduct an annual internal stress test in connection with its annual capital plan submission as well as biennial company-run stress tests, and subject such BHCs to annual supervisory stress tests conducted by the Federal Reserve. Among other things, the company-run stress tests employ stress scenarios developed by the Company as well as stress scenarios provided by the Federal Reserve and incorporate the Dodd-Frank Act capital actions (as opposed to the Company’s planned capital actions), which are intended to normalize capital distributions across large U.S. BHCs. The Federal Reserve conducts CCAR and Dodd-Frank Act supervisory stress tests employing stress scenarios and internal supervisory models and incorporates the Company’s planned capital actions and the Dodd-Frank Act capital actions, respectively, into its stress tests. The Federal Reserve and the Company are currently required to publish the results of the annual supervisory and biennial company-run stress tests, respectively, no later than June 30 of each applicable year. If the Company were to become a “Category II” institution for purposes of the Tailoring Rules, the Company would become subject to annual (rather than biennial) company-run stress tests. \nUnder the OCC’s rules, national banks with assets in excess of $250 billion, including USBNA, are required to submit company-run stress test results to the OCC concurrently with their parent BHC’s CCAR submission to the Federal Reserve. The stress test is based on the OCC’s stress scenarios (which are typically the same as the Federal Reserve’s stress scenarios) and capital actions that are appropriate for the economic conditions assumed in each scenario. \nBasel III Liquidity Requirements\n As Category III banking organizations, the Company and USBNA are each subject to a minimum liquidity coverage ratio (\"LCR\") under the Tailoring Rules. The LCR is designed to ensure that BHCs have sufficient high-quality liquid assets to survive a significant liquidity stress event lasting for 30 calendar days. In addition, the Company and USBNA are subject to the net stable funding ratio (\"NSFR\") rule, which is designed to promote stable, longer-term funding of assets and business activities over a one-year time horizon. Under the Tailoring Rules and NSFR rule, the Company and USBNA, as Category III banking organizations with less than $75 billion of weighted short-term wholesale funding, qualify for reduced LCR and NSFR requirements calibrated at 85 percent of the full requirements. If the Company were to become a “Category II” institution for purposes of the Tailoring Rules, the Company would become subject to the full (100 percent) LCR and NSFR requirements, as well as daily (rather than monthly) liquidity reporting requirements. \nPrompt Corrective Action\n The Federal Deposit Insurance Corporation Improvement Act (“FDICIA”) provides a framework for regulation of depository institutions and their affiliates (including parent holding companies) by federal banking regulators. As part of that framework, the FDICIA requires the relevant federal banking regulator to take “prompt corrective action” with respect to an FDIC-insured depository institution, such as USBNA, if that institution does not meet certain capital adequacy standards. Supervisory actions by the appropriate federal banking regulator under the “prompt corrective action” rules generally depend upon an institution’s classification within five capital categories. An institution that fails to remain well-capitalized becomes subject to a series of restrictions that increase in severity as its capital condition weakens. Such restrictions may include a prohibition on capital distributions, restrictions on asset growth or restrictions on the ability to receive regulatory approval of applications. The FDICIA also provides for enhanced supervisory authority over undercapitalized institutions, including authority for the appointment of a conservator or receiver for the institution. \n7\nPrompt corrective action regulations apply only to banks and not to BHCs such as the Company. However, the Federal Reserve is authorized to take appropriate action at the BHC level, based on the undercapitalized status of the BHC’s subsidiary banking institutions. In certain instances, relating to an undercapitalized bank, the BHC would be required to guarantee the performance of the undercapitalized subsidiary’s capital restoration plan and could be liable for civil money damages for failure to fulfill those guarantee commitments. \nLong-Term Debt Requirements\n In August 2023, the Federal Reserve, OCC and FDIC issued a proposed rule that would require, among other institutions, each Category III U.S. BHC, including the Company, and each insured depository institution with $100 billion or more in total consolidated assets that is a consolidated subsidiary of a Category III U.S. BHC, such as USBNA, to have minimum levels of outstanding long-term debt. The proposed rule is intended to improve the resolvability of the banking organizations covered by the rule. Under the proposed rule, covered banking organizations would be required to maintain long-term debt in an amount that is equal to the greater of (i) 6% of the organization’s risk-weighted assets; (ii) 3.5% of the organization’s average total consolidated assets; and (iii) 2.5% of the organization’s total leverage exposure, if the organization is subject to the SLR rule. The requirement would be phased in over three years, with covered banking organizations being required to meet 25% of the requirement within one year after finalization of the rule, 50% after two years and 100% after three years. The agencies have not yet issued a final rule. Any effects on the Company and USBNA will depend on the final form of any rulemaking.\nDeposit Insurance\n The DIF provides insurance coverage for certain deposits, up to a standard maximum deposit insurance amount of $250,000 per depositor. Deposits at USBNA are insured up to the applicable limits. The DIF is funded through assessments on insured depository institutions, including USBNA, based on the risk each institution poses to the DIF. The FDIC may increase USBNA’s insurance premiums based on various factors, including the FDIC’s assessment of its risk profile. \nIn addition, large insured depository institutions, including USBNA, are subject to enhanced deposit account recordkeeping and related information technology system requirements meant to facilitate prompt payment of insured deposits if such an institution were to fail. \nIn October 2022, the FDIC finalized a rule to increase the initial base deposit insurance assessment rate schedules for all insured depository institutions by two basis points, beginning with the first quarterly assessment period of 2023. The increased assessment rate is intended to improve the likelihood that the DIF reserve ratio would reach the required minimum of 1.35 percent by the statutory deadline of September 30, 2028. \nIn November 2023, the FDIC released a final rule to impose a special assessment to recover the losses to the DIF resulting from failures of other banking institutions during 2023. The special assessments are tax deductible. As a result of this rule, the Company recognized additional noninterest expense of $136 million and $734 million in 2024 and 2023, respectively, for the FDIC special assessment.\nDepositor Preference\n Under federal law, in the event of the liquidation or other resolution of an insured depository institution, the claims of a receiver of the institution for administrative expense and the claims of holders of domestic deposit liabilities have priority over the claims of other unsecured creditors of the institution, including holders of publicly issued senior or subordinated debt and depositors in non-domestic offices. As a result, those debtholders and depositors would be treated differently from, and could receive, if anything, substantially less than, the depositors in domestic offices of the depository institution. \nOrderly Liquidation Authority\n Upon the insolvency of a BHC, such as the Company, the FDIC may be appointed as conservator or receiver of the BHC if the Secretary of the Treasury determines (upon the written recommendation of the FDIC and the Federal Reserve and after consultation with the President of the United States) that certain conditions set forth in the Dodd-Frank Act regarding the potential impact on financial stability of a financial company’s failure have been met. FDIC rules set forth a comprehensive method for the receivership of a covered financial company. Acting as a conservator or receiver, the FDIC would have broad powers to transfer any assets or liabilities of a BHC without the approval of its creditors. \nResolution Plans\n The Company is required by the Federal Reserve and the FDIC to submit a periodic plan for the rapid and orderly resolution of the Company and its significant legal entities in the event of future material financial distress or failure. If the Federal Reserve and the FDIC jointly determine that the resolution plan is not credible and such deficiencies are not cured in a timely manner, the regulators may jointly impose on the Company more stringent capital, leverage or liquidity requirements or restrictions on the Company’s growth, activities or operations. If the Company were to fail to address the deficiencies in its resolution plan when required, it could eventually be required to divest certain assets or operations. As a Category III banking organization, the Company is required to submit resolution plans on a triennial cycle (alternating between targeted and full submissions). The Company was scheduled to file its next full resolution plan in July 2024, but the FDIC and Federal Reserve extended the submission deadlines for all triennial full filers, including the Company, from July 2024 to October 2025.\nIn August 2024, the Federal Reserve and the FDIC finalized guidance for 2025 and subsequent resolution plan submissions that would apply to certain institutions including Category III institutions such as the Company. The guidance addresses the Federal Reserve’s and FDIC’s expectations regarding key areas of resolution, including capital, liquidity, operational, legal entity rationalization, and insured depository institution resolution, based on a firm’s resolution strategy. \nUSBNA is also required to file periodically separate resolution plans with the FDIC that should enable the FDIC, as receiver, to resolve USBNA under applicable receivership provisions of the Federal Deposit Insurance Act in a manner that ensures that depositors receive access to their insured deposits within one business day of the institution’s failure, maximizes the net present \n8\nvalue return from the sale or disposition of its assets and minimizes the amount of any loss to the institution’s creditors. In June 2024, the FDIC finalized revisions to its resolution planning rule that, among other things, requires periodic testing to validate key resolution capabilities and sets out the criteria and process for the FDIC’s review of the credibility of resolution plans. Under the revised rule, USBNA is required to submit triennial resolution plans and annual interim supplements in years in which a full resolution plan is not filed, which update certain information provided in the full resolution plan. USBNA is required to file its next initial interim supplement on or before July 1, 2025, and its next full resolution plan on or before July 1, 2026. \nRecovery Plans\n The OCC has established enforceable guidelines for recovery planning by insured national banks with average total consolidated assets of $250 billion or more, including USBNA. The guidelines provide that a covered bank should develop and maintain a recovery plan that is appropriate for its individual risk profile, size, activities, and complexity, including the complexity of its organizational and legal entity structure. The guidelines state that a recovery plan should, among other elements, (i) establish triggers, which are quantitative or qualitative indicators of the risk or existence of severe stress that should always be escalated to management or the board of directors, as appropriate, for purposes of initiating a response; (ii) identify a wide range of credible options that a covered bank could undertake to restore financial and operational strength and viability; (iii) include impact assessments for each such recovery option, and (iv) address escalation procedures, management reports, and communication procedures. USBNA’s most recent recovery plan was reviewed and approved pursuant to these guidelines in December 2024. In October 2024, the OCC finalized revisions to these guidelines that incorporate a testing standard and clarify the role of non-financial risk in recovery planning. These revisions are applicable to USBNA’s next recovery plan submission.\nTransactions with Affiliates\n There are various legal restrictions on the extent to which the Company and its non-bank subsidiaries may borrow or otherwise engage in certain types of transactions with USBNA or its subsidiaries. Under the Federal Reserve Act and the Federal Reserve’s Regulation W, USBNA and its subsidiaries are subject to quantitative and qualitative limits on extensions of credit (including credit exposure arising from repurchase and reverse repurchase agreements, securities borrowing and derivative transactions), purchases of assets, and certain other transactions with the Company or its other non-bank subsidiaries and affiliates. Additionally, transactions between USBNA or its subsidiaries, on the one hand, and the Company or its other non-bank subsidiaries and affiliates, on the other hand, are required to be on arm’s length terms. Transactions between USBNA and its affiliates and the Company and its other non-bank subsidiaries and its affiliates must be consistent with standards of safety and soundness. \nAnti-Money Laundering and Sanctions\n The Company is subject to several federal laws that are designed to combat money laundering and terrorist financing, and to restrict transactions with persons, companies, or foreign governments sanctioned by United States authorities. This category of laws includes the Bank Secrecy Act (the “BSA”), the Money Laundering Control Act, the USA PATRIOT Act (collectively, “AML laws”), and implementing regulations for the International Emergency Economic Powers Act and the Trading with the Enemy Act, as administered by the U.S. Department of the Treasury’s Office of Foreign Assets Control (“sanctions laws”). \nAs implemented by federal banking and securities regulators and the U.S. Department of the Treasury, AML laws obligate depository institutions and broker-dealers to verify their customers’ identity, verify the identity of beneficial owners of legal entity customers, conduct customer due diligence, report on suspicious activity, file reports of certain transactions in currency, and conduct enhanced due diligence on certain accounts. Sanctions laws prohibit United States persons and certain foreign affiliates from engaging in any transaction with a restricted person or restricted country. Depository institutions and broker-dealers are required by their respective federal regulators to maintain policies and procedures in order to ensure compliance with the above obligations. Federal regulators regularly examine BSA/Anti-Money Laundering (“AML”) and sanctions compliance programs to ensure their adequacy and effectiveness, and the frequency and extent of such examinations and related remedial actions have been increasing. \nIn January 2021, the Anti-Money Laundering Act of 2020 (“AMLA”), which amends the BSA, was enacted. Among other things, the AMLA codified a risk-based approach to anti-money laundering compliance for financial institutions; required the development of standards by the U.S. Department of the Treasury for evaluating technology and internal processes for BSA compliance; and expanded enforcement- and investigation-related authority, including a significant expansion in the available sanctions for certain BSA violations. Many of the statutory provisions in the AMLA require additional rulemakings, reports and other measures, and the impact of the AMLA will depend on, among other things, rulemaking and implementation guidance. In June 2021, the Financial Crimes Enforcement Network, a bureau of the U.S. Department of the Treasury (“FinCEN”), issued the priorities for anti-money laundering and countering the financing of terrorism policy required under the AMLA. The priorities include corruption, cybercrime, terrorist financing, fraud, transnational crime, drug trafficking, human trafficking and proliferation financing. In July 2024, the OCC, the Federal Reserve, the FDIC and the National Credit Union Administration issued a joint proposed rule that would amend their rules regarding AML programs. Among other things, the proposed rule would require national banks, such as USBNA, to incorporate a risk assessment process into their AML programs that consider the priorities published by FinCEN and would encourage, but not require, banks to consider, evaluate and implement innovative approaches to meet BSA compliance obligations. The effects of the proposed rule on USBNA will depend on the final form of any rulemaking.\nCommunity Reinvestment Act\n USBNA is subject to the provisions of the CRA. Under the terms of the CRA, banks have a continuing and affirmative obligation, consistent with safe and sound operation, to help meet the credit needs of their communities, including providing credit to individuals residing in low- and moderate-income neighborhoods. The OCC assesses \n9\nUSBNA on its record in meeting the credit needs of the community served by USBNA, including low- and moderate-income neighborhoods. CRA assessments also are considered by the Federal Reserve or OCC when reviewing applications by banking institutions to acquire, merge or consolidate with another banking institution or its holding company, to establish a new branch office that will accept deposits, or to relocate an office. In the case of a BHC applying for approval to acquire a bank or other BHC, the Federal Reserve will assess the CRA records of each subsidiary depository institution of the applicant BHC, and those records may be the basis for denying the application. USBNA received an “Outstanding” CRA rating in its most recent examination, covering the period from January 1, 2016 through December 31, 2020.  \nIn October 2023, the OCC, together with the Federal Reserve and FDIC, issued a final rule to modernize the CRA regulatory framework. The final rule is intended, among other things, to strengthen the achievement of the core purpose of the CRA, to adapt to changes in the banking industry, including the expanded role of mobile and online banking, and to tailor performance standards to account for differences in bank size and business models. The final rule tracks the proposed rule issued by the agencies in May 2022 and adjusts CRA evaluations based on bank size and type, with many of the changes applying only to banks with over $2 billion in assets and several applying only to banks with over $10 billion in assets, such as USBNA. The final rule introduces major changes to the CRA regulatory framework, including: (i) the delineation of assessment areas outside a bank’s traditional physical footprint; (ii) the overall evaluation framework and performance standards and metrics; (iii) the definition of community development activities; and (iv) data collection and reporting. The final rule became effective on April 1, 2024, but has been paused subject to a court ordered injunction, and most provisions of the rule will not become applicable until after January 1, 2026, pending the outcome of litigation on the final rule. The Company continues to evaluate the effect of the final rule on USBNA, and any effects may depend on further guidance from the regulators with respect to interpretive and implementation-related issues that may arise. \nRegulation of Brokerage, Investment Advisory and Insurance Activities\n The Company conducts a broad range of securities activities, both retail and institutional, in the United States through U.S. Bancorp Investments, Inc. and U.S. Bancorp Advisors, LLC (collectively, “broker-dealer entities”). These activities are subject to regulations of the SEC, the Financial Industry Regulatory Authority and other authorities, including state regulators. These regulations generally cover licensing of securities personnel, interactions with customers and counterparties, trading operations, securities underwriting compensation and arrangements, customer suitability, recordkeeping, reporting and communications. Securities regulators impose capital requirements on the Company’s broker-dealer entities and conduct audits or other periodic reviews of their sales practice and financial operations. In addition, the Company’s broker-dealer entities are members of the Securities Investor Protection Corporation, which oversees the liquidation of member broker-dealers that close when the broker-dealer is bankrupt or in financial distress and imposes membership fee assessments and other reporting requirements on the broker-dealer entities. \nThe operations of the First American family of funds, the Company’s proprietary money market fund complex, also are subject to regulation by the SEC, including rules requiring a floating net asset value for institutional prime and tax-free money market funds and permitting the board of directors of the money market funds the ability to limit redemptions during periods of stress (allowing for the use of liquidity fees and redemption gates during such times). In July 2023, the SEC finalized amendments to the rules that govern money market funds. These amendments, among other things, increased liquidity requirements for money market funds by requiring funds to hold greater proportions of their total assets in securities that can be liquidated in one business day, and require institutional prime and institutional tax-exempt money market funds to impose liquidity fees on investors that redeem their investments during times of stress. \nThe Company’s operations in the areas of insurance brokerage and reinsurance of credit life insurance are subject to regulation and supervision by various state insurance regulatory authorities, including the licensing of insurance brokers and agents. \nRegulation of Derivatives and the Swaps Marketplace\n Under the Dodd-Frank Act, USBNA, as a CFTC registered swap dealer, is subject to rules regarding the regulation of the swaps marketplace and over-the-counter derivatives, including rules that require swap dealers and major swap participants to register with the CFTC, to meet certain business conduct, document, risk management, recordkeeping, reporting, and segregation requirements, and to centrally clear and trade swaps on regulated exchanges or execution facilities. CFTC rules also require USBNA to be a member of the National Futures Association, a self-regulatory organization with authority over swap dealers, and to comply with the rules of applicable exchanges and clearinghouses.\nIn addition, the OCC’s rules concerning swap margin and capital requirements for swap dealers regulated by the OCC mandate the exchange of initial and variation margin for non-cleared swaps and non-cleared security-based swaps between swap entities regulated by five federal agencies and certain counterparties. The amount of margin will vary based on the relative risk of the non-cleared swap or non-cleared security-based swap. Other rules generally exempt inter-affiliate transactions from initial margin requirements to the extent a depository institution’s total exposure to all affiliates is less than 15 percent of its tier 1 capital. \nThe Volcker Rule\n Section 13 of the BHC Act and its implementing regulations, commonly referred to as the “Volcker Rule,” prohibit banking entities from engaging in proprietary trading, and prohibit certain interests in, or relationships with, hedge funds or private equity funds. The Volcker Rule applies to the Company, USBNA and their affiliates, and compliance requirements are tailored based on the size and scope of trading activities. The Company has a Volcker Rule compliance program in place that covers all of its subsidiaries and affiliates, including USBNA. \n10\nPrivacy and Data Protection\n Federal and state laws contain extensive consumer privacy and data protection provisions. The Gramm Leach-Bliley Act (“GLBA”) requires financial institutions to periodically disclose their privacy policies and practices relating to sharing nonpublic personal information (“NPI”) and enables retail customers to opt out of the sharing of such information with nonaffiliated third parties under certain circumstances. Other federal and state laws and regulations impact the Company’s ability to share certain information with affiliates and non-affiliates for marketing and/or non-marketing purposes, or to contact customers with marketing offers. The GLBA also requires financial institutions to implement a comprehensive information security program. Security and privacy policies and procedures for the protection of personal and confidential information are in effect across all the Company’s businesses and geographic locations. \nData privacy and data protection are areas of increasing legislative focus in the United States, and several U.S. states have enacted comprehensive consumer privacy laws that impose compliance obligations with respect to personal information. The Company has made and will make operational adjustments in accordance with the requirements of applicable privacy and data protection laws. For example, the Company is subject to the California Consumer Protection Act of 2018 and its implementing regulations, as amended in 2020 by the California Privacy Rights Act (the \"CCPA\"), which provided residents of California with specific rights with respect to the collection of their personal information. The CCPA exempts NPI from its scope. The process of drafting and finalizing implementing regulations for the CCPA is ongoing. The Company continues to evaluate the new regulations, and the effects on the Company will depend on the form of any additional rulemakings. \nSimilar comprehensive consumer privacy laws have been adopted by other states where the Company does business. Each of these state laws, however, includes an entity level exemption for “financial institutions” that are subject to the GLBA like the Company. The United States Congress has also proposed legislation relating to data privacy and data protection, and the federal government may in the future pass such legislation. \nIn addition, in the European Union (“EU”), privacy law is governed by the General Data Protection Regulation (“GDPR”), which is directly binding and applicable in each EU member state. The GDPR contains enhanced compliance obligations and increased penalties for non-compliance and is regularly enforced by European regulators. Canada is in the process of replacing its federal privacy law, the Personal Information Protection and Electronic Documents Act, with a new privacy framework that the Company expects will impose additional compliance obligations on the Company’s Canadian operations.\nIn October 2024, the CFPB finalized a rule regarding personal financial data rights, which applies to financial institutions that control or possess data relating to covered consumer financial products or services, such as Regulation E accounts and credit card issuers. Under the final rule, USBNA will be required to provide consumers and, upon the consumer’s request, their authorized third parties electronic access to “covered data.” This includes transaction information, account balances, upcoming bill information, information to initiate payment to and from accounts, the terms and conditions under which an account or credit card was provided, and certain other basic account verification information. The final rule, which is being challenged by several banking industry groups, requires “data providers” such as USBNA to create detailed access interfaces for both consumers and developers in order to effectuate consumers’ access to, and transfer of, their personal financial data. USBNA will be prohibited from imposing any fees or charges for maintaining or providing access to or facilitating the transfer of such data. Unless the rule is overturned or rescinded, USBNA must comply with the final rule by April 1, 2026.\nLike other lenders, USBNA and other subsidiaries of the Company use consumer reports in their underwriting activities. Use of such information is regulated under the Fair Credit Reporting Act (“FCRA”), and the FCRA also regulates reporting information to consumer reporting agencies, prescreening individuals for credit offers, sharing of consumer reports between affiliates, and using affiliate credit data for marketing purposes. Similar state laws may impose additional requirements on the Company and its subsidiaries. In January 2025, the CFPB published a final FCRA-related rule that prohibits the inclusion of medical debts in consumer reports and prohibits a creditor’s use of medical debt to determine credit eligibility, absent a specific exception. There are currently two lawsuits filed against the CFPB disputing the validity of the final rule and a preliminary injunction has been granted by the court. Consequently, the effective date of the final rule has been stayed until June 15, 2025. In addition, a notice of proposed rulemaking to revise the FCRA was also published in December 2024, with comments to the proposal due in March 2025.\nThe federal banking regulators, as well as the SEC, CFPB, CFTC, and related self-regulatory organizations, regularly issue guidance on cybersecurity that is intended to enhance cyber risk management among financial institutions and provide timely information to investors. A financial institution’s management is required to maintain sufficient business continuity planning processes to ensure the rapid recovery, resumption and maintenance of the institution’s operations after a cybersecurity incident. A financial institution is also expected to develop appropriate processes to enable recovery of data and business operations if the institution or its critical service providers experience a cybersecurity incident. \nThe Company and its subsidiaries are subject to increasing numbers of regulatory notification and disclosure requirements related to cybersecurity. As of April 2022, banking organizations, such as the Company and USBNA, are required to notify their primary federal regulator within 36 hours of a computer-security incident that results in actual harm to the confidentiality, integrity, or availability of an information system or the information that the system processes, stores or transmits, which has materially disrupted or degraded, or is reasonably likely to materially disrupt or degrade, the banking organization’s ability to deliver services to a material portion of its customer base, jeopardize the viability of key operations of the banking organization, or impact the stability of the financial sector. Similarly, the Office of the Superintendent of Financial Institutions in Canada requires Federally Regulated Financial Institutions to report qualifying technology and cybersecurity incidents under the provisions of the August 13, 2021 Technology and Cyber Security Incident Reporting Advisory. \n11\nConsumer Protection\n USBNA’s retail banking activities are subject to a variety of federal and state statutes and regulations designed to protect consumers. These laws and regulations require, among other things, disclosures of the cost of credit and terms of deposit accounts, provide substantive consumer rights, prohibit discrimination in credit transactions, regulate the use of credit report information, provide financial privacy protections, prohibit unfair, deceptive and abusive practices and subject USBNA to substantial regulatory oversight. Violations of applicable consumer protection laws can result in significant potential liability from litigation brought by customers, including actual damages, restitution and attorneys’ fees, and may also result in significant reputational harm. USBNA’s regulators may also seek to enforce consumer protection requirements and obtain these and other remedies, including regulatory sanctions and civil money penalties. \nUSBNA and its subsidiaries are subject to supervision and regulation by the CFPB with respect to federal consumer laws. The CFPB has undertaken numerous rule-making and other initiatives, including launching an initiative to reduce the amounts and types of fees financial institutions may charge, including by recently proposing a rule that would significantly reduce the permissible amount of credit card late fees, issuing informal guidance and taking enforcement actions against certain financial institutions. The CFPB’s rulemaking, examination and enforcement authority has affected and will continue to affect financial institutions that provide consumer financial products and services, including the Company, USBNA and the Company’s other subsidiaries. These regulatory activities may limit the types of financial services and products the Company may offer, which in turn may reduce the Company’s revenues.\nExecutive and Incentive Compensation\n Guidelines adopted by the federal banking agencies prohibit excessive compensation as an unsafe and unsound practice and describe compensation as “excessive” when the amounts paid are unreasonable or disproportionate to the services performed by an executive officer, employee, director or principal stockholder. The Federal Reserve has issued comprehensive guidance on incentive compensation policies (the “Incentive Compensation Guidance”) intended to ensure that the incentive compensation policies of banking organizations do not undermine safety and soundness by encouraging excessive risk-taking. The Incentive Compensation Guidance is based upon the key principles that a banking organization’s incentive compensation arrangements should (i) provide incentives that do not encourage risk-taking beyond the organization’s ability to effectively identify and manage risks; (ii) be compatible with effective internal controls and risk management; and (iii) be supported by strong corporate governance, including active and effective oversight by the organization’s board of directors. The Incentive Compensation Guidance states that enforcement actions may be taken against a banking organization if its incentive compensation arrangements or related risk-management control or governance processes pose a risk to the organization’s safety and soundness and the organization is not taking prompt and effective measures to correct the deficiencies. \nDuring 2016, the federal bank regulatory agencies and the SEC proposed revised rules on incentive-based payment arrangements at specified regulated entities having at least $1 billion of total assets. In July 2024, the OCC, FDIC, Federal Housing Finance Agency and National Credit Union Administration jointly re-proposed the regulatory text of the 2016 proposal. The Federal Reserve and the SEC did not join the proposal, and the proposed rule will not be published in the Federal Register until the agencies have joined.\nEnvironmental, Social and Governance\n In recent years, federal, state and international lawmakers and regulators have increased their focus on financial institutions’ and other companies’ risk oversight, disclosures and practices in connection with climate change and other environmental, social and governance matters. In October 2023, the United States federal banking agencies issued a set of principles relating to the management of climate-related financial risks.  The principles apply to banking organizations with over $100 billion in total consolidated assets, including the Company and USBNA. The principles are intended to provide a framework for large banking organizations to guide their efforts to identify, measure, monitor, and mitigate physical and transition risks associated with climate change. Among other guidance, the principles describe how climate-related financial risks can be addressed in connection with specific risk categories, including credit risk, liquidity risk, operational risk, and legal and compliance risk. In March 2024, the SEC adopted final rules related to the disclosure of climate-related financial risk, but such rules have been stayed pending the completion of judicial review of the petitions challenging the rules, and on February 11, 2025, the SEC requested a pause of the litigation, citing concerns with the legality of the rules. Further, several states in which the Company operates have enacted or proposed statutes, regulations or guidance addressing climate change and other sustainability issues.  For example, in 2023, the State of California enacted laws, which are subject to ongoing litigation, requiring certain companies doing business in California to disclose greenhouse gas emissions data and certain other climate-related information. In addition, the European Union’s Corporate Sustainability Reporting Directive came into effect in January 2023, significantly expanding the scope of sustainability disclosures required to be disclosed by certain EU and non-EU companies.\nConversely, some states in which the Company does business have enacted, or proposed to enact, certain “anti-ESG” measures, including statutes, regulations or policies that prohibit certain financial institutions from denying or canceling products or services to a person, or otherwise discriminating against a person in making available products or services, on the basis of social credit scores and certain other factors. Similarly, the current Presidential administration has issued a number of executive orders and various agencies have taken positions that relate to environmental and social matters. Some of these measures may conflict with other regulatory requirements, including those described above. Due to legal challenges and other uncertainties, the effects of these measures on the Company cannot be predicted at this time.\nOther Supervision and Regulation\n As a public company, the Company is subject to the requirements of the Securities Act of 1933, as amended, the Securities Exchange Act of 1934, as amended (the “Exchange Act”), and the rules and regulations promulgated \n12\nby the SEC thereunder, as administered by the SEC. As a listed company on the New York Stock Exchange (“NYSE”), the Company is subject to the rules of the NYSE for listed companies. \nCapital Covenants\nThe Company has entered into several transactions involving the issuance of capital securities (“Capital Securities”) by a certain Delaware statutory trust formed by the Company (the “Trust”), the issuance by the Company of preferred stock (“Preferred Stock”) and the issuance by a subsidiary of USBNA of preferred stock exchangeable for the Company’s Preferred Stock under certain circumstances (“Exchangeable Preferred Stock”). Simultaneously with the closing of certain of those transactions, the Company entered into a replacement capital covenant, as amended from time to time (as amended, each, a “Replacement Capital Covenant” and collectively, the “Replacement Capital Covenants”) for the benefit of persons that buy, hold or sell a specified series of long-term indebtedness of the Company or USBNA (the “Covered Debt”). Each of the Replacement Capital Covenants provides that neither the Company nor any of its subsidiaries (including the Trust) will repay, redeem or purchase any of the Preferred Stock, Exchangeable Preferred Stock or the Capital Securities and the securities held by the Trust (the “Other Securities”), as applicable, on or before the date specified in the applicable Replacement Capital Covenant, unless the Company has received proceeds from the sale of qualifying securities that (a) have equity-like characteristics that are the same as, or more equity-like than, the applicable characteristics of the Preferred Stock, the Exchangeable Preferred Stock, the Capital Securities or Other Securities, as applicable, at the time of repayment, redemption or purchase, and (b) the Company has obtained the prior approval of the Federal Reserve, if such approval is then required by the Federal Reserve or, in the case of the Exchangeable Preferred Stock, the approval of the OCC. \nThe Company will provide a copy of any Replacement Capital Covenant to a holder of the relevant Covered Debt upon request. For copies of any of these documents, holders should write to Investor Relations, U.S. Bancorp, 800 Nicollet Mall, Minneapolis, Minnesota 55402, or call (866) 775-9668.\nThe following table identifies the closing date for each transaction, issuer, series of Capital Securities, Preferred Stock or Exchangeable Preferred Stock issued in the relevant transaction, Other Securities, if any, and applicable Covered Debt as of February 21, 2025, for those securities that remain outstanding.\nClosing\nDate\nIssuer\nCapital Securities, Preferred Stock \nor Exchangeable Preferred Stock\nOther Securities\nCovered Debt\n3/17/06\nUSB Capital\nIX and\nU.S. Bancorp\nUSB Capital IX’s $675,378,000 of 6.189% Fixed-to-Floating Rate Normal Income Trust Securities\nU.S. Bancorp’s Series A Non-Cumulative Perpetual Preferred Stock\nU.S. Bancorp’s 2.491% Fixed Rate Reset Subordinated Notes due November 3, 2036 (CUSIP No. 91159HJB7)\n3/27/06\nU.S. Bancorp\nU.S. Bancorp’s 40,000,000 Depositary Shares ($25 per Depositary Share), each representing a 1/1,000\nth \ninterest in a share of Series B Non-Cumulative Perpetual Preferred Stock\nNot Applicable\nU.S. Bancorp’s 2.491% Fixed Rate Reset Subordinated Notes due November 3, 2036 (CUSIP No. 91159HJB7)\n12/22/06\nUSB Realty\nCorp.\n(a)\n and U.S. Bancorp\nUSB Realty Corp.’s 4,500 shares of Fixed-to-Floating-Rate Exchangeable Non-Cumulative Perpetual Series A Preferred Stock exchangeable for shares of U.S. Bancorp’s Series C Non-Cumulative Perpetual Preferred Stock\n(b)\nNot Applicable\nU.S. Bancorp’s 2.491% Fixed Rate Reset Subordinated Notes due November 3, 2036 (CUSIP No. 91159HJB7)\n(a)    USB Realty Corp. is a subsidiary of USBNA.\n(b)    Under certain circumstances, upon the direction of the OCC, each share of USB Realty Corp.’s Series A Preferred Stock will be automatically exchanged for one share of U.S. Bancorp’s Series C Non-Cumulative Perpetual Preferred Stock.\nAvailable Information \nU.S. Bancorp’s website can be found at www.usbank.com. U.S. Bancorp makes available free of charge on its website, by clicking on “About us” and then clicking on “Investor relations” and then clicking on “Financials” and then clicking on \"SEC filings,\" its annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13 or 15(d) of the Exchange Act, as well as all other reports filed by U.S. Bancorp with the SEC as soon as reasonably practicable after electronically filed with, or furnished to, the SEC. \nAdditional Information \nAdditional information in response to this Item 1 can be found in the 2024 Annual Report on pages 54 to 56 under the heading “Business Segment Financial Review.” That information is incorporated into this report by reference.",
    "item1a": "Item 1A can be found in the 2024 Annual Report on pages 136 to 151 under the heading “Risk Factors.” That information is incorporated into this report by reference. \n13",
    "item1b": "Item 1B.  Unresolved Staff Comments \nNone.",
    "item1c": "Item 1C.  Cybersecurity\nRisk Assessment and Management\nThe Company is committed to managing risks that may impact the Company and incorporating risk considerations into its business activities at all levels, including strategic planning, risk identification inventory and assessment, and day-to-day business decisions. The Company’s Board of Directors has approved a risk management framework that establishes governance and risk management requirements for all the Company’s key risk areas and risk-taking activities. The Board oversees management’s performance relative to the risk management framework and risk appetite. Management is responsible for defining the various risks facing the Company, formulating risk management policies and procedures, and managing risk exposures on a day-to-day basis. The Company’s Executive Risk Committee (ERC), which is chaired by the Chief Risk Officer, oversees execution of the risk management framework. The ERC is supported by management’s senior operating committees, each responsible for a specified risk category. The Company’s Information Security Risk Committee (ISRC), which is co-chaired by the Chief Information Security Officer (CISO) and the Chief Technology Risk Officer, is a senior operating committee under this risk governance structure and is responsible for the management of information security risk at the Company. The ISRC provides direction and oversight of the information security risk management framework and corporate control programs of the Company, including significant information security risk events, and mitigation strategies. Further, the ISRC facilitates communication across business lines to provide for effective and consistent information security risk identification and control infrastructure to mitigate and manage material information security risks. The ISRC serves as an escalation, decision making, and approval body for information security risk items, including key policies and programs, issue resolution, emerging risks, and key program adherence. The ISRC escalates matters as appropriate to executive management, the ERC, which reports to the Board’s Risk Management Committee, or a relevant committee of the Board. Generally, each of the ERC and ISRC meet at least monthly.\nAs part of the Company’s risk management framework, risk management programs and processes are in place to incorporate risk considerations into day-to-day business activities across the Company’s risk categories, business lines, and functions. Risk programs may manage all or certain components of a particular risk type. The Company’s cybersecurity risk program provides centralized planning and management of related and interdependent work with a focus on risks from cybersecurity threats. Additionally, the Company’s Information Security Awareness and Training Program educates employees and contractors on information security policies, standards, and practices to protect U.S. Bancorp’s information, information systems, and processes. \nThe Company’s cybersecurity risk program is integrated into the Company’s overall business and operational strategies and requires that the Company allocate appropriate resources to maintain the program.\n \nThe Company’s processes for assessing, identifying, and managing material risks from cybersecurity threats are integrated into the Company’s overall risk governance and oversight structures through its “three lines of defense” model for establishing effective checks and balances within the risk management framework.\n In this model, specific to cybersecurity threats, the first line of defense is Information Security Services (ISS), which is responsible for identifying and implementing cybersecurity controls in accordance with policy requirements and industry best practices, to meet regulatory requirements and to safeguard the business. The second line of defense, Cybersecurity Risk Oversight within the Company's Operational Risk Management group, provides reporting and escalation of emerging risks related to cybersecurity and other concerns to senior management, the ERC, the ISRC, other designated senior operating committees, and the Risk Management Committee of the Board of Directors. The third line of defense, the Company’s internal audit function, provides independent assessment and assurance regarding the effectiveness of the Company’s governance, risk management, and control processes with respect to cybersecurity threats, and provides challenges and recommendations for improvement.\nThe Company uses reporting and metrics frameworks and regular internal and external oversight to assess the health of the cybersecurity risk program. At the first level, the ISS team identifies, assesses, and manages cybersecurity risk and threats. The Company manages cybersecurity issues and findings through remediation and/or closure, with escalation processes if an issue or finding cannot be remediated within required timeframes. The Company engages external assessors, consultants, and auditors to review the Company’s cybersecurity risk program against those of industry peers. The Company also uses consultants periodically to provide recommendations to improve and enhance the program. Additionally, the Company continually works to align its policies and practices with industry-accepted information security practices as provided by the National Institute of Standards and Technology Cybersecurity Framework (NIST CSF), Payment Card Industry Data Security Standards (PCI DSS), and other applicable standards, laws, and regulations.\nDuring the fiscal year ended December 31, 2024, the Company has not identified any specific risks from cybersecurity threats that have materially affected, or are reasonably likely to affect, the Company’s business strategy, results of operations, or financial condition, other than the risks described under “Risk Factors – Operations and Business Risk” in the 2024 Annual Report\n. The Company may not be successful in preventing or mitigating the impacts of a future cybersecurity incident that could have a material adverse effect on the Company or its business strategy, results of operations or financial condition.\nThird Party Risks\nThe Company also maintains a third-party risk management program responsible for the oversight of outsourced operations, which enables the Company to oversee and identify risks related to engaging third-party service providers, including risks from \n14\ncybersecurity threats to third-party service providers\n. T\nhe Company conducts due diligence using a risk-based approach in selecting and monitoring third-party service providers\n. The Company also obtains contractual assurances from third-party service providers relating to their security responsibilities, controls, reporting, and roles and responsibilities as it pertains to cybersecurity incident response policies and notification requirements. As appropriate, the Company obtains independent reviews of the third parties’ security through audit reports and testing and conducts verification and validation with third parties to confirm cybersecurity and information security risks are appropriately identified, measured, mitigated, monitored, and reported by the third party to the Company.\nBoard of Directors Oversight\nAs part of its responsibility to oversee the management, business, and strategy of the Company, \nthe Company’s Board of Directors reviews and approves the Company’s risk management framework annually through its Risk Management Committee and oversees the Company’s risk management processes by informing itself about the Company’s key risks and evaluating whether management has reasonable risk management and control processes in place to address those risks. The Board carries out its risk management oversight responsibilities primarily through its committees\n. Each Board committee is responsible for overseeing certain risks under its charter. \nThe Board’s Risk Management Committee, with support from its Cybersecurity and Technology Subcommittee, has primary oversight responsibility for cybersecurity risk, including risks from any cybersecurity threats\n. The Risk Management Committee monitors the Company’s compliance with the risk management framework and risk limits established under the Company’s risk appetite statement approved by the Board. The Risk Management Committee also oversees the Company’s independent risk management function. \nThe Cybersecurity and Technology Subcommittee has oversight responsibility for cybersecurity risk management and cyber resiliency and certain technology matters\n. The Risk Management Committee and its Cybersecurity and Technology Subcommittee receive quarterly reports from management on cybersecurity issues, including cybersecurity threats. \nThe Board’s Risk Management Committee and Audit Committee\n also hold a joint meeting annually at which they receive a report from the Company’s CISO on cybersecurity threats facing the Company and its preparedness to meet and respond to those threats. In addition, the full Board holds periodic cybersecurity education sessions, which may feature the perspective of an outside expert on current cybersecurity topics. The Company also typically conducts an annual executive-level crisis exercise that includes a cybersecurity component to test its resiliency response, completeness of playbooks, and communication protocols. This exercise involves Board members, Managing Committee members, third-party companies, and regulators, as appropriate.\nThe Company’s risk management framework includes its risk appetite statement, which is approved annually by the Board’s Risk Management Committee, and defines acceptable levels of risk-taking and risk limits and establishes the governance and oversight activities over risk management and reporting. Management monitors and measures the Company’s risk appetite using a quantitative risk scorecard consisting of risk appetite metrics and associated limits reported to the Board’s Risk Management Committee on a quarterly basis. The Company’s risk appetite statement includes specific information security metrics and associated limits. These limits also inform how matters, including cybersecurity incidents or threats, are escalated to specific members of management, appropriate senior operating committees (including the ISRC and/or ERC), and/or the Board of Directors or appropriate Board committee. The Board’s Risk Management Committee oversees the Company’s risk profile relative to its risk appetite and compliance with risk limits.\nManagement Oversight\nThe members of the Company’s management that are primarily responsible for assessing and managing risks from cybersecurity threats, including monitoring risk appetite metrics and limits related to cybersecurity, include the Company’s CISO, Chief Risk Officer, and Chief Information and Technology Officer.\n \nThe Company’s CISO is primarily responsible for the implementation of defense capabilities and risk mitigation strategies. T\nhe Company’s CISO, Timothy J. Held, has over 27 years of information technology and cybersecurity experience\n. He holds the title of Executive Vice President and Chief Information Security Officer and has been in his role since 2018, having served as the Company’s Deputy CISO from 2015 to 2018 and Head of Cyber Defense, Threat Intelligence, and Incident Response from 2012 to 2018. The CISO is supported by his direct reports and their teams, many of whom hold cybersecurity-related certifications.\nThe Company’s CISO reports to the Vice Chair and Chief Risk Officer, Jodi L. Richard, who has served in that position since October 2018. She served as Executive Vice President and Chief Operational Risk Officer of the Company from January 2018 until October 2018, having served as Senior Vice President and Chief Operational Risk Officer from 2014 until January 2018. Prior to that time, Ms. Richard held various senior leadership roles at HSBC from 2003 until 2014, including Executive Vice President and Head of Operational Risk and Internal Control at HSBC North America from 2008 to 2014.\nVenkatachari Dilip, the Company’s Senior Executive Vice President and Chief Information and Technology Officer, has oversight of technology-related risk management issues and controls that align to the NIST CSF. Mr. Dilip previously was an Executive Vice President from September 2018 to April 2023 and has served as Chief Information and Technology Officer since joining the Company in September 2018. From May 2014 until July 2017, he served as Vice President at McKinsey Digital where he helped banks accelerate their digital transformation. From April 2009 to September 2013, he served as CEO at Compass Labs leading an innovative marketing analytics company. From March 2006 until April 2008, he served as Director of Products at Google where he led product teams for mobile ads and Google Checkout. From March 2004 until March 2006, he served as Vice President of PayPal/eBay and on the Board of PayPal Europe, where he was responsible for Payments Services, Risk and Fraud Management. Previously, Mr. Dilip co-founded and led startup companies CashEdge and CommerceSoft from 1996 until 2003.\n15\nThe CISO and his leadership team generally meet each business day to discuss security item triage and emerging threats and trends identified by the Threat Intelligence Team. The CISO shares pertinent information from those meetings with the Chief Risk Officer\n. During a cyber incident, which could involve the Company or a third-party service provider to the Company, the \nCompany’s Cyber Security Incident Response Team (CSIRT) leads the response and internal communication\n. CSIRT manages low and moderate severity incidents, and Enterprise Crisis Management manages high and very high severity incidents. The risk rating of an incident may change throughout the incident investigation period as new information is learned or the environment changes. Depending on severity level, CSIRT or Enterprise Crisis Management distributes incident communications to senior management, including the Chief Executive Officer, Chief Risk Officer, Board of Directors or appropriate Board committee, and if applicable, the Company’s regulators.\nISS leadership reports prevention, detection, mitigation, and remediation activities through various working groups and committees. Certain working groups meet with the CISO monthly to review completed risk assessments, and items that require escalation are reported up using the internal committee structure and ad hoc communications if time sensitive. Additionally, working group and committee meetings report up issues to Operational Risk Management, which may decide to open a formal Risk Management Issue (RMI) based on the severity of the issue or other factors and which are subject to specific governance processes. All security-related RMI remediation activities are reviewed with the Chief Risk Officer and Chief Information and Technology Officer on a bi-weekly basis."
  }
}