{
  "ticker": "VLO",
  "cik": "0001035002",
  "company_name": "VALERO ENERGY CORP/TX",
  "filing_date": "2025-02-26",
  "accession": "0001035002-25-000005",
  "primary_doc": "vlo-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1A. RISK FACTORS—Risks Related to Our Business, Industry, and Operations—\nOur financial results are affected by volatile margins, which are dependent upon factors beyond our control, including the price of feedstocks and the market price at which we can sell our products\n,”—“\nIndustry, market, and other developments could decrease the demand for our products\n,”—“\nWe are subject to risks related to the costs and availability of our feedstocks and other critical supplies\n,”—“\nOur investments in \n6\nTa\nble \no\nf\n \nConten\nt\ns\njoint ventures and other entities decrease our ability to manage risk\n,” and —“Legal, Government, and Regulatory Risks—\nWe are subject to risks arising from the Renewable and Low-Carbon Fuel Programs, and other regulations, policies, international certifications, and standards impacting low-carbon fuels\n,” which are incorporated by reference into this item.\nRefining\nRefineries\nOverview\nOur 15 petroleum refineries are located in the U.S., Canada, and the U.K., and they have a combined feedstock throughput capacity of approximately 3.2 million BPD. The following table presents the locations of these refineries and their feedstock throughput capacities as of December 31, 2024.\nRefinery\nLocation\nThroughput \nCapacity (a)\n(BPD)\nU.S.:\nBenicia\nCalifornia\n170,000 \nWilmington\nCalifornia\n135,000 \nMeraux\nLouisiana\n135,000 \nSt. Charles\nLouisiana\n340,000 \nArdmore\nOklahoma\n90,000 \nMemphis\nTennessee\n195,000 \nCorpus Christi (b)\nTexas\n370,000 \nHouston\nTexas\n255,000 \nMcKee\nTexas\n200,000 \nPort Arthur\nTexas\n435,000 \nTexas City\nTexas\n260,000 \nThree Rivers\nTexas\n100,000 \nCanada:\nQuebec City\nQuebec\n235,000 \nU.K.:\nPembroke\nWales\n270,000 \nTotal\n3,190,000 \n________________________\n(a)\nThroughput capacity represents estimated capacity for processing crude oil, intermediates, and other feedstocks. Total estimated crude oil capacity is approximately 2.7 million BPD.\n(b)\nRepresents the combined capacities of two refineries – the Corpus Christi East and Corpus Christi West Refineries.\n•\nCalifornia\n◦\nBenicia Refinery\n. Our Benicia Refinery is located northeast of San Francisco on the Carquinez Straits of San Francisco Bay. It processes sour crude oils into California Reformulated Gasoline Blendstock for Oxygenate Blending (CARBOB) and Conventional Blendstock for Oxygenate Blending (CBOB) gasolines, CARB diesel, diesel, jet fuel, and asphalt. Gasoline production is primarily CARBOB, which meets CARB specifications when blended with ethanol. The refinery receives feedstocks via a marine dock and pipelines and distributes most of its products via pipeline and truck.\n7\nTa\nble \no\nf\n \nConten\nt\ns\n◦\nWilmington Refinery\n. Our Wilmington Refinery is located near Los Angeles. It processes a blend of heavy and high-sulfur crude oils and produces CARBOB and CBOB gasolines, CARB diesel, diesel, jet fuel, and asphalt. The refinery receives feedstocks via pipelines connected\n \nto marine terminals and docks and distributes its products via pipeline to various terminals.\n•\nLouisiana\n◦\nMeraux Refinery\n. Our Meraux Refinery is located approximately 15 miles southeast of New Orleans on the Mississippi River. It processes sour and sweet crude oils and produces gasoline, diesel, jet fuel, and high-sulfur fuel oil. The refinery receives feedstocks at its dock and has access to the Louisiana Offshore Oil Port and distributes its products via its dock and the Colonial Pipeline. The refinery is located about 40 miles from our St. Charles Refinery, allowing for integration of feedstocks and refined petroleum product blending.\n◦\nSt. Charles Refinery\n. Our St. Charles Refinery is located approximately 25 miles west of New Orleans on the Mississippi River. It processes sour crude oils and other feedstocks and produces gasoline and diesel. The refinery receives feedstocks via its docks and has access to the Louisiana Offshore Oil Port and distributes its products via its docks and our Parkway Pipeline and the Bengal Pipeline, both of which access the Plantation Pipeline and Colonial Pipeline.\n•\nOklahoma\n◦\nArdmore Refinery\n. Our Ardmore Refinery is located approximately 100 miles south of Oklahoma City. It processes primarily sweet crude oils and produces gasoline and diesel. The refinery receives feedstocks via pipelines and distributes its products via rail, truck, and the Magellan Pipeline system.\n•\nTennessee\n◦\nMemphis Refinery\n. Our Memphis Refinery is located on the Mississippi River. It processes primarily sweet crude oils and produces gasoline, diesel, and jet fuel. The refinery receives feedstocks via the Diamond Pipeline, the Dakota Access Pipeline, barge, and rail and distributes its products via truck, barge, the Shorthorn Pipeline, and rail.\n•\nTexas\n◦\nCorpus Christi East and West Refineries\n. Our Corpus Christi East and West Refineries are located on the Corpus Christi Ship Channel. The East Refinery processes sour crude oil and the West Refinery processes sweet crude oil, sour crude oil, and residual fuel oil, and both refineries produce gasoline, aromatics, jet fuel, diesel, and asphalt. The refineries receive feedstocks via docks on the Corpus Christi Ship Channel and pipelines. The refineries’ physical locations allow for the transfer of various feedstocks and blending components between them. The refineries distribute their products via truck, ship, barge, and pipeline.\n◦\nHouston Refinery\n. Our Houston Refinery is located on the Houston Ship Channel. It processes sweet crude and intermediate oils and produces gasoline, jet fuel, and diesel. The refinery receives feedstocks via pipeline, ship, and barge and distributes its products via pipeline, including the Colonial Pipeline and Explorer Pipeline.\n◦\nMcKee Refinery\n. Our McKee Refinery is located in the Texas Panhandle. It processes primarily sweet crude oils and produces gasoline, diesel, jet fuel, and asphalt. The refinery receives feedstocks via pipeline and distributes its products primarily via pipeline and rail.\n8\nTa\nble \no\nf\n \nConten\nt\ns\n◦\nPort Arthur Refinery\n. Our Port Arthur Refinery is located on the Texas Gulf Coast approximately 90 miles east of Houston. It processes heavy sour crude oils and other feedstocks and produces gasoline, diesel, jet fuel, and residual fuel oil. The refinery receives feedstocks via rail, ship, barge, and pipeline and distributes its products via pipeline, including the Colonial Pipeline and Explorer Pipeline, and via ship and barge.\n◦\nTexas City Refinery\n. Our Texas City Refinery is located southeast of Houston on the Texas City Ship Channel. It processes crude oils and produces gasoline, diesel, and jet fuel. The refinery receives feedstocks via pipeline and by ship and barge using docks on the Texas City Ship Channel and distributes its products via ship and barge, as well as via pipeline, including the Colonial Pipeline and Explorer Pipeline.\n◦\nThree Rivers Refinery\n. Our Three Rivers Refinery is located in South Texas between Corpus Christi and San Antonio. It primarily processes sweet crude oils and produces gasoline, diesel, jet fuel, and aromatics. The refinery receives feedstocks via pipeline and truck and distributes its products primarily via pipeline.\n•\nCanada\n◦\nQuebec Refinery\n. Our Quebec Refinery is located in Lévis (near Quebec City). It processes sweet crude oils and produces gasoline, diesel, jet fuel, heating oil, and low-sulfur fuel oil. The refinery receives feedstocks via ship at its marine dock on the St. Lawrence River (some of which is sourced from our crude oil terminal in Montreal that receives crude oil from western Canada) and distributes its products via our pipeline to our Montreal East terminal and other terminals and via rail, truck, and ship.\n•\nU.K.\n◦\nPembroke Refinery\n. Our Pembroke Refinery is located in the County of Pembrokeshire in South West Wales. It processes primarily sweet crude oils and produces gasoline, diesel, jet fuel, heating oil, and low-sulfur fuel oil. The refinery receives its feedstocks via ship and barge through docks on the Milford Haven Waterway and distributes its products via truck, ship, barge, and our Mainline Pipeline.\nFeedstock Supply\nOur crude oil and other feedstocks are purchased through a combination of term and spot contracts. Our term supply contracts are at market-related prices and feedstocks are purchased directly or indirectly from various national oil companies as well as international and U.S. oil companies. The contracts generally permit the parties to amend the contracts (or terminate them), effective as of the next scheduled renewal date, by giving the other party proper notice within a prescribed period of time (e.g., 60 days, 6 months) before expiration of the current term. The majority of the crude oil purchased under our term contracts is purchased at the producer’s official stated price (i.e., the “market” price established by the seller for all purchasers) and not at a negotiated price specific to us.\n9\nTa\nble \no\nf\n \nConten\nt\ns\nMarketing\nOverview\nWe sell refined petroleum products in both the wholesale rack and bulk markets. These sales include products that are manufactured in our refining operations, as well as products purchased or received on exchange from third parties. Most of our refineries have access to marine facilities, and they interconnect with common-carrier pipeline systems, allowing us to sell products in the U.S., Canada, the U.K., Ireland, Latin America, and other parts of the world.\nWholesale Rack Sales\nWe sell our products on a wholesale basis through an extensive rack marketing network. The principal purchasers of our products from terminal truck racks are wholesalers, distributors, retailers, and truck-delivered end users throughout the U.S., Canada, the U.K., Ireland, and Latin America.\nThe majority of our rack volume is sold through unbranded channels. The remainder is sold to distributors and dealers that are members of the Valero family of brands that operate branded sites in the U.S., Canada, the U.K., Ireland, and Mexico. These sites are independently owned and are supplied by us under multi-year contracts. Approximately 7,000\n \noutlets carry our brand names. For branded sites, products are sold under the Valero\n®\n, Beacon\n®\n, Diamond Shamrock\n®\n,\n \nand Shamrock\n®\n brands in the U.S., the Ultramar\n®\n brand in Canada, the Valero\n® \nand Texaco\n®\n brands in the U.K. and Ireland, and the Valero\n®\n brand in Mexico.\nBulk Sales\nWe also sell our products through bulk sales channels in the U.S. and international markets. Our bulk sales are made to various petroleum companies, traders, and bulk end users, such as railroads, airlines, and utilities. Our bulk sales are distributed primarily via pipeline, ship, and barge to major tank farms and trading hubs.\nLogistics\nWe own logistics assets (crude oil pipelines, product pipelines, terminals, tanks, marine docks, truck rack bays, and other assets) that support our refining operations and export capabilities. Demand for transportation fuels in Latin America is expected to continue to grow. To support our wholesale rack operations in Latin America, we have invested in or grown our access to terminals in Mexico and Peru. Our U.S. Gulf Coast refineries are well positioned to support export growth to Latin America, and all of our refineries with waterborne access are well positioned to support export growth in other countries around the world.\nRenewable Diesel\n \nOur Relationship with DGD\nDGD is a joint venture that we consolidate. We entered into the DGD joint venture in 2011 and it began operations in 2013. See Note 12 of Notes to Consolidated Financial Statements regarding our accounting for DGD. We operate DGD’s renewable diesel plants and perform certain management functions for DGD as an independent contractor under an agreement with DGD.\nRenewable Diesel Plants\nDGD owns two renewable diesel plants. The first DGD plant began operations in 2013 and is located next to our St. Charles Refinery (the DGD St. Charles Plant). The second DGD plant commenced operations in the fourth quarter of 2022 and is located next to our Port Arthur Refinery (the DGD Port Arthur Plant, and together with the DGD St. Charles Plant, the DGD Plants). The DGD Plants produce renewable diesel, renewable naphtha, and with the completion of the SAF project at the DGD Port Arthur Plant, began \n10\nTa\nble \no\nf\n \nConten\nt\ns\nproducing neat SAF in the fourth quarter of 2024. Renewable diesel is a low-carbon liquid transportation fuel that is interchangeable with petroleum-based diesel. Renewable naphtha is used to produce renewable gasoline and renewable plastics. These products are produced from waste and renewable feedstocks using a pre-treatment process and an advanced hydroprocessing-isomerization process. Neat SAF is a renewable blending component that, under current aviation regulations, can be blended up to 50 percent with conventional jet fuel to produce SAF for use in an aircraft. The market value of these products can vary based on regional policies, feedstock preferences, and CI scores. Waste feedstocks (predominantly animal fats, used cooking oils, and inedible distillers corn oils (DCOs)) are the preferred feedstocks due to their lower CI scores; however, vegetable oils and other renewable feedstocks are also used. While several other companies have made, or have announced interest in making, investments in renewable diesel projects, the DGD Plants are currently two of only a small number of operational facilities that have the capacity to process 100 percent waste feedstocks, and this feedstock flexibility currently provides a margin advantage.\nThe DGD Plants receive waste and renewable feedstocks primarily by rail, truck, ship, and barge owned by third parties. DGD is party to a raw material supply agreement with Darling under which Darling is obligated to offer to DGD a portion of its feedstock requirements at market pricing, but DGD is not obligated to purchase all or any part of its feedstock from Darling. Therefore, DGD pursues the most optimal feedstock supply available.\nThe DGD St. Charles Plant has a production capacity of approximately 700 million gallons of renewable diesel and approximately 30 million gallons of renewable naphtha per year. The DGD Port Arthur Plant, which has a production capacity of approximately 470 million gallons of renewable diesel and approximately 20 million gallons of renewable naphtha per year, commenced operations in the fourth quarter of 2022. DGD’s combined renewable diesel and renewable naphtha production capacities increased to approximately 1.2 billion gallons and 50 million gallons, respectively, per year.\nThe SAF project at the DGD Port Arthur Plant commenced operations in the fourth quarter of 2024. The project provides the plant the optionality to upgrade approximately 50 percent of its renewable diesel annual production capacity to neat SAF.\nMarketing\nDGD sells renewable diesel, renewable naphtha, and neat SAF under the Diamond Green Diesel\n®\n brand primarily to be blended with petroleum-based diesel, petroleum-based gasoline, and conventional jet fuel, respectively, and to end users for use in their operations. DGD distributes its renewable diesel and renewable naphtha via rail and ship domestically and to international markets. DGD distributes its neat SAF via ship and barge to domestic markets. In 2025, DGD expects to also distribute neat SAF via ship and barge to international markets.\n11\nTa\nble \no\nf\n \nConten\nt\ns\nEthanol\nEthanol Plants\nOur ethanol business began in 2009 with the purchase of our first ethanol plants. We have since grown the business by purchasing additional ethanol plants. Our 12 ethanol plants are located in the Mid-Continent region of the U.S., and they have a combined ethanol production capacity of approximately 1.7 billion gallons per year. Our ethanol plants are dry mill facilities that process corn to produce ethanol and various co-products, including livestock feed (dry distillers grains, or DDGs, and syrup) and inedible DCOs.\nThe following table presents the locations of our ethanol plants, their annual production capacities for ethanol (in millions of gallons) and DDGs (in tons), and their annual corn processing capacities (in millions of bushels) as of December 31, 2024.\nState\nCity\nEthanol\nProduction\nCapacity\nDDG\nProduction\nCapacity\nCorn\nProcessing\nCapacity\nIndiana\nBluffton\n140\n368,000\n49\nLinden \n140\n368,000\n49\nMount Vernon\n100\n263,000\n35\nIowa\nAlbert City \n140\n368,000\n49\nCharles City \n165\n434,000\n57\nFort Dodge\n150\n394,000\n52\nHartley \n150\n394,000\n52\nLakota\n110\n289,000\n38\nMinnesota\nWelcome \n150\n394,000\n52\nNebraska\nAlbion\n140\n368,000\n49\nOhio\nBloomingburg\n140\n368,000\n49\nSouth Dakota\nAurora \n150\n394,000\n52\nTotal\n1,675\n4,402,000\n583\nWe source our corn supply from local farmers and commercial elevators. Our plants receive corn primarily via rail and truck.\nMarketing\nWe sell our ethanol under term and spot contracts in bulk markets in the U.S. We also export our ethanol into the global markets and have access to logistics assets that are well positioned to support export growth. We distribute our ethanol primarily by rail (using some railcars owned by us), truck, ship, and barge. We sell DDGs primarily to animal feed customers in the U.S., Mexico, and Asia, which are distributed primarily via rail, truck, ship, and barge.\nSeasonality\nDemand for gasoline, diesel, and asphalt is higher during the spring and summer months than during the winter months in most of our markets, primarily due to seasonal increases in highway traffic and construction. The demand for renewable diesel has not significantly fluctuated by season. Ethanol is primarily blended into gasoline, and as a result, ethanol demand typically moves in line with the demand for gasoline.\n12\nTa\nble \no\nf\n \nConten\nt\ns\nGOVERNMENT REGULATIONS\nWe incorporate by reference into this item the disclosures on government regulations, including environmental regulations, contained in the following sections of this report:\n•\n“—OUR COMPREHENSIVE LIQUID FUELS STRATEGY—\nRegulations, Policies, and Standards Driving Low-Carbon Fuel Demand\n”;\n•\n“",
    "item1a": "ITEM 1A. RISK FACTORS) that may adversely affect our operations could indicate that the carrying value of an asset may not be recoverable and result in an impairment loss that could be material. If the circumstances that trigger an impairment also result in a reduction in the estimated useful life of the asset, then we may also be required to recognize an asset retirement obligation for that asset. See also the matters and potential impacts from the uncertainty described in Note 2 of Notes to Consolidated Financial Statements.\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nCOMMODITY PRICE RISK\nWe are exposed to market risks related to the volatility in the price of feedstocks (primarily crude oil, waste and renewable feedstocks, and corn), the products we produce, and natural gas used in our operations. To reduce the impact of price volatility on our results of operations and cash flows, we use commodity derivative instruments, including futures and options to manage the volatility of:\n•\ninventories and firm commitments to purchase inventories generally for amounts by which our current year inventory levels (determined on a LIFO basis) differ from our previous year-end LIFO inventory levels; and\n•\nforecasted purchases and/or product sales at existing market prices that we deem favorable.\nOur positions in commodity derivative instruments are monitored and managed on a daily basis by our risk control group to ensure compliance with our stated risk management policy that is periodically reviewed with our Board and/or relevant Board committee.\nAs of December 31, 2024 and 2023, the amount of gain or loss that would have resulted from a 10 percent increase or decrease in the underlying price for all of our commodity derivative instruments entered into for purposes other than trading with which we have market risk was not material. See Note 20 of Notes to Consolidated Financial Statements for notional volumes associated with these derivative contracts as of December 31, 2024.\nCOMPLIANCE PROGRAM PRICE RISK\nWe are exposed to market risk related to the volatility in the price of credits needed to comply with the Renewable and Low-Carbon Fuel Programs. To manage this risk, we enter into contracts to purchase these credits. As of December 31, 2024 and 2023, the amount of gain or loss in the fair value of derivative instruments that would have resulted from a 10 percent increase or decrease in the underlying price of the contracts was not material. See Note 20 of Notes to Consolidated Financial Statements for a discussion about these blending programs.\n63\nTable of Contents\nINTEREST RATE RISK\nThe following tables provide information about our debt instruments (dollars in millions), the fair values of which are sensitive to changes in interest rates. A 10 percent increase or decrease in our floating interest rates would not have a material effect on our results of operations. Principal cash flows and related weighted-average interest rates by expected maturity dates are presented. See Note 9 of Notes to Consolidated Financial Statements for additional information related to our debt.\nDecember 31, 2024\n (a)\nExpected Maturity Dates\n2025\n2026\n2027\n2028\n2029\nThere-\nafter\nTotal\nFair\nValue\nFixed rate\n$\n441\n$\n672\n$\n564\n$\n1,047\n$\n439\n$\n4,935\n$\n8,098\n$\n7,718 \nAverage interest rate\n3.2 \n%\n4.2 \n%\n2.2 \n%\n4.4 \n%\n4.0 \n%\n5.6 \n%\n4.9 \n%\nFloating rate\n$\n58\n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \n$\n58\n$\n58 \nAverage interest rate\n8.4 \n%\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n8.4 \n%\nDecember 31, \n2023\n (a)\nExpected Maturity Dates\n2024\n2025\n2026\n2027\n2028\nThere-\nafter\nTotal\nFair\nValue\nFixed rate\n$\n167\n$\n441\n$\n672\n$\n564\n$\n1,047\n$\n5,374\n$\n8,265\n$\n8,079 \nAverage interest rate\n1.2 \n%\n3.2 \n%\n4.2 \n%\n2.2 \n%\n4.4 \n%\n5.5 \n%\n4.8 \n%\nFloating rate\n$\n1,030\n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \n$\n1,030\n$\n1,030 \nAverage interest rate\n8.7 \n%\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n8.7 \n%\n________________________\n(a)\nExcludes unamortized discounts and debt issuance costs.\nFOREIGN CURRENCY RISK\nWe are exposed to exchange rate fluctuations on transactions related to our foreign operations that are denominated in currencies other than the local (functional) currencies of those operations. To manage our exposure to these exchange rate fluctuations, we often use foreign currency contracts. As of December 31, 2024 and 2023, the fair value of our foreign currency contracts was not material.\nSee Note 20 of Notes to Consolidated Financial Statements for a discussion about our foreign currency risk management activities.\n64\nTable of Contents\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is responsible for establishing and maintaining adequate “internal control over financial reporting” (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934) for Valero Energy Corporation. Our management evaluated the effectiveness of Valero’s internal control over financial reporting as of December 31, 2024. In its evaluation, management used the criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Management believes that as of December 31, 2024, our internal control over financial reporting was effective based on those criteria.\nOur independent registered public accounting firm has issued an attestation report on the effectiveness of our internal control over financial reporting, which begins on page \n68\n of this report.\n65\nTable of Contents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nValero Energy Corporation:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Valero Energy Corporation and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the years in the three-year period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated February 26, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated \n66\nTable of Contents\nfinancial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAssessment of gross unrecognized tax benefits\nAs discussed in Note 15 to the consolidated financial statements, as of December 31, 2024, the Company has gross unrecognized tax benefits, excluding related interest and penalties, of $316 million. The Company’s tax positions are subject to examination by local taxing authorities and resolution of such examinations may span multiple years. Due to the complexities inherent in the interpretation of income tax laws in domestic and foreign jurisdictions, it is uncertain whether some of the Company’s income tax positions will be sustained upon examination.\nWe identified the assessment of the Company’s gross unrecognized tax benefits as a critical audit matter. Complex auditor judgment was required in evaluating the Company’s interpretation of income tax laws and assessing the Company’s determination of the ultimate resolution of its income tax positions.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s income tax process. This included controls to evaluate which of the Company’s income tax positions may not be sustained upon examination and estimate the gross unrecognized tax benefits. We involved domestic and international income tax professionals with specialized skills and knowledge, who assisted in:\n•\nobtaining an understanding and evaluating the Company’s income tax positions as filed or intended to be filed\n•\nevaluating the Company’s interpretation of income tax laws by developing an independent assessment of the Company’s income tax positions and comparing the results to the Company’s assessment\n•\ninspecting settlements and communications with applicable taxing authorities\n•\nassessing the expiration of applicable statutes of limitations.\nIn addition, we evaluated the Company’s ability to estimate its gross unrecognized tax benefits by comparing historical uncertain income tax positions, including the gross unrecognized tax benefits, to actual results upon conclusion of tax examinations.\n/s/ \nKPMG LLP\nWe have served as the Company’s auditor since 2004.\nSan Antonio, Texas\nFebruary 26, 2025\n67\nTable of Contents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nValero Energy Corporation:\nOpinion on Internal Control Over Financial Reporting\nWe have audited Valero Energy Corporation and subsidiaries’ (the Company) internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\n \nIn our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements), and our report dated February 26, 2025 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the \n68\nTable of Contents\nassets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nSan Antonio, Texas\nFebruary 26, 2025\n69\nTable of Contents\nVALERO ENERGY CORPORATION\nCONSOLIDATED BALANCE SHEETS\n(millions of dollars, except par value)\nDecember 31,\n2024\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n4,657\n \n$\n5,424\n \nReceivables, net\n10,708\n \n12,525\n \nInventories\n7,761\n \n7,583\n \nPrepaid expenses and other\n611\n \n689\n \nTotal current assets\n23,737\n \n26,221\n \nProperty, plant, and equipment, at cost\n52,368\n \n51,668\n \nAccumulated depreciation\n(\n23,054\n)\n(\n21,459\n)\nProperty, plant, and equipment, net\n29,314\n \n30,209\n \nDeferred charges and other assets, net\n7,092\n \n6,626\n \nTotal assets\n$\n60,143\n \n$\n63,056\n \nLIABILITIES AND EQUITY\nCurrent liabilities:\nCurrent portion of debt and finance lease obligations\n$\n743\n \n$\n1,406\n \nAccounts payable\n12,092\n \n12,567\n \nAccrued expenses\n1,130\n \n1,240\n \nTaxes other than income taxes payable\n1,360\n \n1,452\n \nIncome taxes payable\n170\n \n137\n \nTotal current liabilities\n15,495\n \n16,802\n \nDebt and finance lease obligations, less current portion\n9,720\n \n10,118\n \nDeferred income tax liabilities\n5,267\n \n5,349\n \nOther long-term liabilities\n2,140\n \n2,263\n \nCommitments and contingencies\nEquity:\nValero Energy Corporation stockholders’ equity:\nCommon stock, $\n0.01\n par value; \n1,200,000,000\n shares authorized;\n673,501,593\n and \n673,501,593\n shares issued\n7\n \n7\n \nAdditional paid-in capital\n6,939\n \n6,901\n \nTreasury stock, at cost;\n358,637,890\n and \n340,199,677\n common shares\n(\n28,178\n)\n(\n25,322\n)\nRetained earnings\n47,016\n \n45,630\n \nAccumulated other comprehensive loss\n(\n1,272\n)\n(\n870\n)\nTotal Valero Energy Corporation stockholders’ equity\n24,512\n \n26,346\n \nNoncontrolling interests\n3,009\n \n2,178\n \nTotal equity\n27,521\n \n28,524\n \nTotal liabilities and equity\n$\n60,143\n \n$\n63,056\n \nSee Notes to Consolidated Financial Statements.\n70\nTable of Contents\nVALERO ENERGY CORPORATION\nCONSOLIDATED STATEMENTS OF INCOME\n(millions of dollars, except per share amounts)\nYear Ended December 31,\n2024\n2023\n2022\nRevenues (a)\n$\n129,881\n \n$\n144,766\n \n$\n176,383\n \nCost of sales:\nCost of materials and other\n116,516\n \n123,087\n \n150,770\n \nOperating expenses (excluding depreciation and amortization\nexpense reflected below)\n5,831\n \n6,089\n \n6,389\n \nDepreciation and amortization expense\n2,729\n \n2,658\n \n2,428\n \nTotal cost of sales\n125,076\n \n131,834\n \n159,587\n \nAsset impairment loss\n—\n \n—\n \n61\n \nOther operating expenses\n44\n \n33\n \n66\n \nGeneral and administrative expenses (excluding depreciation and\namortization expense reflected below)\n961\n \n998\n \n934\n \nDepreciation and amortization expense\n45\n \n43\n \n45\n \nOperating income\n3,755\n \n11,858\n \n15,690\n \nOther income, net\n499\n \n502\n \n179\n \nInterest and debt expense, net of capitalized interest\n(\n556\n)\n(\n592\n)\n(\n562\n)\nIncome before income tax expense\n3,698\n \n11,768\n \n15,307\n \nIncome tax expense\n692\n \n2,619\n \n3,428\n \nNet income\n3,006\n \n9,149\n \n11,879\n \nLess: Net income attributable to noncontrolling interests\n236\n \n314\n \n351\n \nNet income attributable to Valero Energy Corporation stockholders\n$\n2,770\n \n$\n8,835\n \n$\n11,528\n \nEarnings per common share\n$\n8.58\n \n$\n24.93\n \n$\n29.05\n \nWeighted-average common shares outstanding (in millions)\n322\n \n353\n \n395\n \nEarnings per common share – assuming dilution\n$\n8.58\n \n$\n24.92\n \n$\n29.04\n \nWeighted-average common shares outstanding – \nassuming dilution (in millions)\n322\n \n353\n \n396\n \n__________________________\nSupplemental information:\n(a) Includes excise taxes on sales by certain of our foreign\noperations\n$\n5,907\n \n$\n5,765\n \n$\n5,194\n \n    \nSee Notes to Consolidated Financial Statements.\n71\nTable of Contents\nVALERO ENERGY CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(millions of dollars)\nYear Ended December 31,\n2024\n2023\n2022\nNet income\n$\n3,006\n \n$\n9,149\n \n$\n11,879\n \nOther comprehensive income (loss):\nForeign currency translation adjustment\n(\n546\n)\n433\n \n(\n613\n)\nNet gain on pension\nand other postretirement benefits\n207\n \n30\n \n335\n \nNet gain (loss) on cash flow hedges\n(\n87\n)\n90\n \n(\n6\n)\nOther comprehensive income (loss) before\nincome tax expense\n(\n426\n)\n553\n \n(\n284\n)\nIncome tax expense related to\nitems of other comprehensive income (loss)\n21\n \n18\n \n70\n \nOther comprehensive income (loss)\n(\n447\n)\n535\n \n(\n354\n)\nComprehensive income\n2,559\n \n9,684\n \n11,525\n \nLess: Comprehensive income attributable\nto noncontrolling interests\n191\n \n360\n \n348\n \nComprehensive income attributable to\nValero Energy Corporation stockholders\n$\n2,368\n \n$\n9,324\n \n$\n11,177\n \nSee Notes to Consolidated Financial Statements.\n72\nTable of Contents\nVALERO ENERGY CORPORATION\nCONSOLIDATED STATEMENTS OF EQUITY\n(millions of dollars, except per share amounts)\nValero Energy Corporation Stockholders’ Equity\nCommon\nStock\nAdditional\nPaid-in\nCapital\nTreasury\nStock\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nLoss\nTotal\nNon-\ncontrolling\nInterests\nTotal\nEquity\nBalance as of December 31, 2021\n$\n7\n \n$\n6,827\n \n$\n(\n15,677\n)\n$\n28,281\n \n$\n(\n1,008\n)\n$\n18,430\n \n$\n1,387\n \n$\n19,817\n \nNet income\n— \n— \n— \n11,528\n \n— \n11,528\n \n351\n \n11,879\n \nDividends on common stock\n($\n3.92\n per share)\n— \n— \n— \n(\n1,562\n)\n— \n(\n1,562\n)\n— \n(\n1,562\n)\nStock-based compensation expense\n— \n89\n \n— \n— \n— \n89\n \n— \n89\n \nTransactions in connection with\nstock-based compensation plans\n— \n(\n53\n)\n57\n \n— \n— \n4\n \n— \n4\n \nPurchases of common stock for treasury\n— \n— \n(\n4,577\n)\n— \n— \n(\n4,577\n)\n— \n(\n4,577\n)\nContributions from noncontrolling interests\n— \n— \n— \n— \n— \n— \n265\n \n265\n \nDistributions to noncontrolling interests\n— \n— \n— \n— \n— \n— \n(\n93\n)\n(\n93\n)\nOther comprehensive loss\n— \n— \n— \n— \n(\n351\n)\n(\n351\n)\n(\n3\n)\n(\n354\n)\nBalance as of December 31, 2022\n7\n \n6,863\n \n(\n20,197\n)\n38,247\n \n(\n1,359\n)\n23,561\n \n1,907\n \n25,468\n \nNet income\n— \n— \n— \n8,835\n \n— \n8,835\n \n314\n \n9,149\n \nDividends on common stock\n($\n4.08\n per share)\n— \n— \n— \n(\n1,452\n)\n— \n(\n1,452\n)\n— \n(\n1,452\n)\nStock-based compensation expense\n— \n94\n \n— \n— \n— \n94\n \n— \n94\n \nTransactions in connection with\nstock-based compensation plans\n— \n(\n56\n)\n63\n \n— \n— \n7\n \n— \n7\n \nPurchases of common stock for treasury\n— \n— \n(\n5,188\n)\n— \n— \n(\n5,188\n)\n— \n(\n5,188\n)\nContributions from noncontrolling interests\n— \n— \n— \n— \n— \n— \n75\n \n75\n \nDistributions to noncontrolling interests\n— \n— \n— \n— \n— \n— \n(\n164\n)\n(\n164\n)\nOther comprehensive income\n— \n— \n— \n— \n489\n \n489\n \n46\n \n535\n \nBalance as of December 31, 2023\n7\n \n6,901\n \n(\n25,322\n)\n45,630\n \n(\n870\n)\n26,346\n \n2,178\n \n28,524\n \nNet income\n— \n— \n— \n2,770\n \n— \n2,770\n \n236\n \n3,006\n \nDividends on common stock\n($\n4.28\n per share)\n— \n— \n— \n(\n1,384\n)\n— \n(\n1,384\n)\n— \n(\n1,384\n)\nStock-based compensation expense\n— \n89\n \n— \n— \n— \n89\n \n— \n89\n \nTransactions in connection with\nstock-based compensation plans\n— \n(\n51\n)\n52\n \n— \n— \n1\n \n— \n1\n \nPurchases of common stock for treasury\n— \n— \n(\n2,908\n)\n— \n— \n(\n2,908\n)\n— \n(\n2,908\n)\nContributions from noncontrolling interests\n— \n— \n— \n— \n— \n— \n90\n \n90\n \nDistributions to noncontrolling interests\n— \n— \n— \n— \n— \n— \n(\n182\n)\n(\n182\n)\nConversion of IEnova Revolver\ndebt to equity (see Notes 9 and 12)\n— \n— \n— \n— \n— \n— \n732\n \n732\n \nOther comprehensive loss\n— \n— \n— \n— \n(\n402\n)\n(\n402\n)\n(\n45\n)\n(\n447\n)\nBalance as of December 31, 2024\n$\n7\n \n$\n6,939\n \n$\n(\n28,178\n)\n$\n47,016\n \n$\n(\n1,272\n)\n$\n24,512\n \n$\n3,009\n \n$\n27,521\n \nSee Notes to Consolidated Financial Statements.\n73\nTable of Contents\nVALERO ENERGY CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(millions of dollars)\nYear Ended December 31,\n2024\n2023\n2022\nCash flows from operating activities:\nNet income\n$\n3,006\n \n$\n9,149\n \n$\n11,879\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization expense\n2,774\n \n2,701\n \n2,473\n \nGain on early retirement of debt, net\n—\n \n(\n11\n)\n(\n14\n)\nAsset impairment loss\n—\n \n—\n \n61\n \nDeferred income tax expense (benefit)\n(\n87\n)\n103\n \n50\n \nChanges in current assets and current liabilities\n795\n \n(\n2,326\n)\n(\n1,626\n)\nChanges in deferred charges and credits and other operating activities, net\n195\n \n(\n387\n)\n(\n249\n)\nNet cash provided by operating activities\n6,683\n \n9,229\n \n12,574\n \nCash flows from investing activities:\nCapital expenditures (excluding variable interest entities (VIEs))\n(\n649\n)\n(\n665\n)\n(\n788\n)\nCapital expenditures of VIEs:\nDiamond Green Diesel Holdings LLC (DGD)\n(\n250\n)\n(\n235\n)\n(\n853\n)\nOther VIEs\n(\n8\n)\n(\n11\n)\n(\n40\n)\nDeferred turnaround and catalyst cost expenditures (excluding VIEs)\n(\n1,079\n)\n(\n946\n)\n(\n1,030\n)\nDeferred turnaround and catalyst cost expenditures of DGD\n(\n71\n)\n(\n59\n)\n(\n26\n)\nPurchases of available-for-sale (AFS) debt securities\n(\n29\n)\n(\n276\n)\n(\n100\n)\nProceeds from sales and maturities of AFS debt securities\n81\n \n314\n \n5\n \nProceeds from sale of assets\n—\n \n—\n \n32\n \nInvestments in nonconsolidated joint ventures\n—\n \n—\n \n(\n1\n)\nOther investing activities, net\n24\n \n13\n \n(\n4\n)\nNet cash used in investing activities\n(\n1,981\n)\n(\n1,865\n)\n(\n2,805\n)\nCash flows from financing activities:\nProceeds from debt issuance and borrowings (excluding VIEs)\n6,700\n \n1,750\n \n2,239\n \nProceeds from debt borrowings of VIEs:\nDGD\n410\n \n550\n \n809\n \nOther VIEs\n27\n \n120\n \n105\n \nRepayments of debt and finance lease obligations (excluding VIEs)\n(\n7,086\n)\n(\n2,125\n)\n(\n5,067\n)\nRepayments of debt and finance lease obligations of VIEs:\nDGD\n(\n686\n)\n(\n480\n)\n(\n823\n)\nOther VIEs\n(\n13\n)\n(\n77\n)\n(\n73\n)\nPremiums paid on early retirement of debt\n—\n \n(\n5\n)\n(\n56\n)\nPurchases of common stock for treasury\n(\n2,875\n)\n(\n5,136\n)\n(\n4,577\n)\nPayment of excise tax on purchases of common stock for treasury\n(\n49\n)\n—\n \n—\n \nCommon stock dividend payments\n(\n1,384\n)\n(\n1,452\n)\n(\n1,562\n)\nContributions from noncontrolling interests\n90\n \n75\n \n265\n \nDistributions to noncontrolling interests\n(\n182\n)\n(\n164\n)\n(\n93\n)\nOther financing activities, net\n(\n1\n)\n3\n \n(\n16\n)\nNet cash used in financing activities\n(\n5,049\n)\n(\n6,941\n)\n(\n8,849\n)\nEffect of foreign exchange rate changes on cash\n(\n248\n)\n139\n \n(\n180\n)\nNet increase (decrease) in cash, cash equivalents, and restricted cash\n(\n595\n)\n562\n \n740\n \nCash and cash equivalents at beginning of year\n5,424\n \n4,862\n \n4,122\n \nCash, cash equivalents, and restricted cash at end of year (a)\n$\n4,829\n \n$\n5,424\n \n$\n4,862\n \n________________________\n(a)\nRestricted cash is included in prepaid expenses and other in our consolidated balance sheets.\nSee Notes to Consolidated Financial Statements.\n74\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.    DESCRIPTION OF BUSINESS, BASIS OF PRESENTATION, AND SIGNIFICANT ACCOUNTING POLICIES\nDescription of Business\nThe terms “Valero,” “we,” “our,” and “us,” as used in this report, may refer to Valero Energy Corporation, one or more of its consolidated subsidiaries, or all of them taken as a whole. The term “DGD,” as used in this report, may refer to Diamond Green Diesel Holdings LLC, its wholly owned consolidated subsidiary, or both of them taken as a whole.\nWe are a multinational manufacturer and marketer of petroleum-based and low-carbon liquid transportation fuels and petrochemical products, and we sell our products primarily in the United States (U.S.), Canada, the United Kingdom (U.K.), Ireland, and Latin America. We own \n15\n petroleum refineries located in the U.S., Canada, and the U.K. with a combined throughput capacity of approximately \n3.2\n million barrels per day. We are a joint venture member in DGD, which produces low-carbon fuels at \ntwo\n plants located in the Gulf Coast region of the U.S. with a combined production capacity of approximately \n1.2\n billion gallons per year. We also own \n12\n ethanol plants located in the Mid-Continent region of the U.S. with a combined production capacity of approximately \n1.7\n billion gallons per year.\nBasis of Presentation\nGeneral\nThese consolidated financial statements were prepared in conformity with U.S. generally accepted accounting principles (GAAP) and with the rules and regulations of the U.S. Securities and Exchange Commission (SEC).\nSignificant Accounting Policies\nPrinciples of Consolidation\nThese financial statements include those of Valero, our wholly owned subsidiaries, and VIEs in which we have a controlling financial interest. The VIEs that we consolidate are described in Note 12. The ownership interests held by others in the VIEs are recorded as noncontrolling interests. Intercompany items and transactions have been eliminated in consolidation. Investments in less than wholly owned entities where we have significant influence are accounted for using the equity method.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires us to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. Actual results could differ from those estimates. On an ongoing basis, we review our estimates based on currently available information. Changes in facts and circumstances may result in revised estimates.\nCash Equivalents\nOur cash equivalents are short-term, highly liquid investments that are readily convertible to known amounts of cash and have a maturity of three months or less when acquired.\nInvestments in Debt Securities\nInvestments in debt securities that have stated maturities of three months or less from the date of acquisition are classified as cash equivalents, and those with stated maturities of greater than three months \n75\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nbut less than one year are classified as short-term investments, which are reflected in prepaid expenses and other in our balance sheets. Our investments in debt securities are classified as AFS and are subsequently measured and carried at fair value in our balance sheets with changes in fair value reported in other comprehensive income until realized. The cost of a security sold is determined using the first-in, first-out method.\nReceivables\nTrade receivables are carried at amortized cost, which is the original invoice amount adjusted for cash collections, write-offs, and foreign exchange. We maintain an allowance for credit losses, which is adjusted based on management’s assessment of our customers’ historical collection experience, known or expected credit risks, and industry and economic conditions.\nInventories\nThe cost of (i) refinery feedstocks and refined petroleum products and blendstocks, (ii) renewable diesel feedstocks (i.e., waste and renewable feedstocks, predominantly animal fats, used cooking oils, vegetable oils, and inedible distillers corn oils (DCOs)) and products, and (iii) ethanol feedstocks and products is determined under the last-in, first-out (LIFO) method using the dollar-value LIFO approach, with any increments valued based on average purchase prices during the year. Our LIFO inventories are carried at the lower of cost or market. The cost of products purchased for resale and the cost of materials and supplies are determined principally under the weighted-average cost method. Our non-LIFO inventories are carried at the lower of cost or net realizable value.\nIn determining the market value of our inventories, we assume that feedstocks are converted into products, which requires us to make estimates regarding the products expected to be produced from those feedstocks and the conversion costs required to convert those feedstocks into products. We also estimate the usual and customary transportation costs required to move the inventory from our plants to the appropriate points of sale. We then apply an estimated selling price to our inventories. If the aggregate market value of our LIFO inventories or the aggregate net realizable value of our non-LIFO inventories is less than the related aggregate cost, we recognize a loss for the difference in our statements of income. To the extent the aggregate market value of our LIFO inventories subsequently increases, we recognize an increase to the value of our inventories (not to exceed cost) and a gain in our statements of income.\nProperty, Plant, and Equipment\nThe cost of property, plant, and equipment (property assets) purchased or constructed, including betterments of property assets, is capitalized. However, the cost of repairs to and normal maintenance of property assets is expensed as incurred. Betterments of property assets are those that extend the useful life, increase the capacity or improve the operating efficiency of the asset, or improve the safety of our operations. The cost of property assets constructed includes interest and certain overhead costs allocable to the construction activities.\nOur operations are highly capital intensive. Each of our refineries and plants comprises a large base of property assets, consisting of a series of interconnected, highly integrated and interdependent crude oil and other feedstock processing facilities and supporting infrastructure (Units) and other property assets that support our business. Improvements consist of the addition of new Units and other property assets and betterments of those Units and assets. We plan for these improvements by developing a multi-year capital investment program that is updated and revised based on changing internal and external factors.\n76\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nDepreciation of crude oil processing and waste and renewable feedstocks processing facilities is recorded on a straight-line basis over the estimated useful lives of these assets primarily using the composite method of depreciation. We maintain a separate composite group of property assets for each of our refineries and our renewable diesel plants. We estimate the useful life of each group based on an evaluation of the property assets comprising the group, and such evaluations consist of, but are not limited to, the physical inspection of the assets to determine their condition, consideration of the manner in which the assets are maintained, assessment of the need to replace assets, and evaluation of the manner in which improvements impact the useful life of the group. The estimated useful lives of our composite groups range primarily from \n20\n to \n30\n years.\nUnder the composite method of depreciation, the cost of an improvement is added to the composite group to which it relates and is depreciated over that group’s estimated useful life. We design improvements to our crude oil processing and waste and renewable feedstocks processing facilities in accordance with engineering specifications, design standards, and practices we believe to be accepted in our industry, and these improvements have design lives consistent with our estimated useful lives. Therefore, we believe the use of the group life to depreciate the cost of improvements made to the group is reasonable because the estimated useful life of each improvement is consistent with that of the group.\nAlso under the composite method of depreciation, the historical cost of a minor property asset (net of salvage value) that is retired or replaced is charged to accumulated depreciation and no gain or loss is recognized. However, a gain or loss is recognized for a major property asset that is retired, replaced, sold, or for an abnormal disposition of a property asset (primarily involuntary conversions). Gains and losses are reflected in depreciation and amortization expense, unless such amounts are reported separately due to materiality.\nDepreciation of our corn processing facilities, administrative buildings, and other assets is recorded on a straight-line basis over the estimated useful lives of the related assets using the component method of depreciation. The estimated useful life of our corn processing facilities is \n20\n years.\nLeasehold improvements are amortized on a straight-line basis over the shorter of the lease term or the estimated useful life of the related asset. Finance lease right-of-use assets are amortized as discussed below under “Leases.”\nDeferred Charges and Other Assets\n“Deferred charges and other assets, net” primarily include the following:\n•\nturnaround costs, which are incurred in connection with planned major maintenance activities at our refineries, renewable diesel plants, and ethanol plants, are deferred when incurred and amortized on a straight-line basis over the period of time estimated to lapse until the next turnaround occurs;\n•\nfixed-bed catalyst costs, representing the cost of catalyst that is changed out at periodic intervals when the quality of the catalyst has deteriorated beyond its prescribed function, are deferred when incurred and amortized on a straight-line basis over the estimated useful life of the specific catalyst;\n77\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n•\noperating lease right-of-use assets, which are amortized as discussed below under “Leases”;\n•\ninvestments in nonconsolidated joint ventures;\n•\npurchased compliance credits, which are described below under “Costs of Renewable and Low-Carbon Fuel Programs”;\n•\ngoodwill;\n•\nintangible assets, which are amortized over their estimated useful lives; and\n•\nnoncurrent income taxes receivable.\nLeases\nWe evaluate if a contract is or contains a lease at inception of the contract. If we determine that a contract is or contains a lease, we recognize a right-of-use (ROU) asset and lease liability at the commencement date of the lease based on the present value of lease payments over the lease term. The present value of the lease payments is determined by using the implicit rate when readily determinable. If not readily determinable, our centrally managed treasury group provides an incremental borrowing rate based on quoted interest rates obtained from financial institutions. The rate used is for a term similar to the duration of the lease based on information available at the commencement date. Lease terms include options to extend or terminate the lease when it is reasonably certain that we will exercise those options.\nWe recognize ROU assets and lease liabilities for leasing arrangements with terms greater than one year. Except for the marine transportation asset class, we account for lease and nonlease components in a contract as a single lease component for all classes of underlying assets. Our marine transportation contracts include nonlease components, such as maintenance and crew costs. We allocate the consideration in these contracts based on pricing information provided by the third-party broker.\nExpense for an operating lease is recognized as a single lease cost on a straight-line basis over the lease term and is reflected in the appropriate income statement line item based on the leased asset’s function. Amortization expense of a finance lease ROU asset is recognized on a straight-line basis over the lesser of the useful life of the leased asset or the lease term. However, if the lessor transfers ownership of the finance lease ROU asset to us at the end of the lease term, the finance lease ROU asset is amortized over the useful life of the leased asset. Amortization expense is reflected in depreciation and amortization expense. Interest expense is incurred based on the carrying value of the lease liability and is reflected in “interest and debt expense, net of capitalized interest.”\nImpairment of Assets\nLong-lived assets are tested for recoverability whenever events or changes in circumstances indicate that the carrying amount of the asset may not be recoverable. A long-lived asset is not deemed recoverable if its carrying amount exceeds the sum of the undiscounted cash flows expected to result from its use and eventual disposition. If a long-lived asset is not deemed recoverable, an impairment loss is recognized for the amount by which the carrying amount of the long-lived asset exceeds its fair value, with fair value determined based on discounted estimated net cash flows or other appropriate methods.\n78\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nWe evaluate our equity method investments for impairment when there is evidence that we may not be able to recover the carrying amount of our investments or the investee is unable to sustain an earnings capacity that justifies the carrying amount. A loss in the value of an investment that is other than a temporary decline is recognized based on the difference between the estimated current fair value of the investment and its carrying amount.\nGoodwill is not amortized, but is tested for impairment annually on October\n \n1st and in interim periods when events or changes in circumstances indicate that the fair value of a reporting unit with goodwill is below its carrying amount. A goodwill impairment loss is recognized for the amount that the carrying amount of a reporting unit, including goodwill, exceeds its fair value, limited to the total amount of goodwill allocated to that reporting unit.\nAsset Retirement Obligations\nWe record a liability, which is referred to as an asset retirement obligation, at fair value for the estimated cost to retire a tangible long-lived asset at the time we incur that liability, which is generally when the asset is purchased, constructed, or leased. We record the liability when we have a legal obligation to incur costs to retire the asset and when a reasonable estimate of the fair value of the liability can be made. If a reasonable estimate cannot be made at the time the liability is incurred, we record the liability when sufficient information is available to estimate the liability’s fair value.\nWe have obligations with respect to certain of our assets at our refineries and plants to clean and/or dispose of various component parts of the assets at the time they are retired. However, these component parts can be used for extended and indeterminate periods of time as long as they are properly maintained and/or upgraded. It is our practice and current intent to maintain all our assets and continue making improvements to those assets based on technological advances. As a result, we believe that assets at our refineries and plants have indeterminate lives for purposes of estimating asset retirement obligations because dates or ranges of dates upon which we would retire such assets cannot reasonably be estimated at this time. We will recognize a liability at such time when sufficient information exists to estimate a date or range of potential settlement dates that is needed to employ a present value technique to estimate fair value.\nEnvironmental Matters\nLiabilities for future remediation costs are recorded when environmental assessments and/or remedial efforts are probable and the costs can be reasonably estimated. Other than for assessments, the timing and magnitude of these accruals generally are based on the completion of investigations or other studies or a commitment to a formal plan of action. Amounts recorded for environmental liabilities have not been reduced by possible recoveries from third parties and have not been measured on a discounted basis.\nLegal Contingencies\nWe are subject to legal proceedings, claims, and liabilities that arise in the ordinary course of business. We accrue losses associated with legal claims when such losses are probable and reasonably estimable. If we determine that a loss is probable and cannot estimate a specific amount for that loss but can estimate a range of loss, the best estimate within the range is accrued. If no amount within the range is a better estimate than any other, the minimum amount of the range is accrued. Estimates are adjusted as additional \n79\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\ninformation becomes available or circumstances change. Legal defense costs associated with loss contingencies are expensed in the period incurred.\nForeign Currency Translation\nGenerally, our foreign subsidiaries use their local currency as their functional currency. Balance sheet amounts are translated into U.S. dollars using exchange rates in effect as of the balance sheet date. Income statement amounts are translated into U.S. dollars using the exchange rates in effect at the time the underlying transactions occur. Foreign currency translation adjustments are recorded as a component of accumulated other comprehensive loss.\nRevenue Recognition\nOur revenues are primarily generated from contracts with customers. We generate revenue from contracts with customers from the sale of products by our Refining, Renewable Diesel, and Ethanol segments. Revenues are recognized when we satisfy our performance obligation to transfer products to our customers, which typically occurs at a point in time upon shipment or delivery of the products, and for an amount that reflects the transaction price that is allocated to the performance obligation.\nThe customer is able to direct the use of, and obtain substantially all of the benefits from, the products at the point of shipment or delivery. As a result, we consider control to have transferred upon shipment or delivery because we have a present right to payment at that time, the customer has legal title to the asset, we have transferred physical possession of the asset, and the customer has significant risks and rewards of ownership of the asset.\nOur contracts with customers state the final terms of the sale, including the description, quantity, and price for goods sold. Payment terms for our customers vary by type of customer and method of delivery; however, the payment is typically due in full within \ntwo\n to \nten days\n from the date of invoice. In the normal course of business, we generally do not accept product returns.\nThe transaction price is the consideration that we expect to be entitled to in exchange for our products. The transaction price for substantially all of our contracts is generally based on commodity market pricing (i.e., variable consideration). As such, this market pricing may be constrained (i.e., not estimable) at the inception of the contract but will be recognized based on the applicable market pricing, which will be known upon transfer of the goods to the customer. Some of our contracts also contain variable consideration in the form of sales incentives to our customers, such as discounts and rebates. For contracts that include variable consideration, we estimate the factors that determine the variable consideration in order to establish the transaction price.\nWe have elected to exclude from the measurement of the transaction price all taxes assessed by government authorities that are both imposed on and concurrent with a specific revenue-producing transaction and collected by us from a customer (e.g., sales tax, use tax, value-added tax, etc.). We continue to include in the transaction price excise taxes that are imposed on certain inventories in our foreign operations. The amount of such taxes is provided in supplemental information in a footnote to the statements of income.\n80\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThere are instances where we provide shipping services in relation to the goods sold to our customer. Shipping and handling costs that occur before the customer obtains control of the goods are deemed to be fulfillment activities and are included in cost of materials and other. We have elected to account for shipping and handling activities that occur after the customer has obtained control of a good as fulfillment activities rather than as a promised service, and we have included these activities in cost of materials and other.\nWe enter into certain purchase and sale arrangements with the same counterparty that are deemed to be made in contemplation of one another. We combine these transactions and present the net effect in cost of materials and other. We also enter into refined petroleum product exchange transactions to fulfill sales contracts with our customers by accessing refined petroleum products in markets where we do not operate our own refineries. These refined petroleum product exchanges are accounted for as exchanges of nonmonetary assets, and no revenues are recorded on these transactions.\nCost Classifications\nCost of materials and other primarily includes the cost of materials that are a component of our products sold. These costs include (i) the direct cost of materials (such as crude oil and other refinery feedstocks, refined petroleum products and blendstocks, renewable diesel feedstocks and products, and ethanol feedstocks and products) that are a component of our products sold; (ii) costs related to the delivery (such as shipping and handling costs) of products sold; (iii) costs related to our obligations to comply with the Renewable and Low-Carbon Fuel Programs defined below under “Costs of Renewable and Low-Carbon Fuel Programs”; (iv) the blender’s tax credit recognized on qualified fuel mixtures; (v) gains and losses on our commodity derivative instruments; and (vi) certain excise taxes.\nOperating expenses (excluding depreciation and amortization expense) include costs to operate our refineries (and associated logistics assets), renewable diesel plants, and ethanol plants. These costs primarily include employee-related expenses, energy and utility costs, catalysts and chemical costs, and repair and maintenance expenses.\nDepreciation and amortization expense associated with our operations is separately presented in our statements of income as a component of cost of sales and general and administrative expenses and is disclosed by reportable segment in Note 17.\nOther operating expenses include costs, if any, incurred by our reportable segments that are not associated with our cost of sales.\nCosts of Renewable and Low-Carbon Fuel Programs\nWe purchase credits to comply with various government and regulatory blending programs, such as the U.S. Environmental Protection Agency’s Renewable Fuel Standard, California Low Carbon Fuel Standard, Canada Clean Fuel Regulations, U.K. Renewable Transport Fuel Obligation, and similar programs in other jurisdictions in which we operate (collectively, the Renewable and Low-Carbon Fuel Programs). We purchase compliance credits (primarily Renewable Identification Numbers (RINs)) to comply with government regulations that require us to blend a certain volume of renewable and low-carbon fuels into the petroleum-based transportation fuels we produce in, or import into, the respective jurisdiction to be consumed therein based on annual quotas. To the degree that we are unable to blend \n81\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nrenewable and low-carbon fuels at the required quotas, we must purchase compliance credits to meet our obligations.\nThe costs of purchased compliance credits are charged to cost of materials and other when such credits are needed to satisfy our compliance obligations. To the extent we have not purchased enough credits nor entered into fixed-price purchase contracts to satisfy our obligations as of the balance sheet date, we charge cost of materials and other for such deficiency based on the market prices of the credits as of the balance sheet date, and we record a liability for our obligation to purchase those credits. See Note 19 for disclosure of our fair value liability. If the number of purchased credits exceeds our obligation as of the balance sheet date, we record a prepaid asset equal to the amount paid for those excess credits.\nStock-Based Compensation\nCompensation expense for our share-based compensation plans is based on the fair value of the awards granted and is recognized on a straight-line basis over the shorter of (i) the requisite service period of each award or (ii) the period from the grant date to the date retirement eligibility is achieved if that date is expected to occur during the vesting period established in the award.\nIncome Taxes\nIncome taxes are accounted for under the asset and liability method. Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred amounts are measured using enacted tax rates expected to apply to taxable income in the year those temporary differences are expected to be recovered or settled. Deferred tax assets are reduced by unrecognized tax benefits, if such items may be available to offset the unrecognized tax benefit. Income tax effects are released from accumulated other comprehensive loss to retained earnings, when applicable, on an individual item basis as those items are reclassified into income.\nWe have elected to classify any interest expense and penalties related to the underpayment of income taxes in income tax expense.\nWe have elected to treat the global intangible low-taxed income (GILTI) tax as a period expense.\nEarnings per Common Share\nEarnings per common share is computed by dividing net income attributable to Valero stockholders by the weighted-average number of common shares outstanding for the year. Participating securities are included in the computation of basic earnings per share using the two-class method. Earnings per common share – assuming dilution is computed by dividing net income attributable to Valero stockholders by the weighted-average number of common shares outstanding for the year increased by the effect of dilutive securities. Earnings per common share – assuming dilution is also determined using the two-class method, unless the treasury stock method is more dilutive. Potentially dilutive securities are excluded from the computation of earnings per common share – assuming dilution when the effect of including such shares would be antidilutive.\n82\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nDerivatives and Hedging\nAll derivative instruments, not designated as normal purchases or sales, are recognized in our balance sheets as either assets or liabilities measured at their fair values with changes in fair value recognized currently in income or in other comprehensive income as appropriate. The cash flow effects of all of our derivative instruments are reflected in operating activities in our statements of cash flows.\nAccounting Pronouncements Recently Adopted\nASU 2023-07\nIn November 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, to improve interim and annual disclosures about a public entity’s reportable segments primarily through improved disclosures about significant segment expenses and other segment related items. We adopted this ASU effective January 1, 2024 and it did not affect our financial position or our results of operations, but did result in additional disclosures.\nASU 2023-09\nIn December 2023, the FASB issued ASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n, to improve annual income tax disclosures of a public business entity by requiring further disaggregation of information in the rate reconciliation and disaggregation of income taxes paid by jurisdiction. This ASU also includes certain other amendments intended to improve the effectiveness of annual income tax disclosures. We adopted this ASU effective January 1, 2025 and it did not affect our financial position or our results of operations, but will result in additional annual disclosures. \nAccounting Pronouncement Not Yet Adopted\nASU 2024-03\nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement Reporting—Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n, to improve interim and annual disclosures about a public business entity’s expenses by requiring more detailed information in the notes to the financial statements about certain expense categories, including purchases of inventory, employee compensation, depreciation, amortization, and selling expenses. We expect to adopt this ASU effective January 1, 2027 and the adoption will not affect our financial position or our results of operations, but will result in additional disclosures.\n \n83\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n2.    UNCERTAINTY\nIn recent years, the State of California has adopted legislation that has subjected our refining and marketing operations to potential increased operational restrictions and new reporting requirements. Significant legislation that has impacted or could impact our operations includes, but is not limited to, the following:\n•\nIn September 2022, California adopted Senate Bill No. 1322 (SB 1322), which requires refineries in California to report monthly on the volume and cost of the crude oil they buy, the quantity and price of the wholesale gasoline they sell, and the gross gasoline margin per barrel, among other information. The provisions of SB 1322 were effective January 2023.\n•\nIn March 2023, California adopted Senate Bill No. 2 (such statute, together with any regulations contemplated or issued thereunder, SBx 1-2), which, among other things, (i) authorized the establishment of a maximum gross gasoline refining margin (max margin) and the imposition of a financial penalty for profits above a max margin, (ii) significantly expanded the reporting obligations under SB 1322 and the Petroleum Industry Information Reporting Act of 1980, which include reporting requirements to the California Energy Commission (CEC) for all participants in the petroleum industry supply chain in California, and (iii) authorized the CEC to regulate the timing and other aspects of refinery turnaround and maintenance activities in certain instances. The provisions of SBx 1-2 became effective June 26, 2023.\n•\nIn May 2024, the CEC issued resolutions adopting emergency regulations implementing new and expanded refining margin, refinery maintenance, and marine import reporting requirements, all of which became effective in June 2024. It remains uncertain as to what extent any regulations will address the remaining reporting requirements under SBx 1-2.\n•\nIn October 2024, California adopted Assembly Bill No. 1 (ABx 2-1), which among other things, (i) authorizes the CEC to require that refiners maintain minimum levels of inventories of refined transportation fuels, including any feedstocks and blending components for those fuels, and (ii) provides certain requirements for CEC regulations governing the timing of refinery turnarounds and maintenance under existing SBx 1-2 authority, including that the refiner first make resupply plans or other arrangements to the satisfaction of the CEC’s executive director.\nWe continue to review and analyze the provisions of SBx 1-2 and related legislation, the possible impacts to our refining and marketing operations, and potential impacts on consumers in California. Any adverse effects on our operations or financial performance in California could indicate that the carrying value of our assets in California is not recoverable, which would result in an impairment loss that could be material. In addition, if the circumstances that trigger an impairment loss result in a reduction in the estimated useful lives of the assets, we may be required to recognize an asset retirement obligation that could be material. Other jurisdictions are contemplating similarly focused legislation or actions.\nThe ultimate timing and impacts of SBx 1-2 and any other similarly focused legislation or actions are subject to considerable uncertainty due to a number of factors, including technological and economic feasibility, legal challenges, and potential changes in law, regulation, or policy, and it is not currently \n84\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\npossible to predict the ultimate effects of these matters and developments on our financial position, results of operations, and liquidity. Consequently, we have continued to evaluate strategic alternatives for our operations in California. As a result, we updated our evaluation of potential impairment and determined that there continued to be no impairment as of December 31, 2024. Future developments from our evaluation of strategic alternatives could significantly impact our asset impairment assumptions and result in an impairment loss that could be material.\n3.    RECEIVABLES\nReceivables consisted of the following (in millions):\nDecember 31,\n2024\n2023\nReceivables from contracts with customers\n$\n5,812\n \n$\n7,209\n \nReceivables from certain purchase and sale arrangements\n3,939\n \n3,857\n \nReceivables before allowance for credit losses\n9,751\n \n11,066\n \nAllowance for credit losses\n(\n20\n)\n(\n28\n)\nReceivables after allowance for credit losses\n9,731\n \n11,038\n \nIncome taxes receivable\n272\n \n409\n \nOther receivables\n705\n \n1,078\n \nReceivables, net\n$\n10,708\n \n$\n12,525\n \n4.    INVENTORIES\nInventories consisted of the following (in millions):\nDecember 31,\n2024\n2023\nRefinery feedstocks\n$\n2,167\n \n$\n2,223\n \nRefined petroleum products and blendstocks\n4,016\n \n3,790\n \nRenewable diesel feedstocks and products\n872\n \n913\n \nEthanol feedstocks and products\n342\n \n313\n \nMaterials and supplies\n364\n \n344\n \nInventories\n$\n7,761\n \n$\n7,583\n \nAs of December 31, 2024 and 2023, the replacement cost (market value) of LIFO inventories exceeded their LIFO carrying amounts by $\n4.0\n billion and $\n4.4\n billion, respectively. Our non-LIFO inventories accounted for $\n1.3\n billion and $\n1.5\n billion of our total inventories as of December 31, 2024 and 2023, respectively.\n85\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n5.    LEASES\nGeneral\nWe have entered into long-term leasing arrangements for the right to use various classes of underlying assets as follows:\n•\nPipelines, Terminals, and Tanks\n includes facilities and equipment used in the storage, transportation, production, and sale of our feedstocks and products;\n•\nMarine Transportation\n includes time charters for ocean-going tankers and coastal vessels;\n•\nRail Transportation\n includes railcars and related storage facilities; and\n•\nOther \nincludes machinery, equipment, and various facilities used in our operations; facilities and equipment related to industrial gases and power used in our operations; land and rights-of-way associated with our refineries, plants, and pipelines and other logistics assets, as well as office facilities; and equipment primarily used at our corporate offices, such as printers and copiers.\nIn addition to fixed lease payments, some arrangements contain provisions for variable lease payments. Certain leases for pipelines, terminals, and tanks provide for variable lease payments based on, among other things, throughput volumes in excess of a base amount. Certain marine transportation leases contain provisions for payments that are contingent on usage. Additionally, if the rental increases are not scheduled in the lease, such as an increase based on subsequent changes in the index or rate, those rents are considered variable lease payments. In all instances, variable lease payments are recognized in the period in which the obligation for those payments is incurred.\n86\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nLease Costs and Other Supplemental Information\nOur total lease cost comprises costs that are included in our statements of income, as well as costs capitalized as part of an item of property, plant, and equipment or inventory. \nTotal lease cost was as follows (in millions):\nPipelines,\nTerminals,\nand Tanks\nTransportation\nOther\nTotal\nMarine\nRail\nYear ended December 31, 2024\nFinance lease cost:\nAmortization of ROU assets\n$\n247\n \n$\n—\n \n$\n3\n \n$\n33\n \n$\n283\n \nInterest on lease liabilities\n107\n \n—\n \n—\n \n9\n \n116\n \nOperating lease cost\n167\n \n210\n \n89\n \n42\n \n508\n \nVariable lease cost\n114\n \n36\n \n—\n \n10\n \n160\n \nShort-term lease cost\n27\n \n196\n \n3\n \n134\n \n360\n \nSublease income\n—\n \n(\n33\n)\n—\n \n(\n2\n)\n(\n35\n)\nTotal lease cost\n$\n662\n \n$\n409\n \n$\n95\n \n$\n226\n \n$\n1,392\n \nYear ended December 31, 2023\nFinance lease cost:\nAmortization of ROU assets\n$\n213\n \n$\n—\n \n$\n3\n \n$\n30\n \n$\n246\n \nInterest on lease liabilities\n101\n \n—\n \n1\n \n5\n \n107\n \nOperating lease cost\n166\n \n127\n \n80\n \n45\n \n418\n \nVariable lease cost\n114\n \n61\n \n—\n \n8\n \n183\n \nShort-term lease cost\n18\n \n125\n \n2\n \n112\n \n257\n \nSublease income\n—\n \n(\n29\n)\n—\n \n(\n2\n)\n(\n31\n)\nTotal lease cost\n$\n612\n \n$\n284\n \n$\n86\n \n$\n198\n \n$\n1,180\n \nYear ended December 31, 2022\nFinance lease cost:\nAmortization of ROU assets\n$\n183\n \n$\n—\n \n$\n3\n \n$\n32\n \n$\n218\n \nInterest on lease liabilities\n78\n \n—\n \n1\n \n5\n \n84\n \nOperating lease cost\n171\n \n102\n \n68\n \n38\n \n379\n \nVariable lease cost\n79\n \n50\n \n—\n \n9\n \n138\n \nShort-term lease cost\n15\n \n82\n \n3\n \n57\n \n157\n \nSublease income\n—\n \n(\n27\n)\n—\n \n(\n2\n)\n(\n29\n)\nTotal lease cost\n$\n526\n \n$\n207\n \n$\n75\n \n$\n139\n \n$\n947\n \n87\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table presents additional information related to our operating and finance leases (in millions, except for lease terms and discount rates):\nDecember 31, 2024\nDecember 31, 2023\nOperating\nLeases\nFinance\nLeases\nOperating\nLeases\nFinance\nLeases\nSupplemental balance sheet information\nROU assets, net reflected in the following\nbalance sheet line items:\nProperty, plant, and equipment, net\n$\n—\n$\n2,218\n$\n—\n$\n2,195\nDeferred charges and other assets, net\n1,098\n—\n1,136\n—\nTotal ROU assets, net\n$\n1,098\n$\n2,218\n$\n1,136\n$\n2,195\nCurrent lease liabilities reflected in the\nfollowing balance sheet line items:\nCurrent portion of debt and finance lease\nobligations\n$\n—\n$\n244\n$\n—\n$\n209\nAccrued expenses\n378\n—\n360\n—\nNoncurrent lease liabilities reflected in the\nfollowing balance sheet line items:\nDebt and finance lease obligations,\nless current portion\n—\n2,134\n—\n2,097\nOther long-term liabilities\n699\n—\n753\n—\nTotal lease liabilities\n$\n1,077\n$\n2,378\n$\n1,113\n$\n2,306\nOther supplemental information\nWeighted-average remaining lease term\n6.2\n years\n13.2\n years\n6.9\n years\n14.3\n years\nWeighted-average discount rate\n5.9\n \n%\n4.9\n \n%\n5.7\n \n%\n4.8\n \n%\nSupplemental cash flow information related to our operating and finance leases is presented in Note 18.\n88\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nMaturity Analyses\nAs of December 31, 2024, the remaining minimum lease payments due under our long-term leases were as follows (in millions):\nOperating\nLeases\nFinance\nLeases\n2025\n$\n417\n \n$\n353\n \n2026\n288\n \n325\n \n2027\n155\n \n294\n \n2028\n91\n \n292\n \n2029\n60\n \n263\n \nThereafter\n337\n \n1,836\n \nTotal undiscounted lease payments\n1,348\n \n3,363\n \nLess: Amount associated with discounting\n271\n \n985\n \nTotal lease liabilities\n$\n1,077\n \n$\n2,378\n \n6.    PROPERTY, PLANT, AND EQUIPMENT\nSummary by Major Class\nMajor classes of property, plant, and equipment, including assets held under finance leases, consisted of the following (in millions):\n \nDecember 31,\n2024\n2023\nLand\n$\n500\n \n$\n505\n \nCrude oil processing facilities\n34,089\n \n34,043\n \nTransportation and terminaling facilities\n6,013\n \n5,978\n \nWaste and renewable feedstocks processing facilities\n3,616\n \n3,243\n \nCorn processing facilities\n1,058\n \n1,069\n \nAdministrative buildings\n1,147\n \n1,137\n \nFinance lease ROU assets (see Note 5)\n3,348\n \n3,062\n \nOther\n1,993\n \n1,942\n \nConstruction in progress\n604\n \n689\n \nProperty, plant, and equipment, at cost\n52,368\n \n51,668\n \nAccumulated depreciation\n(\n23,054\n)\n(\n21,459\n)\nProperty, plant, and equipment, net\n$\n29,314\n \n$\n30,209\n \nDepreciation expense for the years ended December 31, 2024, 2023, and 2022 was $\n1.9\n billion, $\n1.9\n billion, and $\n1.7\n billion, respectively.\nAsset Impairment\nOur ethanol plant located in Lakota, Iowa (Lakota ethanol plant) was previously configured to produce a higher-grade ethanol product, as opposed to fuel-grade ethanol, suitable for hand sanitizer blending or industrial purposes that had a higher market value than fuel-grade ethanol. During 2022, demand for \n89\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nhigher-grade ethanol declined and had a negative impact on the profitability of the plant. As a result, we tested the recoverability of the carrying value of the Lakota ethanol plant and concluded that it was impaired. Therefore, we reduced the carrying value of the plant to its estimated fair value and recognized an asset impairment loss of $\n61\n million for the year ended December 31, 2022. See Note 19 for disclosure related to the method used to determine fair value. During the third quarter of 2023, the Lakota ethanol plant resumed production of fuel-grade ethanol.\nSale of Ethanol Plant\nIn June 2022, we sold our ethanol plant in Jefferson, Wisconsin (Jefferson ethanol plant) for $\n32\n million, which resulted in a gain of $\n23\n million that is included in depreciation and amortization expense for the year ended December 31, 2022.\n7.    DEFERRED CHARGES AND OTHER ASSETS\n“Deferred charges and other assets, net” consisted of the following (in millions):\nDecember 31,\n2024\n2023\nDeferred turnaround and catalyst costs, net\n$\n2,689\n \n$\n2,382\n \nOperating lease ROU assets, net (see Note 5)\n1,098\n \n1,136\n \nInvestments in nonconsolidated joint ventures\n695\n \n713\n \nPurchased compliance credits\n488\n \n612\n \nGoodwill\n260\n \n260\n \nIntangible assets, net\n151\n \n183\n \nIncome taxes receivable\n317\n \n56\n \nOther\n1,394\n \n1,284\n \nDeferred charges and other assets, net\n$\n7,092\n \n$\n6,626\n \nAmortization expense for deferred turnaround and catalyst costs and intangible assets was $\n852\n million, $\n821\n million, and $\n745\n million for the years ended December 31, 2024, 2023, and 2022, respectively. \nThe entire balance of goodwill is related to our Refining segment. See Note 17 for information on our reportable segments.\n90\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n8.    ACCRUED EXPENSES AND OTHER LONG-TERM LIABILITIES\nAccrued expenses and other long-term liabilities consisted of the following (in millions):\nAccrued\nExpenses\nOther Long-Term\nLiabilities\nDecember 31,\nDecember 31,\n2024\n2023\n2024\n2023\nOperating lease liabilities (see Note 5)\n$\n378\n \n$\n360\n \n$\n699\n \n$\n753\n \nLiability for unrecognized tax benefits\n— \n— \n429\n \n238\n \nDefined benefit plan liabilities (see Note 13)\n73\n \n55\n \n423\n \n476\n \nRepatriation tax liability (see Note 15) (a)\n— \n— \n—\n \n167\n \nEnvironmental liabilities\n45\n \n23\n \n261\n \n294\n \nWage and other employee-related liabilities\n307\n \n392\n \n102\n \n90\n \nAccrued interest expense\n68\n \n83\n \n— \n— \nContract liabilities from contracts with customers\n(see Note 17)\n82\n \n40\n \n— \n— \nBlending program obligations (see Note 19)\n78\n \n83\n \n— \n— \nOther accrued liabilities\n99\n \n204\n \n226\n \n245\n \nAccrued expenses and other long-term liabilities\n$\n1,130\n \n$\n1,240\n \n$\n2,140\n \n$\n2,263\n \n________________________\n(a)\nThe current portion of repatriation tax liability is included in income taxes payable. As of December 31, 2024 and 2023, the current portion of repatriation tax liability was $\n167\n million and $\n134\n million, respectively.\n \n91\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n9.    DEBT AND FINANCE LEASE OBLIGATIONS\nDebt, at stated values, and finance lease obligations consisted of the following (in millions):\nFinal\nMaturity\nDecember 31,\n2024\n2023\nCredit facilities:\nValero Revolver\n2027\n$\n—\n \n$\n—\n \nAccounts Receivable Sales Facility\n2025\n—\n \n—\n \nDGD Revolver\n2026\n—\n \n250\n \nDGD Loan Agreement\n2026\n—\n \n—\n \nIEnova Revolver\n2028\n58\n \n766\n \nPublic debt:\nValero Senior Notes\n1.200\n%\n2024\n—\n \n167\n \n2.850\n%\n2025\n251\n \n251\n \n3.65\n%\n2025\n189\n \n189\n \n3.400\n%\n2026\n426\n \n426\n \n2.150\n%\n2027\n564\n \n564\n \n4.350\n%\n2028\n591\n \n591\n \n4.000\n%\n2029\n439\n \n439\n \n8.75\n%\n2030\n200\n \n200\n \n2.800\n%\n2031\n462\n \n462\n \n7.5\n%\n2032\n729\n \n729\n \n6.625\n%\n2037\n1,380\n \n1,380\n \n6.75\n%\n2037\n24\n \n24\n \n10.500\n%\n2039\n113\n \n113\n \n4.90\n%\n2045\n621\n \n621\n \n3.650\n%\n2051\n829\n \n829\n \n4.000\n%\n2052\n508\n \n508\n \n7.45\n%\n2097\n70\n \n70\n \nValero Energy Partners LP (VLP) Senior Notes\n4.375\n%\n2026\n146\n \n146\n \n4.500\n%\n2028\n456\n \n456\n \nDebenture, \n7.65\n%\n2026\n100\n \n100\n \nOther debt\n2024\n—\n \n14\n \nNet unamortized debt issuance costs and other\n(\n71\n)\n(\n77\n)\nTotal debt\n8,085\n \n9,218\n \nFinance lease obligations (see Note 5)\n2,378\n \n2,306\n \nTotal debt and finance lease obligations\n10,463\n \n11,524\n \nLess: Current portion\n743\n \n1,406\n \nDebt and finance lease obligations, less current portion\n$\n9,720\n \n$\n10,118\n \n92\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nCredit Facilities\nValero Revolver\nWe have a $\n4\n billion revolving credit facility (the Valero Revolver) that matures in November 2027. We have the option to increase the aggregate commitments under the Valero Revolver to $\n5.5\n billion, subject to certain conditions. The Valero Revolver also provides for the issuance of letters of credit of up to $\n2.4\n billion.\nOutstanding borrowings under the Valero Revolver bear interest, at our option, at either (i) the Adjusted Term SOFR, a secured overnight financing rate (SOFR) or (ii) the Alternate Base Rate (each of these rates is defined in the Valero Revolver), plus the applicable margins. The Valero Revolver also requires payments for customary fees, including facility fees, letter of credit participation fees, and administrative agent fees. The interest rate and facility fees under the Valero Revolver are subject to adjustment based upon the credit ratings assigned to our senior unsecured debt.\nCanadian Revolver\nOne of our Canadian subsidiaries had a C$\n150\n million committed revolving credit facility (the Canadian Revolver) with a maturity date of November 2023. The Canadian Revolver provided for the issuance of letters of credit. Prior to November 30, 2023, all letters of credit under this facility were canceled and the facility was terminated.\nAccounts Receivable Sales Facility\nWe have an accounts receivable sales facility with a group of third-party entities and financial institutions to sell up to $\n1.3\n billion of eligible trade receivables on a revolving basis. In July 2024, we extended the maturity date of this facility to July 2025. Under this program, one of our marketing subsidiaries (Valero Marketing) sells eligible receivables, without recourse, to another of our subsidiaries (Valero Capital), whereupon the receivables are no longer owned by Valero Marketing. Valero Capital, in turn, sells an undivided percentage ownership interest in the eligible receivables, without recourse, to the third-party entities and financial institutions. To the extent that Valero Capital retains an ownership interest in the receivables it has purchased from Valero Marketing, such interest is included in our financial statements solely as a result of the consolidation of the financial statements of Valero Capital with those of Valero Energy Corporation; the receivables are not available to satisfy the claims of the creditors of Valero Marketing or Valero Energy Corporation.\nAs of December 31, 2024 and 2023, $\n2.5\n billion and $\n2.6\n billion, respectively, of our accounts receivable composed the designated pool of accounts receivable included in the program. All amounts outstanding under the accounts receivable sales facility are reflected as debt in our balance sheets and proceeds and repayments are reflected as cash flows from financing activities. Outstanding borrowings under the facility bear interest, at either (i) an adjusted daily simple SOFR or (ii) an alternate base rate as allowed under the terms of this facility, plus applicable margins. The interest rates under the program are subject to adjustment based upon the credit ratings assigned to our senior unsecured debt. The program also requires payments for customary fees, including facility fees.\nDGD Revolver\nDGD, as described in Note 12, has a $\n400\n million unsecured revolving credit facility (the DGD Revolver) with a syndicate of financial institutions that matures in June 2026. DGD has the option to increase the \n93\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\naggregate commitments under the DGD Revolver to $\n550\n million, subject to certain restrictions. The DGD Revolver also provides for the issuance of letters of credit of up to $\n150\n million. The DGD Revolver is only available to fund the operations of DGD, and the creditors of DGD do not have recourse against us.\nOutstanding borrowings under the DGD Revolver generally bear interest, at DGD’s option, at (i) an alternate base rate, (ii) an adjusted term SOFR, or (iii) an adjusted daily simple SOFR as allowed under the terms of the agreement for the applicable interest period in effect from time to time, plus the applicable margins. There were \nno\n outstanding borrowings under the DGD Revolver as of December 31, 2024. As of December 31, 2023, the variable interest rate was \n7.201\n percent. The DGD Revolver also requires payments for customary fees, including unused commitment fees, letter of credit fees, and administrative agent fees.\nDGD Loan Agreement\nDGD has an unsecured revolving loan agreement (the DGD Loan Agreement) with its members (Darling Ingredients Inc. (Darling) and us) with a maturity date of June 2026. Under this agreement, each member has committed $\n100\n million, resulting in aggregate commitments of $\n200\n million. The DGD Loan Agreement is only available to fund the operations of DGD. Any outstanding borrowings under this agreement represent loans made by the noncontrolling member as any transactions between DGD and us under this agreement are eliminated in consolidation.\nOutstanding borrowings under the DGD Loan Agreement bear interest at a term SOFR for the applicable interest period in effect from time to time plus the applicable margin.\nIEnova Revolver\nCentral Mexico Terminals, as described in Note 12, has a combined $\n830\n million unsecured revolving credit facility (IEnova Revolver) with IEnova (defined in Note 12), that matures in February 2028. IEnova may terminate this revolver at any time and demand repayment of all outstanding amounts; therefore, all outstanding borrowings are reflected in current portion of debt. The IEnova Revolver is only available to fund the operations of Central Mexico Terminals, and the creditors of Central Mexico Terminals do not have recourse against us.\nDuring the year ended December 31, 2024, IEnova converted $\n732\n million of outstanding borrowings under the IEnova Revolver to additional equity in Central Mexico Terminals, which resulted in an increase in the noncontrolling interest related to IEnova.\nOutstanding borrowings under the IEnova Revolver bear interest at a SOFR for the applicable interest period in effect from time to time plus the applicable margin. The interest rate under this revolver is subject to adjustment, with agreement by both parties, based upon changes in market conditions. As of December 31, 2024 and 2023, the variable interest rate was \n8.443\n percent and \n9.245\n percent, respectively.\n94\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nSummary of Credit Facilities\nWe had outstanding borrowings, letters of credit issued, and availability under our credit facilities as follows (in millions):\nDecember 31, 2024\nFacility\nAmount\nMaturity Date\nOutstanding\nBorrowings\nLetters of Credit\nIssued (a)\nAvailability\nCommitted facilities:\nValero Revolver\n$\n4,000\n \nNovember 2027\n$\n—\n \n$\n2\n \n$\n3,998\n \nAccounts receivable\nsales facility\n1,300\n \nJuly 2025\n—\n \nn/a\n1,300\n \nCommitted facilities of\nVIEs (b):\nDGD Revolver\n400\n \nJune 2026\n—\n \n14\n \n386\n \nDGD Loan Agreement (c)\n100\n \nJune 2026\n—\n \nn/a\n100\n \nIEnova Revolver\n830\n \nFebruary 2028\n58\n \nn/a\n772\n \nUncommitted facilities:\nLetter of credit facilities\nn/a\nn/a\nn/a\n71\n \nn/a\n________________________\n(a)\nLetters of credit issued as of December 31, 2024 expire at various times in 2025 through 2026.\n(b)\nCreditors of the VIEs do not have recourse against us.\n(c)\nThe amounts shown for this facility represent the facility amount available from, and borrowings outstanding to, the noncontrolling member as any transactions between DGD and us under this facility are eliminated in consolidation.\nWe are charged letter of credit issuance fees under our various uncommitted short-term bank credit facilities. These uncommitted credit facilities have no commitment fees or compensating balance requirements.\nActivity under our credit facilities was as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nBorrowings:\nAccounts receivable sales facility\n$\n6,700\n \n$\n1,750\n \n$\n1,600\n \nDGD Revolver\n310\n \n550\n \n759\n \nDGD Loan Agreement\n100\n \n—\n \n50\n \nIEnova Revolver\n27\n \n120\n \n105\n \nRepayments:\nAccounts receivable sales facility\n(\n6,700\n)\n(\n1,750\n)\n(\n1,600\n)\nDGD Revolver\n(\n560\n)\n(\n400\n)\n(\n759\n)\nDGD Loan Agreement\n(\n100\n)\n(\n25\n)\n(\n50\n)\nIEnova Revolver\n—\n \n(\n71\n)\n(\n67\n)\n95\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nPublic Debt\nIn March 2024, we repaid the $\n167\n million outstanding principal balance of our \n1.200\n percent Senior Notes that matured on March 15, 2024.\nIn February 2023, we used cash on hand to purchase and retire a portion of the following notes (in millions):\nDebt Purchased and Retired\nPrincipal\nAmount\n6.625\n% Senior Notes due 2037\n$\n62\n \n3.650\n% Senior Notes due 2051\n26\n \n4.000\n% Senior Notes due 2052\n45\n \nVarious other Valero and VLP Senior Notes\n66\n \nTotal\n$\n199\n \nDuring the year ended December 31, 2022, the following activity occurred:\n•\nIn November and December 2022, we used cash on hand to purchase and retire a portion of the following notes (in millions):\nDebt Purchased and Retired\nPrincipal\nAmount\n2.150\n% Senior Notes due 2027\n$\n22\n \n4.500\n% VLP Senior Notes due 2028\n26\n \n2.800\n% Senior Notes due 2031\n28\n \n6.625\n% Senior Notes due 2037\n58\n \n4.90\n% Senior Notes due 2045\n24\n \n3.650\n% Senior Notes due 2051\n95\n \n4.000\n% Senior Notes due 2052\n97\n \n7.45\n% Senior Notes due 2097\n30\n \nVarious other Valero Senior Notes\n62\n \nTotal\n$\n442\n \n96\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n•\nIn September 2022, we used cash on hand to purchase and retire a portion of the following notes in connection with cash tender offers that we publicly announced in August 2022 and completed in September 2022 (in millions):\nDebt Purchased and Retired\nPrincipal\nAmount\n3.65\n% Senior Notes due 2025\n$\n48\n \n2.850\n% Senior Notes due 2025\n291\n \n4.375\n% VLP Senior Notes due 2026\n62\n \n3.400\n% Senior Notes due 2026\n166\n \n4.350\n% Senior Notes due 2028\n131\n \n4.000\n% Senior Notes due 2029\n552\n \nTotal\n$\n1,250\n \n•\nIn June 2022, we reduced our debt through the acquisition of the $\n300\n million of \n4.00\n percent Gulf Opportunity Zone Revenue Bonds Series 2010 that are due December 1, 2040, but were subject to mandatory tender on June 1, 2022. We have the option to effectuate a remarketing of these bonds.\n•\nIn February 2022, we issued $\n650\n million of \n4.000\n percent Senior Notes due June 1, 2052. Proceeds from this debt issuance totaled $\n639\n million before deducting the underwriting discount and other debt issuance costs. \nThe proceeds and cash on hand were used to purchase and retire a portion of the following notes in connection with cash tender offers that we publicly announced and completed in February 2022 (in millions):\nDebt Purchased and Retired\nPrincipal\nAmount\n3.65\n% Senior Notes due 2025\n$\n72\n \n2.850\n% Senior Notes due 2025\n507\n \n4.375\n% VLP Senior Notes due 2026\n168\n \n3.400\n% Senior Notes due 2026\n653\n \nTotal\n$\n1,400\n \nOn February 7, 2025, we issued $\n650\n million of \n5.150\n percent Senior Notes due February 15, 2030. Proceeds from this debt issuance totaled $\n649\n million before deducting the underwriting discount and other debt issuance costs.\n97\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nOther Disclosures\n“Interest and debt expense, net of capitalized interest” is comprised as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nInterest and debt expense\n$\n580\n \n$\n611\n \n$\n619\n \nLess: Capitalized interest\n24\n \n19\n \n57\n \nInterest and debt expense, net of\ncapitalized interest\n$\n556\n \n$\n592\n \n$\n562\n \nOur credit facilities and other debt arrangements contain various customary restrictive covenants, including cross-default and cross-acceleration clauses.\nPrincipal maturities for our debt obligations as of December 31, 2024 were as follows (in millions):\n2025 (a)\n$\n499\n \n2026\n672\n \n2027\n564\n \n2028\n1,047\n \n2029\n439\n \nThereafter\n4,935\n \nNet unamortized debt issuance costs and other\n(\n71\n)\nTotal debt\n$\n8,085\n \n________________________\n(a)\nMaturities for 2025 include the IEnova Revolver.\n10.    COMMITMENTS AND CONTINGENCIES\nPurchase Obligations\nWe have various purchase obligations under certain crude oil and other feedstock supply arrangements, industrial gas supply arrangements (such as hydrogen supply arrangements), natural gas supply arrangements, and various throughput, transportation, and terminaling agreements. We enter into these contracts to ensure an adequate supply of feedstock and utilities and adequate storage capacity to operate our refineries, renewable diesel plants, and ethanol plants. Substantially all of our purchase obligations are based on market prices or adjustments based on market indices. Certain of these purchase obligations include fixed or minimum volume requirements, while others are based on our usage requirements. None of these obligations is associated with suppliers’ financing arrangements. These purchase obligations are not reflected as liabilities.\nSelf-Insurance\nWe are self-insured for certain medical and dental, workers’ compensation, automobile liability, general liability, and other third-party liability claims up to applicable retention limits. Liabilities are accrued for self-insured claims, or when estimated losses exceed coverage limits, and when sufficient information is available to reasonably estimate the amount of the loss. These liabilities are included in accrued expenses and other long-term liabilities.\n98\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n11.    EQUITY\nShare Activity\nActivity in the number of shares of common stock and treasury stock was as follows (in millions):\nCommon\nStock\nTreasury\nStock\nBalance as of December 31, 2021\n673\n \n(\n264\n)\nTransactions in connection with\nstock-based compensation plans\n— \n1\n \nPurchases of common stock for treasury\n— \n(\n38\n)\nBalance as of December 31, 2022\n673\n \n(\n301\n)\nTransactions in connection with\nstock-based compensation plans\n— \n1\n \nPurchases of common stock for treasury\n— \n(\n40\n)\nBalance as of December 31, 2023\n673\n \n(\n340\n)\nPurchases of common stock for treasury\n— \n(\n19\n)\nBalance as of December 31, 2024\n673\n \n(\n359\n)\nPreferred Stock\nWe have \n20\n million shares of preferred stock authorized with a par value of $\n0.01\n per share. \nNo\n shares of preferred stock were outstanding as of December 31, 2024 or 2023.\nTreasury Stock\nWe purchase shares of our outstanding common stock as authorized by our board of directors (Board), including under share purchase programs (described in the table below) and with respect to our employee stock-based compensation plans.\nOur Board authorized us to purchase shares of our outstanding common stock under various programs with no expiration dates as follows (in millions):\nProgram Name\nAuthorization\nDate\nTotal Cost\nAuthorized\nCompletion of\nAuthorized Share\nPurchases\nRemaining\nAvailable for\nPurchase as of\nDecember 31,\n2024\nJanuary 2018 Program\nJanuary 23, 2018\n$\n2,500\n \nSecond quarter of 2022\n$\n—\n \nJuly 2022 Program\nJuly 7, 2022\n2,500\n \nFourth quarter of 2022\n—\n \nOctober 2022 Program\nOctober 26, 2022\n2,500\n \nSecond quarter of 2023\n—\n \nFebruary 2023 Program\nFebruary 23, 2023\n2,500\n \nFourth quarter of 2023\n—\n \nSeptember 2023 Program\nSeptember 15, 2023\n2,500\n \nThird quarter of 2024\n—\n \nFebruary 2024 Program\nFebruary 22, 2024\n2,500\n \nn/a\n1,828\n \nSeptember 2024 Program\nSeptember 19, 2024\n2,500\n \nn/a\n2,500\n \n99\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nCommon Stock Dividends\nOn January 16, 2025, our Board declared a quarterly cash dividend of $\n1.13\n per common share payable on March 3, 2025 to holders of record at the close of business on January 30, 2025.\nIncome Tax Effects Related to Components of Other Comprehensive Income (Loss)\nThe tax effects allocated to each component of other comprehensive income (loss) were as follows (in millions):\nBefore-Tax\nAmount\nTax Expense\n(Benefit)\nNet Amount\nYear ended December 31, 2024\nForeign currency translation adjustment\n$\n(\n546\n)\n$\n(\n16\n)\n$\n(\n530\n)\nPension and other postretirement benefits:\nGain (loss) arising during the year related to:\nNet actuarial gain\n224\n \n51\n \n173\n \nMiscellaneous loss\n—\n \n1\n \n(\n1\n)\nAmounts reclassified into income related to:\nNet actuarial gain\n(\n9\n)\n(\n2\n)\n(\n7\n)\nPrior service credit\n(\n10\n)\n(\n3\n)\n(\n7\n)\nSettlement loss\n5\n \n1\n \n4\n \nEffect of exchange rates\n(\n3\n)\n(\n1\n)\n(\n2\n)\nNet\n \ngain\n \non pension and other\npostretirement benefits\n207\n \n47\n \n160\n \nDerivative instruments designated and\nqualifying as cash flow hedges:\nNet gain arising during the year\n30\n \n3\n \n27\n \nNet gain reclassified into income\n(\n117\n)\n(\n13\n)\n(\n104\n)\nNet loss on cash flow hedges\n(\n87\n)\n(\n10\n)\n(\n77\n)\nOther comprehensive loss\n$\n(\n426\n)\n$\n21\n \n$\n(\n447\n)\n100\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nBefore-Tax\nAmount\nTax Expense\n(Benefit)\nNet Amount\nYear ended December 31, 2023\nForeign currency translation adjustment\n$\n433\n \n$\n—\n \n$\n433\n \nPension and other postretirement benefits:\nGain (loss) arising during the year related to:\nNet actuarial gain\n77\n \n18\n \n59\n \nPrior service cost\n(\n19\n)\n(\n4\n)\n(\n15\n)\nMiscellaneous loss\n—\n \n2\n \n(\n2\n)\nAmounts reclassified into income related to:\nNet actuarial gain\n(\n12\n)\n(\n3\n)\n(\n9\n)\nPrior service credit\n(\n22\n)\n(\n5\n)\n(\n17\n)\nSettlement loss\n2\n \n—\n \n2\n \nEffect of exchange rates\n4\n \n1\n \n3\n \nNet gain on pension and other\npostretirement benefits\n30\n \n9\n \n21\n \nDerivative instruments designated and\nqualifying as cash flow hedges:\nNet gain arising during the year\n82\n \n8\n \n74\n \nNet loss reclassified into income\n8\n \n1\n \n7\n \nNet gain on cash flow hedges\n90\n \n9\n \n81\n \nOther comprehensive income\n$\n553\n \n$\n18\n \n$\n535\n \nYear ended December 31, 2022\nForeign currency translation adjustment\n$\n(\n613\n)\n$\n(\n7\n)\n$\n(\n606\n)\nPension and other postretirement benefits:\nNet actuarial gain arising during the year\n244\n \n57\n \n187\n \nAmounts reclassified into income related to:\nNet actuarial loss\n52\n \n12\n \n40\n \nPrior service credit\n(\n22\n)\n(\n5\n)\n(\n17\n)\nSettlement loss\n61\n \n13\n \n48\n \nNet gain on pension and other\npostretirement benefits\n335\n \n77\n \n258\n \nDerivative instruments designated and\nqualifying as cash flow hedges:\nNet loss arising during the year\n(\n292\n)\n(\n32\n)\n(\n260\n)\nNet loss reclassified into income\n286\n \n32\n \n254\n \nNet loss on cash flow hedges\n(\n6\n)\n—\n \n(\n6\n)\nOther comprehensive loss\n$\n(\n284\n)\n$\n70\n \n$\n(\n354\n)\n101\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nAccumulated Other Comprehensive Loss\nChanges in accumulated other comprehensive loss by component, net of tax, were as follows (in millions):\nForeign\nCurrency\nTranslation\nAdjustment\nDefined\nBenefit\nPlans\nItems\nGains \n(Losses) on\nCash Flow\nHedges\nTotal\nBalance as of December 31, 2021\n$\n(\n562\n)\n$\n(\n441\n)\n$\n(\n5\n)\n$\n(\n1,008\n)\nOther comprehensive income (loss)\nbefore reclassifications\n(\n606\n)\n187\n \n(\n114\n)\n(\n533\n)\nAmounts reclassified from\naccumulated other comprehensive \nloss\n—\n \n71\n \n111\n \n182\n \nOther comprehensive income (loss)\n(\n606\n)\n258\n \n(\n3\n)\n(\n351\n)\nBalance as of December 31, 2022\n(\n1,168\n)\n(\n183\n)\n(\n8\n)\n(\n1,359\n)\nOther comprehensive income\nbefore reclassifications\n433\n \n42\n \n32\n \n507\n \nAmounts reclassified from\naccumulated other comprehensive\nloss\n—\n \n(\n24\n)\n3\n \n(\n21\n)\nEffect of exchange rates\n—\n \n3\n \n—\n \n3\n \nOther comprehensive income\n433\n \n21\n \n35\n \n489\n \nBalance as of December 31, 2023\n(\n735\n)\n(\n162\n)\n27\n \n(\n870\n)\nOther comprehensive income (loss)\nbefore reclassifications\n(\n529\n)\n172\n \n12\n \n(\n345\n)\nAmounts reclassified from\naccumulated other comprehensive \nloss\n—\n \n(\n10\n)\n(\n45\n)\n(\n55\n)\nEffect of exchange rates\n—\n \n(\n2\n)\n—\n \n(\n2\n)\nOther comprehensive income (loss)\n(\n529\n)\n160\n \n(\n33\n)\n(\n402\n)\nBalance as of December 31, 2024\n$\n(\n1,264\n)\n$\n(\n2\n)\n$\n(\n6\n)\n$\n(\n1,272\n)\n102\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nGains (losses) reclassified out of accumulated other comprehensive loss and into net income were as follows (in millions):\nDetails about\nAccumulated Other\nComprehensive Loss\nComponents\nAffected Line\nItem in the\nStatements of\nIncome\nYear Ended December 31,\n2024\n2023\n2022\nAmortization of items related to defined\nbenefit pension plans:\nNet actuarial gain (loss)\n$\n9\n \n$\n12\n \n$\n(\n52\n)\n(a) Other income, net\nPrior service credit\n10\n \n22\n \n22\n \n(a) Other income, net\nSettlement loss\n(\n5\n)\n(\n2\n)\n(\n61\n)\n(a) Other income, net\n14\n \n32\n \n(\n91\n)\nTotal before tax\n(\n4\n)\n(\n8\n)\n20\n \nTax benefit (expense)\n$\n10\n \n$\n24\n \n$\n(\n71\n)\nNet of tax\nGains (losses) on cash flow hedges:\nCommodity contracts\n$\n117\n \n$\n(\n8\n)\n$\n(\n286\n)\nRevenues\n117\n \n(\n8\n)\n(\n286\n)\nTotal before tax\n(\n13\n)\n1\n \n32\n \nTax benefit (expense)\n$\n104\n \n$\n(\n7\n)\n$\n(\n254\n)\nNet of tax\nTotal reclassifications for the year\n$\n114\n \n$\n17\n \n$\n(\n325\n)\nNet of tax\n________________________\n(a)\nThese accumulated other comprehensive loss components are included in the computation of net periodic benefit cost, as discussed in Note 13.\n12.    VARIABLE INTEREST ENTITIES\nConsolidated VIEs\nIn the normal course of business, we have financial interests in certain entities that have been determined to be VIEs. We consolidate a VIE when we have a variable interest in an entity for which we are the primary beneficiary such that we have (i) the power to direct the activities of the VIE that most significantly impact the VIE’s economic performance and (ii) the obligation to absorb losses of or the right to receive benefits from the VIE that could potentially be significant to the VIE. In order to make this determination, we evaluated our contractual arrangements with the VIE, including arrangements for the use of assets, purchases of products and services, debt, equity, or management of operating activities.\nThe following discussion summarizes our involvement with the consolidated VIEs:\n•\nDGD is a joint venture with a subsidiary of Darling that owns and operates \ntwo\n plants that process waste and renewable feedstocks (predominantly animal fats, used cooking oils, vegetable oils, and inedible DCOs) into renewable diesel, renewable naphtha, and neat sustainable aviation \n103\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nfuel (SAF)\n5\n. One plant is located next to our St. Charles Refinery (the DGD St. Charles Plant) and the other plant is located next to our Port Arthur Refinery (the DGD Port Arthur Plant). Our significant agreements with DGD include an operations agreement that outlines our responsibilities as operator of both plants.\nAs operator, we operate the plants and perform certain day-to-day operating and management functions for DGD as an independent contractor. The operations agreement provides us (as operator) with certain power to direct the activities that most significantly impact DGD’s economic performance. Because this agreement conveys such power to us and is separate from our ownership rights, we determined that DGD was a VIE. For this reason and because we hold a \n50\n percent ownership interest that provides us with significant economic rights and obligations, we determined that we are the primary beneficiary of DGD.\n DGD has risk associated with its operations because it generates revenues from external customers.\n•\nCentral Mexico Terminals is a collective group of \nthree\n subsidiaries of Infraestructura Energetica Nova, S.A.P.I. de C.V. (IEnova), a Mexican company and indirect subsidiary of Sempra Energy, a U.S. public company. We have terminaling agreements with Central Mexico Terminals that represent variable interests because we have determined them to be finance leases due to our exclusive use of the terminals. Although we do not have an ownership interest in the entities that own each of the \nthree\n terminals, the finance leases convey to us (i) the power to direct the activities that most significantly impact the economic performance of all \nthree\n terminals and (ii) the ability to influence the benefits received or the losses incurred by the terminals because of our use of the terminals. As a result, we determined each of the entities was a VIE and that we are the primary beneficiary of each. Substantially all of Central Mexico Terminals’ revenues will be derived from us; therefore, we believe there is limited risk to us associated with revenues from external customers.\n•\nWe also have financial interests in other entities that have been determined to be VIEs because the entities’ contractual arrangements transfer the power to us to direct the activities that most significantly impact their economic performance or reduce the exposure to operational variability and risk of loss created by the entity that otherwise would be held exclusively by the equity owners. Furthermore, we determined that we are the primary beneficiary of these VIEs because (i) certain contractual arrangements (exclusive of our ownership rights) provide us with the power to direct the activities that most significantly impact the economic performance of these entities and/or (ii) our \n50\n percent ownership interests provide us with significant economic rights and obligations.\nThe assets of the consolidated VIEs can only be used to settle their own obligations and the creditors of the consolidated VIEs have no recourse to our other assets. We generally do not provide financial guarantees to the VIEs. Although we have provided credit facilities to some of the VIEs in support of their construction or acquisition activities and working capital requirements, these transactions are \n5\n \nDGD produces synthetic paraffinic kerosene (SPK), a renewable blending component, using the Hydrotreated Esters and Fatty Acids (HEFA) process. SPK is also commonly referred to as “neat SAF.” Current aviation regulations allow SPK to be blended up to 50 percent with conventional jet fuel for use in an aircraft. This blend is commonly referred to as “blended SAF” or “SAF.”\n104\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\neliminated in consolidation. Our financial position, results of operations, and cash flows are impacted by the performance of the consolidated VIEs, net of intercompany eliminations, to the extent of our ownership interest in each VIE.\nThe following table presents summarized balance sheet information for the significant assets and liabilities of the consolidated VIEs, which are included in our balance sheets (in millions):\nDGD\nCentral\nMexico\nTerminals\nOther\nTotal\nDecember 31, 2024\nAssets\nCash and cash equivalents\n$\n353\n \n$\n—\n \n$\n21\n \n$\n374\n \nOther current assets\n976\n \n9\n \n42\n \n1,027\n \nProperty, plant, and equipment, net\n3,806\n \n647\n \n64\n \n4,517\n \nLiabilities\nCurrent liabilities, including current portion \nof debt and finance lease obligations\n$\n304\n \n$\n75\n \n$\n4\n \n$\n383\n \nDebt and finance lease obligations,\nless current portion\n642\n \n—\n \n—\n \n642\n \nDecember 31, 2023\nAssets\nCash and cash equivalents\n$\n237\n \n$\n—\n \n$\n23\n \n$\n260\n \nOther current assets\n1,520\n \n11\n \n46\n \n1,577\n \nProperty, plant, and equipment, net\n3,772\n \n665\n \n75\n \n4,512\n \nLiabilities\nCurrent liabilities, including current portion\nof debt and finance lease obligations\n$\n616\n \n$\n808\n \n$\n19\n \n$\n1,443\n \nDebt and finance lease obligations,\nless current portion\n669\n \n—\n \n—\n \n669\n \nNonconsolidated VIEs\nWe hold variable interests in VIEs that have not been consolidated because we are not considered the primary beneficiary. These nonconsolidated VIEs are not material to our financial position or results of operations and are accounted for as equity investments.\n105\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n13.    EMPLOYEE BENEFIT PLANS\nDefined Benefit Plans\nWe have defined benefit pension plans, some of which are subject to collective bargaining agreements, that cover most of our employees. These plans provide eligible employees with retirement income based primarily on years of service and compensation during specific periods under final average pay and cash balance formulas. We fund all of our pension plans as required by local regulations. In the U.S., all qualified pension plans are subject to the Employee Retirement Income Security Act’s minimum funding standard. We typically do not fund or fully fund U.S. nonqualified and certain foreign pension plans that are not subject to funding requirements because contributions to these pension plans may be less economic and investment returns may be less attractive than our other investment alternatives.\nWe also provide health care and life insurance benefits for certain retired employees through our postretirement benefit plans. Most of our employees become eligible for these benefits if, while still working for us, they reach normal retirement age or take early retirement. These plans are unfunded, and retired employees share the cost with us. Individuals who became our employees as a result of an acquisition became eligible for postretirement benefits under our plans as determined by the terms of the relevant acquisition agreement.\n106\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe changes in benefit obligation related to all of our defined benefit plans, the changes in fair value of plan assets\n(a)\n, and the funded status of our defined benefit plans as of and for the years ended below were as follows (in millions):\nPension Plans\nOther Postretirement\nBenefit Plans\nDecember 31,\nDecember 31,\n2024\n2023\n2024\n2023\nChanges in benefit obligation\nBenefit obligation as of beginning of year\n$\n2,618\n \n$\n2,413\n \n$\n266\n \n$\n258\n \nService cost\n112\n \n111\n \n4\n \n4\n \nInterest cost\n125\n \n121\n \n13\n \n13\n \nParticipant contributions\n—\n \n—\n \n24\n \n22\n \nPlan amendments\n—\n \n19\n \n—\n \n—\n \nBenefits paid\n(\n186\n)\n(\n166\n)\n(\n41\n)\n(\n42\n)\nActuarial (gain) loss\n(\n99\n)\n110\n \n(\n29\n)\n10\n \nForeign currency exchange rate changes\n(\n4\n)\n10\n \n(\n2\n)\n1\n \nBenefit obligation as of end of year\n$\n2,566\n \n$\n2,618\n \n$\n235\n \n$\n266\n \nChanges in plan assets (a)\nFair value of plan assets as of beginning of year\n$\n2,835\n \n$\n2,485\n \n$\n—\n \n$\n—\n \nActual return on plan assets\n310\n \n399\n \n—\n \n—\n \nCompany contributions\n76\n \n101\n \n17\n \n20\n \nParticipant contributions\n—\n \n—\n \n24\n \n22\n \nBenefits paid\n(\n186\n)\n(\n166\n)\n(\n41\n)\n(\n42\n)\nForeign currency exchange rate changes\n(\n6\n)\n16\n \n—\n \n—\n \nFair value of plan assets as of end of year\n$\n3,029\n \n$\n2,835\n \n$\n—\n \n$\n—\n \nReconciliation of funded status (a)\nFair value of plan assets as of end of year\n$\n3,029\n \n$\n2,835\n \n$\n—\n \n$\n—\n \nLess: Benefit obligation as of end of year\n2,566\n \n2,618\n \n235\n \n266\n \nFunded status as of end of year\n$\n463\n \n$\n217\n \n$\n(\n235\n)\n$\n(\n266\n)\nAccumulated benefit obligation\n$\n2,423\n \n$\n2,450\n \nn/a\nn/a\n________________________\n(a)\nPlan assets include only the assets associated with pension plans subject to legal minimum funding standards. Plan assets associated with U.S. nonqualified pension plans are not included here because they are not protected from our creditors and therefore cannot be reflected as a reduction from our obligations under the pension plans. As a result, the reconciliation of funded status does not reflect the effect of plan assets that exist for all of our defined benefit plans. See Note 19 for the assets associated with certain U.S. nonqualified pension plans.\n107\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe actuarial\n \ngain for the year ended December 31, 2024 primarily resulted from an\n \nincrease in the discount rates used to determine our benefit obligations for our pension plans from \n5.01\n percent in 2023 to \n5.72\n percent in 2024. The actuarial loss for the year ended December 31, 2023 primarily resulted from a decrease in the discount rates used to determine our benefit obligations for our pension plans from \n5.19\n percent in 2022 to \n5.01\n percent in 2023.\nThe fair value of our plan assets as of December 31, 2024 and 2023 were favorably impacted by the return on plan assets resulting primarily from an improvement in equity market prices during each year.\nAmounts recognized in our balance sheets for our pension and other postretirement benefit plans include (in millions):\nPension Plans\nOther Postretirement\nBenefit Plans\nDecember 31,\nDecember 31,\n2024\n2023\n2024\n2023\nDeferred charges and other assets, net\n$\n724\n \n$\n482\n \n$\n—\n \n$\n—\n \nAccrued expenses\n(\n51\n)\n(\n32\n)\n(\n22\n)\n(\n23\n)\nOther long-term liabilities\n(\n210\n)\n(\n233\n)\n(\n213\n)\n(\n243\n)\n$\n463\n \n$\n217\n \n$\n(\n235\n)\n$\n(\n266\n)\nThe following table presents information for our pension plans with projected benefit obligations in excess of plan assets (in millions):\nDecember 31,\n2024\n2023\nProjected benefit obligation\n$\n260\n \n$\n265\n \nFair value of plan assets\n—\n \n—\n \nThe following table presents information for our pension plans with accumulated benefit obligations in excess of plan assets (in millions):\nDecember 31,\n2024\n2023\nAccumulated benefit obligation\n$\n220\n \n$\n220\n \nFair value of plan assets\n—\n \n—\n \n108\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nBenefit payments that we expect to pay, including amounts related to expected future services that we expect to receive, are as follows for the years ending December 31 (in millions):\nPension\nBenefits\nOther\nPostretirement\nBenefits\n2025\n$\n224\n \n$\n22\n \n2026\n228\n \n21\n \n2027\n222\n \n20\n \n2028\n199\n \n20\n \n2029\n189\n \n19\n \n2030-2034\n1,112\n \n92\n \nDuring 2025, we plan to contribute approximately $\n130\n million to our pension plans and $\n20\n million to our other postretirement benefit plans, respectively.\nThe components of net periodic benefit cost related to our defined benefit plans were as follows (in millions):\nPension Plans\nOther Postretirement \nBenefit Plans\nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\n2022\n2024\n2023\n2022\nService cost\n$\n112\n \n$\n111\n \n$\n152\n \n$\n4\n \n$\n4\n \n$\n6\n \nInterest cost\n125\n \n121\n \n85\n \n13\n \n13\n \n8\n \nExpected return on plan assets\n(\n214\n)\n(\n202\n)\n(\n192\n)\n—\n \n—\n \n—\n \nAmortization of:\nNet actuarial (gain) loss\n(\n5\n)\n(\n6\n)\n52\n \n(\n4\n)\n(\n6\n)\n—\n \nPrior service credit\n(\n10\n)\n(\n18\n)\n(\n18\n)\n—\n \n(\n4\n)\n(\n4\n)\nSettlement loss\n5\n \n2\n \n61\n \n—\n \n—\n \n—\n \nNet periodic benefit cost\n$\n13\n \n$\n8\n \n$\n140\n \n$\n13\n \n$\n7\n \n$\n10\n \nThe components of net periodic benefit cost other than the service cost component (i.e., the non-service cost components) are included in “other income, net.”\nAmortization of the net actuarial (gain) loss shown in the preceding table was based on the straight-line amortization of the excess of the unrecognized (gain) loss over \n10\n percent of the greater of the projected benefit obligation or market-related value of plan assets (smoothed asset value) over the average remaining service period of active employees expected to receive benefits under each respective plan. Amortization of prior service credit shown in the preceding table was based on a straight-line amortization of the credit over the average remaining service period of employees expected to receive benefits under each respective plan.\n109\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nPre-tax amounts recognized in other comprehensive income (loss) were as follows (in millions):\nPension Plans\nOther Postretirement\nBenefit Plans\nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\n2022\n2024\n2023\n2022\nNet gain (loss) arising during\nthe year:\nNet actuarial gain (loss)\n$\n195\n \n$\n87\n \n$\n158\n \n$\n29\n \n$\n(\n10\n)\n$\n86\n \nPrior service cost\n—\n \n(\n19\n)\n—\n \n—\n \n—\n \n—\n \nNet (gain) loss reclassified into\nincome:\nNet actuarial (gain) loss\n(\n5\n)\n(\n6\n)\n53\n \n(\n4\n)\n(\n6\n)\n(\n1\n)\nPrior service credit\n(\n10\n)\n(\n18\n)\n(\n18\n)\n—\n \n(\n4\n)\n(\n4\n)\nSettlement loss\n5\n \n2\n \n61\n \n—\n \n—\n \n—\n \nEffect of exchange rates\n(\n2\n)\n4\n \n—\n \n(\n1\n)\n—\n \n—\n \nTotal changes in other\ncomprehensive income (loss)\n$\n183\n \n$\n50\n \n$\n254\n \n$\n24\n \n$\n(\n20\n)\n$\n81\n \nThe pre-tax amounts in accumulated other comprehensive loss that have not yet been recognized as components of net periodic benefit cost were as follows (in millions):\nPension Plans\nOther Postretirement\nBenefit Plans\nDecember 31,\nDecember 31,\n2024\n2023\n2024\n2023\nNet actuarial (gain) loss\n$\n62\n \n$\n256\n \n$\n(\n96\n)\n$\n(\n73\n)\nPrior service cost\n22\n \n11\n \n1\n \n2\n \nTotal\n$\n84\n \n$\n267\n \n$\n(\n95\n)\n$\n(\n71\n)\nThe weighted-average assumptions used to determine the benefit obligations were as follows:\nPension Plans\nOther Postretirement\nBenefit Plans \nDecember 31,\nDecember 31,\n2024\n2023\n2024\n2023\nDiscount rate\n5.72\n \n%\n5.01\n \n%\n5.64\n \n%\n5.01\n \n%\nRate of compensation increase\n4.04\n \n%\n3.83\n \n%\nn/a\nn/a\nInterest crediting rate for\ncash balance plans\n4.25\n \n%\n3.59\n \n%\nn/a\nn/a\nThe discount rate assumption used to determine the benefit obligations as of December 31, 2024 and 2023 for the majority of our pension plans and other postretirement benefit plans was based on the Aon AA Only Above Median yield curve and considered the timing of the projected cash outflows under our plans. This curve was designed by Aon, our actuarial consultant, to provide a means for plan sponsors to \n110\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nvalue the liabilities of their pension plans or postretirement benefit plans. To develop this curve, a hypothetical double-A yield curve represented by a series of annualized individual discount rates with maturities from \nsix months\n to \n99\n years is constructed. Each bond issue underlying the double-A yield curve is required to have an average rating of double-A when averaging all available ratings by Moody’s Investors Service, Standard & Poor’s Ratings Services, and Fitch Ratings. Only the bonds representing the 50 percent highest yielding issuances of this double-A yield curve are then included in the Aon AA Only Above Median yield curve.\nWe based our discount rate assumption on the Aon AA Only Above Median yield curve because we believe it is representative of the types of bonds we would use to settle our pension and other postretirement benefit plan liabilities as of those dates. We believe that the yields associated with the bonds used to develop this yield curve reflect the current level of interest rates.\nThe weighted-average assumptions used to determine the net periodic benefit cost were as follows:\nPension Plans\nOther Postretirement\nBenefit Plans\nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\n2022\n2024\n2023\n2022\nDiscount rate\n5.01\n \n%\n5.19\n \n%\n2.94\n \n%\n5.01\n \n%\n5.20\n \n%\n2.96\n \n%\nExpected long-term rate of return\non plan assets\n7.29\n \n%\n7.31\n \n%\n6.71\n \n%\nn/a\nn/a\nn/a\nRate of compensation increase\n3.84\n \n%\n3.76\n \n%\n3.70\n \n%\nn/a\nn/a\nn/a\nInterest crediting rate for\ncash balance plans\n3.59\n \n%\n3.76\n \n%\n3.03\n \n%\nn/a\nn/a\nn/a\nThe assumed health care cost trend rates were as follows:\nDecember 31,\n2024\n2023\nHealth care cost trend rate assumed for the next year\n8.13\n \n%\n6.68\n \n%\nRate to which the cost trend rate was assumed to decline\n(the ultimate trend rate)\n4.97\n \n%\n4.97\n \n%\nYear that the rate reaches the ultimate trend rate\n2036\n2032\n111\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table presents the fair values of the assets of our pension plans (in millions) as of December 31, 2024 and 2023 by level of the fair value hierarchy. Assets categorized in Level 1 of the hierarchy are measured at fair value using a market approach based on unadjusted quoted prices from national securities exchanges. Assets categorized in Level 2 of the hierarchy are measured at net asset value in a market that is not active or using inputs other than quoted prices that are observable. No assets were categorized in Level 3 of the hierarchy as of December 31, 2024 and 2023. As previously noted, we do not fund or fully fund U.S. nonqualified and certain foreign pension plans that are not subject to funding requirements, and we do not fund our other postretirement benefit plans.\n2024\n2023\nLevel 1\nLevel 2\nTotal\nLevel 1\nLevel 2\nTotal\nEquity securities (a)\n$\n542\n \n$\n—\n \n$\n542\n \n$\n585\n \n$\n—\n \n$\n585\n \nMutual funds\n233\n \n—\n \n233\n \n223\n \n—\n \n223\n \nCorporate debt instruments\n—\n \n261\n \n261\n \n—\n \n251\n \n251\n \nGovernment securities\n81\n \n169\n \n250\n \n86\n \n186\n \n272\n \nCommon collective trusts (b)\n—\n \n1,337\n \n1,337\n \n—\n \n1,078\n \n1,078\n \nPooled separate accounts (c)\n—\n \n325\n \n325\n \n—\n \n323\n \n323\n \nPrivate fund\n—\n \n—\n \n—\n \n—\n \n46\n \n46\n \nInsurance contract\n—\n \n13\n \n13\n \n—\n \n13\n \n13\n \nInterest and dividends receivable\n6\n \n—\n \n6\n \n6\n \n—\n \n6\n \nCash and cash equivalents\n64\n \n—\n \n64\n \n48\n \n—\n \n48\n \nSecurities transactions payable, net\n(\n2\n)\n—\n \n(\n2\n)\n(\n10\n)\n—\n \n(\n10\n)\nTotal pension plan assets\n$\n924\n \n$\n2,105\n \n$\n3,029\n \n$\n938\n \n$\n1,897\n \n$\n2,835\n \n________________________\n(a)\nThis class of securities includes domestic and international securities, which are held in a wide range of industry sectors.\n(b)\nThis class primarily includes investments in approximately \n70\n percent equities and \n30\n percent bonds as of December 31, 2024. As of December 31, 2023, this class primarily included investments in approximately \n80\n percent equities and \n20\n percent bonds.\n(c)\nThis class primarily includes investments in approximately \n45\n percent equities and \n55\n percent bonds as of December 31, 2024 and 2023.\nThe investment policies and strategies for the assets of our pension plans incorporate a well-diversified approach that is expected to earn long-term returns from capital appreciation and a growing stream of current income. This approach recognizes that assets are exposed to risk and the market value of the pension plans’ assets may fluctuate from year to year. Risk tolerance is determined based on our financial ability to withstand risk within the investment program and the willingness to accept return volatility. In line with the investment return objective and risk parameters, the pension plans’ mix of assets includes a diversified portfolio of equity and fixed-income investments. Equity securities include international securities and a blend of U.S. growth and value stocks of various sizes of capitalization. Fixed income securities include bonds and notes issued by the U.S. government and its agencies, corporate bonds, and mortgage-backed securities. The aggregate asset allocation is reviewed on an annual basis. As of December 31, 2024, the target allocations for plan assets under our primary pension plan are \n65\n percent equity securities and \n35\n percent fixed income investments.\n112\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe expected long-term rate of return on plan assets is based on a forward-looking expected asset return model. This model derives an expected rate of return based on the target asset allocation of a plan’s assets. The underlying assumptions regarding expected rates of return for each asset class reflect Aon’s best expectations for these asset classes. The model reflects the positive effect of periodic rebalancing among diversified asset classes. We select an expected asset return that is supported by this model.\nDefined Contribution Plans\nWe have defined contribution plans that cover most of our employees. Our contributions to these plans are based on employees’ compensation and/or a partial match of employee contributions to the plans. Our contributions to these defined contribution plans were $\n92\n million, $\n87\n million, and $\n83\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n14.    STOCK-BASED COMPENSATION\nOverview\nUnder our 2020 Omnibus Stock Incentive Plan (the 2020 OSIP), various stock and stock-based awards may be granted to employees, non-employee directors, and third-party service providers. The 2020 OSIP permits grants of (i) restricted stock and restricted stock units; (ii) stock options (including incentive and non-qualified stock options); (iii) stock appreciation rights; (iv) performance awards of cash, stock, or other securities; and (v) other stock-based awards (e.g., stock unit awards). Awards under the 2020 OSIP are granted at the discretion of our Board’s Human Resources and Compensation Committee (and, as applicable, approved by the independent directors) and may be subject to vesting or performance periods, performance goals, or other restrictions. The 2020 OSIP was approved by our stockholders on April 30, 2020, and as of such date, any shares of common stock that were not subject to outstanding awards and were available to be awarded under the 2011 Omnibus Stock Incentive Plan (the 2011 OSIP) became available for issuance under the 2020 OSIP and any shares of common stock subject to awards under the 2011 OSIP outstanding as of April 30, 2020, that are subsequently forfeited, terminated, canceled or rescinded, settled in cash in lieu of common stock, exchanged for awards not involving common stock, or expired unexercised also become available for issuance under the 2020 OSIP. No future awards will be made under the 2011 OSIP. As of December 31, 2024, \n11,283,380\n shares of our common stock remained available to be awarded under the 2020 OSIP and there were no awards issued under the 2011 OSIP that remained outstanding.\nThe following table reflects activity related to our stock-based compensation arrangements (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nStock-based compensation expense:\nRestricted stock\n$\n67\n \n$\n69\n \n$\n71\n \nPerformance awards\n33\n \n38\n \n32\n \nTotal stock-based compensation expense\n$\n100\n \n$\n107\n \n$\n103\n \nTax benefit recognized on stock-based compensation expense\n$\n13\n \n$\n14\n \n$\n15\n \nTax benefit realized for tax deductions resulting from\nexercises and vestings\n—\n \n2\n \n2\n \n113\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nRestricted Stock\nRestricted stock is our most significant stock-based compensation arrangement. Employees, non-employee directors, and third-party service providers are eligible to receive restricted stock, which vests in accordance with individual written agreements between the participants and us, usually in equal annual installments over a period of \nthree years\n beginning one year after the date of grant. The fair value of each share of restricted stock is equal to the market price of our common stock. \nA summary of the status of our restricted stock awards is presented in the following table:\nNumber of\nShares\nWeighted-\nAverage\nGrant-Date\nFair Value\nPer Share\nNonvested shares as of January 1, 2024\n902,846\n \n$\n112.01\n \nGranted\n495,444\n \n131.68\n \nVested\n(\n594,001\n)\n108.87\n \nForfeited\n(\n9,069\n)\n111.21\n \nNonvested shares as of December 31, 2024\n795,220\n \n126.63\n \nAs of December 31, 2024, there was $\n52\n million of unrecognized compensation cost related to outstanding unvested restricted stock awards, which is expected to be recognized over a weighted-average period of approximately \ntwo years\n.\nThe following table reflects activity related to our restricted stock:\nYear Ended December 31,\n2024\n2023\n2022\nWeighted-average grant-date fair value per share of\nrestricted stock granted\n$\n131.68\n \n$\n125.57\n \n$\n112.88\n \nFair value of restricted stock vested (in millions)\n82\n \n99\n \n99\n \n15.    INCOME TAXES\nIncome Statement Components\nIncome before income tax expense was as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nU.S. operations\n$\n2,685\n \n$\n9,335\n \n$\n11,716\n \nForeign operations\n1,013\n \n2,433\n \n3,591\n \nIncome before income tax expense\n$\n3,698\n \n$\n11,768\n \n$\n15,307\n \n114\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nStatutory income tax rates applicable to the countries in which we operate were as follows:\nYear Ended December 31,\n2024\n2023\n2022\nU.S.\n21 \n%\n21 \n%\n21 \n%\nCanada\n15 \n%\n15 \n%\n15 \n%\nU.K. (a)\n25 \n%\n25 \n%\n19 \n%\nIreland\n13 \n%\n13 \n%\n13 \n%\nPeru\n30 \n%\n30 \n%\n30 \n%\nMexico\n30 \n%\n30 \n%\n30 \n%\n________________________\n(a)\nStatutory income tax rate was increased to 25 percent effective April 1, 2023.\nThe following is a reconciliation of income tax expense computed by applying statutory income tax rates to actual income tax expense (dollars in millions):\nU.S.\nForeign\nTotal\nAmount\nPercent\nAmount\nPercent\nAmount\nPercent\nYear ended December 31, 2024\nIncome tax expense at statutory rates\n$\n564\n \n21.0\n \n%\n$\n142\n \n14.0\n \n%\n$\n706\n \n19.1\n \n%\nU.S. state and Canadian provincial\ntax expense, net of federal\nincome tax effect\n19\n \n0.7\n \n%\n101\n \n10.0\n \n%\n120\n \n3.2\n \n%\nPermanent differences\n(\n83\n)\n(\n3.1\n)\n%\n2\n \n0.2\n \n%\n(\n81\n)\n(\n2.2\n)\n%\nGILTI tax\n79\n \n2.9\n \n%\n—\n \n—\n \n%\n79\n \n2.1\n \n%\nForeign tax credits\n(\n59\n)\n(\n2.2\n)\n%\n—\n \n—\n \n%\n(\n59\n)\n(\n1.5\n)\n%\nBiofuels tax credits (a)\n(\n101\n)\n(\n3.7\n)\n%\n—\n \n—\n \n%\n(\n101\n)\n(\n2.7\n)\n%\nRepatriation withholding tax\n57\n \n2.1\n \n%\n—\n \n—\n \n%\n57\n \n1.5\n \n%\nTax effects of income associated\nwith noncontrolling interests\n(\n50\n)\n(\n1.8\n)\n%\n(\n6\n)\n(\n0.6\n)\n%\n(\n56\n)\n(\n1.5\n)\n%\nValuation allowance\n—\n \n—\n \n%\n57\n \n5.6\n \n%\n57\n \n1.5\n \n%\nOther, net\n(\n37\n)\n(\n1.4\n)\n%\n7\n \n0.7\n \n%\n(\n30\n)\n(\n0.8\n)\n%\nIncome tax expense\n$\n389\n \n14.5\n \n%\n$\n303\n \n29.9\n \n%\n$\n692\n \n18.7\n \n%\n________________________\n(a)\nAs permitted under Section 40(b) of the Internal Revenue Code of 1986, as amended (the Code), producers of second-generation biofuels that are registered with the Internal Revenue Service (IRS) are eligible for an income tax credit of up to $1.01 per gallon of qualified biofuel that was produced and sold in the U.S. through December 31, 2024. We recorded a gross tax benefit in December 2024 related to these tax credits for the cellulosic ethanol produced by our Ethanol segment from 2020 through 2024.\n115\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nU.S.\nForeign\nTotal\nAmount\nPercent\nAmount\nPercent\nAmount\nPercent\nYear ended December 31, 2023\nIncome tax expense at statutory rates\n$\n1,960\n \n21.0\n \n%\n$\n449\n \n18.5\n \n%\n$\n2,409\n \n20.5\n \n%\nU.S. state and Canadian provincial\ntax expense, net of federal\nincome tax effect\n114\n \n1.2\n \n%\n161\n \n6.6\n \n%\n275\n \n2.3\n \n%\nPermanent differences\n(\n87\n)\n(\n0.9\n)\n%\n(\n18\n)\n(\n0.7\n)\n%\n(\n105\n)\n(\n0.9\n)\n%\nGILTI tax\n167\n \n1.8\n \n%\n—\n \n—\n \n167\n \n1.4\n \n%\nForeign tax credits\n(\n149\n)\n(\n1.6\n)\n%\n—\n \n—\n \n(\n149\n)\n(\n1.3\n)\n%\nRepatriation withholding tax\n45\n \n0.5\n \n%\n—\n \n—\n \n45\n \n0.4\n \n%\nTax effects of income associated\nwith noncontrolling interests\n(\n84\n)\n(\n0.9\n)\n%\n30\n \n1.2\n \n%\n(\n54\n)\n(\n0.4\n)\n%\nOther, net\n8\n \n—\n \n%\n23\n \n0.9\n \n%\n31\n \n0.3\n \n%\nIncome tax expense\n$\n1,974\n \n21.1\n \n%\n$\n645\n \n26.5\n \n%\n$\n2,619\n \n22.3\n \n%\nYear ended December 31, 2022\nIncome tax expense at statutory rates\n$\n2,460\n \n21.0\n \n%\n$\n611\n \n17.0\n \n%\n$\n3,071\n \n20.1\n \n%\nU.S. state and Canadian provincial\ntax expense, net of federal\nincome tax effect\n182\n \n1.6\n \n%\n255\n \n7.1\n \n%\n437\n \n2.8\n \n%\nPermanent differences\n(\n61\n)\n(\n0.5\n)\n%\n(\n16\n)\n(\n0.5\n)\n%\n(\n77\n)\n(\n0.5\n)\n%\nGILTI tax\n413\n \n3.5\n \n%\n—\n \n—\n \n413\n \n2.7\n \n%\nForeign tax credits\n(\n396\n)\n(\n3.4\n)\n%\n—\n \n—\n \n(\n396\n)\n(\n2.6\n)\n%\nRepatriation withholding tax\n51\n \n0.4\n \n%\n—\n \n—\n \n51\n \n0.3\n \n%\nTax effects of income associated\nwith noncontrolling interests\n(\n78\n)\n(\n0.7\n)\n%\n25\n \n0.7\n \n%\n(\n53\n)\n(\n0.3\n)\n%\nOther, net\n(\n27\n)\n(\n0.2\n)\n%\n9\n \n0.3\n \n%\n(\n18\n)\n(\n0.1\n)\n%\nIncome tax expense\n$\n2,544\n \n21.7\n \n%\n$\n884\n \n24.6\n \n%\n$\n3,428\n \n22.4\n \n%\n116\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nComponents of income tax expense were as follows (in millions):\nU.S.\nForeign\nTotal\nYear ended December 31, 2024\nCurrent:\nCountry\n$\n464\n \n$\n180\n \n$\n644\n \nU.S. state / Canadian provincial\n37\n \n98\n \n135\n \nTotal current\n501\n \n278\n \n779\n \nDeferred:\nCountry\n(\n99\n)\n23\n \n(\n76\n)\nU.S. state / Canadian provincial\n(\n13\n)\n2\n \n(\n11\n)\nTotal deferred\n(\n112\n)\n25\n \n(\n87\n)\nIncome tax expense\n$\n389\n \n$\n303\n \n$\n692\n \nYear ended December 31, 2023\nCurrent:\nCountry\n$\n1,804\n \n$\n415\n \n$\n2,219\n \nU.S. state / Canadian provincial\n157\n \n140\n \n297\n \nTotal current\n1,961\n \n555\n \n2,516\n \nDeferred:\nCountry\n25\n \n69\n \n94\n \nU.S. state / Canadian provincial\n(\n12\n)\n21\n \n9\n \nTotal deferred\n13\n \n90\n \n103\n \nIncome tax expense\n$\n1,974\n \n$\n645\n \n$\n2,619\n \nYear ended December 31, 2022\nCurrent:\nCountry\n$\n2,147\n \n$\n766\n \n$\n2,913\n \nU.S. state / Canadian provincial\n153\n \n312\n \n465\n \nTotal current\n2,300\n \n1,078\n \n3,378\n \nDeferred:\nCountry\n164\n \n(\n138\n)\n26\n \nU.S. state / Canadian provincial\n80\n \n(\n56\n)\n24\n \nTotal deferred\n244\n \n(\n194\n)\n50\n \nIncome tax expense\n$\n2,544\n \n$\n884\n \n$\n3,428\n \n117\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nIncome Taxes Paid\nIncome taxes paid to U.S. and foreign taxing authorities were as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nU.S.\n$\n701\n \n$\n2,158\n \n$\n2,396\n \nForeign\n142\n \n1,336\n \n892\n \nIncome taxes paid, net\n$\n843\n \n$\n3,494\n \n$\n3,288\n \nDeferred Income Tax Assets and Liabilities\nThe tax effects of significant temporary differences representing deferred income tax assets and liabilities were as follows (in millions):\nDecember 31,\n2024\n2023\nDeferred income tax assets:\nTax credit carryforwards\n$\n858\n \n$\n809\n \nNet operating losses (NOLs)\n689\n \n710\n \nInventories\n197\n \n237\n \nFinance lease obligations\n317\n \n314\n \nOperating lease liabilities\n502\n \n519\n \nOther\n195\n \n221\n \nTotal deferred income tax assets\n2,758\n \n2,810\n \nValuation allowance\n(\n1,484\n)\n(\n1,383\n)\nNet deferred income tax assets\n1,274\n \n1,427\n \nDeferred income tax liabilities:\nProperty, plant, and equipment\n4,875\n \n5,121\n \nDeferred turnaround costs\n450\n \n399\n \nOperating lease ROU assets\n467\n \n546\n \nInvestments\n417\n \n423\n \nOther\n332\n \n287\n \nTotal deferred income tax liabilities\n6,541\n \n6,776\n \nNet deferred income tax liabilities\n$\n5,267\n \n$\n5,349\n \nWe had the following income tax credit and loss carryforwards as of December 31, 2024 (in millions):\nAmount\nExpiration\nU.S. state income tax credits (gross amount)\n$\n79\n \n2025 through 2039\nU.S. state income tax credits (gross amount)\n2\n \nUnlimited\nU.S. foreign tax credits\n794\n \n2027 through 2034\nU.S. state income tax NOLs (gross amount)\n12,071\n \n2025 through 2040\nForeign NOLs (gross amount)\n82\n \n2029 through 2034\nForeign NOLs (gross amount)\n174\n \nUnlimited\n118\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nWe have recorded a valuation allowance as of December 31, 2024\n \nand 2023\n \ndue to uncertainties related to our ability to utilize some of our deferred income tax assets associated with our U.S. foreign tax credits, certain U.S. state income tax credits, certain foreign deferred tax assets, and certain NOLs before they expire. The valuation allowance is based on our estimates of future taxable income in the various jurisdictions in which we operate and the period over which deferred income tax assets will be recoverable. The valuation allowance increased by $\n101\n million in 2024 due to the generation of foreign tax credits, foreign NOLs, and other foreign deferred tax assets that cannot be realized.\nUnrecognized Tax Benefits\nChanges in Unrecognized Tax Benefits\nThe following is a reconciliation of the changes in unrecognized tax benefits, excluding related interest and penalties (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nBalance as of beginning of year\n$\n186\n \n$\n284\n \n$\n816\n \nAdditions for tax positions related to the current year\n52\n \n18\n \n27\n \nAdditions for tax positions related to prior years\n106\n \n4\n \n19\n \nReductions for tax positions related to prior years\n(\n19\n)\n(\n73\n)\n(\n573\n)\nReductions for tax positions related to the lapse of\napplicable statute of limitations\n(\n7\n)\n(\n9\n)\n(\n5\n)\nSettlements\n(\n2\n)\n(\n38\n)\n—\n \nBalance as of end of year\n$\n316\n \n$\n186\n \n$\n284\n \nAs of December 31, 2024 and 2023, there was $\n236\n million and $\n126\n million, respectively, of unrecognized tax benefits that if recognized would reduce our annual effective tax rate.\nInterest and penalties incurred during the years ended December 31, 2024, 2023, and 2022 were not material. Accrued interest and penalties as of December 31, 2024 and 2023 were not material.\nAlthough reasonably possible, we do not anticipate that any of our tax audits will be resolved during the next 12 months that would result in a reduction in our liability for unrecognized tax benefits either due to our tax positions being sustained or due to our agreement to their disallowance. Should any reductions occur, we do not expect that they would have a material impact on our financial statements because such reductions would not materially affect our annual effective tax rate.\nTax Returns Under Audit\nU.S. Federal\nIn 2023, we settled the audits related to our U.S. federal income tax returns for 2012 through 2015, with the exception of one issue regarding the timing of deductibility of certain costs at our refineries. During 2024, we filed formal claims for refund with the IRS for this disagreed-upon issue. The settlement related to these audits resulted in a favorable reduction in our unrecognized tax benefits.\n119\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nAs of December 31, 2024,\n \nour U.S. federal income tax returns for 2017 through 2020 were under audit by the IRS. We continue to work with the IRS to resolve these audits and we believe that they will be resolved for amounts consistent with our recorded amounts of unrecognized tax benefits associated with these audits.\nU.S. State\nAs of December 31, 2024, our California tax returns for 2011 through 2016 were under audit by the state of California. During 2024, we settled the audits related to our California income tax returns for 2017 through 2019 for amounts consistent with our recorded amounts for unrecognized tax benefits. We do not expect the ultimate disposition of the remaining audits will result in a material change to our financial position, results of operations, or liquidity. We believe these audits will be resolved for amounts consistent with our recorded amounts for unrecognized tax benefits associated with these audits.\nForeign\nAs of December 31, 2024, certain of our Canadian subsidiaries’ federal tax returns for 2013 through 2015 and 2017 through 2022 were under audit by the Canada Revenue Agency and our Quebec provincial tax returns for 2013 through 2015 and 2017 through 2018 were under audit by Revenue Quebec. As of December 31, 2024, the 2020 tax return for one of our Mexican subsidiaries was under audit by Servicio de Administración Tributaria, and we are protesting proposed adjustments for this tax return. We do not expect the ultimate disposition of these audits or inquiries will result in a material change to our financial position, results of operations, or liquidity.\nOther Disclosures\nUndistributed Earnings of Foreign Subsidiaries\nAs of December 31, 2024, the cumulative undistributed earnings of our foreign subsidiaries that is considered permanently reinvested in the relevant foreign countries were $\n6.0\n billion. This amount excludes $\n1.2\n billion of earnings that are no longer considered permanently reinvested. We are able to distribute cash via a dividend from our foreign subsidiaries with a full dividend received deduction in the U.S. However, there is a cost to repatriate the undistributed earnings of certain of our foreign subsidiaries to us, including, but not limited to, withholding taxes imposed by certain foreign jurisdictions, U.S. state income taxes, and U.S. federal income tax on foreign exchange gains. We have accrued $\n59\n million of withholding and other taxes on the $\n1.2\n billion of earnings previously noted, but it is not practicable to estimate the amount of additional tax that would be payable on the undistributed earnings that are considered permanently reinvested.\nRepatriation Tax Liability\nOur repatriation tax liability relates to our recognition of a one-time transition tax on the deemed repatriation of previously undistributed accumulated earnings and profits of our foreign subsidiaries and was previously included in other long-term liabilities. This transition tax, which is reflected in income taxes payable as of December 31, 2024 (see Note 8), will be remitted to the IRS over the eight-year period provided in the Code, with the final installment due in 2025.\n120\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n16.    EARNINGS PER COMMON SHARE\nEarnings per common share was computed as follows (dollars and shares in millions, except per share amounts):\nYear Ended December 31,\n2024\n2023\n2022\nEarnings per common share:\nNet income attributable to Valero stockholders\n$\n2,770\n \n$\n8,835\n \n$\n11,528\n \nLess: Income allocated to participating securities\n8\n \n27\n \n43\n \nNet income available to common stockholders\n$\n2,762\n \n$\n8,808\n \n$\n11,485\n \nWeighted-average common shares outstanding\n322\n \n353\n \n395\n \nEarnings per common share\n$\n8.58\n \n$\n24.93\n \n$\n29.05\n \nEarnings per common share – assuming dilution:\nNet income attributable to Valero stockholders\n$\n2,770\n \n$\n8,835\n \n$\n11,528\n \nLess: Income allocated to participating securities\n8\n \n27\n \n43\n \nNet income available to common stockholders\n$\n2,762\n \n$\n8,808\n \n$\n11,485\n \nWeighted-average common shares outstanding\n322\n \n353\n \n395\n \nEffect of dilutive securities\n—\n \n—\n \n1\n \nWeighted-average common shares outstanding – \nassuming dilution\n322\n \n353\n \n396\n \nEarnings per common share – assuming dilution\n$\n8.58\n \n$\n24.92\n \n$\n29.04\n \nParticipating securities include restricted stock and performance awards granted under our 2020 OSIP or our 2011 OSIP. Dilutive securities include participating securities as well as outstanding stock options. For the years ended December 31, 2024, 2023, and 2022, we computed earnings per common share – assuming dilution using the two-class method for all dilutive securities.\n121\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n17.    REVENUES AND SEGMENT INFORMATION\nRevenue from Contracts with Customers\nDisaggregation of Revenue\nRevenue is presented in the table below under “\nSegment Information\n” disaggregated by product because this is the level of disaggregation that management has determined to be beneficial to users of our financial statements.\nContract Balances\nContract balances were as follows (in millions):\nDecember 31,\n2024\n2023\nReceivables from contracts with customers,\nincluded in receivables, net (see Note 3)\n$\n5,812\n \n$\n7,209\n \nContract liabilities, included in accrued expenses (see Note 8)\n82\n \n40\n \nDuring the years ended December 31, 2024, 2023, and 2022, we recognized as revenue $\n39\n million, $\n127\n million, and $\n76\n million, respectively, that was included in contract liabilities as of December 31, 2023, 2022, and 2021, respectively.\nRemaining Performance Obligations\nWe have spot and term contracts with customers, the majority of which are spot contracts with no remaining performance obligations. We do not disclose remaining performance obligations for contracts that have terms of one year or less. The transaction price for our remaining term contracts includes a fixed component and variable consideration (i.e., a commodity price), both of which are allocated entirely to a wholly unsatisfied promise to transfer a distinct good that forms part of a single performance obligation. The fixed component is not material and the variable consideration is highly uncertain. Therefore, as of December 31, 2024, we have not disclosed the aggregate amount of the transaction price allocated to our remaining performance obligations.\nSegment Information\nWe have \nthree\n reportable segments—Refining, Renewable Diesel, and Ethanol. Each segment is a strategic business unit that offers different products and services by employing unique technologies and marketing strategies and whose operations and operating performance are managed and evaluated separately. Operating performance is measured based on the operating income generated by the segment, which includes revenues and expenses that are directly attributable to the management of the respective segment. Intersegment sales are generally derived from transactions made at prevailing market rates. The following is a description of each segment’s business operations.\n•\nThe \nRefining segment\n includes the operations of our petroleum refineries, the associated activities to market our refined petroleum products, and the logistics assets that support our refining operations. The principal products manufactured by our refineries and sold by this segment include gasolines and blendstocks, distillates, and other products.\n122\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n•\nThe \nRenewable Diesel segment\n represents the operations of DGD, a consolidated joint venture as discussed in Note 12, and the associated activities to market renewable diesel, renewable naphtha, and neat SAF. The principal products manufactured by DGD and sold by this segment are renewable diesel, renewable naphtha, and neat SAF. This segment sells some renewable diesel and neat SAF to the Refining segment for blending into petroleum-based diesel and conventional jet fuel, respectively, which is then sold to that segment’s customers as finished product. For the year ended December 31, 2024, all neat SAF sales were to the Refining segment.\n•\nThe \nEthanol segment \nincludes the operations of our ethanol plants and the associated activities to market our ethanol and co-products. The principal products manufactured by our ethanol plants are ethanol and distillers grains. This segment sells some ethanol to the Refining segment for blending into gasoline, which is sold to that segment’s customers as a finished gasoline product.\nOperations that are not included in any of the reportable segments are included in the corporate category.\nOur chief operating decision maker (CODM) is our Chairman of the Board, Chief Executive Officer and President. Our CODM uses operating income by segment to allocate resources (including employees, property, and financial or capital resources) for each segment primarily during the annual budget process. On a monthly basis, our CODM considers budget-to-actual variances for operating income by segment when evaluating the operating performance of each segment.\n123\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following tables reflect information about our operating income, including a reconciliation to our consolidated income before income tax expense\n \nand total expenditures for long-lived assets, by reportable segment (in millions):\nRefining\nRenewable\nDiesel\nEthanol\nCorporate\nand\nEliminations\nTotal\nYear ended December 31, 2024\nRevenues:\nRevenues from external customers\n$\n123,853\n \n$\n2,410\n \n$\n3,618\n \n$\n—\n \n$\n129,881\n \nIntersegment revenues\n10\n \n2,656\n \n868\n \n(\n3,534\n)\n— \nTotal revenues\n123,863\n \n5,066\n \n4,486\n \n(\n3,534\n)\n129,881\n \nCost of sales:\nCost of materials and other (a)\n112,538\n \n3,944\n \n3,558\n \n(\n3,524\n)\n116,516\n \nOperating expenses (excluding depreciation \nand amortization expense reflected below)\n4,946\n \n350\n \n536\n \n(\n1\n)\n5,831\n \nDepreciation and amortization expense \n2,391\n \n265\n \n77\n \n(\n4\n)\n2,729\n \nTotal cost of sales\n119,875\n \n4,559\n \n4,171\n \n(\n3,529\n)\n125,076\n \nOther operating expenses\n17\n \n—\n \n27\n \n—\n \n44\n \nGeneral and administrative expenses (excluding\ndepreciation and amortization expense \nreflected below)\n—\n \n—\n \n—\n \n961\n \n961\n \nDepreciation and amortization expense\n—\n \n—\n \n—\n \n45\n \n45\n \nOperating income by segment\n$\n3,971\n \n$\n507\n \n$\n288\n \n$\n(\n1,011\n)\n3,755\n \nOther income, net\n499\n \nInterest and debt expense, net of capitalized\ninterest\n(\n556\n)\nIncome before income tax expense\n$\n3,698\n \nTotal expenditures for long-lived assets (b)\n$\n1,635\n \n$\n321\n \n$\n34\n \n$\n67\n \n$\n2,057\n \n________________________\nSee notes on page \n126\n.\n124\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nRefining\nRenewable\nDiesel\nEthanol\nCorporate\nand\nEliminations\nTotal\nYear ended December 31, 2023\nRevenues:\nRevenues from external customers\n$\n136,470\n \n$\n3,823\n \n$\n4,473\n \n$\n—\n \n$\n144,766\n \nIntersegment revenues\n18\n \n3,168\n \n1,086\n \n(\n4,272\n)\n— \nTotal revenues\n136,488\n \n6,991\n \n5,559\n \n(\n4,272\n)\n144,766\n \nCost of sales:\nCost of materials and other (a)\n117,401\n \n5,550\n \n4,395\n \n(\n4,259\n)\n123,087\n \nOperating expenses (excluding depreciation \nand amortization expense reflected below)\n5,208\n \n358\n \n515\n \n8\n \n6,089\n \nDepreciation and amortization expense\n2,351\n \n231\n \n80\n \n(\n4\n)\n2,658\n \nTotal cost of sales\n124,960\n \n6,139\n \n4,990\n \n(\n4,255\n)\n131,834\n \nOther operating expenses\n17\n \n—\n \n16\n \n—\n \n33\n \nGeneral and administrative expenses (excluding\ndepreciation and amortization expense \nreflected below)\n—\n \n—\n \n—\n \n998\n \n998\n \nDepreciation and amortization expense\n—\n \n—\n \n—\n \n43\n \n43\n \nOperating income by segment\n$\n11,511\n \n$\n852\n \n$\n553\n \n$\n(\n1,058\n)\n11,858\n \nOther income, net\n502\n \nInterest and debt expense, net of capitalized\ninterest\n(\n592\n)\nIncome before income tax expense\n$\n11,768\n \nTotal expenditures for long-lived assets (b)\n$\n1,488\n \n$\n294\n \n$\n43\n \n$\n91\n \n$\n1,916\n \n________________________\nSee notes on page \n126\n.\n125\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nRefining\nRenewable\nDiesel\nEthanol\nCorporate\nand\nEliminations\nTotal\nYear ended December 31, 2022\nRevenues:\nRevenues from external customers\n$\n168,154\n \n$\n3,483\n \n$\n4,746\n \n$\n—\n \n$\n176,383\n \nIntersegment revenues\n56\n \n2,018\n \n740\n \n(\n2,814\n)\n— \nTotal revenues\n168,210\n \n5,501\n \n5,486\n \n(\n2,814\n)\n176,383\n \nCost of sales:\nCost of materials and other (a)\n144,588\n \n4,350\n \n4,628\n \n(\n2,796\n)\n150,770\n \nOperating expenses (excluding depreciation\nand amortization expense reflected below)\n5,509\n \n255\n \n625\n \n—\n \n6,389\n \nDepreciation and amortization expense\n2,247\n \n122\n \n59\n \n—\n \n2,428\n \nTotal cost of sales\n152,344\n \n4,727\n \n5,312\n \n(\n2,796\n)\n159,587\n \nAsset impairment loss\n—\n \n—\n \n61\n \n—\n \n61\n \nOther operating expenses\n63\n \n—\n \n3\n \n—\n \n66\n \nGeneral and administrative expenses (excluding\ndepreciation and amortization expense \nreflected below)\n—\n \n—\n \n—\n \n934\n \n934\n \nDepreciation and amortization expense\n—\n \n—\n \n—\n \n45\n \n45\n \nOperating income by segment\n$\n15,803\n \n$\n774\n \n$\n110\n \n$\n(\n997\n)\n15,690\n \nOther income, net\n179\n \nInterest and debt expense, net of capitalized\ninterest\n(\n562\n)\nIncome before income tax expense\n$\n15,307\n \nTotal expenditures for long-lived assets (b)\n$\n1,763\n \n$\n879\n \n$\n22\n \n$\n73\n \n$\n2,737\n \n________________________\n(a)\nCost of materials and other for our Renewable Diesel segment is net of the blender’s tax credit on qualified fuel mixtures of $\n1.3\n billion, $\n1.2\n billion, and $\n761\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n(b)\nTotal expenditures for long-lived assets includes amounts related to capital expenditures; deferred turnaround and catalyst costs; and property, plant, and equipment for acquisitions.\n126\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table provides a disaggregation of revenues from external customers for our principal products by reportable segment (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nRefining:\nGasolines and blendstocks\n$\n56,014\n \n$\n61,538\n \n$\n70,496\n \nDistillates\n55,636\n \n63,664\n \n82,521\n \nOther product revenues\n12,203\n \n11,268\n \n15,137\n \nTotal Refining revenues\n123,853\n \n136,470\n \n168,154\n \nRenewable Diesel:\nRenewable diesel\n2,316\n \n3,665\n \n3,333\n \nRenewable naphtha\n94\n \n158\n \n150\n \nTotal Renewable Diesel revenues\n2,410\n \n3,823\n \n3,483\n \nEthanol:\nEthanol\n2,647\n \n3,300\n \n3,653\n \nDistillers grains\n971\n \n1,173\n \n1,093\n \nTotal Ethanol revenues\n3,618\n \n4,473\n \n4,746\n \nRevenues\n$\n129,881\n \n$\n144,766\n \n$\n176,383\n \nRevenues by geographic area are shown in the following table (in millions). The geographic area is based on location of customer and no customer accounted for 10 percent or more of our revenues.\nYear Ended December 31,\n2024\n2023\n2022\nU.S.\n$\n93,311\n \n$\n104,208\n \n$\n126,722\n \nCanada\n8,577\n \n10,107\n \n11,743\n \nU.K. and Ireland\n15,236\n \n16,148\n \n17,822\n \nMexico and Peru\n5,405\n \n6,438\n \n8,396\n \nOther countries\n7,352\n \n7,865\n \n11,700\n \nRevenues\n$\n129,881\n \n$\n144,766\n \n$\n176,383\n \nLong-lived assets include “property, plant, and equipment, net” and certain long-lived assets included in “deferred charges and other assets, net.” \nLong-lived assets by geographic area consisted of the following (in millions):\nDecember 31,\n2024\n2023\nU.S.\n$\n28,359\n \n$\n28,868\n \nCanada\n1,414\n \n1,598\n \nU.K. and Ireland\n1,484\n \n1,346\n \nMexico and Peru\n798\n \n837\n \nTotal long-lived assets\n$\n32,055\n \n$\n32,649\n \n127\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nTotal assets by reportable segment were as follows (in millions):\nDecember 31,\n2024\n2023\nRefining\n$\n46,729\n \n$\n49,031\n \nRenewable Diesel\n5,680\n \n5,790\n \nEthanol\n1,545\n \n1,549\n \nCorporate and eliminations\n6,189\n \n6,686\n \nTotal assets\n$\n60,143\n \n$\n63,056\n \nAs of December 31, 2024 and 2023, our investments in nonconsolidated joint ventures accounted for under the equity method were $\n695\n million and $\n713\n million, respectively, all of which related to the Refining segment and are reflected in “deferred charges and other assets, net” as presented in Note 7.\n18.    SUPPLEMENTAL CASH FLOW INFORMATION\nIn order to determine net cash provided by operating activities, net income is adjusted by, among other things, changes in current assets and current liabilities as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nDecrease (increase) in current assets:\nReceivables, net\n$\n1,562\n \n$\n(\n387\n)\n$\n(\n1,619\n)\nInventories\n(\n286\n)\n(\n684\n)\n(\n672\n)\nPrepaid expenses and other\n320\n \n(\n34\n)\n(\n180\n)\nIncrease (decrease) in current liabilities:\nAccounts payable\n(\n430\n)\n(\n169\n)\n521\n \nAccrued expenses\n(\n168\n)\n(\n50\n)\n(\n5\n)\nTaxes other than income taxes payable\n(\n57\n)\n(\n226\n)\n98\n \nIncome taxes payable\n(\n146\n)\n(\n776\n)\n231\n \nChanges in current assets and current liabilities\n$\n795\n \n$\n(\n2,326\n)\n$\n(\n1,626\n)\nChanges in current assets and current liabilities for the year ended December 31, 2024 were primarily due to the following:\n•\nThe decrease in receivables was due to a decrease in refined petroleum product prices combined with a decrease in related sales volumes in December 2024 compared to December 2023;\n•\nThe increase in inventories was primarily due to an increase in inventory volumes in December 2024 compared to December 2023; and\n•\nThe decrease in accounts payable was due to a decrease in crude oil and other feedstock prices in December 2024 compared to December 2023, partially offset by an increase in related volumes purchased.\n128\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nChanges in current assets and current liabilities for the year ended December 31, 2023 were primarily due to the following:\n•\nThe increase in receivables was primarily due to an increase in refined petroleum product sales volumes in December 2023 compared to December 2022, partially offset by a decrease in related prices;\n•\nThe increase in inventories was primarily due to an increase in inventory volumes in December 2023 compared to December 2022;\n•\nThe decrease in accounts payable was due to a decrease in crude oil and other feedstock prices in December 2023 compared to December 2022, partially offset by an increase in related volumes purchased; and\n•\nThe decrease in income taxes payable was primarily due to income tax payments made during the year ended December 31, 2023.\nChanges in current assets and current liabilities for the year ended December 31, 2022 were primarily due to the following:\n•\nThe increase in receivables was primarily due to an increase in refined petroleum product prices in December 2022 compared to December 2021;\n•\nThe increase in inventories was primarily due to an increase in inventory volumes associated with the DGD Port Arthur Plant, which commenced operations in the fourth quarter of 2022; and\n•\nThe increase in accounts payable was primarily due to an increase in feedstock volumes purchased for the start-up of the DGD Port Arthur Plant in December 2022 compared to December 2021.\nCash flows related to interest and income taxes were as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nInterest paid in excess of amount capitalized,\nincluding interest on finance leases\n$\n556\n \n$\n562\n \n$\n570\n \nIncome taxes paid, net (see Note 15)\n843\n \n3,494\n \n3,288\n \n129\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nSupplemental cash flow information related to our operating and finance leases was as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nOperating\nLeases\nFinance\nLeases\nOperating\nLeases\nFinance\nLeases\nOperating\nLeases\nFinance\nLeases\nCash paid for amounts included \nin the measurement of \nlease liabilities:\nOperating cash flows\n$\n527\n \n$\n116\n \n$\n428\n \n$\n107\n \n$\n395\n \n$\n83\n \nInvesting cash flows\n1\n \n— \n—\n \n— \n—\n \n— \nFinancing cash flows\n— \n245\n \n— \n250\n \n— \n180\n \nChanges in lease balances \nresulting from new and \nmodified leases (a)\n448\n \n318\n \n396\n \n157\n \n178\n \n660\n \n________________________\n(a)\nNoncash activity for the year ended December 31, 2022 primarily included approximately $\n500\n million for a finance lease ROU asset and related liability recognized in connection with the completion of the DGD Port Arthur Plant. DGD entered into the finance lease agreement with a third party to utilize certain rail facilities, truck rack facilities, and tanks for the transportation and storage of feedstocks and renewable diesel. The agreement commenced in the fourth quarter of 2022, upon completion of the DGD Port Arthur Plant, and has an initial term of \n20\n years with \ntwo\n automatic \nfive-year\n renewal periods.\nNoncash financing activities for the year ended December 31, 2024 included the conversion by IEnova of $\n732\n million of outstanding borrowings under the IEnova Revolver to additional equity in Central Mexico Terminals, as described in Note 9. There were no other significant noncash investing and financing activities during the year ended December 31, 2024, except as noted in the table above. \nThere were no significant noncash investing and financing activities during the years ended December 31, 2023 and 2022, except as noted in the table above.\n130\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n19.    FAIR VALUE MEASUREMENTS\nGeneral\nGAAP requires or permits certain assets and liabilities to be measured at fair value on a recurring or nonrecurring basis in our balance sheets, and those assets and liabilities are presented below under “\nRecurring Fair Value Measurements\n”\n \nand “\nNonrecurring Fair Value Measurements\n.”\n \nAssets and liabilities measured at fair value on a recurring basis, such as derivative financial instruments, are measured at fair value at the end of each reporting period. Assets and liabilities measured at fair value on a nonrecurring basis, such as the impairment of property, plant and equipment, are measured at fair value in particular circumstances.\nGAAP also requires the disclosure of the fair values of financial instruments when an option to elect fair value accounting has been provided, but such election has not been made. A debt obligation is an example of such a financial instrument. The disclosure of the fair values of financial instruments not recognized at fair value in our balance sheets is presented below under “\nFinancial Instruments\n.”\nGAAP provides a framework for measuring fair value and establishes a three-level fair value hierarchy that prioritizes inputs to valuation techniques based on the degree to which objective prices in external active markets are available to measure fair value. The following is a description of each of the levels of the fair value hierarchy.\n•\nLevel 1 \n–\n \nObservable inputs, such as unadjusted quoted prices in active markets for identical assets or liabilities.\n•\nLevel 2 \n–\n \nInputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly. These include quoted prices for similar assets or liabilities in active markets and quoted prices for identical or similar assets or liabilities in markets that are not active.\n•\nLevel 3 \n–\n \nUnobservable inputs for the asset or liability. Unobservable inputs reflect our own assumptions about what market participants would use to price the asset or liability. The inputs are developed based on the best information available in the circumstances, which might include occasional market quotes or sales of similar instruments or our own financial data such as internally developed pricing models, discounted cash flow methodologies, as well as instruments for which the fair value determination requires significant judgment.\n131\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nRecurring Fair Value Measurements\nThe following tables present information (in millions) about our assets and liabilities recognized at their fair values in our balance sheets categorized according to the fair value hierarchy of the inputs utilized by us to determine the fair values as of December 31, 2024 and 2023.\nWe have elected to offset the fair value amounts recognized for multiple similar derivative contracts executed with the same counterparty, including any related cash collateral assets or obligations as shown below; however, fair value amounts by hierarchy level are presented in the following tables on a gross basis. We have no derivative contracts that are subject to master netting arrangements that are reflected gross in our balance sheets.\nDecember 31, 2024\nTotal \nGross\nFair\nValue\nEffect of \nCounter-\nparty \nNetting\nEffect of \nCash \nCollateral \nNetting\nNet \nCarrying \nValue on \nBalance \nSheet\nCash \nCollateral \nPaid or \nReceived \nNot Offset\nFair Value Hierarchy\nLevel 1\nLevel 2\nLevel 3\nAssets\nCommodity derivative\ncontracts\n$\n402\n \n$\n—\n \n$\n—\n \n$\n402\n \n$\n(\n402\n)\n$\n—\n \n$\n—\n \n$\n—\n \nPhysical purchase\ncontracts\n—\n \n2\n \n—\n \n2\n \nn/a\nn/a\n2\n \nn/a\nInvestments of certain\nbenefit plans\n89\n \n—\n \n4\n \n93\n \nn/a\nn/a\n93\n \nn/a\nInvestments in AFS\ndebt securities\n6\n \n20\n \n—\n \n26\n \nn/a\nn/a\n26\n \nn/a\nForeign currency\ncontracts\n6\n \n—\n \n—\n \n6\n \nn/a\nn/a\n6\n \nn/a\nTotal\n$\n503\n \n$\n22\n \n$\n4\n \n$\n529\n \n$\n(\n402\n)\n$\n—\n \n$\n127\n \nLiabilities\nCommodity derivative \ncontracts\n$\n448\n \n$\n—\n \n$\n—\n \n$\n448\n \n$\n(\n402\n)\n$\n(\n46\n)\n$\n—\n \n$\n(\n71\n)\nBlending program\nobligations\n—\n \n13\n \n—\n \n13\n \nn/a\nn/a\n13\n \nn/a\nPhysical purchase \ncontracts\n—\n \n3\n \n—\n \n3\n \nn/a\nn/a\n3\n \nn/a\nTotal\n$\n448\n \n$\n16\n \n$\n—\n \n$\n464\n \n$\n(\n402\n)\n$\n(\n46\n)\n$\n16\n \n132\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nDecember 31, 2023\nTotal \nGross \nFair \nValue\nEffect of \nCounter-\nparty \nNetting\nEffect of \nCash \nCollateral \nNetting\nNet \nCarrying \nValue on \nBalance \nSheet\nCash \nCollateral \nPaid or \nReceived \nNot Offset\nFair Value Hierarchy\nLevel 1\nLevel 2\nLevel 3\nAssets\nCommodity derivative \ncontracts\n$\n803\n \n$\n—\n \n$\n—\n \n$\n803\n \n$\n(\n642\n)\n$\n(\n66\n)\n$\n95\n \n$\n—\n \nInvestments of certain \nbenefit plans\n76\n \n—\n \n4\n \n80\n \nn/a\nn/a\n80\n \nn/a\nInvestments in AFS\ndebt securities\n36\n \n75\n \n—\n \n111\n \nn/a\nn/a\n111\n \nn/a\nTotal\n$\n915\n \n$\n75\n \n$\n4\n \n$\n994\n \n$\n(\n642\n)\n$\n(\n66\n)\n$\n286\n \nLiabilities\nCommodity derivative \ncontracts\n$\n643\n \n$\n—\n \n$\n—\n \n$\n643\n \n$\n(\n642\n)\n$\n(\n1\n)\n$\n—\n \n$\n(\n67\n)\nBlending program\nobligations\n—\n \n58\n \n—\n \n58\n \nn/a\nn/a\n58\n \nn/a\nPhysical purchase \ncontracts\n—\n \n6\n \n—\n \n6\n \nn/a\nn/a\n6\n \nn/a\nForeign currency\ncontracts\n7\n \n—\n \n—\n \n7\n \nn/a\nn/a\n7\n \nn/a\nTotal\n$\n650\n \n$\n64\n \n$\n—\n \n$\n714\n \n$\n(\n642\n)\n$\n(\n1\n)\n$\n71\n \nA description of our assets and liabilities recognized at fair value along with the valuation methods and inputs we used to develop their fair value measurements are as follows:\n•\nCommodity derivative contracts consist primarily of exchange-traded futures, which are used to reduce the impact of price volatility on our results of operations and cash flows as discussed in Note 20. These contracts are measured at fair value using a market approach based on quoted prices from the commodity exchange and are categorized in Level 1 of the fair value hierarchy.\n•\nPhysical purchase contracts represent the fair value of fixed-price corn purchase contracts. The fair values of these purchase contracts are measured using a market approach based on quoted prices from the commodity exchange or an independent pricing service and are categorized in Level 2 of the fair value hierarchy.\n•\nInvestments of certain benefit plans consist of investment securities held by trusts for the purpose of satisfying a portion of our obligations under certain U.S. nonqualified benefit plans. The plan assets categorized in Level 1 of the fair value hierarchy are measured at fair value using a market approach based on quoted prices from national securities exchanges. The plan assets categorized in Level 3 of the fair value hierarchy represent insurance contracts, the fair value of which is provided by the insurer.\n133\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n•\nInvestments in AFS debt securities consist primarily of commercial paper and U.S. government treasury bills and have maturities within one year. The securities categorized in Level 1 are measured at fair value using a market approach based on quoted prices from national securities exchanges, and the securities categorized in Level 2 are measured at fair value using a market approach based on quoted prices from independent pricing services. The amortized cost basis of the securities approximates fair value. Realized and unrealized gains and losses were de minimis for the years ended December 31, 2024 and 2023.\n•\nBlending program obligations represent our liability for the purchase of compliance credits needed to satisfy our blending obligations under the Renewable and Low-Carbon Fuel Programs. The blending program obligations are categorized in Level 2 of the fair value hierarchy and are measured at fair value using a market approach based on quoted prices from an independent pricing service.\n•\nForeign currency contracts consist of foreign currency exchange and purchase contracts and foreign currency swap agreements related to our foreign operations to manage our exposure to exchange rate fluctuations on transactions denominated in currencies other than the local (functional) currencies of our operations. These contracts are valued based on quoted foreign currency exchange rates and are categorized in Level 1 of the fair value hierarchy.\nNonrecurring Fair Value Measurements\nAs discussed in Note 6, we concluded that our Lakota ethanol plant was impaired as of December 31, 2022, which resulted in an asset impairment loss of $\n61\n million. The fair value of the Lakota ethanol plant was determined using a combination of the income and market approaches and was classified in Level 3. We employed a probability-weighted approach to possible future cash flow scenarios, including the use of\n \npeer company metrics and comparison to a recent sales transaction.\nThere were \nno\n assets or liabilities that were measured at fair value on a nonrecurring basis as of December 31, 2024 and 2023.\nFinancial Instruments\nOur financial instruments include cash and cash equivalents, restricted cash, investments in AFS debt securities, receivables, payables, debt obligations, operating and finance lease obligations, commodity derivative contracts, and foreign currency contracts. \nThe estimated fair values of cash and cash equivalents, restricted cash, receivables, payables, and operating and finance lease obligations approximate their carrying amounts; the carrying value and fair value of debt is shown in the table below (in millions).\nDecember 31, 2024\nDecember 31, 2023\nFair Value\nHierarchy\nCarrying\nAmount\nFair\nValue\nCarrying\nAmount\nFair\nValue\nFinancial liabilities:\nDebt (excluding finance lease\nobligations)\nLevel 2\n$\n8,085\n \n$\n7,776\n \n$\n9,218\n \n$\n9,109\n \n134\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nInvestments in AFS debt securities, commodity derivative contracts, and foreign currency contracts are recognized at their fair values as shown in “\nRecurring Fair Value Measurements\n”\n \nabove.\n20.    PRICE RISK MANAGEMENT ACTIVITIES\nGeneral\nWe are exposed to market risks primarily related to the volatility in the price of commodities, foreign currency exchange rates, and the price of credits needed to comply with the Renewable and Low-Carbon Fuel Programs. We enter into derivative instruments to manage some of these risks, including derivative instruments related to the various commodities we purchase or produce, and foreign currency exchange and purchase contracts, as described below under “\nRisk Management Activities by Type of Risk.\n” These derivative instruments are recorded as either assets or liabilities measured at their fair values (see Note 19), as summarized below under “\nFair Values of Derivative Instruments\n.”\n \nThe effect of these derivative instruments on our income and other comprehensive income (loss) is summarized below under “\nEffect of Derivative Instruments on Income and Other Comprehensive Income (Loss)\n.”\nRisk Management Activities by Type of Risk\nCommodity Price Risk\nWe are exposed to market risks related to the volatility in the price of feedstocks (primarily crude oil, waste and renewable feedstocks, and corn); the products we produce; and natural gas and electricity used in our operations. To reduce the impact of price volatility on our results of operations and cash flows, we use commodity derivative instruments, such as futures and options. Our positions in commodity derivative instruments are monitored and managed on a daily basis by our risk control group to ensure compliance with our stated risk management policy that is periodically reviewed with our Board and/or relevant Board committee.\nWe primarily use commodity derivative instruments as cash flow hedges and economic hedges. Our objectives for entering into each type of hedge is described below.\n•\nCash flow hedges \n– The objective of our cash flow hedges is to lock in the price of forecasted purchases and/or product sales at existing market prices that we deem favorable.\n•\nEconomic hedges\n – Our objectives for holding economic hedges are to (i) manage price volatility in certain feedstock and product inventories and (ii) lock in the price of forecasted purchases and/or product sales at existing market prices that we deem favorable.\n135\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nAs of December 31, 2024, we had the following outstanding commodity derivative instruments that were used as cash flow hedges and economic hedges, as well as commodity derivative instruments related to the physical purchase of corn at a fixed price. The information presents the notional volume of outstanding contracts by type of instrument and year of maturity (volumes in thousands of barrels, except corn contracts that are presented in thousands of bushels).\nNotional Contract\nVolumes by\nYear of Maturity\n2025\nDerivatives designated as cash flow hedges:\nRefined petroleum products:\nFutures – long\n180\n \nFutures – short\n1,780\n \nDerivatives designated as economic hedges:\nCrude oil and refined petroleum products:\nFutures – long\n98,086\n \nFutures – short\n102,120\n \nCorn:\nFutures – long\n46,405\n \nFutures – short\n85,365\n \nPhysical contracts – long\n37,826\n \nForeign Currency Risk\nWe are exposed to exchange rate fluctuations on transactions related to our foreign operations that are denominated in currencies other than the local (functional) currencies of our operations. To manage our exposure to these exchange rate fluctuations, we often use foreign currency contracts. These contracts are not designated as hedging instruments for accounting purposes and therefore are classified as economic hedges. As of December 31, 2024, we had foreign currency contracts to purchase $\n777\n million of U.S. dollars. These commitments\n \nmatured on or before January 27, 2025.\nRenewable and Low-Carbon Fuel Programs Price Risk\nWe are exposed to market risk related to the volatility in the price of credits needed to comply with the Renewable and Low-Carbon Fuel Programs. To manage this risk, we enter into contracts to purchase these credits. Some of these contracts are derivative instruments; however, we elect the normal purchase exception and do not record these contracts at their fair values. The Renewable and Low-Carbon Fuel Programs require us to blend a certain volume of renewable and low-carbon fuels into the petroleum-based transportation fuels we produce in, or import into, the respective jurisdiction to be consumed therein based on annual quotas. To the degree we are unable to blend at the required quotas, we must purchase compliance credits (primarily RINs). For the years ended December 31, 2024, 2023, and 2022, the cost of meeting our credit obligations under the Renewable and Low-Carbon Fuel Programs was $\n730\n million, $\n1.3\n billion, and $\n1.5\n billion, respectively, which are reflected in cost of materials and other.\n136\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nFair Values of Derivative Instruments\nThe following table provides information about the fair values of our derivative instruments as of December 31, 2024 and 2023 (in millions) and the line items in our balance sheets in which the fair values are reflected. See Note 19 for additional information related to the fair values of our derivative instruments.\nAs indicated in Note 19, we net fair value amounts recognized for multiple similar derivative contracts executed with the same counterparty under master netting arrangements, including cash collateral assets and obligations. The following table, however, is presented on a gross asset and gross liability basis, which results in the reflection of certain assets in liability accounts and certain liabilities in asset accounts:\nBalance Sheet\nLocation\nDecember 31, 2024\nDecember 31, 2023\nAsset\nDerivatives\nLiability\nDerivatives\nAsset\nDerivatives\nLiability\nDerivatives\nDerivatives designated \nas hedging instruments:\nCommodity contracts\nReceivables, net\n$\n12\n \n$\n13\n \n$\n141\n \n$\n34\n \nDerivatives not designated\nas hedging instruments:\nCommodity contracts\nReceivables, net\n$\n390\n \n$\n435\n \n$\n662\n \n$\n609\n \nPhysical purchase contracts\nInventories\n2\n \n3\n \n—\n \n6\n \nForeign currency contracts\nReceivables, net\n6\n \n—\n \n—\n \n—\n \nForeign currency contracts\nAccrued expenses\n—\n \n—\n \n—\n \n7\n \nTotal\n$\n398\n \n$\n438\n \n$\n662\n \n$\n622\n \nMarket Risk\nOur price risk management activities involve the receipt or payment of fixed price commitments into the future. These transactions give rise to market risk, which is the risk that future changes in market conditions may make an instrument less valuable. We closely monitor and manage our exposure to market risk on a daily basis in accordance with policies that are periodically reviewed with our Board and/or relevant Board committee. Market risks are monitored by our risk control group to ensure compliance with our stated risk management policy. \nWe do not require any collateral or other security to support derivative instruments into which we enter.\n We also do not have any derivative instruments that require us to maintain a minimum investment-grade credit rating.\n137\nTable of Contents\nVALERO ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nEffect of Derivative Instruments on Income and Other Comprehensive Income (Loss)\nThe following table provides information about the gain (loss) recognized in income and other comprehensive income (loss) due to fair value adjustments of our cash flow hedges (in millions):\nDerivatives in\nCash Flow Hedging\nRelationships\nLocation of Gain (Loss)\nRecognized in Income\non Derivatives\nYear Ended December 31,\n2024\n2023\n2022\nCommodity contracts:\nGain (loss) recognized in\nother comprehensive\nincome (loss)\nn/a\n$\n30\n \n$\n82\n \n$\n(\n292\n)\nGain (loss) reclassified\nfrom accumulated \nother comprehensive\nloss into income\nRevenues\n117\n \n(\n8\n)\n(\n286\n)\nFor cash flow hedges, no component of any derivative instrument’s gain or loss was excluded from the assessment of hedge effectiveness for the years ended December 31, 2024, 2023, and 2022. For the years ended December 31, 2024, 2023, and 2022, cash flow hedges primarily related to forecasted sales of renewable diesel. As of December 31, 2024, the estimated deferred after-tax loss that is expected to be reclassified into revenues within the next 12 months was not material. The changes in accumulated other comprehensive loss by component, net of tax, for the years ended December 31, 2024, 2023, and 2022 are described in Note 11.\nThe following table provides information about the gain (loss) recognized in income on our derivative instruments with respect to our economic hedges and our foreign currency hedges and the line items in our statements of income in which such gains (losses) are reflected (in millions):\nDerivatives Not\nDesignated as\nHedging Instruments\nLocation of Gain (Loss)\nRecognized in Income\non Derivatives\nYear Ended December\n \n31,\n2024\n2023\n2022\nCommodity contracts\nRevenues\n$\n(\n18\n)\n$\n(\n27\n)\n$\n(\n17\n)\nCommodity contracts\nCost of materials and other\n(\n86\n)\n208\n \n(\n988\n)\nCommodity contracts\nOperating expenses \n(excluding depreciation and\namortization expense)\n—\n \n1\n \n(\n1\n)\nForeign currency contracts\nCost of materials and other\n36\n \n(\n34\n)\n73\n \nForeign currency contracts\nOther income, net\n—\n \n—\n \n(\n119\n)\n138\nTable of Contents\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nOur management has evaluated, with the participation of our principal executive officer and principal financial officer, the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) under the Securities Exchange Act of 1934) as of the end of the period covered by this report, and has concluded that our disclosure controls and procedures were effective as of December 31, 2024.\nInternal Control over Financial Reporting\n(a)\n \nManagement’s Report on Internal Control over Financial Reporting.\nThe management report on our internal control over financial reporting required by this item appears in “\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\n” on page \n65\n of this report, and is incorporated by reference into this item.\n(b)\n \nAttestation Report of the Independent Registered Public Accounting Firm.\nKPMG LLP’s report on our internal control over financial reporting appears in “\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\n” beginning on page \n68\n of this report, and is incorporated by reference into this item.\n(c)\n \nChanges in Internal Control over Financial Reporting.\nThere has been no change in our internal control over financial reporting that occurred during our last fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nITEM 9B. OTHER INFORMATION\n(a)\nIn February 2025, the Human Resources and Compensation Committee of our Board approved an amendment to our performance share awards (beginning with 2025 grants and including outstanding tranches of prior awards), such that going forward our performance share awards will vest solely on the basis of relative total shareholder return as set forth in the applicable award agreement.\n(b)\nDuring the three months ended December 31, 2024, no director or officer (as defined in Rule 16a-1(f) of the Securities Exchange Act of 1934) of Valero \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement,” as each term is defined in Item 408 of Regulation S-K.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n139\nTable of Contents\nPART III\nInformation regarding our executive officers appears in PART\n \nI of this report under “\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\n.”\n All other information required by ITEMS 10 through 14 of Form 10-K is incorporated by reference from the discussions under the following anticipated headings in our definitive proxy statement for our 2025 annual meeting of stockholders (the 2025 Proxy Statement). We expect to file the 2025 Proxy Statement with the SEC on or before March 31, 2025. No other information other than what is required to satisfy ITEMS 10 through 14 of Form 10-K is incorporated by reference into these items from the 2025 Proxy Statement.\nCopies of all documents incorporated by reference, other than exhibits to such documents, will be provided without charge to each person who receives a copy of this Form 10-K upon written request to Valero Energy Corporation, Attn: Secretary, P.O. Box 696000, San Antonio, Texas 78269-6000.\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nIn addition to the information regarding our executive officers that appears \nin PART\n \nI of this report under “\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\n,” the \ndisclosures under the following anticipated headings in our 2025 Proxy Statement are incorporated by reference herein: \n•\n“\nProposal No.\n \n1—Election of directors—Information Concerning Our Director Nominees\n;”\n•\n“\nProposal No.\n \n1—Election of directors—Nominees\n;”\n \n•\n“\nHow Our Board is Structured, Governed, and Operates—Overview of Our Board Committees—Audit Committee—Current Audit Committee Members\n;”\n•\n“\nHow Our Board is Structured, Governed, and Operates—Overview of Our Board Committees—Audit Committee—Audit Committee Financial Experts\n;”\n•\n“\nHow Our Board is Structured, Governed, and Operates—How Our Director Nominees are Selected\n;”\n•\n“\nCompensation Discussion and Analysis—Compensation-Related Policies—\nInsider Trading Policy\n;” and\n•\n“\nMiscellaneous—Governance Documents and Codes of Ethics\n.”\nITEM 11. EXECUTIVE COMPENSATION\nThe disclosures under the following anticipated headings in our 2025 Proxy Statement are incorporated by reference herein: \n•\n“\nHow Our Board is Structured, Governed, and Operates—Overview of Our Board Committees—Human Resources and Compensation Committee—Compensation Committee Interlocks and Insider Participation\n;”\n•\n“\nCompensation Discussion and Analysis\n;”\n140\nTable of Contents\n•\n“\nHuman Resources and Compensation Committee Report\n;”\n•\n“\nExecutive Compensation\n;”\n•\n“\nDirector Compensation\n;”\n•\n“\nPay Ratio Disclosure\n;”\n \nand\n \n•\n“\nAdditional Information—Board Independence, Related Party Matters, and Beneficial Ownership—Certain Relationships and Transactions with Related Persons\n.”\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe disclosures under the following anticipated headings in our 2025 Proxy Statement are incorporated by reference herein:\n \n•\n“\nEquity Compensation Plan Information\n,” and\n•\n“\nAdditional Information—Board Independence, Related Party Matters, and Beneficial Ownership—Beneficial Ownership of Valero Securities\n.”\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe disclosures under the following anticipated headings in our 2025 Proxy Statement are incorporated by reference herein: \n•\n“\nAdditional Information—Board Independence, Related Party Matters, and Beneficial Ownership—Independence of Our Directors\n,” and\n•\n“\nAdditional Information—Board Independence, Related Party Matters, and Beneficial Ownership—Certain Relationships and Transactions with Related Persons\n.”\nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe disclosures under the following anticipated heading in our 2025 Proxy Statement are incorporated by reference herein: “\nKPMG LLP Fees\n.”\n141\nTable of Contents\nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)\n1. Financial Statements\n. The following are included in “\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\n” of this Form 10-K:\nPage\nManagement’s Report on Internal Control Over Financial Reporting\n65\nReports of Independent Registered Public Accounting Firm\n (PCAOB ID: \n185\n)\n66\nConsolidated Balance Sheets as of December 31, 2024 and 2023\n70\nConsolidated Statements of Income for the years ended December 31, 2024, 2023, and 2022\n71\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2024,\n \n2023, and 2022\n72\nConsolidated Statements of Equity for the years ended December 31, 2024, 2023, and 2022\n73\nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023, and 2022\n74\nNotes to Consolidated Financial Statements\n75\n2. Financial Statement Schedules and Other Financial Information\n. No financial statement schedules are submitted because either they are inapplicable or because the required information is included in the consolidated financial statements or notes thereto.\n3. Exhibits\n. Filed as part of this Form 10-K are the following exhibits:\nIndex to Exhibits\n3.01\n—\nAmended and Restated Certificate of Incorporation of Valero Energy Corporation, formerly known as Valero Refining and Marketing Company–incorporated by reference to Exhibit 3.1 to Valero’s Registration Statement on Form S-1 (SEC File No. 333-27013) filed May 13, 1997.\n3.02\n—\nCertificate of Amendment (July 31, 1997) to Restated Certificate of Incorporation of Valero Energy Corporation–incorporated by reference to Exhibit 3.02 to Valero’s annual report on Form 10-K for the year ended December 31, 2003 (SEC File No. 001-13175).\n3.03\n—\nCertificate of Merger of Ultramar Diamond Shamrock Corporation with and into Valero Energy Corporation dated December 31, 2001–incorporated by reference to Exhibit 3.03 to Valero’s annual report on Form 10-K for the year ended December 31, 2003 (SEC File No. 001-13175).\n3.04\n—\nAmendment (effective December 31, 2001) to Restated Certificate of Incorporation of Valero Energy Corporation–incorporated by reference to Exhibit 3.1 to Valero’s current report on Form 8-K dated December 31, 2001, and filed January 11, 2002 (SEC File No. 001-13175).\n3.05\n—\nSecond Certificate of Amendment (effective September 17, 2004) to Restated Certificate of Incorporation of Valero Energy Corporation–incorporated by reference to Exhibit 3.04 to Valero’s quarterly report on Form 10-Q for the quarter ended September 30, 2004 (SEC File No. 001-13175).\n3.06\n—\nCertificate of Merger of Premcor Inc. with and into Valero Energy Corporation effective September 1, 2005–incorporated by reference to Exhibit 2.01 to Valero’s quarterly report on Form 10-Q for the quarter ended September 30, 2005 (SEC File No. 001-13175).\n3.07\n—\nThird Certificate of Amendment (effective December 2, 2005) to Restated Certificate of Incorporation of Valero Energy Corporation–incorporated by reference to Exhibit 3.07 to Valero’s annual report on Form 10-K for the year ended December 31, 2005 (SEC File No. 001-13175).\n3.08\n—\nFourth Certificate of Amendment (effective May 24, 2011) to Restated Certificate of Incorporation of Valero Energy Corporation–incorporated by reference to Exhibit 4.8 to Valero’s current report on Form 8-K dated and filed May 24, 2011 (SEC File No. 001-13175).\n142\nTable of Contents\n3.09\n—\nFifth Certificate of Amendment (effective May 13, 2016) to Restated Certificate of Incorporation of Valero Energy Corporation–incorporated by reference to Exhibit 3.02 to Valero’s current report on Form 8-K dated May 12, 2016, and filed May 18, 2016 (SEC File No. 001-13175).\n3.10\n—\nAmended and Restated Bylaws of Valero Energy Corporation–incorporated by reference to Exhibit 3.01 to Valero’s current report on Form 8-K dated March 15, 2022 and filed March 18, 2022 (SEC File No. 001-13175)\n.\n4.01\n—\nIndenture dated as of December 12, 1997 between Valero Energy Corporation and The Bank of New York–incorporated by reference to Exhibit 3.4 to Valero’s Registration Statement on Form S-3 (SEC File No. 333-56599) filed June 11, 1998.\n4.02\n—\nIndenture (Senior Indenture) dated as of June 18, 2004 between Valero Energy Corporation and Bank of New York–incorporated by reference to Exhibit 4.7 to Valero’s Registration Statement on Form S-3 (SEC File No. 333-116668) filed June 21, 2004.\n4.03\n—\nForm of Indenture related to subordinated debt securities–incorporated by reference to Exhibit 4.8 to Valero’s Registration Statement on Form S-3 (SEC File No. 333-116668) filed June 21, 2004.\n4.04\n—\nIndenture dated as of March 10, 2015 between Valero Energy Corporation and U.S. Bank Trust Company, National Association, as successor in interest to U.S. Bank National Association–incorporated by reference to Exhibit 4.1 to Valero’s Registration Statement on Form S-3 (SEC File No. 333-202635) filed March 10, 2015.\n4.05\n—\nIndenture, dated as of November 30, 2016, between Valero Energy Partners LP, as issuer, and U.S. Bank Trust Company, National Association, as successor in interest to U.S. Bank National Association, as trustee–incorporated by reference to Exhibit 4.1 to Valero Energy Partners LP’s Post-Effective Amendment No. 1 to Registration Statement on Form S-3 (Registration File No. 333-208052) filed November 30, 2016.\n4.06\n—\nFirst Supplemental Indenture (with Parent Guarantee), dated as of January 10, 2019, among Valero Energy Partners LP, as issuer; Valero Energy Corporation, as parent guarantor; and U.S. Bank Trust Company, National Association, as successor in interest to U.S. Bank National Association, as trustee–incorporated by reference to Exhibit 4.2 to Valero’s current report on Form 8-K dated and filed January 10, 2019 (SEC File No. 001-13175).\n4.07\n—\nSpecimen Certificate of Common Stock–incorporated by reference to Exhibit 4.1 to Valero’s Registration Statement on Form S-3 (SEC File No. 333-116668) filed June 21, 2004.\n4.08\n—\nDescription of Valero Energy Corporation common stock, $0.01 par value–incorporated by reference to Exhibit\n \n4.09 to Valero’s annual report on Form\n \n10-K for the year ended December\n \n31, 2019 (SEC File No.\n \n001\n-\n13175).\n+10.01\n—\nValero Energy Corporation Annual Bonus Plan, amended and restated as of February 28, 2018–incorporated by reference to Exhibit 10.01 to Valero’s annual report on Form 10-K for the year ended December 31, 2017 (SEC File No. 001-13175).\n+10.02\n—\nValero Energy Corporation 2020 Omnibus Stock Incentive Plan–incorporated by reference to Appendix\n \nA to Valero’s Definitive Proxy Statement on Schedule\n \n14A, filed March\n \n19, 2020 (SEC File No.\n \n001-13175).\n+10.03\n—\nAmendment No. 1 to the Valero Energy Corporation 2020 Omnibus Stock Incentive Plan effective October 1, 2021–incorporated by reference to Exhibit 10.04 to Valero’s annual report on Form 10-K for the year ended December 31, 2021 (SEC File No. 001-13175).\n+10.04\n—\nValero Energy Corporation Deferred Compensation Plan, amended and restated as of January 1, 2008–incorporated by reference to Exhibit 10.04 to Valero’s annual report on Form 10-K for the year ended December 31, 2008 (SEC File No. 001-13175).\n+10.05\n—\nValero Energy Corporation Supplemental Executive Retirement Plan, as amended and restated effective July 1, 2023–incorporated by reference to Exhibit 10.01 to Valero’s quarterly report on Form 10-Q for the quarter ended June 30, 2023 (SEC File No. 001-13175).\n+10.06\n—\nValero Energy Corporation Excess Pension Plan, as amended and restated effective December 31, 2011–incorporated by reference to Exhibit 10.10 to Valero’s annual report on Form 10-K for the year ended December 31, 2011 (SEC File No. 001-13175).\n143\nTable of Contents\n+10.07\n—\nForm of Change of Control Severance Agreement (Tier II-A) between Valero Energy Corporation and executive officer–incorporated by reference to Exhibit 10.02 to Valero’s current report on Form 8-K dated November 2, 2016, and filed November 7, 2016 (SEC File No. 001-13175).\n+10.08\n—\nSchedule of Tier II-A Change of Control Agreements–incorporated by reference to Exhibit 10.10 to Valero’s annual report on Form 10-K for the year ended December 31, 2020 (SEC File No. 001-13175).\n+10.09\n—\nForm of Amendment (dated January 17, 2017) to Change of Control Severance Agreements, amending Section 9 thereof–incorporated by reference to Exhibit 10.01 to Valero’s current report on Form 8-K dated and filed January 17, 2017 (SEC File No. 001-13175).\n+10.10\n—\nForm of Restricted Stock Agreement (2020 and 2021 grants)–incorporated by reference to Exhibit 10.17 to Valero’s annual report on Form 10-K for the year ended December 31, 2020 (SEC File No. 001-13175).\n+10.11\n—\nForm of Stock Unit Award Agreement for Non-Employee Directors (standard)–incorporated by reference to Exhibit 10.01 to Valero’s current report on Form 8-K dated April 30, 2019, and filed May 1, 2019 (SEC File No. 001-13175).\n+10.12\n—\nForm of Stock Unit Award Agreement for Non-Employee Directors (with one-year hold provision)–incorporated by reference to Exhibit 10.02 to Valero’s current report on Form 8-K dated April 30, 2019, and filed May 1, 2019 (SEC File No. 001-13175).\n10.13\n—\nFifth Amended and Restated Revolving Credit Agreement, dated as of November 22, 2022, among Valero Energy Corporation, as Borrower; JPMorgan Chase Bank, N.A., as Administrative Agent; and the lenders named therein–incorporated by reference to Exhibit 99.1 to Valero’s current report on Form 8-K dated November 22, 2022, and filed November 22, 2022 (SEC File No. 001-13175).\n+10.14\n—\nForm of Amended and Restated Performance Share Agreement (2022 grant–third tranche)–incorporated by reference to Exhibit 10.02 to Valero’s quarterly report on Form 10-Q for the quarter ended March 31, 2023 (SEC File No. 001-13175).\n+10.15\n—\nForm of Restricted Stock Agreement (2022, 2023, and 2024 grants and current)–incorporated by reference to Exhibit 10.26 to Valero’s annual report on Form 10-K for the year ended December 31, 2021 (SEC File No. 001-13175).\n+10.16\n—\nForm of Performance Share Agreement (2023 grant–second tranche)–incorporated by reference to Exhibit 10.03 to Valero’s quarterly report on Form 10-Q for the quarter ended March 31, 2023 (SEC File No. 001-13175).\n*+10.17\n—\nForm of Amended and Restated Performance Share Agreement (2024 grant–first tranche).\n*+10.18\n—\nForm of Amended and Restated Performance Share Agreement (2023 grant–third tranche, 2024 grant–second and third tranches, and current).\n+10.19\n—\nForm of Aircraft Time Sharing Agreement–incorporated by reference to Exhibit 10.04 to Valero’s quarterly report on Form 10-Q for the quarter ended March 31, 2023 (SEC File No. 001-13175).\n+10.20\n—\nForm of Change of Control Severance Agreement (Tier II) between Valero Energy Corporation and executive officer–incorporated by reference to Exhibit 10.16 to Valero’s annual report on Form 10-K for the year ended December 31, 2013 (SEC File No. 001-13175).\n+10.21\n—\nForm of Amendment (dated January 7, 2013) to Change of Control Severance Agreements (to eliminate excise tax gross-up benefit)–incorporated by reference to Exhibit 10.17 to Valero’s annual report on Form 10-K for the year ended December 31, 2012 (SEC File No. 001-13175).\n*19.01\n—\nSecurities Trading Policy.\n*21.01\n—\nValero Energy Corporation subsidiaries.\n22.01\n—\nSubsidiary Issuer of Guaranteed Securities–incorporated by reference to Exhibit 22.01 to Valero’s annual report on Form 10-K for the year ended December 31, 2020 (SEC File No. 001-13175).\n*23.01\n—\nConsent of KPMG LLP dated February 26, 2025.\n*24.01\n—\nPower of Attorney dated February 26, 2025 (on the signature page of this Form 10-K).\n144\nTable of Contents\n*31.01\n—\nRule 13a-14(a) Certification (under Section 302 of the Sarbanes-Oxley Act of 2002) of principal executive officer.\n*31.02\n—\nRule 13a-14(a) Certification (under Section 302 of the Sarbanes-Oxley Act of 2002) of principal financial officer.\n**32.01\n—\nSection 1350 Certifications (under Section 906 of the Sarbanes-Oxley Act of 2002).\n97.01\n—\nExecutive Compensation Clawback Policy–incorporated by reference to Exhibit 97.01 to Valero’s annual report on Form 10-K for the year ended December 31, 2023 (SEC File No. 001-13175).\n***101.INS\n—\nInline XBRL Instance Document–the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n***101.SCH\n—\nInline XBRL Taxonomy Extension Schema Document.\n***101.CAL\n—\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n***101.DEF\n—\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n***101.LAB\n—\nInline XBRL Taxonomy Extension Label Linkbase Document.\n***101.PRE\n—\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\n***104\n—\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n________________________\n*\nFiled herewith.\n**\nFurnished herewith.\n***\nSubmitted electronically herewith.\n+\nIdentifies management contracts or compensatory plans or arrangements required to be filed as an exhibit hereto.\nPursuant to paragraph 601(b)(4)(iii)(A) of Regulation S-K, the registrant has omitted from the foregoing listing of exhibits, and hereby agrees to furnish to the SEC upon its request, copies of certain instruments, each relating to debt not exceeding 10 percent of the total assets of the registrant and its subsidiaries on a consolidated basis.\nITEM 16. FORM 10-K SUMMARY\nNone.\n145\nTable of Contents\nSIGNATURE\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nVALERO ENERGY CORPORATION\n(Registrant)\nBy:\n/s/ R. Lane Riggs\n(R. Lane Riggs)\nChairman of the Board,\nChief Executive Officer and President\nDate: February 26, 2025\n146\nTable of Contents\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below hereby constitutes and appoints R. Lane Riggs, Jason W. Fraser, and Richard\n \nJ. Walsh, or any of them, each with power to act without the other, his true and lawful attorney-in-fact and agent, with full power of substitution and resubstitution, for him and in his name, place and stead, in any and all capacities, to sign any or all subsequent amendments and supplements to this annual report on Form 10-K, and to file the same, or cause to be filed the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto each said attorney-in-fact and agent full power to do and perform each and every act and thing requisite and necessary to be done in and about the premises, as fully to all intents and purposes as he might or could do in person, hereby qualifying and confirming all that said attorney-in-fact and agent or his substitute or substitutes may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ R. Lane Riggs\nChairman of the Board,\nChief Executive Officer and President\n(Principal Executive Officer)\nFebruary 26, 2025\n(R. Lane Riggs)\n/s/ Jason W. Fraser\nExecutive Vice President\nand Chief Financial Officer\n(Principal Financial and Accounting Officer)\nFebruary 26, 2025\n(Jason W. Fraser)\n/s/ Fred M. Diaz\nDirector\nFebruary 26, 2025\n(Fred M. Diaz)\n/s/ H. Paulett Eberhart\nDirector\nFebruary 26, 2025\n(H. Paulett Eberhart)\n/s/ Marie A. Ffolkes\nDirector\nFebruary 26, 2025\n(Marie A. Ffolkes)\n/s/ Kimberly S. Greene\nDirector\nFebruary 26, 2025\n(Kimberly S. Greene)\n/s/ Deborah P. Majoras\nDirector\nFebruary 26, 2025\n(Deborah P. Majoras)\n/s/ Eric D. Mullins\nDirector\nFebruary 26, 2025\n(Eric D. Mullins)\n/s/ Robert A. Profusek\nDirector\nFebruary 26, 2025\n(Robert A. Profusek)\n/s/ Randall J. Weisenburger\nDirector\nFebruary 26, 2025\n(Randall J. Weisenburger)\n/s/ Rayford Wilkins, Jr.\nDirector\nFebruary 26, 2025\n(Rayford Wilkins, Jr.)\n147",
    "item1c": "ITEM 1C. CYBERSECURITY \nRISK MANAGEMENT AND STRATEGY\nWe take an \nenterprise approach\n to information security risk management and governance. Our information security program and framework comprise processes, policies, practices, systems, and technologies that are designed to identify, assess, prioritize, manage, and monitor risks to our information systems, including risks from cybersecurity threats and events and risks associated with the use of third-party service providers.\n \nOur established recovery approach is designed to provide for the ready availability and use of our business-critical processes in the event of any downtime, disaster, or outages. We also seek to \nidentify and mitigate the risks associated with the use of third-party service providers through the review of their security programs prior to our engagement thereof.\n Additionally, our control environment and internal audit process are designed to bring a systematic, disciplined approach to evaluate our risk management, control, and governance processes concerning cybersecurity and our information security framework. \nWe have a cybersecurity Incident Response Plan (IRP) that sets forth a process designed to effectively respond to an incident by obtaining information, coordinating activities, assessing results, and communicating applicable developments to our stakeholders, including employees, law enforcement, other external parties and agencies, and our Board.\n The IRP includes the following major components: preparation, detection and analysis, containment, eradication, notification, recovery, reporting, and lessons learned. Specific technical and legal playbooks have also been developed for data breaches, malware, unauthorized remote access, and ransomware. We have also retained certain third-party experts to assist us with various aspects of incident assessment and response in the event those services become necessary or useful.\nTypically, we (i) perform periodic tabletop exercises with a company-wide cross-functional team that are \nfacilitated by a third-party expert\n and are intended to simulate a real-life security incident, (ii) conduct penetration testing as needed and annually conduct Payment Card Industry Data Security Standard testing and firewall reviews, and have periodically engaged a third-party expert to help therewith, (iii) hold annual cybersecurity awareness trainings, and (iv) periodically engage a third-party expert to conduct a review of our information security framework, which is designed to help identify existing and emerging risks, and mitigate against such risks. These internal efforts and external third-party reviews also support our efforts to regularly assess our information security program and framework against emerging risks, market and industry developments and provide opportunities to make adjustments or enhancements when deemed prudent or necessary. In 2024, we established a company-wide cross-functional team to preliminarily assess the risks and opportunities from conventional and generative AI and will continue these assessments in 2025. \nTo date, there have been no cybersecurity incidents that have materially affected us, or that are reasonably likely to materially affect us, including our business strategy, financial condition, or results of operations.\nFor additional information on the cybersecurity risks we face, see “",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone."
  }
}