{
  "ticker": "VLTO",
  "cik": "0001967680",
  "company_name": "Veralto Corp",
  "filing_date": "2025-02-25",
  "accession": "0001967680-25-000008",
  "primary_doc": "vlto-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business” for a discussion of Veralto’s strategic objectives and methodologies for delivering long-term shareholder value.  Veralto is a multinational business with global operations.  During 2024, approximately 55% of Veralto’s sales were derived from customers outside the United States.  As a diversified, global business, Veralto’s operations are affected by worldwide, regional and industry-specific economic and political factors.  Veralto’s geographic and industry diversity, as well as the range of its products and services, help limit the impact of any one industry or the economy of any single country on its consolidated operating results.  The Company’s individual businesses monitor key competitors and customers, including to the extent possible their sales, to gauge relative performance and the outlook for the future.\nAs a result of the Company’s geographic and industry diversity, the Company faces a variety of opportunities and challenges, including rapid technological development in most of the Company’s served markets, the expansion and evolution of high-growth markets, trends and costs associated with a global labor force, consolidation of the Company’s competitors and increasing regulation.  The Company operates in a highly competitive business environment in most markets, and the Company’s long-term growth and profitability will depend in particular on its ability to identify, consummate and integrate appropriate acquisitions and identify and consummate appropriate investments and strategic partnerships, develop innovative and differentiated new products and services with higher gross profit margins, expand and improve the effectiveness of the Company’s sales force, continue to reduce costs and improve operating efficiency and quality, effectively address the demands of an increasingly regulated global environment and expand its business in high-growth geographies and high-growth market segments.  The Company is making significant investments, organically and through acquisitions and investments, to address the rapid pace of technological change in its served markets and to globalize its manufacturing, research and development and customer-facing resources to be responsive to the Company’s customers throughout the world and improve the efficiency of the Company’s operations.  The Company defines high-growth markets as developing markets of the world which include Asia (with the exception of Japan, Australia and New Zealand), Latin America (including Mexico), the Middle East, Eastern Europe and Africa.  The Company defines developed markets as all markets of the world that are not high-growth markets.\nBusiness Performance\nThe Company’s overall revenues for the year ended December 31, 2024 increased 3.4% as compared to 2023.  Core sales for the year ended December 31, 2024 increased 3.7% as compared to 2023.  Currency exchange rates decreased reported sales by 0.3%.  For the definition of “core sales,” refer to “—Results of Operations” below.  \nGeographically, the Company’s sales during 2024 in developed markets increased year-over-year by 4.6% driven by increased sales of 5.9% in North America and 2.6% in Western Europe while high-growth markets were flat, primarily driven by year-over-year sales increases in the majority of countries within the high-growth markets offset by low double digit sales declines in China due to lower demand.\nThe Company’s core sales during 2024 in developed markets increased 4.2% year-over-year driven by a 5.3% increase in North America and a 2.2% increase in Western Europe.  Core sales in high-growth markets increased 2.5% driven by high-single digit increases in Latin America partially offset by mid-single digit decreases in China.\nNet earnings for the year ended December 31, 2024 totaled approximately $833 million, or $3.34 per diluted common share, compared to approximately $839 million, or $3.40 per diluted common share, for the year ended December 31, 2023.  The decrease in net earnings in 2024 as compared to 2023 was driven by higher operating expenses, standalone public company costs and interest expense post separation from Danaher.  Refer to “—Results of Operations” for further discussion of the year-over-year changes in net earnings for the year ended December 31, 2024.   \nOutlook\nThe Company anticipates 2025 results will be driven by the following expectations in each of the Company’s reportable segments:\n31\nTable of Contents\n•\nWater Quality: the Company expects continued year-over-year growth driven by on-going strong demand for industrial water treatment, particularly in North America, with steady demand across municipal end-markets in North America and Europe, partially offset by continued weakness in China.\n•\nProduct Quality & Innovation: the Company expects continued year-over-year growth driven by improved demand in the consumer packaged goods market globally.\nThe Company has access to capital resources and continues to focus on profitability improvements and leveraging Veralto Enterprise System (“VES”) to manage the anticipated impact of the challenging macroeconomic environment on business operations. \nThe Company’s outlook for 2025 reflects our current visibility and expectations based on current market factors.  Our ability to meet our expectations are subject to numerous risks, including, but not limited to, those described in “",
    "item1a": "Item 1A. Risk Factors.”\nThe Company’s amended and restated certificate of incorporation require it to indemnify to the full extent authorized or permitted by law any person made, or threatened to be made a party to any action or proceeding by reason of his or her service as a director or officer of the Company, or by reason of serving at the request of the Company as a director or officer of any other entity, subject to limited exceptions.  The Company’s amended and restated by-laws provide for similar indemnification rights.  While the Company maintains insurance for this type of liability, a significant deductible apply to this coverage and any such liability could exceed the amount of the insurance coverage.\nCRITICAL ACCOUNTING ESTIMATES\nManagement’s discussion and analysis of the Company’s financial condition and results of operations is based upon the Company’s Consolidated and Combined Financial Statements, which have been prepared in accordance with accounting principles generally accepted in the United States.  The preparation of these financial statements requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities.  The Company bases these estimates and judgments on historical experience, the current economic environment and on various other assumptions that are believed to be reasonable under the circumstances.  Actual results may differ materially from these estimates and judgments.\nThe Company believes the following accounting estimates are most critical to an understanding of its financial statements.  Estimates are considered to be critical if they meet both of the following criteria: (1) the estimate requires assumptions about material matters that are uncertain at the time the estimate is made, and (2) material changes in the estimate are reasonably likely from period-to-period.  For a detailed discussion on the application of these and other accounting estimates, refer to Note 1 to the Consolidated and Combined Financial Statements.\nAcquired Intangibles\n—The Company’s business acquisitions typically result in the recognition of goodwill, customer relationships, developed technology and other intangible assets, which affect the amount of future period amortization expense and possible impairment charges that the Company may incur.  The fair values of acquired intangibles are determined using information available near the acquisition date based on estimates and \n42\nTable of Contents\nassumptions that are deemed reasonable by the Company.  Significant assumptions include the discount rates and certain assumptions that form the basis of the forecasted results of the acquired business including earnings before interest, taxes, depreciation and amortization (“EBITDA”), revenue, revenue growth rates, royalty rates and technology obsolescence rates.  These assumptions are forward looking and could be affected by future economic and market conditions.  The Company engages third-party valuation specialists who review the Company’s critical assumptions and calculations of the fair value of acquired intangible assets in connection with significant acquisitions.  Refer to Notes 1, 2 and 9 to the Consolidated and Combined Financial Statements for a description of the Company’s policies relating to goodwill, acquired intangibles and acquisitions.\nIn performing its goodwill impairment testing, the Company estimates the fair value of its reporting units primarily using a market-based approach which relies on current trading multiples of forecasted EBITDA for peer companies and recent transactions for comparable companies operating in businesses similar to each of the Company’s reporting units to calculate an estimated fair value of each reporting unit.  In evaluating the estimates derived by the market-based approach, management makes judgments about the relevance and reliability of the multiples by considering factors unique to its reporting units, including operating results, business plans, economic projections, anticipated future cash flows, as well as judgments about recent market sale transactions of comparable companies and the comparability of selected peer companies.  There are inherent uncertainties related to these assumptions and management’s judgment in applying them to the analysis of goodwill impairment. \nAs of December 31, 2024, the Company had three reporting units for goodwill impairment testing.  Reporting units resulting from recent acquisitions generally present the highest risk of impairment.  Management believes the impairment risk associated with these reporting units generally decreases as these businesses are integrated into the Company and better positioned for potential future earnings growth.  The Company’s annual goodwill impairment analysis indicated that in all instances, the fair values of the Company’s reporting units exceeded their carrying values and consequently did not result in an impairment charge.  The excess of the estimated fair value over carrying value (expressed as a percentage of carrying value for the respective reporting unit) for each of the Company’s reporting units as of the annual testing date ranged from approximately 202% to approximately 991%.  To evaluate the sensitivity of the fair value calculations used in the goodwill impairment test, the Company applied a hypothetical 10% decrease to the fair values of each reporting unit and compared those hypothetical values to the reporting unit carrying values.  Based on this hypothetical 10% decrease, the excess of the estimated fair value over carrying value (expressed as a percentage of carrying value for the respective reporting unit) for each of the Company’s reporting units ranged from approximately 144% to approximately 783%. \nThe Company reviews identified intangible assets for impairment whenever events or changes in circumstances indicate that the related carrying amounts may not be recoverable.  Determining whether an impairment loss occurred for finite-lived intangibles requires a comparison of the carrying amount to the sum of undiscounted cash flows expected to be generated by the asset.  These analyses require management to make judgments and estimates about future revenues, expenses, market conditions and discount rates related to these assets.  Indefinite-lived intangibles are subject to impairment testing at least annually or more frequently if events or changes in circumstances indicate that potential impairment exists.  Determining whether an impairment loss occurred for indefinite-lived intangible assets involves calculating the fair value of the indefinite-lived intangible assets and comparing the fair value to their carrying value.  If the fair value is less than the carrying value, the difference is recorded as an impairment loss.  There were no intangible asset impairment charges recorded during 2024.  Refer to Note 9 to the Consolidated and Combined Financial Statements for a description of intangible asset impairment charges recorded during 2023.\nIf actual results are not consistent with management’s estimates and assumptions, goodwill and other intangible assets may be overstated and a charge would need to be taken against net earnings which would adversely affect the Company’s financial statements.  Historically, the Company’s estimates of goodwill and intangible assets have been materially correct.\nContingent Liabilities\n—As discussed in “Item 3.  Legal Proceedings” and Note 16 to the Consolidated and Combined Financial Statements, the Company is, from time to time, subject to a variety of litigation and similar contingent liabilities incidental to its business (or the business operations of previously owned entities).  The Company recognizes a liability for any legal contingency or contract settlement expense that is known or probable of occurrence and reasonably estimable.  These assessments require judgments concerning matters such as litigation developments and outcomes, the anticipated outcome of negotiations, the number of future claims, the cost of both pending and future claims and the value of the elements in the outcome.  In addition, because most contingencies are resolved over long periods of time, liabilities may change in the future due to various factors, including those discussed in Note 16 to the Consolidated and Combined Financial Statements.  If the reserves \n43\nTable of Contents\nestablished by the Company with respect to these contingent liabilities are inadequate, the Company would be required to incur an expense equal to the amount of the loss incurred in excess of the reserves, which would adversely affect the Company’s financial statements.  \nIncome Taxes\n—For a description of the Company’s income tax accounting policies, refer to Notes 1 and 6 to the Consolidated and Combined Financial Statements.  The Company establishes valuation allowances for its deferred tax assets if it is more likely than not that some or all of the deferred tax asset will not be realized.  This requires management to make judgments and estimates regarding: (1) the timing and amount of the reversal of taxable temporary differences, (2) expected future taxable income and (3) the impact of tax planning strategies.  Future changes to tax rates would also impact the amounts of deferred tax assets and liabilities and could have an adverse impact on the Company’s financial statements. \nThe Company provides for unrecognized tax benefits when, based upon the technical merits, it is “more likely than not” that an uncertain tax position will not be sustained upon examination.  Judgment is required in evaluating tax positions and determining income tax provisions.  The Company re-evaluates the technical merits of its tax positions and may recognize an uncertain tax benefit in certain circumstances, including when: (1) a tax audit is completed; (2) applicable tax laws change, including a tax case ruling or legislative guidance; or (3) the applicable statute of limitations expires.\nIn addition, certain of the Company’s tax returns are currently under review by tax authorities (refer to “—Results of Operations—Income Taxes” and Note 6 to the Consolidated and Combined Financial Statements).  Management believes the positions taken in these returns are in accordance with the relevant tax laws.  However, the outcome of these audits is uncertain and could result in the Company being required to record charges for prior year tax obligations which could have a material adverse impact to the Company’s financial statements, including its effective tax rate.\nCorporate Allocations\n—Prior to the Separation, the Company operated as part of Danaher and not as a separate, publicly traded company.  Accordingly, certain shared costs have been allocated to the Company and are reflected as expenses in the accompanying Combined Financial Statements.  The Company considers the allocation methodologies used to be reasonable and appropriate reflections of the related expenses attributable to Veralto for purposes of the carve-out financial statements; however, the expenses reflected in these financial statements may not be indicative of the actual expenses that would have been incurred during the periods presented if Veralto had operated as a separate stand-alone entity.  In addition, the expenses reflected in the financial statements may not be indicative of expenses that will be incurred in the future by Veralto.  Refer to Note 18 to the Consolidated and Combined Financial Statements for a description of corporate allocations and related party transactions.\nNEW ACCOUNTING STANDARDS\nFor a discussion of the new accounting standards impacting the Company, refer to Note 1 to the Consolidated and Combined Financial Statements.\nITEM 7A.  QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe information required by this item is included under “Item 7.  Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\n44\nTable of Contents\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Management on Veralto Corporation’s Internal Control Over Financial Reporting\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting for the Company.  Internal control over financial reporting is defined in Rules 13a-15(f) and 15d-15(f) promulgated under the Securities Exchange Act of 1934.\nThe Company’s management assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024.  In making this assessment, the Company’s management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in “Internal Control-Integrated Framework” (2013 framework).  Based on this assessment, management concluded that, as of December 31, 2024, the Company’s internal control over financial reporting is effective.\nManagement’s assessment of the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024, excluded TraceGains, which was acquired by the Company in 2024.  This entity, whose total assets and total revenues were excluded from the Company’s assessment, represented under 1% of the related consolidated amounts as of and for the year ended December 31, 2024.  Based upon Securities and Exchange Commission staff guidance, companies are allowed to exclude certain acquisitions from their assessments of internal control over financial reporting during the first year of an acquisition while integrating the acquired companies.\nThe Company’s independent registered public accounting firm has issued an audit report on the effectiveness of the Company’s internal control over financial reporting.  This report dated February 25, 2025 appears on page \n4\n6\n of this Form 10-K.\n45\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Veralto Corporation\nOpinion on Internal Control Over Financial Reporting\nWe have audited Veralto Corporation’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Veralto Corporation (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nAs indicated in the accompanying Report of Management on Internal Control over Financial Reporting, management’s assessment of and conclusion on the effectiveness of internal control over financial reporting did not include the internal controls of TraceGains, which is included in the 2024 consolidated financial statements of the Company and constituted 0.5% and 0.1% of total and net assets, respectively, as of December 31, 2024 and less than 0.2% of sales for the year then ended. Our audit of internal control over financial reporting of the Company also did not include an evaluation of the internal control over financial reporting of TraceGains.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated and combined statements of earnings, comprehensive income, equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and schedule listed in the Index at Item 15(a) and our report dated February 25, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Report of Management on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may \n46\nTable of Contents\nbecome inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nBoston, Massachusetts\nFebruary 25, 2025\n47\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Veralto Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Veralto Corporation (the Company) as of December 31, 2024 and 2023, the related consolidated and combined statements of earnings, comprehensive income, equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a) (collectively referred to as the “consolidated and combined financial statements”). In our opinion, the consolidated and combined financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 25, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated and combined financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinion on the critical audit matter or on the account or disclosure to which it relates. \n48\nTable of Contents\nGoodwill Impairment\nDescription of the Matter\nAs described in Note 9 to the consolidated and combined financial statements, goodwill is tested for impairment at least annually, or more frequently if indicators of potential goodwill impairment exists, at the reporting unit level. Total goodwill as of December 31, 2024 was $2.7 billion. To estimate the fair value of each reporting unit, the Company used the market approach based on multiples of earnings before interest, taxes, depreciation and amortization (EBITDA). The Company did not record any impairment of the carrying value of goodwill during the year ended December 31, 2024.  \nAuditing management’s goodwill impairment test for the Company’s reporting units was challenging and judgmental due to the estimation required to determine the fair value of the reporting units. In particular, the fair value estimates related to significant assumptions, such as the identification of peer companies to derive the trading EBITDA multiples involved a high degree of management subjectivity. \nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company’s process to estimate the fair value of each reporting unit. For example, we tested controls over the appropriateness of assumptions management used, specifically controls over the identification of peer companies.\nTo test the estimated fair value of the Company’s reporting units, our audit procedures included, among others, assessing the valuation methodology and testing the significant assumptions used in the Company’s analyses, as well as testing the completeness and accuracy of the underlying data. For example, we compared the significant assumptions to third-party industry and economic data, and to the historical results of the Company’s reporting units. We performed sensitivity analyses of significant assumptions to evaluate the changes in the fair values of the reporting units that would result from changes in key assumptions. We also involved internal valuation specialists to assist in our evaluation of significant assumptions, specifically the identification of peer companies, used by the Company. In addition, we tested management’s reconciliation of the fair values of its reporting units to the market capitalization of the Company. \n/s/ Ernst & Young LLP\nWe have served as the Company’s auditor since 2022.\nBoston, Massachusetts\nFebruary 25, 2025\n49\nTable of Contents\nVERALTO CORPORATION\nCONSOLIDATED BALANCE SHEETS\n($ in millions, except per share amounts)\n \nAs of December 31\n \n2024\n2023\nASSETS\nCurrent assets:\nCash and equivalents\n$\n1,101\n \n$\n762\n \nTrade accounts receivable, less allowance for credit losses of $\n37\n and $\n36\n, respectively\n812\n \n826\n \nInventories\n288\n \n297\n \nPrepaid expenses and other current assets\n186\n \n188\n \nTotal current assets\n2,387\n \n2,073\n \nProperty, plant and equipment, net\n268\n \n262\n \nOther long-term assets\n523\n \n398\n \nGoodwill\n2,693\n \n2,533\n \nOther intangible assets, net\n535\n \n427\n \nTotal assets\n$\n6,406\n \n$\n5,693\n \nLIABILITIES AND EQUITY\nCurrent liabilities:\nTrade accounts payable\n$\n395\n \n$\n431\n \nAccrued expenses and other liabilities\n850\n \n834\n \nTotal current liabilities\n1,245\n \n1,265\n \nOther long-term liabilities\n517\n \n410\n \nLong-term debt\n2,599\n \n2,629\n \nEquity:\nPreferred stock - $\n0.01\n par value as of December 31, 2024 and December 31, 2023, \n15\n million shares authorized as of both dates; and \n0\n shares issued and outstanding as of both dates\n—\n \n—\n \nCommon stock - $\n0.01\n par value as of December 31, 2024 and December 31, 2023, \n1.0\n billion shares authorized as of both dates; and \n247.4\n million shares and \n246.3\n million shares issued and outstanding, respectively\n2\n \n2\n \nAdditional paid-in capital\n2,190\n \n2,157\n \nRetained earnings\n917\n \n178\n \nAccumulated other comprehensive loss\n(\n1,071\n)\n(\n954\n)\nTotal Veralto equity\n2,038\n \n1,383\n \nNoncontrolling interests\n7\n \n6\n \nTotal equity\n2,045\n \n1,389\n \nTotal liabilities and equity\n$\n6,406\n \n$\n5,693\n \nSee the accompanying Notes to the Consolidated and Combined Financial Statements.\n50\nTable of Contents\nVERALTO CORPORATION\nCONSOLIDATED AND COMBINED STATEMENTS OF EARNINGS\n($ and shares in millions, except per share amounts)\n \nYear Ended December 31\n \n2024\n2023\n2022\nSales\n$\n5,193\n \n$\n5,021\n \n$\n4,870\n \nCost of sales\n(\n2,088\n)\n(\n2,120\n)\n(\n2,110\n)\nGross profit\n3,105\n \n2,901\n \n2,760\n \nOperating costs:\nSelling, general and administrative expenses\n(\n1,644\n)\n(\n1,536\n)\n(\n1,431\n)\nResearch and development expenses\n(\n253\n)\n(\n225\n)\n(\n217\n)\nOperating profit\n1,208\n \n1,140\n \n1,112\n \nNonoperating income (expense):\nOther income (expense), net\n(\n9\n)\n(\n14\n)\n1\n \nInterest expense, net\n(\n113\n)\n(\n30\n)\n—\n \nEarnings before income taxes\n1,086\n \n1,096\n \n1,113\n \nIncome taxes\n(\n253\n)\n(\n257\n)\n(\n268\n)\nNet earnings\n$\n833\n \n$\n839\n \n$\n845\n \nNet earnings per common share:\nBasic\n$\n3.37\n \n$\n3.41\n \n$\n3.43\n \nDiluted\n$\n3.34\n \n$\n3.40\n \n$\n3.43\n \nAverage common stock and common equivalent shares outstanding:\nBasic\n247.3\n \n246.4\n \n246.3\n \nDiluted\n249.6\n \n246.8\n \n246.3\n \nSee the accompanying Notes to the Consolidated and Combined Financial Statements.\n51\nTable of Contents\nVERALTO CORPORATION\nCONSOLIDATED AND COMBINED STATEMENTS OF COMPREHENSIVE INCOME\n($ in millions)\nYear Ended December 31\n2024\n2023\n2022\nNet earnings\n$\n833\n \n$\n839\n \n$\n845\n \nOther comprehensive income (loss), net of income taxes:\nForeign currency translation adjustments\n(\n139\n)\n29\n \n(\n100\n)\nPension and postretirement plan benefit adjustments\n(\n4\n)\n(\n15\n)\n33\n \nUnrealized gain (loss) on net investment hedge\n26\n \n(\n14\n)\n—\n \nTotal other comprehensive income (loss), net of income taxes\n(\n117\n)\n—\n \n(\n67\n)\nComprehensive income\n$\n716\n \n$\n839\n \n$\n778\n \nSee the accompanying Notes to the Consolidated and Combined Financial Statements.\n52\nTable of Contents\nVERALTO CORPORATION\nCONSOLIDATED AND COMBINED STATEMENTS OF EQUITY\n ($ and shares in millions)\nCommon Stock\nShares\nAmount\nAdditional Paid-In Capital\nRetained Earnings\nNet Former Parent Investment\nAccumulated Other\nComprehensive\nIncome (Loss)\nNoncontrolling  \nInterests\nJanuary 1, 2022\n— \n$\n— \n$\n— \n$\n— \n$\n4,084\n \n$\n(\n887\n)\n$\n4\n \nNet earnings for the year\n— \n— \n— \n— \n845\n \n— \n— \nNet transfers to Former Parent\n— \n— \n— \n— \n(\n781\n)\n— \n— \nOther comprehensive loss\n— \n— \n— \n— \n— \n(\n67\n)\n— \nFormer Parent common stock-based award activity\n— \n— \n— \n— \n41\n \n— \n— \nChange in noncontrolling interests\n— \n— \n— \n— \n— \n— \n1\n \nDecember 31, 2022\n— \n$\n— \n$\n— \n$\n— \n$\n4,189\n \n$\n(\n954\n)\n$\n5\n \nNet earnings for the year\n— \n— \n— \n200\n \n639\n \n— \n— \nCommon stock dividends declared\n— \n— \n— \n(\n22\n)\n— \n— \n— \nRecapitalization\n246.3\n \n2\n \n— \n— \n(\n2\n)\n— \n— \nConsideration paid to Former Parent in connection with Separation\n— \n— \n— \n— \n(\n2,600\n)\n— \n— \nNet transfers to Former Parent\n— \n— \n— \n— \n(\n147\n)\n— \n— \nNoncash adjustments to Former Parent's investment, net\n— \n— \n2,114\n \n— \n(\n2,114\n)\n— \n— \nFormer parent stock-based compensation activity\n— \n— \n— \n35\n \n— \n— \nStock-based deferred compensation award activity\n— \n— \n20\n \n— \n— \n— \n— \nCommon stock-based award activity\n— \n— \n23\n \n— \n— \n— \n— \nChange in noncontrolling interests\n— \n— \n— \n— \n— \n— \n1\n \nDecember 31, 2023\n246.3\n \n$\n2\n \n$\n2,157\n \n$\n178\n \n$\n—\n \n$\n(\n954\n)\n$\n6\n \nNet earnings for the year\n— \n$\n— \n$\n— \n$\n833\n \n$\n—\n \n$\n— \n$\n— \nCommon stock dividends declared\n— \n— \n— \n(\n94\n)\n— \n— \n— \nSeparation related adjustments\n— \n— \n(\n55\n)\n— \n— \n— \n— \nOther comprehensive loss\n— \n— \n— \n— \n— \n(\n117\n)\n— \nCommon stock-based award activity\n1.1\n \n— \n88\n \n— \n— \n— \n— \nChange in noncontrolling interests\n— \n— \n— \n— \n— \n— \n1\n \nDecember 31, 2024\n247.4\n \n$\n2\n \n$\n2,190\n \n$\n917\n \n$\n—\n \n$\n(\n1,071\n)\n$\n7\n \nSee the accompanying Notes to the Consolidated and Combined Financial Statements.\n53\nTable of Contents\nVERALTO CORPORATION\nCONSOLIDATED AND COMBINED STATEMENTS OF CASH FLOWS\n($ in millions)\nYear Ended December 31\n \n2024\n2023\n2022\nCash flows from operating activities:\nNet earnings\n$\n833\n \n$\n839\n \n$\n845\n \nNoncash items:\nDepreciation\n40\n \n39\n \n40\n \nAmortization of intangible assets\n38\n \n48\n \n50\n \nStock-based compensation expense\n65\n \n55\n \n41\n \nLoss on product line disposition\n15\n \n—\n \n—\n \nImpairment of equity method investment\n—\n \n15\n \n—\n \nChange in deferred income taxes\n(\n74\n)\n(\n25\n)\n(\n44\n)\nChange in trade accounts receivable, net\n3\n \n2\n \n(\n88\n)\nChange in inventories\n3\n \n52\n \n(\n38\n)\nChange in trade accounts payable\n(\n29\n)\n(\n1\n)\n23\n \nChange in prepaid expenses and other assets\n(\n48\n)\n(\n54\n)\n(\n5\n)\nChange in accrued expenses and other liabilities\n29\n \n(\n7\n)\n46\n \nNet cash provided by operating activities\n875\n \n963\n \n870\n \nCash flows from investing activities:\nCash paid for acquisitions, net of cash acquired\n(\n363\n)\n—\n \n(\n55\n)\nPayments for additions to property, plant and equipment\n(\n55\n)\n(\n54\n)\n(\n34\n)\nProceeds from sales of property, plant and equipment\n—\n \n2\n \n—\n \nAll other investing activities\n(\n16\n)\n(\n3\n)\n—\n \nNet cash used in investing activities\n(\n434\n)\n(\n55\n)\n(\n89\n)\nCash flows from financing activities:\nProceeds from the issuance of common stock in connection with stock-based compensation\n24\n \n4\n \n—\n \nNet transfers to Former Parent\n—\n \n(\n147\n)\n(\n781\n)\nConsideration paid to Former Parent in connection with Separation\n—\n \n(\n2,600\n)\n—\n \nPayment of dividends\n(\n89\n)\n—\n \n—\n \nProceeds from borrowings (maturities longer than 90 days)\n—\n \n2,608\n \n—\n \nNet cash used in financing activities\n(\n65\n)\n(\n135\n)\n(\n781\n)\nEffect of exchange rate changes on cash and cash equivalents\n(\n37\n)\n(\n11\n)\n—\n \nNet change in cash and cash equivalents\n339\n \n762\n \n—\n \nBeginning balance of cash and cash equivalents\n762\n \n—\n \n—\n \nEnding balance of cash and cash equivalents\n$\n1,101\n \n$\n762\n \n$\n—\n \nSupplemental disclosures:\nCash interest payments\n$\n137\n \n$\n—\n \n$\n—\n \nCash income tax payments\n$\n293\n \n$\n113\n \n$\n—\n \nSee the accompanying Notes to the Consolidated and Combined Financial Statements.\n54\nTable of Contents\nVERALTO CORPORATION\nNOTES TO CONSOLIDATED AND COMBINED FINANCIAL STATEMENTS\nNOTE 1.  \nBUSINESS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES \nVeralto Corporation’s (“Veralto,” the “Company,” “we,” “us,” or “our”) unifying purpose is \nSafeguarding the World’s Most Vital Resources \nTM\n.  The Company’s diverse group of associates and leading operating companies provide essential technology solutions that monitor, enhance and protect key resources around the globe.  The Company is committed to the advancement of public health and safety and believes it is positioned to support its customers as they address large global challenges including environmental resource sustainability, water scarcity, management of severe weather events, food and pharmaceutical security, and the impact of an aging workforce.  Through its core offerings in water analytics, water treatment, marking and coding and packaging and color, customers look to the Company’s solutions to help ensure the safety, quality, efficiency and reliability of their products, processes and people globally.  The Company operates through \ntwo\n segments – Water Quality (“WQ”) and Product Quality & Innovation (“PQI”).  Through the Water Quality segment, the Company improves the quality and reliability of water through its leading brands Hach, Trojan Technologies and ChemTreat.  Through the Product Quality & Innovation segment, the Company promotes consumer trust in products and helps enable product innovation through leading brands including Videojet, Linx, Esko, X-Rite and Pantone.\nBasis of Presentation\n—Prior to the Company’s separation from Danaher Corporation (“Danaher” or “Former Parent”), Veralto businesses were comprised of Danaher’s Environmental & Applied Solutions segment.  On August 24, 2023, the Board of Directors of Danaher approved the separation of Danaher’s Environmental & Applied Solutions segment through the pro rata distribution of all of the issued and outstanding common stock of Veralto Corporation to Danaher's stockholders (the “Separation”).  In connection with the Separation, on September 20, 2023, the net assets of the Veralto businesses were contributed to Veralto, a wholly-owned subsidiary of the Former Parent, and, as partial consideration for such contribution the Company made a cash payment to Danaher in the amount of $\n2.6\n billion.  In addition, on September 29, 2023, the \n100\n shares of Veralto common stock held by Danaher were recapitalized into \n246,291,342\n shares of Veralto common stock held by Danaher.  All per share amounts in the Consolidated and Combined Statements of Earnings have been retroactively adjusted to give effect to this recapitalization.  Veralto completed the Separation on September 30, 2023, the first day of its fiscal fourth quarter. \nIn connection with the Separation, on September 29, 2023, Danaher and Veralto entered into a separation and distribution agreement as well as various other related agreements (collectively the “Agreements”) that govern the Separation and the relationships between the parties going forward, including a transition services agreement, employee matters agreement, tax matters agreement, an intellectual property matters agreement, a Veralto Enterprise System (“VES”) license agreement, and a framework agreement governing certain commercial arrangements between subsidiaries of Danaher and Veralto.  In accordance with the tax matters agreement, Danaher is retaining certain net tax liabilities that are subject to joint and several liability between Danaher and the Company with respect to the taxable periods (or portions thereof) ended on or prior to the Separation.\nThe accompanying Consolidated and Combined Financial Statements present the Company’s historical financial position, results of operations, changes in equity and cash flows in accordance with accounting principles generally accepted in the United States of America (“GAAP”). The Consolidated and Combined Financial Statements for periods prior to the separation were derived from the historical financial statements and accounting records of the Environmental & Applied Solutions segment of Danaher in accordance with GAAP for the preparation of carved-out combined financial statements. Through the date of Separation, all revenues and costs as well as assets and liabilities directly associated with the business activity of the Company are included as a component of the Combined Financial Statements.  Prior to the separation, the financial statements also included allocations of certain general, administrative, sales and marketing expenses from Danaher’s corporate office to the Company and Danaher’s investment, as applicable.  The allocations were determined on a reasonable basis; however, the amounts are not necessarily representative of the amounts that would have been reflected in the financial statements had the Company been an entity that operated independently of Danaher.  Related party allocations are discussed further in Note 18.\nFollowing the Separation, the consolidated financial statements include the accounts of Veralto and those of the Company’s wholly-owned subsidiaries and no longer include any allocations from Danaher.  Accordingly:\n•\nThe Consolidated Balance Sheets at December 31, 2024 and December 31, 2023 consist of the Company’s consolidated balances.    \n55\nTable of Contents\n•\nThe Consolidated Statement of Earnings, Statement of Comprehensive Income, Statement of Changes in Equity and Statement of Cash Flows for the year ended December 31, 2024 consist of the Company’s consolidated results.\n•\nThe Consolidated and Combined Statement of Earnings, Statement of Comprehensive Income, Statement of Changes in Equity and Statement of Cash Flows for the year ended December 31, 2023 consist of the Company’s consolidated results for the three months ended December 31, 2023 and the combined results of the Veralto businesses for the nine months ended September 29, 2023. \n•\nThe Combined Statements of Earnings, Statements of Comprehensive Income, Statement of Changes in Equity, and Statement of Cash Flows for the year ended December 31, 2022 consist of the combined results and activity of the Veralto businesses.\nAll significant transactions between the Company and Former Parent have been included in the accompanying Consolidated and Combined Financial Statements.  Transactions with Former Parent are reflected in the accompanying Consolidated and Combined Statements of Equity as “Net transfers to Former Parent.” In addition, the accumulated net effect of intercompany transactions between the Company and Danaher or Danaher affiliates for periods prior to the Separation are included in “Noncash adjustments to Former Parent’s investment, net.”\nBefore the Separation, the Company was dependent upon Danaher for all of its working capital and financing requirements under Danaher’s centralized approach to cash management and financing of operations of its subsidiaries.  Because the Company was part of Danaher during the nine months ended September 29, 2023, only cash, cash equivalents and borrowings clearly associated with Veralto and related to the Separation have been included in the Combined Financial Statements through the date of Separation.  Other financial transactions relating to the business operations of the Company during the above period were accounted for through the Net Former Parent investment account of the Company.\nThe Consolidated and Combined Financial Statements may not be indicative of future performance and do not necessarily reflect what the Consolidated and Combined Statements of Earnings and Statements of Cash Flows would have been had the Company operated as a separate business during the periods presented.\n \nAccounting Principles\n—The accompanying financial statements have been prepared in accordance with GAAP.  The Consolidated and Combined Financial Statements include the accounts of the Company and its subsidiaries.  All intercompany balances and transactions have been eliminated upon consolidation.  The Consolidated and Combined Financial Statements also reflect the impact of noncontrolling interests.  Noncontrolling interests do not have a significant impact on the Company’s consolidated results of continuing operations, therefore earnings attributable to noncontrolling interests for continuing operations are not presented separately in the Company’s Consolidated and Combined Statements of Earnings.  Earnings attributable to noncontrolling interests have been reflected in selling, general and administrative expenses and were insignificant in all periods presented.  Reclassifications of certain prior year amounts have been made to conform to the current year presentation.\nUse of Estimates\n—The preparation of these financial statements in conformity with GAAP requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities.  The Company bases these estimates on historical experience, the current economic environment and on various other assumptions that are believed to be reasonable under the circumstances.  However, uncertainties associated with these estimates exist and actual results may differ materially from these estimates.\nCash and Cash Equivalents\n—The Company considers all highly liquid investments with a maturity of three months or less at the date of purchase to be cash equivalents.\nAccounts Receivable and Allowances for Credit Losses\n—All trade accounts, contract and finance receivables are reported on the accompanying Consolidated Balance Sheets adjusted for any write-offs and net of allowances for credit losses.  The allowances for credit losses represent management’s best estimate of the expected future credit losses from the Company’s trade accounts, contract and finance receivable portfolios.  Determination of the allowances requires management to exercise judgment about the timing, frequency and severity of credit losses that could materially affect the provision for credit losses and, therefore, net earnings.  The Company regularly performs detailed reviews of its portfolios to determine if an impairment has occurred and evaluates the collectability of receivables based on a combination of various financial and qualitative factors that may affect customers’ ability to pay, including customers’ financial condition, collateral, debt-servicing ability, past payment experience and credit bureau information.  In circumstances where the Company is aware of a specific customer’s inability to meet its financial obligations, a specific reserve is recorded against amounts due to reduce the recognized receivable to the \n56\nTable of Contents\namount reasonably expected to be collected.  Additions to the allowances for credit losses are charged to current period earnings, amounts determined to be uncollectible are charged directly against the allowances, while amounts recovered on previously written-off accounts increase the allowances.  If the financial condition of the Company’s customers were to deteriorate, resulting in an impairment of their ability to make payments, additional reserves would be required.  The Company does not believe that trade accounts receivable represents significant concentrations of credit risk because of the diversified portfolio of individual customers and geographical areas.  The Company’s allowance for credit losses as of December 31, 2024 reflects the Company’s best estimate of the expected future losses for its accounts receivables; however, these estimates may change and future actual losses may differ from the Company’s estimates.  The Company will continue to monitor economic conditions and will revise the estimates of the expected future losses for accounts receivable as necessary.  The Company recorded $\n9\n million, $\n10\n million and $\n9\n million of expense associated with credit losses for the years ended December 31, 2024, 2023 and 2022, respectively. \nIncluded in the Company’s trade accounts receivable and other long-term assets as of December 31, 2024 and 2023 are $\n165\n million and $\n153\n million of net aggregate financing receivables, respectively.  All financing receivables are evaluated for impairment based on individual customer credit profiles.\nInventories\n—Inventories include the costs of material, labor and overhead.  Inventories are stated at the lower of cost and net realizable value primarily using the first-in, first-out method.\n \nThe classes of inventory as of December 31 are summarized as follows:\n($ in millions)\n2024\n2023\nFinished goods\n$\n122\n \n$\n126\n \nWork in process\n39\n \n42\n \nRaw materials\n127\n \n129\n \nTotal\n$\n288\n \n$\n297\n \nPrepaid Expenses and Other Current Assets\n—Prepaid expenses and other current assets primarily result from advance payments to vendors for goods and services and are capitalized until the related goods are received or services are performed.  Included in the Company’s prepaid expenses and other current assets as of December 31, 2024 and 2023 are prepaid expenses of $\n110\n million and $\n105\n million, respectively.\n \nProperty, Plant and Equipment\n—Property, plant and equipment are carried at cost.\n \nThe provision for depreciation has been computed principally by the straight-line method based on the estimated useful lives of the depreciable assets as follows:\nCategory\nUseful Life\nBuildings\n30\n years\nLeased assets and leasehold improvements\nAmortized over the lesser of the economic life of the asset or the term of the lease\nMachinery and equipment\n3\n – \n10\n years\nCustomer-leased instruments\n5\n – \n10\n years\nEstimated useful lives are periodically reviewed and, when appropriate, changes to estimates are made prospectively.\nThe classes of property, plant and equipment as of December 31 are summarized as follows:\n($ in millions)\n2024\n2023\nLand and improvements\n$\n16\n \n$\n15\n \nBuildings\n208\n \n202\n \nMachinery and equipment\n502\n \n491\n \nCustomer-leased equipment\n27\n \n26\n \nGross property, plant and equipment\n753\n \n734\n \nLess: accumulated depreciation\n(\n485\n)\n(\n472\n)\nProperty, plant and equipment, net\n$\n268\n \n$\n262\n \n57\nTable of Contents\nInvestments\n—Equity investments in common stock or in-substance common stock for which the Company has a significant influence but not a controlling interest, are accounted for using the equity method of accounting which requires the Company to record its initial investment at cost and adjust the balance each period for the Company’s share of the investee’s income or loss and dividends paid.  For securities without readily available fair values, the Company has elected the measurement alternative to record these investments at cost and to adjust for impairments and observable price changes with a same or similar security from the same issuer within net earnings (the “Fair Value Alternative”).  \nInvestments for which the Company does not have the ability to significantly influence the operating decisions of the investee, or for which the investment is in securities other than common stock or in-substance common stock are accounted for using the cost method.  For investments accounted for under the cost method that do not have readily determinable fair values, the Company measures them at cost minus impairment, if any, plus or minus changes resulting from observable price changes in orderly transactions for the identical or a similar investment of the same issuer.\nNon-controlling investments made in 2024 are included in other long-term assets.\n  The C\nompany made \nno\n such investments in 2023 o\nr 2022.  No significant realized or unrealized gains or losses were recorded in 2024, 2023 or 2022 with respect to these investments. \nOther Assets\n—\nOther assets\n principally include noncurrent financing receivables, noncurrent deferred tax assets, operating lease right-of-use assets, other investments and a tax indemnification asset as a result of the Separation from Danaher.\n \nFair Value of Financial Instruments\n—The Company’s financial instruments consist primarily of cash and cash equivalents, trade accounts receivable, obligations under trade accounts payable and short and long-term debt.  Due to their short-term nature, the carrying values for cash and cash equivalents, trade accounts receivable and trade accounts payable approximate fair value.\n  Refer to Note 10 for the fair values of the Company’s long-term debt.\nGoodwill and Other Intangible Assets\n—Goodwill and other intangible assets result from the Company’s acquisition of existing businesses.  In accordance with accounting standards related to business combinations, goodwill is not amortized; however, certain finite-lived identifiable intangible assets, primarily customer relationships and acquired technology, are amortized over their estimated useful lives.  Intangible assets with indefinite lives are not amortized.  The Company reviews identified intangible assets and goodwill for impairment whenever events or changes in circumstances indicate that the related carrying amounts may not be recoverable.  The Company also tests intangible assets with indefinite lives and goodwill for impairment at least annually.  Refer to Note 9 for additional information about the Company’s goodwill and other intangible assets.\nRevenue Recognition\n—The Company derives revenues primarily from the sale of Water Quality and Product Quality & Innovation products and services.  Revenue is recognized when control of the promised products or services is transferred to the Company’s customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those products or services (the transaction price).  A performance obligation is a promise in a contract to transfer a distinct product or service to a customer and is the unit of account under Accounting Standards Codification (“ASC”) 606, \nRevenue from Contracts with Customers.  \nFor equipment and consumables sold by the Company, control transfers to the customer at a point in time.  To indicate the transfer of control, the Company must have a present right to payment, legal title must have passed to the customer, the customer must have the significant risks and rewards of ownership, and where acceptance is not a formality, the customer must have accepted the product or service.  The Company’s principal terms of sale are Free On Board (“FOB”) Shipping Point, or equivalent, and the Company records revenue for these product sales upon transfer of control to the customer, which may occur at shipment.  For those FOB Shipping Point arrangements where risk of loss is not transferred until delivery, the Company transfers control and records revenue upon delivery of the product to the customer.  Sales arrangements with delivery terms that are not FOB Shipping Point are not recognized upon shipment and the transfer of control for revenue recognition is evaluated based on the associated shipping terms and customer obligations.  If a performance obligation to the customer with respect to a sales transaction remains to be fulfilled following shipment (typically installation or acceptance by the customer), revenue recognition for that performance obligation is deferred until such commitments have been fulfilled.  Returns for products sold are estimated and recorded as a reduction of revenue at the time of sale.  Customer allowances and rebates, consisting primarily of volume discounts and other short-term incentive programs, are recorded as a reduction of revenue at the time of sale because these allowances reflect a reduction in the transaction price.  Product returns, customer allowances and rebates are estimated based on historical experience and known trends.  For extended warranty and service, control transfers to the customer over the term of the arrangement.  Revenue \n58\nTable of Contents\nfor extended warranty and service is recognized based upon the period of time elapsed under the arrangement.  Revenue for other long-term contracts is generally recognized based upon the cost-to-cost method, which measures costs incurred relative to total estimated costs, provided that the Company meets the criteria associated with transferring control of the good or service over time.\nCertain of the Company’s revenues relate to sales-type leases (“STL”) and operating-type lease (“OTL”) arrangements.  Leases are outside the scope of ASC 606 and are therefore accounted for in accordance with ASC 842, \nLeases\n.  Equipment lease revenue for STL arrangements is recognized upon lease commencement.  Equipment lease revenue for OTL agreements is recognized on a straight-line basis over the life of the lease, and the cost of customer-leased equipment is recorded within property, plant and equipment in the accompanying Consolidated Balance Sheets and depreciated over the equipment’s estimated useful life.  Depreciation expense associated with the leased equipment under OTL arrangements is reflected in cost of sales in the accompanying Consolidated and Combined Statements of Earnings.  \nFor a contract with multiple performance obligations, the Company allocates the contract’s transaction price to each performance obligation on a relative standalone selling price basis using the Company’s best estimate of the standalone selling price of each distinct product or service in the contract.  The primary method used to estimate standalone selling price is the price observed in standalone sales to customers.  Allocation of the transaction price is determined at the contracts’ inception.\n \nShipping and Handling\n—Shipping and handling costs are included as a component of cost of sales.  Revenue derived from shipping and handling costs billed to customers is included in sales.\nAdvertising\n—Advertising costs are expensed as incurred.\nResearch and Development\n—The Company conducts research and development activities for the purpose of developing new products, enhancing the functionality, effectiveness, ease of use and reliability of the Company’s existing products and expanding the applications for which uses of the Company’s products are appropriate.  Research and development costs are expensed as incurred.\nIncome Taxes—\nIncome taxes for the Company are accounted for under the asset and liability method.  Deferred income tax assets and liabilities are recognized for the future tax consequences attributable to differences between the carrying amounts of existing assets and liabilities in the Consolidated and Combined Financial Statements and their respective tax basis.  Deferred income tax assets and liabilities are measured using enacted tax rates expected to be applied to taxable income in the years in which those temporary differences are expected to be recovered or settled.  Deferred income tax assets and liabilities are reported in other assets and other liabilities in the Consolidated Balance Sheets, respectively.  The effect on deferred income tax assets and liabilities of a change in tax rates is generally recognized in income tax expense in the period that includes the enactment date.  Global Intangible Low-Taxed Income (“GILTI”) is accounted for as a current tax expense in the year the tax is incurred. \nValuation allowances are recorded if it is more likely than not that some portion of the deferred income tax assets will not be realized.  In evaluating the need for a valuation allowance, the Company considers various factors, including the expected level of future taxable income and available tax planning strategies.  Any changes in judgment about the valuation allowance are recorded through income tax expense and are based on changes in facts and circumstances regarding realizability of deferred tax assets. \nThe Company must presume that an income tax position taken in a tax return will be examined by the relevant tax authority and determine whether it is more likely than not that the tax position will be sustained upon examination based upon the technical merits of the position.  An income tax position that meets the more-likely-than-not recognition threshold is measured to determine the amount of benefit to recognize in the financial statements.  The Company establishes a liability for unrecognized income tax benefits for income tax positions for which it is more likely than not that a tax position will not be sustained upon examination by the respective taxing authority to the extent such tax positions reduce the Company’s income tax liability.  The Company recognizes interest and penalties related to unrecognized income tax benefits in income tax expense in the Consolidated and Combined Statements of Earnings.\nProductivity Improvement and Restructuring\n—The Company periodically initiates productivity improvement and restructuring activities to appropriately position the Company’s cost base relative to prevailing economic conditions and associated customer demand as well as in connection with certain acquisitions.  Costs associated with productivity improvement and restructuring actions can include one-time termination benefits and related charges in addition to facility closure, contract termination and other related activities.  The Company records the cost of the productivity improvement and restructuring activities when the associated liability is incurred.\n \n59\nTable of Contents\nForeign Currency Translation\n—Exchange rate adjustments resulting from foreign currency transactions are recognized in net earnings, whereas effects resulting from the translation of financial statements are reflected as a component of accumulated other comprehensive income (loss).  Assets and liabilities of subsidiaries operating outside the United States with a functional currency other than U.S. dollars are translated into U.S. dollars using year end exchange rates and income statement accounts are translated at weighted average rates.\n  Net foreign currency transaction losses were $\n14\n million and $\n45\n million for the years ended December 31, 2024 and December 31, 2023, respectively. \nDerivative Financial Instruments\n—The Company is neither a dealer nor a trader in derivative instruments.  The Company has generally accepted the exposure to transactional exchange rate movements without using derivative instruments to manage this risk.  The Company has issued foreign currency denominated long-term debt as a partial hedge of its net investment in foreign operations against adverse movements in exchange rates between the U.S. dollar and the euro.  This foreign currency denominated long-term debt issuance is designated and qualifies as a nonderivative hedging instrument.  Accordingly, the foreign currency translation of this debt instrument is recorded in accumulated other comprehensive income (loss), offsetting the foreign currency translation adjustment of the Company’s related net investment that is also recorded in accumulated other comprehensive income (loss).\n  Refer to Note 13 for additional information.\nAccumulated Other Comprehensive Income (Loss)\n—Accumulated other comprehensive income (loss) refers to certain gains and losses that under GAAP are included in comprehensive income (loss) but are excluded from net earnings as these amounts are initially recorded as an adjustment to equity.  Foreign currency translation adjustments are generally not adjusted for income taxes as they relate to indefinite investments in non-U.S. subsidiaries.  Net investment hedge adjustments reflect the gains or losses on the foreign currency denominated long-term debt issuance designated as a nonderivative hedging instrument.  Pension and postretirement plan benefit adjustments relate to unrecognized prior service credits and actuarial losses.\n  Refer to Notes 13, 14 and 17 for additional information.\nLoss Contingencies\n—The Company records a reserve for loss contingencies when it is both probable that a loss will be incurred and the amount of the loss is reasonably estimable.  The Company evaluates pending litigation and other contingencies at least quarterly and adjusts the reserve for such contingencies for changes in probable and reasonably estimable losses.  The Company includes an estimate for related legal costs at the time such costs are both probable and reasonably estimable.\nStock-Based Compensation\n—Certain employees of the Company participate in Veralto’s shared-based compensation plans which include stock options, restricted stock units (“RSUs”), and performance stock units (\"PSUs\").  The Company had no stock-based compensation plans prior to the Separation; however certain of the Company’s employees had participated in Danaher’s stock-based compensation plans (“Danaher Plans”).  The expense associated with Veralto employees who participated in the Danaher Plans was allocated to the Company in the accompanying Consolidated and Combined Statements of Earnings for the associated periods prior to the Separation.  Equity-based compensation expense is recognized net of an estimated forfeiture rate on a straight-line basis over the requisite service period of the award, except that in the case of RSUs, compensation expense is recognized using an accelerated attribution method.\n  Refer to Note 17 for additional information on the stock-based compensation plans in which certain employees of the Company participate.\nPension and Postretirement Benefit Plans\n—The Company measures its pension and postretirement plans’ assets and its obligations that determine the respective plan’s funded status as of the end of the Company’s fiscal year, and recognizes an asset for a plan’s overfunded status or a liability for a plan’s underfunded status in its balance sheet.  Changes in the funded status of the plans are recognized in the year in which the changes occur and reported in comprehensive income (loss).  Refer to Note 14 for additional information on the Company’s pension and postretirement plans including a discussion of the actuarial assumptions, the Company’s policy for recognizing the associated gains and losses and the method used to estimate service and interest cost components.\nRecent Accounting Pronouncements\n—In November 2024, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2024-03, \nIncome Statement — reporting Comprehensive Income — Expense Disaggregation Disclosures\n. The ASU requires entities to provide disaggregated disclosures of certain categories of expenses on an annual and interim basis including purchases of inventory, employee compensation, depreciation and intangible asset amortization for each income statement line item that contains those expenses.  This ASU is effective for annual periods beginning after December 15, 2026, and interim reporting periods beginning after December 15, 2027 with early adoption permitted.  The Company is currently assessing the impact of this ASU on its disclosures in the Consolidated Financial Statements.\n60\nTable of Contents\nOn March 6, 2024, the SEC adopted the final rule under SEC Release No. 33-11275, \nThe Enhancement and Standardization of Climate-Related Disclosures for Investors\n, which requires registrants to disclose material climate-related risks, activities to mitigate or adapt to such risks, information about board oversight of climate-related risks and climate-related targets or goals that are material to the registrant’s business, results of operations or financial condition.  In April 2024, the SEC voluntarily stayed the final rules pending the resolution of certain legal challenges.  The Company is currently assessing the impact of these final rules on its Consolidated Financial Statements and disclosures. \nIn December 2023, the FASB issued ASU 2023-09, \nImprovements to Income Tax Disclosures\n, which enhances the transparency of income tax disclosures in ASC 740,\n Income Taxes\n, primarily related to the rate reconciliation and income taxes paid information.  The ASU is effective for fiscal years beginning after December 15, 2024, may be applied retrospectively and early adoption is permitted.  The Company is currently assessing the impact on its Consolidated Financial Statements and related income tax disclosures for the year ending December 31, 2025. \nIn November 2023, the FASB issued ASU 2023-07, \nImprovements to Reportable Segment Disclosures\n, which improves reportable segment disclosure requirements in ASC 280, \nSegment Reporting\n, primarily through enhanced disclosures about significant segment expenses.  The ASU is effective for fiscal years beginning after December 15, 2023 and early adoption is permitted.  The Company first applied the ASU to the Company’s annual disclosures for the year ended December 31, 2024. \nIn August 2023, the FASB issued ASU 2023-05, \nBusiness Combinations—Joint Venture Formations\n (Subtopic 805-60): Recognition and Initial Measurement.  The ASU requires that a joint venture apply a new basis of accounting upon formation in which the joint venture will recognize and initially measure its assets and liabilities at fair value (with exceptions to fair value measurement that are consistent with the business combinations guidance).  The ASU is effective prospectively for all joint venture formations with a formation date on or after January 1, 2025, with early adoption permitted.  The Company early adopted the ASU effective September 30, 2023 on a prospective basis.\n \nNOTE 2.  \nACQUISITIONS\nThe Company continually evaluates potential acquisitions that either strategically fit with the Company’s existing portfolio or expand the Company’s portfolio into a new and attractive business area.  The Company has completed a number of acquisitions that have been accounted for as purchases and have resulted in the recognition of goodwill in the Company’s Consolidated and Combined Financial Statements.  This goodwill arises because the purchase prices for these businesses exceed the fair value of acquired identifiable net assets due to the purchase prices reflecting a number of factors including the future earnings and cash flow potential of these businesses, the multiple to earnings, cash flow and other factors at which similar businesses have been purchased by other acquirers, the competitive nature of the processes by which the Company acquired the businesses, the avoidance of the time and costs which would be required (and the associated risks that would be encountered) to enhance the Company’s existing product offerings to key target markets and enter into new and profitable businesses and the complementary strategic fit and resulting synergies these businesses bring to existing operations.\nThe Company makes an initial allocation of the purchase price at the date of acquisition based upon its understanding of the fair value of the acquired assets and assumed liabilities.  The Company obtains the information used for the purchase price allocation during due diligence and through other sources.  In the months after closing, as the Company obtains additional information about the acquired assets and liabilities, including through tangible and intangible asset appraisals, and learns more about the newly acquired business, it is able to refine the estimates of fair value and more accurately allocate the purchase price.  The fair values of acquired intangibles are determined based on estimates and assumptions that are deemed reasonable by the Company.  Significant assumptions include the discount rates and certain assumptions that form the basis of the forecasted results of the acquired business, including revenue, revenue growth rates, royalty rates and technology obsolescence rates.  These assumptions are forward looking and could be affected by future economic and market conditions.  The Company engages third-party valuation specialists who review the Company’s critical assumptions and calculations of the fair value of acquired intangible assets in connection with significant acquisitions.  Only facts and circumstances that existed as of the acquisition date are considered for subsequent adjustment. \nThe following briefly describes the Company’s acquisition activity for the three years ended December 31, 2024.\nOn October 4, 2024, the Company acquired the holding company that owned TraceGains (“TraceGains”) for a cash purchase price of approximately $\n349\n million, net of cash acquired (the “TraceGains Acquisition”).  TraceGains is a leading provider of cloud-based software solutions that enable connected data and digital workflow management to \n61\nTable of Contents\nhelp consumer brands meet increasingly stringent compliance and reporting regulations for food and beverage safety and traceability.  Its solutions enable consumer brands to efficiently track ingredient inputs, monitor supplier quality and develop new products with greater safety and increased velocity.  TraceGains is now part of the Company’s PQI segment.  The Company completed the TraceGains Acquisition using cash on hand.  The Company preliminarily recorded approximately $\n240\n million of goodwill related to the TraceGains Acquisition.  The Company will make appropriate adjustments to the purchase price allocation prior to completion of the one-year measurement period, if required.  \nDuring 2024, in addition to the TraceGains Acquisition, the Company acquired assets and businesses across \nthree\n transactions for total consideration of approximately $\n14\n million in cash, net of cash acquired.  The businesses acquired complement existing units of the Company's PQI segment.  The Company recorded an aggregate of approximately $\n3\n million of goodwill related to the acquisition of these businesses. \nThe Company had \nno\n acquisitions during the year ended December 31, 2023.\nDuring 2022\n,\n the Company acquired \nthree\n businesses for total consideration o\nf $\n55\n million \nin cash, net of cash acquired and recorded goodwill and intangible assets of \n$\n38\n million\n and \n$\n18\n million\n, respectively.  T\nhe businesses acquired complement existing units of the Company’s PQI segment. \nThe following summarizes the estimated fair values of the assets acquired and liabilities assumed at the date of acquisition for the individually significant acquisition of TraceGains in 2024 discussed above.  All of the other 2024 acquisitions were not material in the aggregate.\n($ in millions)\nTraceGains\nTrade accounts receivable\n$\n5\n \nIntangible assets - trade names\n5\n \nIntangible assets - developed technology\n86\n \nIntangible assets - customer relationships\n55\n \nGoodwill\n240\n \nDeferred revenue\n(\n18\n)\nDeferred tax liabilities\n(\n21\n)\nOther assets and liabilities, net\n(\n3\n)\nNet assets acquired\n$\n349\n \nNet cash consideration\n$\n349\n \nThe weighted-average amortization periods for definite-lived intangible assets acquired in 2024 are \n15\n years for customer relationships and \n10\n years for developed technology.  The weighted-average amortization period for definite-lived intangible assets acquired in 2024 is \n12\n years.  Trade names acquired during 2024 have an indefinite life.\nTransaction-related costs for the TraceGains Acquisition were $\n4\n million for the year ended December 31, 2024.  Transaction-related costs and acquisition-related fair value adjustments attributable to other acquisitions were not material for the years ended December 31, 2023 or \n2022\n.\nPro Forma Financial Information\nPro forma financial information for these acquisitions has not been presented because the acquisitions were not material to the Company’s Consolidated Statements of Earnings.  See Note 9 for goodwill and intangible assets acquired.\nNOTE 3.  \nCAPITAL STOCK AND NET EARNINGS PER COMMON SHARE \nCapital Stock\nUnder Veralto’s amended and restated certificate of incorporation, as of December 31, 2024, Veralto’s authorized capital stock consists of \n1.0\n billion common shares with par value $\n0.01\n per share and \n15\n million preferred shares with par value $\n0.01\n per share.  \nOn September 29, 2023, the \n100\n shares of Veralto common stock held by Danaher were recapitalized into \n246,291,342\n shares of Veralto common stock held by Danaher.  On September 30, 2023, Danaher distributed all of Veralto’s issued and outstanding common stock to Danaher’s stockholders.\n \nNo\n preferred shares were issued or outstanding on December 31, 2024.  Each share of Veralto common stock entitles the holder \n62\nTable of Contents\nto \none\n vote on all matters to be voted upon by common stockholders.  Veralto’s Board of Directors (the “Board”) is authorized to issue shares of preferred stock in one or more series and has discretion to determine the rights, preferences, privileges and restrictions, including voting rights, dividend rights, conversion rights, redemption privileges and liquidation preferences, of each series of preferred stock.  The Board’s authority to issue preferred stock with voting rights or conversion rights that, if exercised, could adversely affect the voting power of the holders of common stock, could potentially discourage attempts by third parties to obtain control of Veralto through certain types of takeover practices.\nFollowing the Separation, the Company began paying a regular quarterly dividend during the first quarter of 2024.  Aggregate cash payments for the four quarterly dividends paid to shareholders during 2024 were \n$\n89\n million and were recorded as dividends to shareholders in the Consolidated and Combined Statements of Changes in Equity and the Consolidated and Combined Statements of Cash Flows.\nOn \nDecember 19, 2024\n, the Company’s board of directors authorized a quarterly dividen\nd of $\n0.11\n p\ner share of Company common stock payable on\n January 31, 2025\n to holders of record at the close of business on\n December 31, 2024.\nEarnings per Common Share\nBasic net earnings per share (“EPS”) is calculated by dividing net earnings by the weighted average number of shares of common stock outstanding for the applicable period.  Diluted EPS is computed based on the weighted average number of common shares outstanding increased by the number of additional shares that would have been outstanding had the potentially dilutive common shares been issued and reduced by the number of shares the Company could have repurchased with the proceeds from the issuance of the potentially dilutive shares.\nThe Company was incorporated on October 26, 2022; accordingly, the Company had \nno\n shares or common equivalent shares outstanding prior to that date.  The total number of shares outstanding immediately after the recapitalization described above was \n246.3\n million and is utilized for the calculation of both basic and diluted EPS for all periods prior to the Separation.\nInformation related to the calculation of net earnings per common share for the years ended December 31 is summarized as follows:\n($ and shares in millions, except per share amounts)\n2024\n2023\n2022\nNumerator:\nNet earnings\n$\n833\n \n$\n839\n \n$\n845\n \nDenominator:\nWeighted average common shares outstanding used in Basic EPS\n247.3\n \n246.4\n \n246.3\n \nIncremental shares from assumed exercise of dilutive options and vesting of dilutive RSUs and PSUs\n2.3\n \n0.4\n \n—\n \nWeighted average common shares outstanding used in Diluted EPS\n249.6\n \n246.8\n \n246.3\n \nBasic EPS\n$\n3.37\n \n$\n3.41\n \n$\n3.43\n \nDiluted EPS\n$\n3.34\n \n$\n3.40\n \n$\n3.43\n \n63\nTable of Contents\nNOTE 4.  \nREVENUE \nThe following table presents the Company’s revenues disaggregated by geographical region and revenue type.  Sales taxes and other usage-based taxes collected from customers are excluded from revenues.  \n($ in millions)\nWater Quality\nProduct Quality & Innovation\nTotal\nYear ended December 31, 2024:\nGeographical region:\nNorth America\n(a)\n$\n1,804\n \n$\n689\n \n$\n2,493\n \nWestern Europe\n546\n \n603\n \n1,149\n \nOther developed markets\n65\n \n50\n \n115\n \nHigh-growth markets\n(b)\n723\n \n713\n \n1,436\n \nTotal\n$\n3,138\n \n$\n2,055\n \n$\n5,193\n \nRevenue type:\nRecurring\n$\n1,846\n \n$\n1,303\n \n$\n3,149\n \nNonrecurring\n1,292\n \n752\n \n2,044\n \nTotal\n$\n3,138\n \n$\n2,055\n \n$\n5,193\n \nYear ended December 31, 2023:\nGeographical region:\nNorth America\n(a)\n$\n1,694\n \n$\n659\n \n$\n2,353\n \nWestern Europe\n536\n \n584\n \n1,120\n \nOther developed markets\n65\n \n53\n \n118\n \nHigh-growth markets\n(b)\n744\n \n686\n \n1,430\n \nTotal\n$\n3,039\n \n$\n1,982\n \n$\n5,021\n \nRevenue type:\nRecurring\n$\n1,727\n \n$\n1,227\n \n$\n2,954\n \nNonrecurring\n1,312\n \n755\n \n2,067\n \nTotal\n$\n3,039\n \n$\n1,982\n \n$\n5,021\n \nYear ended December 31, 2022:\nGeographical region:\nNorth America \n(a)\n$\n1,590\n \n$\n670\n \n$\n2,260\n \nWestern Europe\n500\n \n559\n \n1,059\n \nOther developed markets\n67\n \n56\n \n123\n \nHigh-growth markets \n(b)\n730\n \n698\n \n1,428\n \nTotal\n$\n2,887\n \n$\n1,983\n \n$\n4,870\n \nRevenue type:\nRecurring\n$\n1,663\n \n$\n1,196\n \n$\n2,859\n \nNonrecurring\n1,224\n \n787\n \n2,011\n \nTotal\n$\n2,887\n \n$\n1,983\n \n$\n4,870\n \n(a) \nThe Company defines North America as the United States and Canada.\n(b) \nThe Company defines high-growth markets as developing markets of the world which include Asia (with the exception of Japan, Australia and New Zealand), Latin America (including Mexico), the Middle East, Eastern Europe and Africa.  The Company defines developed markets as all markets of the world that are not high-growth markets.\n \n64\nTable of Contents\nThe Company sells equipment to customers as well as consumables and services, some of which customers purchase on a recurring basis.  Consumables sold for use with the equipment sold by the Company are typically critical to the use of the equipment and are typically used on a one-time or limited basis, requiring frequent replacement in the customer’s operating cycle.  Examples of these consumables include chemistries for water testing instruments and cartridges for marking and coding equipment.  Additionally, some of the Company’s consumables are used on a standalone basis, such as water treatment solutions.  The Company separates its goods and services between those typically sold to a customer on a recurring basis and those typically sold to a customer on a nonrecurring basis.  Recurring revenue includes revenue from consumables, services, spare parts and OTLs.  Nonrecurring revenue includes revenue from equipment and STLs.  OTLs and STLs are included in the above revenue amounts.  For the years ended December 31, 2024, 2023 and 2022, lease revenue was $\n82\n million, $\n86\n million and $\n69\n million, respectively.  Service and software revenue was immaterial for all periods presented.  Software revenues for point-in-time licenses are nonrecurring while revenues for Software-as-a-Service and over time licenses are recurring.\nRemaining Performance Obligations\nRemaining performance obligations represent the aggregate transaction price allocated to performance obligations with an original contract term greater than one year which are fully or partially unsatisfied at the end of the period.  Remaining performance obligations include noncancelable purchase orders, the non-lease portion of minimum purchase commitments under long-term consumable supply arrangements, extended warranty and service and other long-term contracts.  These remaining performance obligations do not include revenue from contracts with customers with an original term of one year or less, revenue from long-term consumable supply arrangements with no minimum purchase requirements or revenue expected from purchases made in excess of the minimum purchase requirements or revenue from equipment leased to customers.  While the remaining performance obligation disclosure is similar in concept to backlog, the definition of remaining performance obligations excludes leases and contracts that provide the customer with the right to cancel or terminate for convenience with no substantial penalty, even if historical experience indicates the likelihood of cancellation or termination is remote.  Additionally, the Company has elected to exclude contracts with customers with an original term of one year or less from remaining performance obligations while these contracts are included within backlog.\nAs of December 31, 2024, the aggregate amount of the transaction price allocated to remaining performance obligations was approximately $\n293\n million.  The Company expects to recognize revenue on approximately \n41\n% of the remaining performance obligations over the next \n12\n months, \n32\n% over the subsequent \n12\n months, and the remainder recognized thereafter.\nContract Liabilities\nThe Company often receives cash payments from customers in advance of the Company’s performance resulting in contract liabilities that are classified as either current or long-term in the Consolidated Balance Sheets based on the timing of when the Company expects to recognize revenue.  As of December 31, 2024 and 2023, contract liabilities were approximately $\n254\n million and $\n223\n million, respectively, and are included within accrued expenses and other liabilities and other long-term liabilities in the accompanying Consolidated Balance Sheets.  Revenue recognized during the years ended December 31, 2024 and 2023 that was included in the opening contract liability balance was approximately $\n196\n million and $\n187\n million, respectively.\nNOTE 5.  \nSEGMENT INFORMATION \nThe Company operates and reports its results in \ntwo\n separate business segments consisting of the Water Quality and Product Quality & Innovation segments.  \nThe Company’s Water Quality segment provides proprietary precision instrumentation, consumables, software, services and advanced water treatment technologies to help measure, analyze and treat the world’s water in municipal, industrial, commercial, residential, research and natural resource applications. \nThe Company’s Product Quality & Innovation segment provides equipment, consumables, software and services for various marking and coding, traceability, printing, packaging design and quality management, packaging converting and color and appearance management applications for consumer packaged goods and industrial products.\n65\nTable of Contents\nResources are allocated and performance is assessed by the President & Chief Executive Officer (CEO), whom the Company has determined to be the Chief Operating Decision Maker (“CODM”).  The CODM evaluates the performance of its segments and allocates resources to them based on operating profit.  The CODM also compares actual results to expectations in assessing performance of the segments.  Operating profit represents total revenues less operating expenses, excluding nonoperating income and expense and income taxes.  Operating profit amounts in the Other segment consist of unallocated corporate costs and other costs not considered part of management’s evaluation of reportable segment operating performance. \nThe identifiable assets by segment are those used in each segment’s operations.  Intersegment amounts are not significant and are eliminated to arrive at combined totals. \nDetailed segment data for the years ended December 31 is as follows:\n($ in millions)\n2024\n2023\n2022\nSales:\nWater Quality\n$\n3,138\n \n$\n3,039\n \n$\n2,887\n \nProduct Quality & Innovation\n2,055\n \n1,982\n \n1,983\n \nTotal\n$\n5,193\n \n$\n5,021\n \n$\n4,870\n \nOperating profit:\nWater Quality\n$\n768\n \n$\n730\n \n$\n668\n \nProduct Quality & Innovation\n529\n \n472\n \n488\n \nOther\n(\n89\n)\n(\n62\n)\n(\n44\n)\nTotal\n$\n1,208\n \n$\n1,140\n \n$\n1,112\n \nIdentifiable segment assets:\nWater Quality\n$\n2,450\n \n$\n2,508\n \n$\n2,544\n \nProduct Quality & Innovation\n2,657\n \n2,289\n \n2,281\n \nOther\n1,299\n \n896\n \n—\n \nTotal\n$\n6,406\n \n$\n5,693\n \n$\n4,825\n \nDepreciation and amortization of intangible assets:\nWater Quality\n$\n41\n \n$\n45\n \n$\n46\n \nProduct Quality & Innovation\n36\n \n42\n \n44\n \nOther\n1\n \n—\n \n—\n \nTotal\n$\n78\n \n$\n87\n \n$\n90\n \nCapital expenditures, gross:\nWater Quality\n$\n36\n \n$\n29\n \n$\n25\n \nProduct Quality & Innovation\n17\n \n17\n \n9\n \nOther\n2\n \n8\n \n—\n \nTotal\n$\n55\n \n$\n54\n \n$\n34\n \n66\nTable of Contents\nA reconciliation of total segment sales to total segment operating profit and of total segment operating profit to total consolidated and combined earnings before income taxes, for the years ended December 31 is as follows:\n2024\n($ in millions)\nWater Quality\nProduct Quality & Innovation\nOther\nTotal\nSales\n$\n3,138\n \n$\n2,055\n \n$\n—\n \n$\n5,193\n \nLess: other segment items\n(\n2,370\n)\n(\n1,526\n)\n(\n89\n)\n(\n3,985\n)\nSegment operating profit\n$\n768\n \n$\n529\n \n$\n(\n89\n)\n$\n1,208\n \nOther expense, net\n(\n9\n)\nInterest expense, net\n(\n113\n)\nEarnings before income taxes\n$\n1,086\n \n2023\n($ in millions)\nWater Quality\nProduct Quality & Innovation\nOther\nTotal\nSales\n$\n3,039\n \n$\n1,982\n \n$\n—\n \n$\n5,021\n \nLess: other segment items\n(\n2,309\n)\n(\n1,510\n)\n(\n62\n)\n(\n3,881\n)\nSegment operating profit\n$\n730\n \n$\n472\n \n$\n(\n62\n)\n$\n1,140\n \nOther expense, net\n(\n14\n)\nInterest expense, net\n(\n30\n)\nEarnings before income taxes\n$\n1,096\n \n2022\n($ in millions)\nWater Quality\nProduct Quality & Innovation\nOther\nTotal\nSales\n$\n2,887\n \n$\n1,983\n \n$\n—\n \n$\n4,870\n \nLess: other segment items\n(\n2,219\n)\n(\n1,495\n)\n(\n44\n)\n(\n3,758\n)\nSegment operating profit\n$\n668\n \n$\n488\n \n$\n(\n44\n)\n$\n1,112\n \nOther income, net\n1\n \nEarnings before income taxes\n$\n1,113\n \nOperations in Geographical Areas:\nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales:\nUnited States\n$\n2,312\n \n$\n2,177\n \n$\n2,094\n \nChina\n334\n \n356\n \n395\n \nGermany\n266\n \n257\n \n251\n \nAll other (each country individually less than \n5\n% of total sales)\n2,281\n \n2,231\n \n2,130\n \nTotal\n$\n5,193\n \n$\n5,021\n \n$\n4,870\n \nProperty, plant and equipment, net:\nUnited States\n$\n200\n \n$\n179\n \n$\n168\n \nUnited Kingdom\n16\n \n14\n \n15\n \nGermany\n24\n \n23\n \n21\n \nAll other (each country individually less than \n5\n% of total property, plant and equipment, net)\n28\n \n46\n \n43\n \nTotal\n$\n268\n \n$\n262\n \n$\n247\n \n67\nTable of Contents\nNOTE 6.  \nINCOME TAXES \nPrior to the Separation, the Company’s operating results were included in Danaher’s various consolidated U.S. federal and certain state income tax returns, as well as certain foreign returns.  For periods prior to the Separation, the Company’s Consolidated and Combined Financial Statements reflect income tax expense and deferred tax balances as if the Company had filed tax returns on a standalone basis separate from Danaher.  The separate return method applies the accounting guidance for income taxes to the standalone financial statements as if the Company was a separate taxpayer and a standalone enterprise for periods prior to the Separation. \nEarnings from operations before income taxes for the years ended December 31 were as follows:\n($ in millions)\n2024\n2023\n2022\nUnited States\n$\n555\n \n$\n484\n \n$\n528\n \nNon-U.S.\n531\n \n612\n \n585\n \nTotal\n$\n1,086\n \n$\n1,096\n \n$\n1,113\n \nThe provision for income taxes from operations for the years ended December 31 were as follows:\n($ in millions)\n2024\n2023\n2022\nCurrent:\nFederal U.S.\n$\n116\n \n$\n86\n \n$\n107\n \nNon-U.S.\n184\n \n169\n \n177\n \nState and local\n27\n \n27\n \n28\n \nDeferred:\nFederal U.S.\n(\n45\n)\n(\n19\n)\n(\n22\n)\nNon-U.S.\n(\n29\n)\n(\n4\n)\n(\n17\n)\nState and local\n—\n \n(\n2\n)\n(\n5\n)\nIncome tax provision\n$\n253\n \n$\n257\n \n$\n268\n \nThe Company has earnings that have been taxed previously in the United States (“PTEP”) as of December 31, 2024 which can be repatriated subject to foreign withholding and U.S. state income taxes.  The Company intends to permanently reinvest its earnings in non-U.S. operations except to the extent of PTEP.  The potential tax implications of repatriating unremitted earnings are driven by the facts at the time of distribution.  The incremental cost to repatriate these earnings is not expected to be material.\nThe effective income tax rate from operations for the years ended December 31 varies from the U.S. statutory federal income tax rate as follows:\n \nPercentage of Pretax Earnings\n \n2024\n2023\n2022\nStatutory federal income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nIncrease (decrease) in tax rate resulting from:\nState income taxes (net of Federal income tax benefit)\n2.0\n \n1.9\n \n1.7\n \nNon-U.S. rate differential\n2.1\n \n3.5\n \n2.7\n \nUS Taxation of Foreign Earnings\n(\n4.2\n)\n(\n2.1\n)\n(\n1.5\n)\nChange in uncertain tax positions\n3.2\n \n—\n \n1.0\n \nR&D and other tax credits\n(\n0.9\n)\n(\n1.3\n)\n(\n0.3\n)\nOther\n0.7\n \n1.0\n \n0.1\n \nNet excess tax benefits from stock-based compensation\n(\n0.6\n)\n(\n0.6\n)\n(\n0.6\n)\nEffective income tax rate\n23.3\n \n%\n23.4\n \n%\n24.1\n \n%\n68\nTable of Contents\nThe Company’s effective tax rate for 2024, 2023 and 2022 differs from the U.S. federal statutory rate of 21.0%, due principally to the Company’s earnings outside the United States that are taxed at rates different than the U.S. federal statutory rate, state taxes, as well as the impact of the following: \n•\nThe effective tax rate of \n23.3\n% in 2024 includes net tax provisions primarily related to changes in estimates associated with prior period uncertain tax positions and audit settlements partially offset by excess tax benefits from stock-based compensation.  This increased the reported rate on a net basis by \n0.6\n%.  It also includes a \n0.3\n% unfavorable impact of a non-deductible loss on the sale of a product line.\n•\nThe effective tax rate of \n23.4\n% in 2023 includes net tax benefits primarily related to excess tax benefits from stock-based compensation.  This decreased the reported rate on a net basis by \n1.0\n%.\n•\nThe effective tax rate of \n24.1\n% in 2022 includes net tax benefits primarily related to excess tax benefits from stock-based compensation, partially offset by changes in estimates associated with prior period uncertain tax positions and audit settlements.  These items decreased the reported rate on a net basis by \n0.4\n%. \nSignificant components of the Company’s deferred tax assets and liabilities from operations at the end of each fiscal year were as follows:  \n($ in millions)\n2024\n2023\nDeferred tax assets:\nAllowance for credit losses\n$\n6\n \n$\n6\n \nInventories\n18\n \n18\n \nEmployee benefit plans\n8\n \n7\n \nOther accruals and prepayments\n112\n \n79\n \nStock-based compensation expense\n17\n \n14\n \nOperating lease liabilities\n37\n \n31\n \nCapitalized research and development costs\n86\n \n46\n \nTax credit, operating loss and capital loss carryforwards\n57\n \n34\n \nNet Investment Hedge\n—\n \n4\n \nValuation allowances\n(\n32\n)\n(\n29\n)\nTotal deferred tax assets\n309\n \n210\n \nDeferred tax liabilities:\nDepreciation\n(\n13\n)\n(\n12\n)\nOperating lease right-of-use assets\n(\n35\n)\n(\n29\n)\nGoodwill and other intangible assets\n(\n270\n)\n(\n242\n)\nNet investment hedge\n(\n3\n)\n—\n \nTotal deferred tax liability\n(\n321\n)\n(\n283\n)\nNet deferred tax liability\n$\n(\n12\n)\n$\n(\n73\n)\nDeferred tax assets and deferred tax liabilities are included in other assets and other long-term liabilities, respectively, in the accompanying Consolidated Balance Sheets. \nA valuation allowance is recorded on certain deferred tax assets if it has been determined it is more likely than not that all or a portion of these assets will not be realized.  The valuation allowances in 2024 and 2023 are primarily attributable to foreign net operating loss carryforwards. \nAs of December 31, 2024, our U.S. and non-U.S. net operating loss carryforwards totaled $\n224\n million, of which $\n96\n million is related to federal and state net operating loss carryforwards, and $\n128\n million related to non-U.S. net operating loss carryforwards.  Certain of these losses can be carried forward indefinitely and others can be carried forward to various dates from 2025 through 2044. \nThe Company recognizes tax benefits from uncertain tax positions only if, in its assessment, it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position.  The tax benefits recognized from such positions are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement.  Judgment is required in evaluating tax \n69\nTable of Contents\npositions and determining income tax provisions.  The Company re-evaluates the technical merits of its tax positions and may recognize an uncertain tax benefit in certain circumstances, including when: (i) a tax audit is completed; (ii) applicable tax laws change, including a tax case ruling or legislative guidance; or (iii) the applicable statute of limitations expires.\nAs of December 31, 2024, tax benefits totaled $\n156\n million ($\n116\n million, net of the impact of $\n66\n million of indirect tax benefits offset by $\n26\n million associated with potential interest and penalties).  As of December 31, 2023, gross unrecognized tax benefits totaled $\n97\n million ($\n82\n million, net of the impact of $\n34\n million of indirect tax benefits offset by $\n19\n million associated with potential interest and penalties).  The Company recognized approximately $\n7\n million of net tax expense from potential interest and penalties during 2024, $\n1\n million of net tax benefits from the reversal of potential interest and penalties during 2023, and $\n2\n million of net tax expense from potential interest and penalties during 2022 associated with uncertain tax positions.  To the extent taxes are not assessed with respect to uncertain tax positions, substantially all amounts accrued (including interest and penalties and net of indirect offsets) will be reduced and reflected as a reduction of the overall income tax provision.  Unrecognized tax benefits and associated accrued interest and penalties are included in our income tax provision.  Unrecognized tax benefits and associated accrued interest and penalties are included in taxes, income and other accrued expenses as detailed in Note 11.\nA reconciliation of the beginning and ending amount of unrecognized tax benefits, excluding amounts accrued for potential interest and penalties, is as follows:\n($ in millions)\n2024\n2023\n2022\nUnrecognized tax benefits, beginning of year\n$\n97\n \n$\n94\n \n$\n81\n \nAdditions based on tax positions related to the current year\n46\n \n—\n \n8\n \nAdditions for tax positions of prior years\n15\n \n2\n \n11\n \nReductions for tax positions of prior years\n—\n \n2\n \n—\n \nAcquisitions, divestitures and other\n—\n \n4\n \n—\n \nStatute of limitations expirations\n(\n1\n)\n(\n1\n)\n(\n1\n)\nSettlements\n—\n \n(\n4\n)\n(\n4\n)\nEffect of foreign currency translation\n(\n1\n)\n—\n \n(\n1\n)\nUnrecognized tax benefits, end of year\n$\n156\n \n$\n97\n \n$\n94\n \nThe Company considers many factors when evaluating and estimating its tax positions and the impact on income tax expense, which may require periodic adjustments, and which may not accurately anticipate actual outcomes.  It is reasonably possible that the amount of the unrecognized benefit with respect to certain of the Company's unrecognized tax positions will significantly increase or decrease within the next twelve months.  However, based on the uncertainties associated with finalizing audits with the relevant tax authorities including formal legal proceedings, it is not possible to reasonably estimate the impact of any such change.\nThe Company conducts business globally, and the Former Parent filed numerous consolidated and separate income tax returns in the U.S. federal and state and non-U.S. jurisdictions.  The non-U.S. countries in which the Company has a significant presence include Belgium, Brazil, Canada, China, Germany, the Netherlands and the United Kingdom.  Excluding these non-U.S. jurisdictions, the Company believes that a change in the statutory tax rate of any individual non-U.S. country would not have a material effect on the Company’s Consolidated and Combined Financial Statements given the geographic dispersion of the Company’s income.\nThe Company is routinely examined by various domestic and international taxing authorities.  In connection with the Separation, the Company entered into certain agreements with Danaher, including a tax matters agreement.  The tax matters agreement distinguishes between the treatment of tax matters for “Joint” filings compared to “Separate” filings prior to the Separation.  “Joint” filings involve legal entities, such as those in the United States, that include operations from both Danaher and the Company.  By contrast, “Separate” filings involve certain entities (primarily outside of the United States) that exclusively include either Danaher’s or the Company’s operations, respectively.  In accordance with the tax matters agreement, Danaher is liable for and has indemnified the Company against all income tax liabilities involving “Joint” filings for periods prior to the Separation.  The Company remains liable for certain pre-Separation income tax liabilities including those related to the Company’s “Separate” filings. \nPursuant to U.S. tax law, the Company’s initial U.S. federal income tax return was filed during October 2024 for the short taxable year September 30, 2023 through December 31, 2023.  The Company expects to file its first full year \n70\nTable of Contents\nU.S. federal income tax return for 2024 with the Internal Revenue Service (“IRS”) during 2025.  The IRS has not yet begun an examination of the Company.  The Company’s operations in certain U.S. states and foreign jurisdictions remain subject to routine examination.\nNOTE 7.  \nNONOPERATING INCOME (EXPENSE) \nThe following sets forth the components of the Company’s other income (expense), net:\n($ in millions)\n2024\n2023\n2022\nOther components of net periodic benefit costs \n$\n1\n \n$\n1\n \n$\n1\n \nUnrealized investment losses\n—\n \n(\n15\n)\n—\n \nLoss on product line dispositions, net\n(\n10\n)\n—\n \n—\n \nTotal other income (expense), net\n$\n(\n9\n)\n$\n(\n14\n)\n$\n1\n \nOther Components of Net Periodic Benefit Costs\nThe Company disaggregates the service cost component of net periodic benefit costs of noncontributory defined benefit pension plans and other postretirement employee benefit plans and presents the other components of net periodic benefit cost in other income (expense), net.  These other components of net period benefit costs include the assumed rate of return on plan assets, partially offset by amortization of actuarial losses and interest.\nLoss on Product Line Dispositions, net\nDuring 2024, the Company divested \ntwo\n product lines and recorded a \n$\n10\n million\n net loss associated with the sales that is presented in other income (expense), net.  The divestiture of these product lines were recorded in the Water Quality segment.  The divestitures did not represent a strategic shift with a major effect on the Company’s operations and financial results and therefore are not reported as discontinued operations.\nImpairment of Equity Method Investments\nDuring 2023, the Company recorded an impairment of $\n15\n million related to an equity method investment, which is reflected in other income (expense), net.\n \nNOTE 8.  \nLEASES \nThe Company has operating leases for office space, warehouses, distribution centers, research and development facilities, manufacturing locations and certain equipment, primarily automobiles.  Many leases include \none\n or more options to renew, some of which include options to extend the leases for up to \n15\n years, and some leases include options to terminate the leases within \n30\n days.  In certain of the Company’s lease agreements, the rental payments are adjusted periodically to reflect actual charges incurred for common area maintenance, utilities, inflation and/or changes in other indexes.  The Company’s finance leases were not material as of December 31, 2024 and 2023.  Right-of-use (“ROU”) assets arising from finance leases are included in property, plant and equipment, net and the liabilities are included in accrued expenses and other liabilities and other long-term liabilities in the accompanying Consolidated Balance Sheets.\n71\nThe Consolidated and Combined Financial Statements include the following amounts related to operating leases where the Company is the lessee:\n($ in millions)\n2024\n2023\n2022\nConsolidated and Combined Statements of Earnings\nFixed operating lease expense \n(a)\n$\n51\n \n$\n43\n \n$\n40\n \nVariable operating lease expense\n18\n \n12\n \n13\n \nTotal operating lease expense\n$\n69\n \n$\n55\n \n$\n53\n \nConsolidated and Combined Statements of Cash Flows\nCash paid for amounts included in the measurement of operating lease liabilities\n$\n49\n \n$\n41\n \n$\n40\n \nROU assets obtained in exchange for operating lease obligations\n47\n \n52\n \n24\n \nConsolidated Balance Sheets\nDecember 31, 2024\nDecember 31, 2023\nLease Assets and Liabilities\nClassification\nOperating lease ROU assets\nOther long-term assets\n$\n159\n \n$\n144\n \nOperating lease liabilities - current\nAccrued expenses and other liabilities\n$\n39\n \n$\n33\n \nOperating lease liabilities - long-term\nOther long-term liabilities\n129\n \n115\n \nTotal operating lease liabilities\n$\n168\n \n$\n148\n \nWeighted average remaining lease term\n7\n years\n8\n years\nWeighted average discount rate\n4.6\n \n%\n4.1\n \n%\n(a) \nIncludes short-term leases and sublease income, both of which were immaterial.\nThe following table presents the maturity of the Company’s operating lease liabilities as of December 31, 2024 ($ in millions):\n2025\n$\n45\n \n2026\n36\n \n2027\n27\n \n2028\n19\n \n2029\n15\n \nThereafter\n55\n \nTotal operating lease payments\n197\n \nLess: imputed interest\n(\n29\n)\nTotal operating lease liabilities\n$\n168\n \nAs of December 31, 2024, the Company had no additional significant operating or finance leases that had not yet commenced.\n72\nNOTE 9.  \nGOODWILL AND OTHER INTANGIBLE ASSETS \nAs discussed in Note 2, goodwill arises from the purchase price for acquired businesses exceeding the fair value of tangible and intangible assets acquired less assumed liabilities and noncontrolling interests.  Management assesses the goodwill of each of its reporting units for impairment at least annually at the beginning of the fourth quarter and as “triggering” events occur that indicate that it is more likely than not that an impairment exists.  The Company elected to bypass the optional qualitative goodwill assessment allowed by applicable accounting standards and performed a quantitative impairment test for all reporting units as this was determined to be the most effective method to assess for impairment across the reporting units.\nThe Company estimates the fair value of its reporting units using a market approach, based on current trading multiples of EBITDA for peer companies operating in businesses similar to each of the Company’s reporting units, in addition to recent market sale transactions of comparable companies.  In determining the estimated fair value of each reporting unit, the Company also applies a control premium to the trading multiples of EBITDA for peer companies.  If the estimated fair value of the reporting unit is less than its carrying value, the Company will impair the goodwill for the amount of the carrying value in excess of the fair value.\nAs of December 31, 2024, the Company had \nthree\n reporting units for goodwill impairment testing.  As of the date of the 2024 annual impairment test, the carrying value of the goodwill included in each individual reporting unit ranged from $\n548\n million to approximately $\n1.3\n billion.  \nNo\n goodwill impairment charges were recorded for the years ended December 31, 2024, 2023 and 2022 and no “triggering” events have occurred subsequent to the performance of the 2024 annual impairment test.  The factors used by management in its impairment analysis are inherently subject to uncertainty.  If actual results are not consistent with management’s estimates and assumptions, goodwill and other intangible assets may be overstated and a charge would need to be taken against net earnings.\nThe following is a rollforward of the Company’s goodwill by segment:  \n($ in millions)\nWater Quality\nProduct Quality & Innovation\nTotal\nBalance, January 1, 2023\n$\n1,277\n \n$\n1,199\n \n$\n2,476\n \nAdjustments due to finalization of purchase price allocations\n—\n \n2\n \n2\n \nForeign currency translation and other\n28\n \n27\n \n55\n \nBalance, December 31, 2023\n1,305\n \n1,228\n \n2,533\n \nAttributable to 2024 acquisitions\n—\n \n243\n \n243\n \nForeign currency translation and other\n(\n49\n)\n(\n34\n)\n(\n83\n)\nBalance, December 31, 2024\n$\n1,256\n \n$\n1,437\n \n$\n2,693\n \nFinite-lived intangible assets are amortized over their legal or estimated useful life.  \nThe following summarizes the gross carrying value and accumulated amortization for each major category of intangible assets as of December 31: \n2024\n2023\n($ in millions)\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nFinite-lived intangibles:\nCustomer relationships\n$\n631\n \n$\n(\n510\n)\n$\n595\n \n$\n(\n502\n)\nPatents, technology and other intangibles\n355\n \n(\n246\n)\n277\n \n(\n246\n)\nTotal finite-lived intangibles\n986\n \n(\n756\n)\n872\n \n(\n748\n)\nIndefinite-lived intangibles:\nTrademarks and trade names\n305\n \n— \n303\n \n— \nTotal intangibles\n$\n1,291\n \n$\n(\n756\n)\n$\n1,175\n \n$\n(\n748\n)\nDuring 2024 and 2022, the Company acquired finite-lived intangible assets, consisting primarily of trade names, developed technology and customer relationships.  Refer to Note 2 for additional information on the intangible assets acquired.  There were no such acquisitions during 2023.\n73\nThe Company reviews identified intangible assets for impairment whenever events or changes in circumstances indicate that the related carrying amounts may not be recoverable.  Indefinite-lived intangibles are subject to impairment testing at least annually or more frequently if events or changes in circumstances indicate that potential impairment exists.  The Company identified impairment triggers during the second and third quarters of 2023 and the second quarter of 2022 which resulted in the impairment charges of certain long-lived assets, including technology, customer relationships and trade names.  In 2023, and 2022, the Company recorded impairment charges totaling $\n12\n million, and $\n9\n million, respectively, related to these long-lived assets in selling, general and administrative expenses in the Consolidated and Combined Statements of Earnings.  There were no impairment charges recorded during 2024. \nTotal intangible amortization expense in 2024, 2023 and 2022 was $\n38\n million, $\n48\n million and $\n50\n million, respectively.  Based on the intangible assets recorded as of December 31, 2024, amortization expense is estimated to be approximately $\n35\n million during 2025, $\n34\n million during 2026, $\n30\n million during 2027, $\n26\n million during 2028 and $\n24\n million during 2029\n.\n74\nNOTE 10.  \nFAIR VALUE MEASUREMENTS \nAccounting standards define fair value based on an exit price model, establish a framework for measuring fair value for assets and liabilities required to be carried at fair value and provide for certain disclosures related to the valuation methods used within the valuation hierarchy as established within the accounting standards.  This hierarchy prioritizes the inputs into three broad levels as follows. \n•\nLevel 1 inputs are quoted prices (unadjusted) in active markets for identical assets or liabilities. \n•\nLevel 2 inputs are quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets in markets that are not active, or other observable characteristics for the asset or liability, including interest rates, yield curves and credit risks, or inputs that are derived principally from, or corroborated by, observable market data through correlation. \n•\nLevel 3 inputs are unobservable inputs based on the Company’s assumptions.  A financial asset or liability’s classification within the hierarchy is determined based on the lowest level input that is significant to the fair value measurement in its entirety.\nA summary of financial liabilities that are measured at fair value on a recurring basis were as follows:\n($ in millions)\nQuoted Prices in Active Market (Level 1)\nSignificant Other Observable Inputs (Level 2)\nSignificant Unobservable Inputs (Level 3)\nTotal\nDecember 31, 2024\nDeferred compensation liabilities\n$\n32\n \n$\n—\n \n$\n—\n \n$\n32\n \nDecember 31, 2023\nDeferred compensation liabilities\n$\n23\n \n$\n—\n \n$\n—\n \n$\n23\n \nCertain management employees participate in the Company’s nonqualified deferred compensation programs, which permits such employees to defer a portion of their compensation, on a pretax basis, until after their termination of employment.  All amounts deferred under such plans are unfunded, unsecured obligations and are presented as a component of the compensation and benefits accrual included in other long-term liabilities in the accompanying Consolidated Balance Sheets.  Participants may choose among alternative earning rates for the amounts they defer, which are primarily based on investment options within the Company’s defined contribution plans for the benefit of U.S. employees (“401(k) Programs”) (except that the earnings rates for amounts contributed unilaterally by the Company are entirely based on changes in the value of the Company’s common stock).  Changes in the deferred compensation liability under these programs are recognized based on changes in the fair value of the participants’ accounts, which are based on the applicable earnings rates. \nFair Value of Financial Instruments\nThe carrying amounts and fair values of the Company’s other financial instruments as of December 31 were as follows:\n2024\n2023\n($ in millions)\nCarrying\nAmount\nFair Value\nCarrying\nAmount\nFair Value\nLong-term debt\n$\n2,599\n \n$\n2,638\n \n$\n2,629\n \n$\n2,710\n \nAs of December 31, 2024, long-term borrowings were categorized as Level 1.  The fair value of long-term borrowings was based on quoted market prices.  The difference between the fair value and the carrying amounts of long-term borrowings is attributable to changes in market interest rates and/or the Company’s credit ratings subsequent to the occurrence of the borrowing.  The fair values of borrowings with original maturities of one year or less, as well as cash and cash equivalents, trade accounts receivable, net and trade accounts payable generally approximate their carrying amounts due to the short-term maturities of these instruments.\nRefer to Note 14 for information related to the fair value of the Company sponsored defined benefit pension plan assets.\n75\nNOTE 11.  \nACCRUED EXPENSES AND OTHER LIABILITIES \nAccrued expenses and other liabilities as of December 31 were as follows:\n \n2024\n2023\n($ in millions)\nCurrent\nNoncurrent\nCurrent\nNoncurrent\nCompensation and benefits\n$\n244\n \n$\n29\n \n$\n184\n \n$\n44\n \nDeferred revenue\n237\n \n17\n \n208\n \n15\n \nTaxes, income and other\n77\n \n295\n \n139\n \n185\n \nOperating lease liabilities\n39\n \n129\n \n33\n \n115\n \nOther\n253\n \n47\n \n270\n \n51\n \nTotal\n$\n850\n \n$\n517\n \n$\n834\n \n$\n410\n \nOther category above primarily includes accruals related to sales and product allowances, pension and postretirement benefits, interest payable, dividends payable, and warranty reserves.\nNOTE 12.  \nFINANCING \nThe components of the Company’s debt as of December 31 were as follows ($ in millions):\nOutstanding Amount\nDescription and Aggregate Principal Amount\n2024\n2023\n5.50\n% senior unsecured notes due 9/18/2026 ($\n700\n million) (the “2026 Notes”)\n$\n697\n \n$\n696\n \n5.35\n% senior unsecured notes due 9/18/2028 ($\n700\n million) (the “2028 Notes”)\n696\n \n695\n \n4.15\n% senior unsecured notes due 9/19/2031 (€\n500\n million) (the “2031 Notes”)\n513\n \n546\n \n5.45\n% senior unsecured notes due 9/18/2033 ($\n700\n million) (the \"2033 Notes\")\n693\n \n692\n \nLong-term debt\n$\n2,599\n \n$\n2,629\n \nSenior Unsecured Notes\nIn September 2023, and in connection with the Separation, the Company issued approximately $\n2.1\n billion aggregate principal amount of USD senior unsecured notes in three series with maturity dates ranging from 2026 through 2033 (collectively, the “U.S. Dollar Notes”).  Additionally, the Company issued €\n500\n million principal amount of senior unsecured notes (“Euro Notes”) with a maturity date of 2031.\nInterest payments on the U.S. Dollar Notes are due semi-annually until maturity.  Interest payments on the Euro Notes are due annually until maturity.  In the event of a change in control and a related downgrade of the ratings of the U.S. Dollar Notes and Euro Notes (collectively, the \"Notes\") below investment grade, the indentures governing the Notes requires that the Company make an offer to each holder of the Notes to repurchase all or any part of that holder's notes at a repurchase price equal to \n101\n% of the aggregate principal amount of the Notes repurchased, plus any accrued and unpaid interest.  The indentures also include a limitation on liens incurred by the Company and its wholly owned U.S. subsidiaries.  The indentures do not restrict the Company or its subsidiaries from incurring indebtedness, nor does it require any financial covenants.  All the covenants are subject to a number of exceptions, limitations, and qualifications.\nUpon issuance, the Notes became guaranteed by Danaher.  Following the completion of the Separation on September 30, 2023, Danaher was automatically and unconditionally released and discharged from all obligations under its guarantees. \nThe Company recorded $\n24\n million of debt discounts and debt issuance costs related to the Notes.  Debt issuance costs are presented as a reduction of debt in the Consolidated Balance Sheets and are amortized as a component of interest expense over the term of the related debt.  Unamortized debt discounts and debt issuance costs totaled $\n19\n million and $\n24\n million as of December 31, 2024 and 2023, respectively. \nThe proceeds of the Notes were distributed to Danaher during September as partial consideration for the net assets contributed to Veralto in advance of the Separation on September 30, 2023.  \n76\nRegistration Rights Agreement\nIn connection with the issuance of the Notes, the Company entered into a registration rights agreement, pursuant to which the Company was obligated to use commercially reasonable efforts to file with the SEC, and cause to be declared effective, a registration statement with respect to an offer to exchange each series of Notes for registered notes (“Registered Notes”) with substantially identical terms (“Exchange Offer”).  Accordingly, on July 26, 2024, the Company filed a Form S-4 with the SEC (the “Registration Statement”), which Registration Statement was declared effective on August 5, 2024.  On August 5, 2024, the Company launched the Exchange Offer, which expired on September 3, 2024.  Substantially all Notes were tendered and exchanged for Registered Notes in the Exchange Offer.\nCredit Facility\nOn August 31, 2023, the Company entered into a credit agreement providing for a \nfive-year\n unsecured revolving credit facility in an aggregate committed amount of $\n1.5\n billion (the “Credit Facility”).  There were \nno\n outstanding amounts under the Credit Facility as of December 31, 2024.  The Credit Facility includes an alternative currency sublimit up to an amount equal to \n90\n% of the aggregate commitments and a $\n100\n million swingline sublimit and provides for the issuance of swing loans.\nBorrowings under the Credit Facility bear interest at the Company’s option as follows: (i) in the case of borrowings denominated in U.S. dollars, (1) Term Secured Overnight Financing Rate (“SOFR”) Loans (as defined in the Credit Agreement) bear interest at a variable rate equal to the Term SOFR (as defined in the Credit Agreement) plus the Applicable Rate (a margin of between \n79.5\n and \n130.0\n basis points, depending on the Company’s long-term debt credit rating); and (2) Base Rate Committed Loans and Swing Line Loans (each as defined in the Credit Agreement) bear interest at a variable rate equal to the highest of (a) the Federal funds rate (as published by the Federal Reserve Bank of New York from time to time) plus 1/2 of 1.0%, (b) Bank of America’s “prime rate” as publicly announced from time to time, (c) Term SOFR (based on one-month interest period plus \n1.0\n%) and (d) \n1.0\n%, plus in each case the Applicable Rate (a margin of between \n0.0\n to \n30.0\n basis points, depending on the Company’s long-term debt credit rating); and (ii) in the case of borrowings denominated in euros, Alternative Currency Loans (as defined in the Credit Agreement) bear interest at EURIBOR (as defined in the Credit Agreement) plus the Applicable Rate (a margin of between \n79.5\n and \n130.0\n basis points, depending on the Company’s long-term debt credit rating).  In addition, the Company is required to pay a per annum facility fee of between \n8.0\n and \n20.0\n basis points (depending on the Company’s long-term debt credit rating) based on the aggregate commitments under the Credit Facility, regardless of usage.  The Company’s current credit rating as of December 31, 2024 is Baa1/BBB and the associated facility fee is \n9.0\n basis points.\nThe Credit Facility contains affirmative and negative covenants customary to financings of this type that, among other things, limits the Company and its subsidiaries’ ability to incur additional liens and to make certain fundamental changes.  In addition, the Credit Facility contains a financial covenant that requires the Company to not exceed a maximum consolidated net leverage ratio of \n3.75\n:1.00 that will be tested quarterly.  The maximum consolidated net leverage ratio will be increased to \n4.25\n:1.00 for the \nfour\n consecutive full fiscal quarters immediately following the consummation of any material acquisition.  The Company intends to use the Credit Facility for liquidity support for the Company’s commercial paper programs and for general corporate purposes.  Outstanding commercial paper directly reduces borrowing capacity under the Credit Facility.  There were \nno\n amounts outstanding under the commercial paper program as of December 31, 2024.\nDebt issuance costs related to the credit facility were not material.\nOther\nThe Company’s minimum principal payments for the next five years are as follows ($ in millions):\n2025\n$\n—\n \n2026\n700\n \n2027\n—\n \n2028\n700\n \n2029\n—\n \nThereafter\n1,218\n \n77\nNOTE 13.  \nHEDGING TRANSACTIONS \nThe Company is neither a dealer nor a trader in derivative instruments.  The Company has generally accepted the exposure to transactional exchange rate movements without using derivative instruments to manage this risk.  The Company has issued foreign currency denominated long-term debt as a partial hedge of its net investment in foreign operations against adverse movements in exchange rates between the U.S. dollar and the euro.  This foreign currency denominated long-term debt issuance is designated and qualifies as a nonderivative hedging instrument.  Accordingly, the foreign currency translation of this debt instrument is recorded in accumulated other comprehensive income (loss), offsetting the foreign currency translation adjustment of the Company’s related net investment that is also recorded in accumulated other comprehensive income (loss).  This instrument matures in September 2031.\nThe following table summarizes the notional values as of December 31, 2024 and 2023 and pretax impact of changes in the fair values of instruments designated as net investment hedges in accumulated other comprehensive income (“OCI”) for the year then ended:\n($ in millions)\nNotional Amount Outstanding\nGain Recognized in OCI\nAmounts Reclassified from OCI\nYear ended December 31, 2024:\nNet investment hedges:\nForeign currency denominated debt\n$\n513\n \n$\n34\n \n$\n—\n \nYear ended December 31, 2023:\nNet investment hedges:\nForeign currency denominated debt\n$\n546\n \n$\n(\n19\n)\n$\n—\n \nGains or losses related to the net investment hedges are classified as foreign currency translation adjustments in the schedule of changes in OCI in Note 17, as these items are attributable to the Company’s hedges of its net investment in foreign operations. \nThe Company did not reclassify any other deferred gains or losses related to the net investment hedge from accumulated other comprehensive income (loss) to earnings during the years ended December 31, 2024 or December 31, 2023.  In addition, the Company did not have any ineffectiveness related to the net investment hedge during the years ended December 31, 2024 or December 31, 2023 and, should they arise, any ineffective portions of the hedge would be reclassified from accumulated other comprehensive income (loss) into earnings during the period of change.\nThe Company’s nonderivative debt instrument designated and qualifying as a net investment hedge, was classified in the Company’s Consolidated Balance Sheets within Long-term debt as of December 31, 2024 and 2023.\nNOTE 14.  \nPENSION AND OTHER POSTRETIREMENT EMPLOYEE BENEFIT PLANS \nCertain of the Company's employees participate in noncontributory defined benefit pension plans and under certain of these plans, benefit accruals continue.  In general, the Company’s policy is to fund these plans based on considerations relating to legal requirements, underlying asset returns, the plan’s funded status, the anticipated tax deductibility of the contribution, local practices, market conditions, interest rates and other factors.\n78\nThe following sets forth the funded status of the Company's plans as of the most recent actuarial valuations using measurement dates of December 31:\n($ in millions)\n2024\n2023\nChange in pension benefit obligation:\nBenefit obligation at beginning of year\n$\n(\n171\n)\n$\n(\n142\n)\nService cost\n(\n5\n)\n(\n5\n)\nInterest cost\n(\n4\n)\n(\n4\n)\nParticipant contributions\n(\n2\n)\n(\n2\n)\nPlan settlements and curtailments\n9\n \n—\n \nBenefits and other expenses paid\n5\n \n6\n \nActuarial (loss) gain\n(\n4\n)\n(\n14\n)\nForeign exchange rate impact and other\n10\n \n(\n10\n)\nBenefit obligation at end of year\n(\n162\n)\n(\n171\n)\nChange in plan assets:\nFair value of plan assets at beginning of year\n135\n \n124\n \nActual return on plan assets\n3\n \n1\n \nEmployer contributions\n6\n \n5\n \nParticipant contributions\n2\n \n2\n \nSettlements\n(\n7\n)\n—\n \nBenefits and other expenses paid\n(\n5\n)\n(\n6\n)\nForeign exchange rate impact\n(\n7\n)\n9\n \nFair value of plan assets at end of year\n127\n \n135\n \nFunded status\n$\n(\n35\n)\n$\n(\n36\n)\nThe largest contributor to the net actuarial loss affecting the benefit obligation in 2024 was a decrease in the 2024 discount rate compared to the prior period.  The largest contributor to the net actuarial loss affecting the benefit obligation in 2023 was a decrease in the 2023 discount rates compared to the prior period. \nProjected benefit obligation (“PBO”) and fair value of plan assets for pension plans and postretirement benefit plans with PBOs in excess of plan assets:\n($ in millions)\n2024\n2023\nProjected benefit obligation\n$\n162\n \n$\n171\n \nFair value of plan assets\n127\n \n135\n \nThe year-over-year change in the amounts above reflects the benefit plans with a PBO in excess of the fair value of plan assets.\nAccumulated benefit obligation (“ABO”) and fair value of plan assets for pension plans and postretirement benefit plans with ABOs in excess of plan assets:\n($ in millions)\n2024\n2023\nAccumulated benefit obligation\n$\n149\n \n$\n157\n \nFair value of plan assets\n127\n \n135\n \nThe year-over-year change in the amounts above reflects the benefit plans with an ABO in excess of the fair value of plan assets.\n79\nWeighted average assumptions used to determine benefit obligations at date of measurement:\n \n2024\n2023\nDiscount rate\n1.7\n \n%\n2.0\n \n%\nRate of compensation increase\n2.2\n \n%\n2.5\n \n%\nIn 2024, the medical trend rate used to determine the postretirement benefit obligation was \n7.7\n%.  The rate decreases gradually to an ultimate rate of \n4.0\n% by 2049 and remains at that level thereafter.  In 2023, the medical trend rate used to determine the postretirement benefit obligation was \n5.9\n%, gradually decreasing to an ultimate rate of \n4.0\n% by 2048 and remaining at that level thereafter.  The trend rate is a significant factor in determining the amounts reported.\nComponents of net periodic pension and postretirement benefit (cost):\n($ in millions)\n2024\n2023\nService cost\n$\n(\n5\n)\n$\n(\n5\n)\nInterest cost\n(\n4\n)\n(\n4\n)\nExpected return on plan assets\n4\n \n4\n \nAmortization of prior service credit\n1\n \n1\n \nAmortization of net loss\n—\n \n—\n \nSettlement and curtailment gain\n2\n \n—\n \nNet periodic pension cost\n$\n(\n2\n)\n$\n(\n4\n)\nThe components of the net periodic benefit (cost) of the noncontributory defined benefit pension plans and other postretirement employee benefit plans other than service cost are included in other income (expense), net in the Consolidated and Combined Statements of Earnings. \nWeighted average assumptions used to determine net periodic pension benefit (cost) at date of measurement:\n($ in millions)\n2024\n2023\nDiscount rate\n2.0\n \n%\n2.9\n \n%\nExpected long-term return on plan assets\n3.1\n \n%\n3.1\n \n%\nRate of compensation increase\n2.5\n \n%\n2.5\n \n%\nThe discount rate reflects the market rate on December 31 of the prior year for high-quality fixed-income investments with maturities corresponding to the Company’s benefit obligations and is subject to change each year.\nIncluded in accumulated other comprehensive income (loss) as of December 31, 2024 are the following amounts that have not yet been recognized in net periodic pension cost: unrecognized prior service credit of $\n6\n million ($\n5\n million, after-tax) and unrecognized actuarial gains of approximately $\n11\n million ($\n9\n million, after-tax).  The unrecognized losses and prior service cost, net, is calculated as the difference between the actuarially determined projected benefit obligation and the value of the plan assets less accrued pension costs as of December 31, 2024.  \nSelection of Expected Rate of Return on Assets\nThe expected rate of return reflects the asset allocation of the plans, and is based primarily on broad, publicly traded equity and fixed-income indices and forward-looking estimates of active portfolio and investment management.  Long-term rate of return on asset assumptions for the plans were determined on a plan-by-plan basis based on the composition of assets and ranged from \n2.0\n% to \n3.3\n% in 2024 and 2023, with a weighted average rate of return assumption of \n3.1\n% in 2024 and 2023.  \nPension Plan Assets\nThe Company’s pension plan assets are invested in various insurance contracts as determined by the administrator of each plan.  The value of the plan assets directly affects the funded status of the Company’s pension plans recorded in the Consolidated and Combined Financial Statements. \n80\nInsurance contracts are valued based upon the quoted prices of the underlying investments with the insurance company and are considered a Level 2 investment.  The fair value of plan assets as of December 31, 2024 and 2023 was $\n127\n million and $\n135\n million, respectively.\nThe method described above may produce a fair value estimate that may not be indicative of net realizable value or reflective of future fair values.  Furthermore, while the Company believes the valuation methods are appropriate and consistent with the methods used by other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the reporting date.\nExpected Contributions\nDuring 2025, the Company’s cash contribution requirements for its pension plans are expected to be approximately $\n5\n million.  The ultimate amounts to be contributed depend upon, among other things, legal requirements, underlying asset returns, the plan’s funded status, the anticipated tax deductibility of the contributions, local practices, market conditions, interest rates and other factors.\nThe following sets forth benefit payments, which reflect expected future service, as appropriate, expected to be paid by the plans in the periods indicated ($ in millions):\n2025\n$\n7\n \n2026\n7\n \n2027\n7\n \n2028\n10\n \n2029\n10\n \n2030 - 2034\n44\n \nOther Matters\nSubstantially all employees not covered by defined benefit plans are covered by defined contribution plans, which generally provide for Company funding based on a percentage of compensation.\nExpense for all defined benefit and defined contribution pension plans amounted to $\n63\n million, $\n52\n million and $\n44\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nNOTE 15.  \nCOMMITMENTS \nWarranties\nThe Company generally accrues estimated warranty costs at the time of sale.  In general, manufactured products are warranted against defects in material and workmanship when properly used for their intended purpose, installed correctly and appropriately maintained.  Warranty periods depend on the nature of the product and range from the date of such sale up to \ntwenty years\n.  The amount of the accrued warranty liability is determined based on historical information such as past experience, product failure rates or number of units repaired, estimated cost of material and labor and in certain instances estimated property damage.  \nAs of\n December 31, 2024 and 2023, the Company had accrued warranty liabilities of $\n30\n million and $\n34\n million, respectively.\n \nPurchase Obligations\nThe Company has entered into agreements to purchase goods or services that are enforceable and legally binding on the Company and that specify all significant terms, including fixed or minimum quantities to be purchased, fixed, minimum or variable price provisions and the approximate timing of the transaction.  Purchase obligations exclude agreements that are cancellable at any time without p\nenalty.  As of December 31, 2024, the aggregate amount of the Company’s purchase obligations totaled approximately $\n184\n million and the majority of these obligations are expected to be settled during 2025.\nNOTE 16.  \nLITIGATION AND CONTINGENCIES \nThe Company is subject to or otherwise responsible for a variety of litigation and other legal and regulatory proceedings in the course of its business (or related to the business operations of previously owned entities), including claims or counterclaims for damages arising out of the use of products or services and claims relating to intellectual property matters, employment matters, tax matters, commercial disputes, breach of contract claims, \n81\nTable of Contents\ncompetition and sales and trading practices, environmental matters, personal injury, insurance coverage and acquisition or divestiture-related matters, as well as regulatory subpoenas, requests for information, investigations and enforcement.  The Company may also from time to time become subject to lawsuits as a result of acquisitions or as a result of liabilities retained from, or representations, warranties or indemnities provided in connection with, businesses divested by the Company or its predecessors.  The types of claims made in lawsuits include claims for compensatory damages, consequential damages, punitive damages and/or injunctive relief. \nWhile the Company maintains general, products, property, workers’ compensation, automobile, cargo, aviation, crime, cyber, fiduciary and directors’ and officers’ liability insurance (and has acquired rights under similar policies in connection with certain acquisitions) up to certain limits that cover certain of these claims, this insurance may be insufficient or unavailable to cover such losses.  For general, products and property liability and most other insured risks, the Company purchases outside insurance coverage only for severe losses and must establish and maintain reserves with respect to amounts within the self-insured retention.  In addition, while the Company believes it is entitled to indemnification from third parties for some of these claims, these rights may also be insufficient or unavailable to cover such losses. \nThe Company records a liability in the Consolidated and Combined Financial Statements for loss contingencies when a loss is known or considered probable and the amount can be reasonably estimated.  If the reasonable estimate of a known or probable loss is a range, and no amount within the range is a better estimate than any other, the minimum amount of the range is accrued.  If a loss does not meet the known or probable level but is reasonably possible it is disclosed and if the loss or range of loss can be reasonably estimated, the estimated loss or range of loss is disclosed.  The Company’s reserves consist of specific reserves for individual claims and additional amounts for anticipated developments of these claims as well as for incurred but not yet reported claims.  The specific reserves for individual known claims are quantified with the assistance of legal counsel and outside risk professionals where appropriate.  In addition, outside risk professionals assist in the determination of reserves for incurred but not yet reported claims through evaluation of the Company’s specific loss history, actual claims reported and industry trends together with statistical and other factors.  Reserve estimates may be adjusted as additional information regarding a claim becomes known.  Because most contingencies are resolved over long periods of time, new developments (including litigation developments, the discovery of new facts, changes in legislation and outcomes of similar cases), changes in assumptions or changes in the Company’s strategy in any given period can require the Company to adjust the loss contingency estimates that have been recorded in the financial statements, record estimates for liabilities or assets previously not susceptible to reasonable estimates or pay cash settlements or judgments.  \nIn addition, the Company’s operations, products and services are subject to numerous U.S. federal, state, local and non-U.S. environmental, health and safety laws and regulations concerning, among other things, the health and safety of Veralto employees, the generation, storage, use and transportation of hazardous materials, emissions or discharges of substances into the environment, investigation and remediation of hazardous substances or materials at various sites, chemical constituents in products and end-of-life disposal and take-back programs for products sold.  A number of the Company’s operations involve the handling, manufacturing, use or sale of substances that are or could be classified as hazardous materials within the meaning of applicable laws.  Compliance with these laws and regulations has not had and, based on current information and the applicable laws and regulations currently in effect, is not expected to have a material effect on the Company’s capital expenditures, earnings or competitive position, and the Company does not anticipate material capital expenditures for environmental control facilities. \nIn addition to environmental compliance costs, the Company from time to time incurs costs related to remedial efforts or alleged environmental damage associated with past or current waste disposal practices or other hazardous materials handling practices.  The Company may also from time to time become party to personal injury, property damage or other claims brought by private parties alleging injury or damage due to the presence of, or exposure to, hazardous substances.  If the Company determines that potential liability for a particular site or with respect to a personal injury claim is known or considered probable and reasonably estimable, the Company accrues the total estimated loss, including investigation and remediation costs, associated with the site or claim. \nWhile the Company actively pursues insurance recoveries, as well as recoveries from other potentially responsible parties, it does not recognize any insurance recoveries until realized or until such time as a sustained pattern of collections is established related to historical matters of a similar nature and magnitude.  If the Company’s self-insurance and litigation reserves prove inadequate, it would be required to incur an expense equal to the amount of the loss incurred in excess of the reserves, which would adversely affect the Company’s Consolidated and Combined Financial Statements. \n82\nTable of Contents\nAs of December 31, 2024, the Company had approximately $\n124\n million of guarantees consisting primarily of outstanding standby letters of credit, bank guarantees and performance and bid bonds.  These guarantees have been provided in connection with certain arrangements with vendors, customers, insurance providers, financing counterparties and governmental entities to secure the Company’s obligations and/or performance requirements related to specific transactions.  The Company believes that if the obligations under these instruments were triggered, they would not have a material effect on its Consolidated and Combined Financial Statements.\nNOTE 17.  \nSTOCKHOLDERS' EQUITY AND STOCK-BASED COMPENSATION\nStock-Based Compensation\nIn connection with the Separation, the Company adopted the 2023 Omnibus Incentive Plan (the “Stock Plan”) and outstanding equity awards of Danaher held by Veralto employees were converted into or replaced with awards of Veralto common stock under the Stock Plan based on the “concentration method,” and as adjusted to maintain the economic value before and after the Separation date using the ratio of the Veralto common stock fair market value relative to the Danaher common stock fair market value  prior to the Separation.  The incremental stock-based compensation expense recorded as a result of this equity award conversion is $\n10\n million, with $\n7\n million recognized after the Separation in the fourth quarter of 2023 and an additional $\n3\n million recognized over the remaining service period.  For each equity award holder, the intent was to maintain the economic value of the equity awards before and after the Separation.  The terms of the equity awards, such as the award period, exercisability and vesting schedule, as applicable, generally continue unchanged.  Other than converted or replacement equity awards of Veralto issued in replacement of the Former Parent’s RSUs and stock options, the terms of the converted or replacement equity awards of Veralto (e.g., vesting date and expiration date) continued unchanged.\nThe Stock Plan provides for the grant of stock options, PSUs, and RSUs, among other types of awards.  A total of \n22\n million shares of Veralto common stock have been authorized for issuance under the Stock Plan.  As of December 31, 2024, approximately \n14\n million shares of common stock remain available for issuance under the Stock Plan.\nStock options under the Stock Plan generally vest pro rata over a \nfour-year\n or \nfive-year\n period and terminate \n10\n years from the grant date, though the specific terms of each grant are determined by the Compensation Committee of the Company’s Board of Directors.  The Company’s executive officers, non-employee directors, and certain other employees may be awarded stock options with different vesting criteria.  Exercise prices for stock options granted under the Stock Plan are generally equal to the closing price of Veralto’s common stock on the New York Stock Exchange on the date of grant, while stock options issued as conversion awards in connection with the Separation from Danaher were priced to maintain the economic value before and after the Separation.\nRSUs granted under the Stock Plan provide for the issuance of common stock at no cost to the holder.  RSUs granted to employees generally vest pro rata over a \nfour-year\n or \nfive-year\n period, although certain employees and non-employee directors may be awarded RSUs with different time-based vesting criteria.  Certain members of senior management may also be awarded incremental RSUs subject to performance-based vesting criteria.  Prior to vesting, RSUs do not have dividend equivalent rights, do not have voting rights, and the shares underlying the RSUs are not considered issued or outstanding.\nPSUs granted under the Stock Plan provide for the issuance of a share of the Company’s common stock at no cost to the holder and will vest at \n0\n% to \n200\n% of the target share amount based on achievement of performance targets.  The performance targets are based on a mix of both achievement of an internal growth metric and the Company’s total shareholder return ranking, both over a performance period of approximately \nthree years\n.  PSUs issued are entitled to dividend equivalent rights.  The PSU dividend equivalent rights are subject to the same vesting and payment restrictions as the related shares, but do not have voting rights and the shares underlying the PSUs are not considered issued and outstanding.\nThe equity compensation awards granted by the Company generally vest only if the employee is employed by the Company (or in the case of directors, the director continues to serve on the Company Board) on the vesting date or in other limited circumstances, including following a qualifying retirement.  To cover the exercise of options and vesting of RSUs, the Company generally issues new shares from its authorized but unissued share pool, although it may instead issue treasury shares in certain circumstances.\nThe Company accounts for stock-based compensation by measuring the cost of employee services received in exchange for all equity awards granted based on the fair value of the award as of the grant date.  The Company recognizes the compensation expense over the requisite service period (which is generally the vesting period but may be shorter than the vesting period if the employee becomes retirement eligible before the end of the vesting \n83\nTable of Contents\nperiod).  For awards issued after the Separation the fair value for RSU awards was calculated using the closing price of the Company’s common stock on the date of grant, adjusted for the fact that RSUs do not accrue dividends.  The fair value of the options granted was calculated using a Black-Scholes Merton option pricing model (“Black-Scholes”).\nThe following summarizes the assumptions used in the Black-Scholes model to value options granted during the years ended December 31:\n \n2024\n2023\nRisk-free interest rate\n4.0\n – \n4.5\n% \n4.6\n – \n4.7\n%\nWeighted average volatility\n33.0\n – \n36.1\n%\n32.7\n% – \n35.7\n%\nDividend yield\n0.4\n% – \n0.5\n% \n—\n%\nExpected years until exercise\n5\n – \n7\n5\n – \n7\nThe Black-Scholes model incorporates assumptions to value stock-based awards.  The risk-free rate of interest for periods within the contractual life of the option is based on a zero-coupon U.S. government instrument whose maturity period equals or approximates the option’s expected term.  Expected volatility is based on the average historical stock price volatility of a group of peer companies for the expected term of the option.  The dividend yield is calculated by dividing the Company’s annual common stock dividend, based on the most recent quarterly dividend rate, by the closing stock price on the grant date.  To estimate the option exercise timing used in the valuation model (which impacts the risk-free interest rate and the expected years until exercise), in addition to considering the vesting period and contractual term of the option, the Company analyzes and considers actual historical exercise experience for previously granted options.  The Company stratifies its employee population into multiple groups for option valuation and attribution purposes based upon distinctive patterns of forfeiture rates and option holding periods, as indicated by the ranges set forth in the table above for the risk-free interest rate and the expected years until exercise.\nThe amount of stock-based compensation expense recognized during a period is also based on the portion of the awards that are ultimately expected to vest.  The Company estimates pre-vesting forfeitures at the time of grant by analyzing historical data and revises those estimates in subsequent periods if actual forfeitures differ from those estimates.  Ultimately, the total expense recognized over the vesting period will equal the fair value of awards that actually vest.\nThe Company’s total stock-based compensation expense for the years ended December 31, 2024, 2023 and 2022 was $\n65\n million, $\n55\n million, and $\n41\n million, respectively.\nStock-based compensation has been recognized as a component of selling, general and administrative expenses in the accompanying Consolidated and Combined Statements of Earnings.  As of December 31, 2024, $\n38\n million of total unrecognized compensation cost related to RSUs and PSUs is expected to be recognized over a weighted average period of approximately \n2\n years.  As of December 31, 2024, $\n37\n million of total unrecognized compensation cost related to stock options is expected to be recognized over a weighted average period of approximately \n2\n years.  Future compensation amounts will be adjusted for any changes in estimated forfeitures.\n84\nTable of Contents\nThe following summarizes option activity under the Company’s stock plans:\n(in millions, except weighted average exercise price and number of years)\nOptions\nWeighted Average Exercise Price\nWeighted Average Remaining Contractual Term (in years)\nAggregate Intrinsic Value\nOutstanding as of December 31, 2022\n—\n \n$\n—\n \nAwards converted from Former Parent plan\n5.7\n \n58.22\n \nGranted\n0.1\n \n77.53\n \nExercised\n(\n0.1\n)\n31.81\n \nCancelled/forfeited\n(\n0.1\n)\n78.05\n \nOutstanding as of December 31, 2023\n5.6\n \n58.93\n \n6.3\n$\n141\n \nGranted\n0.9\n \n89.15\n \nExercised\n(\n0.8\n)\n41.36\n \nCancelled/forfeited\n(\n0.3\n)\n81.69\n \nOutstanding as of December 31, 2024\n5.4\n \n$\n65.52\n \n6\n$\n199\n \nVested and expected to vest as of December 31, 2024 \n(a)\n5.4\n \n$\n65.18\n \n5\n$\n197\n \nVested as of December 31, 2024\n3.1\n \n$\n51.72\n \n4\n$\n154\n \n(a) \nThe “expected to vest” options are the net unvested options that remain after applying the forfeiture rate assumption to total unvested options.\nThe aggregate intrinsic value in the table above represents the total pretax intrinsic value (the difference between the Company’s closing stock price on the last trading day of 2024 and the exercise price, multiplied by the number of in-the-money options) that would have been received by the option holders had all option holders exercised their options on December 31, 2024.  The amount of aggregate intrinsic value will change based on the price of the Company’s common stock. \nThe weighted average per share grant-date fair values of options granted during 2024 and 2023 was $\n33.90\n and $\n34.52\n, respectively.\nOptions outstanding as of December 31, 2024 are summarized below:\n(in millions, except price per share and number of years)\nOutstanding\nExercisable\nExercise Price\nShares\nAverage Exercise Price\nAverage Remaining Life (in years)\nShares\nAverage Exercise Price\n$\n19.35\n to $\n37.91\n1.1\n \n$\n28.62\n \n2\n1.1\n \n$\n28.62\n \n$\n37.92\n to $\n62.92\n1.1\n \n45.65\n \n4\n1.0\n \n44.77\n \n$\n62.93\n to $\n83.22\n0.9\n \n75.32\n \n6\n0.4\n \n74.13\n \n$\n83.23\n to $\n90.31\n1.5\n \n84.95\n \n8\n0.2\n \n83.57\n \n$\n90.32\n to $\n102.68\n0.8\n \n93.80\n \n7\n0.4\n \n93.54\n \nThe aggregate intrinsic value o\nf options exercised during the year ended December 31, 2024 was $\n47\n million.  Exercise of options during the year ended December 31, 2024 resulted in net cash receipts of $\n34\n million.  Upon exercise of the award by the employee, the Company derives a tax deduction measured by the excess of the market value over the grant price at the date of exercise.  The Company realized a tax benefit of $\n8\n million in 2024 related to the exercise of employee stock options. \n85\nTable of Contents\nThe following summarizes information on unvested RSU activity:\n(in millions, except weighted average grant-date fair value)\nNumber of RSUs\nWeighted Average\nGrant-Date Fair Value\nUnvested as of December 31, 2022\n—\n \n$\n—\n \nAwards from Former Parent plan\n1.0\n \n76.38\n \nGranted\n0.1\n \n76.19\n \nVested\n(\n0.1\n)\n80.20\n \nForfeited\n—\n \n77.93\n \nUnvested as of December 31, 2023\n1.0\n \n76.23\n \nGranted\n0.5\n \n95.60\n \nVested\n(\n0.4\n)\n71.07\n \nForfeited\n(\n0.1\n)\n81.19\n \nUnvested as of December 31, 2024\n1.0\n \n$\n86.45\n \nThe tax benefit of $\n5\n million related to the vesting of RSUs for the year ended December 31, 2024 has been recorded as a reduction to the current income tax provision and is reflected as an operating cash inflow in the accompanying Consolidated and Combined Statements of Cash Flows. \nIn connection with the exercise of certain stock options and the vesting of RSUs previously issued by the Company, a number of shares sufficient to fund statutory minimum tax withholding requirements has been withheld from the total shares issued or released to the award holder (though under the terms of the applicable plan, the shares are considered to have been issued and are not added back to the pool of shares available for grant).  During the year ended December 31, 2024, \n108\n thousand shares with an aggregate value of $\n10\n million were withheld to satisfy the requirement.  The withholding is treated as a reduction in additional paid-in \ncapital in the accompanying Consolidated and Combined Statements of Equity and a reduction in proceeds from the issuance of common stock in connection with stock-based compensation in the Consolidated and Combined Statements of Cash Flows.\n86\nTable of Contents\nAccumulated Other Comprehensive Income\nThe changes in accumulated other comprehensive income (loss) by component are summarized below.\n($ in millions)\nForeign Currency Translation Adjustments\nNet Investment Hedges\nPension and Postretirement Plan Benefit Adjustments\nAccumulated Comprehensive Income (Loss)\nBalance, January 1, 2022\n$\n(\n868\n)\n$\n— \n$\n(\n19\n)\n$\n(\n887\n)\nOther comprehensive income (loss) before reclassifications:\nIncrease (decrease)\n(\n100\n)\n— \n40\n \n(\n60\n)\nIncome tax impact\n—\n \n— \n(\n7\n)\n(\n7\n)\nOther comprehensive income (loss) before reclassifications, net of income taxes\n(\n100\n)\n— \n33\n \n(\n67\n)\nReclassification adjustments\nIncrease (decrease)\n—\n \n— \n—\n \n(a)\n—\n \nIncome tax impact\n—\n \n— \n—\n \n—\n \nReclassification adjustments, net of income taxes\n—\n \n— \n—\n \n—\n \nNet other comprehensive income (loss), net of income taxes\n(\n100\n)\n— \n33\n \n(\n67\n)\nBalance, December 31, 2022\n(\n968\n)\n— \n14\n \n(\n954\n)\nOther comprehensive income (loss) before reclassifications:\nIncrease (decrease)\n29\n \n(\n19\n)\n(\n18\n)\n(\n8\n)\nIncome tax impact\n—\n \n5\n \n2\n \n7\n \nOther comprehensive income (loss) before reclassifications, net of income taxes\n29\n \n(\n14\n)\n(\n16\n)\n(\n1\n)\nReclassification adjustments\nIncrease\n—\n \n— \n1\n \n(a)\n1\n \nIncome tax impact\n—\n \n— \n—\n \n—\n \nReclassification adjustments, net of income taxes\n—\n \n— \n1\n \n1\n \nNet other comprehensive income (loss), net of income taxes\n29\n \n(\n14\n)\n(\n15\n)\n—\n \nBalance, December 31, 2023\n(\n939\n)\n(\n14\n)\n(\n1\n)\n(\n954\n)\nOther comprehensive income (loss) before reclassifications:\nIncrease (decrease)\n(\n139\n)\n34\n \n—\n \n(\n105\n)\nIncome tax impact\n—\n \n(\n8\n)\n—\n \n(\n8\n)\nOther comprehensive income (loss) before reclassifications, net of income taxes\n(\n139\n)\n26\n \n—\n \n(\n113\n)\nReclassification adjustments\nIncrease (decrease)\n—\n \n— \n(\n5\n)\n(a)\n(\n5\n)\nIncome tax impact\n—\n \n— \n1\n \n1\n \nReclassification adjustments, net of income taxes\n—\n \n—\n \n(\n4\n)\n(\n4\n)\nNet other comprehensive income (loss), net of income taxes\n(\n139\n)\n26\n \n(\n4\n)\n(\n117\n)\nBalance, December 31, 2024\n$\n(\n1,078\n)\n$\n12\n \n$\n(\n5\n)\n$\n(\n1,071\n)\n(a) \nThis accumulated other comprehensive income (loss) component is included in the computation of net periodic pension and postretirement cost (refer to Note 14 for additional details).\n87\nTable of Contents\nNOTE 18.  \nRELATED PARTY TRANSACTIONS \nRelated Party Agreements\nIn connection with the Separation, on September 29, 2023, Veralto entered into the Agreements that govern the Separation and the relationships between the parties following the Separation, including an employee matters agreement, a tax matters agreement, an intellectual property matters agreement, a Veralto Enterprise System license agreem\nent and a transition services agreement.\nEmployee Matters Agreement\nVeralto and Danaher entered into an employee matters agreement that governs Veralto’s and Danaher’s compensation and employee benefit obligations with respect to the employees and other service providers of each company, and generally allocates liabilities and responsibilities relating to employment matters and employee compensation and benefit plans and programs.\nThe employee matters agreement provides for the treatment of outstanding Danaher equity awards held by Veralto’s employees upon completion of the distribution, as described in further detail in “Treatment of Outstanding Equity Awards at the Time of the Separation,” and certain other incentive arrangements.\nThe employee matters agreement provides that, following the distribution, Veralto’s employees generally will no longer participate in benefit plans sponsored or maintained by Danaher but commenced participation in Veralto’s benefit plans, which are generally similar to the existing Danaher benefit plans, with the exception of Veralto employees participating in certain Danaher U.S. and Canadian health and welfare plans, who continued to participate in such plans through January 1, 2024.\nThe employee matters agreement also sets forth the general principles relating to employee matters, including with respect to the assignment and transfer of employees, the assumption and retention of liabilities and related assets, workers’ compensation, payroll taxes, regulatory filings, leaves of absence, the provision of comparable benefits, employee service credit, the sharing of employee information and the duplication or acceleration of benefits.\nTax Matters Agreement\nIn connection with the separation and distribution, Veralto and Danaher entered into a tax matters agreement that governs the parties’ respective rights, responsibilities and obligations with respect to tax liabilities and benefits, tax attributes, the preparation and filing of tax returns, the control of audits and other tax proceedings and other matters regarding taxes.  In general, under the agreement, Veralto is responsible for any U.S. federal, state, local or foreign taxes (and any related interest, penalties or audit adjustments) imposed with respect to tax returns that include only Veralto and/or any of its subsidiaries for any periods or portions thereof ending on or prior to the consummation of the separation and distribution.  Danaher retains responsibility for any U.S. federal, state, local or foreign taxes (and any related interest, penalties or audit adjustments) imposed with respect to tax returns that include Danaher or any of its subsidiaries and Veralto and/or any of its subsidiaries for periods or portions thereof prior to the consummation of the separation and distribution.\nNeither party’s obligations under the agreement is limited in amount or subject to any cap.  The agreement also assigns responsibilities for administrative matters, such as the filing of returns, payment of taxes due, retention of records and conduct of audits, examinations or similar proceedings.  In addition, the agreement provides for cooperation and information sharing with respect to tax matters.\nDanaher is responsible for preparing and filing any tax return that includes Danaher or any of its subsidiaries (as determined immediately after the distribution), including those that also include Veralto and/or any of its subsidiaries.  Veralto is responsible for preparing and filing any tax returns that include only Veralto and/or any of its subsidiaries.\nThe party responsible for preparing and filing any tax return has primary authority to control tax contests related to any such tax return.  Veralto has exclusive authority to control tax contests with respect to tax returns that include only Veralto and/or any of its subsidiaries.\nVeralto also agreed to certain covenants that contain restrictions intended to preserve the tax-free status of the distribution and separation.  Veralto may take certain actions prohibited by these covenants only if Veralto obtains and provides to Danaher an opinion from a U.S. tax counsel or accountant of recognized national standing, in either case reasonably satisfactory to Danaher, to the effect that such action would not jeopardize the tax-free status of these transactions, or if Veralto obtains prior written consent of Danaher, in its sole and absolute discretion, waiving \n88\nTable of Contents\nsuch requirement.  Veralto is barred from taking any action, or failing to take any action, where such action or failure to act adversely affects or could reasonably be expected to adversely affect the tax-free status of these transactions, for all relevant time periods.  In addition, during the time period ending \ntwo years\n after the date of the distribution these covenants include specific restrictions on Veralto:\n•\ndiscontinuing the active conduct of Veralto’s trade or business;\n•\nissuing or selling stock or other securities (including securities convertible into Veralto stock but excluding certain compensatory arrangements); \n•\namending Veralto’s certificate of incorporation (or other organization documents) or taking any other action, whether through a stockholder vote or otherwise, affecting the voting rights of Veralto common stock;\n•\nselling assets outside the ordinary course of business; and\n•\nentering into any other corporate transaction which would cause Veralto to undergo a 50% or greater change in its stock ownership.\nVeralto agreed to indemnify Danaher and its affiliates against any and all tax-related liabilities incurred by them relating to the distribution and certain other aspects of the separation to the extent caused by an acquisition of Veralto stock or assets or by any other action undertaken by Veralto.  This indemnification applies even if Danaher has permitted Veralto to take an action that would otherwise have been prohibited under the tax related covenants described above.  Veralto’s potential indemnification obligation cannot be estimated with certainty because it depends in part on the fair market value of the Veralto common stock distributed in the distribution, but it could materially adversely affect Veralto’s financial position.\nIntellectual Property Matters Agreement\nVeralto and Danaher entered into an intellectual property matters agreement pursuant to which Danaher has granted Veralto a non-exclusive, fully paid-up, irrevocable, sublicensable (subject to the restriction below), worldwide and royalty-free license to use certain intellectual property rights retained by Danaher.  Veralto is able to sublicense its rights in connection with activities relating to Veralto’s and its affiliates business, but not for independent use by third parties.\nVeralto also granted back to Danaher a personal, generally irrevocable, non-exclusive, fully paid-up, sublicensable (subject to the restrictions below), worldwide and royalty-free license to continue to use the transferred intellectual property rights.  Danaher is able to sublicense its rights in connection with activities relating to Danaher’s and its affiliates retained business, but not for independent use by third parties.  This license-back permits Danaher to continue to use the transferred intellectual property rights in the conduct of its remaining businesses.  Veralto believes that the license-back has little impact on Veralto’s businesses because Danaher’s use of the transferred intellectual property rights is generally limited to products and services that are not part of Veralto’s businesses.\nUnder the intellectual property matters agreement, the term period with respect to licensed or sublicensed know-how is perpetual and with respect to each licensed or sublicensed patent it will expire upon expiration of the last valid claim of such patent.\nThe intellectual property matters agreement is intended to provide freedom to operate in the event that any of Danaher’s retained trade secrets (excluding VES) or patented technology is used in any of Veralto’s businesses, and, as such, applies to all portions of Veralto’s businesses.  However, Veralto believes that there may be relatively little use of such retained trade secrets or patented technology in its businesses, and as a result, Veralto does not believe that the intellectual property matters agreement has a material impact on any of its businesses.\nVeralto Enterprise System License Agreement\nVeralto and Danaher entered into a VES license agreement pursuant to which Danaher granted a nonexclusive, worldwide, non-transferable, perpetual license to Veralto to use, modify, enhance and improve VES solely in support of its businesses.  Veralto is able to sublicense such license solely to direct and indirect, wholly-owned subsidiaries (but only as long as such entities remain direct and indirect, wholly-owned subsidiaries) and to third parties to the extent reasonably necessary to support the businesses of Veralto and its subsidiaries and subject to appropriate confidentiality and non-use obligations.  In addition, each of Danaher and Veralto will license to each other improvements made by such party to VES during the first \ntwo years\n of the term of the VES license agreement.  The term period for the VES license agreement is perpetual, unless terminated earlier by either party.\n89\nTable of Contents\nTransition Services Agreement\nDanaher and Veralto entered into a transition services agreement that became effective upon the distribution, pursuant to which Danaher and its subsidiaries and Veralto and its subsidiaries provide to each other various services.  The services provided include information technology, facilities, certain accounting and other financial functions, and administrative services.  The charges for the transition services generally allow the providing company to fully recover all out-of-pocket costs and expenses it actually incurs in connection with providing the service, plus, in some cases, the allocated indirect costs of providing the services, generally without profit.\nThe transition services agreement terminates on the expiration of the term of the last service provided under it, unless earlier terminated by either party under certain circumstances, including, but not limited to, in the event of an uncured material breach by the other party or its applicable affiliates.  If no term period is provided for a specified service, then such service is to terminate on the second anniversary of the distribution date of the transition services agreement.  The recipient for a particular service generally can terminate that service prior to the scheduled expiration date, subject to a minimum notice period equal to \n30\n days.\nVeralto does not expect the net costs associated with the transition services agreement to be materially different than the historical costs that have been allocated to Veralto related to these same services.\nAllocated Expenses\nPrior to the Separation, Veralto operated as part of Danaher and not as a stand-alone company.  Accordingly, certain shared costs for management and support functions which were provided on a centralized basis within Danaher were allocated to Veralto and are reflected as expenses in these financial statements prior to the Separation date.  The Company considers the allocation methodologies used to be reasonable and appropriate reflections of the related expenses attributable to Veralto for purposes of the carved-out financial statements; however, the expenses reflected in these financial statements for periods prior to the Separation date may not be indicative of the actual expenses that would have been incurred during the periods presented if the Company had operated as a separate stand-alone entity.  In addition, the expenses reflected in the financial statements may not be indicative of expenses that the Company will incur in the future.\nCorporate Expenses\nCertain corporate overhead and shared expenses incurred by Danaher and its subsidiaries have been allocated to the Company and are reflected in the Consolidated and Combined Statements of Earnings.  These amounts include, but are not limited to, items such as general management and executive oversight, costs to support Danaher information technology infrastructure, facilities, compliance, human resources, marketing and legal functions and financial management and transaction processing including public company reporting, consolidated tax filings and tax planning, Danaher benefit plan administration, risk management and consolidated treasury services, certain employee benefits and incentives, and stock based compensation administration.  These costs are allocated using methodologies that management believes are reasonable for the item being allocated.  Allocation methodologies include the Company’s relative share of revenues, headcount, or functional spend as a percentage of the total.\nCorporate expenses allocated to Veralto from Danaher and its subsidiaries for the years ended December 31, 2023 and 2022 were $\n42\n million and $\n49\n million, respectively.  Following the Separation, the Company independently incurs expenses as a stand-alone company and \nno\n expenses are allocated by Danaher.\nInsurance Programs Administered by Danaher\nIn addition to the corporate allocations discussed above, the Company was allocated expenses related to certain insurance programs Danaher administers on behalf of the Company, including workers compensation, property, cargo, automobile, crime, fiduciary, product, general and directors’ and officers’ liability insurance.  These amounts were allocated using various methodologies, as described below.\nIncluded within the insurance cost allocation are allocations related to programs for which Danaher is self-insured up to a certain amount.  For the self-insured component, costs are allocated to the Company based on its incurred claims.  Danaher has premium based policies which cover amounts in excess of the self-insured retentions.  The Company is allocated a portion of the total insurance cost incurred by the Danaher based on its pro-rata portion of the Danaher’s total underlying exposure base.  An estimated liability relating to the Company’s known and incurred but not reported claims has been allocated to the Company and reflected on the accompanying Consolidated Balance Sheets.\n90\nTable of Contents\nInsurance programs expenses allocated to Veralto from Danaher and its subsidiaries for the years ended December 31, 2023 and 2022 were $\n8\n million and $\n7\n million, respectively.\nMedical Insurance Programs Administered by Danaher\nIn addition to the corporate allocations discussed above, the Company was allocated expenses related to the medical insurance programs the Danaher administers on behalf of the Company.  These amounts were allocated using actual medical claims incurred during the period for the associated employees attributable to the Company.\nMedical insurance programs expenses allocated to Veralto from Danaher and its subsidiaries for the years ended December 31, 2023 and 2022 were $\n88\n million and $\n87\n million, respectively. \nDeferred Compensation Program Administered by Danaher\nRefer to Note 10 for information regarding the deferred compensation program.  In connection with the Separation, the Company established a similar independent, nonqualified deferred compensation program. \nDeferred compensation program expenses incurred for the years ended December 31, 2023 and 2022 was $\n3\n million.\nRevenue and Other Transactions Entered Into In the Ordinary Course of Business\nPrior to the Separation, the Company operated as part of Danaher and not as a stand-alone company and certain of its revenue arrangements related to contracts entered into in the ordinary course of business with Danaher and its affiliates.\nVeralto recorded revenues of $\n21\n million and $\n24\n million from sales to Danaher and its subsidiaries during the nine months ended September 29, 2023 and the year ended December 31, 2022, respectively.  Following the Separation, Veralto continues to enter into revenue arrangements in the ordinary course of business with Danaher and its subsidiaries, although certain agreements were entered into or terminated as a result of the Separation.  During the three months ended December 31, 2023 following the Separation, sales to Danaher and its subsidiaries were $\n7\n million.  During the year ended December 31, 2024, sales to Danaher and its subsidiaries were $\n21\n million.\nIn addition to transactions entered into in the ordinary course of business, the Company made net payments of approximately $\n16\n million and $\n10\n million during the years ended December 31, 2024 and 2023, respectively, in accordance with the transition services agreement for various services provided to the Company by Danaher.\n91\nTable of Contents\nITEM 9.  CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable.\nITEM 9A.  CONTROLS AND PROCEDURES\nOur management, with the participation of the President and Chief Executive Officer, and Senior Vice President and Chief Financial Officer, has evaluated the effectiveness of our disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”)) as of the end of the period covered by this report.  Based on such evaluation, the President and Chief Executive Officer, and Senior Vice President and Chief Financial Officer, have concluded that, as of the end of such period, these disclosure controls and procedures were effective.\nManagement’s annual report on its internal control over financial reporting (as such term is defined in Rules 13a-15(f) under the Exchange Act) and the independent registered public accounting firm’s audit report on the effectiveness of the Company’s internal control over financial reporting are included in Item 8. Financial Statements and Supplementary Data, under the headings “Report of Management on Veralto Corporation’s Internal Control Over Financial Reporting” and “Report of Independent Registered Public Accounting Firm,” respectively, and are incorporated herein by reference.\nThere have been no changes in our internal control over financial reporting that occurred during the most recent completed fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nITEM 9B.  OTHER INFORMATION\nDirector and Officer Trading Arrangements\nOn \nNovember 7, 2024\n, \nJennifer L. Honeycutt\n, Veralto’s \nPresident and Chief Executive Officer\n, \nadopted\n a trading plan intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) under the Exchange Act to sell up to \n54,408\n shares of common stock, subject to certain conditions.  Unless otherwise terminated pursuant to its terms, the plan will terminate on \nOctober 29, 2025\n, or when all of the shares under the plan are sold.\nOn \nNovember 25, 2024\n, \nSurekha Trivedi\n, Veralto’s Senior Vice \nPresident, Strategy and Sustainability\n, \nadopted\n a trading plan intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) under the Exchange Act to sell up to \n4,111\n shares of common stock, subject to certain conditions.  Unless otherwise terminated pursuant to its terms, the plan will terminate on \nNovember 14, 2025\n, or when all of the shares under the plan are sold.\nITEM 9C.  DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n92\nTable of Contents\nPART III\nITEM 10.  DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOther than the information below, the information required by this Item is incorporated by reference from the sections entitled \nProposal 1–Election of Directors\n, \nCorporate Governance\n and \nOther Information\n in the Proxy Statement for the Company’s 2025 annual meeting of shareholders.\nCode of Ethics\nVeralto has adopted a code of business conduct and ethics for directors, officers (including Veralto’s principal executive officer, principal financial officer and principal accounting officer) and employees, known as the Code of Conduct.  The Code of Conduct is available in the “Sustainability” section of Veralto’s website at www.veralto.com.\nVeralto intends to disclose any amendment to the Code of Conduct that relates to any element of the code of ethics definition enumerated in Item 406(b) of Regulation S-K, and any waiver from a provision of the Code of Conduct granted to any director, principal executive officer, principal financial officer, principal accounting officer, or any of its other executive officers, in the “Sustainability” section of its website, at www.veralto.com, within four business days following the date of such amendment or waiver.\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nSet forth below are the names, ages, positions and experience of Veralto’s executive officers as of February 4, 2025.  All of Veralto’s executive officers hold office at the pleasure of Veralto’s Board of Directors.  Unless otherwise stated, the positions indicated are Veralto positions.\nName\nAge\nPosition\nJennifer L. Honeycutt\n55\nPresident and Chief Executive Officer; Director\nSameer Ralhan\n51\nSenior Vice President and Chief Financial Officer\nMelissa Aquino\n53\nSenior Vice President, Water Quality\nMattias Byström\n52\nSenior Vice President, Product Quality & Innovation\nSurekha Trivedi\n50\nSenior Vice President, Strategy & Sustainability\nLesley Beneteau\n52\nSenior Vice President, Human Resources\nSylvia Stein\n58\nSenior Vice President and General Counsel\nJennifer L. Honeycutt\n serves as Veralto’s President and Chief Executive Officer and a member of the Board, and previously served as Executive Vice President with responsibility for Danaher’s Environmental & Applied Solutions segment since July 2022.  Prior to that, Ms. Honeycutt has served in leadership positions in a variety of different functions and businesses since joining Danaher in 1999, including most recently as Executive Vice President for Danaher’s Life Sciences Tools Platform and Global High Growth Markets from January 2021 through September 2022, Vice President and Group Executive within Danaher’s Life Sciences Platform from May 2019 through January 2021, and as President of Pall Corporation from January 2017 through January 2021.\nSameer Ralhan \nserves as Veralto’s Senior Vice President and Chief Financial Officer.  Prior to joining Veralto, Mr. Ralhan held a variety of positions at The Chemours Company, a global provider of performance chemicals, from November 2014 to June 2023, including as Senior Vice President, Chief Financial Officer from June 2019 to June 2023, and as Vice President, Finance and Treasurer from May 2018 to June 2019.\nMelissa Aquino\n serves as Veralto’s Senior Vice President, Water Quality, and has served as Vice President and Group Executive of Danaher’s Water Quality companies since January 2023.  Prior to that, Ms. Aquino served as Senior Vice President and Group Executive of IDEX Corporation, a provider of specialty engineered products, from October 2022 to January 2023.  Prior to joining IDEX Corporation, Ms. Aquino held a variety of positions at Danaher from March 2000 to October 2022, including most recently as President of Cepheid, a Danaher subsidiary, from April 2021 to October 2022.\nMattias Byström \nserves as Veralto’s Senior Vice President, Product Quality & Innovation, and has served as Vice President and Group Executive of Danaher’s Product Identification companies since November 2021.  Prior to that, Mr. Byström served in various leadership roles for Danaher’s Product Identification businesses since September 2018, including President of Esko from September 2018 to March 2020 and most recently as President of Danaher’s Packing & Color Management companies from March 2020 to November 2021.  Prior to joining Danaher, \n93\nTable of Contents\nMr. Byström served as Chief Executive Officer of FlexLink, a provider of conveyor systems and factory automation systems, from April 2015 to April 2018. \nSurekha Trivedi\n serves as Veralto’s Senior Vice President, Strategy & Sustainability, and has held a variety of positions at Danaher since joining Danaher in 2007, including most recently as Vice President of Strategy for Danaher’s Environmental & Applied Solutions segment since October 2022.\nLesley Beneteau \nserves as Veralto’s Senior Vice President and Chief Human Resources Officer, and has held a variety of positions since joining Danaher in 2010 including most recently as Vice President, Talent Management of Danaher since November 2015.\nSylvia Stein\n serves as Veralto’s Senior Vice President and Chief Legal Officer.  Prior to joining Danaher in June 2023, Ms. Stein served as Vice President, General Counsel, Corporate Secretary and Chief Compliance Officer of Modine Manufacturing Company, a thermal management company, from January 2018 to June 2023.\nITEM 11.  EXECUTIVE COMPENSATION\nThe information required by this Item is incorporated by reference from the sections entitled \nDirector Compensation, Compensation Discussion and Analysis, Compensation Committee Report, Compensation Tables and Information \n(other than the Pay Versus Performance disclosure)\n \nand \nSummary of Employment Agreements and Plans\n in the Proxy Statement for the Company’s 2025 annual meeting of shareholders (provided that the Compensation Committee Report shall not be deemed to be “filed” and the Pay-Versus-Performance disclosure shall not be deemed to be incorporated by reference herein).\nITEM 12.  SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item is incorporated by reference from the sections entitled \nBeneficial Ownership of Veralto Common Stock by Directors, Officers and Principal Shareholders, Summary of Employment Agreements and Plans \nand\n Compensation Tables and Information\n in the Proxy Statement for the Company’s 2025 annual meeting of shareholders (provided that the Pay-Versus-Performance disclosure shall not be deemed to be incorporated by reference herein).\nITEM 13.  CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated by reference from the section entitled \nDirector Independence and Related Person Transactions\n in the Proxy Statement for the Company’s 2025 annual meeting of shareholders.\nITEM 14.  PRINCIPAL ACCOUNTANT FEES AND SERVICES\nOur independent registered public accounting firm is \nErnst & Young LLP\n, \nBoston, Massachusetts\n, PCAOB ID: 000\n42\n.\nThe information required by this Item is incorporated by reference from the section entitled \nProposal 2–Ratification of Independent Registered Public Accounting Firm \nin the Proxy Statement for the Company’s 2025 annual meeting of shareholders.\n94\nTable of Contents\nPART IV\nITEM 15.  EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\na)    The following documents are filed as part of this report.\n(1)\nFinancial Statements.  The financial statements are set forth under “Item 8.  Financial Statements and Supplementary Data” of this Annual Report on Form 10-K.\n(2)\nSchedules.  An index of Exhibits and Schedules is on page \n95\n of this report.  Schedules other than those listed below have been omitted from this Annual Report on Form 10-K because they are not required, are not applicable or the required information is included in the financial statements or the notes thereto.\n(3)\nExhibits.  The exhibits listed in the accompanying Exhibit Index are filed or incorporated by reference as part of this Annual Report on Form 10-K.\nITEM 16.  FORM 10-K SUMMARY\nNot applicable.\nINDEX TO FINANCIAL STATEMENTS, SUPPLEMENTARY DATA AND FINANCIAL STATEMENT SCHEDULE\n \nPage Number in\nForm 10-K\nSchedule:\nValuation and Qualifying Accounts\n101\n95\nTable of Contents\nEXHIBIT INDEX\nExhibit Number\nDescription\n2.1\nSeparation and Distribution Agreement, dated as of September 29, 2023, by and between Veralto Corporation and Danaher Corporation (incorporated by reference to Exhibit 2.1 to Veralto Corporation’s Current Report on Form 8-K filed October 2, 2023)\n3.1\nAmended and Restated Certificate of Incorporation of Veralto Corporation (incorporated by reference to Exhibit 3.1 to Veralto Corporation’s Current Report on Form 8-K filed October 2, 2023)\n3.2\nAmended and Restated Bylaws of Veralto Corporation (incorporated by reference to Exhibit 3.2 to Veralto Corporation’s Current Report on Form 8-K filed October 2, 2023)\n4.1\nIndenture, dated as of September 18, 2023, between Veralto Corporation, as issuer, and Deutsche Bank Trust Company Americas, a New York banking corporation, as trustee (incorporated by reference to Exhibit 4.1 to Veralto Corporation’s Current Report on Form 8-K filed September 19, 2023)\n4.2\nRegistration Rights Agreement, dated as of September 18, 2023, by and among Veralto Corporation and Barclays Capital Inc., BNP Paribas Securities Corp., BofA Securities, Inc., Citigroup Global Markets Inc. and Morgan Stanley & Co. LLC, as representatives of the initial purchasers of the USD Notes (incorporated by reference to Exhibit 4.2 to Veralto Corporation’s Current Report on Form 8-K filed September 19, 2023)\n4.3\nIndenture, dated as of September 19, 2023, between Veralto Corporation, as issuer, and Deutsche Bank Trust Company Americas, a New York banking corporation, as trustee (incorporated by reference to Exhibit 4.3 to Veralto Corporation’s Current Report on Form 8-K filed September 19, 2023)\n4.4\nRegistration Rights Agreement, dated as of September 19, 2023, by and among Veralto Corporation and Deutsche Bank AG, London Branch and Goldman Sachs & Co. LLC, as representatives of the initial purchasers of the Euro Notes  (incorporated by reference to Exhibit 4.4 to Veralto Corporation’s Current Report on Form 8-K filed September 19, 2023)\n4.5\nDescription of Securities Registered under Section 12 of the Exchange Act (incorporated by reference to Exhibit 4.5 to Veralto Corporation’s Annual Report on Form 10-K filed February 28, 2024)\n10.1\nEmployee Matters Agreement, dated as of September 29, 2023, by and between Veralto Corporation and Danaher Corporation (incorporated by reference to Exhibit 10.1 to Veralto Corporation’s Current Report on Form 8-K filed October 2, 2023)\n10.2\nTax Matters Agreement, dated as of September 29, 2023, by and between Veralto Corporation and Danaher Corporation (incorporated by reference to Exhibit 10.2 to Veralto Corporation’s Current Report on Form 8-K filed October 2, 2023)\n10.3\nTransition Services Agreement, dated as of September 29, 2023, by and between Veralto Corporation and Danaher Corporation (incorporated by reference to Exhibit 10.3 to Veralto Corporation’s Current Report on Form 8-K filed October 2, 2023)\n10.4\nIntellectual Property Matters Agreement, dated as of September 29, 2023, by and between Veralto Corporation and Danaher Corporation (incorporated by reference to Exhibit 10.4 to Veralto Corporation’s Current Report on Form 8-K filed October 2, 2023)\n10.5\nDBS License Agreement, dated as of September 29, 2023, by and between Veralto Corporation and Danaher Corporation (incorporated by reference to Exhibit 10.5 to Veralto Corporation’s Current Report on Form 8-K filed October 2, 2023)\n10.6\nFramework Agreement, dated as of September 29, 2023, by and between Beckman Coulter, Inc. and Hach Company (incorporated by reference to Exhibit 10.6 to Veralto Corporation’s Current Report on Form 8-K filed October 2, 2023)\n10.7\nVeralto Corporation 2023 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.1 to Amendment 1 to the Registrant’s Registration Statement on Form S-8 (File No. 333-274789), filed with the Commission on February 28, 2024)*\n10.8\nVeralto Corporation Executive Deferred Incentive Program, a sub-plan under the 2023 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.22 to the Registrant’s Registration Statement on Form 10 filed with the Commission on August 3, 2023)*\n10.9\nVeralto Corporation Excess Contribution Program, a sub-plan under the 2023 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.21 to the Registrant’s Registration Statement on Form 10 filed with the Commission on August 3, 2023)*\n10.10\nVeralto Corporation Deferred Compensation Plan (incorporated by reference to Exhibit 10.23 to the Registrant’s Registration Statement on Form 10 filed with the Commission on August 3, 2023).\n96\nTable of Contents\n10.11\nCredit Agreement, dated as of August 31, 2023, by and among Veralto Corporation, certain subsidiaries of Veralto Corporation, Bank of America, N.A., as administrative agent and Bank of America, N.A. as lender and swing line lender (incorporated by reference to Exhibit 10.25 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)*\n10.12\nForm of Veralto Corporation Director and Officer Indemnification Agreement (incorporated by reference to Exhibit 10.6 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)\n*\n10.13\nOffer of Employment Letter, dated as of January 27, 2023, between Danaher Corporation and Jennifer Honeycutt (incorporated by reference to Exhibit 10.7 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)\n*\n10.14\nOffer of Employment Letter, dated as of May 12, 2023, between DH EAS Employment LLC and Sameer Ralhan (incorporated by reference to Exhibit 10.8 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)\n*\n10.15\nOffer of Employment Letter, dated as of January 6, 2023, between Danaher Corporation and Melissa Aquino (incorporated by reference to Exhibit 10.9 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)\n*\n10.16\nEmployment Agreement, dated as of December 21, 2021, between VTI Sweden AB and Mattias Byström (incorporated by reference to Exhibit 10.10 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)\n*\n10.17\nOffer of Employment Letter, dated as of April 10, 2023, between Veralto Corporation and Sylvia Stein* (incorporated by reference to Exhibit 10.17 to Veralto Corporation’s Annual Report on Form 10-K filed February 28, 2024)\n10.18\nAmendment to Employment Agreement, dated as of May 5, 2023, between VTI Sweden AB and Mattias Byström (incorporated by reference to Exhibit 10.11 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)\n*\n10.19\nOffer of Employment Letter, dated as of February 27, 2023, between Danaher Corporation and Surekha Trivedi\n \n(incorporated by reference to Exhibit 10.12 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)\n*\n10.20\nForm of Veralto Corporation Stock Option Agreement\n10.21\nForm of Veralto Corporation Restricted Stock Unit Agreement\n10.22\nForm of Veralto Corporation Performance Stock Unit Agreement\n10.23\nForm of Veralto Retirement Savings Plan (incorporated by reference to Exhibit 10.5 to Amendment 1 to the Registrant’s Registration Statement on Form S-8 (File No. 333-274789), filed with the Commission on February 28, 2024)\n10.24\nForm of Veralto Corporation Stock Option Agreement for Non-Employee Directors\n10.25\nForm of Veralto Corporation Restricted Stock Unit Agreement for Non-Employee Directors\n10.26\nForm A of Veralto Corporation Agreement Regarding Competition and Protection of Proprietary Interests (incorporated by reference to Exhibit 10.18 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)\n10.27\nForm B of Veralto Corporation Agreement Regarding Solicitation and Protection of Proprietary Interests (incorporated by reference to Exhibit 10.19 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)\n10.28\nForm of Veralto Corporation Senior Leader Severance Pay Plan (incorporated by reference to Exhibit 10.20 to Amendment No. 2 to Veralto Corporation’s Registration Statement on Form 10 filed August 31, 2023)\n10.29\nFirst Amendment to Veralto Corporation Senior Leaders Severance Pay Plan (incorporated by reference to Exhibit 10.1 to Veralto Corporation’s Form 8-K filed December 15, 2023)\n10.30\nSecond Amendment to the Senior Leaders Severance Pay Plan of Veralto Corporation and its Affiliated Companies\n19.1\nVeralto Corporation Insider Trading Policy\n21.1\nSubsidiaries of Registrant\n23.1\nConsent of Independent Registered Public Accounting Firm\n31.1\nCertification of Chief Executive Officer Pursuant to Item 601(b)(31) of Regulation S-K, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\nCertification of Chief Financial Officer Pursuant to Item 601(b)(31) of Regulation S-K, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification of Chief Executive Officer, Pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n97\nTable of Contents\n32.2\nCertification of Chief Financial Officer, Pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n97.1\nClawback Policy, Pursuant to Section 954 of the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (incorporated by reference to Exhibit 97.1 to Veralto Corporation’s Annual Report on Form 10-K filed February 28, 2024)\n101\nInteractive data files (formatted as Inline XBRL).\n104\nCover Page Interactive Data File (contained in Exhibit 101).\n*\nIndicates management contract or compensatory plan, contract or arrangement.\n98\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nVERALTO CORPORATION\nDate:\nFebruary 25, 2025\nBy:\n/s/ JENNIFER L. HONEYCUTT\nJennifer L. Honeycutt\nPresident, Chief Executive Officer and Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this annual report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the date indicated:\nName, Title and Signature\nDate\n/s/ LINDA FILLER\nFebruary 25, 2025\nLinda Filler\nChair of the Board\n/s/ JENNIFER L. HONEYCUTT\nFebruary 25, 2025\nJennifer L. Honeycutt\nPresident, Chief Executive Officer and Director\n/s/ SAMEER RALHAN\nFebruary 25, 2025\nSameer Ralhan\nSenior Vice President and Chief Financial Officer\n/s/ BERNARD M. SKEETE\nFebruary 25, 2025\nBernard M. Skeete\nVice President and Chief Accounting Officer\n/s/ FRANÇOISE COLPRON\nFebruary 25, 2025\nFrançoise Colpron\nDirector\n/s/ DANIEL L. COMAS\nFebruary 25, 2025\nDaniel L. Comas\nDirector\n/s/ SHYAM P. KAMBEYANDA\nFebruary 25, 2025\nShyam P. Kambeyanda\nDirector\n/s/ WILLIAM H. KING\nFebruary 25, 2025\nWilliam H. King\nDirector\n99\nTable of Contents\n/s/ WALTER G. LOHR, JR.\nFebruary 25, 2025\nWalter G. Lohr, Jr.\nDirector\n/s/ HEATH A. MITTS\nFebruary 25, 2025\nHeath A. Mitts\nDirector\n/s/ VIJAY SANKARAN\nFebruary 25, 2025\nVijay Sankaran\nDirector\n/s/ JOHN T. SCHWIETERS\nFebruary 25, 2025\nJohn T. Schwieters\nDirector\n/s/ CINDY L. WALLIS-LAGE\nFebruary 25, 2025\nCindy L. Wallis-Lage\nDirector\n/s/ THOMAS L. WILLIAMS\nFebruary 25, 2025\nThomas L. Williams\nDirector\n100\nTable of Contents\nVERALTO CORPORATION\nSCHEDULE II—VALUATION AND QUALIFYING ACCOUNTS\n($ in millions)\nClassification\nBalance at Beginning of Period \n(a)\nCharged to Costs & Expenses\nImpact of Currency\nWrite-Offs, Write-Downs & Deductions\nBalance at End of Period \n(a)\nYear ended December 31, 2024:\nAllowances deducted from asset account\nAllowance for credit losses\n$\n37\n \n9\n \n(\n1\n)\n(\n6\n)\n$\n39\n \nYear ended December 31, 2023:\nAllowances deducted from asset account\nAllowance for credit losses\n$\n36\n \n10\n \n—\n \n(\n9\n)\n$\n37\n \nYear ended December 31, 2022:\nAllowances deducted from asset account\nAllowance for credit losses\n$\n36\n \n9\n \n(\n1\n)\n(\n8\n)\n$\n36\n \n(a) \nAmounts include allowance for credit losses classified as current and noncurrent.\n101"
  }
}