{
  "ticker": "VMC",
  "cik": "0001396009",
  "company_name": "Vulcan Materials CO",
  "filing_date": "2025-02-20",
  "accession": "0001396009-25-000005",
  "primary_doc": "vmc-20241231.htm",
  "item_sections": {
    "item1": "Item 1 “\nBusiness\n” under the “Business Strategy” heading — we have created one of the most profitable public companies in our industry as measured by aggregates gross profit per ton.\nIn 2019, we set a target of $9 of cash gross profit per ton on volumes of 230 to 240 million tons, which we exceeded in 2023. In 2022, we set a new target to achieve $11 to $12 cash gross profit per ton once we reach 260 to 270 million tons. We delivered $10.61 of cash gross profit per ton on 220 million tons in 2024, exiting the year with cash gross profit of $2,332 million. Our durable growth strategy gives us confidence that we will deliver more value to our shareholders on every ton of aggregates we sell.\nCash gross profit per ton is a non-GAAP measure. See the definitions and reconciliations within this Item 7 under the caption \"\nReconciliation of Non-GAAP Financial Measures\n.\"\nMore than an aggregates supplier, we are a business dedicated to customer service and finding creative solutions to meet our customers’ needs. Being a valued partner and trusted supplier means that we are providing the right product, with the right specifications, that is the right quality, delivered the right way — on time and safely. Our \nOne Vulcan, Locally Led \napproach, in which our employees work together to leverage the size and strengths of Vulcan as a whole, while running their operations with a strong entrepreneurial spirit and sense of ownership, allows us to deliver market-leading services to our customers.\nPart II\n34\nTransportation costs are passed along to our customers, and because aggregates have a very high weight-to-price ratio, those costs can add up quickly when transporting aggregates long distances. Having the most extensive distribution network of any aggregates producer sets us apart. Combining our trucking, rail, barge and ocean vessel shipping logistics capabilities allows us to provide better customer solutions and create a seamless customer experience at a competitive price. As an approximation, a truck has a capacity of 20-25 tons of aggregates; a railcar has a capacity of 4-5 truckloads; a barge has a capacity of 65 truckloads; and our ocean vessels have the capacity of 2,500 truckloads.\nProduction and sales are currently halted at our Calica operations in Mexico. For additional information, see Note 12 “\nCommitments and Contingencies\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nPart II\n35\nINDUSTRY LEADER WITH CLEAR COMPETITIVE ADVANTAGES\n▪\nLargest U.S. aggregates producer with strategic geographic diversity\n▪\n423 active aggregates facilities with 16.5 billion tons of reserves\n▪\nLeading unit profitability margins driven by operational expertise and pricing performance\n▪\n76% of the U.S. population growth over the next decade is projected to occur in Vulcan-served states\nOver time, we have strategically and systematically built one of the most valuable aggregates franchises in the U.S. with a footprint that is impossible to replicate. Zoning and permitting regulations have made it increasingly difficult to expand existing quarries or to develop new quarries. Such regulations, while curtailing expansion, also increase the value of our reserves that were zoned and permitted decades ago.\nDemand for aggregates correlates positively with changes in population, household formations and employment. We have a coast-to-coast footprint that serves 35 of the top 50 highest-growth metropolitan statistical areas (MSAs). As state and federal spending increase, Vulcan is poised to benefit greatly from growing private and public demand for aggregates, thereby delivering significant long-term value for our shareholders. \nSource: Woods & Poole CEDDS 2024\nBased on people added from 2024 to 2034\nPart II\n36\nSTRONG CASH FLOW GENERATION AND INVESTMENT-GRADE BALANCE SHEET\n▪\nFinancial capacity to sustain capital reinvestment in current asset base and to fund growth\n▪\nMaintain an investment-grade credit position\n▪\nContinue to leverage current capital base to grow earnings and maximize cash generation\n▪\nPrudently pursue attractive acquisitions and greenfields\n▪\nReturn value to shareholders with dividends and stock repurchases \nFree Cash Flow Growth\nin millions\n \nFree cash flow is a Non-GAAP measure and calculated by subtracting purchases of property, plant and equipment from operating cash flows. Free cash flow is useful to investors in understanding how existing cash from operations is utilized as a source for sustaining our current capital plan and future development growth.\nOur financial position is strong as evidenced by our long-term investment-grade credit ratings (Fitch BBB/Moody’s Baa2/Standard & Poor’s BBB+).\n \nAt December 31, 2024, our available liquidity was $2,064.5 million, including $559.7 million of unrestricted cash on hand, significantly higher than our liquidity needs. Our leverage ratio, as measured by total debt to Adjusted EBITDA, was 2.6 times at December 31, 2024 (our net debt to Adjusted EBITDA ratio at December 31, 2024 was 2.3 times). Our long-term leverage target is 2.0 to 2.5x.\n*\nThese years include significant acquisition activity (see \nPart I, Item 1 \n\"\nBusiness\n\"\n under the caption \"Business Strategy\" for further details).\nPart II\n37\nSAFETY, HEALTH AND ENVIRONMENTAL PERFORMANCE\nA strategy for sustainable, long-term value creation must include doing right by our employees, our neighbors and the environment in which we operate. Over our more than six decades as a public company, we have built a strong, resilient and vital business on this foundation of doing things the right way.\nWe are a leader in our industry in safety, health and environmental performance, with a safety record substantially better than the industry average. We apply the shared experiences, expertise and resources at each of our locally led sites with an emphasis on taking care of one another. The result is a record of safety excellence that consistently outperforms the industry.\nVulcan MSHA Injury Rate Compared to Aggregates Industry\nNumber of Injuries per 200,000 Hours Worked\nSource: Bureau of Labor Statistics records and internal Vulcan data.\n*\nThe aggregates industry MSHA injury rate for 2024 was not available as of the filing of this report.\nWe focus on our environmental stewardship programs with the same commitment that we bring to our health and safety initiatives resulting in 98% citation-free inspections out of all 2024 federal and state environmental inspections. As an industry leader, our aim is to meet — and strive to exceed — all federal, state and local environmental regulations. \nHowever, sustainability means looking beyond what is required of a company by governments and regulators. Sustainability is reflected in our business strategy. We lead community relations programs that serve our neighbors while ensuring that we grow and thrive in the communities where we operate. In all parts of our company, from local operations to our corporate and regional offices to our international business and ocean-going shipping, we are focused on ensuring that our operations are efficient in ways that are economically and environmentally sustainable. It’s the right thing to do for our business and our stakeholders.\nWe continue to make progress on reducing our carbon footprint, increasing our energy efficiency, and measuring and reducing our water use. We also manage our land with biodiversity in mind. During 2024, we operated 33 sites containing wildlife enhancement programs that are certified by the Wildlife Habitat Council in addition to several other sites that are working towards certification.\nWe recognize that the aggregates mining in which we engage is an interim use of the approximately 310,000 acres of land in our portfolio. Our land and water assets will be converted to other valuable uses at the end of mining. Effective management throughout the life cycle of our land — from pre-mining utilization as agriculture and timber development, to post-mining development as water reservoirs or residential and commercial development — not only generates significant additional value for our shareholders but greatly benefits the communities in which we operate.\nPart II\n38\nRESULTS OF OPERATIONS\nTotal revenues are primarily derived from our product sales of aggregates, asphalt mix and ready-mixed concrete, and include freight & delivery costs that we pass along to our customers to deliver these products. We also generate service revenues from our asphalt construction paving business and services related to our aggregates business. We present separately our discontinued operations, which consists of our former Chemicals business.\nThe following table highlights significant components of our consolidated operating results including EBITDA and Adjusted EBITDA.\nCONSOLIDATED OPERATING RESULTS HIGHLIGHTS\nFor the years ended December 31\nin millions, except per share and per unit data\n2024\n2023\n2022\nTotal revenues\n$\n7,417.7 \n$\n7,781.9 \n$\n7,315.2 \nCost of revenues\n(5,418.1)\n(5,833.4)\n(5,757.5)\nGross profit\n1,999.6 \n1,948.5 \n1,557.7 \nGross profit margin\n27.0 \n%\n25.0 \n%\n21.3 \n%\nSelling, administrative and general expenses\n(531.1)\n(542.8)\n(515.1)\nSAG as a percentage of total revenues\n7.2 \n%\n7.0 \n%\n7.0 \n%\nGain on sale of property, plant & equipment and businesses\n52.3 \n76.4 \n10.7 \nLoss on impairments\n(86.6)\n(28.3)\n(67.9)\nOperating earnings\n1,364.5 \n1,427.4 \n951.4 \nInterest expense\n(191.2)\n(196.1)\n(169.2)\nEarnings from continuing operations before income taxes\n1,172.1 \n1,245.1 \n788.1 \nIncome tax expense\n(251.4)\n(299.4)\n(193.0)\nEffective tax rate from continuing operations\n21.4 \n%\n24.0 \n%\n24.5 \n%\nEarnings from continuing operations\n920.7 \n945.7 \n595.1 \nLoss on discontinued operations, net of tax\n(7.6)\n(10.8)\n(18.6)\nEarnings attributable to noncontrolling interest\n(1.2)\n(1.7)\n(0.9)\nNet earnings attributable to Vulcan\n$\n911.9 \n$\n933.2 \n$\n575.6 \nDiluted earnings (loss) per share attributable to Vulcan\nContinuing operations \n$\n6.91 \n$\n7.06 \n$\n4.45 \nDiscontinued operations\n(0.06)\n(0.08)\n(0.14)\nNet earnings\n$\n6.85 \n$\n6.98 \n$\n4.31 \nEBITDA \n1\n$\n1,963.2 \n$\n2,025.4 \n$\n1,517.9 \nAdjusted EBITDA \n1\n$\n2,057.2 \n$\n2,011.3 \n$\n1,625.6 \nAverage Sales Price and Unit Shipments\nAggregates\nTons\n219.9 \n234.6 \n236.6 \nFreight-adjusted sales price\n$\n21.08 \n$\n19.02 \n$\n16.41 \nAsphalt Mix\nTons\n13.6 \n13.4 \n12.2 \nAverage sales price\n$\n80.09 \n$\n75.76 \n$\n71.29 \nReady-mixed concrete\nCubic yards\n3.6 \n7.5 \n10.5 \nAverage sales price\n$\n182.93 \n$\n166.95 \n$\n150.82 \n1\nNon-GAAP measures are defined and reconciled within this Item 7 under the caption \"\nReconciliation of Non-GAAP Financial\n \nMeasures\n.\"\nPart II\n39\nNet earnings attributable to Vulcan for 2024 were $911.9 million ($6.85 per diluted share) compared to $933.2 million ($6.98 per diluted share) in 2023. Each year's results were impacted by discrete items, as follows:\nNet earnings attributable to Vulcan for 2024 include:\n▪\npretax net gain of $36.7 million related to the sale of real estate in Virginia\n▪\npretax charges of $86.6 million associated with a goodwill impairment\n▪\npretax charges of $17.7 million for divested operations\n▪\npretax charges of $16.3 million associated with non-routine acquisitions\n▪\npretax loss on discontinued operations of $10.2 million\nNet earnings attributable to Vulcan for 2023 include:\n▪\npretax net gain of $67.1 million related to the sale of excess real estate and businesses\n▪\npretax charges of $28.3 million for long-lived asset impairments related to the sale of businesses\n▪\npretax charges of $7.9 million for divested operations\n▪\npretax charges of $2.1 million associated with non-routine acquisitions\n▪\npretax loss on discontinued operations of $14.7 million\n▪\n$12.9 million of tax charges related to a valuation allowance against Calica deferred tax assets, including net operating loss (NOL) carryforwards\nAdjusted for these discrete items, earnings attributable to Vulcan from continuing operations (Adjusted Diluted EPS) was $7.53 per diluted share for 2024 compared to $7.00 per diluted share for 2023. \nEARNINGS FROM CONTINUING OPERATIONS BEFORE INCOME TAXES\nYear-over-year changes in earnings from continuing operations before income taxes are summarized below:\n \nin millions\n2022\n$\n788.1 \n2023\n$\n1,245.1 \nHigher aggregates gross profit\n325.7 \n79.9 \nHigher asphalt gross profit\n92.3 \n20.5 \nLower concrete gross profit\n(27.2)\n(49.3)\nLower (higher) selling, administrative and general expenses\n(27.7)\n11.7 \nHigher (lower) gain on sale of property, plant & equipment and businesses\n65.7 \n(24.1)\nLower (higher) impairment charges\n39.6 \n(58.3)\nLower (higher) interest expense\n(26.9)\n9.3 \nLower (higher) acquisition related expenses\n8.4 \n(14.2)\nHigher environmental remediation expenses\n(1.4)\n(15.7)\nLower (higher) foreign currency transaction losses\n4.5 \n(16.5)\nAll other\n4.0 \n(16.3)\n2023\n$\n1,245.1 \n2024\n$\n1,172.1 \nPart II\n40\nOPERATING RESULTS BY SEGMENT\nWe present our results of operations by segment at the gross profit level. We have three operating (and reportable) segments organized around our principal product lines: (1) Aggregates, (2) Asphalt and (3) Concrete. Management reviews earnings for our reporting segments principally at the gross profit level.\n1.\nAGGREGATES\nSHIPMENTS\nin millions\nAggregates shipments decreased 6%, reflecting underlying demand as well as the impacts from severe weather events in the third quarter which were not all recovered during the fourth quarter of 2024.\nOur year-over-year freight-adjusted selling price\n1\n for aggregates:\n▪\nincreased 10.8% in 2024\n▪\nincreased 15.9% in 2023\n▪\nincreased 10.3% in 2022\n1\nWe routinely arrange the delivery of our aggregates to the customer. Additionally, we incur freight costs to move aggregates from the production site to remote distribution sites. These costs are passed on to our customers in the aggregates price. We remove these pass-through freight & delivery revenues (and any other aggregates-derived segment revenues, such as landfill tipping fees) from the freight-adjusted selling price for aggregates. See the \"\nReconciliation of Non-GAAP Financial Measures\n\"\n within this Item 7 for a reconciliation of freight-adjusted revenues.\nPart II\n41\nThe pricing environment remained positive. Freight-adjusted pricing increased 10.8% ($2.06 per ton) versus the prior year to $21.08, with all markets realizing year-over-year improvement. \nAGGREGATES GROSS PROFIT\nin millions\nAGGREGATES CASH GROSS PROFIT\nin millions\nAggregates segment gross profit increased 5% to $1,816.7 million (or $8.26 per ton), and gross profit margin expanded 120 basis points. Cash gross profit per ton increased 12% (or $1.15 per ton) from the prior year to $10.61 resulting from continued pricing growth and moderating cost trends. Improvements in unit profitability were widespread across our footprint.\nFreight-adjusted unit cash cost of sales increased 10%, or $0.91 per ton. Shipments in 2024 and 2023 were negatively impacted by the absence of tons available from our Mexico operations which were unexpectedly and arbitrarily shut down by the Mexican government in 2022 (f\nor additional information, see Note 12 “\nCommitments and Contingencies\n” in Item 8 “\nFinancial Statements and Supplementary D\nata\n”)\n. \n2\nASPHALT\nSHIPMENTS\nin millions\nAsphalt segment gross profit was $170.1 million (an increase of $20.5 million), and cash gross profit was $214.2 million, a 16% increase from the prior year. Shipments increased slightly, and pricing increased 5.7%, or $4.33 per ton. \nASPHALT GROSS PROFIT\nin millions\nASPHALT CASH GROSS PROFIT\nin millions\nOur year-over-year average sales price\n1\n for asphalt mix:\n•\nincreased 5.7% in 2024\n•\nincreased 6.3% in 2023\n•\nincreased 21.2% in 2022\n1\nAsphalt mix average sales price is calculated by dividing revenues generated from the shipment of asphalt mix by the total tons shipped. The sales price calculation excludes service revenues generated from our asphalt construction paving business.\nPart II\n42\n3.\nCONCRETE\nSHIPMENTS\nin millions\nConcrete segment gross profit was $12.8 million, a decrease of $49.3 million from the prior year which included earnings from our divested operations in Texas. Cash gross profit was $58.3 million, and unit cash gross profit was $16.35 per cubic yard.\nCONCRETE GROSS PROFIT\nin millions\nCONCRETE CASH GROSS PROFIT\nin millions\nOur year-over-year average sales price\n1\n for ready-mixed concrete:\n▪\nincreased 9.6% in 2024\n▪\nincreased 10.7% in 2023\n▪\nincreased 11.1% in 2022\n1\nReady-mixed concrete average sales price is calculated by dividing revenues generated from the shipment of ready-mixed concrete by the total cubic yards shipped. The sales price calculation excludes immaterial revenues generated from the sale of raw materials.\nPart II\n43\nSELLING, ADMINISTRATIVE AND GENERAL EXPENSES\nin millions\nAs a percentage of total revenues, SAG expense was:\n▪\n7.2% in 2024 — increased 20 basis points\n▪\n7.0% in 2023 — unchanged from the prior year\n▪\n7.0% in 2022 — decreased 50 basis points\nOur comparative headcount levels at year-end:\n▪\nincreased 9% in 2024\n▪\ndecreased 8% in 2023\n▪\nincreased 6% in 2022\nThe 2024 increase in our employment level was primarily the result of acquisitions (see Note 19 \"\nAcquisitions and Divestitures\n\" in\n Item 8 “\nFinancial Statements and Supplementary Data\n”). As noted above, \n2024\n \nSAG expense was $531.1 million, 2% lower than the prior year, or 7.2% as a percentage of total revenues. The current year includes overhead costs associated with acquisitions completed during the year. We expect to realize cost synergies in 2025 as the acquired operations become fully integrated.\nGAIN ON SALE OF PROPERTY, PLANT & EQUIPMENT AND BUSINESSES\nin millions\nThe 2024 gain on sale of property, plant & equipment and businesses of $52.3 million includes a pretax gain of $36.7 million from the sale of a former sales yard in Virginia. The 2023 gain on sale of property, plant & equipment and businesses of $76.4 million includes a pretax gain of $65.7 million from the sale of excess real estate in Virginia and a pretax gain of $15.2 million from the sale of real estate associated with a former recycled concrete facility in Illinois, partially offset by a pretax loss of $13.8 million related to the sale of our Texas concrete operations. We remain focused on our efforts to maximize the value of our portfolio of quarry operations as they move through their life-cycle of land management. For additional details, see Note 19 “\nAcquisitions and Divestitures\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.” \nLOSS ON IMPAIRMENTS\nLoss on impairments was $86.6 million in 2024 which represents a goodwill impairment charge related to a reporting unit that includes concrete operations acquired from U.S. Concrete in 2021. Loss on impairments was $28.3 million in 2023 which represents a long-lived asset impairment charge related to the Texas concrete operations that were sold during the fourth quarter of 2023.\nSee Note 18 “\nGoodwill and Intangible Assets\n” and Note 19 “\nAcquisitions and Divestitures\n” in Item 8 “\nFinancial Statements and\n \nSupplementary Data\n” for additional discussion.\nOTHER OPERATING EXPENSE, NET\nOther operating income (expense) is composed primarily of idle facilities expense, environmental remediation costs, gain (loss) on settlement of AROs, finance charges collected and rental income (expense). Total other operating expense and significant and/or discrete items included in the total were:\n▪\n$69.7 million in 2024 — includes the following:\n▪\n$17.7 million of charges associated with divested operations\n▪\n$8.5 million of charges associated with non-routine acquisitions (excludes items included in cost of revenues)\n▪\n$34.9 million of idle facilities expenses\n•\n$26.4 million in 2023 — includes the following:\n▪\n$7.9 million of charges associated with divested operations\n▪\n$1.6 million of charges associated with non-routine acquisitions (excludes items included in cost of revenues)\n▪\n$27.4 million of idle facilities expenses\nPart II\n44\nOTHER NONOPERATING INCOME (EXPENSE), NET\nOther nonoperating income (expense), net was $22.1 million of expense in 2024 and $2.7 million of expense in 2023, composed primarily of pension and postretirement benefit costs (excluding service costs), foreign currency transaction gains/losses, Rabbi Trust gains/losses and net earnings/losses of nonconsolidated equity method investments.\nINTEREST EXPENSE\nin millions\n \nInterest expense was $191.2 million in 2024 compared to $196.1 million in 2023. See Note 6 “\nDebt\n” in Item 8 “\nFinancial Statements and Supplementary Data\n” for additional discussion.\nINCOME TAXES\nOur income tax expense from continuing operations for the years ended December 31 is shown below:\ndollars in millions\n2024\n2023\n2022\nEarnings from continuing operations before income taxes\n$\n1,172.1 \n$\n1,245.1 \n$\n788.1 \nIncome tax expense\n$\n251.4 \n$\n299.4 \n$\n193.0 \nEffective tax rate\n21.4 \n%\n24.0 \n%\n24.5 \n%\nThe $48.0 million decrease in our 2024 income tax expense compared to 2023 was primarily related to a decrease in earnings from continuing operations and the income tax benefit recorded for the remeasurement of our deferred taxes at a new blended income tax rate. The $106.4 million increase in our 2023 income tax expense compared to 2022 was primarily related to an increase in earnings from continuing operations. \nDuring the fourth quarter of 2024, we determined that the rate at which our deferred tax liabilities will reverse has decreased, largely as a result of changes in our state tax profile from the Wake Stone acquisition. As a result, we remeasured our deferred tax liabilities and recorded a tax benefit of $21.9 million.\nIn May 2022, Mexican government officials unexpectedly and arbitrarily shut down our Calica operations in Mexico. In 2024, Calica had deferred tax assets (including NOLs) of $27.5 million. Although Calica continues to record losses, the devaluation of the Mexican peso during the year resulted in an immaterial change to its deferred tax assets in U.S. dollars. As a result, we recorded a charge to increase the valuation allowance by $0.1 million to $27.5 million in 2024. The Calica NOL deferred tax asset carryforward of $23.3 million would expire between 2032 and 2033 if not utilized. Should the Mexican government lift the shutdown and/or we are successful in our North American Free Trade Agreement (NAFTA) claim, we will reevaluate the need for a valuation allowance against the deferred tax assets.\nFor additional information, see Note 9 “\nIncome Taxes\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nPart II\n45\nDISCONTINUED OPERATIONS\nPretax loss from discontinued operations was: \n•\n$(10.2) million in 2024\n•\n$(14.7) million in 2023\n•\n$(25.2) million in 2022\nPretax loss from discontinued operations for 2024 and 2023 resulted primarily from general and product liability costs, including legal defense costs and environmental remediation costs associated with our former Chemicals business. In addition, 2022 includes a $15.3 million charge for a litigation matter (see Note 12 “\nCommitments and Contingencies\n” in Item 8 “\nFinancial Statements and\n \nSupplementary Data\n”). For additional information about discontinued operations, see Note 1 “\nSummary of Significant Accounting\n \nPolicies\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nKNOWN TRENDS OR UNCERTAINTIES\nInflationary pressures and labor constraints can be factors that impact our operations. Although inflationary pressures can create short-term to medium-term headwinds, the combination of inflation and visibility of demand may create a favorable environment for price increases. Additionally, labor constraints can cause delays and inefficiencies in our operations as well as those of our customers. If labor constraints continue, our operations may proceed at a slower pace, which may effectively extend the recovery while allowing us the opportunity to compound price, control costs and grow earnings.\nFurther, the Mexican government has taken actions adverse to our property and operations in Mexico. On May 5, 2022, Mexican government officials presented employees at our Calica operations in Quintana Roo, Mexico with arbitrary shutdown orders to immediately cease underwater quarrying and extraction operations. On May 13, 2022, the Mexican government suspended the three-year customs permit granted in March 2022 to Calica and began a proceeding that could result in the revocation of that permit. In September 2024, the Mexican government ordered the closure of Calica's already-suspended quarrying activities and the shutdown of certain activities at Calica's Punta Venado port facilities. On September 23, 2024, the President of Mexico signed a presidential decree declaring the entirety of Calica's properties as a \"Natural Protected Area\" (the \"ANP Decree\"). Among other provisions, the ANP Decree prohibits Calica from extracting petrous or construction materials from its properties. We strongly believe that the actions taken by Mexico are arbitrary and illegal, and we intend to vigorously pursue all lawful avenues available to us in order to protect our rights, under both Mexican and international law. For additional information regarding our Calica operations, see \nthe NAFTA Arbitration section in \nNote 12 “\nCommitments and Contingencies\n” in Item 8 “\nFinancial Statements and\n \nSupplementary Data\n.”\nPart II\n46\nRECONCILIATION OF NON-GAAP FINANCIAL MEASURES\nAGGREGATES SEGMENT FREIGHT-ADJUSTED REVENUES\nAggregates segment freight-adjusted revenues is not a Generally Accepted Accounting Principle (GAAP) measure and should not be considered as an alternative to metrics defined by GAAP. We present this measure as it is consistent with the basis by which we review our operating results. We believe that this presentation is consistent with our competitors and meaningful to our investors as it excludes revenues associated with freight & delivery, which are pass-through activities. It also excludes other revenues related to services, such as landfill tipping fees, that are derived from our aggregates business. Additionally, we use this metric as the basis for calculating the average sales price of our aggregates products. Reconciliation of this metric to its nearest GAAP measure is presented below:\nin millions, except per ton data\n2024\n2023\n2022\nAggregates segment\nSegment sales\n$\n5,949.6 \n$\n5,918.9 \n$\n5,280.6 \nFreight & delivery revenues \n1\n(1,220.1)\n(1,350.2)\n(1,291.3)\nOther revenues\n(93.3)\n(107.4)\n(106.3)\nFreight-adjusted revenues\n$\n4,636.2 \n$\n4,461.3 \n$\n3,883.0 \nUnit shipments - tons\n219.9\n234.6\n236.6\nFreight-adjusted sales price\n$\n21.08 \n$\n19.02 \n$\n16.41 \n1\nAt the segment level, freight & delivery revenues include intersegment freight & delivery (which are eliminated at the consolidated level) and freight to remote distribution sites.\nPart II\n47\nCASH GROSS PROFIT\nGAAP does not define “cash gross profit,” and it should not be considered as an alternative to earnings measures defined by GAAP. We and the investment community use this metric to assess the operating performance of our business. Additionally, we present this metric as we believe that it closely correlates to long-term shareholder value. Cash gross profit adds back noncash charges for depreciation, depletion, accretion and amortization to gross profit. Segment cash gross profit per unit is computed by dividing segment cash gross profit by units shipped. Segment cash cost of sales per unit is computed by subtracting segment cash gross profit per unit from segment freight-adjusted sales price. Segment freight-adjusted sales price is calculated by dividing revenues generated from the shipment of product (excluding service revenues generated by the segments) by the total units of the product shipped. Reconciliation of these metrics to their nearest GAAP measures are presented below:\nin millions, except per unit data\n2024\n2023\n2022\nAggregates segment\nGross profit\n$\n1,816.7 \n$\n1,736.8 \n$\n1,411.1 \nDepreciation, depletion, accretion and amortization\n515.7 \n482.3 \n441.3 \nCash gross profit\n$\n2,332.4 \n$\n2,219.1 \n$\n1,852.4 \nUnit shipments - tons\n219.9 \n234.6 \n236.6 \nGross profit per ton\n$\n8.26 \n$\n7.40 \n$\n5.96 \nFreight-adjusted sales price\n$\n21.08 \n$\n19.02 \n$\n16.41 \nCash gross profit per ton\n10.61 \n9.46 \n7.83 \nFreight-adjusted cash cost of sales per ton\n$\n10.47 \n$\n9.56 \n$\n8.58 \nAsphalt segment\nGross profit\n$\n170.1 \n$\n149.6 \n$\n57.3 \nDepreciation, depletion, accretion and amortization\n44.1 \n35.6 \n35.1 \nCash gross profit\n$\n214.2 \n$\n185.2 \n$\n92.4 \nUnit shipments - tons\n13.6 \n13.4 \n12.2 \nGross profit per ton\n$\n12.55 \n$\n11.16 \n$\n4.71 \nAverage sales price\n$\n80.09 \n$\n75.76 \n$\n71.29 \nCash gross profit per ton\n15.81 \n13.81 \n7.60 \nCash cost of sales per ton\n$\n64.28 \n$\n61.95 \n$\n63.69 \nConcrete segment\nGross profit\n$\n12.8 \n$\n62.1 \n$\n89.3 \nDepreciation, depletion, accretion and amortization\n45.5 \n72.8 \n83.1 \nCash gross profit\n$\n58.3 \n$\n134.9 \n$\n172.4 \nUnit shipments - cubic yards\n3.6 \n7.5 \n10.5 \nGross profit per cubic yard\n$\n3.60 \n$\n8.32 \n$\n8.48 \nAverage sales price\n$\n182.93 \n$\n166.95 \n$\n150.82 \nCash gross profit per cubic yard\n16.35 \n18.08 \n16.36 \nCash cost of sales per cubic yard\n$\n166.58 \n$\n148.87 \n$\n134.46 \nPart II\n48\nEBITDA AND ADJUSTED EBITDA\nGAAP does not define “Earnings Before Interest, Taxes, Depreciation and Amortization” (EBITDA), and it should not be considered as an alternative to earnings measures defined by GAAP. We use this metric to assess the operating performance of our business and as a basis for strategic planning and forecasting as we believe that it closely correlates to long-term shareholder value. We do not use this metric as a measure to allocate resources. We adjust EBITDA for certain items to provide a more consistent comparison of earnings performance from period to period. Reconciliation of this metric to its nearest GAAP measure is presented below (numbers may not foot due to rounding):\nin millions\n2024\n2023\n2022\nNet earnings attributable to Vulcan\n$\n911.9 \n$\n933.2 \n$\n575.6 \nIncome tax expense, including discontinued operations\n248.8 \n295.6 \n186.5 \nInterest expense, net of interest income\n170.3 \n179.6 \n168.4 \nDepreciation, depletion, accretion and amortization\n632.2 \n617.0 \n587.5 \nEBITDA\n$\n1,963.2 \n$\n2,025.4 \n$\n1,517.9 \nLoss on discontinued operations\n$\n10.2 \n$\n14.7 \n$\n25.2 \nGain on sale of real estate and businesses, net\n(36.7)\n(67.1)\n(6.1)\nLoss on impairments\n86.6 \n28.3 \n67.8 \nCharges associated with divested operations\n17.7 \n7.9 \n3.8 \nAcquisition related charges \n1\n16.3 \n2.1 \n17.1 \nAdjusted EBITDA\n$\n2,057.2 \n$\n2,011.3 \n$\n1,625.6 \n1\nRepresents charges associated with acquisitions requiring clearance under federal antitrust laws. Wake Stone acquisition related costs in 2024 include acquisition related expenses of $3.8 million and the cost impact of purchase accounting inventory valuations of $6.4 million. Superior acquisition related costs in 2024 include acquisition related expenses of $4.7 million (see \nNote 19\n for additional information).\nADJUSTED DILUTED EPS ATTRIBUTABLE TO VULCAN FROM CONTINUING OPERATIONS\nSimilar to our presentation of Adjusted EBITDA, we present Adjusted diluted earnings per share (EPS) attributable to Vulcan from continuing operations to provide a more consistent comparison of earnings performance from period to period. This metric\n \nis not defined by GAAP and should not be considered as an alternative to earnings measures defined by GAAP. Reconciliation of this metric to its nearest GAAP measure is presented below:\n2024\n2023\n2022\nDiluted Earnings Per Share\nNet earnings attributable to Vulcan\n$\n6.85 \n$\n6.98 \n$\n4.31 \nItems included in Adjusted EBITDA above, net of tax\n0.68 \n(0.08)\n0.69 \nNOL carryforward valuation allowance\n0.00 \n0.10 \n0.11 \nAdjusted diluted EPS attributable to Vulcan from continuing operations\n$\n7.53 \n$\n7.00 \n$\n5.11 \nNET DEBT TO ADJUSTED EBITDA\nNet debt to Adjusted EBITDA is not a GAAP measure and should not be considered as an alternative to metrics defined by GAAP. We, the investment community and credit rating agencies use this metric to assess our leverage. Net debt subtracts cash and cash equivalents and restricted cash from total debt. Reconciliation of this metric to its nearest GAAP measure is presented below:\nin millions\n2024\n2023\nCurrent maturities of long-term debt\n$\n400.5 \n$\n0.5 \nLong-term debt\n4,906.9 \n3,877.3 \nTotal debt\n$\n5,307.4 \n$\n3,877.8 \nCash and cash equivalents and restricted cash\n(600.8)\n(949.2)\nNet debt\n$\n4,706.6 \n$\n2,928.6 \nAdjusted EBITDA\n$\n2,057.2 \n$\n2,011.3 \nTotal Debt to Adjusted EBITDA\n2.6x\n1.9x\nNet Debt to Adjusted EBITDA\n2.3x\n1.5x\nPart II\n49\nRETURN ON INVESTED CAPITAL\nWe define “Return on Invested Capital” (ROIC) as Adjusted EBITDA for the trailing-twelve months divided by average invested capital (as illustrated below) during the trailing-five quarters. Our calculation of ROIC is considered a non-GAAP financial measure because we calculate ROIC using the non-GAAP metric EBITDA. We believe that our ROIC metric is meaningful because it helps investors assess how effectively we are deploying our assets. Although ROIC is a standard financial metric, numerous methods exist for calculating a company’s ROIC. As a result, the method we use to calculate our ROIC may differ from the methods used by other companies. This metric\n \nis not defined by GAAP and should not be considered as an alternative to earnings measures defined by GAAP. Reconciliation of this metric to its nearest GAAP measure is presented below (numbers may not foot due to rounding):\ndollars in millions\n2024\n2023\n2022\nAdjusted EBITDA\n$\n2,057.2 \n$\n2,011.3 \n$\n1,625.6 \nAverage invested capital\nProperty, plant & equipment, net\n$\n6,743.6 \n$\n6,106.3 \n$\n5,810.4 \nGoodwill\n3,567.6 \n3,626.5 \n3,708.5 \nOther intangible assets\n1,506.4 \n1,593.4 \n1,737.5 \nFixed and intangible assets\n$\n11,817.6 \n$\n11,326.2 \n$\n11,256.4 \nCurrent assets\n$\n2,177.5 \n$\n2,192.9 \n$\n1,898.8 \nCash and cash equivalents\n(479.2)\n(352.8)\n(161.3)\nCurrent tax\n(37.2)\n(32.7)\n(47.2)\nAdjusted current assets\n1,661.1 \n1,807.4 \n1,690.3 \nCurrent liabilities\n(860.7)\n(833.7)\n(1,002.1)\nCurrent maturities of long-term debt\n80.5 \n0.5 \n2.1 \nShort-term debt\n19.0 \n20.0 \n137.6 \nAdjusted current liabilities\n(761.2)\n(813.2)\n(862.4)\nAdjusted net working capital\n$\n899.9 \n$\n994.2 \n$\n827.9 \nAverage invested capital\n$\n12,717.5 \n$\n12,320.4 \n$\n12,084.3 \nReturn on invested capital\n16.2 \n%\n16.3 \n%\n13.5 \n%\n2025 PROJECTED EBITDA\nProjected EBITDA\n \nis not defined by GAAP and should not be considered as an alternative to earnings measures defined by GAAP. Reconciliation of this metric to its nearest GAAP measure is presented below:\nin millions\n2025 Projected Mid-Point \n1\nNet earnings attributable to Vulcan\n$\n1,090 \nIncome tax expense, including discontinued operations\n315 \nInterest expense, net of interest income\n245 \nDepreciation, depletion, accretion and amortization\n800 \nProjected EBITDA\n$\n2,450 \n1\nSee the Market Developments and Outlook section (earlier within this Item 7) for the assumptions used to build this projection.\nBecause GAAP financial measures on a forward-looking basis are not accessible, and reconciling information is not available without unreasonable effort, we have not provided reconciliations for forward-looking non-GAAP measures, other than the reconciliation of Projected EBITDA as noted above. For the same reasons, we are unable to address the probable significance of the unavailable information, which could be material to future results.\nPart II\n50\nLIQUIDITY AND FINANCIAL RESOURCES\nOur primary sources of liquidity are cash provided by our operating activities, a substantial, committed bank line of credit and our commercial paper program. Additional sources of capital include access to the capital markets, the sale of surplus real estate and dispositions of nonstrategic operating assets. We believe these financial resources are sufficient to fund our business requirements for 2025, including:\n▪\ncontractual obligations\n▪\ncapital expenditures\n▪\ndebt service obligations\n▪\ndividend payments\n▪\npotential acquisitions\n▪\npotential share repurchases\nOur future contractual payments as of December 31, 2024 are summarized in the table below:\nNote\nReference\nPayments Due by Year\nin millions\n2025\n2026-2029\nThereafter\nTotal\nContractual Obligations\nBank line of credit\nPrincipal payments\nNote 6\n$\n0.0 \n$\n0.0 \n$\n0.0 \n$\n0.0 \nInterest payments and fees\n1\nNote 6\n2.8 \n10.4 \n0.0 \n13.2 \nCommercial paper\nPrincipal payments\nNote 6\n0.0 \n550.0 \n0.0 \n550.0 \nInterest payments\nNote 6\n24.8 \n81.9 \n0.0 \n106.7 \nTerm debt\nPrincipal payments\nNote 6\n400.5 \n900.4 \n3,540.2 \n4,841.1 \nInterest payments\nNote 6\n222.9 \n829.9 \n2,359.8 \n3,412.6 \nOperating leases \n2\nNote 7\n74.9 \n194.3 \n210.4 \n479.6 \nFinance leases \n2\nNote 7\n10.9 \n9.9 \n0.0 \n20.8 \nMineral royalties\nNote 12\n27.5 \n73.4 \n136.7 \n237.6 \nUnconditional purchase obligations\nCapital\nNote 12\n78.2 \n0.0 \n0.0 \n78.2 \nNoncapital \n3\nNote 12\n42.4 \n98.4 \n6.0 \n146.8 \nBenefit plans \n4\nNote 10\n18.5 \n51.2 \n45.1 \n114.8 \nTotal contractual obligations \n5\n$\n903.4 \n$\n2,799.8 \n$\n6,298.2 \n$\n10,001.4 \n1\nIncludes fees for unused borrowing capacity and fees for standby letters of credit. The figures for all years assume that the amount of unused borrowing capacity and the amount of standby letters of credit do not change from December 31, 2024.\n2\nExcludes lease renewal options which are included in the table labeled Maturity of Lease Liabilities in Note 7 “\nLeases\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\n3\nNoncapital unconditional purchase obligations relate primarily to transportation and electricity contracts.\n4\nPayments in “Thereafter” column for benefit plans are for the years 2030-2034. The future contributions are based on current economic conditions and may vary based on future interest rates, asset performance, participant longevity and other plan experience.\n5\nExcludes discounted asset retirement obligations in the amount of $427.4 million at December 31, 2024, the majority of which have an estimated settlement date beyond 2029 (see Note 17 “\nAsset Retirement Obligations\n” in Item 8 “\nFinancial Statements and Supplementary Data\n”).\nDuring 2025, we expect to spend between $750 million and $800 million in total on capital expenditures, including growth projects.\nAs of December 31, 2024, we were contingently liable for $863.6 million within 463 surety bonds underwritten by various surety companies. These bonds guarantee our performance and are required primarily by states and municipalities and their related agencies. The top five in amount totaled $210.8 million (24%) and were for certain construction contracts and reclamation obligations. We have agreed to indemnify the underwriting companies against any exposure under the surety bonds. No material claims have been made against our surety bonds.\nWe have no material off-balance sheet arrangements, such as financing or unconsolidated variable interest entities.\nOur balanced approach to capital deployment remains unchanged. We intend to balance reinvestment in our business, growth through acquisitions and return of capital to shareholders, while sustaining financial strength and flexibility.\nPart II\n51\nWe actively manage our capital structure and resources in order to balance the cost of capital and the risk of financial stress. We seek to meet these objectives by adhering to the following principles:\n▪\nmaintain substantial bank line of credit borrowing capacity\n▪\nproactively manage our debt maturity schedule such that repayment/refinancing risk in any single year is low\n▪\nmaintain an appropriate balance of fixed-rate and floating-rate debt\n▪\nminimize financial and other covenants that limit our operating and financial flexibility\nWe will continue to assess our liquidity sources and needs in order to take appropriate actions to meet our objectives.\nCASH\nIncluded in our \nDecember 31, 2024\n cash and cash equivalents and restricted cash balances of \n$600.8 million\n is \n$41.1 million\n of restricted cash (see Note 1 “\nSummary of Significant Accounting Policies\n” in Item 8 “\nFinancial Statements and Supplementary Data\n” under the caption \"Restricted Cash\").\nCASH FROM OPERATING ACTIVITIES\nin millions\nNet cash provided by operating activities is derived primarily from net earnings before noncash deductions for depreciation, depletion, accretion and amortization.\nin millions\n2024\n2023\n2022\nNet earnings\n$\n913.1 \n$\n934.9 \n$\n576.5 \nDepreciation, depletion, accretion and amortization\n632.2 \n617.0 \n587.5 \nLoss on impairments\n86.6 \n28.3 \n67.9 \nNoncash operating lease expense\n51.4 \n53.9 \n60.3 \nNet gain on sale of property, plant & equipment and businesses\n(52.3)\n(76.4)\n(10.7)\nDeferred income taxes, net\n(9.4)\n(43.3)\n57.7 \nOther operating cash flows, net \n1\n(212.0)\n22.4 \n(191.0)\nNet cash provided by operating activities\n$\n1,409.6 \n$\n1,536.8 \n$\n1,148.2 \n \n1\nPrimarily reflects changes to working capital balances.\n2024 VERSUS 2023 — Net cash provided by operating activities was $1,409.6 million during 2024, a $127.2 million decrease compared to 2023 which primarily resulted from changes in working capital balances.\nDays sales outstanding, a measurement of the time it takes to collect receivables, were 45.6 days at December 31, 2024 compared to 46.1 days at December 31, 2023. Our over 90 day receivables balance of $29.6 million at December 31, 2024 was $2.0 million higher than the December 31, 2023 balance of $27.6 million. All customer accounts are actively managed, and no losses in excess of amounts reserved are currently expected.\nPart II\n52\nCASH FROM INVESTING ACTIVITIES\nin millions\n2024 VERSUS 2023 — Net cash used for investing activities was $2,814.9 million during 2024, a $2,651.4 million increase compared to 2023. During 2024, we acquired businesses for $2,266.2 million of cash consideration whereas there were no business acquisitions in 2023. Additionally, proceeds from the sale of property, plant & equipment and businesses were down $653.3 million in 2024 from the prior year, which includes cash proceeds from the sale of our concrete operations in Texas and the collection of a note receivable related to the 2022 sale of concrete operations in New Jersey, New York and Pennsylvania (see Note 19 “\nAcquisitions and Divestitures\n” in Item 8 “\nFinancial Statements and Supplementary Data\n” for further information). Partially offsetting these net increases to cash used for investing activities, during 2024, we invested $603.5 million in our existing operations (includes changes in accruals for property, plant & equipment), a $269.1 million decrease compared to 2023. This $603.5 million investment includes both maintenance and internal growth projects to enhance our distribution capabilities, develop new production sites and improve existing production facilities.\nCASH FROM FINANCING ACTIVITIES\nin millions\n2024 VERSUS 2023 — Net cash provided by financing activities in 2024 was $1,056.9 million, compared to $585.6 million of cash used in 2023. The current year includes proceeds of $2,000.0 million from the issuance of senior notes and cash paid to redeem the $550.0 million senior notes due 2026 (see Note 6 \"\nDebt\n\" in Item 8 “\nFinancial Statements and Supplementary Data\n”). The prior year includes a $100.0 million net payment on our line of credit. Additionally, we returned $313.2 million to shareholders (a $115.2 million decrease compared to the prior year due to lower share repurchases) through $244.4 million of dividends ($1.84 per share compared to $1.72 per share) and $68.8 million of common stock repurchases (270,142 shares repurchased at $254.71 average price per share compared to 977,591 shares repurchased at $204.52 average price per share).\nPart II\n53\nDEBT\nCertain debt measures as of December 31 are outlined below:\ndollars in millions\n2024\n2023\nDebt\nCurrent maturities of long-term debt\n$\n400.5 \n$\n0.5 \nLong-term debt\n4,906.9 \n3,877.3 \nTotal debt\n$\n5,307.4 \n$\n3,877.8 \nCapital\nTotal debt\n$\n5,307.4 \n$\n3,877.8 \nTotal equity\n8,142.5 \n7,507.9 \nTotal capital\n$\n13,449.9 \n$\n11,385.7 \nTotal Debt as a Percentage of Total Capital\n39.5 \n%\n34.1 \n%\nWeighted-Average Effective Interest Rates\nLine of credit \n1\n1.13 \n%\n1.13 \n%\nCommercial paper\n4.65 \n%\n5.64 \n%\nTerm debt\n5.00 \n%\n4.82 \n%\nFixed Versus Floating Interest Rate Debt\nFixed-rate debt\n89.8 \n%\n72.1 \n%\nFloating-rate debt\n10.2 \n%\n27.9 \n%\n1\nReflects the margin above SOFR for SOFR-based borrowings; we also paid upfront fees that are amortized to interest expense and pay fees for unused borrowing capacity and standby letters of credit.\nAt December 31, 2024, total debt to Adjusted EBITDA was 2.6 times (2.3 times on a net debt basis reflecting $600.8 million of cash on hand). Our weighted-average debt maturity was 12.6 years, and our total weighted-average effective interest rate was 4.97%.\nLINE OF CREDIT AND COMMERCIAL PAPER PROGRAM\nOur $1,600.0 million commercial paper program was established in August 2022 and matures in November 2029. Commercial paper borrowings bear interest at rates determined at the time of borrowing and as agreed between us and the commercial paper investors. As of December 31, 2024, we had $550.0 million in long-term commercial paper borrowings. \nOur $1,600.0 million unsecured line of credit was amended in November 2024 to extend the maturity date from August 2027 to November 2029. Our line of credit contains covenants customary for an unsecured investment-grade facility. Covenants, borrowings, cost ranges and other details are described in Note 6 “\nDebt\n” in Item 8 “\nFinancial\n \nStatements and Supplementary Data\n.” As of December 31, 2024, we were in compliance with the line of credit covenants, the margin for Secured Overnight Financing Rate (SOFR) borrowings was 1.125%, the margin for base rate borrowings was 0.125% and the commitment fee for the unused amount was 0.100%.\nAs of December 31, 2024, our available borrowing capacity under the line of credit was $1,504.8 million. Utilization of the borrowing capacity was as follows:\n▪\nNone was borrowed\n▪\n$95.2 million was used to support standby letters of credit\nTERM DEBT\nAll of our $5,391.1 million (face value) of term debt (which includes the $550.0 million commercial paper) is unsecured. All of the covenants in the debt agreements are customary for investment-grade facilities. As of December 31, 2024, we were in compliance with all term debt covenants.\nIn March 2023, we issued $550.0 million of 5.80% senior notes due 2026. We redeemed these notes at par in March 2024 using cash on hand and recognized noncash expense of $2.3 million with the acceleration of unamortized deferred debt issuance costs.\nIn November 2024, we entered into a $2,000.0 million unsecured delayed draw term loan which was partially drawn in November 2024 upon the acquisition of Wake Stone. Subsequently, the delayed draw term loan balance was fully repaid and terminated in November 2024 using proceeds from the issuance of senior notes as described below.\nIn November 2024, we issued $500.0 million of 4.95% senior notes due 2029, $750.0 million of 5.35% senior notes due 2034 and $750.0 million of 5.70% senior notes due 2054. Total proceeds of $1,975.0 million (net of discounts and transaction costs), together with cash on hand, were used to repay the outstanding balance on the $2,000.0 million delayed draw term loan and to provide liquidity for acquisitions and debt maturing in 2025.\nFor additional information regarding term debt, see Note 6 “\nDebt\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nPart II\n54\nDEBT PAYMENTS AND MATURITIES\nScheduled debt payments during 2024 and 2023 were $0.5 million in the first quarter of each year. As of December 31, 2024, maturities for the next four quarters and for the next five years are as follows (excluding any borrowings on the line of credit):\n \nin millions\n2025 Debt Maturities\nin millions\nDebt Maturities\nFirst Quarter\n$\n0.5 \n2025\n$\n400.5 \nSecond Quarter\n400.0 \n2026\n0.4 \nThird Quarter\n0.0 \n2027\n400.0 \nFourth Quarter\n0.0 \n2028\n0.0 \n2029\n1,050.0 \nSubsequent to year end, in February 2025 we delivered a notice of redemption to holders of our 4.50% senior notes due 2025, providing for the full redemption of the $400.0 million aggregate principal amount of these notes. We expect to complete this redemption in March 2025 using existing cash on hand.\nFor additional information regarding debt payments and maturities, see Note 6 “\nDebt\n” in Item 8 “\nFinancial Statements and\n \nSupplementary Data\n.”\nDEBT RATINGS\nOur debt ratings and outlooks as of December 31, 2024 are as follows:\nShort-term\nLong-term\nOutlook\nFitch\nF2\nBBB\nPositive\nMoody's\nP-2\nBaa2\nStable\nStandard & Poor's\nA-2\nBBB+\nStable\nEQUITY\nThe number of our common stock issuances and purchases are as follows:\nin millions\n2024\n2023\n2022\nCommon stock shares at January 1, issued and outstanding\n132.1\n132.9\n132.7\nCommon stock issued for share-based compensation plans\n0.3\n0.2\n0.2\nCommon stock purchased and retired\n(0.3)\n(1.0)\n0.0\nCommon stock shares at December 31, issued and outstanding\n132.1\n132.1\n132.9\nAs of December 31, 2024, there were 6,817,118 shares remaining under the February 2017 share purchase authorization by our Board of Directors. Depending upon market, business, legal and other conditions, we may purchase shares from time to time through the open market (including plans designed to comply with Rule 10b5-1 of the Securities Exchange Act of 1934) and/or privately negotiated transactions. The authorization has no time limit, does not obligate us to purchase any specific number of shares and may be suspended or discontinued at any time.\nThe detail of our common stock purchases (all of which were open market purchases) are as follows:\nin millions, except average cost\n2024\n2023\n2022\nNumber of shares purchased and retired\n0.3\n1.0\n0.0\nTotal purchase price\n$\n68.8 \n$\n200.0 \n$\n0.0 \nAverage cost per share\n$\n254.71 \n$\n204.52 \n$\n0.00 \nThere were no shares held in treasury as of December 31, 2024, 2023 and 2022.\nPart II\n55\nSTANDBY LETTERS OF CREDIT\nFor a discussion of our standby letters of credit, see Note 6 “\nDebt\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.\"\nCRITICAL ACCOUNTING POLICIES\nWe follow certain significant accounting policies when preparing our consolidated financial statements. A summary of these policies is included in Note 1 “\nSummary of Significant Accounting Policies\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nWe prepare these financial statements to conform with accounting principles generally accepted in the United States of America. These principles require us to make estimates and judgments that affect reported amounts of assets, liabilities, revenues and expenses, and the related disclosures of contingent assets and contingent liabilities at the date of the financial statements. We base our estimates on historical experience, current conditions and various other assumptions we believe reasonable under existing circumstances and evaluate these estimates and judgments on an ongoing basis. The results of these estimates form the basis for our judgments about the carrying values of assets and liabilities as well as identifying and assessing the accounting treatment with respect to commitments and contingencies. Our actual results may materially differ from these estimates.\nWe believe the following critical accounting policies require the most significant judgments and estimates used in the preparation of our consolidated financial statements:\n1.\nGoodwill impairment\n2.\nImpairment of long-lived assets excluding goodwill\n3.\nBusiness combinations and purchase price allocation\n4.\nPension and other postretirement benefits\n5.\nEnvironmental compliance costs\n6.\nClaims and litigation including self-insurance\n7.\nIncome taxes\n1.\nGOODWILL IMPAIRMENT\nGoodwill represents the excess of the cost of net assets acquired in business combinations over the fair value of the identifiable tangible and intangible assets acquired and liabilities assumed in a business combination. Goodwill impairment exists when the fair value of a reporting unit is less than its carrying amount. Goodwill is tested for impairment annually, as of November 1, or more frequently whenever events or changes in circumstances would more likely than not reduce the fair value of a reporting unit below its carrying amount. The impairment evaluation is a critical accounting policy because goodwill is material to our total assets (as of December 31, 2024, goodwill represents 22% of total assets), and the evaluation involves the use of significant estimates, assumptions and judgment.\nHOW WE TEST GOODWILL FOR IMPAIRMENT\nGoodwill is tested for impairment at the reporting unit level, one level below our operating segments. We have identified 14 reporting units (of which 10 carry goodwill) based primarily on geographic location. We have the option of either assessing qualitative factors to determine whether it is more likely than not that the carrying value of our reporting units exceeds their respective fair value or proceeding directly to a quantitative test. We elected to perform the quantitative impairment test for all years presented.\nThe quantitative impairment test compares the fair value of a reporting unit to its carrying value, including goodwill. If the fair value exceeds its carrying value, the goodwill of the reporting unit is not considered impaired. However, if the carrying value of a reporting unit exceeds its fair value, we recognize an impairment loss equal to that excess.\nHOW WE DETERMINE CARRYING VALUE AND FAIR VALUE\nWe determine the carrying value of each reporting unit by assigning assets and liabilities, including goodwill, to those units as of the measurement date. We estimate the fair values of the reporting units using both an income approach (which involves discounting estimated future cash flows) and a market approach (which involves the application of revenue and EBITDA multiples of comparable companies). We consider market factors when determining the assumptions and estimates used in our valuation models. Finally, to assess the reasonableness of the reporting unit fair values, we compare the total of the reporting unit fair values to our market capitalization.\nPart II\n56\nOUR FAIR VALUE ASSUMPTIONS\nWe base our fair value estimates on market participant assumptions we believe to be reasonable at the time, but such assumptions are subject to inherent uncertainty and actual results may differ. Changes in key assumptions or management judgment with respect to a reporting unit or its prospects may result from a change in market conditions, market trends, interest rates or other factors outside of our control, or underperformance relative to historical or projected operating results. These conditions could result in a significantly different estimate of the fair value of our reporting units which could result in an impairment charge in the future.\nThe significant assumptions in our discounted cash flow models include our estimate of future profitability, capital requirements and the discount rate. The profitability estimates used in the models were derived from internal operating budgets and forecasts for long-term demand and pricing in our industry. Estimated capital requirements reflect replacement capital estimated on a per unit basis and, if applicable, acquisition capital necessary to support growth estimated in the models. The discount rate was derived using a capital asset pricing model.\nRESULTS OF OUR IMPAIRMENT TESTS\nPrior to our annual impairment test in 2022, we recorded an interim goodwill impairment loss of $50.9 million related to the sale of a reporting unit comprised of concrete operations in New Jersey, New York and Pennsylvania. The results of our annual impairment test for 2022 indicated that the estimated fair values of two other Concrete segment reporting units exceeded carrying values by less than 15%. One of those Concrete segment reporting units was sold during the fourth quarter of 2023. The results of our annual impairment test for 2023 indicated that the estimated fair value of the other Concrete segment reporting unit exceeded carrying value by less than 5%. During the third quarter of 2024, we determined that a triggering event had occurred with respect to this reporting unit. Based on an interim goodwill impairment test, we determined that the estimated fair value of this reporting unit was less than its carrying value. As a result, we recorded an $86.6 million noncash impairment charge. The results of our annual impairment test for 2024 indicated that the estimated fair values of all reporting units with goodwill substantially exceeded their carrying values.\nFor additional information about goodwill, see Note 18 “\nGoodwill and Intangible Assets\n” and Note 19 “\nAcquisitions and Divestitures\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.\n”\n2.\nIMPAIRMENT OF LONG-LIVED ASSETS EXCLUDING GOODWILL\nWe evaluate the carrying value of long-lived assets, including intangible assets subject to amortization, when events and circumstances indicate that the carrying value may not be recoverable. The impairment evaluation is a critical accounting policy because long-lived assets are material to our total assets (as of December 31, 2024, net property, plant & equipment represents 49% of total assets while net other intangible assets represents 10% of total assets), and the evaluation involves the use of significant estimates, assumptions and judgment. The carrying value of long-lived assets is considered impaired when the estimated undiscounted cash flows from such assets are less than their carrying value. In that event, we perform a fair value analysis and recognize a loss equal to the amount by which the carrying value exceeds the fair value.\nFair value is estimated primarily by using a discounted cash flow methodology that requires considerable judgment and assumptions. Our estimate of net future cash flows is based on historical experience and assumptions of future trends which may be different from actual results. We periodically review the appropriateness of the estimated useful lives of our long-lived assets.\nWe test long-lived assets for impairment at a significantly lower level than the level at which we test goodwill for impairment. In markets where we do not produce downstream products (e.g., asphalt mix and ready-mixed concrete), the lowest level of largely independent identifiable cash flows is at the individual aggregates operation or a group of aggregates operations collectively serving a local market or remote markets through our rail and water distribution networks. Conversely, in vertically integrated markets, the cash flows of our downstream and upstream businesses are not largely independently identifiable as the selling price of the upstream products (aggregates) impacts the profitability of the downstream business.\nDuring 2024, we recorded no significant losses on impairment of long-lived assets. During the third quarter of 2023, we recognized a long-lived asset impairment loss of $28.3 million for assets classified as held for sale (subsequently sold during the fourth quarter). In addition, during the third quarter of 2022, we recognized a long-lived asset impairment loss of $16.9 million for assets classified as held for sale (subsequently sold during the fourth quarter of 2022). Refer to Note 19 “\nAcquisitions and Divestitures\n” in Item 8 “\nFinancial Statements and Supplementary Data\n” for further information.  \nWe maintain certain long-lived assets that are not currently being used in our operations. These assets totaled $609.1 million at December 31, 2024, representing a 14% increase from December 31, 2023. Of the total $609.1 million, approximately 35% relates to real estate held for future development and expansion of our operations. In addition, approximately 15% is comprised of real estate (principally former mining sites) pending development as commercial or residential real estate, reservoirs or landfills. The remaining 50% is composed of aggregates, asphalt and concrete operating assets idled temporarily. We evaluate the useful lives and the recoverability of these assets whenever events or changes in circumstances indicate that carrying amounts may not be recoverable.\nFor additional information about long-lived assets and intangible assets, see Note 4 “\nProperty, Plant & Equipment\n” and Note 18 “\nGoodwill and Intangible Assets\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nPart II\n57\n3.\nBUSINESS COMBINATIONS AND PURCHASE PRICE ALLOCATION\nOur strategic long-term plans include potential investments in value-added acquisitions of related or similar businesses. When an acquisition is completed, our consolidated statements of comprehensive income include the operating results of the acquired business starting from the date of acquisition, which is the date that control is obtained.\nHOW WE DETERMINE AND ALLOCATE THE PURCHASE PRICE\nThe purchase price is determined based on the fair value of consideration transferred to and liabilities assumed from the seller as of the date of acquisition. We allocate the purchase price to the fair values of the tangible and identifiable intangible assets acquired and liabilities assumed as of the date of acquisition. Goodwill is recorded for the excess of the purchase price over the net fair value of the identifiable assets acquired and liabilities assumed. The purchase price allocation is a critical accounting policy because the estimation of fair values of acquired assets and assumed liabilities is judgmental and requires various assumptions. Additionally, the amounts assigned to depreciable and amortizable assets compared to amounts assigned to goodwill, which is not amortized, can significantly affect our results of operations.\nFair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction and therefore represents an exit price. A fair value measurement assumes the highest and best use of the asset by market participants. The fair value hierarchy prioritizes the inputs to valuation techniques used to measure fair value into three broad levels as described below:\nLevel 1:\n Quoted prices in active markets for identical assets or liabilities\nLevel 2:\n Inputs that are derived principally from or corroborated by observable market data\nLevel 3:\n Inputs that are unobservable and significant to the overall fair value measurement\nLevel 1 fair values are used to value investments in publicly-traded entities and assumed obligations for publicly-traded long-term debt.\nLevel 2 fair values are typically used to value acquired machinery and equipment, land, buildings, and assumed liabilities for asset retirement obligations, environmental remediation and compliance obligations. Additionally, Level 2 fair values are typically used to value assumed contracts at other-than-market rates.\nLevel 3 fair values are used to value acquired mineral reserves as well as leased mineral interests (referred to in our financial statements as contractual rights in place) and other identifiable intangible assets. We determine the fair values of owned mineral reserves and leased mineral interests using a lost profits approach and/or an excess earnings approach. These valuation techniques require management to estimate future cash flows. The estimate of future cash flows is based on available historical information and future expectations and assumptions determined by management but is inherently uncertain. Key assumptions in estimating future cash flows include sales price, shipment volumes, production costs and capital needs. The present value of the projected net cash flows represents the fair value assigned to mineral reserves and mineral interests. The discount rate is a significant assumption used in the valuation model and is based on the required rate of return that a hypothetical market participant would assume if purchasing the acquired business, with an adjustment for the risk of these assets not generating the projected cash flows. \nOther identifiable intangible assets may include, but are not limited to, patents, tradenames and trademarks. The fair values of these assets are typically determined by an excess earnings method, a replacement cost method or a market approach.\nMEASUREMENT PERIOD ADJUSTMENTS\nWe may adjust the amounts recognized in an acquisition during a measurement period after the acquisition date. Any such adjustments are the result of subsequently obtaining additional information that existed at the acquisition date regarding the assets acquired or the liabilities assumed. Measurement period adjustments are generally recorded as increases or decreases to goodwill, if any, recognized in the transaction. The cumulative impact of measurement period adjustments on depreciation, amortization and other income statement items are recognized in the period the adjustment is determined. The measurement period ends once we have obtained all necessary information that existed as of the acquisition date but does not extend beyond one year from the date of acquisition. Any adjustments to assets acquired or liabilities assumed beyond the measurement period, unless as a result of an error, are recorded through earnings.\nFor additional information about business combinations and purchase price allocations, see Note 19 “\nAcquisitions and Divestitures\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nPart II\n58\n4.\nPENSION AND OTHER POSTRETIREMENT BENEFITS\nAccounting for pension and other postretirement benefits requires that we use assumptions for the valuation of projected benefit obligations (PBO) and the performance of plan assets. The valuation is a critical accounting policy because pension and other postretirement benefit obligations and plan assets are material to our balance sheet. Each year, we review our assumptions for discount rates (used for PBO, service cost and interest cost calculations), expected return on plan assets and the cost of covered healthcare benefits. Due to plan changes made in 2013, annual pay increases do not materially impact plan obligations.\n▪\nDiscount Rates — We use a high-quality bond full yield curve approach (specific spot rates for each annual expected cash flow) to establish the discount rates at each measurement date.\n▪\nExpected Return on Plan Assets — Our expected return on plan assets is a long-term view based on our current asset allocation and a judgment informed by consultation with our retirement plans’ consultant and our pension plans’ actuary. \n▪\nRate of Increase in the Per Capita Cost of Covered Healthcare Benefits — We project the expected increases in the cost of covered healthcare benefits.\nRefer to Note 10 “\nBenefit Plans\n” in Item 8 “\nFinancial Statements and Supplementary Data\n” for the discount rates used for PBO, service cost and interest cost calculations; the expected return on plan assets; and the rate of increase in the per capita cost of healthcare benefits.\nChanges to the assumptions listed above would have an impact on the PBO and the annual net benefit cost. The following table reflects the favorable and unfavorable outcomes associated with a change in certain assumptions:\n(Favorable) Unfavorable\n0.5 Percentage Point Increase\n0.5 Percentage Point Decrease\nin millions\nInc (Dec) in\nBenefit Obligation\nInc (Dec) in\nAnnual Benefit Cost\nInc (Dec) in\nBenefit Obligation\nInc (Dec) in\nAnnual Benefit Cost\nActuarial Assumptions\nDiscount rates\nPension\n$\n(28.1)\n$\n0.2 \n$\n30.5 \n$\n(0.2)\nOther postretirement benefits\n(1.4)\n(0.2)\n1.5 \n0.2 \nExpected return on plan assets\nnot applicable\n(2.9)\nnot applicable\n2.9 \nAs of the December 31, 2024 measurement date, the fair value of our pension plan assets decreased from $647.9 million for the prior year-end to $607.1 million primarily due to an increase in the level of intermediate and long-term bond yields during the year.\nThe discount rate is the weighted-average of the spot rates for each cash flow on the yield curve for high-quality bonds as of the measurement date. As of the \nDecember 31, 2024\n measurement date, the PBO of o\nur pension plans decreased from $693.3 million to $640.8 million. This decrease was primarily due to the increase in discount rates for the plans (approximately 0.7 percentage points). The PBO of our postretirement plans decreased from $44.2 million to $42.2 million. This decrease was primarily due to the increase in discount rates for the plans (approximately 0.6 percentage points) and favorable claims experience.\nDuring \n2025\n, we expect to recognize net pension expense of $8.9 million and net postretirement expense of $4.9 million compared to expense of \n$13.2 million\n and expense of \n$5.1 million\n, respectively, in \n2024\n. The expected decrease in pension expense is primarily due to the increase in the expected return on plan assets, and the expected decrease in postretirement expense is primarily due to the increase in discount rates and favorable claims experience.\nWe anticipate that contributions totaling approximately \n$9.6 million\n to the funded pension plans will be required during \n2025\n, and we do not anticipate making a discretionary contribution. We currently do not anticipate that the funded status of any of our plans will fall below statutory thresholds requiring accelerated funding or constraints on benefit levels or plan administration.\nFor additional information about pension and other postretirement benefits, see Note 10 “\nBenefit Plans\n” in Item 8 “\nFinancial\n \nStatements and Supplementary Data\n.”\nPart II\n59\n5.\nENVIRONMENTAL COMPLIANCE COSTS\nOur environmental compliance costs include the cost of ongoing monitoring programs, the cost of remediation efforts and other similar costs. Our accounting policy for environmental compliance costs is a critical accounting policy because it involves the use of significant estimates and assumptions and requires considerable management judgment.\nHOW WE ACCOUNT FOR ENVIRONMENTAL COSTS\nTo account for environmental costs, we:\n▪\nexpense or capitalize environmental costs consistent with our capitalization policy\n▪\nexpense costs for an existing condition caused by past operations that do not contribute to future revenues\n▪\naccrue costs for environmental assessment and remediation efforts when we determine that a liability is probable and we can reasonably estimate the cost\nAt the early stages of a remediation effort, environmental remediation liabilities are not easily quantified due to the uncertainties of various factors. The range of an estimated remediation liability is defined and redefined as events in the remediation effort occur, but generally liabilities are recognized no later than completion of the remedial feasibility study. When we can estimate a range of probable loss, we accrue the most likely amount. If no amount in the range of probable loss is considered most likely, the minimum loss in the range is accrued. As of December 31, 2024, the difference between the amount accrued and the maximum loss in the range for all sites for which a range can be reasonably estimated was $4.1 million; this amount does not represent our maximum exposure to loss for all environmental remediation obligations as it excludes those sites for which a range of loss cannot be reasonably estimated at this time. Our environmental remediation obligations are recorded on an undiscounted basis.\nAccrual amounts may be based on technical cost estimations or the professional judgment of experienced environmental managers. Our Safety, Health and Environmental Affairs Management Committee routinely reviews cost estimates and key assumptions in response to new information, such as the kinds and quantities of hazardous substances, available technologies and changes to the parties participating in the remediation efforts. However, a number of factors, including adverse agency rulings and unanticipated conditions as remediation efforts progress, may cause actual results to differ materially from accrued costs.\nFor additional information about environmental compliance costs, see Note 8 “\nAccrued Environmental Remediation Costs\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\n6.\nCLAIMS AND LITIGATION INCLUDING SELF-INSURANCE\nWe are involved with claims and litigation, including items covered under our self-insurance program. We are self-insured for losses related to workers' compensation up to $3.0 million per occurrence and automotive and general/product liability up to $10.0 million per occurrence. We have excess coverage on a per occurrence basis beyond these retention levels.\nUnder our self-insurance program, we aggregate certain claims and litigation costs that are reasonably predictable based on our historical loss experience and accrue losses, including future legal defense costs, based on actuarial studies. Certain claims and litigation costs, due to their unique nature, are not included in our actuarial studies. For matters not included in our actuarial studies, legal defense costs are accrued when incurred.\nOur accounting policy for claims and litigation including self-insurance is a critical accounting policy because it involves the use of significant estimates and assumptions and requires considerable management judgment.\nHOW WE ASSESS THE PROBABILITY OF LOSS\nWe use both internal and outside legal counsel to assess the probability of loss, and we establish an accrual when the claims and litigation represent a probable loss and the cost can be reasonably estimated. Significant judgment is used in determining the timing and amount of the accruals for probable losses, and the actual liability could differ materially from the accrued amounts.\nFor additional information about claims and litigation including self-insurance, see Note 1 “\nSummary of Significant Accounting\n \nPolicies\n” in Item 8 “\nFinancial Statements and Supplementary Data\n” under the caption \"Claims and Litigation Including Self-Insurance.\"\n7.\nINCOME TAXES\nVALUATION OF OUR DEFERRED TAX ASSETS\nWe file federal, state and foreign income tax returns and account for the current and deferred tax effects of such returns using the asset and liability method. We recognize deferred tax assets and liabilities (which reflect our best assessment of the future taxes we will pay) based on the differences between the book basis and tax basis of assets and liabilities. Deferred tax assets represent items to be used as a tax deduction or credit in future tax returns while deferred tax liabilities represent items that will result in additional tax in future tax returns.\nSignificant judgments and estimates are required in determining our deferred tax assets and liabilities. These estimates are updated throughout the year to consider income tax return filings, our geographic mix of earnings, legislative changes and other relevant items. We are required to account for the effects of changes in income tax rates on deferred tax balances in the period in which the legislation is enacted.\nPart II\n60\nEach quarter we analyze the likelihood that our deferred tax assets will be realized. Realization of the deferred tax assets ultimately depends on the existence of sufficient taxable income of the appropriate character in either the carryback or carryforward period. A valuation allowance is recorded if, based on the weight of all available positive and negative evidence, it is more likely than not (a likelihood of more than 50%) that some portion, or all, of a deferred tax asset will not be realized. A summary of our deferred tax assets is included in Note 9 “\nIncome Taxes\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nLIABILITY FOR UNRECOGNIZED TAX BENEFITS\nWe recognize a tax benefit associated with a tax position when we judge it is more likely than not that the position will be sustained based upon the technical merits of the position. For a tax position that meets the more likely than not recognition threshold, we measure the income tax benefit as the largest amount that we judge to have a greater than 50% likelihood of being realized. A liability is established for the unrecognized portion of any tax position. Our liability for unrecognized tax benefits is adjusted periodically due to changing circumstances, such as the progress of tax audits, case law developments and new legislation.\nGenerally, we are not subject to significant changes in income taxes by any taxing jurisdiction for the years before 2021. While it is often difficult to predict the final outcome or the timing of resolution of any particular tax matter, we believe our liability for unrecognized tax benefits is appropriate.\nWe consider a tax position to be resolved at the earlier of the issue being “effectively settled,” settlement of an examination, or the expiration of the statute of limitations. Upon resolution of a tax position, any liability for unrecognized tax benefits will be released.\nOur liability for unrecognized tax benefits is generally presented as noncurrent. However, if we anticipate paying cash within one year to settle an uncertain tax position, the liability is presented as current. We classify interest and penalties associated with our liability for unrecognized tax benefits as income tax expense.\nNEW ACCOUNTING STANDARDS\nFor a discussion of the accounting standards recently adopted or pending adoption and the effect such accounting changes will have on our results of operations, financial position or liquidity, see Note 1 “\nSummary of Significant Accounting Policies\n” in Item 8 “\nFinancial Statements and Supplementary Data\n” under the caption \"New Accounting Standards.\"\nFORWARD-LOOKING STATEMENTS\nThe foregoing discussion and analysis, as well as certain information contained elsewhere in this Annual Report, contain “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and are intended to be covered by the safe harbor created thereby. See the discussion in \"\nSafe Harbor Statement under the Private Securities Litigation Reform Act of 1995\n\" in Part I above.\n \nITEM 7A\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nMARKET RISK\nWe are exposed to certain market risks arising from transactions that are entered into in the normal course of business. To manage these market risks, we may use derivative financial instruments. We do not enter into derivative financial instruments for trading or speculative purposes.\nAs discussed in the \nLiquidity and Financial Resources\n section of Item 7 “\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n,” we actively manage our capital structure and resources to balance the cost of capital and risk of financial stress. Such activity includes balancing the cost and risk of interest expense. In addition to floating-rate borrowings, we at times use interest rate swaps to manage the mix of fixed-rate and floating-rate debt.\nAt December 31, 2024, the estimated fair value of our long-term debt including current maturities was $5,162.7 million compared to a face value of $5,391.1 million. The estimated fair value was determined by averaging several asking price quotes for the publicly traded notes and assuming par value for the remainder of the debt. The fair value estimate is based on information available as of the balance sheet date. The effect of a decline in interest rates of one percentage point would increase the fair value of our debt by approximately $399.8 million.\nWe are exposed to certain economic risks related to the costs of our pension and other postretirement benefit plans. These economic risks include changes in the discount rate for high-quality bonds and the expected return on plan assets. The impact of a change in these assumptions on our annual pension and other postretirement benefits costs is discussed in greater detail within the \nCritical Accounting Policies\n section of this Annual Report.\nPart II\n61\nITEM 8\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of Vulcan Materials Company:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Vulcan Materials Company and subsidiaries (the “Company”) as of December 31, 2024 and 2023, the related consolidated statements of comprehensive income, equity, and cash flows, for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 20, 2025 expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nHewitt Landfill Environmental Matter – Refer to Note 12 to the consolidated financial statements\nCritical Audit Matter Description\nThe Company is subject to governmental proceedings and orders pertaining to the protection of the environment. Specific to the Hewitt Landfill Environmental Matter, management is engaged in groundwater testing, certain remedial procedures and ongoing dialogue with the Environmental Protection Agency (EPA), Los Angeles Regional Water Quality Control Board (RWQCB), Los Angeles Department of Water and Power (LADWP), and Honeywell. The testing and dialogue is related to the Company’s contribution to soil, soil vapor and/or groundwater contamination in the former Hewitt Landfill in Los Angeles and the potential contribution of the Hewitt Landfill to groundwater contamination in the North Hollywood Operable Unit (NHOU) of the San Fernando Valley Superfund Site.\nThe groundwater treatment system for the Hewitt Landfill on-site remediation is fully operational, and the anticipated costs have been fully accrued for based on facts and circumstances known to the Company at this time. The Company has disclosed facts and circumstances that led to the accrual and the inherent uncertainty that exists in the timing and recognition of potential incremental responsibility or share of costs for the Hewitt Landfill on-site remediation or the NHOU. Due to these uncertainties, future amounts recorded related to the ultimate resolution of claims and assessments could cause actual losses to differ materially from accrued costs. \nWe identified the Hewitt Landfill and NHOU (collectively the “Hewitt Landfill Environmental Matter” or “the Matter”) as a critical audit matter because evaluating the estimate of the liability and the extent and sufficiency of related disclosures is subjective in nature and as such requires an increased extent of effort, involves especially subjective auditing judgments, and requires the involvement of our environmental specialists.\nPart II\n62\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the uncertainty in the timing, recognition and disclosure of the Company’s responsibility and potential share of remediation costs, specifically as they relate to the Hewitt Landfill Environmental Matter include the following, among others:\n▪\nWe tested the operating effectiveness of controls over the identification and evaluation of information available to assess potential responsibility or share of remediation costs for the Hewitt Landfill Environmental Matter, as well as controls over the adequacy of the related financial statement footnote disclosures.\n▪\nWith the assistance of our environmental specialists, we evaluated the accuracy and completeness of management’s recorded liabilities for the Hewitt Landfill Environmental Matter by:\n▪\nIndependently obtaining and reading correspondence from the EPA, RWQCB and LADWP regarding the Hewitt Landfill Environmental Matter.\n▪\nObtaining an understanding of the change in estimate of remediation costs, as applicable, and performing procedures to evaluate the appropriateness and sufficiency of the estimate at year-end.\n▪\nPerforming a search of environmental records in the public domain from independently and nationally recognized resources.\n▪\nWe obtained letters from internal and external counsel as to the Matter’s status, probability of an unfavorable outcome, and the amount or range of potential loss should the outcome be unfavorable.\n▪\nWe read and compared the Company’s footnote disclosure to evidential matter obtained during the audit.\n/s/ \nDELOITTE & TOUCHE LLP\nBirmingham, Alabama\nFebruary 20, 2025\nWe have served as the Company’s auditor since 1956.\nPart II\n63\nVULCAN MATERIALS COMPANY AND SUBSIDIARY COMPANIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nFor the Years Ended December 31\nin millions, except per share data\n2024\n2023\n2022\nTotal revenues\n$\n7,417.7\n \n$\n7,781.9\n \n$\n7,315.2\n \nCost of revenues\n(\n5,418.1\n)\n(\n5,833.4\n)\n(\n5,757.5\n)\nGross profit\n1,999.6\n \n1,948.5\n \n1,557.7\n \nSelling, administrative and general expenses\n(\n531.1\n)\n(\n542.8\n)\n(\n515.1\n)\nGain on sale of property, plant & equipment and businesses\n52.3\n \n76.4\n \n10.7\n \nLoss on impairments\n(\n86.6\n)\n(\n28.3\n)\n(\n67.9\n)\nOther operating expense, net\n(\n69.7\n)\n(\n26.4\n)\n(\n34.0\n)\nOperating earnings\n1,364.5\n \n1,427.4\n \n951.4\n \nOther nonoperating income (expense), net\n(\n22.1\n)\n(\n2.7\n)\n5.1\n \nInterest income\n20.9\n \n16.5\n \n0.8\n \nInterest expense\n(\n191.2\n)\n(\n196.1\n)\n(\n169.2\n)\nEarnings from continuing operations before income taxes\n1,172.1\n \n1,245.1\n \n788.1\n \nIncome tax (expense) benefit\n \n \n \nCurrent\n(\n261.3\n)\n(\n343.6\n)\n(\n133.4\n)\nDeferred\n9.9\n \n44.2\n \n(\n59.6\n)\nTotal income tax expense\n(\n251.4\n)\n(\n299.4\n)\n(\n193.0\n)\nEarnings from continuing operations\n920.7\n \n945.7\n \n595.1\n \nLoss on discontinued operations, net of tax\n(\n7.6\n)\n(\n10.8\n)\n(\n18.6\n)\nNet earnings\n913.1\n \n934.9\n \n576.5\n \nEarnings attributable to noncontrolling interest\n(\n1.2\n)\n(\n1.7\n)\n(\n0.9\n)\nNet earnings attributable to Vulcan\n$\n911.9\n \n$\n933.2\n \n$\n575.6\n \nOther comprehensive income (loss), net of tax\n \n \n \nAmortization of accumulated cash flow hedge losses\n1.7\n \n1.6\n \n1.5\n \nAdjustment for funded status of benefit plans\n9.7\n \n4.2\n \n(\n6.5\n)\nAmortization of accumulated benefit plan costs\n5.0\n \n5.1\n \n3.0\n \nOther comprehensive income (loss)\n16.4\n \n10.9\n \n(\n2.0\n)\nComprehensive income\n929.5\n \n945.8\n \n574.5\n \nComprehensive earnings attributable to noncontrolling interest\n(\n1.2\n)\n(\n1.7\n)\n(\n0.9\n)\nComprehensive income attributable to Vulcan\n$\n928.3\n \n$\n944.1\n \n$\n573.6\n \nBasic earnings (loss) per share attributable to Vulcan\n \n \n \nContinuing operations \n$\n6.95\n \n$\n7.10\n \n$\n4.47\n \nDiscontinued operations\n(\n0.06\n)\n(\n0.08\n)\n(\n0.14\n)\nNet earnings\n$\n6.89\n \n$\n7.02\n \n$\n4.33\n \nDiluted earnings (loss) per share attributable to Vulcan\n \n \n \nContinuing operations \n$\n6.91\n \n$\n7.06\n \n$\n4.45\n \nDiscontinued operations\n(\n0.06\n)\n(\n0.08\n)\n(\n0.14\n)\nNet earnings\n$\n6.85\n \n$\n6.98\n \n$\n4.31\n \nWeighted-average common shares outstanding \nBasic\n132.3\n133.0\n133.0\nAssuming dilution\n133.1\n133.7\n133.6\nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nPart II\n64\n \nVULCAN MATERIALS COMPANY AND SUBSIDIARY COMPANIES\nCONSOLIDATED BALANCE SHEETS\nAs of December 31\nin millions\n2024\n2023\nAssets\nCash and cash equivalents \n$\n559.7\n \n$\n931.1\n \nRestricted cash\n41.1\n \n18.1\n \nAccounts and notes receivable, net\n892.3\n \n889.7\n \nInventories\n681.8\n \n615.6\n \nOther current assets\n90.8\n \n70.4\n \nTotal current assets\n2,265.7\n \n2,524.9\n \nInvestments and long-term receivables\n31.3\n \n31.3\n \nProperty, plant & equipment, net\n8,461.5\n \n6,217.7\n \nOperating lease right-of-use assets, net\n526.4\n \n511.7\n \nGoodwill\n3,788.1\n \n3,531.7\n \nOther intangible assets, net\n1,714.7\n \n1,460.7\n \nOther noncurrent assets \n317.1\n \n267.7\n \nTotal assets\n$\n17,104.8\n \n$\n14,545.7\n \nLiabilities\n \n \nCurrent maturities of long-term debt\n400.5\n \n0.5\n \nTrade payables and accruals\n407.0\n \n390.4\n \nAccrued salaries, wages and management incentives\n124.0\n \n135.8\n \nAccrued interest\n31.4\n \n32.8\n \nOther current liabilities\n276.2\n \n238.1\n \nTotal current liabilities\n1,239.1\n \n797.6\n \nLong-term debt\n4,906.9\n \n3,877.3\n \nDeferred income taxes, net\n1,336.5\n \n1,028.9\n \nPension and other postretirement benefits\n75.2\n \n83.6\n \nAsset retirement obligations\n427.4\n \n324.1\n \nDeferred revenue\n137.8\n \n145.3\n \nNoncurrent operating lease liabilities\n521.4\n \n507.4\n \nOther noncurrent liabilities\n318.0\n \n273.6\n \nTotal liabilities\n$\n8,962.3\n \n$\n7,037.8\n \nOther commitments and contingencies (Note 12)\n \n \nEquity\n \n \nCommon stock, $\n1\n par value, Authorized \n480.0\n shares, \n   Outstanding \n132.1\n and \n132.1\n shares, respectively\n132.1\n \n132.1\n \nCapital in excess of par value\n2,900.1\n \n2,880.1\n \nRetained earnings\n5,213.8\n \n4,615.0\n \nAccumulated other comprehensive loss\n(\n127.4\n)\n(\n143.8\n)\nTotal shareholders' equity\n8,118.6\n \n7,483.4\n \nNoncontrolling interest\n23.9\n \n24.5\n \nTotal equity\n8,142.5\n \n7,507.9\n \nTotal liabilities and equity\n$\n17,104.8\n \n$\n14,545.7\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nPart II\n65\nVULCAN MATERIALS COMPANY AND SUBSIDIARY COMPANIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended December 31\nin millions\n2024\n2023\n2022\nOperating Activities\nNet earnings\n$\n913.1\n \n$\n934.9\n \n$\n576.5\n \nAdjustments to reconcile net earnings to net cash provided by operating activities\n \n \n \nDepreciation, depletion, accretion and amortization\n632.2\n \n617.0\n \n587.5\n \nLoss on impairments\n86.6\n \n28.3\n \n67.9\n \nNoncash operating lease expense\n51.4\n \n53.9\n \n60.3\n \nNet gain on sale of property, plant & equipment and businesses\n(\n52.3\n)\n(\n76.4\n)\n(\n10.7\n)\nContributions to pension plans\n(\n8.7\n)\n(\n7.4\n)\n(\n7.8\n)\nShare-based compensation expense\n53.4\n \n63.2\n \n41.1\n \nDeferred income taxes, net\n(\n9.4\n)\n(\n43.3\n)\n57.7\n \n(Increase) decrease in assets excluding the initial effects of business  acquisitions and dispositions\n \n \n \nAccounts and notes receivable\n63.2\n \n28.2\n \n(\n53.3\n)\nInventories\n(\n27.4\n)\n(\n54.6\n)\n(\n49.5\n)\nOther assets\n(\n93.0\n)\n27.8\n \n(\n92.3\n)\nIncrease (decrease) in liabilities excluding the initial effects of business acquisitions and dispositions\n \n \n \nAccrued interest and income taxes\n(\n6.8\n)\n18.8\n \n0.4\n \nTrade payables and other accruals\n(\n193.0\n)\n(\n25.1\n)\n(\n17.4\n)\nOther noncurrent liabilities\n(\n20.4\n)\n(\n42.4\n)\n(\n36.4\n)\nOther, net\n20.7\n \n13.9\n \n24.2\n \nNet cash provided by operating activities\n$\n1,409.6\n \n$\n1,536.8\n \n$\n1,148.2\n \nInvesting Activities\n \n \n \nPurchases of property, plant & equipment\n(\n603.5\n)\n(\n872.6\n)\n(\n612.6\n)\nProceeds from sale of property, plant & equipment\n54.7\n \n94.6\n \n38.7\n \nProceeds from sale of businesses\n0.2\n \n613.6\n \n50.0\n \nPayment for businesses acquired, net of acquired cash and adjustments\n(\n2,266.2\n)\n0.9\n \n(\n529.2\n)\nOther, net\n(\n0.1\n)\n0.0\n \n0.1\n \nNet cash used for investing activities\n$\n(\n2,814.9\n)\n$\n(\n163.5\n)\n$\n(\n1,053.0\n)\nFinancing Activities\n \n \n \nProceeds from short-term debt\n8.0\n \n166.1\n \n1,361.0\n \nPayment of short-term debt\n(\n8.0\n)\n(\n266.1\n)\n(\n1,261.0\n)\nPayment of current maturities and long-term debt\n(\n550.5\n)\n(\n550.5\n)\n(\n557.7\n)\nProceeds from issuance of long-term debt\n2,000.0\n \n550.0\n \n550.0\n \nDebt issuance and exchange costs\n(\n31.6\n)\n(\n3.4\n)\n(\n2.8\n)\nPayment of finance leases\n(\n13.0\n)\n(\n30.8\n)\n(\n33.8\n)\nPurchases of common stock\n(\n68.8\n)\n(\n200.0\n)\n0.0\n \nDividends paid\n(\n244.4\n)\n(\n228.4\n)\n(\n212.6\n)\nShare-based compensation, shares withheld for taxes\n(\n33.0\n)\n(\n21.9\n)\n(\n18.5\n)\nDistribution to noncontrolling interest\n(\n1.8\n)\n(\n0.8\n)\n0.0\n \nOther, net\n0.0\n \n0.2\n \n0.2\n \nNet cash provided by (used for) financing activities\n$\n1,056.9\n \n$\n(\n585.6\n)\n$\n(\n175.2\n)\nNet increase (decrease) in cash and cash equivalents and restricted cash\n(\n348.4\n)\n787.7\n \n(\n80.0\n)\nCash and cash equivalents and restricted cash at beginning of year\n949.2\n \n161.5\n \n241.5\n \nCash and cash equivalents and restricted cash at end of year\n$\n600.8\n \n$\n949.2\n \n$\n161.5\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nPart II\n66\nVULCAN MATERIALS COMPANY AND SUBSIDIARY COMPANIES\nCONSOLIDATED STATEMENTS OF EQUITY\n \nCommon Stock\nCapital in\nExcess of\nPar Value\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nTotal\nShareholders'\nEquity\nNon-\ncontrolling\nInterest\nTotal\nin millions\nShares\nAmount\nBalances at December 31, 2021\n132.7\n$\n132.7\n \n$\n2,816.5\n \n$\n3,748.5\n \n$\n(\n152.7\n)\n$\n6,545.0\n \n$\n22.7\n \n$\n6,567.7\n \nNet earnings \n0.0\n0.0 \n0.0 \n575.6\n \n0.0 \n575.6\n \n0.9\n \n576.5\n \nShare-based compensation plans,  net of shares withheld for taxes\n0.2\n0.2\n \n(\n18.7\n)\n0.0 \n0.0 \n(\n18.5\n)\n0.0 \n(\n18.5\n)\nShare-based compensation expense\n0.0\n0.0 \n41.1\n \n0.0 \n0.0 \n41.1\n \n0.0 \n41.1\n \nCash dividends on common stock\n0.0\n0.0 \n0.0 \n(\n212.6\n)\n0.0 \n(\n212.6\n)\n0.0 \n(\n212.6\n)\nOther comprehensive income (loss)\n0.0\n0.0 \n0.0 \n0.0 \n(\n2.0\n)\n(\n2.0\n)\n0.0 \n(\n2.0\n)\nOther\n0.0\n0.0 \n0.1\n \n(\n0.1\n)\n0.0 \n0.0 \n0.0 \n0.0\n \nBalances at December 31, 2022\n132.9\n$\n132.9\n \n$\n2,839.0\n \n$\n4,111.4\n \n$\n(\n154.7\n)\n$\n6,928.6\n \n$\n23.6\n \n$\n6,952.2\n \nNet earnings \n0.0\n0.0 \n0.0 \n933.2\n \n0.0 \n933.2\n \n1.7\n \n934.9\n \nShare-based compensation plans,  net of shares withheld for taxes\n0.2\n0.2\n \n(\n22.0\n)\n0.0 \n0.0 \n(\n21.8\n)\n0.0 \n(\n21.8\n)\nPurchase and retirement of common stock\n(\n1.0\n)\n(\n1.0\n)\n0.0 \n(\n201.5\n)\n0.0 \n(\n202.5\n)\n0.0 \n(\n202.5\n)\nShare-based compensation expense\n0.0\n0.0 \n63.2\n \n0.0 \n0.0 \n63.2\n \n0.0 \n63.2\n \nCash dividends on common stock\n0.0\n0.0 \n0.0 \n(\n228.4\n)\n0.0 \n(\n228.4\n)\n0.0 \n(\n228.4\n)\nOther comprehensive income (loss)\n0.0\n0.0 \n0.0 \n0.0 \n10.9\n \n10.9\n \n0.0 \n10.9\n \nDistribution to noncontrolling interest\n0.0\n0.0 \n0.0 \n0.0 \n0.0 \n0.0 \n(\n0.8\n)\n(\n0.8\n)\nOther\n0.0\n0.0 \n(\n0.1\n)\n0.3\n \n0.0 \n0.2\n \n0.0 \n0.2\n \nBalances at December 31, 2023\n132.1\n$\n132.1\n \n$\n2,880.1\n \n$\n4,615.0\n \n$\n(\n143.8\n)\n$\n7,483.4\n \n$\n24.5\n \n$\n7,507.9\n \nNet earnings\n0.0\n0.0 \n0.0\n \n911.9\n \n0.0\n \n911.9\n \n1.2\n \n913.1\n \nShare-based compensation plans,  net of shares withheld for taxes\n0.3\n0.3\n \n(\n33.5\n)\n0.0 \n0.0 \n(\n33.2\n)\n0.0 \n(\n33.2\n)\nPurchase and retirement of common stock\n(\n0.3\n)\n(\n0.3\n)\n0.0 \n(\n68.8\n)\n0.0 \n(\n69.1\n)\n0.0 \n(\n69.1\n)\nShare-based compensation expense\n0.0\n0.0 \n53.4\n \n0.0 \n0.0 \n53.4\n \n0.0 \n53.4\n \nCash dividends on common stock\n0.0\n0.0 \n0.0 \n(\n244.4\n)\n0.0 \n(\n244.4\n)\n0.0 \n(\n244.4\n)\nOther comprehensive income (loss)\n0.0\n0.0 \n0.0 \n0.0 \n16.4\n \n16.4\n \n0.0 \n16.4\n \nDistribution to noncontrolling interest\n0.0\n0.0 \n0.0 \n0.0 \n0.0 \n0.0 \n(\n1.8\n)\n(\n1.8\n)\nOther\n0.0\n0.0 \n0.1\n \n0.1\n \n0.0 \n0.2\n \n0.0 \n0.2\n \nBalances at December 31, 2024\n132.1\n$\n132.1\n \n$\n2,900.1\n \n$\n5,213.8\n \n$\n(\n127.4\n)\n$\n8,118.6\n \n$\n23.9\n \n$\n8,142.5\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nPart II\n67\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1: \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nNATURE OF OPERATIONS\nVulcan Materials Company (the “Company,” “Vulcan,” “we,” “our”), a New Jersey corporation, is the nation's largest supplier of construction aggregates (primarily crushed stone, sand and gravel) and a major producer of aggregates-intensive downstream products such as asphalt mix and ready-mixed concrete.\nWe operate primarily in the United States, and our principal product — aggregates — is used in most types of public and private construction projects and in the production of asphalt mix and ready-mixed concrete. We serve aggregates markets in \ntwenty-three\n states, the U.S. Virgin Islands, Washington D.C., and the local markets surrounding our operations in Freeport, Bahamas; British Columbia, Canada; Puerto Cortés, Honduras; and Quintana Roo, Mexico (see \nNote 12\n, NAFTA Arbitration). Our primary focus is serving metropolitan markets in the United States that are expected to experience the most significant growth in population, households and employment. These \nthree\n demographic factors are significant drivers of demand for aggregates. While aggregates is our focus and primary business, we produce and sell aggregates-intensive asphalt mix and/or ready-mixed concrete products in our Alabama, Arizona, California, Maryland, New Mexico, Tennessee, Texas, Virginia, U.S. Virgin Islands and Washington D.C. markets.\nDue to the 2005 sale of our Chemicals business as described below, the results of the Chemicals business are presented as discontinued operations in the accompanying Consolidated Statements of Comprehensive Income.\nDISCONTINUED OPERATIONS\nIn 2005, we sold substantially all the assets of our Chemicals business to Basic Chemicals, a subsidiary of Occidental Chemical Corporation. \nThe financial results of the Chemicals business are classified as discontinued operations in the accompanying Consolidated Statements of Comprehensive Income for all periods presented. Results from discontinued operations are as follows:\nin millions\n2024\n2023\n2022\nPretax loss\n$\n(\n10.2\n)\n$\n(\n14.7\n)\n$\n(\n25.2\n)\nIncome tax benefit\n2.6\n \n3.9\n \n6.6\n \nLoss on discontinued operations, net of tax\n$\n(\n7.6\n)\n$\n(\n10.8\n)\n$\n(\n18.6\n)\nOur discontinued operations include charges related to general and product liability costs, including legal defense costs, and environmental remediation costs associated with our former Chemicals business (including certain matters as discussed in \nNote\n \n12\n). In addition, 2022 includes a $\n15.3\n million charge for a litigation matter. There were \nno\n revenues from discontinued operations for the years presented.\nPRINCIPLES OF CONSOLIDATION\nThe consolidated financial statements include the accounts of Vulcan Materials Company and all our majority or wholly-owned subsidiary companies. Partially-owned affiliates are either consolidated or accounted for at cost or as equity investments depending on the level of ownership interest or our ability to exercise control over the affiliates’ operations. All intercompany transactions and accounts have been eliminated in consolidation.\nNONCONTROLLING INTEREST\nWe own an \n88\n% controlling interest in the Orca Sand and Gravel Limited Partnership (Orca) which was formed to develop the Orca quarry in British Columbia, Canada. The remaining \n12\n% noncontrolling interest is held by the Namgis First Nation (Namgis). This noncontrolling interest consists of the Namgis’ share of the fair value equity in the partnership. Our consolidated financial statements recognize the full fair value of all of the subsidiary’s assets and liabilities offset by the noncontrolling interest in total equity.\nUSE OF ESTIMATES IN THE PREPARATION OF FINANCIAL STATEMENTS\nThe preparation of these financial statements in conformity with accounting principles generally accepted (GAAP) in the United States of America requires us to make estimates and judgments that affect reported amounts of assets, liabilities, revenues and expenses, and the related disclosures of contingent assets and contingent liabilities at the date of the financial statements. We evaluate these estimates and judgments on an ongoing basis and base our estimates on historical experience, current conditions and various other assumptions that are believed to be reasonable under the circumstances. The results of these estimates form the basis for our judgments about the carrying values of assets and liabilities as well as identifying and assessing the accounting treatment with respect to commitments and contingencies. Actual results may differ materially from these estimates. The most significant estimates included in the preparation of these financial statements are related to goodwill and long-lived asset impairments, business combinations and purchase price allocation, pension and other postretirement benefits, environmental compliance, claims and litigation including self-insurance, and income taxes. Events that relate to conditions arising after December 31, 2024 will be reflected in management’s estimates for future periods.\n \nPart II\n68\nBUSINESS COMBINATIONS\nWe account for business combinations under the acquisition method of accounting. The purchase price of an acquisition is allocated to the underlying identifiable assets acquired and liabilities assumed based on their respective fair values. The purchase price is determined based on the fair value of consideration transferred to and liabilities assumed from the seller as of the date of acquisition. We allocate the purchase price to the fair values of the tangible and identifiable intangible assets acquired and liabilities assumed as of the date of acquisition. Goodwill is recorded for the excess of the purchase price over the net fair value of the identifiable assets acquired and liabilities assumed.\nDetermining the fair values of assets acquired and liabilities assumed requires judgment and often involves the use of significant estimates and assumptions. Fair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction and, therefore, represents an exit price. A fair value measurement assumes the highest and best use of the asset by market participants.\nWe may adjust the amounts recognized in an acquisition during a measurement period after the acquisition date. Any such adjustments are the result of subsequently obtaining additional information that existed at the acquisition date regarding the assets acquired or the liabilities assumed. Measurement period adjustments are generally recorded as increases or decreases to goodwill, if any, recognized in the transaction. The cumulative impact of measurement period adjustments on depreciation, amortization and other income statement items are recognized in the period the adjustment is determined.\nFor additional information about business combinations, see \nNote 19\n.\nFOREIGN CURRENCY TRANSACTIONS\nThe U.S. dollar is the functional currency for all of our operations, as the primary economic environment in which we transact business is the United States. For our non-U.S. subsidiaries, local currency inventories and long-term assets such as property, plant & equipment and intangibles are remeasured into U.S. dollars at approximate rates prevailing when acquired; all other assets and liabilities are remeasured at year-end exchange rates. Inventories charged to cost of sales and depreciation are remeasured at historical rates; all other income and expense items are remeasured at average exchange rates prevailing during the year. Gains and losses which result from remeasurement are included in other nonoperating income/expense in the accompanying Consolidated Statements of Comprehensive Income and are not material for the years presented.\nCASH EQUIVALENTS\nWe classify as cash equivalents all highly liquid securities with a maturity of three months or less at the time of purchase. The carrying amount of these securities approximates fair value due to their short-term maturities.\nRESTRICTED CASH\nRestricted cash primarily consists of cash proceeds from the sale of property held in escrow for the acquisition of replacement property under like-kind exchange agreements. The escrow accounts are administered by an intermediary. Cash restricted pursuant to like-kind exchange agreements remains restricted for a maximum of 180 days from the date of the property sale pending the acquisition of replacement property. Restricted cash may also include cash reserved by other contractual agreements (such as asset purchase agreements) for a specified purpose and therefore is not available for use for other purposes. Restricted cash is included with cash and cash equivalents in the accompanying Consolidated Statements of Cash Flows.\nACCOUNTS AND NOTES RECEIVABLE\nAccounts and notes receivable from customers result from our extending credit to trade customers for the purchase of our products. The terms generally provide for payment within 15 days of the month following invoice. On occasion, when necessary to conform to regional industry practices, we sell product under extended payment terms, which may result in either secured or unsecured short-term notes; or, on occasion, notes with durations of less than one year are taken in settlement of existing accounts receivable. Other accounts and notes receivable result from short-term transactions (less than one year) other than the sale of our products, such as interest receivable, insurance claims, freight claims, bid deposits or rents receivable.\nAllowance for credit losses is based on our assessment of the collectability of customer accounts. We regularly review the allowance by considering factors such as historical experience, credit quality, the age of the accounts receivable balances, and current economic conditions that may affect a customer’s ability to pay.\n Allowances for credit losses were $\n13.2\n million and $\n13.6\n million at December 31, 2024 and 2023, respectively. Bad debt expense (included in selling, administrative and general expense) for the years ended December 31, 2024, 2023 and 2022 was $\n3.7\n million, $\n2.1\n million\n \nand $\n0.7\n million, respectively. \nINVENTORIES\nInventories and supplies are stated at the lower of cost or net realizable value. We use the last-in, first-out (LIFO) method of valuation for most of our inventories because it results in a better matching of costs with revenues. Such costs include fuel, parts and supplies, raw materials, direct labor and production overhead. An actual valuation of inventory under the LIFO method can be made only at the end of each year based on the inventory levels and costs at that time. Accordingly, interim LIFO calculations are based on our estimates of expected year-end inventory levels and costs and are subject to the final year-end LIFO inventory valuation. Substantially all operating supplies inventory is carried at average cost.\nFor additional information about inventories, see \nNote 3\n.\nPart II\n69\nPROPERTY, PLANT & EQUIPMENT\nProperty, plant & equipment are carried at cost less accumulated depreciation, depletion and amortization.\nFor assets sold or otherwise disposed of, the cost and related accumulated depreciation are removed, and any related gain or loss is reflected in income.\nCapitalized software costs reflected in property, plant & equipment are immaterial for all years presented.\nFor additional information about our property, plant & equipment, see \nNote 4\n.\nPREPAID SOFTWARE AS A SERVICE\nPrepaid software as a service (SaaS) implementation costs of $\n17.7\n million are reflected in other noncurrent assets as of December 31, 2024 (there were no related prepaid implementation costs prior to 2024). We recorded prepaid SaaS costs of $\n19.4\n million for the year ended December 31, 2024 which are recognized as service expense on a straight-line basis over \n7\n years. Service expense related to prepaid SaaS implementation costs was $\n1.7\n million for the year ended December 31, 2024.\nREPAIR AND MAINTENANCE\nRepair and maintenance costs generally are charged to operating expense as incurred. Renewals and betterments that add materially to the utility or useful lives of property, plant & equipment are capitalized and subsequently depreciated. Actual costs for planned major maintenance activities, related primarily to periodic overhauls on our aircrafts and oceangoing vessels, are capitalized and amortized to the next overhaul.\nLEASES\nOur nonmineral leases with initial terms in excess of one year are recognized on the balance sheet as right-of-use (ROU) assets and lease liabilities. Mineral leases are exempt from balance sheet recognition.\nROU assets represent our right to use an underlying asset for the lease term, and lease liabilities represent our obligation to make lease payments arising from the leases. ROU assets and lease liabilities are recognized at the lease commencement date based on the present value of lease payments over the lease term. The lease term only includes options to extend or terminate the lease when it is reasonably certain that we will exercise that option. As our leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments. ROU assets are adjusted for any prepaid lease payments and lease incentives. Except for equipment with monthly monitoring service where the service component accounts for a majority of the lease cost, the non-lease components of our lease agreements are not separated from the lease components.\nFor additional information about leases, see \nNote 7\n.\nDEPRECIATION, DEPLETION, ACCRETION AND AMORTIZATION\nDepreciation is generally computed by the straight-line method at rates based on the estimated service lives of the various classes of assets, which include machinery and equipment (\n3\n to \n35\n years), buildings (\n7\n to \n20\n years) and land improvements (\n3\n to \n20\n years). Finance leases are amortized over varying periods not in excess of applicable lease terms or estimated useful lives. Capitalized costs for software under our control (by ownership or license) are included in machinery and equipment and are depreciated on a straight-line basis beginning when the software project is substantially complete.\nCost depletion on depletable land is computed by the unit-of-sales method based on estimated recoverable units.\nAccretion reflects the period-to-period increase in the carrying amount of the liability for asset retirement obligations. It is computed using the same credit-adjusted, risk-free rate used to initially measure the liability at fair value.\nLeaseholds are amortized over varying periods not in excess of applicable lease terms or estimated useful lives.\nAmortization of intangible assets subject to amortization is computed based on the estimated life of the intangible assets. A significant portion of our intangible assets is contractual rights in place associated with zoning, permitting and other rights to access and extract aggregates reserves. Contractual rights in place associated with aggregates reserves are amortized using the unit-of-sales method based on estimated recoverable units. Other intangible assets are amortized principally by the straight-line method.\nDepreciation, depletion, accretion and amortization expense for the years ended December 31 is outlined below:\n \nin millions\n2024\n2023\n2022\nDepreciation\n$\n464.6\n \n$\n441.1\n \n$\n409.1\n \nDepletion\n59.5\n \n61.1\n \n50.2\n \nAccretion\n14.7\n \n13.9\n \n14.1\n \nDepreciation of finance leases\n9.5\n \n12.8\n \n16.5\n \nAmortization of intangibles\n83.9\n \n88.1\n \n97.6\n \nTotal depreciation, depletion, accretion and amortization\n$\n632.2\n \n$\n617.0\n \n$\n587.5\n \nPart II\n70\nDERIVATIVE INSTRUMENTS\nDuring the normal course of operations, we are exposed to market risks including interest rates, foreign currency exchange rates and commodity prices. From time to time, and consistent with our risk management policies, we use derivative instruments to balance the cost and risk of such expenses. We do not use derivative instruments for trading or other speculative purposes.\nThe accounting for gains and losses that result from changes in the fair value of derivative instruments depends on whether the derivatives have been designated and qualify as hedging instruments and the type of hedging relationship. Changes in the fair value of interest rate swap fair value hedges are recorded as interest expense consistent with the change in the fair value of the hedged item attributable to the risk being hedged. Changes in the fair value of interest rate swap cash flow hedges are recorded in accumulated other comprehensive income (AOCI) and are reclassified into interest expense in the same period the hedged items affect earnings. We may also enter into contracts that qualify for the normal purchases and normal sales (NPNS) exception. When a contract meets the criteria to qualify as NPNS, we apply such exception. Income recognition and realization related to NPNS contracts generally coincide with the physical delivery of the commodity. For contracts qualifying for the NPNS exception, no recognition of the contract’s fair value in the consolidated financial statements is required until settlement of the contract as long as the transaction remains probable of occurring. \nFor additional information about derivative instruments, see \nNote 5\n.\nFAIR VALUE MEASUREMENTS\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The fair value hierarchy prioritizes the inputs to valuation techniques used to measure fair value into three broad levels as described below:\nLevel 1:\n Quoted prices in active markets for identical assets or liabilities\nLevel 2:\n Inputs that are derived principally from or corroborated by observable market data\nLevel 3:\n Inputs that are unobservable and significant to the overall fair value measurement\nOur assets at December 31 subject to fair value measurement on a recurring basis are summarized below:\nin millions\n2024\n2023\nLevel 1 Fair Value\nRabbi Trust\nMutual funds\n$\n31.1\n \n$\n31.7\n \nTotal\n$\n31.1\n \n$\n31.7\n \nLevel 2 Fair Value\nInterest rate swaps\n$\n0.0\n \n$\n(\n0.3\n)\nRabbi Trust\nMoney market mutual fund\n0.3\n \n0.5\n \nTotal\n$\n0.3\n \n$\n0.2\n \nWe have \ntwo\n Rabbi Trusts for the purpose of providing a level of security for the employee nonqualified retirement and deferred compensation plans and for the directors' nonqualified deferred compensation plans. The fair values of these investments are estimated using a market approach. The Level 1 investments include mutual funds for which quoted prices in active markets are available. Level 2 investments are stated at estimated fair value based on the underlying investments in the fund (high-quality, short-term, U.S. dollar-denominated money market instruments).\nNet gains (losses) of the Rabbi Trusts’ investments were $(\n0.4\n) million, $\n3.0\n million and $(\n4.8\n) million for the years ended December 31, 2024, 2023 and 2022, respectively. The portions of the net gains (losses) related to investments still held by the Rabbi Trusts at December 31, 2024, 2023 and 2022 were $(\n0.6\n) million, $\n3.1\n million and $(\n5.2\n) million, respectively.\nInterest rate swaps are measured at fair value using quoted market prices or pricing models that use prevailing market interest rates as of the measurement date. These interest rate swaps are more fully described in \nNote 5\n.\nThe carrying values of our cash equivalents, restricted cash, accounts and notes receivable, short-term debt, trade payables and accruals, and all other current liabilities approximate their fair values because of the short-term nature of these instruments. Additional disclosures for derivative instruments and interest-bearing debt are presented in \nNote\n 5\n and \nNote\n 6\n, respectively.\nDuring the third quarter of 2023, net assets held for sale (our concrete operations in Texas) with a carrying value of $\n513.3\n million were written down to their estimated fair value (less cost to sell) of $\n485.0\n million, resulting in an impairment loss of $\n28.3\n million; these net assets were subsequently sold during the fourth quarter of 2023 resulting in additional loss on sale of $\n13.8\n million. The estimated fair value (Level 1 fair value measurement) was determined based on the expected proceeds from the probable sale of the disposal group. See below for a related goodwill impairment charge in 2022 and \nNote 19\n for additional discussion of the disposal of the net assets.\nPart II\n71\nGOODWILL IMPAIRMENT\nGoodwill represents the excess of the cost of net assets acquired in business combinations over the fair value of the identifiable tangible and intangible assets acquired and liabilities assumed in a business combination. Goodwill impairment exists when the fair value of a reporting unit is less than its carrying amount. As of December 31, 2024, goodwill totaled $\n3,788.1\n million as compared to $\n3,531.7\n million at December 31, 2023. Goodwill represents \n22\n% of total assets at December 31, 2024 and \n24\n% at December 31, 2023.\nGoodwill is tested for impairment annually, as of November 1, or more frequently whenever events or changes in circumstances would more likely than not reduce the fair value of a reporting unit below its carrying amount. Goodwill is tested for impairment at the reporting unit level, one level below our operating segments. We have \nthree\n operating segments organized around our principal product lines: Aggregates, Asphalt and Concrete. Within these \nthree\n operating segments, we have identified \n14\n reporting units (of which \n10\n carry goodwill) based primarily on geographic location. We have the option of either assessing qualitative factors to determine whether it is more likely than not that the carrying value of our reporting units exceeds their respective fair value or proceeding directly to a quantitative test. We elected to perform the quantitative impairment test for all years presented.\nThe quantitative impairment test compares the fair value of a reporting unit to its carrying value, including goodwill. If the fair value exceeds its carrying value, the goodwill of the reporting unit is not considered impaired. However, if the carrying value of a reporting unit exceeds its fair value, we recognize an impairment loss equal to that excess.\nDuring the third quarter of 2024, we determined that a triggering event occurred with respect to a reporting unit that includes concrete operations acquired from U.S. Concrete in 2021. Based on an interim goodwill impairment test, we determined that the estimated fair value of this reporting unit was less than its carrying value. As a result, we recorded a $\n86.6\n million interim goodwill impairment loss. In addition, during the third quarter of 2022, we recorded an interim goodwill impairment loss of $\n50.9\n million related to the fourth quarter sale of a reporting unit comprised of concrete operations in New Jersey, New York and Pennsylvania (see Note 19 for additional information). There were \nno\n charges for goodwill impairment in the year ended December 31, 2023.\nWe estimate the fair values of the reporting units using both an income approach (which involves discounting estimated future cash flows) and a market approach (which involves the application of revenue and EBITDA multiples of comparable companies). Determining the fair value of our reporting units involves the use of significant estimates and assumptions and considerable management judgment. We base our fair value estimates on assumptions we believe to be reasonable at the time, but such assumptions are subject to inherent uncertainty and actual results may differ. Changes in key assumptions or management judgment with respect to a reporting unit or its prospects, which may result from a change in market conditions, market trends, interest rates or other factors outside of our control, or underperformance relative to historical or projected operating results, could result in a significantly different estimate of the fair value of our reporting units, which could result in an impairment charge in the future.\nFor additional information about goodwill, see \nNote 18\n.\nIMPAIRMENT OF LONG-LIVED ASSETS EXCLUDING GOODWILL\nWe evaluate the carrying value of long-lived assets, including intangible assets subject to amortization, when events and circumstances indicate that the carrying value may not be recoverable. The carrying value of long-lived assets is considered impaired when the estimated undiscounted cash flows from such assets are less than their carrying value. In that event, we perform a fair value analysis and recognize a loss equal to the amount by which the carrying value exceeds the fair value. Fair value is determined primarily by using a discounted cash flow methodology that requires considerable judgment and assumptions. Our estimate of net future cash flows is based on historical experience and assumptions of future trends, which may be different from actual results. We periodically review the appropriateness of the estimated useful lives of our long-lived assets.\nWe test long-lived assets for impairment at a significantly lower level than the level at which we test goodwill for impairment. In markets where we do not produce downstream products (e.g., asphalt mix and ready-mixed concrete), the lowest level of largely independent identifiable cash flows is at the individual aggregates operation or a group of aggregates operations collectively serving a local market or remote markets through our rail and water distribution networks. Conversely, in vertically integrated markets, the cash flows of our downstream and upstream businesses are not largely independently identifiable as the selling price of the upstream products (aggregates) determines the profitability of the downstream business.\nAs of December 31, 2024, net property, plant & equipment represents \n49\n% of total assets while net other intangible assets represents \n10\n% of total assets. As previously noted, during the third quarter of 2023, we recorded a $\n28.3\n million loss on impairment of long-lived assets related to the fourth quarter sale of concrete operations in Texas. In addition, during the third quarter of 2022, we recorded a $\n16.9\n million loss on impairment of long-lived assets related to the fourth quarter sale of concrete operations in New Jersey, New York and Pennsylvania. See \nNote 19\n for divestiture information and \nNote 18\n for a related goodwill impairment charge in 2022. During 2024, we recorded \nno\n significant losses on impairment of long-lived assets.\nFor additional information about long-lived assets and intangible assets, see \nNote\n 4\n and \nNote\n 18\n, respectively.\nPart II\n72\nREVENUES AND REVENUE RECOGNITION\nTotal revenues include sales of product and services to customers, net of any discounts and taxes, and freight and delivery revenues billed to customers. Freight and delivery generally represent pass-through transportation we incur (including our administrative costs) and pay to third-party carriers to deliver our products to customers. The cost related to freight and delivery is included in cost of revenues.\nRevenues are measured as the amount of consideration we expect to receive in exchange for transferring goods or providing services. Sales tax and other taxes we collect are recorded as liabilities until remitted and thus are excluded from revenues. Costs to obtain and fulfill contracts (primarily asphalt construction paving contracts) are immaterial and are expensed as incurred when the expected amortization period is \none year\n or less.\nRevenues for product sales are recognized when control passes to the customer (typically occurs when finished products are shipped/delivered). Construction paving revenues are recognized using the percentage-of-completion method.\nOur products typically are sold to private industry and not directly to governmental entities. Although approximately \n40\n% to \n55\n% of our aggregates shipments have historically been used in publicly-funded construction (such as highways, airports and government buildings), relatively insignificant sales are made directly to federal, state, county or municipal governments/agencies. Therefore, although reductions in state and federal funding can curtail publicly-funded construction, the vast majority of our aggregates business is not directly subject to renegotiation of profits or termination of contracts with state or federal governments.\nFor additional information regarding revenues and revenue recognition, see \nNote 2\n.\nSTRIPPING COSTS\nIn the mining industry, the costs of removing overburden and waste materials to access mineral deposits are referred to as stripping costs.\nStripping costs incurred during the production phase are considered costs of extracted minerals under our inventory costing system, inventoried, and recognized in cost of sales in the same period as the revenue from the sale of the inventory. The production stage is deemed to begin when the activities, including removal of overburden and waste material that may contain incidental saleable material, required to access the saleable product are complete.\n Stripping costs considered as production costs and included in the costs of inventory produced were $\n132.1\n million, $\n135.8\n million and $\n133.1\n million in 2024, 2023 and 2022, respectively.\nConversely, stripping costs incurred during the development stage of a mine (pre-production stripping) are excluded from our inventory cost. Pre-production stripping costs are capitalized and reported within other noncurrent assets in our accompanying Consolidated Balance Sheets. Capitalized pre-production stripping costs are expensed over the productive life of the mine using the unit-of-sales method.\n Pre-production stripping costs included in other noncurrent assets were $\n104.8\n million and $\n98.4\n million\n \n(net of accumulated amortization of $\n9.8\n million and $\n7.7\n million) as of December 31, 2024 and 2023, respectively.\nRECLAMATION COSTS\nReclamation costs resulting from normal use of long-lived assets are recognized over the period the asset is in use when there is a legal obligation to incur these costs upon retirement of the assets. Additionally, reclamation costs resulting from normal use under a mineral lease are recognized over the lease term when there is a legal obligation to incur these costs upon expiration of the lease. The obligation, which cannot be reduced by estimated offsetting cash flows, is recorded at fair value as a liability at the obligating event date and is accreted through charges to operating expenses. This fair value is also capitalized as part of the carrying amount of the underlying asset and depreciated over the estimated useful life of the asset. If the obligation is settled for other than the carrying amount of the liability, a gain or loss is recognized on settlement.\nTo determine the fair value of the obligation, we estimate the cost (including a reasonable profit margin) for a third party to perform the legally required reclamation tasks. This cost is then increased for both future estimated inflation and an estimated market risk premium related to the estimated years to settlement. Once calculated, this cost is discounted to fair value using present value techniques with a credit-adjusted, risk-free rate commensurate with the estimated years to settlement.\nIn estimating the settlement date, we evaluate the current facts and conditions to determine the most likely settlement date. If this evaluation identifies alternative estimated settlement dates, we use a weighted-average settlement date considering the probabilities of each alternative.\nWe review reclamation obligations at least annually for a revision to the cost or a change in the estimated settlement date. Additionally, reclamation obligations are reviewed in the period that a triggering event occurs that would result in either a revision to the cost or a change in the estimated settlement date. Examples of events that would trigger a change in the cost include a new reclamation law or amendment of an existing mineral lease. Examples of events that would trigger a change in the estimated settlement date include the acquisition of additional reserves or the closure of a facility.\nThe carrying value of these obligations was $\n427.4\n million and $\n324.1\n million as of December 31, 2024 and 2023, respectively. For additional information about reclamation obligations (referred to in our financial statements as asset retirement obligations), see \nNote 17\n.\nPart II\n73\nENVIRONMENTAL COMPLIANCE\nOur environmental compliance costs are undiscounted and include the cost of ongoing monitoring programs, the cost of remediation efforts and other similar costs. We accrue costs for environmental assessment and remediation efforts when we determine that a liability is probable and we can reasonably estimate the cost. At the early stages of a remediation effort, environmental remediation liabilities are not easily quantified due to the uncertainties of various factors. The range of an estimated remediation liability is defined and redefined as events in the remediation effort occur, but generally liabilities are recognized no later than the completion of the remedial feasibility study.\nWhen we can estimate a range of probable loss, we accrue the most likely amount. If no amount in the range of probable loss is considered most likely, the minimum loss in the range is accrued. As of December 31, 2024, the spread between the amount accrued and the maximum loss in the range for all sites for which a range can be reasonably estimated was $\n4.1\n million; this amount does not represent our maximum exposure to loss for all environmental remediation obligations as it excludes those sites for which a range of loss cannot be reasonably estimated at this time. Accrual amounts may be based on technical cost estimations or the professional judgment of experienced environmental managers. Our Safety, Health and Environmental Affairs Management Committee routinely reviews cost estimates and key assumptions in response to new information, such as the kinds and quantities of hazardous substances, available technologies and changes to the parties participating in the remediation efforts. However, a number of factors, including adverse agency rulings and encountering unanticipated conditions as remediation efforts progress, may cause actual results to differ materially from accrued costs.\nFor additional information about environmental compliance costs, see \nNote 8\n.\nCLAIMS AND LITIGATION INCLUDING SELF-INSURANCE\nWe are involved with claims and litigation, including items covered under our self-insurance program. We are self-insured for losses related to workers' compensation up to $\n3.0\n million per occurrence and automotive and general/product liability up to $\n10.0\n million per occurrence. We have excess coverage on a per occurrence basis beyond these retention levels. Under our self-insurance program, we aggregate certain claims and litigation costs that are reasonably predictable based on our historical loss experience and accrue losses, including future legal defense costs, based on actuarial studies. Certain claims and litigation costs, due to their unique nature, are not included in our actuarial studies. We use both internal and outside legal counsel to assess the probability of loss and establish an accrual when the claims and litigation represent a probable loss and the cost can be reasonably estimated. For matters not included in our actuarial studies, legal defense costs are accrued when incurred.\n \nThe following table outlines our self-insurance program at December 31:\ndollars in millions\n2024\n2023\nSelf-insurance Program\nSelf-insured liabilities (undiscounted)\n$\n138.2\n \n$\n151.7\n \nInsured liabilities (undiscounted)\n2.3\n \n2.3\n \nDiscount rate\n4.22\n \n%\n4.56\n \n%\nAmounts Recognized in Consolidated Balance Sheets\nInvestments and long-term receivables\n2.3\n \n2.3\n \nOther current liabilities\n(\n47.3\n)\n(\n59.6\n)\nOther noncurrent liabilities\n(\n74.6\n)\n(\n76.1\n)\nNet insurance liabilities (discounted)\n$\n(\n119.6\n)\n$\n(\n133.4\n)\nEstimated payments (undiscounted and excluding the impact of related receivables) under our self-insurance program for the five years subsequent to December 31, 2024 are as follows:\n \nin millions\nEstimated Payments under Self-insurance Program\n2025\n$\n40.1\n \n2026\n29.0\n \n2027\n17.6\n \n2028\n10.0\n \n2029\n5.4\n \nSignificant judgment is used in determining the timing and amount of the accruals for probable losses, and the actual liability could differ materially from the accrued amounts.\nFor additional information about claims and litigation, see \nNote 12\n under the caption \"Litigation and Environmental Matters.\"\nPart II\n74\nSHARE-BASED COMPENSATION\nAll of our share-based compensation awards are classified as equity awards. We measure share-based compensation awards using fair-value-based measurement methods. This results in the recognition of compensation expense for all share-based compensation awards based on their fair value as of the grant date with adjustments for performance, as applicable. Compensation cost is recognized over the requisite service period. Forfeitures are recognized as they occur.\nA summary of the estimated future compensation cost (unrecognized compensation expense) as of December 31, 2024 related to share-based awards granted to employees under our long-term incentive plans is presented below:\ndollars in millions\nUnrecognized\nCompensation\nExpense\nExpected\nWeighted-Average\nRecognition (Years)\nSOSARs \n1\n$\n1.7\n \n1.4\nPerformance shares\n18.6\n \n1.7\nRestricted shares\n13.4\n \n1.7\nTotal/weighted-average\n$\n33.7\n \n1.7\n1\nStock-Only Stock Appreciation Rights (SOSARs)\nPretax compensation expense related to our employee share-based compensation awards and related income tax benefits for the years ended December 31 are summarized below:\nin millions\n2024\n2023\n2022\nPretax compensation expense\n$\n50.6\n \n$\n60.6\n \n$\n38.7\n \nIncome tax benefits\n7.7\n \n9.1\n \n6.9\n \nWe receive an income tax deduction for share-based compensation equal to the excess of the market value of our common stock on the date of exercise or issuance over the exercise price. Excess tax benefits resulting from tax deductions, after considering any deductibility limitations such as IRC section 162(m), in excess of the compensation cost recognized are reflected as discrete income tax benefits in the period of exercise or issuance.\nFor additional information about share-based compensation, see \nNote 11\n under the caption \"Share-based Compensation Plans\".\nPENSION AND OTHER POSTRETIREMENT BENEFITS\nAccounting for pension and other postretirement benefits requires that we use assumptions for the valuation of projected benefit obligations (PBO) and the performance of plan assets. Each year, we review our assumptions (listed below) for discount rates (used for PBO, service cost, and interest cost calculations), expected return on plan assets and the cost of covered healthcare benefits. Due to plan changes made in 2013, annual pay increases do not materially impact plan obligations.\n▪\nDiscount Rates — We use a high-quality bond full yield curve approach (specific spot rates for each annual expected cash flow) to establish the discount rates at each measurement date.\n▪\nExpected Return on Plan Assets — Our expected return on plan assets is a long-term view based on our current asset allocation and a judgment informed by consultation with our retirement plans’ consultant and our pension plans’ actuary.\n▪\nRate of Increase in the Per Capita Cost of Covered Healthcare Benefits — We project the expected increases in the cost of covered healthcare benefits.\nAccounting standards provide for the delayed recognition of differences between actual results and expected or estimated results. This delayed recognition of actual results allows for a smoothed recognition in earnings of changes in benefit obligations and asset performance. The differences between actual results and expected or estimated results are recognized in full in other comprehensive income. Amounts recognized in other comprehensive income are reclassified to earnings in a systematic manner over the average remaining service period of participants for our active plans or the average remaining lifetime of participants for our inactive plans.\nWe present the service cost component of net periodic benefit cost in cost of revenues and selling, administrative and general expense consistent with employee compensation costs. The other components of net periodic benefit cost are \nreported within other nonoperating income in our accompanying Consolidated Statements of Comprehensive Incom\ne.\nFor additional information about pension and other postretirement benefits, see \nNote 10\n.\nPart II\n75\nINCOME TAXES\nWe file federal, state and foreign income tax returns and account for the current and deferred tax effects of such returns using the asset and liability method. We recognize deferred tax assets and liabilities (which reflect our best assessment of the future taxes we will pay) based on the differences between the book basis and tax basis of assets and liabilities. Deferred tax assets represent items to be used as a tax deduction or credit in future tax returns while deferred tax liabilities represent items that will result in additional tax in future tax returns.\nSignificant judgments and estimates are required in determining our deferred tax assets and liabilities. These estimates are updated throughout the year to consider income tax return filings, our geographic mix of earnings, legislative changes and other relevant items. We are required to account for the effects of changes in income tax rates on deferred tax balances in the period in which the legislation is enacted.\nEach quarter we analyze the likelihood that our deferred tax assets will be realized. Realization of the deferred tax assets ultimately depends on the existence of sufficient taxable income of the appropriate character in either the carryback or carryforward period. A valuation allowance is recorded if, based on the weight of all available positive and negative evidence, it is more likely than not (a likelihood of more than \n50\n%) that some portion, or all, of a deferred tax asset will not be realized. A summary of our deferred tax assets is included in \nNote 9\n.\nWe recognize a tax benefit associated with a tax position when, in our judgment, it is more likely than not that the position will be sustained based upon the technical merits of the position. For a tax position that meets the more likely than not recognition threshold, we measure the income tax benefit as the largest amount that we judge to have a greater than \n50\n% likelihood of being realized. A liability is established for the unrecognized portion of any tax position. Our liability for unrecognized tax benefits is adjusted periodically due to changing circumstances, such as the progress of tax audits, case law developments and new legislation.\nGenerally, we are not subject to significant changes in income taxes by any taxing jurisdiction for the years before 2021. While it is often difficult to predict the final outcome or the timing of resolution of any particular tax matter, we believe our liability for unrecognized tax benefits is appropriate.\nWe consider a tax position to be resolved at the earlier of the issue being “effectively settled,” settlement of an examination, or the expiration of the statute of limitations. Upon resolution of a tax position, any liability for unrecognized tax benefits will be released.\nOur liability for unrecognized tax benefits is generally presented as noncurrent. However, if we anticipate paying cash within one year to settle an uncertain tax position, the liability is presented as current. We classify interest and penalties associated with our liability for unrecognized tax benefits as income tax expense.\nOur largest permanent item in computing both our taxable income and effective tax rate is the deduction allowed for statutory depletion. The impact of statutory depletion on the effective tax rate is presented in \nNote 9\n. The deduction for statutory depletion does not necessarily change proportionately to changes in pretax earnings.\nCOMPREHENSIVE INCOME\nWe report comprehensive income in our Consolidated Statements of Comprehensive Income and Consolidated Statements of Equity. Comprehensive income comprises two subsets: net earnings and other comprehensive income (OCI). OCI includes adjustments to cash flow hedges, as well as actuarial gains or losses and prior service costs related to pension and postretirement benefit plans.\nFor additional information about comprehensive income, see \nNote 14\n.\nEARNINGS PER SHARE (EPS)\nEarnings per share are computed by dividing net earnings by the weighted-average common shares outstanding (basic EPS) or weighted-average common shares outstanding assuming dilution (diluted EPS)\n, as set forth below:\nin millions\n2024\n2023\n2022\nWeighted-average common shares outstanding\n132.3\n133.0\n133.0\nDilutive effect of\nSOSARs\n0.2\n0.2\n0.2\nOther stock compensation awards\n0.6\n0.5\n0.4\nWeighted-average common shares outstanding, assuming dilution\n133.1\n133.7\n133.6\nAll dilutive common stock equivalents are reflected in our earnings per share calculations. In periods of loss, shares that otherwise would have been included in our diluted weighted-average common shares outstanding computation would be excluded.\nAntidilutive common stock equivalents are not included in our earnings per share calculations.\n \nThe number of antidilutive common stock equivalents for which the exercise price exceeds the weighted-average market price for the years ended December 31 is as follows:\nin millions\n2024\n2023\n2022\nAntidilutive common stock equivalents\n0.0\n0.0\n0.1\nPart II\n76\nRECLASSIFICATIONS\nAs a result of a first quarter 2024 change in our internal management reporting structure, prior period segment information has been revised to conform to our current segment reporting structure. This change had no impact on our prior consolidated results of operations, financial position or cash flows (refer to \nNote\n \n15\n for further information).\nNEW ACCOUNTING STANDARDS\nACCOUNTING STANDARDS RECENTLY ADOPTED\nDuring the fourth quarter of 2024, we adopted Accounting Standards Update (ASU) 2023-07, “Segment Reporting – Improvements to Reportable Segment Disclosures,” which resulted in enhanced disclosures related to significant segment expenses and a description of how the chief operating decision maker utilizes segment operating profit or loss to assess segment performance (see \nNote\n 15\n). \nACCOUNTING STANDARDS PENDING ADOPTION\nIn December 2023, the Financial Accounting Standards Board (FASB) issued ASU 2023-09, “Income Taxes – Improvements to Income Tax Disclosures,” which requires disclosure of specific categories and disaggregation of information in the rate reconciliation table and expands disclosures related to income taxes paid. The new standard is effective for fiscal years beginning after December 15, 2024 and is to be applied prospectively. We are assessing the effect of this ASU on our disclosures that will be included in our Form 10-K for the year ending December 31, 2025.\nIn November 2024, the FASB issued ASU 2024-03, \"Disaggregation of Income Statement Expenses,\" which requires disaggregated disclosure of prescribed expense categories within relevant income statement captions. The new standard is effective for fiscal years beginning after December 15, 2026 and is to be applied prospectively. We are assessing the effect of this ASU on our consolidated financial statements and related disclosures.\nPart II\n77\nNOTE 2: \nREVENUES\nTotal revenues are primarily derived from our product sales of aggregates (crushed stone, sand and gravel, sand and other aggregates), asphalt mix and ready-mixed concrete, and include freight & delivery costs that we pass along to our customers to deliver these products. We also generate service revenues from our asphalt construction paving business and service revenues related to our aggregates business, such as landfill tipping fees. Our total service revenues were as follows: 2024 — $\n275.7\n million (\n3.7\n% of total revenues), 2023 — $\n239.6\n million (\n3.1\n% of total revenues) and 2022 — $\n233.1\n million (\n3.2\n% of total revenues).\nOur segment total revenues by geographic market for the years ended December 31, 2024, 2023 and 2022 are disaggregated as follows:\nFor the Year Ended December 31, 2024\nin millions\nAggregates \nAsphalt\nConcrete\nTotal \nEast revenues\n$\n1,758.6\n \n$\n200.0\n \n$\n338.3\n \n$\n2,296.9\n \nGulf Coast revenues\n3,242.9\n \n277.4\n \n8.8\n \n3,529.1\n \nWest revenues\n948.1\n \n768.2\n \n306.4\n \n2,022.7\n \nSegment sales\n$\n5,949.6\n \n$\n1,245.6\n \n$\n653.5\n \n$\n7,848.7\n \nIntersegment sales\n(\n431.0\n)\n0.0\n \n0.0\n \n(\n431.0\n)\nTotal revenues \n1\n$\n5,518.6\n \n$\n1,245.6\n \n$\n653.5\n \n$\n7,417.7\n \nFor the Year Ended December 31, 2023\nin millions\nAggregates \nAsphalt\nConcrete\nTotal \nEast revenues\n$\n1,665.2\n \n$\n201.4\n \n$\n363.0\n \n$\n2,229.6\n \nGulf Coast revenues\n3,333.8\n \n231.6\n \n539.8\n \n4,105.2\n \nWest revenues\n919.9\n \n707.7\n \n346.5\n \n1,974.1\n \nSegment sales\n$\n5,918.9\n \n$\n1,140.7\n \n$\n1,249.3\n \n$\n8,308.9\n \nIntersegment sales\n(\n527.0\n)\n0.0\n \n0.0\n \n(\n527.0\n)\nTotal revenues \n1\n$\n5,391.9\n \n$\n1,140.7\n \n$\n1,249.3\n \n$\n7,781.9\n \nFor the Year Ended December 31, 2022\nin millions\nAggregates \nAsphalt\nConcrete\nTotal \nEast revenues\n$\n1,508.2\n \n$\n177.3\n \n$\n694.2\n \n$\n2,379.7\n \nGulf Coast revenues\n2,940.8\n \n211.2\n \n551.9\n \n3,703.9\n \nWest revenues\n831.6\n \n601.7\n \n347.8\n \n1,781.1\n \nSegment sales\n$\n5,280.6\n \n$\n990.2\n \n$\n1,593.9\n \n$\n7,864.7\n \nIntersegment sales\n(\n549.5\n)\n0.0\n \n0.0\n \n(\n549.5\n)\nTotal revenues \n1\n$\n4,731.1\n \n$\n990.2\n \n$\n1,593.9\n \n$\n7,315.2\n \n1\nThe geographic markets are defined by states/countries as follows:\nEast market — Arkansas, Delaware, Illinois, Kentucky, Maryland, New Jersey, New York, North Carolina, Pennsylvania, Tennessee, Virginia, and Washington D.C.\nGulf Coast market — Alabama, Florida, Georgia, Louisiana, Mississippi, Oklahoma, South Carolina, Texas, U.S. Virgin Islands, Freeport (Bahamas), Puerto Cortés (Honduras) and Quintana Roo (Mexico)\nWest market — Arizona, California, Hawaii, New Mexico and British Columbia (Canada)\nPRODUCT REVENUES\nRevenue is recognized when obligations under the terms of a contract with our customer are satisfied; generally, this occurs at a point in time when our aggregates, asphalt mix and ready-mixed concrete are shipped/delivered and control passes to the customer. Revenue for our products is recorded at the fixed invoice amount, and payment is due by the 15\nth\n day of the following month;\n \nwe do not offer discounts for early payment.\nFreight & delivery generally represents pass-through transportation costs we incur (including our administrative costs) and pay to third-party carriers to deliver our products to customers and are accounted for as a fulfillment activity. Likewise, the costs related to freight & delivery are included in cost of revenues.\nPart II\n78\nFreight & delivery revenues are as follows:\nin millions\n2024\n2023\n2022\nTotal revenues\n$\n7,417.7\n \n$\n7,781.9\n \n$\n7,315.2\n \nFreight & delivery revenues \n1\n(\n988.2\n)\n(\n1,003.4\n)\n(\n960.3\n)\nTotal revenues excluding freight & delivery\n$\n6,429.5\n \n$\n6,778.5\n \n$\n6,354.9\n \n1\nIncludes freight & delivery to remote distribution sites.\n \nCONSTRUCTION PAVING SERVICE REVENUES\nRevenue from our asphalt construction paving business is recognized over time using the percentage-of-completion method under the cost approach. The percentage of completion is determined by costs incurred to date as a percentage of total costs estimated for the project. Under this approach, recognized contract revenue equals the total estimated contract revenue multiplied by the percentage of completion. Future revenues from unsatisfied performance obligations (including contracts with an expected duration of 1 year or less) at December 31, 2024, 2023 and 2022 were $\n159.0\n million, $\n137.0\n million and $\n112.3\n million, respectively. The remaining period to complete the obligations remaining at December 31, 2024 ranged from \n1\n month to \n48\n months.\nOur construction contracts are unit priced, and an account receivable is recorded for amounts invoiced based on actual units produced. Contract assets for estimated earnings in excess of billings, contract assets related to retainage provisions and contract liabilities for billings in excess of costs are immaterial. Variable consideration in our construction paving contracts is immaterial and consists of incentives and penalties based on the quality of work performed. Our construction paving contracts may contain warranty provisions covering defects in equipment, materials, design or workmanship that generally run from nine months to one year after project completion. Due to the nature of our construction paving projects, including contract owner inspections of the work during construction and prior to acceptance, we have not experienced material warranty costs for these short-term warranties.\nVOLUMETRIC PRODUCTION PAYMENT DEFERRED REVENUES\nIn 2013 and 2012, we sold a percentage interest in certain future aggregates production for net cash proceeds of $\n226.9\n million. These transactions, structured as volumetric production payments (VPPs): \n▪\nrelate to \neight\n quarries in Georgia and South Carolina\n▪\nprovide the purchaser solely with a nonoperating percentage interest in the subject quarries’ future aggregates production\n▪\ncontain no minimum annual or cumulative guarantees by us for production or sales volume, nor minimum sales price\n▪\nare both volume and time limited\nWe are the exclusive sales agent for, and transmit quarterly to the purchaser the proceeds from the sale of, the purchaser’s share of aggregates production. Our consolidated total revenues exclude the revenue from the sale of the purchaser’s share of aggregates.\nThe proceeds we received from the sale of the percentage interest were recorded as deferred revenue on the balance sheet. We recognize revenue on a unit-of-sales basis (as we sell the purchaser’s share of production) relative to the volume limitations of the transactions. Given the nature of the risks and potential rewards assumed by the buyer, the transactions do not reflect financing activities.\nChanges in the VPP deferred revenue balances (current and noncurrent) are as follows: \nin millions\n2024\n2023\n2022\nDeferred revenue balance at beginning of year\n$\n152.8\n \n$\n161.8\n \n$\n170.1\n \nRevenue recognized from deferred revenue\n(\n7.5\n)\n(\n9.0\n)\n(\n8.3\n)\nDeferred revenue balance at end of year\n$\n145.3\n \n$\n152.8\n \n$\n161.8\n \nBased on expected sales from the specified quarries, we expect to recognize $\n7.5\n million of VPP deferred revenue as income in 2025 (reflected in other current liabilities in our December 31, 2024 Consolidated Balance Sheet).\nPart II\n79\nNOTE 3: \nINVENTORIES\nInventories at December 31 are as follows:\nin millions\n2024\n2023\nFinished products \n1\n$\n534.6\n \n$\n494.4\n \nRaw materials\n69.7\n \n51.2\n \nProducts in process\n9.0\n \n6.5\n \nOperating supplies and other\n68.5\n \n63.5\n \nTotal inventories\n$\n681.8\n \n$\n615.6\n \n1\nIncludes inventories encumbered by volumetric production payments (see Note 2) of $\n3.9\n million and $\n3.6\n million as of December 31, 2024 and 2023, respectively.\nIn addition to the inventory balances presented above, as of December 31, 2024 and 2023, we had $\n22.8\n million and $\n12.5\n million, respectively, of inventory classified as long-term assets (other noncurrent assets) as we do not expect to sell the inventory within one year of their respective balance sheet dates.\nWe use the LIFO method of valuation for most of our inventories as it results in a better matching of costs with revenues. Inventories valued under the LIFO method total $\n389.8\n million and $\n356.9\n million at December 31, 2024 and 2023, respectively. During 2024, 2023 and 2022, inventory reductions resulted in liquidations of LIFO inventory layers carried at costs prevailing in prior years as compared to current-year costs. The effect of the LIFO liquidation on our results was as follows:\n▪\n2024 — decrease cost of revenues by $\n5.1\n million and increase net earnings by $\n3.8\n million\n▪\n2023 — decrease cost of revenues by $\n3.6\n million\n \nand increase net earnings by $\n2.7\n million\n▪\n2022 — decrease cost of revenues by $\n4.8\n million and increase net earnings by $\n3.5\n million\nEstimated current cost exceeded LIFO cost at December 31, 2024 and 2023 by $\n370.6\n million and $\n302.6\n million, respectively. In periods of increasing costs, LIFO generally results in higher cost of revenues than under FIFO. In periods of decreasing costs, the results are generally the opposite. We provide supplemental income disclosures to facilitate comparisons with companies not on LIFO. The supplemental income calculation is derived by tax-affecting the change in the LIFO reserve for the periods presented. If all inventories valued at LIFO cost had been valued under first-in, first-out (FIFO) method, the approximate effect on net earnings would have been an increase of $\n47.2\n million in 2024, an increase of $\n27.9\n million in 2023 and an increase of $\n48.1\n million in 2022.\nNOTE 4: \nPROPERTY, PLANT & EQUIPMENT\nBalances of major classes of assets and allowances for depreciation, depletion and amortization at December 31 are as follows:\n \nin millions\n2024\n2023\nLand and land improvements \n1\n$\n5,804.8\n \n$\n4,292.6\n \nBuildings\n304.4\n \n204.4\n \nMachinery and equipment\n7,717.2\n \n6,785.5\n \nFinance leases (see Note 7)\n54.7\n \n62.3\n \nDeferred asset retirement costs\n235.6\n \n171.3\n \nConstruction in progress\n400.1\n \n319.4\n \nTotal, gross property, plant & equipment\n$\n14,516.8\n \n$\n11,835.5\n \nAllowances for depreciation, depletion and amortization\n(\n6,055.3\n)\n(\n5,617.8\n)\nTotal, net property, plant & equipment\n$\n8,461.5\n \n$\n6,217.7\n \n1\nIncludes depletable land of $\n4,015.7\n million and $\n2,684.4\n million as of December 31, 2024 and 2023, respectively.\nCapitalized interest costs with respect to qualifying construction projects and total interest costs incurred before recognition of the capitalized amount for the years ended December 31 are as follows:\n \nin millions\n2024\n2023\n2022\nCapitalized interest cost\n$\n4.0\n \n$\n3.7\n \n$\n3.6\n \nTotal interest cost incurred before recognition of the capitalized amount\n195.2\n \n199.8\n \n172.8\n \nPart II\n80\nNOTE 5: \nDERIVATIVE INSTRUMENTS\nDuring the normal course of operations, we are exposed to market risks including interest rates, foreign currency exchange rates and commodity prices. From time to time, we use derivative instruments to balance the cost and risk of such expenses. We do not use derivative instruments for trading or other speculative purposes. \nIn March 2023, we issued $\n550.0\n million of \n5.80\n% fixed-rate debt maturing in March 2026. Concurrently, we entered into fixed-to-floating interest rate swap agreements designated as fair value hedges in the amount of $\n550.0\n million. These swap agreements terminated in March 2024, coinciding with the redemption of the debt.\nThe changes in the fair value of these swaps designated as fair value hedges were recorded in interest expense and were perfectly offset by changes in the fair value of the related debt also recorded in interest expense. \nThese swaps were recognized at fair value in the accompanying Consolidated Balance Sheets at December 31 as follows:\nin millions\nBalance Sheet Location\n2024\n2023\nFair Value Hedges \n1\nInterest rate swaps\nOther noncurrent assets\n$\n0.0\n \n$\n3.9\n \nInterest rate swaps\nOther current liabilities\n0.0\n \n(\n4.2\n)\nInterest rate swaps net liability\n$\n0.0\n \n$\n(\n0.3\n)\n \n1\nSee \nNote 1\n under the caption “Fair Value Measurements” for further discussion of fair value determination.\n \nIn 2007, 2018 and 2020, we entered into interest rate locks of future debt issuances to hedge the risk of higher interest rates. These interest rate locks were designated as cash flow hedges. The gain/loss upon settlement of these cash flow hedges is deferred (recorded in accumulated other comprehensive income (AOCI)) and amortized to interest expense over the term of the related debt.\nThis amortization was reflected in the accompanying Consolidated Statements of Comprehensive Income for the years ended December 31 as follows:\n \nin millions\nIncome Statement Location\n2024\n2023\n2022\nCash Flow Hedges\nLoss reclassified from AOCI\nInterest expense\n$\n(\n2.2\n)\n$\n(\n2.1\n)\n$\n(\n2.0\n)\nFor the twelve-month period ending December 31, 2025, we estimate that $\n2.4\n million of the $\n17.7\n million net of tax loss in AOCI will be reclassified to interest expense.\nPart II\n81\nNOTE 6: \nDEBT\nDebt at December 31 is detailed as follows:\nin millions\nEffective\nInterest Rates\n2024\n2023\nBank line of credit expires 2029 \n1\n$\n0.0\n \n$\n0.0\n \nCommercial paper expires 2029\n1\n0.0\n \n0.0\n \nTotal short-term debt\n$\n0.0\n \n$\n0.0\n \nBank line of credit expires 2029 \n1\n$\n0.0\n \n$\n0.0\n \nCommercial paper expires 2029 \n1\n550.0\n \n550.0\n \n4.50\n% notes due 2025\n4.65\n%\n400.0\n \n400.0\n \n5.80\n% notes due 2026\n0.0\n \n550.0\n \n3.90\n% notes due 2027\n4.00\n%\n400.0\n \n400.0\n \n4.95\n% notes due 2029\n5.17\n%\n500.0\n \n0.0\n \n3.50\n% notes due 2030\n3.94\n%\n750.0\n \n750.0\n \n5.35\n% notes due 2034\n5.48\n%\n750.0\n \n0.0\n \n7.15\n% notes due 2037\n8.05\n%\n129.2\n \n129.2\n \n4.50\n% notes due 2047\n4.59\n%\n700.0\n \n700.0\n \n4.70\n% notes due 2048\n5.42\n%\n460.9\n \n460.9\n \n5.70\n% notes due 2054\n5.82\n%\n750.0\n \n0.0\n \nOther notes\n1.0\n \n1.4\n \nTotal long-term debt - face value\n$\n5,391.1\n \n$\n3,941.5\n \nUnamortized discounts and debt issuance costs\n(\n83.7\n)\n(\n63.4\n)\nFair value adjustments \n2\n0.0\n \n(\n0.3\n)\nTotal long-term debt - book value\n$\n5,307.4\n \n$\n3,877.8\n \nCurrent maturities\n(\n400.5\n)\n(\n0.5\n)\nTotal long-term debt - reported value\n$\n4,906.9\n \n$\n3,877.3\n \nEstimated fair value of long-term debt\n$\n4,762.6\n \n$\n3,798.0\n \n1\nBorrowings on the bank line of credit and commercial paper are classified as short-term if we intend to repay within twelve months and as long-term if we have the intent and ability to extend payment beyond twelve months. \n2\nSee \nNote 5\n for additional information on our fair value hedging strategy.\n \n \nDiscounts and debt issuance costs are amortized using the effective interest method over the terms of the respective notes resulting in $\n11.4\n million and $\n6.2\n million of net interest expense for these items for 2024 and 2023, respectively.\nLINE OF CREDIT AND COMMERCIAL PAPER PROGRAM\nOur $\n1,600.0\n million commercial paper program was established in August 2022 and matures in November 2029. Commercial paper borrowings bear interest at rates determined at the time of borrowing and as agreed between us and the commercial paper investors. As of December 31, 2024, we had $\n550.0\n million in long-term commercial paper borrowings.\nOur $\n1,600.0\n million unsecured line of credit was amended in November 2024 to extend the maturity date from August 2027 to November 2029. Our line of credit contains covenants customary for an unsecured investment-grade facility. As of December 31, 2024, we were in compliance with the line of credit covenants. Borrowings on the line of credit bear interest, at our option, at either SOFR plus a margin or Truist Bank’s base rate plus a margin. The margins are determined by our credit ratings. Standby letters of credit, which are issued under the line of credit and reduce availability, are charged a fee equal to the margin for SOFR borrowings plus \n0.175\n%. We also pay a commitment fee on the daily average unused amount of the line of credit that ranges from \n0.090\n% to \n0.225\n% determined by our credit ratings. As of December 31, 2024, the margin for SOFR borrowings was \n1.125\n%, the margin for base rate borrowings was \n0.125\n% and the commitment fee for the unused amount was \n0.100\n%.\nAs of December 31, 2024, our available borrowing capacity under the line of credit was $\n1,504.8\n million. Utilization of the borrowing capacity was as follows:\n▪\nNone\n was borrowed\n▪\n$\n95.2\n million was used to support standby letters of credit\nPart II\n82\nTERM DEBT\nAll of our $\n5,391.1\n million (face value) of term debt (which includes $\n550.0\n million of commercial paper) is unsecured. All of the covenants in the debt agreements are customary for investment-grade facilities. As of December 31, 2024, we were in compliance with all term debt covenants.\nIn March 2023, we issued $\n550.0\n million of \n5.80\n% senior notes due 2026. We redeemed these notes at par in March 2024 using cash on hand and recognized noncash expense of $\n2.3\n million with the acceleration of unamortized deferred debt issuance costs.\nIn November 2024, we entered into a $\n2,000.0\n million unsecured delayed draw term loan which was partially drawn in November 2024 upon the acquisition of Wake Stone Corporation (Wake Stone). Subsequently, the delayed draw term loan balance was fully repaid and terminated in November 2024 using proceeds from the issuance of senior notes as described below.\nIn November 2024, we issued $\n500.0\n million of \n4.95\n% senior notes due 2029, $\n750.0\n million of \n5.35\n% senior notes due 2034 and $\n750.0\n million of \n5.70\n% senior notes due 2054. Total proceeds of $\n1,975.0\n million (net of discounts and transaction costs), together with cash on hand, were used to repay the outstanding balance on the $\n2,000.0\n million delayed draw term loan and to provide liquidity for acquisitions and debt maturing in 2025.\nThe total scheduled (principal and interest) debt payments, excluding the line of credit, for the five years subsequent to December 31, 2024 are as follows:\nin millions\nTotal\nPrincipal\nInterest\nScheduled Debt Payments (excluding the line of credit)\n \n \n \n2025\n$\n649.2\n \n$\n400.5\n \n$\n248.7\n \n2026\n233.5\n \n0.4\n \n233.1\n \n2027\n624.9\n \n400.0\n \n224.9\n \n2028\n217.1\n \n0.0\n \n217.1\n \n2029\n1,265.3\n \n1,050.0\n \n215.3\n \nSTANDBY LETTERS OF CREDIT\nWe provide, in the normal course of business, certain third-party beneficiaries with standby letters of credit to support our obligations to pay or perform according to the requirements of an underlying agreement. Such letters of credit typically have an initial term of \none year\n, renew automatically and can only be modified or canceled with the approval of the beneficiary. Except for $\n9.6\n million of letters of credit related to acquisitions completed in 2024, our standby letters of credit are issued by banks that participate in our $\n1,600.0\n million line of credit and reduce the borrowing capacity thereunder. \nOur standby letters of credit as of December 31, 2024 are summarized by purpose in the table below:\n \nin millions\nRisk management insurance\n$\n81.4\n \nReclamation/restoration requirements\n23.4\n \nTotal standby letters of credit\n$\n104.8\n \n \nPart II\n83\nNOTE 7: \nLEASES\nOur portfolio of nonmineral leases is composed of leases for real estate (including office buildings, aggregates sales yards and terminals, and concrete and asphalt sites) and equipment (including railcars and rail track, barges, and office, plant and mobile equipment).\nLease right-of-use (ROU) assets and liabilities reflected on our December 31 balance sheets and the weighted-average lease terms and discount rates are as follows:\ndollars in millions\nClassification on the Balance Sheet\n2024\n2023\nAssets\nOperating lease ROU assets\n$\n673.2\n \n$\n636.1\n \nAccumulated amortization\n(\n146.8\n)\n(\n124.4\n)\nOperating leases, net\nOperating lease right-of-use assets, net\n526.4\n \n511.7\n \nFinance lease ROU assets\n54.7\n \n62.3\n \nAccumulated depreciation\n(\n24.3\n)\n(\n20.2\n)\nFinance leases, net\nProperty, plant & equipment, net\n30.4\n \n42.1\n \nTotal lease assets\n$\n556.8\n \n$\n553.8\n \nLiabilities\nCurrent\nOperating\nOther current liabilities\n$\n49.3\n \n$\n47.3\n \nFinance\nOther current liabilities\n10.7\n \n12.5\n \nNoncurrent\nOperating \nNoncurrent operating lease liabilities\n521.4\n \n507.4\n \nFinance\nOther noncurrent liabilities\n9.7\n \n16.6\n \nTotal lease liabilities\n$\n591.1\n \n$\n583.8\n \nLease Term and Discount Rate\nWeighted-average remaining lease term (years)\nOperating leases\n18.9\n19.5\nFinance leases\n2.2\n2.5\nWeighted-average discount rate\nOperating leases\n4.5\n \n%\n4.3\n \n%\nFinance leases\n3.2\n \n%\n2.4\n \n%\nOur lease agreements do not contain material residual value guarantees, restrictive covenants or early termination options. In addition to the lease assets and liabilities presented in the table above, we entered into an agreement to lease a terminal in California and expect to have all permits in place associated with all lease commencement options by the second quarter of 2025.\nOur building leases have remaining noncancelable periods of \n0\n - \n14\n years and lease terms (including options to extend) of \n1\n - \n22\n years. Key factors in determining the certainty of lease renewals include the location of the building, the value of leasehold improvements and the cost to relocate. Rental payments for certain of our building leases are periodically adjusted for inflation, and this variable component is recognized as expense when incurred. Many of our building leases contain common area maintenance charges which we include in the calculation of our lease liability (the lease consideration is not allocated between the lease and non-lease components).\nOur aggregates sales yard leases have remaining noncancelable periods of \n0\n - \n24\n years and lease terms of \n1\n - \n74\n years. The key factor in determining the certainty of lease renewals is the financial impact of extending the lease, including the reserve life of the sourcing aggregates quarry. Certain aggregates sales yard lease agreements include rental payments based on a percentage of sales over contractual levels or the number of shipments received into the sales yard. Variable payments for these sales yards comprise a majority of the overall variable lease cost presented in the table below.\nOur concrete and asphalt site leases have remaining noncancelable periods of \n0\n - \n15\n years and lease terms of \n0\n - \n74\n years. The key factor in determining the certainty of lease renewals is the financial impact of extending the lease, including the reserve life of the sourcing aggregates quarry. Rental payments are generally fixed for our concrete and asphalt sites.\nOur rail (car and track) leases have remaining noncancelable periods of \n0\n - \n15\n years and lease terms of \n0\n - \n60\n years. Key factors in determining the certainty of lease renewals include the market rental rate for comparable assets and, in some cases, the cost incurred to restore the asset. Rental payments are fixed for our rail leases. The majority of our rail leases contain substitution rights that allow the supplier to replace damaged equipment. Because these rights are generally limited to either replacing railcars or moving our placement on rail track for purposes of repair or maintenance, we do not consider these substitution rights to be substantive and have recorded a lease liability and ROU asset for all leased rail.\nPart II\n84\nOur barge leases have remaining noncancelable periods of \n3\n - \n4\n years and lease terms of \n10\n - \n18\n years. Key factors in determining the certainty of lease renewals include the market rental rate for comparable assets and, in some cases, the cost incurred to restore the asset. Rental payments are fixed. Like our rail leases, our barge leases contain non-substantive substitution rights that are limited to replacing barges in need of repair or maintenance.\nOffice, plant and mobile equipment leases have remaining noncancelable periods of \n0\n - \n5\n years and lease terms of \n0\n - \n5\n years. The key factor in determining the certainty of lease renewals is the market rental rate for comparable assets. Rental payments are generally fixed for our equipment leases with terms greater than \n1\n year. The significant majority of our short-term lease cost presented in the table below is derived from office and plant equipment leases with terms of \n1\n year or less.\nThe components of lease expense for the years ended December 31, 2024, 2023 and 2022 are as follows:\nin millions\n2024\n2023\n2022\nFinance lease cost\nDepreciation of right-of-use assets\n$\n9.5\n \n$\n12.8\n \n$\n16.5\n \nInterest on lease liabilities\n0.7\n \n0.9\n \n1.2\n \nOperating lease cost\n75.6\n \n77.5\n \n85.6\n \nShort-term lease cost \n1\n46.9\n \n50.4\n \n46.4\n \nVariable lease cost\n20.6\n \n23.5\n \n14.4\n \nSublease income\n(\n2.8\n)\n(\n3.4\n)\n(\n2.9\n)\nTotal lease expense\n$\n150.5\n \n$\n161.7\n \n$\n161.2\n \n1\nIncludes the cost of leases with an initial term of one year or less (including those with terms of one month or less).\n \nCash paid for operating leases was $\n73.8\n million and $\n73.0\n million for 2024 and 2023, respectively. Cash paid for finance leases (principal and interest) was $\n13.7\n million and $\n31.6\n million for 2024 and 2023, respectively.\nMaturity analysis on an undiscounted basis of our lease liabilities (see \nNote 12\n for mineral lease payments) as of December 31, 2024 is as follows:\nin millions\nOperating\nLeases\nFinance\nLeases\n2025\n$\n73.8\n \n$\n11.2\n \n2026\n66.7\n \n6.7\n \n2027\n62.2\n \n2.1\n \n2028\n55.2\n \n0.8\n \n2029\n50.8\n \n0.4\n \nThereafter\n608.7\n \n0.0\n \nTotal minimum lease payments\n$\n917.4\n \n$\n21.2\n \nLease payments representing interest\n(\n346.7\n)\n(\n0.8\n)\nPresent value of future minimum lease payments\n$\n570.7\n \n$\n20.4\n \nCurrent obligations under leases\n(\n49.3\n)\n(\n10.7\n)\nLong-term lease obligations\n$\n521.4\n \n$\n9.7\n \nPart II\n85\nNOTE 8: \nACCRUED ENVIRONMENTAL REMEDIATION COSTS\nOur Consolidated Balance Sheets as of December 31 include accrued environmental remediation costs (measured on an undiscounted basis) as follows:\n \nin millions\n2024\n2023\nContinuing operations\n$\n47.9\n \n$\n32.6\n \nRetained from former Chemicals business\n8.3\n \n8.3\n \nTotal accrued environmental remediation costs\n$\n56.2\n \n$\n40.9\n \nThe long-term portion of the accruals noted above is included in \nother noncurrent liabilities\n in the accompanying Consolidated Balance Sheets and amounted to $\n42.5\n million and $\n28.0\n million at December 31, 2024 and 2023, respectively. The $\n14.5\n million increase relates to environmental matters associated with divested operations. The short-term portion of these accruals is included in other current liabilities in the accompanying Consolidated Balance Sheets.\nThe accrued environmental remediation costs in continuing operations relate primarily to the former U.S. Concrete, Florida Rock, Tarmac and CalMat facilities acquired in 2021, 2007, 2000 and 1999, respectively. The balances noted above for the former Chemicals business relate to retained environmental remediation costs from the 2003 sale of the Performance Chemicals business and the 2005 sale of the Chloralkali business. Refer to \nNote 12\n for additional discussion of contingent environmental matters.\nNOTE 9: \nINCOME TAXES\nThe components of earnings from continuing operations before income taxes are as follows:\n \nin millions\n2024\n2023\n2022\nEarnings from Continuing Operations before Income Taxes\nDomestic\n$\n1,196.1\n \n$\n1,251.0\n \n$\n788.7\n \nForeign\n(\n24.0\n)\n(\n5.9\n)\n(\n0.6\n)\nTotal\n$\n1,172.1\n \n$\n1,245.1\n \n$\n788.1\n \nIncome tax expense (benefit) from continuing operations consists of the following:\nin millions\n2024\n2023\n2022\nIncome Tax Expense (Benefit) from Continuing Operations\nCurrent\nFederal\n$\n204.7\n \n$\n274.8\n \n$\n85.2\n \nState and local\n51.8\n \n64.0\n \n43.6\n \nForeign\n4.8\n \n4.8\n \n4.6\n \nTotal\n$\n261.3\n \n$\n343.6\n \n$\n133.4\n \nDeferred\nFederal\n$\n13.6\n \n$\n(\n44.1\n)\n$\n43.4\n \nState and local\n(\n20.5\n)\n(\n4.2\n)\n3.3\n \nForeign\n(\n3.0\n)\n4.1\n \n12.9\n \nTotal\n$\n(\n9.9\n)\n$\n(\n44.2\n)\n$\n59.6\n \nTotal expense\n$\n251.4\n \n$\n299.4\n \n$\n193.0\n \nPart II\n86\nIncome tax expense (benefit) differs from the amount computed by applying the federal statutory income tax rate to earnings from continuing operations before income taxes. The sources and tax effects of the differences are as follows:\ndollars in millions\n2024\n2023\n2022\nIncome tax expense at the federal statutory tax rate\n$\n246.1\n \n21.0\n \n%\n$\n261.5\n \n21.0\n \n%\n$\n165.5\n \n21.0\n \n%\nExpense (Benefit) from Income Tax Differences\nStatutory depletion\n(\n41.0\n)\n(\n3.5\n \n%)\n(\n39.0\n)\n(\n3.1\n \n%)\n(\n30.6\n)\n(\n3.9\n \n%)\nState and local income taxes, net of federal income tax benefit\n51.4\n \n4.4\n \n%\n48.7\n \n3.9\n \n%\n37.5\n \n4.8\n \n%\nNondeductible goodwill\n16.2\n \n1.4\n \n%\n16.2\n \n1.3\n \n%\n10.7\n \n1.4\n \n%\nValuation allowance\n0.1\n \n0.0\n \n%\n10.3\n \n0.8\n \n%\n14.5\n \n1.8\n \n%\nDeferred tax rate remeasurement\n(\n21.9\n)\n(\n1.9\n \n%)\n0.0\n \n0.0\n \n%\n0.0\n \n0.0\n \n%\nOther, net\n0.5\n \n0.0\n \n%\n1.7\n \n0.1\n \n%\n(\n4.6\n)\n(\n0.6\n \n%)\nTotal income tax expense / Effective tax rate\n$\n251.4\n \n21.4\n \n%\n$\n299.4\n \n24.0\n \n%\n$\n193.0\n \n24.5\n \n%\nDuring the fourth quarter of 2024, we determined that the rate at which our deferred tax liabilities will reverse has decreased, largely as a result of changes in our state tax profile from the Wake Stone acquisition. As a result, we remeasured our deferred tax liabilities and recorded a tax benefit of $\n21.9\n million.\nDeferred taxes on the balance sheet result from temporary differences between the amount of assets and liabilities recognized for financial reporting and tax purposes. \nThe components of the net deferred income tax liability at December 31 are as follows:\nin millions\n2024\n2023\nDeferred Tax Assets\nOperating lease liabilities\n$\n140.8\n \n$\n139.1\n \nAsset retirement obligations & other reserves\n86.6\n \n87.1\n \nState net operating losses\n74.7\n \n79.6\n \nIncentive compensation\n52.4\n \n57.6\n \nState bonus depreciation\n55.7\n \n54.7\n \nCapitalized research expenditures\n39.7\n \n25.4\n \nEmployee benefits\n22.2\n \n22.9\n \nOther\n81.8\n \n56.9\n \nTotal gross deferred tax assets\n$\n553.9\n \n$\n523.3\n \nValuation allowance\n(\n87.7\n)\n(\n89.5\n)\nTotal net deferred tax asset\n$\n466.2\n \n$\n433.8\n \nDeferred Tax Liabilities\nProperty, plant & equipment\n$\n1,244.8\n \n$\n907.1\n \nGoodwill/other intangible assets\n323.2\n \n334.4\n \nOperating lease right-of-use assets\n129.8\n \n128.2\n \nOther\n104.9\n \n93.0\n \nTotal deferred tax liabilities\n$\n1,802.7\n \n$\n1,462.7\n \nDeferred income tax liability, net\n$\n1,336.5\n \n$\n1,028.9\n \nThe December 31, 2024 net deferred tax liability reflects a $\n307.6\n million increase from the prior year. This increase includes a net deferred tax liability of $\n311.2\n million related to our acquisition of Wake Stone, reflecting book over tax basis differences, of which $\n328.9\n million relates to property, plant and equipment.\nAt December 31, 2024, we have Alabama state NOL carryforward deferred tax assets of $\n68.5\n million, against which we have a valuation allowance of $\n50.8\n million. $\n4.9\n million of the Alabama NOL carryforward expired in 2024, resulting in additional tax expense of $\n1.3\n million over the previous amount of valuation allowance recorded. Almost all of the remaining Alabama NOL carryforward would expire between 2025 and 2029 if not utilized.\nAs discussed in \nNote 12\n, in May 2022, Mexican government officials unexpectedly and arbitrarily shut down our Calica operations in Mexico. In 2024, Calica had deferred tax assets (including NOLs) of $\n27.5\n million. Although Calica continues to record losses, the devaluation of the Mexican peso during the year resulted in an immaterial change to its deferred tax assets in U.S. dollars. As a result, we recorded a charge to increase the valuation allowance by $\n0.1\n million to $\n27.5\n million in 2024. The Calica NOL deferred tax asset carryforward of $\n23.3\n million would expire between 2032 and 2033 if not utilized. Should the Mexican government lift the shutdown and/or if we are successful in our NAFTA claim, we will reevaluate the need for a valuation allowance against the deferred tax assets.\nPart II\n87\nIn August 2022, the Inflation Reduction Act (IRA) was signed into law, effective for tax years beginning on or after January 1, 2023. The IRA introduced a corporate alternative minimum tax (CAMT) of 15% applicable to corporations with adjusted financial statement income in excess of $1 billion, as well as certain climate-related tax provisions. We were not subject to CAMT in 2023 or in 2024.\nThe Organization for Economic Co-operation and Development (OECD) has developed a framework to enact a two-pillar solution to address the challenges arising from the digitization of a global economy. Pillar Two introduced a global minimum effective tax rate where multinational groups with consolidated revenue over €750.0 million are subject to a minimum effective tax rate of 15% on income arising in low-tax jurisdictions. Pillar Two legislation has been enacted in certain jurisdictions in which we operate and it was effective on January 1, 2024. Most jurisdictions in which we operate have tax rates in excess of 15%. However, our operations in the Bahamas are not eligible for transitional safe harbor relief, and we have reflected an immaterial amount of Pillar Two tax in our effective tax rate for 2024.\nWe consider the undistributed earnings, if any, related to the investment in our Canadian and Honduran subsidiaries and Canadian investment in its U.S. subsidiary to be indefinitely reinvested; accordingly, no foreign withholding or other income taxes have been provided thereon. Due to complexities in the tax laws, it is not practicable to estimate the amount of deferred income taxes not recorded that are associated with these earnings. We have not, nor do we currently anticipate in the foreseeable future, the need to repatriate funds (other than for the repayment of intercompany loan obligations) to satisfy domestic liquidity needs arising in the ordinary course of business.\nChanges in our liability for unrecognized tax benefits for the years ended December 31 are as follows:\nin millions\n2024\n2023\n2022\nUnrecognized tax benefits as of January 1\n$\n21.0\n \n$\n18.7\n \n$\n10.8\n \nIncreases for tax positions related to\nPrior years\n0.8\n \n0.3\n \n4.6\n \nCurrent year\n6.7\n \n4.8\n \n6.6\n \nDecreases for tax positions related to\nPrior years\n0.0\n \n(\n0.3\n)\n(\n0.2\n)\nSettlements\n(\n0.3\n)\n(\n0.2\n)\n0.0\n \nExpiration of applicable statute of limitations\n(\n3.3\n)\n(\n2.3\n)\n(\n3.1\n)\nUnrecognized tax benefits as of December 31\n$\n24.9\n \n$\n21.0\n \n$\n18.7\n \nWe classify interest and penalties recognized on the liability for unrecognized tax benefits as income tax expense. Interest and penalties recognized as income tax expense were $\n1.5\n million, $\n1.5\n million and $\n0.8\n million in 2024, 2023 and 2022, respectively. The balance of accrued interest and penalties included in our liability for unrecognized tax benefits as of December 31 was $\n4.8\n million, $\n3.3\n million and $\n1.8\n million in 2024, 2023 and 2022, respectively. Our liability for unrecognized tax benefits at December 31 in the table above includes $\n23.7\n million, $\n19.8\n million and $\n17.6\n million in 2024, 2023 and 2022, respectively, that would affect the effective tax rate if recognized. We anticipate no single tax position generating a significant increase or decrease in our liability for unrecognized tax benefits within 12 months of this reporting date.\nWe file income tax returns in U.S. federal, various state and foreign jurisdictions. With few exceptions, we are no longer subject to U.S. federal, state or foreign exams by tax authorities for years prior to 2021.\nAs of December 31, 2024, income tax receivables of $\n4.7\n million and $\n0.1\n million are included in other accounts and notes receivable and other current assets, respectively, in the accompanying Consolidated Balance Sheet. There were similar receivables of $\n1.3\n million and $\n0.2\n million recorded in other accounts and notes receivable and other current assets, respectively, as of December 31, 2023.\nPart II\n88\nNOTE 10: \nBENEFIT PLANS\nPENSION PLANS\nWe sponsor \ntwo\n qualified, noncontributory defined benefit pension plans, the Vulcan Materials Company Pension Plan (VMC Pension Plan) and the CMG Hourly Pension Plan (CMG Pension Plan). The VMC Pension Plan has been closed to new entrants since 2007, and benefit accruals ceased in 2005 for hourly participants and 2013 for salaried participants. The CMG Pension Plan is closed to new entrants other than through one small union, and benefits continue to accrue equal to a flat dollar amount for each year of service. In addition to these qualified plans, we sponsor \nthree\n unfunded, nonqualified pension plans. The projected benefit obligation (PBO) presented in the table below includes $\n32.5\n million and $\n39.7\n million related to these unfunded, nonqualified pension plans for 2024 and 2023, respectively.\nThe following table sets forth the combined funded status of the plans and their reconciliation with the related amounts recognized in our consolidated financial statements at December 31:\nin millions\n2024\n2023\nChange in Benefit Obligation\nProjected benefit obligation at beginning of year\n$\n693.3\n \n$\n691.1\n \nService cost\n2.3\n \n2.5\n \nInterest cost\n32.9\n \n34.0\n \nActuarial (gain) loss\n(\n40.2\n)\n12.4\n \nBenefits paid\n(\n47.5\n)\n(\n46.7\n)\nProjected benefit obligation at end of year\n$\n640.8\n \n$\n693.3\n \nChange in Fair Value of Plan Assets\nFair value of assets at beginning of year\n$\n647.9\n \n$\n637.8\n \nActual return on plan assets\n(\n2.0\n)\n49.4\n \nEmployer contribution\n8.7\n \n7.4\n \nBenefits paid\n(\n47.5\n)\n(\n46.7\n)\nFair value of assets at end of year\n$\n607.1\n \n$\n647.9\n \nFunded status\n(\n33.7\n)\n(\n45.4\n)\nNet amount recognized\n$\n(\n33.7\n)\n$\n(\n45.4\n)\nAmounts Recognized in the Consolidated Balance Sheets\nNoncurrent assets\n$\n8.1\n \n$\n6.5\n \nCurrent liabilities\n(\n4.1\n)\n(\n7.3\n)\nNoncurrent liabilities\n(\n37.7\n)\n(\n44.6\n)\nNet amount recognized\n$\n(\n33.7\n)\n$\n(\n45.4\n)\nAmounts Recognized in Accumulated Other Comprehensive Income\nNet actuarial loss\n$\n153.1\n \n$\n168.4\n \nPrior service cost\n0.0\n \n1.0\n \nTotal amount recognized\n$\n153.1\n \n$\n169.4\n \nThe decrease in actuarial loss as of December 31, 2024 was primarily attributable to the increase in discount rates compared with the prior year.\nThe following table sets forth the pension plans for which their accumulated benefit obligation (ABO) or projected benefit obligation (PBO) exceeds the fair value of their respective plan assets at December 31:\nin millions\n2024\n2023\nPension plans with ABO in excess of plan assets\nAccumulated benefit obligation\n$\n177.5\n \n$\n182.7\n \nFair value of assets\n135.8\n \n140.3\n \nPension plans with PBO in excess of plan assets\nProjected benefit obligation\n$\n177.7\n \n$\n192.2\n \nFair value of assets\n135.8\n \n140.3\n \nPart II\n89\nThe following table sets forth the components of net periodic benefit cost, amounts recognized in other comprehensive income and weighted-average assumptions of the plans at December 31:\ndollars in millions\n2024\n2023\n2022\nComponents of Net Periodic Pension Benefit Cost\nService cost\n$\n2.3\n \n$\n2.5\n \n$\n4.0\n \nInterest cost\n32.9\n \n34.0\n \n21.1\n \nExpected return on plan assets\n(\n28.1\n)\n(\n27.6\n)\n(\n30.1\n)\nAmortization of prior service cost\n1.0\n \n1.4\n \n1.4\n \nAmortization of actuarial loss\n5.1\n \n5.6\n \n4.2\n \nNet periodic pension benefit cost\n$\n13.2\n \n$\n15.9\n \n$\n0.6\n \nChanges in Plan Assets and Benefit Obligations Recognized in Other Comprehensive Income\nNet actuarial loss (gain)\n$\n(\n10.2\n)\n$\n(\n9.4\n)\n$\n11.2\n \nReclassification of prior service cost\n(\n1.0\n)\n(\n1.4\n)\n(\n1.4\n)\nReclassification of actuarial loss\n(\n5.1\n)\n(\n5.6\n)\n(\n4.2\n)\nAmount recognized in other comprehensive income\n$\n(\n16.3\n)\n$\n(\n16.4\n)\n$\n5.6\n \nAmount recognized in net periodic pension benefit cost and other comprehensive income\n$\n(\n3.1\n)\n$\n(\n0.5\n)\n$\n6.2\n \nAssumptions\nWeighted-average assumptions used to determine net periodic benefit cost for years ended December 31\nDiscount rate — PBO\n5.00\n \n%\n5.19\n \n%\n2.92\n \n%\nDiscount rate — service cost\n5.10\n \n%\n5.29\n \n%\n3.17\n \n%\nDiscount rate — interest cost\n4.90\n \n%\n5.09\n \n%\n2.37\n \n%\nExpected return on plan assets\n4.85\n \n%\n4.85\n \n%\n4.00\n \n%\nWeighted-average assumptions used to determine benefit obligation at December 31\nDiscount rate\n5.65\n \n%\n5.00\n \n%\n5.19\n \n%\nPlan assets are primarily invested in liability hedging assets which include money market securities, inflation linked debt securities, public corporate debt securities and government debt securities that are actively managed to match the duration of the plans’ liabilities.\nAt each measurement date, we estimate the net asset values and fair values of our pension assets using various valuation techniques. For certain investments, we use the net asset value (NAV) as a practical expedient to estimating fair value. Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. The fair value hierarchy prioritizes the inputs to valuation techniques used to measure fair value into three broad levels as described below:\nLevel 1: Quoted prices in active markets for identical assets or liabilities\nLevel 2: Inputs that are derived principally from or corroborated by observable market data\nLevel 3: Inputs that are unobservable and significant to the overall fair value measurement\nThe fair values and net asset values of our pension plan assets at December 31, 2024 and 2023 are in the tables below. The assets in the common/collective trusts and in the private partnerships consist of both return seeking and liability hedging investments.\nFAIR VALUE MEASUREMENTS AT DECEMBER 31, 2024\nin millions\nLevel 1\nLevel 2\nLevel 3\nTotal\nAsset Category\nDebt funds\n$\n0.0\n \n$\n590.2\n \n$\n0.0\n \n$\n590.2\n \nInvestments in the fair value hierarchy\n$\n0.0\n \n$\n590.2\n \n$\n0.0\n \n$\n590.2\n \nInterest in common/collective trusts (at NAV)\n13.1\n \nPrivate partnerships (at NAV)\n3.8\n \nTotal pension plan assets\n$\n607.1\n \nPart II\n90\nFAIR VALUE MEASUREMENTS AT DECEMBER 31, 2023\nin millions\nLevel 1\nLevel 2\nLevel 3\nTotal\nAsset Category\nDebt funds\n$\n0.0\n \n$\n634.9\n \n$\n0.0\n \n$\n634.9\n \nInvestments in the fair value hierarchy\n$\n0.0\n \n$\n634.9\n \n$\n0.0\n \n$\n634.9\n \nInterest in common/collective trusts (at NAV)\n9.3\n \nPrivate partnerships (at NAV)\n3.7\n \nTotal pension plan assets\n$\n647.9\n \nThe following describes the types of investments included in each asset category listed in the tables above and the valuation techniques we used to determine the fair values or net asset values as of December 31, 2024 and 2023.\nThe debt funds category consists of U.S. federal, state and local government debt securities, corporate debt securities, foreign government debt securities, asset-backed securities and derivatives. The fair values of U.S. government and corporate debt securities are based on current market rates and credit spreads for debt securities with similar maturities. The fair values of debt securities issued by foreign governments are based on prices obtained from broker/dealers and international indices. The fair values of asset-backed securities are priced using prepayment speed and spread inputs that are sourced from the new issue market. Derivatives are valued using pricing models based on the prevailing forward exchange rate of the underlying currencies taking into account the creditworthiness of the counterparties.\nCommon/collective trust fund investments consist of an index fund investing primarily in domestic equities and a short-term investment fund for highly liquid, short-term debt securities. Investments are valued at the NAV of units of a bank collective trust. The NAV is based on the fair value of the underlying investments held by the fund less its liabilities. This practical expedient is not used when it is determined to be probable that the fund will sell the investment for an amount different than the reported NAV.\nThe private partnerships category consists primarily of secondary private equity funds and mezzanine debt funds. The NAV of these investments has been estimated based on methods employed by the general partners, including reference to third-party transactions and valuations of comparable companies.\nTotal employer contributions to the pension plans are presented below:\nin millions\nPension\nEmployer Contributions\n2022\n$\n7.8\n \n2023\n7.4\n \n2024\n8.7\n \n2025 (estimated)\n13.8\n \nFor our qualified pension plans, we made a contribution of $\n2.0\n million in 2024 and made \nno\n contributions during 2023 and 2022. We anticipate making a $\n9.6\n million contribution to our qualified pension plans in 2025. For our nonqualified pension plans, we contributed $\n6.7\n million\n,\n $\n7.4\n million and $\n7.8\n million during 2024, 2023 and 2022, respectively, and expect to contribute $\n4.2\n million during 2025.\nThe following benefit payments, which reflect expected future service, as appropriate, are expected to be paid:\nin millions\nPension\nEstimated Future Benefit Payments\n2025\n$\n48.0\n \n2026\n48.5\n \n2027\n49.6\n \n2028\n49.6\n \n2029\n50.0\n \n2030-2034\n247.5\n \nWe contribute to a number of multiemployer defined benefit pension plans under the terms of collective-bargaining agreements for union-represented employees. The risks of participating in multiemployer plans differ from single employer plans as follows:\n▪\nassets contributed to a multiemployer plan by one employer may be used to provide benefits to employees of other participating employers\n▪\nif a participating employer stops contributing to the plan, the unfunded obligations of the plan may be borne by the remaining participating employers\n▪\nif we cease to have an obligation to contribute to one or more of the multiemployer plans to which we contribute, we may be required to pay those plans an amount based on the underfunded status of the plan, referred to as a withdrawal liability\nPart II\n91\nNone of the multiemployer pension plans that we participate in are individually significant. Our contributions to individual multiemployer pension plans did not exceed \n5\n% of the plans’ total contributions in the three years ended December 31, 2024, 2023 and 2022. Total contributions to multiemployer pension plans were $\n30.2\n million, $\n36.6\n million and $\n48.6\n million in 2024, 2023 and 2022, respectively.\nAs of December 31, 2024, a total of \n14.7\n% of our domestic hourly labor force was covered by collective-bargaining agreements. Of such employees covered by collective-bargaining agreements, \n48.8\n% were covered by agreements that expire in 2025. We also employed \n248\n \nunion employees in Mexico who are covered by a collective-bargaining agreement that will expire in 2025. None of our union employees in Mexico participate in multiemployer pension plans. \nIn addition to the pension plans noted above, we had \none\n unfunded supplemental retirement plan as of December 31, 2024 and 2023. The accrued costs for the supplemental retirement plan were $\n0.5\n million and $\n0.4\n million at December 31, 2024 and 2023, respectively.\nPOSTRETIREMENT PLANS\nIn addition to pension benefits, we provide certain healthcare and life insurance benefits for some retired employees. Our employer portion of the medical coverage cost for the postretirement healthcare plan is capped. Substantially all of our salaried employees and, where applicable, certain of our hourly employees may become eligible for these benefits if they reach a qualifying age and meet certain service requirements. Generally, Company-provided healthcare benefits end when covered individuals become eligible for Medicare benefits, become eligible for other group insurance coverage or reach age 65 (whichever occurs first).\nThe following table sets forth the combined funded status of the plans and their reconciliation with the related amounts recognized in our consolidated financial statements at December 31:\nin millions\n2024\n2023\nChange in Benefit Obligation\nProjected benefit obligation at beginning of year\n$\n44.2\n \n$\n41.8\n \nService cost\n2.2\n \n2.0\n \nInterest cost\n2.2\n \n2.0\n \nActuarial (gain) loss\n(\n3.0\n)\n3.6\n \nBenefits paid\n(\n3.4\n)\n(\n5.2\n)\nProjected benefit obligation at end of year\n$\n42.2\n \n$\n44.2\n \nChange in Fair Value of Plan Assets\nFair value of assets at beginning of year\n$\n0.0\n \n$\n0.0\n \nActual return on plan assets\n0.0\n \n0.0\n \nFair value of assets at end of year\n$\n0.0\n \n$\n0.0\n \nFunded status\n$\n(\n42.2\n)\n$\n(\n44.2\n)\nNet amount recognized\n$\n(\n42.2\n)\n$\n(\n44.2\n)\nAmounts Recognized in the Consolidated Balance Sheets\nCurrent liabilities\n$\n(\n4.7\n)\n$\n(\n5.2\n)\nNoncurrent liabilities\n(\n37.5\n)\n(\n39.0\n)\nNet amount recognized\n$\n(\n42.2\n)\n$\n(\n44.2\n)\nAmounts Recognized in Accumulated Other Comprehensive Income\nNet actuarial gain\n$\n(\n15.0\n)\n$\n(\n12.7\n)\nPrior service cost\n10.2\n \n11.7\n \nTotal amount recognized\n$\n(\n4.8\n)\n$\n(\n1.0\n)\nThe increase in actuarial gain as of December 31, 2024 was primarily attributable to the increase in discount rates and favorable claims experience for the plans compared with the prior year.\nPart II\n92\nThe following table sets forth the components of net periodic benefit cost, amounts recognized in other comprehensive income, weighted-average assumptions and assumed trend rates of the plans at December 31:\ndollars in millions\n2024\n2023\n2022\nComponents of Net Periodic Postretirement Benefit Cost\nService cost\n$\n2.2\n \n$\n2.0\n \n$\n2.2\n \nInterest cost\n2.2\n \n2.0\n \n0.9\n \nAmortization of prior service cost (credit)\n1.4\n \n1.4\n \n(\n0.3\n)\nAmortization of actuarial gain\n(\n0.7\n)\n(\n1.5\n)\n(\n1.3\n)\nNet periodic postretirement benefit cost\n$\n5.1\n \n$\n3.9\n \n$\n1.5\n \nChanges in Plan Assets and Benefit Obligations Recognized in Other Comprehensive Income\nNet actuarial (gain) loss\n$\n(\n3.0\n)\n$\n3.6\n \n$\n(\n2.4\n)\nReclassification of prior service (cost) credit\n(\n1.4\n)\n(\n1.4\n)\n0.3\n \nReclassification of actuarial gain\n0.7\n \n1.5\n \n1.3\n \nAmount recognized in other comprehensive income\n$\n(\n3.7\n)\n$\n3.7\n \n$\n(\n0.8\n)\nAmount recognized in net periodic postretirement benefit cost and other comprehensive income\n$\n1.4\n \n$\n7.6\n \n$\n0.7\n \nAssumptions\nAssumed Healthcare Cost Trend Rates at December 31\nHealthcare cost trend rate assumed for next year (Pre-65/Post-65)\n8.45\n% / n/a\n10.20\n% / n/a\n7.04\n% / n/a\nRate to which the cost trend rate gradually declines\n4.50\n \n%\n4.50\n \n%\n4.50\n \n%\nYear that the rate reaches the rate it is assumed to maintain\n2035\n2031\n2030\nWeighted-average assumptions used to determine net periodic benefit cost for years ended December 31\nDiscount rate — PBO\n4.90\n \n%\n5.09\n \n%\n2.59\n \n%\nDiscount rate — service cost\n4.96\n \n%\n5.15\n \n%\n2.89\n \n%\nDiscount rate — interest cost\n4.85\n \n%\n5.03\n \n%\n2.06\n \n%\nWeighted-average assumptions used to determine benefit obligation at December 31\nDiscount rate\n5.51\n \n%\n4.90\n \n%\n5.08\n \n%\nTotal employer contributions to the postretirement plans are presented below:\nin millions\nPostretirement\nEmployer Contributions\n2022\n$\n4.9\n \n2023\n5.2\n \n2024\n3.4\n \n2025 (estimated)\n4.7\n \nThe employer contributions shown above are equal to the cost of benefits during the year. The plans are not funded and are not subject to any regulatory funding requirements.\nThe following benefit payments, which reflect expected future service, as appropriate, are expected to be paid:\nin millions\nPostretirement\nEstimated Future Benefit Payments\n2025\n$\n4.7\n \n2026\n4.9\n \n2027\n5.1\n \n2028\n5.1\n \n2029\n5.0\n \n2030–2034\n21.4\n \nPart II\n93\nContributions by participants to the postretirement benefit plans for the years ended December 31 are as follows:\n \nin millions\nPostretirement\nParticipants Contributions\n2022\n$\n2.0\n \n2023\n1.5\n \n2024\n1.7\n \nPENSION AND OTHER POSTRETIREMENT BENEFITS ASSUMPTIONS\nEach year, we review our assumptions for discount rates (used for PBO, service cost, and interest cost calculations), the per capita cost of healthcare benefits and the expected return on plan assets. Due to plan changes made in 2013, annual pay increases do not materially impact plan obligations.\nWe use a high-quality bond full yield curve approach (specific spot rates for each annual expected cash flow) to establish the discount rates at each measurement date. At December 31, 2024, the discount rates used were as follows:\n▪\nPBO for various plans – ranged from \n5.25\n% to\n \n5.73\n% (December 31, 2023 ranged from \n4.77\n% to \n5.05\n%)\n▪\nService cost – weighted average of \n5.10\n% and \n4.96\n% for our pension plans and our other postretirement plans, respectively \n(2023 figures were \n5.29\n% and \n5.15\n%, respectively)\n▪\nInterest cost – weighted average of \n4.90\n% and \n4.85\n% for our pension plans and our other postretirement plans, respectively\n(2023 figures were \n5.09\n% and \n5.03\n%, respectively)\nIn selecting the rate of increase in the per capita cost of covered healthcare benefits, we consider past performance and forecast of future healthcare cost trends. At \nDecember 31, 2024\n, our assumed rate of increase in the per capita cost of covered healthcare benefits was \n8.45\n% for pre-65 coverage, with rates decreasing each year until reaching \n4.50\n% in 2035 and remaining level thereafter.\nOur expected return on plan assets\n is a long-term view based on our current asset allocation and a judgment informed by consultation with our retirement plans’ consultant and our pension plans’ actuary. \nFor 2024 and 2023, the expected return on plan assets used to measure plan benefit costs was set at \n4.85\n% and \n4.85\n%, respectively. For 2025, the preliminary expected return on plan assets is \n5.90\n%.\nDEFINED CONTRIBUTION PLANS\nIn addition to our pension and postretirement plans, we sponsor \nseven\n defined contribution plans. Substantially all salaried and non-union hourly employees are eligible to be covered by one of these plans. Under these plans, we match employees’ eligible contributions at established rates. Expense recognized in connection with these matching obligations totaled $\n87.5\n million, $\n79.2\n million and $\n68.2\n million in 2024, 2023 and 2022, respectively.\nPart II\n94\nNOTE 11: \nINCENTIVE PLANS\nSHARE-BASED COMPENSATION PLANS\nOur 2016 Omnibus Long-term Incentive Plan (Plan) authorizes the granting of performance shares, restricted shares, Stock-Only Stock Appreciation Rights (SOSARs) and other types of share-based awards to key salaried employees and nonemployee directors. The maximum number of shares that may be issued under the Plan is \n8,000,000\n, of which \n4,396,033\n shares remain under this authorization as of December 31, 2024.\nPERFORMANCE SHARES — Each performance share unit is equal to and paid in one share of our common stock but carries no voting rights. The number of units ultimately paid for performance share awards may range from \n0\n% to \n200\n% of the number of units awarded on the date of grant. Payment is based upon the outcome of performance and/or market conditions. Awards vest on December 31 of the third year after date of grant. Vesting is accelerated upon death, disability, or change of control and the awards become non-forfeitable upon reaching retirement age — all as defined in the award agreement. Nonvested units are forfeited upon termination for any other reason. Expense provisions referable to performance share awards amounted to $\n30.4\n million, $\n40.1\n million and $\n23.2\n million in 2024, 2023 and 2022, respectively.\nThe fair value of performance shares is estimated as of the date of grant using a Monte Carlo simulation model. The following table summarizes the activity for nonvested performance share units during the year ended December 31, 2024:\nNumber\nof Shares\nWeighted-Average Grant Date Fair Value\nPerformance Shares\nNonvested at January 1, 2024\n227,472\n$\n180.13\n \nGranted\n110,240\n247.00\n \nVested\n(\n105,541\n)\n185.31\n \nCanceled/forfeited\n(\n8,625\n)\n207.00\n \nNonvested at December 31, 2024\n223,546\n$\n209.62\n \nDuring 2023 and 2022, the weighted-average grant date fair value of performance shares granted was $\n175.46\n and $\n185.31\n, respectively.\nThe aggregate values for distributed performance share awards are based on the closing price of our common stock as of the distribution date. \nThe aggregate values of distributed performance shares for the years ended December 31 are as follows:\nin millions\n2024\n2023\n2022\nAggregate value of distributed performance shares\n$\n45.3\n \n$\n24.8\n \n$\n33.4\n \nRESTRICTED SHARES — Each restricted share unit is equal to and paid in one share of our common stock but carries no voting rights. Awards vest on the third anniversary of the grant date. Vesting is accelerated upon reaching retirement age, death, disability, or change of control, all as defined in the award agreement. Nonvested units are forfeited upon termination for any other reason. Expense provisions referable to restricted share awards amounted to $\n15.1\n million, $\n16.5\n million and $\n11.6\n million in 2024, 2023 and 2022, respectively.\nThe fair value of restricted shares is estimated as of the date of grant based on the stock price adjusted for dividends foregone (for restricted share units that do not accrue dividends). \nThe following table summarizes the activity for nonvested restricted share units during the year ended December 31, 2024:\nNumber\nof Shares\nWeighted-Average\nGrant Date\nFair Value\nRestricted Stock Units\nNonvested at January 1, 2024\n236,673\n$\n175.29\n \nGranted\n71,087\n247.00\n \nVested\n(\n61,320\n)\n166.42\n \nCanceled/forfeited\n(\n10,864\n)\n200.35\n \nNonvested at December 31, 2024\n235,576\n$\n198.08\n \nDuring 2023 and 2022, the weighted-average grant date fair value of restricted shares granted was $\n175.46\n and $\n184.49\n, respectively.\nPart II\n95\nThe aggregate values for distributed restricted share awards are based on the closing price of our common stock as of the distribution date. \nThe aggregate values of distributed restricted shares for the years ended December 31 are as follows:\nin millions\n2024\n2023\n2022\nAggregate value of distributed restricted shares\n$\n15.6\n \n$\n11.1\n \n$\n15.7\n \nSTOCK-ONLY STOCK APPRECIATION RIGHTS (SOSARs) — SOSARs granted have an exercise price equal to the market value of our underlying common stock on the date of grant. The SOSARs vest ratably over \n3\n years and expire \n10\n years subsequent to the date of grant. Vesting is accelerated upon reaching retirement age, death, disability, or change of control, all as defined in the award agreement. Nonvested awards are forfeited upon termination for any other reason.\nThe fair value of SOSARs is estimated as of the date of grant using the Black-Scholes option pricing model. Compensation cost for SOSARs is based on this grant date fair value and is recognized for awards that ultimately vest. The following table presents the weighted-average fair value and the weighted-average assumptions used in estimating the fair value of grants during the years ended December 31:\n2024\n2023\n2022\nSOSARs\nFair value\n$\n86.32\n \n$\n72.39\n \n$\n60.57\n \nRisk-free interest rate\n1.94\n \n%\n3.90\n \n%\n2.02\n \n%\nDividend yield\n0.84\n \n%\n0.79\n \n%\n0.77\n \n%\nVolatility\n28.81\n \n%\n28.88\n \n%\n26.68\n \n%\nExpected term (years)\n9.0\n9.0\n9.0\nThe risk-free interest rate is based on the yield at the date of grant of a U.S. Treasury security with a maturity period approximating the SOSARs expected term. The dividend yield assumption is based on our historical dividend payouts adjusted for current expectations of future payouts. The volatility assumption is based on the historical volatility and expectations about future volatility of our common stock over a period equal to the SOSARs expected term. The expected term is based on historical experience and expectations about future exercises and represents the period of time that SOSARs granted are expected to be outstanding.\nA summary of our SOSAR activity as of December 31, 2024 and changes during the year are presented below:\nNumber\nof Shares\nWeighted-Average\nExercise Price\nWeighted-Average\nRemaining\nContractual\nLife (Years)\nAggregate\nIntrinsic Value\n(in millions)\nSOSARs\nOutstanding at January 1, 2024\n533,457\n$\n134.35\n \nGranted\n60,730\n253.43\n \nExercised\n(\n168,420\n)\n106.43\n \nForfeited or expired\n0\n0.00\n \nOutstanding at December 31, 2024\n425,767\n$\n162.38\n \n5.83\n$\n40.9\n \nExercisable at December 31, 2024\n303,269\n$\n140.10\n \n4.76\n$\n35.9\n \nThe aggregate intrinsic values in the table above represent the total pretax intrinsic value (the difference between our stock price on the last trading day of 2024 and the exercise price, multiplied by the number of in-the-money SOSARs) that would have been received by the option holders had all SOSARs been exercised on December 31, 2024. These values change based on the fair market value of our common stock. \nThe aggregate intrinsic values of SOSARs exercised for the years ended December 31 are as follows:\nin millions\n2024\n2023\n2022\nAggregate intrinsic value of SOSARs exercised\n$\n27.9\n \n$\n25.1\n \n$\n1.9\n \nThe following table presents cash received and tax benefit realized from SOSAR exercises and compensation cost recorded referable to SOSARs for the years ended December 31:\nin millions\n2024\n2023\n2022\nSOSARs\nCash received from exercises\n$\n0.0\n \n$\n0.0\n \n$\n0.0\n \nTax benefit from exercises\n5.7\n \n6.0\n \n0.4\n \nCompensation cost\n5.1\n \n4.0\n \n4.0\n \nPart II\n96\nNONEMPLOYEE DIRECTOR AWARDS — In addition to the share-based compensation plans for employees discussed above, we issue a limited number of stock units to our nonemployee directors annually. Expense provisions referable to nonemployee director stock units amounted to $\n2.8\n million, $\n2.6\n million and $\n2.4\n million in 2024, 2023 and 2022, respectively.\nCASH-BASED COMPENSATION PLANS\nWe have incentive plans under which cash awards may be made annually. Expense provisions under these plans referable to awards to officers and certain employees amounted to $\n58.8\n million, $\n77.3\n million and $\n42.8\n million\n \nin 2024, 2023 and 2022, respectively.\nNOTE 12: \nCOMMITMENTS AND CONTINGENCIES\nWe have commitments in the form of unconditional purchase obligations as of December 31, 2024. These include commitments for the purchase of property, plant & equipment of $\n78.2\n million and commitments for noncapital purchases of $\n146.8\n million. \nThese commitments are due as follows:\n \nin millions\nUnconditional\nPurchase \nObligations\nProperty, Plant & Equipment\n2025\n$\n78.2\n \nThereafter\n0.0\n \nTotal\n$\n78.2\n \nNoncapital (primarily transportation and electricity contracts)\n2025\n$\n42.4\n \n2026–2027\n56.1\n \n2028–2029\n42.3\n \nThereafter\n6.0\n \nTotal\n$\n146.8\n \nExpenditures for noncapital purchases totaled $\n117.6\n million, $\n120.8\n million and $\n96.7\n million in 2024, 2023 and 2022, respectively.\nWe have commitments in the form of minimum royalties under mineral leases as of December 31, 2024 in the amount of $\n237.6\n million, due as follows:\nin millions\nMineral\nLeases\nMinimum Royalties\n2025\n$\n27.5\n \n2026–2027\n43.5\n \n2028–2029\n29.9\n \nThereafter\n136.7\n \nTotal\n$\n237.6\n \nExpenditures for royalties under mineral leases totaled $\n118.6\n million, $\n113.6\n million and $\n109.1\n million in 2024, 2023 and 2022, respectively.\nCertain of our aggregates reserves are burdened by volumetric production payments (nonoperating interest) as described in \nNote 2\n. As the holder of the working interest, we have responsibility to bear the cost of mining and producing the reserves attributable to this nonoperating interest.\nAs described in \nNote 1\n under the caption \"Claims and Litigation Including Self-Insurance\", our net liabilities for our self-insurance program totaled $\n119.6\n million as of December 31, 2024.\nAs summarized by purpose in \nNote 6\n, our standby letters of credit totaled $\n104.8\n million as of December 31, 2024.\nAs outlined in \nNote 7\n, our present value of future minimum (nonmineral) lease payments totaled $\n591.1\n million as of December 31, 2024.\nAs described in \nNote 9\n, our liability for unrecognized tax benefits is $\n24.9\n million\n \nas of December 31, 2024.\nAs described in \nNote 17\n, our asset retirement obligations totaled $\n427.4\n million as of December 31, 2024.\nPart II\n97\nLITIGATION AND ENVIRONMENTAL MATTERS\nWe are subject to occasional governmental proceedings and orders pertaining to occupational safety and health or to protection of the environment, such as proceedings or orders relating to noise abatement, air emissions or water discharges. As part of our continuing program of stewardship in safety, health and environmental matters, we have been able to resolve such proceedings and to comply with such orders without any material adverse effects on our business.\nWe have received notices from the United States Environmental Protection Agency (EPA) or similar state or local agencies that we are considered a potentially responsible party (PRP) at a limited number of sites under the Comprehensive Environmental Response, Compensation and Liability Act (CERCLA or Superfund) or similar state and local environmental laws. Generally, we share the cost of remediation at these sites with other PRPs or alleged PRPs in accordance with negotiated or prescribed allocations. There is inherent uncertainty in determining the potential cost of remediating a given site and in determining any individual party's share in that cost. As a result, estimates can change substantially as additional information becomes available regarding the nature or extent of site contamination, remediation methods, other PRPs and their probable level of involvement, and actions by or against governmental agencies or private parties.\nWe have reviewed the nature and extent of our involvement at each Superfund site as well as potential obligations arising under other federal, state and local environmental laws. While ultimate resolution and financial liability is uncertain at a number of the sites, in our opinion, based on information currently available, the ultimate resolution of claims and assessments related to these sites will not have a material effect on our consolidated results of operations, financial position or cash flows, although amounts recorded in a given period could be material to our results of operations or cash flows for that period. Amounts accrued for environmental matters are presented in \nNote 8\n.\nWe are a defendant in various lawsuits in the ordinary course of business. It is not possible to determine with precision the outcome, or the amount of liability, if any, under these lawsuits, especially where the cases involve possible jury trials with as yet undetermined jury panels.\nIn addition to these lawsuits in which we are involved in the ordinary course of business, certain other material legal proceedings are specifically described below.\n▪\nLOWER PASSAIC RIVER STUDY AREA (DISCONTINUED OPERATIONS and SUPERFUND SITE) — The Lower Passaic River Study Area is part of the Diamond Shamrock Superfund Site in New Jersey. Vulcan and approximately \n70\n other companies are parties (collectively the Cooperating Parties Group, CPG) to a May 2007 Administrative Order on Consent (AOC) with the EPA to perform a Remedial Investigation/Feasibility Study (draft RI/FS) of the lower \n17\n miles of the Passaic River (River). The draft RI/FS was submitted recommending a targeted hot spot remedy; however, the EPA issued a record of decision (ROD) in March 2016 that calls for a bank-to-bank dredging remedy for the lower \n8\n miles of the River. The EPA estimates that the cost of implementing this proposal is $\n1.38\n billion. In September 2016, the EPA entered into an Administrative Settlement Agreement and Order on Consent with Occidental Chemical Corporation (Occidental) in which Occidental agreed to undertake the remedial design for this bank-to-bank dredging remedy and to reimburse the United States for certain response costs.\nEfforts to investigate and remediate the River have been underway for many years and have involved hundreds of entities that have had operations on or near the River at some point during the past several decades. We formerly owned a chemicals operation near the mouth of the River, which was sold in 1974. The major risk drivers in the River have been identified to include dioxins, PCBs, DDx and mercury. We did not manufacture any of these risk drivers and have no evidence that any of these were discharged into the River by Vulcan.\nIn August 2017, the EPA informed certain members of the CPG, including Vulcan and others, that it planned to use the services of a third-party allocator with the expectation of offering cash-out settlements to some parties in connection with the bank-to-bank remedy identified in the ROD. This voluntary allocation process established an impartial third-party expert recommendation for use by the government and the participants as the basis of possible settlements, including settlements related to future remediation actions. The final allocation recommendations, which are subject to confidentiality provisions, were submitted to the EPA for its review and consideration in late December 2020. Certain PRPs, including Vulcan, thereafter received a joint confidential settlement demand from the EPA/Department of Justice (DOJ). Vulcan and certain of the other PRPs that received the joint confidential settlement demand (the Settling Defendants) reached an agreement to settle with the EPA/DOJ and negotiated a Consent Decree. The court granted the motion to enter the Consent Decree in December 2024. Vulcan’s portion of the settlement is within the immaterial loss recorded for this matter in 2015.\nIn July 2018, Vulcan, along with more than \n100\n other defendants, was sued by Occidental in United States District Court for the District of New Jersey, Newark Vicinage. Occidental is seeking cost recovery and contribution under CERCLA for costs related to the River. This lawsuit is currently stayed. In another related proceeding, Occidental filed a lawsuit in March 2023 against Vulcan and \n39\n other defendants in United States District Court for the District of New Jersey, Newark Vicinage seeking cost recovery and contribution under CERCLA for costs related to the upper 9 miles of the River. It is unknown at this time how the settlement and approval of the Consent Decree with the EPA/DOJ would affect the Occidental lawsuits.\n▪\nTEXAS BRINE MATTER (DISCONTINUED OPERATIONS) — During operation of its former Chemicals Division, Vulcan leased the right to mine salt out of an underground salt dome formation in Assumption Parish, Louisiana from 1976 - 2005. Throughout that period, Texas Brine Company (Texas Brine) was the operator contracted by Vulcan to mine and deliver the salt as brine. We sold our Chemicals Division in 2005 and transferred our rights and interests related to the salt and mining operations to the purchaser, a subsidiary of Occidental Chemical Company (Occidental), and we have had no association with the leased premises or Texas Brine since that time. In August 2012, a sinkhole developed in the vicinity of the Texas Brine mining operations. Numerous lawsuits were filed thereafter in state court in Assumption Parish, Louisiana. Other lawsuits, including class action litigation, were filed in the United States District Court for the Eastern District of Louisiana in New Orleans.\nPart II\n98\nIn these lawsuits, the main plaintiffs sued numerous defendants, including Texas Brine, Occidental and Vulcan, alleging various damages including, but not limited to, property damages; a claim by the State of Louisiana for response costs and civil penalties; physical damages to oil and gas pipelines and storage facilities (pipelines); and business interruption losses. All such claims have been settled except for the claims by the State of Louisiana. Our insurers to date have funded these settlements in excess of our self-insured retention amount.\nAdditionally, Texas Brine, Occidental and Vulcan sued each other in various state and federal court forums. Vulcan and Occidental have since dismissed all of their claims against one another; Texas Brine and Occidental have settled their claims against each other; and Texas Brine’s and Vulcan’s claims against each other are pending in state and federal court. In general, Texas Brine alleges that the sinkhole was caused, in whole or in part, by our negligent or fraudulent actions or failure to act; that we breached the salt lease with Occidental, as well as an operating agreement and related contracts with Texas Brine; that we were strictly liable for certain property damages in our capacity as a former lessee of the salt lease; and that we violated the agreement under which we sold our Chemicals Division to Occidental. Texas Brine’s claims against Vulcan include claims for past and future response costs, lost profits and investment costs, indemnity payments, attorneys’ fees, other litigation costs, and judicial interests. Texas Brine also recently filed a lawsuit against Vulcan seeking indemnity for potential exposure Texas Brine may have to Occidental in the related arbitration, the State of Louisiana, and for ongoing and future Louisiana regulatory matters. In August 2022, we removed the lawsuit to federal court.\nThe state court held a joint bench trial (judge only) in 2017 in \nthree\n cases brought by pipeline companies claiming damages to their facilities as a result of the sinkhole. This “Phase 1” trial was limited in scope to comparative fault and liability for causing the sinkhole. In December 2017, the trial court issued a ruling allocating fault as follows: Occidental \n50\n%, Texas Brine (and its wholly-owned subsidiary) \n35\n% and Vulcan \n15\n%. In December 2020, the Louisiana Court of Appeal, First Circuit reversed the judgment in part in \none\n of the \nthree\n jointly tried cases, allocating \n55\n% of the fault to Texas Brine (and its wholly-owned subsidiary); \n30\n% to Occidental; and affirming the \n15\n% fault allocation to Vulcan. In May 2021 and April 2022, the Court of Appeal issued judgments in the other two pipeline cases, adopting the same fault allocation. The Louisiana Supreme Court has declined to review the judgments, resulting in final judgments regarding fault allocations in those matters. \nIn the second quarter of 2022, we recorded an immaterial loss related to the claims brought by Texas Brine. In August 2022, Vulcan and Texas Brine commenced a joint “Phase 2” bench trial in the same \nthree\n pipeline cases where fault was allocated. Prior to trial, the trial court granted various motions by Vulcan seeking dismissal of Texas Brine’s contract-based claims and hundreds of millions of dollars in alleged damages. Thus, the Phase 2 trial addressed the claims that remained pending between Texas Brine and Vulcan after that motion practice. During the Phase 2 trial, Texas Brine and Vulcan reached a negotiated joint stipulation as to the amount of Texas Brine’s damages for its surviving tort claims at issue in the trial. After applying Vulcan’s \n15\n% fault allocation, Vulcan’s stipulated financial responsibility for the damages at issue in the trial is within the immaterial loss recorded during the second quarter of 2022. I\nn December 2022, the trial court entered a judgment in the pipeline cases reflecting this stipulation. Texas Brine moved to assess all trial costs against Vulcan. Texas Brine and Vulcan thereafter reached a settlement, wherein Vulcan agreed to pay a portion of Texas Brine's trial costs, the amount of which was within the remaining immaterial loss recorded in the second quarter of 2022.\nThe December 2022 Phase 2 judgment did not address numerous of Texas Brine’s claims seeking hundreds of millions of dollars in damages that were dismissed prior to trial. Texas Brine appealed those judgments. In December 2024, the Court of Appeal affirmed the dismissal of most of those damage claims but remanded the dispute to the District Court for further adjudication of an indemnity claim under one of the agreements. We cannot at this time reasonably estimate the range of liability, if any, that could result from Texas Brine's indemnity claim or should the Louisiana Supreme Court exercise jurisdiction to review any of the December 2024 appellate court rulings. At this time, we also cannot reasonably estimate a range of liability pertaining to the claims brought by the State of Louisiana. \n▪\n1,1,1-TRICHLOROETHANE LITIGATION (DISCONTINUED OPERATIONS) — During the operation of our former Chemicals Division, which was divested to Occidental in 2005, Vulcan manufactured a chlorinated solvent known as 1,1,1-trichloroethane. Vulcan faces liabilities related to 1,1,1-trichloroethane stabilized with 1,4-dioxane (\"TCA\"). We are one of the defendants in cases filed in both state and federal courts, including \none\n case filed by the State of New Jersey. According to the various complaints, the plaintiffs seek damages including, but not limited to, unspecified compensatory damages associated with the remediation of water wells allegedly contaminated with 1,4-dioxane, natural resource damages, disgorgement of profits from the sale of TCA, punitive damages, as well as penalties and attorney's fees under various statutes. We will vigorously defend these cases on substantive and procedural grounds. At this time, we cannot determine the likelihood of loss, or reasonably estimate a range of loss, if any, pertaining to the above-referenced cases.\n▪\nHEWITT LANDFILL MATTER (SUPERFUND SITE) — In September 2015, the Los Angeles Regional Water Quality Control Board (RWQCB) issued a Cleanup and Abatement Order directing Calmat Co., a Vulcan subsidiary (hereinafter \"Vulcan\") to assess, monitor, cleanup, and abate wastes that have been discharged to soil, soil vapor, and/or groundwater at the former Hewitt Landfill in Los Angeles.\nFollowing an onsite and offsite investigation and pilot scale testing, the RWQCB approved a corrective action under a Cleanup and Abatement Order (CAO) to include leachate recovery, storm water capture and conveyance improvements, and a groundwater pump, treat and reinjection system. Certain on-site source control measures have been implemented, and the treatment system is fully operational. In October 2024, the RWQCB made a request under the CAO for a work plan to install additional monitoring wells and optimize and expand the existing on-site remediation system. This request complements expansion discussions with the EPA and other stakeholders, as part of the Alternative Design Work Plan (ADWP) which was submitted in January 2025. Currently-anticipated costs of these on-site source control activities, including those associated with this work plan, have been fully accrued.\nPart II\n99\nWe are also engaged in an ongoing dialogue with the EPA, Honeywell, and the Los Angeles Department of Water and Power (LADWP) regarding the potential contribution of the Hewitt Landfill to groundwater contamination in the North Hollywood Operable Unit (NHOU) of the San Fernando Valley Superfund Site.\nThe EPA and Vulcan entered into an AOC and Statement of Work having an effective date of September 2017 for the design of \ntwo\n extraction wells south of the Hewitt Landfill to protect the North Hollywood West (NHW) well field located within the NHOU. In November 2017, we submitted a Pre-Design Investigation (PDI) Work Plan to the EPA, which sets forth the activities and schedule for collection of data in support of our evaluation of the need for an offsite remedy. In addition, this evaluation was expanded as part of the PDI to include the evaluation of a remedy in light of LADWP’s Rinaldi-Toluca (RT) wellfield project. PDI investigative activities were completed between the first and third quarters of 2018, and in December 2018 we submitted a Draft PDI Evaluation Report to the EPA. The Draft PDI Evaluation Report summarizes data collection activities conducted pursuant to the Draft PDI Work Plan and provides model updates and evaluation of remediation alternatives for offsite areas. The EPA provided a final set of comments to the Draft PDI Evaluation Report in October 2020. The final set of comments included a request that Vulcan revise and develop a final PDI Evaluation Report. The final comments further provided a proposal for an alternative approach for offsite remediation (as opposed to installation of offsite extraction wells) and development of a Supplemental PDI Evaluation Report (Supplemental Report) that would require the EPA to modify the remedy in the record of decision as it relates to the Hewitt Landfill. In December 2020, we submitted the Final PDI Evaluation Report, which included responses to the EPA’s comments.\nAt the EPA's request, we submitted a Supplemental Report in March 2023 and an ADWP in May 2023. Similar to the PDI Evaluation Report, the Supplemental Report and ADWP identified expansion of the onsite Hewitt remedy in conjunction with the offsite treatment being performed by LADWP as the preferred option for addressing contamination in offsite areas, instead of the \ntwo\n wells proposed by the EPA. In conjunction with its review of the Supplemental Report, the EPA held an initial meeting with stakeholders, including LADWP, in November 2023 and has requested additional meetings to determine a path forward. \nIn December 2019, Honeywell agreed with LADWP to build a water treatment system (often referred to as the Cooperative Containment Concept or CCC or the second interim remedy) that will provide treated groundwater in the NHOU to LADWP for public water supply purposes. Honeywell contends that some of the contamination to be remediated by the treatment system it is building originated from the Hewitt Landfill and that Vulcan should fund some portion of the costs that Honeywell has incurred and will incur in developing and implementing the second interim remedy. During the fourth quarter of 2021, we completed a partial settlement with Honeywell related to certain of the costs that Honeywell has incurred for an immaterial amount. In March 2023, Honeywell filed a lawsuit against Vulcan and a third party alleging that Honeywell has incurred more than $\n11\n million in costs to resolve its liability to the EPA and that it estimates that it will spend in excess of $\n100\n million to construct and operate its water treatment system. Honeywell seeks an \"equitable share of necessary response costs\" from Vulcan and the third party, which claims indemnity from Vulcan. Discussions are ongoing with Honeywell regarding the reasonable costs Honeywell has incurred. We are also gathering and analyzing data and developing technical information to determine the extent of possible contribution by the Hewitt Landfill to the groundwater contamination in the area. Based on this technical information and recent settlement discussions, we have accrued an immaterial amount for our contribution of costs anticipated to be incurred by Honeywell. This work is also intended to assist in identification of other PRPs that may have contributed to groundwater contamination in the area.\nFurther, LADWP is constructing \ntwo\n new production and treatment facilities at city wellfields located near the Hewitt Landfill — the NHW wellfield and the RT wellfield (also referred to as the NHW treatment system and North Hollywood Central (NHC) treatment system, respectively). LADWP has alleged that the Hewitt Landfill is one of the primary sources of contamination at the NHW treatment system and one of the sources of contamination at the NHC treatment system. According to information available on the California State Water Resources Control Board (SWRCB) website, the capital cost of the NHW treatment system is estimated at $\n92\n million, and the capital cost of the NHC treatment system is estimated at $\n245\n million. The NHW system commenced operation in late 2024, and the NHC system is expected to commence operation in 2025. Both systems will incur costs for operation and maintenance. LADWP has applied for and received substantial funding to contribute to both treatment systems from grants of Proposition 1 bond funding from the SWRCB. According to information available on the SWRCB website, the bond money obtained for the NHW treatment system is $\n46\n million, and the bond money obtained for the NHC treatment system is $\n95\n million. \nWe anticipate continued discussions with LADWP regarding its potential claims. In conjunction with those discussions, we are engaging in further efforts to gather and analyze records and data in order to assess the extent of possible contribution by the Hewitt Landfill to the groundwater contamination in the area, consistent with the parallel request by the EPA, and the reasonableness of LADWP’s remediation efforts. This work is also intended to assist in identification of other PRPs that may have contributed to groundwater contamination in the area of the NHW and RT wellfields. Together, these efforts will allow us to analyze our anticipated equitable contribution to LADWP’s remediation efforts. Among other factors, we anticipate that any equitable contribution should take into account the on-site source control and other measures implemented by Vulcan at the former Hewitt Landfill, the relative contribution and duration of any contaminants originating from the Hewitt Landfill to the LADWP systems, and the cost effectiveness of the LADWP systems. At this time, we cannot reasonably estimate a range of a loss to Vulcan pertaining to LADWP’s potential contribution claim.\n▪\nNAFTA ARBITRATION — In September 2018, our subsidiary Legacy Vulcan, LLC (Legacy Vulcan), on its own behalf, and on behalf of our Mexican subsidiary Calizas Industriales del Carmen, S.A. de C.V. (Calica), served the United Mexican States (Mexico) a Notice of Intent to Submit a Claim to Arbitration under Chapter 11 of the North American Free Trade Agreement (NAFTA). This NAFTA claim relates to the treatment of a portion of our quarrying operations in Quintana Roo, Mexico arising from, among other measures, Mexico’s failure to comply with a legally binding zoning agreement and relates to other unfair, arbitrary and capricious actions by Mexico’s environmental enforcement agency. We assert that these actions are in breach of Mexico’s international obligations under NAFTA and international law.\nPart II\n100\nAs required by Article 1118 of NAFTA, we sought to settle this dispute with Mexico through consultations. Notwithstanding our good faith efforts to resolve the dispute amicably, we were unable to do so and filed a Request for Arbitration with the International Centre for Settlement of Investment Disputes (ICSID) in December 2018. In January 2019, ICSID registered our Request for Arbitration.\nA hearing on the merits took place in July 2021. While we awaited the final resolution from the tribunal, we continued to engage with government officials to pursue an amicable resolution of the dispute. On May 5, 2022, Mexican government officials unexpectedly and arbitrarily shut down Calica’s remaining operations in Mexico. On May 8, 2022, Legacy Vulcan filed an application in the NAFTA arbitration seeking provisional measures and leave to file an ancillary claim in connection with this latest shutdown (see \nPart I\nI\n, Item \n7\n \n\"\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n\"\n under the caption \"Known Trends or Uncertainties\"). In July 2022, the NAFTA arbitration tribunal granted Legacy Vulcan’s application and ordered Mexico not to take any action that might further aggravate the dispute between the parties or render the resolution of the dispute potentially more difficult. A hearing on the merits of the ancillary claim took place in August 2023. We expect that the NAFTA arbitration tribunal will issue a decision on the claim and ancillary claim during the first half of 2025. \nAt this time, there can be no assurance whether we will be successful in our NAFTA claim and ancillary claim, and we cannot quantify the amount we may recover, if any, under this arbitration proceeding if we are successful.\nIt is not possible to predict the ultimate outcome of these and other legal proceedings in which we are involved, and a number of factors, including developments in ongoing discovery or adverse rulings, or the verdict of a particular jury, could cause actual losses to differ materially from accrued costs. \nNo\n liability was recorded for claims and litigation for which a loss was determined to be only reasonably possible or for which a loss could not be reasonably estimated. Legal costs incurred in defense of lawsuits are expensed as incurred. In addition, losses on certain claims and litigation described above may be subject to limitations on a per occurrence basis by excess insurance, as described in \nNote 1\n under the caption \"Claims and Litigation Including Self-Insurance.\"\nNOTE 13: \nEQUITY\nOur capital stock consists solely of common stock, par value $\n1.00\n per share, of which \n480,000,000\n shares may be issued. Holders of our common stock are entitled to \none\n vote per share. We may also issue \n5,000,000\n shares of preferred stock, but \nno\n shares have been issued. The terms and provisions of such shares will be determined by our Board of Directors upon any issuance of preferred shares in accordance with our Certificate of Incorporation.\nThere were \nno\n shares held in treasury as of December 31, 2024, 2023 and 2022.\nOur common stock purchases (all of which were open market purchases) and subsequent retirements for the years ended December 31 are summarized below:\nin millions, except average cost\n2024\n2023\n2022\nNumber of shares purchased and retired\n0.3\n1.0\n0.0\nTotal purchase price \n1\n$\n68.8\n \n$\n200.0\n \n$\n0.0\n \nAverage cost per share\n$\n254.71\n \n$\n204.52\n \n$\n0.00\n \n \n1\nThe amount paid to purchase shares in excess of the par value and related excise taxes are recorded in retained earnings.\n \nAs of December 31, 2024, \n6,817,118\n shares may be purchased under the current authorization of our Board of Directors.\nDividends for the years ended December 31 were as follows:\nin millions, except per share data\n2024\n2023\n2022\nCash dividends\n$\n244.4\n \n$\n228.4\n \n$\n212.6\n \nCash dividends per share\n$\n1.84\n \n$\n1.72\n \n$\n1.60\n \nTotal equity as presented in the consolidated financial statements for the year ended December 31, 2024 includes a noncontrolling interest of $\n23.9\n million, representing the unowned portion of a subsidiary. See \nNote 1\n under the caption \"Noncontrolling Interest\" for additional discussion.\nPart II\n101\nNOTE 14: \nOTHER COMPREHENSIVE INCOME\nComprehensive income comprises two subsets: net earnings and other comprehensive income (OCI). The components of OCI are presented in the accompanying Consolidated Statements of Comprehensive Income and Consolidated Statements of Equity, net of applicable taxes.\nAmounts in accumulated other comprehensive income (loss) (AOCI), net of tax, at December 31, are as follows:\nin millions\n2024\n2023\n2022\nCash flow hedges\n$\n(\n17.7\n)\n$\n(\n19.4\n)\n$\n(\n21.0\n)\nPension and postretirement plans\n(\n109.7\n)\n(\n124.4\n)\n(\n133.7\n)\nTotal AOCI\n$\n(\n127.4\n)\n$\n(\n143.8\n)\n$\n(\n154.7\n)\nChanges in AOCI, net of tax, for the three years ended December 31, 2024 are as follows:\nin millions\nCash Flow\nHedges\nPension and\nPostretirement\nBenefit Plans\nTotal\nAOCI Balances at December 31, 2021\n$\n(\n22.5\n)\n$\n(\n130.2\n)\n$\n(\n152.7\n)\nOther comprehensive income (loss) before reclassifications\n0.0\n \n(\n6.5\n)\n(\n6.5\n)\nAmounts reclassified from AOCI\n1.5\n \n3.0\n \n4.5\n \nNet OCI changes\n1.5\n \n(\n3.5\n)\n(\n2.0\n)\nAOCI Balances at December 31, 2022\n$\n(\n21.0\n)\n$\n(\n133.7\n)\n$\n(\n154.7\n)\nOther comprehensive income (loss) before reclassifications\n0.0\n \n4.2\n \n4.2\n \nAmounts reclassified from AOCI\n1.6\n \n5.1\n \n6.7\n \nNet OCI changes\n1.6\n \n9.3\n \n10.9\n \nAOCI Balances at December 31, 2023\n$\n(\n19.4\n)\n$\n(\n124.4\n)\n$\n(\n143.8\n)\nOther comprehensive income (loss) before reclassifications\n0.0\n \n9.7\n \n9.7\n \nAmounts reclassified from AOCI\n1.7\n \n5.0\n \n6.7\n \nNet OCI changes\n1.7\n \n14.7\n \n16.4\n \nAOCI Balances at December 31, 2024\n$\n(\n17.7\n)\n$\n(\n109.7\n)\n$\n(\n127.4\n)\nAmounts reclassified from AOCI to earnings are as follows:\nin millions\n2024\n2023\n2022\nAmortization of Accumulated Cash Flow Hedge Losses\nInterest expense\n$\n2.2\n \n$\n2.1\n \n$\n2.0\n \nBenefit from income taxes\n(\n0.5\n)\n(\n0.5\n)\n(\n0.5\n)\nTotal\n$\n1.7\n \n$\n1.6\n \n$\n1.5\n \nAmortization of Accumulated Benefit Plan Costs\nOther nonoperating expense\n$\n6.8\n \n$\n6.9\n \n$\n4.0\n \nBenefit from income taxes\n(\n1.8\n)\n(\n1.8\n)\n(\n1.0\n)\nTotal\n$\n5.0\n \n$\n5.1\n \n$\n3.0\n \nTotal reclassifications from AOCI to earnings\n$\n6.7\n \n$\n6.7\n \n$\n4.5\n \nPart II\n102\nNOTE 15: \nSEGMENT REPORTING\nOur operating segments are based on our internal management reporting structure. Our chief operating decision maker (CODM),\nthe Chairman and Chief Executive Officer, evaluates our operating results through reportable segment gross profit. This financial metric is used to review operating trends, perform analytical comparisons between periods and monitor budget-to-actual variances on a monthly basis in order to assess performance and allocate resources.\nWe continually assess our internal management reporting structure and the financial information evaluated by our CODM to determine whether any changes have occurred that would impact segment reporting. During the first quarter of 2024, we reorganized the financial information provided to our CODM. As a result, we now report our calcium operation within our Aggregates reporting segment to align with our new reporting structure. All prior period segment information has been revised to conform to the current presentation. This change in our reporting segments had no impact on previously reported consolidated financial results.\nWe have \nthree\n operating (and reportable) segments organized around our principal product lines: Aggregates, Asphalt and Concrete. Management reviews earnings from these reporting segments principally at the gross profit level.\nThe Aggregates segment produces and sells aggregates (crushed stone, sand and gravel, sand, and other aggregates) and related products and services. During 2024, the Aggregates segment principally served markets in \ntwenty-three\n states, the U.S. Virgin Islands, Washington D.C., Freeport (Bahamas), British Columbia (Canada), Puerto Cortés (Honduras) and Quintana Roo (Mexico) — see \nNote 12\n, NAFTA Arbitration — with a full line of aggregates. Aggregates are used primarily in the construction and maintenance of highways, streets and other public works and in the construction of housing and commercial, industrial and other nonresidential facilities. Customers are served by truck, rail and water distribution networks from our production facilities and sales yards. Due to the high weight-to-price ratio of aggregates, markets generally are local in nature. Quarries located on waterways and rail lines allow us to serve remote markets where local aggregates reserves may not be available. \nThe Asphalt segment produces and sells asphalt mix in \nsix\n states (Alabama, Arizona, California, New Mexico, Tennessee and Texas) and provides asphalt construction paving services in \nthree\n states (Alabama, Tennessee and Texas).\nThe Concrete segment produces and sells ready-mixed concrete in \nthree\n states (California, Maryland and Virginia) in addition to the U.S. Virgin Islands and Washington D.C.\nAggregates comprise approximately \n95\n% of asphalt mix by weight and \n80\n% of ready-mixed concrete by weight. Our Asphalt and Concrete segments are primarily supplied with their aggregates requirements from our Aggregates segment. These intersegment sales are made at local market prices for the particular grade and quality of product used in the production of asphalt mix and ready-mixed concrete and are excluded from total revenues. Customers for our Asphalt and Concrete segments are generally served locally at our production facilities or by truck. Because asphalt mix and ready-mixed concrete harden rapidly, delivery is time constrained and generally confined to a radius of approximately \n20\n to \n25\n miles from the producing facility.\nThe vast majority of our activities are domestic. We sell a relatively small amount of construction aggregates outside the United States. Total domestic revenues were $\n7,401.0\n million, $\n7,769.7\n million and $\n7,263.9\n million in 2024, 2023 and 2022, respectively. Nondomestic Aggregates segment revenues were $\n16.7\n million, $\n12.2\n million and $\n51.3\n million in 2024, 2023 and 2022, respectively; there were \nno\n significant nondomestic revenues in our Asphalt or Concrete segments. Long-lived assets outside the United States, which consist primarily of property, plant & equipment, were $\n501.4\n million, $\n524.1\n million and $\n534.2\n million in 2024, 2023 and 2022, respectively. Equity method investments of $\n26.6\n million in 2024, $\n26.6\n million in 2023 and $\n26.5\n million in 2022 are included in the identifiable assets for the Aggregates segment and in investments and long-term receivables on the accompanying Consolidated Balance Sheets.\nPart II\n103\nSEGMENT FINANCIAL DISCLOSURE\nin millions\n2024\n2023\n2022\nTotal Revenues\nAggregates \n1\n$\n5,949.6\n \n$\n5,918.9\n \n$\n5,280.6\n \nAsphalt \n2\n1,245.6\n \n1,140.7\n \n990.2\n \nConcrete \n3\n653.5\n \n1,249.3\n \n1,593.9\n \nSegment sales\n$\n7,848.7\n \n$\n8,308.9\n \n$\n7,864.7\n \nAggregates intersegment sales\n(\n431.0\n)\n(\n527.0\n)\n(\n549.5\n)\nTotal revenues\n$\n7,417.7\n \n$\n7,781.9\n \n$\n7,315.2\n \nCost of Revenues\nAggregates\n$\n(\n3,701.9\n)\n$\n(\n3,655.1\n)\n$\n(\n3,320.0\n)\nAsphalt\n(\n1,075.5\n)\n(\n991.1\n)\n(\n932.9\n)\nConcrete \n3\n(\n640.7\n)\n(\n1,187.2\n)\n(\n1,504.6\n)\nTotal\n$\n(\n5,418.1\n)\n$\n(\n5,833.4\n)\n$\n(\n5,757.5\n)\nGross Profit\nAggregates\n$\n1,816.7\n \n$\n1,736.8\n \n$\n1,411.1\n \nAsphalt\n170.1\n \n149.6\n \n57.3\n \nConcrete \n3\n12.8\n \n62.1\n \n89.3\n \nTotal \n$\n1,999.6\n \n$\n1,948.5\n \n$\n1,557.7\n \nReconciliation to Pretax Earnings\nSelling, administrative and general expenses\n$\n(\n531.1\n)\n$\n(\n542.8\n)\n$\n(\n515.1\n)\nOther operating income (expense), net\n(\n104.0\n)\n21.7\n \n(\n91.2\n)\nOther nonoperating income (expense), net\n(\n22.1\n)\n(\n2.7\n)\n5.1\n \nInterest expense, net\n(\n170.3\n)\n(\n179.6\n)\n(\n168.4\n)\nEarnings from continuing operations before income taxes\n$\n1,172.1\n \n$\n1,245.1\n \n$\n788.1\n \n1\nIncludes product sales, as well as freight & delivery costs that we pass along to our customers, and service revenues (see \nNote 2\n) related to our aggregates business.\n2\nIncludes product sales, as well as service revenues (see \nNote 2\n) from our asphalt construction paving business. \n3\nThe decreases in the Concrete segment are primarily due to the 2022 divestiture of concrete operations in New Jersey, New York and Pennsylvania and the 2023 divestiture of concrete operations in Texas. See \nNote \n19\n \nfor additional information.\nPart II\n104\nSEGMENT FINANCIAL DISCLOSURE (CONTINUED)\nin millions\n2024\n2023\n2022\nDepreciation, Depletion, Accretion & Amortization \n1\nAggregates\n$\n515.7\n \n$\n482.3\n \n$\n441.3\n \nAsphalt\n44.1\n \n35.6\n \n35.1\n \nConcrete\n45.5\n \n72.8\n \n83.1\n \nOther\n26.9\n \n26.3\n \n28.0\n \nTotal\n$\n632.2\n \n$\n617.0\n \n$\n587.5\n \nCapital Expenditures \n2\nAggregates\n$\n588.4\n \n$\n764.9\n \n$\n540.4\n \nAsphalt\n36.1\n \n46.9\n \n23.3\n \nConcrete\n12.2\n \n15.8\n \n50.4\n \nCorporate\n0.7\n \n0.9\n \n30.0\n \nTotal\n$\n637.4\n \n$\n828.5\n \n$\n644.1\n \nIdentifiable Assets \n3\nAggregates\n$\n14,294.6\n \n$\n11,753.2\n \n$\n11,579.0\n \nAsphalt\n805.7\n \n613.4\n \n597.6\n \nConcrete\n1,065.8\n \n962.3\n \n1,436.2\n \nTotal identifiable assets \n4\n$\n16,166.1\n \n$\n13,328.9\n \n$\n13,612.8\n \nGeneral corporate\n337.9\n \n267.6\n \n460.3\n \nCash and cash equivalents and restricted cash\n600.8\n \n949.2\n \n161.5\n \nTotal assets\n$\n17,104.8\n \n$\n14,545.7\n \n$\n14,234.6\n \n1\nDepreciation, Depletion, Accretion & Amortization (DDA&A) for each segment is included in cost of revenues.\n2\nCapital expenditures include changes in accruals for purchases of property, plant & equipment. Capital expenditures exclude property, plant & equipment obtained by business acquisitions.\n3\nCertain temporarily idled assets are included within a segment's Identifiable Assets, but the associated DDA&A is shown within Other in the DDA&A section above as the related DDA&A is excluded from segment gross profit.\n4\nThe increases in total identifiable assets are primarily due to acquisitions completed in 2024 (see \nNote 19\n f\nor additional information)\n.\nNOTE 16: \nSUPPLEMENTAL CASH FLOW INFORMATION\nSupplemental information referable to the Consolidated Statements of Cash Flows is summarized below: \nin millions\n2024\n2023\n2022\nCash Payments\nInterest (exclusive of amount capitalized)\n$\n182.9\n \n$\n178.7\n \n$\n164.3\n \nIncome taxes\n279.8\n \n291.7\n \n143.5\n \nNoncash Investing and Financing Activities\nAccruals for purchases of property, plant & equipment\n$\n98.5\n \n$\n64.6\n \n$\n108.7\n \nNote received from sale of business\n0.9\n \n0.0\n \n130.0\n \nRecognition of new and revised lease obligations:\nOperating lease right-of-use assets\n68.8\n \n4.0\n \n44.8\n \nFinance lease right-of-use assets\n4.6\n \n2.9\n \n3.8\n \nConsideration payable to seller in business acquisitions\n30.9\n \n0.0\n \n65.4\n \nPart II\n105\nNOTE 17: \nASSET RETIREMENT OBLIGATIONS\nAsset retirement obligations (AROs) are legal obligations associated with the retirement of long-lived assets resulting from the acquisition, construction, development and/or normal use of the underlying assets, including legal obligations for land reclamation. Recognition of a liability for an ARO is required in the period in which it is incurred at its estimated fair value. The associated asset retirement costs are capitalized as part of the carrying amount of the underlying asset and depreciated over the estimated useful life of the asset. The liability is accreted through charges to operating expenses. If the ARO is settled for a value other than the carrying amount of the liability, we recognize a gain or loss on settlement.\nFor the years ended December 31, ARO operating costs related to accretion of the liabilities and depreciation of the assets are as follows:\nin millions\n2024\n2023\n2022\nAccretion\n$\n14.7\n \n$\n13.9\n \n$\n14.1\n \nDepreciation\n12.5\n \n9.0\n \n9.4\n \nTotal ARO operating costs\n$\n27.2\n \n$\n22.9\n \n$\n23.5\n \nARO operating costs are reported in cost of revenues. AROs are reported within other noncurrent liabilities in our accompanying Consolidated Balance Sheets.\nReconciliations of the carrying amounts of our AROs for the years ended December 31 are as follows:\nin millions\n2024\n2023\nARO balance at beginning of year\n$\n324.1\n \n$\n311.3\n \nLiabilities incurred\n42.3\n \n0.0\n \nLiabilities settled\n(\n19.1\n)\n(\n9.9\n)\nAccretion expense\n14.7\n \n13.9\n \nRevisions, net\n65.4\n \n8.8\n \nARO balance at end of year\n$\n427.4\n \n$\n324.1\n \nARO liabilities incurred during 2024 relate to those assumed in 2024 acquisitions (see \nNote 19\n). ARO revisions during 2024 primarily related to cost adjustments for a number of aggregates properties in California that are being reclaimed for alternative uses post mining.\nPart II\n106\nNOTE 18: \nGOODWILL AND INTANGIBLE ASSETS\nAcquired identifiable intangible assets are classified into three categories: (1) goodwill, (2) intangible assets with finite lives subject to amortization and (3) intangible assets with indefinite lives. Goodwill and intangible assets with indefinite lives are not amortized; rather, they are reviewed for impairment at least annually.\nGOODWILL\nGoodwill is recognized when the consideration paid for a business exceeds the fair value of the tangible and identifiable intangible assets acquired. Goodwill is allocated to reporting units for purposes of testing goodwill for impairment. We test goodwill for impairment on an annual basis or more frequently if events or circumstances change in a manner that would more likely than not reduce the fair value of a reporting unit below its carrying value. A decrease in the estimated fair value of one or more of our reporting units could result in the recognition of a material, noncash write-down of goodwill.\nDuring the third quarter of 2024, we determined that a triggering event occurred with respect to a reporting unit that includes concrete operations acquired from U.S. Concrete in 2021. We previously disclosed that the estimated fair value of this reporting unit exceeded its carrying value by less than 5%. Based on an interim goodwill impairment test, we determined that the estimated fair value of this reporting unit was less than its carrying value. As a result, we recorded an $\n86.6\n million noncash impairment charge. In addition, during the third quarter of 2022, we recorded an interim goodwill impairment loss of $\n50.9\n million related to the fourth quarter sale of a reporting unit comprised of concrete operations in New Jersey, New York and Pennsylvania. There were no charges for goodwill impairment in the year ended December 31, 2023. Accumulated goodwill impairment losses amount to $\n390.2\n million ($\n252.7\n million in our former Cement segment and $\n137.5\n in our Concrete segment).\nWe have \nthree\n reportable segments organized around our principal product lines: Aggregates, Asphalt and Concrete. \nChanges in the carrying amount of goodwill by reportable segment for the three years ended December 31 are shown below:\nin millions\nAggregates\nAsphalt\nConcrete\nTotal\nGoodwill at December 31, 2022\n$\n3,330.3\n \n$\n91.6\n \n$\n267.7\n \n$\n3,689.6\n \nGoodwill of acquired businesses \n1\n(\n0.1\n)\n0.0\n \n0.0\n \n(\n0.1\n)\nGoodwill of divested businesses \n1\n0.0\n \n0.0\n \n(\n157.8\n)\n(\n157.8\n)\nGoodwill at December 31, 2023\n$\n3,330.2\n \n$\n91.6\n \n$\n109.9\n \n$\n3,531.7\n \nGoodwill of acquired businesses \n1\n343.0\n \n0.0\n \n0.0\n \n343.0\n \nGoodwill impairment\n0.0\n \n0.0\n \n(\n86.6\n)\n(\n86.6\n)\nGoodwill at December 31, 2024\n$\n3,673.2\n \n$\n91.6\n \n$\n23.3\n \n$\n3,788.1\n \n1\nSee \nNote 19\n for acquisitions and divestitures.\n \nINTANGIBLE ASSETS\nIntangible assets consist of contractual rights in place (primarily permitting and zoning rights), noncompetition agreements, customer relationships and trade names and trademarks. Intangible assets acquired in business combinations are stated at their fair value determined as of the date of acquisition. Intangible assets acquired individually or otherwise obtained outside a business combination consist primarily of permitting, permitting compliance and zoning rights and are stated at their historical cost less accumulated amortization. Costs incurred to renew or extend the life of existing intangible assets are capitalized. These capitalized renewal/extension costs were immaterial for the years presented.\nSee \nNote 19\n for the details of the intangible assets acquired in business acquisitions. Amortization of finite-lived intangible assets is computed based on the estimated life of the intangible assets. Contractual rights in place associated with aggregates reserves are amortized using the unit-of-sales method based on estimated recoverable units. Other intangible assets are amortized principally by the straight-line method. Intangible assets are reviewed for impairment when events or circumstances indicate that the carrying amount may not be recoverable. There were \nno\n material charges for impairment of intangible assets in 2024, 2023 and 2022.\nPart II\n107\nThe gross carrying amount and accumulated amortization by major intangible asset class for the years ended December 31 are summarized below:\nin millions\n2024\n2023\nGross Carrying Amount\nContractual rights in place \n$\n1,899.0\n \n$\n1,592.7\n \nPermitting, permitting compliance and zoning rights\n221.3\n \n206.8\n \nOther \n1\n101.6\n \n90.4\n \nTotal gross carrying amount\n$\n2,221.9\n \n$\n1,889.9\n \nAccumulated Amortization\nContractual rights in place \n$\n(\n407.0\n)\n$\n(\n344.5\n)\nPermitting, permitting compliance and zoning rights\n(\n70.4\n)\n(\n59.5\n)\nOther \n1\n(\n29.8\n)\n(\n25.2\n)\nTotal accumulated amortization\n$\n(\n507.2\n)\n$\n(\n429.2\n)\nTotal Intangible Assets Subject to Amortization, net\n$\n1,714.7\n \n$\n1,460.7\n \nIntangible Assets with Indefinite Lives\n0.0\n \n0.0\n \nTotal Intangible Assets, net\n$\n1,714.7\n \n$\n1,460.7\n \nAmortization Expense for the Year\n$\n83.9\n \n$\n88.1\n \n1\nIncludes noncompetition agreements, patents, customer relationships, tradenames and trademarks.\nEstimated amortization expense for the five years subsequent to December 31, 2024 is as follows:\nin millions\nEstimated Amortization Expense for Five Subsequent Years \n1\n2025\n$\n89.7\n \n2026\n88.2\n \n2027\n85.3\n \n2028\n83.7\n \n2029\n81.1\n \n1\nIncludes amortization of quarry development assets (including pre-production stripping costs) reported within other noncurrent assets in our accompanying Consolidated Balance Sheets.\n \nNOTE 19: \nACQUISITIONS AND DIVESTITURES\nBUSINESS ACQUISITIONS\n2024 BUSINESS ACQUISITIONS — During 2024, we acquired the following operations for total consideration of $\n2,297.1\n million ($\n2,266.2\n million cash and $\n30.9\n million noncash):\n▪\nAlabama — aggregates, asphalt mix and construction paving operations\n▪\nCalifornia — aggregates, asphalt and ready-mixed concrete operations\n▪\nNorth Carolina — aggregates operations\n▪\nSouth Carolina — aggregates operations\n▪\nTexas — asphalt mix and construction paving operations\nWhile none of these acquisitions were individually material, our fourth quarter acquisitions of Wake Stone Corporation (Wake Stone) and Superior Ready Mix, L.P. (Superior) were collectively material. \nThe amounts of total revenues and net earnings attributable to Vulcan from the Wake Stone and Superior acquisitions are included in our Consolidated Statement of Comprehensive Income for the year ended December 31, 2024 as follows:\nin millions\n2024\nActual Results\nTotal revenues\n$\n13.3\n \nNet loss attributable to Vulcan\n(\n10.5\n)\nPart II\n108\nThe unaudited pro forma financial information in the table below summarizes the results of operations for Vulcan, Wake Stone and Superior as if they were combined as of January 1, 2023. The pro forma financial information does not reflect any cost savings, operating efficiencies or synergies as a result of these acquisitions. Consistent with the assumed acquisition date of January 1, 2023, the pro forma information excludes transactions between Vulcan, Wake Stone and Superior. \nThe following pro forma information also includes: 1) charges directly attributable to the acquisitions, including acquisition related expenses of $\n8.5\n million; 2) cost of sales related to the sale of acquired inventory marked up to fair value; 3) depreciation, depletion, amortization & accretion expense related to the mark up to fair value of acquired assets; 4) interest expense reflecting the new debt structure; and 5) tax effects of the business combination:\nin millions\n2024\n2023\nSupplemental Pro Forma Results\nTotal revenues\n$\n7,810.2\n \n$\n8,188.9\n \nNet earnings attributable to Vulcan\n818.2\n \n835.9\n \nThe unaudited pro forma results above may not be indicative of the results that would have been obtained had these acquisitions occurred at the beginning of 2023, nor does it intend to be a projection of future results.\nThese acquisitions are reported in our consolidated financial statements as of their respective acquisition dates. \nThe fair value of consideration transferred for the Wake Stone and Superior acquisitions and the preliminary amounts (pending final appraisals of intangible assets and property, plant & equipment as well as working capital adjustments) of assets acquired and liabilities assumed are summarized below:\nin millions\nDecember 31\n2024\nFair Value of Purchase Consideration\nCash\n$\n2,059.8\n \nPayable to seller\n30.9\n \nTotal fair value of purchase consideration\n$\n2,090.7\n \nIdentifiable Assets Acquired and Liabilities Assumed\nInventories\n$\n28.5\n \nProperty, plant & equipment\n1,918.2\n \nIdentifiable intangible assets\n275.5\n \nOther assets\n60.5\n \nAsset retirement obligations\n(\n41.5\n)\nDeferred tax liabilities\n(\n311.2\n)\nOther liabilities\n(\n173.7\n)\nNet identifiable assets acquired\n$\n1,756.3\n \nGoodwill\n$\n334.4\n \nAs a collective result of the Wake Stone and Superior acquisitions, as well as other immaterial acquisitions completed in 2024, we recognized $\n306.4\n million of amortizable intangible assets and $\n343.0\n million of goodwill. The amortizable intangible assets will be amortized against earnings over a weighted-average of approximately \n20\n years and will be deductible for income tax purposes over \n15\n years. The $\n343.0\n million of goodwill primarily represents deferred tax liabilities generated from carrying over the seller's tax basis in the assets acquired as well as synergies expected to be realized from acquiring established businesses with assets that have been assembled over a long period of time; the collection of those assets combined with our assets can earn a higher rate of return than either individually. Of the total goodwill recognized, $\n31.8\n million will be deductible for income tax purposes.\n2023 BUSINESS ACQUISITIONS — During 2023, we completed \nno\n business acquisitions.\n2022 BUSINESS ACQUISITIONS — During 2022, including adjustments made in 2023, we purchased the following operations for total consideration of $\n593.7\n million\n \n($\n528.3\n million cash and $\n65.4\n million noncash):\n▪\nCalifornia — aggregates, asphalt mix and ready-mixed concrete operations\n▪\nTexas — aggregates operations\n▪\nVirginia — ready-mixed concrete operations\n▪\nHonduras — an aggregates operation serving limited markets along the Gulf Coast\nPart II\n109\nDIVESTITURES AND PENDING DIVESTITURES\nIn 2024, we sold:\n▪\nFourth quarter — real estate associated with a former sales yard in Virginia resulting in a pretax gain of $\n36.7\n million\nIn 2023, we sold:\n▪\nFourth quarter — concrete operations in Texas resulting in a third quarter impairment charge of $\n28.3\n million and a fourth quarter loss on sale of $\n13.8\n million (the assets were written down to fair value less cost to sell in the third quarter)\n▪\nFourth quarter — excess real estate in Virginia resulting in a pretax gain of $\n65.7\n million\n▪\nSecond quarter — real estate associated with a former recycled concrete facility in Illinois resulting in a pretax gain of $\n15.2\n million\nIn 2022, we sold:\n▪\nFourth quarter — concrete operations in New Jersey, New York and Pennsylvania resulting in a third quarter impairment charge of $\n67.8\n million and a fourth quarter loss on sale of $\n17.4\n million (the assets were written down to fair value less cost to sell in the third quarter)\n▪\nThird quarter — excess real estate in Southern California resulting in a pretax gain of $\n23.5\n million\nNo\n material assets met the criteria for held for sale at December 31, 2024, 2023 or 2022.\nPart II\n110\nITEM 9\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A\nCONTROLS AND PROCEDURES\nDISCLOSURE CONTROLS AND PROCEDURES\nWe maintain a system of controls and procedures designed to ensure that information required to be disclosed in reports we file with the SEC is recorded, processed, summarized and reported within the time periods specified by the SEC's rules and forms. These disclosure controls and procedures (as defined in the Securities Exchange Act of 1934 Rules 13a - 15(e) or 15d - 15(e)), include, without limitation, controls and procedures designed to ensure that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure. Our Chief Executive Officer and Chief Financial Officer, with the participation of other management officials, evaluated the effectiveness of the design and operation of the disclosure controls and procedures as of December 31, 2024. Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of December 31, 2024.\nWe completed the implementation of our quote to invoice system for our aggregates and asphalt operations in the third quarter of 2024. Excluding the acquisitions of Wake Stone and Superior noted below, no other changes were made during the fourth quarter of 2024 to our internal controls over financial reporting, nor have there been other factors that materially affect these controls.\nMANAGEMENT'S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is responsible for establishing and maintaining an adequate system of internal control over financial reporting as required by the Sarbanes-Oxley Act of 2002 and as defined in Securities Exchange Act Rule 13a-15(f).\nUnder management's supervision, an evaluation of the design and effectiveness of our internal control over financial reporting was conducted based on the framework in \nInternal Control\n — \nIntegrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, management concluded that our internal control over financial reporting was effective as of December 31, 2024.\nWe completed our acquisitions of Wake Stone on November 8, 2024 and Superior on December 20, 2024 and have not yet included either company in management's assessment of the effectiveness of our internal control over financial reporting. We are currently integrating both companies into our operations and internal control processes. Accordingly, pursuant to the SEC's general guidance that an assessment of a recently acquired business may be omitted from the scope of an assessment for one year following the acquisition, the scope of management's assessment of the effectiveness of our disclosure controls and procedures does not include Wake Stone or Superior. Wake Stone and Superior combined constituted approximately 13.7% of our total assets as of December 31, 2024 and approximately 0.2% of our total revenues for the year ended December 31, 2024.\nDeloitte & Touche LLP, an independent registered public accounting firm, as auditors of our consolidated financial statements, has issued an attestation report on the effectiveness of our internal control over financial reporting as of December 31, 2024. Deloitte & Touche LLP's report, which expresses an unqualified opinion on the effectiveness of our internal control over financial reporting, follows this report.\nINHERENT LIMITATIONS ON EFFECTIVENESS OF CONTROLS\nManagement does not expect that our disclosure controls and procedures or our internal controls over financial reporting will prevent or detect all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control system’s objectives will be met. The design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Further, because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, have been detected.\nPart II\n111\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM – INTERNAL CONTROL OVER FINANCIAL REPORTING\nTo the shareholders and the Board of Directors of Vulcan Materials Company:\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Vulcan Materials Company and subsidiaries (the “Company”) as of December 31, 2024, based on criteria established in \nInternal Control\n — \nIntegrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control\n — \nIntegrated Framework (2013)\n issued by COSO. \nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2024 of the Company and our report dated February 20, 2025, expressed an unqualified opinion on those financial statements.\nAs described in Item 9A, Disclosure Controls and Procedures, management excluded from its assessment the internal control over financial reporting at Wake Stone Corporation (“Wake Stone”) and Superior Ready Mix Concrete, L.P. (“Superior”), which were acquired by Vulcan Materials Company on November 8, 2024 and December 20, 2024, respectively, and whose combined financial statements constitute 13.7% of total assets as of December 31, 2024, and approximately 0.2% of total revenues for the year ended December 31, 2024. Accordingly, our audit did not include the internal control over financial reporting at Superior and Wake Stone.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of the effectiveness to future periods are subject to the risk that the controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ DELOITTE & TOUCHE LLP\nBirmingham, Alabama\nFebruary 20, 2025\nPart II\n112\nITEM 9B\nOTHER INFORMATION\nSECURITIES TRADING PLANS OF SECTION 16 OFFICERS AND DIRECTORS\nDuring the three months ended December 31, 2024, none of our Section 16 officers or directors \nadopted\n or \nterminated\n a Rule 10b5-1 or non-Rule 10b5-1 trading arrangement as defined in Item 408(a) of Regulation S-K.\nITEM 9C\nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPart II\n113\nPART III\nITEM 10\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOn or about March 24, 2025, we expect to file a definitive proxy statement with the Securities and Exchange Commission pursuant to Regulation 14A (our “2025 Proxy Statement”). The information under the headings “Proposal 1 - Election of Directors,” “Corporate Governance – Policies,” “Corporate Governance – Director Nomination Process,” “Corporate Governance – Committees of the Board of Directors” and “Delinquent Section 16(a) Reports” (to the extent reported therein) included in our 2025 Proxy Statement is incorporated herein by reference. See also the information about our executive officers and governance policies set forth above in Part I of this report.\nITEM 11\nEXECUTIVE COMPENSATION\nThe information under the headings “Compensation Discussion and Analysis,” “Director Compensation,” “Executive Compensation,” “Corporate Governance – Compensation Committee Interlocks and Insider Participation,” and “Compensation Committee Report” included in our 2025 Proxy Statement is incorporated herein by reference.\nITEM 12\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED\nSTOCKHOLDER MATTERS\nThe information under the headings “Security Ownership of Certain Beneficial Owners and Management” and “Equity Compensation Plans” included in our 2025 Proxy Statement is incorporated herein by reference.\nITEM 13\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information under the headings “Corporate Governance – Director Independence” and “Corporate Governance – Transactions with Related Persons” included in our 2025 Proxy Statement is incorporated herein by reference.\nITEM 14\nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information under the heading “Independent Registered Public Accounting Firm” included in our 2025 Proxy Statement is incorporated herein by reference.\nPart III\n114\nPART IV\nITEM 15\nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) (1) Financial statements\nThe following financial statements are included herein on the pages shown below:\nPage in Report\nReport of Independent Registered Public Accounting Firm (PCAOB ID \n34\n)\n62\n – \n63\nConsolidated Statements of Comprehensive Income\n64\nConsolidated Balance Sheets\n65\nConsolidated Statements of Cash Flows\n66\nConsolidated Statements of Equity\n67\nNotes to Consolidated Financial Statements\n68\n – \n110\n(a) (2) Financial statement schedules\nFinancial statement schedules are omitted because of the absence of conditions under which they are required or because the required information is provided in the financial statements or notes thereto.\nFinancial statements (and summarized financial information) of 50% or less owned entities accounted for by the equity method have been omitted because they do not, considered individually or in the aggregate, constitute a significant subsidiary.\n(a) (3) Exhibits\nExhibit 3(a)\nCertificate of Incorporation (Restated 2007) of the Company (formerly known as Virginia Holdco, Inc.), filed as Exhibit 3.1 to the Company’s Current Report on Form 8-K on November 16, 2007\n \n1\nExhibit 3(b)\nAmended and Restated By-Laws of the Company (as amended through December 9, 2022) filed as Exhibit 3.1 to the Company’s Current Report on Form 8-K filed on December 12, 2022 \n1\nExhibit 4(a)\nSenior Debt Indenture, dated as of December 11, 2007, between the Company and Wilmington Trust Company, as Trustee, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K on December 11, 2007\n \n1\nExhibit 4(b)\nFirst Supplemental Indenture, dated as of December 11, 2007, between Vulcan Materials Company and Wilmington Trust Company, as Trustee, to that certain Senior Debt Indenture, dated as of December 11, 2007, between the Company and Wilmington Trust Company, as Trustee, filed as Exhibit 4.2 to the Company’s Current Report on Form 8-K on December 11, 2007\n \n1\nExhibit 4(c)\nFifth Supplemental Indenture, dated March 30, 2015, between the Company and Regions Bank, as Trustee, filed as Exhibit 4.1 to the Company's Current Report on Form 8-K filed on March 30, 2015\n \n1\nExhibit 4(d)\nSixth Supplemental Indenture, dated March 14, 2017, between the Company and Regions Bank, as Trustee, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K filed on March 14, 2017\n \n1\nExhibit 4(e)\nSeventh Supplemental Indenture, dated as of June 15, 2017, between Vulcan Materials Company and Regions Bank, as Trustee, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K filed on June 15, 2017\n \n1\nExhibit 4(f)\nNinth Supplemental Indenture, dated as of May 18, 2020, between Vulcan Materials Company and Regions Bank as Trustee, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K filed on May 18, 2020\n \n1\nExhibit 4(g)\nTenth Supplemental Indenture, dated as of March 3, 2023, between Vulcan Materials Company and Regions Bank as Trustee, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K filed on March 3, 2023\n \n1\nExhibit 4(h)\nEleventh Supplemental Indenture, dated as of November 20, 2024, between Vulcan Materials Company and Regions Bank as Trustee, filed as Exhibit 4.1 to the Company's Current Report on Form 8-K filed on November 20, 2024\nExhibit 4(i)\nIndenture, dated as of February 23, 2018, between Vulcan Materials Company and Regions Bank, as Trustee, filed as Exhibit 4.1 to the Company’s Current Report on Form 8-K filed on February 26, 2018\n \n1\nPart IV\n115\nExhibit 4(j)\nDescription of Securities, filed as Exhibit 4(o) to the Company’s Annual Report on Form 10-K filed on February 24, 2023\n \n1\nExhibit 10(a)\nCredit Agreement, dated as of September 10, 2020, among Vulcan Materials Company, Truist Bank, as Administrative Agent, and the Lenders and other parties named therein, filed as Exhibit 10.1 to the Company’s Current Report on Form 8-K filed on September 11, 2020\n \n1\nExhibit 10(b)\nFirst Amendment to Credit Agreement, dated June 30, 2021, among Vulcan Materials Company, Truist Bank, as Administrative Agent, and the Lenders and other parties named therein, filed as Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed on August 5, 2021\n \n1\nExhibit 10(c)\nSecond Amendment to Credit Agreement, dated August 16, 2021, by and between Vulcan Materials Company and Truist Bank, as Administrative Agent, filed as Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed on November 5, 2021\n \n1\nExhibit 10(d)\nThird Amendment to Credit Agreement, dated March 18, 2022, by and between Vulcan Materials Company and Truist Bank, as Administrative Agent, filed as Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed on May 5, 2022\n \n1\nExhibit 10(e)\nFourth Amendment to Credit Agreement, dated as of August 8, 2022, among Vulcan Materials Company, Truist Bank, as Administrative Agent, and the Lenders and other parties named therein, filed as Exhibit 10.1 to the Company’s Current Report on Form 8-K filed on August 9, 2022\n \n1\nExhibit 10(f)\nFifth Amendment to Credit Agreement, dated as of November 4, 2024, among Vulcan Mat\nerials Company, Truist Bank, as Administrative Agent, and the Revolving Credit Lenders and other parties named therein, filed as Exhibit 10.2 to the Company's Current Report on \nForm 8-K filed on November 4, 2024\nExhibit 10(g)\nUnfunded Supplemental Benefit Plan for Salaried Employees, as amended, filed as Exhibit 10.4 to the Company’s Current Report on Form 8-K filed on December 17, 2008\n \n1\n,2\nExhibit 10(h)\nAmendment No. 1 to the Unfunded Supplemental Benefit Plan for Salaried Employees filed as Exhibit 10.1 to the Company’s Current Report on Form 8-K on January 7, 2014\n \n1\n,2\nExhibit 10(i)\nDeferred Compensation Plan for Directors Who Are Not Employees of the Company, as amended, filed as Exhibit 10.5 to the Company’s Current Report on Form 8-K filed on December 17, 2008\n \n1\n,2\nExhibit 10(j)\nExecutive Deferred Compensation Plan, as amended, filed as Exhibit 10.1 to the Company's Current Report on Form 8-K filed on December 17, 2008\n \n1,2\nExhibit 10(k)\nForm of Change of Control Employment Agreement dated January 1, 2016, filed as Exhibit 10.1 to the Company's Current Report on Form 8-K filed on January 7, 2016\n \n1,2\nExhibit 10(l)\nV\nulcan Materials Company Change of Control Severance Plan for Senior Officers, effective January 1, 2016, filed as Exhibit 10(m) to the Comp\nany's Annual Report on Form 10-K filed on February 25, \n \n20\n16\n \n1,2\nExhibit 10(m)\nExecutive Incentive Plan of the Company, as amended, filed as Exhibit 10.2 to the Company's Current Report on Form 8-K filed on December 17, 2008\n \n1,2\nExhibit 10(n)\nVulcan Materials Company 2016 Omnibus Long-Term Incentive Plan, filed as Exhibit 99 to the Company’s Registration Statement on Form S-8 (File No. 333-211349) filed on May 13, 2016\n \n1,2\nExhibit 10(o)\nForm of Non-Employee Director Deferred Stock Unit Agreement under the Vulcan Materials Company 2016 Omnibus Long-Term Incentive Plan, filed as Exhibit 10(y) to the Company’s Quarterly Report on Form 10-Q filed on August 3, 2016\n \n1,2\nExhibit 10(p)\nForm of Stock-Only Stock Appreciation Rights Award Agreement under the Vulcan Materials Company 2016 Omnibus Long-Term Incentive Plan, filed as Exhibit 10(z) to the Company’s Quarterly Report on Form 10-Q filed on August 3, 2016\n \n1,2\nExhibit 10(q)\nForm of Restricted Stock Unit Award Agreement under the Vulcan Materials Company 2016 Omnibus Long-Term Incentive Plan, filed as Exhibit 10(aa) to the Company’s Quarterly Report on Form 10-Q filed on August 3, 2016\n \n1,2\nExhibit 10(r)\nForm of Performance Share Unit Award Agreement under the Vulcan Materials Company 2016 Omnibus Long-Term Incentive Plan, filed as Exhibit 10(bb) to the Company’s Quarterly Report on Form 10-Q filed on August 3, 2016\n \n1,2\nPart IV\n116\nExhibit 10(s)\nForm of Performance Share Unit Award Agreement (2019) under the Vulcan Materials Company 2016 Omnibus Long-Term Incentive Plan, filed as Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed on May 3, 2019\n \n1,2\nExhibit 10(t)\nForm of Performance Share Unit Award Agreement (2020) under the Vulcan Materials Company 2016 Omnibus Long-Term Incentive Plan, filed as Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q filed on May 6, 2020\n \n1,2\nExhibit 10(u)\nForm of Stock-Only Appreciation Rights Award Agreement (2020) under the Vulcan Materials Company 2016 Omnibus Long-Term Incentive Plan, filed as Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q filed on May 6, 2020\n \n1,2\nExhibit 10(v)\nForm of Restricted Stock Unit Award Agreement (2020) under the Vulcan Materials Company 2016 Omnibus Long-Term Incentive Plan, filed as Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed on May 6, 2020\n \n1,2\nExhibit 10(w)\nForm of Non-Employee Director Restricted Stock Unit Award Agreement under the Vulcan Materials Company 2016 Omnibus Long-Term Incentive Plan filed as Exhibit 10.3 to the Company’s Quarterly Report on Form 10-Q filed on August 5, 2020\n \n1,2\nExhibit 19\nInsider Trading Policy\nExhibit 21\nList of the Company's material subsidiaries as of \nDecember 31, 2024\nExhibit 23\nConsent of Deloitte & Touche LLP, Independent Registered Public Accounting Firm\nExhibit 24\nPowers of Attorney\nExhibit 31(a)\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nExhibit 31(b)\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nExhibit 32(a)\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nExhibit 32(b)\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nExhibit 95\nMSHA Citations and Litigation\nExhibit 97\nClawback Policy, filed as Exhibit 97 to the Company's Annual Report on Form 10-K filed on February 22, 2024\n \n1\nExhibit 101\nThe following financial information from this Annual Report on Form 10-K for the year ended December 31, 2024 are formatted in iXBRL (Inline eXtensible Business Reporting Language): (i) the Consolidated Statements of Comprehensive Income, (ii) the Consolidated Balance Sheets, (iii) the Consolidated Statements of Cash Flows, (iv) the Consolidated Statements of Equity and (v) the Notes to Consolidated Financial Statements\nExhibit 104\nCover Page Interactive Data File – the cover page from this Annual Report on Form 10-K for the year ended December 31, 2024 is formatted in iXBRL (contained in Exhibit 101)\n1\nIncorporated by reference.\n2\nManagement contract or compensatory plan.\nOur SEC file number for documents filed with the SEC pursuant to the Securities Exchange Act of 1934, as amended, is 001-33841.\nITEM 16\nFORM 10-K SUMMARY\nWe have chosen not to include an optional summary of the information required by this Form 10-K.\nPart IV\n117\n \nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on February 20, 2025.\nVULCAN MATERIALS COMPANY\n/s/ J. Thomas Hill\nJ. Thomas Hill\nChairman and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ J. Thomas Hill\nChairman and Chief Executive Officer\n(Principal Executive Officer)\nFebruary 20, 2025\n/s/ Mary Andrews Carlisle\nSenior Vice President and Chief Financial Officer\n(Principal Financial Officer)\nFebruary 20, 2025\n/s/ Randy L. Pigg\nVice President, Controller\n(Principal Accounting Officer)\nFebruary 20, 2025\n/s/ Melissa H. Anderson\nDirector\nFebruary 20, 2025\n/s/ Thomas A. Fanning\nDirector\nFebruary 20, 2025\n/s/ O. B. Grayson Hall, Jr.\nDirector\nFebruary 20, 2025\n/s/ Cynthia L. Hostetler\nDirector\nFebruary 20, 2025\n/s/ Lydia H. Kennard\nDirector\nFebruary 20, 2025\n/s/ Richard T. O'Brien\nDirector\nFebruary 20, 2025\n/s/ James T. Prokopanko\nDirector\nFebruary 20, 2025\n/s/ Kathleen L. Quirk\nDirector\nFebruary 20, 2025\n/s/ David P. Steiner\nDirector\nFebruary 20, 2025\n/s/ Lee J. Styslinger, III\nDirector\nFebruary 20, 2025\n/s/ George Willis\nDirector\nFebruary 20, 2025\n/s/ Denson N. Franklin III\nAttorney-in-Fact\nFebruary 20, 2025\nPart IV\n118"
  }
}