{
  "ticker": "VRSN",
  "cik": "0001014473",
  "company_name": "VERISIGN INC/CA",
  "filing_date": "2025-02-13",
  "accession": "0001014473-25-000006",
  "primary_doc": "vrsn-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.\n    \nBUSINESS \nOverview \n \nWe are a global provider of critical internet infrastructure and domain name registry services, enabling internet navigation for many of the world’s most recognized domain names. We help enable the security, stability, and resiliency of the Domain Name System (“DNS”) and the internet by providing Root Zone Maintainer services, operating two of the thirteen global internet root servers, and providing registration services and authoritative resolution for the .\ncom\n and .\nnet\n top-level domains (“TLDs”), which support the majority of global e-commerce. \nWe were incorporated in Delaware on April 12, 1995. Our principal executive offices are located at 12061 Bluemont Way, Reston, Virginia 20190. Our telephone number at that address is (703) 948-3200. Our common stock is traded on the Nasdaq Global Select Market under the ticker symbol VRSN. VERISIGN, the VERISIGN logo, and certain other product or service names are registered or unregistered trademarks in the U.S. and other countries. Other names used in this Form 10-K may be trademarks of their respective owners. Our primary website is \nhttps://www.verisign.com\n. The information available on, or accessible through, this website is not incorporated in this Form 10-K by reference.\nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), are available, free of charge, on the Investor Relations section of our website as soon as is reasonably practicable after filing such reports with the Securities and Exchange Commission (the “SEC”). The SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at \nhttps://www.sec.gov\n.\nPursuant to our agreements with the Internet Corporation for Assigned Names and Numbers (“ICANN”), we make available files containing all active domain names registered in the .\ncom \nand .\nnet \nregistries. Further, we also make available a summary of the active zone count registered in the .\ncom\n and \n.net\n registries and the number of \n.com\n and \n.net\n domain name registrations in the domain name base. The zone counts and information on how to obtain access to the zone files can be found at \nhttps://www.verisign.com/zone\n. The domain name base is the active zone plus the number of domain names that are registered but not configured for use in the respective top-level domain zone file plus the number of domain names that are in a client or server hold status. The domain name base may also reflect compensated or uncompensated judicial or administrative actions to keep in or remove from the active zone an immaterial number of domain names. These files and the related summary data are updated at least once per day. The update times may vary each day. The number of domain names provided in this Form 10-K are as of midnight of the date reported. \nWe announce material financial information to our investors using our investor relations website \nhttps://investor.verisign.com\n, SEC filings, investor events, news and earnings releases, public conference calls and webcasts. We use these channels as well as social media to communicate with our investors and the public about our company, our products and services, and other issues. It is possible that the information we post on social media could be deemed to be material information. Therefore, we encourage investors, the media, and others interested in our company to review the information we post on the social media channels and websites listed below. This list may be updated from time to time on our investor relations website.\nhttps://verisign.com\nhttps://blog.verisign.com\nhttps://facebook.com/verisign\nhttps://x.com/verisign\nhttps://linkedin.com/company/verisign\nhttps://youTube.com/user/verisign\nhttps://dnib.com\nThe contents of these websites are not intended to be incorporated by reference into this Form 10-K or in any other report or document we file.\nServices \nWe operate the authoritative directory, for all \n.com, .net, \nand\n .name\n domain names (generic top-level domains, “gTLDs”), as well as for certain transliterations of .\ncom\n and .\nnet\n in a number of different native languages and scripts (internationalized generic top-level domains, “IDN gTLDs”). We also operate the authoritative directory for all .\ncc\n domain names (country code top-level domain, or “ccTLD”). We operate the technical or back-end systems for .\nedu\n and certain other gTLDs. As the registry \n3\nTable of Contents\nor service provider for these top-level domains, our services allow individuals and organizations to establish their online identities, while providing the secure, always-on access they need to communicate and transact reliably with online audiences. \n \nWe operate the \n.com, .net,\n and \n.name \ngTLDs and the IDN gTLDs under registry agreements with ICANN and also, with respect to the \n.com\n gTLD, a Cooperative Agreement with the U.S. Department of Commerce (“DOC”). We operate the .\ncc\n ccTLD under an agreement with Cocos (Keeling) Islands. Under separate agreements, we provide technical or back-end services for .\nedu\n and for certain other gTLDs.\nWe also perform the Root Zone Maintainer function under an agreement with ICANN for the core of the internet’s DNS and operate two of the thirteen root zone servers that contain authoritative data for the top of the DNS hierarchy.\nOur global constellation of DNS servers provides internet protocol (“IP”) address information in response to queries, enabling the use of browsers, email systems, and other systems on the internet. In addition, we own and maintain our shared registration system that allows registrars to enter new second-level domain names into Verisign-operated central directories and to submit modifications, transfers, re-registrations, and deletions for existing second-level domain names (“Shared Registration System”). \nDomain names in the registries we operate can be registered for between one and 10 years. Unlike other gTLDs, the prices we charge for \n.com\n, \n.net \nand\n .name \ndomain name registrations\n \nare subject to restrictions in our agreements with ICANN and our prices may be increased only according to those restrictions. Retail pricing for these domain name registrations is established by registrars. For \n.com\n domain name registrations, we pay ICANN on a quarterly basis $0.2575 for each annual domain name registration and a fixed fee of $6,250. For \n.name \ndomain name registrations, we pay ICANN on a quarterly basis $0.25 for each annual domain name registration. For \n.net \ndomain name registrations, we remit to ICANN a $0.75 fee per annual domain name registration that is collected from registrars.\nRevenues for \n.cc\n domain names and our IDN gTLDs are based on prices that are not subject to the same pricing restrictions as those for the .\ncom\n, .\nnet\n and .\nname \ngTLDs. The fees for our performance of technical or back-end services for \n.edu\n and certain other gTLDs are based on the terms of our agreements with those respective businesses\n. \n \nOperations Infrastructure \nOur main operations infrastructure consists of secure data centers in Dulles, Virginia; Ashburn, Virginia; and New Castle, Delaware; as well as more than 200 other points of presence around the world. Our domain name servers refer requestors to the associated authoritative name servers for second level domains in the registries we operate or support, thus enabling DNS resolution for \n.com\n and \n.net\n domain names and for domain names in the other registries that we operate, or for which we provide technical or back-end services. Our servers process hundreds of billions of transactions daily. Our operations infrastructure operates continuously, supporting the security, integrity and availability of our services, which are critical for our business and internet users. The performance and availability of our infrastructure are critical for our business. Key features of our operations infrastructure include: \n \n•\nDistributed Servers:  \nWe operate a large number of high-speed servers globally to support localized transaction volume and performance demands. In conjunction with our proprietary software, processes and procedures, this purpose-built global constellation of servers offers rapid failover, global and local load balancing, and threshold monitoring on critical servers. \n \n•\nNetworking:  \nWe deploy and maintain a redundant and diverse global network, maintain high-speed, redundant connections to numerous internet service providers, and maintain network interconnection relationships globally to ensure that our critical services are readily accessible to end users. \n \n•\nSecurity and Availability:  \nWe incorporate architectural concepts such as protected domains, restricted nodes, and distributed access control in our system architecture. In addition, we employ firewalls and intrusion detection software, endpoint and network detection and response systems as well as proprietary security mechanisms at many points across our infrastructure. We perform continuous internal vulnerability testing and periodic controls audits, and also contract with third-party security organizations to perform periodic penetration tests and security risk assessments on our systems. We have engineered resiliency and diversity into how we host classes of products throughout our set of interconnected sites to reduce the risk of unknown vendor defects and zero-day security vulnerabilities. \n•\nData Integrity:  \nWe use several proprietary systemic integrity checks and validations to ensure data correctness when updating and publishing the DNS records for the registries we operate. \n \nWe continuously seek to enhance our infrastructure and capabilities to support both normal and peak system load plus attack volumes based on historical experience, as well as to address projected internet attack trends.\n4\nTable of Contents\n \nCall Centers and Service Desk:  \nWe provide customer support services over the phone, by email and through web-based self-help systems. Our support teams are staffed with trained technical customer support personnel. Support is available for customers 24 hours a day. \n \nOperations Support and Monitoring:  \nThrough our network operations center, we have an extensive monitoring capability that enables us to track the status and performance of our critical systems, network and services. Our network operations center monitors our systems continuously. \n \nDisaster Recovery Plans:  \nWe have disaster recovery and business continuity capabilities that are designed to deal with the loss of entire data centers and other facilities. We maintain data centers with mirrored services that allow failover with no data loss and no loss of function or capacity. Our critical data services (including domain name registration) use advanced storage systems and techniques such as synchronous mirroring and remote replication to our global resolution sites to provide data protection. We periodically operate services at alternate data centers during maintenance windows to ensure the availability of our data centers for disaster recovery.\nMarketing, Sales and Distribution \nWe seek to expand our business through focused marketing campaigns and programs that target growth in \n.com\n,\n .net\n and \n.cc \ndomain names, both domestically and internationally through our registrars. We provide tools to be used by both registrars and end users to enable them to find relevant domain names. We have marketing and sales offices and account management teams in several countries around the world.\nResearch and Development \nWe believe that timely development of new and enhanced capabilities for our DNS registration and resolution infrastructure and of new and enhanced ways to ensure the security, stability, and resiliency of our services, are vital to protect our business in an ever-increasing cyberthreat environment, to adapt to evolving internet protocols and standards, and to remain competitive in the marketplace. We also invest in R&D that benefits the DNS and internet community in which we operate more broadly. \nOur future success will depend, in large part, on our ability to continue to maintain and enhance our current technologies and services and to develop new ones. We actively investigate and incubate new concepts and evaluate new business ideas through our innovation pipeline. We expect that most of the future enhancements to our existing services and our new services will be the result of internal development efforts in collaboration with suppliers, other vendors, customers, and the technology community. Under certain circumstances, we may also acquire or license technology from third parties. \nCompetition\nWe face competition in the domain name registry space from other gTLD and ccTLD registries that are competing for the business of entities and individuals that are seeking to obtain a domain name registration. In addition to the registries we operate or for which we provide technical or back-end services, there are numerous other operational gTLD registries, ASCII ccTLD registries, IDN ccTLD registries, and IDN gTLD registries. Under our agreements with ICANN, we are subject to certain restrictions in the operation of \n.com\n, \n.net\n and \n.name\n on pricing, bundling, marketing, methods of distribution, introduction of new registry services, and use of registrars, that do not apply to ccTLDs and other gTLDs and therefore may create a competitive disadvantage. Among our competitors operating gTLD and ccTLD registries are China Internet Network Information Center (CNNIC), DENIC eG, Nominet, Identity Digital, Public Interest Registry (PIR),\n \nCentralNic, Google, .xyz, GoDaddy, and Radix.\nDemand for domain names could be negatively impacted to the extent end-users establish their online identities using social media (such as Facebook, Instagram or Tiktok) or transact business on e-commerce platforms (such as Amazon, Etsy and Taobao) instead of registering domain names. Furthermore, demand for domain names could also be negatively impacted by the activities of providers of web and mobile applications that allow end-users to locate and access content.\nAlternative namespaces, new technologies and the expansion of existing technologies may increase competitive pressure. Our industry is characterized by collaborative relationships involving our competitors. In the past, certain of our competitors have consolidated or vertically integrated. Our ability to participate and benefit from such collaborative arrangements or consolidations may be limited and such collaborative arrangements and consolidations could harm our competitive position and adversely impact our business.\n5\nTable of Contents\nIndustry Regulation \nThe DNS is governed under a multi-stakeholder model comprised of civil society, the private sector, including for-profit and not-for-profit organizations such as ICANN, governments, including the U.S. government, academia, non-governmental organizations, and international organizations. ICANN plays a central coordination role in this bottom-up multi-stakeholder system. ICANN is mandated through its bylaws to uphold a private sector-led multi-stakeholder approach to internet governance for the public benefit. ICANN’s multi-stakeholder policy development processes have created, and will continue to create, policies, programs, and standards that directly or indirectly impact our business. Certain policies can be adopted as Consensus or Temporary Policies, which we are obligated to follow under our agreements with ICANN.\nWe are also subject to country-level laws and regulations in the United States and in international locations. In China, we are required to maintain licenses for .\ncom,\n .\nnet, \nand \n.cc\n under regulations issued by the Ministry of Industry and Information Technology. Additionally, in many jurisdictions in which we operate, including California, the European Union, the United Kingdom, China and elsewhere, strict data security and data privacy regulations have been, or are being, adopted. Because we do not possess extensive personal registrant information, we have not yet experienced significant impacts from these regulations. However, compliance costs and other business impacts could become significant if we begin to receive personal registrant information in our .\ncom\n and .\nnet\n gTLDs. Other regulations, or changes to regulations, including those related to cybersecurity, may also significantly impact our business operations.\n \n.com Generic\n \nTop-Level Domain\nOur operation of the .\ncom\n gTLD is subject to the terms of a registry agreement with ICANN (as amended, the “.\ncom\n Registry Agreement”). The current term of the \n.com\n Registry Agreement is six years and must be renewed or extended by November 30, 2030. Although the \n.com\n Registry Agreement contains a “presumptive” right of renewal, ICANN could terminate or refuse to renew the Registry Agreement in certain prescribed circumstances. See “Risk Factors - Any loss or modification of our right to operate the .\ncom\n and .\nnet\n gTLDs could have a material adverse impact on our business and result in loss of revenues.” in Part I,",
    "item1a": "Item 1A of this Form 10-K.\nOur cybersecurity program leverages the NIST Cybersecurity Framework to help protect the Company’s operations, information, production systems and networks from threats through cybersecurity practices, programs and tools that establish defenses in depth. The cybersecurity program includes, among other items, vulnerability and patch management, segmentation, identity and access management, application of zero-trust principles, automated ingestion of multi-source threat intelligence, end point and network detection/response, application security, secure configurations for operating systems and databases, continuous security monitoring and 24/7 security operations. \nThe program has dedicated business resilience, insider threat and governance, risk and compliance (“GRC”) functions that report to our Chief Information Security Officer (“CISO”). Incident management is governed by our Incident Response Plan that assigns incident command and control parameters and escalation protocols to management and the Board of Directors.\n \nOur cybersecurity program also focuses on risks from the use of third-party services. Our GRC team assesses the cybersecurity practices of current and prospective service providers for compliance \n19\nwith our requirements, and our procurement functions seek terms and conditions, including by example, audit rights and vulnerability or breach disclosure obligations, to enhance our defenses against supply chain risks.\n \nOur cybersecurity program incorporates several control and best practice regimes, including for example, the Center for Internet Security (“CIS”) controls. We conduct regular internal and external assessments, audits, and tabletop exercises to assess security vulnerabilities, control compliance and incident preparedness. These assessments and exercises include red team exercises simulating external attacks, threat and vulnerability assessments, ransomware, application, and secure image testing, crisis management exercises, including incident response, and internal audit reviews. Management and the Board’s Cybersecurity Committee reviews the results of these exercises, audits and assessments. \nWe also actively engage with third parties, such as key vendors, auditors, consultants, industry participants, and intelligence and law enforcement communities as part of our continuing efforts to evaluate and enhance the effectiveness of our cybersecurity program.\n We monitor emerging data protection laws and cybersecurity and privacy regulatory requirements and implement changes to our standards and processes for continued compliance. Our cybersecurity program also includes employee and contractor training, which primarily consists of monthly educational videos, annual trainings and certifications, and phishing exercises.\nOur cybersecurity strategy and program are led by our \nExecutive Vice President of Technology and Chief Security Officer (“CSO”)\n, who reports to the CEO. \nOur CSO has over 25 years of experience in technology and cybersecurity leadership positions and has authored several security-related books and numerous patents, IP standards, and security research publications. He has served in various capacities on various technology working groups and standards setting organizations including the Internet Architecture Board and the Internet Engineering Task Force\n. Our CSO manages a converged security, engineering and operations organization that helps to ensure that cyber and other security priorities are appropriately integrated throughout technology and operations, as well as more broadly across the Company. Our CISO, Chief Information Officer (“CIO”), Chief Technology Officer (“CTO”) and the head of architecture and engineering report to our CSO.\n \nThese and other experienced employees lead the teams responsible for implementing various parts of our cybersecurity program.\nIn addition, a management-level Safety and Security Council (“Council”) chaired by our CEO and comprised of our CSO, General Counsel, and other senior officers, provides cross-functional coordination for the management of the Company’s security functions. The Council receives information, typically monthly, on the status of the cybersecurity program, initiatives, incidents, cybersecurity risks, assessments, and threats, among other items. The Chair of the Board’s Cybersecurity Committee is the Board’s liaison to the Council and attends the regular meetings of the Council.\nThe Cybersecurity Committee\n assists the Board with its oversight of the Company’s cybersecurity risks and our cybersecurity program.\n The Committee reviews our incident response plan, including escalation protocols, business continuity program plans, program budgets and resources, and our cybersecurity insurance program. The Committee also reviews and discusses the activities of the Council at each of its regularly scheduled meetings. The Committee operates pursuant to a written charter and calendar, each of which are reviewed on an annual basis. \nThe Cybersecurity Committee and the full Board receive quarterly status reports on the cybersecurity program from the CSO, addressing progress and updates on various cybersecurity functions and initiatives including, for example, compliance, assessments, security operations and incident response, business resilience, DDoS attacks, data privacy, technology and asset management, controls, and vulnerability management.",
    "item1b": "ITEM 1B.\n    \nUNRESOLVED STAFF COMMENTS \nNone.",
    "item1c": "ITEM 1C.\n    \nCYBERSECURITY \nOur cybersecurity program is designed and implemented to assess, identify, mitigate and manage risks from cybersecurity threats that may result in adverse effects on the integrity and availability of our production and information systems. Among other items, our cybersecurity program is comprised of policies, standards, plans and frameworks for information security, business resilience, insider threat mitigation, technology asset management, cyber risk management, incident response and procurement. Material risks from cybersecurity threats include, among other things, operational disruption, including failure to meet our service level agreements, loss or destruction of data, hardware or intellectual property, and cyber extortion through ransomware. \nThe management of cybersecurity risks, which involves significant and sustained resource commitments and management attention, is also integrated into the Company’s enterprise risk management program through formal processes that help identify and elevate the most serious risks, including those pertaining to cybersecurity, for management at the enterprise level and oversight at the Board level.\n \nFor more information on the Company’s cybersecurity risks and their possible impact on our business strategy, results of operations, or financial condition see “Risk Factors – Cybersecurity and Technology Risk Factors” in Part I,"
  }
}