{
  "ticker": "VRTX",
  "cik": "0000875320",
  "company_name": "VERTEX PHARMACEUTICALS INC / MA",
  "filing_date": "2025-02-13",
  "accession": "0000875320-25-000053",
  "primary_doc": "vrtx-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.\nBUSINESS\nOVERVIEW\nWe are a global biotechnology company that invests in scientific innovation to create transformative \nmedicines \nfor people with serious diseases, with a focus on specialty markets. We have seven approved medicines: five that treat the underlying cause of cystic fibrosis (“CF”), a life-threatening genetic disease, one that treats severe sickle cell disease (“SCD”) and transfusion dependent beta thalassemia (“TDT”), life shortening inherited blood disorders, and one that treats moderate-to-severe acute pain. Our clinical-stage pipeline includes programs in CF, SCD, beta thalassemia, acute and peripheral neuropathic pain, APOL1-mediated kidney disease, IgA nephropathy and other autoimmune renal diseases and cytopenias, type 1 diabetes, myotonic dystrophy type 1, and autosomal dominant polycystic kidney disease.\nOur goal in CF is to continue to extend our leadership by developing treatment regimens that will provide benefits to all people with CF. In December 2024, the U.S. Food and Drug Administration (the “FDA”) approved ALYFTREK (vanzacaftor/tezacaftor/deutivacaftor), our fifth medicine for people with CF. In addition to ALYFTREK, our marketed medicines that treat people with CF are TRIKAFTA/KAFTRIO (elexacaftor/tezacaftor/ivacaftor and ivacaftor), SYMDEKO/SYMKEVI (tezacaftor/ivacaftor and ivacaftor), ORKAMBI (lumacaftor/ivacaftor) and KALYDECO (ivacaftor). Collectively, our five marketed CF medicines are being used to treat nearly three quarters of the approximately 94,000 people with CF in the U.S., Europe, Australia, and Canada. \nThrough approval of new medicines, label expansions, and expanded reimbursement, we are focused on increasing the number of people with CF who are eligible and able to receive our medicines. We are evaluating our current medicines in additional patient populations, including younger children, with the goal of having small molecule treatments for all people who have at least one mutation in their cystic fibrosis transmembrane conductance regulator (“CFTR”) gene that is responsive to our CFTR modulators. In December 2024, the FDA approved the expanded use of TRIKAFTA for treatment of people with CF. With this approval, 94 additional non-F508del CFTR mutations have been added to the TRIKAFTA label. \nWe are evaluating VX-522, an investigational messenger ribonucleic acid (“mRNA”) therapeutic that we are developing in collaboration with Moderna, Inc. (“Moderna”) in a Phase 1/2 clinical trial in people with CF. The multiple ascending dose portion of the clinical trial is ongoing, and we expect to share data in the first half of 2025. VX-522 has the potential to benefit the more than 5,000 people with CF in the U.S., Canada, Europe and Australia who do not make full-length CFTR protein and therefore cannot benefit from CFTR modulators. In addition, \nwe are continuing our research and development of additional CFTR modulators, with the aim of developing best-in-class medicines that can help more patients achieve normal levels of CFTR function, and we are investigating additional potential treatments for people with CF who do not make full-length CFTR protein and cannot benefit from CFTR modulators. \nIn SCD and TDT, our goal is to\n eliminate vaso-occlusive crises (“VOCs”) (as well as vaso-occlusive organ damage) and transfusion dependence, respectively. Our marketed therapy is CASGEVY (exagamglogene autotemcel), an ex-vivo, non-viral CRISPR/Cas9 gene-edited cell therapy, which has been approved in the United States (“U.S.”), the European Union (“E.U.”), the United Kingdom (“U.K.”), the Kingdom of Saudi Arabia (“Saudi Arabia”), the Kingdom of Bahrain (“Bahrain”), the United Arab Emirates (the “UAE”), Canada and Switzerland for treatment of people 12 years of age and older with SCD or TDT. We estimate approximately 60,000 people with severe SCD or TDT are or could become eligible for CASGEVY in the U.S., Canada, Europe, Saudi Arabia and Bahrain. We are evaluating CASGEVY as a treatment for children 5 to 11 years of age with SCD or TDT in global Phase 3 clinical trials. We are progressing preclinical assets for gentler conditioning for CASGEVY, which could broaden the eligible patient population, and investigating small molecules for the potential treatment of SCD and TDT. \nIn January 2025, the FDA approved JOURNAVX (suzetrigine), our selective non-opioid NaV1.8 pain signal inhibitor, for the treatment of moderate-to-severe acute pain. We have begun our commercial launch of JOURNAVX in eligible adults in the U.S. In addition, we are enrolling and dosing patients in a Phase 3 clinical trial evaluating suzetrigine for the treatment of diabetic peripheral neuropathy, a common form of peripheral neuropathic pain. We are enrolling and dosing patients in two Phase 2 clinical trials evaluating VX-993, a next-generation selective NaV1.8 pain signal inhibitor, for the treatment of acute pain and for the treatment of diabetic peripheral neuropathy. In December 2024, we announced results from a Phase 2 clinical trial evaluating suzetrigine in people with lumbosacral radiculopathy (“LSR”). Treatment with suzetrigine \n1\ndemonstrated a statistically significant and clinically meaningful within-group reduction in pain and we plan to advance to pivotal development in LSR, pending discussions with regulators. \nThe following chart sets forth our approved products, clinical-stage programs, and select pre-clinical programs:\nBeyond CF, SCD, TDT and pain, we are advancing programs across multiple disease areas and modalities, including: \n•\nAPOL1-Mediated Kidney Disease. \nWe are evaluating inaxaplin, our small molecule for the treatment of APOL1-mediated kidney disease (“AMKD”)\n. We continue to enroll and dose people with AMKD in the Phase 3 portion of the global Phase 2/3 clinical trial.\n•\nIgA Nephropathy\n. We are developing povetacicept, a dual inhibitor of the B cell activating factor (“BAFF”) and a proliferation-inducing ligand (“APRIL”) pathways, as a potentially best-in-class approach to treat IgA nephropathy (“IgAN”), a serious progressive, autoimmune kidney disease that can lead to end-stage renal disease. We are enrolling and dosing patients in the Phase 3 clinical trial evaluating povetacicept in people with IgAN.\n•\nType 1 Diabetes. Z\nimislecel, formerly known as VX-880, is an allogeneic stem-cell derived, fully differentiated islet cell therapy in pivotal development for the treatment of type 1 diabetes (“T1D”). We expect to complete enrollment and dosing in the Phase 3 portion of this Phase 1/2/3 clinical trial in 2025. Our second clinical program in T1D, VX-264, in which zimislecel is encapsulated in an immunoprotective device, is ongoing. We are also pursuing alternative approaches to immunosuppression that could be used with zimislecel, as well as hypoimmune cells.\n•\nMyotonic Dystrophy Type 1. \nWe are exploring multiple approaches to address the underlying causal biology for myotonic dystrophy type 1 (“DM1”), including small molecules. We completed the single ascending dose portion of the global Phase 1/2 clinical trial evaluating VX-670, an oligonucleotide-based approach that we have in-licensed from Entrada Therapeutics, Inc. (“Entrada”). We are enrolling and dosing the multiple ascending dose portion of the trial, which will evaluate the safety and efficacy of VX-670.\n•\nAutosomal Dominant Polycystic Kidney Disease\n. We are nearing completion of a Phase 1 clinical trial in healthy volunteers evaluating VX-407, our first-in-class small molecule corrector that targets the underlying cause of autosomal dominant polycystic kidney disease (“ADPKD”) in people with a subset of variants in the PKD1 gene. We expect to advance VX-407 into a Phase 2 proof-of-concept study in people with ADPKD in 2025.\n•\nIn addition to the programs listed above, we have additional research programs aimed at diseases that fit our research and development strategy and follow-on programs in our existing disease areas in accord with our serial innovation approach.\n2\nOur core strategy is to discover and develop innovative medicines by combining transformative advances in the understanding of human disease and the science of therapeutics to dramatically advance human health. That strategy focuses on validated targets that address causal human biology, predictive lab assays and clinical biomarkers, rapid paths to registration and approval, and product candidates that hold the potential for transformative patient benefit. Our approach includes advancing multiple compounds or therapies from each program into early clinical trials to obtain patient data that can inform selection of the most promising therapies for later stage development as well as inform our ongoing discovery and development efforts. We aim to rapidly follow our first-in-class therapies that achieve proof-of-concept with potential best-in-class candidates. We plan to continue investing to advance our strategy, fostering scientific innovation by identifying additional product candidates through internal research efforts, and investing in business development transactions to access emerging technologies, products and product candidates. \nOur serial innovation approach is intended to increase the likelihood of successfully bringing transformative medicines to patients and to provide durable clinical and commercial success. Our CF medicines are the exemplar of this strategy, as we continue to reach more people with CF than ever before through approvals of new medicines, approvals in new geographies, label expansions, including for younger patients, and expanded reimbursement. In addition, we have diversified our business through the approvals for CASGEVY for the treatment of SCD and TDT and through the approval for JOURNAVX for the treatment of acute pain. We are working to ensure broad access for eligible patients with these conditions in all countries with regulatory approval. Within our clinical pipeline, we have rapidly progressed multiple programs into pivotal development during the last year. As we continue to invest in our serial innovation strategy, launch new products, advance our diverse pipeline, and expand geographically, we continue to maintain a strong financial profile.\n3\nMARKETED PRODUCTS\nInformation regarding our marketed products, including information regarding the disease area, initial approval and age group for which the therapy is approved, are set forth in the table below.\nDisease\nInitial Approval\nEligible Age Group\n(1)\nCystic Fibrosis\n2024\n6 years of age and older\n2019\n2 years of age and older\n2020\n2 years of age and older\n2018\n6 years of age and older\n2018\n6 years of age and older\n2015\n1 year of age and older\n2012\n1 month of age and older\nSickle Cell Disease and Transfusion-Dependent Beta Thalassemia\n2023\n12 years of age and older\nAcute Pain\n \n2025\nadults\n(1) \nSpecifies the youngest eligible age group in any major market. \nCF\nOur CF medicines are collectively being used by nearly three quarters of the approximately 94,000 people with CF in the U.S., Europe, Australia, and Canada. Additionally, we continue to secure formal reimbursement in multiple additional countries that collectively comprise approximately 15,000 additional people with CF. Approximately 10,000 of those additional people with CF are eligible for treatment with CFTR modulators. We previously served many of these markets through named patient sales.\n4\nCF is a life-shortening genetic disease caused by a defective or missing CFTR protein resulting from mutations in the CFTR gene. To develop CF, children must inherit two defective CFTR genes, which are referred to as alleles; one allele is inherited from each parent. The vast majority of patients with CF carry at least one F508del mutation. The F508del mutation results in a defect in the CFTR protein in which the CFTR protein does not reach the surface of the cells in sufficient quantities and does not adequately transport chloride ions. \nThe absence of working CFTR protein results in poor flow of salt and water into and out of cells in a number of organs, including the lungs. As a result, thick, sticky mucus builds up and blocks the passages in many organs, leading to a variety of symptoms. In particular, mucus builds up and clogs the airways in the lungs, causing chronic lung infections and progressive lung damage. CFTR potentiators, such as ivacaftor and deutivacaftor, increase the probability that the CFTR protein channels open on the cell surface, increasing the flow of salt and water into and out of the cell. CFTR correctors, such as lumacaftor, tezacaftor, elexacaftor and vanzacaftor, increase the proper protein processing and folding of mutant CFTR proteins, such that a larger amount of functional CFTR protein reaches the cell surface. Our CFTR regimens target the underlying cause of disease and have been shown to improve CFTR protein function in people with CF, and as such have been shown to provide transformative benefit for people living with CF. \nOur CF medicines are used by patients in over 60 countries, and TRIKAFTA/KAFTRIO is approved and reimbursed or accessible in more than 50 of these countries. We continue to increase the number of patients eligible and able to receive our current medicines through approvals of new medicines, label expansions and expanded reimbursement. In December 2024, the FDA approved the expanded use of TRIKAFTA for the treatment of people with CF 2 years of age and older who have at least one F508del mutation in the CFTR gene or a mutation that is responsive to TRIKAFTA based on clinical and/or in vitro data. With this approval, 94 additional non-F508del CFTR mutations have been added to the TRIKAFTA label.\nIn December 2024, the FDA approved ALYFTREK for the treatment of people with CF 6 years of age and older who have at least one F508del mutation or another mutation in the CFTR gene that is responsive to ALYFTREK. ALYFTREK is our next-in-class triple combination, which has the benefit of a once-daily dosing regimen and demonstrated non-inferiority to TRIKAFTA in ppFEV\n1\n, a measure of lung function, and an improvement in sweat chloride levels as compared to TRIKAFTA. ALYFTREK carries a lower royalty burden than our other approved CF medicines and is also approved for 31 additional mutations not responsive to other CFTR modulator therapies. \nSickle Cell Disease and Transfusion-Dependent Beta Thalassemia \nCASGEVY, our therapy for SCD and TDT, is approved in the U.S., the E.U., the U.K., Saudi Arabia, Bahrain, the UAE, Canada and Switzerland. SCD and TDT are hemoglobinopathies, a group of inherited blood disorders that result from gene mutations that alter hemoglobin, a protein in red blood cells that delivers oxygen throughout the body. We estimate approximately 60,000 people with severe SCD or TDT are or could become eligible for CASGEVY in the U.S., Canada, Europe, Saudi Arabia and Bahrain. \nSCD is caused by the change of a single amino acid in the β-hemoglobin gene that causes red cells to change shape in settings of low oxygen. These sickled cells block blood flow and can lead to severe pain (known as vaso-occlusive crises), organ damage, and shortened life span. Treatment is typically focused on relieving pain and minimizing organ damage, requiring medication and, for some patients, monthly blood transfusions and frequent hospital visits. \nBeta thalassemia is caused by loss-of-function mutations in the same β-hemoglobin gene that lead to severe anemia in patients, which causes fatigue and shortness of breath. In infants, beta thalassemia causes failure to thrive, jaundice, and feeding problems. Complications of beta thalassemia can lead to an enlarged spleen, liver and/or heart, misshapen bones and delayed puberty. Treatment for beta thalassemia varies depending on the disease severity for each patient. Patients with TDT, the most severe form of the disease, require regular blood transfusions, as frequently as every two to four weeks. Repeated blood transfusions eventually cause an unhealthy buildup of iron in the patient, leading to organ damage. \nCASGEVY, our ex-vivo, non-viral CRISPR/Cas9-based gene-editing therapy, was developed for the treatment of severe SCD and TDT, with our collaborator, CRISPR Therapeutics AG (“CRISPR”). Patients first undergo a treatment at an authorized treatment center (“ATC”) that mobilizes a population of hematopoietic stem and progenitor cells (“HSPC”) from the bone marrow into the bloodstream. These cells are collected from the patient’s bloodstream and transferred to a manufacturing facility where the HSPCs are purified and CRISPR/Cas9 gene-editing is performed. The gene-editing procedure results in a precise and specific gene-edit in a non-coding intron of the BCL11A gene. Following manufacturing, the edited cells, now called CASGEVY, are transferred back to the ATC. Patients are preconditioned with a myeloablative \n5\nconditioning treatment that ablates their bone marrow prior to infusion of CASGEVY. After the edited HSPC cells are returned to the patient and engraft, the gene-edit results in significant increases in the levels of fetal hemoglobin erythrocytes, thereby reducing or eliminating symptoms associated with disease. Efficacy data support the profile of CASGEVY as a potential one-time functional cure for people with severe SCD and TDT. \nOur global launch strategy for CASGEVY continues to focus on countries with high unmet medical need and infrastructure to support treatment with this CRISPR/Cas9-based gene-editing therapy, including the U.S., the Middle East, and major markets in Europe. We are working with ATCs to enable patient initiation, supporting the patient journey through infusion with CASGEVY, and working with payors to secure broad and equitable access for patients. With more than 50 ATCs activated globally, our strategy is focused on activation of a global ATC network to treat patients and expansion of our globally-enabled manufacturing and supply chain to meet growing patient demand. Our teams are also focused on working to educate patients, physicians and policymakers on the treatment journey and CASGEVY clinical data, where appropriate. \nAcute Pain \nAcute pain is a disabling condition that may occur suddenly but typically lasts less than 90 days and resolves in days or weeks (for example, following surgery or an injury). It is estimated that over 80 million people are prescribed a medicine for acute pain every year in the U.S. Currently available treatments have limitations around efficacy or side effects, including a risk of addiction. Because of these challenges, over- and under-utilization, as well as misutilization, of current pain medicines may occur. \nIn January 2025, the FDA approved JOURNAVX for the treatment of moderate-to-severe acute pain in adults. The approval was based on two positive randomized controlled Phase 3 clinical trials and supported by a positive single arm Phase 3 clinical trial evaluating safety and effectiveness. JOURNAVX is a first-in-class, oral pain signal inhibitor that is highly selective for NaV1.8 voltage-gated sodium channels. Through this mechanism, JOURNAVX provides effective relief of pain without evidence of the limitations of other currently available therapies, including the addictive potential of opioids.\nOur launch strategy for JOURNAVX focuses on securing broad access for people with acute pain, educating patients and physicians on the clinical profile of JOURNAVX, and making investments to provide a seamless treatment experience for physicians and people with acute pain. We are engaging with payors and formulary decision makers to secure reimbursement and access to JOURNAVX. We are working to secure national retail distribution to facilitate broad availability of JOURNAVX as well as financial and co-pay assistance programs for patients that will support access to JOURNAVX. \nRESEARCH AND DEVELOPMENT PROGRAMS\nWe invest in research and development to discover and develop transformative medicines for people with serious diseases, with a focus on specialty markets. Our research strategy is to combine transformative advances in the understanding of human disease and in the science of therapeutics to dramatically advance human health. We focus on:\n•\ndisease areas with known causal human biology; \n•\ntargets validated by causal human biology;\n•\npredictive lab assays and clinical biomarkers;\n•\npotential for transformative benefit regardless of modality; and\n•\nefficient path to registration and approval.\nOur development-stage product candidates are focused on the treatment of serious diseases, including CF, SCD, TDT, acute and peripheral neuropathic pain, AMKD, IgAN and other autoimmune renal diseases and cytopenias, T1D, DM1, and ADPKD. In pursuit of serial innovation, our research and development approach includes advancing multiple candidates into clinical trials and pursuing multiple modalities with the goal of bringing first-in-class and/or best-in-class therapies to patients. \nOur research and development strategy has been validated through our success in moving novel product candidates into clinical trials and obtaining marketing approvals for ALYFTREK, TRIKAFTA/KAFTRIO, KALYDECO, ORKAMBI, and \n6\nSYMDEKO/SYMKEVI for the treatment of CF, CASGEVY for the treatment of SCD and TDT, and JOURNAVX for the treatment of acute pain. Our approach to drug discovery has been further validated by our successful demonstration of clinical proof-of-concept in four additional disease areas: in diabetic peripheral neuropathy with our NaV1.8 inhibitors, in AMKD with inaxaplin, in T1D with zimislecel, and in IgAN with povetacicept. \nOver the last several years, this strategy has led us to expand our capabilities to include additional innovative therapeutic modalities with a focus on cell and genetic therapies, which have the potential to treat, and in some cases, cure diseases by addressing the underlying cause of the disease. CASGEVY, approved in multiple geographies, including the U.S., is one such example. We continue to make significant internal investments in cell and genetic therapies. These investments include the development of a Boston-based campus for research and current Good Manufacturing Practices (“cGMP”) clinical manufacturing capabilities dedicated to our portfolio of cell and genetic therapy technologies and teams. \n To augment our internal programs, we acquire businesses and technologies and collaborate with biopharmaceutical and technology companies, leading academic research institutions, government laboratories, foundations and other organizations to advance research in our disease areas of interest, as well as to access technologies needed to execute on our strategy. Our internal and external innovation approaches are based on the same strategy, which enables us to effectively integrate and execute on new internal capabilities as we invest in external innovation. Our investments in external innovation include our collaboration with CRISPR, which resulted in the successful development and approval of CASGEVY and the establishment and advancement of other pipeline programs, including our T1D program through our acquisition of Semma Therapeutics, Inc. (“Semma”), our expansion of our renal programs through our acquisition of Alpine Immune Sciences, Inc. (“Alpine”), our mRNA therapeutic, VX-522, for treatment of CF through our collaboration with Moderna, and our intracellular therapeutics for DM1, including VX-670, through our collaboration with Entrada.\nCF \nWe are enrolling and dosing in a Phase 3 clinical trial evaluating ALYFTREK in children with CF 2 to 5 years of age who have at least one F508del mutation or a mutation responsive to triple combination CFTR modulators.\nWe estimate that approximately 90% of people with CF could benefit from our five approved medicines, including TRIKAFTA/KAFTRIO and the recently approved ALYFTREK. We continue to identify and develop additional CFTR modulators with the goal of developing best-in-class medicines that can help more patients who respond to CFTR modulators achieve normal levels of CFTR function; our next generation of CFTR modulators have completed, or are in the process of completing, Phase 1 clinical trials.\nIn order to treat people with CF who do not make full-length CFTR protein, and as a result, cannot benefit from our CFTR modulators, we are researching and developing genetic therapies, such as mRNA, and gene-editing approaches to CF. In collaboration with Moderna, we are developing VX-522, a nebulized CF mRNA therapeutic designed to treat the underlying cause of CF lung disease for these people by enabling cells in the lungs to produce functional CFTR protein. \nThe multiple ascending dose portion of the clinical trial is ongoing and we expect data in the first half of 2025. We believe that VX-522 has the potential to benefit more than 5,000 people with CF in the U.S., Canada, Europe and Australia.\nSickle Cell Disease and Transfusion-Dependent Beta Thalassemia \nTwo global Phase 3 clinical trials evaluating CASGEVY in children 5 to 11 years of age with severe SCD (the CLIMB SCD-151 clinical trial) and TDT (the CLIMB THAL-141 clinical trial) are ongoing. \nWe have completed enrollment in these two clinical trials, and we expect to complete dosing in 2025. \nIn connection with our serial innovation approach, we are advancing preclinical assets for myeloablative conditioning agents with improved tolerability profiles, which we refer to as “gentler conditioning agents,” which could be used in connection with treatment with CASGEVY, significantly broadening the eligible SCD and TDT patient population. We are  also investigating in vivo gene-editing approaches and small molecules for the potential treatment of SCD and TDT.\nPain\nPain can be debilitating and develop from a variety of conditions. Most commonly, patients with pain can be categorized as suffering from one of three types of pain: acute pain, chronic neuropathic pain (caused primarily by damage or dysfunction of peripheral nerves), or chronic musculoskeletal pain (caused primarily by damage to muscle, joints or bone). Acute pain usually resolves in days or weeks (for example, following surgery or an injury), while chronic pain generally lasts greater \n7\nthan three months due to unresolved or ongoing damage to tissues or nerves. Currently available treatments have limitations around efficacy or side effects, including a risk of addiction. Because of these challenges, over- and under-utilization, as well as mis-utilization, of current pain medicines may occur. \nThe sodium channels NaV1.8 and NaV1.7 play important roles in the physiology of pain. We have discovered multiple selective small molecule inhibitors of NaV1.8 as potential treatments for pain. We obtained pharmacological validation of NaV1.8 inhibition with a first generation NaV1.8 inhibitor in three clinical pain types: acute pain, chronic neuropathic pain, and chronic musculoskeletal pain. \nIn acute pain, we are evaluating an oral formulation of VX-993, our next-generation NaV1.8 pain signal inhibitor, for the treatment of moderate-to-severe acute pain following bunionectomy surgery in a Phase 2 clinical trial. We are also enrolling and dosing healthy volunteers in a Phase 1 clinical trial evaluating an intravenous formulation of VX-993. The FDA has granted Fast Track Designation to VX-993 in acute pain in both the oral and intravenous formulations. \nIn neuropathic \npain, we are enrolling and dosing in the Phase 3 pivotal program evaluating suzetrigine in people with diabetic peripheral neuropathy, a common form of peripheral neuropathic pain, with the ultimate goal of securing a broad label for the treatment of peripheral neuropathic pain. In addition, we are enrolling and dosing patients in a Phase 2 clinical trial for the oral formulation of VX-993, for the treatment of diabetic peripheral neuropathy. There are no approved medicines in the U.S. that are labeled for the treatment of peripheral neuropathic pain. The FDA has granted suzetrigine Breakthrough Therapy Designation in diabetic peripheral neuropathy. \nIn support of this broad peripheral neuropathic pain indication we seek, we completed a Phase 2 clinical trial of suzetrigine for the treatment of people with LSR, which is pain caused by impairment or injury to nerve roots in the area of the lumbar spine, another type of peripheral neuropathic pain. In December 2024, we announced Phase 2 clinical trial results showing that treatment with suzetrigine demonstrated a statistically significant and clinically meaningful within-group reduction in pain on the numeric pain rating scale for people with LSR, and that suzetrigine was safe and generally well-tolerated in the trial. The clinical trial also included a placebo reference arm, which showed a similar within-group reduction. We hypothesize that a high placebo response in this clinical trial led to a lack of separation of the suzetrigine and placebo response curves. We believe we can innovate in pain clinical trial design to better control the placebo effect, and succeed in pivotal development with suzetrigine. We plan to advance suzetrigine into pivotal development in LSR, pending discussions with regulators on trial design and the regulatory package.\nIn keeping with our serial innovation approach, we are advancing multiple additional NaV1.8 inhibitors and NaV1.7 inhibitors, which could be used alone or in combination, for the treatment of acute pain and chronic neuropathic pain\n.\nAPOL1-Mediated Kidney Disease \nInherited mutations in the APOL1 gene play a causal role in the biology of severe proteinuric kidney diseases referred to as AMKD. In AMKD, the kidney’s filtering units known as the glomeruli, and within them the cells known as podocytes, are damaged, leading to leakage of protein into the urine, deterioration in kidney function, scarring, and, ultimately, permanent kidney damage. Patients with proteinuria who inherited two copies of the APOL1 mutations demonstrate rapid progression to end-stage kidney disease. Some patients with AMKD have the histological finding of focal segmental glomerulosclerosis (“FSGS”) and co-morbidities such as hypertension. We are evaluating multiple novel small molecules that inhibit the function of the mutant APOL1 protein with the potential to treat APOL1-mediated kidney disease.\nIn a Phase 2 proof-of-concept clinical trial, patients with APOL1-mediated FSGS treated with inaxaplin on top of standard of care achieved a statistically significant, substantial, and clinically meaningful reduction of proteinuria, and inaxaplin was well tolerated by patients. Based on this positive Phase 2 data, we initiated pivotal development of inaxaplin in a single Phase 2/3 adaptive clinical trial in patients with AMKD in 2022. We completed t\nhe Phase 2B portion of the Phase 2/3 clinical trial and initiated the Phase 3 portion of the study in 2024. \nWe continue to enroll and dose people with AMKD in the Phase 3 portion of the global Phase 2/3 pivotal clinical trial (“AMPLITUDE”). We expect to complete enrollment in the interim analysis cohort in 2025 and apply for potential accelerated approval in the U.S., assuming a positive interim analysis.\nIn addition, we have initiated \na Phase 2 proof-of-concept clinical trial (“AMPLIFIED”) evaluating inaxaplin as a treatment for people with AMKD and diabetes or other co-morbidities currently not eligible for the AMPLITUDE trial.\n8\nIgA Nephropathy and Other B Cell-Mediated Diseases\nIgAN is a serious, progressive, life-threatening chronic kidney disease that causes inflammation and damage to the kidneys. It is the most common primary glomerulonephritis worldwide, affecting approximately 300,000 people in the U.S. and Europe, and, in China, there are approximately 750,000 people diagnosed with IgAN. A high percentage of people with IgAN progress to end-stage kidney disease. While there are approved therapies for the treatment of IgAN, there are no approved therapies that specifically target the underlying cause of the disease. \nIgAN is thought to occur when the body produces an abnormal form of IgA, a type of antibody that normally helps the body fight infections. The body generates an abnormal immune response, including antibodies (autoantibodies), against this abnormal IgA, and these antibodies can combine to create larger molecules called immune complexes. These immune complexes can deposit in the kidneys, triggering damage and inflammation, especially within the glomeruli, impairing the kidneys’ ability to properly filter waste and fluid. \nIn 2024, we acquired Alpine and its lead asset, povetacicept, which has the potential of being a “pipeline-in-a-product.” Povetacicept is a dual antagonist of BAFF and APRIL, which play key roles in pathogenesis of IgAN and multiple other autoimmune diseases via their roles in the activation, differentiation and/or survival of B cells, T cells and innate immune cells. Povetacicept is a protein therapeutic based upon an engineered TACI (transmembrane activator and CAML interactor) domain. It has demonstrated higher binding affinity and greater potency in preclinical studies versus other inhibitors of BAFF and/or APRIL and has demonstrated potential best-in-class efficacy in a clinical trial in people with IgAN. Povetacicept is being studied as a once every four weeks subcutaneous injection, with the aim of at home self-administration upon commercialization.\nIn 2024, we initiated RAINIER, our global Phase 3 pivotal trial of povetacicept versus placebo in approximately 480 people with IgAN, which is enrolling and dosing people in the U.S., Europe and Asia. The clinical trial design contemplates a pre-planned interim analysis evaluating the change from baseline in urine protein-to-creatine ratio (“UPCR”) after a certain number of patients reach 36 weeks of treatment. If positive, the interim analysis may serve as the basis to seek accelerated approval in the U.S. The final analysis will occur when patients reach two years of treatment and will evaluate total eGFR (estimated glomerular filtration rate) slope. \nWe expect to complete enrollment in the interim analysis cohort in 2025 and apply for potential accelerated approval in the U.S., assuming a positive interim analysis.\nIn January 2025, we entered into a collaboration agreement with Zai Lab Limited (“Zai”) for the development and commercialization of povetacicept in mainland China, Hong Kong SAR, Macau SAR, Taiwan region and Singapore. Under this collaboration, Zai will help advance the povetacicept clinical trials and make the regulatory submissions in the licensed territories. Zai will also be responsible for commercialization activities in the licensed territories, if povetacicept becomes an approved product. \nWe believe povetacicept holds the potential to transform multiple B-cell mediated diseases and deliver on its potential as a pipeline-in-a-product, with significant market opportunity across multiple therapeutic areas. In addition to IgAN, we are evaluating povetacicept as a treatment for other B cell-mediated autoimmune kidney diseases in the RUBY-3 basket trial and as a treatment for autoimmune cytopenias in the RUBY-4 basket trial. Both of these basket trials are ongoing, and we expect data in some of these conditions in 2025. \nType 1 Diabetes\nT1D is a chronic metabolic disorder caused by insufficient insulin secretion by the beta cells in the pancreas. In patients with T1D, the insulin-producing islet cells of the pancreas are destroyed by the person’s own immune system, resulting in a lack of insulin and impairment of blood glucose control. While insulin therapy allows patients to live for decades with the disease, challenges of insulin therapy include inadequate control of blood sugar (both hyper- and hypo-glycemia), a substantial burden of care on patients and families, and long-term vascular complications. Current standards of care do not address the underlying causes of the disease, and there are limited treatment options beyond insulin for the management of T1D.\nWe are developing non-autologous (allogeneic) fully differentiated, stem-cell derived islet cell therapies designed to replace insulin-producing islet cells that are destroyed in people with T1D, with the goal of delivering a functional cure. We are pursuing multiple programs for the transplant of functional islets into patients, including: transplantation of islet cells alone followed by standard, chronic immunosuppression to protect the implanted cells, implantation of the islet cells inside a \n9\nnovel immunoprotective device, alternative approaches to immunosuppression that could be used with the implanted islet cells, and development of hypoimmune islet cells to optimize protection of the implanted islet cells from the immune system.\nZimislecel, our first program, is a stem cell-derived, allogeneic, fully differentiated, insulin-producing islet cell replacement therapy, using standard immunosuppression to protect the implanted cells. The Phase 1/2/3 clinical trial is designed as a sequential, multi-part clinical trial to evaluate the safety and efficacy of zimislecel, and has been expanded to include a total of 50 people. We expect to complete enrollment and dosing in the Phase 3 portion of this clinical trial in 2025 and, assuming positive data, we expect to file for approval after patients have completed one year of insulin-free follow-up. Data presented demonstrate unprecedented efficacy and curative potential. Safety data are consistent with the immunosuppressives, the perioperative period, and past medical history. In addition, we have initiated a clinical trial evaluating zimislecel in people with T1D who have had a kidney transplant. \nIn our second program, we are evaluating VX-264, in which zimislecel is encapsulated in an immunoprotective device that is implanted in patients, which we believe can obviate the need for immunosuppressive therapy. We are enrolling and dosing patients with VX-264 in a Phase 1/2 clinical trial to evaluate the safety, tolerability and efficacy of VX-264. Part A of the study dosed patients with a partial dose of cells/devices and a stagger between patients, Part B dosed patients with a full target dose and a stagger between patients, and Part C will dose at full target dose without a stagger between patients. We expect to share Part B full-dose data from this clinical trial in 2025.\nIn our third program, research is directed toward developing hypoimmune cells by gene-editing zimislecel prior to differentiation into fully differentiated islets in order to cloak them from the immune system. This program continues to advance in pre-clinical development. We are also pursuing alternative approaches to immunosuppression that could be used with zimislecel.\nMyotonic Dystrophy Type 1 \nDM1 is an inherited disease that results in the weakening and destruction of skeletal muscles over time. Muscle weakness, muscle wasting and myotonia (sustained muscle contraction and difficulty relaxing muscles) are the hallmark features of DM1. It is a serious life-shortening disease with no approved treatments. \nVX-670, our lead approach for DM1, holds the potential to address the underlying cause of DM1. VX-670 is an oligonucleotide connected to a cyclic peptide to promote effective delivery into cells. We completed the single ascending dose portion of the global Phase 1/2 clinical trial evaluating the first candidate, VX-670, in patients with DM1. We are enrolling and dosing the multiple ascending dose portion of the trial, which will evaluate the safety and efficacy of VX-670. We also have a small molecule program for DM1 in preclinical development. \nAutosomal Dominant Polycystic Kidney Disease\nADPKD is a life-shortening genetic kidney disease characterized by the growth of numerous kidney-enlarging cysts that impair kidney function and can ultimately lead to kidney failure, requiring dialysis or kidney transplantation, and premature death. Kidney cysts can also lead to severe abdominal pain, cyst infection, blood in the urine and kidney stones, all of which significantly impair quality of life. Around half of patients with ADPKD experience kidney failure by the age of 60.\nVX-407 is a first-in-class small molecule corrector that is designed to target the underlying cause of ADPKD in people with a subset of PKD1 variants. We are nearing completion of a Phase 1 clinical trial in healthy volunteers evaluating VX-407 and expect to advance VX-407 into a Phase 2 proof-of-concept clinical trial in people with ADPKD in 2025.\nCOMMERCIALIZATION OF OUR MEDICINES\nOur commercialization efforts focus on supporting the appropriate use of ALYFTREK, TRIKAFTA/KAFTRIO, SYMDEKO/SYMKEVI, ORKAMBI, KALYDECO, CASGEVY and JOURNAVX in the markets where these products have been approved. Our teams are responsible for promoting products to health care providers, ensuring our products are distributed effectively, ensuring the safe use of our products, and obtaining reimbursement for our products from third-party payors, including governmental organizations in the U.S. and ex-U.S. markets. In parallel, our government affairs and public \n10\npolicy group advocates for policies that promote life sciences innovation and increase awareness of the diseases on which we are focusing with state and federal legislatures, government agencies, public health officials and other policymakers. \nCommercialization of CF Medicines \nIn the U.S., we primarily sell our CF products to a limited number of specialty pharmacy and specialty distributors. In international markets, we sell our CF products primarily through distributor arrangements and to retail pharmacies, as well as to hospitals and clinics, many of which are government-owned or supported. We also have established programs in the U.S. that provide our CF products to qualified uninsured or underinsured patients at no charge or at a reduced charge, based on specific eligibility criteria. \nOur U.S. field-based CF commercial team is comprised of a small number of individuals to support commercialization of our medicines for CF. We focus our CF marketing efforts in the U.S. on a relatively small number of physicians and health care professionals who write most of the prescriptions for CF medicines. Many of these physicians and health care professionals are located at a limited number of accredited centers in the U.S. focused on the treatment of CF. In international markets, we or our distributors have small sales forces that support TRIKAFTA/KAFTRIO, SYMDEKO/SYMKEVI, ORKAMBI and KALYDECO in jurisdictions where these products are approved. \nIn December 2024, the FDA approved ALYFTREK in the U.S. as a treatment for people with CF 6 years of age and older who have at least one F508del mutation or another mutation in the CFTR gene that is responsive to ALYFTREK. This includes people with CF with one of 31 mutations who are now eligible for a CFTR modulator for the first time. ALYFTREK demonstrated non-inferiority to TRIKAFTA in ppFEV\n1\n, a measure of lung function, and an improvement in sweat chloride levels as compared to TRIKAFTA, and we believe that this medicine has the potential to improve the care of patients with CF. ALYFTREK has the additional benefit of a once-daily dosing regimen and may lead to a new standard in CF care, reinforcing our established position as the leading company in CF. In addition, this new triple combination regimen has a lower royalty burden than our other CF medicines. We believe ALYFTREK presents an opportunity for three types of patients: (i) those who are currently on a CFTR modulator who may want to switch to ALYFTREK, (ii) those patients who have not yet been initiated on a CFTR modulator or been eligible for a CFTR modulator, and (iii) those who have discontinued from another CFTR modulator. We are supporting the launch of ALYFTREK through our existing commercial infrastructure.\nALYFTREK is under regulatory review in the U.K., the E.U., Canada, Switzerland, Australia and New Zealand. \nAdditionally, in December 2024, the FDA approved the expanded use of TRIKAFTA for the treatment of people with CF 2 years of age and older who have at least one F508del mutation in the CFTR gene or a mutation that is responsive to TRIKAFTA based on clinical and/or in vitro data. With this approval, 94 additional non-F508del CFTR mutations have been added to the TRIKAFTA label, and approximately 300 additional people with CF in the U.S. are now eligible to receive TRIKAFTA as a treatment.\nCommercialization of CASGEVY\nWe are continuing the commercial launch of CASGEVY, following approvals in the U.S., the E.U., the U.K., Saudi Arabia, Bahrain, the UAE, Canada and Switzerland. We expect to obtain additional regulatory approvals for CASGEVY in 2025. We estimate approximately 60,000 people with severe SCD and TDT are or could become eligible for CASGEVY in the U.S., Canada, Europe, Saudi Arabia and Bahrain.\nAs CASGEVY is the first CRISPR-based therapy to be approved, our global launch strategy is focused on educating physicians, patients and caregivers, payors, and policymakers about the significant disease burden of SCD and TDT and the availability of CASGEVY as a treatment option. We have also established a global manufacturing network to ensure adequate production and supply of CASGEVY at commercial scale. Given the geographic concentration of patients, we expect to reach the majority of patients through our specialty commercial model, which is comprised of a small number of field-based individuals. Because the administration of CASGEVY requires specialized experience in stem cell transplantation, we are engaging with experienced hospitals to establish a network of authorized treatment centers across the U.S., Europe and the Middle East. We have activated more than 50 authorized treatment centers across the U.S., Europe, Saudi Arabia, Bahrain and the UAE, and we are working to activate additional centers.\n Our teams are actively engaged with key treatment centers, policymakers and third-party payors to ensure that patients who may be eligible for CASGEVY have access to this potentially curative therapy. We are seeking broad access with \n11\ngovernment and commercial payors for CASGEVY. In the U.S., there is broad coverage of CASGEVY in the private and public payer space, initially through single case agreements as medical policies are finalized. In addition, we have recently reached an agreement with the Centers for Medicare & Medicaid Services (“CMS”) to participate in its cell and gene therapy access model, which may enable additional access mechanisms for states and authorized treatment centers. In England, we have secured access for eligible people with TDT and SCD. In the E.U., we are working with national health authorities to achieve access and reimbursement and have secured reimbursed access for people with SCD or TDT in Luxembourg, we have established a hospital-based reimbursement for CASGEVY in Austria, and the Italian Medicines Agency has approved early access for CASGEVY, on a case-by-case basis, to treat people with TDT or SCD. In the Middle East, we have reached a hospital-based reimbursement for people with SCD or TDT in Saudi Arabia, and for national reimbursement for eligible people in Bahrain. We are actively working to expand access to CASGEVY across Europe and the Middle East. \nWe are currently treating patients across multiple geographies and more than 50 patients have initiated cell collection. The first commercial patient was infused with CASGEVY in the third quarter of 2024. \nCommercialization of JOURNAVX\n \nIn January 2025, JOURNAVX was approved by the FDA as a treatment for adults with moderate-to-severe acute pain. We believe JOURNAVX has the potential to establish a new standard of care for the estimated 80 million patients in the U.S. who are prescribed a medicine for their acute pain each year. Approximately half of these patients are prescribed opioids, which, while effective, have significant safety and tolerability concerns, and addictive potential. JOURNAVX provides effective relief of moderate-to-severe acute pain, has a favorable safety and tolerability profile, and based on its mechanism of action, does not have addictive potential.\nOur commercial focus at launch for JOURNAVX is securing broad access and investing to ensure a seamless experience for patients and physicians. We are engaging with key health care professionals, formulary decision makers and payers to establish the conditions for rapid patient access and uptake. Our commercial field team is engaging stakeholders to support the launch of JOURNAVX in hospitals and other healthcare settings in the U.S. In addition, we are working to secure broad stocking agreements with national retail pharmacies and regional chains, to ensure access to JOURNAVX for patients across the U.S.\nWe are also focused on ensuring there is equal access to non-opioid options for pain relief. We continue to see momentum from federal and state policymakers to support the appropriate use of non-opioid pain medications, including addressing financial and other administrative barriers, such as utilization management, to accessing non-opioid options. In addition, as a part of our commitment to patients, we are offering financial and copay support programs for eligible patients who are prescribed JOURNAVX. \nReimbursement of Approved Therapies\nOur CF medicines are used by patients in more than 60 countries, and TRIKAFTA/KAFTRIO is reimbursed or accessible in more than 50 of these countries outside the U.S. We expect to continue to focus significant resources to maintain reimbursement and obtain expanded reimbursement for our CF medicines and pipeline therapies in ex-U.S. markets. \nIn SCD and TDT, CASGEVY is approved in the U.S., the E.U., the U.K., Saudi Arabia, Bahrain, the UAE, Canada and Switzerland, and we are actively engaged with relevant stakeholders to obtain broad access and reimbursement with government and commercial payors for CASGEVY. CASGEVY is broadly reimbursed by third-party payors in the U.S., including the federal government. Currently in the U.S., across commercial and government payors, all eligible CASGEVY patients have case-by-case coverage through single case agreements, and we have signed agreements with national and regional payors, which cover over 250 million lives, to provide access to CASGEVY. Within Medicare, to help address this issue, we applied for and CMS has granted a new technology add-on payment for CASGEVY when used for the treatment of SCD for Medicare patients. Within Medicaid, we have engaged all of the Medicaid administrators in all 50 U.S. states, focused on the 25 states with the highest prevalence of SCD patients, and have confirmed pathways to reimbursement in all 25 of those priority states. In addition, in February 2023, the U.S. Administration established a new demonstration program to help pay for cell and gene therapies in diseases such as SCD through the CMS program known as The Cell and Gene Therapy Access Model (“CGT Access Model”). The CGT Access Model was designed to provide an opportunity to accelerate and enhance broad Medicaid access for eligible patients across all 50 U.S. states by allowing state Medicaid agencies to delegate authority to CMS to coordinate and facilitate outcomes-based payment arrangements (“OBAs”) with cell and gene therapy \n12\nmanufacturers, such as ours. In December 2024, we reached an agreement with CMS to expand access by participating in the CGT Access Model for SCD to benefit Medicaid beneficiaries. \nFor CASGEVY in ex-U.S. markets, we anticipate some early access programs initially and in parallel we are pursuing long-term reimbursement arrangements. We have successfully achieved national reimbursement in England, Luxembourg, and Bahrain for people with TDT or SCD, and secured hospital-based reimbursement for patients in Saudi Arabia and Austria. We continue to engage with payors in the U.K., the E.U., and the Middle East. \nFor JOURNAVX in the U.S., we have been working with government and commercial payors pre- and post-approval to support rapid and broad access, including to accelerate targeted contracting and formulary additions at both select payors and targeted hospital systems. In addition, we are finalizing contracts with private and government payors, as well as hospital group purchasing organizations.\nSTRATEGIC TRANSACTIONS AND COLLABORATIONS\nAs part of our business strategy, we seek to license or acquire technologies, products, product candidates, and businesses that are aligned with our corporate and research and development strategies and complement and advance our ongoing research and development efforts. In addition, we establish business relationships with collaborators to support our research activities and to lead or support development and/or commercialization of certain product candidates. We expect to continue to identify and evaluate potential acquisitions, licenses and collaborations that may be similar or different from the transactions that we have engaged in previously.\nStrategic Transactions\nIn May 2024, we acquired Alpine for approximately $5.0 billion. Alpine’s lead molecule, povetacicept, is \na highly potent and effective dual antagonist of BAFF and APRIL. We are evaluating povetacicept for the potential treatment of IgAN in a Phase 3 clinical trial and for the treatment of other serious autoimmune diseases in Phase 2 clinical trials. \nWe believe povetacicept has the potential to treat multiple diseases or conditions and become a pipeline-in-a-product, with significant market opportunity across multiple therapeutic areas. \nIn addition to Alpine, we have made additional acquisitions which have expanded and advanced our pipeline, including: \n•\nIn 2017, we enhanced our CF portfolio through our acquisition of certain CF assets, including deutivacaftor, from Concert Pharmaceuticals Inc. In December 2024, the FDA approved ALYFTREK (vanzacaftor/tezacaftor/deutivacaftor) \nfor people with CF 6 years of age and older. \n•\nIn 2019, we established our T1D program through our acquisition of Semma, a privately held company focused on the use of stem cell-derived human islets as a potentially curative treatment for T1D. We are evaluating zimislecel for the potential treatment of T1D in a Phase 1/2/3 clinical trial. We expect to complete enrollment and dosing in the Phase 3 portion of this clinical trial in 2025. In addition, our second clinical program in T1D, VX-264, in which zimislecel is encapsulated in an immunoprotective device, is ongoing.\nWe expect to continue to identify and make acquisitions to expand and advance our pipeline and business. \nCollaboration and Licensing Arrangements\nJoint Development and Commercialization Agreement with CRISPR\nIn December 2017, we entered into a joint development and commercialization agreement (“Original JDCA”) with CRISPR, pursuant to which we are co-developing and co-commercializing CASGEVY for SCD and TDT. We entered into the Original JDCA following our exercise of an option \nto co-develop and co-commercialize the hemoglobinopathies program that was contained in the collaboration agreement that we entered into with CRISPR in 2015. \nIn April 2021, we and CRISPR amended and restated the Original JDCA (the “A&R JDCA”). Pursuant to the A&R JDCA, the parties agreed to, among other things, (a) adjust the governance structure for the collaboration and adjust the responsibilities of each party thereunder; (b) adjust the allocation of net profits and net losses between the parties; and (c) \n13\nexclusively license (subject to CRISPR’s reserved rights to conduct certain activities) certain intellectual property rights to us relating to the products that may be \nresearched\n, developed, manufactured and commercialized under such agreement. \nPursuant to the A&R JDCA, we lead global development, manufacturing and commercialization of CASGEVY, with support from CRISPR. Subject to the terms and conditions of the A&R JDCA, we have the right to conduct all research, development, manufacturing, and commercialization activities relating to the product candidates and products under the A&R JDCA (including CASGEVY) throughout the world, subject to CRISPR’s reserved right to conduct certain activities.\nIn connection with the A&R JDCA, we made a $\n900.0\n million upfront payment to CRISPR in the second quarter of 2021. CRISPR earned an additional one-time $\n200.0\n million milestone payment upon receipt of marketing approval of CASGEVY from the FDA.\nWe and CRISPR shared equally all expenses incurred under the Original JDCA. On July 1, 2021, with respect to CASGEVY, the net profits and net losses incurred pursuant to the A&R JDCA began to be allocated 60% to us and 40% to CRISPR, subject to certain adjustments, while all other product candidates and products continue to have net profits and net losses shared equally between the parties. \nEither party may terminate the A&R JDCA upon the other party’s material breach, subject to specified notice and cure provisions, or, in our case, in the event that CRISPR becomes subject to specified bankruptcy, winding up, or similar circumstances. Either party may terminate the A&R JDCA in the event the other party commences or participates in any action or proceeding challenging the validity or enforceability of any patent that is licensed to such challenging party pursuant to the A&R JDCA. We also have the right to terminate the A&R JDCA for convenience at any time after giving prior written notice.\n \nIf circumstances arise pursuant to which a party would have the right to terminate the A&R JDCA on account of an uncured material breach, such party may elect to keep the A&R JDCA in effect and cause such breaching party to be treated as if it had exercised its opt-out rights with respect to the products associated with such uncured material breach and the royalties payable to the breaching party would be reduced by a specified percentage.\nEither party may opt out of the development of a product candidate under the A&R JDCA after predetermined points in the development of the product candidate, on a candidate-by-candidate basis. In the event of such opt-out, the party opting-out will no longer share in the net profits and net losses associated with such product candidate and, instead, the opting out party will be entitled to high single to mid-teen percentage royalties on the net sales of such product, if commercialized.\nIn-License Agreements\nWe have entered into various agreements pursuant to which we have obtained access to technologies from third parties and are conducting research and development activities with collaborators. Pursuant to these arrangements, we have obtained development and commercialization rights to resulting product candidates. Depending on the terms of the arrangements, we may be responsible for the costs of research activities, required to make upfront payments and/or milestone payments upon the achievement of certain research, development, and commercial objectives, and/or pay royalties on future sales, if any, of commercial products resulting from the collaboration. Our current in-license agreements include:\n•\nCRISPR Therapeutics AG.\n In addition to our arrangement with CRISPR described above, we have exercised options to exclusively license treatments for specific targets, including CF, that were subject to the research program under the collaboration agreement we entered into with CRISPR in 2015. In 2019, we obtained exclusive worldwide rights to CRISPR’s intellectual property for Duchenne muscular dystrophy (“DMD”) and DM1 gene-editing products through a new agreement with CRISPR. In 2023, we obtained non-exclusive rights to CRISPR’s intellectual property for the development of hypoimmune gene-edited cell therapies for T1D through a new agreement with CRISPR.\n•\nModerna, Inc.\n \nIn 2016, we entered into a collaboration with Moderna for the identification and development of mRNA therapeutics encoding CFTR for the treatment of CF. \nIn December 2022, the FDA cleared our\n Investigational New Drug Application (“IND”)\n for VX-522, an mRNA therapeutic we are developing with Moderna pursuant to this collaboration. The multiple ascending dose portion of the Phase 1/2 clinical trial of VX-522 in people with CF is ongoing. We expect to share data from this clinical trial in the first half of 2025.\n•\nEntrada Therapeutics, Inc.\n In 2022, we established a collaboration with Entrada focused on enabling efficient intracellular delivery of an oligonucleotide for DM1. This collaboration includes VX-670, an investigational candidate for the treatment of DM1 that is in clinical development. \nWe completed the single ascending dose portion \n14\nof the global Phase 1/2 clinical trial for VX-670 in people with DM1. We are enrolling and dosing the multiple ascending dose portion of the trial, which will evaluate the safety and efficacy of VX-670.\nOut-license Agreements\nWe have entered into various agreements pursuant to which we have out-licensed rights to certain product candidates to third-party collaborators. Pursuant to these out-license arrangements, our collaborators are responsible for all costs related to the continued development of such product candidates and obtain development and commercialization rights to these product candidates. Depending on the terms of the arrangements, our collaborators may be required to make upfront payments, milestone payments upon the achievement of certain research and development objectives and/or pay royalties on future sales, if any, of commercial products licensed under the agreement. \nIn January 2025, we entered into a collaboration agreement with Zai for the development and commercialization of povetacicept in mainland China, Hong Kong SAR, Macau SAR, Taiwan region and Singapore. Under this collaboration, Zai will help advance the povetacicept clinical trials and make the regulatory submissions in the licensed territories. Zai will also be responsible for commercialization activities in the licensed territories, if povetacicept becomes an approved product. \nCystic Fibrosis Foundation\nIn 2004, we entered into a collaboration agreement with the Cystic Fibrosis Foundation, as successor in interest to the Cystic Fibrosis Foundation Therapeutics, Inc., to support research and development activities. Pursuant to the collaboration agreement, as amended, we have agreed to pay tiered royalties ranging from single digits to sub-teens on covered compounds first synthesized and/or tested during a research term on or before February 28, 2014, including ivacaftor, lumacaftor and tezacaftor and royalties ranging from low-single digits to mid-single digits on net sales of certain compounds first synthesized and/or tested between March 1, 2014 and August 31, 2016, including elexacaftor. We do not have any royalty obligations on compounds first synthesized and tested on or after September 1, 2016. For combination products, such as ORKAMBI, SYMDEKO/SYMKEVI, TRIKAFTA/KAFTRIO, and ALYFTREK sales are allocated equally to each of the active pharmaceutical ingredients in the combination product, and royalties are then paid for any royalty-bearing components included in the combination.\nINTELLECTUAL PROPERTY\nPatents and other intellectual property rights such as trademarks, trade secrets, and copyrights are critical to our business. We actively seek protection for our products and proprietary information by means of U.S. and foreign patents, trademarks, and copyrights, as appropriate. In addition, we rely upon trade secret protection and contractual arrangements to protect certain of our proprietary information.\nPatents provide a period of exclusivity that can make it more difficult for competitors to market and use our technology. We own and control patents and pending patent applications that relate to compounds, formulations, synthetic routes, intermediates, devices, treatment of diseases, and other inventions.\nTo protect our intellectual property, we typically apply for patents several years before a product receives marketing approval. Under current law, a patent expires 20 years from its first effective filing date. Since the drug development process may last for many years, there may be a period of time in which we have an issued patent but not marketing approval to sell the drug. To compensate for patent term lost while a product is in clinical trials and undergoing review for marketing approval, we may be able to apply for patent term extensions or supplementary protection certificates (“SPCs”) in some countries. In addition to patent protection, we receive regulatory exclusivity from U.S. and European regulatory agencies for the active pharmaceutical and biological agents and, where applicable, their approved orphan indications for a certain time period. Regulatory exclusivity runs concurrently with patent exclusivity and provides complementary protection for our products.\nFor our approved commercial products, and those in development, we own or hold exclusive and non-exclusive licenses to several hundred patents around the world. In the U.S., once an NDA, or a supplement thereto, is approved we are required to list with the FDA each U.S. patent with claims that cover our product or a method of using the product. The FDA publishes the patents we list in a book referred to as the Orange Book. We have thirteen issued U.S. patents listed in the Orange Book that cover the active pharmaceutical ingredients in KALYDECO, its marketed formulations, and/or its approved indication. \n15\nWe have 22 issued U.S. patents listed in the Orange Book that cover the active pharmaceutical ingredients in ORKAMBI, its marketed formulations, and/or its approved indication. We have 25 issued U.S. patents listed in the Orange Book that cover the active pharmaceutical ingredients in SYMDEKO, its marketed formulation, and/or its approved indication. We have 28 issued U.S. patents listed in the Orange Book that cover the active pharmaceutical ingredients in TRIKAFTA, its marketed formulation, and/or its approved indication. We have 35 issued U.S. patents listed in the Orange Book that cover the active pharmaceutical ingredients in ALYFTREK, its marketed formulation, and/or its approved indication. We expect to have an issued patent listed in the Orange Book that covers the active pharmaceutical ingredient in JOURNAVX, its marketed formulation, and/or its approved indication.\nProducts approved by the FDA under a Biologics Licensing Application (“BLA”), including CASGEVY, receive 12 years of regulatory exclusivity in the U.S. from a product’s approval date. Additionally, we have licenses to dozens of issued U.S. patents that cover CASGEVY, its approved indication, and/or its manufacture. Products approved by the FDA under a BLA are not subject to the Orange Book patent listing requirement.\nThe table below sets forth the year of projected expiration for the basic product patent covering each of our approved products. For products that are combinations of two or more active ingredients, the table lists the projected expiration of the latest expiring patent covering any of the active pharmaceutical ingredients (lumacaftor for ORKAMBI, tezacaftor for SYMDEKO/SYMKEVI, elexacaftor for TRIKAFTA/KAFTRIO and vanzacaftor for ALYFTREK). Unless otherwise noted, patent term extensions, and pediatric exclusivity periods are not reflected in the expiration dates listed in the table below and may extend protection. In some instances, we also own later-expiring patents and applications relating to solid forms, formulations, methods of manufacture, or the use of these drugs in the treatment of particular diseases or conditions. In some cases, however, such patents may not protect our drug from generic competition after the expiration of the basic patent.\nProduct\nExpiration Year\nof U.S. Basic Product Patent\nExpiration Year\nof European Basic Product Patent\nKALYDECO\n2027\n  2027 \n1\nORKAMBI\n2031\n  2030\n 1\nSYMDEKO/SYMKEVI\n2027\n  2033\n 1\nTRIKAFTA/KAFTRIO\n2037\n2037\nCASGEVY\n  2035 \n2\n    2034\n 3, 4\nALYFTREK\n2039\n2039\nJOURNAVX\n2040\n2040\n1 \nExpiration date reflects SPCs granted in the five major European markets (France, Germany, Italy, Spain and the U.K.).\n2 \nExpiration year reflects the expiration of regulatory exclusivity, which expires later than the basic product patent for this product in this market.\n3 \nExpiration year reflects the expiration of regulatory exclusivity in the E.U., which expires later than the basic product patent for this product in this market. \n4\n Product is approved in Great Britain with regulatory exclusivity until November 2033, which is later than the expiration of the basic product patent.\nIn addition to protecting our marketed products, we actively file patent applications in the U.S. and in foreign countries on inventions relating to our pipeline. For example, we also own and/or control U.S. and foreign patents and/or patent applications relating to the following:\n•\nOther CF potentiators and correctors and many other related compounds, and the use of those compounds for the treatment CF.\n•\nVX-522 and other mRNA-based approaches for treating CF.\n•\nVX-993, VX-973, and other compounds being studied for the potential treatment of pain. \n•\nInaxaplin and other compounds being studied for the potential treatment of AMKD.\n•\nPovetacicept for the treatment of IgAN.\n•\nZimislecel, VX-264, and other cell-based approaches for treating T1D.\n16\n•\nVX-670 for the treatment of DM1.\n•\nVX-407 and other compounds being studied for the potential treatment of ADPKD.\n•\nOther pre-clinical and clinical candidates and the use of such candidates to treat specified diseases.\n•\nThe manufacture, pharmaceutical compositions, related solid forms, formulations, dosing regimens, and methods of use of many of the above compounds.\nWe and CRISPR intend to rely upon a combination of rights, including patent rights, trade secret protection, and regulatory exclusivities to protect CASGEVY. CRISPR has licensed certain rights to a worldwide patent portfolio that covers various aspects of the CRISPR/Cas9 editing platform technology including, for example, compositions of matter and methods of use, including their use in targeting or cutting DNA, from Dr. Emmanuelle Charpentier. In addition to Dr. Charpentier, this patent portfolio has named inventors who assigned their rights to the Regents of the University of California or the University of Vienna, to whom we refer, together with Dr. Charpentier, as the CVC Group. CRISPR has non-exclusive or co-exclusive rights to the patent rights that protect the core CRISPR/Cas9 gene-editing technology. For example, certain third parties, including competitors, have reported obtaining a license to rights in this patent portfolio in certain fields. In addition, patents and patent applications in this patent portfolio are the subject of adversarial proceedings in the U.S., Europe, and other jurisdictions, including proceedings in the U.S. Patent and Trademark Office (the “USPTO”), between the CVC Group and, separately, Sigma-Aldrich, Co. LLC (“Sigma-Aldrich”), ToolGen, Inc. (“ToolGen”), and the Broad Institute, Harvard University, and Massachusetts Institute of Technology (collectively, “Broad”). To date, both the CVC Group and Broad have obtained granted patents that purport to cover aspects of CRISPR/Cas9 editing platform technology. The patents and patent applications within the patent portfolios of the CVC Group, Broad, Sigma-Aldrich and/or ToolGen are, or may in the future be, involved in proceedings similar to interferences or priority disputes in Europe or other foreign jurisdictions. In December 2023, we entered into an agreement with Editas Medicine, Inc. (“Editas”), providing us a non-exclusive sublicense to certain patents relating to CRISPR/Cas9 technology, owned by Broad and Harvard, which are licensed to Editas. In addition to the patent portfolios licensed from Dr. Charpentier, Broad, and Harvard, we own patents and/or patent applications relating to the composition, manufacture, and use of CASGEVY.\nFrom time to time, we enter into exclusive and non-exclusive license agreements for proprietary third-party technology used in connection with our research activities. These license agreements typically provide for the payment by us of a license fee but may also include terms providing for milestone payments or royalties for the development and/or commercialization of our drug products arising from the related research.\nWe cannot be certain that issued patents we own or license will be enforceable or provide adequate protection or that pending patent applications will result in issued patents. \nThe existence of patents does not guarantee our right to practice the patented technology or commercialize the patented product. Litigation, interferences, oppositions, \ninter partes\n reviews, administrative challenges or other similar types of proceedings may be necessary in some instances to determine the validity and scope of certain patents, regulatory exclusivities or other proprietary rights, and in other instances to determine the validity, scope or non-infringement of intellectual property rights that may be claimed by third parties to be pertinent to the manufacture, use or sale of our products. \nMANUFACTURING \nAs we market and sell our approved products and advance our product candidates through clinical development toward commercialization, we continue to build and maintain our supply chain and quality assurance resources. We rely on internal capabilities and a global network of third parties to manufacture and distribute our product candidates for clinical trials, as well as our products for commercial sale and post-approval clinical trials. In addition to establishing supply chains for each new approved product, we must adapt our supply chain for existing products to include additional formulations that are often required to treat younger patients or to increase scale of production for existing products. We are focused on ensuring the stability of the supply chains for our current products, including KALYDECO, ORKAMBI, SYMDEKO/SYMKEVI, TRIKAFTA/KAFTRIO, ALYFTREK, CASGEVY, JOURNAVX, and for our pipeline programs. In addition, we are focused on identifying and ensuring efficient manufacturing and delivery processes for the biological and cell and genetic therapies we are developing, including our stem cell therapy program for T1D and biologics manufacturing for povetacicept and other product candidates.\n17\nWe have established our own small molecule manufacturing capabilities in Boston, which we use for clinical trial and commercial supplies, including certain manufacturing steps related to our commercial supply of TRIKAFTA/KAFTRIO. We expect to continue to rely on third parties to meet our commercial supply needs, including for TRIKAFTA/KAFTRIO, CASGEVY, ALYFTREK, JOURNAVX, and pipeline programs, and a significant portion of our clinical supply needs for the foreseeable future. We have established and continue to evaluate additional manufacturing capacity for our current and future products, including recently approved ALYFTREK for CF, and JOURNAVX for pain.\nOur supply chain for sourcing raw materials and manufacturing our product and product candidates, including obtaining all necessary supplies, is a multi-step global endeavor. In general, these raw materials and other necessary supplies are available from multiple sources. Third-party contract manufacturers, including some in China, perform different parts of our manufacturing process. Contract manufacturers supply us with raw materials, convert these raw materials into drug substance and/or convert the drug substance or product into final dosage form. In addition, third parties assist us with packaging, warehousing, and global distribution of our products. Establishing and managing this global supply chain for each of our products and product candidates require a significant financial commitment and the creation and maintenance of numerous third-party contractual relationships. \nThe manufacturing processes for biological and cell and genetic therapies are more complex than those required for small molecule drugs and require different systems, equipment, facilities, and expertise. Additionally, we are unable to utilize a single process for all of our biological and cell and genetic therapies; they must be customized for each program and therapy. We are investing and plan to continue to invest significant resources in expanding and strengthening our manufacturing, infrastructure and capabilities, such as cGMP clinical manufacturing, both independently and through third-party networks, in an effort to develop and commercialize our biological and cell and genetic therapies. We have secured agreements for povetacicept and our T1D cell therapy program to meet our anticipated demands. We continue to evaluate additional suppliers for all of our late-stage clinical programs for additional capacity and redundancy to support commercial supply. \nWe rely on third-party manufacturers to produce or process cell culture reagents and gene-editing components, such as Cas9 protein and guide RNA molecules for clinical trials and commercial supply of CASGEVY, and to generate gene-edited cells to supply CASGEVY. We continue to rely on third-party manufacturers for commercial supply of CASGEVY. The manufacturing process for CASGEVY involves a number of steps prior to the final infusion of drug product into patients. Following mobilization and collection of blood cells from the patient, cells are transferred to a manufacturing site where HSPCs are purified and CRISPR/Cas9 gene-editing is performed. The edited cellular product, called CASGEVY, is frozen and transported back to the authorized treatment center where it is stored prior to infusion into the patient. Each step must be completed successfully, and in a timely manner, requiring coordination between us, authorized treatment centers, third-party manufacturers and shipping vendors. We are making significant investments to secure additional capacity and to coordinate manufacturing, testing, and logistics activities at a larger scale across multiple facilities to serve the geographies in which we are treating and expect to treat additional patients with CASGEVY.\nWe have established manufacturing capabilities in the Boston area to support our T1D program. In addition, to further expand our capabilities in cell therapy manufacturing, we have a strategic agreement with Lonza to support the manufacture of our portfolio of investigational allogeneic stem cell-derived, fully differentiated, insulin-producing islet cell therapies. We also rely on third-party manufacturers to produce drug substance and finished drug product for clinical trials for povetacicept. \nWe have developed systems and processes to track, monitor, and oversee our and our third-party manufacturers’ activities, including a quality assurance program intended to ensure that our third-party manufacturers comply with cGMP and the foreign jurisdictional equivalents when applicable. We devote substantial time, resources and effort in the areas of production, quality control, and quality assurance to maintain cGMP compliance. We regularly evaluate the performance of our third-party manufacturers with the objective of confirming their continuing capabilities to meet our needs efficiently and economically. Manufacturing facilities, both foreign and domestic, are subject to inspections by or under the authority of the FDA and other U.S. and foreign government authorities. Although we actively engage with regulatory authorities, the timing of inspections and regulatory approvals for each of these facilities is the remit of the manufacturer and not within our control and may be delayed for a number of reasons.\n18\nCOMPETITION\nThe pharmaceutical industry is characterized by extensive research efforts, rapid technological progress, and intense competition. There are many public and private companies, including pharmaceutical companies and biotechnology companies, engaged in developing products for the indications our drugs are approved to treat and the therapeutic areas we are targeting with our research and development activities. Potential competitors also include academic institutions, government agencies, other public and private research organizations and charitable venture philanthropy organizations that conduct research, seek patent protection and/or establish collaborative arrangements for research, development, manufacturing and commercialization. Mergers and acquisitions in the pharmaceutical, biotechnology and gene therapy industries may result in a larger concentration of resources among a smaller number of our competitors. Some of our competitors may have substantially greater financial, technical, marketing and human resources than we do. \nWe believe that competition in our industry is based on, among other factors, innovative research, the effective and rapid development of product candidates, the ability to market and obtain reimbursement for products and the ability to establish effective patent protection. We face competition based on the safety and efficacy of our product and product candidates, the timing and scope of regulatory approvals, the availability and cost of supply, marketing and sales capabilities, reimbursement coverage, price, patent protection and other factors. Our competitors may develop or commercialize more effective, safer, or more affordable products than we are able to develop or commercialize or obtain more effective patent protection. As a result, our competitors may commercialize products more rapidly or effectively than we do, which would adversely affect our competitive position, the likelihood that our product candidates, if approved, would achieve and maintain market acceptance and our ability to generate meaningful revenues from our products. Future competitive products may render our products, or future products, obsolete or noncompetitive. Another key element of remaining competitive in our industry is recruiting and retaining leading scientific, technical and management personnel to conduct our research activities and advance our development programs, including with the commercial expertise to effectively market our products. \nOur success in rapidly developing and commercializing our products may increase the resources that our competitors allocate to the development of potential treatments. In addition, clinical trials conducted by our competitors could take place simultaneously with our own trials and may slow down our pace of development if we are unable to recruit sufficient clinical trial subjects. If one or more competing therapies are successfully developed as a marketable treatment, our revenues from our current products and/or additional products, if then approved, could face significant competitive pressure.\nMany other pharmaceutical and biotechnology companies are investing resources for the discovery and development of small molecules and biologic and cell and gene therapies to treat the same disease areas for which we are developing therapies in our pipeline. If any of these competitors develop or successfully commercialize products involving therapies competitive with our pipeline therapies, the potential return on our investment in those pipeline therapies could be impacted.\nCystic Fibrosis\nA number of companies are seeking to identify and develop product candidates for the treatment of CF, including CFTR modulators and other therapies intended to address the underlying causes of CF.\nSionna Therapeutics, Inc. has multiple CFTR modulators in Phase 1 or Phase 2 development, including assets in-licensed from AbbVie Inc. in July 2024, and additional CFTR modulators in preclinical development. Proteostasis Therapeutics, Inc. was developing potential CFTR modulator therapies prior to its acquisition by Yumanity Therapeutics, Inc. (“Yumanity”). Following the merger, Yumanity out-licensed the CF program to Fair Therapeutics. In February 2024, HIT-CF Europe, a research project from CF-Europe, a federation of European patient advocacy groups, initiated a Phase 2b trial of a combination of Fair Therapeutics’ CFTR modulators in European CF patients with rare mutations of the CFTR gene. \nOther therapeutic approaches include addressing CF utilizing nucleic acid therapies, which are compounds that allow expression of a functional CFTR protein and are relevant for the more than 5,000 people with CF who cannot make full-length CFTR protein and cannot benefit from CFTR modulators. Nucleic acid therapies are under development by companies such as Arcturus Therapeutics Holdings, Inc., ReCode Therapeutics, Inc., Krystal Biotech, Inc., Spirovant Sciences, Inc. Boehringer Ingelheim International, GmbH, 4D Molecular Therapeutics, Inc and SpliSense, Ltd. \nSickle Cell and Beta Thalassemia\nThere are multiple approved small molecule and biologic treatments for SCD and beta thalassemia, including products from Novartis International AG (“Novartis”), and Bristol Myers Squibb together with Merck & Co. In addition, bluebird bio, \n19\nInc. (“bluebird”) obtained FDA approval of its gene therapy, ZYNTEGLO\n™\n (betibeglogene autotemcel) in August 2022 for the treatment of patients with beta thalassemia who require regular red blood cell transfusions. bluebird withdrew its marketing authorizations for Zynteglo from both the E.U. and U.K. in early 2022. In late 2023, bluebird also obtained FDA approval for its gene therapy for SCD, LYFGENIA\n™\n (lovotibeglogene autotemcel). In September 2024, Pfizer Inc. (“Pfizer”) voluntarily withdrew OXBRYTA\n®\n (voxelotor) from all markets. Authorization for Novartis’ ADAKVEO\n®\n (crizanlizumab) has been revoked in the U.K. and in Europe, however, this drug remains approved for use in the U.S. by the FDA.\nVarious companies and private academic/medical institutes are developing therapies for the treatment of SCD or beta thalassemia utilizing CRISPR technology, lentiviral vectors, or transcription activator-like effector nuclease, gene correction, base, or prime editing. For example, Beam Therapeutics has a base-editing asset in clinical development for SCD. In addition, Agios Pharmaceuticals’ Supplemental New Drug Application for PYRUKYND\n® \n(mitapivat) is under review in the U.S. for the treatment of adult patients with non-transfusion dependent and transfusion dependent alpha- or beta thalassemia. Mitapivat is also in Phase 3 for SCD.\nPain\nThe acute pain market largely consists of conventional analgesics, including opioids, non-steroidal anti-inflammatory drugs, acetaminophen and local anesthetics, low-cost generics, and reformulations aiming to provide safer, more tolerable, or more convenient therapies. Peripheral neuropathic pain is a type of chronic pain caused by injury or dysfunction of peripheral nerves. The peripheral neuropathic pain market largely consists of generic anticonvulsants and anti-depressant drugs.\nSeveral companies are pursuing clinical development of novel mechanisms of action for acute and chronic pain indications, including NaV1.8 inhibitors in Phase 1 clinical trials by Latigo Bio, Merck, and SiteOne Therapeutics. Several additional NaV1.8/1.7 inhibitors are in preclinical development for pain, and there are several other compounds with other mechanisms of action in development, including programs by Eli Lilly and Company (“Eli Lilly”) and Lexicon Pharmaceuticals Inc.\nT1D\nThe T1D standard of care of exogenous insulin injections continues to progress as multiple companies are developing novel insulin formulations, advanced pumps and glucose sensors, and fully closed loop systems. Pharmaceutical and biotechnology companies are actively engaged in the research and development of products for T1D, including strategies to prevent the destruction of beta cells, to protect beta cell function, or to replace missing beta cells, as well as other cell therapy approaches such as immune evasive technologies to hide the cell from the immune system, micro- and macro-encapsulation technologies that potentially require no immunosuppression, and islets cell in combination with immunosuppression. In addition to CellTrans, Inc.’s LANTIDRA™ (donislecel), the first FDA-approved cadaveric islet therapy for the treatment of T1D, other companies developing cell therapies for T1D, either directly or through partnerships, include Novo Nordisk A/S, Eli Lilly, Sernova Corp, Sana Biotechnology, Inc., Seraxis, Inc., and Evotec A.G.\nAMKD\nThere are no approved therapies for AMKD. People with chronic kidney disease (“CKD”) take angiotensin-converting enzyme inhibitors and angiotensin receptor blockers to treat hypertension; steroids and immunosuppressants to reduce proteinuria; and SGLT2 inhibitors to reduce the risk of CKD progression. These CKD treatments may reduce proteinuria, but do not stop the rapid disease progression seen in AMKD patients. Several companies have early programs developing APOL1-targeted assets, including AstraZeneca, Maze Therapeutics, and OmniAb. Eli Lilly’s Janus kinase inhibitor (baricitinib) is being investigated in AMKD patients in a Phase 2 study by Duke University.\nIgAN\nIgAN is a rapidly evolving landscape with multiple potentially disease-modifying therapies in late-stage clinical development. There are three novel therapies for IgAN approved in major markets: Calliditas’ TARPEYO\n®\n/KINPEYGO\n® \n(delayed release budesonide), Travere Therapeutics’ FILSPARI\n® \n(sparsentan), a dual endothelin angiotensin receptor antagonist, and Novartis’ FABHALTA\n®\n (iptacopan), a complement factor B inhibitor. Programs in late-stage clinical development include Otsuka Pharmaceutical Co., Ltd’s sibeprenlimab (anti-APRIL mAb), Vera Therapeutics’ atacicept (dual BAFF/APRIL inhibitor), RemeGen’s telitacicept (dual BAFF/APRIL inhibitor), Novartis’ zigakibart (anti-APRIL mAb), and other programs from Novartis, Roche (and partner Ionis Pharmaceuticals), and AstraZeneca. Other mid-stage clinical \n20\nprograms include anti-CD38 mAbs from Biogen and Takeda. In addition, there is significant global preclinical and earlier stage clinical development activity for IgAN.\nGOVERNMENT REGULATION\nOur operations and activities are subject to extensive regulation by numerous government authorities in the U.S., Europe and other countries. In the U.S., Europe and other countries, our products are subject to rigorous regulations governing their testing, manufacture, labeling, storage, record keeping, approval, and advertising and promotion. As a result of these regulations, product development and product approval processes are very expensive and time consuming. The regulatory requirements applicable to drug and biologic development, approval, and marketing are subject to change. In addition, regulations and administrative guidance often are revised or reinterpreted by the agencies in ways that may significantly affect our business and our products. It is impossible to predict whether legislative changes will be enacted, or FDA or comparable ex-U.S. regulations, guidance or interpretations will change.\nUnited States Government Regulation\nNew Drug Application and Biologics License Application Approval Processes\nThe process required by the FDA before a drug or biologic may be marketed in the U.S. generally involves the following:\n•\ncompletion of preclinical laboratory tests, animal studies and formulation studies conducted according to Good Laboratory Practices (“GLP”), and other applicable regulations;\n•\nsubmission to the FDA of an IND, which must become effective before clinical trials in the U.S. may begin;\n•\nperformance of adequate and well-controlled clinical trials according to Good Clinical Practices (“GCP”), and other clinical trial-related regulations to establish the safety and efficacy of the proposed drug for its intended use;\n•\nsubmission to the FDA of a New Drug Application (“NDA”) or a BLA;\n•\nsatisfactory completion of a pre-approval FDA inspection of the manufacturing facility or facilities at which the product will be produced to assess compliance with cGMP; and\n•\nFDA review and approval of the NDA or BLA.\nOnce a drug or biologic is identified for development, it enters the preclinical testing stage. Preclinical tests include laboratory evaluations of product chemistry, toxicity and formulation, as well as animal pharmacology and toxicology studies. An IND sponsor must submit the results of the preclinical tests, together with manufacturing information and analytical data, to the FDA as part of the IND, which seeks FDA approval to test the drug or biologic in humans. Preclinical or nonclinical testing typically continues even after the IND is submitted. \nIf the FDA accepts the IND, the drug or biologic can then be studied in human clinical trials to determine if the product candidate is safe and effective. Clinical trials involve three separate phases that often overlap, can take many years and are expensive. These three phases, which are subject to considerable regulation, are as follows:\n•\nPhase 1. \nThe drug or biologic initially is introduced into a limited number of healthy human subjects or patients with the target disease or condition and tested for safety, dosage tolerance, absorption, metabolism, distribution and elimination. In the case of some drugs or biologics for severe or life-threatening diseases, such as cancer, especially when the drug or biologic may be inherently too toxic to ethically administer to healthy volunteers, the initial human testing is often conducted in patients.\n•\nPhase 2. \nClinical trials are next initiated in a limited patient population with the specified disease or condition the drug or biologic is intended to treat to identify possible adverse effects and safety risks, to preliminarily evaluate the efficacy of the drug or biologic candidate for the disease or condition it is intended to treat and to determine dosage tolerance and optimal dosage.\n21\n•\nPhase 3. \nClinical trials are undertaken to further evaluate dosage, clinical efficacy and safety in an expanded patient population at geographically dispersed clinical trial sites. These clinical trials are intended to establish the overall risk-benefit ratio of the drug or biologic and provide an adequate basis for regulatory approval and product labeling.\nIt is possible that Phase 1, Phase 2 and Phase 3 testing may not be completed successfully within any specified period, if at all. The FDA or the sponsor may, at any time during the initial 30-day IND review period or while clinical trials are ongoing under the IND, impose a partial or complete clinical hold or suspend a clinical trial at any time for a variety of reasons, including a finding that the healthy volunteers or patients are being exposed to an unacceptable health risk. Progress reports detailing the results of the clinical trials must be submitted at least annually to the FDA and more frequently in other situations, and the occurrence of serious adverse events must also be reported. Information about certain clinical trials must be submitted within specific timeframes to the National Institutes of Health for public dissemination on the \nwww.clinicaltrials.gov\n website.\nPost-approval trials, sometimes referred to as Phase 4 clinical trials, may be conducted after initial marketing approval. These trials are used to gain additional experience from the treatment of patients in the intended therapeutic indication and are commonly intended to generate additional safety data regarding use of the product in a clinical setting. In certain instances, the FDA may mandate the performance of Phase 4 clinical trials as a condition of approval of an NDA or BLA.\nThe results of drug or biologic development, preclinical studies and clinical trials, along with descriptions of the manufacturing process, analytical tests conducted on the chemistry of the drug or biologic, proposed labeling and other relevant information are submitted to the FDA as part of an NDA or BLA requesting approval to market the drug or biologic. The FDA reviews each NDA or BLA submitted to ensure that it is sufficiently complete for substantive review before it accepts it for filing. It may request additional information rather than accept an NDA or BLA for filing. \nOnce the submission is accepted for filing, the FDA begins an in-depth review. The FDA reviews an NDA or BLA to determine, among other things, whether a drug or biologic is safe and effective for its intended use and whether its manufacturing is cGMP-compliant to assure and preserve the drug or biologic’s identity, strength, quality and purity. The FDA may refer the NDA or BLA to an advisory committee for review and recommendation as to whether the NDA or BLA should be approved and under what conditions. The FDA is not bound by the recommendation of an advisory committee, but it generally follows such recommendations. Before approving an NDA or BLA, the FDA will inspect the facility or facilities where the drug or biologic is manufactured and tested. Additionally, before approving an NDA or BLA, the FDA may inspect one or more clinical trial sites to assure compliance with GCP requirements.\nThe FDA may require, as a condition of approval, restricted distribution and use, enhanced labeling, special packaging or labeling, expedited reporting of certain adverse events, submission of promotional materials, restrictions on direct-to-consumer advertising or commitments to conduct additional research post-approval. The FDA will issue a complete response letter if the agency decides not to approve the NDA or BLA in its present form. \nExpedited Review and Approval\nThe FDA has developed a number of distinct approaches to make new drugs or biologics available as rapidly as possible in cases where there is no available treatment or there are advantages over existing treatments.\nThe FDA may grant “accelerated approval” to products that have been studied for their safety and effectiveness in treating serious illnesses and that provide meaningful therapeutic benefit to patients over existing treatments. For accelerated approval, the product must have an effect on a surrogate endpoint or an intermediate clinical endpoint that is considered reasonably likely to predict the clinical benefit of a drug, such as an effect on irreversible morbidity and mortality. When approval is based on surrogate endpoints or clinical endpoints other than survival or morbidity, the sponsor will be required to conduct additional post-approval clinical studies to verify and describe the clinical benefit. These studies are known as “confirmatory trials.” Approval of a drug may be withdrawn, or the labeled indication of the drug changed if these trials fail to verify clinical benefit or do not demonstrate sufficient clinical benefit to justify the risks associated with the drug or biologic. \nThe FDA may grant “fast track” status to products that treat serious diseases or conditions and demonstrate the potential to address an unmet medical need. Fast track is a process designed to facilitate the development and expedite the review of such products by providing, among other things, more frequent meetings with the FDA to discuss the product’s development plan and rolling review, which allows submission of individually completed sections of an NDA or BLA for FDA review \n22\nbefore the entire submission is completed. Fast track status does not ensure that a product will be developed more quickly or receive FDA approval.\n“Breakthrough Therapy” designation is a process designed to expedite the development and review of drugs or biologics that are intended to treat a serious condition and preliminary clinical evidence indicates that the drug or biologic may demonstrate substantial improvement over available therapy on one or more clinically significant endpoints. Breakthrough Therapy designation provides all of the benefits of fast-track designation in addition to robust FDA-sponsor interaction and communication to help to identify the most efficient and expeditious path for clinical development while minimizing the number of patients placed in ineffective control regimens.\n“Regenerative Medicine Advanced Therapy,” (“RMAT”) designation is a process created by the 21st Century Cures Act in December 2016. A product is eligible for RMAT designation if it is a regenerative medicine therapy that is intended to treat, modify, reverse or cure a serious disease or condition, and if preliminary clinical evidence indicates that the product has the potential to address unmet medical needs for such disease or condition. The benefits of RMAT designation include the benefits available to breakthrough therapies, including potential eligibility for priority review and accelerated approval based on surrogate or intermediate endpoints. \nThe FDA may grant “priority review” status to a product that, if approved, would provide significant improvement in the safety or effectiveness of the treatment, diagnosis, or prevention of serious conditions. Priority review is intended to reduce the time it takes for the FDA to review an NDA or BLA, with the goal to take action on the application within six months from when the application is filed, compared to ten months for a standard review.\nManufacturing Quality Control\nAmong the conditions for NDA or BLA approval is the requirement that the prospective manufacturer’s quality control and manufacturing procedures continually conform with cGMP. Manufacturers must devote substantial time, money and effort in the areas of production, quality control, and quality assurance to maintain cGMP compliance. Material changes in manufacturing equipment, location, or process, may result in additional regulatory review and approval. The FDA, and other regulatory agencies, conduct periodic visits to inspect equipment, facilities, and processes following the initial approval of a product. If a manufacturing facility is not in substantial compliance with the applicable regulations and requirements imposed when the product was approved, regulatory or judicial enforcement action may be initiated, which may include a warning letter, suspension of manufacturing, product seizure, or an injunction against shipment of products from the facility and/or recall of products previously shipped. We rely, and expect to continue to rely, on third parties for the production of our products. Future FDA, state, and foreign inspections may identify compliance issues at the facilities of our contract manufacturers that may disrupt manufacture or distribution of our products or require substantial resources to correct.\nPost-approval Requirements\nOnce an approval is granted, the FDA may withdraw the approval if compliance with regulatory requirements is not maintained or if problems occur after the product reaches the market. Later discovery of previously unknown problems with a product may result in restrictions on the product or complete withdrawal of the product from the market. In addition, the sponsor of an approved drug in the U.S. may not promote that drug for unapproved, although a physician may prescribe a drug for an unapproved use in accordance with the practice of medicine. The FDA and other agencies actively enforce the laws and regulations prohibiting the promotion of unapproved uses, as well as false or misleading promotion. Further, after approval, some types of changes to the approved product, such as adding new indications, manufacturing changes and additional labeling claims, are subject to further FDA review and approval. In addition, the FDA may require testing, including Phase 4 trials, and surveillance programs to monitor the effect of approved products that have been commercialized, and the FDA has the power to prevent or limit further marketing of a product based on the results of these post-marketing programs. \nProducts we manufacture or distribute pursuant to FDA approvals are subject to continuing regulation by the FDA, including, among other things:\n•    record-keeping requirements;\n•    reporting of adverse experiences with the product;\n•    providing the FDA with updated safety and efficacy information;\n23\n•    drug sampling and distribution requirements;\n•    notifying the FDA and gaining its approval of specified manufacturing or labeling changes;\n•    complying with certain electronic records and signature requirements; and\n•    complying with FDA promotion and advertising requirements.\nFailure to comply with the applicable U.S. requirements at any time during the drug or biologic development process, approval process or after approval, may subject us or our collaborators to administrative or judicial sanctions, any of which could have a material adverse effect on us. These sanctions could include:\n•    restrictions on marketing or manufacturing of the product; \n•    safety alerts, Dear Healthcare Provider letters, press releases, or other communications containing warnings or other safety information about the product;\n•    refusal to approve or delay in review of pending applications;\n•    withdrawal of an approval or the implementation of limitations on a previously approved indication for use;\n•    imposition of a clinical hold, a risk evaluation and mitigation strategy (“REMS”) or other safety-related limitations;\n•    warning letters or “untitled letters;”\n•    product seizures, recalls, or detentions, or refusal to permit the import or export of products;\n•    total or partial suspension of production or distribution; \n•    consent decrees, corporate integrity agreements, debarment or exclusion from federal healthcare programs; or\n•    injunctions, fines, disgorgement, refusals of government contracts, or civil or criminal penalties.\nThe FDA typically advises that patients treated with gene therapy undergo follow-up observations for potential adverse events for a 15-year period. As part of the FDA approval of CASGEVY for the treatment of SCD and TDT, we are required to conduct two post-marketing requirement (“PMR”) safety studies to assess the long-term risk of hematologic malignancies and off-target genome editing effects by CRISPR/Cas9. Both PMR safety studies are consistent with the FDA’s guidance for industry on Long Term Follow-up After Administration of Human Gene Therapy Products. \nUnited States Patent Term Restoration and Regulatory Exclusivity\nUpon approval, products may be entitled to certain kinds of exclusivity under applicable intellectual property and regulatory regimes. The Drug Price Competition and Patent Term Restoration Act of 1984 (commonly known as the Hatch-Waxman Act) permits a patent restoration term of up to five years as compensation for patent term lost during product development and the FDA regulatory review process. The length of the patent extension is roughly based on 50 percent of the period of time from the filing of an IND for a compound to the submission of the NDA for such compound, plus 100 percent of the time period from NDA submission to regulatory approval. The extension, however, cannot exceed five years and the patent term remaining after regulatory approval cannot exceed 14 years.\nIf the FDA approves a drug product that contains a new chemical entity not previously approved, the product is typically entitled to five years of non-patent regulatory exclusivity. Other products may be entitled to three years of exclusivity if approval was based on the FDA’s reliance on new clinical studies essential to approval submitted by the NDA applicant. \nBiologics are also entitled to exclusivity under the Biologics Price Competition and Innovation Act (the “BPCIA”), which was passed as Title VII to the ACA. The law provides a pathway for approval of products that are biosimilar to or interchangeable with an FDA-licensed reference biological product. Under the BPCIA, a reference biological product is granted 12 years of data exclusivity, the period of time during which an innovator’s clinical data cannot be used by other companies, from the time of first licensure of the product, and an application for a biosimilar product may not be submitted to the FDA until four years following the date that the reference product was first licensed by the FDA. In addition, the approval of a biosimilar product may not be made effective by the FDA until 12 years from the date on which the reference product \n24\nwas first licensed. The BPCIA also created certain exclusivity periods for biosimilars approved as interchangeable products. At this juncture, it is unclear whether products deemed “interchangeable” by the FDA will, in fact, be readily substituted by pharmacies, which are governed by state pharmacy law. Biologics are also eligible for orphan drug exclusivity, as discussed below. The law also includes an extensive process for the innovator biologic and biosimilar manufacturer to litigate patent infringement, validity, and enforceability prior to the approval of the biosimilar. There have been ongoing federal legislative and administrative efforts as well as judicial challenges seeking to repeal, modify or invalidate some or all of the provisions of the ACA. While none of those efforts have focused on changes to the provisions of the ACA related to the biosimilar regulatory framework, if the ACA is repealed, substantially modified, or invalidated, it is unclear what, if any, impact such action would have on biosimilar regulation.\nIf the NDA or BLA applicant studies the product for use by children, the FDA may grant pediatric exclusivity, which extends by 180 days each existing exclusivity (patent and regulatory) related to the product.\nOrphan Drug Designation and Exclusivity\nUnder the Orphan Drug Act, the FDA may grant orphan drug designation to drugs or biologics intended to treat a rare disease or condition, which is generally a disease or condition that affects fewer than 200,000 people in the U.S. \nIf a drug or biologic that has orphan drug designation subsequently receives the first FDA approval for that drug or biologic for the disease for which it has such designation, the product is entitled to orphan drug exclusivity, which means that the FDA may not approve any other applications to market the same drug for the same disease or condition for seven years following marketing approval, except in certain very limited circumstances, such as if the later product is shown to be clinically superior to the orphan product. Orphan drug exclusivity, however, also could block the approval of our products for seven years if a competitor first obtains approval of the same drug, as defined by the FDA, for the same disease or condition for which we were seeking approval. KALYDECO, ORKAMBI, SYMDEKO, TRIKAFTA, ALYFTREK and CASGEVY have been granted orphan drug exclusivity by the FDA.\nWe may pursue orphan drug designation for certain of our future product candidates. Even if we obtain orphan drug designation for a product candidate, we may not be the first to obtain marketing approval for the product candidate for any particular orphan indication due to the uncertainties associated with developing novel therapies. Further, even if we obtain orphan drug exclusivity for a product candidate, that exclusivity may not effectively protect the product from competition because orphan drug exclusivity does not prevent different drugs from being approved for the same condition. Moreover, orphan drug exclusivity may not prevent the approval of another sponsor’s product that is considered to be the same drug for a different disease or condition, even where such product could be prescribed for an unapproved indication that is protected by orphan drug exclusivity. Even after an orphan drug is approved, regulators may subsequently approve the same drug made by another manufacturer for the same condition if the regulator concludes that the later drug is safer, more effective, or makes a major contribution to patient care. Orphan drug designation neither shortens the development time or regulatory review time of a drug or biologic nor gives the drug or biologic any advantage in the regulatory review or approval process.\nForeign Regulation\nWe conduct clinical trials and market our products in numerous jurisdictions outside the U.S. Most of these jurisdictions have clinical trial, product approval and post-approval regulatory processes that are similar in principle to those in the U.S. Thus, whether or not we obtain FDA approval for a product candidate, we must obtain approval from the comparable regulatory authorities of foreign countries or economic areas, such as the E.U., before we can commence clinical trials or market products in those countries or areas. The approval process and requirements governing the conduct of clinical trials, product licensing, pricing and reimbursement vary greatly from place to place, and the time may be longer or shorter than that required for FDA approval.\nUnder the E.U. regulatory system, a company may submit marketing authorization applications either under a centralized or decentralized procedure. The centralized procedure, which is compulsory for orphan medicines, medicines produced by biotechnology, and those medicines intended to treat AIDS, cancer, neurodegenerative disorders, or diabetes, and optional for those medicines that are highly innovative, provides for the grant of a single marketing authorization that is valid for all E.U. member states. In addition to the centralized procedure, the E.U. also has a nationalized procedure, which requires a separate application to and approval determination by each country; a decentralized procedure, whereby applicants submit identical applications to several countries and receive simultaneous approval; and a mutual recognition procedure, where applicants submit an application to one country for review and other countries may accept or reject the initial decision.\n25\nAdditionally, our European headquarters and European research facility are located in the U.K. Despite the U.K. formally withdrawing from the E.U. on January 31, 2020, a number of E.U. regulations were retained in U.K. law. The U.K. government has communicated an intent to remove or replace some of these E.U. provisions, which may increase some regulatory divergence between the U.K. and the E.U. Given the uncertainty as to what changes may be incorporated into U.K. law, it is unclear if any such changes could adversely affect our business, financial condition, and operating results.\nRegulations Concerning Reimbursement\nSales of our products depend, to a large degree, on the extent to which our products will be reimbursed by third-party payors, such as government health programs, commercial insurance, and managed health care organizations. Increasingly, these third-party payors are becoming stricter in the ways they evaluate and reimburse medical products and services. Additionally, the containment of health care costs has become a priority of many governments, and the prices of drugs have been a focus in this effort. The U.S. government, state legislatures and foreign governments have shown significant interest in implementing cost-containment programs, including price controls, restrictions on reimbursement and requirements for substitution of generic products. Adoption of price controls and cost-containment measures, and adoption of more restrictive policies in jurisdictions with existing controls and measures, could limit our revenues. Decisions by third-party payors to not cover a product could reduce physician usage of the product.\nIn the U.S., we participate in the Medicaid Drug Rebate program, Medicare, and other governmental pricing programs. Medicaid is a joint federal and state program that is administered by the states for low-income and disabled beneficiaries. Under the Medicaid Drug Rebate program, we are required to pay a rebate to each state Medicaid program for our covered outpatient drugs, which includes select inpatient drugs for which there is “direct reimbursement.” Medicaid rebates are based on pricing data reported by us on a monthly and quarterly basis to CMS, the federal agency that administers the Medicaid and Medicare programs. \nAny company that participates in the Medicaid Drug Rebate program also must participate in the 340B drug pricing program (the “340B program”), and the Federal Supply Schedule (“FSS”) pricing program. The 340B program, which is administered by the Health Resources and Services Administration, requires participating companies to agree to charge statutorily defined “covered entities” no more than the 340B “ceiling price” for covered outpatient drugs. The 340B ceiling price is calculated using a statutory formula, which is based on pricing data calculated under the Medicaid Drug Rebate Program. The FSS pricing program, which is administered by the Department of Veterans Affairs (“VA”), also requires participating companies to extend discounted prices to the VA, Department of Defense, Coast Guard, and Public Health Service. Similar to the 340B program, FSS prices are calculated utilizing pricing data reported by us to the VA on a quarterly and annual basis.\nThe Medicare program includes “Part A” that generally covers certain hospital services for eligible beneficiaries. In general, Part A covers inpatient hospital services, skilled nursing, and hospice care. Most individuals are enrolled in Medicare Part A upon reaching age 65 (although other individuals qualify for Part A, including those receiving services for end stage renal disease). Prescription drugs that are used as part of an inpatient hospital stay will be covered by Medicare Part A, and these products typically are paid as part of a bundled or composite rate (e.g., diagnosis related group).\nThe Medicare Part D program provides a voluntary prescription drug benefit to Medicare beneficiaries. Under “Part D,” Medicare beneficiaries may enroll in prescription drug plans offered by private entities, which provide coverage of outpatient prescription drugs such as our acute pain and CF medicines. Unlike Medicare Part A and B, Part D coverage is not standardized. Part D prescription drug plan sponsors are not required to pay for all covered Part D drugs, and each drug plan can develop its own drug formulary that identifies which drugs it will cover and at what tier or level. Any formulary used by a Part D prescription drug plan must be developed and reviewed by a pharmacy and therapeutics committee. U.S. government payment for some of the costs of prescription drugs may increase demand for products for which we receive marketing approval. \nPrivate payors often follow Medicare coverage policy and payment limitations in setting their own payment rates. As a result, any reduction in payment that results from Part D reimbursement may result in a similar reduction in payments from non-governmental payors for our products. Additionally, private payors, including health maintenance organizations and pharmacy benefit managers in the U.S., are adopting more aggressive utilization management techniques, and are increasingly applying restrictive plan designs that can impact patients and manufacturers and they continue to push for significant discounts and rebates from manufacturers. As a consequence, these payors may not cover or adequately reimburse for use of our products or may do so at levels that disadvantage them relative to competitive products.\n26\nThe U.S. government has shown significant interest in implementing cost-containment programs for medicines and has enacted reforms at the state and federal level designed to, among other things, modify prescription drug reimbursement amounts and methodologies, and otherwise control health care costs. The Patient Protection and Affordable Care Act (“ACA”) was enacted in March 2010 and was designed to expand coverage for the uninsured while at the same time containing overall health care costs. With regard to pharmaceutical products, among other things, the ACA was designed to expand and increase industry rebates for drugs covered under Medicaid programs, impose an annual fee on branded pharmaceutical manufacturers, subject biological products to potential competition by lower-cost biosimilars, and make changes to the coverage requirements under the Medicare Part D program. Additionally, in August 2022, the Inflation Reduction Act (“IRA”) was enacted, establishing a Medicare Drug Price Negotiation Program, a Medicare inflationary rebate, and a redesign of the Part D benefit structure. Certain drugs, including our CF medicines and CASGEVY, are excluded from the IRA negotiation program. Nevertheless, other elements of the IRA may have a material impact on our business, including the redesign of the Part D benefit and the new Manufacturer Discount Program, which will require manufacturers to take on more of the beneficiary cost previously subsidized by the federal government through the application of increased drug discounts. Under the Non-Opioids Prevent Addiction in the Nation (“NOPAIN”) Act, CMS reimbursement for novel, oral, non-opioids will include an add-on payment when the drug is used in the hospital outpatient and ambulatory surgery center settings. We expect that JOURNAVX, our recently approved medicine for the treatment of moderate-to-severe acute pain, will qualify for inclusion on the list of applicable drugs under the NOPAIN Act. \nWe anticipate that the U.S. government will continue to engage in activities seeking to address drug pricing and reimbursement. Furthermore, certain states have enacted laws establishing Prescription Drug Affordability Boards (“PDABs”). Some state PDABs, including those in Colorado, Maryland, Washington, and Minnesota, either have the authority or have defined a pathway pursuant to which they may be granted the authority to establish upper payment limits for prescription drugs. In certain states, there is pending litigation that would establish a PDAB or expand the authority of an existing PDAB.\nIn Europe and other foreign jurisdictions, the success of our products depends largely on obtaining and maintaining government reimbursement, because patients are generally unable to access prescription pharmaceutical products that are not reimbursed by their governments. In some countries, such as Germany, commercial sales of a new product may begin while pricing and reimbursement terms are under discussion. In other countries, a company must complete reimbursement negotiations prior to the commencement of commercial supply of the pharmaceutical product. The requirements governing drug pricing vary widely country-by-country and region-by-region. For example, the member states of the E.U. can restrict the range of drugs for which their national health insurance systems provide reimbursement and can control the prices of prescription drugs. In addition, many ex-U.S. government payors require companies to provide health economic assessments of products, which are evaluated by government agencies set up for this purpose. A member state may approve a specific price for the drug, or it may instead adopt a system of direct or indirect controls on the total amount of money that a company may receive for supply of a drug. Countries also may consider increasing mandatory discounts over time in an attempt to manage increased demands on healthcare budgets. Reimbursement discussions in foreign countries often result in a reimbursement price that is lower than the net price that companies can obtain for the product in the U.S. In addition, reimbursement discussions may take a significant period of time resulting in commercialization delays. In some countries where reimbursement has not yet been obtained, or where there are a limited number of eligible people and our medicines or therapies are unregistered, the governments of such countries may agree to purchase our medicines and therapies on an unlicensed and/or named patient basis. Reimbursement for our products cannot be assured because a country or region may only provide for reimbursement on terms that we do not deem adequate. Further, many ex-U.S. governments have introduced or are in the process of introducing legislation focusing on cost containment measures in the pharmaceutical industry. The impact of these laws where finalized, the final form of laws under consideration, and their relevant practical application, are unknown at this time, but may lead to lower prices, paybacks, or other forms of discounts or special taxes.\nOther Regulations\nPharmaceutical companies are also subject to various laws pertaining to healthcare “fraud and abuse,” including the federal Anti-Kickback Statute (“AKS”), the False Claims Act (“FCA”), and other state and federal laws and regulations. In the U.S., the Anti-Kickback Statute generally makes it illegal to knowingly and willfully solicit, offer, receive or pay any remuneration in return for or to induce the referral of business, including the purchase or prescription of a particular drug that is reimbursed by a state or federal health care program. The FCA prohibits knowingly and willingly presenting or causing to be presented for payment to third-party payors (including Medicare and Medicaid), any claims for reimbursed drugs or services that are false or fraudulent, claims for items or services not provided as claimed or claims for medically unnecessary \n27\nitems or services. Violations of fraud and abuse laws may be punishable by criminal and/or civil sanctions, including fines and civil monetary penalties, as well as by the possibility of exclusion from federal healthcare programs (including Medicare and Medicaid). Liability under the FCA may also arise when a violation of certain laws or regulations related to the underlying products (e.g., violations regarding improper promotional activity, manufacturing regulations, or unlawful payments) contributes to the submission of a false claim. If we were subject to allegations concerning, or convicted of violating, these laws, our business could be harmed.\nLaws and regulations also have been enacted by the federal government and various states to regulate the sales and marketing practices of pharmaceutical manufacturers. The laws and regulations generally limit financial interactions between manufacturers and health care providers, require manufacturers to adopt certain compliance standards or require disclosure to the government and public of such interactions. The laws include U.S. federal and state “sunshine” provisions. The federal sunshine provisions apply to pharmaceutical manufacturers with products reimbursed under certain government programs and require those manufacturers to disclose annually to the federal government (for re-disclosure to the public) certain payments and other transfers of value made to physicians, physicians assistants, advanced practice registered nurses, and teaching hospitals. State laws may also require disclosure of pharmaceutical pricing information and marketing expenditures. Many of these laws and regulations contain requirements that are subject to interpretation. Outside the U.S., other countries have implemented requirements for disclosure of financial interactions with healthcare providers and additional countries may consider or implement such laws.\nWe are subject to various federal and foreign laws that govern our international business practices with respect to payments to government officials. Those laws include the U.S. Foreign Corrupt Practices Act (“FCPA”), which prohibits U.S. companies and their representatives from paying, offering to pay, promising, or authorizing the payment of anything of value to any foreign government official, government staff member, political party, or political candidate for the purpose of obtaining or retaining business or to otherwise obtain favorable treatment or influence a person working in an official capacity. In many countries, the health care professionals we regularly interact with may meet the FCPA’s definition of a foreign government official. We are also subject to U.K. Bribery Act 2010 (“the Bribery Act”), which proscribes giving and receiving bribes in the public and private sectors, bribing a foreign public official, and failing to have adequate procedures to prevent employees and other agents from giving bribes. U.S. companies that conduct business in the U.K. generally will be subject to the Bribery Act.\nOur collection and use of personal data as part of our business activities is subject to various privacy and data security laws and regulations, including oversight by various regulatory or other governmental bodies, in the U.S., E.U., U.K., Canada, Australia, Brazil, Saudi Arabia and other jurisdictions. Such laws and regulations have the potential to affect our business materially, continue to evolve and increasingly are being enforced.\nOur present and future business has been and will continue to be subject to various other laws and regulations. Various laws, regulations, and recommendations relating to safe working conditions, laboratory practices, the experimental use of animals, and the purchase, storage, movement, import, export and use and disposal of hazardous or potentially hazardous substances are or may be applicable to our activities. In addition, as we expand our pipeline and contemplate different approaches that may incorporate the use of medical devices, such approaches may necessitate compliance with regulatory laws applicable to medical devices, including those governing the testing, manufacture, approval, distribution, and marketing of medical devices. Furthermore, the extent of government regulation, which might result from future legislation or administrative action, cannot accurately be predicted.\nWe have a global corporate compliance program designed to actively identify, prevent, and mitigate healthcare fraud and abuse risk through, among other things, the implementation of compliance policies and systems and through the promotion of a culture of compliance. We will continue to devote substantial resources to enhance and expand our corporate compliance program as necessary to help us manage and mitigate our evolving compliance risk environment as our business grows and expands globally. Even with these measures, however, we cannot guarantee compliance with the various complex laws and regulations to which we are subject now or in the future.\nEMPLOYEES AND HUMAN CAPITAL MANAGEMENT\nAs of December 31, 2024, we had approximately 6,100 employees. Of these employees, approximately 5,100 were based in the U.S. and approximately 1,000 were based outside the U.S. None of our U.S. employees are covered by a collective \n28\nbargaining agreement. A small number of employees outside the U.S. are covered by such agreements due to local law or industry requirements. We consider our relations with our employees to be good. We face intense competition for our personnel from our competitors and other companies throughout our industry and from universities and research institutions. At times, when industry conditions are positive, we may face challenges in recruiting and retaining employees across the biotechnology industry due to industry job market dynamics.\nWe rely on skilled, experienced, and innovative employees to conduct the operations of our company. The biotechnology industry is very competitive, and recruiting and retaining such employees is important to the continued success of our business. We are committed to building an outstanding, committed, and passionate team, and we focus on a culture that values all employees. We focus on recruiting, retaining, and developing qualified and talented employees from a diverse range of backgrounds to conduct our research, development, commercial, and other business activities because we believe that each employee brings unique perspectives and strengths, and by embracing these strengths, we can do our best work for patients. \nWe view diversity through a broad lens that encompasses culture, backgrounds, experiences, and worldview to foster creativity and innovation. Our initiatives include learning, resources, and forums that promote belonging in our workplaces; five global employee resource networks that promote connectivity and collaboration across levels and functions; and investments to support equal opportunity in our surrounding communities. \nTo promote our employees’ continued well-being, we offer comprehensive benefits and resources, including those focused on health and income protection, such as life insurance and retirement savings programs. We continue to promote and enhance wellness tools supporting our employees’ mental, social, physical and financial health. We continually review and augment our programs to include benefits that support the evolving needs of our workforce. \nIn addition, we provide our employees with career development and advancement opportunities, including job rotations, mentoring, and managerial training. We are committed to identifying and developing our next generation of leaders and have developed programs focused on manager excellence, talent and succession for critical roles in our organization. \nOTHER MATTERS\nFinancial Information and Significant Customers\nWe operate in one segment, pharmaceuticals. Financial information about our revenue by product and significant customers is set forth in Note Q, “Segment Information,” to our consolidated financial statements included in this Annual Report on Form 10-K.\nInformation Available on the Internet\nOur internet address is \nwww.vrtx.com. \nOur annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, and all amendments to those reports, are available to you free of charge through the “Investors/Financial Information/SEC Filings” section of our website as soon as reasonably practicable after those materials have been electronically filed with, or furnished to, the Securities and Exchange Commission.\nCorporate Information\nVertex was incorporated in Massachusetts in 1989, and our principal executive offices are located at 50 Northern Avenue Boston, Massachusetts 02210.\n29\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS \nThe names, ages and positions held by our executive officers are as follows:\nName\nAge\nPosition\nReshma Kewalramani, M.D.\n52\nChief Executive Officer and President\nJeffrey M. Leiden, M.D., Ph.D.\n69\nExecutive Chairman\nDavid Altshuler, M.D., Ph.D. \n60\nExecutive Vice President, Chief Scientific Officer\nStuart A. Arbuckle\n59\nExecutive Vice President, Chief Operating Officer\nE. Morrow “Morrey” Atkinson, III, Ph.D.\n59\nExecutive Vice President, Chief Technical Operations Officer, Head of Biopharmaceutical Science and Manufacturing Operations\nJonathan Biller, J.D.\n61\nExecutive Vice President, Chief Legal Officer\nCarmen Bozic, M.D.\n62\nExecutive Vice President, Global Medicines Development and Medical Affairs, and Chief Medical Officer\nAmit K. Sachdev, J.D.\n57\nExecutive Vice President, Chief Patient and External Affairs Officer\nOurania “Nia” Tatsis, Ph.D.\n55\nExecutive Vice President, Chief Regulatory and Quality Officer\nCharles F. Wagner, Jr.\n56\nExecutive Vice President, Chief Financial Officer\nKristen C. Ambrose, CPA\n48\nSenior Vice President, Chief Accounting Officer\nDuncan J. McKechnie\n56\nSenior Vice President, Head of North America Commercial\nDr. Kewalramani has been our Chief Executive Officer and President since April 2020 and a member of our Board of Directors since February 2020. Dr. Kewalramani was our Executive Vice President and Chief Medical Officer from April 2018 through April 2020. She was our Senior Vice President, Late Development from February 2017 until April 2018. Dr. Kewalramani also served on the board of Ginkgo Bioworks from September 2021 to June 2024. From August 2004 to January 2017, she served in roles of increasing responsibility at Amgen Inc., most recently as Vice President and Head of U.S. Medical Organization. From 2014 through 2019, Dr. Kewalramani was the industry representative to the FDA’s Endocrine and Metabolic Drug Advisory Committee. She completed her internship and residency in Internal Medicine at the Massachusetts General Hospital and her fellowship in Nephrology at the Massachusetts General Hospital and Brigham and Women’s Hospital combined program. Dr. Kewalramani holds a B.A. from Boston University and an M.D. from Boston University School of Medicine. She is an alumna of the Harvard Business School, having completed the General Management Program. \nDr. Leiden is our Executive Chairman, a position he has held since in April 2020. He was our Chief Executive Officer and President from 2012 through March 2020. He has been a member of our Board of Directors since July 2009, the Chairman of our Board of Directors since May 2012, and served as our lead independent director from October 2010 through December 2011. Dr. Leiden was a Managing Director at Clarus Ventures, a life sciences venture capital firm, from 2006 through January 2012. Dr. Leiden was President and Chief Operating Officer of Abbott Laboratories, Pharmaceuticals Products Group, and a member of the Board of Directors of Abbott Laboratories from 2001 to 2006. From 1987 to 2000, Dr. Leiden held several academic appointments, including the Rawson Professor of Medicine and Pathology and Chief of Cardiology and Director of the Cardiovascular Research Institute at the University of Chicago, the Elkan R. Blout Professor of Biological Sciences at the Harvard School of Public Health, and Professor of Medicine at Harvard Medical School. He is an elected member of both the American Academy of Arts and Sciences and the Institute of Medicine of the National Academy of Sciences. Dr. Leiden is a member of the Board of Directors of the Massachusetts Mutual Life Insurance Company, a private insurance company, since 2015. Dr. Leiden is the Executive Chairman of the Board of Directors of Odyssey Therapeutics, a private biotechnology company, since 2022, and is the Chairman of the Board of Directors of Casana, a private healthcare technology company, since 2021. Dr. Leiden was a director and the non-executive Vice Chairman of the board of Shire plc, from 2006 to January 2012, a director of Quest Diagnostics, from December 2014 to May 2019, and the Chairman of Revolution Healthcare Acquisition Corp., from April 2021 to December 2022. Dr. Leiden received his M.D., Ph.D. and B.A. degrees from the University of Chicago.\nDr. Altshuler is our Executive Vice President, Chief Scientific Officer, a role he has held since January 2015, and was a member of our Board of Directors from May 2012 through December 2014. Dr. Altshuler was one of four founding members of the Broad Institute, a research collaboration of Harvard University and the Massachusetts Institute of Technology, The Whitehead Institute and the Harvard Hospitals. He served as the Director of the Institute’s Program in Medical and \n30\nPopulation Genetics from 2003 through December 2014 and as the Institute’s Deputy Director and Chief Academic Officer from 2009 through December 2014. Dr. Altshuler joined the faculty at Harvard Medical School and the Massachusetts General Hospital in 2000 and held the academic rank of Professor of Genetics and Medicine from 2008 through December 2014. He served as Adjunct Professor of Biology at MIT from 2012 through December 2014. Dr. Altshuler earned a B.S. from MIT, a Ph.D. from Harvard University and an M.D. from Harvard Medical School. Dr. Altshuler completed his clinical training in Internal Medicine, and in Endocrinology, Diabetes and Metabolism, at the Massachusetts General Hospital.\nMr. Arbuckle is our Executive Vice President, Chief Operating Officer, a position he has held since July 2021. As previously announced, Mr. Arbuckle will retire from Vertex effective July 1, 2025. Prior to his role at Vertex, Mr. Arbuckle served as Executive Vice President, Chief Commercial and Operations Officer from March 2021 to July 2021, and as our Executive Vice President, Chief Commercial Officer from September 2012 to February 2021. Prior to joining us, Mr. Arbuckle held multiple commercial leadership roles at Amgen, Inc. from July 2004 through August 2012. Mr. Arbuckle has worked in the biopharmaceuticals industry since 1986, including more than 15 years at GlaxoSmithKline plc, where he held sales and marketing roles of increasing responsibility for medicines aimed at treating respiratory, metabolic, musculoskeletal, cardiovascular and other diseases. He has served as a member of the Board of Directors of Rhythm Pharmaceuticals Inc. since July 2019. He served as a member of the Board of Directors of Cerulean Pharma, Inc. from June 2015 through July 2017 and served as a member of the Board of Directors of ImmunoGen, Inc. from January 2018 until it was acquired by AbbVie Inc. in February 2024. Mr. Arbuckle holds a BSc in Pharmacology and Physiology from the University of Leeds.\nDr. Atkinson has been our Executive Vice President, Chief Technical Operations Officer, Head of Biopharmaceutical Sciences and Manufacturing Operations since August 2023. He previously served as our Senior Vice President, Head of Commercial Manufacturing and Supply Chain since July 2020. Prior to joining us, Dr. Atkinson served in various roles at Bristol-Myers Squibb Co., including as Senior Vice President, Global Manufacturing Operations from September 2019 to June 2020; Vice President and Integration Leader, Corporate Cell Therapy and Global Development and Manufacturing from January 2019 to September 2019; Vice President, Internal Manufacturing, Biologics from June 2017 to January 2019; and Vice President, Biologics Development and Clinical Manufacturing from 2012 to June 2017. Before Bristol-Myers Squibb, he held various roles at Cook Pharmica, LLC (now owned by Novo Holdings) and Eli Lilly. Dr. Atkinson has served as a member of the Board of Directors of 89bio, Inc., since February 2022. Dr. Atkinson holds a B.S. in Biology from Indiana University and a Ph.D. in Biological Sciences from Stanford University.\nMr. Biller has been our Executive Vice President, Chief Legal Officer since September 2022. From November 2019 until he joined us, Mr. Biller served in several executive roles at Agios Pharmaceuticals, Inc., including Chief Legal Officer and, most recently, Chief Financial Officer and Head of Corporate Affairs. Prior to Agios, he served as Executive Vice President, General Counsel at Celgene from July 2018 to November 2019, where he was responsible for their global legal function, and served as Senior Vice President, Tax and Treasury from 2011 to June 2018. Prior to Celgene, Mr. Biller was General Counsel, Chief Tax Officer and Secretary at Bunge Limited, a global publicly traded agriculture and food company. Earlier in his career he held various leadership roles at Alcon, Inc. and was a partner at Hopkins & Sutter and Foley & Lardner. Mr. Biller holds a B.A. from Brown University and a J.D. from Yale Law School.\nDr. Bozic is our Executive Vice President, Global Medicines Development and Medical Affairs, a position she has held since October 2019, and she has been our Chief Medical Officer since April 2020. She was our Senior Vice President and Head of Global Clinical Development from May 2019 to October 2019. Prior to joining us, Dr. Bozic spent more than 20 years at Biogen Inc., a biotechnology company focused on neurological diseases, most recently as Senior Vice President of Global Development and Portfolio Transformation from 2015 to May 2019 and as Senior Vice President of Clinical and Safety Sciences from 2013 to 2015. Dr. Bozic has served as the industry representative to the FDA’s Risk Communication Advisory Committee, and was a member of PhRMA’s Clinical and Preclinical Development Committee and the Board of Managers at BioMotiv. She is a member of the Clinical Advisory Committee at Akili Interactive. She received her M.D., C.M., completed her residency, and was Chief Resident in Internal Medicine at McGill University. She completed her fellowship in Pulmonary and Critical Care Medicine at Brigham and Women’s Hospital and was an Associate Physician at Beth Israel Deaconess Medical Center and Harvard Medical School before joining the biopharmaceutical industry. \nMr. Sachdev is our Executive Vice President, Chief Patient and External Affairs Officer, a role he has held since July 2023. From October 2019 to July 2023, he was our Executive Vice President, Chief Patient Officer. In addition, Mr. Sachdev served in the role of Chief of Staff to the CEO from April 2020 to March 2023. He served as our Executive Vice President and Chief Regulatory Officer from January 2017 until September 2019, and as our Executive Vice President, Policy, Access and Value from October 2014 through December 2016. In 2010, he established our first international commercial operations \n31\nin Canada. In 2007, he joined us as a Senior Vice President, to establish our government affairs and public policy activities, as well as our patient advocacy programs. Prior to joining us, Mr. Sachdev served as Executive Vice President, Health, of the Biotechnology Industry Organization (BIO) and was the Deputy Commissioner for Policy at the FDA, where he also served in several other senior positions. Prior to the FDA, Mr. Sachdev served as Majority Counsel to the Committee on Energy and Commerce in the U.S. House of Representatives and practiced law at the American Chemistry Council, and subsequently at the law firm of Ropes & Gray LLP. He served as a member of the Board of Directors of Eiger BioPharmaceuticals from April 2019 to September 2024. Mr. Sachdev holds a B.S from Carnegie Mellon University and a J.D. from Emory University School of Law.\nDr. Tatsis is our Executive Vice President, Chief Regulatory and Quality Officer, a position she has held since August 2020. Previously, she was our Senior Vice President and Chief Regulatory Officer from October 2019 to August 2020, and our Senior Vice President, Global Regulatory Affairs from September 2017 to October 2019. Prior to joining us, Dr. Tatsis held positions of increasing responsibility at several pharmaceutical companies, including Sanofi, Stemnion, Pfizer, and Wyeth. Most recently, from 2014 to 2017, she was Vice President, Head of Global Regulatory Affairs, at the Sanofi Genzyme Business Unit focused on Inflammation/Immunology, Rare Disease, Multiple Sclerosis, Ophthalmology, Neurology, and Oncology/Immuno-Oncology. Dr. Tatsis also worked as an associate staff scientist and research fellow in Immunology and Vaccine Development at the Wistar Institute and completed a post-doctoral research fellowship in Immunology at Thomas Jefferson University. Dr. Tatsis has served as a member of the board of directors at Verve Therapeutics since June 2024. She received her Ph.D. in Cell and Molecular Biology from the University of Vermont and holds a B.S. in Biology from Temple University.\nMr. Wagner is our Executive Vice President, Chief Financial Officer, a position he has held since April 2019. As previously announced, Mr. Wagner has been appointed as our Chief Operating Officer effective July 1, 2025. Mr. Wagner will remain an Executive Vice President and our Chief Financial Officer following this appointment. Prior to his role at Vertex, Mr. Wagner was Chief Financial Officer and Executive Vice President, Finance, of Ortho Clinical Diagnostics, a Carlyle Group portfolio company, from June 2015 to March 2019. In that role, he led the finance, accounting, tax, treasury, global financial systems, lender relations, and acquisitions and divestiture groups, and also had shared leadership for several enterprise-wide projects. From July 2012 to June 2015, Mr. Wagner served as Executive Vice President, Chief Financial Officer of Bruker Corporation, a scientific instruments manufacturer. Prior to that, Mr. Wagner served as Chief Financial Officer for Progress Software Corporation, a provider of enterprise software, and Millipore Corporation, a global provider of products and services in the life science tools market. Mr. Wagner served as a director of Good Start Genetics, Inc., from April 2014 to August 2017 and served as a director and member of the Audit Committee of Bruker Corporation from August 2010 to June 2012. He has served as a member of the Board of Directors of The TJX Companies, Inc., since September 2023. Mr. Wagner holds a B.S. in Accounting from Boston College and a M.B.A from Harvard Business School.\nMs. Ambrose is our Senior Vice President, Chief Accounting Officer, a position she has held since May 2021. Ms. Ambrose previously served as our Senior Vice President, Accounting, Tax, Treasury, Strategic Sourcing and Corporate Services since March 2021. From February 2003 until she joined us, Ms. Ambrose held roles of increasing responsibility at Boston Scientific Corporation, a medical device company, most recently as Vice President of Finance and Controller of the Global Endoscopy Division from July 2019 to March 2021 and as Vice President of Global Internal Audit from February 2017 to June 2019. Prior to Boston Scientific Corporation, Ms. Ambrose served as an accountant at Ernst & Young LLP. She received her B.S. in Commerce from the University of Virginia and is a Certified Public Accountant.\nMr. McKechnie is our Senior Vice President, Head of North America Commercial, a position he has held since October 2018. As previously announced, Mr. McKechnie has been appointed as our Executive Vice President, Chief Commercial Officer effective July 1, 2025. Mr. McKechnie previously served as our Vice President of Global Marketing from June 2013 to September 2018. Prior to joining Vertex, Mr. McKechnie held positions of increasing responsibility at Novartis AG, including Vice President, Respiratory Franchise from January 2013 to June 2013; Vice President and Head Brand Maximization and Established Medicines from April 2012 to April 2013; and Vice President, Cardiovascular Marketing from November 2008 to March 2012. Before Novartis, Mr. McKechnie held various roles at GlaxoSmithKline plc. Mr. McKechnie holds a Business & Marketing degree from the University of Plymouth in England.\n32",
    "item1a": "Item 1A, and elsewhere in this report and those described from time to time in our future reports filed with the Securities and Exchange Commission.\nAny such forward-looking statements are made on the basis of our views and assumptions as of the date of the filing and are not estimates of future performance. Except as required by law, we undertake no obligation to publicly update any forward-looking statements. The reader is cautioned not to place undue reliance on any such statements.",
    "item1b": "ITEM 1B.\nUNRESOLVED STAFF COMMENTS\nWe did not receive any written comments from the Securities and Exchange Commission prior to the date 180 days before the end of the fiscal year ended December 31, 2024 regarding our filings under the Securities Exchange Act of 1934, as amended, that have not been resolved.",
    "item1c": "ITEM 1C.\nCYBERSECURITY\nRisk Management and Strategy\nWe recognize the critical importance of developing, implementing, and maintaining robust cybersecurity measures to maintain the security, confidentiality, integrity, and availability of our business systems and confidential information, including personal information and intellectual property. \nOur cybersecurity program includes systems and processes for assessing, identifying and managing material risks from cybersecurity threats and include maintenance and monitoring of information security policies aligned with global regulatory controls and aligned with National Institute of Standards and Technology Cybersecurity Framework; user and employee awareness of cyber policies and practices; information systems configuration management; third-party risk management systems; identity and information asset protection; infrastructure security systems; and cyber threat operations with continuous monitoring and threat hunting.\n \nThis program includes processes to oversee and identify material risks from cybersecurity threats associated with our use of third-party service providers.\n \nWe also engage a range of third-party experts in connection with various development, implementation, and maintenance activities related to our cybersecurity program, including audit and compliance, threat hunting, monitoring, and end-user support.\nOur cybersecurity program is integrated into our overall risk management systems, including our annual enterprise risk management program, internal audit program, business continuity and crisis management programs, third-party risk management program, insurance risk management program, and employee compliance programs. As part of our overall risk management program, we maintain a global insurance portfolio with comprehensive cyber coverage. Our Chief Information Security Officer (“CISO”) and the Information Security function advises, consults with, or provides input to each of these programs to ensure that material risks from cybersecurity threats are appropriately assessed, identified, and managed. \n65\nAs of the date of this report, there have been no cybersecurity threats that have materially affected or are reasonably likely to materially affect our business, operations, or financial condition.\n Similar to other companies, we have experienced cybersecurity incidents, including temporary service interruptions of third-party suppliers. As of the date of this report, however, known cybersecurity incidents, individually or in aggregate, have not had a material impact on our company. Over the last three years, net expenses incurred from any information security breaches, including any penalties and settlements, are not material relative to our total revenue. For additional discussion on cybersecurity risks we face, see Item 1.A Risk Factors — \nA breakdown or breach of our information technology systems could subject us to liability or interrupt the operation of our business\n.\nGovernance\nWhile our board of directors has oversight responsibility for risk management generally, the Audit and Finance Committee (“Audit Committee”) is specifically responsible for overseeing our cybersecurity risk management program to ensure that cybersecurity risks are identified, assessed, managed, and monitored.\n \nOur CISO provides quarterly updates to the Audit Committee in this regard, and covers the state of our cybersecurity program, supported by key performance indicators across the range of cybersecurity functions related to risk management and governance, identity and information asset protection, core security and endpoint security, and cyber threat operations.\n These updates include descriptions of cybersecurity incidents of interest, including those associated with our third-party service providers; the board will be informed promptly of material risks from cybersecurity threats.\nWe strive to create a culture of cybersecurity resilience and awareness and believe that cybersecurity is the responsibility of every employee and contractor. \nAt the same time, primary responsibility for assessing, monitoring, and managing our cybersecurity risks lies with our \nCISO\n, Michael Daly, who has more than 35 years of experience in security and information systems and spent 25 years with Raytheon Technologies, most recently as Chief Technology Officer of Cybersecurity, Special Missions, Training & Services. Our CISO supported the U.S. President's National Security Telecommunications Advisory Committee for more than 20 years, is a member of the Massachusetts Cybersecurity Strategy Council, and previously served as Chair of the Kogod Cybersecurity Governance Center at American University. He also served on the Rhode Island Homeland Security Advisory Board and was a member of various commercial cyber product councils.\nOur CISO oversees a team of skilled cybersecurity professionals who have Certified Information Systems Security Professional (“CISSP”) credentials, Global Information Assurance Certification from the SANS Institute, and other security and network certifications. The cybersecurity team monitors and evaluates our cybersecurity posture and performance on an ongoing basis, including through regular vulnerability scans, penetration tests, and threat intelligence feeds. The cybersecurity team uses various tools and methodologies to manage cybersecurity risk that are tested on a regular cadence, and assesses and evaluates cybersecurity incidents, escalating certain cybersecurity incidents to the CISO according to protocol. The CISO is continually informed regarding the performance of the cybersecurity program, as well as the latest developments in cybersecurity, including potential threats and innovative risk management techniques aligned with industry standards. The CISO reports to our Chief Scientific Officer (“CSO”). Our CSO is an executive officer and leads internal research and external innovation, corporate data strategy, technology and data sciences, and reports directly to our CEO."
  }
}