{
  "ticker": "VST",
  "cik": "0001692819",
  "company_name": "Vistra Corp.",
  "filing_date": "2025-02-28",
  "accession": "0001692819-25-000013",
  "primary_doc": "vistra-20241231.htm",
  "item_sections": {
    "item1": "Item 1.\nBUSINESS\nReferences in this report to \"we,\" \"our,\" \"us,\" and \"the Company\" are to Vistra and/or its subsidiaries, as apparent in the context. See \nGlossary of Terms and Abbreviations\n for defined terms.\nGeneral\nVistra is an integrated retail electricity and power generation company. We combine an innovative, customer-centric approach to retail sales with safe, reliable, diverse, and efficient power generation. Our integrated power generation and wholesale operation allows us to efficiently obtain the electricity needed to serve our customers at the lowest cost. The integrated model enables us to structure products and contracts in a way that offers significant value compared to stand-alone retail electric providers.\nThe Company brings its products and services to market in 18 states and the District of Columbia, including all major competitive wholesale power markets in the U.S. We serve approximately 5 million residential, commercial, and industrial retail customers with electricity and natural gas. Our generation fleet totals approximately 41,000 megawatts of generation capacity powered by a diverse portfolio, including natural gas, nuclear, coal, solar, and battery energy storage facilities.\nMarket Discussion\nThe operations of Vistra, as an integrated retail electricity and power generation company, are further aligned into five reportable business segments: (i) Retail, (ii) Texas, (iii) East, (iv) West, and (v) Asset Closure. Our Texas, East, and West segments include our electricity generation operations, and our Asset Closure segment is engaged in the decommissioning and reclamation of retired plants and mines. In the fourth quarter of 2024, we updated our reportable segments to reflect changes in how the Company's Chief Operating Decision Maker (CODM) makes operating decisions, assesses performance, and allocates resources by eliminating the Sunset segment. The results of the plants previously included in the Sunset segment are now reflected in the Texas and East segments based on their respective geography.\nRetail Operations\nVistra is one of the largest competitive residential retail electricity providers in the U.S. Our retail operations are engaged in retail sales of electricity, natural gas, and related services to approximately 5 million customers. Substantially all of our retail activities are conducted by TXU Energy, Ambit Energy, Dynegy Energy Services, Homefield Energy, and U.S. Gas & Electric across 16 U.S. states and the District of Columbia. The largest portion of our retail operations are in Texas, where we provide retail electricity to approximately 2.6 million customers.\nOur TXU Energy brand, which has been used to sell electricity to customers in the competitive retail electricity market in Texas for over 20 years, is registered and protected by trademark law. We also own the trade names for Ambit Energy, Dynegy Energy Services, Homefield Energy, TriEagle Energy, Public Power, and U.S. Gas & Electric.\nWe believe that we have differentiated ourselves by providing a distinctive customer experience predicated on delivering reliable and innovative power products and solutions to our customers, including 100% wind and solar options, as well as thermostats, dashboards, and other programs designed to encourage reduced electricity consumption and increased energy efficiency. Our distinctive power products give our customers choice, convenience, and control over how and when they use electricity and related services.\n1\nTable of Contents\nElectricity Generation Operations\nVistra is the largest competitive power generator in the U.S. as measured by MWh of generation capacity. At December 31, 2024, our generating capacity was powered by the following:\nPrimary Fuel\nTechnology\nNet Capacity (MW)\n% of Net Capacity\nNatural Gas\nCCGT, CT or ST\n24,120 \n59%\nCoal\nST\n8,428 \n21%\nUranium\nNuclear\n6,448 \n16%\nRenewable\nSolar/Battery\n1,474 \n4%\nFuel Oil\nCT\n187 \n—%\nTotal\n40,657 \n100%\nOur natural gas-fueled generation fleet is comprised of 23 CCGT generation facilities totaling 19,742 MW and 10 peaking generation facilities totaling 4,378 MW. We satisfy our fuel requirements at these facilities through a combination of spot market and near-term purchase contracts. Additionally, we have near-term natural gas transportation agreements and natural gas storage agreements in place to ensure fleet reliability.\nOur coal/lignite-fueled generation fleet is comprised of seven generation facilities totaling 8,428 MW of generation capacity. We meet our fuel requirements at our coal-fueled generation facilities in PJM and MISO with coal purchased from multiple suppliers under contracts of various lengths and transported to the facilities by either railcar or barges. We meet our fuel requirements in ERCOT using lignite that we mine at our generation facilities and coal purchased and transported by railcar.\nWe own and operate six nuclear generation units at four different facilities:\nUnit\nISO\nNet Capacity (MW)\nRefueling Outage Frequency\nLicense Expiration Date\nComanche Peak Unit 1\nERCOT\n1,200 \n18 Months\n2050\nComanche Peak Unit 2\nERCOT\n1,200 \n18 Months\n2053\nBeaver Valley Unit 1\nPJM\n939 \n18 Months\n2036\nBeaver Valley Unit 2\nPJM\n933 \n18 Months\n2047\nPerry\nPJM\n1,268 \n24 Months\n2026 (a)\nDavis-Besse\nPJM\n908 \n24 Months\n2037\nTotal\n6,448 \n___________\n(a)\nIn 2023, an application for a license renewal at our Perry nuclear plant was filed with the NRC to extend our license through 2046.\nNuclear units are generally operated at full capacity. Refueling (nuclear fuel assembly replacement) outages for each unit are scheduled to occur during the spring or fall off-peak demand periods. While one unit is undergoing a refueling outage at dual-unit facilities, the remaining unit is intended to operate at full capacity. During a refueling outage, other maintenance, modification, and testing activities are completed that cannot be accomplished when the unit is in operation.\nWe have contracts in place for all of our nuclear fuel requirements through 2029. We do not anticipate any significant difficulties in acquiring uranium and contracting for associated conversion, enrichment, and fabrication services in the foreseeable future. We continue to monitor developments regarding the availability of nuclear fuel that may arise out of the Russia and Ukraine conflict. See Item 7. \nManagement's Discussion and Analysis of Financial Condition, and Results of Operations – Significant Activities and Events, and Items Influencing Future Performance\n \n– Macroeconomic Conditions\n.\nOur generation operations by segment are represented in the following table:\nSegment\nNet Capacity (MW)\n% of Net Capacity\nISO/RTO\nTexas\n19,031 \n47%\nERCOT\nEast\n19,746 \n49%\nPJM, ISO-NE, MISO, and NYISO\nWest\n1,880 \n4%\nCAISO\nTotal\n40,657 \n100%\n2\nTable of Contents\nIndependent System Operators (ISOs) and Regional Transmission Organizations (RTOs)\n — ISOs and RTOs manage the transmission infrastructure and markets across regions, separate from our operations. They dispatch generation facilities, ensuring efficient and reliable transmission system operation. ISOs/RTOs administer short-term energy and ancillary service markets, typically day-ahead and real-time, and some also manage long-term planning reserves through various capacity markets. They impose bid and price limits in wholesale power markets.  NERC regions and ISOs/RTOs often have different geographic footprints, and while there may be geographic overlap between NERC regions and ISOs/RTOs, their respective roles and responsibilities do not generally overlap.\nIn centrally dispatched market structures (e.g., ERCOT, PJM, ISO-NE, NYISO, MISO, CAISO), all generators receive the same price for energy based on the bid price of the last MWh needed to balance supply and demand. Prices vary within different zones due to transmission losses and congestion. For example, if a less efficient natural gas unit is needed to meet demand, its offer price sets the market clearing price for all dispatched generation in that market, regardless of other units' offer prices. Generators receive the location-based marginal price for their output.\nERCOT\n — ERCOT is an ISO that manages the flow of electricity from approximately 103,600 MW of expected Summer 2024 peak generation capacity to approximately 27 million Texas customers, representing approximately 90% of the state's electric load.\nAs an energy-only market, ERCOT's market design is distinct from other competitive electricity markets in the U.S. Other markets maintain a minimum planning reserve margin through regulated planning, resource adequacy requirements and/or capacity markets. In contrast, ERCOT's resource adequacy is currently predominately dependent on energy-market price signals. The Texas Legislature mandated the development of an ancillary service, the Dispatchable Reliability Reserve Service (DRRS), to address intra-hour operations challenges. The PUCT voted in December 2024 to have ERCOT develop DRRS so it can address both operational issues and resource adequacy issues. ERCOT is continuing work on DRRS, and it has not been implemented as of the date hereof. In 2014, ERCOT implemented the Operating Reserve Demand Curve (ORDC), pursuant to which wholesale electricity prices in the real-time electricity market increase automatically as available operating reserves decrease below defined threshold levels, creating a price adder. The slope of the ORDC curve is determined through a mathematical loss of load probability calculation using forecasted reserves and historical data. In both March 2019 and March 2020, ERCOT implemented 0.25 standard deviation shifts in the loss of load probability calculation and moved to using a single blended ORDC curve; these changes resulted in a more rapid escalation in power prices as operating reserves fall below defined thresholds. Effective January 1, 2022, when operating reserves drop to 3,000 MW or less, the ORDC automatically adjusts power prices to $5,000/MWh which is equal to the high system-wide offer cap. When ERCOT implements real-time co-optimization, discussed below, the ORDC will be replaced by ancillary service demand curves that are designed to mimic the operation of the ORDC. ERCOT also calculates the \"peaker net margin\" based on revenues a hypothetical unhedged peaking unit would collect in the market. If the peaker net margin exceeds a certain threshold, the system-wide offer cap is reduced to the low system-wide offer cap of $2,000/MWh for the remainder of the calendar year. In December 2023, the PUCT also approved an Emergency Pricing Program that temporarily lowers the system-wide offer cap to $2,000/MWh if prices have been at the cap for 12 hours in a rolling 24-hour period. Historically, high demand due to elevated temperatures in the summer months or high demand due to reduced temperatures in the winter months, combined with underperformance of wind generation, has created the conditions during which the ORDC contributes meaningfully to power prices. Extreme weather conditions can also lead to scarcity conditions regardless of season. Other than during periods of \"scarcity pricing,\" the price of power is typically set by natural gas-fueled generation facilities (see Item 7. \nManagement's Discussion and Analysis of Financial Condition, and Results of Operations – Significant Activities and Events, and Items Influencing Future Performance\n).\n3\nTable of Contents\nTransactions in ERCOT take place in two key markets: the day-ahead market and the real-time market. The day-ahead market is a voluntary, financial electricity market conducted the day before each operating day in which generators and purchasers of electricity may bid for one or more hours of electricity supply or consumption. The real-time market is a physical market in which electricity is dispatched and priced in five-minute intervals. The day-ahead market provides market participants with visibility into where prices are expected to clear, and the prices are not impacted by subsequent events. Conversely, the real-time market exposes purchasers to the risk of transient operational events and price spikes. These two markets allow market participants to manage their risk profile by adjusting their participation in each market. In addition, ERCOT uses ancillary services to maintain system reliability, including regulation service, responsive reserve service, and non-spinning reserve service. Ancillary services are provided by generators and qualified loads to help maintain the stable voltage and frequency requirements of the transmission system. ERCOT currently procures ancillary services in the day-ahead market, but plans to implement co-optimization of energy and ancillary services in the real-time market by the end of 2025. Because ERCOT has one of the highest concentrations of wind and solar capacity generation among U.S. markets, the ERCOT market is more susceptible to fluctuations in wholesale electricity supply due to intermittent wind and solar production, making ERCOT more vulnerable to periods of generation scarcity. ERCOT implemented the ERCOT Contingency Reserve Service (ECRS) in June 2023 to further address the need for operating reserves to manage load and intermittent resource output uncertainty.\nPJM\n — PJM is an RTO that manages the flow of electricity from approximately 183,000 MW of generation capacity to approximately 65 million customers in all or parts of Delaware, Illinois, Indiana, Kentucky, Maryland, Michigan, New Jersey, North Carolina, Ohio, Pennsylvania, Tennessee, Virginia, West Virginia, and the District of Columbia.\nLike ERCOT, PJM administers markets for wholesale electricity and provides transmission planning for the region, utilizing a locational marginal pricing (LMP) methodology which calculates a price for every generator and load point within PJM. PJM operates day-ahead and real-time markets into which generators can bid to provide energy and ancillary services. PJM also administers a forward capacity auction, the Reliability Pricing Model (RPM), which establishes a long-term market for capacity. We have participated in RPM auctions for years up to and including PJM's planning year 2025-2026, which ends May 31, 2026. PJM's RPM auction for planning year 2026-2027 was delayed and is expected to be run in July 2025. We also enter into bilateral capacity transactions. PJM's Capacity Performance (CP) rules were designed to improve system reliability and include penalties for under-performing units and reward for over-performing units during shortage events. Full transition of the capacity market to CP rules occurred in planning year 2020-2021. An independent market monitor continually monitors PJM markets to ensure a robust, competitive market and to identify improper behavior by any entity.\nISO-NE\n — ISO-NE is an ISO that manages the flow of electricity from approximately 30,600 MW of winter generation capacity to approximately 15 million customers in the states of Vermont, New Hampshire, Massachusetts, Connecticut, Rhode Island, and Maine.\nISO-NE dispatches power plants to meet system energy and reliability needs and settles physical power deliveries at LMPs. Its energy markets allow market participants to buy and sell energy and ancillary services at prices established through real-time and day-ahead auctions. Energy prices vary among the locations in ISO-NE and are largely influenced by transmission constraints and fuel supply. ISO-NE offers the Forward Capacity Market where capacity prices are determined through auctions currently run three years prior to the capacity delivery year. ISO-NE is working with stakeholders to transition to a prompt capacity market for the delivery year starting in June 2028. Performance incentive rules have the potential to increase capacity payments for those resources that are providing excess energy or reserves during a shortage event, while penalizing those that produce less than the required level.\nNYISO\n — NYISO is an ISO that manages the flow of electricity from approximately 37,100 MW of installed summer generation capacity to approximately 20 million New York customers.\nNYISO dispatches power plants to meet system energy and reliability needs and settles physical power deliveries at LMPs. Its energy markets allow market participants to buy and sell energy and ancillary services at prices established through real-time and day-ahead auctions. Energy prices vary among the regional zones and locations in the NYISO and are largely influenced by transmission constraints and fuel supply. NYISO offers the Installed Capacity Market, a forward capacity market where capacity prices are determined through auctions. Strip auctions occur one to two months prior to the commencement of a six-month seasonal planning period. Subsequent auctions provide an opportunity to sell excess capacity for the balance of the seasonal planning period or the upcoming month. Due to the short-term nature of the NYISO-operated capacity auctions and a relatively liquid bilateral market for NYISO capacity products, our Independence facility sells a significant portion of its capacity through bilateral transactions. The balance is cleared through the seasonal and monthly capacity auctions.\n4\nTable of Contents\nMISO\n — MISO is an RTO that manages the flow of electricity from approximately 202,000 MW of installed generation capacity to approximately 45 million customers in all or parts of Iowa, Minnesota, North Dakota, Wisconsin, Michigan, Kentucky, Indiana, Illinois, Missouri, Arkansas, Mississippi, Texas, Louisiana, Montana, South Dakota, and Manitoba, Canada.\nMISO dispatches power plants to meet system energy and reliability needs and settles physical power deliveries at LMPs. Its energy markets allow market participants to buy and sell energy and ancillary services at prices established through real-time and day-ahead auctions. Energy prices vary among the regional zones and locations in MISO and are largely influenced by transmission constraints and fuel supply. An independent market monitor is responsible for evaluating the performance of the markets and identifying conduct by market participants or MISO that may compromise the efficiency or distort the outcome of the markets.\nMISO administers a one-year Planning Resource Auction (PRA) for the next planning year from June 1st of the current year to May 31st of the following year. MISO's PRA currently uses a vertical demand curve that can result in more volatile capacity prices. In 2022, FERC approved MISO's proposal to change the annual Planning Resource Auction into a seasonal auction, effective for the 2023-2024 planning year. Starting with the PRA for the 2025-2026 planning year, MISO will begin using a sloped demand curve. We participate in these auctions with open capacity that has not been committed through bilateral or retail transactions. We also participate in the MISO annual and monthly financial transmission rights auctions to manage the cost of our transmission congestion, as measured by the congestion component of the LMP price differential between two points on the transmission grid across the market area.\nCAISO\n \n— CAISO is an ISO that manages the flow of electricity to approximately 32 million customers primarily in California, representing approximately 80% percent of the state's electric load.\nEnergy is priced in CAISO utilizing an LMP methodology. The capacity market is comprised of Generic, Flexible, and Local Resource Adequacy (RA) Capacity, which is administered by the California Public Utilities Commission (CPUC). Unlike other centrally cleared capacity markets, the resource adequacy markets in California are primarily bilaterally traded markets. In 2020, the CPUC introduced a central procurement entity for Local RA Capacity effective for the 2023 compliance year. The central procurement entity runs a pay-as-bid auction for Local RA Capacity. In November 2016, CAISO implemented a voluntary capacity auction for annual, monthly, and intra-month procurement to cover for deficiencies in the market. The voluntary Competitive Solicitation Process, which FERC approved in October 2015, is a modification to the Capacity Procurement Mechanism (CPM) and provides another avenue to sell RA capacity.\nWholesale Operations\n — Our wholesale commodity risk management group is responsible for dispatching our generation fleet in response to market needs after implementing portfolio optimization strategies, thus linking and integrating the generation fleet production with our retail customer and wholesale sales opportunities. Market demand, also known as load, faced by electric power systems, such as those we operate in, varies from moment to moment as a result of changes in business and residential demand, which is often driven by weather. Unlike most other commodities, the production and consumption of electricity must remain balanced on an instantaneous basis. There is a certain baseline demand for electricity across an electric power system that occurs throughout the day, which is typically satisfied by baseload generation units with low variable operating costs. Baseload generation units can also increase output to satisfy certain incremental demand and reduce output when demand is unusually low. Intermediate/load-following generation units, which can more efficiently change their output to satisfy increases in demand, typically satisfy a large proportion of changes in intraday load as they respond to daily increases in demand or unexpected changes in supply created by reduced generation from renewable resources or other generator outages. Peak daily loads may be satisfied by peaking units. Peaking units are typically the most expensive to operate, but they can quickly start up and shut down to meet brief peaks in demand. In general, baseload units, intermediate/load following units, and peaking units are dispatched into the ISO/RTO grid in order from lowest to highest variable cost. Price formation is typically based on the highest variable cost unit that clears the market to satisfy system demand at a given point in time.\nOur commodity risk management group enters into electricity, natural gas, and other commodity derivative contracts to reduce exposure to price fluctuations with the goal of reducing volatility of future revenues and fuel costs for our generation facilities and purchased power costs for our Retail segment.\n5\nTable of Contents\nSeasonality\nThe demand for and market prices of electricity and natural gas are affected by weather. As a result, our operating results are impacted by extreme or sustained weather conditions and may fluctuate on a seasonal basis. Typically, demand for and the price of electricity is higher in the summer and winter seasons, when the temperatures are more extreme, and the demand for and price of natural gas is also generally higher in the winter. More severe weather conditions such as heat waves or extreme winter weather have made, and may make, such fluctuations more pronounced. The pattern of this fluctuation may change depending on, among other things, the retail load served and the terms of contracts to purchase or sell electricity.\nCompetition\nCompetition in the markets in which we operate is impacted by electricity and fuel prices, congestion along the power grid, subsidies provided by state and federal governments for new and existing generation facilities, including renewables generation and battery ESS, new market entrants, construction of new generation assets, technological advances in power generation, the actions of environmental and other regulatory authorities, and other factors. We primarily compete with other electricity generators and retailers based on our ability to generate electric supply, market and sell electricity at competitive prices, and efficiently utilize transportation from third-party pipelines and transmission from electric utilities to deliver electricity to end-users. Competitors in the generation and retail power markets in which we participate include numerous regulated utilities, industrial companies, non-utility generators, competitive subsidiaries of regulated utilities, independent power producers, REPs, and other energy marketers. See",
    "item1a": "Item 1A. \nRisk Factors\n.\nThe Sustainability and Risk Committee of the Board has been delegated oversight responsibility of Vistra's Information Security.\n \nVistra periodically engages third-party advisors to provide cybersecurity oversight and tabletop training to the full Board to further our commitment to responsible oversight of cybersecurity risk management.\n \nAt least quarterly, our CIO reports to the Board on our Information Security program, including cybersecurity risks and threats (including the emerging threat landscape), an assessment of our Information Security program, and the status of projects to strengthen our Information Security program.\n In furtherance of our commitment to responsible oversight of cybersecurity risk management, in 2023, the Board appointed a director who brings extensive cybersecurity expertise to the Board.\n45\nTable of Contents\nOur CIO serves as head of Vistra's Technology Services and is responsible for ensuring the reliability, security, and continued development of the Company's technology platforms and delivering new solutions to support the business.\n The CIO has served in various senior information technology roles in public companies for over 30 years, including Keurig Dr. Pepper Inc., General Motors, Pfizer, and Electronic Data Systems.\nOur CISO has over 23 years of information technology experience. He has held technology positions across various areas — including infrastructure management, application management, architecture, operations, and cybersecurity — and brings expertise from Farmers Insurance and Zurich Insurance.",
    "item1b": "Item 1B.\nUNRESOLVED STAFF COMMENTS\nNone.\n44\nTable of Contents",
    "item1c": "Item 1C.\nCYBERSECURITY\nThe Company has a cybersecurity and incident response program designed to assess, identify, and manage material risks from cybersecurity threats, including matters related to the cybersecurity of the Company's critical infrastructure, data, or information technology systems and the Company's actions to prepare for, identify, assess, respond, mitigate and remediate material cyber, information security, or technology risks (collectively referred to as Information Security). This program includes:\n•\noperating a Cyber Security Operations Center;\n•\nraising employee awareness through annual general and job-specific cybersecurity trainings and employee phishing simulations;\n•\nmaintaining defined cyber incident response plans;\n•\nenhancing security measures to protect our systems and data;\n•\nevolving monitoring capabilities to improve early detection and rapid response to potential cyber threats; and\n•\nadapting to new work environments that include off-site work through mitigation of remote network risk to our internal systems, assets, or data.\nCybersecurity represents an important component of the Company's overall approach to enterprise risk management and is integrated into the risk management process and ongoing assessment.\n In addition to an internal security program, we strive to stay ahead of the threat landscape by actively monitoring and conducting due diligence on key third-party vendors' Information Security programs and risks. This includes qualitative assessments to gain a deeper understanding of their security posture and potential vulnerabilities. \nWe make strategic investments in our perimeter and internal defenses, cyber security operations center, and regulatory compliance activities with the advice of consultants and third parties\n. Moreover, to minimize risk, we maintain an insurance policy that provides coverage for matters relating to Information Security.\nVistra's \nChief Information Officer (CIO)\n ensures Information Security is built into the Company's larger technology strategy and oversees our Chief Information Security Officer (CISO). Our CISO and his Information Security team are responsible for leading the enterprise-wide information security strategy, policy, standards, architecture, and processes. Additionally, our Cyber Incident Response Teams under the CISO are responsible for monitoring and analyzing the Company's cybersecurity posture in partnership with Risk and Legal.\nThe CIO and CISO collaborate with our internal audit department and external consultants to review information technology-related risks (based upon the National Institute of Standards and Technology (NIST) Cybersecurity Framework) as part of the overall Vistra cyber risk management process. Through these processes, the CIO and CISO are informed about and monitor the prevention, detection, mitigation, and remediation of cybersecurity threats.\nWe also participate in industry groups and with regulators to gain additional knowledge, including, but not limited to, the Federal Bureau of Investigation, U.S. Cybersecurity and Infrastructure Security Agency, U.S. Department of Homeland Security, Electricity Information Sharing and Analysis Center, U.S. Cyber Emergency Response Team, the NRC and NERC. We apply the knowledge gained through industry partnerships, government organizations, external cyber risk platforms, and program maturity assessments to improve our processes to detect and mitigate cyber threats.\nAs of the date of this report, we have not identified any impacts from cybersecurity threats, including those from any previous cybersecurity incidents, that have materially affected our results of operation or financial condition. However, despite our efforts, we cannot eliminate all risks from cybersecurity threats, or provide assurances that we have not experienced undetected cybersecurity incidents. For additional information on risks from cybersecurity threats, see"
  }
}