{
  "ticker": "VTR",
  "cik": "0000740260",
  "company_name": "Ventas, Inc.",
  "filing_date": "2025-02-13",
  "accession": "0000740260-25-000052",
  "primary_doc": "vtr-20241231.htm",
  "item_sections": {
    "item1": "Item 1A of this Annual Report.\nBusiness Summary and Overview of 2024 \nVentas, Inc., (together with its consolidated subsidiaries, unless otherwise indicated or except where the context otherwise requires, “we,” “us,” “our,” “Company” and other similar terms) is a real estate investment trust (“REIT”) focused on delivering strong, sustainable shareholder returns by enabling exceptional environments that benefit a large and growing aging population. We hold a portfolio that includes senior housing communities, outpatient medical buildings, research centers, hospitals and healthcare facilities located in North America and the United Kingdom.  As of December 31, 2024, we owned or had investments in 1,387 properties consisting of 1,356 properties in our reportable business segments (“Segment Properties”) and 31 properties held by unconsolidated real estate entities in our non-segment operations. Our Company is headquartered in Chicago, Illinois with additional corporate offices in Louisville, Kentucky and New York, New York.\nWe elected to be taxed as a REIT under Sections 856 through 860 of the Internal Revenue Code (the “Code”), commencing with our taxable year ended December 31, 1999. Provided we qualify for taxation as a REIT, we generally are not required to pay U.S. federal corporate income taxes on our REIT taxable income that is currently distributed to our stockholders.  In order to maintain our qualification as a REIT, we must satisfy a number of technical requirements, which impact how we invest in, operate and manage our assets.  See “Risk Factors—Our REIT Status Risks” included in Part I,",
    "item1a": "Item 1A of this Annual Report.\nLiquidity and Capital Resources\nOur principal sources of liquidity are cash flows from operations, proceeds from the issuance of debt and equity securities, borrowings under our unsecured revolving credit facility and commercial paper program, and proceeds from asset sales. \nFor the next 12 months, our principal liquidity needs are to: (i) fund operating expenses; (ii) meet our debt service requirements; (iii) repay maturing mortgage and other debt; (iv) fund acquisitions, investments and commitments and any development and redevelopment activities; (v) fund capital expenditures; and (vi) make distributions to our stockholders and unitholders, as required for us to continue to qualify as a REIT. \nDepending upon the availability of external capital, we believe our liquidity is sufficient to fund these uses of cash. \nWe expect that these liquidity needs generally will be satisfied by a combination of the following: cash flows from operations, cash on hand, debt assumptions and financings (including secured financings), issuances of debt and equity securities, dispositions of assets (including in whole or in part, through joint venture arrangements) and borrowings under our revolving credit facilities and commercial paper program. However, an inability to access liquidity through multiple capital sources concurrently could have a material adverse effect on us. \nOur material contractual obligations arising in the normal course of business primarily consist of long-term debt and related interest payments, and operating obligations which include ground lease obligations. During the year ended December 31, 2024, our material contractual obligations increased primarily due to net issuances of senior notes to pre-fund upcoming debt maturities. See “Note 10 – Senior Notes Payable and Other Debt” and “Note 14 – Commitments and Contingencies” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report for further information regarding our long-term debt obligations and operating obligations, respectively. \n64\nWe may, from time to time, seek to retire or purchase our outstanding indebtedness for cash or in exchange for equity securities in open market purchases, privately negotiated transactions or otherwise. Such repurchases or exchanges, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions, prospects for capital and other factors. The amounts involved may be material.\nLoans Receivable and Investments\nIn September 2024, we provided new secured debt financing of $109.0 million to the owner of a senior housing property, secured by the asset and with additional credit support. The loan provides us with a right of first offer to purchase the asset on certain terms and conditions. The loan has a 3-year term and bears interest at a variable rate based on one-month SOFR, subject to a floor of 4.50%, plus a spread of 5.75%, increasing to 6.00% commencing October 1, 2025.\nCredit Facilities, Commercial Paper, Unsecured Term Loans and Letters of Credit\nAs of December 31, 2024, we had $2.74 billion of undrawn capacity under our unsecured revolving credit facility with $6.4 million outstanding and an additional $0.8 million restricted to support outstanding letters of credit. We use our unsecured revolving credit facility to support our commercial paper program and for general corporate purposes. \nOur wholly-owned subsidiary, Ventas Realty, Limited Partnership (“Ventas Realty”), may issue from time to time unsecured commercial paper notes up to a maximum aggregate amount outstanding at any time of $1.0 billion. The notes are sold under customary terms in the U.S. commercial paper note market and are ranked pari passu with all of Ventas Realty’s other unsecured senior indebtedness. The notes are fully and unconditionally guaranteed by Ventas, Inc. As of December 31, 2024, we had no borrowings outstanding under our commercial paper program. \nVentas Realty has a $500.0 million unsecured term loan priced at Adjusted SOFR plus 0.85%, which is subject to adjustment based on Ventas Realty’s debt ratings. This term loan is fully and unconditionally guaranteed by Ventas, Inc. It matures in June 2027 and includes an accordion feature that permits Ventas Realty to increase the aggregate borrowings thereunder to up to $1.25 billion, subject to the satisfaction of certain conditions, including the receipt of additional commitments for such increase.\nVentas Realty has a $200.0 million unsecured term loan priced at Adjusted SOFR plus 0.85%, which is subject to adjustment based on Ventas Realty’s debt ratings. This term loan is fully and unconditionally guaranteed by Ventas, Inc. It matures in February 2027 and includes an accordion feature that permits Ventas Realty to increase the aggregate borrowings thereunder to up to $500.0 million, subject to the satisfaction of certain conditions, including the receipt of additional commitments for such increase.\nDuring the year ended December 31, 2024, we repaid a C$500.0 million ($369.4 million) unsecured term loan facility priced at Canadian Dollar Offered Rate (“CDOR”) plus 0.90% that would otherwise have matured in January 2025.\nAs of December 31, 2024, our $100.0 million uncommitted line for standby letters of credit had an outstanding balance of $15.4 million. The agreement governing the line contains certain customary covenants and, under its terms, we are required to pay a commission on each outstanding letter of credit at a fixed rate.\nExchangeable Senior Notes\nIn June 2023, Ventas Realty issued $862.5 million aggregate principal amount of its 3.75% Exchangeable Senior Notes due 2026 (the “Exchangeable Notes”) in a private placement. The Exchangeable Notes are senior, unsecured obligations of Ventas Realty and are fully and unconditionally guaranteed on an unsecured and unsubordinated basis by Ventas, Inc. The Exchangeable Notes bear interest at a rate of 3.75% per year, payable semi-annually in arrears on June 1 and December 1 of each year, beginning on December 1, 2023. The Exchangeable Notes mature on June 1, 2026, unless earlier exchanged, redeemed or repurchased. As of both December 31, 2024 and 2023, we had $862.5 million aggregate principal amount of the Exchangeable Notes outstanding with an effective interest rate of 4.62% inclusive of the impact of the amortization of issuance costs. For the years ended December 31, 2024 and 2023, we recognized $32.3 million and $17.8 million of contractual interest expense, respectively, and amortization of issuance costs of $6.8 million and $3.6 million, respectively, related to the Exchangeable Notes. Unamortized issuance costs of $10.3 million and $17.1 million as of December 31, 2024 and 2023 were recorded as an offset to Senior notes payable and other debt on our Consolidated Balance Sheets.\nThe Exchangeable Notes are exchangeable at an initial exchange rate of 18.2460 shares of our common stock per $1,000 principal amount of Exchangeable Notes (equivalent to an initial exchange price of approximately $54.81 per share of \n65\ncommon stock). The initial exchange rate is subject to adjustment, including in the event of the payment of a quarterly dividend in excess of $0.45 per share, but will not be adjusted for any accrued and unpaid interest. Upon exchange of the Exchangeable Notes, Ventas Realty will pay cash up to the aggregate principal amount of the Exchangeable Notes to be exchanged and pay or deliver (or cause to be delivered), as the case may be, cash, shares of common stock or a combination of cash and shares of common stock, at Ventas Realty’s election, in respect of the remainder, if any, of its exchange obligation in excess of the aggregate principal amount of the Exchangeable Notes being exchanged. Prior to the close of business on the business day immediately preceding March 1, 2026, the Exchangeable Notes will be exchangeable at the option of the noteholders only upon the satisfaction of specified conditions and during certain periods described in the indenture governing the Exchangeable Notes. On or after March 1, 2026, until the close of business on the business day immediately preceding the maturity date, the Exchangeable Notes will be exchangeable at the option of the noteholders at any time regardless of these conditions or periods.\nSenior Notes\nAs of December 31, 2024, we had outstanding $8.3 billion aggregate principal amount of senior notes issued by Ventas Realty, approximately $73.8 million aggregate principal amount of senior notes issued by Nationwide Health Properties, Inc. (“NHP”) and assumed by our subsidiary, Nationwide Health Properties, LLC (“NHP LLC”), as successor to NHP, in connection with our acquisition of NHP, and C$2.0 billion aggregate principal amount of senior notes issued by our subsidiary, Ventas Canada Finance Limited (“Ventas Canada”). All of the senior notes issued by Ventas Realty and Ventas Canada are unconditionally guaranteed by Ventas, Inc.\nWe may, from time to time, seek to retire or purchase our outstanding senior notes for cash or in exchange for equity securities in open market purchases, privately negotiated transactions or otherwise. Such repurchases or exchanges, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions, prospects for capital and other factors. The amounts involved may be material.\nThe indentures governing our outstanding senior notes require us to comply with various financial and other restrictive covenants. We were in compliance with all of these covenants at December 31, 2024.\nIn February 2024, Ventas Canada issued and sold C$650.0 million ($478.3 million) aggregate principal amount of 5.10% Senior Notes, Series J due 2029 in a private placement. The proceeds were primarily used to repay our C$500.0 million ($369.4 million) unsecured term loan facility due 2025.\nIn April and May 2024, we repaid $800.0 million senior notes consisting of $400.0 million aggregate principal amount of 3.50% Senior Notes due 2024 and $400.0 million aggregate principal amount of 3.75% Senior Notes due 2024 at maturity primarily with cash on hand and borrowings through our commercial paper program. \nIn April 2024, we repaid C$73.0 million ($53.4 million) aggregate principal amount of 2.80% Senior Notes, Series E due 2024 at maturity with cash on hand.\nIn May 2024, Ventas Realty issued and sold $500.0 million aggregate principal amount of 5.625% Senior Notes due 2034 in a registered public offering. The proceeds were primarily used to repay balances outstanding under our commercial paper program.\nIn September 2024, Ventas Realty issued and sold $550.0 million aggregate principal amount of 5.00% Senior Notes due 2035 in a registered public offering. We used the proceeds for general corporate purposes, including funding of acquisitions and the repayment of other indebtedness.\nIn September 2024, we repaid C$163.3 million ($120.8 million) aggregate principal amount of 4.125% Senior Notes due 2024 at maturity with cash on hand.\nIn January and February 2025, we repaid $450.0 million and $600.0 million aggregate principal amount of 2.65% Senior Notes due 2025 and aggregate principal amount of 3.50% Senior Notes due 2025, respectively, at maturity using cash on hand and borrowings through our commercial paper program.\nMortgages\nAt December 31, 2024, our consolidated aggregate principal amount of mortgage debt outstanding was $3.2 billion, of which our share was $2.9 billion.\n66\nUnder certain circumstances, contractual and legal restrictions, including those contained in the instruments governing our subsidiaries’ outstanding mortgage indebtedness, may restrict our ability to obtain cash from our subsidiaries for the purpose of meeting our debt service obligations, including our payment guarantees with respect to Ventas Realty’s and Ventas Canada’s senior notes. \nIn February 2024, we entered into a C$52.8 million ($39.1 million) fixed rate mortgage loan, which accrues interest at 4.644%, matures in 2029 and is secured by one senior housing community in Canada.\nIn April 2024, we entered into an aggregate C$103.0 million ($75.5 million) fixed rate mortgage loans, which accrue interest at a blended rate of 4.90%, mature in 2029 and are secured by two senior housing communities in Canada.\nIn May 2024, we entered into a $52.3 million fixed rate mortgage loan, which accrues interest at 6.02%, matures in 2034 and is secured by one outpatient medical building in California.\nDerivatives and Hedging\nIn the normal course of our business, interest rate fluctuations affect future cash flows under our variable rate debt obligations, loans receivable and marketable debt securities, and foreign currency exchange rate fluctuations affect our operating results. We follow established risk management policies and procedures, including the use of derivative instruments, to mitigate the impact of these risks.\nWe do not use derivative instruments for trading or speculative purposes, and we have a policy of entering into contracts only with major financial institutions based upon their credit ratings and other factors. When considered together with the underlying exposure that the derivative is designed to hedge, we do not expect that the use of derivatives in this manner would have any material adverse effect on our future financial condition or results of operations.\nWe enter into interest rate swaps in order to maintain a capital structure containing targeted amounts of fixed and variable-rate debt and manage interest rate risk. Interest rate swaps designated as cash flow hedges involve the receipt of variable amounts from a counterparty in exchange for our fixed-rate payments. These interest rate swap agreements are used to hedge the variable cash flows associated with variable-rate debt.\nPeriodically, we enter into and designate interest rate locks to partially hedge the risk of changes in interest payments attributable to increases in the benchmark interest rate during the period leading up to the probable issuance of fixed-rate debt. We designate our interest rate locks as cash flow hedges. Gains and losses when we settle our interest rate locks are amortized over the life of the related debt and recorded in Interest expense in our Consolidated Statements of Income.\nAs of December 31, 2024, our variable rate debt obligations of $0.8 billion reflect, in part, the effect of $141.3 million notional amount of interest rate swaps with maturities in March 2027, that effectively convert fixed rate debt to variable rate debt. \nAs of December 31, 2024, our fixed rate debt obligations of $12.8 billion reflect, in part, the effect of $526.5 million and C$635.9 million notional amount of interest rate swaps with maturities ranging from February 2025 to April 2031, in each case, that effectively convert variable rate debt to fixed rate debt. \n2024 Activity\nFrom June through September 2024, we entered into an aggregate $350.0 million treasury locks to hedge interest rate risk on future debt issuances. In September 2024, we terminated the treasury locks in conjunction with the issuance of the $550.0 million aggregate principal amount of 5.00% Senior Notes due 2035.\nCapital Stock\nIn February 2024, we entered into an amendment to our November 2021 ATM Sales Agreement, providing for an “at-the-market” equity offering program, pursuant to which we could sell, from time to time, up to $1.0 billion aggregate gross sales price of shares of our common stock (as amended, the “February 2024 ATM Program”). In September 2024, we terminated the February 2024 ATM Program and entered into an ATM Sales Agreement providing for the sale, from time to time, of up to $2.0 billion aggregate gross sales price of shares of our common stock (the “September 2024 ATM Program” and, together with the February 2024 ATM Program, the “ATM Programs”). The ATM Programs have allowed us to enter into forward sales agreements, as discussed below. By utilizing a forward sales agreement, we can secure a share price on the sale of \n67\nshares of our common stock at or shortly after the time the forward sales agreement becomes effective, while postponing the receipt of proceeds from the sale of shares until a future date.  As of December 31, 2024, the remaining amount available under our September 2024 ATM Program for future sales of common stock was $1.5 billion.\nDuring the year ended December 31, 2024, we issued 37.3 million shares of our common stock for gross proceeds of $2.2 billion, representing an average price of $58.38 per share, of which 3.4 million shares or approximately $201.1 million in gross proceeds remained unsettled with maturity in March 2026. During the year ended December 31, 2023, we issued 2.3 million shares of our common stock for gross proceeds of $110.4 million, representing an average price of $47.89 per share. There were no issuances of common stock for the year ended December 31, 2022. \nEquity Forward Sales Agreements\nEquity forward sales agreements generally have a maturity of one to two years. At any time during the term of an equity forward sales agreement, we may settle that equity forward sales agreement by delivery of physical shares of our common stock to the forward purchaser or, at our election, subject to certain exceptions, we may settle in cash or by net share settlement. The forward sales price we expect to receive upon settlement of outstanding equity forward sales agreements will be the initial forward price, net of commissions, established on or shortly after the effective date of the relevant equity forward sales agreement, subject to adjustments for accrued interest, the forward purchasers’ stock borrowing costs in excess of a certain threshold specified in the equity forward sales agreement, and certain fixed price reductions for expected dividends on our common stock during the term of the equity forward sales agreement. Our unsettled equity forward sales agreements are accounted for as equity instruments.\nIn January 2025, we entered into additional unsettled equity forward sales agreements for 0.8 million shares or approximately $49.8 million in gross proceeds with maturity in March 2026.\nDividends\nDuring 2024, we declared four dividends totaling $1.80 per share of our common stock, including a fourth quarter dividend of $0.45 per share. In order to continue to qualify as a REIT, we must make annual distributions to our stockholders of at least 90% of our REIT taxable income (excluding net capital gain). In addition, we will be subject to income tax at the regular corporate rate to the extent we distribute less than 100% of our REIT taxable income, including any net capital gains.  We intend to pay dividends greater than 100% of our taxable income, after the use of any net operating loss carryforwards, for 2025. \nWe expect that our cash flows will exceed our REIT taxable income due to depreciation and other non-cash deductions in computing REIT taxable income and that we will be able to satisfy the 90% distribution requirement. However, from time to time, we may not have sufficient cash on hand or other liquid assets to meet this requirement or we may decide to retain cash or distribute such greater amount as may be necessary to avoid income and excise taxation. If we do not have sufficient cash on hand or other liquid assets to enable us to satisfy the 90% distribution requirement, or if we desire to retain cash, we may borrow funds, issue additional equity securities, pay taxable stock dividends, if possible, distribute other property or securities or engage in a transaction intended to enable us to meet the REIT distribution requirements or any combination of the foregoing.\nCapital Expenditures\nFrom time to time, we engage in development and redevelopment activities within our reportable business segments and through our investments in unconsolidated entities. For example, we are party to certain agreements that commit us to develop properties funded through capital that we and, in certain circumstances, our joint venture partners provide. As of December 31, 2024, we had three active and committed projects pursuant to these agreements, including two projects that are unconsolidated. In addition, from time to time, we engage in redevelopment projects with respect to our existing senior housing communities, outpatient medical buildings and research centers to maximize the value, increase NOI, maintain a market-competitive position, achieve property stabilization or change the primary use of the property.\nThe terms of our triple-net leases generally obligate our tenants to pay all capital expenditures necessary to maintain and improve our triple-net leased properties. However, from time to time, we may fund the capital expenditures for our triple-net leased properties through loans or advances to the tenants, which may increase the amount of rent payable with respect to the properties in certain cases. We may also fund capital expenditures for which we may become responsible upon expiration of our triple-net leases or in the event that our tenants are unable or unwilling to meet their obligations under those leases. \n68\nWe expect that these liquidity needs generally will be satisfied by a combination of the following: cash flows from operations, cash on hand, debt assumptions and financings (including secured financings), issuances of debt and equity securities, dispositions of assets (in whole or in part through joint venture arrangements) and borrowings under our revolving credit facilities and commercial paper program.\nTo the extent that unanticipated capital expenditure needs arise or significant borrowings are required, our liquidity may be affected adversely. Our ability to borrow additional funds may be restricted in certain circumstances by the terms of the instruments governing our outstanding indebtedness.\nCash Flows\nThe following table sets forth our sources and uses of cash flows for the years ended December 31, 2024 and 2023 (dollars in thousands):\n \nFor the Years Ended\nDecember 31,\nChange\n \n2024\n2023\n$\n%\nCash, cash equivalents and restricted cash at beginning of year\n$\n563,462 \n$\n170,745 \n$\n392,717 \nnm\nNet cash provided by operating activities\n1,329,625 \n1,119,873 \n209,752 \n18.7 \nNet cash used in investing activities\n(2,377,089)\n(184,664)\n(2,192,425)\nnm\nNet cash provided by (used in) financing activities\n1,445,220 \n(543,749)\n1,988,969 \nnm\nEffect of foreign currency translation\n(3,985)\n1,257 \n(5,242)\nnm\nCash, cash equivalents and restricted cash at end of year\n$\n957,233 \n$\n563,462 \n$\n393,771 \n69.9 \n______________________________\nnm - not meaningful\nCash Flows from Operating Activities\nCash flows from operating activities increased $209.8 million during 2024 compared to the same period in 2023 primarily due to growth in our businesses and improvements to our working capital.\nCash Flows from Investing Activities\nCash flows used in investing activities increased $2.2 billion during 2024 compared to the same period in 2023 primarily due to a $1.9 billion increase in acquisition and a $122.6 million increase in investment in loans receivable in 2024.\nCash Flows from Financing Activities\nNet cash provided by financing activities increased $2.0 billion during 2024 compared to the same period in 2023 primarily due to a $1.9 billion increase in issuances of common stock.\nOff-Balance Sheet Arrangements\nWe own interests in certain unconsolidated entities as described in “Note 7 – Investments in Unconsolidated Entities.” Except in limited circumstances, our risk of loss is limited to our investment in the entities and any outstanding loans receivable. Further, we use financial derivative instruments to hedge interest rate and foreign currency exchange rate exposure. Finally, as of December 31, 2024, we had $16.3 million outstanding letters of credit obligations. \nCommitments and Contingencies\nThe information contained in “Note 14 – Commitments and Contingencies” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report is incorporated by reference into this Item 7.\n69\nGuarantor and Issuer Information - Registered Senior Notes\nVentas, Inc. has fully and unconditionally guaranteed the obligation to pay principal and interest with respect to the outstanding senior notes issued by our 100% owned subsidiary, Ventas Realty, that were issued in transactions registered under the Securities Act of 1933. No other Ventas entities are issuers or guarantors of debt securities registered under the Securities Act. \nUnder certain circumstances, contractual and legal restrictions, including those contained in the instruments governing our subsidiaries’ outstanding mortgage indebtedness, may restrict our ability to obtain cash from our subsidiaries for the purpose of meeting our debt service obligations, including Ventas Realty’s payment obligations and our payment guarantees with respect to Ventas Realty’s registered senior notes. \nVentas Realty is a direct, wholly owned subsidiary of Ventas, Inc. Excluding investments in subsidiaries, the assets, liabilities and results of operations of Ventas Realty and Ventas, Inc., on a combined basis, are not material to the consolidated financial position or consolidated results of operations of Ventas. Therefore, in accordance with Rule 13-01 of Regulation S-X, we have elected to exclude summarized financial information for the issuer and guarantor of our registered senior notes. \nPlease see “—Liquidity and Capital Resources” for a description of our outstanding senior notes and other debt obligations, including the registered senior notes described above.\nITEM 7A.    \nQuantitative and Qualitative Disclosures About Market Risk\nThe information set forth in Part II, Item 7 of this Annual Report under “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Asset/Liability Management” is incorporated by reference into this Item 7A.\n70\nITEM 8.    \nFinancial Statements and Supplementary Data\nVentas, Inc.\nIndex to Consolidated Financial Statements and Financial Statement Schedules\nPage\nManagement Report on Internal Control over Financial Reporting\n72\nReport of Independent Registered Public Accounting Firm\n (KPMG LLP, Chicago, IL, Auditor Firm ID: \n185\n)\n73\nReport of Independent Registered Public Accounting Firm on Internal Control over Financial Reporting\n75\nConsolidated Balance Sheets as of December 31, 2024 and 2023\n76\nConsolidated Statements of Income for the Years Ended December 31, 2024, 2023 and 2022\n77\nConsolidated Statements of Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022\n78\nConsolidated Statements of Equity for the Years Ended December 31, 2024, 2023 and 2022\n79\nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022\n80\nNotes to Consolidated Financial Statements\n82\nConsolidated Financial Statement Schedules\n \nSchedule III — Real Estate and Accumulated Depreciation\n124\nSchedule IV — Mortgage Loans on Real Estate\n127\n71\nMANAGEMENT REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act of 1934, as amended. This system is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external purposes in accordance with U.S. GAAP. Because of its inherent limitations, internal control over financial reporting is not intended to provide absolute assurance that a misstatement of our financial statements would be prevented or detected.\nManagement, with the participation of the Company’s Chief Executive Officer and Chief Financial Officer, conducted an assessment of the effectiveness of the Company’s internal control over financial reporting based on the criteria set forth in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, management has concluded that our internal control over financial reporting was effective at the reasonable assurance level as of December 31, 2024.\nThe effectiveness of our internal control over financial reporting as of December 31, 2024 has been audited by KPMG LLP, an independent registered public accounting firm, as stated in their report included herein.\n \n72\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors \nVentas, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Ventas, Inc. and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes and financial statement schedules III and IV (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the years in the three-year period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated February 13, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involves our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nImpairment of real estate investments in the senior housing operating portfolio\nAs discussed in Notes 1, 2, and 5 to the consolidated financial statements, the Company periodically evaluates its long-lived assets, primarily consisting of investments in real estate, for impairment indicators. If indicators of impairment are present, the Company evaluates the carrying value of the related real estate investments in relation to the future undiscounted cash flows of the underlying operations. In performing this evaluation, the Company considers market conditions and current intentions with respect to holding or disposing of the asset and adjusts the net book value of real estate properties to fair value if the sum of the expected future undiscounted cash flows, including sales proceeds, is less than book value. During the year, impairment indicators arose for certain real estate properties and as a result, recoverability assessments were performed.\n73\nWe identified the evaluation of real estate investments within the senior housing operating portfolio for impairment as a critical audit matter. Subjective auditor judgment was required in evaluating the Company’s determination of the future undiscounted cash flows. In particular, the undiscounted cash flows were sensitive to significant assumptions, including capitalization rates, projected operating cash flows, and stabilization period. Additionally, subjective auditor judgment and specialized skills and knowledge were needed to evaluate market data used by the Company.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the impairment process. This included controls related to the Company’s impairment process and the significant assumptions described above. To test certain of the Company’s undiscounted cash flow estimates, we evaluated the Company’s forecasts of projected operating cash flows by comparing actual results to the Company’s forecasts adjusted for current market trends. In addition, we involved valuation professionals with specialized skills and knowledge, who assisted in evaluating the Company’s significant assumptions by comparing the significant assumptions to publicly available market data.\n/s/ \nKPMG LLP\n        \nWe have served as the Company’s auditor since 2014.\nChicago, Illinois\nFebruary 13, 2025\n74\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors Ventas, Inc.:\nOpinion on Internal Control Over Financial Reporting\nWe have audited Ventas, Inc. and subsidiaries' (the Company) internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes and financial statement schedules III and IV (collectively, the consolidated financial statements), and our report dated February 13, 2025 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP    \n    \nChicago, Illinois \nFebruary 13, 2025\n75\nVENTAS, INC.\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except per share amounts)\nAs of December 31, \n2024\n2023\nAssets\n \n \nReal estate investments:\n \n \nLand and improvements\n$\n2,775,790\n \n$\n2,596,274\n \nBuildings and improvements\n28,717,990\n \n27,201,381\n \nConstruction in progress\n336,231\n \n368,143\n \nAcquired lease intangibles\n1,558,751\n \n1,448,146\n \nOperating lease assets\n308,019\n \n312,142\n \n33,696,781\n \n31,926,086\n \nAccumulated depreciation and amortization\n(\n11,096,236\n)\n(\n10,177,136\n)\nNet real estate property\n22,600,545\n \n21,748,950\n \nSecured loans receivable and investments, net\n144,872\n \n27,986\n \nInvestments in unconsolidated real estate entities\n626,122\n \n598,206\n \nNet real estate investments\n23,371,539\n \n22,375,142\n \nCash and cash equivalents\n897,850\n \n508,794\n \nEscrow deposits and restricted cash\n59,383\n \n54,668\n \nGoodwill\n1,044,915\n \n1,045,176\n \nAssets held for sale\n18,625\n \n56,489\n \nDeferred income tax assets, net\n1,931\n \n1,754\n \nOther assets\n792,663\n \n683,410\n \nTotal assets\n$\n26,186,906\n \n$\n24,725,433\n \nLiabilities and equity\n \n \nLiabilities:\n \n \nSenior notes payable and other debt\n$\n13,522,551\n \n$\n13,490,896\n \nAccrued interest payable\n143,345\n \n117,403\n \nOperating lease liabilities\n218,003\n \n194,734\n \nAccounts payable and other liabilities\n1,152,306\n \n1,041,616\n \nLiabilities related to assets held for sale\n2,726\n \n9,243\n \nDeferred income tax liabilities\n8,150\n \n24,500\n \nTotal liabilities\n15,047,081\n \n14,878,392\n \nRedeemable OP unitholder and noncontrolling interests\n310,229\n \n302,636\n \nCommitments and contingencies\nEquity:\n \n \nVentas stockholders’ equity:\n \n \nPreferred stock, $\n1.00\n par value; \n10,000\n shares authorized, unissued\n—\n \n—\n \nCommon stock, $\n0.25\n par value; \n600,000\n shares authorized, \n437,085\n and \n402,380\n shares outstanding at December 31, 2024 and 2023, respectively\n109,119\n \n100,648\n \nCapital in excess of par value\n17,607,482\n \n15,650,734\n \nAccumulated other comprehensive loss\n(\n33,526\n)\n(\n35,757\n)\nRetained earnings (deficit)\n(\n6,886,653\n)\n(\n6,213,803\n)\nTreasury stock, \n4\n and \n279\n shares issued at December 31, 2024 and 2023, respectively\n(\n25,155\n)\n(\n13,764\n)\nTotal Ventas stockholders’ equity\n10,771,267\n \n9,488,058\n \nNoncontrolling interests\n58,329\n \n56,347\n \nTotal equity\n10,829,596\n \n9,544,405\n \nTotal liabilities and equity\n$\n26,186,906\n \n$\n24,725,433\n \nSee accompanying notes.\n76\nVENTAS, INC.\nCONSOLIDATED STATEMENTS OF INCOME\n(In thousands, except per share amounts)\nFor the Years Ended December 31,\n2024\n2023\n2022\nRevenues\n \n \n \nRental income:\n \n \n \nTriple-net leased properties\n$\n622,054\n \n$\n619,208\n \n$\n598,154\n \nOutpatient medical and research portfolio\n874,886\n \n867,193\n \n801,159\n \n1,496,940\n \n1,486,401\n \n1,399,313\n \nResident fees and services\n3,372,796\n \n2,959,219\n \n2,651,886\n \nThird-party capital management revenues\n17,359\n \n17,841\n \n26,199\n \nIncome from loans and investments\n9,057\n \n22,952\n \n48,160\n \nInterest and other income\n28,114\n \n11,414\n \n3,635\n \nTotal revenues\n4,924,266\n \n4,497,827\n \n4,129,193\n \nExpenses\n \n \n \nInterest\n602,835\n \n574,112\n \n467,557\n \nDepreciation and amortization\n1,253,143\n \n1,392,461\n \n1,197,798\n \nProperty-level operating expenses:\nSenior housing\n2,506,413\n \n2,247,812\n \n2,004,420\n \nOutpatient medical and research portfolio\n298,320\n \n292,776\n \n257,003\n \nTriple-net leased properties\n15,829\n \n14,557\n \n15,301\n \n2,820,562\n \n2,555,145\n \n2,276,724\n \nThird-party capital management expenses\n6,507\n \n6,101\n \n6,194\n \nGeneral, administrative and professional fees\n162,990\n \n148,876\n \n144,874\n \nLoss (gain) on extinguishment of debt, net\n687\n \n(\n6,104\n)\n581\n \nTransaction, transition and restructuring costs\n20,369\n \n15,215\n \n30,884\n \n(Reversal of) allowance on loans receivable and investments, net\n(\n166\n)\n(\n20,270\n)\n19,757\n \nGain on foreclosure of real estate\n—\n \n(\n29,127\n)\n—\n \nShareholder relations matters\n15,751\n \n—\n \n20,693\n \nOther expense (income) \n49,584\n \n(\n23,001\n)\n58,268\n \nTotal expenses\n4,932,262\n \n4,613,408\n \n4,223,330\n \nLoss before unconsolidated entities, real estate dispositions, income taxes and noncontrolling interests\n(\n7,996\n)\n(\n115,581\n)\n(\n94,137\n)\nIncome from unconsolidated entities\n1,563\n \n13,626\n \n28,500\n \nGain on real estate dispositions\n57,009\n \n62,119\n \n7,780\n \nIncome tax benefit\n37,775\n \n9,539\n \n16,926\n \nNet income (loss)\n88,351\n \n(\n30,297\n)\n(\n40,931\n)\nNet income attributable to noncontrolling interests\n7,198\n \n10,676\n \n6,516\n \nNet income (loss) attributable to common stockholders\n$\n81,153\n \n$\n(\n40,973\n)\n$\n(\n47,447\n)\nEarnings per common share\n \n \nBasic:\n \n \n \nNet income (loss)\n$\n0.21\n \n$\n(\n0.08\n)\n$\n(\n0.10\n)\nNet income (loss) attributable to common stockholders\n0.20\n \n(\n0.10\n)\n(\n0.12\n)\nDiluted: \n(1)\nNet income (loss)\n$\n0.21\n \n$\n(\n0.08\n)\n$\n(\n0.10\n)\nNet income (loss) attributable to common stockholders\n0.19\n \n(\n0.10\n)\n(\n0.12\n)\n(1)\n     \nPotential common shares are not included in the computation of diluted earnings per share (“EPS”) when a net loss exists as the effect would be an antidilutive per share amount.\nSee accompanying notes.\n77\nVENTAS, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands)\nFor the Years Ended December 31,\n2024\n2023\n2022\nNet income (loss)\n$\n88,351\n \n$\n(\n30,297\n)\n$\n(\n40,931\n)\nOther comprehensive (loss) income:\n \n \n \nForeign currency translation gain (loss)\n14,433\n \n6,024\n \n(\n11,837\n)\nUnrealized loss on available for sale securities\n(\n862\n)\n(\n1,256\n)\n(\n1,838\n)\nUnrealized (loss) gain on derivative instruments\n(\n19,672\n)\n(\n2,766\n)\n39,377\n \nTotal other comprehensive (loss) income\n(\n6,101\n)\n2,002\n \n25,702\n \nComprehensive income (loss)\n82,250\n \n(\n28,295\n)\n(\n15,229\n)\nComprehensive (loss) income attributable to noncontrolling interests\n(\n1,135\n)\n11,635\n \n4,497\n \nComprehensive income (loss) attributable to common stockholders\n$\n83,385\n \n$\n(\n39,930\n)\n$\n(\n19,726\n)\nSee accompanying notes.\n78\nVENTAS, INC.\nCONSOLIDATED STATEMENTS OF EQUITY\nFor the Years Ended December 31, 2024, 2023 and 2022 \n(In thousands, except per share amounts)\nCommon\nStock Par\nValue\nCapital in\nExcess of\nPar Value\nAccumulated Other Comprehensive Loss\nRetained\nEarnings\n(Deficit)\nTreasury\nStock\nTotal Ventas\nStockholders’\nEquity\nNon- controlling\nInterests\nTotal Equity\nBalance at January 1, 2022\n$\n99,838\n \n$\n15,498,956\n \n$\n(\n64,520\n)\n$\n(\n4,679,889\n)\n$\n—\n \n$\n10,854,385\n \n$\n91,375\n \n$\n10,945,760\n \nNet income\n— \n— \n— \n(\n47,447\n)\n— \n(\n47,447\n)\n6,516\n \n(\n40,931\n)\nOther comprehensive income\n— \n— \n27,720\n \n— \n— \n27,720\n \n(\n2,018\n)\n25,702\n \nNet change in noncontrolling interests\n— \n(\n9,235\n)\n— \n— \n— \n(\n9,235\n)\n(\n27,164\n)\n(\n36,399\n)\nDividends to common stockholders—$\n1.80\n per share\n— \n— \n— \n(\n722,049\n)\n— \n(\n722,049\n)\n— \n(\n722,049\n)\nIssuance of common stock for stock plans, restricted stock grants and other\n74\n \n38,370\n \n— \n— \n(\n536\n)\n37,908\n \n— \n37,908\n \nAdjust redeemable OP unitholder interests to current fair value\n— \n11,480\n \n— \n— \n— \n11,480\n \n— \n11,480\n \nRedemption of OP Units\n— \n206\n \n— \n— \n—\n \n206\n \n— \n206\n \nBalance at December 31, 2022\n99,912\n \n15,539,777\n \n(\n36,800\n)\n(\n5,449,385\n)\n(\n536\n)\n10,152,968\n \n68,709\n \n10,221,677\n \nNet loss\n— \n— \n— \n(\n40,973\n)\n— \n(\n40,973\n)\n10,676\n \n(\n30,297\n)\nOther comprehensive income \n— \n— \n1,043\n \n— \n— \n1,043\n \n959\n \n2,002\n \nNet change in noncontrolling interests\n— \n(\n12,495\n)\n— \n— \n— \n(\n12,495\n)\n(\n23,997\n)\n(\n36,492\n)\nDividends to common stockholders—$\n1.80\n per share\n— \n40\n \n— \n(\n723,445\n)\n— \n(\n723,405\n)\n— \n(\n723,405\n)\nIssuance of common stock for stock plans, restricted stock grants and other\n736\n \n141,552\n \n— \n— \n(\n13,228\n)\n129,060\n \n— \n129,060\n \nAdjust redeemable OP unitholder interests to current fair value\n— \n(\n18,056\n)\n— \n— \n— \n(\n18,056\n)\n— \n(\n18,056\n)\nRedemption of OP Units\n— \n(\n84\n)\n— \n— \n— \n(\n84\n)\n— \n(\n84\n)\nBalance at December 31, 2023\n100,648\n \n15,650,734\n \n(\n35,757\n)\n(\n6,213,803\n)\n(\n13,764\n)\n9,488,058\n \n56,347\n \n9,544,405\n \nNet income\n— \n— \n— \n81,153\n \n— \n81,153\n \n7,198\n \n88,351\n \nOther comprehensive loss\n— \n— \n2,231\n \n— \n— \n2,231\n \n(\n8,332\n)\n(\n6,101\n)\nNet change in noncontrolling interests\n— \n(\n22,345\n)\n— \n— \n— \n(\n22,345\n)\n3,116\n \n(\n19,229\n)\nDividends to common stockholders— $\n1.80\n per share\n— \n78\n \n— \n(\n754,003\n)\n— \n(\n753,925\n)\n— \n(\n753,925\n)\nIssuance of common stock for stock plans, restricted stock grants and other\n8,471\n \n2,015,265\n \n— \n— \n(\n11,391\n)\n2,012,345\n \n— \n2,012,345\n \nAdjust redeemable OP unitholder interests to current fair value\n— \n(\n34,169\n)\n— \n— \n— \n(\n34,169\n)\n— \n(\n34,169\n)\nRedemption of OP Units\n— \n(\n2,081\n)\n— \n— \n—\n \n(\n2,081\n)\n— \n(\n2,081\n)\nBalance at December 31, 2024\n$\n109,119\n \n$\n17,607,482\n \n$\n(\n33,526\n)\n$\n(\n6,886,653\n)\n$\n(\n25,155\n)\n$\n10,771,267\n \n$\n58,329\n \n$\n10,829,596\n \n   See accompanying notes.\n79\nV\nENTAS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nFor the Years Ended December 31,\n2024\n2023\n2022\nCash flows from operating activities:\n \n \n \nNet income (loss)\n$\n88,351\n \n$\n(\n30,297\n)\n$\n(\n40,931\n)\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\n \n \n \nDepreciation and amortization \n1,253,143\n \n1,392,461\n \n1,197,798\n \nAmortization of deferred revenue and lease intangibles, net\n(\n54,242\n)\n(\n59,604\n)\n(\n63,543\n)\nOther non-cash amortization\n30,143\n \n22,416\n \n12,957\n \n(Reversal of) allowance on loans receivable and investments, net\n(\n166\n)\n(\n20,270\n)\n19,757\n \nStock-based compensation\n30,991\n \n30,987\n \n30,715\n \nStraight-lining of rental income\n(\n5,094\n)\n(\n7,597\n)\n(\n11,094\n)\nLoss (gain) on extinguishment of debt, net\n687\n \n(\n6,104\n)\n581\n \nGain on real estate dispositions\n(\n57,009\n)\n(\n62,119\n)\n(\n7,780\n)\nIncome tax benefit\n(\n43,487\n)\n(\n15,269\n)\n(\n21,348\n)\nIncome from unconsolidated entities\n(\n1,563\n)\n(\n13,626\n)\n(\n28,500\n)\nGain on foreclosure of real estate\n—\n \n(\n29,127\n)\n—\n \nDistributions from unconsolidated entities\n18,298\n \n16,123\n \n19,847\n \nOther\n25,762\n \n(\n44,503\n)\n52,489\n \nChanges in operating assets and liabilities:\nIncrease in other assets\n(\n117,363\n)\n(\n48,445\n)\n(\n52,897\n)\nIncrease in accrued interest payable\n27,205\n \n1,252\n \n4,915\n \nIncrease (decrease) in accounts payable and other liabilities\n133,969\n \n(\n6,405\n)\n7,197\n \nNet cash provided by operating activities\n1,329,625\n \n1,119,873\n \n1,120,163\n \nCash flows from investing activities:\n \n \n \nNet investment in real estate property\n(\n1,925,957\n)\n(\n6,466\n)\n(\n446,628\n)\nInvestment in loans receivable\n(\n125,363\n)\n(\n2,750\n)\n(\n30,700\n)\nProceeds from real estate disposals\n329,094\n \n399,534\n \n112,926\n \nProceeds from loans receivable\n6,870\n \n44,630\n \n890\n \nProceeds from sale of interest in unconsolidated entities\n—\n \n50,054\n \n—\n \nNet cash assumed in foreclosure of real estate\n—\n \n11,615\n \n—\n \nDevelopment project expenditures\n(\n322,232\n)\n(\n383,590\n)\n(\n231,939\n)\nCapital expenditures\n(\n281,614\n)\n(\n259,415\n)\n(\n222,130\n)\nDistributions from unconsolidated entities\n8,368\n \n74,670\n \n28,311\n \nInvestment in unconsolidated entities\n(\n69,797\n)\n(\n130,522\n)\n(\n83,652\n)\nInsurance proceeds for property damage claims\n3,542\n \n17,576\n \n13,704\n \nNet cash used in investing activities\n(\n2,377,089\n)\n(\n184,664\n)\n(\n859,218\n)\nCash flows from financing activities:\n \n \n \nNet change in borrowings under revolving credit facilities\n(\n7,103\n)\n(\n12,410\n)\n(\n27,179\n)\nNet change in borrowings under commercial paper program\n—\n \n(\n402,354\n)\n122,414\n \nProceeds from debt\n1,913,431\n \n2,527,482\n \n957,781\n \nRepayment of debt\n(\n1,621,316\n)\n(\n1,973,132\n)\n(\n575,391\n)\nPurchase of noncontrolling interests\n(\n11,064\n)\n(\n110\n)\n(\n170\n)\nPayment of deferred financing costs\n(\n35,878\n)\n(\n41,837\n)\n(\n8,824\n)\nIssuance of common stock, net\n1,964,867\n \n108,455\n \n—\n \nCash distribution to common stockholders\n(\n740,326\n)\n(\n723,559\n)\n(\n720,319\n)\nCash distribution to redeemable OP unitholders\n(\n6,468\n)\n(\n6,191\n)\n(\n6,292\n)\nCash issued for redemption of OP Units\n(\n2,416\n)\n(\n1,132\n)\n(\n1,487\n)\nContributions from noncontrolling interests\n3,703\n \n20,241\n \n5,371\n \nDistributions to noncontrolling interests\n(\n22,300\n)\n(\n32,029\n)\n(\n32,325\n)\nProceeds from stock option exercises\n26,052\n \n1,736\n \n8,691\n \nOther\n(\n15,962\n)\n(\n8,909\n)\n(\n6,198\n)\nNet cash provided by (used in) financing activities\n1,445,220\n \n(\n543,749\n)\n(\n283,928\n)\nNet increase (decrease) in cash, cash equivalents and restricted cash\n397,756\n \n391,460\n \n(\n22,983\n)\nEffect of foreign currency translation\n(\n3,985\n)\n1,257\n \n(\n2,869\n)\nCash, cash equivalents and restricted cash at beginning of year\n563,462\n \n170,745\n \n196,597\n \nCash, cash equivalents and restricted cash at end of year\n$\n957,233\n \n$\n563,462\n \n$\n170,745\n \n80\nV\nENTAS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS (Continued)\n(Dollars in thousands)\nFor the Years Ended December 31,\n2024\n2023\n2022\nSupplemental disclosure of cash flow information:\n \n \n \nInterest paid excluding capitalized interest\n$\n575,741\n \n$\n548,108\n \n$\n467,556\n \nSupplemental schedule of non-cash activities:\n \n \n \nAssets acquired and liabilities assumed from acquisitions and other:\n \n \n \nReal estate investments\n$\n43,086\n \n$\n—\n \n$\n16,540\n \nOther assets\n12,955\n \n7,873\n \n875\n \nOther liabilities\n23,489\n \n9,000\n \n7,747\n \nDeferred income tax liability\n28,601\n \n12,382\n \n960\n \nNoncontrolling interests\n—\n \n—\n \n3,351\n \nSettlement of loan receivable\n—\n \n486,082\n \n—\n \nReal estate received in settlement of loan receivable\n—\n \n1,566,395\n \n—\n \nAssumption of debt related to real estate owned\n—\n \n1,016,804\n \n—\n \nEquity issued for redemption of OP Units\n434\n \n—\n \n—\n \nInvestment in unconsolidated entities\n—\n \n—\n \n8,100\n \nSee accompanying notes.\n81\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 – DESCRIPTION OF BUSINESS  \nVentas, Inc., (together with its consolidated subsidiaries, unless otherwise indicated or except where the context otherwise requires, “we,” “us,” “our,” “Company” and other similar terms) is a real estate investment trust (“REIT”) focused on delivering strong, sustainable shareholder returns by enabling exceptional environments that benefit a large and growing aging population. We hold a portfolio that includes senior housing communities, outpatient medical buildings, research centers, hospitals and healthcare facilities located in North America and the United Kingdom.  As of December 31, 2024, we owned or had investments in \n1,387\n properties consisting of \n1,356\n properties in our reportable business segments (“Segment Properties”) and \n31\n properties held by unconsolidated real estate entities in our non-segment operations. Our Company is headquartered in Chicago, Illinois with additional corporate offices in Louisville, Kentucky and New York, New York.\nWe elected to be taxed as a REIT under Sections 856 through 860 of the Internal Revenue Code (the “Code”), commencing with our taxable year ended December 31, 1999. Provided we qualify for taxation as a REIT, we generally are not required to pay U.S. federal corporate income taxes on our REIT taxable income that is currently distributed to our stockholders.  In order to maintain our qualification as a REIT, we must satisfy a number of technical requirements, which impact how we invest in, operate and manage our assets.\nWe operate through three reportable business segments: senior housing operating portfolio, which we refer to as “SHOP,” outpatient medical and research portfolio, which we refer to as “OM&R,” and triple-net leased properties, which we refer to as “NNN.” We also hold assets outside of our reportable business segments, which we refer to as non-segment assets and which consist primarily of corporate assets, including cash and cash equivalents, restricted cash, loans receivable and investments and accounts receivable as well as investments in unconsolidated entities. Our investments in unconsolidated entities include investments made through our third-party institutional private capital management platform, Ventas Investment Management (“VIM”). Through VIM, we partner with third-party institutional investors to invest in real estate through various joint ventures and other co-investment vehicles where we are the sponsor or general partner, including our open-ended investment vehicle, the Ventas Life Science & Healthcare Real Estate Fund (the “Ventas Fund”).\nOur chief operating decision maker evaluates performance of the combined properties in each operating segment and determines how to allocate resources to these segments, based on net operating income (“NOI”) for each segment. See our Consolidated Financial Statements and the related notes, including “Note 2 – Accounting Policies” and “Note 18 – Segment Information”.\nThe following table summarizes information for our portfolio for the year ended December 31, 2024 (dollars in thousands):\nSegment\nNOI \n(1)\nPercentage of Total NOI\nSegment Properties\nSenior housing operating portfolio (SHOP)\n$\n866,383\n \n41.9\n \n%\n629\n \nOutpatient medical and research portfolio (OM&R)\n579,271\n \n28.0\n \n%\n426\n \nTriple-net leased properties (NNN)\n606,225\n \n29.3\n \n%\n301\n \nNon-segment \n(2)\n17,204\n \n0.8\n \n%\nn/a\n$\n2,069,083\n \n100\n \n%\n1,356\n \n______________________________\n(1)    \n“NOI” is defined as total revenues, less interest and other income, property-level operating expenses and third-party capital management expenses. See “Non-GAAP Financial Measures” included elsewhere in this Annual Report for additional disclosure and a reconciliation of net income attributable to common stockholders, as computed in accordance with U.S. generally accepted accounting principles (“GAAP”), to NOI.\n(2)    \nNOI for non-segment includes management fees and promote revenues, net of expenses related to our third-party institutional private capital management platform, income from loans and investments and corporate-level expenses not directly attributable to any of our \nthree\n reportable business segments.\nNOTE 2 – ACCOUNTING POLICIES \nPrinciples of Consolidation\nThe accompanying Consolidated Financial Statements include our accounts and the accounts of our wholly-owned subsidiaries and the joint venture entities over which we exercise control. All intercompany transactions and balances have been \n82\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\neliminated in consolidation, and our net earnings are reduced by the portion of net earnings attributable to noncontrolling interests. \nU.S. generally accepted accounting principles (“GAAP”) require us to identify entities for which control is achieved through means other than voting rights and to determine which business enterprise is the primary beneficiary of variable interest entities (“VIEs”). A VIE is broadly defined as an entity with one or more of the following characteristics: (a) the total equity investment at risk is insufficient to finance the entity’s activities without additional subordinated financial support; (b) as a group, the holders of the equity investment at risk lack (i) the ability to make decisions about the entity’s activities through voting or similar rights, (ii) the obligation to absorb the expected losses of the entity, or (iii) the right to receive the expected residual returns of the entity; and (c) the equity investors have voting rights that are not proportional to their economic interests, and substantially all of the entity’s activities either involve, or are conducted on behalf of, an investor that has disproportionately few voting rights. We consolidate our investment in a VIE when we determine that we are its primary beneficiary. We may change our original assessment of a VIE upon subsequent events such as the modification of contractual arrangements that affects the characteristics or adequacy of the entity’s equity investments at risk and the disposition of all or a portion of an interest held by the primary beneficiary.\n \nWe identify the primary beneficiary of a VIE as the enterprise that has both: (i) the power to direct the activities of the VIE that most significantly impact the entity’s economic performance and (ii) the obligation to absorb losses or the right to receive benefits of the VIE that could be significant to the entity. We perform this analysis on an ongoing basis.\nAs it relates to investments in joint ventures, GAAP may preclude consolidation by the sole general partner in certain circumstances based on the type of rights held by the limited partner or partners. We assess limited partners’ rights and their impact on our consolidation conclusions, and we reassess if there is a change to the terms or in the exercisability of the rights of the limited partners, the sole general partner increases or decreases its ownership of limited partnership (“LP”) interests or there is an increase or decrease in the number of outstanding LP interests. We also apply this guidance to managing member interests in limited liability companies (“LLCs”). \nWe consolidate several VIEs that share the following common characteristics: \n•\nthe VIE is in the legal form of an LP or LLC; \n•\nthe VIE was designed to own and manage its underlying real estate investments; \n•\nwe are the general partner or managing member of the VIE; \n•\nwe own a majority of the voting interests in the VIE; \n•\na minority of voting interests in the VIE are owned by external third parties, unrelated to us; \n•\nthe minority owners do not have substantive kick-out or participating rights in the VIE; and  \n•\nwe are the primary beneficiary of the VIE. \nWe have separately identified certain special purpose entities that were established to allow investments in research projects by tax credit investors (“TCIs”). We have determined that these special purpose entities are VIEs, we are a holder of variable interests and we are the primary beneficiary of the VIEs, and therefore, we consolidate these special purpose entities. Our primary beneficiary determination is based upon several factors, including but not limited to the rights we have in directing the activities which most significantly impact the VIEs’ economic performance as well as certain guarantees which protect the TCIs from losses should a tax credit recapture event occur.  \n83\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSubstantially all of the assets of the VIEs are real estate investments and substantially all of the liabilities of the VIEs are mortgage loans. Assets of the consolidated VIEs can only be used to settle obligations of such VIEs. Liabilities of the consolidated VIEs represent claims against the specific assets of the VIEs. Unless otherwise required by an operating agreement, any mortgage loans of the consolidated VIEs are non-recourse to us.\n \nThe table below summarizes the total assets and liabilities of our consolidated VIEs as reported on our Consolidated Balance Sheets (dollars in thousands):\nAs of December 31, 2024\nAs of December 31, 2023\nTotal Assets\nTotal Liabilities\nTotal Assets\nTotal Liabilities\nNHP/PMB L.P.\n$\n728,457\n \n$\n286,030\n \n$\n759,817\n \n$\n266,658\n \nFonds Immobilier Groupe Maurice, S.E.C.\n1,779,762\n \n1,121,659\n \n1,971,410\n \n1,204,619\n \nOther identified VIEs\n1,447,381\n \n410,721\n \n1,597,957\n \n354,828\n \nTax credit VIEs \n(1)\n—\n \n—\n \n29,746\n \n4,024\n \n______________________________\n(1)\n     Balances as of December 31, 2024 reflect the completion of the tax credit structure unwinds.\nInvestments in Unconsolidated Entities\nWe report investments in unconsolidated entities over whose operating and financial policies we have the ability to exercise significant influence under the equity method of accounting. We adjust our investment in unconsolidated entities for additional contributions made, distributions received as well as our share of the investee’s earnings or losses, which is included in Income from unconsolidated entities in our Consolidated Statements of Income.\nWe base the initial carrying value of investments in unconsolidated entities on the fair value of the assets at the time we acquired the joint venture interest. We estimate fair values for our equity method investments based on discounted cash flow models that include all estimated cash inflows and outflows over a specified holding period and, where applicable, any estimated debt premiums or discounts. The capitalization rates, discount rates and credit spreads we use in these models are based upon assumptions that we believe to be within a reasonable range of current market rates for the respective investments.\nWe generally amortize any difference between our cost basis and the basis reflected at the joint venture level, if any, over the lives of the related assets and liabilities and include that amortization in our share of income or loss from unconsolidated entities. For earnings of equity method investments with pro rata distribution allocations, net income or loss is allocated between the partners in the joint venture based on their respective stated ownership percentages. In other instances, net income or loss may be allocated between the partners in the joint venture based on the hypothetical liquidation at book value method (the “HLBV method”). Under the HLBV method, net income or loss is allocated between the partners based on the difference between each partner’s claim on the net assets of the joint venture at the end and beginning of the period, after taking into account contributions and distributions. Each partner’s share of the net assets of the joint venture is calculated as the amount that the partner would receive if the joint venture were to liquidate all of its assets at net book value and distribute the resulting cash to creditors and partners in accordance with their respective priorities. Under the HLBV method, in any given period, we could record more or less income than the joint venture has generated, than actual cash distributions we receive or than the amount we may receive in the event of an actual liquidation.\nRedeemable OP Unitholder and Noncontrolling Interests\nWe own a majority interest in NHP/PMB L.P. (“NHP/PMB”), a limited partnership formed in 2008 to acquire properties from entities affiliated with Pacific Medical Buildings LLC (“PMB”). Given our wholly-owned subsidiary is the general partner and the primary beneficiary of NHP/PMB, we consolidate NHP/PMB as a VIE. As of December 31, 2024, third-party investors owned \n3.8\n million Class A limited partnership units in NHP/PMB (“OP Units”), which represented \n33\n% of the total units then outstanding, and we owned \n7.7\n million Class B limited partnership units in NHP/PMB, representing the remaining \n67\n%. The OP Units may be redeemed at any time at the election of the holder for cash or, at our option, \n0.9051\n shares of our common stock per OP Unit, subject to adjustment in certain circumstances. We are party by assumption to a registration rights agreement with the holders of the OP Units that requires us, subject to the terms and conditions and certain exceptions set forth therein, to file and maintain a registration statement relating to the issuance of shares of our common stock upon redemption of OP Units. \nThe OP Units are classified outside of permanent equity on our Consolidated Balance Sheets because they may be redeemed by third parties under circumstances that are outside of our control. We reflect the OP Units at the greater of cost or redemption value. We recognize changes in fair value through capital in excess of par value, net of cash distributions paid and \n84\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\npurchases by us of any OP Units. Our diluted earnings per share includes the effect of any potential shares outstanding from redemption of the OP Units.  \nCertain noncontrolling interests of other consolidated joint ventures were also classified as redeemable at December 31, 2024 and 2023. We record the carrying amount of these noncontrolling interests at the greater of their initial carrying amount (increased or decreased for the noncontrolling interests’ share of net income or loss and distributions) or the redemption value, which is primarily based on the fair value of the underlying real estate asset. Our joint venture partners have certain redemption rights with respect to their noncontrolling interests in these joint ventures that are outside of our control, and the redeemable noncontrolling interests are classified outside of permanent equity on our Consolidated Balance Sheets. We recognize changes in the carrying value of redeemable noncontrolling interests through Capital in excess of par value on our Consolidated Balance Sheets. \n \nNoncontrolling Interests\nExcluding the redeemable noncontrolling interests described above, we present the portion of any equity that we do not own in entities that we control (and thus consolidate) as noncontrolling interests and classify those interests as a component of consolidated equity, separate from total Ventas stockholders’ equity, on our Consolidated Balance Sheets. For consolidated joint ventures with pro rata distribution allocations, net income or loss, and comprehensive income, is allocated between the joint venture partners based on their respective stated ownership percentages. In other cases, net income or loss is allocated between the joint venture partners based on the HLBV method. We account for purchases or sales of equity interests that do not result in a change of control as equity transactions, through capital in excess of par value. We include Net income attributable to noncontrolling interests in net income in our Consolidated Statements of Income and we include the noncontrolling interests’ share of comprehensive income in our Consolidated Statements of Comprehensive Income.\nAccounting for Historic and New Markets Tax Credits\nFor certain of our research centers, we are party to contractual arrangements with TCIs that were established to enable the TCIs to receive benefits of historic tax credits (“HTCs”), new markets tax credits (“NMTCs”) or both. As of December 31, 2024 and 2023, we owned \nzero\n and \none\n property that had syndicated NMTCs to TCIs.\nIn general, TCIs invest cash into special purpose entities that invest in entities that own the subject property and generate the tax credits. The TCIs receive substantially all of the tax credits and hold only a nominal interest in the economic risk and benefits of the special purpose entities. \nHTCs are delivered to the TCIs upon substantial completion of the project. NMTCs are allowed for up to \n39\n% of a qualified investment and are delivered to the TCIs after the investment has been funded and spent on a qualified business. HTCs are subject to recapture within five years of substantial completion. The amount of the recapture is equal to \n100\n% of the HTCs during the first year after the completion of the historic rehabilitation and is reduced by \n20\n% each year during the subsequent five-year period. NMTCs are subject to recapture until the end of the seventh year following the qualifying investment. We have provided the TCIs with certain guarantees which protect the TCIs from losses should a tax credit recapture event occur. The contractual arrangements with the TCIs include a put/call provision whereby we may be obligated or entitled to repurchase the interest of the TCIs in the special purpose entities at the end of the tax credit recapture period. We anticipate that either the TCIs will exercise their put rights or we will exercise our call rights prior to the applicable tax credit recapture periods.\nThe portion of the TCI’s investment that is attributed to the put is recorded at fair value at inception in accounts payable and other liabilities on our Consolidated Balance Sheets, and is accreted to the expected put price as interest expense in our Consolidated Statements of Income over the recapture period. The remaining balance of the TCI’s investment is initially recorded in accounts payable and other liabilities on our Consolidated Balance Sheets and will be relieved upon delivery of the tax credit to the TCI, as a reduction in the carrying value of the subject property, net of allocated expenses. Direct and incremental costs incurred in structuring the transaction are deferred and will be recognized as an increase in the cost basis of the subject property upon the recognition of the related tax credit as discussed above.\n85\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAccounting Estimates\nThe preparation of financial statements in accordance with GAAP requires us to make estimates and assumptions regarding future events that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period.  Actual results could differ from those estimates.\nAccounting for Real Estate Acquisitions\nWhen we acquire real estate, we first make reasonable judgments about whether the transaction involves an asset or a business. Our real estate acquisitions are generally accounted for as asset acquisitions as substantially all of the fair value of the gross assets acquired is concentrated in a single identifiable asset or group of similar identifiable assets. We record the cost of the assets acquired as tangible and intangible assets and liabilities based upon their relative fair values as of the acquisition date. \nOur asset acquisitions may include one or more groups of real estate properties within which there are different types of tangible and intangible assets, typically consisting of land, buildings, site improvements, furniture, fixtures and equipment and lease intangibles.  When we acquire multiple real estate properties in a single transaction, we first assess the individual fair value of the real estate properties and then determine the individual fair value of the various types of tangible and intangible assets therein. The individual fair value of the real estate properties is estimated by applying a valuation methodology such as the direct capitalization method of the income approach, which includes estimate for a capitalization rate, annual gross income, vacancy, and expenses based on a number of factors including historical operating results, known and anticipated trends as well as market and economic conditions.\nWe estimate the fair value of buildings acquired on an as-if-vacant basis or replacement cost basis and depreciate the building value over the estimated remaining life of the building, generally \n35\n years. We determine the fair value of other fixed assets, such as site improvements, and furniture, fixtures and equipment, based upon the replacement cost and depreciate such value over the assets’ estimated remaining useful lives, generally \n15\n years for land improvements and \n20\n years for building improvements. We determine the value of land either by considering the sales prices of similar properties in recent transactions or based on internal analyses of recently acquired and existing comparable properties within our portfolio. We generally determine the value of construction in progress based upon the replacement cost. However, for certain acquired properties that are part of a ground-up development, we determine fair value by using the same valuation approach as for all other properties and deducting the estimated cost to complete the development. During the remaining construction period, we capitalize project costs until the development has reached substantial completion. Construction in progress, including capitalized interest, is not depreciated until the development has reached substantial completion.\nIntangibles primarily include the value of in-place leases and acquired lease contracts. We include all lease-related intangible assets and liabilities within Acquired lease intangibles and Accounts payable and other liabilities, respectively, on our Consolidated Balance Sheets. \nThe fair value of acquired lease-related intangibles, if any, reflects: (i) the estimated value of any above or below market leases, determined by discounting the difference between the estimated market rent and in-place lease rent; and (ii) the estimated value of in-place leases related to the cost to obtain tenants, including leasing commissions, and an estimated value of the absorption period to reflect the value of the rent and recovery costs foregone during a reasonable lease-up period as if the acquired space was vacant. We amortize any acquired lease-related intangibles to revenue or amortization expense over the remaining life of the associated lease plus any assumed bargain renewal periods. If a lease is terminated prior to its stated expiration or not renewed upon expiration, we recognize all unamortized amounts of lease-related intangibles associated with that lease in operations over the shortened lease term.\nWe estimate the fair value of purchase option intangible assets and liabilities, if any, by discounting the difference between the applicable property’s acquisition date fair value and an estimate of its future option price. We do not amortize the resulting intangible asset or liability over the term of the lease, but rather adjust the recognized value of the asset or liability upon sale.\nIn connection with an acquisition, we may assume rights and obligations under certain lease agreements pursuant to which we become the lessee of a given property. We generally assume the lease classification previously determined by the prior lessee absent a modification in the assumed lease agreement. We assess assumed operating leases, including ground leases, to determine whether the lease terms are favorable or unfavorable to us given current market conditions on the acquisition date. To the extent the lease terms are favorable or unfavorable to us relative to market conditions on the acquisition \n86\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\ndate, we recognize an intangible asset or liability at fair value and amortize that asset or liability to Interest or rental expense in our Consolidated Statements of Income over the applicable lease term. Where we are the lessee, we record the acquisition date values of leases, including any above or below market value, within Operating lease assets and Operating lease liabilities on our Consolidated Balance Sheets.\nWe estimate the fair value of noncontrolling interests assumed consistent with the manner in which we value all of the underlying assets and liabilities.\nWe calculate the fair value of long-term assumed debt by discounting the remaining contractual cash flows on each instrument at the current market rate for those borrowings, which we approximate based on the rate at which we would expect to incur a replacement instrument on the date of acquisition, and recognize any fair value adjustments related to long-term debt as effective yield adjustments over the remaining term of the instrument.\nImpairment of Long-Lived and Intangible Assets\nWe periodically evaluate our long-lived assets, primarily consisting of investments in real estate, for impairment indicators. If indicators of impairment are present, we evaluate the carrying value of the related real estate investments in relation to the future undiscounted cash flows of the underlying operations. In performing this evaluation, we consider market conditions and our current intentions with respect to holding or disposing of the asset. We adjust the net book value of properties and other long-lived assets to fair value if the sum of the expected future undiscounted cash flows, including sales proceeds, is less than book value. We recognize an impairment loss at the time we make any such determination.  \nIf impairment indicators arise with respect to intangible assets with finite useful lives, we evaluate impairment by comparing the carrying amount of the asset to the estimated future undiscounted net cash flows expected to be generated by the asset.  If estimated future undiscounted net cash flows are less than the carrying amount of the asset, then we estimate the fair value of the asset and compare the estimated fair value to the intangible asset’s carrying value. We recognize any shortfall from carrying value as an impairment loss in the current period. \nWe evaluate our investments in unconsolidated entities for impairment at least annually, and whenever events or changes in circumstances indicate that the carrying value of our investment may exceed its fair value. If we determine that a decline in the fair value of our investment in an unconsolidated entity is other-than-temporary, and if such reduced fair value is below the carrying value, we record an impairment.  \nWe test goodwill for impairment at least annually, and more frequently if indicators of impairment arise. We first assess qualitative factors, such as current macroeconomic conditions, state of the equity and capital markets and our overall financial and operating performance, to determine the likelihood that the fair value of a reporting unit is less than its carrying amount. If we determine it is more likely than not that the fair value of a reporting unit is less than its carrying amount, we proceed with estimating the fair value of the operating unit. A goodwill impairment, if any, will be recognized in the period it is determined and is measured as the amount by which a reporting unit’s carrying value exceeds its fair value. \nEstimates of fair value used in our evaluation of goodwill (if necessary based on our qualitative assessment), investments in real estate, investments in unconsolidated entities and intangible assets are based upon discounted future cash flow projections or other acceptable valuation techniques that are based, in turn, upon all available evidence including level three inputs, such as revenue and expense growth rates, estimates of future cash flows, capitalization rates, discount rates, general economic conditions and trends, or other available market data such as replacement cost or comparable sales. Our ability to accurately predict future operating results and cash flows and to estimate and determine fair values impacts the timing and recognition of impairments. While we believe our assumptions are reasonable, changes in these assumptions may have a material impact on our financial results.\n \nAssets Held for Sale \nWe sell properties from time to time for various reasons, including favorable market conditions or the exercise of purchase options by tenants. We classify certain long-lived assets as held for sale once the criteria, as defined by GAAP, have been met. Long-lived assets to be disposed of are reported at the lower of their carrying amount or fair value minus cost to sell and are no longer depreciated.\nIf at any time we determine that the criteria for classifying assets as held for sale are no longer met, we reclassify assets within Net real estate property on our Consolidated Balance Sheets for all periods presented. The carrying amount of \n87\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nthese assets is adjusted in the period in which a change in classification is determined to reflect any depreciation expense that would have been recognized had the asset been continuously classified as net real estate investments.\nLoans Receivable\nWe record loans receivable, other than those acquired in connection with asset acquisition, on our Consolidated Balance Sheets (either in Secured loans receivable and investments, net or Other assets, in the case of non-mortgage loans receivable) at the unpaid principal balance, net of any deferred origination fees, purchase discounts or premiums and valuation allowances. We amortize net deferred origination fees, which are comprised of loan fees collected from the borrower net of certain direct costs, and purchase discounts or premiums over the contractual life of the loan using the effective interest method and immediately recognize in income any unamortized balances if the loan is repaid before its contractual maturity.\n \nWe evaluate a current estimate of all expected credit losses over the life of a financial instrument, which may result in recognition of credit losses on loans and other financial instruments before an actual event of default. We evaluate the collectability of our loans receivable based on a combination of credit quality indicators, including, but not limited to, payment status, financial strength of the borrower and guarantors, historical loan write-offs, and nature, extent and value of the underlying collateral. We establish reserves for any estimated credit losses with a corresponding charge to Allowance on loans receivable and investments in our Consolidated Statements of Income. Subsequent changes in our estimate of credit losses may result in a corresponding increase or decrease to Allowance on loans receivable and investments in our Consolidated Statements of Income.\nCash Equivalents\nCash equivalents consist of highly liquid investments with original maturity date of three months or less when purchased. These investments are stated at cost, which approximates fair value.\nEscrow Deposits and Restricted Cash\nEscrow deposits consist of amounts held by us or our lenders to provide for future real estate tax, insurance expenditures and tenant improvements related to our properties and operations. Restricted cash generally represents amounts paid to us for security deposits and other similar purposes.\nDeferred Financing Costs\nWe amortize deferred financing costs, which are reported as a reduction to Senior notes payable and other debt on our Consolidated Balance Sheets, as a component of interest expense over the terms of the related borrowings using a method that approximates a level yield. Amortization of approximately $\n28.9\n million, $\n23.2\n million and $\n18.2\n million were included in Interest expense for the years ended December 31, 2024, 2023 and 2022, respectively.\nAvailable for Sale Securities\nWe record our available for sale securities at fair value and include unrealized gains and losses in stockholders’ equity as a component of Accumulated other comprehensive income on our Consolidated Balance Sheets. If we determine that a credit loss exists with respect to individual investments, we will recognize an allowance against the amortized cost basis of the investment with a corresponding charge to net income (in Allowance on loans receivable and investments) in our Consolidated Statements of Income. Income from available for sale securities is recognized when earned and gains or losses on securities sold, which are based on the specific identification method, and reported in Income from loans and investments in our Consolidated Statements of Income.\nDerivative Instruments\nWe recognize all derivative instruments in Other assets or Accounts payable and other liabilities on our Consolidated Balance Sheets at fair value as of the reporting date. We recognize changes in the fair value of derivative instruments designated as cash flow hedges, which are primarily used to hedge interest rate risk, in Accumulated other comprehensive income on our Consolidated Balance Sheets, and are amortized over the life of the related debt to Interest expense in our Consolidated Statements of Income.\n88\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nWe do not use our derivative financial instruments, including interest rate caps, interest rate swaps and foreign currency forward contracts, for trading or speculative purposes. Our foreign currency forward contracts and certain of our interest rate swaps (including the interest rate swap contracts of consolidated and unconsolidated joint ventures) are designated as effectively hedging the variability of expected cash flows related to their underlying securities and, therefore, also are recorded on our Consolidated Balance Sheets at fair value, with changes in the fair value of these instruments recognized in Accumulated other comprehensive income on our Consolidated Balance Sheets. We recognize any noncontrolling interests’ proportionate share of the changes in fair value of swap contracts of our consolidated joint ventures in Noncontrolling interests on our Consolidated Balance Sheets. We recognize our proportionate share of the change in fair value of swap contracts of our unconsolidated joint ventures in Accumulated other comprehensive income on our Consolidated Balance Sheets. Certain of our other interest rate swaps and rate caps were not designated as having a hedging relationship with the underlying securities and therefore do not meet the criteria for hedge accounting under GAAP. Accordingly, these derivative instruments are recorded on our Consolidated Balance Sheets at fair value, and changes in the fair value of these instruments are recognized in Interest expense in our Consolidated Statements of Income.\n \nFair Values of Financial Instruments\nFair value is a market-based measurement, not an entity-specific measurement, and we determine fair value based on the assumptions that we expect market participants would use in pricing the asset or liability. As a basis for considering market participant assumptions in fair value measurements, GAAP establishes a fair value hierarchy that distinguishes between market participant assumptions based on market data obtained from sources independent of the reporting entity (observable inputs that are classified within Levels 1 and 2 of the hierarchy) and the reporting entity’s own assumptions about market participant assumptions (unobservable inputs classified within Level 3 of the hierarchy). \nThe fair value hierarchy is as follows:\n•\nLevel 1 inputs - Unadjusted quoted prices for identical assets or liabilities in active markets that we have the ability to access. \n•\nLevel 2 inputs - Inputs other than quoted prices included in Level 1 that are directly or indirectly observable for the asset or liability. Level 2 inputs may include quoted prices for similar assets and liabilities in active markets and other inputs for the asset or liability that are observable at commonly quoted intervals, such as interest rates, foreign exchange rates and yield curves. \n•\nLevel 3 inputs - Unobservable inputs for the asset or liability, which typically are based on our own assumptions, because there is little, if any, related market activity. \nIf the determination of the fair value measurement is based on inputs from different levels of the hierarchy, the level within which the entire fair value measurement falls is the lowest-level input that is significant to the fair value measurement in its entirety. If the volume and level of market activity for an asset or liability has decreased significantly relative to the normal market activity for such asset or liability (or similar assets or liabilities), then transactions or quoted prices may not accurately reflect fair value. In addition, if there is evidence that a transaction for an asset or liability is not orderly, little, if any, weight is placed on that transaction price as an indicator of fair value. Our assessment of the significance of a particular input to the fair value measurement in its entirety requires judgment and considers factors specific to the asset or liability. \nWe use the following methods and assumptions in estimating the fair value of our financial instruments whose fair value is determined on a recurring basis.\n•\nCash and cash equivalents - \nThe carrying amount of unrestricted cash and cash equivalents reported on our Consolidated Balance Sheets approximates fair value due to the short maturity of these instruments.\n•\nEscrow deposits and restricted cash\n \n-\n The carrying amount of escrow deposits and restricted cash reported on our Consolidated Balance Sheets approximates fair value due to the short maturity of these instruments.\n•\nLoans receivable - \nWe estimate the fair value of loans receivable using Level 2 and Level 3 inputs, including underlying asset performance and credit quality. We discount future cash flows using current interest rates at which similar loans with the same terms and length to maturity would be made to borrowers with similar credit ratings. \n•\nAvailable for sale securities - \nWe estimate the fair value of marketable debt securities using Level 2 inputs. We observe quoted prices for similar assets or liabilities in active markets that we have the ability to access. We \n89\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nconsider credit spreads, underlying asset performance and credit quality, default rates and confirmed settlement amounts at maturity.\n•\nDerivative instruments - \nWe estimate the fair value of derivative instruments, including interest rate caps, interest rate swaps, and foreign currency forward contracts, using Level 2 inputs. \n◦\nInterest rate caps \n-\n We observe forward yield curves and other relevant information.\n◦\nInterest rate swaps \n-\n We observe alternative financing rates derived from market-based financing rates, forward yield curves and discount rates.\n◦\nForeign currency forward contracts \n-\n We estimate the future values of the two currency tranches using forward exchange rates that are based on traded forward points and calculate a present value of the net amount using a discount factor based on observable traded interest rates.\n•\nStock warrants -\n We estimate the fair value of stock warrants representing an interest in a public-traded entity using Level 2 inputs that are obtained from public sources such as equity spot price, dividend yield, volatility and risk-free rate. We estimate the fair value of stock warrants representing a financial interest in a private entity based on Level 3 inputs that reflect significant assumptions including underlying enterprise value, market volatility, duration, dividend rate and risk-free rate.\n•\nSenior notes payable and other debt - \nWe estimate the fair value of senior notes payable and other debt using Level 2 inputs. We discount the future cash flows using current interest rates at which we could obtain similar borrowings. For mortgage debt, we may estimate fair value using level three inputs, similar to those used in determining fair value of loans receivable (above).\n•\nRedeemable OP unitholder interests - \nWe estimate the fair value of our redeemable OP unitholder interests using Level 1 inputs. We base fair value on the closing price of our common stock, as OP Units may be redeemed at the election of the holder for cash or, at our option, shares of our common stock, subject to adjustment in certain circumstances.\nRevenue Recognition\nNNN and OM&R\nIn accordance with Accounting Standards Codification (“ASC”) 842, \nLeases\n (“ASC 842”), we recognize rental revenue for operating lease arrangements when the tenant takes possession or controls the physical leased asset. Certain of our triple-net leases and most of our outpatient medical buildings and research centers’ (collectively, “outpatient medical and research portfolio”) leases provide for periodic and determinable increases in base rent. We recognize base rental revenues under these leases on a straight-line basis over the applicable lease term when collectability of substantially all rents is probable.  Recognizing rental income on a straight-line basis generally results in recognized revenues during the first half of a lease term exceeding the cash amounts contractually due from our tenants, creating a straight-line rent receivable that is included in other assets on our Consolidated Balance Sheets. At December 31, 2024 and 2023, this cumulative excess totaled $\n202.7\n million and $\n194.1\n million, respectively (excluding properties classified as held for sale).\nCertain of our leases provide for periodic increases in base rent only if certain revenue parameters or other substantive contingencies are met. We recognize the increased rental revenue under these leases as the related parameters or contingencies are met, rather than on a straight-line basis over the applicable lease term. \nWe assess the probability of collecting substantially all rents under our leases based on several factors, including, among other things, payment history, the financial strength of the tenant and any guarantors, the historical operations and operating trends of the property, the historical payment pattern of the tenant, the type of property, the value of the underlying collateral, if any, expected future performance of the property and current economic conditions. If our evaluation of these factors indicates it is not probable that we will be able to collect substantially all rents under the lease, we record a charge to rental income. If we change our conclusions regarding the probability of collecting rent payments required by a lease, we may recognize adjustments to rental income in the period we make such change in our conclusions. \n90\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nWe are also entitled to receive reimbursements from our tenants for various property operating costs that we pay on their behalf. We have elected the practical expedient for lessors to account for the lease and nonlease components as a single component pursuant to ASC 842 when the lease component is predominant, the timing and pattern of transfer are the same, and the lease component, if separately accounted for, would be treated as an operating lease. Accordingly, the reimbursements from tenants are recognized as variable lease payments when earned and the corresponding property-level operating costs are expensed when incurred.\nSHOP\nOur resident agreements are accounted for as leases under ASC 842. Resident leases within our SHOP reportable business segment also contain service elements. We elected the practical expedient to account for our resident leases as a single lease component and recognize resident fees and services, other than move-in fees and certain rent incentives, monthly as services are provided. We recognize move-in fees and certain rent incentives on a straight-line basis over the average resident stay. \nOther \nWe provide various services to our unconsolidated real estate entities in exchange for fees and reimbursements, which are determined in accordance with the terms specific to each arrangement. We recognize these fees as we provide the services.\nWe may also earn promote revenue within the VIM platform related to the Ventas Fund, a perpetual life investment vehicle focused on investments in research centers, outpatient medical buildings and senior housing communities in North America. Within the Ventas Fund, promote revenue is generally based on the Ventas Fund’s cumulative returns over three-year performance periods. The promote revenue is based on operating performance and real estate valuation of the portfolio, including highly variable inputs such as capitalization rates, market rents, and interest rates. As the asset appreciation is an important driver of the promote and the key inputs in the valuation process can change, we generally recognize promote revenues at or near the end of the performance period. We include these revenues as a component of Third-party capital management revenues in our Consolidated Statements of Income.\nWe may also earn promote revenues within the VIM platform related to our other investment vehicles. Within these other investment vehicles, promote revenues are generally earned after our partners have received distributions sufficient to provide a specified rate of return on their invested capital.\nWe recognize interest income from loans and investments, including discounts and premiums, using the effective interest method when collectability is reasonably assured. We apply the effective interest method on a loan-by-loan basis and recognize discounts and premiums as yield adjustments over the related loan term. We recognize interest income on loans with an allowance on a cash basis.\n     \nAccounting for Leased Property\nWe lease real property, primarily land and corporate office space, and equipment, primarily vehicles at our senior housing communities. At lease inception, we establish an operating lease asset and operating lease liability, calculated as the present value of future minimum lease payments on our Consolidated Balance Sheets. As our leases do not provide an implicit rate, we use a discount rate that approximates our incremental borrowing rate available at lease commencement to determine the present value. Our lease expense primarily consists of ground and corporate office leases. Ground lease expense is included in Interest expense and corporate office lease expense is included in General, administrative and professional fees in our Consolidated Statements of Income.\nAccounting for Foreclosed Properties\nThe Company may receive properties pursuant to a foreclosure, deed in lieu of foreclosure or other legal action in full or partial settlement of loans receivable by taking legal title or physical possession of the properties. We refer to such actions as a “foreclosure” and to such properties as “foreclosed properties.” We account for foreclosed properties received in settlement of loans receivable in accordance with ASC 310, \nReceivables\n. Foreclosed real estate received in full or partial satisfaction of a loan and any debt assumed upon foreclosure is recorded at fair value at the time of foreclosure. If the amortized cost basis in the loan exceeds the fair value of the collateral received, the difference is recorded as an allowance on loans receivable and investments in the Consolidated Statements of Income. Conversely, if the fair value of the collateral received is higher than the amortized cost basis in the loan, the difference, less the fair value of any debt assumed, less the principal amount of the loan \n91\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nreceivable (after the reversal of previously recorded allowances), and net of working capital assumed and transaction costs, is recorded as a Gain on foreclosure of real estate in the Consolidated Statements of Income.\nExchangeable Senior Notes\nWe account for our exchangeable senior notes in accordance with ASC 470-20, \nDebt - Debt with Conversion and Other Options (after the adoption of Accounting Standards Update (\n“\nASU\n”\n) 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging - Contracts in Entity’s Own Equity (Subtopic 815-40): Accounting for Convertible Instruments and Contracts in an Entity’s Own Equity (\n“\nASU 2020-06\n”\n)). \nWe evaluate the exchange features embedded in our exchangeable senior notes in accordance with ASC 815, \nDerivatives and Hedging\n. ASC 815 requires embedded derivatives to be separated from their host non-derivative contracts and accounted for as free-standing derivative financial instruments if, and only if, each of the following three criteria is met: (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable GAAP with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument. Certain contracts that involve an entity’s own equity are explicitly exempted from the requirements of ASC 815.\nStock-Based Compensation\nWe recognize share-based payments to employees and directors, including grants of restricted stock and restricted stock units (including time-based and performance-based awards), included in General, administrative and professional fees in our Consolidated Statements of Income generally on a straight-line basis over the requisite service period based on the grant date fair value of the award. Forfeitures of share-based awards are recognized as they occur.\nTransaction, Transition and Restructuring Costs\nTransaction, transition and restructuring costs include expenses relating to mergers, acquisitions and investments; expenses relating to strategic transactions, such as spin-offs, joint ventures, partnerships, significant lease and management agreement transactions and similar arrangements; transition and integration expenses incurred by properties that have undergone operator or business model transitions; and expenses relating to organizational and other restructuring activities.\nOther Expense\nOther expense includes the changes in fair value of stock warrants, net expenses or recoveries related to significant disruptive events and other expenses or income.\nGain on Real Estate Dispositions\nWe recognize a gain on real estate disposition when we transfer control of a property and when it is probable that we will collect substantially all of the related consideration.\nFederal Income Tax\nWe have elected to be treated as a REIT under the applicable provisions of the Internal Revenue Code of 1986, as amended (the “Code”), for every year beginning with the year ended December 31, 1999. Accordingly, we generally are not subject to federal income tax on net income that we distribute to our stockholders, provided that we continue to qualify as a REIT. However, with respect to certain of our subsidiaries that have elected to be treated as taxable REIT subsidiaries (“TRS” or “TRS entities”), we record income tax expense or benefit, as those entities are subject to federal income tax similar to regular corporations. Certain foreign subsidiaries are subject to foreign income tax, although they did not elect to be treated as TRSs. \nWe account for deferred income taxes using the asset and liability method and recognize deferred tax assets and liabilities for the expected future tax consequences of events that have been included in our financial statements or tax returns. Under this method, we determine deferred tax assets and liabilities based on the differences between the financial reporting and tax bases of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. Any increase or decrease in the deferred tax liability that results from a change in circumstances, and that causes us to change our judgment about expected future tax consequences of events, is included in the tax provision when such changes occur. Deferred income taxes also reflect the impact of operating loss and tax credit carryforwards. A valuation allowance is provided \n92\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nif we believe it is more likely than not that all or some portion of the deferred tax asset will not be realized. Any increase or decrease in the valuation allowance that results from a change in circumstances, and that causes us to change our judgment about the realizability of the related deferred tax asset, is included in the tax provision when such changes occur.\nWe recognize the tax benefit from an uncertain tax position claimed or expected to be claimed on a tax return only if it is more likely than not that the tax position will be sustained on examination by taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement. We recognize interest and penalties, if applicable, related to uncertain tax positions as part of Income tax benefit in our Consolidated Statements of Income.\n \nForeign Currency\nCertain of our subsidiaries’ functional currencies are the local currencies of their respective foreign jurisdictions. We translate the results of operations of our foreign subsidiaries into U.S. dollars using average rates of exchange in effect during the period, and we translate balance sheet accounts using exchange rates in effect at the end of the period. We record the resulting currency translation adjustments in Accumulated other comprehensive income, a component of stockholders’ equity, on our Consolidated Balance Sheets, and we record foreign currency transaction gains and losses in Other expense (income) in our Consolidated Statements of Income. We recognize any noncontrolling interests’ proportionate share of currency translation adjustments of our foreign consolidated joint ventures in Noncontrolling interests on our Consolidated Balance Sheets.\nSegment Reporting\nAs of December 31, 2024, we operated through \nthree\n reportable business segments: SHOP, OM&R and NNN. In our SHOP segment, we own and invest in senior housing communities throughout the United States and Canada and engage operators to operate those communities. In our OM&R segment, we primarily acquire, own, develop, lease and manage outpatient medical buildings and research centers throughout the United States. In our NNN segment, we invest in and own senior housing communities, skilled nursing facilities (“SNFs”), long-term acute care facilities (“LTACs”), freestanding inpatient rehabilitation facilities (“IRFs”) and other healthcare facilities, throughout the United States and the United Kingdom and lease these properties to tenants under triple-net or absolute-net leases that obligate the tenants to pay all property-related expenses, including maintenance, utilities, repairs, taxes, insurance and capital expenditures. See “Note 18 – Segment Information.”\n \nGovernment Assistance\nWe applied for and received grants under Phase 2, Phase 3 and Phase 4 of the Provider Relief Fund administered by the U.S. Department of Health & Human Services (“HHS”) on behalf of the assisted living communities in our senior living operations segment to partially mitigate losses attributable to COVID-19. These grants are intended to reimburse eligible providers for expenses incurred to prevent, prepare for and respond to COVID-19 and lost revenues attributable to COVID-19. We will not be required to repay distributions from the Provider Relief Fund, provided that we attest to and comply with certain terms and conditions, including, not using grants received from the Provider Relief Fund to reimburse expenses or losses that other sources are obligated to reimburse, reporting and record keeping requirements and cooperating with any government audits. See “Government Regulation—CARES Act and Similar Governmental Funding Programs” in Part I, Item 1 of this Annual Report.\nWe, and our managers, tenants, borrowers and investments in unconsolidated entities also received grants under other government programs on behalf of our senior housing communities primarily to partially mitigate losses attributable to COVID-19.\nDuring 2024 and 2023, we did \nnot\n receive any HHS grants. During 2022, we received $\n54.2\n million in HHS grants. These grants are recognized as a contra expense within Property-level operating expenses in our Consolidated Statements of Income in the period in which they were received. Any grants that are ultimately received and retained by us are not expected to fully offset the losses incurred in our SHOP segment that are attributable to COVID-19. Further, although we continue to monitor and evaluate the terms and conditions associated with these government grants, we cannot assure you that we will be in compliance with all requirements related to the payments received, in which case some or all of the grants received may need to be repaid.\n93\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nRecent Accounting Standards\nIn December 2023, the FASB issued Accounting Standards Update 2023-09, \nImprovements to Income Tax Disclosures\n (“ASU 2023-09”), which requires public entities on an annual basis to (1) disclose specific categories in the rate reconciliation and (2) provide additional information for reconciling items that meet a quantitative threshold (if the effect of those reconciling items is equal to or greater than 5 percent of the amount computed by multiplying pretax income or loss by the applicable statutory income tax rate). ASU 2023-09 is effective for fiscal years beginning after December 15, 2024. We are evaluating the impact of adopting ASU 2023-09 on our Consolidated Financial Statements.\nIn March 2024, the SEC adopted the final rule under SEC Release No. 33-11275, \nThe Enhancement and Standardization of Climate Related Disclosures for Investors\n, which requires registrants to disclose climate-related information in registration statements and annual reports. The new rules would be effective for annual reporting periods beginning in fiscal year 2025. However, in April 2024, the SEC exercised its discretion to stay these rules pending the completion of judicial review of certain consolidated petitions with the United States Court of Appeals for the Eighth Circuit in connection with these rules. We are evaluating the impact of this rule on our Consolidated Financial Statements.\nOn November 4, 2024, the FASB issued ASU 2024-03, \nDisaggregation of Income Statement Expenses\n (DISE), which requires disaggregated disclosure of income statement expenses for public business entities (PBEs). ASU 2024-03 requires a footnote disclosure about specific expenses by requiring PBEs to disaggregate, in a tabular presentation, each relevant expense caption on the face of the income statement that includes certain natural expenses relevant to the Company, such as (1) employee compensation, (2) depreciation and (3) intangible asset amortization. The tabular disclosure would also include certain other expenses, when applicable. The ASU does not change the expense captions an entity presents on the face of the income statement; rather, it requires disaggregation of certain expense captions into specified categories in disclosures within the footnotes to the financial statements. ASU 2024-03 is effective for annual reporting periods beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027. The requirements will be applied prospectively with the option for retrospective application. We are evaluating the impact of adopting ASU 2024-03 on our Consolidated Financial Statements.\nReclassifications\nTo conform to the current year presentation, expenses related to shareholder relations matters for the comparative periods have been reclassified from Transaction, transition and restructuring costs and presented separately in our Consolidated Statements of Income.\nNOTE 3 – CONCENTRATION OF CREDIT RISK \nWe use total revenues and total NOI in assessing our concentration of credit risk. See “Non-GAAP Financial Measures” included elsewhere in this Annual Report for additional disclosure and a reconciliation of net income attributable to common stockholders, as computed in accordance with GAAP, to total NOI.\nWe are exposed to the credit risk of our tenants in our NNN and OM&R segments because those tenants are obligated to pay us rent and, in certain instances pay or reimburse us for some or all property-related expenses, including utilities, real estate taxes, insurance, repairs and maintenance, cleaning, roads and grounds expense and other  expenses.. Because we engage independent managers to manage the properties in our SHOP segment in exchange for a management fee, we are not directly exposed to their credit risk in the same manner or to the same extent as the tenants in our NNN and OM&R segments.\nOur consolidated properties were located in \n48\n states, the District of Columbia, \nseven\n Canadian provinces and the United Kingdom as of December 31, 2024, with properties in \none\n state (California) accounting for more than \n10\n% of our total revenues and NOI for each of the years ended December 31, 2024, 2023 and 2022.\n94\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table summarizes certain information about our credit risk concentration for our NNN and OM&R segments for the years presented:\n \nFor the Years Ended December 31,\n \n2024\n2023\n2022\nContribution as a Percentage of Total Revenues \n(1)\n:\n \n \nBrookdale Senior Living (“Brookdale”) \n(2) (3)\n3.1\n \n%\n3.3\n \n%\n3.6\n \n%\nArdent Health Partners, LLC (together with its subsidiaries, “Ardent”) \n(4)\n2.8\n \n3.0\n \n3.2\n \nKindred Healthcare, LLC (together with its subsidiaries, “Kindred”)\n2.8\n \n2.9\n \n3.2\n \nAll others\n22.8\n \n25.0\n \n25.7\n \nContribution as a Percentage of Total NOI:\nBrookdale \n(2) (3)\n7.2\n \n%\n7.7\n \n%\n8.1\n \n%\nKindred\n6.7\n \n6.9\n \n7.3\n \nArdent \n(4)\n6.6\n \n6.9\n \n7.1\n \nAll others\n37.6\n \n41.5\n \n42.4\n \n______________________________\n(1)\nRepresents percentage of total revenues which include third-party capital management revenues, income from loans and investments and interest and other income.\n(2)\nThe 2024, 2023 and 2022 results include $\n42.0\n million, $\n42.6\n million and $\n42.6\n million, respectively, of amortization of up-front consideration received in 2020 from a revised master lease agreement with Brookdale.\n(3)\nResults exclude \nnine\n senior housing communities which are included in our SHOP segment.\n(4)\nResults exclude \n19\n outpatient medical buildings included in “All others.”\n    \nEach of our Brookdale, Ardent and Kindred leases is guaranteed by a corporate parent. \nLease Income\nRental income from our NNN and OM&R operating leases consists of fixed and variable lease payments. \nThe variable payments primarily represent reimbursements of various property-level operating expenses that we pay on behalf of our tenants. The following table summarizes rental income from our NNN and OM&R operating leases (in thousands):\nFor the Years Ended December 31,\n2024\n2023\n2022\nFixed income from operating leases\n$\n1,251,042\n \n$\n1,241,075\n \n$\n1,192,607\n \nVariable income from operating leases\n245,898\n \n245,326\n \n206,706\n \n95\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFuture Contractual Rents\n    \nThe following table sets forth the minimum lease payments under the existing lease for all of our consolidated triple-net and outpatient medical and research building leases as of December 31, 2024 (excluding properties classified as held for sale as of December 31, 2024, dollars in thousands):\nBrookdale Senior Living \n(1)\nArdent\nKindred\nOther\nTotal\n2025\n$\n158,858\n \n$\n152,913\n \n$\n137,178\n \n$\n739,668\n \n$\n1,188,617\n \n2026\n72,350\n \n152,354\n \n133,747\n \n684,967\n \n1,043,418\n \n2027\n72,350\n \n151,237\n \n133,747\n \n584,104\n \n941,438\n \n2028\n72,350\n \n151,237\n \n116,007\n \n483,548\n \n823,142\n \n2029\n72,350\n \n151,237\n \n107,137\n \n381,595\n \n712,319\n \nThereafter\n434,102\n \n839,613\n \n116,863\n \n1,296,791\n \n2,687,369\n \nTotal\n$\n882,360\n \n$\n1,598,591\n \n$\n744,679\n \n$\n4,170,673\n \n$\n7,396,303\n \n______________________________\n(1)\n2025 minimum lease payments include all assets covered by the Brookdale lease as of December 31, 2024, of which $\n86.5\n million is associated with \n56\n senior housing properties for which the lease will expire on December 31, 2025.\nNOTE 4 – ACQUISITIONS OF REAL ESTATE PROPERTY \nWe acquire and invest in senior housing, outpatient medical buildings, research centers and other healthcare properties primarily to achieve an expected yield on our investment, to grow and diversify our portfolio and revenue base, and to reduce our dependence on any single manager or tenant, geographic location, asset type, business model or revenue source. Each of our acquisitions disclosed below was accounted for as an asset acquisition.\n2025 Acquisitions\nIn January 2025, we acquired \ntwo\n senior housing communities reported within our SHOP segment for an aggregate purchase price of $\n70.0\n million.\n2024 Acquisitions\nDuring the year ended December 31, 2024, we acquired \n50\n senior housing communities reported within our SHOP segment and \nfive\n long-term acute care facilities (“LTACs”) reported within our NNN segment for an aggregate purchase price of $\n1.9\n billion.\n2022 Acquisitions\nDuring the year ended December 31, 2022, for an aggregate purchase price of $\n453.2\n million, we acquired \n18\n outpatient medical buildings leased to affiliates of Ardent, \none\n behavioral health center, \none\n research center (all of which are reported within our OM&R segment) and \ntwo\n senior housing communities (which are reported within our SHOP segment).\nNOTE 5 – DISPOSITIONS, ASSETS HELD FOR SALE AND IMPAIRMENTS \n2024 Activity\nDuring the year ended December 31, 2024, we sold \n19\n senior housing communities in our SHOP segment, \n12\n outpatient medical buildings (\none\n of which was vacant) in our OM&R segment and \n24\n properties in our NNN segment for aggregate consideration of $\n315.1\n million and recognized $\n57.0\n million in Gain on real estate dispositions in our Consolidated Statements of Income.\n96\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n2023 Activity\nDuring the year ended December 31, 2023, we sold \nseven\n communities in our SHOP segment, \n10\n properties in our OM&R segment, \nnine\n properties in our NNN segment and \ntwo\n land parcels for aggregate consideration of $\n399.5\n million and recognized a gain on the sale of these assets of $\n62.1\n million in our Consolidated Statements of Income.\n2022 Activity\nDuring the year ended December 31, 2022, we sold \nseven\n communities in our SHOP segment, \ntwo\n properties in our OM&R segment, \nthree\n properties in our NNN segment, \ntwo\n vacant properties for aggregate consideration of $\n115.1\n million and recognized a net gain on the sale of these assets of $\n7.8\n million in our Consolidated Statements of Income.\nAssets Held for Sale\nThe table below summarizes our real estate assets classified as held for sale including the amounts reported on our Consolidated Balance Sheets (dollars in thousands):\nAs of December 31, 2024\nAs of December 31, 2023\nSegment Properties Held for Sale\nAssets Held for Sale\nLiabilities Related to Assets \nHeld for Sale \nSegment Properties Held for Sale\nAssets Held for Sale\nLiabilities Related to Assets \nHeld for Sale\nSHOP\n2\n \n$\n18,612\n \n$\n2,158\n \n13\n \n$\n48,173\n \n$\n6,419\n \nOM&R \n(1)\n—\n \n13\n \n568\n \n3\n \n5,431\n \n2,643\n \nNNN\n—\n \n—\n \n—\n \n1\n \n2,885\n \n181\n \nTotal\n2\n \n$\n18,625\n \n$\n2,726\n \n17\n \n$\n56,489\n \n$\n9,243\n \n______________________________\n(1)\nThe balances as of December 31, 2024 relate to a partial sale of a building, as such, the property count did not change.\nReal Estate Impairments\nFor the year ended December 31, 2024, we recognized impairments of $\n86.0\n million comprising of $\n43.8\n million, $\n1.5\n million and $\n40.7\n million impairments in our SHOP, OM&R and NNN segments, respectively. For the year ended December 31, 2023, we recognized impairments of $\n226.6\n million comprising of $\n190.5\n million, $\n19.2\n million and $\n16.9\n million impairments in our SHOP, OM&R and NNN segments, respectively. For the year ended December 31, 2022, we recognized impairments of $\n107.8\n million comprising of $\n76.4\n million, $\n27.5\n million and $\n3.9\n million impairments in our SHOP, OM&R and NNN segments, respectively. The impairments are recorded primarily as a component of Depreciation and amortization in our Consolidated Statements of Income. The impairments recorded were primarily a result of a change in our intent to hold or a change in the future cash flows of the impaired assets.\n97\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 6 – LOANS RECEIVABLE AND INVESTMENTS \nAs of December 31, 2024 and 2023, we held $\n173.0\n million and $\n54.1\n million, respectively, of loans receivable and investments, net of allowance, relating to senior housing and healthcare operators or properties. \nThe following is a summary of our loans receivable and investments, net, including amortized cost, fair value and unrealized gains or losses on available for sale investments, if applicable (dollars in thousands):\nAmortized Cost\nAllowance\nCarrying Amount\nFair Value\nAs of December 31, 2024:\nSecured/mortgage loans and other, net \n(1)\n$\n144,872\n \n$\n—\n \n$\n144,872\n \n$\n146,229\n \nNon-mortgage loans receivable, net \n(2)\n31,939\n \n(\n3,810\n)\n28,129\n \n27,640\n \nTotal loans receivable and investments, net\n$\n176,811\n \n$\n(\n3,810\n)\n$\n173,001\n \n$\n173,869\n \nAs of December 31, 2023:\nSecured/mortgage loans and other, net \n(1)\n$\n27,986\n \n$\n—\n \n$\n27,986\n \n$\n27,947\n \nNon-mortgage loans receivable, net \n(2)\n30,128\n \n(\n3,976\n)\n26,152\n \n25,200\n \nTotal loans receivable and investments, net\n$\n58,114\n \n$\n(\n3,976\n)\n$\n54,138\n \n$\n53,147\n \n______________________________\n(1)\nInvestments have contractual maturities ranging from 2025 to 2027.\n(2)\nIncluded in Other assets on our Consolidated Balance Sheets.\n2024 Activity\nIn September 2024, we provided new secured debt financing of $\n109.0\n million to the owner of a senior housing property, secured by the asset and with additional credit support. The loan provides us with a right of first offer to purchase the asset on certain terms and conditions. The loan has a \n3-year\n term and bears interest at a variable rate based on one-month SOFR, subject to a floor of \n4.50\n%, plus a spread of \n5.75\n%, increasing to \n6.00\n% commencing October 1, 2025.\n2023 Activity\nOn May 1, 2023, we took ownership of the properties that secured the Company’s cash-pay non-recourse mezzanine loan to Santerre Health Investors (the “Santerre Mezzanine Loan”) by converting the outstanding principal amount of the Santerre Mezzanine Loan to equity, with no additional consideration being paid. As a result, the Santerre Mezzanine Loan is no longer outstanding. The properties consisted of a diverse pool of outpatient medical buildings, senior housing communities, triple-net leased skilled nursing facilities and hospital assets in the United States, which, at the time, also secured a $\n1\n billion non-recourse senior mortgage loan issued under the CHC Commercial Mortgage Trust 2019-CHC (the “CHC Mortgage Loan”). For additional information regarding the CHC Mortgage Loan, see “Note 10 – Senior Notes Payable and Other Debt.”\nUpon taking ownership of the portfolio, we reversed the previously recorded (in 2022) $\n20.0\n million CECL allowance and recognized a Gain on foreclosure of real estate of $\n29.1\n million in our Consolidated Statements of Income. The gain is the fair value of the properties that secured the Santerre Mezzanine Loan, less the fair value of the CHC Mortgage Loan, less the principal amount of the Santerre Mezzanine Loan on May 1, 2023 (after the reversal of previously recorded allowances), and net of non-real estate assets and liabilities and transaction costs. For additional information, see “Note 11 – Fair Values of Financial Instruments.”\n98\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 7 – INVESTMENTS IN UNCONSOLIDATED ENTITIES\nWe report investments in unconsolidated entities over whose operating and financial policies we have the ability to exercise significant influence under the equity method of accounting. Our investments in unconsolidated entities include investments in both real estate entities and operating entities as described further below.\nInvestments in Unconsolidated Real Estate Entities\nBelow is a summary of our investments in unconsolidated real estate entities, including through VIM, as of December 31, 2024 and 2023, respectively (dollars in thousands):\nOwnership \n(1)\nas of December 31,\nCarrying Amount\nas of December 31,\n2024\n2023\n2024\n2023\nInvestments in unconsolidated real estate entities:\nVentas Life Science & Healthcare Real Estate Fund\n20.0\n%\n20.1\n%\n$\n267,202\n \n$\n264,442\n \nPension Fund Joint Venture\n25.0\n%\n25.0\n%\n11,939\n \n22,169\n \nResearch & Innovation Development Joint Venture\n53.0\n%\n53.0\n%\n309,499\n \n275,829\n \nVentas Investment Management platform\n588,640\n \n562,440\n \nAtrium Health & Wake Forest Joint Venture\n48.5\n%\n48.5\n%\n36,881\n \n35,137\n \nAll other \n(2)\n34.0\n%-\n37.5\n%\n34.0\n%-\n37.5\n%\n601\n \n629\n \nTotal investments in unconsolidated real estate entities\n$\n626,122\n \n$\n598,206\n \n______________________________\n(1)    \nThe entities in which we have an ownership interest may have less than a \n100\n% interest in the underlying real estate. The ownership percentages in the table reflect our interest in the entities. Joint venture members, including us in some instances, have equity participation rights based on the underlying performance of the investments, which could result in non pro rata distributions.\n(2)\n     Includes investments in parking structures and other de minimis investments in unconsolidated real estate entities.\nWe provide various services to our unconsolidated real estate entities in exchange for fees and reimbursements. Total management fees earned in connection with these services were $\n15.5\n million, $\n14.7\n million and $\n14.5\n million for the years ended December 31, 2024, 2023 and 2022, respectively. Such amounts, along with any promote revenue, are included in Third-party capital management revenues in our Consolidated Statements of Income.\nInvestments in Unconsolidated Operating Entities\nWe own investments in unconsolidated operating entities such as Ardent and Atria, which are included within Other assets on our Consolidated Balance Sheets. \nAs of December 31, 2024, we held a \n34\n% ownership interest in Atria, which entitles us to customary minority rights and protections, including the right to appoint \ntwo\n members to the Atria Board of Directors. \nAs of December 31, 2024, we held an approximately \n6.7\n% ownership interest in Ardent. \nOne\n of our executive officers is currently a member of the Ardent Board of Directors. Going forward, we have the right (but not the obligation) to nominate \none\n member of the Ardent Board of Directors for so long as we beneficially own \n4\n% or more of the total voting power of the outstanding common stock of Ardent, pursuant to our nomination agreement with Ardent. Following Ardent’s initial public offering, which was consummated in July 2024, our equity stake in Ardent decreased from the issuance of primary shares from \n7.5\n% to approximately \n6.7\n%, which resulted in a gain of $\n8.7\n million for the year ended December 31, 2024, which is included in Income from unconsolidated entities in our Consolidated Statements of Income.\nIn May 2023, we sold approximately \n24\n% of our ownership interest in Ardent to a third-party investor for $\n50.1\n million in total proceeds. As a result of the sale, we recognized $\n33.5\n million of gain for the year ended December 31, 2023 in Income from unconsolidated entities in our Consolidated Statements of Income and our ownership interest in Ardent was reduced from \n9.8\n% to \n7.5\n%.\n99\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nPursuant to Rule 3-09 and Rule 4-08(g) of Regulation S-X under the Securities Act, we are required to present summarized financial information of the combined accounts of our unconsolidated entities accounted for by the equity method. \nThe following table summarizes the combined unaudited financial information of our equity method investments, based on the most recent financial information available to us as of the respective reporting dates and periods (dollars in thousands):\nAs of December 31,\n2024\n2023\nTotal assets\n$\n9,813,724\n \n$\n9,423,867\n \nTotal liabilities\n6,168,639\n \n6,133,776\n \nTotal noncontrolling interests\n582,678\n \n574,575\n \nTotal equity, net of noncontrolling interests\n3,062,405\n \n2,715,516\n \nFor the Years Ended December 31,\n2024\n2023\n2022\nTotal revenues\n$\n7,121,808\n \n$\n6,526,010\n \n$\n6,193,393\n \nTotal pre-tax income\n313,313\n \n43,100\n \n335,793\n \nNet income (loss) attributable to common stockholders\n196,984\n \n(\n44,313\n)\n212,112\n \nNOTE 8 – INTANGIBLES \nThe following is a summary of our intangibles (dollars in thousands):\n \nAs of December 31, 2024\nAs of December 31, 2023\n \nBalance\nWeighted Average\nRemaining Amortization\nPeriod in Years\nBalance\nWeighted Average\nRemaining Amortization\nPeriod in Years\nIntangible assets:\n \n \n \n \nAbove-market lease intangibles \n(1)\n$\n124,515\n \n4.3\n$\n130,371\n \n4.8\nIn-place lease and other real estate intangibles \n(2)\n1,434,236\n \n8.4\n1,317,775\n \n8.3\nAcquired lease intangibles\n1,558,751\n \n1,448,146\n \nGoodwill\n1,044,915\n \nN/A\n1,045,176\n \nN/A\nOther intangibles \n(2)\n41,190\n \n24.4\n34,440\n \n4.8\nAccumulated amortization\n(\n1,286,374\n)\nN/A\n(\n1,189,817\n)\nN/A\nNet intangible assets\n$\n1,358,482\n \n8.8\n$\n1,337,945\n \n8.0\nIntangible liabilities:\n \n \n \nBelow-market lease intangibles \n(1)\n$\n269,572\n \n7.0\n$\n306,499\n \n8.1\nOther lease intangibles\n13,498\n \nN/A\n13,498\n \nN/A\nAccumulated amortization\n(\n211,441\n)\nN/A\n(\n241,600\n)\nN/A\nPurchase option intangibles\n3,568\n \nN/A\n3,568\n \nN/A\nNet intangible liabilities\n$\n75,197\n \n7.0\n$\n81,965\n \n8.1\n______________________________\n(1)\n     Amortization of above- and below-market lease intangibles is recorded as a decrease and an increase to revenues, respectively, in our Consolidated Statements of Income.\n(2)\n     Amortization of intangibles is recorded in Depreciation and amortization in our Consolidated Statements of Income.\nN/A—Not Applicable\n \nOther intangibles (including non-compete agreements, trade names and trademarks) are included in Other assets on our Consolidated Balance Sheets. Net intangible liabilities are included in Accounts payable and other liabilities on our Consolidated Balance Sheets. For the years ended December 31, 2024, 2023 and 2022, our net amortization related to these intangibles was $\n80.8\n million, $\n111.2\n million and $\n102.4\n million, respectively. \n100\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following is a summary of the estimated net amortization related to these intangibles for each of the next five years (dollars in thousands):\nEstimated Net Amortization\n2025\n$\n104,042\n \n2026\n41,445\n \n2027\n14,830\n \n2028\n12,723\n \n2029\n8,730\n \nThe table below reflects the carrying amount of goodwill, by segment, as of December 31, 2024 (dollars in thousands):\n \nGoodwill\nOM&R\n$\n466,967\n \nNNN\n318,412\n \nSHOP\n259,536\n \nTotal goodwill\n$\n1,044,915\n \n    \nThere were no significant changes in the allocation of goodwill or any impairments during the years ended December 31, 2024, 2023 and 2022.\nNOTE 9 – OTHER ASSETS \nThe following is a summary of our other assets (dollars in thousands):\nAs of December 31,\n2024\n2023\nStraight-line rent receivables\n$\n202,675\n \n$\n194,108\n \nDeferred lease costs, net\n145,973\n \n118,556\n \nAccounts receivable, net \n(1)\n108,138\n \n76,091\n \nInvestment in unconsolidated operating entities\n95,623\n \n80,312\n \nStock warrants\n40,192\n \n59,281\n \nNon-mortgage loans receivable, net\n28,129\n \n26,152\n \nOther intangibles, net\n11,513\n \n5,584\n \nOther\n160,420\n \n123,326\n \nTotal other assets\n$\n792,663\n \n$\n683,410\n \n______________________________\n(1)\n     Allowance for doubtful accounts as of December 31, 2024 and 2023 were $\n70.3\n million and $\n75.5\n million, respectively.\nIn the above table, stock warrants as of December 31, 2024 represent: (1) warrants exercisable at any time prior to December 31, 2025, in whole or in part, for \n11.1\n million shares of Brookdale Senior Living, Inc common stock (“Brookdale Common Stock”) at an exercise price of $\n3.00\n per share (the “Brookdale Warrants”), and (2) warrants exercisable at any time prior to September 13, 2034 for \n9.9\n% of the common equity of a parent company of Kindred Healthcare, LLC (“Kindred”) exercisable at the pre-transaction value of such common equity (the “Scion Warrants”). We received the Scion Warrants in September 2024 as part of the consideration for a lease amendment that we entered into with Kindred and its parent companies, ScionHealth.\nDuring the year ended December 31, 2024, we exercised Brookdale Warrants for \n5.2\n million shares of Brookdale Common Stock on a cashless basis, resulting in our receipt of \n2.9\n million shares of Brookdale Common Stock (net of the $\n3.00\n exercise price), which we sold for net cash proceeds of approximately $\n18.0\n million (recorded within operating cash flows in our Consolidated Statements of Cash Flows). \n101\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe Brookdale Warrants and the Scion Warrants are measured at fair value with changes in fair value being recognized within Other expense (income) in our Consolidated Statements of Income.\nNOTE 10 – SENIOR NOTES PAYABLE AND OTHER DEBT \nThe following is a summary of our senior notes payable and other debt (dollars in thousands):\nAs of December 31,\n2024\n2023\nUnsecured revolving credit facility \n(1)(2)\n$\n6,397\n \n$\n14,006\n \nCommercial paper notes\n—\n \n—\n \n3.50\n% Senior Notes due 2024\n—\n \n400,000\n \n3.75\n% Senior Notes due 2024\n—\n \n400,000\n \n4.125\n% Senior Notes, Series B due 2024 \n(2)\n—\n \n123,256\n \n2.80\n% Senior Notes, Series E due 2024 \n(2)\n—\n \n55,143\n \nUnsecured term loan due 2025 \n(2)\n—\n \n377,501\n \n2.65\n% Senior Notes due 2025\n450,000\n \n450,000\n \n3.50\n% Senior Notes due 2025\n600,000\n \n600,000\n \n4.125\n% Senior Notes due 2026\n500,000\n \n500,000\n \n3.75\n% Exchangeable Senior Notes due 2026\n862,500\n \n862,500\n \n3.25\n% Senior Notes due 2026\n450,000\n \n450,000\n \nUnsecured term loan due February 2027\n200,000\n \n200,000\n \nUnsecured term loan due June 2027\n500,000\n \n500,000\n \n2.45\n% Senior Notes, Series G due 2027 \n(2)\n330,320\n \n358,626\n \n3.85\n% Senior Notes due 2027\n400,000\n \n400,000\n \n4.00\n% Senior Notes due 2028\n650,000\n \n650,000\n \n5.398\n% Senior Notes, Series I due 2028 \n(2)\n417,246\n \n453,001\n \n4.40\n% Senior Notes due 2029\n750,000\n \n750,000\n \n5.10\n% Senior Notes, Series J due 2029\n (2)\n452,017\n \n—\n \n3.00\n% Senior Notes due 2030\n650,000\n \n650,000\n \n4.75\n% Senior Notes due 2030\n500,000\n \n500,000\n \n2.50\n% Senior Notes due 2031\n500,000\n \n500,000\n \n3.30\n% Senior Notes, Series H due 2031 \n(2)\n208,623\n \n226,501\n \n5.625\n% Senior Notes due 2034\n500,000\n \n—\n \n5.00\n% Senior Notes due 2035\n550,000\n \n—\n \n6.90\n% Senior Notes due 2037 \n(3)\n52,400\n \n52,400\n \n6.59\n% Senior Notes due 2038 \n(3)\n21,413\n \n21,413\n \n5.70\n% Senior Notes due 2043\n300,000\n \n300,000\n \n4.375\n% Senior Notes due 2045\n300,000\n \n300,000\n \n4.875\n% Senior Notes due 2049\n300,000\n \n300,000\n \nMortgage loans and other\n3,167,886\n \n3,174,251\n \nTotal\n13,618,802\n \n13,568,598\n \nDeferred financing costs, net\n(\n92,365\n)\n(\n84,034\n)\nUnamortized fair value adjustment\n11,587\n \n17,081\n \nUnamortized discounts\n(\n15,473\n)\n(\n10,749\n)\nSenior notes payable and other debt\n$\n13,522,551\n \n$\n13,490,896\n \n______________________________\n(1)\nAs of December 31, 2024 and 2023, aggregate Canadian Dollar borrowings of C$\n2.0\n million ($\n1.4\n million) and \nzero\n were outstanding, respectively. As of December 31, 2024 and 2023, aggregate British Pound borrowings of £\n4.0\n million ($\n5.0\n million) and £\n11.0\n million ($\n14.0\n million) were outstanding, respectively.\n(2)\nBritish Pound and Canadian Dollar debt obligations shown in US Dollars.\n102\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(3)\nOur \n6.90\n% Senior Notes due 2037 are subject to repurchase at the option of the holders, at par, on October 1, 2027, and our \n6.59\n% Senior Notes due 2038 are subject to repurchase at the option of the holders, at par, on July 7, 2028.\n \nCredit Facilities, Commercial Paper, Unsecured Term Loans and Letters of Credit\nAs of December 31, 2024, we have a $\n2.75\n billion unsecured revolving credit facility priced at SOFR plus \n0.10\n% (“Adjusted SOFR”) plus \n0.775\n% which is subject to adjustment based on the Company’s debt ratings. Our unsecured revolving credit facility matures in April 2028, and may be extended at our option, subject to the satisfaction of certain conditions, for \ntwo\n additional periods of \nsix months\n each. The revolving credit facility also includes an accordion feature that permits us to increase our aggregate borrowing capacity thereunder to up to $\n3.75\n billion, subject to the satisfaction of certain conditions, including the receipt of additional commitments for such increase.\nOur unsecured revolving credit facility imposes certain customary restrictions on us, including restrictions pertaining to: (i) liens; (ii) investments; (iii) the incurrence of additional indebtedness; (iv) mergers and dissolutions; (v) certain dividend, distribution and other payments; (vi) permitted businesses; (vii) transactions with affiliates; and (viii) the maintenance of certain consolidated total leverage, secured debt leverage, unsecured debt leverage and fixed charge coverage ratios and minimum consolidated adjusted net worth, and contains customary events of default. \nAs of December 31, 2024, we had $\n2.74\n billion of undrawn capacity under our unsecured revolving credit facility with $\n6.4\n million outstanding and an additional $\n0.8\n million restricted to support outstanding letters of credit. We use our unsecured revolving credit facility to support our commercial paper program and for general corporate purposes. \nOur wholly-owned subsidiary, Ventas Realty, Limited Partnership (“Ventas Realty”), may issue from time to time unsecured commercial paper notes up to a maximum aggregate amount outstanding at any time of $\n1.0\n billion. The notes are sold under customary terms in the U.S. commercial paper note market and are ranked pari passu with all of Ventas Realty’s other unsecured senior indebtedness. The notes are fully and unconditionally guaranteed by Ventas, Inc. As of December 31, 2024, we had \nno\n borrowings outstanding under our commercial paper program. \nVentas Realty has a $\n500.0\n million unsecured term loan priced at Adjusted SOFR plus \n0.85\n%, which is subject to adjustment based on Ventas Realty’s debt ratings. This term loan is fully and unconditionally guaranteed by Ventas, Inc. It matures in June 2027 and includes an accordion feature that permits Ventas Realty to increase the aggregate borrowings thereunder to up to $\n1.25\n billion, subject to the satisfaction of certain conditions, including the receipt of additional commitments for such increase.\nVentas Realty has a $\n200.0\n million unsecured term loan priced at Adjusted SOFR plus \n0.85\n%, which is subject to adjustment based on Ventas Realty’s debt ratings. This term loan is fully and unconditionally guaranteed by Ventas, Inc. It matures in February 2027 and includes an accordion feature that permits Ventas Realty to increase the aggregate borrowings thereunder to up to $\n500.0\n million, subject to the satisfaction of certain conditions, including the receipt of additional commitments for such increase.\nDuring the year ended December 31, 2024, we repaid a C$\n500.0\n million ($\n369.4\n million) unsecured term loan facility priced at Canadian Dollar Offered Rate (“CDOR”) plus \n0.90\n% that would otherwise have matured in January 2025.\nAs of December 31, 2024, our $\n100.0\n million uncommitted line for standby letters of credit had an outstanding balance of $\n15.4\n million. The agreement governing the line contains certain customary covenants and, under its terms, we are required to pay a commission on each outstanding letter of credit at a fixed rate.\nExchangeable Senior Notes\nIn June 2023, Ventas Realty issued $\n862.5\n million aggregate principal amount of its \n3.75\n% Exchangeable Senior Notes due 2026 (the “Exchangeable Notes”) in a private placement. The Exchangeable Notes are senior, unsecured obligations of Ventas Realty and are fully and unconditionally guaranteed on an unsecured and unsubordinated basis by Ventas, Inc. The Exchangeable Notes bear interest at a rate of \n3.75\n% per year, payable semi-annually in arrears on June 1 and December 1 of each year, beginning on December 1, 2023. The Exchangeable Notes mature on June 1, 2026, unless earlier exchanged, redeemed or repurchased. As of both December 31, 2024 and 2023, we had $\n862.5\n million aggregate principal amount of the Exchangeable Notes outstanding with an effective interest rate of \n4.62\n% inclusive of the impact of the amortization of issuance costs. For the years ended December 31, 2024 and 2023, we recognized $\n32.3\n million and $\n17.8\n million of contractual interest expense, respectively, and amortization of issuance costs of $\n6.8\n million and $\n3.6\n million, respectively, related to the \n103\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nExchangeable Notes. Unamortized issuance costs of $\n10.3\n million and $\n17.1\n million as of December 31, 2024 and 2023 were recorded as an offset to Senior notes payable and other debt on our Consolidated Balance Sheets.\nThe Exchangeable Notes are exchangeable at an initial exchange rate of \n18.2460\n shares of our common stock per $1,000 principal amount of Exchangeable Notes (equivalent to an initial exchange price of approximately $\n54.81\n per share of common stock). The initial exchange rate is subject to adjustment, including in the event of the payment of a quarterly dividend in excess of $\n0.45\n per share, but will not be adjusted for any accrued and unpaid interest. Upon exchange of the Exchangeable Notes, Ventas Realty will pay cash up to the aggregate principal amount of the Exchangeable Notes to be exchanged and pay or deliver (or cause to be delivered), as the case may be, cash, shares of common stock or a combination of cash and shares of common stock, at Ventas Realty’s election, in respect of the remainder, if any, of its exchange obligation in excess of the aggregate principal amount of the Exchangeable Notes being exchanged. Prior to the close of business on the business day immediately preceding March 1, 2026, the Exchangeable Notes will be exchangeable at the option of the noteholders only upon the satisfaction of specified conditions and during certain periods described in the indenture governing the Exchangeable Notes. On or after March 1, 2026, until the close of business on the business day immediately preceding the maturity date, the Exchangeable Notes will be exchangeable at the option of the noteholders at any time regardless of these conditions or periods.\nWe have evaluated and concluded that the exchange options embedded in our exchangeable senior notes are eligible for the entity’s own equity scope exception from ASC 815 and therefore, do not need to be bifurcated. Accordingly, we record our exchangeable senior notes as liabilities (included in Senior notes payable and other debt on our Consolidated Balance Sheets).\nSenior Notes\nAs of December 31, 2024, we had outstanding $\n8.3\n billion aggregate principal amount of senior notes issued by Ventas Realty, approximately $\n73.8\n million aggregate principal amount of senior notes issued by Nationwide Health Properties, Inc. (“NHP”) and assumed by our subsidiary, Nationwide Health Properties, LLC (“NHP LLC”), as successor to NHP, in connection with our acquisition of NHP, and C$\n2.0\n billion aggregate principal amount of senior notes issued by our subsidiary, Ventas Canada Finance Limited (“Ventas Canada”). All of the senior notes issued by Ventas Realty and Ventas Canada are unconditionally guaranteed by Ventas, Inc.\nVentas Realty’s senior notes are part of our and Ventas Realty’s general unsecured obligations, ranking equal in right of payment with all of our and Ventas Realty’s existing and future senior obligations and ranking senior in right of payment to all of our and Ventas Realty’s existing and future subordinated indebtedness. However, Ventas Realty’s senior notes are effectively subordinated to our and Ventas Realty’s secured indebtedness, if any, to the extent of the value of the assets securing that indebtedness. Ventas Realty’s senior notes are also structurally subordinated to the preferred equity and indebtedness, whether secured or unsecured, of our subsidiaries (other than Ventas Realty).\nVentas Canada’s senior notes are part of our and Ventas Canada’s general unsecured obligations, ranking equal in right of payment with all of Ventas Canada’s existing and future subordinated indebtedness. However, Ventas Canada’s senior notes are effectively subordinated to our and Ventas Canada’s secured indebtedness, if any, to the extent of the value of the assets securing that indebtedness. Ventas Canada’s senior notes are also structurally subordinated to the preferred equity and indebtedness, whether secured or unsecured, of our subsidiaries (other than Ventas Canada).\nNHP LLC’s senior notes are part of NHP LLC’s general unsecured obligations, ranking equal in right of payment with all of NHP LLC’s existing and future senior obligations and ranking senior to all of NHP LLC’s existing and future subordinated indebtedness. However, NHP LLC’s senior notes are effectively subordinated to NHP LLC’s secured indebtedness, if any, to the extent of the value of the assets securing that indebtedness. NHP LLC’s senior notes are also structurally subordinated to the preferred equity and indebtedness, whether secured or unsecured, of its subsidiaries.\nVentas Realty and Ventas Canada may redeem each series of their respective senior notes in whole at any time or in part from time to time, prior to maturity at the redemption prices set forth in the applicable indenture (which include, in many instances, a make-whole premium), plus, in each case, accrued and unpaid interest thereon to the redemption date.\nIn February 2024, Ventas Canada issued and sold C$\n650.0\n million ($\n478.3\n million) aggregate principal amount of \n5.10\n% Senior Notes, Series J due 2029 in a private placement. The proceeds were primarily used to repay our C$\n500.0\n million ($\n369.4\n million) unsecured term loan facility due 2025.\n104\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn April and May 2024, we repaid $\n800.0\n million senior notes consisting of $\n400.0\n million aggregate principal amount of \n3.50\n% Senior Notes due 2024 and $\n400.0\n million aggregate principal amount of \n3.75\n% Senior Notes due 2024 at maturity primarily with cash on hand and borrowings through our commercial paper program. \nIn April 2024, we repaid C$\n73.0\n million ($\n53.4\n million) aggregate principal amount of \n2.80\n% Senior Notes, Series E due 2024 at maturity with cash on hand.\nIn May 2024, Ventas Realty issued and sold $\n500.0\n million aggregate principal amount of \n5.625\n% Senior Notes due 2034 in a registered public offering. The proceeds were primarily used to repay balances outstanding under our commercial paper program.\nIn September 2024, Ventas Realty issued and sold $\n550.0\n million aggregate principal amount of \n5.00\n% Senior Notes due 2035 in a registered public offering. We used the proceeds for general corporate purposes, including funding of acquisitions and the repayment of other indebtedness.\nIn September 2024, we repaid C$\n163.3\n million ($\n120.8\n million) aggregate principal amount of \n4.125\n% Senior Notes due 2024 at maturity with cash on hand.\nIn January and February 2025, we repaid $\n450.0\n million and $\n600.0\n million aggregate principal amount of \n2.65\n% Senior Notes due 2025 and aggregate principal amount of \n3.50\n% Senior Notes due 2025, respectively, at maturity using cash on hand and borrowings through our commercial paper program.\nMortgages\nAt December 31, 2024, we had \n145\n mortgage loans outstanding in the aggregate principal amount of $\n3.2\n billion, which are secured by \n140\n of our properties. Of these loans, \n131\n loans in the aggregate principal amount of $\n2.7\n billion bear interest at fixed rates ranging from \n2.24\n% to \n7.13\n% per annum, and \n14\n loans in the aggregate principal amount of $\n483.9\n million bear interest at variable rates ranging from \n3.05\n% to \n7.79\n% per annum as of December 31, 2024. At December 31, 2024, the weighted average annual rate on our fixed rate mortgage loans was \n4.3\n%, and the weighted average annual rate on our variable rate mortgage loans was \n5.1\n%. Our mortgage loans had a weighted average maturity of \n4.3\n years as of December 31, 2024.\nDuring the year ended December 31, 2024, we repaid in full mortgage loans in the aggregate principal amount of $\n48.3\n million.\nIn February 2024, we entered into a C$\n52.8\n million ($\n39.1\n million) fixed rate mortgage loan, which accrues interest at \n4.644\n%, matures in 2029 and is secured by \none\n senior housing community in Canada.\nIn April 2024, we entered into an aggregate C$\n103.0\n million ($\n75.5\n million) fixed rate mortgage loans, which accrue interest at a blended rate of \n4.90\n%, mature in 2029 and are secured by \ntwo\n senior housing communities in Canada.\nIn May 2024, we entered into a $\n52.3\n million fixed rate mortgage loan, which accrues interest at \n6.02\n%, matures in 2034 and is secured by \none\n outpatient medical building in California.\n105\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nScheduled Maturities of Borrowing Arrangements and Other Provisions\nAs of December 31, 2024, our indebtedness had the following maturities (dollars in thousands):\nPrincipal Amount\nDue at Maturity\nUnsecured Revolving\nCredit Facility and Commercial Paper Notes\nScheduled Periodic\nAmortization\nTotal Maturities\n2025\n$\n1,737,827\n \n$\n—\n \n$\n48,425\n \n$\n1,786,252\n \n2026\n2,041,934\n \n—\n \n42,663\n \n2,084,597\n \n2027\n1,558,922\n \n—\n \n42,907\n \n1,601,829\n \n2028\n1,447,250\n \n6,397\n \n36,105\n \n1,489,752\n \n2029\n1,637,470\n \n—\n \n29,906\n \n1,667,376\n \nThereafter\n4,890,539\n \n—\n \n98,457\n \n4,988,996\n \nTotal maturities\n$\n13,313,942\n \n$\n6,397\n \n$\n298,463\n \n$\n13,618,802\n \n    \nThe instruments governing our outstanding indebtedness contain covenants that limit our ability and the ability of certain of our subsidiaries to, among other things: (i) incur debt; (ii) make certain dividends, distributions and investments; (iii) enter into certain transactions; and/or (iv) merge, consolidate or sell certain assets. Ventas Realty’s and Ventas Canada’s senior notes also require us and our subsidiaries to maintain total unencumbered assets of at least \n150\n% of our unsecured debt.  Our credit facilities also require us to maintain certain financial covenants pertaining to, among other things, our consolidated total leverage, secured debt, unsecured debt, fixed charge coverage and net worth.\nAs of December 31, 2024, we were in compliance with all of these covenants.\nDerivatives and Hedging\nIn the normal course of our business, interest rate fluctuations affect future cash flows under our variable rate debt obligations, loans receivable and marketable debt securities, and foreign currency exchange rate fluctuations affect our operating results. We follow established risk management policies and procedures, including the use of derivative instruments, to mitigate the impact of these risks.\nWe do not use derivative instruments for trading or speculative purposes, and we have a policy of entering into contracts only with major financial institutions based upon their credit ratings and other factors. When considered together with the underlying exposure that the derivative is designed to hedge, we do not expect that the use of derivatives in this manner would have any material adverse effect on our future financial condition or results of operations.\nWe enter into interest rate swaps in order to maintain a capital structure containing targeted amounts of fixed and variable-rate debt and manage interest rate risk. Interest rate swaps designated as cash flow hedges involve the receipt of variable amounts from a counterparty in exchange for our fixed-rate payments. These interest rate swap agreements are used to hedge the variable cash flows associated with variable-rate debt.\nPeriodically, we enter into and designate interest rate locks to partially hedge the risk of changes in interest payments attributable to increases in the benchmark interest rate during the period leading up to the probable issuance of fixed-rate debt. We designate our interest rate locks as cash flow hedges. Gains and losses when we settle our interest rate locks are amortized over the life of the related debt and recorded in Interest expense in our Consolidated Statements of Income.\nAs of December 31, 2024, our variable rate debt obligations of $\n0.8\n billion reflect, in part, the effect of $\n141.3\n million notional amount of interest rate swaps with maturities in March 2027, that effectively convert fixed rate debt to variable rate debt. \nAs of December 31, 2024, our fixed rate debt obligations of $\n12.8\n billion reflect, in part, the effect of $\n526.5\n million and C$\n635.9\n million notional amount of interest rate swaps with maturities ranging from February 2025 to April 2031, in each case, that effectively convert variable rate debt to fixed rate debt. \n106\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n2024 Activity\nFrom June through September 2024, we entered into an aggregate $\n350.0\n million treasury locks to hedge interest rate risk on future debt issuances. In September 2024, we terminated the treasury locks in conjunction with the issuance of the $\n550.0\n million aggregate principal amount of \n5.00\n% Senior Notes due 2035.\nDuring the year ended December 31, 2024, approximately $\n22.3\n million of realized gain primarily relating to our interest rate swaps was reclassified into Interest expense in our Consolidated Statements of Income. Approximately $\n3.0\n million of unrealized gains, which are included in Accumulated other comprehensive income as of December 31, 2024, are expected to be reclassified into earnings within the next 12 months.\nNOTE 11 – FAIR VALUES OF FINANCIAL INSTRUMENTS \nFinancial Instruments Measured at Fair Value\nThe table below summarizes the carrying amounts and fair values of our financial instruments either recorded or disclosed on a recurring basis (dollars in thousands): \n \nAs of December 31, 2024\nAs of December 31, 2023\n \nCarrying Amount\nFair Value\nCarrying Amount\nFair Value\nAssets:\n \n \n \n \nCash and cash equivalents \n(1)\n$\n897,850\n \n$\n897,850\n \n$\n508,794\n \n$\n508,794\n \nEscrow deposits and restricted cash \n(1)\n59,383\n \n59,383\n \n54,668\n \n54,668\n \nStock warrants \n(3)(4)(5)\n40,192\n \n40,192\n \n59,281\n \n59,281\n \nSecured mortgage loans and other, net \n(3)(4)\n144,872\n \n146,229\n \n27,986\n \n27,947\n \nNon-mortgage loans receivable, net \n(3)(4)(5)\n28,129\n \n27,640\n \n26,152\n \n25,200\n \nDerivative instruments \n(3)(5)\n12,908\n \n12,908\n \n19,782\n \n19,782\n \nLiabilities:\nSenior notes payable and other debt, gross \n(3)(4)\n13,618,802\n \n13,411,066\n \n13,568,598\n \n13,104,091\n \nDerivative instruments \n(3)(6)\n5,887\n \n5,887\n \n2,525\n \n2,525\n \nRedeemable OP Units \n(2)\n200,420\n \n200,420\n \n173,452\n \n173,452\n \n______________________________\n(1)\nThe carrying amount approximates fair value due to the short maturity of these instruments.\n(2)\nLevel 1 within fair value hierarchy.\n(3)\nLevel 2 within fair value hierarchy.\n(4)\nLevel 3 within fair value hierarchy.\n(5)\nIncluded in Other assets on our Consolidated Balance Sheets.\n(6)\nIncluded in Accounts payable and other liabilities on our Consolidated Balance Sheets.    \n(7)\nDuring the years ended December 31, 2024 and 2023, there were no material transfers of financial assets or liabilities within the fair value hierarchy.\nFor a discussion of the assumptions considered, refer to “Note 2 – Accounting Policies.” The use of different market assumptions and estimation methodologies may have a material effect on the reported estimated fair value amounts.  Accordingly, the estimates presented above are not necessarily indicative of the amounts we would realize in a current market exchange.\nItems Measured at Fair Value on a Recurring Basis\nIn the above table, stock warrants consist of the Brookdale Warrants and the Scion Warrants. The Brookdale Warrants represent an interest in a publicly-traded entity and their fair value is based on Level 2 inputs that are obtained from public sources such as equity spot price, dividend yield, volatility and risk-free rate.\nThe Scion Warrants represent a financial interest in a private entity whose fair value is based on Level 3 inputs that reflect significant assumptions including underlying enterprise value, market volatility, duration, dividend rate and risk-free rate. Changes in one or more of these inputs could impact the fair value determination. During the year ended December 31, \n107\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n2024, there has been no realized or unrealized gains or losses recognized for these warrants.  There has been no transfer into or out of Level 3 financial instruments during the periods presented.\nSubstantially all of our derivative instruments consist of interest rate swaps. Their fair value is based on Level 2 inputs. See “Note 2 – Accounting Policies.”\nOther Items Measured at Fair Value on a Nonrecurring Basis\nReal estate recorded as held for sale and any associated real estate impairment recorded due to the shortening of the expected hold period due to our change in intent to hold the asset (see “Note 5 – Dispositions and Impairments”) are measured at fair value on a nonrecurring basis. We estimate the fair value of assets held for sale and any associated impairment charges based primarily on current sales price expectations, which reside within Level 2 of the fair value hierarchy.\nReal estate impairment charges recorded due to our evaluation of recoverability when events or changes in circumstances indicate the carrying amount may not be recoverable are based on company-specific inputs and our assumptions about the marketability of the properties as observable inputs are not available. As such, we have determined that these fair value measurements generally reside within Level 3 of the fair value hierarchy. We estimate the fair value of real estate deemed to not be recoverable using the cost or income approach and unobservable data such as net operating income and estimated capitalization and discount rates, and giving consideration to local and national industry market data including comparable sales.\n2023 Activity\nThe fair value of the collateral received in connection with the equitization of the Santerre Mezzanine Loan on May 1, 2023 was determined using fair value determinations within Level 1, 2 and 3 of the fair value hierarchy. The fair value of the non-real estate assets and liabilities was based on their cost, given the short term nature of those balances and because cost was the best information available, which reside within Level 1 of the fair value hierarchy. The fair value of the CHC Mortgage Loan, which approximates par, was based on the absence of recent underlying trading activity, consideration of the near-term maturity date and adjustments for the credit-worthiness of the borrower, which reside within Level 2 of the fair value hierarchy.\nThe fair value of the real estate properties that secured the Santerre Mezzanine Loan of $\n1.566\n billion (net of $\n31.8\n million of capital expenditures) on May 1, 2023 was determined using unobservable inputs primarily within Level 3 of the fair value hierarchy. For SHOP and outpatient medical properties, fair value was based on either an income or market approach that took into account unobservable inputs such as direct capitalization rates, estimated NOI, market rents, costs per unit, replacement cost and estimates of future cash flows, which are based on a number of factors including historical operating results, known trends and market and economic conditions. For the majority of the SHOP properties, fair value was based on an income approach with significant unobservable inputs that included an average direct capitalization rate of \n6.8\n% on estimated expected stabilized NOI, adjusted based on cost per unit in certain cases. For the majority of the outpatient medical properties, fair value was based on an income approach with significant unobservable inputs that included an average direct capitalization rate of \n6.7\n% on estimated expected stabilized NOI, adjusted based on cost per square foot in certain cases. For triple-net leased properties, fair value was primarily based on an average estimated per bed value by property by state of $\n88,000\n, which was determined based on an assessment of recent transactions adjusted for property, operator and other characteristics such as contractual rent, tenant payment history, underlying operating trends, reimbursement rates and other market data.\nNOTE 12 – LONG-TERM COMPENSATION \nCompensation Plans\nWe currently have: \n•\none\n plan, the 2022 Incentive Plan, under which equity awards, including options to purchase common stock, shares of restricted stock or restricted stock units, have been or may be granted to our officers, employees and non-employee directors; and\n•\none\n plan under which our non-employee directors may elect to defer receipt of all or a portion of their cash retainers and meeting fees and receive shares of common stock in lieu thereof at a later date chosen by the participating director (the Non-Employee Directors’ Cash Compensation Deferral Plan, formerly known as the Non-Employee Directors’ Deferred Stock Compensation Plan). \n108\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThese plans are referred to collectively as the “Plans.”\nThe number of shares initially reserved for issuance and the number of shares available for future grants or issuance under the Plans as of December 31, 2024 were as follows:\n•\n2022 Incentive Plan—\n11.4\n million shares, plus any shares of common stock subject to awards granted under the 2012 Plan as of October 1, 2022, that expire, or for any reason are forfeited, cancelled or terminated either without such shares being issued or with such shares being forfeited (such shares the “2012 Plan Shares”) were reserved initially for grants or issuance to employees and non-employee directors, and \n10.8\n million shares were available for future issuance as of December 31, 2024.\n•\nNon-Employee Directors’ Cash Compensation Deferral Plan—\n0.6\n million shares were reserved initially for issuance to participating non-employee directors in lieu of the payment of all or a portion of their retainer and meeting fees, at their option, and \n0.4\n million shares were available for future issuance as of December 31, 2024.\nIn addition, we have \ntwo\n plans under which outstanding options to purchase common stock, shares of restricted stock or restricted stock units have been granted to our officers, employees and non-employee directors (the 2006 Stock Plan for Directors and the 2012 Incentive Plan). New grants are not permitted under either of these plans. \nOutstanding options, all of which were issued under the 2012 Plan, are exercisable at the market price on the date of grant, expire \nten years\n from the date of grant, and are fully vested.\nStock Options\nThe following is a summary of stock option activity in 2024:\nShares (000’s)\nWeighted Average\nExercise Price\nWeighted\nAverage\nRemaining\nContractual\nLife (years)\nIntrinsic\nValue\n($000’s)\nOutstanding as of December 31, 2023\n3,457\n \n$\n62.17\n \n \nOptions exercised\n(\n426\n)\n61.21\n \n \n1,208\n \nOptions forfeited\n(\n400\n)\n51.84\n \nOutstanding as of December 31, 2024\n2,631\n \n63.89\n \n1.6\n$\n399\n \nExercisable as of December 31, 2024\n2,631\n \n63.89\n \n1.6\n$\n399\n \nCompensation costs for all share-based awards are based on the grant date fair value and are recognized on a straight-line basis during the requisite service periods, with charges primarily recorded in General, administrative and professional fees in our Consolidated Statements of Income. As of December 31, 2024, 2023 and 2022, there was \nno\n unrecognized compensation expense relating to stock options.\nAggregate proceeds received from options exercised under the Plans for the years ended December 31, 2024, 2023 and 2022 were $\n26.1\n million, $\n1.7\n million and $\n8.7\n million, respectively. The total intrinsic value at exercise of options exercised during the year ended December 31, 2024 was $\n1.2\n million. The total intrinsic value at exercise of options exercised during the year ended December 31, 2023 was immaterial. The total intrinsic value at exercise of options exercised during the year ended December 31, 2022 was $\n0.7\n million. There was \nno\n deferred income tax benefit for stock options exercised.\nRestricted Stock and Restricted Stock Units\n    \nWe recognize the fair value of shares of restricted stock and restricted stock units (including time-based and performance-based awards) on the grant date of the award as stock-based compensation expense over the requisite service period, with charges primarily to General, administrative and professional fees of $\n30.9\n million, $\n30.4\n million and $\n30.7\n million in 2024, 2023 and 2022, respectively, in our Consolidated Statements of Income. Time-based restricted stock and restricted stock unit awards granted to employees generally vest over a \nthree-year\n period, while time-based restricted stock unit awards granted to non-employee directors typically vest approximately \none year\n from the date of grant. Performance-based \n109\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nstock units granted to our executive officers, which include market and performance components, may be earned and vest, if at all, at the end of the \nthree-year\n performance period based on the achievement of such components. If provided in the applicable Plan or award agreement, the vesting of awards may accelerate upon a change of control (as defined in the applicable Plan) of Ventas and other specified events. In addition to customary change in control vesting provisions, awards generally vest on retirement provided certain conditions are met. Employees are typically not retirement eligible until age 65, or in the case of executive officers, until their age plus years of service equals 75, with a minimum age of 62; the retirement age for non-employee directors is 75.\nThe fair market value of time-based restricted stock units is determined based on the closing market price of the Company’s shares on the grant date and is expensed over the period of \nthree\n to \nfour years\n. In calculating the grant date fair value of performance-based stock units, we use a Monte Carlo simulation to calculate the grant date fair value of the total shareholder return (“TSR”)-driven components and the closing price on the date of grant, assuming performance at target—which was the probable outcome at the grant date—for other performance components. The Monte Carlo simulation “probability weights” potential outcomes of the relative TSR measures of each performance-based stock unit as of the grant date, based on, among other things, assumptions related to volatility, correlation and interest rates, which can fluctuate significantly year-over-year.  The following assumptions were used in the Monte Carlo valuation for the TSR-driven components for performance-based stock units granted during the years ended December 31, 2024, 2023 and 2022, respectively: (i) expected term of \nthree years\n for each of the years (equal to the remaining performance period at the grant date), (ii) historical volatility of \n42.0\n%, \n41.3\n%, and \n38.7\n% and, (iii) risk-free rate of \n4.09\n%, \n3.84\n%, and \n1.02\n%. The total grant date fair value of time-based restricted stock units and performance-based stock units granted during the years ended December 31, 2024, 2023 and 2022 was $\n35.6\n million, $\n30.1\n million, and $\n24.1\n million, respectively.\nThe following is a summary of the status of our non-vested restricted stock and restricted stock units (including time-based and performance-based awards) as of December 31, 2024, and changes during the year ended December 31, 2024:\nRestricted\nStock \n(000’s)\nWeighted\nAverage\nGrant Date\nFair Value\nRestricted\nStock Units (000’s)\nWeighted\nAverage\nGrant Date\nFair Value\nNon-vested at December 31, 2023\n156\n \n$\n51.30\n \n1,309\n \n$\n52.03\n \nGranted\n—\n \n—\n \n750\n \n49.74\n \nVested\n(\n99\n)\n52.03\n \n(\n665\n)\n48.54\n \nForfeited\n(\n6\n)\n51.09\n \n(\n93\n)\n47.16\n \nNon-vested at December 31, 2024\n51\n \n49.88\n \n1,301\n \n52.39\n \nAs of December 31, 2024, we had $\n17.2\n million of unrecognized compensation cost related to non-vested restricted stock and restricted stock units under the Plans. We expect to recognize that cost over a weighted average period of \n0.45\n years. The total fair value at the vesting date for restricted stock and restricted stock units that vested during the years ended December 31, 2024, 2023 and 2022 was $\n32.7\n million, $\n25.0\n million and $\n29.6\n million, respectively.\nEmployee and Director Stock Purchase Plan\nWe have in effect an Employee and Director Stock Purchase Plan (“ESPP”) under which our employees and directors may purchase shares of our common stock at a discount. Pursuant to the terms of the ESPP, on each purchase date, participants may purchase shares of common stock at a price not less than \n90\n% of the market price on that date (with respect to the employee tax-favored portion of the plan) and not less than \n95\n% of the market price on that date (with respect to the additional employee and director portion of the plan). We initially reserved \n3.0\n million shares for issuance under the ESPP. As of December 31, 2024, \n0.2\n million shares had been purchased under the ESPP and \n2.8\n million shares were available for future issuance.   \nEmployee Benefit Plan\n    \nWe maintain a 401(k) plan that allows eligible employees to defer compensation subject to certain limitations imposed by the Code. In 2024, we made contributions for each qualifying employee of up to \n4.0\n% of his or her salary, subject to certain limitations. During 2024, 2023 and 2022, our aggregate contributions were approximately $\n2.1\n million, $\n2.0\n million and $\n1.6\n million, respectively.\n110\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 13 – INCOME TAXES \nWe have elected to be taxed as a REIT under the applicable provisions of the Code for every year beginning with the year ended December 31, 1999. We have also elected for certain of our subsidiaries to be treated as TRS entities, which are subject to federal, state and foreign income taxes. All entities other than the TRS entities are collectively referred to as the “REIT” within this note. Certain REIT entities are subject to foreign income tax.\nAlthough we intend to continue to operate in a manner that will enable us to qualify as a REIT, such qualification depends upon our ability to meet, on a continuing basis, various distribution, stock ownership and other tests. \nOur tax treatment of distributions per common share was as follows:\nFor the Years Ended December 31,\n2024\n2023\n2022\nTax treatment of distributions:\n \n \n \nOrdinary income\n$\n—\n \n$\n—\n \n$\n—\n \nQualified ordinary income\n—\n \n0.04468\n \n0.04906\n \n199A qualified business income\n1.09580\n \n1.49465\n \n1.75094\n \nLong-term capital gain\n—\n \n0.09136\n \n—\n \nNon-dividend distribution\n0.70420\n \n0.16931\n \n—\n \nDistribution reported for 1099-DIV purposes\n1.80000\n \n1.80000\n \n1.80000\n \nAdd: Dividend declared in current year and taxable in following year\n0.45000\n \n0.45000\n \n0.45000\n \nLess: Dividend declared in prior year and taxable in current year\n(\n0.45000\n)\n(\n0.45000\n)\n(\n0.45000\n)\nDistribution declared per common share outstanding\n$\n1.80000\n \n$\n1.80000\n \n$\n1.80000\n \nWe believe we have met the annual REIT distribution requirement by payment of at least \n90\n% of our estimated taxable income for 2024, 2023 and 2022. \nOur consolidated expense (benefit) for income taxes was as follows (dollars in thousands):\nFor the Years Ended December 31,\n2024\n2023\n2022\nCurrent - Federal \n$\n324\n \n$\n534\n \n$\n(\n2,257\n)\nCurrent - State\n2,630\n \n2,564\n \n2,662\n \nDeferred - Federal \n(\n30,436\n)\n(\n6,135\n)\n338\n \nDeferred - State\n28\n \n230\n \n1,310\n \nCurrent - Foreign\n2,646\n \n2,587\n \n3,217\n \nDeferred - Foreign\n(\n12,967\n)\n(\n9,319\n)\n(\n22,196\n)\nTotal\n$\n(\n37,775\n)\n$\n(\n9,539\n)\n$\n(\n16,926\n)\nThe 2024 income tax benefit is primarily due to losses in certain of our TRS entities and a $\n28.6\n million change in valuation allowance due to purchase accounting activity. The 2023 income tax benefit is primarily due to losses in certain of our TRS entities and a $\n3.2\n million benefit from internal restructurings of U.S. TRS entities. The 2022 income tax benefit is primarily due to losses at certain TRS entities and an income tax benefit of $\n11.9\n million from an internal restructuring of foreign TRS entities.\nAlthough the TRS entities and certain other foreign entities have paid minimal cash federal, state and foreign income taxes for the year ended December 31, 2024, their income tax liabilities may increase in future years as we exhaust net operating loss (“NOL”) carryforwards and as our operations grow. Such increases could be significant.\n111\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nA reconciliation of income tax expense and benefit, which is computed by applying the federal corporate tax rate for the years ended December 31, 2024, 2023 and 2022, to the income tax expense and benefit is as follows (dollars in thousands):\nFor the Years Ended December 31,\n2024\n2023\n2022\nTax at statutory rate on earnings from continuing operations before unconsolidated entities, noncontrolling interest and income taxes\n$\n(\n1,679\n)\n$\n(\n24,272\n)\n$\n(\n19,733\n)\nState income taxes, net of federal benefit\n2,641\n \n(\n839\n)\n(\n5,411\n)\nChange in valuation allowance\n(\n10,593\n)\n20,330\n \n53,117\n \nTax at statutory rate on earnings not subject to federal income taxes\n(\n18,773\n)\n(\n7,809\n)\n(\n31,528\n)\nForeign rate differential and foreign taxes\n1,813\n \n43\n \n123\n \nChange in tax status of TRS\n—\n \n9,171\n \n(\n1,961\n)\nOther differences\n(\n11,184\n)\n(\n6,163\n)\n(\n11,533\n)\nIncome tax benefit\n$\n(\n37,775\n)\n$\n(\n9,539\n)\n$\n(\n16,926\n)\nEach TRS is a tax-paying component for purposes of classifying deferred tax assets and liabilities. \nThe tax effects of temporary differences and carryforwards included in the net deferred tax liabilities are summarized as follows (dollars in thousands):\nAs of December 31,\n2024\n2023\n2022\nProperty, primarily differences in depreciation and amortization, the tax basis of land assets and the treatment of interests and certain costs\n$\n(\n73,214\n)\n$\n(\n26,071\n)\n$\n(\n34,734\n)\nOperating loss and interest deduction carryforwards\n236,424\n \n233,847\n \n220,891\n \nExpense accruals and other\n56,546\n \n26,700\n \n16,723\n \nValuation allowance\n(\n225,975\n)\n(\n257,222\n)\n(\n227,960\n)\nNet deferred tax liabilities \n$\n(\n6,219\n)\n$\n(\n22,746\n)\n$\n(\n25,080\n)\nOur net deferred tax liability decreased $\n16.5\n million during 2024 primarily due to the impact of operating losses at certain TRS entities and an increase in deferred tax assets of $\n18.0\n million due to tax law changes in Canada regarding the deductibility of interest and financing expenses. Our net deferred tax liability decreased $\n1.7\n million during 2023 primarily due to the impact of operating losses at certain TRS entities and the reversal of $\n3.2\n million of net deferred tax liabilities from an internal restructuring of TRS entities, partially offset by an increase of $\n12.4\n million in connection with our equitization of the Santerre Mezzanine Loan on May 1, 2023. Our net deferred tax liability decreased $\n23.0\n million during 2022 primarily due to the impact of operating losses at certain TRS entities and the reversal of $\n11.9\n million of deferred tax liabilities from an internal restructuring of foreign TRS entities.\nDue to uncertainty regarding the realization of certain deferred tax assets, we have established valuation allowances, primarily in connection with the NOL carryforwards related to certain TRSs. The amounts related to NOLs at the TRS entities for 2024, 2023 and 2022 are $\n180.8\n million, $\n179.0\n million and $\n171.0\n million, respectively. \nWe are subject to corporate-level taxes (“built-in gains tax”) for any asset dispositions during the \nfive-year\n period immediately after the assets were owned by a C corporation (either prior to our REIT election, through stock acquisition or merger).  The amount of income potentially subject to built-in gains tax is generally equal to the lesser of the excess of the fair value of the asset over its adjusted tax basis as of the date it became a REIT asset or the actual amount of gain.  Some, but not all, future gains could be offset by available NOL carryforwards.\nAt December 31, 2024, 2023 and 2022, the REIT had NOL carryforwards of $\n1.0\n billion, $\n1.1\n billion and $\n1.1\n billion, respectively. Additionally, the REIT has $\n10.8\n million of federal income tax credits that were carried over from acquisitions at December 31, 2024, 2023 and 2022. These amounts can be used to offset future taxable income (or taxable income for prior years if an audit determines that tax is owed), if any. The REIT will be entitled to utilize NOLs and tax credit carryforwards only to the extent that REIT taxable income exceeds our deduction for dividends paid. Certain NOL and credit carryforwards are limited as to their utilization by Section 382 of the Code. The remaining REIT carryforwards began to expire in 2023.\n112\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the years ended December 31, 2024 and 2023, the net difference between tax bases and the reported amount of REIT assets and liabilities for federal income tax purposes was approximately $\n1.8\n billion and $\n2.2\n billion, respectively, less than the book bases of those assets and liabilities for financial reporting purposes.\nGenerally, we are subject to audit under the statute of limitations by the Internal Revenue Service (“IRS”) for the year ended December 31, 2021, and subsequent years and are subject to audit by state taxing authorities for the year ended December 31, 2020 and subsequent years. We are subject to audit generally under the statutes of limitation by the Canada Revenue Agency and provincial authorities with respect to the Canadian entities for the year ended December 31, 2020 and subsequent years. We are subject to audit in the United Kingdom generally for the periods ended in and subsequent to 2023.  \nThe following table summarizes the activity related to our unrecognized tax benefits (dollars in thousands):\n2024\n2023\nBalance as of January 1\n$\n5,205\n \n$\n5,828\n \nAdditions to tax positions related to prior years\n—\n \n108\n \nSubtractions to tax positions related to prior years\n(\n1,242\n)\n(\n731\n)\nBalance as of December 31\n$\n3,963\n \n$\n5,205\n \nIf recognized, these unrecognized tax benefits of $\n4.0\n million and $\n5.2\n million at December 31, 2024 and 2023, respectively, would reduce our annual effective tax rate. We accrued \nno\n interest or penalties related to the unrecognized tax benefits during 2024. We do not expect our unrecognized tax benefits to increase or decrease materially in 2025.\nAs a part of the transfer pricing structure in the normal course of business, the REIT enters into transactions with certain TRSs, such as leasing and sub-management transactions, other capital financing and allocation of general and administrative costs, which transactions are intended to comply with the IRS and foreign tax authority transfer pricing rules.\nNOTE 14 – COMMITMENTS AND CONTINGENCIES \nFrom time to time, we are party to various lawsuits, investigations, claims and other legal and regulatory proceedings arising in connection with our business. In certain circumstances, regardless of whether we are a named party in a lawsuit, investigation, claim or other legal or regulatory proceeding, we may be contractually obligated to indemnify, defend and hold harmless our managers, tenants and borrowers or other third parties against, or may otherwise be responsible for, such actions, proceedings or claims. These claims may include, among other things, professional liability and general liability claims, commercial liability claims, unfair business practices claims and employment claims, as well as regulatory proceedings and government investigations, including proceedings related to our senior housing operating portfolio, where we are typically the holder of the applicable healthcare license. These claims may not be fully insured and some may allege large damage amounts.\nIt is the opinion of management, that the disposition of any such lawsuits, investigations, claims and other legal and regulatory proceedings that are currently pending will not, individually or in the aggregate, have a material adverse effect on us. However, regardless of the merits of a particular action, investigation or claim, we may be forced to expend significant financial resources to defend and resolve these matters. We are unable to predict the ultimate outcome of these lawsuits, investigations, claims and other legal and regulatory proceedings, and if management’s assessment of our liability with respect thereto is incorrect, such actions, investigations and claims could have a material adverse effect on us.\nFrom time to time, on behalf of ourselves or on behalf of our unconsolidated entities, we have agreed, and may in the future agree, to provide guarantees, indemnities or other similar contingent obligations to third parties.  Such agreements may include, without limitation: (1) guarantees of all or a portion of the principal, interest and other amounts due under mortgage debt or other borrowings, (2) customary nonrecourse carve-out guarantees provided in connection with mortgage or other borrowings, (3) customary indemnifications of lenders for potential environmental liabilities, (4) completion guarantees provided to lenders, tenants, ground lessors or other third parties for the completion of development and redevelopment projects, (5) guarantees of payment of contingent tax obligations to tax credit investors who have purchased historic, new market and other tax credits from us or our unconsolidated entities, (6) guarantees of ground rent and other payment of ground rent and other obligations to ground lessors and (7) indemnities and other guarantees required in connection with the procurement of performance and surety bonds and standby letters of credit.\nAs of December 31, 2024 and 2023, \nno\n triggering events relating to our guarantees, indemnities or similar contingent obligations have occurred. Accordingly, \nno\n contingent liability is recorded in our Consolidated Balance Sheets.\n113\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nOperating Leases\nWe lease land, equipment and corporate office space. At inception, we establish an operating lease asset and operating lease liability represented as the present value of future minimum lease payments. As our leases do not provide an implicit rate, we use a discount rate that approximates our incremental borrowing rate available at lease commencement to determine the present value of lease payments. The incremental borrowing rates were adjusted for the length of the individual lease term. The weighted average discount rate and remaining lease term of our leases are \n7.40\n% and \n33.1\n years, respectively. Operating lease assets and liabilities are not recognized for leases with an initial term of 12 months or less, as these short-term leases are accounted for similar to previous guidance. Many of our leases include renewal options to extend the term for one year or more. Renewal options that we are not reasonably certain to exercise are excluded from the operating lease assets and liabilities.\nOur lease expense primarily consists of ground leases, which is included in Interest expense in our Consolidated Statements of Income. For the years ended December 31, 2024, 2023 and 2022, we recognized $\n33.7\n million, $\n37.0\n million and $\n31.9\n million of expense relating to our leases, respectively. For the years ended December 31, 2024, 2023 and 2022, cash paid for leases was $\n24.8\n million, $\n29.8\n million and $\n24.0\n million, respectively, as reported within operating cash outflows in our Consolidated Statements of Cash Flows.\n    \nThe following table summarizes future minimum lease obligations under non-cancelable ground and other operating leases as of December 31, 2024 (dollars in thousands):\n2025\n$\n20,176\n \n2026\n21,701\n \n2027\n21,202\n \n2028\n20,022\n \n2029\n19,201\n \nThereafter\n598,633\n \nTotal undiscounted minimum lease payments\n700,935\n \nLess: imputed interest\n(\n482,932\n)\nOperating lease liabilities\n$\n218,003\n \n114\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 15 – EARNINGS PER SHARE \nThe following table shows the amounts used in computing our basic and diluted earnings per share (in thousands, except per share amounts):\n \nFor the Years Ended December 31,\n \n2024\n2023\n2022\nNumerator for basic and diluted earnings per share:\n \n \n \nNet income (loss)\n$\n88,351\n \n$\n(\n30,297\n)\n$\n(\n40,931\n)\nNet income attributable to noncontrolling interests\n7,198\n \n10,676\n \n6,516\n \nNet income (loss) attributable to common stockholders\n$\n81,153\n \n$\n(\n40,973\n)\n$\n(\n47,447\n)\nDenominator:\nDenominator for basic earnings per share—weighted average shares\n411,770\n \n401,809\n \n399,549\n \nEffect of dilutive securities:\nRestricted stock awards\n397\n \n389\n \n390\n \nOP unitholder interests\n3,422\n \n3,472\n \n3,515\n \nExchangeable Notes\n744\n \n—\n \n—\n \nEquity forward sales agreements\n33\n \n—\n \n—\n \nDenominator for diluted earnings per share—adjusted weighted average shares\n416,366\n \n405,670\n \n403,454\n \nBasic earnings per share:\nNet income (loss)\n$\n0.21\n \n$\n(\n0.08\n)\n$\n(\n0.10\n)\nNet income (loss) attributable to common stockholders\n0.20\n \n(\n0.10\n)\n(\n0.12\n)\nDiluted earnings per share: \n(1)\n \n \nNet income (loss)\n$\n0.21\n \n$\n(\n0.08\n)\n$\n(\n0.10\n)\nNet income (loss) attributable to common stockholders\n0.19\n \n(\n0.10\n)\n(\n0.12\n)\n______________________________\n(1)\n     Potential common shares are not included in the computation of diluted earnings per share when a net loss exists as the effect would be an antidilutive per share amount.\nThere were \n2.9\n million, \n3.5\n million and \n3.6\n million anti-dilutive options outstanding for the years ended December 31, 2024, 2023 and 2022, respectively.\nThe dilutive effect of our Exchangeable Notes is calculated using the if-converted method in accordance with ASU 2020-06. We are required, pursuant to the indenture governing the Exchangeable Notes, to settle the aggregate principal amount of the Exchangeable Notes in cash and may elect to settle any remaining exchange obligation (i.e., the stock price in excess of the exchange obligation) in cash, shares of our common stock, or a combination thereof. Under the if-converted method, we include the number of shares required to satisfy the exchange obligation, assuming all the Exchangeable Notes are exchanged. The average closing price of our common stock for the year ended December 31, 2024 is used as the basis for determining the dilutive effect on earnings per share. The Exchangeable Notes were not included in the computation of diluted earnings per share for the years ended December 31, 2023 and 2022 as they were antidilutive. \nOur unsettled equity forward sales agreements do not impact basic earnings per share. We apply the treasury stock method to our unsettled equity forward sales agreements to determine their dilutive effect, if any. See “Note 16 – Permanent and Temporary Equity.”\nNOTE 16 – PERMANENT AND TEMPORARY EQUITY \nCapital Stock\nIn February 2024, we entered into an amendment to our November 2021 ATM Sales Agreement, providing for an “at-the-market” equity offering program, pursuant to which we could sell, from time to time, up to $\n1.0\n billion aggregate gross sales price of shares of our common stock (as amended, the “February 2024 ATM Program”). In September 2024, we \n115\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nterminated the February 2024 ATM Program and entered into an ATM Sales Agreement providing for the sale, from time to time, of up to $\n2.0\n billion aggregate gross sales price of shares of our common stock (the “September 2024 ATM Program” and, together with the February 2024 ATM Program, the “ATM Programs”). The ATM Programs have allowed us to enter into forward sales agreements, as discussed below. By utilizing a forward sales agreement, we can secure a share price on the sale of shares of our common stock at or shortly after the time the forward sales agreement becomes effective, while postponing the receipt of proceeds from the sale of shares until a future date. As of December 31, 2024, the remaining amount available under our September 2024 ATM Program for future sales of common stock was $\n1.5\n billion.\nDuring the year ended December 31, 2024, we issued \n37.3\n million shares of our common stock for gross proceeds of $\n2.2\n billion, representing an average price of $\n58.38\n per share, of which \n3.4\n million shares or approximately $\n201.1\n million in gross proceeds remained unsettled with maturity in March 2026. During the year ended December 31, 2023, we issued \n2.3\n million shares of our common stock for gross proceeds of $\n110.4\n million, representing an average price of $\n47.89\n per share. There were \nno\n issuances of common stock for the year ended December 31, 2022. \nEquity Forward Sales Agreements\nEquity forward sales agreements generally have a maturity of \none\n to \ntwo years\n. At any time during the term of an equity forward sales agreement, we may settle that equity forward sales agreement by delivery of physical shares of our common stock to the forward purchaser or, at our election, subject to certain exceptions, we may settle in cash or by net share settlement. The forward sales price we expect to receive upon settlement of outstanding equity forward sales agreements will be the initial forward price, net of commissions, established on or shortly after the effective date of the relevant equity forward sales agreement, subject to adjustments for accrued interest, the forward purchasers’ stock borrowing costs in excess of a certain threshold specified in the equity forward sales agreement, and certain fixed price reductions for expected dividends on our common stock during the term of the equity forward sales agreement. Our unsettled equity forward sales agreements are accounted for as equity instruments.\nIn January 2025, we entered into additional unsettled equity forward sales agreements for \n0.8\n million shares or approximately $\n49.8\n million in gross proceeds with maturity in March 2026.\nExcess Share Provision\nOur Amended and Restated Certificate of Incorporation (our “Charter”) contains restrictions on the ownership and transfer of our common and preferred stock to enable us to preserve our REIT status. Our Charter provides certain specified remedies if a transfer would violate one of the ownership limitations. In particular, if a person acquires beneficial or constructive ownership of more than the ownership limit (currently, \n9.0\n%, in number or value, of our outstanding common stock or \n9.9\n%, in number or value, of our outstanding preferred stock), or in violation of certain other limitations set forth in our Charter, then the shares that are beneficially or constructively owned in excess of the relevant limitation are considered to be “excess shares.” Excess shares are automatically deemed transferred to a trust for the benefit of a charitable institution or other qualifying organization selected by our Board of Directors. The trust is entitled to all dividends with respect to the excess shares, and the trustee may exercise all voting power over the excess shares.\nWe have the right to purchase the excess shares for a purchase price equal to the lesser of the price per share in the transaction that created the excess shares or the market price on the date we buy the shares, and we may defer payment of the purchase price for up to \nfive years\n (and we are not obligated to pay interest on such deferred payment). If we do not purchase the excess shares, the trustee of the trust is required to transfer the excess shares at the direction of our Board of Directors. The owner of the excess shares is entitled to receive the lesser of the proceeds from the sale of the excess shares or the original purchase price for such excess shares, and any additional amounts are payable to the beneficiary of the trust. As of December 31, 2024, there were \nno\n shares in the trust. Our Charter also provides that a transfer of shares of common or preferred stock that would otherwise result in ownership, under the applicable attribution rules of the Code, of shares in excess of the ownership limit, would cause our shares to be beneficially owned by fewer than 100 persons, or would result in our being “closely held” (within the meaning of Section 856(h) of the Code), will be void ab initio and the purported transferee will acquire no rights in such shares. \nOur Board of Directors is empowered to grant waivers from the excess share provisions of our Charter under certain circumstances.\n116\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAccumulated Other Comprehensive Loss\nThe following is a summary of our accumulated other comprehensive loss (dollars in thousands):\nAs of December 31,\n \n2024\n2023\nForeign currency translation loss\n$\n(\n34,341\n)\n$\n(\n56,596\n)\nUnrealized loss on available for sale securities\n(\n2,118\n)\n(\n1,256\n)\nUnrealized gain on derivative instruments\n2,933\n \n22,095\n \nTotal accumulated other comprehensive loss\n$\n(\n33,526\n)\n$\n(\n35,757\n)\nRedeemable OP Unitholder and Noncontrolling Interests\nThe following is a roll-forward of our redeemable OP unitholder and noncontrolling interests for 2024 (dollars in thousands):\nRedeemable OP Unitholder Interests\nRedeemable Noncontrolling Interests\nTotal Redeemable OP Unitholder and Noncontrolling Interests\nBalance as of December 31, 2023\n$\n173,452\n \n$\n129,184\n \n$\n302,636\n \nNew issuances\n—\n \n1,141\n \n1,141\n \nChange in fair value\n34,163\n \n1,198\n \n35,361\n \nDispositions\n—\n \n—\n \n—\n \nDistributions and other\n(\n6,424\n)\n(\n21,714\n)\n(\n28,138\n)\nRedemptions\n(\n771\n)\n—\n \n(\n771\n)\nBalance as of December 31, 2024\n$\n200,420\n \n$\n109,809\n \n$\n310,229\n \nNOTE 17 – RELATED PARTY TRANSACTIONS \nAtria\nWe hold a \n34\n% ownership interest in Atria, which entitles us to customary minority rights and protections, including the right to appoint \ntwo\n members to the Atria Board of Directors.\nAtria provides comprehensive property management and accounting services with respect to our senior housing communities that Atria operates, for which we pay annual management fees pursuant to long-term management agreements. For the years ended December 31, 2024, 2023 and 2022, we incurred fees to Atria of $\n62.9\n million, $\n63.4\n million and $\n61.5\n million, respectively, which are recorded within property-level operating expenses in our Consolidated Statements of Income. For the year ended December 31, 2024, 2023 and 2022, we incurred fees to Atria of $\n0.1\n million, $\n1.5\n million and $\n6.1\n million, respectively, primarily in connection with the transition of senior housing communities operated by Atria, which are recorded within Transaction, transition and restructuring costs in our Consolidated Statements of Income. \nArdent\nAs of December 31, 2024, we held an approximately \n6.7\n% ownership interest in Ardent. \nOne\n of our executive officers is currently a member of the Ardent Board of Directors. Going forward, we have the right (but not the obligation) to nominate \none\n member of the Ardent Board of Directors for so long as we beneficially own \n4\n% or more of the total voting power of the outstanding common stock of Ardent, pursuant to our nomination agreement with Ardent. Following Ardent’s initial public offering, which was consummated in July 2024, our equity stake in Ardent decreased from the issuance of primary shares from \n7.5\n% to approximately \n6.7\n%, which resulted in a gain of $\n8.7\n million for the year ended December 31, 2024, which is included in Income from unconsolidated entities in our Consolidated Statements of Income. \nIn May 2023, we sold approximately \n24\n% of our ownership interest in Ardent to a third-party investor for $\n50.1\n million in total proceeds. As a result of the sale, we recognized $\n33.5\n million of gain for the year ended December 31, \n117\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n2023 in Income from unconsolidated entities in our Consolidated Statements of Income and our ownership interest in Ardent was reduced from \n9.8\n% to \n7.5\n%.\nAs of December 31, 2024, we leased \n11\n hospitals to Ardent pursuant to a single, triple-net master lease agreement. For the years ended December 31, 2024, 2023 and 2022, we recognized rental income from Ardent of $\n137.1\n million, $\n133.7\n million and $\n130.5\n million, respectively. As of December 31, 2024, we also leased \n19\n outpatient medical buildings to Ardent under separate leases included in our OM&R segment. For the years ended December 31, 2024, 2023 and 2022, we recognized rental income from Ardent of $\n13.5\n million, $\n13.4\n million and $\n12.1\n million, respectively.\n    \nPMBRES\nWe hold a \n50\n% ownership interest in PMB Real Estate Services LLC (“PMBRES”), which entitles us to customary rights and protections, including the right to appoint \ntwo\n members to the PMBRES Board of Directors.\nPMBRES provides outpatient medical building management, leasing, marketing, facility development and advisory services to highly rated hospitals and other healthcare facilities throughout the United States, for which we pay management fees and leasing commissions pursuant to long-term management agreements. For the years ended December 31, 2024, 2023 and 2022, we incurred fees to PMBRES of $\n11.2\n million, $\n10.9\n million and $\n8.5\n million, respectively. Management fees are recorded within property-level operating expenses in our Consolidated Statements of Income. Leasing commissions are accounted for as initial direct costs and recorded within other assets on our Consolidated Balance Sheets and amortized over the life of the related lease.\nNOTE 18 – SEGMENT INFORMATION \nAs of December 31, 2024, we operated through \nthree\n reportable business segments: SHOP, OM&R and NNN. In our SHOP segment, we own and invest in senior housing communities throughout the United States and Canada and engage operators to operate those communities. In our OM&R segment, we primarily acquire, own, develop, lease and manage outpatient medical buildings and research centers throughout the United States. In our NNN segment, we invest in and own senior housing communities, skilled nursing facilities (“SNFs”), long-term acute care facilities (“LTACs”), freestanding inpatient rehabilitation facilities (“IRFs”) and other healthcare facilities, throughout the United States and the United Kingdom and lease these properties to tenants under triple-net or absolute-net leases that obligate the tenants to pay all property-related expenses, including maintenance, utilities, repairs, taxes, insurance and capital expenditures. Information provided for “non-segment” includes management fees and promote revenues, net of expenses related to our third-party institutional private capital management platform, income from loans and investments and corporate-level expenses not directly attributable to any of our \nthree\n reportable business segments. Non-segment assets consist primarily of corporate assets, including cash and cash equivalents, restricted cash, loans receivable and investments and accounts receivable. Non-segment assets also include our investments in unconsolidated entities, including investments in unconsolidated real estate entities through our third-party institutional private capital management platform, VIM, and investments in unconsolidated operating entities, such as Ardent and Atria. Through VIM, we partner with third-party institutional investors to invest in real estate through various joint ventures and other co-investment vehicles. Non-segment assets also include other assets, such as our Brookdale and Kindred Warrants. Total assets by reportable business segment is not disclosed as the CODM does not review such information to evaluate business performance and allocate resources. The accounting policies for the segments are the same as those described in the summary of significant accounting policies (see “Note 2 – Accounting Policies”).\nOur chief operating decision maker (“CODM”) is the Chief Executive Officer of the Company. Our CODM evaluates performance of the combined properties in each reportable business segment and determines how to allocate resources to those segments based on NOI for each segment. Our CODM uses NOI to assess the performance of each segment and to allocate resources (including employees and financial or capital resources) primarily during the quarterly or annual business review and annual budget and forecasting process. We define NOI as total revenues, less interest and other income, property-level operating expenses and third-party capital management expenses. We consider NOI useful because it allows investors, analysts and our management to measure unlevered property-level operating results and to compare our operating results to the operating results of other real estate companies between periods on a consistent basis. In order to facilitate a clear understanding of our historical consolidated operating results, NOI should be examined in conjunction with net income attributable to common stockholders as presented in our Consolidated Financial Statements and other financial data included elsewhere in this Annual Report. See “Non-GAAP Financial Measures” included elsewhere in this Annual Report for additional disclosure and reconciliations of net income attributable to common stockholders, as computed in accordance with GAAP, to NOI.\n118\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nInterest expense, depreciation and amortization, general, administrative and professional fees, income tax expense and other non-property-specific revenues and expenses are not allocated to individual reportable business segments for purposes of assessing segment performance. There are \nno\n intersegment sales or transfers.\n119\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSummary information by reportable business segment is as follows (dollars in thousands):\nFor the Year Ended December 31, 2024\nSHOP\nOM&R\nNNN\nNon-Segment\nTotal\nRevenues:\nRental income\n$\n—\n \n$\n874,886\n \n$\n622,054\n \n$\n—\n \n$\n1,496,940\n \nResident fees and services\n3,372,796\n \n—\n \n—\n \n—\n \n3,372,796\n \nThird-party capital management revenues\n—\n \n2,705\n \n—\n \n14,654\n \n17,359\n \nIncome from loans and investments\n—\n \n—\n \n—\n \n9,057\n \n9,057\n \nInterest and other income\n—\n \n—\n \n—\n \n28,114\n \n28,114\n \nTotal revenues\n$\n3,372,796\n \n$\n877,591\n \n$\n622,054\n \n$\n51,825\n \n$\n4,924,266\n \nTotal revenues\n$\n3,372,796\n \n$\n877,591\n \n$\n622,054\n \n$\n51,825\n \n$\n4,924,266\n \nLess:\nInterest and other income\n—\n \n—\n \n—\n \n28,114\n \n28,114\n \nLabor \n(1)\n1,418,320\n \n—\n \n—\n \n—\n \n1,418,320\n \nManagement fees\n174,491\n \n—\n \n—\n \n—\n \n174,491\n \nOther segment expenses \n(2)\n913,602\n \n298,320\n \n15,829\n \n—\n \n1,227,751\n \nProperty-level operating expenses\n2,506,413\n \n298,320\n \n15,829\n \n—\n \n2,820,562\n \nThird-party capital management expenses\n—\n \n—\n \n—\n \n6,507\n \n6,507\n \nNOI\n$\n866,383\n \n$\n579,271\n \n$\n606,225\n \n$\n17,204\n \n2,069,083\n \nInterest and other income\n \n28,114\n \nInterest expense\n \n \n(\n602,835\n)\nDepreciation and amortization\n \n \n(\n1,253,143\n)\nGeneral, administrative and professional fees\n \n \n(\n162,990\n)\nLoss on extinguishment of debt, net\n \n \n(\n687\n)\nTransaction, transition and restructuring costs\n \n \n(\n20,369\n)\nReversal of allowance on loans receivable and investments, net\n166\n \nShareholder relations matters\n(\n15,751\n)\nOther expense\n \n \n(\n49,584\n)\nIncome from unconsolidated entities\n1,563\n \nGain on real estate dispositions\n57,009\n \nIncome tax benefit\n \n \n37,775\n \nNet income\n88,351\n \nNet income attributable to noncontrolling interests\n7,198\n \nNet income attributable to common stockholders\n$\n81,153\n \n______________________________\n(1)\n     Labor expense primarily includes salaries, benefits and related taxes.\n(2)    \nOther segment expenses include:\n•\nSHOP — food, utilities, real estate taxes, insurance, repairs and maintenance, marketing, supplies and other expenses.\n•\nOM&R — utilities, real estate taxes, insurance, repairs and maintenance, cleaning, roads and grounds expense and other  expenses.\n•\nNNN — real estate taxes and insurance.\nThe CODM does not regularly receive significant expense details for the OM&R or the NNN segments and focuses on monitoring revenues and NOI because a significant majority or all of the property-level operating expenses are recovered from the tenants.\n120\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Year Ended December 31, 2023\nSHOP\nOM&R\nNNN\nNon-Segment\nTotal\nRevenues:\nRental income\n$\n—\n \n$\n867,193\n \n$\n619,208\n \n$\n—\n \n$\n1,486,401\n \nResident fees and services\n2,959,219\n \n—\n \n—\n \n—\n \n2,959,219\n \nThird-party capital management revenues\n—\n \n2,515\n \n—\n \n15,326\n \n17,841\n \nIncome from loans and investments\n—\n \n—\n \n—\n \n22,952\n \n22,952\n \nInterest and other income\n—\n \n—\n \n—\n \n11,414\n \n11,414\n \nTotal revenues\n$\n2,959,219\n \n$\n869,708\n \n$\n619,208\n \n$\n49,692\n \n$\n4,497,827\n \nTotal revenues\n$\n2,959,219\n \n$\n869,708\n \n$\n619,208\n \n$\n49,692\n \n$\n4,497,827\n \nLess:\nInterest and other income\n—\n \n—\n \n—\n \n11,414\n \n11,414\n \nLabor \n(1)\n1,279,296\n \n—\n \n—\n \n—\n \n1,279,296\n \nManagement fees\n146,162\n \n—\n \n—\n \n—\n \n146,162\n \nOther segment expenses \n(2)\n822,354\n \n292,776\n \n14,557\n \n—\n \n1,129,687\n \nProperty-level operating expenses\n2,247,812\n \n292,776\n \n14,557\n \n—\n \n2,555,145\n \nThird-party capital management expenses\n—\n \n—\n \n—\n \n6,101\n \n6,101\n \nNOI\n$\n711,407\n \n$\n576,932\n \n$\n604,651\n \n$\n32,177\n \n1,925,167\n \nInterest and other income\n \n \n11,414\n \nInterest expense\n \n \n \n(\n574,112\n)\nDepreciation and amortization\n \n \n \n(\n1,392,461\n)\nGeneral, administrative and professional fees\n \n \n \n(\n148,876\n)\nGain on extinguishment of debt, net\n \n \n \n6,104\n \nTransaction, transition and restructuring costs\n \n \n \n(\n15,215\n)\nReversal of allowance on loans receivable and investments, net\n20,270\n \nGain on foreclosure of real estate\n29,127\n \nOther income\n \n \n \n23,001\n \nIncome from unconsolidated entities\n13,626\n \nGain on real estate dispositions\n62,119\n \nIncome tax benefit\n \n \n \n9,539\n \nNet loss\n(\n30,297\n)\nNet income attributable to noncontrolling interests\n10,676\n \nNet loss attributable to common stockholders\n$\n(\n40,973\n)\n______________________________\n(1)\n     Labor expense primarily includes salaries, benefits and related taxes.\n(2)    \nOther segment expenses include:\n•\nSHOP — food, utilities, real estate taxes, insurance, repairs and maintenance, marketing, supplies and other expenses.\n•\nOM&R — utilities, real estate taxes, insurance, repairs and maintenance, cleaning, roads and grounds expense and other  expenses.\n•\nNNN — real estate taxes and insurance.\nThe CODM does not regularly receive significant expense details for the OM&R or the NNN segments and focuses on monitoring revenues and NOI because a significant majority or all of the property-level operating expenses are recovered from the tenants.\n121\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Year Ended December 31, 2022\nSHOP\nOM&R\nNNN\nNon-Segment\nTotal\nRevenues:\nRental income\n$\n—\n \n$\n801,159\n \n$\n598,154\n \n$\n—\n \n$\n1,399,313\n \nResident fees and services\n2,651,886\n \n—\n \n—\n \n—\n \n2,651,886\n \nThird-party capital management revenues\n—\n \n2,448\n \n—\n \n23,751\n \n26,199\n \nIncome from loans and investments\n—\n \n—\n \n—\n \n48,160\n \n48,160\n \nInterest and other income\n—\n \n—\n \n—\n \n3,635\n \n3,635\n \nTotal revenues\n$\n2,651,886\n \n$\n803,607\n \n$\n598,154\n \n$\n75,546\n \n$\n4,129,193\n \nTotal revenues\n$\n2,651,886\n \n$\n803,607\n \n$\n598,154\n \n$\n75,546\n \n$\n4,129,193\n \nLess:\nInterest and other income\n—\n \n—\n \n—\n \n3,635\n \n3,635\n \nLabor \n(1)\n1,164,761\n \n—\n \n—\n \n—\n \n1,164,761\n \nManagement fees\n127,453\n \n—\n \n—\n \n—\n \n127,453\n \nOther segment expenses\n (2)\n712,206\n \n257,003\n \n15,301\n \n—\n \n984,510\n \nProperty-level operating expenses\n2,004,420\n \n257,003\n \n15,301\n \n—\n \n2,276,724\n \nThird-party capital management expenses\n—\n \n—\n \n—\n \n6,194\n \n6,194\n \nNOI\n$\n647,466\n \n$\n546,604\n \n$\n582,853\n \n$\n65,717\n \n1,842,640\n \nInterest and other income\n \n \n \n3,635\n \nInterest expense\n \n \n \n \n(\n467,557\n)\nDepreciation and amortization\n \n \n \n \n(\n1,197,798\n)\nGeneral, administrative and professional fees\n \n \n \n \n(\n144,874\n)\nLoss on extinguishment of debt, net\n(\n581\n)\nTransaction, transition and restructuring costs\n \n \n \n \n(\n30,884\n)\nAllowance on loans receivable and investments, net\n(\n19,757\n)\nShareholder relations matters\n(\n20,693\n)\nOther expense\n \n \n \n \n(\n58,268\n)\nIncome from unconsolidated entities\n28,500\n \nGain on real estate dispositions\n7,780\n \nIncome tax benefit\n \n \n \n \n16,926\n \nNet loss\n(\n40,931\n)\nNet income attributable to noncontrolling interests\n6,516\n \nNet loss attributable to common stockholders\n$\n(\n47,447\n)\n______________________________\n(1)\n     Labor expense primarily includes salaries, benefits and related taxes.\n(2)    \nOther segment expenses include:\n•\nSHOP — food, utilities, real estate taxes, insurance, repairs and maintenance, marketing, supplies and other expenses.\n•\nOM&R — utilities, real estate taxes, insurance, repairs and maintenance, cleaning, roads and grounds expense and other  expenses.\n•\nNNN — real estate taxes and insurance.\nThe CODM does not regularly receive significant expense details for the OM&R or the NNN segments and focuses on monitoring revenues and NOI because a significant majority or all of the property-level operating expenses are recovered from the tenants.\n    \n122\nVENTAS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nCapital expenditures, including investments in real estate property and development project expenditures, by reportable business segment are as follows (dollars in thousands):\n \nFor the Years Ended December 31,\n Capital Expenditures:\n2024\n2023\n2022\nSHOP\n$\n2,061,741\n \n$\n409,105\n \n$\n423,420\n \nOM&R\n273,615\n \n231,855\n \n472,662\n \nNNN\n194,447\n \n8,511\n \n4,614\n \nTotal capital expenditures\n$\n2,529,803\n \n$\n649,471\n \n$\n900,696\n \nOur portfolio of properties and loans and other investments are located in the United States, Canada and the United Kingdom. Revenues are attributed to an individual country based on the location of each property. \nGeographic information regarding our operations is as follows (dollars in thousands):\n \nAs of December 31,\n Net Real Estate Property:\n2024\n2023\nUnited States\n$\n19,690,838\n \n$\n18,702,960\n \nCanada\n2,719,078\n \n2,837,858\n \nUnited Kingdom\n190,629\n \n208,132\n \nTotal net real estate property\n$\n22,600,545\n \n$\n21,748,950\n \nFor the Years Ended December 31,\n Revenues:\n2024\n2023\n2022\nUnited States\n$\n4,366,953\n \n$\n4,004,173\n \n$\n3,652,327\n \nCanada\n526,575\n \n464,772\n \n449,091\n \nUnited Kingdom\n30,738\n \n28,882\n \n27,775\n \nTotal revenues\n$\n4,924,266\n \n$\n4,497,827\n \n$\n4,129,193\n \n123\nVENTAS, INC.\nSCHEDULE III - REAL ESTATE AND ACCUMULATED DEPRECIATION\n (Dollars in thousands)\n \nFor the Years Ended December 31,\n \n2024\n2023\n2022\nReconciliation of real estate:\n \n \n \nCarrying cost:\n \n \n \nBalance at beginning of period\n$\n30,165,798\n \n$\n28,768,409\n \n$\n28,479,870\n \nAdditions during period:\nAcquisitions\n1,817,275\n \n1,437,729\n \n460,959\n \nCapital expenditures\n560,006\n \n645,596\n \n443,710\n \nDeductions during period:\nForeign currency translation\n(\n287,505\n)\n90,105\n \n(\n265,942\n)\nOther \n(1)\n(\n425,563\n)\n(\n776,041\n)\n(\n350,188\n)\nBalance at end of period\n$\n31,830,011\n \n$\n30,165,798\n \n$\n28,768,409\n \nAccumulated depreciation:\n \n \n \nBalance at beginning of period\n$\n9,016,173\n \n$\n8,231,160\n \n$\n7,433,480\n \nAdditions during period:\nDepreciation expense\n1,015,531\n \n937,767\n \n907,134\n \nDispositions:\nSales and/or transfers to assets held for sale\n(\n115,981\n)\n(\n190,666\n)\n(\n72,047\n)\nForeign currency translation\n(\n76,185\n)\n37,912\n \n(\n37,407\n)\nBalance at end of period\n$\n9,839,538\n \n$\n9,016,173\n \n$\n8,231,160\n \n______________________________\n(1)\nOther may include sales, transfers to assets held for sale and impairments.\n124\nVENTAS, INC.\nSCHEDULE III - REAL ESTATE AND ACCUMULATED DEPRECIATION\nDecember 31, 2024 \n(Dollars in thousands\n)\n \n \nInitial Cost to Company\nGross Amount Carried\nat Close of Period\n \n \n \nDescription\nCount\nEncumbrances\nLand and\nImprovements\nBuildings and\nImprovements\nCosts\nCapitalized\nSubsequent to \nAcquisition \n(1)\nLand and\nImprovements\nBuildings and\nImprovements\nTotal\nAccumulated\nDepreciation\nNet Book Value\nYear of\nConstruction\nYear\nAcquired\nLife on which\nDepreciation\nIn Income Statement is  Computed\nUNITED STATES PROPERTIES\nSenior Housing\n \nAtria Senior Living\n168 \n$\n808,973\n \n$\n511,890\n \n$\n4,640,742\n \n$\n759,032\n \n$\n542,415\n \n$\n5,369,249\n \n$\n5,911,664\n \n$\n2,018,616\n \n$\n3,893,048\n \n1860 - 2013\n2007 - 2021\n13 - 54 years\nBrookdale Senior Living\n129 \n48,040\n \n190,091\n \n1,860,167\n \n131,497\n \n190,698\n \n1,991,057\n \n2,181,755\n \n1,066,193\n \n1,115,563\n \n1915 - 2012\n2004 - 2021\n24 - 35 years\nSunrise Senior Living\n86 \n41,372\n \n210,207\n \n2,331,589\n \n275,821\n \n223,688\n \n2,593,930\n \n2,817,617\n \n1,194,960\n \n1,622,657\n \n1985 - 2009\n2007 - 2021\n17 - 35 years\nSinceri Senior Living\n40 \n—\n \n74,077\n \n693,443\n \n83,227\n \n76,113\n \n774,634\n \n850,747\n \n278,086\n \n572,661\n \n1974 - 2017\n2006 - 2024\n35 - 35 years\nDiscovery Senior Living\n34 \n27,964\n \n72,430\n \n659,902\n \n53,549\n \n73,629\n \n712,253\n \n785,881\n \n168,124\n \n617,758\n \n1984 - 2020\n2006 - 2024\n24 - 35 years\nPriority Life Care Properties\n32 \n37,954\n \n47,010\n \n445,682\n \n68,896\n \n48,199\n \n513,388\n \n561,588\n \n179,116\n \n382,471\n \n1986 - 2009\n2006 - 2021\n29 - 51 years\nSodalis Senior Living\n30 \n—\n \n52,780\n \n441,080\n \n52,397\n \n53,402\n \n492,856\n \n546,257\n \n162,765\n \n383,492\n \n1987 - 2009\n2006 - 2021\n14 - 47 years\nGrace Management\n26 \n17,662\n \n98,083\n \n655,799\n \n13,278\n \n98,082\n \n669,078\n \n767,160\n \n28,040\n \n739,120\n \n1985 - 2016\n2011 - 2024\n12 - 39 years\nKoelsch Senior Communities\n19 \n64,403\n \n27,721\n \n292,414\n \n13,289\n \n28,133\n \n305,291\n \n333,424\n \n83,674\n \n249,750\n \n1972 - 2014\n2011 - 2017\n35 - 35 years\nSenior Lifestyle\n16 \n—\n \n55,911\n \n553,261\n \n27,969\n \n57,328\n \n579,813\n \n637,141\n \n76,081\n \n561,059\n \n1982 - 2012\n2011 - 2023\n33 - 35 years\nMeridian Senior Living\n14 \n—\n \n19,090\n \n104,237\n \n2,025\n \n19,091\n \n106,261\n \n125,352\n \n29,308\n \n96,044\n \n1972 - 2012\n2011 - 2023\n35 - 35 years\nSonida Senior Living\n13 \n12,401\n \n18,129\n \n197,928\n \n38,816\n \n18,833\n \n236,040\n \n254,873\n \n89,332\n \n165,541\n \n1979 - 2006\n2005 - 2021\n35 - 47 years\nAzura Memory Care\n13 \n—\n \n6,361\n \n53,002\n \n7,193\n \n7,200\n \n59,356\n \n66,556\n \n24,560\n \n41,996\n \n1990 - 2019\n2011 - 2019\n35 - 35 years\nMilestone Retirement Communities\n11 \n—\n \n16,810\n \n183,225\n \n20,049\n \n16,903\n \n203,181\n \n220,084\n \n60,488\n \n159,596\n \n1965 - 2011\n2011 - 2014\n35 - 35 years\nAmerican House\n11 \n—\n \n5,438\n \n124,369\n \n20,905\n \n6,926\n \n143,786\n \n150,712\n \n65,038\n \n85,674\n \n1998 - 2000\n2006 - 2014\n35 - 35 years\nAvamere Family of Companies\n11 \n—\n \n20,407\n \n113,192\n \n13,817\n \n20,654\n \n126,763\n \n147,416\n \n50,780\n \n96,636\n \n1998 - 2014\n2011 - 2015\n35 - 35 years\nHawthorn Senior Living\n10 \n55,205\n \n35,668\n \n220,099\n \n19,542\n \n35,890\n \n239,418\n \n275,309\n \n34,035\n \n241,274\n \n1991 - 2008\n2021 - 2021\n27 - 50 years\nOther Senior Housing Operators\n75 \n91,351\n \n127,976\n \n1,258,229\n \n44,351\n \n127,606\n \n1,302,947\n \n1,430,555\n \n294,791\n \n1,135,768\n \n1972 - 2021\n2004 - 2024\n11 - 35 years\nOther Senior Housing\n—\n \n—\n \n165\n \n—\n \n—\n \n165\n \n165\n \n—\n \n165\n \nTotal Senior Housing\n738\n \n1,205,325\n \n1,590,079\n \n14,828,525\n \n1,645,653\n \n1,644,790\n \n16,419,466\n \n18,064,256\n \n5,903,987\n \n12,160,273\n \nOutpatient Medical Buildings\nLillibridge\n215 \n24,760\n \n165,132\n \n2,113,822\n \n683,332\n \n170,334\n \n2,791,952\n \n2,962,286\n \n1,223,597\n \n1,738,689\n \n1960 - 2016\n2004 - 2023\n4 - 39 years\nPMB RES\n40 \n238,007\n \n80,638\n \n975,535\n \n198,377\n \n82,416\n \n1,172,134\n \n1,254,550\n \n433,324\n \n821,226\n \n1968 - 2024\n2011 - 2023\n19 - 35 years\nCornerstone Companies, Inc.\n26 \n—\n \n28,336\n \n156,018\n \n3,636\n \n28,417\n \n159,573\n \n187,990\n \n11,531\n \n176,459\n \n1975 - 2012\n2023 - 2023\n35 - 35 years\nArdent Health Services\n19 \n—\n \n5,638\n \n214,808\n \n599\n \n5,638\n \n215,408\n \n221,045\n \n20,329\n \n200,716\n \n1974 - 2011\n2018 - 2022\n35 - 35 years\nMemorial Health System\n12 \n—\n \n2,346\n \n25,031\n \n13,169\n \n2,453\n \n38,093\n \n40,546\n \n24,592\n \n15,954\n \n1976 - 2003\n2010 - 2010\n35 - 35 years\nOther Medical Buildings Operators\n85 \n10,805\n \n133,897\n \n1,033,609\n \n55,493\n \n131,098\n \n1,091,901\n \n1,222,999\n \n371,341\n \n851,658\n \n1954 - 2019\n2004 - 2023\n25 - 35 years\nOther Medical Buildings \n—\n \n—\n \n—\n \n5,655\n \n3,644\n \n2,011\n \n5,655\n \n2,363\n \n3,292\n \nTotal Outpatient Medical Buildings\n397\n \n273,572\n \n415,987\n \n4,518,823\n \n960,261\n \n424,000\n \n5,471,072\n \n5,895,071\n \n2,087,077\n \n3,807,994\n \n125\n \n \nInitial Cost to Company\nGross Amount Carried\nat Close of Period\n \n \n \nDescription\nCount\nEncumbrances\nLand and\nImprovements\nBuildings and\nImprovements\nCosts\nCapitalized\nSubsequent to \nAcquisition \n(1)\nLand and\nImprovements\nBuildings and\nImprovements\nTotal\nAccumulated\nDepreciation\nNet Book Value\nYear of\nConstruction\nYear\nAcquired\nLife on which\nDepreciation\nIn Income Statement is  Computed\nResearch\nWexford\n27 \n227,600\n \n71,764\n \n1,429,367\n \n55,798\n \n71,002\n \n1,485,927\n \n1,556,929\n \n381,547\n \n1,175,382\n \n1900 - 2019\n2016 - 2022\n15 - 60 years\nOther Research Operators\n2 \n—\n \n1,194\n \n76,515\n \n290\n \n1,193\n \n76,806\n \n77,999\n \n12,334\n \n65,665\n \n2010 - 2016\n2020 - 2020\n35 - 35 years\nOther Research \n71,695\n \n—\n \n11,328\n \n258,172\n \n69,458\n \n200,042\n \n269,500\n \n8,764\n \n260,736\n \nTotal Research\n29\n \n299,295\n \n72,958\n \n1,517,210\n \n314,260\n \n141,653\n \n1,762,775\n \n1,904,428\n \n402,645\n \n1,501,783\n \nIRFs & LTACs\nKindred Healthcare\n34 \n—\n \n86,024\n \n348,554\n \n(\n660\n)\n85,027\n \n348,890\n \n433,917\n \n212,065\n \n221,852\n \n1949 - 2008\n1998 - 2024\n20 - 40 years\nOther IRFs & LTACs\n14 \n—\n \n18,641\n \n198,449\n \n1,070\n \n18,644\n \n199,517\n \n218,160\n \n56,594\n \n161,567\n \n1989 - 2013\n2011 - 2023\n35 - 36 years\nTotal IRFs & LTACs\n48\n \n—\n \n104,665\n \n547,003\n \n410\n \n103,671\n \n548,407\n \n652,077\n \n268,659\n \n383,419\n \nOther Healthcare Facilities\nArdent Health Services\n10 \n—\n \n98,428\n \n1,126,010\n \n78,106\n \n97,416\n \n1,205,128\n \n1,302,544\n \n321,882\n \n980,663\n \n1928 - 2020\n2018 - 2022\n35 - 35 years\nSkilled Nursing\nGenesis Healthcare\n12 \n—\n \n11,350\n \n164,745\n \n(\n5,708\n)\n11,350\n \n159,037\n \n170,387\n \n82,117\n \n88,270\n \n1948 - 1995\n2004 - 2011\n30 - 35 years\nOther Skilled Nursing Operators\n22 \n—\n \n31,502\n \n192,512\n \n(\n22,707\n)\n31,683\n \n169,624\n \n201,307\n \n26,933\n \n174,373\n \n1920 - 2000\n1998 - 2023\n29 - 40 years\nTotal Skilled Nursing\n34\n \n—\n \n42,852\n \n357,257\n \n(\n28,415\n)\n43,033\n \n328,661\n \n371,694\n \n109,050\n \n262,643\n \nCANADIAN PROPERTIES\nSenior Housing\nLe Groupe Maurice\n37 \n1,156,570\n \n162,989\n \n1,967,564\n \n(\n63,608\n)\n154,141\n \n1,912,804\n \n2,066,945\n \n240,019\n \n1,826,926\n \n2000 - 2024\n2019 - 2022\n40 - 60 years\nAtria Senior Living\n29 \n265,047\n \n75,553\n \n845,363\n \n(\n110,078\n)\n63,843\n \n746,995\n \n810,838\n \n272,953\n \n537,885\n \n1988 - 2008\n2014 - 2014\n35 - 35 years\nSunrise Senior Living\n12 \n—\n \n46,600\n \n418,821\n \n(\n83,373\n)\n36,994\n \n345,053\n \n382,048\n \n173,318\n \n208,730\n \n2001 - 2007\n2007 - 2007\n35 - 35 years\nOther Senior Housing Operators\n6 \n—\n \n25,172\n \n146,694\n \n(\n16,019\n)\n22,116\n \n133,732\n \n155,847\n \n14,841\n \n141,006\n \n2006 - 2019\n2021 - 2021\n35 - 35 years\nOther Senior Housing\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nTotal Senior Housing\n84\n \n1,421,617\n \n310,314\n \n3,378,442\n \n(\n273,078\n)\n277,094\n \n3,138,584\n \n3,415,678\n \n701,131\n \n2,714,547\n \nUNITED KINGDOM PROPERTIES\nSenior Housing\nCanford Healthcare Limited\n11 \n—\n \n40,481\n \n81,719\n \n(\n17,264\n)\n34,571\n \n70,365\n \n104,936\n \n20,674\n \n84,262\n \n1910 - 2014\n2015 - 2017\n40 - 40 years\nInternational Hospital\nSpire Healthcare\n3 \n—\n \n11,903\n \n136,628\n \n(\n29,206\n)\n9,562\n \n109,763\n \n119,325\n \n24,433\n \n94,892\n \n1980 - 1986\n2014 - 2014\n50 - 50 years\nTOTAL\n1,354\n \n$\n3,199,809\n \n$\n2,687,667\n \n$\n26,491,617\n \n$\n2,650,727\n \n$\n2,775,790\n \n$\n29,054,221\n \n$\n31,830,011\n \n$\n9,839,538\n \n$\n21,990,473\n \n______________________________\n(1)\n     Adjustments to basis included provisions for asset impairments, partial dispositions, costs capitalized subsequent to acquisitions and foreign currency translation adjustments.\n126\nVENTAS, INC.\nSCHEDULE IV - MORTGAGE LOANS ON REAL ESTATE\nDecember 31, 2024\n(Dollars in thousands)\nLocation\nInterest Rate\nFixed / Variable\nMaturity Date\nPeriodic Payment Terms\nPrior Liens\nFace Amount of Mortgages\nCarrying Amount of Mortgages \n(1)\nPrincipal Amount of Loans Subject to Delinquent Principal or Interest\nFirst mortgage relating to \ntwo\n senior housing properties located in:\nTexas\nLesser of 9.50% or Term SOFR plus \n5.00\n%\nVariable\n6/16/2025\nInterest only \n(3)\n$\n—\n \n$\n8,000\n \n$\n8,000\n \n$\n—\n \nFirst mortgage relating to \none\n senior housing property located in:\nIllinois\nGreater of 9.00% or Term SOFR plus \n4.50\n%\nVariable\n2/15/2026\nInterest only\n—\n \n1,285\n \n1,277\n \n—\n \nFirst mortgage relating to \ntwo\n senior housing properties located in:\nTennessee\nGreater of 9.00% or Term SOFR plus \n4.50\n%\nVariable\n4/23/2026\nInterest only\n—\n \n3,150\n \n3,100\n \n—\n \nFirst mortgage relating to \ntwo\n senior housing properties located in:\nSouth Carolina\nGreater of 9.00% or Term SOFR plus \n4.50\n%\nVariable\n5/21/2026\nInterest only\n—\n \n3,150\n \n3,095\n \n—\n \nFirst mortgage relating to \none\n senior housing property located in:\nWashington\nGreater of 10.25% or Term SOFR plus \n5.75\n%\nVariable\n9/20/2027\nInterest only \n(4)\n—\n \n109,000\n \n108,022\n \n—\n \nFirst mortgage relating to \none\n senior housing property located in:\nPennsylvania\nTerm SOFR plus \n3.75\n%\nVariable\n11/4/2027\nInterest and principal;  $\n19.2\nM balloon due at maturity \n(2)\n—\n \n19,978\n \n19,978\n \n—\n \nTotal\n$\n—\n \n$\n144,563\n \n$\n143,472\n \n$\n—\n \n______________________________\n(1)\n     For Federal income tax purposes, the aggregate cost of investments in mortgage loans on real estate is the carrying amount, as disclosed in the schedule.\n(2)\n     A prepayment premium of \n0\n% to\n3\n% is assessed on the outstanding principal balance depending on timing of prepayment and source of funds.\n(3)\n     This loan was originally scheduled to mature on June 16, 2024 and was extended to mature on June 15, 2025.\n(4)\n     A prepayment premium consisting of accelerated interest charged on the prepaid amount is assessed, as of the date of the prepayment, at the greater of the contract rate and the term SOFR forward curve through September 30, 2026. An exit fee is assessed at \n1\n%of the amount of principal prepaid.\nReconciliation of Mortgage Loans:\nYear Ended December 31,\n2024\n2023\n2022\nBeginning Balance\n$\n26,087\n \n$\n491,334\n \n$\n486,200\n \nAdditions:\nNew loans \n(1)\n115,359\n \n—\n \n25,247\n \nConstruction draws\n2,100\n \n835\n \n—\n \nTotal additions\n117,459\n \n835\n \n25,247\n \nDeductions:\nPrincipal repayments\n(\n74\n)\n—\n \n(\n113\n)\nConversions to real property\n—\n \n(\n486,082\n)\n—\n \nAllowance\n—\n \n20,000\n \n(\n20,000\n)\nTotal deductions\n(\n74\n)\n(\n466,082\n)\n(\n20,113\n)\nEffect of foreign currency translation \n—\n \n—\n \n—\n \nEnding Balance\n$\n143,472\n \n$\n26,087\n \n$\n491,334\n \n______________________________\n(1)\n     New loans include $\n7.5\n million received as non-cash consideration for properties sold in 2024.\n127\nITEM 9.    \nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure\n    None.\nITEM 9A.  \nControls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs required by Rules 13a-15(b) and 15d-15(b) of the Exchange Act, our management, with the participation of our Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of our disclosure controls and procedures as of December 31, 2024. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) were effective as of December 31, 2024, at the reasonable assurance level.\nInternal Control over Financial Reporting\nThe information set forth under “Management Report on Internal Control over Financial Reporting” and “Report of Independent Registered Public Accounting Firm on Internal Control over Financial Reporting” included in Part II, Item 8 of this Annual Report is incorporated by reference into this Item 9A.\nInternal Control Changes\nDuring the fourth quarter of 2024, there were no changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nITEM 9B.  \nOther Information\nDuring the three months ended December 31, 2024, none of our directors or officers (as defined in Rule 16a-1(f) of the Securities Exchange Act of 1934, as amended) \nadopted\n, \nterminated\n or modified a Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement (as such terms are defined in Item 408 of Regulation S-K).\nITEM 9C.  \nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNone.\n128\nPART III\nITEM 10.    \nDirectors, Executive Officers and Corporate Governance\nThe information required by this Item 10 is incorporated by reference to our definitive Proxy Statement for the 2025 Annual Meeting of Stockholders, which we will file with the SEC not later than April 30, 2025.\nITEM 11.    \nExecutive Compensation\nThe information required by this Item 11 is incorporated by reference to our definitive Proxy Statement for the 2025 Annual Meeting of Stockholders, which we will file with the SEC not later than April 30, 2025.\nITEM 12.    \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item 12 is incorporated by reference to our definitive Proxy Statement for the 2025 Annual Meeting of Stockholders, which we will file with the SEC not later than April 30, 2025.\nITEM 13.    \nCertain Relationships and Related Transactions, and Director Independence\n    \nThe information required by this Item 13 is incorporated by reference to our definitive Proxy Statement for the 2025 Annual Meeting of Stockholders, which we will file with the SEC not later than April 30, 2025.\nITEM 14.    \nPrincipal Accountant Fees and Services\nThe information required by this Item 14 is incorporated by reference to our definitive Proxy Statement for the 2025 Annual Meeting of Stockholders, which we will file with the SEC not later than April 30, 2025.\n129\nPART IV\nITEM 15.    \nExhibits and Financial Statement Schedules\nFinancial Statements and Financial Statement Schedules\nThe following documents have been included in Part II, Item 8 of this Annual Report on Form 10-K:\n \nPage\nReports of Independent Registered Public Accounting Firm\n73\nConsolidated Balance Sheets as of December 31, 202\n4\n and 20\n23\n76\nConsolidated Statements of Income for the Years Ended December 31, 202\n4\n, 202\n3\n and 20\n2\n2\n77\nConsolidated Statements of Comprehensive Income for the Years Ended December 31, 202\n4\n, 202\n3\n and 20\n2\n2\n78\nConsolidated Statements of Equity for the Years Ended December 31, 202\n4\n, 202\n3\n and 20\n2\n2\n79\nConsolidated Statements of Cash Flows for the Years Ended December 31, 202\n4\n, 202\n3\n and 20\n2\n2\n80\nNotes to Consolidated Financial Statements\n82\nConsolidated Financial Statement Schedules\n \nSchedule III — Real Estate and Accumulated Depreciation\n124\nSchedule IV — Mortgage Loans on Real Estate\n127\nAll other schedules have been omitted because they are inapplicable or not required or the information is included elsewhere in the Consolidated Financial Statements or notes thereto.\n130\nEXHIBITS\nExhibit\nNumber\nDescription of Document\nLocation of Document\n2.1\nAgreement and Plan of Merger, dated as of June 28, 2021, by and among Ventas, Inc., Cadence Merger Sub LLC and New Senior Investment Group Inc.\nIncorporated by reference herein.  Previously filed as Exhibit 2.1 to our Current Report on Form 8-K, filed on June 28, 2021, File No. 001-10989.\n3.1\nAmended and Restated Certificate of Incorporation, as amended, of Ventas, Inc.\nIncorporated by reference herein.  Previously filed as Exhibit 3.1 to our Quarterly Report on Form 10-Q for the quarter ended June 30, 2011, filed on August 5, 2011, File No. 001-10989.\n \n \n3.2\nSixth Amended and Restated Bylaws, as amended, of Ventas, Inc.\nIncorporated by reference herein.  Previously filed as Exhibit 3.1 to our Current Report on Form 8-K, filed on June 1, 2022, File No. 001-10989.\n \n \n4.1\nSpecimen common stock certificate.\nIncorporated by reference herein.  Previously filed as Exhibit 4.1 to our Annual Report on Form 10-K for the fiscal year ended December 31, 2015, filed on February 12, 2016, File No. 001-10989.\n4.2\nIndenture dated as of September 26, 2013 by and among Ventas, Inc., Ventas Realty, Limited Partnership, as Issuer, the Guarantors named therein, as Guarantors, and U.S. Bank National Association, as Trustee.\nIncorporated by reference herein.  Previously filed as Exhibit 4.10 to our Annual Report on Form 10-K for the year ended December 31, 2016, filed on February 14, 2017, File No. 001-10989.\n4.3\nSecond Supplemental Indenture dated as of September 26, 2013 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor, and U.S. Bank National Association, as Trustee, relating to the 5.700% Senior Notes due 2043.\nIncorporated by reference herein.  Previously filed as Exhibit 4.3 to our Current Report on Form 8-K, filed on September 26, 2013, File No. 001-10989.\n4\n.4\nFifth Supplemental Indenture dated as of January 14, 2015 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor, and U.S. Bank National Association, as Trustee, relating to the 3.500% Senior Notes due 2025.\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on January 14, 2015, File No. 001-10989.\n4\n.5\nSixth Supplemental Indenture dated as of January 14, 2015 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor, and U.S. Bank National Association, as Trustee, relating to the 4.375% Senior Notes due 2045.\nIncorporated by reference herein.  Previously filed as Exhibit 4.3 to our Current Report on Form 8-K, filed on January 14, 2015, File No. 001-10989.\n4.6\nIndenture dated as September 24, 2014 by and among Ventas, Inc., Ventas Canada Finance Limited, the Guarantors parties thereto from time to time and Computershare Trust Company of Canada, as Trustee.\nIncorporated by reference herein.  Previously filed as Exhibit 4.1 to our Quarterly Report on Form 10-Q for the quarter ended September 30, 2014, filed on October 24, 2014, File No. 001-10989.\n4.7\nSeventh Supplemental Indenture dated as of December 1, 2021 by and among Ventas Canada Finance Limited, as Issuer, Ventas, Inc., as Guarantor, and Computershare Trust Company of Canada, as Trustee, relating to the 2.45% Senior Notes, Series G due 2027.\nIncorporated by reference herein. Previously filed as Exhibit 4.14 to our Annual Report on Form 10-K for the year ended December 31, 2021, filed on February 18, 2022, File No. 001-10989.\n4.8\nEighth Supplemental Indenture dated as of December 1, 2021 by and among Ventas Canada Finance Limited, as Issuer, Ventas, Inc., as Guarantor, and Computershare Trust Company of Canada, as Trustee, relating to the 3.30% Senior Notes, Series H due 2031.\nIncorporated by reference herein. Previously filed as Exhibit 4.15 to our Annual Report on Form 10-K for the year ended December 31, 2021, filed on February 18, 2022, File No. 001-10989.\n4.9\nNinth Supplemental Indenture dated as of April 21, 2023 by and among Ventas Canada Finance Limited, as Issuer, Ventas, Inc., as Guarantor, and Computershare Trust Company of Canada, as Trustee, relating to the 5.398% Senior Notes, Series I due 2028.\nIncorporated by reference herein. Previously filed as Exhibit 4.1 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2023, filed on May 9, 2023, File No. 001-10989.\n4.10\nEighth Supplemental Indenture dated as of December 1, 2021 by and among Ventas Canada Finance Limited, as Issuer, Ventas, Inc., as Guarantor, and Computershare Trust Company of Canada, as Trustee, relating to the 3.30% Senior Notes, Series H due 2031.\nIncorporated by reference herein. Previously filed as Exhibit 4.15 to our Annual Report on Form 10-K for the year ended December 31, 2021, filed on February 18, 2022, File No. 001-10989.\n131\nExhibit\nNumber\nDescription of Document\nLocation of Document\n4.11\nTenth Supplemental Indenture dated as of March 5, 2024 by and among Ventas Canada Finance Limited, as Issuer, Ventas, Inc., as Guarantor, and Computershare Trust Company of Canada, as Trustee, relating to the 5.10% Senior Notes, Series J due 2029.\nIncorporated by reference herein. Previously filed as Exhibit 4.1 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2024, filed on May 2, 2024, File No. 001-10989.\n4.12\nIndenture dated as of July 16, 2015 by and among Ventas, Inc., Ventas Realty, Limited Partnership, as Issuer, the Guarantors named therein as Guarantors, and U.S. Bank National Association, as Trustee.\nIncorporated by reference herein.  Previously filed as Exhibit 4.1 to our Current Report on Form 8-K, filed on July 16, 2015, File No. 001-10989.\n4.13\nFirst Supplemental Indenture dated as of July 16, 2015 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas Inc., as Guarantor, and U.S. Bank National Association, as Trustee, relating to the 4.125% Senior Notes due 2026.\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on July 16, 2015, File No. 001-10989.\n4.14\nThird Supplemental Indenture dated as of September 21, 2016 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas Inc., as Guarantor, and U.S. Bank National Association, as Trustee, relating to the 3.250% Senior Notes due 2026.\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on September 21, 2016, File No. 001-10989.\n4.15\nFourth Supplemental Indenture dated as of March 29, 2017 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor, and U.S. Bank National Association, as Trustee, relating to the 3.850% Senior Notes due 2027.\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on March 29, 2017, File No. 001-10989.\n4.16\nIndenture dated February 23, 2018 among Ventas, Inc., Ventas Realty, Limited Partnership, the Guarantors named therein, and U.S. Bank National Association, as Trustee\nIncorporated by reference herein.  Previously filed as Exhibit 4.1 to our Current Report on Form 8-K, filed on February 23, 2018, File No. 001-10989.\n4.17\nFirst Supplemental Indenture dated as of February 23, 2018 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor and U.S. Bank National Association, as Trustee relating to the 4.000% Senior Notes due 2028\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on February 23, 2018, File No. 001-10989.\n4.18\nSecond Supplemental Indenture dated as of August 15, 2018 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor and U.S. Bank National Association, as Trustee relating to the 4.400% Senior Notes due 2029\nIncorporated by reference herein. Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on August 15, 2018, File No. 001-10989.\n4.19\nThird Supplemental Indenture dated as of February 26, 2019 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor and U.S. Bank National Association, as Trustee relating to the 3.500% Senior Notes due 2024 and 4.875% Senior Notes due 2049\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on February 26, 2019, File No. 001-10989.\n4.20\nFourth Supplemental Indenture dated as of July 3, 2019 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor and U.S. Bank National Association, as Trustee relating to the 2.650% Senior Notes due 2025\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on July 3, 2019, File No. 001-10989.\n4.21\nFifth Supplemental Indenture dated as of August 21, 2019 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor and U.S. Bank National Association, as Trustee relating to the 3.000% Senior Notes due 2030\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on August 21, 2019, File No. 001-10989.\n4.22\nSixth Supplemental Indenture dated as of April 1, 2020 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor and U.S. Bank National Association, as Trustee relating to the 4.750% Senior Notes due 2030.\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on April 1, 2020, File No. 001-10989.\n132\nExhibit\nNumber\nDescription of Document\nLocation of Document\n4.23\nSeventh Supplemental Indenture dated as of August 20, 2021 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor and U.S. Bank National Association, as Trustee relating to the 2.500% Senior Notes due 2031.\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on August 20, 2021, File No. 001-10989.\n4.24\nEighth Supplemental Indenture dated as of May 13, 2024 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor and U.S. Bank National Association, as Trustee relating to the 5.625% Senior Notes due 2034.\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on May 13, 2024, File No. 001-10989.\n4.25\nNinth Supplemental Indenture dated as of September 9, 2024 by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor and U.S. Bank National Association, as Trustee relating to the 5.000% Senior Notes due 2035.\nIncorporated by reference herein.  Previously filed as Exhibit 4.2 to our Current Report on Form 8-K, filed on August 20, 2021, File No. 001-10989.\n4.26\nIndenture dated as of June 13, 2023, by and among Ventas Realty, Limited Partnership, as Issuer, Ventas, Inc., as Guarantor, and U.S. Bank Trust Company, National Association, as Trustee, relating to the 3.75% Exchangeable Senior Notes due 2026.\nIncorporated by reference herein. Previously filed as Exhibit 4.1 to our Current Report on Form 8-K, filed on June 13, 2023, File No. 001-10989.\n4.27\nDescription of the Registrant’s Securities.\nFiled herewith.\nPursuant to Item 601(b)(4)(iii)(A) of Regulation S-K, the Company has not filed as an exhibit to this Form 10-K certain instruments defining the rights of the holders of certain additional long-term debt of the Company and its subsidiaries, none of which authorize a total amount of indebtedness in excess of 10% of the total assets of the Company and its subsidiaries on a consolidated basis. The Company agrees to furnish a copy of any of these agreements to the SEC upon request.\n10.1\nFirst Amended and Restated Agreement of Limited Partnership of Ventas Realty, Limited Partnership.\nIncorporated by reference herein.  Previously filed as Exhibit 3.5 to our Registration Statement on Form S-4, as amended, filed on May 29, 2002, File No. 333-89312.\n10.2\nCredit and Guaranty Agreement, dated as of June 27, 2022, among Ventas Realty, Limited Partnership, a Delaware limited partnership, as borrower, Ventas, Inc., a Delaware corporation, as guarantor, the lending institutions party thereto from time to time, and Bank of America, N.A., as Administrative Agent.\nIncorporated by reference herein.  Previously filed as Exhibit 10.1 to our Current Report on Form 8-K, filed on June 30, 2022, File No. 001-10989\n10.3\nFourth Amended and Restated Credit and Guaranty Agreement, dated as of April 24, 2024, among Ventas Realty, Limited Partnership, Ventas SSL Ontario II, Inc., Ventas Canada Finance Limited, Ventas UK Finance, Inc., and Ventas Euro Finance, LLC, as Borrowers, Ventas, Inc., as Guarantor, the Lenders identified therein, Bank of America, N.A., as Administrative Agent, and Bank of America, N.A.,  JPMorgan Chase Bank, N.A. and Wells Fargo Bank, National Association, as L/C Issuers.\nIncorporated by reference herein. Previously filed as Exhibit 10.1 to our Current Report on Form 8-K, filed on April 24, 2024, File No. 001-10989.\n1\n0.4\nCredit and Guaranty Agreement, dated as of September 6, 2023, among Ventas Realty, Limited Partnership, a Delaware limited partnership, as borrower, Ventas, Inc., a Delaware corporation, as guarantor, the lending institutions party thereto from time to time, and Bank of America, N.A., as Administrative Agent.\nIncorporated by reference herein. Previously filed as Exhibit 10.1 to our Current Report on Form 8-K, filed on September 12, 2023, File No. 001-10989.\n10.\n5\nATM Sales Agreement, dated September 18, 2024, among Ventas, Inc. and the Agents and Forward Purchasers named therein.\nIncorporated by reference herein.\n \nPreviously filed as Exhibit 1.1 to our Current Report on Form 8-K, filed on September 18, 2024, File No. 001-10989.\n133\nExhibit\nNumber\nDescription of Document\nLocation of Document\n10.6\nCooperation Agreement, dated March 4, 2024, among Ventas, Inc. and Land & Buildings Investment Management, LLC and certain of its affiliates.\nIncorporated by reference herein. Previously filed as Exhibit 10.1 to our Current Report on Form 8-K, filed on March 4, 2024, File No. 001-10989.\n10\n.\n7\n.1*\nVentas, Inc. 2006 Stock Plan for Directors, as amended.\nIncorporated by reference herein.  Previously filed as Exhibit 10.1 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2012, filed on April 27, 2012, File No. 001-10989.\n10.\n7\n.2*\nForm of Restricted Stock Unit Agreement—2006 Stock Plan for Directors.\nIncorporated by reference herein.  Previously filed as Exhibit 10.11.4 to our Annual Report on Form 10-K for the year ended December 31, 2008, filed on February 27, 2009, File No. 001-10989.\n10.\n8\n.1*\nVentas, Inc. 2012 Incentive Plan.\nIncorporated by reference herein.  Previously filed as Exhibit 10.1 to our Current Report on Form 8-K, filed on May 23, 2012, File No. 001-10989.\n10.\n8\n.2*\nFirst Amendment to the Ventas, Inc. 2012 Incentive Plan.\nIncorporated by reference herein.  Previously filed as Exhibit 10.10.7 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2017, filed on April 28, 2017, File No. 001-10989.\n10.\n8\n.3*\nForm of Stock Option Agreement (Employees) under the Ventas, Inc. 2012 Incentive Plan.\nIncorporated by reference herein.  Previously filed as Exhibit 10.6.2 to our Annual Report on Form 10-K for the year ended December 31, 2014, filed February 13, 2015, File No. 001-10989.\n10.\n8\n.4*\nForm of Restricted Stock Agreement (Directors) under the Ventas, Inc. 2012 Incentive Plan.\nIncorporated by reference herein.  Previously filed as Exhibit 10.5 to our Registration Form on S-8, filed on August 7, 2012, File No. 333-183121.\n10.\n8\n.5*\nForm of Restricted Stock Unit Agreement (Directors) under the Ventas, Inc. 2012 Incentive Plan.\nIncorporated by reference herein.  Previously filed as Exhibit 10.6 to our Registration Form on S-8, filed on August 7, 2012, File No. 333-183121.\n10.\n8\n.6*\nForm of Performance-Based Restricted Stock Unit Agreement (CEO) under the Ventas, Inc. 2012 Incentive Plan.\nIncorporated by reference herein.  Previously filed as Exhibit 10.10.8 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2017, filed on April 28, 2017, File No. 001-10989.\n10.\n8\n.7*\nForm of Restricted Stock Unit Agreement (CEO) under the Ventas, Inc. 2012 Incentive Plan.\nIncorporated by reference herein.  Previously filed as Exhibit 10.10.9 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2017, filed on April 28, 2017, File No. 001-10989.\n10.\n8\n.8*\nForm of Performance-Based Restricted Stock Unit Agreement (Non-CEO) under the Ventas, Inc. 2012 Incentive Plan.\nIncorporated by reference herein.  Previously filed as Exhibit 10.10.11 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2017, filed on April 28, 2017, File No. 001-10989.\n10.\n8\n.9*\nForm of Restricted Stock Unit Agreement (Non-CEO) under the Ventas, Inc. 2012 Incentive Plan.\nIncorporated by reference herein.  Previously filed as Exhibit 10.10.12 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2017, filed on April 28, 2017, File No. 001-10989.\n \n \n \n10.\n9\n.1*\nVentas, Inc. Non-Employee Directors’ Cash Compensation Deferral Plan (formerly the “Ventas Nonemployee Directors’ Deferred Stock Compensation Plan”)\nIncorporated by reference herein.  Previously filed as Exhibit 10.10.1 to our Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 10, 2023, File No. 001-10989.\n10.\n9\n.2*\nDeferral Election Form under the Ventas Nonemployee Directors’ Deferred Stock Compensation Plan (used prior to December 2022)\nIncorporated by reference herein.  Previously filed as Exhibit 10.13.2 to our Annual Report on Form 10-K for the year ended December 31, 2008, filed on February 27, 2009, File No. 001-10989.\n \n \n \n10.\n9\n.3*\nDeferral Election Form under the Ventas, Inc. Non-Employee Directors’ Cash Compensation Deferral Plan.\nIncorporated by reference herein.  Previously filed as Exhibit 10.10.3 to our Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 10, 2023, File No. 001-10989\n134\nExhibit\nNumber\nDescription of Document\nLocation of Document\n10.1\n0\n.1*\nVentas, Inc. 2022 Incentive Plan\nIncorporated by reference herein. Previously filed as Exhibit 10.1 to our Quarterly Report on Form 10-Q filed on August 5, 2022, File No. 001-10989.\n10.1\n0\n.2*\nVentas, Inc. Non-Employee Directors’ Equity Award Deferral Program Adopted Pursuant to the Ventas, Inc. 2022 Incentive Plan\nIncorporated by reference herein.  Previously filed as Exhibit 10.11.2 to our Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 10, 2023, File No. 001-10989.\n10.1\n0\n.3*\nDeferral Election Form under the Ventas, Inc. Non-Employee Directors’ Equity Award Deferral Program\nIncorporated by reference herein.  Previously filed as Exhibit 10.11.3 to our Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 10, 2023, File No. 001-10989.\n10.1\n0\n.4*\nRestricted Stock Award granted to Sumit Roy on October 1, 2022 under the Ventas, Inc. 2022 Incentive Plan\nIncorporated by reference herein.  Previously filed as Exhibit 10.11.4 to our Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 10, 2023, File No. 001-10989.\n10.1\n0\n.5*\nForm of Restricted Stock Unit Award under the Ventas, Inc. 2022 Incentive Plan (Non-Employee Directors)\nIncorporated by reference herein.  Previously filed as Exhibit 10.11.5 to our Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 10, 2023, File No. 001-10989.\n10.1\n0\n.6*\nForm of Restricted Stock Unit Agreement under the Ventas, Inc. 2022 Incentive Plan (CEO)\nIncorporated by reference herein.  Previously filed as Exhibit 10.11.6 to our Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 10, 2023, File No. 001-10989.\n10.1\n0\n.7*\nForm of Performance Share Unit Agreement under the Ventas, Inc. 2022 Incentive Plan (CEO)\nIncorporated by reference herein.  Previously filed as Exhibit 10.11.7 to our Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 10, 2023, File No. 001-10989.\n10.1\n0\n.8*\nForm of Restricted Stock Unit Award under the Ventas, Inc. 2022 Incentive Plan (non-CEO Executive Officer)\nIncorporated by reference herein.  Previously filed as Exhibit 10.11.8 to our Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 10, 2023, File No. 001-10989.\n10.1\n0\n.9*\nForm of Performance Share Unit Award under the Ventas, Inc. 2022 Incentive Plan (non-CEO Executive Officer)\nIncorporated by reference herein.  Previously filed as Exhibit 10.11.9 to our Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 10, 2023, File No. 001-10989.\n10.1\n1\n*\nSecond Amended and Restated Employment Agreement dated as of March 22, 2011 between Ventas, Inc. and Debra A. Cafaro.\nIncorporated by reference herein.  Previously filed as Exhibit 10.1 to our Current Report on Form 8-K, filed on March 24, 2011, File No. 001-10989.\n \n \n \n10.1\n2\n.1*\nOffer Letter dated September 16, 2014 from Ventas, Inc. to Robert F. Probst.\nIncorporated by reference herein.  Previously filed as Exhibit 10.1 to our Current Report on Form 8-K, filed on September 29, 2014, File No. 001-10989.\n \n \n10.1\n2\n.2*\nEmployee Protection and Noncompetition Agreement dated September 16, 2014 between Ventas, Inc. and Robert F. Probst.\nIncorporated by reference herein.  Previously filed as Exhibit 10.2 to our Current Report on Form 8-K, filed on September 29, 2014, File No. 001-10989.\n \n10.1\n2\n.3*\nAmendment dated December 8, 2017 to Employee Protection and Noncompetition Agreement dated as of September 16, 2014 between Ventas, Inc. and Robert F. Probst.\nIncorporated by reference herein. Previously filed as Exhibit 10.17.3 to our Annual Report on Form 10-K for the year ended December 31, 2017, filed on February 9, 2018, File No. 001-10989.\n \n10.1\n3\n.1*\nOffer of Employment Term Sheet dated March 20, 2018 from Ventas, Inc. to Peter J. Bulgarelli.\nIncorporated by reference herein.  Previously filed as Exhibit 10.1.1 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2018, filed on April 27, 2018, File No. 001-10989.\n10.1\n3\n.2*\nEmployee Protection and Noncompetition Agreement dated March 20, 2018 between Ventas, Inc. and Peter J. Bulgarelli.\nIncorporated by reference herein.  Previously filed as Exhibit 10.1.2 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2018, filed on April 27, 2018, File No. 001-10989.\n135\nExhibit\nNumber\nDescription of Document\nLocation of Document\n10.1\n4\n.1*\nOffer Letter dated December 22, 2019 from Ventas, Inc. to Carey Shea Roberts.\nIncorporated by reference herein.\n \nPreviously filed as Exhibit 10.18.3 to our Annual Report on Form 10-K for the year ended December 31, 2020, filed on February 23, 2021, File No. 001-10989\n10.1\n4\n.2*\nEmployee Protection and Restrictive Covenants Agreement dated January 21, 2020 between Ventas, Inc. and Carey Shea Roberts.\nIncorporated by reference herein. Previously filed as Exhibit 10.2.1 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2020, filed on May 8, 2020, File No. 001-10989.\n10.1\n4\n.3*\nEmployment Bonus Agreement dated March 4, 2020 between Ventas, Inc. and Carey Shea Roberts. \nIncorporated by reference herein. Previously filed as Exhibit 10.2.2 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2020, filed on May 8, 2020, File No. 001-10989.\n10.1\n5\n.1*\nOffer Letter dated January 30, 2020 from Ventas, Inc. to J. Justin Hutchens.\nIncorporated by reference herein.\n \nPreviously filed as Exhibit 10.19.2 to our Annual Report on Form 10-K for the year ended December 31, 2020, filed on February 23, 2021, File No. 001-10989\n10.1\n5\n.2*\nEmployee Protection and Restrictive Covenants Agreement dated February 7, 2020 between Ventas, Inc. and J. Justin Hutchens.\nIncorporated by reference herein. Previously filed as Exhibit 10.3 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2020, filed on May 8, 2020, File No. 001-10989.\n10.1\n6\n*\nVentas Employee and Director Stock Purchase Plan, as amended.\nIncorporated by reference herein.  Previously filed as Exhibit 10.18 to our Annual Report on Form 10-K for the year ended December 31, 2008, filed on February 27, 2009, File No. 001-10989.\n1\n9\nVentas, Inc. Securities Trading Policy\nFiled herewith.\n21\nSubsidiaries of Ventas, Inc.\nFiled herewith.\n22\nList of Guarantors and Issuers of Guaranteed Securities.\nFiled herewith.\n23\nConsent of KPMG LLP.\nFiled herewith.\n31.1\nCertification of Debra A. Cafaro, Chairman and Chief Executive Officer, pursuant to Rule 13a-14(a) under the Exchange Act.\nFiled herewith.\n31.2\nCertification of Robert F. Probst, Executive Vice President and Chief Financial Officer, pursuant to Rule 13a-14(a) under the Exchange Act.\nFiled herewith.\n32.1\nCertification of Debra A. Cafaro, Chairman and Chief Executive Officer, pursuant to Rule 13a-14(b) under the Exchange Act and 18 U.S.C. 1350.\nFiled herewith.\n32.2\nCertification of Robert F. Probst, Executive Vice President and Chief Financial Officer, pursuant to Rule 13a-14(b) under the Exchange Act and 18 U.S.C. 1350.\nFiled herewith.\n97\nPolicy relating to recovery of erroneously awarded compensation.\nIncorporated by reference herein. Previously filed as Exhibit 97 to our Annual Report on Form 10-K for the year ended December 31, 2023, filed on February 15, 2024, File No. 001-10989.\n136\nExhibit\nNumber\nDescription of Document\nLocation of Document\n101\nThe following materials from the Company’s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in iXBRL (Inline Extensible Business Reporting Language): (i) Index to Consolidated Financial Statements and Financial Statement Schedules, including auditor information, (ii) the Consolidated Balance Sheets, (iii) the Consolidated Statements of Income, (iv) the Consolidated Statements of Comprehensive Income, (v) the Consolidated Statements of Equity, (vi) the Consolidated Statements of Cash Flows, (vii) Notes to the Consolidated Financial Statements (viii) Schedule III and IV.\nFiled herewith.\n104\nCover Page Interactive Data File (embedded within the Inline XBRL document).\nFiled herewith.\n*   Management contract or compensatory plan or arrangement required to be filed as an exhibit pursuant to Item 15(b) of Form 10-K.\nITEM 16.    \nForm 10-K Summary\n    None.\n137\nSIGNATURES\n    Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: February 13, 2025                                                                                                                                                                                                                                                                                                   \n \nVENTAS, INC.\n \nBy:\n/s/ DEBRA A. CAFARO\nDebra A. Cafaro\n Chairman and Chief Executive Officer\n    \nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this Report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\n138\nSignature\nTitle\nDate\n/s/ DEBRA A. CAFARO\nChairman and Chief Executive Officer                                 (Principal Executive Officer)\nFebruary 13, 2025\nDebra A. Cafaro\n/s/ ROBERT F. PROBST\nExecutive Vice President and Chief Financial Officer             (Principal Financial Officer)\nFebruary 13, 2025\nRobert F. Probst\n/s/ GREGORY R. LIEBBE\nSenior Vice President, Chief Accounting Officer and Controller (Principal Accounting Officer)\nFebruary 13, 2025\nGregory R. Liebbe\n/s/ MELODY C. BARNES\nDirector\nFebruary 13, 2025\nMelody C. Barnes\n/s/ THEODORE R. BIGMAN\nDirector\nFebruary 13, 2025\nTheodore R. Bigman\n/s/ MICHAEL J. EMBLER\nDirector\nFebruary 13, 2025\nMichael J. Embler\n/s/ MATTHEW J. LUSTIG\nDirector\nFebruary 13, 2025\nMatthew J. Lustig\n/s/ ROXANNE M. MARTINO\nDirector\nFebruary 13, 2025\nRoxanne M. Martino\n/s/ MARGUERITE M. NADER\nDirector\nFebruary 13, 2025\nMarguerite M. Nader\n/s/ SEAN P. NOLAN\nDirector\nFebruary 13, 2025\nSean P. Nolan\n/s/ WALTER C. RAKOWICH\nDirector\nFebruary 13, 2025\nWalter C. Rakowich\n/s/ JOE V. RODRIGUEZ, JR.\nDirector\nFebruary 13, 2025\nJoe V. Rodriguez, Jr.\n/s/ SUMIT ROY\nDirector\nFebruary 13, 2025\nSumit Roy\n/s/ MAURICE S. SMITH\nDirector\nFebruary 13, 2025\nMaurice S. Smith\n139"
  }
}