{
  "ticker": "VZ",
  "cik": "0000732712",
  "company_name": "VERIZON COMMUNICATIONS INC",
  "filing_date": "2025-02-12",
  "accession": "0000732712-25-000006",
  "primary_doc": "vz-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n114\nSignatures\n114\nCertifications\nTable of Contents\nPART I\nItem 1.    Business\nGeneral\nVerizon Communications Inc. (the Company) is a holding company that, acting through its subsidiaries (together with the Company, collectively, Verizon), is one of the world’s leading providers of communications, technology, information and streaming products and services to consumers, businesses and government entities. With a presence around the world, we offer data, video and voice services and solutions on our networks and platforms that are designed to meet customers’ demand for mobility, reliable network connectivity and security.\nWe have two reportable segments that we operate and manage as strategic business units - Verizon Consumer Group (Consumer) and Verizon Business Group (Business).\nVerizon Consumer Group\nOur Consumer segment provides consumer-focused wireless and wireline communications services and products. Our wireless services are provided across one of the most extensive wireless networks in the United States (U.S.) under the Verizon family of brands and through wholesale and other arrangements. We also provide fixed wireless access (FWA) broadband through our fifth-generation (5G) or fourth-generation (4G) Long-Term Evolution (LTE) networks as an alternative to traditional landline internet access. Our wireline services are provided in nine states in the Mid-Atlantic and Northeastern U.S., as well as Washington D.C., over our 100% fiber-optic network through our Verizon Fios product portfolio and over a traditional copper-based network to customers who are not served by Fios. \nIn 2024, the Consumer segment’s revenues were $102.9 billion, representing approximately 76% of Verizon’s consolidated revenues. As of December 31, 2024, Consumer had approximately 115 million wireless retail connections (including FWA), of which 83% are postpaid connections. In addition, at December 31, 2024, Consumer had approximately 10 million total broadband connections (which includes Fios internet, FWA and Digital Subscriber Line (DSL) connections), and approximately 3 million Fios video connections.\nVerizon Business Group\nOur Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and advanced communication services, corporate networking solutions, security and managed network services, local and long distance voice services and network access to deliver various Internet of Things (IoT) services and products. We provide these products and services to businesses, public sector customers and wireless and wireline carriers across the U.S. and a subset of these products and services to customers around the world. \nIn 2024, the Business segment's revenues were $29.5 billion, representing approximately 22% of Verizon’s consolidated revenues. As of December 31, 2024, Business had approximately 31 million wireless retail postpaid connections (including FWA) and approximately 2 million total broadband connections (which includes Fios internet, FWA and DSL connections).\nAdditional discussion of our reportable segments is included in Item 7 under the headings \"Management’s Discussion and Analysis of Financial Condition and Results of Operations — Overview\" and \"— Segment Results of Operations\" and in Note 13 to the consolidated financial statements included in this Annual Report.\nService and Product Offerings\nWireless Services and Equipment\nWe provide a wide variety of wireless services to Consumer and Business customers on different service plan options. \nOur Consumer Group offers customizable, personalized phone plans for retail customers, allowing them to design the plan that fits their needs, including access to their preferred content and services (which we call “perks”). We also offer plans for customers who want access to Verizon’s network at a lower price point, as well as discounts and special rate plans for qualifying customers. \nCustomers can obtain our wireless services on a postpaid or prepaid basis. Retail (non-wholesale) postpaid accounts primarily represent retail customers that are directly served and managed by Verizon and use Verizon branded services. A single account may include monthly wireless services for a variety of connected devices. Our postpaid service is generally billed one month in advance for a monthly access charge in return for access to and usage of network services. Our prepaid service is offered only to Consumer customers and enables individuals to obtain wireless services without credit verification by paying for all services in advance. As of December 31, 2024, we had 95 million postpaid connections and 20 million prepaid connections, representing approximately 83% and 17% of our Consumer wireless retail connections, respectively.\n4\nTable of Contents\n \nOur Business customers can choose from a variety of plans with different features to meet their specific needs.\nWe also provide FWA broadband through our 5G or 4G LTE wireless networks to our Consumer and Business customers. FWA enables fixed broadband access using radio frequencies instead of cables and can be used to connect homes and businesses to the internet. As of December 31, 2024, we had nearly 4.6 million FWA broadband connections.\nConsumer and Business offer several categories of wireless equipment to customers, including a variety of smartphones and other handsets, wireless-enabled internet devices, such as tablets, and other wireless-enabled connected devices, such as smart watches. Oftentimes, we offer promotional trade in offers to incentivize new customers or existing customer upgrades. Consumer wireless customers can acquire wireless equipment from us using device payment plans, which permit the customer to pay for the device in installments over time. Customers that activate service on devices purchased under the device payment program generally pay lower service fees as compared to those under our fixed-term service plans, and their device payment plan charge is included on their wireless monthly bill. While we no longer offer Consumer customers fixed-term subsidized service plans for devices, we continue to offer subsidized plans to our Business customers. We also continue to service existing plans for customers who have not yet purchased and activated devices under the Verizon device payment program.\nVerizon Consumer Group\nIn addition to wireless services and equipment for retail customers, the Consumer segment sells residential fixed connectivity solutions, including internet, video and voice services, and wireless network access to resellers on a wholesale basis. Consumer also provides non-connectivity services including device protection, content offerings, cloud storage, and other products.\nResidential fixed services \n– We provide residential fixed connectivity solutions to customers over our 100% fiber-optic network through our Verizon Fios product portfolio and over a traditional copper-based network to customers who are not served by Fios. We also provide FWA broadband through both 5G and 4G LTE home internet offerings, which are available in most states across the U.S.\nWe offer residential fixed services tailored to the needs of our customers with a variety of perk options and the flexibility to change them. Depending on customer needs at a particular time, our services may include features related to, among other things: internet access at different speed tiers using fiber-optic, copper or wireless technology; video services that may feature a variety of content and streaming options, video on demand products, cloud-based services and digital video recording capabilities; over-the-top (OTT) video services; voice services; and other home solutions. \nNetwork access services \n– We sell network access to mobile virtual network operators (MVNOs) on a wholesale basis, who in turn resell wireless service under their own brand(s) to consumers. \nVerizon Business Group \nIn addition to the wireless services and equipment discussed above, our Business segment provides a variety of wireless and wireline services and products, which are organized by the primary customer groups for these offerings: Enterprise and Public Sector, Business Markets and Other, and Wholesale.\nEnterprise and Public Sector\nEnterprise and Public Sector offers wireless products and services as well as wireline connectivity such as broadband and managed services to our large business and public sector customers. Large businesses are identified based on their size and volume of business with Verizon. Public sector customers include U.S. federal, state and local governments and educational institutions. Our offerings to this customer group include plans with features and pricing designed to address their specific needs. In 2024, Enterprise and Public Sector revenues were $14.2 billion, representing approximately 48% of Business’s total revenues.\nEnterprise and Public Sector offers a broad portfolio of connectivity, security and professional services designed to enable our customers to optimize their business operations, mitigate business risks and capitalize on data. These services include the following:\n•\nNetwork services \n– We offer a portfolio of network connectivity products to help our customers connect with their employees, partners, vendors and customers. These products include internet access services, private networking services, private cloud connectivity services and virtual and software defined networking services. \n•\nAdvanced communications services \n– We offer a suite of services to our customers to help them communicate with their employees, partners, vendors, constituents and customers. These products include Internet Protocol (IP)-based voice and video services, unified communications and collaboration tools and customer contact center solutions.\n•\nCore services \n– We provide a portfolio of domestic and global voice and data solutions utilizing traditional telecommunications technology, including voice calling, messaging services, conferencing, contact center solutions and private line and data access networks. Core services also include the provision of customer premises equipment, and installation, maintenance and site services. \n5\nTable of Contents\n•\nSecurity services \n– We offer a suite of management and data security services that help our customers protect, detect and respond to security threats to their networks, data, applications and infrastructure.\n•\nIoT services \n– We provide the network access required to deliver various IoT products and services. We work with companies that purchase network access from us to connect their devices, bundled together with their own solutions, which they sell to end users.\nBusiness Markets and Other\nBusiness Markets and Other offers wireless services (including FWA broadband), wireless equipment, advanced communication services, tailored voice and networking products, Fios services, advanced voice solutions and security services to businesses that ordinarily do not meet the requirements to be categorized as Enterprise and Public Sector, as described above. Business Markets and Other also includes solutions that support mobile resource management. In 2024, Business Markets and Other revenues were $13.1 billion, representing approximately 44% of Business’s total revenues.\nBusiness Markets and Other also provides fixed connectivity solutions comparable to the residential fixed services provided by Consumer, as well as business services and connectivity similar to the products and services offered to Global Enterprise customers, in each case with features and pricing designed to address the needs of small and medium businesses.\nWholesale\nWholesale offers wireline communications services including data, voice, local dial tone and broadband services primarily to local, long distance, and wireless carriers that use our facilities to provide services to their customers. In 2024, Wholesale revenues were $2.2 billion, representing approximately 8% of Business’s total revenues. A portion of Wholesale revenues are generated by a few large telecommunications companies, most of which compete directly with us. Wholesale's services include:\n•\nData services \n– We offer a portfolio of data services to enhance our Wholesale customers’ networks and provide connections to their end users and subscribers.\n•\nVoice services \n– We provide switched access services that allow carriers to complete their end-user calls that originate or terminate within our territory. In addition, we provide originating and terminating voice services throughout the U.S. and globally utilizing our time-division multiplexing and Voice over Internet Protocol (VoIP) networks.\n•\nLocal services \n– We offer an array of local dial tone and broadband services to competitive local exchange carriers, some of which are offered to comply with telecommunications regulations. In addition, we offer services such as colocation, resale and unbundled network elements in compliance with applicable regulations.\nDistribution\nWe use a combination of direct, indirect and alternative distribution channels to market and distribute our products and services to Consumer and Business customers. \nOur direct channel, including our company-operated stores, is a core component of our distribution strategy. Our sales and service centers and business direct sales teams also represent significant distribution channels for our services. In addition, we have a robust digital channel and omni-channel as a part of the customer experience in order to offer choice and convenience.\nOur indirect channel includes agents that sell our wireless and wireline products and services at retail locations throughout the U.S., as well as through the internet. The majority of these sales are made under exclusive selling arrangements with us. We also have relationships with high-profile national retailers that sell our wireless and wireline products and services, as well as convenience store chains that sell our wireless prepaid products and services. \nIn addition to our direct channel, our Business segment has additional distribution channels that include business solution fulfillment provided by resellers, non-stocked device fulfillment performed by distributors and integrated mobility services provided by system integrators and resellers.\nGlobal Networks and Technology\nOur Networks \nWe design, build and operate networks to provide connectivity and related services meeting the needs of our diverse customers: consumers, businesses, government organizations and educational institutions. \n•\nTechnologies\n – Our networks leverage advanced technologies, including 5G wireless, fiber-based transport, cloud infrastructures, private networks and IP routing solutions. \n6\nTable of Contents\n•\nScale and geography\n – We operate a national network covering over 146 million wireless retail connections as of December 31, 2024. In addition to our significant U.S. infrastructure, we have a presence globally and relationships with many operators and partners allowing us to service multinational network needs.\n•\nServices and capabilities\n – We provide connectivity, access to the internet, voice calling, text messaging and both linear and streaming video capabilities. Beyond these basic services, our network solutions include advanced services and capabilities such as E911, first responder solutions and private networking solutions.\n•\nReliability\n – We strive to design and deploy reliable networks. We test our networks for reliability and use various methods and procedures to maintain network availability, capability and capacity. To mitigate the impact of power disruptions on our operations, we have battery backup at every switch and every macro cell. We also utilize backup generators at a majority of our macro cells and at every switch location. In addition, we have a fleet of portable backup generators that can be deployed if needed.\nNetwork Evolution \nWe consider the reliability, speed, capacity, coverage and security of our wireless network to be key factors in our continued success. We are evolving and transforming our networks to ensure our customers receive access to the best network possible. Areas of evolution and transformation include:  \n•\n5G Wireless\n – Verizon has driven the conversion from 4G to 5G through a sequence of network changes involving the radio access network, the core network infrastructure and change to the devices connecting to the network. Over the past several years, we have been leading the development of 5G wireless technology industry standards and the ecosystems for fixed and mobile 5G wireless services. 5G technology enables higher throughput and lower latency than 4G LTE technology and allows our networks to handle more traffic as the number of internet-connected devices and customer usage needs grow. Our evolution to 5G with its new architecture allows us to simplify operations by eliminating legacy network elements.  \n•\nCoverage and densification\n – We continue to improve 5G wireless service coverage by leveraging our breadth of wireless spectrum, including millimeter wave and C-Band spectrum, which we are continuing to deploy across the continental U.S. We are densifying our networks by utilizing macro and small cell technology, in-building solutions and distributed antenna systems. Network densification enables us to increase coverage, improve quality of service and add capacity to accommodate an increasing number of users. It also supports our growing FWA business and growing bandwidth needs for uses such as streaming and video content creation.  \n•\nVirtualization\n – We are leveraging the benefits of cloud computing and storage as we evolve our network infrastructure. Our private cloud infrastructure allows us to use shared compute, storage and networking resources rather than building unique physical instances for our network infrastructure.  \n•\nFiber transport and IP networking\n – We own and operate one of the largest global fiber-optic networks in the world, providing connectivity to Business customers in more than 180 countries. Our global IP network includes long-haul, metro and submarine assets that enable and support international operations. In response to growing bandwidth demand, we have upgraded and increased our long-haul core fiber-based transport capacity as well as our IP network capacity and efficiency. We continue to build local fiber networks by adding fiber connectivity to premises, venues, cell tower locations and data centers.  \n•\nEnergy efficiency \n– We strive to improve the energy efficiency of our networks, facilities and fleet. We are balancing increased energy needs from ongoing expansion and densification of our networks with initiatives to effectively manage energy consumption, including using more energy-efficient equipment, discontinuing or migrating legacy services and pursuing opportunities to use renewable energy sources. \nFios \nResidential broadband service has seen significant growth in bandwidth demand over the past several years, and we believe that demand will continue to grow. We expect that the continued emergence of new video services, new data applications and the proliferation of IP devices in the home will continue to drive new network requirements for increased data speeds and throughput. We believe that the Passive Optical Network (PON) technology underpinning Fios positions us well to meet these demands in a cost-effective and efficient manner. We also continue to evolve the in-home broadband router element to bring new capability and improved performance, such as improved Wi-Fi, to our retail customers. \nWhile deployed initially as a consumer broadband network, our Fios infrastructure is also experiencing more widespread application in the Business segment, especially as businesses increasingly migrate to ethernet-based access services.\nIn September 2024, we entered into an agreement to acquire Frontier Communications Parent, Inc. (Frontier), a U.S. provider of broadband internet and other communication services. Upon closing, this transaction is expected to enhance our fiber broadband footprint and provide opportunities for future Fios growth.\n7\nTable of Contents\nSpectrum\nThe spectrum licenses we hold can be used for mobile and fixed wireless voice, video and data communications services. We are licensed by the Federal Communications Commission (FCC) to provide these wireless services on the following low and mid-band spectrum in areas that collectively cover nearly all of the population of the U.S.: (i) the 700 MHz Upper C block, (ii) Cellular spectrum (850 MHz), (iii) Personal Communication Services (PCS) spectrum (1900 MHz), (iv) AWS 1 and AWS 3 bands (1700 MHz uplink and 2100 MHz downlink), and (v) the 3.7 GHz band (C-Band). We also hold spectrum licenses in the 28, Upper 37 and 39 GHz bands, known as millimeter wave spectrum, and utilize both Priority Access Licenses (PALs) and General Authorized Access (GAA) in the 3.5 GHz band (Citizens Broadband Radio Service).\nWe anticipate that demand for spectrum will continue to increase over time, driven by growth in customer connections and the increased usage of wireless broadband services that use more bandwidth and require faster rates of speed, as well as the wider deployment of 5G mobile and fixed services. We expect to meet the demand for 5G and 4G spectrum needs with our existing spectrum assets. If demand continues to increase or if new spectrum is required for a future generation of technology, we can meet that demand by acquiring licenses or leasing spectrum from other licensees, or by acquiring new spectrum licenses from the FCC, if and when future FCC spectrum auctions occur. \nFrom time to time we have exchanged spectrum licenses with other wireless service providers through secondary market swap transactions. We expect to continue to pursue similar opportunities to trade spectrum licenses in order to meet capacity and expansion needs in the future. We also gain access to spectrum through cross-lease transactions. In certain cases, we have entered into intra-market spectrum swaps designed to increase the amount of contiguous spectrum within frequency bands in a specific market. Contiguous spectrum improves network performance and efficiency. These swaps, as well as any spectrum purchases, require us to obtain governmental approvals.\nInformation regarding spectrum license transactions, including our pending acquisition of select spectrum licenses of United States Cellular Corporation and certain of its subsidiaries, is presented in Note 3 to the consolidated financial statements included in this Annual Report.\nCompetition and Related Trends\nThe telecommunications industry is highly competitive. The rapid development of new technologies, services and products has eliminated many of the distinctions among wireless, cable, internet and traditional telephone services and brought new competitors to our markets. We expect competition to remain intense as traditional and non-traditional participants seek increased market share. \nCompetitive factors within the telecommunications industry include, among others, network reliability, speed, capacity and coverage; pricing and promotional strategies; the quality of customer service; marketing, sales and distribution capabilities; development of new and enhanced products and services; the ability to anticipate and respond to various factors and trends affecting our industry; the availability of capital resources; and regulatory changes. \nCompetition remains intense as a result of various factors, including aggressive pricing, increased levels of promotions and service plan discounts, and offerings that include additional bundled premium content or other perks, in some cases specifically targeting Verizon customers. Competition may increase as smaller, stand-alone wireless service providers merge or transfer licenses to larger, better capitalized wireless service providers and as MVNOs resell wireless communication services. In addition, aggressive network deployment as well as increasing government incentives related to it may enhance the ability of certain of our competitors to compete with us.\nWith respect to our wireless connectivity products and services, we compete against other national wireless service providers, including AT&T Inc. and T-Mobile US, Inc., as well as various regional wireless service providers. We also compete for retail activations with resellers that buy bulk wholesale service from wireless service providers, including Verizon, and resell it to their customers. Resellers include cable companies, such as Comcast Corporation and Charter Communications, Inc., and others. Several major cable operators also offer bundles with wireless services through strategic relationships. \nWe also face competition from other communications and technology companies seeking to increase their brand recognition and capture market share with respect to the provision of wireless products and services, in addition to non-traditional offerings in mobile data. For example, Microsoft Corporation, Alphabet Inc., Apple Inc., Meta Platforms, Inc. and others are offering alternative means for messaging and making wireless voice calls that, in certain cases, can be used in lieu of the wireless providers' voice service, as well as alternative means of accessing video content. In addition, we are seeing increasing competition in the provisioning of internet access by low Earth orbit satellite companies as well in the area of fixed wireless offerings that provide an alternative to traditional landline internet service providers.\nWith respect to Fios and our other broadband services, we compete against cable companies, wireless service providers, domestic and foreign telecommunications providers, satellite television companies, low Earth orbit satellite companies, internet service providers, OTT providers and other companies that offer network services and managed enterprise solutions. We also \n8\nTable of Contents\nface increasing competition from other internet portal providers. We expect the market will continue to shift from traditional linear video to OTT offerings. We also expect customer migration from traditional voice services to wireless services to continue.\nCompanies with a global presence are increasingly competing with us in our Business segment. A relatively small number of telecommunications and integrated service providers with global operations serve customers in the global enterprise market and, to a lesser extent, the global wholesale market. We compete with these providers for large contracts to provide integrated solutions to global enterprises and government customers. Many of these companies have strong market presence, brand recognition and existing customer relationships, all of which contribute to intense competition.\nIn the Enterprise and Public Sector markets, competition levels remain high, primarily as a result of increased industry focus on technology convergence. We compete in this area with system integrators, carriers, and hardware and software providers. In addition, some of the largest information technology services companies are making strategic acquisitions, divesting non-strategic assets and forging new alliances to improve their cost structure. Many new alliances and acquisitions have focused on developing fields, such as cloud computing, software defined networking, communication applications and other computing tasks via networks, rather than by the use of in-house machines. \nIn the Business Markets and Other category, customer purchasing behaviors and preferences continue to evolve. Solution speed and simplicity are becoming key differentiators for customers who are seeking full life-cycle offers that simplify the process of starting, running and growing their businesses. Mobile network operators and other carriers are aggressively targeting this customer group with a variety of bundles and discounts as it is among the largest and fastest growing categories in the Business segment.\nOur Wholesale business competes with traditional carriers for metro/mid/long-haul fiber, voice and IP services. In addition, mobile video and data needs are driving a greater need for wireless backhaul. Network providers, cable companies and specialty firms are competitors for this business opportunity.\nRegulatory Trends\nRegulatory Landscape\nVerizon operates in a regulated and highly competitive market, as described above. Some of our competitors are subject to fewer regulatory constraints than Verizon. For many services offered by Verizon, the FCC is our primary regulator. The FCC has jurisdiction over interstate telecommunications services and other matters under the Communications Act of 1934, as amended (Communications Act). Other Verizon services are subject to various state and local regulations.\nFederal, State and Local Regulation\nWireless Services\nThe FCC regulates several aspects of our wireless operations. Generally, the FCC has jurisdiction over the construction, operation, acquisition and transfer of wireless communications systems. All wireless services require use of radio frequency spectrum, the assignment and distribution of which is subject to FCC oversight. If demand continues to increase or if new spectrum is required for a future generation of technology, we can meet our needs for licensed spectrum by purchasing licenses or leasing spectrum from others, or by participating in a competitive bidding process to acquire new spectrum from the FCC. Those processes are subject to certain reviews, approvals and potential conditions.\nToday, Verizon holds FCC spectrum licenses that allow it to provide a wide range of mobile and fixed communications services, including both voice and data services. FCC spectrum licenses typically have a term of 10 years, at which time they are subject to renewal. While the FCC has routinely renewed all of Verizon’s wireless licenses, challenges could be raised in the future. If a wireless license was revoked or not renewed, Verizon would not be permitted to provide services on the spectrum covered by that license. Some of our licenses require us to comply with so-called \"open access\" FCC regulations, which generally require licensees of particular spectrum to allow customers to use devices and applications of their choice, subject to certain technical limitations. The FCC has also imposed certain specific mandates on wireless carriers, including construction and geographic coverage requirements, technical operating standards, provision of enhanced 911 services, roaming obligations and requirements for wireless tower and antenna facilities.\nThe Communications Act generally preempts regulation by state and local governments of the entry of, or the rates charged by, wireless carriers. It does not prohibit states from regulating the other \"terms and conditions\" of wireless service. For example, some states impose reporting and consumer protection requirements. Several states also have laws or regulations that address safety issues (for example, use of wireless handsets while driving), universal service funding, and taxation matters. Some states are also considering new network reliability or service quality requirements that may affect how and where we provide services if not preempted by federal law. In addition, wireless tower and antenna facilities are often subject to state and local zoning and land use regulation, and securing approvals for new or modified facilities is often a lengthy and expensive process.\n9\nTable of Contents\nBroadband\nVerizon offers many different broadband services. In early January 2025, based on litigation filed by the broadband industry, a federal appeals court overturned the FCC's April 2024 final decision to regulate broadband services via utility-style common carriage regulation under Title II of the Communications Act.  Absent further action in the courts, this decision will remain in effect and limit the risk of burdensome FCC broadband regulation. In addition to federal activity, several states have adopted or are considering adopting laws or executive orders that would impose net neutrality and other requirements on some of our broadband services, including a law in New York that requires discounted broadband pricing for low income customers. Some states may also impose pricing or other rules related to broadband built with the assistance of federal or state funding. The FCC also adopted broad rules related to \"digital discrimination\" that could further increase regulatory oversight of broadband services; industry groups have appealed those rules in court. Our broadband commitment can be found on our website at https://www.verizon.com/about/our-company/verizon-broadband-commitment.\nWireline Voice\nVerizon offers many different wireline voice services, including traditional telephone service and other services that rely on technologies such as VoIP. For regulatory purposes, legacy telephone services are generally considered to be \"common carrier\" services. Common carrier services are subject to heightened regulatory oversight with respect to rates, terms and conditions and other aspects of the services. The FCC has not decided the regulatory classification of VoIP but has said VoIP service providers must comply with certain rules, such as 911 capabilities and law enforcement assistance requirements.\nState public utility commissions regulate Verizon’s telephone operations with respect to certain telecommunications intrastate matters. Verizon operates as an \"incumbent local exchange carrier\" in nine states and the District of Columbia. These incumbent operations are subject to various levels of pricing flexibility and other state oversight and requirements. Verizon also has other wireline operations that are more lightly regulated. Some states, including California, impose reporting requirements and are considering new network reliability or service quality requirements for wireline voice services, including for VoIP.\nVideo\nVerizon offers a multichannel video service that is regulated like traditional cable service. The FCC has a body of rules that apply to cable operators, and these rules also generally apply to Verizon. In areas where Verizon offers its facilities-based multichannel video services, Verizon has been required to obtain a cable franchise from local government entities, or in some cases a state-wide franchise, and comply with certain one-time and ongoing obligations as a result.\nPrivacy, Data Protection, and Artificial Intelligence\nWe are subject to local, state, federal, and international laws and regulations relating to privacy and data protection that impact all parts of our business, including wireline, wireless, broadband and the development and roll out of new products. At the federal level, our business is governed by the FCC or the Federal Trade Commission (FTC), depending on the product or service. The California Consumer Privacy Act, Europe's General Data Protection Regulation and a number of other privacy laws more recently adopted by other states and countries include significant penalties for non-compliance. Generally, attention to privacy and data security requirements is increasing at all levels of government globally, and privacy-related legislation has been introduced or is under consideration in many locations. These regulations could have a significant impact on our businesses. Policymakers at the local, state, federal and international levels are also considering imposing laws and regulations on the use of artificial intelligence (AI). This is a nascent area of regulatory focus; therefore, it is unclear how such regulation could impact our business.\nPublic Safety and Cybersecurity\nThe FCC plays a role in addressing public safety concerns by regulating emergency communications services and mandating widespread availability of both media (broadcast/cable) and wireless emergency alerting services. In addition, federal and state agencies have mandated and may impose additional regulations to ensure continuity of service during disasters. For example, the FCC adopted rules requiring wireless providers to support roaming on each other’s networks during disasters, and the California Public Utilities Commission has imposed regulations relating to back-up power for communications facilities. In response to prior cyberattacks and increasing risks from cybersecurity threats, the FCC and other regulators are attempting to increase regulation of the cybersecurity practices of providers. The FCC is also addressing the use by American companies of equipment produced by certain companies deemed to cause potential national security risks. Verizon does not currently use equipment in its networks from vendors under such restrictions. \nIntercarrier Compensation and Network Access\nThe FCC regulates some of the rates that carriers pay each other for the exchange of voice traffic (particularly traditional wireline traffic) over different networks and other aspects of interconnection for some voice services. The FCC also regulates some of the rates and terms and conditions for certain wireline \"business data services\" and other services and network facilities. Verizon is both a seller and a buyer of these services, and both makes and receives interconnection payments.\n10\nTable of Contents\nHuman Capital Resources\nWith approximately 99,600 employees on a full-time equivalent basis as of December 31, 2024, 88% of whom are based in the U.S., we know that our people are one of our most valuable investments. In order to realize our core business strategy, we have developed human capital programs and practices that support, develop and care for our employees throughout their careers with Verizon. Our strategy to build a workforce with talent, skills and motivation to give the company a competitive edge now and into the future rests on three pillars:\n•\nAttract and maintain a diverse workforce with the necessary skills and talent to execute on our business priorities. \n•\nDevelop our employees' potential by offering educational opportunities that keep pace with changes occurring across our industry.\n•\nInspire individuals to build a career at Verizon by providing meaningful work and opportunities for career advancement in a collaborative and inclusive environment.\nVerizon strives to be an employer of choice by offering our employees competitive compensation and benefits packages. We seek to recruit and retain employees with diverse backgrounds, experiences and perspectives to best meet the needs of the diverse customers and communities we serve. We provide extensive on-the-job training opportunities, tuition reimbursement programs and career development support to enable our employees to maximize their potential and thrive professionally. As of December 31, 2024, Verizon's global workforce was approximately 68.6% male, 31.1% female and 0.3% unknown or undeclared, and the race/ethnicity of our U.S. workforce was 52.5% White, 18.4% Black, 14.0% Hispanic, 8.8% Asian, 0.4% American Indian / Alaskan Native, 0.3% Native Hawaiian / Pacific Islander, 2.6% two or more races, and 3.0% unknown or undeclared. Women represented 36.2% of U.S. senior leadership (vice president level and above). People of color represented 34.0% of U.S. senior leadership.\nVerizon respects our employees' rights to freedom of association and collective bargaining in compliance with applicable laws, including the right to join or not join labor unions. We have a long history of working with the Communications Workers of America and the International Brotherhood of Electrical Workers — the two unions that in total represent approximately 25% of our employees as of December 31, 2024. The current collective bargaining agreements covering our union-represented employees who serve customers in our Mid-Atlantic and Northeast service areas extend through August 1, 2026. Other collective bargaining agreements covering smaller groups of employees extend through various dates between 2025 and 2028. In addition, where applicable outside of the U.S., we engage with employee representative bodies such as works council. Verizon meets with U.S. national and local union leaders, as well as works council leaders outside the U.S., to talk about key business topics, including safety, customer service, plans to improve operational processes, our business performance and the impacts that changing technology and competition are having on our customers, employees and business strategy. \nFor a discussion of Verizon's Board oversight of risks related to our human capital resources, see the section entitled \"Governance — Our governance framework — Oversight of business risks\" in our definitive Proxy Statement to be filed with the Securities and Exchange Commission and delivered to shareholders in connection with our 2025 Annual Meeting of Shareholders.\nPatents, Trademarks and Licenses\nWe own or have licenses to various patents, copyrights, trademarks, domain names and other intellectual property rights necessary to conduct our business. We actively pursue the filing and registration of patents, copyrights, trademarks and domain names to protect our intellectual property rights within the United States and abroad. We also actively grant licenses, in exchange for appropriate fees or other consideration and subject to appropriate safeguards and restrictions, to other companies that enable them to utilize certain of our intellectual property rights and proprietary technology as part of their products and services. Such licenses enable the licensees to take advantage of Verizon's brands and the results of Verizon’s research and development efforts. While these licenses result in valuable consideration for Verizon, we do not believe that the loss of such consideration, or the expiration of any of our intellectual property rights, would have a material effect on our results of operations.\nWe periodically receive offers from third parties to purchase or obtain licenses for patents and other intellectual property rights in exchange for royalties or other payments. We also periodically receive notices alleging that our products or services infringe on third-party patents or other intellectual property rights. These claims, whether against us directly or against third-party suppliers of products or services that we sell to our customers, if successful, could require us to pay damages or royalties, rebrand, or cease offering the relevant products or services.\nInformation About Our Executive Officers\nSee Part III, Item 10. \"Directors, Executive Officers and Corporate Governance\" of this Annual Report on Form 10-K for information about our executive officers.\n11\nTable of Contents\nInformation on Our Internet Website\nWe make available, free of charge on our website, our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all amendments to those reports, at https://www.verizon.com/about/investors as soon as reasonably practicable after such reports are electronically filed with or furnished to the Securities and Exchange Commission (SEC). These reports and other information are also available on the SEC's website at https://www.sec.gov. We periodically provide other information for investors on our website, including news and announcements regarding our financial performance, information on environmental, social and corporate governance matters, and details related to our annual meeting of shareholders. We encourage investors, the media, our customers, business partners and other stakeholders to review the information we post on this channel. Website references in this report are provided as a convenience and do not constitute, and should not be viewed as, incorporation by reference of the information contained on, or available through, the websites. Therefore, such information should not be considered part of this report.\nCautionary Statement Concerning Forward-Looking Statements\nIn this report we have made forward-looking statements. These statements are based on our estimates and assumptions and are subject to risks and uncertainties. Forward-looking statements include the information concerning our possible or assumed future results of operations. Forward-looking statements also include those preceded or followed by the words \"anticipates,\" \"assumes,\" \"believes,\" \"estimates,\" \"expects,\" \"forecasts,\" \"hopes,\" \"intends,\" \"plans,\" \"targets\" or similar expressions. For those statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. \nThe following important factors, along with those discussed elsewhere in this report and in other filings with the SEC, could affect future results and could cause those results to differ materially from those expressed in the forward-looking statements: \n•\nthe effects of competition in the markets in which we operate, including the inability to successfully respond to competitive factors such as prices, promotional incentives and evolving consumer preferences; \n•\nfailure to take advantage of, or respond to competitors' use of, developments in technology, including artificial intelligence, and address changes in consumer demand;\n•\nperformance issues or delays in the deployment of our 5G network resulting in significant costs or a reduction in the anticipated benefits of the enhancement to our networks; \n•\nthe inability to implement our business strategy; \n•\nadverse conditions in the U.S. and international economies, including inflation and changing interest rates in the markets in which we operate; \n•\ncyberattacks impacting our networks or systems and any resulting financial or reputational impact; \n•\ndamage to our infrastructure or disruption of our operations from natural disasters, extreme weather conditions, acts of war, terrorist attacks or other hostile acts and any resulting financial or reputational impact; \n•\ndisruption of our key suppliers’ or vendors' provisioning of products or services, including as a result of geopolitical factors or the potential impacts of global climate change;\n•\nmaterial adverse changes in labor matters and any resulting financial or operational impact; \n•\ndamage to our reputation or brands;\n•\nthe impact of public health crises on our business, operations, employees and customers; \n•\nchanges in the regulatory environment in which we operate, including any increase in restrictions on our ability to operate our networks or businesses; \n•\nallegations regarding the release of hazardous materials or pollutants into the environment from our, or our predecessors', network assets and any related government investigations, regulatory developments, litigation, penalties and other liability, remediation and compliance costs, operational impacts or reputational damage;\n•\nour high level of indebtedness; \n12\nTable of Contents\n•\nsignificant litigation and any resulting material expenses incurred in defending against lawsuits or paying awards or settlements;\n•\nan adverse change in the ratings afforded our debt securities by nationally accredited ratings organizations or adverse conditions in the credit markets affecting the cost, including interest rates, and/or availability of further financing; \n•\nsignificant increases in benefit plan costs or lower investment returns on plan assets; \n•\nchanges in tax laws or regulations, or in their interpretation, or challenges to our tax positions, resulting in additional tax expense or liabilities;\n•\nchanges in accounting assumptions that regulatory agencies, including the SEC, may require or that result from changes in the accounting rules or their application, which could result in an impact on earnings; and\n•\nrisks associated with mergers, acquisitions, divestitures and other strategic transactions, including our ability to consummate the proposed acquisition of Frontier and obtain cost savings, synergies and other anticipated benefits within the expected time period or at all.",
    "item1a": "Item 1A of this Annual Report on Form 10-K. \n20\nTable of Contents",
    "item1b": "Item 1B.    Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.    Cybersecurity\nCybersecurity Program\nVerizon’s comprehensive cybersecurity program is designed to identify and protect against cybersecurity risks and to position Verizon to rapidly detect, respond to, and recover from cybersecurity incidents that impact our company. The program is built on the following pillars:\n•\nNIST Cybersecurity Framework\n -\n Our program is aligned to the National Institute of Standards and Technology’s (NIST) Cybersecurity Framework, which outlines the core components and responsibilities necessary to sustain a healthy and well-balanced cybersecurity program.\n•\nRisk identification\n -\n We continually assess the cybersecurity threat and vulnerability landscape using various commercial, government and publicly available information sources.\n•\nRisk detection\n -\n We use both manual and automated detection methods on a scheduled and ad-hoc basis to identify vulnerabilities within, and threats to, our operations and network infrastructure.\n•\nRisk evaluation\n -\n Once a cybersecurity vulnerability is detected, we assign a threat severity classification based on the risk profile associated with the vulnerability.\n•\nRemediation\n -\n Verizon’s information security team reports all cybersecurity vulnerabilities and their associated threat classification to the appropriate business team for remediation. Deadlines for remediation are set based on the severity of the threat and closely tracked in a central system of record. In the instances when a remediation deadline cannot be met, the information security team and the business team work together to deploy appropriate mitigating or compensating controls until the remediation work is complete.\n•\nMetrics and analysis\n -\n We track the performance of our cybersecurity program by collecting, retaining and analyzing a broad range of data related to our threat identification, detection and response activity. We use this data to assess threat trends, for strategic planning purposes and to enhance management accountability for cybersecurity.\nOur processes for assessing, identifying, and managing cybersecurity risks include tabletop exercises to test and reinforce our incident response controls, control gap analyses, penetration tests, data recovery testing, internal and external security assessments, and threat intelligence monitoring. We also conduct annual cybersecurity and data privacy training, which is mandatory for all our full- and part-time employees.\nIn addition to our in-house cybersecurity capabilities, we also engage assessors, consultants and other third parties to assist with various cybersecurity matters. For example, \nVerizon validates enterprise cybersecurity maturity every two years through a third-party maturity assessment.\n This assessment measures Verizon’s ability to identify, prevent, detect, respond to, and recover from threats to systems, assets and data. The results of the assessment serve as the baseline for enterprise cybersecurity across the company. In addition to this baseline, certain subsets of our technology environment are subject to incremental cybersecurity certification and periodic third party validation under applicable regulatory or contractual requirements.\n \n19\nTable of Contents\nVerizon has a comprehensive enterprise cybersecurity incident response plan, which is activated in the event of a cybersecurity incident. The plan is a detailed playbook that specifies how Verizon classifies, responds to, and recovers from cybersecurity incidents and includes notification procedures that vary depending on the significance of the incident. When warranted by the severity of the incident, our Chief Executive Officer (CEO) and other senior executives are part of the notification chain. \nIntegrated Cybersecurity Risk Management\n \nVerizon’s Senior Vice President and Chief Information Security Officer (CISO) has responsibility for the management of cybersecurity risks at Verizon. The CISO and her team are responsible for Verizon’s information security strategy, policy, standards, architecture and processes.\nThe CISO brings nearly two decades of cybersecurity experience to her work at Verizon. Prior to joining Verizon, she held executive-level cybersecurity roles at other large public companies, where she was responsible for cybersecurity strategy and operations, including incident response, threat intelligence, security services, architecture, commercial operational technology security, and regulatory and compliance matters.\nVerizon effectuates cybersecurity management by providing for close cooperation among the CISO’s team and other teams within the company, as well as by integrating cybersecurity risk into Verizon’s overall enterprise risk management structures and processes. Each of our business units and certain functional groups have a Business Information Security Officer, who is an integral member of that unit or group, but reports to the CISO. This structure provides the CISO with line of sight across the enterprise. The CISO and members of her leadership team also meet regularly with business unit senior leaders, including the CEO, the Chief Financial Officer (CFO) and the Chief Human Resources Officer, to discuss business priorities, emerging threats and trends, and the performance of the cybersecurity program.\nThe Verizon Executive Security Council (VESC) oversees and evaluates the work of the CISO and their team. The VESC is jointly chaired by the head of Verizon Global Services and the President of Global Networks and Technology and includes Verizon’s Chief Compliance Officer, Chief Legal Officer, Senior Vice President of Internal Audit and senior executives in business and technology functions. The VESC provides oversight of all aspects of Verizon’s cybersecurity program and, at regular intervals throughout the year, evaluates key cybersecurity metrics as well as planned and ongoing initiatives to reduce cybersecurity risks.\nVerizon’s Management Audit Committee (VMAC), which includes our CFO, Senior Vice President of Internal Audit and other senior executives, is responsible for overseeing components of our overall risk management strategy. The VMAC receives quarterly updates from the CISO on Verizon’s cybersecurity program.\nVerizon also operates a robust internal audit program. Each year, Verizon’s internal audit team conducts an overall business risk assessment, which includes an evaluation of cybersecurity risks. The results of the assessment are presented to the leaders of the relevant business teams, who are responsible for prioritizing and addressing the risks identified.\nBoard Oversight of Cybersecurity Risk\nThe \nAudit Committee\n of the Board of Directors (Board) has primary responsibility for overseeing Verizon’s risk management and compliance programs relating to cybersecurity and data protection and privacy.\n \nAs part of the \nBoard’s oversight\n of risks from cybersecurity threats, the CISO leads an annual review and discussion with the full Board dedicated to Verizon’s cybersecurity risks, threats and protections. The CISO provides a mid-year update to this annual review to the Audit Committee and, as warranted, additional updates throughout the year. The Audit Committee also receives a report from senior management on Verizon’s cybersecurity posture and related matters at each of its other meetings during the year at which the CISO is not present.\nThird Party Risk Management \nWe have implemented processes to identify and manage risks from cybersecurity threats associated with our use of third-party service providers.\n The Verizon Third Party Risk Management Program establishes governance, processes and tools for managing various supplier-related risks, including information security. As a condition of working with Verizon, suppliers who access sensitive business or customer information are expected to meet certain information security requirements.  \nRisks from Cybersecurity Threats\nWe are subject to increasing and evolving cybersecurity threats as cyberattacks against companies, including Verizon, have increased in frequency, scope and potential harm in recent years. While none of the cyberattacks to which we have been subject to date have been material to Verizon's operations or financial condition, there can be no guarantee that we will not experience a material cyberattack in the future.\n For more information on the risks from cybersecurity threats that we face, refer to “Risk Factors — Operational Risks — Cyberattacks impacting our networks or systems could have an adverse effect on our business” in Part I,"
  }
}