{
  "ticker": "WAB",
  "cik": "0000943452",
  "company_name": "WESTINGHOUSE AIR BRAKE TECHNOLOGIES CORP",
  "filing_date": "2025-02-12",
  "accession": "0001628280-25-005100",
  "primary_doc": "wab-20241231.htm",
  "item_sections": {
    "item1": "Item 15.\nExhibits and Financial Statement Schedules\n85\nItem 16.\nForm 10-K Summary\n90\n2\nPART I\nItem  1.\nBUSINESS\nGeneral\nWestinghouse Air Brake Technologies Corporation, doing business as Wabtec Corporation, is a Delaware corporation with headquarters at 30 Isabella Street in Pittsburgh, Pennsylvania. Our telephone number is 412-825-1000, and our website is located at \nwww.wabteccorp.com\n. Except as the context otherwise requires, all references to “we”, “our”, “us”, the “Company” and “Wabtec” refer to Westinghouse Air Brake Technologies Corporation and its consolidated subsidiaries. George Westinghouse founded the original Westinghouse Air Brake Co. in 1869 when he invented the air brake. Westinghouse Air Brake Company (“WABCO”) was formed in 1990 when it acquired certain assets and operations from American Standard, Inc., now known as Trane (“Trane”). The Company went public on the New York Stock Exchange in 1995. \nThroughout the years, the Company has made a number of strategic acquisitions leading the Company to where it is today. These have primarily included:\n•\nthe 1999 merger with MotivePower Industries, Inc. whereby the Company adopted its current name of Westinghouse Air Brake Technologies Corporation, or Wabtec; \n•\nthe 2017 acquisition of Faiveley Transport, S.A. (“Faiveley Transport”), a leading provider of value-added, integrated systems and services, primarily for the global transit rail market. Based in France, the Faiveley Transport business has roots to 1919 and made Wabtec a leader in manufacturing pantographs, automatic door mechanisms, air conditioning systems, railway braking systems and couplers; and,\n•\nthe 2019 acquisition of GE Transportation, a business unit of General Electric Company. This brought a global technology leader and supplier of locomotives, equipment, services and digital solutions to the rail, mining, marine, stationary power and drilling industries into Wabtec.\nAs a result of those strategic acquisitions, as well as other smaller acquisitions and organic growth, Wabtec is a global provider of value-added, technology-based locomotives, equipment, systems and services for the freight rail and passenger transit industries, and the mining, marine, and industrial markets. Wabtec has approximately 29,500 employees, excluding contingent workers, and operations in over 50 countries. Our highly engineered products, which are intended to enhance safety, improve productivity and reduce maintenance costs for customers, can be found on most locomotives, freight cars, passenger transit cars and buses around the world.\nIndustry Overview\nThe Company primarily serves the global freight rail and passenger transit industries. As such, our operating results are largely dependent on the level of activity, financial condition and capital spending plans of freight railroads and passenger transit agencies around the world, and transportation equipment manufacturers who serve those markets. Many factors influence these industries, including general economic conditions; traffic volumes, as measured by freight carloads and passenger ridership; government spending on public transportation; and investment in new technologies. In general, trends such as urbanization and growth in developing markets, sustainability and environmental awareness, investment in technology solutions, an aging equipment fleet, and growth in global trade are expected to drive continued investment in freight rail and passenger transit.\nThe Association of the European Rail Industry, UNIFE, advocates for and represents European train builders and rail suppliers. UNIFE publishes a biennial market study that provides an overview of the market in its current form and a forecast of its future development in different regions and market segments. The 2024 biennial edition of the study concluded that the global rail market grew 2.7% in the 2021 to 2023 period as the industry started recovering from the negative impacts of the COVID-19 pandemic and forecasts the industry to continue with a compound annual growth rate of 3% through 2027. \nAs growth continues, Wabtec expects to have additional opportunities to provide products and services in these markets. New technologies offered by Wabtec can provide solutions to improve safety, cost and reliability of rail, as well as support the modernization of the global rail fleets. Consistent with the UNIFE study, increased investment in infrastructure improvements, digitalization and automation is expected, all of which would improve efficiency in the global rail industry. \nBusiness Segments and Products\nWe provide our products and services through two principal business segments, the Freight Segment and the Transit Segment, both of which have different market characteristics and business drivers. The Freight Segment primarily manufactures new and modernized locomotives; provides aftermarket parts and services to existing locomotives; provides components to new and existing freight cars; builds new commuter locomotives; supplies rail control and infrastructure products including electronics, positive train control equipment, signal design and engineering services; provides a comprehensive suite of \n3\nsoftware-enabled solutions designed to improve customer safety, efficiency and productivity in the transportation and mining industries; overhauls locomotives; and provides heat exchangers and cooling systems for rail and other industrial markets. Customers include large, publicly traded railroads, leasing companies, manufacturers of original equipment such as locomotives and freight cars, utilities, and companies in the mining, marine, and industrial markets. We are a global manufacturer of diesel-electric locomotives for freight railroads producing essential products and solutions that help railroads reduce operating costs, decrease fuel use, minimize downtime and comply with emissions standards. As a result of the large base of nearly 24,000 locomotives, Wabtec's Services product line of modernizing, rebuilding and overhauling, remanufacturing, maintaining, and exchanging locomotives and components in the aftermarkets provides a significant, recurring revenue stream. In 2024, the Freight Segment accounted for approximately 72% of Wabtec’s total net sales, with approximately 59% of its net sales in the U.S. and approximately 61% of the Freight Segment’s net sales were in the aftermarket.\nThe Transit Segment primarily manufactures and services components for new and existing passenger transit vehicles, typically regional trains, high speed trains, subway cars, light-rail vehicles and buses; and supplies rail control and infrastructure products including electronics, signal design and engineering services. Customers include public transit authorities and municipalities, leasing companies, manufacturers of passenger transit vehicles and buses, and companies in the electrical generation, distribution, and charging industries. In 2024, the Transit Segment accounted for approximately 28% of our total net sales, with approximately 18% of its net sales in the U.S. The Transit Segment maintains a large installed base of original equipment globally which allows for a significant recurring revenue stream in the aftermarket. Approximately 55% of the Transit Segment’s net sales are in the aftermarket. \nThe following is a summary of our primary products and services in both aftermarket and original equipment across both of our business segments:\nEquipment:\n•\nDiesel-electric and liquid natural gas powered locomotives for freight and transit \n•\nEngines, electric motors and premium propulsion systems used in locomotives, mining, marine, stationary power and drilling applications\n•\nMarine and mining products\nDigital Intelligence Products:\n•\nPositive Train Control (\"PTC\") equipment and electronically controlled pneumatic braking products\n•\nRailway electronics, including event recorders, monitoring equipment and end of train devices\n•\nSignal design and engineering services\n•\nTrain performance such as distributed locomotive power, train 'cruise control', and train remote control\n•\nTransport intelligence such as Industrial/mobile Internet of Things (IoT) hardware & software, edge-to-cloud, on and off-board analytics & rules, and asset performance management\n•\nTransport logistics such as rail and shipper transportation management and port visibility and optimization \n•\nNetwork optimization such as rail network scheduling, dispatch and optimization, intermodal, terminal management and optimization, and rail yard management and optimization\nComponents:\n•\nFreight car trucks and braking equipment and related components for freight applications\n•\nAir compressors, dryers and HVAC systems\n•\nHeat transfer components and systems for diesel and gas engine cooling, generator and transformer coolers and high temperature applications\n•\nCustom engineered burners and combustion systems\n•\nRailgear, signaling and switch products\n•\nTurbochargers for industrial and aftermarket vehicle applications\nServices:\n•\nFreight locomotive overhauls, modernizations and refurbishment\n•\nMaster service agreements for locomotive and car maintenance\n•\nTransit locomotive and car overhaul\n•\nUnit exchange of locomotive components\n•\nLong term parts arrangements\n•\nMaintenance of way equipment and services\nTransit Products:\n•\nRailway and freight braking equipment and related components, including high-speed passenger transit vehicles\n•\nFriction products, including brake shoes, discs and pads\n4\n•\nHeating, ventilation and air conditioning equipment\n•\nAccess doors and platform screen doors\n•\nPantographs \n•\nAuxiliary power converter and battery charging\n•\nPassenger information systems and closed-circuit television\n•\nSignaling and railway electric relays\n•\nDoors, window assemblies, accessibility lifts, ramps and electric charging solutions for buses\nWabtec is utilizing a flexible and growing portfolio of freight rail and passenger transit products and innovative technologies to support customers’ sustainability goals and targets. From pioneering advancements to current signaling systems and network efficiency solutions, we are striving to increase the rail capacity to move more freight by train. Wabtec is working to reduce existing locomotive fleet emissions through fuel-efficiency solutions and testing renewable diesel and biofuels. We are also conducting collaborative research and development efforts with the National Laboratories to support the use of hydrogen to lower emissions across the rail industry. In 2024, Canadian National Railway Company, Norfolk Southern and Union Pacific Railroad each recognized Wabtec’s leadership in sustainability, energy efficiency, innovation, and environmental stewardship with partnership awards. This was Wabtec’s second year in a row receiving the Thoroughbred Sustainability Partner Award from Norfolk Southern. Wabtec also is implementing energy-reducing technologies for the passenger transit sector. In 2022, Wabtec received sustainability awards from both the German Ministry of Transportation and Deutsche Bahn and for our Green Air heating, ventilation, and air conditioning (HVAC) solution.\nIn recent years, we have also introduced a number of significant new products, including PTC equipment that encompasses onboard digital data and global positioning communication protocols. We are making additional investments in this technology which we believe will provide customers with opportunities to improve safety and efficiency, in part through data analytics solutions. During 2023, Wabtec also expanded the Digital Intelligence portfolio with entry into the railcar telematics market. \nFor additional information on our business segments, see Note 19 of “Notes to Consolidated Financial Statements” included in Part II, Item 8 of this report.\nCompetitive Strengths\nThrough both organic growth and strategic acquisitions, Wabtec has developed the following competitive strengths:\n•\nIconic legacy and strong reputation with a history of over 150 years of innovation\n.\n Wabtec has been transforming the rail landscape through various innovations and technologies for over 150 years. We have a long history of advancing technologies to meet customer needs and have been recognized for the development and production of locomotives, equipment, including PTC equipment, and systems for the freight rail and passenger transit industries. We are also a service provider for freight rail and passenger transit vehicles. \n•\nBreadth of product offering with a stable mix of original equipment market (OEM) and aftermarket business\n. Our comprehensive product portfolio and service offerings span the freight rail and passenger transit industries, as well as the bus, mining, marine, and industrial markets, which help Wabtec balance the cyclical nature of the global rail business. We provide our products in both the original equipment market and the aftermarket. Our substantial installed base of products with end-users, such as the railroads and the passenger transit authorities, is a significant competitive advantage for providing products and services to the aftermarket because these customers often look to purchase safety- and performance-related replacement parts and technology upgrades from the original equipment components supplier. Wabtec has an installed base of nearly 24,000 locomotives, as well as a diverse offering of Transit locomotives and cars both internationally and domestically. Our significant installed base enables opportunities in the aftermarket parts and services business.\n•\nLeading design and engineering capabilities.\n We believe a hallmark of our relationship with our customers has been our leading design and engineering practice, which has assisted in the improvement and modernization of global railway equipment. Wabtec's engineers and technical capabilities support continued focus on innovative product development and efforts to achieve scalable technologies. We believe both our customers and government authorities value our technological capabilities and commitment to innovation, as we seek not only to enhance the efficiency and profitability of our customers, but also to improve the overall safety of the railways through continuous improvement of product performance. To that end, we have assembled a wide range of patented products, which we believe provides us with a competitive advantage that enhances our customers' safety, productivity, reliability and capacity. \n•\nDriving fuel efficiency for the rail industry. \nWe have taken significant steps to drive fuel efficiency in global transport and make our world safer, smarter and greener. Wabtec is advancing our sustainability priorities both through our own commitments to our people, communities, and planet, as well as by innovating next generation technologies that reduce \n5\nemissions, energy consumption and waste, and increase fuel efficiency for our customers through advancements in our equipment and digital solutions. \n•\nDriving the digital transformation of the rail industry.\n Our early investment in data analytics and software has allowed us to become a strategic partner for customers looking to derive new value from existing assets, digitally transform their operations and enhance their network optimization. Through these initiatives, our digital solutions have helped to transform many distribution channels in the transportation industry including mine to ports, from shipper to receiver, from port to intermodal terminals to main line locomotives and railcars and across train yards and operation centers. The breadth of our Digital Intelligence solutions gives customers confidence in our ability to address their current and future needs with the latest digital technologies.\n•\nStrategic partnerships with longstanding customers and other key stakeholders.\n We listen to our key stakeholders and focus on areas where Wabtec can enable the most meaningful impact for our customers, communities, and the world. Transformational change requires collaboration, so we are committed to accelerating progress by partnering with customers, government leaders, corporations, universities, and other key stakeholders. For example, we have partnered with a customer, as well as an artificial intelligence and robotics institution to create technologies that will further decarbonize freight rail transport, improve freight safety, and generate greater rail network utilization. By working together with these partners and others, we are developing advanced solutions for the industry to realize the zero-emission rail network of the future.  \n•\nExperience with industry regulatory requirements. \nThe freight rail and passenger transit industries are governed by various government agencies and regulators in each country and region. These groups mandate rigorous manufacturer certification and a new product testing and approval processes that we believe are difficult for new entrants to meet cost-effectively and efficiently without the scale and extensive experience we possess.\n•\nStreamlined cost structure and operational excellence provide operating leverage and support Wabtec’s growth.\n We focus on driving continuous operational improvement across the organization by sharing best practices, instilling a culture of learning, problem solving and constant improvement, and driving standard operating practices. Wabtec is also focused on earnings growth through expanding high-margin recurring revenue streams. Additionally, Wabtec is a provider of technology-enabled locomotives and equipment, freight car components, systems, and services for the freight rail and passenger transit industries. The size of Wabtec's operations enables the Company to achieve economies of scale, in addition to using best-cost locations for executing on operational decisions. Completed strategic acquisitions and integrations have also led to operating synergies across Wabtec. \nBusiness Strategy\nWe strive to generate sufficient cash to invest in our growth strategies while maintaining world-class product value, technology and customer responsiveness. We continuously strive to improve quality, delivery and productivity, and to reduce costs utilizing global sourcing and supply chain management. These practices enable us to streamline processes, improve product reliability and customer satisfaction, reduce product cycle times and respond more rapidly to market developments. We also rely on functional experts within the Company across various disciplines to train, coach and share best practices throughout the Company, while benchmarking against best-in-class competitors and peers. Over time, we intend to continue to increase operating margins, improve cash flow and strengthen our ability to invest in the following growth strategies:\n•\nAccelerate innovation of scalable technologies\n.\n We continue to emphasize innovation and development funding to create new products and capabilities to increase customer productivity, efficiency, capacity, utilization and safety, such as the hydrogen powered locomotive, vehicle monitoring and data analytics. We plan to invest in bringing new technologies to market for our customers. A significant portion of our investment is expected to be focused on three customer-centric areas of innovation: advanced supply chain visibility, automation and digitization and zero-emissions operations. These investments will position our customers for success and make these technologies the standard going forward. We have a multi-year initiative to build on our existing expertise and technologies in the Digital Intelligence space. In addition, we invest in developing enhancements and new features to existing products, such as brake discs and heat exchangers. We are focusing on technological advances, especially in the areas of electronics and alternative fuels, including hydrogen technologies, braking products and other on-board equipment, as a means to deliver new product growth. We seek to provide customers with incremental technological advances that offer immediate benefits with cost-effective investments.\n•\nGrow and refresh expansive installed base. \nWe are a transportation and component manufacturer with a significant installed base with expansive product and service capabilities. We have nearly 24,000 locomotives in service, the majority of which are equipped with Digital Intelligence technologies, like Positive Train Control. We intend to increase sales through direct sales of existing products to current and new customers, by developing specific new products for application in new geographic markets, by making strategic acquisitions and through joint ventures with railway suppliers which have a strong presence in their local markets. We believe that international markets represent a \n6\nsignificant opportunity for future growth. In Transit, we are focused on mature markets such as Europe and emerging markets such as India. In Freight, we are targeting markets that operate significant fleets of locomotives and freight cars, including Australia, Brazil, Egypt, India, South Africa, Kazakhstan, and other select areas within Europe, Asia and South America. In addition, we have opportunities to increase the sale of certain products that we currently manufacture for the rail industry into other industrial markets, such as mining, off-highway and energy. \n•\nDrive fuel efficiencies through emerging technologies.\n Today, rail represents the cleanest, most energy efficient and safest mode of moving freight and people on land.\n \nAs global demands for growth increase, current trends suggest that freight and passenger rail activity will more than double by 2050, leading to an increased demand for sustainable transportation of people and goods. These converging forces highlight the critical interplay between market dynamics, the need for increased fuel efficiency and Wabtec’s business strategy. Wabtec is helping customers transition to a more utilized, efficient, and low-carbon rail network. Alternative clean energy technologies are critical in the fight against climate change and reducing greenhouse gas emissions. We are helping our customers reduce their overall cost of operations through the development of low-emitting locomotives like our Tier 4 locomotives, Trip Optimizer, Green Air and Green Friction products, and the use of alternative fuels such as biodiesel, renewable diesel, and hydrogen.\n•\nExpand high-margin recurring revenue streams.\n Our expansive installed base allows us to generate strong recurring revenues with replacement parts and components, digital solutions, overhauls and modernizations. Aftermarket sales are typically done at higher margins and are less cyclical than OEM sales because a certain level of aftermarket maintenance and service work must be performed, even during an industry slowdown. Sales of aftermarket parts and services represent approximately 60% of total net sales. As a long-time supplier of original equipment, we have an extensive installed base of equipment in operation and growing this installed base further will expand our recurring aftermarket sales. Wabtec provides aftermarket parts and services for its components, and we seek to expand this business with customers who currently perform the work in-house. In this way, we expect to benefit as transit authorities and railroads outsource certain maintenance and overhaul functions.\n•\nDrive continuous operational improvement\n.\n We are focused on continuous improvement to drive cost competitiveness, effectively deploy capital and accelerate Lean. Lean is a set of principles that emphasize customer focus, elimination of waste, high quality growth and relentless prioritization of work to improve safety, quality, delivery and cost. Lean is being embedded in our culture and is fundamental to how we execute our strategy. We are using Lean principles to help examine processes and continuously improve them by solving problems at their root cause. Our Lean transformation model focuses on driving process improvements and management systems to maximize the flow of value produced for the customer, remove waste, empower employees and optimize the enterprise. These principles are also rigorously applied to sustainability and safety.\nRecent Acquisitions\nSee Note 3 of “Notes to Consolidated Financial Statements” included in Part II, Item 8 of this report for additional information about our recent acquisitions.\nBacklog\nBacklog represents the future sales we expect to recognize on firm orders received from customers and approximates the Company’s remaining performance obligations at the end of each period. The Company’s total backlog was approximately $22.3 billion at December 31, 2024. The Company’s contracts are subject to standard industry cancellation provisions, including cancellations on short notice or upon completion of designated stages. Generally, if a customer were to cancel a contract, we would have an enforceable right to payment for work completed up to the date of cancellation which would include a reasonable profit margin. Substantial scope-of-work adjustments are common. For these and other reasons, completion of the Company’s backlog may be delayed or canceled. The railroad industry, in general, has historically been subject to fluctuations due to overall economic conditions and the level of use of alternative modes of transportation.\n7\nThe roll forward of the Company's backlog of firm customer orders and the expected year of completion are as follows:\n In millions \nFreight Segment\nTransit Segment\nConsolidated\n Balance at December 31, 2023\n$\n17,785 \n$\n4,214 \n$\n21,999 \n Less: 2024 Net sales \n(7,468)\n(2,919)\n(10,387)\n New orders \n7,348 \n3,147 \n10,495 \n Adjustments / foreign exchange, net \n321 \n(156)\n165 \n Balance at December 31, 2024\n$\n17,986 \n$\n4,286 \n$\n22,272 \n Expected Delivery \n2025\n$\n5,577 \n$\n2,104 \n$\n7,681 \nThereafter\n$\n12,409 \n$\n2,182 \n$\n14,591 \nGlobal economic conditions have not resulted in any material cancellations recently, but they have impacted the timing of some orders in backlog as, in certain cases, the delivery of goods and services were pushed out from their original timelines and could result in future modifications or cancellations.\nEngineering and Development\nTo execute our strategy to develop new products, we invest in a variety of engineering and development activities. For the years ended December 31, 2024, 2023 and 2022, we invested $206 million, $218 million and $209 million, respectively, in engineering for product development and improvement activities. Significant incremental engineering expense can be incurred with the execution of original equipment customer contracts. Across the Company we have established multiple Centers of Competence, which have specialized, technical expertise in various disciplines and product areas.\nOur engineering and development program includes investments in data analytics, train control and other new technologies, such as liquid natural gas and hydrogen-powered locomotives, with an emphasis on developing products that enhance safety, productivity and efficiency for our customers. For example, we have developed advanced cooling systems that enable lower emissions from diesel engines used in rail and other industrial markets. We periodically conduct specific research projects in conjunction with universities, customers and other industry suppliers.\nWe use our product development system to develop and monitor new product programs. The system requires the product development team to follow consistent steps throughout the development process, from concept to launch, to ensure the product will meet customer expectations and internal profitability targets.\nIntellectual Property\nWe have more than 6,500 active patents worldwide and file for approximately 300 new patents each year. We actively review our patent procurement processes and make adjustments as appropriate to the business environment. We also rely on a combination of trade secrets and other intellectual property laws, nondisclosure agreements and other protective measures to establish and protect our proprietary rights in our intellectual property. We actively monitor competitor patent issuance during our product development to reduce litigation risks, and we follow their product development practices to monitor possible patent infringement by them, and to evaluate their strategies and plans.\nTrademarks we utilize can be licensed from other companies, acquired as part of mergers or acquisitions, or have been developed through the normal course of business. We have entered into a variety of license agreements as licensor and licensee. We do not believe that any single license agreement is of material importance to our business or any of our business segments as a whole. \nCustomers\nWe provide products and services for more than 500 customers worldwide. Our customers include passenger transit authorities and railroads throughout North America, Europe, Asia Pacific, Africa and South America; manufacturers of transportation equipment, such as locomotives, freight cars, passenger transit vehicles and buses and companies that own, lease, and maintain such equipment, as well as customers in the mining, marine, and industrial markets.\nTop customers can change from year to year. For the fiscal year ended December 31, 2024, our top five customers accounted for approximately 30% of net sales. No one customer represents 10% or more of consolidated net sales. We believe that we have strong relationships with all of our key customers.\n8\nCompetition\nWe operate in a highly competitive marketplace. Price competition is strong because we have a relatively small number of customers and they are very cost-conscious. In addition to price, competition is based on product performance and technological leadership, quality, reliability of delivery, and customer service and support.\nOur principal competitors vary across product lines and geographies. Within North America, New York Air Brake Company, a subsidiary of the German air brake producer Knorr-Bremse AG (“Knorr”) and Amsted Rail Company, Inc., a subsidiary of Amsted Industries Corporation, are our principal overall OEM competitors. Our primary competition for locomotives is Progress Rail, owned by a subsidiary of Caterpillar. Our primary competition for freight and passenger transit service and repair is mostly from the railroads’ and passenger transit authorities’ in-house operations and Knorr. We believe our key strengths, strategic partnerships and operational excellence, coupled with an experienced management team, enable us to compete effectively in this marketplace. Outside of North America, Knorr is our main competitor, although not in every product line or geography. In addition, our competitors often include smaller, local suppliers in most international markets. Depending on the product line and geography, we can also compete with our customers, such as CRRC Corporation Limited, a China-based manufacturer of rolling stock.\nEnvironmental, Social and Governance\nSustainability\nWabtec is committed to creating sustainable value through innovative rail technologies and responsible business practices. Our mission to unlock our customers' potential by delivering innovative and lasting transportation solutions underpins our sustainability strategy. Our strategy helps us capitalize on market opportunities and reduce safety and environmental risks, while creating value for our customers, employees and other stakeholders. Wabtec utilizes three Strategic Sustainability Principles to execute our sustainability strategy: \n•\nInnovating with Purpose.\n We are committed to developing responsible and sustainable products that minimize the impact on the planet.\n•\nDriving Responsible Operations.\n We are committed to providing safe work environments and products that enable productive and efficient use of resources.\n•\nEmpowering People and Communities. \nWe are committed to driving an inclusive culture grounded in integrity, committed to the development of and investment in the communities where our teams live and work.\nAs we refine our sustainability strategy, we believe it is important to listen to our key internal and external stakeholders to identify and develop Environmental, Social and Governance (\"ESG\") topics of focus that align to our overall sustainability strategy and action plans. These topics are reviewed periodically to ensure our focus is in-line with the current market conditions and trends. Additionally, we utilize our Green Finance Framework to support the development of technologies that enable sustainable value creation. \nWabtec is committed to transparency on ESG topics, including the opportunities and challenges we encounter as we work to enhance performance and conduct business in a responsible manner. We publish periodic sustainability and sustainability-related reports, where we present ESG information, including policies, goals, activities, and qualitative and quantitative data on our progress. \nCompensation and Benefits\nWe remain committed to a strong pay-for performance philosophy that aligns individual performance, behaviors and business results with individual rewards. To deliver on that commitment, we utilize market data to benchmark to the external market and consider factors such as an employee’s role and experience, the location of the job and performance when determining compensation. \nWe provide our employees resources to help them be mentally, physically and financially well. We offer a wide range of benefits including healthcare and wellness (physical and mental) benefits, retirement benefits, paid time off, an employee assistance program, and seven employee resource groups to build diverse and inclusive communities at Wabtec. \nHuman Capital\nIn 2023, after years of growth and integration, we took the next step on our journey to become One Wabtec by aligning the behaviors of our legacy companies and evolving our shared culture. We launched our new cultural blueprint through our Vision, Mission, and Values after hearing from over 2,200 diverse stakeholders around the globe, including our customers, team members, managers, senior leaders, and Board of Directors. Our vision: Revolutionize the way the world moves for future generations. Our mission: unlock our customers’ potential by delivering innovative and lasting transportation solutions. At \n9\nWabtec, our purpose stems from four values that shape our core identity: People First, Expand the Possible, Embrace Diversity, and One Wabtec. These values are woven throughout our global operations, and they motivate us to build lasting connections. \nWabtec is committed to ensuring our workplace respects and seeks the unique talents, experiences and viewpoints of all our employees. We strive to create an environment where employees can be themselves. Our Board of Directors also plays a critical role in creating an organization that prioritizes, supports and invests in these ideals. \nOur headquarters are in Pittsburgh, Pennsylvania and we have offices, facilities, and operations in over 50 countries around the globe. As of December 31, 2024, we have a global workforce of approximately 29,500 employees, excluding contingent workers. \nUnionized Population\nA portion of our workers are represented by labor unions. The United Electrical, Radio and Machine Workers of America (UE), Locals 506 and 618 collective bargaining agreement, covering approximately 1,400 locomotive manufacturing workers in Erie, Pennsylvania, expired on June 9, 2023. Negotiations with the UE officially began on April 27, 2023 and an agreement between the Company and the UE was not reached before the contract expired. On June 22, 2023, the UE voted against ratification of the Company's proposed agreement and authorized a strike. The Company and the UE subsequently reached an agreement that was ratified by the UE on August 31, 2023, ending the labor strike. The Company continuously monitors its labor activity.\nTraining and Development\nWe continually invest in our employees’ career growth and provide employees with a wide range of development opportunities, including face-to-face, virtual, social and self-directed learning, mentoring and coaching programs. We have invested in training courses through Wabtec’s Learning Management System (\"LMS\"). Wabtec has partnered with a third-party vendor to provide an online learning platform available to all of our employees, both hourly and salary. \nOur Leadership, Expertise, Advancement and Development (\"LEAD\") program is the primary path for university graduates into Wabtec. LEAD is a two-year program that offers an immersive learning experience in the fields of engineering, operations, finance and IT along with extensive leadership training designed to build the next generation of leaders. On average, there are 100 participants in the LEAD program that rotate between business units or departments every six months to work on strategic projects and assignments, gain exposure to senior leadership and build their global professional network. We are focused on strengthening this program to support our global talent pipeline.\nEnvironmental, Health and Safety \nPutting people first is how we do business at Wabtec. Our Environmental, Health and Safety (\"EHS\") program has a longstanding commitment to continuously improve and foster a culture that proactively reduces risks and hazards in our operations, protects the environment, ensures regulatory compliance, and encourages learning and development. To ensure operational accountability for EHS across all levels of Wabtec, we use standard metrics (both lagging and leading indicators) and structured management reviews to track and measure EHS performance across all our operational sites. Monthly EHS operating reviews with the Executive Vice President for Global Operations are used to review operational risks at the enterprise-level, develop strategic initiatives, and communicate key performance indicators to senior management. Each site is responsible for developing a risk reduction plan to drive site or project-level actions related to risk reduction, compliance assurance, employee engagement, and continuous EHS improvement. Through these efforts, our Operations and EHS teams are partnering to eliminate and reduce hazards and risks within Wabtec’s operations, which is fundamental to improved EHS performance. In 2024, we had zero fatalities and our total recordable injury rate decreased by over 5% compared with 2023. We remain steadfast in our commitment to protecting our people and driving toward EHS excellence.\nRegulation\nIn the course of our operations, we are subject to various regulations and standards of governments and other agencies in the U.S. and around the world. These entities typically govern equipment, safety and interoperability standards for freight rail rolling stock and passenger transit, oversee a wide variety of rules and regulations governing safety and design of equipment, and evaluate certification and qualification requirements for suppliers. New products generally must undergo testing and approval processes that are rigorous and lengthy. As a result of these regulations and requirements, we must usually obtain and maintain certifications in a variety of jurisdictions and countries. The governing bodies include the Federal Railroad Administration (\"FRA\") and the Association of American Railroads (\"AAR\") in the U.S., and the International Union of Railways (“UIC”) and the European Railway Agencies in Europe. Also, in Europe, the European Committees for Standardization continually draft new European standards which cover, for example, the Reliability, Availability, Maintainability and Safety of railways systems. To guarantee interoperability in Europe, the European Union for Railway Agencies is responsible for defining and implementing Technical Standards of Interoperability, which covers areas such as \n10\ninfrastructure, energy, rolling stock, telematic applications, traffic operation and management subsystems, noise pollution and waste generation, protection against fire and smoke, and system safety.\nMost countries and regions in which Wabtec does business have similar rule-making bodies. For example, in China any product or system sold on the Chinese market must have been certified in accordance with national standards. In the local Indian market, most products are covered by regulations patterned after AAR and UIC standards.\nEffects of Seasonality\nOur business has limited seasonality. Third and fourth quarter results may be affected by the timing of services performed under our locomotive maintenance contracts and vacation and scheduled plant shutdowns at several of our major customers. Fourth quarter results may be affected by the timing of spare parts and service orders placed by transit agencies worldwide. Quarterly results can also be affected by the timing of projects in backlog and by project delays.\nEnvironmental Matters\nThe Company's operations and products are subject to a variety of environmental laws and regulations governing air emissions, discharges into water, the use, handling, storage, and disposal of hazardous substances and waste materials, as well as the remediation of contamination associated with releases of hazardous substances. The Company believes its operations and products currently comply in all material respects with all of the various environmental laws and regulations applicable to our business; however, there can be no assurance that environmental requirements will not change in the future or that we will not incur significant costs to comply with such requirements.\nAvailable Information\nWe maintain a website at www.wabteccorp.com. Available free of charge on this site are: our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to such reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as well as the annual report to stockholders, our Green Bond Report (https://ir.wabteccorp.com/investor-relations/green-finance-framework), our sustainability and sustainability-related reports (www.wabteccorp.com/sustainability/report-archive), and other information. The Internet site and the information contained therein or connected thereto are not incorporated by reference into this Form 10-K. The following are also available free of charge on this site and are available in print to any shareholder who requests them: Our Corporate Governance Guidelines, the charters of our Audit, Compensation and Talent Management and Governance and Sustainability Committees, our Code of Conduct, which is applicable to all employees, our Code of Ethics for Senior Officers, which is applicable to our executive officers, our Policies on Related Party Transactions and Conflict Minerals.\n11\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nThe following table provides information on our executive officers as of February 12, 2025.  \nOfficers\nAge\nPosition\nRafael Santana\n53\nPresident and Chief Executive Officer\nDavid L. DeNinno\n69\nExecutive Vice President, General Counsel and Secretary\nJohn A. Olin\n64\nExecutive Vice President and Chief Financial Officer\nNicole Theophilus\n54\nExecutive Vice President and Chief Administrative Officer\nEric Gebhardt\n56\nExecutive Vice President and Chief Technology Officer\nGina Trombley\n54\nExecutive Vice President, Sales & Marketing & Chief Commercial Officer - Americas\nGreg Sbrocco\n56\nExecutive Vice President, Global Operations\nMichael E. Fetsko\n60\nPresident, Freight and Industrial Components\nAlicia Hammersmith\n54\nPresident, Freight Services\nRogerio Mendonca\n52\nPresident, Freight Equipment\nNalin Jain\n55\nPresident, Digital Intelligence\nPascal Schweitzer\n48\nPresident, Transit\nLillian Leroux\n53\nChief Strategy and Sustainability Officer\nJohn A. Mastalerz\n58\nSenior Vice President of Finance and Chief Accounting Officer\nKyra Yates\n46\nVice President, Investor Relations\nRafael Santana \nwas named President and Chief Executive Officer of the Company effective July 1, 2019. Previously, he served as Executive Vice President from February 2019 to July 2019. Mr. Santana was President and Chief Executive Officer of GE Transportation since November 2017. Mr. Santana has held several global leadership positions since joining GE in 2000, including roles in the Transportation, Power and Oil and Gas businesses. Prior to being named President and Chief Executive Officer of GE Transportation, Mr. Santana was President and Chief Executive Officer of GE in Latin America. He also served as President and Chief Executive Officer of GE Oil and Gas Turbomachinery Solutions and had roles as Chief Executive Officer for GE Gas Engines and Chief Executive Officer for GE Energy in Latin America. \nDavid L. DeNinno \nwas named Executive Vice President, General Counsel and Secretary of the Company effective December 2016. Previously, Mr. DeNinno served as Senior Vice President, General Counsel and Secretary since February 2012. Previously, Mr. DeNinno served as a partner at K&L Gates LLP since May 2011 and prior to that with Reed Smith LLP.\nJohn A. Olin\n was named Executive Vice President and Chief Financial Officer effective October 1, 2021. Prior to joining Wabtec, Mr. Olin served as the Senior Vice President and Chief Financial Officer of Harley-Davidson, where he was instrumental in driving strategic change amidst significant market disruption, including reshaping the company. Prior to Harley-Davidson, Mr. Olin served as Controller of Kraft Foods' Cheese Division, and had 12 years of financial leadership at Kraft, Oscar Mayer Foods, and Miller Brewing Company. Mr. Olin also held positions with financial services and specialized consulting firms including Ernst and Whinney (now Ernst and Young).\nNicole Theophilus \nwas named Executive Vice President & Chief Administrative Officer in July 2024. Ms. Theophilus was originally named Wabtec's Executive Vice President & Chief Human Resource Officer in October 2020. Before joining Wabtec, Ms. Theophilus served as Chief Human Resource Officer of West Corporation from March 2016 through February 2018. She also served as Executive Vice President and Chief Human Resource Officer, Vice President of Human Resources and Vice President and Chief Employment Counsel of ConAgra Corporation, where she was employed from 2006 through 2015. Prior to 2006, Ms. Theophilus was a partner with the law firm Husch Blackwell.\nEric Gebhardt \nwas named Executive Vice President and Chief Technology Officer in October 2020. Prior to joining Wabtec, Mr. Gebhardt served as Managing Director of KCK-US, a Delaware corporation, from May 2019 through September 2020. He also served in a variety of roles with General Electric including Chief Technology Officer of GE Power from August 2017 through January 2019, Chief Product Management Officer for GE Energy Connections from February 2017 through August 2017, Chief Platforms and Operations Officer for Current from January 2016 through January 2017, and Chief Technology Officer for GE Oil & Gas from October 2012 through December 2015.\nGina Trombley \nwas named Executive Vice President, Sales & Marketing & Chief Commercial Officer - Americas, effective September 8, 2020. Prior to joining Wabtec, Ms. Trombley served in various executive roles at Bombardier Transportation from 2017 to August 2020, most recently as Vice President of Services and previously as Vice President Sales for Bombardier Transport - Americas. Ms. Trombley also held progressive commercial and marketing leadership roles at Parsons and GE Transportation.\n12\nGreg Sbrocco \nwas named Executive Vice President, Global Operations in February 2019. Prior to this, Mr. Sbrocco was Global Supply Chain Leader for GE Transportation since September 2014. Mr. Sbrocco had been with GE since 1992 when he joined as an Environmental Engineer for the GE Energy business. During his tenure with GE, Mr. Sbrocco held several leadership roles in GE Energy, GE Oil and Gas, and GE Transportation.\nMichael E. Fetsko \nwas named President, Freight and Industrial Components effective January 2017. Previously, Mr. Fetsko served as Vice President and Group Executive from January 2014.  He joined Wabtec in July of 2011 as Vice President, Freight Pneumatics. Prior to joining Wabtec, Mr. Fetsko served in various executive management roles with Bombardier Transportation. Prior to Bombardier, Mr. Fetsko served in various management roles with two different environmental engineering firms. \nAlicia Hammersmith\n was named President, Freight Services in April 2023. Previously, Ms. Hammersmith served as Group Vice President, Transit Operations from 2020-2023 and as General Manager Latin America & Texas from 2019-2020.  Prior to joining Wabtec, Ms. Hammersmith served in various management roles with GE.\nRogerio Mendonca \nwas named President, Freight Equipment in February 2021. Previously Mr. Mendonca served as Vice President for Baker Hughes from July 2017. Prior to that he served as President of GE Transportation in Latin America from April 2016 through July 2017 and in several roles leading up to that including Commercial Director and Service Operations General Manager.\nNalin Jain \nwas named President, Digital Intelligence business effective December 2020. Mr. Jain had served as President, Global Equipment since May 2019 and previously as President & CEO, International Markets since August 2017 for GE Transportation. Prior to that, Mr. Jain had multiple leadership roles of increasing responsibility with GE Aviation and GE Transportation, since September 2005. Mr. Jain served as Director Global Partnerships with Bombardier Inc since July 2002 and prior to that he worked for Saint Gobain. \nPascal Schweitzer \nwas named President, Transit in April 2023. Previously, Mr. Schweitzer served as President, Freight Services from February 2019 to April 2023 and Vice President—Services of GE Transportation from April 2017 to February 2019. He also served as General Manager – Europe – Power Services for GE Power from November 2015 through April 2017 and prior to that several positions with Alstom Power.\nLilian Leroux \nwas named Chief Strategy and Sustainability officer in April 2023. Previously he served as President, Transit from March 2019 to April 2023 and Group President—Brakes & Safety from January 2017 to October 2019. Prior to that, Mr. Leroux held various executive management roles with Faiveley Transport, starting in January 2001.\n \nJohn A. Mastalerz \nwas named Senior Vice President of Finance and Chief Accounting Officer in February 2020.  Previously, Mr. Mastalerz served as Senior Vice President, Corporate Controller and Principal Accounting Officer from July 2017 to February 2020 and as Vice President and Corporate Controller from January 2014 to July 2017. Prior to joining Wabtec, Mr. Mastalerz served in various executive management roles with the H.J. Heinz Company from January 2001 to December 2013, most recently as Corporate Controller and Principal Accounting Officer.  Prior to 2001, Mr. Mastalerz was a Senior Manager with PricewaterhouseCoopers LLP.\nKyra Yates \nwas named Vice President of Investor Relations in March 2024. Previously, Ms. Yates served as the Vice President and Chief Financial Officer of Wabtec's Global Operations from March 2022 to March 2024, where she managed the financial performance of the Company's manufacturing, sourcing, and logistics operations. She also served as the Chief Financial Officer of Wabtec's Americas Services from March 2021 to March 2022. Ms. Yates had been with GE Transportation since 2008, and prior to that she held several positions with other GE businesses beginning in 2000.",
    "item1a": "Item 1A.\nRISK FACTORS\nRISKS RELATED TO OUR BUSINESS AND OPERATIONS\nWe are dependent upon key customers.\nWe rely on several key customers who represent a significant portion of our business. While we believe our relationships with our customers are generally good, our top customers could choose to reduce or terminate their relationships with Wabtec. In addition, many of our customers place orders for products on an as-needed basis and operate in cyclical industries. As a result, customer order levels have varied from period to period in the past and may vary significantly in the future. Such customer orders may be subject to delays and cancellations based on various market- and customer-specific conditions. Furthermore, the average service life of certain products in our end markets has increased in recent years due to innovations in technologies and manufacturing processes, which has also allowed end users to replace parts less often. As a result of our dependence on our key customers, we could experience a material adverse effect on our business, results of operations and financial condition if we lost any one or more of our key customers or if there is a reduction in their demand for our products.\n13\nOur business operates in a highly competitive industry.\nWe operate in a global, competitive marketplace and face substantial competition from a limited number of established competitors, some of which may have greater financial resources than we do, may have a more extensive low-cost sourcing strategy and presence in low-cost regions than we do, or may receive significant governmental support. Price competition is strong and, coupled with the existence of a number of cost-conscious customers with significant negotiating power, has historically limited our ability to increase prices. In addition to price, competition is based on product performance and technological leadership, quality, reliability of delivery, and customer service and support. If our competitors invest heavily in innovation and develop products that are more efficient or effective than our products, we may not be able to compete effectively. There can be no assurance that competition in one or more of our markets will not adversely affect us and our results of operations.\nA failure to predict and react to customer demand could adversely affect our business.\nIf we are unable to accurately forecast demand for our existing products or to react appropriately to changes in demand, we may experience delayed product shipments and customer dissatisfaction. If demand increases significantly from current levels, both we and our suppliers may have difficulty meeting such demand, particularly if such demand increases occur rapidly. Alternatively, we may carry excess inventory if demand for our products decreases below projected levels.\nAdditionally, we have dedicated significant resources to the development, manufacturing and marketing of new products. Decisions to develop and market new transportation products are typically made without firm indications of customer acceptance. Moreover, by their nature, new products may require alteration of existing business methods or threaten to displace existing equipment in which our customers may have a substantial capital investment. There can be no assurance that any new products that we develop will gain widespread acceptance in the marketplace or that such products will be able to compete successfully with other new products or services that may be introduced by competitors. Furthermore, we may incur additional warranty or other costs as new products are tested and used by customers.\nFailure to accurately predict and react to customer demand could have a material adverse effect on our business, results of operations and financial condition.\nWe may fail to respond adequately or in a timely manner to innovative changes in new technology. \nIn recent years, the global transportation landscape has been characterized by rapid changes in technology, leading to innovative developments in transportation and logistics that could change the way the railway industry does business. There may be additional innovations impacting the railway industry that we cannot yet foresee. Any failure by us to quickly adapt to and adopt new innovations in products and processes desired by our customers may result in a significant loss of demand for our product and service offerings. In addition, advances in technology may require us to increase investments in order to remain competitive, and our customers may not be willing to accept higher prices to cover the cost of these investments.\nOur revenues are subject to cyclical variations in the railway and passenger transit markets and changes in government spending.\nThe railway industry historically has been subject to significant fluctuations due to overall economic conditions, the use of alternate methods of transportation and the levels of government spending on railway projects. In economic downturns, railroads have deferred, and may defer, certain expenditures in order to conserve cash in the short term. For example, the economic slowdown that was caused by the COVID-19 pandemic impacted the timing of some orders, as customers deferred the delivery of some goods and services to future years. Reductions in freight traffic may reduce demand for our replacement products.\nThe passenger transit railroad industry is also cyclical and is influenced by a variety of factors. New passenger transit car orders vary from year to year and are influenced by a variety of factors, including major replacement programs, the construction or expansion of transit systems by transit authorities and the quality and cost of alternative modes of transportation. To the extent that future funding for proposed public projects is curtailed or withdrawn altogether as a result of changes in political, economic, fiscal, or other conditions beyond our control, such projects may be delayed or canceled, resulting in a potential loss of business for us, including transit aftermarket and new transit car orders. There can be no assurance that economic conditions will be favorable or that there will not be significant fluctuations adversely affecting the industry as a whole and Wabtec.\nOur backlog is not necessarily indicative of the level of our future revenues.\nOur backlog represents future production and estimated potential revenue attributable to firm contracts with, or written orders from, our customers for delivery in various periods.  Instability in the global economy, negative conditions in the global credit markets, volatility in the industries that our products serve, changes in legislative policy, adverse changes in the financial condition of our customers, adverse changes in the availability of raw materials and supplies, or un-remedied contract breaches could possibly lead to contract termination or cancellations of orders in our backlog or request for deferred deliveries of our backlog orders, each of which could adversely affect our cash flows and results of operations. For example, although the \n14\neconomic slowdown caused by the COVID-19 pandemic did not result in any material cancellations of the Company's backlog, it did impact the timing of some orders in backlog as, in certain cases, the delivery of goods and services were pushed out from their original timelines.\nEquipment failures, interruptions, delays in deliveries or extensive damage to our facilities, supply chains, distribution systems or information technology systems, could adversely affect our business. \nAll of our facilities, equipment, supply chains, distribution systems and information technology systems are subject to the risk of catastrophic loss due to unanticipated events, such as cyber-attacks, disease outbreak, fires, earthquakes, explosions, floods, tornadoes, hurricanes or weather conditions. An interruption in our manufacturing capabilities, supply chains, distribution systems or information technology systems, whether as a result of such catastrophic loss or any other reason, could reduce, prevent or delay our production and shipment of our product offerings, result in defective products or services, damage customer relationships and our reputation and result in legal exposure and large repair or replacement expenses. This could result in the delay or termination of orders, the loss of future sales and a negative impact to our reputation with our customers.\nThird-party insurance coverage that we maintain with respect to such matters will vary from time to time in both type and amount depending on cost, availability and our decisions regarding risk retention, and may be unavailable or insufficient to protect us against losses. Any of these risks coming to fruition could materially adversely affect our business, results of operations and financial condition. \nDisruption of our supply chain could have an adverse impact on our business, financial condition, and results of operations.\nOur ability to make, move, and sell our products is critical to our success. Damage or disruption to our supply chain, including third-party manufacturing or transportation and distribution capabilities, could impair our ability to manufacture or sell our products. Failure to take adequate steps to mitigate the likelihood or potential impact of disruptions, or to effectively manage such events if they occur, particularly when a product is sourced from a single supplier or location, could adversely affect our business or financial results. For example, the COVID-19 pandemic caused supply chain disruptions, particularly with respect to channels in China, India, the U.S. and Europe, and labor availability constraints that resulted in component, raw material and chip shortages. Additionally, market factors, such as broad-based inflation, escalation of commodities costs, transportation and logistics costs, labor costs, and foreign currency exchange rate fluctuations may exacerbate the impacts of such disruptions. \nThere can be no assurance that supply chain disruptions will not occur from time to time, or that the steps we take to mitigate such disruptions will be effective or achieve their desired results in a timely fashion.\nIn addition, disputes with significant suppliers, including disputes regarding pricing or performance, could adversely affect our ability to supply products to our customers and could materially and adversely affect our product sales, financial condition, and results of operations.\nWe intend to pursue acquisitions, joint ventures and alliances that involve a number of inherent risks, any of which may cause us not to realize anticipated benefits.\nOne aspect of our business strategy is to selectively pursue acquisitions, joint ventures and alliances that we believe will improve our market position and provide opportunities to realize operating synergies. These transactions involve inherent risks and uncertainties, any one of which could have a material adverse effect on our business, results of operations and financial condition including:\n•\ndifficulties in achieving identified financial and operating synergies, including the integration of operations, services and products;\n•\ndiversion of management’s attention from other business concerns;\n•\nthe assumption of unknown liabilities; and\n•\nunanticipated changes in the market conditions, business and economic factors affecting such an acquisition, joint venture or alliance.\nIn addition, we may fail to consummate future acquisitions, joint ventures or other business combinations for a variety of reasons, including the failure to satisfy closing conditions, potential regulatory interventions, or the possibility of competing bidders presenting a superior offer. If we are unable to identify or consummate suitable acquisitions or joint ventures, we may be unable to fully implement our business strategy, and our business and results of operations may be adversely affected as a result. In addition, our ability to engage in such strategic transactions will be dependent on our ability to raise substantial capital, and we may not be able to raise the funds necessary to implement this strategy on terms satisfactory to us, if at all.\nThe integration of our recently completed acquisitions may not result in anticipated improvements in market position or the realization of anticipated operating synergies or may take longer to realize than expected.\nAlthough we believe that our recent acquisitions will improve our market position and realize positive operating results, including operating synergies, operating expense reductions and overhead cost savings, we cannot be assured that these \n15\nimprovements will be obtained or the timing of such improvements. The management and acquisition of businesses involves substantial risks, any of which may result in a material adverse effect on our business and results of operations, including:\n•\nthe uncertainty that an acquired business will achieve anticipated operating results;\n•\nsignificant expenses to integrate;\n•\ndiversion of management’s attention from business operations to integration matters;\n•\ndeparture of key personnel from the acquired business;\n•\neffectively managing entrepreneurial spirit and decision-making;\n•\nintegration of different information systems;\n•\nunanticipated costs and exposure to unforeseen liabilities; and\n•\nimpairment of assets.\nThe effects of potential future public health crises, epidemics, pandemics or similar events on our business, operating results and cash flows are uncertain.\nWe face a wide variety of risks related to health epidemics, pandemics and similar outbreaks. As was evidenced by the COVID-19 pandemic, public health crises have the potential to dramatically impact the global health and economic environment and to trigger significant economic volatility and operational uncertainty.\nFuture public health emergencies, and unpredictable responses by authorities around the world could negatively impact our global operations, customers and suppliers. Any future public health crises, epidemics, pandemics or similar events could result in disruptions to our operations, including higher rates of employee absenteeism and supply chain disruptions, decreased demand for our products, volatility in financial markets, and overall deterioration of national and global economic conditions.\nGiven the tremendous uncertainties and variables associated with public health crises, we cannot predict the impact of such events, but any one could have a material adverse impact on our business, financial position, results of operations and/or cash flows.\nRISKS RELATED TO INTERNATIONAL OPERATIONS\nA significant portion of our sales may be derived from our international operations, which exposes us to certain risks inherent in doing business on an international level.\nFor the fiscal year ended December 31, 2024, approximately 53% of our consolidated net sales were to customers outside of the United States. We intend to continue to expand our international operations, including in emerging markets, in the future. Our global headquarters for the Transit group is located in France, and we conduct other international operations through a variety of wholly and majority-owned subsidiaries and joint ventures, including in Australia, Austria, Brazil, Canada, China, Czech Republic, France, Germany, India, Italy, Kazakhstan/Commonwealth of Independent States (\"CIS\"), the Republic of North Macedonia, Mexico, the Netherlands, Poland, Spain, South Africa, Turkey, and the United Kingdom. As a result, we are subject to various risks, any one of which could have a material adverse effect on those operations and on our business as a whole, including:\n•\nlack of complete operating control;\n•\nlack of local business experience;\n•\ncurrency exchange fluctuations and devaluations;\n•\nrestrictions on currency conversion or the transfer of funds or limitations on our ability to repatriate income or capital;\n•\nthe complexities of operating within multiple tax jurisdictions;\n•\nforeign trade restrictions and exchange controls;\n•\nadverse impacts of international trade policies, such as import quotas, capital controls or tariffs;\n•\ndifficulty enforcing agreements and intellectual property rights;\n•\nthe challenges of complying with complex and changing laws, regulations, and policies of foreign governments;\n•\nthe difficulties involved in staffing and managing widespread operations;\n•\nthe potential for nationalization of enterprises;\n•\neconomic, political and social instability;\n•\npotential reputational harm associated with doing business in certain countries;\n•\npossible local catastrophes, such as natural disasters and epidemics; and \n•\npossible terrorist attacks, conflicts and wars, including actions targeting American interests.\nOur exposure to the risks associated with international operations may intensify if our international operations expand in the future.\nWe may incur increased costs or margin degradation due to fluctuations in interest rates and foreign currency exchange rates.\nIn the ordinary course of business, we are exposed to increases in interest rates that may adversely affect funding costs associated with variable-rate debt and changes in foreign currency exchange rates. We are subject to currency exchange rate \n16\nrisk to the extent that our costs may be denominated in currencies other than those in which we earn and report revenues and vice versa. In addition, a decrease in the value of any of these currencies relative to the U.S. dollar could reduce our profits from non-U.S. operations and the translated value of the net assets of our non-U.S. operations when reported in U.S. dollars in our consolidated financial statements. We may seek to minimize these risks through the use of interest rate swap contracts and currency hedging agreements. There can be no assurance that any of these measures will be effective. Material changes in interest or exchange rates could result in material losses to us.\nWe have substantial operations located in emerging markets, and are subject to regulatory, economic, social and political uncertainties in such markets.\nWe have substantial operations located in emerging markets, such as Brazil, India, and Kazakhstan. Operations in such emerging markets are inherently risky due to a number of regulatory, economic, social and political uncertainties. These risks include economies that may be dependent on only a few products and are therefore subject to significant fluctuations, weak legal systems which may affect our ability to enforce contractual rights, possible exchange controls, unstable governments, nationalization or privatization actions or other government actions affecting the flow of goods and currency.  \nSignificant changes in economic and regulatory policy in emerging countries as well as social or political uncertainties could significantly harm business and economic conditions in these markets generally and could disproportionately impact the rail industry, which could adversely affect our business and prospects in these markets.\nIn addition, physical and financial infrastructure may be less developed in some emerging countries than that of many developed nations. Any disruptions with respect to banking and financial infrastructure, communication systems or any public facility, including transportation infrastructure, could disrupt our normal business activity.  Such disruptions could interrupt our business operations and significantly harm our results of operations, financial condition and cash flows.\nRegional and international conflicts may adversely affect our business and results of operations.\nGiven the nature of our business and our global operations, political, economic, and other conditions in foreign countries and regions, may adversely affect our business and results of operations.  Regional and international conflicts could have a wide range of negative consequences, including causing damage or disruption to international commerce, disruptions to transportation and distribution routes, volatility in commodity markets, supply chain disruptions, business disruptions (including labor shortages), foreign currency dislocations or broader regional instability.\nFor example, the continuing conflict between Russia and Ukraine has affected, and may continue to adversely affect our business and results of operations. The broader consequences of this conflict, which may include sanctions, embargoes, regional instability, and geopolitical shifts; disruptions to transportation and distribution routes, or strategic decisions to alter certain routes; potential retaliatory action by the Russian government against companies, including us, including nationalization of foreign businesses and/or assets in Russia; increased tensions between the United States and countries in which we operate; and the extent of the conflict’s effect on our business and results of operations as well as the global economy, cannot be predicted.\nAdditionally, Wabtec has operations in Kazakhstan that have continued operating but have incurred supply, distribution and currency impacts as an indirect result from the Russian invasion of Ukraine. To date, the operations in Kazakhstan have not been significantly impacted by the ongoing conflict outside of the overall unfavorable impact to economic conditions; however, the future impact to these operations cannot be predicted.\nTo the extent a regional or international conflict adversely affects our business, particularly in Russia and Kazakhstan, it may also have the effect of heightening many other risks disclosed in this Annual Report, any of which could materially and adversely affect our business and results of operations. Such risks include, but are not limited to, adverse effects on macroeconomic conditions, including inflation and business spending; disruptions to our global technology infrastructure, including through cyberattack, ransom attack, or cyber-intrusion; adverse changes in international trade policies and relations; our ability to maintain or increase our prices, our ability to implement and execute our business strategy, disruptions in global supply chains, our exposure to foreign currency fluctuations, and constraints, volatility, or disruption in the capital markets, difficulty staffing and managing impacted operations, and the recoverability of assets in the region.\nRISKS RELATED TO MACRO-ECONOMIC CONDITIONS AND POLICIES\nProlonged unfavorable economic and market conditions could adversely affect our business.\nUnfavorable general economic and market conditions in the United States and internationally, particularly in our key end markets, could have a negative impact on our sales and operations. To the extent that these factors result in continued instability of capital markets, shortages of raw materials or component parts, longer sales cycles, deferral or delay of customer orders or an inability to market our products effectively, our business and results of operations could be materially adversely affected.\n17\nWe may be exposed to raw material shortages, supply shortages, fluctuations in raw material, energy and commodity prices, and inflationary pressure. \nWe purchase energy, steel, aluminum, copper, rubber and rubber-based materials, chemicals, polymers and other key manufacturing inputs from outside sources, and traditionally have not had long-term pricing contracts with our pure raw material suppliers. The costs of these raw materials have been volatile historically and are influenced by factors that are outside our control, including inflationary pressure. If we are unable to pass increases in the costs of our raw materials on to our customers, experience a lag in our ability to pass increases to our customers, or operational efficiencies are not achieved, our operating margins and results of operations may be materially adversely affected. \nOur businesses compete globally for key production inputs. In addition, we rely upon third-party suppliers, including certain single-sourced suppliers, for various components for our products. In the event of a shortage or discontinuation of certain raw materials or key inputs, we may experience challenges sourcing certain of our components to meet our production requirements and may not be able to arrange for alternative sources of certain raw materials or key inputs. Any such shortage may materially adversely affect our competitive position versus companies that are able to better or more cheaply source such raw materials or key inputs.\nChanges to international trade policies, including tariffs and foreign trade restrictions, could adversely affect our business. \nAs a global transportation company, we generate export sales from our U.S. operations and also derive international sales through our foreign subsidiaries, licensees and joint ventures. We also do business with industry suppliers located in various international markets. A protectionist trade environment in either the United States or those foreign countries in which we do business, such as a change in the current tariff structures, export compliance or other trade policies, may adversely affect our business. In particular, such policies may impact or delay our customers' investments in our products, reduce the competitiveness of our products in certain markets, and inhibit our ability to cost-effectively purchase necessary inputs from certain suppliers. In addition, to the extent developments in international trade relations result in reduced global trade or slower growth in global trade, it is likely that this would result in reductions in investment in freight and transit rail. \nInternational trade policies are affected by a diverse array of factors, including global and national economic and political conditions, which make it impossible for us to predict future developments regarding tariffs and other trade restrictions. Although we actively monitor developments in international trade and proactively engage in efforts to mitigate the effect of trade policies, there can be no guarantee that these efforts will be successful.\nLEGAL AND REGULATORY RISKS\nWe are subject to a variety of laws and regulations, including anti-corruption laws, in various jurisdictions.\nWe are subject to various laws, rules and regulations administered by authorities in jurisdictions in which we do business, such as the anti-corruption laws of the U.S. Foreign Corrupt Practices Act, the French Law n° 2016-1691 (Sapin II) and the U.K. Bribery Act, relating to our business and our employees. We are also subject to other laws and regulations governing our international operations, including regulations administered by the U.S. Department of Commerce’s Bureau of Industry and Security, the U.S. Department of Treasury’s Office of Foreign Assets Control, and various non-U.S. government entities, including applicable export control regulations, economic sanctions on countries and persons, customs requirements, currency exchange regulations, and transfer pricing regulations. Despite our policies, procedures and compliance programs, our internal controls and compliance systems may not be able to protect us from prohibited acts willfully committed by our employees, agents or business partners that would violate such applicable laws and regulations. Any such improper acts could damage our reputation, subject us to civil or criminal judgments, fines or penalties, and could otherwise disrupt our business, and as a result, could materially adversely impact our business, results of operations and financial condition. \nIn addition, our manufacturing operations and products are subject to safety, operations, maintenance and mechanical standards, rules and regulations enforced by various federal and state agencies and industry organizations both domestically and internationally. Our business may be adversely impacted by new rules and regulations or changes to existing rules or regulations, which could require additional maintenance or substantial modification or refurbishment of certain of our products or could make such products obsolete or require them to be phased out prior to their useful lives. We are unable to predict what impact these or other regulatory changes may have, if any, on our business or the industry as a whole. We cannot assure that costs incurred to comply with any new standards or regulations will not be material to our business, results of operations and financial condition.\nWe are subject to a variety of environmental laws and regulations.\nWe are subject to a variety of increasingly stringent environmental laws and regulations governing air emissions, discharges into water, chemical substances in products, the use, handling, storage, and disposal of hazardous substances or waste materials, as well as the remediation of contamination associated with releases of hazardous substances. We have incurred, and will continue to incur, both operating and capital costs to comply with environmental laws and regulations, \n18\nincluding costs associated with the clean-up and investigation of some of our current and former properties and offsite disposal locations. We believe our operations currently comply in all material respects with all of the various environmental laws and regulations applicable to our business; however, there can be no assurance that environmental requirements will not change in the future or that we will not incur significant costs to comply with such requirements. Failure to comply with environmental laws and regulations could have significant consequences on our business and results of operations, including the imposition of substantial fines and sanctions for violations, injunctive relief (including requirements that we limit or cease operations at affected facilities), and reputational risk. \nIn addition, certain of our products are subject to extensive, and increasingly stringent, statutory and regulatory requirements governing attributes, such as emissions and noise, including standards imposed by the U.S. Environmental Protection Agency, the European Union and other regulatory agencies around the world. We have made, and will continue to make, significant capital and research expenditures relating to compliance with these standards. The successful development and introduction of new and enhanced products in order to comply with new regulatory requirements are subject to other risks, such as delays in product development, cost over-runs and unanticipated technical and manufacturing difficulties. In addition to these risks, the nature and timing of government implementation and enforcement of these standards-particularly in emerging markets-are unpredictable and subject to change.\nFuture climate change regulation could result in increased operating costs, affect the demand for our products or affect the ability of our critical suppliers to meet our needs.\nPotential regulation addressing climate change may affect the Company's operations and products in certain jurisdictions. The potential challenges posed by evolving climate change policy and prospective regulation are heavily dependent on the nature and degree of such legislation, the consistency (or lack of consistency) of legislation across jurisdictions in which we operate, and the extent to which such regulation and legislation applies to our industry. Although uncertain, these developments could increase costs or reduce the demand for the products the company sells. \nInternational agreements, domestic legislation and regulatory measures to limit greenhouse gas emissions are currently in various phases of discussion or implementation. While we are carefully monitoring developments, at this time, we cannot predict the ultimate impact of climate change and climate change regulation on our operations. Any laws or regulations that may be adopted to restrict or reduce emissions of greenhouse gas could require us to incur increased operating costs and could have an adverse effect on demand for our products. In addition, the price and availability of certain of the raw materials that we use could vary in the future as a result of environmental laws and regulations affecting our suppliers. An increase in the price of our raw materials or a decline in their availability could adversely affect our operating margins or result in reduced demand for our products.\nThe occurrence of litigation in which we are, or could be, named as a defendant is unpredictable.\nFrom time to time, we are subject, directly or through our subsidiaries, to litigation or other commercial disputes and other legal and regulatory proceedings with respect to our business, customers, suppliers, creditors, stockholders, product liability (including asbestos claims), intellectual property infringement, competition and antitrust claims, warranty claims or environmental-related matters. \nDue to the inherent uncertainties of any litigation, commercial disputes or other legal or regulatory proceedings, we cannot accurately predict their ultimate outcome, including the outcome of any related appeals. We may incur significant expense to defend or otherwise address current or future claims. Although we maintain insurance policies for certain risks, we cannot make assurances that this insurance will be adequate to protect us from all material judgments and expenses related to potential future claims or that these levels of insurance will be available in the future at economical prices or at all.  In addition, although in some cases we may be indemnified by non-affiliated entities that retain liabilities in connection with specific matters, there can be no assurance that these indemnitors will remain financially viable and capable of satisfying their obligations.  \nAny litigation, even a claim without merit, could result in substantial costs and diversion of resources and could have a material adverse effect on our business and results of operations.\nOur manufacturer’s warranties or product liability may expose us to potentially significant claims.\nWe warrant the workmanship and materials of many of our products. Accordingly, we are subject to a risk of product liability or warranty claims in the event that the failure of any of our products results in personal injury or death or does not conform to our customers’ specifications. In addition, in recent years, we have introduced a number of new products for which we do not have a history of warranty experience. Although we currently maintain liability insurance coverage, we cannot assure that product liability claims, if made, would not exceed our insurance coverage limits or that insurance will continue to be available on commercially acceptable terms, if at all. The possibility exists for these types of warranty claims to result in costly product recalls, significant repair costs and damage to our reputation.\n19\nExpectations relating to environmental, social and governance considerations expose us to potential liabilities, increased costs, reputational harm, and other adverse effects on our business.\n \nMany governments, regulators, investors, employees, customers and other stakeholders are focused on environmental, social and governance considerations relating to businesses, including climate action and greenhouse gas emissions, supply chain due diligence, human capital management, and diversity initiatives. We make statements about our ESG goals and initiatives through information provided in reports that we file or furnish with the Securities and Exchange Commission, on our website, in press statements, and in other communications, including through our Sustainability Reports. Our response to these ESG considerations and the implementation of these goals and initiatives involves risks and uncertainties, including those described under “Forward-Looking Statements,” and such response may be impacted by factors that are outside our control. In addition, some stakeholders may disagree with our goals and initiatives and the focus of stakeholders may change and evolve over time. Stakeholders also may have different views on the relative prioritization of the Company's ESG focus, including differing views of regulators in various jurisdictions in which we operate. Any failure, or perceived failure, by us to achieve our goals, further our initiatives, adhere to our public statements, comply with federal, state or international environmental, social and governance laws and regulations, or meet evolving and varied stakeholder expectations and standards could result in legal and regulatory proceedings against us and materially adversely affect our business, reputation, results of operations, financial condition, and stock price.\nRISKS RELATED TO DATA SECURITY AND INTELLECTUAL PROPERTY\nIf we are not able to protect our intellectual property and other proprietary rights, we may be adversely affected.\nOur success can be impacted by our ability to protect our intellectual property and other proprietary rights. We rely primarily on patents, trademarks, copyrights, trade secrets and unfair competition laws, as well as license agreements and other contractual provisions, to protect our intellectual property and other proprietary rights. However, filing, prosecuting and defending patents on our products in all countries and jurisdictions throughout the world would be prohibitively expensive. Moreover, existing U.S. legal standards relating to the validity, enforceability and scope of protection of intellectual property rights offer only limited protection, may not provide us with any competitive advantages and may be challenged by third parties. The laws of countries other than the United States may be even less protective of intellectual property rights. As a result, a significant portion of our technology is not patented, and we may be unable or may not seek to obtain patent protection for this technology. Further, although we routinely conduct anti-counterfeiting activities in multiple jurisdictions, we have encountered counterfeit reproductions of our products or products that otherwise infringe on our intellectual property rights. Counterfeit components of low quality may negatively impact our brand value. Accordingly, despite our efforts, we may be unable to prevent third parties from infringing upon, counterfeiting or misappropriating our intellectual property or otherwise gaining access to our technology. If we fail to protect our intellectual property and other proprietary rights, then our business, results of operations and financial condition could be negatively impacted.\nIn addition, we operate in industries in which there are many third-party owners of intellectual property rights. Owners of intellectual property that we need to conduct our business as it evolves may be unwilling to license such intellectual property rights to us on terms we consider reasonable. Third party intellectual property owners may assert infringement claims against us based on their intellectual property portfolios. If we are sued for intellectual property infringement, we may incur significant expenses investigating and defending such claims, even if we prevail.\nWe face cyber-security and data protection risks relating to cyber-attacks and information technology failures that could cause loss of confidential information and other business disruptions.\nWe rely extensively on the security, stability, and availability of technology systems in our business. We also collect, process, and retain sensitive and confidential customer information, including proprietary business information, personal data and other information that may be subject to privacy and security laws, regulations and/or customer-imposed data protection controls. Our business may be adversely impacted by unintentional technology disruptions, including those resulting from programming errors, employee operational errors, software defects, and product vulnerabilities.\nWe also provide technological products integral to train operation. Accordingly, our business may be adversely impacted by disruptions to our own or third-party information technology infrastructure, which could result from cybersecurity incidents, including, but not limited to, unauthorized access to the Company’s information technology systems, data access or acquisition, and/or encryption of the Company’s environment. \nFor instance, we have experienced cyber-security incidents that have impacted the Company's network. We have also been indirectly affected by vulnerabilities in third-party systems used for certain Wabtec products. In each instance, the Company has promptly activated incident response protocols and completed a thorough investigation. Such incidents have not had a material impact on our business, operations or financial results. However, a successful exploitation of our own or our vendors’ information technology infrastructure could result in service interruptions, safety hazards, misappropriation of confidential information, process failures, security breaches or other operational difficulties. Such an event could result in \n20\ndecreased revenues and increased capital, insurance or operating costs, including the increased costs of security to protect the Company’s infrastructure, among other results. Insurance maintained by the Company to protect against loss of business and other related consequences resulting from cyber incidents may not be sufficient to cover all damages. A disruption or compromise of the Company’s technology systems, even for short periods of time, could have a material adverse effect. \nRISKS RELATED TO HUMAN CAPITAL\nLabor shortages and labor disputes may have a material adverse effect on our operations and profitability.\nWe depend on skilled labor in our manufacturing and other businesses. Due to the competitive nature of the labor markets in which we operate, we may not be able to retain, recruit and train the personnel we require, particularly when the economy expands, production rates are high or competition for such skilled labor increases.\nWe collectively bargain with labor unions at some of our operations throughout the world.  Failure to reach an agreement could result in strikes or other labor protests which could disrupt our operations. Furthermore, non-union employees in certain countries have the right to strike.  If we were to experience a strike or work stoppage, it could be difficult for us to find a sufficient number of employees with the necessary skills to replace these employees. We cannot assure that we will reach any such agreement or that we will not encounter strikes or other types of conflicts with the labor unions of our personnel. \nAny such labor shortages or labor disputes could have an adverse effect on our business, results of operations and financial condition, could cause us to lose revenues and customers and might have permanent effects on our business.\nWe rely on our management team and other key personnel.\nWe depend on the skills, working relationships, and continued services of key personnel, including our experienced management team, and other key employees. In addition, our ability to achieve our operating goals depends on our ability to identify, hire, train, and retain qualified individuals. We compete with other companies both within and outside of our industry for talented personnel, and we may lose key personnel or fail to attract, train, and retain other talented personnel. Any such loss or failure could adversely affect our product sales, financial condition, and operating results. If we lose key personnel, because they terminate their employment or retire, or as a result of illness, disability or death, or if an insufficient number of employees is retained to maintain effective operations, our business activities may be adversely affected and our management team's attention may be diverted. In addition, we may not be able to locate suitable replacements for any key personnel that we lose, or we may not be able to hire potential replacements on reasonable terms, all of which could adversely affect our product sales, financial condition, and operating results.\nRISKS RELATED TO OUR INDEBTEDNESS\nOur indebtedness could adversely affect our financial health.\nAt December 31, 2024, we had total debt of $4.0 billion, primarily related to Senior Notes, and the 2022 and 2024 Credit Agreements (\"Credit Agreements\"). Being indebted could have important consequences to us. For example, our indebtedness could:\n•\nincrease our vulnerability to general adverse economic and industry conditions;\n•\nrequire us to dedicate a substantial portion of our cash flow from operations to payments on our indebtedness, thereby reducing the availability of our cash flow to fund working capital, capital expenditures, acquisitions, and other general corporate purposes;\n•\nlimit our flexibility in planning for, or reacting to, changes in our business and the industries in which we operate;\n•\nplace us at a disadvantage compared to competitors that have less debt; \n•\nlimit our ability to borrow additional funds; and,\n•\nresult in higher borrowing costs impacting our financial results upon refinancing any of our maturing debt.\nMoreover, our Credit Agreements and the indentures governing our Senior Notes permit us to incur substantial additional indebtedness, which may further contribute to, or exacerbate the impact of, the foregoing impacts. \nThe indentures for our outstanding Senior Notes and our 2022 and 2024 Credit Agreements contain various covenants that limit our management’s discretion in the operation of our businesses.\nOur Credit Agreements subject us to customary (i) affirmative covenants, including requirements with respect to certain reporting obligations on us and our subsidiaries, and (ii) negative covenants, including limitations on: indebtedness; liens; restricted payments; fundamental changes (including certain changes in control); business activities; transactions with affiliates; restrictive agreements; changes in fiscal year; and use of proceeds. In addition, we are required to maintain (i) an Interest Coverage Ratio of at least 3.00 to 1.00, calculated using an earning metric as defined in the agreement compared to Interest Expense for the four quarters then ended and (ii) a Leverage Ratio, calculated by net debt (total debt, net of up to $300 million of unrestricted cash) as of the last day of such fiscal quarter to the defined earnings metric for the four quarters then ended, of 3.5 or less. All terms are as defined in the Credit Agreements.\n21\nThe indentures under which our Senior Notes were issued contain covenants and restrictions which limit, subject to certain exceptions, certain sale and leaseback transactions with respect to principal properties, the incurrence of secured debt without equally and ratably securing the senior notes and certain merger and consolidation transactions. In addition, the indentures require that we offer to repurchase our outstanding Senior Notes upon the occurrence of certain change of control triggering events.",
    "item1b": "Item 1B.\nUNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "Item 1C.\nCYBERSECURITY\nRisk Management and Strategy\nThe security of the Company’s products, data, services and network is a critical priority. \nTo effectively assess, identify and manage material risks associated with cybersecurity threats, the Company has \nadopted a comprehensive approach\n with respect to acceptable use, risk management, data privacy, education and awareness, security incident management and reporting, identity and access management, third-party management, security (with respect to physical assets, products, networks and systems), security monitoring and vulnerability identification.\n The Company has, and continues to, invest in internal and external tools to better detect, patch, monitor, and restore systems. Further, the Company maintains cybersecurity insurance coverage intended to protect against loss of business and other related consequences resulting from cyber incidents.\nThe Company also maintains a global incident response plan and regularly conducts exercises to help with our overall preparedness. \nThe Company takes measures to improve and update our cybersecurity program, including independent third party assessments, penetration testing and scanning of our systems for vulnerabilities.\n The Company pairs with assessors, consultants, auditors, and other third-party service providers and advisers to assist in monitoring cybersecurity risks.  \nThe Company remains committed to preserving the integrity of its network, while remaining adaptable to identify new and emerging threats relying on both internal and external research and intelligence gathering. The Company has instituted a Cybersecurity Awareness Month program and the Cybersecurity Champion Network for continuous improvement via trainings and continued awareness on emerging cybersecurity risks.\n \nDuring 2022, the Company detected a cyber-security incident which impacted the Company’s network. The Company promptly activated incident response protocols and completed a thorough investigation. The incidents did not have a material impact on our business, operations or financial results.\nGovernance\n \nThe Company and its Board understands the importance of maintaining a secure environment for our products, data and systems that effectively supports our business objectives and customer needs. \nCybersecurity risks are overseen by the \nAudit Committee\n of the Board.\n \nThe Senior Vice-President and Chief Information Officer (“CIO”) and Chief Information Security Officer (“CISO”)\n provide ongoing and continuing reports to the Audit Committee, which includes information about cyber-risk management, the effectiveness of the Company’s cybersecurity framework, and benchmarking the Company against its industry peers.\n The CISO is responsible for navigating cyber risks, data access governance, security governance and global regulatory compliance related to cybersecurity regulations and industry standards. The Company also has a Chief Product Security Officer (“CPSO”) who manages imbedding cybersecurity in the Company’s products and services as they are being developed.\n \nThe Company’s CIO, CISO, and cybersecurity team collectively have decades of experience in various roles managing information security, developing cybersecurity strategy, and implementing, planning and operationalizing a comprehensive global IT infrastructure.\n Our CIO and CISO maintain relevant degrees, certifications, and trainings while also being recognized as experts in their respective fields by industry leaders.  \nThe Company also conducts ongoing cyber security reviews which includes updates on the Company’s enterprise cybersecurity risk and product cybersecurity risk. Risk is assessed utilizing internal key performance indicators and external evaluations to determine the Company’s cybersecurity score in comparison to its peer group. Wabtec's Board of Directors participates in all enterprise annual security awareness training and phishing campaigns. Throughout the year, as appropriate, in addition to regularly scheduled updates, the Audit Committee, CIO, and CISO maintain an ongoing dialogue regarding the Company’s cybersecurity risk and posture. The cybersecurity framework is also supported by Wabtec's broader enterprise risk management process to ensure alignment of the Company’s cybersecurity efforts with the Company’s overall enterprise risk management.\n \n22"
  }
}