{
  "ticker": "WAT",
  "cik": "0001000697",
  "company_name": "WATERS CORP /DE/",
  "filing_date": "2025-02-25",
  "accession": "0001193125-25-034579",
  "primary_doc": "d791800d10k.htm",
  "item_sections": {
    "item1": "Item 1:\n Business\n \n \nGeneral \n \nWaters Corporation (the “Company,” “Waters,” “we,” “our,” or “us”), a global leader in analytical instruments and software, has pioneered innovations in chromatography, mass spectrometry and thermal analysis serving life, materials and food sciences for more than 65 years. With approximately 7,600 employees worldwide, Waters operates directly in over 35 countries and has products available in more than 100 countries. The Company primarily designs, manufactures, sells and services high-performance liquid chromatography (“HPLC”), ultra-performance liquid chromatography (“UPLC” and together with HPLC, referred to as “LC”) and mass spectrometry (“MS”) technology systems and support products, including chromatography columns, other consumable products and comprehensive post-warranty service plans. These systems are complementary products that are frequently employed together \n(“LC-MS”)\n and sold as integrated instrument systems using common software platforms. In addition, the Company designs, manufactures, sells and services thermal analysis, rheometry and calorimetry instruments through its TA Instruments\nTM\n (“TA”) product line. The Company is also a developer and supplier of advanced software-based products that interface with the Company’s instruments, as well as other manufacturers’ instruments. \n \nThe Company’s products are used by pharmaceutical, clinical, biochemical, industrial, nutritional safety, environmental, academic and governmental customers working in research and development, quality assurance and other laboratory applications. LC is a standard technique and is utilized in a broad range of industries to detect, identify, monitor and measure the chemical, physical and biological composition of materials, and to purify a full range of compounds. MS technology, principally in conjunction with chromatography, is employed in drug discovery and development, including clinical trial testing, the analysis of proteins in disease processes (known as “proteomics”), nutritional safety analysis and environmental testing. \nLC-MS\n instruments combine a liquid phase sample introduction and separation system with mass spectrometric compound identification and quantification. The Company’s thermal analysis, rheometry and calorimetry instruments are used in predicting the suitability and stability of fine chemicals, pharmaceuticals, water, polymers, metals and viscous liquids for various industrial, consumer goods and healthcare products, as well as for life science research. \n \nWaters Corporation, organized as a Delaware corporation in 1991, is a holding company that owns all of the outstanding common stock of Waters Technologies Corporation, its operating subsidiary. Waters Corporation became a publicly traded company with its initial public offering (“IPO”) in November 1995. Since the IPO, the Company has added three significant and complementary technologies to its range of products with the acquisitions of TA Instruments in May 1996, Micromass Limited in September 1997 and Wyatt Technology in May 2023. \n \nBusiness Segments\n \nThe Company’s business activities, for which discrete financial information is available, are regularly reviewed and evaluated by the chief operating decision maker. As a result of this evaluation, the Company determined that it has two operating segments: Waters and TA. The Waters operating segment is primarily in the business of designing, manufacturing, selling and servicing LC and MS instrument systems, columns and other precision chemistry consumables that can be integrated and used along with other analytical instruments. The TA operating segment is primarily in the business of designing, manufacturing, selling and servicing thermal analysis, rheometry and calorimetry instruments. The Company’s two operating segments have similar economic characteristics; product processes; products and services; types and classes of customers; methods of distribution; and regulatory environments. Because of these similarities, the two segments have been aggregated into one reporting segment for financial statement purposes. Operations of the Wyatt business are part of the Waters operating segment. \n \nInformation concerning revenues and long-lived assets attributable to each of the Company’s products, services and geographic areas is set forth in Note 17 in the Notes to the Consolidated Financial Statements, which is incorporated herein by reference. \n\n\n \n \n1 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\n\n\nWaters Products and Markets \n \nHigh-Performance and Ultra-Performance Liquid Chromatography\n \nHPLC is a standard technique used to identify and analyze the constituent components of a variety of chemicals and other materials. The Company believes that HPLC’s performance capabilities enable it to separate, identify and quantify a high proportion of all known chemicals. As a result, HPLC is used to analyze substances in a wide variety of industries for research and development purposes, quality control and process engineering applications. \n \nThe most significant \nend-use\n markets for HPLC are those served by the pharmaceutical and life science industries. In these markets, HPLC is used extensively to understand diseases, identify new drugs, develop manufacturing methods and assure the potency and purity of new pharmaceuticals. HPLC is also used in a variety of other applications, such as analyses of foods and beverages for nutritional labeling and compliance with safety regulations and the testing of water and air purity within the environmental testing industry, as well as applications in other industries, such as chemical and consumer products. Waters also has in-vitro diagnostic labelled products that are used as general-purpose instruments for clinical diagnostic applications, such as newborn screening and therapeutic drug management, in countries where these products are registered. HPLC is also used by universities, research institutions and governmental agencies, such as the United States Food and Drug Administration (“FDA”) and the United States Environmental Protection Agency (“EPA”) and their foreign counterparts that mandate safety and efficacy testing. \n \nIn 2004, Waters introduced a novel technology that the Company describes as ultra-performance liquid chromatography that utilizes a packing material with small, uniform diameter particles and a specialized instrument, the ACQUITY\nTM\n UPLC\nTM\n System, to accommodate the increased pressure and narrower chromatographic bands that are generated by these small and tightly packed particles. By using the ACQUITY UPLC System, researchers and analysts are able to achieve more comprehensive chemical separations and faster analysis times in comparison with many analyses previously performed by HPLC. In addition, in using the ACQUITY UPLC System, researchers have the potential to extend the range of applications beyond that of HPLC, enabling them to uncover more levels of scientific information. While offering significant performance advantages, the ACQUITY UPLC System is also compatible with the Company’s software products and the general operating protocols of HPLC. For these reasons, the Company’s customers and field sales and support organizations are well positioned to utilize this innovative technology and instrument. \n \nWaters manufactures LC instruments that are offered in configurations that allow for varying degrees of automation, from component configured systems for academic teaching and research applications to fully automated systems for regulated and high sample throughput testing, and that have a variety of detection technologies, from optical-based ultra-violet absorbance, refractive index and fluorescence detectors to a suite of \nMS-based\n detectors, optimized for certain analyses. \n \nDuring the second half of 2023, Waters introduced the DynaPro\nTM\n ZetaStar\nTM\n instrument through its Wyatt Technology\nTM\n portfolio for nanoparticle analysis. The new instrument simultaneously enables dynamic and static light scattering and dynamic and electrophoretic light scattering measurements, all in one device. By combining multiple light scattering techniques and automatically assessing data quality and performing adaptive data capture, the ZetaStar instrument delivers both increased sensitivity and faster measurements to aid the precise development of complex biologics, using extremely low sample volumes. \n \nIn 2024, the Company introduced HPLC CONNECT software, an \nall-in-one\n software platform that enables full digital synchronization between Waters high- and ultra-performance liquid chromatography (HPLC/UPLC) systems and multi-angle light-scattering instruments (MALS) from its Wyatt Technology\n™\n portfolio. The software delivers \nease-of-use,\n greater efficiency, and higher confidence for scientists performing size exclusion chromatography and MALS \n(SEC-MALS)\n analyses for complex and critical biopharmaceutical innovations, including antibody drug conjugates, other complex protein conjugates, and gene therapies. \n\n\n \n \n2 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\n\n\nThe primary consumable products for LC instruments are chromatography columns. These columns are packed with separation media used in the LC testing process and are typically replaced at regular intervals. The chromatography column contains one of several types of packing material, typically stationary phase particles made from silica or polymeric resins. As a pressurized sample is introduced to the column inlet and permeates through the packed column, it is separated into its constituent components. \n \nThe Company’s precision chemistry consumable products also include environmental and nutritional safety testing products, including Certified Reference Materials and Proficiency Testing products. Laboratories around the world and across multiple industries use these products for quality control and proficiency testing and purchase product support services required to help with their federal and state mandated accreditation requirements or with quality control over critical pharmaceutical analysis. \n \nWaters HPLC columns can be used on Waters-branded and competitors’ LC systems. The Company believes that it is one of a few suppliers in the world that manufactures silica and polymeric resins, packs columns and distributes its own products. In doing so, the Company believes it can better ensure product consistency, a key attribute for its customers in quality control laboratories and can react quickly to new customer requirements. The Company believes that its ACQUITY UPLC Columns are used primarily on its ACQUITY UPLC Systems and, furthermore, that its ACQUITY UPLC Systems primarily use ACQUITY UPLC Columns. \n \nIn 2023, the Company introduced the first in a new line of size exclusion chromatography columns aimed at improving analysis while lowering the cost of gene therapies, specifically adeno-associated viral (“AAV”) vectors. The new Waters XBridge\nTM\n Premier GTx BEH\nTM\n size exclusion chromatography columns double the speed of measuring the potency and safety of AAVs. Combining the columns with light scattering technologies from its Wyatt Technology portfolio deepens the level of information acquired from a single experiment and optimizes the manufacturing of these novel gene delivery vehicles. \n \nThe Company also introduced the Alliance\nTM\n iS HPLC System, the next-generation intelligent HPLC System, designed to reduce compliance risk by adding new levels of proactive error detection, troubleshooting and \nease-of-use.\n When combined with Waters compliance-ready Empower\nTM\n Chromatography Software and eConnect\nTM\n HPLC Columns, the Alliance iS HPLC System streamlines the task of making accurate and precise measurements by detecting and eliminating common errors. In doing so, the Alliance iS HPLC System helps quality control laboratories to consistently meet quality, safety, compliance and \non-time\n product delivery goals. This system also integrates with the cloud-native waters_connect\nTM\n System Monitoring Software enabling real-time monitoring of the Alliance iS HPLC System and any other chromatography instruments controlled by Empower Software. Laboratory managers can view the live status of their HPLC instrument fleet from anywhere and at any time to further improve equipment utilization and overall productivity. In addition, Waters introduced the new bioprocess \nwalk-up\n solutions designed to further simplify biologic sample preparation and analysis. This solution eliminated the need to send bioreactor samples to a central laboratory for analysis making it even easier to accelerate upstream bioprocess development by up to six weeks over traditional methods. \n \nIn 2024, Waters introduced the new Oasis WAX/GCB and GCB/WAX for PFAS Analysis Cartridges with new design features that significantly streamline and expedite sample preparation and analysis of \nper-\n and polyfluoroalkyl substances (“PFAS”). To help ensure accuracy and further confidence in test results, Oasis WAX/GCB and GCB/WAX Cartridges are \nQC-tested\n by an accredited laboratory for low residual PFAS, to reduce or eliminate any time spent troubleshooting potential assay contamination. The Company also introduced the Alliance iS Bio HPLC System with new capabilities that address the operational and analytical challenges of biopharma quality control laboratories. The new HPLC system combines advanced \nbio-separation\n technology and \nbuilt-in\n instrument intelligence features and is designed to help biopharma QC analysts boost efficiency and eliminate up to 40% of common errors, saving time lost by investigating the source of failed runs and \nout-of-specification\n results. In addition, Waters introduced the new GTxResolve Premier Size Exclusion Chromatography 1000Å \n3-micron\n (3 µm) Columns. Waters has implemented a unique combination of novel packing materials and MaxPeakPremier High-Performance Surface technology into the columns to help scientists accelerate the development of gene-based therapeutics, including cell & gene, mRNA and lipid nanoparticles. \n\n\n \n \n3 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\n\n\nMass Spectrometry and Liquid Chromatography-Mass Spectrometry\n \nMS is a powerful analytical technology that is used to identify unknown compounds, to quantify known materials and to elucidate the structural and chemical properties of molecules by measuring the masses of molecules that have been converted into ions. \n \nThe Company is a technology and market leader in the development, manufacture, sale and service of MS instruments and components. These instruments are typically integrated and used along with other complementary analytical instruments and systems, such as LC, chemical electrophoresis and gas chromatography. A wide variety of instrumental designs fall within the overall category of MS instrumentation, including devices that incorporate quadrupole, ion trap, \ntime-of-flight\n (“Tof”), magnetic sector and ion mobility technologies. Furthermore, these technologies are often used in tandem to maximize the speed and/or efficacy of certain experiments. \n \nCurrently, the Company offers a wide range of MS instrument systems utilizing various combinations of quadrupole, Tof and ion mobility designs. These instrument systems are used in drug discovery and development, as well as for environmental, clinical and nutritional safety testing. The overwhelming majority of mass spectrometers sold by the Company are designed to utilize an LC system and a liquid compatible interface (such as an electrospray ionization source) as the sample introduction device. These products supply a diverse market with a strong emphasis on the pharmaceutical, biomedical, clinical, food and beverage and environmental market segments worldwide. \n \nMS is an increasingly important detection technology for LC. The Company’s \nsmaller-sized\n mass spectrometers, such as the single quadrupole detector and the tandem quadrupole detector (“TQD”), are often referred to as LC “detectors” and are typically sold as part of an LC system or as an LC system upgrade. Larger quadrupole systems, such as the Xevo\nTM\n TQ MS System and Xevo \nTQ-S\n MS System, are used primarily for experiments performed for late-stage drug development, including clinical trial testing. Quadrupole \ntime-of-flight\n (“Q-Tof”) instruments, such as the Company’s SYNAPT\nTM\n \nG2-S\n HDMS System, are often used to analyze the role of proteins in disease processes, an application sometimes referred to as “proteomics.” \n \nLC and MS are typically embodied within an analytical system tailored for either a dedicated class of analyses or as a general-purpose analytical device. An increasing percentage of the Company’s customers are purchasing LC and MS components simultaneously and it has become common for LC and MS instrumentation to be used within the same laboratory and operated by the same user. The descriptions of LC and MS above reflect the historical segmentation of these analytical technologies and the historical categorization of their respective practitioners. Increasingly in today’s instrument market, this segmentation and categorization is becoming obsolete as a high percentage of instruments used in the laboratory embody both LC and MS technologies as part of a single device. In response to this development and to further promote the high utilization of these hybrid instruments, the Company has organized its Waters operating segment to develop, manufacture, sell and service integrated \nLC-MS\n systems. \n \nIn 2022, the Company introduced the Xevo TQ Absolute System, the most sensitive and compact benchtop tandem mass spec in its class. The Company introduced the new Xevo G3 Q-Tof Mass Spectrometer with CONFIRM Sequence, a new oligonucleotide sequencing confirmation app for the waters_connect Software platform and an electrospray ionization source for the high-resolution SELECT SERIES MRT Mass Spectrometer. \n \nBased upon 2024, reports from independent marketing research firms and publicly disclosed sales figures from competitors, the Company believes that it is one of the world’s largest manufacturers and distributors of LC and \nLC-MS\n instrument systems, chromatography columns and other consumables and related services. \n \nThe Company has been a developer and supplier of software-based products that interface with both the Company’s and other suppliers’ instruments. The Company’s newest software technology for mass spectrometry is the waters_connect Software platform. \n\n\n \n \n4 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\n\n\nIn 2022, the Company introduced a new PFAS quantitation workflow enabled by enhancements to its waters_connect Software for quantitation software and the Company introduced Extraction+\n TM\n Connected Device, a new software-controlled product for the Waters Andrew+\nTM\n Pipetting Robot that automates the preparation of biological, food, forensics and environmental samples by solid phase extraction. \n \nIn 2023, the Company introduced the next generation Xevo TQ Absolute IVD Mass Spectrometer, expanding its family of MassTrak\nTM\n IVD \nLC-MS/MS\n Systems for clinical diagnostic applications. The powerful analytical performance of the Xevo TQ Absolute IVD Mass Spectrometer is up to five times more sensitive for quantifying clinical analytes. This sensitivity enables clinical laboratories to detect and measure trace level analytes within a sample at lower detection levels than previously possible. It can also extend the testing capabilities of the clinical laboratory to include lower volume samples obtained in less-invasive assays such as saliva, breath, dried blood spots and multiplex panels and large molecules. The new MassTrak \nLC-MS/MS\n IVD System includes the ACQUITY UPLC \nI-Class\n PLUS System with the Xevo TQ Absolute IVD Mass Spectrometer. The ACQUITY UPLC \nI-Class\n PLUS System is designed to deliver rapid and accurate sample analysis to enhance the sensitivity of any mass spectrometer and simplify the characterization of the most complex sample. The Xevo TQ Absolute IVD System provides more consistent \ninstrument-to-instrument\n performance, with a user-friendly design that maximizes service uptime. Its innovative design is also 45% smaller and uses 50% less nitrogen gas and electricity than comparable tandem quadrupole-mass spectrometry systems, making it ideal for hospital labs and independent commercial labs with both sustainability and business growth goals to meet. \n \nIn addition, in 2023, the Company introduced the industry’s first targeted imaging mass spectrometer based on its Xevo TQ Absolute Tandem Quadrupole Mass Spectrometer which is the most sensitive and compact mass spectrometer in its class. The new instrument combines the Waters DESI XS source with the Xevo TQ Absolute System and is five times more sensitive and five times faster than discovery-based imaging systems at precisely determining whether a particular small molecule drug product, and how much of it, reaches its intended target, such as a brain, liver or lung, in a test subject. Further, the Company announced new updates to its SELECT SERIES MRT System that increases its specificity and utility for \nUPLC-MS/MS\n metabolomics and drug discovery applications and for mass spectrometry imaging experiments. The MRT System now offers 50% higher resolution, making it capable of 300,000 FWHM resolution, a 3X faster scan rate and \nparts-per-billion\n mass accuracy. These MRT System enhancements are designed to help research scientists unambiguously identify analytes of interest in samples of blood, urine and tissue, contributing to a greater understanding of molecules and their mechanisms of action in numerous scientific fields. It is compatible with numerous MS imaging sources including DESI and MALDI, and generates crystal-clear, high-resolution images without compromising mass spectral resolution or accuracy. Lastly, in 2023, the Company combined its BioAccord \nLC-MS\n System and the Waters Andrew+ Pipetting Robot, connecting via new protocols in OneLab\nTM \nSoftware to create fully integrated and \neasy-to-use\n bioprocess \nwalk-up\n solutions. It is designed to enable less experienced \nLC-MS\n users to acquire critical quality attribute data for analysis of drug product and cell culture media. Capturing data directly at the bioproduction laboratory can help bioprocess engineers improve process understanding, leading to more robust manufacturing processes and accelerated development timelines. \n \nWaters Service\n \nServices provided by Waters enable customers to maximize technology productivity, support customer compliance activities and provide transparency into enterprise resource management efficiencies. The customer benefits from improved budget control, data-driven technology adoption and accelerated workflow at a site or on a global perspective. The Company considers its service offerings to be highly differentiated from its competition, as evidenced by a consistent increase in annual service revenues. The Company’s principal competitors in the service market include Revvity, Inc., Agilent Technologies, Inc. and Thermo Fisher Scientific Inc. These competitors can provide certain services on Waters instruments to varying degrees and always present competitive risk. \n\n\n \n \n5 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\n\n\nThe servicing and support of instruments, software and accessories is an important source of revenue and represented over 35% of sales for Waters in 2024. These revenues are derived primarily through the sale of support plans, demand services, spare parts, customer performance validation services and customer training. Support plans typically involve scheduled instrument maintenance and an agreement to promptly repair a \nnon-functioning\n instrument in return for a fee described in a contract that is priced according to the configuration of the instrument. \n \nThe waters_connect System Monitoring is a new \nSoftware-as-a-Service\n application that enables laboratory managers and analysts to monitor the real-time status of any chromatography instruments, regardless of the manufacturer, running on Waters Empower Software. The waters_connect System Monitoring application was developed especially for high-volume quality assurance/quality control laboratories. It can reduce the turnaround time of product release samples and facilitate the planning and progress of critical analyses via live, \nat-a-glance\n dashboard views of the operational status of chromatography instruments. The cloud-native application also helps lab managers utilize capital resources better by providing an understanding of instrument history and usage levels and improve the productivity of their teams. \n \nTA Products and Markets\n \nThermal Analysis, Rheometry and Calorimetry\n \nThermal analysis measures the physical or thermodynamic characteristics of materials as a function of temperature. Changes in temperature affect several characteristics of materials, such as their heat flow characteristics, physical state, weight, dimension and mechanical and electrical properties, which may be measured by one or more thermal analysis techniques, including calorimetry. Consequently, thermal analysis techniques are widely used in the development, production and characterization of materials in various industries, such as plastics, chemicals, automobiles, pharmaceuticals and electronics. \n \nRheometry instruments often complement thermal analyzers in characterizing materials. Rheometry characterizes the flow properties of materials and measures their viscosity, elasticity and deformation under different types of “loading” or other conditions. The information obtained under such conditions provides insight into a material’s behavior during processing, packaging, transport, usage and storage. \n \nThermal analysis, rheometry and calorimetry instruments are heavily used in material testing laboratories and, in many cases, provide information useful in predicting the suitability and stability of industrial polymers, fine chemicals, pharmaceuticals, water, metals and viscous liquids in various industrial, consumer goods and healthcare products, as well as for life science research. As with systems offered by Waters, a range of instrument configurations is available with increasing levels of sample handling and information processing automation. In addition, systems and accompanying software packages can be tailored for specific applications. \n \nIn 2022, TA introduced the Powder Rheology Accessory, which enables our Discovery Hybrid Rheometers to characterize the behavior of powders during storage, dispensing, processing and \nend-use.\n The Powder Rheology Accessory provides relevant property and processing measurements for battery electrode coatings to prevent defects that cause cell failure and pharmaceutical tablets to prevent instabilities of API blends. \n \nAlso in 2022, TA introduced Polymer Workflow Guided Methods, which provides walk up and use functionality by codifying polymer workflows. Guided Methods leverages the power of TRIOS AutoPilot Software and enables novice users to quickly learn and use the instrument to set up test methods, run tests, and execute analyses across our Thermal Analysis and Rheology product lines. \n \nIn 2023, TA introduced a new Battery Cycler Microcalorimeter Solution for high-resolution characterization of battery cells. The instrument and software combination enables \nnon-destructive\n testing under real-world operating conditions and significantly reduces experiment time from months to weeks, while providing decisive insights for greater battery efficiency, safety and stability. \n\n\n \n \n6 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\n\n\nIn 2024, TA introduced the following new instrument systems: \n \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\n \nRheo-IS accessory for our Discovery Hybrid Rheometers. This new accessory for its Discovery Hybrid Rheometers is designed to enable simultaneous electrical impedance and rheological measurements, a critical capability for scientists working on new battery formulations. \n \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\n \nRapid Screening-Differential Scanning Calorimeter \n(“RS-DSC”),\n designed for biopharmaceutical developers. The \nRS-DSC\n is a high-throughput DSC for precise thermal stability testing of high-concentration biologic formulations specifically for antibody drugs and engineered proteins. \n \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\n \nTA introduced the Discovery Core Rheometer, a streamlined, modern rheometer designed for routine manufacturing quality control and assurance laboratories. The new analyzer can handle multiple material types such as battery slurries, printing inks, food, and personal care products and it features an \neasy-to-use\n touchscreen interface with self-guided training, methods, and applications for all levels of rheology users. \n \nTA Service\n \nSimilar to Waters, the servicing and support of TA’s instruments is an important source of revenue and represented more than 25% of sales for TA in 2024. TA operates independently from the Waters operating segment, though many of its overseas offices are jointly occupied with Waters to achieve operational efficiencies. TA has dedicated field sales and service operations. Service sales are primarily derived from the sale of support plans, replacement parts and billed labor fees associated with the repair, maintenance and upgrade of installed systems. \n \nGlobal Customers\n \nThe Company typically has a broad and diversified customer base that includes pharmaceutical accounts, other industrial accounts, universities and governmental agencies. Purchase of the Company’s instrument systems is often dependent on its customers’ capital spending, or funding as in the cases of academic, governmental and research institutions, which often fluctuate from year to year. The pharmaceutical segment represents the Company’s largest sector and includes multinational pharmaceutical companies, generic drug manufacturers, contract research organizations (“CROs”) and biotechnology companies. The Company’s other industrial customers include chemical manufacturers, polymer manufacturers, food and beverage companies and environmental testing laboratories. The Company also sells to universities and governmental agencies worldwide. The Company’s technical sales and support staff members work closely with its customers in developing and implementing applications that meet their full range of analytical requirements. During 2024, 58% of the Company’s net sales were to pharmaceutical accounts, 31% to other industrial accounts and 11% to academic institutions and governmental agencies. Although the Company transacts business with various government agencies, no government contract is of such magnitude that a renegotiation of profits or termination of the contract at the election of the government agency would have a material adverse effect on the Company’s financial results. \n \nThe Company typically experiences seasonality in its orders that is reflected as an increase in sales in the fourth quarter, as a result of purchasing habits for capital goods of many customers who tend to exhaust their spending budgets by calendar \nyear-end.\n The Company does not rely on any single customer for a material portion of its sales. During fiscal years 2024, 2023 and 2022, no single customer accounted for more than 2% of the Company’s net sales. \n \nSales and Service\n \nThe Company has one of the largest direct sales and service organizations focused exclusively on the analytical workflows offered by the Company. Across these product technologies, using respective specialized sales and service workforces, the Company serves its customer base with 79 sales offices throughout the world as of \n\n\n \n \n7 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\n\n\n\nDecember 31, 2024 and approximately 4,200, 4,300 and 4,500 field representatives in 2024, 2023 and 2022, respectively. This investment in sales and service personnel serves to maintain and expand the Company’s installed base of instruments. The Company’s sales representatives have direct responsibility for account relationships, while service representatives work in the field to install instruments, train customers and minimize instrument downtime. \nIn-house\n and field-based technical support representatives work directly with customers, providing them assistance with applications and procedures on Company products. The Company provides customers with comprehensive information through various corporate and geographic-specific internet websites and product literature and also makes consumable products available through electronic ordering facilities and a dedicated catalog. \n \nManufacturing and Distribution\n \nThe Company provides high product quality by overseeing each stage of the production of its instruments, columns and chemical reagents. \n \nThe Company currently assembles a portion of its LC instruments at its facility in Milford, Massachusetts, where it performs machining, assembly and testing. The Milford facility maintains quality management and environmental management systems in accordance with the requirements of ISO 9001:2015, ISO 13485:2016, ISO 45001:2018 and ISO 14001:2015, and adheres to applicable regulatory requirements (including the FDA Quality System Regulation and the European \nIn-Vitro\n Diagnostic Directive). The Company outsources manufacturing of certain electronic components, such as computers, monitors and circuit boards, to outside vendors that meet the Company’s quality requirements. In addition, the Company outsources the manufacturing of certain LC instrument systems and components to well-established contract manufacturing firms in Singapore. The Company’s Singapore entity is ISO 9001:2015 certified and manages all Asian outsourced manufacturing as well as the distribution of all products from Asia. The Company may pursue outsourcing opportunities as they arise but believes it maintains adequate supply chain and manufacturing capabilities in the event of disruption or natural disasters. \n \nThe Company primarily manufactures and distributes its LC columns at its facilities in Taunton, Massachusetts and Wexford, Ireland. In February 2024, the Company completed an expansion of its Taunton manufacturing facility, incurring costs of approximately $251 million in connection with the expansion between 2018 and 2024. The Taunton facility processes, sizes and treats silica and polymeric media that are packed into columns, solid phase extraction cartridges and bulk shipping containers in both Taunton and Wexford. The Wexford facility also manufactures and distributes certain data, instruments and software components for the Company’s LC, MS and TA product lines. The Company’s Taunton facility is certified to ISO 9001:2015 and ISO 14001:2015. The Wexford facility is certified to ISO 9001:2015, ISO 13485:2016/EN ISO 13485:2016 and ISO 14001:2015. VICAM manufactures antibody-linked resins and magnetic beads that are packed into columns and kits in Milford, Massachusetts. The Company manufactures and distributes its Analytical Standards and Reagents and Environmental Resource Associates (“ERA”) product lines at its facility in Golden, Colorado, which is certified to ISO 9001:2015 and accredited to ISO/IEC 17025:2017, ISO/IEC 17034:16, ISO/IEC 17043:2010 and TNI Standard Vol. 3:2016. Some ERA products are also manufactured in the Wexford, Ireland facility, which is also accredited to ISO/IEC 17025:2017 and ISO/IEC 17034:2016. \n \nThe Company manufactures and distributes its MS products at its facilities in Wilmslow, England and Wexford, Ireland. In 2024, Waters opened a new facility in Birmingham, England which will increase the Company’s capacity to manufacture certain components used in the Company’s MS instruments. Each stage of this supply chain is closely monitored by the Company to maintain high quality and performance standards. The instruments, components or modules are then returned to the Company’s facilities, where its engineers perform final assembly, calibrations to customer specifications and quality control procedures. The Company’s MS facilities are certified to ISO 9001:2015, ISO 13485:2016/EN ISO 13485:2016 and ISO 14001:2015 (Wexford only) and adhere to applicable regulatory requirements (including the FDA Quality System Regulation and the European \nIn-Vitro\n Diagnostic Directive). \n\n\n \n \n8 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\n\n\nTA’s thermal analysis, rheometry and calorimetry products are manufactured and distributed at the Company’s New Castle, Delaware, Eden Prairie, Minnesota, Lindon, Utah and Hüllhorst, Germany facilities. Similar to MS, elements of TA’s products are manufactured by outside contractors and are then returned to the Company’s facilities for final assembly, calibration and quality control. The Company’s New Castle facility is certified to the ISO 9001:2015 standard and the Eden Prairie facility is certified to both ISO 9001:2015 and ISO/IEC 17025:2017 standards, and the Lindon facility is certified to ISO 9001:2015. \n \nAll instrument manufacturing for Wyatt products takes place at its facilities in Santa Barbara, California. The Company’s Wyatt facility in Santa Barbara, California is certified to ISO 9001:2015. \n \nRaw Materials\n \nThe Company purchases a variety of raw materials, primarily consisting of high temperature alloy sheet metal and castings, forgings, \npre-plated\n metals and electrical components from various vendors. The materials used by the Company’s operations are generally available from a number of sources and in sufficient quantities to meet current requirements subject to normal lead times. \n \nThe Company is subject to rules of the Securities and Exchange Commission (“SEC”) under the Dodd-Frank Wall Street Reform and Consumer Protection Act, which require disclosure as to whether certain materials (tantalum, tin, gold and tungsten), known as conflict minerals, which may be contained in the Company’s products, are mined from the Democratic Republic of the Congo and adjoining countries. In 2024, the Company was not able to determine with certainty the country of origin of some of the conflict minerals in its manufactured products. However, the Company does not have knowledge that any of its conflict minerals originated from the Democratic Republic of the Congo or adjoining countries. The Company is in the process of evaluating its 2024 supply chain, and the Company plans to file its 2024 Form SD with the SEC in May 2025. The results of this and future evaluations may impose additional costs and may introduce new risks related to the Company’s ability to verify the origin of any conflict minerals contained in its products. \n \nIn addition, the Company continues to monitor environmental, health and safety regulations in countries in which it operates throughout the world, in particular, European Union and China Restrictions on the use of certain Hazardous Substances in electrical and electronic equipment and European Union Waste Electrical and Electronic Equipment directives. Further information regarding these regulations is available on the Company’s website, www.waters.com, under the caption “About Waters / Corporate Governance”. \n \nResearch and Development\n \nThe Company maintains an active research and development program focused on the development and commercialization of products that extend, complement and update its existing product offering. The Company’s research and development expenditures for 2024, 2023 and 2022 were $183 million, $175 million and $176 million, respectively. \n \nNearly all of the Company’s LC products have been developed at the Company’s main research and development center located in Milford, Massachusetts, with input and feedback from the Company’s extensive field organizations and customers. The majority of the Company’s MS products are developed at facilities in England and most of the Company’s current materials characterization products are developed at the Company’s research and development center in New Castle, Delaware. At December 31, 2024, 2023 and 2022, there were approximately 1,100, 1,200 and 1,200 employees involved in the Company’s research and development efforts, respectively. The Company has increased research and development expenses from its continued commitment to invest significantly in new product development and existing product enhancements, and as a result of acquisitions. Despite the Company’s active research and development programs, there can be no assurance that the Company’s product development and commercialization efforts will be successful or that the products developed by the Company will be accepted by the marketplace. \n\n\n \n \n9 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\n\n\nThe Company maintains research laboratories in Cambridge, MA and at the University of Delaware, which serves as a strategic, collaborative space in the community, where Waters can partner with academia, research and industry to accelerate the next generation of scientific advancements. \n \nHuman Capital\n \nWe believe that our people differentiate our business and are vital to our continued success. As a result, we have made important investments in our workforce through initiatives and programs that support talent development and inclusion and enhance our Total Rewards programs. \n \nEmployees\n \nThe Company employed approximately 7,600, 7,900 and 8,200 employees at December 31, 2024, 2023 and 2022, respectively, with approximately 39% of the Company’s employees located in the United States. The Company believes its employee relations are generally good. The Company’s employees are not unionized or affiliated with any internal or external labor organizations. \n \nTalent Development\n \nWe believe that our future success depends in a significant part on our continued ability to attract and retain highly skilled employees and then contribute to the growth and development of these employees. \n \nWe further the growth and development of our employees by investing in various programs, digital platforms and workshops that build professional and technical skills. In addition, management periodically assesses succession planning for certain key positions and reviews our workforce to identify high potential employees for future growth and development. \n \nCulture of Inclusion\n \nWe believe inclusion is a core tenet of organizational success and that fostering a sense of inclusivity allows our employees to maximize their performance contribution to our business. As part of our \ncompany-led\n initiatives to drive an inclusive workplace, we have created Employee Circles and Employee Hubs, which are voluntary, employee-driven employee resource groups open to all our employees worldwide to foster an inclusive culture. Waters has focused on expanding the pipeline of strong candidates in our recruitment processes, including developing partnerships with organizations that support a culture of inclusion in hiring and employee engagement. \n \nHealth and Safety\n \nThe health and safety of our employees is our highest priority. Through online and \nin-person\n training programs, we believe that we foster a safe workplace and ensure that all employees are empowered to prevent accidents and injuries. \n \nCompetition\n \nThe analytical instrument systems, supplies and services market is highly competitive. The Company encounters competition from several worldwide suppliers and other companies in both domestic and foreign markets for each of its three primary technologies. The Company competes in its markets primarily on the basis of product performance, reliability, service and, to a lesser extent, price. Competitors continuously introduce new products and have instrument businesses that are generally more diversified than the Company’s business. Some competitors have greater financial resources and broader distribution than the Company’s. \n \nIn the markets served by Waters, the Company’s principal competitors include: Agilent Technologies, Inc., Shimadzu Corporation, Bruker Corporation, Danaher Corporation and Thermo Fisher Scientific Inc. In the \n\n\n \n \n10 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\n\n\n\nmarkets served by TA, the Company’s principal competitors include: PerkinElmer, Inc., NETZSCH-Geraetebau GmbH, Thermo Fisher Scientific Inc., Malvern PANalytical Ltd., a subsidiary of Spectris plc, Anton-Paar GmbH and others not identified here. \n \nThe market for consumable LC products, including separation columns, is highly competitive and generally more fragmented than the analytical instruments market. The Company encounters competition in the consumable columns market from chemical companies that produce column sorbents and small specialized companies that primarily pack purchased sorbents into columns and subsequently package and distribute columns. The Company believes that it is one of the few suppliers that processes silica and polymeric resins, packs columns and distributes its own products. The Company competes in this market on the basis of performance, reproducibility, reputation and, to a lesser extent, price. In recent years, the Company’s principal competitors for consumable products have included: Danaher Corporation; Merck KGaA; Agilent Technologies, Inc.; General Electric Company and Thermo Fisher Scientific Inc. The ACQUITY UPLC Instrument is designed to offer a predictable level of performance when used with ACQUITY UPLC Columns and the Company believes that the expansion of the ACQUITY UPLC Instrument base will enhance its chromatographic column business because of the high level of synergy between ACQUITY UPLC Columns and the ACQUITY UPLC Instruments. \n \nPatents, Trademarks and Licenses\n \nThe Company owns a number of United States and foreign patents and has patent applications pending in the United States and abroad. Certain technology and software has been acquired or is licensed from third parties. The Company also owns a number of trademarks. The Company’s patents, trademarks and licenses are viewed as valuable assets to its operations. However, the Company believes that no one patent or group of patents, trademark or license is, in and of itself, essential to the Company such that its loss would materially affect the Company’s business as a whole. \n \nEnvironmental Matters and Climate Change\n \nThe Company is subject to foreign and U.S. federal, state and local laws, regulations and ordinances that (i) govern activities or operations that may have adverse environmental effects, such as discharges to air and water as well as handling and disposal practices for solid and hazardous wastes, and (ii) impose liability for the costs of cleaning up and certain damages resulting from sites of past spills, disposals or other releases of hazardous substances. The Company believes that it currently conducts its operations and has operated its business in the past in substantial compliance with applicable environmental laws. From time to time, Company operations have resulted or may result in noncompliance with environmental laws or liability for cleanup pursuant to environmental laws. The Company does not currently anticipate any material adverse effect on its operations, financial condition or competitive position as a result of its efforts to comply with environmental laws. \n \nThe Company is sensitive to the growing global debate with respect to climate change. An internal sustainability working group develops increasingly robust data with respect to the Company’s utilization of carbon producing substances in an effort to continuously reduce the Company’s carbon footprint. In 2019, the Company published a sustainability report identifying the various actions and behaviors the Company adopted in 2018 concerning its commitment to both the environment and the broader topic of social responsibility. The Company has continued to publish a sustainability report (which was renamed the ESG Report in 2022) on an annual basis. In November 2024, the Company published its 2024 ESG Report, detailing the Company’s efforts to address its environmental impact and uphold its social responsibilities in 2024. See",
    "item1a": "Item 1A, Risk Factors - Risks Related to Cybersecurity and Data Privacy. \n \nThe Board of Directors oversees the Company’s information security risk management framework that seeks to identify new risks, develop and implement risk mitigation plans, and monitor the results affecting the Company’s business and operations on an ongoing basis. The CIO manages this framework, in collaboration with the Company’s businesses and functions. The CIO presents updates to the \nAudit and Finance Committee\n at least annually and, as necessary, to the full Board of Directors. These reports include detailed updates on the Company’s performance preparing for, preventing, detecting, responding to and recovering from cyber incidents.\n \nThe CIO also promptly informs and updates the \nBoard of Directors\n about any information security incidents that may pose significant risk to the Company. The Company’s program is periodically evaluated by external experts, and the results of those reviews are reported to the Audit and Finance Committee and the Board of Directors. Together with management, the Audit and Finance Committee reviews the Company’s risk assessment and risk management practices and discusses major cybersecurity risk exposures as well as steps taken by management to monitor and control such exposures.\n \n \n \n2\n8\n \n \n \n \n \nTable of Contents\n \n \n \n \nThe Company’s Vice President and Chief Information Officer has over 24 years of business experience managing risks from cybersecurity threats/developing and implementing cybersecurity policies and procedures, as well as several relevant certifications. \n \n \n \n \n2\n9\n \n \n\n\n \n\n\n\n\nTable of Contents",
    "item1b": "Item 1B:\n Unresolved Staff Comments\n \n \nNone. \n\n\n \n \n27 \n\n\n\n\n \n\n\n\n\nTable of Contents\n\n\ntrue",
    "item1c": "Item 1C: \nCybersecurity\n \n \n \nWe maintain a robust system of data protection and cybersecurity resources, technology and processes.\n We regularly evaluate new and emerging risks and ever-changing legal and compliance requirements. We make strategic investments to address these risks and legal and compliance requirements to keep Company, customer and employee data secure. We monitor risks of sensitive information compromise at our business partners where relevant and reevaluate these risks on a periodic basis. We also perform annual and ongoing cybersecurity training and awareness for our employees. \n \n \nWe have a longstanding information security risk management framework structured according to the National Institute of Standards and Technology Cybersecurity Framework, industry best practices, privacy legislation, and other global and local standards and regulations. This risk management framework is under the specific oversight of the Company’s Vice President and Chief Information Officer (the “CIO”) and includes a \ndefense-in-depth\n approach with multiple layers of security controls, including network segmentation, security monitoring, endpoint protection, and identity and access management, as well as data protection best practices and data loss prevention controls. Our Audit and Finance Committee is updated on the overall performance of our information security risk management framework on an annual basis by the CIO. \n \n \nOur cybersecurity awareness program includes regular phishing simulations, annual general cybersecurity awareness, and data protection modules, as well as more contextual and personalized modules for targeted users and roles. We also perform simulations and drills at both a technical and leadership level at least annually. We incorporate external expertise and guidance in all aspects of our cybersecurity program. We complete annual internal security audits and vulnerability assessments of the Company’s information systems and related controls, including systems affecting personal data. In addition, we leverage cybersecurity specialists to complete annual external audits and objective assessments of our cybersecurity program and practices, including our data protection practices, as well as to conduct targeted attack simulations. We continually enhance our information security capabilities in order to protect against emerging threats, while also increasing our ability to detect and respond to cyber incidents and maximize our resilience to recover from potential cyber-attacks. We have a robust incident response plan in place that provides a documented playbook for responding to cybersecurity incidents and facilitates coordination across multiple parts of our Company. Additionally, we have purchased network security and cyber liability insurance in order to provide a level of financial protection, should a data breach occur.\n \n \nDespite the existence of mitigation measures, the Company’s systems and those of its partners remain potentially vulnerable to cybersecurity threats, any of which could have a material adverse effect on the Company’s business. To date, cybersecurity incidents have not resulted in a material adverse impact to the Company’s business strategy, results of operations and financial condition, but future incidents could have such an impact.\n See"
  }
}