{
  "ticker": "WDAY",
  "cik": "0001327811",
  "company_name": "Workday, Inc.",
  "filing_date": "2025-03-11",
  "accession": "0001327811-25-000056",
  "primary_doc": "wday-20250131.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nOverview\nWorkday is the AI platform that helps organizations manage their most important assets – their people and money. Workday provides more than 11,000 organizations with cloud solutions powered by artificial intelligence (“AI”) to help solve some of today’s most complex business challenges, including supporting and empowering their workforce, managing their finances and spend in an ever-changing environment, and planning for the unexpected. \nWe strive to make the world of work and business better, and hope to empower customers to do the same through an innovative suite of solutions with more than 70 million users under contract around the world and across industries – from emerging and medium-sized businesses to more than 60% of the Fortune\n \n500. Central to our purpose is a set of core values – with our employees as number one – along with customer service, innovation, integrity, profitability, and fun. We believe that happy employees lead to happy customers, and we are committed to helping our customers adapt and thrive in this increasingly dynamic business environment. \nAs organizations face changing conditions, we believe the need for an intuitive, scalable, and secure platform that provides unified management of finances, people, suppliers, and planning is more important than ever. In fiscal 2025, we announced Workday Illuminate, the next generation of Workday AI, designed to help our customers accelerate manual tasks, assist their employees, and transform their business processes. Workday Illuminate is built into our platform, allowing us to rapidly deliver and sustain models that can solve countless business problems. As a result, Workday Illuminate helps deliver better employee experiences, increase productivity, improve operational efficiencies, and provide insights for faster, data-driven decision-making. To support our customers and help them continuously adapt how they manage their business and operations, Workday delivers weekly product updates in addition to major feature releases twice a year. Through this model, Workday customers are able to deliver and adopt innovations quickly and adapt at a time that fits their business needs. We sell our solutions worldwide primarily through direct sales by our field sales teams. We also offer professional services, as do our Workday Services Partners, to help customers deploy our solutions and continually adopt new capabilities.\n1\nTable of \nContents\nIn fiscal 2025, we announced several Workday Illuminate-powered capabilities that are expected to be generally available to customers in fiscal 2026, including a set of new role-based AI agents for recruiting, talent mobility, succession, and optimization, and a new Workday Assistant to help simplify common human resources (“HR”) and finance processes. Workday Wellness, another new Workday Illuminate-powered solution, will help provide companies with a real-time view into which benefits and wellness offerings their employees want and use and give AI-driven recommendations on how to improve their benefits programs. In February 2025, we announced additional role-based AI agents for contracts, payroll, financial auditing, and policy. We also announced the Workday Agent System of Record, which is designed to help our customers embrace agentic AI by providing a centralized system for managing, tracking, integrating, and optimizing AI agents that are built by Workday, the customer, or third parties. The Workday Agent System of Record and new role-based AI agents are currently in development and are expected to become available later in fiscal 2026.\nOur Capabilities\nWorkday’s suite of enterprise cloud applications addresses the evolving needs of the C-suite across various industries and is designed to be open, extensible, and configurable, allowing integration with other applications and the ability for users and our partners to build custom applications. Workday offers Financial Management, Spend Management, Human Capital Management (“HCM”), Planning, and Analytics applications. \nFinancial Management: Solutions for the Office of the Chief Financial Officer (“CFO”)\nWorkday helps organizations accelerate their journeys towards becoming truly digital finance organizations by giving them the tools they need to manage the strategic direction of their organizations while also supporting growth, profitability, and compliance and regulatory requirements. Workday’s suite of financial management applications, built on the Workday platform with Workday Illuminate at the core, helps enable CFOs to maintain accounting information; manage core financial processes such as payables and receivables; identify real-time financial, operational, and management insights; perform financial consolidation; reduce time-to-close; promote internal control and auditability; and achieve consistency across global finance operations. Our AI-powered capabilities for finance are designed to transform certain accounting, finance, and procurement processes by anticipating and streamlining common actions and workflows to help increase productivity.\nSpend Management: Solutions for the Office of the CFO\n Workday helps enable procurement professionals to support their businesses throughout the source-to-contract process, including a user experience designed for ease of use and collaboration. Workday offers a set of spend management solutions that help organizations streamline supplier selection and contract management, build and execute sourcing events, such as requests for proposals, and manage indirect spend. Additionally, Workday offers an expense management solution that provides users with flexible ways to submit and approve expenses, while providing leaders the ability to set controls and analyze spend. \nHuman Capital Management: Solutions for the Office of the Chief Human Resources Officer (“CHRO”)\nWorkday delivers HR solutions to help organizations build a skilled workforce, drive productivity, and create an engaging workplace. Workday’s suite of HCM applications allows organizations to manage the entire employee lifecycle – from recruitment to retirement – enabling HR teams to hire, onboard, pay, develop and reskill, and provide meaningful employee experiences that are personalized and helpful, based on listening to the diverse needs of today’s workforce. For example, we are helping organizations manage their total workforce in one seamless experience on Workday through our solutions, including Workday Adaptive Planning, Workday Illuminate-powered recruiting agent, Workday VNDLY, and Workday HCM. \nPlanning: Solutions for the Offices of the CFO and CHRO\nIn today’s dynamic environment, businesses need to continuously plan and model various scenarios to quickly respond to change. Workday provides an active planning process that can model across finance, workforce, sales, and operational data, helping organizations make more informed decisions and respond quickly to changing situations. Workday Illuminate assists in creating forecasts that incorporate historical and third-party data, such as economic data and labor statistics. When combined with Workday’s Financial Management and HCM solutions, organizations are able to leverage real-time transactional data to dynamically adjust and recalibrate their plans.\n2\nTable of \nContents\nAnalytics and Reporting and Workday Platform: Solutions for the Offices of the Chief Information Officer (“CIO”), CFO, and CHRO\nWorkday helps leaders make sense of the vast amount of data they collect enterprise-wide. For example, information technology (“IT”) leaders are navigating the complexities of supporting employees in new environments, which requires them to deploy an adaptable, secure architecture to help ensure global continuity and productivity while remaining agile. Workday provides applications for analytics and reporting, including augmented analytics to surface insights to the line of business in simple-to-understand stories. The Workday Platform combines both the innovation built by Workday and on Workday by our customers and partners, providing organizations with the flexibility to integrate third-party applications and services directly into Workday. By managing their people and money together on the Workday platform, our customers can gain new possibilities for increased agility, transformation, and performance. \nIndustries: Solutions for the Offices of the CIO, CFO, and CHRO\nWorkday offers businesses flexible solutions to help them adapt to their industry-specific needs and respond to change. Workday’s applications serve industries such as financial services, healthcare, higher education, state and local government, and professional services. For example, Workday provides supply chain and inventory solutions to healthcare organizations, allowing them to purchase, stock, track, and replenish their inventory to help support patient care. In addition, higher education institutions can deploy Workday’s solution to manage the end-to-end student and faculty lifecycle. Workday also enables its partner ecosystem to build industry-specific solutions. With Workday Extend, customers and their developers can build custom applications that can accommodate their unique industry business needs, complete with the same experience, security model, and reliability of the native applications offered by Workday. \nProduct Development\nAt Workday, innovation is a core value, which encourages out-of-the-box thinking and creativity, enabling us to create applications designed to change the way people work. We invest significant resources into product development and are committed to rapidly building and/or acquiring new applications and solutions. Our product development organization is responsible for product design, development, testing, and certification. We focus our efforts on developing new applications and core technologies, as well as further enhancing the usability, functionality, reliability, security, performance, and flexibility of existing applications. To grow our suite of Workday applications, we primarily invest in research and development, but we also selectively acquire companies that are consistent with our design principles, existing product set, corporate strategy, and company culture. For example, in fiscal 2025, we acquired HiredScore, Inc. (“HiredScore”), a leading provider of AI-powered talent orchestration solutions, and Evisort Inc. (“Evisort”), a provider of an AI-native document intelligence platform. We also manage a portfolio of strategic investments through Workday Ventures, our strategic investment arm. We invest primarily in enterprise cloud technology companies that we believe are digitally transforming their industries, developing innovative AI-powered technology, improving customer experiences, helping us expand our solution ecosystem or supporting other corporate initiatives. We plan to continue making these types of strategic investments as opportunities arise that we find attractive. \nSales and Marketing\nWe sell our subscription contracts and related services globally, primarily through our direct sales organization, which consists of field sales and field sales support personnel. The Workday Field Sales team is aligned by geography, industry, and/or customer size. We also segment our sales teams into two distinct groups: those focused on landing new customer relationships, and those focused on expanding our relationship within our existing customers. We generate customer leads, accelerate sales opportunities, and build brand awareness through our marketing programs and strategic relationships. Our marketing programs largely target senior business leaders, including CFOs, CHROs, and CIOs. We also generate customer leads and transact through our partner ecosystem, including through resellers. \nOur sales strategy is focused on both adding new customers and on growing our relationships with our existing customers to expand the adoption of our suite of solutions over time. As our customers realize the benefits of our entire suite of service offerings, we aim to upgrade the customers’ experience with new products and features, and gain additional subscriptions by targeting new functional areas and business units. Additionally, by extending our go-to-market capabilities globally, we aim to grow our business by selling to new customers in new regions.\n3\nTable of \nContents\nPartner Ecosystem\nAs a core part of our strategy, we have developed and continue to grow a global ecosystem of partners that build and sell new applications on the Workday platform, source new business with Workday, and deliver quality services and customer outcomes with Workday. These relationships include innovation partners, sales partners, and services partners. Together, Workday and our partners help our customers to better manage their people and their money. The Workday Marketplace allows customers to find Built on Workday applications, Industry Accelerators, packaged solutions, and other integrations and solutions that are purpose-built to complement the Workday platform in targeted countries and industries. Strategic partnerships with public cloud providers, including Amazon Web Services, Inc. (“AWS”) and Google Cloud, allow our customers to reduce their committed spend on cloud. Our global partnerships with payroll providers, including Automatic Data Processing, Inc. (“ADP”) and Strada, enable integrated and streamlined payroll solutions across the world. Our Industry Accelerator program, including 12 new Industry Accelerators announced during fiscal 2025, combines Workday partners, solutions, and services to help speed cloud transformation efforts tailored to solve our customers’ industry-specific challenges.\nCustomers\nWe sell to emerging, medium-sized, and large global organizations that span numerous industry categories, including professional and business services, financial services, healthcare, education, government, technology, media, retail, and hospitality.\nWe have built a company culture centered around customer success and satisfaction. As part of their subscription, customers are provided support services and tools to enhance their experience with Workday applications. This includes 24/7 support; training; a Customer Success Management group to assist customers in production; and Workday Community, an online portal where customers can collaborate and share knowledge and best practices. In addition, we offer Workday Success Plans, a comprehensive, add-on subscription service that delivers continuous value for our customers through strategic advice, product expertise, adoption resources, on-demand education, and technical guidance. We also offer extensive customer training opportunities and a professional services ecosystem of experienced Workday consultants and system integrators to help customers achieve a timely adoption of Workday and enable them to enhance the value of our applications over the life of their subscription.\nSeasonality\nWe have experienced seasonality in terms of when we enter into customer agreements for our services. Historically, we have signed a significantly higher percentage of agreements with new customers, as well as renewal agreements with existing customers, in the fourth quarter of each fiscal year due to customer buying patterns. Although these seasonal factors are common in the technology industry, historical patterns should not be considered a reliable indicator of our future sales activity or performance.\nCompetition\nThe overall market for enterprise application software is rapidly evolving, highly competitive, and subject to changing technology, shifting customer needs, and frequent introductions of new products. We currently compete with large, well-established, enterprise software vendors, such as Oracle Corporation (“\nOracle\n”) and SAP SE (“SAP”). We also face competition from other enterprise software vendors, from regional competitors that only operate in certain geographic markets, from vendors of specific applications that address only one or a portion of our applications, and from vendors that specialize in specific industries in which we provide services, some of which offer cloud-based solutions. These vendors include, without limitation, Anaplan, Inc.; ADP; Coupa Software Inc.; Dayforce, Inc.; Infor, Inc.; Microsoft Corporation; and UKG Inc.\nIn addition, other cloud or AI platform companies that provide services in different target markets or industries may develop applications or acquire companies that operate in our target markets or industries, and some potential customers may elect to develop their own internal applications. However, the domain and industry expertise that is required for a successful solution in the areas of financial management, HCM, and analytics may inhibit new entrants, who may also be unable to invest the necessary capital to accurately address global requirements and regulations. We expect continued consolidation in our industry that could lead to significantly increased competition.\nWe believe the principal competitive factors in our markets include:\n•\nlevel of customer satisfaction and quality of customer references;\n•\nspeed to deploy and ease of use;\n•\nbreadth and depth of application functionality;\n•\ntotal cost of ownership and flexibility of payment terms;\n•\nbrand awareness and reputation;\n•\nadaptive technology platform;\n4\nTable of \nContents\n•\ncapability for configuration, integration, security, scalability, and reliability of applications;\n•\noperational excellence to ensure system availability, scalability, and performance;\n•\nability to innovate and rapidly respond to customer needs, such as the integration of AI into product offerings;\n•\ndomain and industry expertise in applicable laws and regulations;\n•\nsize of customer base and level of user adoption;\n•\ncustomer confidence in financial stability and future viability;\n•\nexisting relationships with key senior business leaders; and\n•\nability to integrate with legacy enterprise infrastructure and third-party applications.\nWe believe that we compete favorably based on these factors. Our ability to remain competitive will largely depend on our ongoing performance in product development and customer support.\nFor more information regarding the competitive risks we face, see “Risk Factors” included in Part I,",
    "item1a": "Item 1A of this report, which disclosures are incorporated by reference herein.\nGovernance\nOur \nBoard of Directors\n is actively involved in overseeing risks from cybersecurity threats. At least once a year, the Board of Directors discusses our programs and policies related to cybersecurity and risk initiatives and considers them closely both from a risk management perspective and as part of Workday’s business strategy. Additionally, the Board has delegated to its Audit Committee oversight of cybersecurity risks and processes to manage them. Our Audit Committee is comprised entirely of independent directors who regularly evaluate cybersecurity risks.\nThe materials presented to our Board and Audit Committee include updates on our data security posture, \nresults from third-party assessments\n, progress towards predetermined risk-mitigation-related goals, our incident response plan, and certain cybersecurity threat risks or incidents and developments, as well as the steps management has taken to respond to such risks.\n \nThe Board and Audit Committee generally receive materials, including a cybersecurity scorecard and other materials indicating current and emerging cybersecurity threat risks and describing our ability to mitigate those risks, and discuss such matters with our \nChief Information Security Officer (“CISO”)\n.\n Material cybersecurity threat risks are also considered during separate Board and committee meeting discussions of important matters like enterprise risk management, operational budgeting, business continuity planning, and other relevant matters\n.\n30\nTable of \nContents\nOur CISO leads all aspects of our global cybersecurity program. Our CISO joined Workday in 2010 and has served as our CISO since April 2018. \nOur CISO has more than 20 years of experience in cybersecurity and information technology risk management, including at a large public company and a recognized consulting firm.\n \nHe also has a degree in information systems management.\nOur cybersecurity program is also supported by a cross-functional leadership team that contributes to our information security and privacy programs and practices, as well as identifies and mitigates security and privacy risks. This team includes our CIO and our Chief Legal Counsel. This team contributes to the development of our cybersecurity strategy and is periodically updated regarding evolving cybersecurity risks and the in-place responsive actions. This team is also informed about the prevention, mitigation, detection, and remediation of cybersecurity incidents through their management of, and participation in, the cybersecurity risk management and strategy processes described herein, including the operation of our incident response plan.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nRisk Management and Strategy\nWe recognize the importance of assessing, identifying, and managing material risks associated with cybersecurity threats. These risks include, among other things, operational risks; intellectual property theft; fraud; extortion; harm to employees or customers; violation of privacy or security laws and other litigation and legal risk; and reputational risks. Our process for identifying and assessing material risks from cybersecurity threats operates alongside our broader overall risk assessment process, covering all company risks. As part of this process appropriate disclosure personnel will collaborate with subject matter specialists, as necessary, to gather insights for identifying and assessing material cybersecurity threat risks, their severity, and potential mitigations.\n29\nTable of \nContents\nWe have implemented a variety of cybersecurity processes, technologies, and controls to aid in our efforts to identify, assess and manage such material risks. Our approach includes: (1) an enterprise risk management program, which includes cybersecurity risks and is periodically refreshed; (2) security and privacy reviews designed to identify risks from many new features, software, and vendors; (3) a vulnerability management program designed to identify hardware and software vulnerabilities; (4) a variety of tools designed to monitor our networks, systems and data for suspicious activity; (5) an internal red team program, which simulates cyber threats, intended to allow us to fix vulnerabilities before threat actors identify them; (6) a threat intelligence program designed to model and research our adversaries; and (7) a variety of privacy, cybersecurity, and incident response trainings and simulations.\n We leverage industry standard security frameworks, including from the National Institute for Standards in Technology (NIST), the International Organization for Standardization (ISO), and the American Institute of Certified Public Accountants (AICPA), to evaluate our security controls, which vary in maturity across the business and are processes we work to continually improve.\nWe also maintain a privacy and cybersecurity incident response program to prepare for, detect, respond to, and recover from cybersecurity incidents, which include processes to triage, assess severity for, escalate, contain, investigate, and remediate the incident, as well as to comply with potentially applicable legal obligations and mitigate brand and reputational damage. Further, we conduct periodic tabletop exercises to test and fortify the controls of our cybersecurity incident response program. The incident response team assesses the severity and priority of incidents on a rolling basis, with escalations of higher severity cybersecurity incidents provided to our management team. If a cybersecurity incident is determined to be a potentially material cybersecurity incident, our disclosure controls and procedures define the steps to determine materiality and disclose such a material cybersecurity incident.\nWhen appropriate, we use external service providers and consultants to assess or monitor the environment or otherwise assist with aspects of our cybersecurity controls and risk assessment process. Our risk management approach is supplemented by external and internal enterprise risk management audits, which are designed to test the effectiveness of our security controls. We conduct penetration testing on a periodic basis and have established an external bug bounty program to allow security researchers to help identify vulnerabilities in our systems before they mature into real-world cybersecurity threats. We also maintain a vendor risk management program designed to identify and mitigate risks associated with third-party service providers, including those in our supply chain and those who have access to our customer or employee data or our systems. This program includes pre-engagement diligence, contractual security and notification provisions, and ongoing monitoring, as appropriate. \nWe describe whether and how risks from identified cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect us, including our business strategy, financial condition, or results of operations, under the headings \n“\nWe depend on data centers and other infrastructure operated by third parties, as well as internet availability, and any disruption in these operations could adversely affect our business and operating results\n,” “\nIf we are unable to successfully integrate our applications with a variety of third-party technologies, our business and operating results could be adversely affected\n,” and “\nIf our information technology systems are compromised or unauthorized access to customer or user data is otherwise obtained, our applications may be perceived as not being secure, our operations may be disrupted, our applications may become unavailable, customers and end users may reduce the use of or stop using our applications, and we may incur significant liabilities\n”\n in our “Risk Factors” included in Part I,"
  }
}