{
  "ticker": "WDC",
  "cik": "0000106040",
  "company_name": "WESTERN DIGITAL CORP",
  "filing_date": "2025-08-14",
  "accession": "0000106040-25-000038",
  "primary_doc": "wdc-20250627.htm",
  "item_sections": {
    "item1": "Item 1, \nBusiness\n, of this Annual Report on Form 10-K.\nOur Company\nWe are a leading developer, manufacturer, and provider of data storage devices and solutions based on hard disk drive (“HDD”) technology. We leverage our capability in the HDD industry primarily for the cloud and hyperscale data center markets. HDDs are critical components in the worldwide data infrastructure market, powering the digital economy. HDDs provide reliable, cost-effective, high-capacity storage needs for a wide range of applications, ranging from cloud data centers, enterprise storage systems, edge computing, video surveillance to client and consumer.\nOur broad portfolio of technology and products addresses our customers’ storage needs through multiple end markets: “Cloud,” “Client” and “Consumer”. Cloud is comprised primarily of products for public or private cloud environments and enterprise customers. Through the Client end market, we provide our original equipment manufacturer (“OEM”) and channel customers a broad array of high-performance HDD solutions across desktop and notebooks. The Consumer end market provides a broad range of retail and other end-user products, which capitalize on the strength of our product brand recognition and vast points of presence around the world.\nOur fiscal year ends on the Friday nearest to June 30 and typically consists of 52 weeks. Approximately every five to six years, we report a 53-week fiscal year to align the fiscal year with the foregoing policy. Fiscal year 2026, ending on July 3, 2026 will be comprised of 53 weeks, with the first quarter consisting of 14 weeks. Fiscal years 2025, 2024, and 2023, which ended on June 27, 2025, June 28, 2024, and June 30, 2023, respectively, each comprised 52 weeks, with all quarters presented consisting of 13 weeks.\nKey Developments\nSeparation of Business Units\nOn February 21, 2025 (the “Separation Date”), we completed the separation of our HDD and Flash business units (the “Separation”) to create two independent public companies, with Western Digital focusing on our existing HDD business and Sandisk Corporation (“Sandisk”), formerly a wholly-owned subsidiary of the Company, holding the Flash business. We believe the Separation better positions each business unit to execute innovative technology and product development, capitalize on unique growth opportunities, extend respective leadership positions, operate more efficiently with distinct capital structures, and pursue capital allocation strategies that maximize long-term shareholder value. The Separation was effected through a pro rata distribution of 80.1% of the outstanding shares of Sandisk common stock to holders of the Company’s common stock as of February 12, 2025, the record date for the distribution. The Company did not issue fractional shares of Sandisk common stock in connection with the distribution. Sandisk is now an independent public company, and Sandisk common stock commenced trading “regular way” under the symbol “SNDK” on the Nasdaq Stock Market LLC (“Nasdaq”) on February 24, 2025, which was the next trading day following the distribution date. The Company continues to trade on Nasdaq under the symbol “WDC” following the Separation. Following the Separation, the Company no longer consolidates Sandisk within the Company’s financial results. As part of the Separation, the Company retained 28.8 million shares of Sandisk common stock, or a 19.9% stake. During the quarter ended June 27, 2025, the Company disposed of 21.3 million shares of Sandisk common stock, along with $4 million in cash, in a tax-free exchange for $800 million principal amount of the Company’s term loan A-3. The Company expects to monetize its remaining stake in Sandisk within one year from the Separation Date.\nInformation provided herein is presented on a continuing operations basis to reflect the impact of the Separation. See Part II, Item 8, Note 3, \nDiscontinued Operations\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K for additional information regarding the Separation.\n30\nTable of Contents\nMacroeconomic Conditions\nThe United States has recently announced changes to its trade policy, including increasing tariffs on imports, in some cases significantly. Several of these recent tariff actions have been followed by announcements of limited exemptions and temporary pauses. These actions have caused substantial uncertainty and have also resulted in retaliatory measures on U.S. goods. Our business and results of operations were not materially impacted in fiscal 2025 as a result of the recent tariff actions. We are actively monitoring developments and plan to leverage tariff exemptions where possible and will take other actions as appropriate to offset any resulting increase in the cost of importing our products or the costs for materials or components in our products, including optimizing our supply chain, sourcing from alternative suppliers, or passing the costs to our customers through tariff surcharges, or increased prices. There can be no assurance that we will be able to successfully offset or mitigate any resulting increase in our costs. In addition, the impact of the tariff actions on our customers, retaliatory measures by other countries in response to U.S. trade policy and any resulting decline in consumer confidence, significant inflation and diminished expectations for the economy could reduce demand for our products and adversely affect our business, financial condition and results of operations. For additional information, please see Part I,",
    "item1a": "Item 1A, \nRisk Factors\n, in this Annual Report on Form 10-K.\nA total of $0.98 billion and \n$1.43 billion\n of our cash and cash equivalents were held outside of the U.S. as of June 27, 2025 and June 28, 2024, respectively. There are no material tax consequences that were not previously accrued for on the repatriation of this cash. \nOur cash equivalents are primarily invested in money market funds that invest in U.S. Treasury securities and U.S. Government agency securities. In addition, from time to time, we also invest directly in certificates of deposit, asset-backed securities and corporate and municipal notes and bonds.\n38\nTable of Contents\nOperating Activities\nNet cash provided by or used in operating activities primarily consists of net income or loss, adjusted for non-cash charges, plus or minus changes in operating assets and liabilities. Net cash used for changes in operating assets and liabilities was \n$1.03 billion\n for 2025, as compared to $307 million of net cash used for such changes for 2024, which largely reflects an increase in net operating assets and liabilities resulting from the increase in the volume of our business as well as the timing and amount of tax payments. Changes in our operating assets and liabilities are largely affected by our working capital requirements, which are dependent on our volume of business and the effective management of our cash conversion cycle as well as timing of payments for taxes. Our cash conversion cycle measures how quickly we can convert our products into cash through sales. At the end of the respective fourth quarters, the cash conversion cycles were as follows (in days):\n2025\n2024\n2023\nDays sales outstanding\n52 \n56 \n56 \nDays in inventory\n76 \n97 \n107 \nDays payables outstanding\n(75)\n(73)\n(66)\nCash conversion cycle\n53 \n80 \n97 \nChanges in days sales outstanding (“DSO”) are generally due to the timing of shipments to and collections from customers. Changes in days in inventory (“DIO”) are generally related to the timing of inventory builds and shipments to customers. Changes in days payables outstanding (“DPO”) are generally related to production volume and the timing of purchases during the period. From time to time, we make payment term modifications with vendors through negotiations with them or by granting to, or receiving from, our vendors payment term accommodations. We make modifications primarily to manage our vendor relationships and to manage our cash flows, including our cash balances.\nIn 2025, DSO decreased by 4 days over the prior year, reflecting timing of shipments and customer collections. DIO decreased by 21 days over the prior year, primarily reflecting improvements in inventory management. DPO increased by 2 days over the prior year, primarily due to more favorable payment terms and routine variations in the timing of purchases and payments during the period.\nInvesting Activities\nNet cash provided by investing activities in 2025 primarily consisted of $401 million in net proceeds from our sale of a majority interest in one of our subsidiaries and $148 million in net notes receivable proceeds from Flash Ventures, partially offset by $412 million in capital expenditures. Net cash used in investing activities in 2024 primarily consisted of $487 million of capital expenditures, partially offset by $239 million in net notes receivable proceeds from Flash Ventures and $195 million in proceeds from the sale-leaseback of property, plant and equipment.\nFinancing Activities\nDuring 2025, net cash used in financing activities primarily consisted of $2.09 billion used for the partial repayment of the 2026 Notes, repayment of borrowings on the 2027 Revolving Credit Facility, and scheduled principal payments on our Term Loan A-2 and Term Loan A-3; $1.37 billion of cash transferred to Sandisk at the Separation; $149 million in share repurchases; $113 million for taxes paid on vested stock awards; $73 million in debt issuance costs; and $44 million in dividends on our common stock and our Series A Preferred Stock. These uses were partially offset by $2.00 billion of proceeds from drawing on the Sandisk credit facilities in connection with the Separation, $150 million from the 2027 Revolving Credit Facility, and $77 million from issuances of shares under our employee stock plans. During 2024, net cash provided by financing activities primarily consisted of $3.00 billion in proceeds from the issuance of the 2028 Convertible Notes, the drawdown of a delayed draw term loan and draws on the revolving credit facility. These sources were partially offset by $2.10 billion used for the repayment of draws on the revolving credit facility, repayments of a delayed draw term loan, scheduled payments on the Term Loan A-2, and settlement of our remaining 1.50% convertible senior notes due February 1, 2024 (the “2024 Convertible Notes”); $505 million used to repurchase a portion of the 2024 Convertible Notes; and $155 million for the purchase of capped calls to hedge the potential dilution impact of the conversion feature of the 2028 Convertible Notes.\nA discussion of our cash flows for 2023, including a comparison of such cash flows to 2024, is included in Part II, Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations – Liquidity and Capital Resources\n, included in our Annual Report on Form 10-K for the year ended June 28, 2024 filed with the SEC on\n August 20, 2024.\n39\nTable of Contents\nOff-Balance Sheet Arrangements\nOther than certain indemnification provisions (see “Short- and Long-term Liquidity – \nPurchase Obligations and Other Commitments\n” below), we do not have any other material off-balance sheet financing arrangements or liabilities, guarantee contracts, retained or contingent interests in transferred assets, or any other obligation arising out of a material variable interest in an unconsolidated entity. We do not have any majority-owned subsidiaries that are not included in the Consolidated Financial Statements. Additionally, we do not have an interest in, or relationships with, any variable interest entities.\n40\nTable of Contents\nShort- and Long-term Liquidity\nMaterial Cash Requirements \nThe following is a summary of our known material cash requirements, including those for capital expenditures, as of June 27, 2025. In addition, see the discussions further below related to unrecognized tax benefits, litigation matters, cash dividend program, dividend rights with respect to the Series A Preferred Stock, foreign exchange contracts and indemnifications.\nTotal\n1 Year (2026)\n2-3 Years (2027-2028)\n4-5 Years (2029-2030)\nMore than 5 Years (Beyond 2030)\n(in millions)\nLong-term debt, including current portion\n(1)\n$\n4,749 \n$\n2,226 \n$\n1,523 \n$\n500 \n$\n500 \nInterest on debt\n507 \n203 \n204 \n69 \n31 \nOperating leases\n165 \n36 \n53 \n30 \n46 \nPurchase obligations and other commitments\n76 \n50 \n26 \n— \n— \nMandatory deemed repatriation tax\n331 \n331 \n— \n— \n— \nTotal\n$\n5,828 \n$\n2,846 \n$\n1,806 \n$\n599 \n$\n577 \n(1)\nPrincipal portion of debt, excluding issuance costs.\nUnrecognized Tax Benefits\nAs of June 27, 2025, the liability for unrecognized tax benefits (excluding accrued interest and penalties) was approximately $569 million. Accrued interest and penalties related to unrecognized tax benefits are recognized in liabilities for uncertain tax positions and are recorded in the provision for income taxes. Accrued interest and penalties related to unrecognized tax benefits as of June 27, 2025, were approximately $82 million. Of these amounts, approximately $498 million could result in potential cash payments, of which $332 million is reasonably expected to be paid within the next twelve months. This potential cash payment is expected to be netted with offsetting favorable tax receivables totaling $148 million, including a reduction to our mandatory deemed repatriation tax obligations related to the settlement for the years 2008 through 2015, for a potential net cash payment of $184 million.\nAs noted above, we had previously reached a final agreement with the IRS regarding notices of deficiency with respect to years 2008 through 2012 and in February 2024, we also reached a final agreement for resolving the notices of proposed adjustments with respect to years 2013 through 2015. During the year ended June 27, 2025, we made payments of $130 million for interest with respect to years 2008 through 2012 and $32 million for tax and interest with respect to years 2013 through 2015, resulting in no remaining liability as of June 27, 2025 related to all years from 2008 through 2015.\nIn connection with settlements for the years 2008 through 2015, we expect to realize reductions to our mandatory deemed repatriation tax obligations and tax savings from interest deductions in future years aggregating to approximately $166 million. Of this amount, $65 million of interest savings from the interest paid with respect to years 2008 through 2015 is classified as a deferred tax asset due to interest expense limitation rules. See Part II, Item 8, Note 13,\n Income Taxes\n of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\n Litigation Matters\nFor additional information on our litigation matters, see Part II, Item 8, Note 17, \nLegal Proceedings\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nCash Dividend Program\nOn April 29, 2025, our Board of Directors authorized the adoption of a quarterly cash dividend program. Under the cash dividend program, holders of our common stock will receive dividends when and as declared by our Board of Directors. During the year ended June 27, 2025, we paid cash dividends of $0.10 per share of our outstanding common stock, totaling $36 million, including payment to holders of our Series A Preferred Stock in accordance with their participation rights.\n41\nTable of Contents\nSubsequent to year-end, on July 29, 2025, our Board of Directors declared a cash dividend of $0.10 per share of our common stock, which will be paid on September 18, 2025 to our shareholders of record as of the close of business on September 4, 2025.\nWe may modify, suspend, or cancel our cash dividend program in any manner and at any time. The amount of future dividends under our cash dividend program, and the declaration and payment thereof, will be based upon all relevant factors, including our financial position, results of operations, cash flows, capital requirements and restrictions under our Loan Agreement and other financing agreements, and shall be in compliance with applicable law.\nDividend Rights\nAs of June 27, 2025, 235,000 shares of our Series A Preferred Stock remained outstanding. These shares are entitled to cumulative preferred dividends and will also participate in any dividends declared for common shareholders on an as-converted equivalent basis. See Part II, Item 8, Note 12, \nShareholders’ Equity and Convertible Preferred Stock\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K for more information regarding these dividend provisions.\nDebt\nAs described in “Key Developments – \nCapital Allocation Actions\n” above, we undertook several financing actions during 2025, including the amendment of our Credit Facility in connection with the Separation and the exchange of a portion of our retained interest in Sandisk shares to reduce a portion of our TLA-3 loan balance.\nThe Company issued $1.60 billion aggregate principal amount of convertible senior notes in November 2023, which bear interest at an annual rate of 3.00% and mature on November 15, 2028 (the “2028 Convertible Notes”). The 2028 Convertible Notes are convertible at the option of any holder beginning August 15, 2028 at a conversion price of approximately $37.82 per share of common stock (which conversion price has been adjusted from approximately $52.20 in accordance with the indenture as a result of the Separation). Prior to August 15, 2028, if the trading price of our common stock remains above 130% of the conversion price for at least 20 trading days (whether or not consecutive) during the 30 consecutive trading-day period prior to the end of a calendar quarter, holders of the 2028 Convertible Notes would have the right to convert the 2028 Convertible Notes during the next succeeding calendar quarter. The 2028 Convertible Notes are also convertible prior to August 15, 2028 upon the occurrence of certain corporate events. Upon any conversion of the 2028 Convertible Notes, we will pay cash for the aggregate principal amount of the notes to be converted and pay or deliver, as the case may be, cash, shares of our common stock or a combination thereof, at our election, in respect of the remainder, if any, of our conversion obligation in excess of the aggregate principal amount of the notes being converted.\nThe sale price conditional conversion feature of the 2028 Convertible Notes was triggered during the calendar quarter ended June 30, 2025 and, accordingly, the holders of the 2028 Convertible Notes have the right to convert the notes during the succeeding calendar quarter ending September 30, 2025. As a result, the 2028 Convertible Notes were classified as Short-term debt in the Consolidated Financial Statements as of June 27, 2025. The Company will continue to evaluate the conversion feature quarterly to determine if the 2028 Convertible Notes become convertible in future periods.\nIn addition to our outstanding debt, as of June 27, 2025, we had $1.25 billion available for borrowing under our revolving credit facility maturing in January 2027 (the “2027 Revolving Credit Facility”), subject to customary conditions under the Loan Agreement. The agreements governing our credit facilities each include limits on secured indebtedness and certain types of unsecured subsidiary indebtedness and require us and certain of our subsidiaries to provide guarantees and collateral to the extent the conditions providing for such guarantees and collateral are met. The loan agreement governing our 2027 Revolving Credit Facility and our Term Loan A-3 (as amended, the “Loan Agreement”) requires us to comply with a financial leverage ratio covenant. As of June 27, 2025, we were in compliance with the financial covenant. Additional information regarding our indebtedness, including information about availability under our 2027 Revolving Credit Facility and the principal repayment terms, interest rates, covenants, collateral and other key terms of our outstanding indebtedness, is included in Part II, Item 8, Note 8, \nDebt\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nIn connection with the Separation, we entered into an amendment with our existing lenders under the Loan Agreement governing our Term Loan Facility and the 2027 Revolving Credit Facility that, among other changes, (a) permitted the Separation, (b) provided for the automatic release, in connection with the Separation, of guarantees and liens on collateral provided by Sandisk and Sandisk Technologies, Inc. under the Loan Agreement, (c) provided for the issuance of a new $2.51 billion Term Loan A-3 maturing in January 2027 (the “Term Loan A-3”) in a non-cash exchange to replace our previously \n42\nTable of Contents\nexisting Term Loan A-2 (the “Term Loan A-2” and, together with the Term Loan A-3, the “Term Loan Facility”), (d) facilitated the debt for equity exchange with respect to the Term Loan A-3 in connection with the Sandisk retained interest, and (e) in connection with the Separation, reduced the aggregate commitments under the 2027 Revolving Credit Facility from $2.25 billion to $1.25 billion. In June 2025, we settled $800 million of the Term Loan A-3 principal amount, through a non-cash exchange of 21.3 million shares of Sandisk common stock held by us, and a $4 million cash payment.\nWe may issue additional debt securities in the future that may be guaranteed by our 100% owned domestic subsidiary, Western Digital Technologies, Inc. (“Guarantor” and, together with Western Digital Corporation, the “Obligor Group”). Such guarantees may be full and unconditional, joint and several, on a secured or unsecured, subordinated or unsubordinated basis, and may be subject to certain customary guarantor release conditions. We conduct operations almost entirely through our subsidiaries. Accordingly, the Obligor Group’s cash flow and ability to service any guaranteed registered debt securities will depend on the earnings of our subsidiaries and the distribution of those earnings to the Obligor Group, including the earnings of the non-guarantor subsidiaries, whether by dividends, loans or otherwise. Holders of such guaranteed registered debt securities would have a direct claim only against the Obligor Group.\nThe following tables include summarized financial information for the Obligor Group. The financial information for the Obligor Group is presented on combined basis, excluding intercompany balances and transactions between the Company and the Guarantor, excluding net intercompany balances between the Obligor Group and non-guarantor subsidiaries, and excluding investments in and equity in the earnings of non-guarantor subsidiaries. The Obligor Group’s amounts due from, amounts due to, and transactions with non-guarantor subsidiaries have been presented in separate line items in the tables below.\nThe assets and liabilities of the Obligor Group include the following:\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nCurrent assets\n$\n2,992 \n$\n2,149 \nNon-current assets\n4,553 \n2,208 \nNet intercompany receivables from (payables to) non-guarantor subsidiaries\n(1,543)\n2,473 \nCurrent liabilities\n3,800 \n3,758 \nNon-current liabilities\n2,873 \n6,626 \nThe operating results of the Obligor Group include the following:\nYear Ended\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nNet sales\n$\n5,249 \n$\n4,066 \nGross profit\n1,941 \n1,002 \nOperating income (loss)\n279 \n(927)\nNet income (loss)\n(320)\n(1,211)\nResults for the Obligor Group include the following transactions with non-guarantor subsidiaries:\nYear Ended\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nIntercompany revenue\n$\n1,378 \n$\n1,416 \nNet intercompany interest (income) expense\n(4)\n8 \nIntercompany dividend income\n2,215 \n567 \n43\nTable of Contents\nPurchase Obligations and Other Commitments\nIn the normal course of business, we enter into purchase orders with suppliers for the purchase of components used to manufacture our products. These purchase orders generally cover forecasted component supplies needed for production during the next quarter, are recorded as a liability upon receipt of the components, and generally may be changed or canceled at any time prior to shipment of the components. We also enter into long-term agreements with suppliers that contain fixed future commitments, which are contingent on certain conditions such as performance, quality and technology of the vendor’s components. These arrangements are included under “Purchase obligations and other commitments” in the table above.\nMandatory Deemed Repatriation Tax\nAs of June 27, 2025, our final estimated mandatory deemed repatriation tax obligation is $331 million and is expected to be paid within the next twelve months.\nMandatory Research and Development Expense Capitalization\nSince the beginning of 2023, we have been required to capitalize and amortize both domestic and foreign R&D expenditures rather than expensing them in the year incurred. The OBBBA, which was signed into law on July 4, 2025, includes broad tax reform provisions that extend and modify key elements of the TCJA. Notably, the new legislation now allows an option for the immediate expensing of domestic R&D expenditures, beginning with our fiscal year 2026, which is expected to result in lower cash tax payments in future periods than previously anticipated.\nForeign Exchange Contracts\nWe purchase foreign exchange contracts to hedge the impact of foreign currency fluctuations on certain underlying assets, liabilities and commitments for operating expenses and product costs denominated in foreign currencies. For a description of our current foreign exchange contract commitments, see Part II, Item 8, Note 7, \nDerivative Instruments and Hedging Activities\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nIndemnifications\nIn the ordinary course of business, we may provide indemnifications of varying scope and terms to customers, vendors, lessors, business partners and other parties with respect to certain matters, including, but not limited to, losses arising out of our breach of agreements, products or services to be provided by us, environmental compliance, or from intellectual property infringement claims made by third parties. In addition, we have entered into indemnification agreements with our directors and certain of our officers that will require us, among other things, to indemnify them against certain liabilities that may arise by reason of their status or service as directors or officers. We maintain director and officer insurance, which may cover certain liabilities arising from our obligation to indemnify our directors and officers in certain circumstances.\nIt is not possible to determine the maximum potential amount under these indemnification agreements due to the limited history of prior indemnification claims and the unique facts and circumstances involved in each particular agreement. Such indemnification agreements may not be subject to maximum loss clauses. Historically, we have not incurred material costs as a result of obligations under these agreements.\nRecent Accounting Pronouncements\nFor a description of recently issued and adopted accounting pronouncements, including the respective dates of adoption and expected effects on our results of operations and financial condition, see Part II, Item 8, Note 2, \nRecent Accounting Pronouncements\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nCritical Accounting Policies and Estimates\nWe have prepared the accompanying Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States (“U.S. GAAP”). The preparation of the financial statements requires the use of judgments and estimates that affect the reported amounts of revenues, expenses, assets, liabilities and shareholders’ equity. We have adopted accounting policies and practices that are generally accepted in the industry in which we operate. If these estimates differ significantly from actual results, the impact to the Consolidated Financial Statements may be material.\n44\nTable of Contents\nRevenue\nWe provide distributors and retailers (collectively referred to as “resellers”) with limited price protection for inventories held by resellers at the time of published list price reductions. We also provide resellers and OEMs with other sales incentive programs. We record estimated variable consideration related to these items as a reduction to revenue at the time of revenue recognition. We use judgment in our assessment of variable consideration in contracts to be included in the transaction price. We use the expected value method to arrive at the amount of variable consideration. We constrain variable consideration until the likelihood of a significant revenue reversal is not probable and believe that the expected value method is the appropriate estimate of the amount of variable consideration based on the fact that we have a large number of contracts with similar characteristics.\nFor sales to OEMs, our methodology for estimating variable consideration is based on the amount of consideration expected to be earned based on the OEMs’ volume of purchases from us or other agreed-upon sales incentive programs. For sales to resellers, the methodology for estimating variable consideration is based on several factors including historical pricing information, current pricing trends and channel inventory levels. Estimating the impact of these factors requires significant judgement and the estimated amount of variable consideration can differ from the actual amount.\nInventories\nWe value inventories at the lower of cost or net realizable value (“NRV”) with cost determined on a first-in, first-out basis. We record inventory write-downs of our inventory to the lower of cost or net realizable value or for obsolete or excess inventory based on assumptions, which requires significant judgement. The determination of NRV involves estimating the ASPs less any selling expenses of inventory based on market conditions and customer demand. To estimate the ASPs and selling expenses of inventory, we review historical sales, future demand, economic conditions, contract prices and other information.\nWe periodically perform an analysis of potential excess and obsolete inventory based on assumptions, which includes changes in business and economic conditions, changes in technology and projected demand of our products. If in any period we anticipate a change in those assumptions to be less favorable than our previous estimates, additional inventory write-downs may be required and could materially and negatively impact our gross margin. If in any period, we can sell inventories that had been written down to a level below the realized selling price in previous periods, higher gross profit would be recognized in the current period.\nIncome Taxes\nWe account for income taxes under the asset and liability method, which provides that deferred tax assets and liabilities be recognized for temporary differences between the financial reporting bases and the tax bases of our assets and liabilities and expected benefits of utilizing net operating loss and tax credit carryforwards. We record a valuation allowance when it is more likely than not that the deferred tax assets will not be realized. Each quarter, we evaluate the need for a valuation allowance for our deferred tax assets and we adjust the valuation allowance so that we record net deferred tax assets only to the extent that we conclude it is more likely than not that these deferred tax assets will be realized. The assessment of valuation allowances against our deferred tax assets requires estimations and significant judgment. We continue to assess and adjust our valuation allowance based on operating results and market conditions. We account for interest and penalties related to income taxes as a component of the provision for income taxes.\nWe recognize liabilities for uncertain tax positions based on a two-step process. To the extent a tax position does not meet a more-likely-than-not level of certainty, no benefit is recognized in the Consolidated Financial Statements. If a position meets the more-likely-than-not level of certainty, it is recognized in the Consolidated Financial Statements at the largest amount that has a greater than 50% likelihood of being realized upon ultimate settlement. Interest and penalties related to unrecognized tax benefits are recognized on liabilities recorded for uncertain tax positions and are recorded in our provision for income taxes. The actual liability for unrealized tax benefits in any such contingency may be materially different from our estimates, which could result in the need to record additional liabilities for unrecognized tax benefits or potentially adjust previously recorded liabilities for unrealized tax benefits and materially affect our operating results.\nLitigation and Contingencies\n45\nTable of Contents\nWe disclose information regarding claims and contingencies where the likelihood of a material loss is probable or reasonably possible. If a loss contingency is probable and the amount of the loss can be reasonably estimated, we record an accrual for the loss. In such cases, there may be an exposure to potential loss in excess of the amount accrued. Where a loss is not probable but is reasonably possible or where a loss in excess of the amount accrued is reasonably possible, we disclose the matter and an estimate of the amount of the loss or range of possible losses for the claim if a reasonable estimate can be made, unless the amount of such reasonably possible losses is not material to our financial position, results of operations or cash flows. The ability to predict the ultimate outcome of such matters involves significant judgments about the merits of the claim, applicable law, potential outcomes, estimates and inherent uncertainties. We engage relevant subject matter experts to assist us with our assessment of available information to reach conclusions on the likelihood and amount, or range, of potential loss. The actual outcome of such matters could differ materially from our estimates.\n46\nTable of Contents\nItem 7A.\n    \nQuantitative and Qualitative Disclosures About Market Risk\nDisclosure About Foreign Currency Risk\nAlthough the majority of our transactions are in U.S. dollars, some transactions are based in various foreign currencies. We purchase short-term foreign exchange contracts to hedge the impact of foreign currency exchange fluctuations on certain underlying assets, liabilities and commitments for product costs and Operating expenses denominated in foreign currencies. The purpose of entering into these hedge transactions is to minimize the impact of foreign currency fluctuations on our results of operations. Substantially all of the contract maturity dates do not exceed 12 months. We do not purchase foreign exchange contracts for speculative or trading purposes. For additional information, see Part II, Item 8, Note 6, \nFair Value Measurements and Investments,\n and Note 7, \nDerivative Instruments and Hedging Activities\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nWe have performed sensitivity analyses for 2025 using a modeling technique that measures the change in the fair values arising from a hypothetical 10% adverse movement in the levels of foreign currency exchange rates relative to the U.S. dollar, with all other variables held constant. The analyses cover all of our foreign currency derivative contracts used to offset the underlying exposures. The foreign currency exchange rates used in performing the sensitivity analyses were based on market rates in effect at June 27, 2025. The sensitivity analyses indicated that a hypothetical 10% adverse movement in foreign currency exchange rates relative to the U.S. dollar would result in a foreign exchange fair value loss of $75 million at June 27, 2025.\nDuring 2025, 2024 and 2023, total net realized and unrealized transaction and foreign exchange contract currency gains and losses were not material to our Consolidated Financial Statements.\nNotwithstanding our efforts to mitigate some foreign exchange risks, we do not hedge all of our foreign currency exposures, and there can be no assurance that our mitigating activities related to the exposures that we hedge will adequately protect us against risks associated with foreign currency fluctuations.\nDisclosure About Interest Rate Risk\nVariable Interest Rate Risk \nWe have generally held a balance of fixed and variable rate debt. As of June 27, 2025, our variable rate debt outstanding consisted of our Term Loan A-3, which is based on various index rates as discussed further in Note 8, \nDebt\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K. As of June 27, 2025, the outstanding balance on our Term Loan A-3 was $1.65 billion, and a 1% increase in the variable rate of interest would increase annual interest expense by $16 million.\n47\nTable of Contents\nItem 8.\n    \nFinancial Statements and Supplementary Data\nIndex to Financial Statements \nPAGE NO.\nConsolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm (Auditor Firm ID: \n185\n)\n49\nConsolidated Balance Sheets — As of June 27, 2025 and June 28, 2024\n52\nConsolidated Statements of Operations — Three Years Ended June 27, 2025\n53\nConsolidated Statements of Comprehensive Income (Loss) — Three Years Ended June 27, 2025\n54\nConsolidated Statements of Cash Flows — Three Years Ended June 27, 2025\n55\nConsolidated Statements of Convertible Preferred Stock and Shareholders’ Equity — Three Years Ended June 27, 2025\n56\nNotes to Consolidated Financial Statements\n57\n48\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors\nWestern Digital Corporation:\nOpinions on the Consolidated Financial Statements and Internal Control Over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Western Digital Corporation and subsidiaries (the Company) as of June 27, 2025 and June 28, 2024, the related consolidated statements of operations, comprehensive income (loss), cash flows, and convertible preferred stock and shareholders’ equity for each of the fiscal years in the three-year period ended June 27, 2025, and the related notes (collectively, the consolidated financial statements). We also have audited the Company’s internal control over financial reporting as of June 27, 2025, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of June 27, 2025 and June 28, 2024, and the results of its operations and its cash flows for each of the fiscal years in the three-year period ended June 27, 2025, in conformity with U.S. generally accepted accounting principles. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of June 27, 2025 based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nBasis for Opinions\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s consolidated financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\n49\nTable of Contents\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nEvaluation of sufficiency of audit evidence over certain variable consideration reductions to revenue\nAs discussed in Note 1 to the consolidated financial statements, the Company provides distributors and retailers (collectively referred to as resellers) with limited price protection and resellers and original equipment manufacturers (OEMs) with other sales incentive programs. The Company records the estimated variable consideration related to these items as a reduction to revenue at the time of revenue recognition.\nWe identified the evaluation of the sufficiency of audit evidence over certain variable consideration reductions to revenue for sales to resellers and OEMs as a critical audit matter. This matter required a high degree of auditor effort in performing procedures to assess the reasonableness of certain variable consideration and associated customer-related accruals as such reductions to revenue involve a number of complex integrated information technology (IT) systems. Therefore, our audit procedures required the involvement of IT professionals with specialized skills and knowledge and auditor judgment was required to determine the nature and extent of audit evidence obtained and to evaluate the results of the procedures.\nThe following are the primary procedures we performed to address this critical audit matter.\n•\nWe evaluated the design and tested the operating effectiveness of certain internal controls related to the Company’s process for determining variable consideration.\n•\nWe involved IT professionals with specialized skills and knowledge, who assisted in the determination and testing of certain IT general and application controls that are used by the Company to determine variable consideration.\n•\nWe assessed certain of the recorded variable consideration by selecting a sample of transactions and comparing the amounts recognized for consistency with underlying documentation.\n•\nWe evaluated the overall sufficiency of audit evidence obtained by assessing the results of procedures performed, including the appropriateness of such evidence.\n50\nTable of Contents\nTax-free determination of the Flash business separation and the debt-for-equity exchange\nAs described in Note 3 to the consolidated financial statements, on February 21, 2025, the Company completed the separation of its Flash business through a pro rata distribution of 80.1% of the outstanding shares of Sandisk Corporation (Sandisk) to the Company’s stockholders. In connection with the separation, the Company completed an external spin-off transaction and an exchange of Sandisk common stock for a portion of the Company’s Term Loan A-3. Management has determined that the separation and the debt-for-equity exchange (collectively referred to as the Transactions) qualified as tax-free transactions under the applicable sections of the United States (U.S.) Internal Revenue Code. The determination of the tax consequences of these Transactions required management to make judgments about the application of tax laws and regulations.\nWe identified the evaluation of income tax treatment of the Transactions as a critical audit matter. This matter required especially subjective auditor judgment and effort in assessing the significant judgments by management in applying relevant tax laws and regulations in determining the tax-free treatment of the Transactions and in performing procedures and evaluating audit evidence. Involvement of professionals with specialized tax skills and knowledge was required.\nThe following are the primary procedures we performed to address this critical audit matter.\n•\nWe evaluated the design and tested the operating effectiveness of certain internal controls relating to management’s determination of the tax-free treatment of the Transactions.\n•\nWe involved professionals with specialized skills and knowledge to assist in assessing the Company’s identification, interpretation, and application of tax laws and evaluating the Company’s analyses prepared to support management’s determination that the Transactions qualified as tax-free.\n/s/ \nKPMG LLP\nWe have served as the Company’s auditor since 1970.\nSanta Clara, California\n \nAugust 13, 2025\n51\nTable of Contents\n WESTERN DIGITAL CORPORATION\n CONSOLIDATED BALANCE SHEETS\n(in millions, except par value)\nJune 27,\n2025\nJune 28,\n2024\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n2,114\n \n$\n1,551\n \nAccounts receivable, net\n1,486\n \n1,231\n \nInventories\n1,291\n \n1,387\n \nRetained interest in Sandisk\n354\n \n—\n \nOther current assets\n611\n \n360\n \nCurrent assets of discontinued operations\n—\n \n3,531\n \nTotal current assets\n5,856\n \n8,060\n \nProperty, plant and equipment, net\n2,343\n \n2,359\n \nGoodwill\n4,319\n \n4,319\n \nOther non-current assets\n1,484\n \n837\n \nNon-current assets of discontinued operations\n—\n \n8,613\n \nTotal assets\n$\n14,002\n \n$\n24,188\n \nLIABILITIES, CONVERTIBLE PREFERRED STOCK AND SHAREHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable\n$\n1,266\n \n$\n1,054\n \nAccrued expenses\n719\n \n1,053\n \nIncome taxes payable\n800\n \n471\n \nAccrued compensation\n407\n \n435\n \nCurrent portion of long-term debt\n2,226\n \n1,750\n \nCurrent liabilities of discontinued operations\n—\n \n1,324\n \nTotal current liabilities\n5,418\n \n6,087\n \nLong-term debt\n2,485\n \n5,684\n \nOther liabilities\n559\n \n1,002\n \nNon-current liabilities of discontinued operations\n—\n \n368\n \nTotal liabilities\n8,462\n \n13,141\n \nCommitments and contingencies (Notes 10, 13 and 17)\nConvertible preferred stock, $\n0.01\n par value; authorized — \n5\n shares; issued and outstanding — \n0.2\n shares as of both June 27, 2025 and June 28, 2024; aggregate liquidation preference of $\n265\n and $\n257\n as of June 27, 2025 and June 28, 2024, respectively\n229\n \n229\n \nShareholders’ equity:\nCommon stock, $\n0.01\n par value; authorized — \n750\n shares; issued and outstanding — \n347\n shares as of June 27, 2025 and \n343\n shares as of June 28, 2024\n3\n \n3\n \nAdditional paid-in capital\n4,621\n \n4,752\n \nAccumulated other comprehensive income (loss)\n20\n \n(\n712\n)\nRetained earnings\n762\n \n6,775\n \nTreasury stock — common shares at cost; \n95\n shares in 2025 and \n0\n shares in 2024\n(\n95\n)\n—\n \nTotal shareholders’ equity\n5,311\n \n10,818\n \nTotal liabilities, convertible preferred stock and shareholders’ equity\n$\n14,002\n \n$\n24,188\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n52\nTable of Contents\nWESTERN DIGITAL CORPORATION\n CONSOLIDATED STATEMENTS OF OPERATIONS\n(in millions, except per share amounts)\n \nYear Ended\nJune 27,\n2025\nJune 28,\n2024\nJune 30,\n2023\nRevenue, net\n$\n9,520\n \n$\n6,317\n \n$\n6,255\n \nCost of revenue\n5,828\n \n4,544\n \n4,864\n \nGross profit\n3,692\n \n1,773\n \n1,391\n \nOperating expenses:\nResearch and development\n994\n \n950\n \n986\n \nSelling, general and administrative\n568\n \n726\n \n807\n \nLitigation matter\n(\n198\n)\n291\n \n—\n \nBusiness realignment charges\n(\n6\n)\n209\n \n146\n \nTotal operating expenses\n1,358\n \n2,176\n \n1,939\n \nOperating income (loss)\n2,334\n \n(\n403\n)\n(\n548\n)\nInterest and other income (expense):\nInterest income\n45\n \n33\n \n19\n \nInterest expense\n(\n357\n)\n(\n414\n)\n(\n310\n)\nLoss on retained interest in Sandisk\n(\n772\n)\n—\n \n—\n \nLoss on extinguishment of debt\n(\n100\n)\n—\n \n—\n \nOther income (expense), net\n(\n20\n)\n45\n \n(\n10\n)\nTotal interest and other expense, net\n(\n1,204\n)\n(\n336\n)\n(\n301\n)\nIncome (loss) before taxes\n1,130\n \n(\n739\n)\n(\n849\n)\nIncome tax expense (benefit)\n(\n513\n)\n26\n \n53\n \nNet income (loss) from continuing operations\n1,643\n \n(\n765\n)\n(\n902\n)\nNet income (loss) from discontinued operations, net of taxes\n246\n \n(\n33\n)\n(\n782\n)\nNet income (loss)\n$\n1,889\n \n$\n(\n798\n)\n$\n(\n1,684\n)\nNet income (loss) per common share:\nBasic:\nContinuing operations\n$\n4.61\n \n$\n(\n2.51\n)\n$\n(\n2.91\n)\nDiscontinued operations\n0.70\n \n(\n0.10\n)\n(\n2.46\n)\nNet income (loss) per share\n5.31\n \n(\n2.61\n)\n(\n5.37\n)\nDiluted:\nContinuing operations\n4.45\n \n(\n2.51\n)\n(\n2.91\n)\nDiscontinued operations\n0.67\n \n(\n0.10\n)\n(\n2.46\n)\nNet income (loss) per share\n5.12\n \n(\n2.61\n)\n(\n5.37\n)\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n53\nTable of Contents\nWESTERN DIGITAL CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS) \n(in millions)\n \nYear Ended\nJune 27,\n2025\nJune 28,\n2024\nJune 30,\n2023\nNet income (loss)\n$\n1,889\n \n$\n(\n798\n)\n$\n(\n1,684\n)\nOther comprehensive gain (loss), before tax:\nActuarial pension gain\n3\n \n23\n \n12\n \nForeign currency translation adjustment\n45\n \n(\n115\n)\n(\n88\n)\nNet unrealized gain (loss) on derivative contracts \n180\n \n(\n87\n)\n138\n \nTotal other comprehensive gain (loss), before tax\n228\n \n(\n179\n)\n62\n \nIncome tax benefit (expense) related to items of other comprehensive gain (loss), before tax\n(\n42\n)\n15\n \n(\n31\n)\nOther comprehensive gain (loss), net of tax\n186\n \n(\n164\n)\n31\n \nTotal comprehensive income (loss)\n$\n2,075\n \n$\n(\n962\n)\n$\n(\n1,653\n)\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n54\nTable of Contents\nWESTERN DIGITAL CORPORATION\n CONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions)\nYear Ended\nJune 27,\n2025\nJune 28,\n2024\nJune 30,\n2023\nCash flows from operating activities\nNet income (loss)\n$\n1,889\n \n$\n(\n798\n)\n$\n(\n1,684\n)\nAdjustments to reconcile net income (loss) to net cash provided by (used in) operations:\nDepreciation and amortization\n451\n \n568\n \n828\n \nStock-based compensation\n265\n \n295\n \n318\n \nDeferred income taxes\n(\n745\n)\n(\n161\n)\n(\n48\n)\nGain on disposal of assets\n(\n2\n)\n(\n87\n)\n(\n7\n)\nNon-cash asset impairment\n2\n \n158\n \n19\n \nGain on business divestiture\n(\n113\n)\n—\n \n—\n \nAmortization of debt issuance costs and discounts\n23\n \n19\n \n13\n \nLoss on retained interest in Sandisk\n772\n \n—\n \n—\n \nLoss on extinguishment of debt\n100\n \n—\n \n—\n \nOther non-cash operating activities, net\n80\n \n19\n \n61\n \nChanges in:\nAccounts receivable, net\n79\n \n(\n568\n)\n1,206\n \nInventories\n(\n409\n)\n356\n \n(\n60\n)\nAccounts payable\n307\n \n244\n \n(\n459\n)\nAccounts payable to related parties\n(\n39\n)\n21\n \n(\n28\n)\nAccrued expenses\n(\n366\n)\n197\n \n(\n352\n)\nIncome taxes payable\n348\n \n(\n474\n)\n130\n \nAccrued compensation\n(\n46\n)\n259\n \n(\n162\n)\nOther assets and liabilities, net\n(\n905\n)\n(\n342\n)\n(\n183\n)\nNet cash provided by (used in) operating activities\n1,691\n \n(\n294\n)\n(\n408\n)\nCash flows from investing activities\nPurchases of property, plant and equipment\n(\n412\n)\n(\n487\n)\n(\n821\n)\nProceeds from the sale of property, plant and equipment\n5\n \n195\n \n14\n \nProceeds from business divestiture\n401\n \n—\n \n—\n \nNotes receivable issuances to Flash Ventures\n(\n266\n)\n(\n243\n)\n(\n627\n)\nNotes receivable proceeds from Flash Ventures\n239\n \n482\n \n641\n \nDistribution from Flash Ventures\n175\n \n—\n \n—\n \nStrategic investments and other, net\n8\n \n26\n \n31\n \nNet cash provided by (used in) investing activities\n150\n \n(\n27\n)\n(\n762\n)\nCash flows from financing activities\nIssuance of stock under employee stock plans\n77\n \n80\n \n93\n \nTaxes paid on vested stock awards under employee stock plans\n(\n113\n)\n(\n88\n)\n(\n80\n)\nPurchase of capped calls\n—\n \n(\n155\n)\n—\n \nProceeds from convertible preferred stock, net of issuance costs\n—\n \n(\n5\n)\n881\n \nRepurchases of common stock\n(\n149\n)\n—\n \n—\n \nDividends paid to shareholders\n(\n44\n)\n—\n \n—\n \nRepurchases of debt\n—\n \n(\n505\n)\n—\n \nRepayment of debt\n(\n2,094\n)\n(\n2,104\n)\n(\n1,180\n)\nProceeds from debt issuance\n2,150\n \n3,000\n \n1,180\n \nDebt issuance costs\n(\n73\n)\n(\n36\n)\n(\n19\n)\nCash transferred to Sandisk related to Separation\n(\n1,366\n)\n—\n \n—\n \nNet cash provided by (used in) financing activities\n(\n1,612\n)\n187\n \n875\n \nEffect of exchange rate changes on cash\n6\n \n(\n10\n)\n(\n9\n)\nNet increase (decrease) in cash and cash equivalents\n235\n \n(\n144\n)\n(\n304\n)\nCash and cash equivalents, beginning of year\n1,879\n \n2,023\n \n2,327\n \nCash and cash equivalents, end of year\n$\n2,114\n \n$\n1,879\n \n$\n2,023\n \nSupplemental disclosure of cash flow information:\nCash paid for income taxes\n$\n789\n \n$\n920\n \n$\n177\n \nCash paid for interest\n$\n367\n \n$\n396\n \n$\n294\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n55\nTable of Contents\nWESTERN DIGITAL CORPORATION\nCONSOLIDATED STATEMENTS OF CONVERTIBLE PREFERRED STOCK AND SHAREHOLDERS’ EQUITY\n(in millions)\nConvertible Preferred Stock\nCommon Stock\nTreasury Stock\nAdditional Paid-In Capital\nAccumulated Other Comprehensive Income (Loss)\nRetained Earnings\nTotal Shareholders’ Equity\nShares\nAmount\nShares\nAmount\nShares\nAmount\nBalance at July 1, 2022\n—\n \n$\n—\n \n315\n \n$\n3\n \n—\n \n$\n—\n \n$\n3,733\n \n$\n(\n579\n)\n$\n9,166\n \n$\n12,323\n \nNet loss\n— \n— \n— \n— \n— \n— \n— \n— \n(\n1,684\n)\n(\n1,684\n)\nAdoption of new accounting standard\n— \n— \n— \n— \n— \n— \n(\n128\n)\n— \n91\n \n(\n37\n)\nEmployee stock plans\n— \n— \n7\n \n— \n— \n— \n13\n \n— \n— \n13\n \nStock-based compensation\n— \n— \n— \n— \n— \n— \n318\n \n— \n— \n318\n \nIssuance of convertible preferred stock, net of issuance costs\n0.9\n \n876\n \n— \n— \n— \n— \n— \n— \n— \n— \nActuarial pension gain\n— \n— \n— \n— \n— \n— \n— \n9\n \n— \n9\n \nForeign currency translation adjustment\n— \n— \n— \n— \n— \n— \n— \n(\n87\n)\n— \n(\n87\n)\nNet unrealized gain on derivative contracts\n— \n— \n— \n— \n— \n— \n— \n109\n \n— \n109\n \nBalance at June 30, 2023\n0.9\n \n876\n \n322\n \n3\n \n—\n \n—\n \n3,936\n \n(\n548\n)\n7,573\n \n10,964\n \nNet loss\n— \n— \n— \n— \n— \n— \n— \n— \n(\n798\n)\n(\n798\n)\nPurchase of capped calls related to the issuance of convertible notes, net of tax\n— \n— \n— \n— \n— \n— \n(\n118\n)\n— \n— \n(\n118\n)\nConversion of convertible preferred stock\n(\n0.7\n)\n(\n647\n)\n15\n \n— \n— \n— \n647\n \n— \n— \n647\n \nEmployee stock plans\n— \n— \n6\n \n— \n— \n— \n(\n8\n)\n— \n— \n(\n8\n)\nStock-based compensation\n— \n— \n— \n— \n— \n— \n295\n \n— \n— \n295\n \nActuarial pension gain\n— \n— \n— \n— \n— \n— \n— \n16\n \n— \n16\n \nForeign currency translation adjustment\n— \n— \n— \n— \n— \n— \n— \n(\n116\n)\n— \n(\n116\n)\nNet unrealized loss on derivative contracts\n— \n— \n— \n— \n— \n— \n— \n(\n64\n)\n— \n(\n64\n)\nBalance at June 28, 2024\n0.2\n \n229\n \n343\n \n3\n \n—\n \n—\n \n4,752\n \n(\n712\n)\n6,775\n \n10,818\n \nNet income\n— \n— \n— \n— \n— \n— \n— \n— \n1,889\n \n1,889\n \nDistribution in connection with the Separation\n— \n— \n— \n— \n— \n— \n(\n307\n)\n546\n \n(\n7,857\n)\n(\n7,618\n)\nEmployee stock plans\n— \n— \n4\n \n— \n1\n \n54\n \n(\n90\n)\n— \n— \n(\n36\n)\nStock-based compensation\n— \n— \n— \n— \n— \n— \n265\n \n— \n— \n265\n \nRepurchases of common stock\n— \n— \n— \n— \n(\n3\n)\n(\n149\n)\n— \n— \n— \n(\n149\n)\nPreferred stock dividends\n— \n— \n— \n— \n— \n— \n— \n— \n(\n8\n)\n(\n8\n)\nCommon stock dividends ($\n0.10\n per share)\n— \n— \n— \n— \n— \n— \n1\n \n— \n(\n37\n)\n(\n36\n)\nActuarial pension gain\n— \n— \n— \n— \n— \n— \n— \n2\n \n— \n2\n \nForeign currency translation adjustment\n— \n— \n— \n— \n— \n— \n— \n45\n \n— \n45\n \nNet unrealized gain on derivative contracts\n— \n— \n— \n— \n— \n— \n— \n139\n \n— \n139\n \nBalance at June 27, 2025\n0.2\n \n$\n229\n \n347\n \n$\n3\n \n(\n2\n)\n$\n(\n95\n)\n$\n4,621\n \n$\n20\n \n$\n762\n \n$\n5,311\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n56\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n \nNote 1.    \nOrganization and Basis of Presentation\nWestern Digital Corporation (“Western Digital” or the “Company”) is a leading developer, manufacturer, and provider of data storage devices and solutions based on hard disk drives (“HDD”) technologies. \nThe Company manufactures, markets, and sells data storage devices and solutions in the United States (“U.S.”) and in foreign countries through its sales personnel, dealers, distributors, retailers, and subsidiaries. Its broad portfolio of technology and products addresses the following key end markets: Cloud, Client, and Consumer. Cloud is comprised primarily of products for public or private cloud environments and enterprise customers. Through the Client end market, the Company provides its OEM and channel customers a broad array of high-performance HDD solutions across desktop and notebooks. The Consumer end market provides a broad range of retail and other end-user products, which capitalize on the strength of the Company’s product brand recognition and vast presence around the world. The Company also generates immaterial license and royalty revenue from its extensive intellectual property portfolio, which is included in each of these three end market categories.\nBasis of Presentation\nThe Company has prepared its Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States (“U.S. GAAP”) and has adopted accounting policies and practices which are generally accepted in the industry in which it operates. The Company’s significant accounting policies are summarized below.\nInformation provided herein is presented on a continuing operations basis to reflect the impact of the Separation of the Company’s Flash business as discussed in further detail in Note 3, \nDiscontinued Operations\n.\nFiscal Year\nThe Company’s fiscal year ends on the Friday nearest to June 30 and typically consists of 52 weeks. Approximately every five to six years, the Company reports a 53-week fiscal year to align the fiscal year with the foregoing policy. Fiscal years 2025, 2024, and 2023, which ended on June 27, 2025, June 28, 2024 and June 30, 2023, respectively, are comprised of 52 weeks, with all quarters presented consisting of 13 weeks. Unless otherwise indicated, references herein to specific years and quarters are to fiscal years and fiscal quarters, and references to financial information are on a consolidated continuing operations basis.\n \nSegment Reporting\nHistorically, the Company had been managed and operated under \ntwo\n reportable segments: HDD and Flash-based products (“Flash”). As a result of the Separation (as defined in Note 3, \nDiscontinued Operations\n) and disposition of the Flash segment, the Company’s continuing operations now consist of a single reportable segment, HDD. The Chief Executive Officer, who is the Company’s Chief Operating Decision Maker (“CODM”), now evaluates the performance of the Company and makes decisions regarding the allocation of resources based on the Compan\ny’s consolidated results.\nBasis of Consolidation\nThe Consolidated Financial Statements include the accounts of the Company and its wholly-owned subsidiaries. All significant intercompany accounts and transactions have been eliminated in consolidation. The functional currency of most of the Company’s foreign subsidiaries is the U.S. dollar. The accounts of these foreign subsidiaries have been remeasured using the U.S. dollar as the functional currency. Gains or losses resulting from the remeasurement of these accounts from local currencies into U.S. dollars were immaterial to the Consolidated Financial Statements. Financial statements of the Company’s foreign subsidiaries for which the functional currency is the local currency are translated into U.S. dollars using the exchange rate at each balance sheet date for assets and liabilities and a weighted average exchange rate for each period for statement of operations items. Translation adjustments are recorded in Accumulated other comprehensive income (loss), a component of shareholders’ equity.\n57\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nUse of Estimates\nCompany management has made estimates and assumptions relating to the reporting of certain assets and liabilities in conformity with U.S. GAAP. These estimates and assumptions have been applied using methodologies that are consistent throughout the periods presented with consideration given to the potential impacts of tariffs. However, actual results could differ materially from these estimates and be significantly affected by changes in U.S. trade policies, including tariffs, trade agreements or other trade restrictions imposed by the United States or other governments and possible retaliatory measures on U.S. goods.\nCash Equivalents\nThe Company’s cash equivalents represent highly liquid investments in money market funds, which are invested in U.S. Treasury securities and U.S. Government agency securities as well as bank certificates of deposit with original maturities at purchase of three months or less. These deposits are typically in excess of U.S. insured limits. Cash equivalents are carried at cost plus accrued interest, which approximates fair value.\nEquity Investments\nThe Company enters into certain strategic investments for the promotion of business and strategic objectives. The equity method of accounting is used if the Company’s ownership interest is greater than or equal to 20% but less than a majority, or where the Company has the ability to exercise significant influence over operating and financial policies. The Company’s equity in the earnings or losses in equity-method investments is recognized in Other income (expense), net, in the Consolidated Statements of Operations and were immaterial for all years presented.\nThe Company’s retained interest in Sandisk is less than 20% and the Company does not have the ability to exercise significant influence over Sandisk’s operating and financial policies. As such, the Company accounts for this interest at fair value. The Company also has an immaterial amount of equity securities that do not have a readily determinable fair value. These securities are measured and recorded using the measurement alternative under Accounting Standards Update (“ASU”) No. 2016-01, “Financial Instruments – Overall (Subtopic 825-10): Recognition and Measurement of Financial Assets and Financial Liabilities,” which is cost minus impairment, if any, plus or minus changes resulting from observable price changes. These investments are recorded within Other non-current assets in the Consolidated Balance Sheets and are periodically analyzed to determine whether or not there are indicators of impairment.\nFair Value of Financial Instruments\nThe carrying amounts of cash equivalents, accounts receivable, accounts payable and accrued expenses approximate fair value for all periods presented because of the short-term maturity of these assets and liabilities. The fair value of investments that are not accounted for under the equity method is based on appropriate market information.\nInventories\nThe Company values inventories at the lower of cost (first-in, first out) or net realizable value. The first-in, first-out method is used to value the cost of the majority of the Company’s inventories. Inventory write-downs are recorded for the valuation of inventory at the lower of cost or net realizable value by analyzing market conditions and estimates of future sales prices as compared to inventory costs and inventory balances.\nThe Company evaluates inventory balances for excess quantities and obsolescence on a regular basis by analyzing estimated demand, inventory on hand, sales levels and other information and reduces inventory balances to net realizable value for excess and obsolete inventory based on this analysis. Unanticipated changes in technology or customer demand could result in a decrease in demand for one or more of the Company’s products, which may require a write-down of inventory that could materially affect operating results.\n58\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nProperty, Plant and Equipment\nProperty, plant, and equipment are carried at cost less accumulated depreciation and amortization. The cost of property, plant and equipment is depreciated over the estimated useful lives of the respective assets. The Company’s buildings and improvements are depreciated over periods ranging from \nfifteen\n to \nthirty years\n. The majority of the Company’s machinery and equipment, software, and furniture and fixtures are depreciated on a straight-line basis over a period of \ntwo\n to \nseven years\n. Leasehold improvements are amortized over the lesser of the estimated useful lives of the assets or the related lease terms.\nGoodwill and Other Long-Lived Assets\nGoodwill is not amortized. Instead, it is tested for impairment on an annual basis or more frequently whenever events or changes in circumstances indicate that goodwill may be impaired. The Company performs an annual impairment test as of the beginning of its fourth quarter. The Company uses qualitative factors to determine whether goodwill is more likely than not impaired and whether a quantitative test for impairment is considered necessary. If the Company concludes from the qualitative assessment that goodwill is more likely than not impaired, the Company is required to perform a quantitative approach to determine the amount of impairment. The Company’s assessments resulted in \nno\n impairment of goodwill in 2025, 2024 or 2023. \nThe Company is required to use judgment when applying goodwill impairment tests, including the identification of its reporting unit and the determination of fair value. In addition, the estimates used to determine the fair value of its reporting unit may change based on the results of operations, macroeconomic conditions or other factors. Changes in these estimates could materially affect the Company’s assessment of the fair value and goodwill impairment. If the Company’s stock price decreases significantly, goodwill could become impaired, which could result in a material charge and adversely affect the Company’s results of operations.\nIn-process research and development (“IPR&D”) is an intangible asset accounted for as an indefinite-lived asset until the completion or abandonment of the associated research and development effort. During the development period, the Company conducts an IPR&D impairment test at least annually or whenever events or changes in facts and circumstances indicate that it is more likely than not that the IPR&D is impaired. Events which might indicate impairment include, but are not limited to, adverse cost factors, strategic decisions made in response to economic, market, and competitive conditions, and the impact of the economic environment on the Company and on its customer base. If impairment is indicated, the impairment is measured as the amount by which the carrying amounts of the assets exceed the fair values of the assets. The Company’s assessment resulted in \nno\n impairment of IPR&D in 2025, 2024 or 2023. \nOther long-lived assets are depreciated or amortized over their estimated useful lives based on the pattern in which the economic benefits are expected to be received. Long-lived assets are tested for recoverability whenever events or changes in circumstances indicate that their carrying amounts may not be recoverable from undiscounted cash flows. If impairment is indicated, the impairment is measured as the amount by which the carrying amounts of the assets exceed the fair values of the assets. The estimates of fair value require evaluation of future market conditions and product lifecycles as well as projected revenue, earnings and cash flow.\n See Note 5, \nSupplemental Financial Statement Data\n, for additional disclosures related to the Company’s other long-lived assets.\nRevenue and Accounts Receivable\nThe Company recognizes revenue when it satisfies a performance obligation by transferring control over a product or service to the customer. The transaction price to be recognized as revenue is adjusted for variable consideration, such as sales incentives, and excludes amounts collected on behalf of third parties, including taxes imposed by governmental authorities. The Company’s performance obligations are typically not considered constrained based on the Company’s history with similar transactions and the fact that uncertainties are resolved in a fairly short period of time.\n59\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nSubstantially all of the Company’s revenue is from the sale of tangible products for which the performance obligations are satisfied at a point in time, generally upon delivery. The Company’s services revenue is immaterial and mainly includes professional service arrangements and post-contract customer support, warranty as a service and maintenance contracts.\n \nThe performance obligations for the Company’s services are generally satisfied ratably over the service period based on the nature of the service provided and contract terms.\nThe Company incurs sales commissions and other direct incremental costs to obtain sales contracts. The Company has applied the practical expedient to recognize the direct incremental costs of obtaining contracts as an expense when incurred if the amortization period is expected to be one year or less or the amount is not material, with these costs charged to Selling, general and administrative expenses. The Company had no direct incremental costs to obtain contracts that have an expected benefit of greater than one year.\nThe Company also applies the practical expedients and does not disclose transaction price allocated to the remaining performance obligations for arrangements that have an original expected duration of one year or less, which mainly consist of support and maintenance contracts. The transaction prices allocated to the Company’s remaining performance obligations as of June 27, 2025 and June 28, 2024, were not material.\nThe contract assets and contract liabilities for the years ended June 27, 2025 and June 28, 2024 were not material.\nThe Company’s customer payment terms are typically less than two months from the date control over the product or service is transferred to the customer. The Company uses the practical expedient and does not recognize a significant financing component for payment considerations of less than one year. The financing components of contracts with payment terms were not material.\nThe Company provides distributors and retailers (collectively referred to as “resellers”) with limited price protection for inventories held by resellers at the time of published list price reductions. The Company also provides resellers and original equipment manufacturers (“OEMs”) with other sales incentive programs. The Company records estimated variable consideration related to these items as a reduction to revenue at the time of revenue recognition. The Company uses judgment in its assessment of variable consideration in contracts to be included in the transaction price. The Company uses the expected value method to arrive at the amount of variable consideration. The Company constrains variable consideration until the likelihood of a significant revenue reversal is not probable and believes that the expected value method is the appropriate estimate of the amount of variable consideration based on the fact that the Company has a large number of contracts with similar characteristics.\nFor sales to OEMs, the Company’s methodology for estimating variable consideration is based on the amount of consideration expected to be earned based on the OEMs’ volume of purchases from the Company or other agreed-upon sales incentive programs. For sales to resellers, the Company’s methodology for estimating variable consideration is based on several factors including historical pricing information, current pricing trends and channel inventory levels. Differences between the estimated and actual amounts of variable consideration are recognized as adjustments to revenue.\nMarketing development program costs are typically recorded as a reduction of the transaction price and therefore, of revenue. The Company nets sales rebates against open customer receivable balances if the criteria to offset are met, otherwise they are recorded within other accrued liabilities.\n \nFor contracts with multiple performance obligations, the Company evaluates whether each deliverable is a distinct promise and should be accounted for as a separate performance obligation. If a promised good or service is not distinct in accordance with the revenue guidance, the Company combines that good or service with the other promised goods or services in the arrangement until a distinct bundle of goods is identified. If applicable, the Company allocates the transaction price to the performance obligations of each distinct product or service, or distinct bundle, based on their relative standalone selling prices.\n60\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nThe Company records an allowance for doubtful accounts by analyzing specific customer accounts and assessing the risk of loss based on insolvency or other collection issues. In addition, the Company routinely analyzes the various receivable aging categories to establish reserves based on a combination of past-due receivables and expected future losses. If the financial condition of a significant customer deteriorates resulting in its inability to pay its accounts when due, or if the Company’s overall loss trajectory changes significantly, an adjustment in the Company’s allowance for doubtful accounts would be required, which could materially affect operating results.\nWarranty\nThe Company records an accrual for estimated warranty costs when revenue is recognized. The Company generally warrants its products for a period of \none\n to \nfive years\n, with a small number of products having a warranty ranging up to \nten years\n or more. The warranty provision considers estimated product failure rates and trends, estimated replacement costs, estimated repair costs which include scrap costs and estimated costs for customer compensatory claims related to product quality issues, if any. For warranties ten years or greater, including lifetime warranties, the Company uses the estimated useful life of the product to calculate the warranty exposure. A statistical warranty tracking model is used to help prepare estimates and assist the Company in exercising judgment in determining the underlying estimates. The statistical tracking model captures specific detail on product reliability, such as factory test data, historical field return rates and costs to repair by product type. Management’s judgment is subject to a greater degree of subjectivity with respect to newly introduced products because of limited field experience with those products upon which to base warranty estimates. Management reviews the warranty accrual quarterly for products shipped in prior periods and which are still under warranty. Any changes in the estimates underlying the accrual may result in adjustments that impact current period gross profit and income. Such changes are generally a result of differences between forecasted and actual return rate experience and costs to repair and could differ significantly from the estimates.\nLitigation and Other Contingencies\nWhen the Company becomes aware of a claim or potential claim, the Company assesses the likelihood of any loss or exposure. The Company discloses information regarding each claim where the likelihood of a material loss contingency is probable or reasonably possible. If a loss contingency is probable and the amount of the loss can be reasonably estimated, the Company records an accrual for the loss. In such cases, there may be an exposure to potential loss in excess of the amount accrued. Where a loss is not probable but is reasonably possible or where a loss in excess of the amount accrued is reasonably possible, the Company discloses an estimate of the amount of the loss or range of possible losses for the claim if a reasonable estimate can be made, unless the amount of such reasonably possible losses is not material to the Company’s financial position, results of operations or cash flows. The ability to predict the ultimate outcome of such matters involves judgments, estimates and inherent uncertainties. The actual outcome of such matters could differ materially from management’s estimates.\n See Note 17, \nLegal Proceedings\n, for additional disclosures related to the Company’s litigation.\nAdvertising Expense\nAdvertising costs are expensed as incurred\n and amounted to $\n32\n million, $\n51\n million and $\n66\n million in 2025, 2024 and 2023, respectively. These expenses are included in Selling, general and administrative in the Consolidated Statements of Operations.\nResearch and Development Expense\nResearch and development (“R&D”) expenditures are expensed as incurred.\n61\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nIncome Taxes\nThe Company accounts for income taxes under the asset and liability method, which provides that deferred tax assets and liabilities be recognized for temporary differences between the financial reporting bases and the tax bases of assets and liabilities and expected benefits of utilizing net operating loss (“NOL”) and tax credit carryforwards. The Company records a valuation allowance when it is more likely than not that the deferred tax assets will not be realized. Each quarter, the Company evaluates the need for a valuation allowance for its deferred tax assets and adjusts the valuation allowance so that the Company records net deferred tax assets only to the extent that it has concluded it is more likely than not that these deferred tax assets will be realized. The Company accounts for interest and penalties related to income taxes as a component of the provision for income taxes.\nThe Company recognizes liabilities for uncertain tax positions based on a two-step process. To the extent a tax position does not meet a more-likely-than-not level of certainty, no benefit is recognized in the financial statements. If a position meets the more-likely-than-not level of certainty, it is recognized in the financial statements at the largest amount that has a greater than 50% likelihood of being realized upon ultimate settlement. Interest and penalties related to unrecognized tax benefits are recognized in liabilities recorded for uncertain tax positions and are recorded in the provision for income taxes. The actual liability for unrealized tax benefits in any such contingency may be materially different from the Company’s estimates, which could result in the need to record additional liabilities for unrecognized tax benefits or potentially adjust previously recorded liabilities for unrealized tax benefits, and may materially affect the Company’s operating results.\nNet Income (Loss) Per Common Share\nThe Company computes net income (loss) per common share using a two-class method when shares are issued that meet the definition of participating securities. The two-class method determines net income (loss) per common share for each class of common stock and participating securities according to dividends declared or accumulated and participation rights in undistributed earnings. The two-class method requires undistributed earnings for the period to be allocated between common stock and participating securities based upon their respective rights to receive dividends as if all income for the period had been distributed. The Company’s convertible preferred stock contractually entitles the holders of such shares to participate in dividends but does not contractually require the holders of such shares to participate in the Company’s losses. \nThe Company computes basic income (loss) per common share by dividing net income (loss) attributable to common shareholders by the weighted average number of common shares outstanding during the period. Diluted income (loss) per common share is computed by using diluted net income (loss) attributable to common shareholders, the weighted average number of common shares and potentially dilutive securities outstanding during the period using the treasury stock method or the “if-converted” method based on the nature of the securities. Potentially dilutive common shares include dilutive outstanding employee stock options, restricted stock unit awards (“RSUs”) and restricted stock unit awards with performance conditions or market conditions (“PSUs”), rights to purchase shares of common stock under the Company’s Employee Stock Purchase Plan (“ESPP”), and shares issuable in connection with the Company’s convertible notes and convertible preferred stock.\nStock-Based Compensation\nThe Company accounts for all stock-based compensation at fair value. Stock-based compensation cost is measured at the grant date based on the fair value of the award and is recognized as expense over the vesting period. Compensation expense is adjusted for forfeitures as they occur. The fair values of RSUs and PSUs with performance conditions are determined based on the closing market price of the Company’s stock on the date of the grant. The fair values of all ESPP purchase rights are estimated using the Black-Scholes-Merton option pricing model and require the input of subjective assumptions. The fair values of PSUs with market conditions are estimated using a Monte Carlo simulation model. PSUs are granted to certain employees and vest only after the achievement of pre-determined performance or market conditions and completion of a requisite service period. At the end of each reporting period, the Company evaluates the probability that PSUs with a performance condition will be earned and records the related stock-based compensation expense over the service period. Compensation expense for PSUs with market conditions is recognized ratably over the required service period regardless of expected or actual achievement.\n62\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nOther Comprehensive Income (Loss), Net of Tax \nOther comprehensive income (loss), net of tax refers to gains and losses that are recorded as an element of shareholders’ equity but are excluded from net income. The Company’s other comprehensive income (loss), net of tax is primarily comprised of unrealized gains or losses on foreign exchange contracts designated as cash flow hedges, foreign currency translation, and actuarial gains or losses related to pensions.\nDerivative Contracts\nThe majority of the Company’s transactions are in U.S. dollars; however, some transactions are based in various foreign currencies. The Company purchases foreign exchange contracts to hedge the impact of foreign currency exchange fluctuations on certain underlying assets, liabilities and commitments for Operating expenses and product costs denominated in foreign currencies. The purpose of entering into these hedging transactions is to minimize the impact of foreign currency fluctuations on the Company’s results of operations. All contract maturity dates are 12 months or less. All foreign exchange contracts are for risk management purposes only. The Company does not purchase foreign exchange contracts for speculative or trading purposes. The Company had foreign exchange contracts with commercial banks for the British pound sterling, European euro, Japanese yen, Malaysian ringgit, Philippine peso, Singaporean dollar and Thai baht, which had an aggregate notional amount of $\n1.14\n billion and $\n1.00\n billion at June 27, 2025 and June 28, 2024, respectively.\nIf the derivative is designated as a cash flow hedge and is determined to be highly effective, the change in fair value of the derivative is initially deferred in Other comprehensive income (loss), net of tax. These amounts are subsequently recognized into earnings when the underlying cash flow being hedged is recognized into earnings. Recognized gains and losses on foreign exchange contracts are reported in Cost of revenue and Operating expenses and presented within cash flows from operating activities. Hedge effectiveness is measured by comparing the hedging instrument’s cumulative change in fair value from inception to maturity to the underlying exposure’s terminal value. The Company determined the ineffectiveness associated with its cash flow hedges to be immaterial to the Consolidated Financial Statements for all years presented.\nA change in the fair value of undesignated hedges is recognized in earnings in the period incurred and is reported in Other income (expense), net.\n \nPensions and Other Post-Retirement Benefit Plans\nThe Company has defined benefit pension plans and other post-retirement plans covering certain employees in various countries. The benefits are based on the employees’ years of service and compensation. The plans are funded in conformity with the funding requirements of applicable government authorities. The Company amortizes unrecognized actuarial gains and losses and prior service costs on a straight-line basis over the remaining estimated average service life of the participants. The measurement date for the plans is the Company’s year-end. The Company recognizes the funded status of its defined benefit pension and post-retirement plans in the Consolidated Balance Sheets, with actuarial changes in the funded status recognized through accumulated other comprehensive loss in the year in which such changes occur. \nThe Company reports the service cost component in the same line item or items as other compensation costs arising from services rendered by the pertinent employees during the period. In addition, the other components of net benefit cost are presented in Other income (expense), net in the Consolidated Statements of Operations.\nLeases\nThe Company leases certain domestic and international facilities and data center space under long-term, non-cancelable operating leases that expire at various dates through 2034. These leases include no material variable or contingent lease payments. Operating lease assets and liabilities are recognized based on the present value of the remaining lease payments discounted using the Company’s incremental borrowing rate. Operating lease assets also include prepaid lease payments minus any lease incentives. Extension or termination options present in the Company’s lease agreements are included in determining the right-of-use asset and lease liability when it is reasonably certain the Company will exercise that option. Lease expense is recognized on a straight-line basis over the lease term.\n63\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 2.    \nRecent Accounting Pronouncements\nAccounting Pronouncements Recently Adopted\nIn September 2022, the Financial Accounting Standards Board (“FASB”) issued an accounting standards update (“ASU”) No. 2022-04, “Liabilities-Supplier Finance Programs (Subtopic 405-50): Disclosure of Supplier Finance Program Obligations” (“ASU 2022-04”), which requires annual and interim disclosures for entities that use supplier finance programs in connection with the purchase of goods and services. ASU 2022-04 requires the Company to provide disclosure of outstanding obligations to such suppliers for all balance sheet dates presented beginning with the Company’s first quarter of 2024 and to provide certain rollforward information related to those obligations beginning in the Company’s first fiscal quarter of 2025. The ASU does not affect the recognition, measurement, or financial statement presentation of supplier finance program obligations. The Company adopted the guidance on the first day of fiscal year 2024. See Note 16, \nSupplier Finance Program,\n of the Notes to Consolidated Financial Statements for information regarding the supplier finance program.\nIn November 2023, the FASB issued ASU No. 2023-07, “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures” (“ASU 2023-07”), which expands on segment reporting requirements primarily through enhanced disclosures surrounding significant segment expenses. ASU 2023-07 requires that a public entity disclose, on an annual and interim basis, significant segment expenses that are regularly provided to an entity’s CODM, a description of other segment items by reportable segment, and any additional measures of a segment’s profit or loss used by the CODM when deciding how to allocate resources. These incremental disclosures have been provided in these financial statements, as discussed in Note 4, \nSegment Reporting, Disaggregated Revenue, Geographic Information, and Concentrations of Risk\n.\nRecently Issued Accounting Pronouncements Not Yet Adopted \nIn November 2024, the FASB issued ASU No. 2024-03, “Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses” (“ASU 2024-03”), which is intended to improve disclosures about the expenses of public entities. ASU 2024-03 requires more detailed information about the types of expenses in commonly presented expense captions (such as cost of sales and selling, general and administrative expenses) and requires public entities to disclose, on an annual and interim basis, the amounts of expenses included in each relevant expense caption presented on the face of the income statement, within continuing operations, in a tabular format. Additionally, public entities will be required to disclose a qualitative description of the amounts remaining in relevant expense captions that are not separately disaggregated quantitatively, the total amount of selling expenses, and, in annual reporting periods, the definition of selling expenses. This standard is effective on either a prospective or retrospective basis for fiscal years beginning after December 15, 2026, and interim periods within fiscal years following adoption, with early adoption permitted. The Company is currently compiling the information required for these disclosures and assessing the basis of adoption and expects to adopt the guidance for annual reporting periods in its annual report for the year ending June 30, 2028.\nIn December 2023, the FASB issued ASU No. 2023-09, “Income Taxes (Topic 740): Improvements to Income Tax Disclosures” (“ASU 2023-09”). ASU 2023-09 calls for enhanced income tax disclosure requirements surrounding the tabular rate reconciliation and income taxes paid. These incremental disclosures will be required beginning with the Company’s financial statements for the year ending July 3, 2026, with early adoption permitted. The Company is currently compiling the information required for these disclosures and expects to provide required disclosures in the year ending July 3, 2026.\n64\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 3.    \nDiscontinued Operations\nOn October 30, 2023, the Company announced that its Board of Directors had completed its strategic review of the business and, after evaluating a comprehensive range of alternatives, authorized the Company to pursue a plan to separate its HDD and Flash business units to create \ntwo\n independent public companies. In connection with the Separation (as defined below), the Company has incurred separation and transition costs, which are recorded as Business separation costs within discontinued operations in the Company’s Consolidated Financial Statements, as further detailed in the summary of net income (loss) from discontinued operations, net of taxes, below.\nOn February 21, 2025, the Company completed the previously announced separation of its Flash business (the “Separation”) through a pro rata distribution of \n80.1\n% of the outstanding shares of Sandisk Corporation (“Sandisk”) to Western Digital stockholders. The Separation is intended to be tax-free for U.S. federal income tax purposes. To reflect the completion of the Separation, the Company recorded a decrease in shareholders’ equity for the net book value of applicable assets and liabilities derecognized in connection with the Separation, net of the Company’s retained \n19.9\n% ownership interest, or \n28.8\n million shares, initially based on the net book value of the applicable assets and liabilities derecognized. As a result of the Separation, Sandisk became an independent public company and Western Digital no longer consolidates Sandisk into the Company’s financial results. The historical net income of Sandisk and applicable assets and liabilities included in the Separation are now reported in the Company’s Consolidated Financial Statements as discontinued operations for all periods prior to the Separation on February 21, 2025. Following the Separation, as the Company no longer controls or has the ability to exert significant influence over Sandisk, the Company measures its retained ownership interest in Sandisk common stock at fair value on a recurring basis (see additional information in Note 6,\n Fair Value Measurements and Investments\n). In June 2025, the Company disposed of \n21.3\n million shares of its Sandisk common stock, along with $\n4\n million in cash, in a tax-free exchange for $\n800\n million principal amount of the Company’s Term Loan A-3. The Company expects to monetize its remaining shares of Sandisk within one year from the Separation Date.\nThe Company entered into various agreements to effect the Separation and provide for the temporary framework of the relationship between Western Digital and Sandisk following the Separation, including, among others, a separation and distribution agreement, a tax matters agreement, and a transition services agreement. The transition services agreement provides for transition service support to be provided for various periods of time ranging up to \n15\n months. The amounts involved under these agreements were not material for the fiscal year ended June 27, 2025 and are not expected to be material.\n65\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nThe following table provides a summary of the assets and liabilities classified as discontinued operations:\nAssets and Liabilities of Discontinued Operations\nJune 28,\n2024\n(in millions)\nAssets\nCash and cash equivalents\n$\n328\n \nAccounts receivable, net\n935\n \nInventories\n1,955\n \nOther current assets\n313\n \nCurrent assets of discontinued operations\n$\n3,531\n \nProperty, plant and equipment, net\n$\n808\n \nNotes receivable and investments in Flash Ventures\n991\n \nGoodwill\n5,713\n \nOther non-current assets\n1,101\n \nNon-current assets of discontinued operations\n$\n8,613\n \nLiabilities\nAccounts payable\n$\n357\n \nAccounts payable to related parties\n313\n \nAccrued expenses\n427\n \nIncome taxes payable\n54\n \nAccrued compensation\n173\n \nCurrent liabilities of discontinued operations\n$\n1,324\n \nNon-current liabilities of discontinued operations\n$\n368\n \nThe following table provides a summary of net income (loss) from discontinued operations, net of taxes:\nNet Income (Loss) from Discontinued Operations, Net of Taxes\n2025\n2024\n2023\n(in millions)\nRevenue, net\n$\n4,361\n \n$\n6,686\n \n$\n6,063\n \nCost of revenue\n2,892\n \n5,514\n \n5,567\n \nOperating expenses:\nResearch and development\n718\n \n957\n \n1,023\n \nSelling, general and administrative\n229\n \n102\n \n163\n \nGain on business divestiture\n(\n113\n)\n—\n \n—\n \nBusiness separation costs\n144\n \n97\n \n—\n \nBusiness realignment charges\n3\n \n(\n70\n)\n47\n \nOperating income (loss)\n488\n \n86\n \n(\n737\n)\nTotal interest and other income (expense), net\n(\n36\n)\n(\n8\n)\n36\n \nIncome (loss) before taxes\n452\n \n78\n \n(\n701\n)\nIncome tax expense\n206\n \n111\n \n81\n \nNet income (loss) from discontinued operations, net of taxes\n$\n246\n \n$\n(\n33\n)\n$\n(\n782\n)\n66\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nCash flows related to discontinued operations have not been segregated and are included in the Consolidated Statements of Cash Flows for all periods presented. \nThe following table provides selected financial information related to cash flows from discontinued operations:\nSelect Cash Flow Information from Discontinued Operations\n2025\n2024\n2023\n(in millions)\nDepreciation and amortization\n$\n115\n \n$\n221\n \n$\n439\n \nPurchases of property, plant and equipment\n139\n \n166\n \n219\n \nStock-based compensation\n98\n \n92\n \n106\n \nOn February 21, 2025, prior to the effective time of the Separation, Sandisk entered into a loan agreement (the “Sandisk Loan Agreement”) by and among Sandisk, the lenders party thereto, JPMorgan Chase Bank, N.A., as administrative agent and collateral agent, and others party thereto. The Sandisk Loan Agreement comprises a term loan B facility in the principal amount of $\n2\n billion (the “Sandisk Term Loan Facility”) and a revolving credit facility in the principal amount of $\n1.5\n billion (the “Sandisk Revolving Credit Facility” and together with the Sandisk Term Loan Facility, the “Sandisk Facilities”). The obligations under this facility were retained by Sandisk upon the Separation.\nThe Company previously had business ventures with Kioxia Corporation (“Kioxia”), which consisted of \nthree\n separate legal entities: Flash Partners Ltd., Flash Alliance Ltd., and Flash Forward Ltd. The Company also previously had a business venture with Unisplendour Corporation Limited and Unissoft (Wuxi) Group Co. Ltd., both collectively referred to as the “Unis Venture”. All business ventures with Kioxia and Unis Venture were distributed to Sandisk in connection with the Separation and are included in discontinued operations.\nPrior to the Separation, effective September 28, 2024, the Company sold \n80\n% of its equity interest in an indirect wholly-owned subsidiary in its Flash business, SanDisk Semiconductor (Shanghai) Co. Ltd. (“SDSS”), resulting in a gain on divestiture of $\n113\n million. Net proceeds from the sale received prior to the Separation were $\n401\n million. The rights to the remaining future proceeds from the sale and the \n20\n% retained interest in SDSS were distributed to Sandisk in connection with the Separation.\nDuring the year ended June 28, 2024, the Company completed a sale and leaseback of its facility in Milpitas, California associated with the Flash business. The Company received net proceeds of $\n191\n million in cash and recorded a gain of $\n85\n million on the sale.\n \n67\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 4.    \nSegment Reporting, Disaggregated Revenue, Geographic Information, and Concentrations of Risk \nThe Company’s Chief Executive Officer, Irving Tan, is the Company’s Chief Operating Decision Maker (“CODM”). The CODM manages the business as a provider of data storage devices and solutions based on HDD technology. The CODM evaluates the performance of the Company and makes decisions regarding the allocation of resources based on the Company’s Net income (loss) from continuing operations and Total assets. The Company has therefore, determined that it has \none\n reportable segment: HDD.\nThe following table is a reconciliation of the Company’s measure of segment profit or loss, significant segment expenses and other segment items:\n2025\n2024\n2023\n(in millions)\nRevenue, net\n$\n9,520\n \n$\n6,317\n \n$\n6,255\n \nLess: Significant expenses and other segment items\nCost of revenue\n(1)\n5,771\n \n4,506\n \n4,827\n \nResearch and development\n(1)\n920\n \n885\n \n916\n \nSelling, general and administrative\n(1)\n503\n \n583\n \n656\n \nLitigation matter\n(\n179\n)\n291\n \n—\n \nBusiness realignment charges\n(\n6\n)\n209\n \n146\n \nStock-based compensation\n167\n \n202\n \n212\n \nStrategic review\n—\n \n38\n \n42\n \nInterest expense, net\n312\n \n381\n \n291\n \nLoss on retained interest in Sandisk\n772\n \n—\n \n—\n \nLoss on extinguishment of debt\n100\n \n—\n \n—\n \nOther expense, net\n2\n \n14\n \n20\n \nOther segment items\n(2)\n28\n \n(\n53\n)\n(\n6\n)\nIncome tax expense (benefit)\n(\n513\n)\n26\n \n53\n \nNet income (loss) from continuing operations\n$\n1,643\n \n$\n(\n765\n)\n$\n(\n902\n)\n(1)    \nExcludes amounts related to stock-based compensation and strategic review which are presented separately in the table above.\n(2)    \nOther segment items include strategic investment activity and other small charges.\n \nDisaggregated Revenue\nThe Company’s disaggregated revenue by end market is as follows:\n2025\n2024\n2023\n(in millions)\nRevenue by end market\nCloud\n$\n8,341\n \n$\n5,052\n \n$\n4,753\n \nClient\n556\n \n577\n \n691\n \nConsumer\n623\n \n688\n \n811\n \nTotal revenue\n$\n9,520\n \n$\n6,317\n \n$\n6,255\n \n68\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nThe Company’s operations outside the United States include manufacturing facilities in China, Japan, Malaysia, the Philippines and Thailand, as well as sales offices throughout the Americas, Asia Pacific, Europe, the Middle East and Africa. The following tables summarize the Company’s operations by geographic area:\n2025\n2024\n2023\n(in millions)\nNet revenue\n (1)\nUnited States\n$\n4,328\n \n$\n2,636\n \n$\n2,694\n \nChina\n1,549\n \n488\n \n471\n \nHong Kong\n1,051\n \n1,331\n \n1,139\n \nRest of Asia\n792\n \n573\n \n546\n \nEurope, Middle East and Africa\n1,536\n \n1,067\n \n1,175\n \nOther\n264\n \n222\n \n230\n \nTotal \n$\n9,520\n \n$\n6,317\n \n$\n6,255\n \n(1)    \nNet revenue is attributed to geographic regions based on the ship-to location of the customer.\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nLong-lived assets\n (1)\nUnited States\n$\n807\n \n$\n810\n \nMalaysia\n378\n \n330\n \nChina\n87\n \n89\n \nThailand\n791\n \n825\n \nRest of Asia\n279\n \n304\n \nEurope, Middle East and Africa\n1\n \n1\n \nTotal\n$\n2,343\n \n$\n2,359\n \n(1)\n    Long-lived assets include property, plant and equipment and are attributed to the geographic location in which they are located.\nCustomer Concentration and Credit Risk\nThe Company sells its products to cloud service providers, OEMs, resellers, distributors and retailers throughout the world. For 2025, three customers accounted for \n17\n%, \n12\n% and \n10\n%, respectively, of the Company’s net revenue. For 2024 and 2023, no single customer accounted for 10% or more of the Company’s net revenue. For 2025, 2024 and 2023, the Company’s top 10 customers accounted for \n68\n%, \n55\n% and \n56\n%, respectively, of the Company’s net revenue.\nThe Company performs ongoing credit evaluations of its customers’ financial condition to manage collection risk, in some cases supplemented by collateral. The Company maintains allowances for potential credit losses, and such losses have historically been within management’s expectations. At any given point in time, the total amount outstanding from any one of a number of its customers may be individually significant to the Company’s financial condition. As of June 27, 2025 and June 28, 2024, net accounts receivable were $\n1.49\n billion and $\n1.23\n billion, respectively, and reserves for potential credit losses were not material. As of June 27, 2025, three customers accounted for \n20\n%, \n19\n%, and \n12\n%, respectively, of the Company’s net accounts receivable and as of June 28, 2024, one customer accounted for \n23\n% of the Company’s net accounts receivable.\n69\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nThe Company also has cash equivalent and investment policies that limit the amount of credit exposure to any one financial institution or investment instrument and require that investments be made only with financial institutions or in investment instruments evaluated as highly credit-worthy.\nSupplier Concentration\nSome key components are purchased from single source vendors for which alternative sources are currently not available. Shortages could occur in these essential materials due to an interruption of supply or increased demand in the industry. If the Company was unable to procure certain of such materials, the Company’s sales could decline, which could have a material adverse effect on its results of operations. The Company also relies on third-party subcontractors to assemble and test a portion of its products. The Company does not have long-term contracts with some of these subcontractors and cannot directly control product delivery schedules or manufacturing processes. This could lead to product shortages or quality assurance problems that could increase the manufacturing costs of the Company’s products and have material adverse effects on the Company’s operating results.\n70\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 5.    \nSupplemental Financial Statement Data\nAccounts receivable, net\nFrom time to time, in connection with factoring agreements, the Company sells trade accounts receivable without recourse to third-party purchasers in exchange for cash. In 2025, the Company sold \nno\n trade accounts receivable. In 2024 and 2023, the Company sold trade accounts receivable aggregating to $\n284\n million and $\n406\n million, respectively. The discounts on the trade accounts receivable sold during the periods were not material and were recorded within Other income (expense), net in the Consolidated Statements of Operations. As of June 27, 2025 and June 28, 2024, \nno\n factored receivables were outstanding.\nInventories\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nInventories:\nRaw materials and component parts\n$\n227\n \n$\n329\n \nWork-in-process\n785\n \n829\n \nFinished goods\n279\n \n229\n \nTotal inventories\n$\n1,291\n \n$\n1,387\n \nProperty, plant and equipment, net\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nProperty, plant and equipment:\nLand and improvements\n$\n225\n \n$\n225\n \nBuildings and improvements\n1,550\n \n1,419\n \nMachinery and equipment\n6,488\n \n6,301\n \nComputer equipment and software\n257\n \n313\n \nFurniture and fixtures\n33\n \n32\n \nConstruction-in-process\n532\n \n685\n \nProperty, plant and equipment, gross\n9,085\n \n8,975\n \nAccumulated depreciation\n(\n6,742\n)\n(\n6,616\n)\nProperty, plant and equipment, net\n$\n2,343\n \n$\n2,359\n \nDepreciation expense for property, plant and equipment totaled $\n334\n million, $\n347\n million and $\n389\n million\n \nin 2025, 2024 and 2023, respectively.\nOther intangible assets, net\nThe Company has acquired IPR&D for projects in progress that had not yet reached technological feasibility at the time of acquisition. IPR&D is initially accounted for as an indefinite-lived intangible asset at the time of acquisition. Once a project reaches technological feasibility, the Company reclassifies the balance to existing technology and begins to amortize the intangible asset over its estimated useful life. As of both June 27, 2025 and June 28, 2024, Other non-current assets included $\n72\n million of IPR&D. During 2025, 2024 and 2023, the Company did \nno\nt record any impairment charges related to IPR&D.\n71\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNon-current assets\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nNon-current assets:\nDeferred tax assets\n$\n1,007\n \n$\n225\n \nOther non-current assets\n477\n \n612\n \nTotal non-current assets\n$\n1,484\n \n$\n837\n \nProduct warranty liability\nChanges in the warranty accrual were as follows:\n2025\n2024\n2023\n(in millions)\nWarranty accrual, beginning of period\n$\n142\n \n$\n202\n \n$\n293\n \nCharges to operations\n99\n \n79\n \n76\n \nUtilization\n(\n83\n)\n(\n119\n)\n(\n143\n)\nChanges in estimate related to pre-existing warranties\n(\n6\n)\n(\n20\n)\n(\n24\n)\nWarranty accrual, end of period\n$\n152\n \n$\n142\n \n$\n202\n \nThe current portion of the warranty accrual is classified in Accrued expenses and the long-term portion is classified in Other liabilities\n \nas noted below:\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nWarranty accrual:\nCurrent portion (included in Accrued expenses)\n$\n57\n \n$\n9\n \nLong-term portion (included in Other liabilities)\n95\n \n133\n \nTotal warranty accrual\n$\n152\n \n$\n142\n \nOther liabilities\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nOther liabilities:\nNon-current net tax payable\n$\n—\n \n$\n200\n \nNon-current portion of unrecognized tax benefits\n163\n \n443\n \nOther non-current liabilities\n396\n \n359\n \nTotal other liabilities\n$\n559\n \n$\n1,002\n \nGoodwill\nManagement performed its annual goodwill impairment assessment as of the first day of its fourth quarter ended June 27, 2025 and concluded there were no impairment indicators as of June 27, 2025. The Company also did not incur any impairment charges for 2025, 2024 or 2023. The carrying amount of goodwill was $\n4.32\n billion as of both June 27, 2025 and June 28, 2024.\n72\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nAccumulated other comprehensive income (loss) \nAccumulated other comprehensive income (loss), net of tax, refers to expenses, gains and losses that are recorded as an element of shareholders’ equity but are excluded from net income. \nThe following table illustrates the changes in the balances of each component of Accumulated other comprehensive income (loss):\nActuarial Pension Gains (Losses)\nForeign Currency Translation Adjustment\nUnrealized Gains (Losses) on Derivative Contracts\nTotal Accumulated Comprehensive Income (Loss)\n(in millions)\nBalance at June 30, 2023\n$\n(\n2\n)\n$\n(\n389\n)\n$\n(\n157\n)\n$\n(\n548\n)\nOther comprehensive income (loss) before reclassifications\n23\n \n(\n115\n)\n(\n331\n)\n(\n423\n)\nAmounts reclassified from accumulated other comprehensive income (loss)\n—\n \n—\n \n244\n \n244\n \nIncome tax benefit (expense) related to items of other comprehensive income (loss)\n(\n7\n)\n(\n1\n)\n23\n \n15\n \nNet current-period other comprehensive income (loss)\n16\n \n(\n116\n)\n(\n64\n)\n(\n164\n)\nBalance at June 28, 2024\n14\n \n(\n505\n)\n(\n221\n)\n(\n712\n)\nOther comprehensive income before reclassifications\n3\n \n45\n \n31\n \n79\n \nAmounts reclassified from accumulated other comprehensive income (loss)\n—\n \n—\n \n149\n \n149\n \nIncome tax expense related to items of other comprehensive income\n(\n1\n)\n—\n \n(\n41\n)\n(\n42\n)\nNet current-period other comprehensive income\n2\n \n45\n \n139\n \n186\n \nDistribution in connection with the Separation\n—\n \n458\n \n88\n \n546\n \nBalance at June 27, 2025\n$\n16\n \n$\n(\n2\n)\n$\n6\n \n$\n20\n \nDuring 2025 and 2024, the amounts reclassified out of Accumulated other comprehensive income (loss) included losses of $\n149\n million and $\n244\n million, respectively, related to foreign exchange contracts.\nAs of June 27, 2025, all existing net losses related to cash flow hedges recorded in Accumulated other comprehensive income (loss) are expected to be reclassified to earnings within the next twelve months.\n \n73\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 6.    \nFair Value Measurements and Investments\nFinancial Instruments Carried at Fair Value\nFinancial assets and liabilities that are remeasured and reported at fair value at each reporting period are classified and disclosed in one of the following three levels:\nLevel 1.    \nQuoted prices in active markets for identical assets or liabilities.\nLevel 2.    \nInputs other than Level 1 that are observable, either directly or indirectly, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3.    \nInputs that are unobservable for the asset or liability and that are significant to the fair value of the assets or liabilities.\nThe following tables present information about the Company’s financial assets and liabilities that are measured at fair value on a recurring basis as of June 27, 2025 and June 28, 2024, and indicate the fair value hierarchy of the valuation techniques utilized to determine such values:\nJune 27, 2025\n \nLevel 1\nLevel 2\nLevel 3\nTotal\n(in millions)\nAssets:\nRetained interest in Sandisk\n$\n354\n \n$\n—\n \n$\n—\n \n$\n354\n \nCash equivalents – Money market funds\n285\n \n—\n \n—\n \n285\n \nForeign exchange contracts\n—\n \n10\n \n—\n \n10\n \nTotal assets at fair value\n$\n639\n \n$\n10\n \n$\n—\n \n$\n649\n \nLiabilities:\nForeign exchange contracts\n$\n—\n \n$\n4\n \n$\n—\n \n$\n4\n \nTotal liabilities at fair value\n$\n—\n \n$\n4\n \n$\n—\n \n$\n4\n \nJune 28, 2024\n \nLevel 1\nLevel 2\nLevel 3\nTotal\n(in millions)\nAssets:\nCash equivalents – Money market funds\n$\n388\n \n$\n—\n \n$\n—\n \n$\n388\n \nForeign exchange contracts\n—\n \n1\n \n—\n \n1\n \nTotal assets at fair value\n$\n388\n \n$\n1\n \n$\n—\n \n$\n389\n \nLiabilities:\nForeign exchange contracts\n$\n—\n \n$\n18\n \n$\n—\n \n$\n18\n \nTotal liabilities at fair value\n$\n—\n \n$\n18\n \n$\n—\n \n$\n18\n \n74\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nRetained Interest in Sandisk. \nThe Company retained \n28.8\n million shares of Sandisk at the Separation. These shares are valued based on quoted market prices. As discussed in Note 8, \nDebt\n, the Company exchanged \n21.3\n million shares of Sandisk to settle a portion of the Company’s Term Loan A-3. As of June 27, 2025, the Company still held \n7.5\n million shares of Sandisk.\nMoney Market Funds.\n The Company’s money market funds are funds that invest in U.S. Treasury and U.S. Government agency securities. Money market funds are valued based on quoted market prices.\nForeign Exchange Contracts.\n The Company’s foreign exchange contracts are short-term contracts to hedge the Company’s foreign currency risk. Foreign exchange contracts are valued using an income approach that is based on a present value of future cash flows model. The market-based observable inputs for the model include forward rates and credit default swap rates. For more information on the Company’s foreign exchange contracts, see Note 7, \nDerivative Instruments and Hedging Activities\n. Derivative assets and liabilities are reflected in the Company’s Consolidated Balance Sheets under Other current assets and Accrued expenses, respectively.\nDuring 2025 and 2024, the Company had no transfers of financial assets and liabilities between levels and there were no changes in valuation techniques and the inputs used in the fair value measurement. \nFinancial Instruments Not Carried at Fair Value \nThe following table contains the related carrying value (which includes principal adjusted for any unamortized issuance costs, and discounts or premiums) and fair value (which is based on quoted market prices) for each of the Company’s outstanding financial instruments. Each of the financial instruments presented below was categorized as Level 2 for all periods presented, based on the frequency of trading immediately prior to the end of the fourth quarter of 2025 and the fourth quarter of 2024, respectively. \nJune 27, 2025\nJune 28, 2024\nCarrying\nValue\nFair\nValue\nCarrying\nValue\nFair\nValue\n(in millions)\n4.75\n% senior unsecured notes due 2026\n$\n500\n \n$\n499\n \n$\n2,296\n \n$\n2,253\n \nVariable interest rate Term Loan A-2 maturing 2027\n—\n \n—\n \n2,578\n \n2,539\n \nVariable interest rate Term Loan A-3 maturing 2027\n1,642\n \n1,655\n \n—\n \n—\n \n3.00\n% convertible notes due 2028\n1,575\n \n2,849\n \n1,568\n \n2,556\n \n2.85\n% senior notes due 2029\n498\n \n463\n \n496\n \n434\n \n3.10\n% senior notes due 2032\n496\n \n442\n \n496\n \n407\n \nTotal\n$\n4,711\n \n$\n5,908\n \n$\n7,434\n \n$\n8,189\n \n75\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 7.    \nDerivative Instruments and Hedging Activities\nAs of June 27, 2025, the Company had outstanding foreign exchange forward contracts that were designated as either cash flow hedges or non-designated hedges. All of the contract maturity dates of these foreign exchange forward contracts are \n12\n months or less. As of June 27, 2025, the Company did not have any derivative contracts with credit risk related contingent features. \nChanges in fair values of the non-designated foreign exchange contracts are recognized in Other income (expense), net and are largely offset by corresponding changes in the fair values of the foreign-currency denominated monetary assets and liabilities. For each of 2025, 2024 and 2023, total net realized and unrealized transaction and foreign exchange contract currency gains and losses were not material to the Company’s Consolidated Financial Statements.\nUnrealized gains or losses on designated cash flow hedges are recognized in Accumulated other comprehensive income (loss). For more information regarding cash flow hedges, see Note 5, \nSupplemental Financial Statement Data – Accumulated other comprehensive income (loss).\nNetting Arrangements\nUnder certain provisions and conditions within agreements with counterparties to the Company’s foreign exchange forward contracts, subject to applicable requirements, the Company has the right of offset associated with the Company’s foreign exchange forward contracts and is allowed to net settle transactions of the same currency with a single net amount payable by one party to the other. As of June 27, 2025 and June 28, 2024, the effect of rights of offset was not material and the Company did not offset or net the fair value amounts of derivative instruments in its Consolidated Balance Sheets.\n76\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 8.    \nDebt\nDebt consisted of the following:\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\n4.75\n% senior unsecured notes due 2026\n$\n500\n \n$\n2,300\n \nVariable interest rate Term Loan A-2 maturing 2027\n—\n \n2,588\n \nVariable interest rate Term Loan A-3 maturing 2027\n1,649\n \n—\n \n3.00\n% convertible notes due 2028\n1,600\n \n1,600\n \n2.85\n% senior notes due 2029\n500\n \n500\n \n3.10\n% senior notes due 2032\n500\n \n500\n \nTotal debt\n4,749\n \n7,488\n \nIssuance costs\n(\n38\n)\n(\n54\n)\nSubtotal\n4,711\n \n7,434\n \nLess: current portion of long-term debt\n(\n2,226\n)\n(\n1,750\n)\nLong-term debt\n$\n2,485\n \n$\n5,684\n \nRevolving Credit Facility and Term Loans\nOn February 20, 2025, the Company entered into a fourth amendment to the loan agreement governing the Company’s revolving credit facility maturing in January 2027 (the “2027 Revolving Credit Facility”) and Term Loan Facility (as defined below), dated as of January 7, 2022 (as amended, the “Loan Agreement”) that, among other changes, (a) permitted the Separation, (b) provided for the automatic release, in connection with the Separation, of guarantees and liens on collateral provided by Sandisk and Sandisk Technologies, Inc. under the Loan Agreement, (c) provided for the issuance of a new $\n2.51\n billion Term Loan A-3 maturing in January 2027 (the “Term Loan A-3”) in a noncash exchange to replace the Company’s previously existing Term Loan A-2 (the “Term Loan A-2” and, together with the Term Loan A-3, the “Term Loan Facility”), (d) facilitated the exchange of Sandisk shares retained at the Separation to settle a portion of the Term Loan A-3 in connection with the Sandisk retained interest, and (e) in connection with the Separation, reduced the aggregate commitments under the 2027 Revolving Credit Facility from $\n2.25\n billion to $\n1.25\n billion. In June 2025, the Company settled $\n800\n million of the Term Loan A-3 principal amount, through a non-cash exchange of \n21.3\n million shares of Sandisk common stock held by the Company, and a $\n4\n million cash payment, resulting in a loss on extinguishment of debt of $\n100\n million.\nDuring the year ended June 27, 2025, the Company also made principal repayments aggregating to $\n138\n million on its Term Loan Facility. As of June 27, 2025, the remaining balance of Term Loan A-3 amortizes in quarterly installments of $\n31\n million per quarter beginning with the quarter ending October 3, 2025, and the remaining balance is payable at maturity on January 7, 2027. Issuance costs for the Term Loan Facility are amortized to Interest expense over its term and unamortized costs were $\n7\n million as of June 27, 2025.\nThe Term Loan A-3 Loan bears interest, at the Company’s option, at a per annum rate equal to either (x) the Adjusted Term SOFR (as defined in the Loan Agreement) plus an applicable margin varying from \n1.125\n% to \n2.000\n% or (y) a base rate plus an applicable margin varying from \n0.125\n% to \n1.000\n%, in each case depending on the corporate family ratings of the Company from at least two of the Credit Rating Agencies (as defined in the Loan Agreement), with an initial interest rate of Adjusted Term SOFR plus \n1.500\n%. The all-in interest rate for Term Loan A-3 as of June 27, 2025 was \n5.918\n%. \n77\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nDuring the year ended June 27, 2025, the Company drew and repaid $\n150\n million principal amount under its $\n1.25\n billion 2027 Revolving Facility. Loans under the 2027 Revolving Facility bear interest at a per annum rate, at the Company’s option, equal to either (x) the Adjusted Term SOFR Rate (as defined in the Loan Agreement) plus an applicable margin varying from \n1.125\n% to \n2.000\n% or (y) a base rate plus an applicable margin varying from \n0.125\n% to \n1.000\n%, in each case depending on the corporate family ratings of the Company from at least two of the Credit Rating Agencies, with an interest rate of Adjusted Term SOFR plus \n1.375\n%. The Company is also required to pay an unused commitment fee on the 2027 Revolving Facility ranging from \n0.120\n% to \n0.350\n% based on the corporate family ratings of the Company from at least two of the Credit Rating Agencies, with an initial unused commitment fee of \n0.200\n%.\nAs of June 27, 2025, the Company had an insignificant amount of issued standby letters of credit.\nThe Loan Agreement governing the 2027 Revolving Credit Facility and the term loan facility requires the Company to maintain a ratio (“Leverage Ratio”) of total funded debt to Consolidated Adjusted EBITDA (as defined in the Loan Agreement) below a maximum, at the end of each quarter, which was \n3.75\n times through June 27, 2025 and will be \n3.25\n times thereafter. As of June 27, 2025, the Company was in compliance with all financial covenants under the Loan Agreement.\nThe Loan Agreement also requires the Company to comply with customary covenants that include, among others, limitations on the incurrence of additional debt, liens on property, acquisitions and investments, loans and guarantees, mergers, consolidations, liquidations and dissolution, asset sales, dividends and distribution, and other payments in respect of the Company’s capital stock, prepayments of certain debt, transactions with affiliates and certain modifications of organizational documents and certain debt agreements.\nSenior Notes\nIn February 2018, the Company issued $\n2.30\n billion aggregate principal amount of senior unsecured notes due February 15, 2026 (the “2026 Senior Unsecured Notes”). The 2026 Senior Unsecured Notes bear interest at an annual rate of \n4.750\n% with interest payable on February 15 and August 15 of each year. The Company is not required to make principal payments on the 2026 Senior Unsecured Notes prior to the maturity date. In April 2025 however, the Company redeemed, at its election, $\n1.80\n billion aggregate principal amount of its 2026 Unsecured Notes at par plus accrued interest.\nOn November 3, 2023, the Company issued $\n1.60\n billion aggregate principal amount of convertible senior notes which bear interest at an annual rate of \n3.00\n% and mature on November 15, 2028, unless earlier repurchased, redeemed or converted (the “2028 Convertible Notes”). The Company is not required to make principal payments on the 2028 Convertible Notes prior to the maturity date. The 2028 Convertible Notes are guaranteed by Western Digital Technologies, Inc., the Company’s wholly-owned subsidiary that also guarantees the 2026 Senior Unsecured Notes.\nThe 2028 Convertible Notes are convertible at the option of any holder beginning on August 15, 2028, at a conversion price of approximately $\n37.82\n per share of common stock (which conversion price has been adjusted from its original conversion price of approximately $\n52.20\n in accordance with the Indenture, as a result of the Separation and dividends paid on the Company’s common stock). Prior to August 15, 2028, if the trading price of the Company’s common stock remains above \n130\n% of the conversion price for at least \n20\n trading days (whether or not consecutive) during the \n30\n consecutive trading-day period prior to the end of a calendar quarter, holders of the 2028 Convertible Notes would have the right to convert the 2028 Convertible Notes during the next succeeding calendar quarter. The 2028 Convertible Notes are also convertible prior to August 15, 2028 upon the occurrence of certain corporate events. Upon any conversion of the 2028 Convertible Notes, the Company will pay cash for the aggregate principal amount of the notes to be converted and pay or deliver, as the case may be, cash, shares of the Company’s common stock or a combination thereof, at the Company’s election, in respect of the remainder, if any, of its conversion obligation in excess of the aggregate principal amount of the notes being converted. On or after November 15, 2026, the Company may redeem for cash, at par plus accrued interest, all or any portion of the 2028 Convertible Notes, at its option, if the last reported sale price of the Company’s common stock has been at least \n130\n% of the conversion price then in effect for at least \n10\n trading days during any \n20\n consecutive trading day period immediately preceding the date of the Company’s redemption notice.\n78\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nDuring the calendar quarter ended June 30, 2025, the sale price conditional conversion feature of the 2028 Convertible Notes was triggered. As a result, the holders of the 2028 Convertible Notes have the right to convert the 2028 Convertible Notes during the next succeeding calendar quarter, through September 30, 2025, at which point the common stock price will be re-evaluated to determine whether the 2028 Convertible Notes will continue to be convertible in the subsequent calendar quarter. The Company has classified the 2028 Convertible Notes as current liabilities in the Company’s Consolidated Financial Statements as of June 27, 2025.\n Net proceeds from the 2028 Convertible Notes were approximately $\n1.56\n billion after deducting issuance costs of approximately $\n37\n million. Debt issuance costs are amortized to interest expense over the term of the 2028 Convertible Notes. As of June 27, 2025, issuance costs of $\n25\n million remained unamortized.\nIn connection with the issuance of the 2028 Convertible Notes, the Company also entered into privately negotiated capped call transactions with certain counterparties (the “Capped Calls”). The Capped Calls each have a strike price of approximately $\n37.82\n per share, which has been adjusted from its original strike price of approximately $\n52.20\n, in accordance with the terms of the agreements, and corresponds to the current conversion price of the 2028 Convertible Notes. The Capped Calls are subject to the same adjustments applicable to the conversion price of the convertible notes, which the Company expects will result in adjusted cap prices of approximately $\n50.53\n per share, subject to certain adjustments. The Capped Calls are generally intended to reduce or offset the potential dilution to the Company’s common stock upon any conversion of the 2028 Convertible Notes with such reduction or offset, as the case may be, subject to a cap based on the cap price. If the market price per share of the Company’s common stock, as measured under the terms of the Capped Calls, exceeds the cap prices of the Capped Calls, there would not be an offset for the excess. The Capped Calls are separate transactions and not part of the terms of the 2028 Convertible Notes. As these transactions met certain accounting criteria, the Capped Calls were recorded in shareholders’ equity and are not accounted for as derivatives. The cost of the Capped Calls of $\n155\n million, net of $\n37\n million in deferred tax assets, was recorded as a decrease to Additional paid-in capital on the Company’s Consolidated Balance Sheets.\nIn December 2021, the Company issued $\n500\n million aggregate principal amount of \n2.850\n% senior notes due February 1, 2029 (the “2029 Senior Notes”) and issued $\n500\n million aggregate principal amount of \n3.100\n% senior notes due February 1, 2032 (the “2032 Senior Notes”), pursuant to the terms of an indenture, dated as of December 10, 2021 (the “Base Indenture”) between the Company and U.S. Bank National Association, as trustee (the “Senior Notes Trustee”), as supplemented by the first supplemental indenture dated as of December 10, 2021 (the “Senior Notes First Supplemental Indenture”) between the Company and the Senior Notes Trustee. As used herein, “Indenture” means the Base Indenture, as supplemented by the Senior Notes First Supplemental Indenture. Interest for both the 2029 Senior Notes and 2032 Senior Notes is payable on February 1 and August 1 of each year. The Company is not required to make principal payments on either the 2029 Senior Notes or 2032 Senior Notes prior to their maturity dates.\nIn February 2018, the Company issued $\n1.10\n billion aggregate principal amount of convertible senior notes due February 1, 2024 (the “2024 Convertible Notes”). The 2024 Convertible Notes bore interest at an annual rate of \n1.50\n% with interest payable on February 1 and August 1 of each year. Contemporaneously with the issuance of the 2028 Convertible Notes as noted above, the Company entered into individually negotiated transactions with certain holders of the Company’s 2024 Convertible Notes to repurchase approximately $\n508\n million aggregate principal amount of such notes at an immaterial discount. On February 1, 2024, the Company settled all remaining 2024 Convertible Notes in accordance with their original terms for an aggregate cash principal payment of $\n592\n million plus interest.\nCollateral and Restrictive Covenants\nUnder the terms of the Loan Agreement, the 2027 Revolving Facility and Term Loan Facility (together, the “Credit Facilities”) are unconditionally guaranteed by Western Digital Technologies, Inc. (the “Guarantor”) and are secured on a first-priority basis (subject to permitted liens) by a lien on substantially all assets and properties of the Company and the Guarantor (the “Collateral”), subject to certain exceptions. Furthermore, under the terms of the applicable indentures, the obligations under the Company’s \n2.850\n% Senior Notes due 2029 and \n3.100\n% Senior Notes due 2032 have been secured by the Collateral on an equal and ratable basis to the obligations under the Credit Facilities, and the obligations under the Company’s 2026 Senior Unsecured Notes have been guaranteed by the Guarantor pursuant to the First Supplemental Indenture dated as of June 20, 2023 and the Second Supplemental Indenture dated as of April 26, 2024 (the “2026 Senior Notes Supplemental Indentures”).\n79\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nThe indentures and supplemental indentures, as applicable, governing the Company’s 2029 Senior Notes, 2032 Senior Notes, 2026 Senior Unsecured Notes and the 2028 Convertible Notes each contain various restrictive covenants, which can include limitations on the Company’s and its subsidiaries’ ability to, among other things, consolidate, merge or sell all or substantially all of their assets; create liens; and incur, assume or guarantee additional indebtedness, and are subject to a number of limitations and exceptions.\nMaturity of Debt \nAs of June 27, 2025, the Company is subject to required principal payment or earlier conversion, at the option of the holder, as follows:\n Contractual Maturity\n (1)\n(in millions)\nFiscal year:\n2026 \n$\n2,226\n \n2027\n1,523\n \n2028\n—\n \n2029\n500\n \n2030\n—\n \n2031 and thereafter\n500\n \nTotal debt maturities\n4,749\n \nIssuance costs\n(\n38\n)\nNet carrying value\n$\n4,711\n \n(1)\n    As of June 30, 2025, the holders of the 2028 Convertible Notes will have the option to convert the notes from July 1, 2025 through September 30, 2025. As such, the principal portion of these notes is reflected as current in the table above.\n80\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 9.    \nPension and Other Post-Retirement Benefit Plans\nThe Company has pension and other post-retirement benefit plans in various countries. The Company’s principal pension plans are in Japan, Thailand, and the Philippines (the “Pension Plans”). All other pension and other post-retirement benefit plans are immaterial to the Consolidated Financial Statements. The expected long-term rate of return on the Pension Plans’ assets is \n2.5\n%.\nObligations and Funded Status\nThe following table presents the changes in unfunded status of the benefit obligations for the Pension Plans:\n2025\n2024\n2023\n(in millions)\nChange in benefit obligation:\nProjected benefit obligation at beginning of period\n$\n244\n \n$\n273\n \n$\n294\n \nService cost\n9\n \n9\n \n14\n \nInterest cost\n7\n \n6\n \n6\n \nPlan amendments\n—\n \n—\n \n—\n \nActuarial gain\n(\n6\n)\n(\n17\n)\n(\n6\n)\nBenefits paid\n(\n8\n)\n(\n7\n)\n(\n8\n)\nSettlement/curtailment\n—\n \n2\n \n(\n15\n)\nOther\n—\n \n—\n \n—\n \nNon-U.S. currency movement\n26\n \n(\n22\n)\n(\n12\n)\nProjected benefit obligation at end of period\n272\n \n244\n \n273\n \nChange in plan assets:\nFair value of plan assets at beginning of period\n184\n \n185\n \n189\n \nActual return on plan assets\n3\n \n12\n \n7\n \nEmployer contributions\n6\n \n13\n \n9\n \nBenefits paid\n(\n8\n)\n(\n7\n)\n(\n8\n)\nNon-U.S. currency movement\n19\n \n(\n19\n)\n(\n12\n)\nFair value of plan assets at end of period\n204\n \n184\n \n185\n \nUnfunded status\n$\n68\n \n$\n60\n \n$\n88\n \nThe following table presents the unfunded amounts related to the Pension Plans as recognized on the Company’s Consolidated Balance Sheets:\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nCurrent liabilities\n$\n1\n \n$\n1\n \nNon-current liabilities\n67\n \n59\n \nNet amount recognized\n$\n68\n \n$\n60\n \nThe accumulated benefit obligation for the Pension Plans was $\n272\n million at June 27, 2025. As of June 27, 2025, the accumulated other income pension balance was $\n27\n million. There were \nno\n material prior service credits for the Pension Plans recognized in Accumulated other comprehensive income (loss) in the Consolidated Balance Sheet as of June 27, 2025.\nNet periodic benefit costs were not material for 2025, 2024 and 2023.\n81\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nAssumptions\nWeighted-Average Assumptions\nThe weighted-average actuarial assumptions used to determine the projected benefit obligations for the Pension Plans were as follows:\n2025\n2024\n2023\nDiscount rate\n2.9\n \n%\n3.0\n \n%\n2.2\n \n%\nRate of compensation increase\n2.7\n \n%\n2.7\n \n%\n2.4\n \n%\nThe weighted-average actuarial assumptions used to determine benefit costs for the Pension Plans were as follows:\n2025\n2024\n2023\nDiscount rate\n3.0\n \n%\n2.2\n \n%\n2.3\n \n%\nExpected long-term rate of return on plan assets\n2.5\n \n%\n2.5\n \n%\n2.5\n \n%\nRate of compensation increase\n2.7\n \n%\n2.4\n \n%\n2.3\n \n%\nThe Company develops a discount rate by calculating when the estimated benefit payments will be due. Management then matches the benefit payments to high quality bonds which match the timing of the expected benefit payments to determine the appropriate discount rate. \nThe Company develops the expected long-term rate of return on plan assets by analyzing rates of return in each plan as well as the investment portfolio applicable to the plan depending on each plan’s economic environment. The Company’s estimates of future rates of return on assets is based in large part on the projected rate of return from the respective investment managers using a long-term view of historical returns, as well as actuarial recommendations using the most current generational and mortality tables and rates. As of June 27, 2025, the Pension Plans’ assets materially consisted of plan assets related to the Japan pension plan and, as such, the assumption used herein is primarily related to the Japan pension plan.\nThe Company develops the rate of compensation increase assumptions using local compensation practices and historical rates of increases.\nPlan Assets\nInvestment Policies and Strategies\nThe investment policy in the Pension Plans is to generate a stable return on investments over a long-term horizon in order to have adequate pension funds to meet the Company’s future obligations. In order to achieve this investment goal, a diversified portfolio with target asset allocation and expected rate of return is established by considering factors such as composition of participants, level of funded status, capacity to absorb risks and the current economic environment. The target asset allocation is \n55\n% in debt securities, \n30\n% in equity securities, and the remaining \n15\n% in other assets. Risk management is accomplished through diversification, periodic review of plan asset performance and appropriate realignment of asset allocation. Assumptions regarding the expected long-term rate of return on plan assets are periodically reviewed and are based on the historical trend of returns, the risk and correlation of each asset and the latest economic environment.\nThe expected long-term rate of return is estimated based on many factors, including expected forecast for inflation, risk premiums for each asset class, expected asset allocation, current and future financial market conditions and diversification and rebalancing strategies. Historical return patterns and correlations, consensus return forecasts and other relevant financial factors are analyzed periodically by the investment advisor so as to ensure that the expected long-term rate of return is reasonable and appropriate.\n82\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nFair Value Measurements\nThe following tables present the Pension Plans’ major asset categories and their associated fair values and net asset values as of June 27, 2025 and June 28, 2024:\nJune 27, 2025\nLevel 1\nLevel 2\nLevel 3\nTotal\n(in millions)\nPlan assets measured at fair value:\nEquity:\nEquity commingled/mutual funds\n(1)(2)\n$\n—\n \n$\n66\n \n$\n—\n \n$\n66\n \nFixed income:\nFixed income commingled/mutual funds\n(1)(3)\n—\n \n110\n \n—\n \n110\n \nNet plan assets subject to leveling\n—\n \n176\n \n—\n \n176\n \nReal estate investment trust at net asset value\n— \n— \n— \n28\n \nTotal investments at fair value\n$\n—\n \n$\n176\n \n$\n—\n \n$\n204\n \nJune 28, 2024\nLevel 1\nLevel 2\nLevel 3\nTotal\n(in millions)\nPlan assets measured at fair value:\nEquity:\nEquity commingled/mutual funds\n(1)(2)\n$\n—\n \n$\n58\n \n$\n—\n \n$\n58\n \nFixed income:\nFixed income commingled/mutual funds\n(1)(3)\n—\n \n99\n \n—\n \n99\n \nNet plan assets subject to leveling\n—\n \n157\n \n—\n \n157\n \nReal estate investment trust at net asset value\n— \n— \n— \n27\n \nTotal investments at fair value\n$\n—\n \n$\n157\n \n$\n—\n \n$\n184\n \n(1)\n    Commingled funds represent pooled institutional investments.\n(2)\n    Equity mutual funds invest primarily in equity securities.\n(3)\n    Fixed income mutual funds invest primarily in fixed income securities.\nThere were no significant movements of assets between any level categories in 2025 or 2024.\nFair Value Valuation Techniques\nEquity securities are valued at the closing price reported on the stock exchange on which the individual securities are traded. Equity commingled/mutual funds are typically valued using the net asset value (“NAV”) provided by the investment manager or administrator of the fund. The NAV is based on the value of the underlying assets owned by the fund, minus liabilities and divided by the number of shares or units outstanding. These assets are classified as either Level 1 or Level 2, depending on availability of quoted market prices for identical or similar assets.\nIf available, fixed income securities are valued using the close price reported on the major market on which the individual securities are traded and are classified as Level 1. The fair value of other fixed income securities is typically estimated using pricing models and quoted prices of securities with similar characteristics and is generally classified as Level 2.\nCash equivalents include money market accounts that are valued at their cost plus interest on a daily basis, which approximates fair value. Short-term investments represent securities with original maturities of one year or less. These assets are classified as either Level 1 or Level 2.\n83\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nCash Flows\nThe Company’s expected employer contributions for 2026 and annual benefit payments over the next \nfive years\n for its Pension Plans are not expected to be material.\n84\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 10.    \nLeases and Other Commitments \nLeases\nThe Company leases certain domestic and international facilities and data center space under long-term, non-cancelable operating leases that expire at various dates through 2034. These leases include no material variable or contingent lease payments. Operating lease assets and liabilities are recognized based on the present value of the remaining lease payments discounted using the Company’s incremental borrowing rate. Operating lease assets also include prepaid lease payments minus any lease incentives. Extension or termination options present in the Company’s lease agreements are included in determining the right-of-use asset and lease liability when it is reasonably certain the Company will exercise those options. Lease expense is recognized on a straight-line basis over the lease term.\nThe following table presents right-of-use lease assets and lease liabilities included in the Company’s Consolidated Balance Sheets:\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nOperating lease right-of-use assets (included in \nOther non-current assets\n)\n$\n123\n \n$\n143\n \nOperating lease liabilities:\nCurrent portion of long-term operating lease liabilities (included in \nAccrued expenses\n)\n31\n \n28\n \nLong-term operating lease liabilities (included in \nOther liabilities\n)\n110\n \n133\n \nTotal operating lease liabilities\n$\n141\n \n$\n161\n \nThe following table summarizes supplemental disclosures of operating cost and cash flow information related to operating leases:\n2025\n2024\n2023\n(in millions)\nCost of operating leases\n$\n33\n \n$\n41\n \n$\n49\n \nCash paid for operating leases\n36\n \n44\n \n43\n \nOperating lease assets obtained in exchange for operating lease liabilities\n18\n \n10\n \n11\n \nThe weighted average remaining lease term and discount rate for the Company’s operating leases were as follows:\nJune 27,\n2025\nJune 28,\n2024\nWeighted average remaining lease term in years\n6.1\n6.6\nWeighted average discount rate\n5.0\n \n%\n5.0\n \n%\n85\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nAs of June 27, 2025, minimum lease payments were as follows:\nLease Amounts\n(in millions)\n2026\n$\n36\n \n2027\n30\n \n2028\n23\n \n2029\n18\n \n2030\n12\n \nThereafter\n46\n \nTotal future minimum lease payments\n165\n \nLess: imputed interest\n24\n \nPresent value of lease liabilities\n$\n141\n \nPurchase Agreements and Other Commitments\nIn the normal course of business, the Company enters into purchase orders with suppliers for the purchase of components used to manufacture its products. These purchase orders generally cover forecasted component supplies needed for production during the next quarter, are recorded as a liability upon receipt of the components, and generally may be changed or canceled at any time prior to shipment of the components. The Company also enters into long-term agreements with suppliers that contain fixed future commitments, which are contingent on certain conditions such as performance, quality and technology of the vendor’s components. \nAs of June 27, 2025, the Company had the following minimum long-term commitments:\nLong-term Commitments\n(in millions)\n2026\n$\n50\n \n2027\n26\n \nTotal\n$\n76\n \n86\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 11.    \nWestern Digital Corporation 401(k) Plan \nThe Company maintains the Western Digital Corporation 401(k) Plan (the “Plan”). The Plan covers substantially all U.S. employees, subject to certain eligibility requirements. Eligible employees receive employer matching contributions immediately upon hire. Eligible employees do not include individuals that are covered by a collective bargaining agreement, provide services as a consultant, interns, independent contractors, leased or temporary employees, or who otherwise are not treated as common-law employees.\nEligible employees are able to contribute up to \n85\n% of their eligible compensation on a combined pre-tax and Roth basis regardless of age, and \n10\n% of their eligible compensation on an after-tax basis, all subject to U.S. Internal Revenue Service (“IRS”) limitations. The Company may make a basic matching contribution equal to \n50\n% of each eligible participant’s contribution that does not exceed \n6\n% of the eligible participant’s annual compensation in the year of contribution. Furthermore, the Company’s employer matching contributions vest immediately. Contributions, including the Company’s matching contribution to the Plan, are recorded as soon as administratively possible after the Company makes payroll deductions from Plan participants.\nEffective February 18, 2023, the Company announced its decision to suspend its previous practice of matching contributions. The Company later resumed matching contributions effective January 1, 2024.\nFor 2025, 2024 and 2023, the Company made Plan contributions of $\n22\n million, $\n8\n million and $\n13\n million, respectively.\n87\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 12.     \nShareholders’ Equity and Convertible Preferred Stock\n2021 Long-Term Incentive Plan\nIn November 2021, stockholders approved the Western Digital Corporation 2021 Long-Term Incentive Plan, (as amended and restated, the “2021 Plan”). Upon the effective date of the 2021 Plan, no new awards were granted under the Western Digital Corporation Amended and Restated 2017 Performance Incentive Plan (the “2017 Plan”). The types of awards that may be granted under the 2021 Plan include stock options, stock appreciation rights (“SARs”), RSUs, PSUs, restricted stock and other forms of awards granted or denominated in the Company’s common stock or units of the Company’s common stock, as well as cash awards. Persons eligible to receive awards under the 2021 Plan include officers and employees of the Company or any of its subsidiaries, directors of the Company and certain consultants and advisors to the Company or any of its subsidiaries. The vesting of awards under the 2021 Plan and the 2017 Plan is determined at the date of grant. Each award expires on a date determined at the date of grant; however, the maximum term of options and SARs is \nten years\n after the grant date of the award. RSUs typically vest over periods ranging from \ntwo\n to \nfour years\n from the date of grant. PSUs are granted to certain employees and vest only after the achievement of pre-determined performance conditions or market conditions and completion of requisite service periods. Once the performance conditions or market conditions are met, the employee’s vesting of PSUs is generally subject to continued service.\nOutstanding RSU and PSU awards have dividend equivalent rights which entitle holders of such outstanding awards to the same dividend value per share as holders of common stock. Dividend equivalent rights are subject to the same vesting and other terms and conditions as the corresponding unvested RSUs and PSUs. Dividend equivalent rights are accumulated and paid in additional shares when the underlying shares vest.\nAs of June 27, 2025, the maximum number of shares of the Company’s common stock that was authorized for award grants under the 2021 Plan was \n34.8\n million shares. The 2021 Plan will terminate on November 22, 2031, unless terminated earlier by the Company’s Board of Directors.\nEmployee Stock Purchase Plan\nUnder the Company’s ESPP, eligible employees may authorize payroll deductions of up to \n10\n% of their eligible compensation, subject to IRS limitations, during prescribed offering periods to purchase shares of the Company’s common stock at \n95\n% of the fair market value of common stock either at the beginning of that offering period or on the applicable exercise date, whichever is less. A participant may participate in only \none\n offering period at a time, and a new offering period generally begins each June 1st and December 1st. Each offering period is generally \n24\n months and consists of \nfour\n exercise dates (each, generally \nsix months\n following the start of the offering period or the preceding exercise date, as the case may be). If the fair market value of the Company’s common stock is less on a given exercise date than on the date of grant, employee participation in that offering period ends and participants are automatically re-enrolled in the next new offering period.\nDuring 2025, 2024 and 2023, the Company issued \n2.0\n million, \n2.4\n million and \n2.7\n million shares, respectively, under the ESPP for aggregate purchase amounts of $\n77\n million, $\n81\n million and $\n92\n million, respectively.\nTo the extent available, the Company may issue shares out of treasury stock upon the vesting of awards, the exercise of employee stock options and the purchase of shares pursuant to the ESPP.\n88\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nStock-based Compensation Expense\nIn connection with the Separation (as discussed in Note 3, \nDiscontinued Operations\n), on February 21, 2025, all outstanding stock-based compensation awards associated with continuing Western Digital employees were adjusted with the intent to preserve the intrinsic value of each award immediately before and after the Separation. The adjustments were determined using a ratio calculated based on the closing price of the Company’s common stock immediately before the Separation and the average of the closing price on each of the first \nfive\n days of trading after the Separation. In addition, for PSUs, the conditions related to the Company’s performance for the 2025 measurement period were modified and fixed at target. The remaining terms of the outstanding awards are unchanged and any unvested stock awards will continue to vest over the original vesting periods. An incremental value of approximately $\n40\n million resulting from the adjustment of the unvested awards will be recognized ratably over the remaining service periods. Upon the Separation, approximately \n3.1\n million unvested stock-based compensation awards were retained by Sandisk employees and will vest upon completion of any remaining service period with Sandisk and approximately \n3.5\n million awards were cancelled from the Company’s incentive plans.\nThe following tables present the Company’s stock-based compensation for equity-settled awards by type and financial statement line items as well as the related tax benefit included in the Company’s Consolidated Statements of Operations:\n2025\n2024\n2023\n(in millions)\nRSUs and PSUs\n$\n151\n \n$\n182\n \n$\n201\n \nESPP\n16\n \n20\n \n11\n \nTotal\n$\n167\n \n$\n202\n \n$\n212\n \n2025\n2024\n2023\n(in millions)\nCost of revenue\n$\n34\n \n$\n36\n \n$\n35\n \nResearch and development\n73\n \n65\n \n70\n \nSelling, general and administrative\n60\n \n101\n \n107\n \nSubtotal\n167\n \n202\n \n212\n \nTax benefit\n(\n23\n)\n(\n30\n)\n(\n29\n)\nTotal\n$\n144\n \n$\n172\n \n$\n183\n \nAny shortfalls or excess windfall tax benefits related to the vesting and exercise of stock-based awards, which are recognized as a component of the Company’s Income tax expense, were not material for the periods presented.\nCompensation costs related to unvested RSUs, PSUs and rights to purchase shares of common stock under the ESPP will generally be amortized on a straight-line basis over the remaining average service period. \nThe following table presents the unamortized compensation cost and weighted average service period of all unvested outstanding awards as of June 27, 2025:\nUnamortized Compensation Costs\nWeighted Average Service Period\n(in millions)\n(years)\nRSUs and PSUs \n(1)\n$\n245\n \n2.1\nESPP\n23\n \n1.4\nTotal unamortized compensation cost\n$\n268\n \n(1)    \nWeighted average service period assumes the performance conditions are met for the PSUs.\n89\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nPlan Activities\nStock Options\nNo\n options were granted or exercised in 2025, 2024 or 2023. As of June 27, 2025, there were no remaining outstanding options.\nRSUs and PSUs\nThe following table summarizes RSU and PSU activity under the Company’s incentive plans:\nNumber of Shares\nWeighted Average Grant Date Fair Value\nAggregate Intrinsic Value at Vest Date\n(in millions)\n(in millions)\nRSUs and PSUs outstanding at July 1, 2022\n15.4\n \n$\n52.89\n \nGranted\n6.6\n \n41.27\n \nVested\n(\n6.6\n)\n54.05\n \n$\n274\n \nForfeited\n(\n1.6\n)\n54.56\n \nRSUs and PSUs outstanding at June 30, 2023\n13.8\n \n46.56\n \nGranted\n6.6\n \n42.29\n \nVested\n(\n5.8\n)\n48.26\n \n$\n297\n \nForfeited\n(\n1.6\n)\n45.62\n \nRSUs and PSUs outstanding at June 28, 2024\n13.0\n \n44.42\n \nGranted\n5.5\n \n40.99\n \nVested\n(\n6.5\n)\n41.08\n \n$\n379\n \nForfeited\n(\n1.4\n)\n50.91\n \nShare conversion due to Separation\n2.6\n \n52.15\n \nAwards cancelled due to Separation\n(\n3.5\n)\n52.32\n \nRSUs and PSUs outstanding at June 27, 2025\n9.7\n \n$\n33.56\n \nRSUs and PSUs are generally settled in an equal number of shares of the Company’s common stock at the time of vesting of the units. \nFair Value Valuation Assumptions\nRSU and PSU Grants\nThe fair value of the Company’s RSU and PSU awards is determined based upon the closing price of the Company’s stock price on the date of grant. The fair value of PSU awards with a market condition is estimated using a Monte Carlo simulation model on the date of grant.\nESPP – Black-Scholes-Merton Model\nThe fair value of ESPP purchase rights issued is estimated at the date of grant of the purchase rights using the Black-Scholes-Merton option pricing model. The Black-Scholes-Merton option pricing model requires the input of assumptions such as the expected stock price volatility and the expected period until options are exercised. Purchase rights under the ESPP are generally granted on either June 1st or December 1st of each year.\n90\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nThe fair values of ESPP purchase rights have been estimated at the date of grant using a Black-Scholes-Merton option pricing model with the following weighted average assumptions: \n2025\n2024\n2023\nWeighted-average expected term (in years)\n1.16\n1.25\n1.25\nRisk-free interest rate\n4.19\n%\n4.93\n%\n4.52\n%\nStock price volatility\n0.39\n0.39\n0.46\nDividend yield\n0.01\n%\n—\n%\n—\n%\nFair value\n$\n13.32\n$\n15.08\n$\n9.70\nConvertible Preferred Stock\nOn January 31, 2023, the Board of Directors of the Company authorized the designation of \n900,000\n shares of Series A Convertible Perpetual Preferred Stock, par value $\n0.01\n per share (the “Preferred Shares”) from the Company’s existing \nfive million\n authorized but unissued shares of preferred stock and issued the Preferred Shares through a private placement for an aggregate purchase price of $\n900\n million, less issuance costs of $\n24\n million. During the year ended June 28, 2024, \n665,000\n of the Preferred Shares were converted into approximately \n15\n million shares of common stock in accordance with the original terms of the Preferred Shares. As of both June 27, 2025 and June 28, 2024, \n235,000\n Preferred Shares were outstanding.\nPreferred dividend provisions\nThe Preferred Shares have an initial stated value of $\n1,000\n per share and accrue a cumulative preferred dividend at an annual rate of \n6.25\n% per annum (increasing to \n7.25\n% per annum on January 31, 2030 and to \n8.25\n% per annum on January 31, 2033) compounded on a quarterly basis. Such dividends are payable on a quarterly basis in cash or in-kind through an increase to the stated value. Dividends in-kind were declared from the date of issuance of the Preferred Shares through December 31, 2024. Preferred dividends in cash of $\n8\n million were declared and paid in 2025. The Preferred Shares also participate in any dividends declared for common shareholders on an as-converted equivalent basis. As of June 27, 2025 and June 28, 2024, accumulated dividends in-kind were $\n30\n million and $\n22\n million, respectively.\nConversion rights\nThe Preferred Shares are convertible into shares of the Company’s common stock at a conversion rate of approximately $\n35.51\n per share (the “Conversion Price”). The conversion rate was adjusted from the initial conversion rate of $\n47.75\n per share as a result of the Separation, in accordance with the Certificate of Designations for the Preferred Shares, using a ratio of the closing price of the Company’s and Sandisk’s common stock over the first \n10\n trading days after the Separation. This rate is subject to future anti-dilution adjustments and certain other one-time adjustments in the event of various specified spin-off-related transactions. This Conversion Price applies to the total of the stated value of the Preferred Shares plus any cumulative accrued but unpaid dividends (the “Accumulated Stated Value”). In the case of future standalone spin-off transactions, the holders of the Preferred Shares may convert one-third of their Preferred Shares into a similar class of preferred shares of the spin-off entity. The Company may opt to convert the Preferred Shares after January 31, 2026, if the closing price per share of the Company’s common stock exceeds \n150\n% of the Conversion Price for at least \n20\n out of \n30\n consecutive trading days immediately before the Company’s conversion notice.\nAs of June 27, 2025 and June 28, 2024, the Preferred Shares outstanding would have been convertible, if otherwise permitted, into \n7\n million and \n5\n million shares of common stock, respectively, based on the conversion rate in effect at each such date.\nRedemption\n \nAfter January 31, 2030, the Company will have the right, but not the obligation, to redeem the Preferred Shares for an amount in cash equal to \n110\n% of the Accumulated Stated Value. Redemption is contingently mandatory in the event of a fundamental change in the business as defined in the designation of the Preferred Shares. \n91\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nThe Preferred Shares have been classified as mezzanine equity in the Company’s Consolidated Balance Sheets because, in the event of certain fundamental changes in the business that are not solely within the control of the Company, the Preferred Shares would become redeemable at the option of the holders. The Company did not adjust the carrying values of the Preferred Shares to the current redemption value of such shares since a liquidation event was not probable at any of the balance sheet dates. Subsequent adjustments to increase or decrease the carrying values to the ultimate redemption value will be made only if and when it becomes probable that such a fundamental change in the business will occur.\nVoting right\n \nThe Preferred Shares will vote, to the extent permitted under the Nasdaq listing rules, on an as-converted equivalent basis along with holders of the Company’s common stock.\nLiquidation preference\n \nIn the event of any voluntary or involuntary liquidation, holders of the Preferred Shares will be senior to the holders of the Company’s common stock and the liquidation preference is the greater of (i) the sum of an amount in cash equal to \n110\n% of the Accumulated Stated Value plus accrued and unpaid dividends and (ii) the payment that the holders of the Preferred Shares would have received had all the Preferred Shares been converted into common stock immediately prior to such liquidation, before any distributions are made to common shareholders and all other classes of junior capital stock of the Company. As of June 27, 2025 and June 28, 2024, the total aggregate liquidation preference was $\n265\n million and $\n257\n million, respectively.\nShare Repurchase Program\nOn May 9, 2025, the Company’s Board of Directors authorized a share repurchase program for the repurchase of up to $\n2.0\n billion of the Company’s common stock. There is no expiration date for the share repurchase program. For the year ended June 27, 2025, the Company repurchased \n2.8\n million shares for a total cost of $\n149\n million. The remaining amount available to be repurchased under the Company’s share repurchase program as of June 27, 2025 was $\n1.85\n billion. Repurchases under the share repurchase program may be made in the open market or in privately negotiated transactions and may be made under a Rule 10b5-1 plan. The Company expects share repurchases to be funded principally by operating cash flows. The amount and timing of share repurchases will depend on market conditions and other corporate considerations. The company may suspend or discontinue the share repurchase program at any time.\nStock Reserved for Issuance\nThe following table summarizes all common stock reserved for issuance at June 27, 2025:\n \nNumber of Shares\n(in millions)\nConvertible notes\n55\n \nOutstanding awards and shares available for award grants\n30\n \nConvertible preferred stock\n10\n \nESPP\n4\n \nTotal\n99\n \nDividends to Common Shareholders\nOn April 29, 2025, the Company’s Board of Directors authorized the adoption of a quarterly cash dividend program. Under the cash dividend program, holders of the Company’s common stock will receive dividends when and as declared by the Board of Directors. During the year ended June 27, 2025, the Company paid cash dividends of $\n0.10\n per share of its outstanding common stock, totaling $\n36\n million, including payment to holders of the Company’s Series A Preferred Stock in accordance with their participation rights.\n92\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nSubsequent to year-end, on July 29, 2025, the Board of Directors declared a cash dividend of $\n0.10\n per share of the Company’s common stock, which will be paid on September 18, 2025 to shareholders of record as of the close of business on September 4, 2025.\nThe Company may modify, suspend, or cancel its cash dividend program in any matter and at any time. The amount of future dividends under the Company’s cash dividend program, and the declaration and payment thereof, will be based upon all relevant factors, including the Company’s financial position, results of operations, cash flows, capital requirements and restrictions under the Company’s Loan Agreement and other financing agreements, and shall be in compliance with applicable law.\n93\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 13.    \nIncome Taxes\nIncome (Loss) Before Taxes \nThe domestic and foreign components of Income (loss) before taxes were as follows:\n2025\n2024\n2023\n(in millions)\nForeign\n$\n2,602\n \n$\n(\n492\n)\n$\n(\n696\n)\nDomestic\n(\n1,472\n)\n(\n247\n)\n(\n153\n)\nIncome (loss) before taxes\n$\n1,130\n \n$\n(\n739\n)\n$\n(\n849\n)\nIncome Tax Expense (Benefit)\nThe components of Income tax expense (benefit) were as follows:\n2025\n2024\n2023\n(in millions)\nCurrent:\nForeign\n$\n213\n \n$\n77\n \n$\n27\n \nDomestic - Federal\n90\n \n34\n \n28\n \nDomestic - State\n(\n1\n)\n6\n \n(\n8\n)\n302\n \n117\n \n47\n \nDeferred:\nForeign\n(\n1\n)\n(\n8\n)\n10\n \nDomestic - Federal\n(\n773\n)\n(\n68\n)\n1\n \nDomestic - State\n(\n41\n)\n(\n15\n)\n(\n5\n)\n(\n815\n)\n(\n91\n)\n6\n \nIncome tax expense (benefit)\n$\n(\n513\n)\n$\n26\n \n$\n53\n \nPreviously, the Tax Cuts and Jobs Act of 2017 (“TCJA”) eliminated the ability to deduct research and development (“R&D”) expenditures in the year incurred, requiring capitalization and amortization under Internal Revenue Code Section 174. On July 4, 2025, the One Big Beautiful Bill Act of 2025 (“OBBBA”) was signed into law, which includes broad tax reform provisions that extend and modify key elements of the TCJA. Notably, the new legislation now allows an option for the immediate expensing of domestic R&D expenditures, beginning with fiscal year 2026. The legislation also includes favorable modifications to international tax provisions, including changes to the Global Intangible Low-Taxed Income regime and enhancements to the Foreign-Derived Intangible Income deduction. Because the OBBBA provisions are not effective for the Company until fiscal year 2026 and the enactment date occurred after the balance sheet date, the tax effects of the OBBBA are not included in the operating results for the fiscal year ended June 27, 2025.\nOn August 16, 2022, the Inflation Reduction Act of 2022 was signed into law, which contained, among other things, a corporate alternative minimum tax (“CAMT”) of 15% on corporations with three-year average annual adjusted financial statement income (“AFSI”) exceeding $1.00 billion. The CAMT became effective for the Company beginning with fiscal year 2024. The Company was not subject to CAMT in fiscal year 2024 and does not expect to be subject to CAMT for fiscal year 2025 as its average annual AFSI did not exceed $1.00 billion for the preceding three-year period.\n94\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nOn December 20, 2021, the Organization for Economic Co-operation and Development G20 Inclusive Framework on Base Erosion and Profit Shifting released Model Global Anti-Base Erosion rules under Pillar Two. Several non-U.S. jurisdictions have either enacted legislation or announced their intention to enact future legislation to adopt certain or all components of Pillar Two, also known as Global Minimum Tax (“GMT”), some of which are effective for the Company in fiscal year 2025. For fiscal year 2025, the Company currently expects to be able to meet certain transitional safe harbors and does not expect any material GMT taxes. As most of the jurisdictions in which the Company operates have adopted this legislation for fiscal year 2026, the Company expects there will be increases in the Company’s future tax obligations in these jurisdictions.\nDeferred Taxes\nTemporary differences and carryforwards, which give rise to a significant portion of deferred tax assets and liabilities were as follows:\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nDeferred tax assets:\nSales related reserves and accrued expenses not currently deductible\n$\n38\n \n$\n34\n \nAccrued compensation and benefits not currently deductible\n75\n \n75\n \nNet operating loss carryforward\n133\n \n134\n \nBusiness credit carryforward\n562\n \n520\n \nLong-lived assets\n796\n \n42\n \nInterest and hedging costs not currently deductible\n166\n \n187\n \nOther\n29\n \n11\n \nTotal deferred tax assets\n1,799\n \n1,003\n \nDeferred tax liabilities:\nLong-lived assets\n(\n40\n)\n(\n33\n)\nUnremitted earnings of certain non-U.S. entities\n(\n149\n)\n(\n218\n)\nOther\n(\n12\n)\n—\n \nTotal deferred tax liabilities\n(\n201\n)\n(\n251\n)\nValuation allowances\n(\n598\n)\n(\n527\n)\nDeferred tax assets, net\n$\n1,000\n \n$\n225\n \nThe increase in the deferred tax assets is attributable primarily to one-time deferred tax benefits related to the inter-entity asset transfer in conjunction with the Separation and the mandatory capitalization of R&D expenditures. While the OBBBA allows for the immediate expensing of domestic R&D expenditures, these provisions are not effective for Company until fiscal year 2026. As such, the Company is required to capitalize a portion of its R&D expenditures in fiscal year 2025 under the prior law. The change in the deferred tax liabilities is attributable primarily to a remeasurement of the Company’s California taxes associated with its un-remitted earnings of its non-U.S. entities. This change is offset entirely by an equal and offsetting change in the valuation allowance. The Company continues to assess and adjust its valuation allowance based on operating results and market conditions. After weighing both the positive and negative evidence available, including, but not limited to, earnings history, projected future outcomes, industry and market trends and the nature of each of the deferred tax assets, the Company determined that it is able to realize its deferred tax assets except for certain loss and credit carryforwards.\nThe Company is permanently reinvested with respect to certain foreign earnings. There is no unrecognized deferred tax liability associated with the repatriation of these foreign undistributed earnings as it can be achieved without additional federal tax consequences.\n95\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nEffective Tax Rate\nReconciliation of the U.S. Federal statutory rate to the Company’s effective tax rate is as follows:\n2025\n2024\n2023\nU.S. Federal statutory rate\n21\n \n%\n21\n \n%\n21\n \n%\nTax rate differential on international income\n(\n36\n)\n(\n22\n)\n(\n22\n)\nTax effect of U.S. foreign income inclusion\n1\n \n(\n1\n)\n(\n1\n)\nTax effect of U.S. foreign minimum tax\n25\n \n(\n6\n)\n—\n \nTax effect of U.S. stock-based compensation\n(\n2\n)\n(\n1\n)\n(\n1\n)\nTax effect of non-deductible loss on retained interest in Sandisk\n16\n \n—\n \n—\n \nTax effect of U.S. permanent differences\n—\n \n5\n \n(\n1\n)\nState income tax, net of federal tax\n—\n \n2\n \n(\n1\n)\nChange in valuation allowance\n6\n \n(\n3\n)\n1\n \nUnremitted earnings of certain non-U.S. entities\n(\n2\n)\n(\n2\n)\n(\n1\n)\nForeign income tax credits\n(\n8\n)\n1\n \n—\n \nR&D tax credits\n(\n6\n)\n5\n \n4\n \nU.S. return to provision\n1\n \n—\n \n(\n1\n)\nTax reserves\n1\n \n(\n3\n)\n(\n3\n)\nInter-entity asset transfer\n(\n61\n)\n—\n \n—\n \nOther\n(\n1\n)\n—\n \n(\n1\n)\nEffective tax rate\n(\n45\n)\n%\n(\n4\n)\n%\n(\n6\n)\n%\nThe tax rate differentials on international income are comprised primarily of reduced tax rates from the Company tax holidays and tax incentive programs in the Philippines and Thailand in fiscal years 2025 and 2024, and in Malaysia, the Philippines, and Thailand in fiscal 2023.\nTax Holidays and Carryforwards\nA substantial portion of the Company’s manufacturing operations in the Philippines and Thailand operate under various tax holidays and tax incentive programs, which will expire in whole or in part at various dates during 2026 through 2033. Certain tax holidays and tax incentive programs may be extended if specific conditions are met. On November 1, 2023, the Company’s tax holiday in Malaysia expired. The Company has applied for an extension and continues to be engaged in active discussions with the Malaysian Investment Development Authority. Because the exact terms of an extension are not currently known, the Company is applying the Malaysia corporate statutory tax rate on its Malaysian income for the full fiscal year. If an extension is granted, the Company will make an adjustment to its effective tax rate in that period.\nThe direct tax impact of these tax holidays and tax incentives was an increase to the Company’s net earnings by $\n551\n million, or $\n1.54\n per diluted share, $\n209\n million, or $\n0.64\n per diluted share, and $\n140\n million, or $\n0.44\n per diluted share, in 2025, 2024 and 2023, respectively.\n96\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nAs of June 27, 2025, the Company had varying amounts of federal and state NOL/tax credit carryforwards that do not expire or, if not used, expire in various years. \nFollowing is a summary of the Company’s federal and state NOL/tax credit carryforwards and the related expiration dates of these NOL/tax credit carryforwards:\nJurisdiction\nNOL/Tax Credit Carryforward Amount\nExpiration\n(in millions)\nFederal NOL (Pre 2017 Act Generation)\n$\n563\n \n2026 to 2038\nCalifornia NOL\n348\n \n2040 to 2047\nOther State NOL\n292\n \nVarious\nFederal tax credits\n89\n \n2027 to 2036\nState tax credits\n750\n \nNo expiration\nThe federal and state NOLs and credits relating to various acquisitions are subject to limitations under Sections 382 and 383 of the U.S. Internal Revenue Code. The Company expects the total amount of federal and state NOLs ultimately realized will be reduced as a result of these provisions by $\n116\n million and $\n240\n million, respectively. The Company expects the total amount of federal and state credits ultimately realized will be reduced as a result of these provisions by $\n27\n million and $\n2\n million, respectively.\nAs of June 27, 2025, the Company had varying amounts of foreign NOL carryforwards that do not expire or, if not used, expire in various years, depending on the country. \nThe major jurisdictions that the Company receives foreign NOL carryforwards and the related amounts and expiration dates of these NOL carryforwards are as follows:\nJurisdiction\nNOL Carryforward Amount\nExpiration\n(in millions)\nMalaysia\n$\n69\n \n2029\nJapan\n42\n \n2026\nUncertain Tax Positions\nWith the exception of certain unrecognized tax benefits that are directly associated with the tax position taken, unrecognized tax benefits are presented gross in the Consolidated Balance Sheets.\nThe following is a tabular reconciliation of the total amounts of unrecognized tax benefits excluding accrued interest and penalties: \n2025\n2024\n2023\n(in millions)\nUnrecognized tax benefit, beginning balance\n$\n721\n \n$\n1,021\n \n$\n1,047\n \nGross increases related to current year tax positions\n11\n \n25\n \n7\n \nGross increases related to prior year tax positions\n26\n \n73\n \n22\n \nGross decreases related to prior year tax positions\n(\n13\n)\n(\n32\n)\n(\n47\n)\nSettlements\n(\n40\n)\n(\n363\n)\n(\n5\n)\nLapse of statute of limitations\n(\n10\n)\n(\n3\n)\n(\n3\n)\nDistribution in connection with the Separation\n(\n126\n)\n—\n \n—\n \nUnrecognized tax benefit, ending balance\n$\n569\n \n$\n721\n \n$\n1,021\n \n97\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nAs of June 27, 2025, June 28, 2024 and June 30, 2023, the portion of the gross unrecognized tax benefits, if recognized, that would affect the effective tax rate is $\n416\n million, $\n555\n million and $\n855\n million, respectively. It is the Company’s policy to include interest and penalties related to its gross unrecognized tax benefits as a component of the provision for income taxes. Accrued interest and penalties included in the Company’s liability related to unrecognized tax benefits as of June 27, 2025, June 28, 2024 and June 30, 2023 was $\n82\n million, $\n181\n million and $\n289\n million, respectively. As of June 27, 2025, June 28, 2024 and June 30, 2023, the Company’s payables related to unrecognized tax benefits, including accrued interest and penalties, were $\n498\n million, $\n736\n million and $\n1.14\n billion, respectively. Of these amounts, approximately $\n332\n million, including interest and penalties, could result in potential cash payments to be made within the next twelve months and have been included in Income taxes payable on the Consolidated Balance Sheets as of June 27, 2025. The remaining payables related to unrecognized tax benefits, including accrued interest and penalties, are included in Other liabilities on the Consolidated Balance Sheets as of June 27, 2025 and June 28, 2024.\nThis potential cash payment is expected to be netted with offsetting favorable tax receivables totaling $\n148\n million, including among other things, a reduction to our mandatory deemed repatriation tax obligations related to the settlement for the years 2008 through 2015, for a potential net cash payment of $\n184\n million. These tax receivables are classified in Other current assets on the Consolidated Balance Sheets as of June 27, 2025.\nThe Company files U.S. Federal, U.S. state and foreign tax returns. For both federal and state tax returns, with few exceptions, the Company is subject to examination for 2016 through 2024. The Company is no longer subject to examination by the IRS for periods prior to 2016, although carry forwards generated prior to those periods may still be adjusted upon examination by the IRS or state taxing authority if they either have been or will be used in a subsequent period. \nIn the following major foreign jurisdictions where there is no tax holiday, the Company could be subject to examination as noted below:\nJurisdiction\nPeriod Subject to Examination\nChina (calendar)\n2014-2024\nIndia (fiscal)\n2017-2024\nJapan (fiscal)\n2016-2024\nMalaysia (fiscal)\n2018-2024\nThailand (fiscal)\n2014-2024\nSingapore (fiscal)\n2021-2024\nUnited Kingdom (fiscal)\n2023-2024\nThe Company had previously reached a final agreement with the IRS regarding notices of deficiency with respect to years 2008 through 2012 and in February 2024, the Company also reached a final agreement for resolving the notices of proposed adjustments with respect to years 2013 through 2015. During the year ended June 27, 2025, the Company made payments of $\n130\n million for interest with respect to years 2008 through 2012 and $\n32\n million for tax and interest with respect to years 2013 through 2015, resulting in no remaining liability as of June 27, 2025 related to all years from 2008 through 2015.\nIn connection with settlements for the years 2008 through 2015, the Company expects to realize reductions to its mandatory deemed repatriation tax obligations and tax savings from interest deductions in future years aggregating to approximately $\n166\n million. Of this amount, $\n65\n million of interest savings from the interest paid with respect to years 2008 through 2015 is classified as a deferred tax asset due to interest expense limitation rules.\nThe Company believes that adequate provision has been made for any adjustments that may result from any other tax examinations. However, the outcome of such tax examinations cannot be predicted with certainty. If any issues addressed in the Company’s tax examinations are resolved in a manner not consistent with management’s expectations, the Company could be required to adjust its provision for income taxes in the period such resolution occurs. As of June 27, 2025, with the exception of the net potential payment of $\n183\n million, it was not possible to estimate the amount of change, if any, in the unrecognized tax benefits that is reasonably possible within the next twelve months. Any significant change in the amount of the Company’s liability for unrecognized tax benefits would most likely result from additional information relating to the examination of the Company’s tax returns.\n98\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 14.    \nNet Income (Loss) Per Common Share \nThe following table presents the computation of basic and diluted income (loss) per common share:\n \n2025\n2024\n2023\n(in millions, except per share data)\nNet income (loss) from continuing operations\n$\n1,643\n \n$\n(\n765\n)\n$\n(\n902\n)\nLess: dividends allocated to preferred shareholders\n17\n \n54\n \n24\n \nLess: income attributable to participating securities\n28\n \n—\n \n—\n \nNet income (loss) from continuing operations attributable to common shareholders - basic\n1,598\n \n(\n819\n)\n(\n926\n)\nNet income (loss) from discontinued operations, net of taxes, attributable to common shareholders\n242\n \n(\n33\n)\n(\n782\n)\nNet income (loss) attributable to common shareholders - basic\n$\n1,840\n \n$\n(\n852\n)\n$\n(\n1,708\n)\nNet income (loss) from continuing operations attributable to common shareholders - basic\n$\n1,598\n \n$\n(\n819\n)\n$\n(\n926\n)\nRe-allocation of participating securities considered potentially dilutive securities\n1\n \n—\n \n—\n \nNet income (loss) from continuing operations attributable to common shareholders - diluted\n1,599\n \n(\n819\n)\n(\n926\n)\nNet income (loss) from discontinued operations, net of taxes, attributable to common shareholders\n242\n \n(\n33\n)\n(\n782\n)\nNet income (loss) attributable to common shareholders - diluted\n$\n1,841\n \n$\n(\n852\n)\n$\n(\n1,708\n)\nWeighted average shares:\nBasic\n347\n \n326\n \n318\n \nRSUs, PSUs, ESPP, and the convertible notes\n12\n \n—\n \n—\n \nDiluted\n359\n \n326\n \n318\n \nNet income (loss) per common share:\nContinuing operations - basic\n$\n4.61\n \n$\n(\n2.51\n)\n$\n(\n2.91\n)\nDiscontinued operations - basic\n0.70\n \n(\n0.10\n)\n(\n2.46\n)\nNet income (loss) per common share - basic\n5.31\n \n(\n2.61\n)\n(\n5.37\n)\nContinuing operations - diluted\n4.45\n \n(\n2.51\n)\n(\n2.91\n)\nDiscontinued operations - diluted\n0.67\n \n(\n0.10\n)\n(\n2.46\n)\nNet income (loss) per common share - diluted\n5.12\n \n(\n2.61\n)\n(\n5.37\n)\nAnti-dilutive potential common shares excluded\n—\n \n22\n \n14\n \nBasic income (loss) per share attributable to common shareholders is computed using (i) net income (loss) less (ii) dividends paid to holders of Preferred Shares less (iii) net income (loss) attributable to participating securities divided by (iv) weighted average basic shares outstanding. Diluted net income (loss) per share attributable to common shareholders is computed as (i) basic net income (loss) attributable to common shareholders plus (ii) diluted adjustments to income allocable to participating securities divided by (iii) weighted average diluted shares outstanding. The “if-converted” method is used to determine the dilutive impact for the convertible notes and the Preferred Shares. The treasury stock method is used to determine the dilutive impact of unvested equity awards.\n99\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\n For 2025, based on the Company’s average stock price during the period, an insignificant number of common shares subject to outstanding equity awards were anti-dilutive. For 2024 and 2023, the Company recorded a net loss and all shares subject to outstanding equity awards were excluded from the calculation of diluted shares for the period because their impact would have been anti-dilutive.\nNote 15.    \nBusiness Realignment Charges\nThe Company periodically incurs charges to realign its business operations with anticipated market demand, primarily consisting of organization rationalization designed to streamline its business, reduce its cost structure and focus its resources. These actions may result in charges for employee termination benefits or charges from the impairment of intangible assets and other long-lived assets. In this regard, in 2024, the Company reassessed existing capacity development plans and made a decision to cancel certain projects, including projects to expand capacity in its Penang, Malaysia facility, resulting in the impairment of existing construction in progress, other assets and the recognition of a liability for certain contract termination costs. The Company may also periodically record credits related to gains upon ultimate sale of property in connection with these activities.\nThe Company recorded the following charges related to these actions:\n2025\n2024\n2023\n(in millions)\nEmployee termination benefits\n$\n2\n \n$\n34\n \n$\n130\n \nAsset impairments\n—\n \n146\n \n19\n \nOther charges (gains):\nGain on disposition of assets and other charges\n—\n \n—\n \n(\n8\n)\nContract termination and other\n2\n \n29\n \n5\n \nRecovery of non-cancellable purchase orders\n(\n10\n)\n—\n \n—\n \nTotal business realignment charges\n$\n(\n6\n)\n$\n209\n \n$\n146\n \nThe following table presents an analysis of the components of these activities against the reserve (included in Accrued expenses) during the year ended June 27, 2025:\nEmployee Termination Benefits\nContract Termination and Other\nTotal\n(in millions)\nAccrual balance at June 28, 2024\n$\n—\n \n$\n28\n \n$\n28\n \nCharges\n2\n \n2\n \n4\n \nCash payments\n(\n1\n)\n(\n11\n)\n(\n12\n)\nRecovery of non-cancellable purchase orders\n—\n \n(\n10\n)\n(\n10\n)\nAccrual balance at June 27, 2025\n$\n1\n \n$\n9\n \n$\n10\n \n100\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 16.    \nSupplier Finance Program\nThe Company maintains a voluntary supplier finance program that provides participating suppliers with enhanced receivable options. The program allows participating suppliers of the Company, at their sole discretion and cost, to sell their receivables due from the Company to a third-party financial institution and receive early payment at terms negotiated between the supplier and the third-party financial institution. The Company’s vendor payment terms and amounts are not impacted by a supplier’s decision to participate in this program.\nThe Company’s current payment terms with its suppliers under these programs generally range from \n60\n to \n90\n days and payment terms that the Company negotiates with its suppliers are not impacted by whether a supplier participates in the program. The Company does not provide any guarantees to any third parties, and no assets are pledged in connection with the arrangements.\nThe Company’s outstanding payment obligations to vendors eligible to participate under its supplier finance program were $\n39\n million and $\n37\n million as of June 27, 2025 and June 28, 2024, respectively, and are included within \nAccounts payable\n on the Company’s Consolidated Balance Sheets with the associated payments reflected in the operating activities section of the Consolidated Statements of Cash Flows. \nThe roll-forward of the Company’s outstanding obligations confirmed as valid under its supplier finance program for the year ended June 27, 2025 is as follows (in millions):\nConfirmed obligation outstanding at the beginning of the year\n$\n37\n \nInvoices confirmed during the year\n244\n \nConfirmed invoices paid during the year\n(\n242\n)\nConfirmed obligations outstanding at the end of the year\n$\n39\n \n101\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 17.    \nLegal Proceedings\nIntellectual Property Litigation\nOn August 26, 2022, MR Technologies, GmbH (“MRT”) filed an action in the United States District Court for the Central District of California (the “Central District Court”) against the Company’s wholly-owned subsidiary, Western Digital Technologies, Inc., alleging infringement of U.S. Patent Nos. 9,978,413, 9,928,864, 11,133,031 and 11,138,997, each of which relate to HDD media. As the case progressed, MRT dropped its claims with respect to U.S. Patent Nos. 9,978,413 and 11,133,031, and the case proceeded to trial in July 2024 on the remaining \ntwo\n patents (together, the “MRT Patents”). The trial concluded on July 26, 2024, and the jury awarded MRT a lump sum of $\n262\n million for use of the MRT Patents in the past and through their remaining lives. MRT also requested and was awarded prejudgment interest totaling $\n117\n million in a judgment entered on August 15, 2024. In addition, MRT requested attorney’s fees and post-judgment interest.\nIn the fourth quarter of fiscal year 2024, the Company recognized an aggregate liability for this matter of $\n384\n million with $\n291\n million recognized as an Operating expense under Litigation matter for the year ended June 28, 2024 and $\n93\n million recognized as Other non-current assets for the patent licenses, to be amortized over their remaining lives. \nSubsequently, in April 2025, pursuant to a confidential agreement, MRT and the Company reached a global settlement of $\n130\n million for all pending legal disputes. The settlement resulted in the dismissal of the MRT matter, as well as a second patent litigation matter MRT filed on August 22, 2024 against the Company. As a result of the settlement, the Company reversed $\n201\n million of previously recorded charges in Operating expense under Litigation matter and $\n6\n million of post-judgment interest previously recorded in Other income (expense), net.\nOn September 28, 2016, SPEX Technologies, Inc. (“SPEX”) filed a lawsuit in the Central District Court against the Company and two of the Company’s current or former wholly-owned subsidiaries, Western Digital Technologies, Inc. and HGST Inc., alleging infringement of U.S. Patent Nos. 6,088,802 and 6,003,135, both of which allegedly relate to moving a security mechanism (e.g., the encrypting/decrypting mechanism) from a host computer or a separate device to a peripheral device that provides data storage. As the case progressed, SPEX dismissed its allegations relating to U.S. Patent No. 6,003,135 and narrowed its case to \none\n claim related to U.S. Patent No. 6,088,802 and asserted this against certain HDD products that may include certain encryption capabilities. The trial commenced on October 8, 2024, and concluded on October 18, 2024, and the jury awarded SPEX damages of $\n316\n million for the use of \none\n claim related to U.S. Patent No. 6,088,802 in the past, prior to its expiration in 2017. On January 8, 2025, the Court entered judgment for SPEX in accordance with the verdict and also awarded SPEX prejudgment interest of $\n237\n million and legal costs. On June 16, 2025, the Court ruled on the Company’s post-trial motions, finding that SPEX did not present sufficient evidence on which a damages award could be determined and therefore awarded nominal damages of $\n1\n. On June 27, 2025, the Court entered an amended judgment awarding SPEX nominal damages of $\n1\n with no prejudgment interest and no legal costs. The Company has appealed the infringement finding, and SPEX has appealed damages-related issues. Based on available appellate arguments, the Company believes a loss is not probable and has not accrued a liability as a result of the jury verdict or the entry of amended judgment in its financial statements as of June 27, 2025.\nOther Matters\nIn the normal course of business, the Company is subject to legal proceedings, lawsuits and other claims. Although the ultimate aggregate amount of reasonably possible monetary liability or financial impact with respect to these other matters is subject to many uncertainties, management believes that any monetary liability or financial impact to the Company from these matters, individually and in the aggregate, would not be material to the Company’s financial condition, results of operations or cash flows. However, any monetary liability and financial impact to the Company from these matters could differ materially from management’s expectations.\nThe ability to predict the ultimate outcome of any legal proceeding involves judgments, estimates and inherent uncertainties. The actual outcome of these matters could differ materially from management’s estimates.\n102\nTable of Contents\nWESTERN DIGITAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS — (Continued)\nNote 18.    \nQuarterly Results of Operations (unaudited)\nAs discussed in Note 1, as a result of the Separation, the historical net income (loss) of Sandisk is reported in the Company’s consolidated financial statements as discontinued operations. \nThe below provides unaudited summarized quarterly financial information on this basis to allow for a meaningful comparison of continuing operations:\nFirst\nSecond\nThird\nFourth\n(in millions, except per share amounts)\n2025\nRevenue, net\n$\n2,212\n \n$\n2,409\n \n$\n2,294\n \n$\n2,605\n \nGross profit\n806\n \n907\n \n912\n \n1,067\n \nNet income from continuing operations\n153\n \n466\n \n772\n \n252\n \nNet income\n493\n \n594\n \n520\n \n282\n \nNet income per common share:\nContinuing operations - basic\n$\n0.43\n \n$\n1.32\n \n$\n2.17\n \n$\n0.70\n \nEarnings per common share - basic\n1.40\n \n1.68\n \n1.46\n \n0.78\n \nContinuing operations - diluted\n0.42\n \n1.28\n \n2.11\n \n0.67\n \nEarnings per common share - diluted\n1.35\n \n1.63\n \n1.42\n \n0.75\n \nFirst\nSecond\nThird\nFourth\n(in millions, except per share amounts)\n2024\nRevenue, net\n$\n1,194\n \n$\n1,367\n \n$\n1,752\n \n$\n2,004\n \nGross profit\n244\n \n313\n \n519\n \n697\n \nNet income (loss) from continuing operations\n(\n365\n)\n(\n146\n)\n(\n8\n)\n(\n246\n)\nNet income (loss)\n(\n685\n)\n(\n287\n)\n135\n \n39\n \nNet income (loss) per common share:\nContinuing operations - basic\n$\n(\n1.18\n)\n$\n(\n0.49\n)\n$\n(\n0.07\n)\n$\n(\n0.77\n)\nEarnings (loss) per common share - basic\n(\n2.17\n)\n(\n0.92\n)\n0.35\n \n0.08\n \nContinuing operations - diluted\n(\n1.18\n)\n(\n0.49\n)\n(\n0.07\n)\n(\n0.77\n)\nEarnings (loss) per common share - diluted\n(\n2.17\n)\n(\n0.92\n)\n0.35\n \n0.08\n \n103\nTable of Contents\nItem 9.\n    \nChanges in and Disagreements With Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A.\n    \nControls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs required by Rule 13a‑15(b) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), we carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures (as such term is defined in Rule 13a-15(e) under the Exchange Act) as of the end of the period covered by this Annual Report on Form 10‑K.\nBased on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of the end of the period covered by this Annual Report on Form 10‑K, our disclosure controls and procedures were effective.\nManagement’s Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a‑15(f) and 15d‑15(f) of the Exchange Act) to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that the transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and our directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nOur management evaluated the effectiveness of our internal control over financial reporting using the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in \nInternal Control – Integrated Framework (2013).\n Based on this evaluation, our management concluded that our internal control over financial reporting was effective as of the end of the period covered by this Annual Report on Form 10‑K. KPMG LLP, our independent registered public accounting firm, which audited the Consolidated Financial Statements included in this Annual Report on Form 10-K, has issued an audit report on our internal control over financial reporting. See Report of Independent Registered Public Accounting Firm herein.\nChanges in Internal Control over Financial Reporting\nThere has been no change in our internal control over financial reporting during the quarter ended June 27, 2025, that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nInherent Limitations of Effectiveness of Controls\nOur management, including our Chief Executive Officer and our Chief Financial Officer, does not expect our internal controls over financial reporting will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the benefits of controls must be considered relative to their costs. Because of the inherent limitations in a system of internal control over financial reporting, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the control. The design of any system of controls is also based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\n104\nTable of Contents\nItem 9B.\n    \nOther Information\nInsider Trading Arrangements\nDuring the quarter ended June 27, 2025, the following officers (as defined in Rule 16a-1(f) of the Exchange Act) adopted trading arrangements for the purchase or sale of securities that are intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) of the Exchange Act (“Rule 10b5-1 Plan”):\n•\nIrving Tan\n, \nChief Executive Officer\n of the Company \nadopted\n a Rule 10b5-1 Plan on \nMay 12, 2025\n. Under this plan, up to an aggregate of \n80,000\n shares of the Company’s common stock may be sold before the plan expires on \nMay 26, 2026\n.\n•\nCynthia Tregillis\n, \nExecutive Vice President, Chief Legal Officer and Secretary\n of the Company, \nadopted\n a Rule 10b5-1 Plan on \nMay 23, 2025\n. Under this plan, up to an aggregate of \n17,502\n shares of the Company’s common stock may be sold before the plan expires on \nMay 26, 2026\n.\nItem 9C.\n    Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n105\nTable of Contents\nPART III\nItem 10.\n    \nDirectors, Executive Officers and Corporate Governance\nThere is incorporated herein by reference to the information required by this Item included in the Company’s Proxy Statement for the 2025 Annual Meeting of Stockholders, which we intend to file with the Securities and Exchange Commission (the “SEC”) no later than 120 days after the close of the year ended June 27, 2025. In addition, our Board of Directors has adopted a Code of Business Ethics that applies to all of our directors, employees and officers, including our Chief Executive Officer and Chief Financial Officer. The current version of the Code of Business Ethics is available on our website under the Corporate Governance section at \nwww.westerndigital.com\n. To the extent required by rules adopted by the SEC and The Nasdaq Stock Market LLC, we intend to promptly disclose future amendments to certain provisions of the Code of Business Ethics, or waivers of such provisions granted to executive officers and directors, on our website under the Corporate Governance section at \nwww.westerndigital.com\n.\nItem 11.\n    \nExecutive Compensation\nThere is incorporated herein by reference to the information required by this Item included in the Company’s Proxy Statement for the 2025 Annual Meeting of Stockholders, which we intend to file with the SEC no later than 120 days after the close of the year ended June 27, 2025.\nItem 12.\n    \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThere is incorporated herein by reference to the information required by this Item included in the Company’s Proxy Statement for the 2025 Annual Meeting of Stockholders, which we intend to file with the SEC no later than 120 days after the close of the year ended June 27, 2025.\nItem 13.\n    \nCertain Relationships and Related Transactions, and Director Independence\nThere is incorporated herein by reference to the information required by this Item included in the Company’s Proxy Statement for the 2025 Annual Meeting of Stockholders, which we intend to file with the SEC no later than 120 days after the close of the year ended June 27, 2025.\nItem 14.\n    \nPrincipal Accountant Fees and Services\nThere is incorporated herein by reference to the information required by this Item included in the Company’s Proxy Statement for the 2025 Annual Meeting of Stockholders, which we intend to file with the SEC no later than 120 days after the close of the year ended June 27, 2025.\n106\nTable of Contents\nPART IV \nItem 15.\n    \nExhibits and Financial Statement Schedules\nThe following documents are filed as a part of this Annual Report on Form 10‑K:\n(1)\nFinancial Statements.\n The financial statements included in Part II, Item 8 of this document are filed as part of this Annual Report on Form 10‑K.\n(2)\nFinancial Statement Schedules.\n \nAll schedules are omitted as the required information is immaterial, inapplicable or the information is presented in the Consolidated Financial Statements or related Notes.\n(3)\nExhibits.\n The exhibits listed in the Exhibit Index below are filed with, or incorporated by reference in, this Annual Report on Form 10‑K, as specified in the Exhibit List, from exhibits previously filed with the SEC. Certain agreements listed in the Exhibit List that we have filed or incorporated by reference may contain representations and warranties by us or our subsidiaries. These representations and warranties have been made solely for the benefit of the other party or parties to such agreements and (i) may have been qualified by disclosures made to such other party or parties, (ii) were made only as of the date of such agreements or such other date(s) as may be specified in such agreements and are subject to more recent developments, which may not be fully reflected in our public disclosures, (iii) may reflect the allocation of risk among the parties to such agreements and (iv) may apply materiality standards different from what may be viewed as material to investors. Accordingly, these representations and warranties may not describe the actual state of affairs at the date hereof and should not be relied upon.\n107\nTable of Contents\nEXHIBIT INDEX \nExhibit\nNumber\nDescription\n2.1\nSeparation and Distribution Agreement, dated as of February 21, 2025, by and between Western Digital Corporation and Sandisk Corporation (incorporated by reference to Exhibit 2.1 of the Current Report on Form 8-K filed by the Company on February 24, 2025)#\n3.1\nAmended and Restated Certificate of Incorporation of Western Digital Corporation, as amended to date (incorporated by reference to Exhibit 3.1 to the Annual Report on Form 10-K filed by the Company on August 20, 2024)\n3.2\nCertificate of Designations, Preferences and Rights of Series A Convertible Perpetual Preferred Stock (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K filed by the Company on February 1, 2023)\n3.3\nAmended and Restated Bylaws of Western Digital Corporation, as amended effective as of March 13, 2025 (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K filed by the Company on March 13, 2025)\n4\n.1\nDescription of Western Digital Corporation’s Capital Stock (incorporated by reference to Exhibit 4.1 to the Annual Report on Form 10-K filed by the Company on August 20, 2024)\n4\n.2\nIndenture (including Form of 4.750% Senior Notes due 2026), dated as of February 13, 2018, among Western Digital Corporation, HGST, Inc., WD Media, LLC, Western Digital (Fremont), LLC and Western Digital Technologies, Inc., as guarantors; and U.S. Bank National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K filed by the Company on February 13, 2018)\n4\n.3\nFirst Supplemental Indenture, dated as of June 20, 2023, by and among Western Digital Technologies, Inc. and U.S. Bank Trust Company, National Association, as trustee (incorporated by reference to Exhibit 10.8 to the Current Report on Form 8-K filed by the Company on June 21, 2023)\n4\n.4\nSecond Supplemental Indenture, dated as of April 26, 2024, between Western Digital Corporation, SanDisk Corporation, SanDisk Technologies, Inc., and U.S. Bank Trust Company, National Association, as successor in interest to U.S. Bank National Association, as trustee (incorporated by reference to Exhibit 4.4 to the Annual Report on Form 10-K filed by the Company on August 20, 2024)\n4\n.5\nIndenture, dated as of December 10, 2021, between Western Digital Corporation and U.S. Bank National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K filed by the Company on December 10, 2021)\n4\n.6\nFirst Supplemental Indenture (including Form of 2.850% Senior Notes due 2029 and Form of 3.100% Senior Notes due 2032), dated as of December 10, 2021, between Western Digital Corporation and U.S. Bank National Association, as trustee (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by the Company on December 10, 2021)\n4\n.7\nIndenture (including Form of 3.00% Convertible Senior Notes due 2028), dated as of November 3, 2023 (the “Indenture”), among (i) Western Digital Corporation, (ii) Western Digital Technologies, Inc., as guarantor, and (iii) U.S. Bank Trust Company, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K the Securities and Exchange Commission on November 3, 2023)\n4\n.8\nFirst Supplemental Indenture, dated as of April 26, 2024, between (i) Western Digital Corporation, (ii) SanDisk Corporation, (iii) SanDisk Technologies, Inc., and (iv) U.S. Bank Trust Company, National Association, as trustee (incorporated by reference to Exhibit 4.8 to the Annual Report on Form 10-K filed by the Company on August 20, 2024)\n1\n0.1\nRestatement Agreement, dated January 7, 2022, by and among Western Digital Corporation, JPMorgan Chase Bank, N.A., as administrative agent, and the lenders party thereto (incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q filed by the Company on May 4, 2022)\n10.1.1\nAmendment No. 1, dated as of December 23, 2022, to the Amended and Restated Loan Agreement, dated as of January 7, 2022, by and among Western Digital Corporation, each lender party thereto, J.P. Morgan Chase Bank, N.A. as Administrative Agent and the other parties thereto (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by the Company on December 23, 2022)\n10.1.2\nAmendment No. 2, dated as of June 20, 2023, to the Amended and Restated Loan Agreement, dated as of January 7, 2022, by and among Western Digital Corporation, each lender party thereto, J.P. Morgan Chase Bank, N.A. as Administrative Agent and the other parties thereto (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by the Company on June 21, 2023)\n10.1.3\nAmendment No. 3, dated as of June 11, 2024, to the Amended and Restated Loan Agreement dated as of January 7, 2022, by and among Western Digital Corporation, each lender party thereto, J.P. Morgan Chase Bank, N.A. as Administrative Agent and the other parties thereto (incorporated by reference to Exhibit 10.16(3) to the Annual Report on Form 10-K filed by the Company on August 20, 2024)\n10.1.4\nAmendment No. 4, dated as of February 20, 2025, to the Amended and Restated Loan Agreement, dated as of January 7, 2022, by and among Western Digital Corporation, JPMorgan Chase Bank, N.A., as administrative agent and the lenders party thereto (incorporated by reference to Exhibit 10.7 to the Current Report on Form 8-K filed by the Company on February 24, 2025)#\n10.1.5\nAmendment No. 5, dated as of May 21, 2025, to the Amended and Restated Loan Agreement, dated as of January 7, 2022, by and among Western Digital Corporation, JPMorgan Chase Bank, N.A., as administrative agent and the lenders party thereto†\n1\n0.2\nGuaranty, dated as of June 20, 2023, by and among Western Digital Corporation, Western Digital Technologies, Inc. and JPMorgan Chase Bank, N.A. as Administrative Agent (incorporated by reference to Exhibit 10.4 to the Current Report on Form 8-K filed by the Company on June 21, 2023)\n108\nTable of Contents\nExhibit\nNumber\nDescription\n10.2.1\nAssumption and Supplement to Guaranty Agreement, dated as of April 26, 2024, made by each of (i) SanDisk Technologies, Inc. and (ii) SanDisk Corporation (incorporated by reference to Exhibit 10.17(1) to the Annual Report on Form 10-K filed by the Company on August 20, 2024)\n1\n0.3\nSecurity Agreement, dated as of June 20, 2023, by and among Western Digital Corporation, Western Digital Technologies, Inc and JPMorgan Chase Bank, N.A. as collateral agent (incorporated by reference to Exhibit 10.6 to the Current Report on Form 8-K filed by the Company on June 21, 2023)\n10.3.1\nAssumption and Supplemental Security Agreement, dated as of April 26, 2024, from SanDisk Corporation and SanDisk Technologies, Inc. to JPMorgan Chase Bank, N.A., as collateral agent (incorporated by reference to Exhibit 10.18(1) to the Annual Report on Form 10-K filed by the Company on August 20, 2024)\n1\n0.4\nForm of Confirmation for Capped Call Transactions (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by the Company on November 3, 2023)\n10.5\nAmended and Restated Letter Agreement, dated January 31, 2023, by and between Western Digital Corporation and Elliott Investment Management L.P. (incorporated by reference to Exhibit 10.4 to the Current Report on Form 8-K filed by the Company on February 1, 2023)\n1\n0.6\nInvestment Agreement, dated January 31, 2023, by and among Western Digital Corporation, Elliott Associates, L.P. and Elliott International, L.P. (incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q filed by the Company on May 10, 2023)\n1\n0.7\nTransition Services Agreement, dated as of February 21, 2025, by and between Western Digital Corporation and Sandisk Corporation (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by the Company on February 24, 2025)#\n1\n0.8\nTax Matters Agreement, dated as of February 21, 2025, by and between Western Digital Corporation and Sandisk Corporation (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K filed by the Company on February 24, 2025)#\n1\n0.9\nEmployee Matters Agreement, dated as of February 21, 2025, by and between Western Digital Corporation and Sandisk Corporation (incorporated by reference to Exhibit 10.3 to the Current Report on Form 8-K filed by the Company on February 24, 2025)#\n1\n0.10\nIntellectual Property Cross-License Agreement, dated as of February 21, 2025, by and between Western Digital Corporation and Sandisk Corporation (incorporated by reference to Exhibit 10.4 to the Current Report on Form 8-K filed by the Company on February 24, 2025)#\n1\n0.11\nTransitional Trademark License Agreement, dated as of February 21, 2025, by and between Western Digital Corporation and Sandisk Corporation (incorporated by reference to Exhibit 10.5 to the Current Report on Form 8-K filed by the Company on February 24, 2025)#\n1\n0.12\nStockholder’s and Registration Rights Agreement, dated as of February 21, 2025, by and between Western Digital Corporation and Sandisk Corporation (incorporated by reference to Exhibit 10.6 to the Current Report on Form 8-K filed by the Company on February 24, 2025)#\n1\n0.13\nWestern Digital Corporation Amended and Restated 2017 Performance Incentive Plan, amended and restated as of August 11, 2020 (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q filed by the Company on February 9, 2021)**\n10.13.1\nForm of Notice of Grant of Restricted Stock Units and Restricted Stock Unit Award Agreement – Vice President and Above, under the Amended and Restated Western Digital Corporation 2017 Performance Incentive Plan (incorporated by reference to Exhibit 10.4 to the Quarterly Report on Form 10-Q filed by the Company on February 9, 2021)**\n10.14\nWestern Digital Corporation Amended and Restated 2021 Long-Term Incentive Plan, amended and restated as of May 28, 2025 (incorporated by reference to Exhibit 4.1 to the Registration Statement on Form S-8 filed by the Company on June 4, 2025)**\n10.14.1\nForm of Notice of Grant of Performance Stock Units and Performance Stock Unit Award Agreement under the Western Digital Corporation 2021 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q filed by the Company on November 2, 2022)**\n10.14.2\nForm of Grant Notice for Performance Stock Unit Award under the Western Digital Corporation 2021 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q filed by the Company on November 7, 2023)**\n10.14.3\nForm of Grant Notice for Restricted Stock Unit Award – Vice President and Above, under the Western Digital Corporation 2021 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.4 to the Quarterly Report on Form 10-Q filed by the Company on February 3, 2022)**\n10.14.4\nForm of Grant Notice for Restricted Stock Unit Award – Vice President and Above, under the Western Digital Corporation Amended and Restated 2021 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.2(3) to the Annual Report on Form 10-K filed by the Company on August 22, 2023)**\n10.14.5\nForm of Grant Notice for Restricted Stock Unit Award – Vice President and Above, under the Western Digital Corporation Amended and Restated 2021 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q filed by the Company on October 31, 2024)**\n109\nTable of Contents\nExhibit\nNumber\nDescription\n10.14.6\nWestern Digital Corporation Amended and Restated 2021 Long-Term Incentive Plan Non-Employee Director Restricted Stock Unit Grant Program, amended and restated as of May 23, 2023 (incorporated by reference to Exhibit 10.2(4) to the Annual Report on Form 10-K filed by the Company on August 22, 2023)**\n10.15\nWestern Digital Corporation Executive Short-Term Incentive Plan (supersedes the Western Digital Corporation Executive Short-Term Incentive Plan dated August 7, 2019), dated February 9, 2021 (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10‑Q filed by the Company on May 6, 2021)**\n10.16\nWestern Digital Corporation Amended and Restated 2005 Employee Stock Purchase Plan, amended and restated as of May 28, 2025 (incorporated by reference to Exhibit 4.2 to the Registration Statement on Form S-8 filed by the Company on June 4, 2025)**\n10.17\nWestern Digital Corporation Deferred Compensation Plan, amended and restated effective January 1, 2013 (incorporated by reference to Exhibit 10.4 to the Quarterly Report on Form 10-Q filed by the Company on November 2, 2012)**\n10.17.1\nAmendment No. 1, effective December 1, 2024, to the Western Digital Corporation Deferred Compensation Plan, amended and restated effective January 1, 2013 (incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q filed by the Company on January 31, 2025)**\n10.18\nWestern Digital Corporation Amended and Restated Change in Control Severance Plan, amended and restated as of March 13, 2025 (incorporated by reference to Exhibit 10.9 to the Quarterly Report on Form 10-Q filed by the Company on May 2, 2025)**\n10.19\nWestern Digital Corporation Amended and Restated Executive Severance Plan, amended and restated as of May 24, 2021 (incorporated by reference to Exhibit 10.7 to the Annual Report on Form 10-K filed by the Company on August 27, 2021)**\n10.20\nForm of Indemnification Agreement for Directors and Officers of Western Digital Corporation (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by the Company on January 30, 2025)**\n10.21\nOffer Letter, dated as of February 11, 2025, to Irving Tan (incorporated by reference to Exhibit 10.10 to the Quarterly Report on Form 10-Q filed by the Company on May 2, 2025)**\n10.22\nOffer Letter, dated as of May 1 2025, to Kris Sennesael†**\n10.23\nAmended and Restated Offer Letter, dated as of April 18, 2025, to Ahmed Shihab (incorporated by reference to Exhibit 10.11 to the Quarterly Report on Form 10-Q filed by the Company on May 2, 2025)**\n1\n9.1\nPolicy Regarding Insider Trading and Unauthorized Disclosures (incorporated by reference to Exhibit 19.1 to the Annual Report on Form 10-K filed by the Company on August 20, 2024)\n2\n1\nSubsidiaries of Western Digital Corporation†\n2\n3\nConsent of Independent Registered Public Accounting Firm†\n3\n1.1\nCertification of Principal Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002†\n3\n1.2\nCertification of Principal Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002†\n3\n2.1\nCertification of Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002*\n3\n2.2\nCertification of Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002*\n9\n7.1\nWestern Digital Corporation Compensation Recovery (Clawback) Policy (incorporated by reference to Exhibit 97.1 to the Annual Report on Form 10-K filed by the Company on August 20, 2024)\n101.INS\nXBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH\nXBRL Taxonomy Extension Schema Document†\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document†\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document†\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document†\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document†\n104\nCover Page Interactive Data File - formatted in Inline XBRL and contained in Exhibit 101\n†\n \nFiled with this report.\n*\n \nFurnished with this report.\n**\n \nManagement contract or compensatory plan or arrangement required to be filed as an exhibit pursuant to applicable rules of the Securities and Exchange Commission.\n#\n \nSchedules and exhibits have been omitted pursuant to Item 601(a)(5) of Regulation S-K. The Registrant agrees to furnish supplementally a copy of any omitted schedule or exhibit to the U.S. Securities and Exchange Commission upon request.\n110\nTable of Contents\nItem 16.\n    \nForm 10-K Summary\nNone.\n111\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Annual Report on Form 10‑K to be signed on its behalf by the undersigned, thereunto duly authorized.\nWESTERN DIGITAL CORPORATION\nBy:\n/s/ Gene Zamiska\nGene Zamiska\nSenior Vice President, Global Accounting and Chief Accounting Officer\n(Principal Accounting Officer and Duly Authorized Officer)\nDated: August 13, 2025\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10‑K has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Irving Tan\nChief Executive Officer, Director\n(Principal Executive Officer)\nAugust 13, 2025\nIrving Tan\n/s/ Kris Sennesael\nExecutive Vice President and Chief Financial Officer\n(Principal Financial Officer)\nAugust 13, 2025\nKris Sennesael\n/s/ Gene Zamiska\nSenior Vice President, Global Accounting and Chief Accounting Officer\n(Principal Accounting Officer)\nAugust 13, 2025\nGene Zamiska\n/s/ Martin I. Cole\nChair of the Board\nAugust 13, 2025\nMartin I. Cole\n/s/ Kimberly E. Alexy\nDirector\nAugust 13, 2025\nKimberly E. Alexy\n/s/ Tunҫ Doluca\nDirector\nAugust 13, 2025\nTunҫ Doluca\n/s/ Bruce Kiddoo\nDirector\nAugust 13, 2025\nBruce Kiddoo\n/s/ Matthew E. Massengill\nDirector\nAugust 13, 2025\nMatthew E. Massengill\n/s/ Roxanne Oulman\nDirector\nAugust 13, 2025\nRoxanne Oulman\n/s/ Stephanie A. Streeter\nDirector\nAugust 13, 2025\nStephanie A. Streeter\n112"
  }
}