{
  "ticker": "WELL",
  "cik": "0000766704",
  "company_name": "WELLTOWER INC.",
  "filing_date": "2025-02-12",
  "accession": "0000766704-25-000009",
  "primary_doc": "well-20241231.htm",
  "item_sections": {
    "item1": "Item 1 - Business - Certain Government Regulations - United States - Reimbursement” above for additional information. Healthcare reimbursement will likely continue to be of paramount importance to federal and state authorities. We cannot make any assessment as to the ultimate timing or effect any future legislative reforms may have on the financial condition of our obligors and properties. There can be no assurance that adequate reimbursement levels will be available for services provided by any property operator or manager, whether the property receives reimbursement from Medicare, Medicaid or private payors. Significant limits on the scope of services reimbursed and on reimbursement rates and fees could have a material adverse effect on an obligor’s liquidity, financial condition and results of operations, which could adversely affect the ability of an obligor to meet its obligations to us. In addition, if a partial or total federal government shutdown were to occur for a prolonged period of time, federal government payment obligations, including its obligations under Medicaid and Medicare, may be delayed. Similarly, if state government shutdowns were to occur, state payment obligations may be delayed. If the federal or state governments fail to make payments under these programs on a timely basis, our business could suffer and our financial position, results of operations or cash flows may be materially affected.\nSince January 1, 2014, the Health Reform Laws have provided those states that expand their Medicaid coverage to otherwise ineligible state residents with incomes at or below 138% of the federal poverty level with an increased federal medical assistance percentage, effective January 1, 2014, when certain conditions are met. The federal government substantially funds the Medicaid expansion and as of December 2024, the number of states implementing expansion has grown to more than 80% of all states. The participation by states in the Medicaid expansion could have the dual effect of increasing our tenants’ revenues, through new patients, but further straining state budgets and their ability to pay our tenants. \nHealth reform measures could be implemented as a result of political, legislative, regulatory and administrative developments and judicial proceedings. Further the impact that the results of the 2024 Presidential and Congressional elections and potential subsequent developments may have on health reform (including through new legislative, executive or regulatory efforts) remains uncertain, and any changes will likely take time to unfold and could have an impact on coverage and reimbursement for healthcare items and services covered by plans that were authorized by the Health Reform Laws. If the operations, cash flows \n35\nor financial condition of our operators, managers and tenants are materially adversely impacted by the Health Reform Laws or future legislation, our revenue and operations may be adversely affected as well. More generally, and because of the dynamic nature of the legislative and regulatory environment for healthcare products and services, and in light of existing federal deficit and budgetary concerns, we cannot predict the impact that broad-based, far-reaching legislative or regulatory changes could have on the U.S. economy, our business or that of our operators and tenants. \nIf controls imposed on certain of our tenants who provide healthcare services that are reimbursed by Medicare, Medicaid and other third-party payors to reduce admissions and length of stay affect inpatient volumes at our healthcare facilities, the financial condition or results of operations of those tenants could be adversely affected\nControls imposed by Medicare, Medicaid and commercial third-party payors designed to reduce admissions and lengths of stay, commonly referred to as “utilization reviews,” have affected and are expected to continue to affect certain of our healthcare facilities, specifically our acute care hospitals and post-acute facilities. Utilization review entails the review of the admission and course of treatment of a patient by managed care plans. Inpatient utilization, average lengths of stay and occupancy rates continue to be negatively affected by payor-required pre-admission authorization and utilization review and by payor pressures to maximize outpatient and alternative healthcare delivery services for less acutely ill patients. Efforts to impose more stringent cost controls and reductions are expected to continue, which could negatively impact the financial condition of our tenants who provide healthcare services in our hospitals and post-acute facilities. If so, this could adversely affect these tenants’ ability and willingness to comply with the terms of their leases with us and/or renew those leases upon expiration, which could have a material adverse effect on us.\nOur operators’, managers' or tenants’ failure to comply with federal, state, province, local and industry-regulated licensure, certification and inspection laws, regulations and standards could adversely affect such operators’, managers' or tenants’ operations, which could adversely affect their ability to meet their obligations to us\n \nOur operators, managers and tenants generally are subject to or impacted by varying levels of federal, state, local and industry-regulated licensure, certification and inspection laws, regulations and standards. These laws and regulations include, among others: laws protecting consumers against deceptive practices; laws relating to the operation of our facilities and how our operators, managers and tenants conduct their business, such as fire, health and safety, data security and privacy laws; federal and state laws affecting hospitals, clinics and other healthcare communities that participate in both Medicare and Medicaid that specify reimbursement rates, pricing, reimbursement procedures and limitations, quality of services and care, background checks, food service and physical plants and similar foreign laws regulating the healthcare industry; resident rights laws (including abuse and neglect laws) and fraud laws; anti-kickback and physician referral laws; the Americans with Disabilities Act of 1990 and similar state and local laws; and safety and health standards set by the Occupational Safety and Health Administration or similar foreign agencies. Our operators’, managers' or tenants’ failure to comply with any of these laws, regulations or standards could result in loss of accreditation, denial of reimbursement, imposition of fines, suspension, decertification or exclusion from federal and state healthcare programs, civil liability and in certain limited instances, criminal penalties, material restrictions on or loss of license, closure of the facility and/or the incurrence of considerable costs arising from an investigation or regulatory action. Such actions may have an effect on our operators’, managers' or tenants’ ability to make lease payments to us and, therefore, adversely impact us. In addition, we may be directly subject to these laws, regulations and standards, as well as potential investigation or enforcement and liability, as a result of our RIDEA-structured arrangements and certain other arrangements, we may pursue with healthcare entities who are directly subject to these laws. See “Item 1 - Business - Certain Government Regulations - United States - Fraud & Abuse Enforcement” and “Item 1 - Business - Certain Government Regulations - United States - Healthcare Matters - Generally” above.\nMany of our properties may require a license, registration and/or CON to operate. Failure to obtain a license, registration or CON, or loss of a required license, registration or CON would prevent a facility from operating in the manner intended by the operators, managers or tenants. These events could materially adversely affect our operators’, managers' or tenants’ ability to make a profit or our operators', managers' or tenants' ability to make rent or other obligatory payments to us. State and local laws also may regulate the expansion, including the addition of new beds or services or acquisition of medical equipment, and the construction or renovation of healthcare facilities, by requiring a CON or other similar approval from a state agency. See “Item 1 — Business — Certain Government Regulations — United States — Licensing and Certification” above. \nIn addition, we cannot assure you that future changes in government regulation will not adversely affect the healthcare industry, including our operators, managers or tenants, nor can we be certain that our operators, managers or tenants will achieve and maintain occupancy and rate levels or labor cost levels that will enable them to satisfy their obligations to us.\nUnfavorable resolution of pending and future litigation matters and disputes could have a material adverse effect on our financial condition\nFrom time to time, we are directly involved or named as a party in legal proceedings, lawsuits and other claims that involve class actions, disputes regarding property damage, care matters and other issues. We also are named as defendants in lawsuits allegedly arising out of our actions or the actions of our operators, tenants or managers in which such operators, tenants or managers have agreed to indemnify, defend and hold us harmless from and against various claims, litigation and liabilities arising in connection with their respective businesses. Employment related class action lawsuits have increased in recent years, including class action lawsuits brought against our operators and managers in certain states regarding employee and \n36\ngovernment requirements concerning wage and hour claims and fair housing complaints, as well as class action lawsuits related to staffing and care. There can be no assurance that we will be able to prevail in, or achieve a favorable settlement of, pending or future litigation. In addition, pending litigation or future litigation, government proceedings or environmental matters could lead to increased costs or interruption of our normal business operations. An unfavorable resolution of pending or future litigation or legal proceedings may have a material adverse effect on our business, results of operations and financial condition. Regardless of its outcome, litigation may result in substantial costs and expenses, significantly divert the attention of management and could damage our reputation and our brand. In addition, any such resolution could involve our agreement to terms that restrict the operation of our business. We cannot guarantee losses incurred in connection with any current or future legal or regulatory proceedings or actions will not exceed any provisions we may have set aside in respect of such proceedings or actions or will not exceed any available insurance coverage.\nDevelopment, redevelopment and construction risks could affect our profitability\nWe invest in various development and redevelopment projects. In deciding whether to acquire, develop or redevelop a particular property, we make assumptions regarding the expected future performance of that property. In particular, we estimate the return on our investment based on expected construction costs, lease up velocity, occupancy, rental rates, operating expenses, capital costs and future competition. If our financial projections with respect to a new property are inaccurate, the property may fail to perform as we expected in analyzing our investment. Our estimate of the costs of repositioning or redeveloping an acquired property may prove to be inaccurate, which may result in our failure to meet our profitability goals.  \nOur development, redevelopment and construction projects are vulnerable to the impact, and have been impacted by, material shortages, labor rates, price volatility and inflation. For example, shortages and fluctuations in the price of lumber, electrical equipment or in other important raw materials have resulted in and could continue to result in delays in the start or completion of, or increase the cost of, developing one or more of our projects. Pricing for labor and raw materials can be affected by various national, regional, local, economic and political factors, including changes to immigration laws that impact the availability of labor or tariffs on imported construction materials. These macroeconomic trends have been, and may continue to be, exacerbated by supply chain disruptions, fluctuations in interest rates, the conflicts between Russia and Ukraine and in the Middle East and other international and domestic events impacting the macroeconomic environment. Additional conditions and risks affecting our development, redevelopment and construction projects include: (i) liability if our communities are not constructed in compliance with the accessibility provisions of the Americans with Disabilities Acts, the Fair Housing Act or other federal, state or local requirements, which noncompliance could result in imposition of fines, an award of damage to private litigants and a requirement that we undertake structural modifications to remedy the noncompliance; (ii) cost overruns, especially in the current geopolitical transition environment regarding tariffs, and untimely completion of construction (including risks beyond our control, such as weather or labor conditions, material shortages or supply chain delays); (iii) the potential for fluctuation of occupancy rates and rents at redeveloped properties, which may result in our investment not being profitable; (iv) the potential that we may expend funds and management time, or fail to recover expenses already incurred, if we do not complete projects already started or abandon development or redevelopment opportunities after we begin to explore them; (v) the inability to complete leasing of a property on schedule or at all, resulting in an increase in carrying or development or redevelopment costs; (vi) the possibility that properties will be leased at below expected rental rates, (vii) to the extent the development or redevelopment activities are conducted in partnership with third parties, the possibility of disputes with our joint venture partners and the potential that we miss certain project management deadlines and (ix) changing technologies and cultural trends that may negatively impact future demand for our properties.  \nIn connection with our renovation, redevelopment, development and related construction activities, we may be unable to obtain, or suffer delays in obtaining, necessary zoning, land-use, building, occupancy and other required governmental permits and authorizations, or satisfactory tax rates, incentives or abatements. Operators or managers of new facilities we construct may need to obtain Medicare and Medicaid certification and enter into Medicare and Medicaid provider agreements and/or third-party payor contracts. In the event that the operator or manager is unable to obtain the necessary licensure, certification, provider agreements or contracts after the completion of construction, there is a risk that we will not be able to earn any revenues on the facility until either the initial operator obtains a license or certification to operate the new facility and the necessary provider agreements or contracts, or we find and contract with a new operator or manager that is able to obtain a license to operate the facility for its intended use and the necessary provider agreements or contracts. We have experienced such delays in obtaining necessary licensing for constructed properties and may experience additional or more significant delays in the future.\nWe rely on our development managers, general contractors and subcontractors to oversee and manage day-to-day construction activities. If any such party underperforms or experiences financial or other problems during the construction process, we could experience significant delays, increased costs to complete the project and/or other negative impacts to our expected returns and may need to exercise contractual remedies against such party, which may include termination of the applicable underlying service contract. In the event such termination occurs mid-construction, we would likely need to engage a new service provider, which could result in additional costs and delays as the transition between providers occurs.\n37\nThe above-described factors could result in increased costs or our abandonment of these projects. In addition, we may abandon opportunities we have begun to investigate, for a range of reasons, including changes in expected financing or construction costs, adverse changes in expected rents or expenses, adverse environmental and/or geotechnical findings, conditions to zoning approval, legal and regulatory hurdles, including moratoriums on development and redevelopment activities, changes in market and economic conditions, natural disasters and other catastrophic events, damage, vandalism or accidents, higher requirements for capital improvements, decreased demand due to competition or other market and economic conditions or defects that we do not discover through the inspection processes, which would result in additional expenses beyond those originally expected. In addition, we may not be able to obtain financing on favorable terms, or at all, which may render us unable to proceed with our development activities. We may not be able to complete construction and lease-up of a property on budget and on schedule, which could result in increased debt service expense or construction costs. Additionally, the time frame required for development, construction and lease-up of these properties means that we may have to wait years for significant cash returns. Because we are required to make cash distributions to our stockholders, if the cash flow from operations or refinancing is not sufficient, we may be forced to borrow additional money to fund such distributions. Newly developed and acquired properties may not produce the cash flow that we expect, which could adversely affect our overall financial performance. \nBank failures or other events affecting financial institutions could have a material adverse effect on our and our operators' and tenants' liquidity, results of operations and financial condition\nThe failure of a bank, or events involving limited liquidity, defaults, non-performance, or other adverse conditions in the financial or credit markets impacting financial institutions, or concerns or rumors about such events, may adversely impact us, either directly or through an adverse impact on our tenants, operators and borrowers. A bank failure or other event affecting financial institutions could lead to disruptions in our or our tenants', operators' and borrowers' access to bank deposits or borrowing capacity, including access to letters of credit from certain of our tenants relating to lease obligations. In addition, our or our tenants', operators' and borrowers' deposits in excess of the Federal Deposit Insurance Corporation limits may not be backstopped by the U.S. government, and banks or financial institutions with which we or our tenants, operators and borrowers do business may be unable to obtain needed liquidity from other banks, government institutions or by acquisition in the event of a failure or liquidity crisis. Any adverse effects to our tenants', operators' or borrowers' liquidity or financial performance could affect their ability to meet their financial and other contractual obligations to us, which could have a material adverse effect on our business, results of operations and financial condition.\nWe may experience losses caused by severe weather conditions, natural disasters or the physical effects of climate change, which could result in an increase of our or our tenants’ cost of insurance, unanticipated costs associated with evacuation, a decrease in our anticipated revenues or a significant loss of the capital we have invested in a property\n \nA large number of our properties are located in areas particularly susceptible to revenue loss, cost increase or damage caused by severe weather conditions or natural disasters such as hurricanes, wildfires, freeze events in warmer climates, earthquakes, tornadoes and floods, as well as the effects of climate change. For example, in 2024, various parts of the U.S. and our portfolio were impacted by Hurricanes Beryl, Debby, Helene and Milton, as well as from wildfires in a number of geographies, among other events, including one of our properties which suffered severe damage.\nWhile we believe, given current industry practice and analysis prepared by outside consultants, that our and our tenants’ insurance coverage is appropriate to cover reasonably anticipated losses that may be caused by hurricanes, wildfires, freeze events, earthquakes, tornadoes, floods, wildfires and other severe weather conditions and natural disasters, including the effects of climate change. We are always subject to the risk that such insurance will not fully cover all losses and depending on the severity of the event and the impact on our properties, such insurance may not cover a significant portion of the losses including the costs associated with evacuation. Moreover, an increase in volatility and difficulty predicting adverse weather events, such as the changes in tornado patterns in recent years, may result in additional losses. Intensifying natural disasters, climate change and extreme weather events, coupled with the current economic climate, have directly affected the availability of insurance premiums, deductibles and the capacity insurers are willing to underwrite. These factors may lead to an increase of our and our operators' or tenants’ cost of insurance, a decrease in our anticipated revenues from an affected property and a loss of all or a portion of the capital we have invested in an affected property. In addition, we or our tenants may not purchase insurance under certain circumstances if the cost of insurance exceeds, in our or our operators' or tenants’ judgment, the value of the coverage relative to the risk of loss, and as a result, we may determine to self-insure more of our exposure, absorb more below deductible losses and look for alternative means of risk transfer.\n \nAlso, changes in federal and state legislation and regulation relating to climate change could result in increased capital expenditures to improve the energy efficiency and resiliency of our existing properties and could also necessitate us to spend more on our new development properties without a corresponding increase in revenue.\nTo the extent that significant changes in the climate occur in areas where our communities are located, we may experience extreme weather and changes in precipitation and temperature, all of which may result in physical damage to or a decrease in demand for properties located in these areas or affected by these conditions. Weather events also have indirect effects on our business by increasing the cost of energy and maintenance at our properties. Should the impact of climate change be material, including significant property damage to or destruction of our communities, or occur for lengthy periods of time, our financial \n38\ncondition or results of operations may be adversely affected. In addition, changes in federal, state and local legislation and regulation based on concerns about climate change could result in increased capital expenditures on our existing properties and our new development properties without a corresponding increase in revenue, resulting in adverse impacts to our results of operations.\nWe may incur costs to remediate environmental contamination at our properties, which could have an adverse effect on our or our obligors’ business or financial condition\nUnder various laws, owners or operators of real estate may be required to respond to the presence or release of hazardous substances on the property and may be held liable for property damage, personal injuries or penalties that result from environmental contamination or exposure to hazardous substances. These laws often impose liability without regard to whether the owner or operator knew of the release of the substances or caused the release. We may become liable to reimburse the government for damages and costs it incurs in connection with the contamination. Generally, such liability attaches to a person based on the person’s relationship to the property. Our operators, tenants or borrowers are primarily responsible for the condition of the property. Moreover, we review environmental site assessments of the properties that we own or encumber prior to taking an interest in them. Those assessments are designed to meet the “all appropriate inquiry” standard, which we believe qualifies us for the innocent purchaser defense if environmental liabilities arise. Based on such assessments, we do not believe that any of our properties are subject to material environmental contamination. However, environmental liabilities may be present in our properties and we may incur costs to remediate contamination, which could have a material adverse effect on our business or financial condition or the business or financial condition of our obligors.\n \nCybersecurity incidents could disrupt our business and result in the loss of confidential information and legal liability\nOur business is at risk from and may be impacted by cybersecurity incidents, including attempts to gain unauthorized access to our confidential data through social engineering attacks or other malicious activity, attempts to interrupt our access to, or use of information technology systems through distributed denial-of-service or ransomware attacks, data extortion attempts, insider threats, incidents related to our increased receipt and use of data from multiple sources and other cybersecurity incidents within our environment or our business partners' environments, including those resulting from human error, product defects and technology failures. Such cyber incidents can range from individual attempts to gain unauthorized access to our or our business partners' information technology systems to more sophisticated security threats and may be specifically targeted to our business or more general industry wide risks. While we employ a number of measures designed to prevent, detect and mitigate these threats, there is no guarantee such efforts will be successful in preventing or detecting a cybersecurity threat. The cybersecurity threat landscape is rapidly evolving and threat actors may leverage new and evolving technologies, such as AI, previously unknown vulnerabilities to perpetrate attacks, as well as sophisticated anti-forensics techniques to evade detection. We may be unable to anticipate evolving techniques, implement adequate cybersecurity barriers or other preventative measures, mitigate the risks from and recover from a cybersecurity incident without operational impact, and thus it is impossible for us to entirely mitigate this risk. Additionally, the use of AI by us or our business partners may create new cybersecurity vulnerabilities, including those which may not be recognized at the time, and malicious actors may employ AI to aid in launching more sophisticated and effective cybersecurity incidents. We regularly defend against, respond to and mitigate risks from cybersecurity incidents; however, there is no assurance that such impacts will not be material in the future. Cybersecurity incidents could disrupt our or our critical business partners’ business, damage our reputation, cause us to incur significant remediation expense and expose us to legal or regulatory claims or proceedings, including enforcement actions under data privacy or disclosure regulations. We maintain cybersecurity insurance providing coverage for certain costs related to cybersecurity-related incidents that impact our cybersecurity and information technology infrastructure. However, our insurance coverage may not sufficiently cover all types of losses or claims that may arise or be subject to exclusions.\nEvolving privacy regulations could expose our business to reputational harm and losses\nWe are subject to continuously evolving and developing laws and regulations in the U.S. and abroad that concern data privacy and protection, including those related to the collection, storage, handling, use, disclosure, transfer and security of personal data, which have required or may require us to incur additional expenses and may expose us to additional risks. We and our operators and managers are subject to numerous such laws and regulations governing the protection of personal and confidential information of our clients, residents and/or employees, including U.S. federal and state laws (including the California Consumer Privacy Act and HIPAA) and non-U.S. laws, such as the U.K. General Data Protection Regulation (\"GDPR\") and the E.U. GDPR, which impose a number of obligations on us. These obligations vary from state to state and country to country, but generally include accountability and transparency requirements. Some jurisdictions (including the E.U. and U.K.) impose restrictions on transfers of data from their jurisdictions to jurisdictions that they do not consider adequate. This may have implications for our cross-border data flows and may result in additional compliance costs.\nMany jurisdictions assess fines, the magnitude of which may depend on the annual global revenue of the company and the nature, gravity and duration of, the violation. Additionally, in some jurisdictions, data subjects may have a right to compensation for financial or non-financial losses. Complying with these laws may cause us or our operators and managers to incur substantial operational and compliance costs or require us to change our business practices. Despite efforts to bring our practices into compliance with these laws, we or our operators and managers may not be successful either due to internal or external factors such as resource allocation limitations or a lack of cooperation among our business partners. Such laws may be \n39\ninterpreted and applied differently depending on the jurisdiction and continue to evolve, making it difficult to predict how they may develop and apply to us. Non-compliance or alleged non-compliance with laws, contractual agreements or industry standards could result in scrutiny or proceedings against us by governmental entities, regulators, our business partners, residents of our communities, data subjects, suppliers, vendors, or other parties. Further, there is a risk that compliance measures we undertake will not be implemented correctly or that individuals within our business or those of our business partners will not be fully compliant with legal obligations. If there are breaches of these measures, we could face significant administrative and monetary sanctions, as well as reputational damage, which may have a material adverse effect on our operations, financial condition and prospects.\nSustainability-related laws, regulations, commitments and stakeholder expectations impose additional cost and expose us to numerous risks\nInvestors and other stakeholders have become increasingly focused on understanding how companies address a variety of sustainability factors. Investors may consider a company's sustainability-related business practices, commitments, scores and reporting, including the company's disclosures and sustainability rating systems developed by third parties, as they evaluate investment decisions. The criteria used in these rating systems may conflict and change frequently, and we cannot predict how these third parties will score us, nor can we have any assurance that they score us or other companies accurately or that we will be able to score well as such criteria change. We supplement our participation in ratings systems with published disclosures of our sustainability activities, but some investors may desire other disclosures that we do not provide. Failure to participate in certain of the third-party ratings systems, score well in third-party rating systems or provide certain sustainability disclosures could result in reputational harm when investors compare us to other companies, and could cause certain investors to be unwilling to invest in our common stock, which could adversely affect our stock price. We have made, and expect to continue to make, such commitments and disclosures related to sustainability initiatives and goals. Statements related to sustainability goals, targets and objectives reflect our current plans and do not constitute a guarantee that such goals, targets or objectives will be achieved. Our ability to achieve any stated goal, target or objective, including with respect to emissions reduction, is subject to numerous factors and conditions, some of which are outside of our control. Our failure or perceived failure to pursue or fulfill our sustainability goals, targets and objectives, to comply with ethical, environmental or other standards, regulations or expectations, or to satisfy various reporting standards with respect to these matters, within the timelines we announce, or at all, could adversely affect our business or reputation, as well as expose us to government enforcement actions and private litigation.\nIn addition, laws, regulations and standards for tracking and reporting on sustainability matters, including emissions, remain inconsistent and continue to evolve. The adoption of further regulations or changes in investor preferences related to sustainability and similar matters may result in changes to our business practices, including increasing expenses or capital expenditures. Other impacts related to sustainability matters may include the costs of compliance with new or existing regulations, standards or reporting requirements regarding the environmental impacts of our business. Our business may also face increased scrutiny from investors and other stakeholders related to our sustainability activities, including the goals, targets and objectives that we announce, and our methodologies and timelines for pursuing them.\nAt the same time, an increasing number of stakeholders, regulators and lawmakers have expressed or pursued contrary views, legislation and investment expectations with respect to sustainability ratings and commitments, including the enactment or proposal of “anti-ESG” legislation, regulation or policies, which may expose us to additional legal, financial or reputational risks based on our sustainability commitments and disclosures. If our sustainability practices do not meet investor or other stakeholder expectations and standards, which continue to evolve, our reputation, our ability to attract or retain employees and our attractiveness as an investment or business partner could be negatively affected.\nOur approach to AI presents risks and challenges that can impact our business and could adversely affect our business\nAI presents risks and challenges that could impact our business, including perceived breaches or privacy or security incidents related to the use of AI. We are integrating generative AI tools into our systems and our third-party business partners, including operators, tenants and vendors, as well as our competitors, may also develop or use such tools. Our ongoing efforts to comply with privacy and data protection laws, as well as initiatives to comply with new legal regulations relating to privacy, data protection and AI, impose significant costs and challenges that are likely to increase over time. AI solutions and features may become more important to our operations or to our future growth over time. Recent developments in AI, such as generative or agentic AI, may accelerate or exacerbate these effects, and industry trends and consumer expectations may influence the pace at which AI solutions are used in our business operations. There can be no assurance that we will realize the desired or anticipated benefits, or any benefits, and we may fail to properly implement such technology. Uncertainty around the safety and security of new and emerging AI applications may require additional investment in the development of proprietary datasets, machine learning models and systems to test for security, accuracy, bias and other variables, which are often complex, may be costly and could impact our profit margin. In addition, the providers of our or our business partners’ AI tools may not meet existing or rapidly evolving regulatory or industry standards with respect to privacy and data protection, compliance and transparency, among others, which could inhibit our or our or our business partners’ ability to maintain an adequate level of functionality or service. Our business partners may also incorporate AI into their products and services without disclosing such use to us or fail to disclose risks presented by their use of AI. There is a risk that AI tools used by us or by our business partners could produce inaccurate or unexpected results or behaviors that could harm our reputation, business, customers or stakeholders. Our \n40\ncompetitors or other third parties may incorporate AI in their business operations more quickly or more successfully than we do. Additionally, the complex and rapidly evolving landscape around AI may expose us to claims, inquiries, demands and proceedings by private parties and global regulatory authorities and subject us to legal liability as well as reputational harm. New laws and regulations are being adopted in the U.S. and in non-U.S. jurisdictions, and existing laws and regulations may be interpreted in ways that would affect our business operations and the way in which we use AI. Any of these outcomes could impair our ability to compete effectively, damage our reputation, result in the loss of valuable property or information and adversely impact our results of operations.\nNegative publicity regarding the healthcare industry could adversely affect our operations\nHealthcare companies, including insurance providers, adult care facilities and others, have received and continue to receive negative publicity reflecting the public perception of the industry. Although we have no direct healthcare operations, we invest in seniors housing and healthcare real estate, and our results of operations may be affected by the amount of negative publicity to which the healthcare industry has been subject as a result of our relationships with our operators, managers and tenants. Speculation, uncertainty or negative publicity about us, our industry or our business could adversely affect our results of operations, require changes to our services, result in damage to our properties, negatively impact the safety of our executives and other personnel or otherwise disrupt our operations, and could encourage additional legislation, regulation, review of industry practices or private litigation that could adversely affect us.\nOur success and the success of our operators and managers depends on key personnel whose continued service is not guaranteed \nOur success and the success of our operators and managers depends on the continued availability and service of key personnel, including executive officers and other highly qualified employees, and competition for their talents is intense. There is substantial competition for qualified personnel. We cannot assure you that we will retain our key personnel or that we will be able to recruit and retain other highly qualified employees in the future. Losing any key personnel could, at least temporarily, have a material adverse effect on our business and that of our operators' and managers' financial position and results of operations.\n \nWelltower is a holding company with no direct operations, and it relies on funds received from Welltower OP to pay its obligations and make distributions to stockholders\nWelltower is a holding company with no direct operations. All of Welltower's property ownership, development and related business operations are conducted through Welltower OP and Welltower has no material assets or liabilities other than its investment in Welltower OP. As a result, Welltower relies on distributions from Welltower OP to make dividend payments and meet its obligations, including any tax liability on taxable income allocated to Welltower from Welltower OP. Welltower exercises exclusive control over Welltower OP, including the authority to cause Welltower OP to make distributions, subject to certain limited approval and voting rights of Welltower OP's other members as described in the Limited Liability Agreement. In addition, because Welltower is a holding company, your claims as stockholders are structurally subordinated to all existing and future liabilities and obligations to preferred equity holders of Welltower OP and its subsidiaries. Therefore, in the event of a bankruptcy, insolvency, liquidation or reorganization of Welltower OP or its subsidiaries, assets of Welltower OP or the applicable subsidiary will be available to satisfy any claims of our stockholders only after such liabilities and obligations have been satisfied in full.\nWelltower is the initial member and majority owner of Welltower OP, with an approximate ownership interest of 99.707% as of December 31, 2024. In connection with our future acquisition activities or otherwise, Welltower OP may issue additional Class A Common Units (\"OP Units\") to third parties and admit additional members. Such issuances would reduce Welltower's percentage ownership in Welltower OP.\nRisks Arising from Our Capital Structure\n \nWe may become more leveraged\n \nPermanent financing for our investments is typically provided through a combination of offerings of debt and equity securities and the incurrence or assumption of secured debt. The incurrence or assumption of indebtedness may cause us to become more leveraged, which could (1) require us to dedicate a greater portion of our cash flow to the payment of debt service, (2) make us more vulnerable to a downturn in the economy, (3) limit our ability to obtain additional financing, (4) negatively affect our credit ratings or outlook by one or more of the rating agencies or (5) make us more vulnerable to elevated or increasing interest rates because of the variable interest rates on some of our borrowings to the extent we have not entirely hedged such variable-rate debt. In addition, any changes to benchmark rates may have an uncertain impact on our cost of funds and our access to the capital markets, which could impact our results of operations and cash flows. Uncertainty as to the nature of such potential changes may also adversely affect the trading market for our securities. Additional financing, therefore, may be unavailable, more expensive or restricted by the terms of our outstanding indebtedness.\n41\nCash available for distributions to stockholders may be insufficient to make dividend contributions at expected levels and are made at the discretion of the Board\n \nIf cash available for distribution generated by our assets decreases due to dispositions or otherwise, we may be unable to make dividend distributions at expected levels. Our inability to make expected distributions would likely result in a decrease in the market price of our common stock. All distributions are made at the discretion of our Board in accordance with Delaware law and depend on our earnings, our financial condition, debt and equity capital available to us, our expectation of our future capital requirements and operating performance, restrictive covenants in our financial and other contractual arrangements, maintenance of our REIT qualification, restrictions under Delaware law and other factors as our Board may deem relevant from time to time. Additionally, our ability to make distributions will be adversely affected if any of the risks described herein, or other significant adverse events, occur.\n \nWe are subject to covenants in our debt agreements that could have a material adverse effect on our business, results of operations and financial condition\nOur debt agreements contain various covenants, restrictions, and events of default. Among other things, these provisions require us to maintain certain financial ratios and minimum net worth and impose certain limits on our ability to incur indebtedness, create liens and make investments or acquisitions. Breaches of these covenants could result in defaults under the instruments governing the applicable indebtedness, in addition to any other indebtedness cross-defaulted against such instruments. These defaults could have a material adverse effect on our business, results of operations and financial condition. \nLimitations on our ability to access capital could have an adverse effect on our ability to make future investments or to meet our obligations and commitments\nWe cannot assure you that we will be able to raise the capital necessary to make future investments or to meet our obligations and commitments as they mature. Our access to capital depends upon a number of factors over which we have little or no control, including current elevated interest rates, inflation and other general market, macroeconomic, geopolitical and public health-related factors; the market’s perception of our growth potential and our current and potential future earnings and cash distributions; the market price of the shares of our common stock and the credit ratings of our debt securities; changes in the credit ratings on U.S. government debt securities; future government shutdowns; and default or delay in payment by the U.S. of its obligations. We also rely on the financial institutions that are parties to our revolving credit facilities. If these institutions become capital constrained, tighten their lending standards or become insolvent or if they experience excessive volumes of borrowing requests from other borrowers within a short period of time, they may be unable or unwilling to honor their funding commitments to us, which would adversely affect our ability to draw on our revolving credit facilities and, over time, could negatively impact our ability to consummate acquisitions, repay indebtedness as it matures, fund capital expenditures or make distributions to our stockholders. If our access to capital is limited by these factors or other factors, it could negatively impact our ability to acquire properties, repay or refinance our indebtedness, fund operations or make distributions to our stockholders.\nDowngrades in our credit ratings could have a material adverse effect on our cost and availability of capital\nWe plan to manage the company to maintain a capital structure consistent with our current profile, but there can be no assurance that we will be able to maintain our current credit ratings. Any downgrades in terms of ratings or outlook by any or all of the rating agencies could have a material adverse effect on our cost and availability of capital, which could in turn have a material adverse effect on our results of operations, liquidity, cash flows, the trading/redemption price of our securities and our ability to satisfy our debt service obligations and to pay dividends and distributions to our equity holders.\nElevated interest rates, or future interest rate increases, could have a material adverse effect on our cost of capital, and our decision to hedge against interest rate risk might not be effective\nElevated interest rates, or future increases in interest rates, could further increase interest cost on new and existing variable-rate debt. Such increases in the cost of capital, and any further increases resulting from future elevated interest rates, could adversely impact our ability to finance operations, acquire and develop properties and refinance existing debt. Specifically, rate increases have corresponding impacts to our costs of borrowing and may have adverse impacts on our ability to raise funds through the offering of our securities or through the issuance of debt due to higher debt capital costs, diminished credit availability and less favorable equity markets. Additionally, elevated interest rates may also result in less liquid property markets, limiting our ability to sell existing assets. Elevated interest rates may also lead purchasers of our common stock to demand a greater annual dividend yield, which could adversely affect the market price of our common stock and could result in increased capitalization rates, which may lead to reduced valuation of our assets.\nWe may from time to time seek to manage our exposure to interest rate volatility with hedging arrangements, which involve additional risks including the risks that counterparties may fail to honor their obligations under these arrangements, that these arrangements may not be effective in reducing our exposure to interest rate changes, that the amount of income we earn from hedging transactions may be limited by federal tax provisions governing REITs and that these arrangements may reduce the benefits to us if interest rates decline. Developing and implementing an interest rate risk strategy is complex, and no strategy can completely insulate us from risks associated with interest rate fluctuations and there can be no assurance that our hedging activities will be effective. Failure to hedge effectively against interest rate risk, if we choose to engage in such activities, could adversely affect our business, financial condition and results of operations.\n42\nRisks Arising from Our Status as a REIT\n \nWe might fail to qualify or remain qualified as a REIT\n \nWe intend to operate as a REIT under the Code, and believe we have operated and will continue to operate in such a manner. If we lose our status as a REIT, we will face serious income tax consequences that will substantially reduce the funds available for satisfying our obligations and for distribution to our stockholders because:\n•\nWelltower would not be allowed a deduction for distributions to stockholders in computing our taxable income and would be subject to U.S. federal income tax at regular corporate rates;\n•\nWelltower would be subject to increased state and local taxes; and\n•\nunless Welltower is entitled to relief under statutory provisions, it could not elect to be subject to tax as a REIT for four taxable years following the year during which it was disqualified. \nSince REIT qualification requires us to meet a number of complex requirements, it is possible that we may fail to fulfill them, and if we do, our earnings will be reduced by the amount of U.S. federal and other income taxes owed. A reduction in our earnings would affect the amount we could distribute to our stockholders. If we do not qualify as a REIT, we will not be required to make distributions to stockholders, since a non-REIT is not required to pay dividends to stockholders in order to maintain REIT status or avoid an excise tax. In addition, if we fail to qualify as a REIT, all distributions to stockholders will continue to be treated as dividends to the extent of our current and accumulated earnings and profits, although corporate stockholders may be eligible for the dividends received deduction, and individual stockholders may be eligible for taxation at the rates generally applicable to long-term capital gains with respect to distributions. \nAs a result of all these factors, our failure to qualify as a REIT also could impair our ability to implement our business strategy and would adversely affect the value of our common stock. Qualification as a REIT involves the application of highly technical and complex Code provisions for which there are only limited judicial and administrative interpretations. The determination of various factual matters and circumstances not entirely within our control may affect our ability to remain qualified as a REIT. Although we believe that we qualify as a REIT, we cannot assure you that we will remain qualified as a REIT for U.S. federal income tax purposes. \nFailure of Welltower OP to maintain status as a partnership for U.S. federal income tax purposes\nWe believe Welltower OP qualifies as a partnership for U.S. federal income tax purposes. As a partnership, Welltower OP is generally not subject to U.S. federal income tax on its income. Instead, each of the partners is allocated its share of Welltower OP's income. We cannot assure you, however, that the IRS will not challenge the status of Welltower OP as a partnership for U.S. federal income tax purposes. If the IRS were to successfully challenge the status of Welltower OP as a partnership, it would be taxable as a corporation. In such event, this would reduce the amount of distributions that Welltower OP could make. The treatment of Welltower OP as a corporation would also cause us to fail to qualify as a REIT. This would substantially reduce our cash available to pay distributions and the return on a unitholder and/or shareholder's investment.\nCertain subsidiaries might fail to qualify or remain qualified as a REIT\nWe own interests in a number of entities which intend to operate as REITs for U.S. federal income tax purposes, some of which we consolidate for financial reporting purposes but each of which is treated as a separate REIT for U.S. federal income tax purposes (each a “Subsidiary REIT”). To qualify as a REIT, each Subsidiary REIT must independently satisfy all of the REIT qualification requirements under the Code, together with all other rules applicable to REITs. Provided that each Subsidiary REIT qualifies as a REIT, our interests in the Subsidiary REITs will be treated as qualifying real estate assets for purposes of the REIT asset tests. If a Subsidiary REIT fails to qualify as a REIT in any taxable year, such Subsidiary REIT would be subject to federal and state income taxes and would not be able to qualify as a REIT for the four subsequent taxable years following the year during which it was disqualified. Any such failure could have an adverse effect on our ability to comply with the REIT income and asset tests, and thus our ability to qualify as a REIT, unless we are able to avail ourselves of certain relief provisions and pay any tax required by such relief provisions.\n \nThe tax imposed on any net income from \"prohibited transactions\" may limit our ability to engage in transactions which would be treated as sales for federal income tax purposes\nAny net income of a REIT from prohibited transactions (which are, in general, sales or other dispositions of property held primarily for sale to customers in the ordinary course of business, other than dispositions of foreclosure property) is subject to a 100% tax, unless certain safe harbor exceptions apply. Although we do not intend to hold any properties that would be characterized as held for sale to customers in the ordinary course of our business (other than through a TRS), such characterizations is a factual determination and no guarantee can be given that the IRS would agree with our characterization of our properties or that we will always be able to make use of the available safe harbors.\nThe 90% annual distribution requirement will decrease our liquidity and may limit our ability to engage in otherwise beneficial transactions\n \nTo comply with the 90% distribution requirement applicable to REITs and to avoid the nondeductible excise tax, we must make distributions to our stockholders. Although we anticipate that we generally will have sufficient cash or liquid assets to enable us to satisfy the REIT distribution requirement, it is possible that, from time to time, we may not have sufficient cash or \n43\nother liquid assets to meet the 90% distribution requirement. This may be due to timing differences between the actual receipt of income and actual payment of deductible expenses, on the one hand, and the inclusion of that income and deduction of those expenses in arriving at our taxable income, on the other hand. In addition, non-deductible expenses such as principal amortization or repayments or capital expenditures in excess of non-cash deductions may cause us to fail to have sufficient cash or liquid assets to enable us to satisfy the 90% distribution requirement. In the event that timing differences occur, or we deem it appropriate to retain cash, we may borrow funds, even if the then-prevailing market conditions are not favorable for these borrowings, issue additional equity securities (although we cannot assure you that we will be able to do so), pay taxable stock dividends, if possible, distribute other property or securities or engage in other transactions intended to enable us to meet the REIT distribution requirements. This may require us to raise additional capital to meet our obligations.\n \nOur use of TRSs is limited under the Code\nUnder the Code, no more than 20% of the value of the gross assets of a REIT may be represented by securities of one or more TRSs. This limitation may affect our ability to increase the size of our TRSs’ operations and assets, and there can be no assurance that we will be able to comply with the applicable limitation, or that such compliance will not adversely affect our business. Also, our TRSs may not, among other things, operate or manage certain healthcare facilities, which may cause us to forgo investments we might otherwise make. Finally, we may be subject to a 100% excise tax on the income derived from certain transactions with our TRSs that are not on an arm's-length basis. We believe our arrangements with our TRSs are on arm's-length terms and intend to continue to operate in a manner that allows us to avoid incurring the 100% excise tax described above, but there can be no assurance that we will be able to avoid application of that tax.\nThe lease of qualified healthcare properties to a TRS is subject to special requirements\nWe lease certain qualified healthcare properties to TRSs (or subsidiaries of TRSs), which lessees contract with managers (or related parties) to manage the healthcare operations at these properties. The rents from this TRS lessee structure are treated as qualifying rents from real property if (1) they are paid pursuant to an arm's-length lease of a qualified healthcare property with a TRS and (2) the manager qualifies as an eligible independent contractor (as defined in the Code). If any of these conditions are not satisfied, then the rents will not be qualifying rents. \nIf certain sale-leaseback transactions are not characterized by the IRS as “true leases,” we may be subject to adverse tax consequences\n \nWe have purchased certain properties and leased them back to the sellers of such properties, and we may enter into similar transactions in the future. We intend for any such sale-leaseback transaction to be structured in such a manner that the lease will be characterized as a “true lease,” thereby allowing us to be treated as the owner of the property for U.S. federal income tax purposes. However, depending on the terms of any specific transaction, the IRS might take the position that the transaction is not a “true lease” but is more properly treated in some other manner. In the event any sale-leaseback transaction is challenged and successfully re-characterized by the IRS, we would not be entitled to claim the deductions for depreciation and cost recovery generally available to an owner of property. Furthermore, if a sale-leaseback transaction were so re-characterized, we might fail to satisfy the REIT asset tests or income tests and, consequently, could lose our REIT status effective with the year of re-characterization. Alternatively, the amount of our REIT taxable income could be recalculated, which may cause us to fail to meet the REIT annual distribution requirements for a taxable year. \nWe could be subject to changes in our tax rates, the adoption of new U.S. or international tax legislation, or exposure to additional tax liabilities \nWe are subject to taxes in the U.S. and foreign jurisdictions. Because the U.S. maintains a worldwide corporate tax system, the foreign and U.S. tax systems are somewhat interdependent. Longstanding international norms that determine each country's jurisdiction to tax cross-border international trade are evolving and could reduce the ability of our foreign subsidiaries to deduct for foreign tax purposes the interest they pay on loans from us, thereby increasing the foreign tax liability of the subsidiaries; it is also possible that foreign countries could increase their withholding taxes on dividends and interest. \nOur effective tax rates could be affected by changes in the mix of earnings in countries with differing statutory tax rates or changes in tax laws or their interpretation. We are also subject to the examination of our tax returns and other tax matters by the IRS and other tax authorities and governmental bodies. We regularly assess the likelihood of an adverse outcome resulting from these examinations to determine the adequacy of our provision for taxes. There can be no assurance as to the outcome of these examinations. If we were subject to review or examination by the IRS or applicable foreign jurisdiction as the result of any new tax law changes, the ultimate determination of which may change our taxes owed for an amount in excess of amounts previously accrued or recorded, our financial condition, operating results and cash flows could be adversely affected.\nThe present federal income tax treatment of REITs may be modified, possibly with retroactive effect, by legislative, judicial or administrative action at any time, which could affect the federal income tax treatment of an investment in us. The federal income tax rules dealing with U.S. federal income taxation and REITs are constantly under review by persons involved in the legislative process, the IRS and the U.S. Treasury Department, which results in statutory changes as well as frequent revisions to regulations and interpretations. Also, the law relating to the tax treatment of other entities or an investment in other entities could change, making an investment in such other entities more attractive relative to an investment in a REIT.\n44\nWe cannot predict how changes in the tax laws in the U.S. or foreign jurisdictions might affect our investors or us. Revisions in tax laws and interpretations thereof could significantly and negatively affect our ability to qualify as a REIT, as well as the tax considerations relevant to an investment in us, could require us to pay additional taxes on our assets or income and/or be subject to additional restrictions, could cause us to change our investments and commitments, and could adversely affect our earnings and cash flow. These changes could, among other things, adversely affect the trading price for our common stock, our financial condition, our results of operations and the amount of cash available for the payment of dividends.\nThe impact to our TRSs of the Corporate Alternative Minimum Tax imposed by the Inflation Reduction Act of 2022 is uncertain and may be adverse\nFor tax years beginning after December 31, 2022, the Inflation Reduction Act of 2022 (\"IRA\") imposes among other things, a 15% Corporate Alternative Minimum Tax (\"Corporate AMT\") on certain U.S. corporations with average adjusted financial statement income (“AFSI”) in excess of $1 billion. Although, by its terms, the Corporate AMT is not applicable to REITs, under the regulations that have been proposed by the IRS, the Corporate AMT may apply to our TRSs.\nOn September 13, 2024, the IRS issued proposed regulations that would address the application of the Corporate AMT (the “Proposed Corporate AMT Regulations”). The Proposed Corporate AMT Regulations do not include an exception for TRSs. Moreover, under the Proposed Corporate AMT Regulations, in determining whether our TRSs meet the $1 billion AFSI threshold described above, our TRSs generally will include all of our AFSI. As a result, under the Proposed Corporate AMT Regulations, our TRSs may be subject to the Corporate AMT if the AFSI threshold is satisfied. Additionally, the Proposed Corporate AMT Regulations would impose new reporting obligations on each of our TRSs subject to the Corporate AMT that are a partner in a partnership, and on partnerships in which we are a member.\nCertain of the Proposed Corporate AMT Regulations would apply from the date that they were published, while others would apply from the date of publication of the finalized rules in the Federal Register. The final Corporate AMT regulations may differ materially from the Proposed Corporate AMT Regulations, and until further regulations and guidance from the IRS and Treasury are released, the impact of the Corporate AMT on our TRSs is uncertain and it is possible that our TRSs will be subject to material U.S. federal income taxes under the Corporate AMT.",
    "item1b": "Item 1B.\n  Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.\n  \nCybersecurity\nWe have \nimplemented\n and maintain various information security processes designed to identify, assess and manage material risks from cybersecurity threats. Our cybersecurity program includes several safeguards such as access controls, multi-factor authentication, continuous monitoring and alerting systems for internal and external threats and penetration testing. Additionally, we conduct regular evaluations of our cybersecurity program, \nwhich may include internal reviews and third-party assessments to validates the program's effectiveness and resilience.\nGovernance\nThe Board of Directors (the \"Board\") retains ultimate oversight of cybersecurity risk, which it manages as part of our enterprise risk management program.\n The Board has delegated primary responsibility of overseeing cybersecurity risks to the Audit Committee. The Audit Committee's responsibilities include reviewing cybersecurity strategies with management, assessing processes and controls pertaining to the management of our information technology operations and their effectiveness and seeking to confirm that management's response to potential cybersecurity incidents is timely and effective. At least annually, the Audit Committee receives a cybersecurity report from the Chief Technology Officer and the information security team. This report may cover a variety of relevant topics, potentially including recent developments, evolving standards, vulnerability assessments, third-party and independent reviews, the threat environment, technological trends and information security considerations related to our operators, managers and third parties. The scope and focus of each report are determined based on current priorities and emerging issues in cybersecurity. The Audit Committee, along with the Chief Technology Officer and the information security team, also report to the Board at least annually on data protection and cybersecurity matters.\nManagement and Cybersecurity Working Group\nReporting to the \nChief Operating Officer, our Chief Technology Officer\n, with extensive cybersecurity knowledge and skills from years of relevant work experience at Welltower and elsewhere, leads the team responsible for developing and implementing our information security program across our business.\n This information security team comprises individuals with relevant educational and technical experience, many having held similar positions with responsibility for various aspects of cybersecurity at large organizations. This team works closely with the Legal department to oversee compliance and regulatory and contractual security requirements. The Chief Technology Officer also leads our Cyber Security Working Group, which is comprised of a cross-functional team including Internal Audit, Legal, Information Technology, Risk Management and Accounting leaders. These individuals meet regularly and are informed about and monitor the prevention, mitigation, detection and remediation of cybersecurity incidents. The Chief Technology Officer is responsible for reporting on cybersecurity and information technology to the Audit Committee and \nBoard\n.\n45\nInformation Security Program\nThe information security team provides regular reports to the Chief Technology Officer and other relevant teams on various cybersecurity threats, assessments and findings. In addition to our internal cybersecurity capabilities, we also periodically engage assessors, consultants, auditors or other third parties to provide consultation and advice to assist with assessing, identifying and managing cybersecurity risks. Our management team identifies and assesses information security risks using industry practices informed by the National Institute of Standards and Technology (\"NIST\"), including the NIST Cybersecurity Framework.\nWe provide mandatory cybersecurity training at least annually to our personnel with network access, including training designed to simulate and help prevent phishing and other social engineering attacks. \nWe also employ systems and processes designed to oversee, identify and reduce the potential impact of a security incident at a third-party vendor, service provider or otherwise implicating the third-party technology and systems we use\n. These systems and processes are designed to the third party's risk level and may include, for example, conducting upfront diligence of the third party's certifications and security program, using contractual provisions that address cybersecurity risks and conducting additional monitoring of the third party's security practices. Additionally, we maintain cybersecurity insurance providing coverage for certain costs related to cybersecurity-related incidents that impact our cybersecurity and information technology infrastructure. However, our insurance coverage may not sufficiently cover all types of losses or claims that arise or be subject to exclusions.\nIncident Response\nThe Cybersecurity Working Group maintains and oversees an incident response plan that applies in the event of a cybersecurity threat or incident and is designed to provide a standardized framework for responding to cybersecurity incidents. The incident response plan sets out a coordinated approach to investigating, containing, documenting and mitigating incidents, including reporting findings and keeping senior management and other key stakeholders (including the Board for certain incidents) informed and involved as appropriate. The objectives of the incident response plan are to reduce the number of systems and users affected by security incidents, reduce the time a threat actor spends within our network, reduce the damage caused by an incident and reduce the time required to restore normal operations. The incident response plan also specifies the use of third-party experts for legal advice, consulting and cyber incident response. \nMaterial Cybersecurity Risks, Threats and Incidents\nWhile we employ several measures to prevent, detect and mitigate cybersecurity threats, there is no guarantee such efforts will be successful. We also rely on information technology and other third-party vendors to support our business, including securely processing personal, confidential, financial, sensitive, or proprietary and other types of information. Despite our efforts to improve our ability, and the ability of relevant third parties', to protect against cyber threats, we may not be able to protect all information, systems, products and services. \nWhile we are not aware of any cybersecurity incidents that have materially affected us within the prior fiscal year\n, there can be no guarantee that we will not be the subject of future attacks, threats or incidents, that may have a material impact on our business strategy, results of operations or financial condition. Additional information on cybersecurity risks we face can be found in Part I,",
    "item1a": "Item 1A \"Risk Factors\" of this Form 10-K under the heading \"Cybersecurity incidents could disrupt our business and result in the loss of confidential information and legal liability,\" which should be read in conjunction with the foregoing information.\n46"
  }
}