{
  "ticker": "WFC",
  "cik": "0000072971",
  "company_name": "WELLS FARGO & COMPANY/MN",
  "filing_date": "2025-02-25",
  "accession": "0000072971-25-000066",
  "primary_doc": "wfc-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.\nBUSINESS\nWells Fargo & Company is a corporation organized under the laws of Delaware and a financial holding company and a bank holding company registered under the Bank Holding Company Act of 1956, as amended (BHC Act). Its principal business is to act as a holding company for its subsidiaries. References in this report to “the Parent” mean the holding company. References to “we,” “our,” “us” or “the Company” mean the holding company and its subsidiaries that are consolidated for financial reporting purposes. \nAt December 31, 2024, we had assets of approximately $1.9 trillion, loans of $912.7 billion, deposits of $1.4 trillion and stockholders’ equity of $179.1 billion. Based on assets, we were the fourth largest bank holding company in the United States. At December 31, 2024, Wells Fargo Bank, N.A. was the Company’s principal subsidiary with assets of $1.7 trillion, or 88% of the Company’s assets.\nOur annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports, are available for free at \nwww.wellsfargo.com/about/investor-relations/filings\n as soon as reasonably practicable after they are electronically filed with or furnished to the Securities and Exchange Commission (SEC). They are also available for free on the SEC’s website at \nwww.sec.gov\n1\n.\nDESCRIPTION OF BUSINESS\nGeneral\nWe are a leading financial services company that provides a diversified set of banking, investment and mortgage products and services, as well as consumer and commercial finance, to individuals, businesses and institutions, throughout the U.S., and in countries outside the U.S. We provide consumer financial products and services including checking and savings accounts, credit and debit cards, and auto, residential mortgage, and small business lending. In addition, we offer financial planning, private banking, investment management, and fiduciary services. We also provide financial solutions to businesses through products and services including traditional commercial loans and lines of credit, letters of credit, asset-based lending and leasing, trade financing, treasury management, and investment banking services. Our website address is www.wellsfargo.com.\nAs of December 31, 2024, we had four reportable operating segments for management reporting purposes: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The 2024 Annual Report to Shareholders includes financial information and descriptions of these operating segments.\nHuman Capital\nOur people are what set Wells Fargo apart and are critical to our success. Wells Fargo continues to invest in our employees by offering market-competitive compensation, career-development opportunities, a broad array of benefits, and strong work-life programs. We want to be recognized as a great company for everyone by maintaining recruitment and career development practices that support our employees and provide an environment that welcomes people from different backgrounds and with different experiences.\n1\n We do not control this website. Wells Fargo has provided this link for your convenience, but does not endorse and is not responsible for the content, links, privacy policy, or security policy of this website.\nAt December 31, 2024, we had approximately 217,000 active employees, with approximately 77% of employees based in the United States. Our global workforce was 51% female and 49% male, and our U.S. workforce was 54% female and 46% male. Our U.S. workforce was 51% white, 48% racially/ethnically diverse, and 1% undeclared.\nCompensation and benefits.  \nWells Fargo's compensation program is linked to performance management and is designed to promote prudent risk management and reinforce its culture and operating standards. The compensation principles include:\n•\nPay for performance\n: Compensation is linked to company, line of business, and individual performance, including meeting regulatory expectations and creating long-term value consistent with the interests of shareholders. \n•\nPromote effective risk management\n: Compensation promotes effective risk management and discourages imprudent or excessive risk-taking. \n•\nAttract and retain talent\n: People are one of Wells Fargo's competitive advantages; therefore, compensation helps attract, motivate, and retain people with the skills, talent, and experience to drive superior long-term company performance.\nIn addition, we offer eligible full- and part-time employees and their eligible dependents a comprehensive set of benefits designed to support their physical, financial, and emotional health to help them make the most of their well-being. \nEmployee learning and development.  \nWe invest in the development of our employees and managers. We believe that when our employees feel properly supported, engaged, and confident in their skills, they are more effective and can provide an even better customer experience. During 2024, we invested approximately $200 million in a variety of employee learning and development programs, including functional training, required risk and regulatory compliance, leadership and professional development, and early talent development programs. In addition, we provided tuition reimbursement for approximately 2,600 employees in 2024.\nWork-life programs.  \nWells Fargo offers many benefits, programs, and work arrangements intended to provide employees with flexibility and work-life balance. For example, employees in certain non-customer-facing roles have flexibility to work up to two days a week remotely, and are expected to spend a minimum of three days a week in the office. Expectations for other roles, including customer-facing, operations, contact center, and non-U.S. based employees, vary by business need.\nCompetition\nThe financial services industry is highly competitive. Our subsidiaries compete with financial services providers such as banks, savings and loan associations, credit unions, finance companies, mortgage banking companies, insurance companies, investment banks and mutual fund companies. They also face increased competition from nonbank institutions such as brokerage houses, private equity firms and online lending companies, as well as from financial services subsidiaries of commercial and manufacturing companies. Many of these competitors enjoy fewer regulatory constraints and some may have lower cost structures.\nSecurities firms and insurance companies that elect to become financial holding companies may acquire banks and other financial institutions. Combinations of this type could \n1\nsignificantly change the competitive environment in which we conduct business. The financial services industry is also becoming more competitive as further technological advances enable more companies to provide financial products and services, including electronic and internet-based financial solutions such as electronic securities trading, lending and payment solutions, as well as digital currencies and alternative payment methods. These technological advances may diminish the importance of depository institutions and other financial intermediaries in the transfer of funds between parties.\nREGULATION AND SUPERVISION\nThe U.S. financial services industry is subject to significant regulation and regulatory oversight initiatives. This regulation and oversight may continue to impact how U.S. financial services companies conduct business and may continue to result in increased regulatory compliance costs.\nBanking statutes, regulations and policies are continually under review by Congress and state legislatures and federal and state regulatory agencies, as well as non-U.S. governments and financial regulators, and a change in them, including changes in how they are interpreted or implemented, could have a material effect on our business. The regulatory framework applicable to depository institutions and bank holding companies (BHCs) is intended to protect depositors, the federal deposit insurance fund, consumers and the banking system as a whole, and not necessarily investors in BHCs such as the Company.\nStatutes, regulations, and policies could restrict our ability to diversify into other areas of financial services, make acquisitions, and pay dividends or repurchase our capital stock. They may also require us to provide financial support to one or more of our subsidiary banks, maintain capital in excess of amounts desired by management, and pay higher deposit insurance premiums as a result of assessments or a general deterioration in the financial condition of depository institutions.\nThe following describes the material elements of the regulatory framework applicable to us and the more significant regulations and regulatory oversight initiatives that have affected or may affect our business. For additional information about the regulatory matters discussed below and other regulations and regulatory oversight matters, see the “Overview,” “Capital Management,” “Forward-Looking Statements” and “Risk Factors” sections and Note 26 (Regulatory Capital Requirements and Other Restrictions) to Financial Statements in the 2024 Annual Report to Shareholders.\nGeneral\nParent Bank Holding Company. \n As a BHC, the Parent is subject to regulation under the BHC Act and to inspection, examination and supervision by its primary regulator, the Board of Governors of the Federal Reserve System (Federal Reserve Board or FRB). The Parent is also subject to the disclosure and regulatory requirements of the Securities Act of 1933, as amended, and the Securities Exchange Act of 1934, as amended, both as administered by the SEC. As a company with securities listed on the New York Stock Exchange (NYSE), the Parent is subject to the rules of the NYSE for listed companies. \nSubsidiary Banks.\n  Our subsidiary national banks, and their subsidiaries, are subject to regulation and examination primarily by the Office of the Comptroller of the Currency (OCC) and also by the Federal Deposit Insurance Corporation (FDIC), the FRB, the Consumer Financial Protection Bureau (CFPB), the SEC and the Commodities Futures Trading Commission (CFTC). The non-\nU.S. branches, subsidiaries, and offices of our subsidiary national banks are subject to regulation and examination by their respective financial regulators as well as by the OCC and the FRB. Non-U.S. operations of our national bank subsidiaries may be subject to the laws and regulations of the countries in which they conduct business. \n \nNonbank Subsidiaries. \n Many of our nonbank subsidiaries are also subject to regulation by the FRB and other applicable federal and state agencies. Our insurance subsidiaries are subject to regulation by applicable state insurance regulatory agencies, as well as the FRB. Our brokerage subsidiaries are regulated by the SEC, the Financial Industry Regulatory Authority (FINRA) and, in some cases, the CFTC and the Municipal Securities Rulemaking Board, and state securities regulators. Our other nonbank subsidiaries may be subject to the laws and regulations of the federal government and/or the various states as well as non-U.S. countries in which they conduct business or operate.\nParent Bank Holding Company Activities\n“Financial in Nature” Requirement. \n We became a financial holding company (FHC) effective March 13, 2000. We continue to maintain our status as a BHC for purposes of various FRB regulations. As a BHC that has elected to be treated as an FHC pursuant to the BHC Act, we may affiliate with securities firms and insurance companies and engage in other activities that are financial in nature or incidental or complementary to activities that are financial in nature. “Financial in nature” activities include securities underwriting, dealing, and market making; sponsoring mutual funds and investment companies; insurance underwriting and agency; merchant banking; and activities that the FRB, in consultation with the Secretary of the U.S. Treasury, determines to be financial in nature or incidental to such financial activity. “Complementary activities” are activities that the FRB determines upon application to be complementary to a financial activity and do not pose a safety and soundness risk. Financial in nature activities and incidental or complementary activities are collectively referred to below as “financial activities”.\nFRB approval is generally not required for us to acquire a company (other than a BHC, bank or savings association) engaged in financial activities, as determined by the FRB. Prior notice to the FRB may be required, however, if the company to be acquired has total consolidated assets of $10 billion or more. Prior FRB approval is required before we may acquire the beneficial ownership or control of more than 5% of the voting shares or substantially all of the assets of a BHC, bank or savings association. We are also subject to prohibitions on our ability to merge, acquire all or substantially all of the assets of, or acquire control of another company if our total resulting consolidated liabilities would exceed 10% of the aggregate consolidated liabilities of all financial companies.\nBecause we are an FHC, if any of our applicable subsidiary banks receives a rating under the Community Reinvestment Act of 1977, as amended (CRA), of less than satisfactory, we will be prohibited, until the rating is raised to satisfactory or better, from engaging in certain new financial activities or acquiring certain companies engaged in financial activities. CRA performance is also considered by regulators in reviewing applications to establish bank branches. In addition, if the FRB finds that an FHC or any one of its subsidiary banks is not well capitalized or well managed, the FHC would be required to enter into an agreement with the FRB to comply with all applicable capital and management requirements and which may contain additional limitations or conditions. Until corrected, the FHC could be prohibited from engaging in any new financial activity or \n2\nacquiring companies engaged in financial activities without prior FRB approval. If the FHC fails to correct any such condition within a prescribed period, the FRB could order the FHC to divest any of its banking subsidiaries or, in the alternative, to cease engaging in financial activities. \nInterstate Banking\n.  A BHC may acquire banks in states other than its home state, subject to any state requirement that the bank has been organized and operating for a minimum period of time, not to exceed five years, and the requirement that the BHC not control, prior to or following the proposed acquisition, more than 10% of the total amount of deposits of insured depository institutions nationwide or, unless the acquisition is the bank holding company’s initial entry into the state, more than 30% of such deposits in the state (or such lesser or greater amount set by the state). Banks are also authorized to merge across state lines, subject to the same deposit limits noted above, thereby creating interstate branches. Banks are also permitted to acquire and to establish new branches in other states.\nRegulatory Approval. \n In determining whether to approve a proposed bank acquisition, federal banking regulators will consider, among other factors, the effect of the acquisition on competition, financial condition, and future prospects including current and projected capital ratios and levels, the competence, experience, and integrity of management and record of compliance with laws and regulations, the convenience and needs of the communities to be served, including the acquiring institution’s record of compliance under the CRA, the effectiveness of the acquiring institution in combating money laundering activities and the risk to the stability of the United States banking system.\nHolding Company Structure\nTransfer of Funds from Subsidiary Banks.\n  The Parent’s subsidiary banks are subject to restrictions under federal law that limit the transfer of funds or other assets from such subsidiaries to the Parent and its nonbank subsidiaries (including affiliates) in so-called “covered transactions.” In general, covered transactions include loans and other extensions of credit, investments and asset purchases, as well as certain other transactions involving the transfer of value from a subsidiary bank to an affiliate or for the benefit of an affiliate. Unless an exemption applies, covered transactions by a subsidiary bank with a single affiliate are limited to 10% of the subsidiary bank’s capital and surplus and, with respect to all covered transactions with affiliates in the aggregate, to 20% of the subsidiary bank’s capital and surplus. Also, loans and extensions of credit to affiliates generally must be secured by qualifying collateral. A bank’s transactions with its nonbank affiliates are also generally required to be on arm’s length terms. The Parent's subsidiary banks are also subject to lending limits and qualitative requirements on loans to executive officers, directors and principal shareholders of the Parent and its subsidiary banks. \nSource of Strength. \n The FRB has a policy that a BHC is expected to act as a source of financial and managerial strength to each of its subsidiary banks and, under appropriate circumstances, to commit resources to support each such subsidiary bank. This support may be required at times when the BHC may not have the resources to provide the support.\nThe OCC may order an assessment of the Parent if the capital of one of its national bank subsidiaries were to become impaired. If the Parent failed to pay the assessment within three months, the OCC could order the sale of the Parent’s stock in the national bank to cover the deficiency.\nDepositor Preference.\n  In the event of the “liquidation or other resolution” of an insured depository institution, the claims of deposits payable in the United States (including the claims of the FDIC as subrogee of insured depositors) and certain claims for administrative expenses of the FDIC as a receiver will have priority over other general unsecured claims against the institution. If an insured depository institution fails, claims of insured and uninsured U.S. depositors, along with claims of the FDIC, will have priority in payment ahead of unsecured creditors, including the Parent, and depositors whose deposits are solely payable at such insured depository institution’s non-U.S. offices.\n \nLiability of Commonly Controlled Institutions.\n  The Company’s subsidiaries include banks in the U.S., such as Wells Fargo Bank, N.A., that are insured by the FDIC. Under the Federal Deposit Insurance Act (FDI Act), insured depository institutions can be held liable for any loss incurred, or reasonably expected to be incurred, by the FDIC due to the default of an insured depository institution controlled by the same BHC, and for any assistance provided by the FDIC to an insured depository institution that is in danger of default and that is controlled by the same BHC. “Default” means generally the appointment of a conservator or receiver. “In danger of default” means generally the existence of certain conditions indicating that a default is likely to occur in the absence of regulatory assistance.\nEnhanced supervision and regulation of systemically important firms\n.  The Dodd-Frank Act grants broad authority to federal banking regulators to establish enhanced supervisory and regulatory requirements for systemically important firms. The FRB has finalized a number of regulations implementing enhanced prudential requirements for large BHCs like Wells Fargo regarding risk-based capital and leverage, risk and liquidity management, single counterparty credit limits, and imposing debt-to-equity limits on any BHC that regulators determine poses a grave threat to the financial stability of the United States. The FRB and OCC have also finalized rules implementing stress testing requirements for large BHCs and national banks. Furthermore, to promote a BHC’s safety and soundness and the financial and operational resilience of its operations, the FRB has finalized guidance regarding effective boards of directors of large BHCs. The OCC, under separate authority, has finalized guidelines establishing heightened governance and risk management standards for large national banks such as Wells Fargo Bank, N.A. The OCC guidelines require covered banks to establish and adhere to a written risk governance framework to manage and control their risk-taking activities. The guidelines also formalize roles and responsibilities for risk management practices within covered banks and create certain risk oversight responsibilities for their boards of directors.\nRegulatory Capital, Leverage and Liquidity Requirements\nThe Company and each of our insured depository institutions are subject to various regulatory capital adequacy and liquidity requirements administered by the FRB and the OCC. The capital rules implement Basel III risk-based capital requirements for U.S. banking organizations and, among other things, establish required minimum ratios relating capital to different categories of assets and exposures. Federal banking regulators have also imposed a leverage ratio and supplementary leverage ratio on large BHCs, like Wells Fargo, and their insured depository institutions, as well as a liquidity coverage ratio and a net stable funding ratio. In addition, the Company is required to have a minimum amount of equity and unsecured long-term debt, often \n3\nreferred to as total loss absorbing capacity, for purposes of resolvability and resiliency.\nFrom time to time, federal banking regulators propose changes and amendments to, and issue interpretations of, risk-based capital requirements and related reporting instructions. In addition, the FRB closely monitors capital levels of the institutions it supervises and may require such institutions to modify capital levels based on FRB determinations. Such determinations, proposals or interpretations could, if implemented in the future, affect our reported capital ratios and net risk-adjusted assets.\nAs an additional means to identify problems in the financial management of depository institutions, the FDI Act requires federal banking regulators to establish certain non-capital safety and soundness standards for institutions for which they are the primary federal regulator. The standards relate generally to operations and management, asset quality, interest rate exposure, executive compensation and risk management. Federal banking regulators are authorized to take action against institutions that fail to meet such standards.\nThe FDI Act requires federal banking regulators to take “prompt corrective action” with respect to FDIC-insured depository institutions that do not meet minimum capital requirements. A depository institution’s treatment for purposes of the prompt corrective action provisions will depend upon how its capital levels compare to various capital measures and certain other factors, as established by regulation.\nIn addition, the FRB’s capital plan rule establishes capital planning and other requirements that govern capital distributions, including dividends and share repurchases, by certain BHCs, including Wells Fargo. Federal banking regulators also require stress tests to evaluate whether an institution has sufficient capital to continue to operate during periods of adverse economic and financial conditions.\nFor additional information on our capital requirements and planning, as well as the leverage and liquidity rules applicable to us, see the “Capital Management” and “Risk Management – Asset/Liability Management – Liquidity Risk and Funding – Liquidity Standards” sections in the 2024 Annual Report to Shareholders.\n“Living Will” Requirements and Related Matters\nLiving Will\n.  Rules adopted by the FRB and the FDIC under the Dodd-Frank Act require large financial institutions, including Wells Fargo, to prepare and periodically submit resolution plans, also known as “living wills,” designed to facilitate their rapid and orderly resolution in the event of material financial distress or failure. Under the rules, rapid and orderly resolution means a reorganization or liquidation of a covered company under the U.S. Bankruptcy Code that can be accomplished in a reasonable period of time and in a manner that substantially mitigates the risk that failure would have serious adverse effects on the financial stability of the United States. In addition to the Company’s resolution plan, Wells Fargo Bank, N.A. (the “Bank”) is also required to prepare and periodically submit a resolution plan. If the FRB and FDIC determine that our resolution plan has deficiencies, they may impose more stringent capital, leverage or liquidity requirements on us or restrict our growth, activities or operations until we adequately remedy the deficiencies. If the FRB and FDIC ultimately determine that we have been unable to remedy any deficiencies, they could require us to divest certain assets or operations. On June 21, 2024, the FRB and FDIC announced that the Company’s most recent resolution plan did not have any shortcomings or deficiencies. \nIf Wells Fargo were to fail, it may be resolved in a bankruptcy proceeding or, if certain conditions are met, under the resolution regime created by the Dodd-Frank Act known as the “orderly liquidation authority.” The orderly liquidation authority allows for the appointment of the FDIC as receiver for a systemically important financial institution that is in default or in danger of default if, among other things, the resolution of the institution under the U.S. Bankruptcy Code would have serious adverse effects on financial stability in the United States. If the FDIC is appointed as receiver for the Parent, then the orderly liquidation authority, rather than the U.S. Bankruptcy Code, would determine the powers of the receiver and the rights and obligations of our security holders. The FDIC’s orderly liquidation authority requires that security holders of a company in receivership bear all losses before U.S. taxpayers are exposed to any losses. There are substantial differences in the rights of creditors between the orderly liquidation authority and the U.S. Bankruptcy Code, including the right of the FDIC to disregard the strict priority of creditor claims under the U.S. Bankruptcy Code in certain circumstances and the use of an administrative claims procedure instead of a judicial procedure to determine creditors’ claims. \nThe strategy described in our most recent resolution plan is a single point of entry strategy, in which the Parent would be the only material legal entity to enter resolution proceedings. However, the strategy described in our resolution plan is not binding in the event of an actual resolution of Wells Fargo, whether conducted under the U.S. Bankruptcy Code or by the FDIC under the orderly liquidation authority. The FDIC has announced that a single point of entry strategy may be a desirable strategy under its implementation of the orderly liquidation authority, but not all aspects of how the FDIC might exercise this authority are known and additional rulemaking is possible.\nTo facilitate the orderly resolution of systemically important financial institutions in case of material distress or failure, federal banking regulations require that institutions, such as Wells Fargo, maintain a minimum amount of equity and unsecured debt to absorb losses and recapitalize operating subsidiaries. Federal banking regulators have also required measures to facilitate the continued operation of operating subsidiaries notwithstanding the failure of their parent companies, such as limitations on parent guarantees, and have issued guidance encouraging institutions to take legally binding measures to provide capital and liquidity resources to certain subsidiaries to facilitate an orderly resolution.\nSupport Agreement\n.  In response to the regulators’ guidance and to facilitate the orderly resolution of the Company, on June 28, 2017, the Parent entered into a support agreement, as amended and restated on June 26, 2019 (the “Support Agreement”), with WFC Holdings, LLC, an intermediate holding company and subsidiary of the Parent (the “IHC”), the Bank, Wells Fargo Securities, LLC (WFS), Wells Fargo Clearing Services, LLC (WFCS), and certain other subsidiaries of the Parent designated from time to time as material entities for resolution planning purposes (the “Covered Entities”) or identified from time to time as related support entities in our resolution plan (the “Related Support Entities”). Pursuant to the Support Agreement, the Parent transferred a significant amount of its assets, including the majority of its cash, deposits, liquid securities and intercompany loans (but excluding its equity interests in its subsidiaries and certain other assets), to the IHC and will continue to transfer those types of assets to the IHC from time to time. In the event of our material financial distress or failure, \n4\nthe IHC will be obligated to use the transferred assets to provide capital and/or liquidity to the Bank, WFS, WFCS, and the Covered Entities pursuant to the Support Agreement. Under the Support Agreement, the IHC will also provide funding and liquidity to the Parent through subordinated notes and a committed line of credit, which, together with the issuance of dividends, is expected to provide the Parent, during business as usual operating conditions, with the same access to cash necessary to service its debts, pay dividends, repurchase its shares, and perform its other obligations as it would have had if it had not entered into these arrangements and transferred any assets. If certain liquidity and/or capital metrics fall below defined triggers, or if the Parent’s board of directors authorizes it to file a case under the U.S. Bankruptcy Code, the subordinated notes would be forgiven, the committed line of credit would terminate, and the IHC’s ability to pay dividends to the Parent would be restricted, any of which could materially and adversely impact the Parent’s liquidity and its ability to satisfy its debts and other obligations, and could result in the commencement of bankruptcy proceedings by the Parent at an earlier time than might have otherwise occurred if the Support Agreement were not implemented. The respective obligations under the Support Agreement of the Parent, the IHC, the Bank, and the Related Support Entities are secured pursuant to a related security agreement.\nRecovery Plan\n.  In addition to our resolution plans, we must also prepare and periodically submit to the FRB a recovery plan that identifies a range of options that we may consider during times of idiosyncratic or systemic economic stress to remedy any financial weaknesses and restore market confidence without extraordinary government support. Recovery options include the possible sale, transfer or disposal of assets, securities, loan portfolios or businesses. The Bank must also prepare and periodically submit to the OCC a recovery plan that sets forth the Bank’s plan to remain a going concern when the Bank is experiencing considerable financial or operational stress, but has not yet deteriorated to the point where liquidation or resolution is imminent. If either the FRB or the OCC determines that our recovery plan is deficient, they may impose fines, restrictions on our business or ultimately require us to divest assets.\nDividend and Share Repurchase Restrictions\nThe Parent is a legal entity separate and distinct from its subsidiary banks and other subsidiaries. A significant source of funds to pay dividends on our common and preferred stock and principal and interest on our debt is dividends from the Parent’s subsidiaries. Various federal and state statutory provisions and regulations limit the amount of dividends the Parent’s subsidiary banks and certain other subsidiaries may pay without regulatory approval. Federal banking regulators have the authority to prohibit the Parent’s subsidiary banks from engaging in unsafe or unsound practices in conducting their businesses. The payment of dividends, depending on the financial condition of the bank in question, could be deemed an unsafe or unsound practice. Similarly, as part of their supervisory authority, regulators may limit or restrict subsidiary capital distributions. The ability of the Parent’s subsidiary banks to pay dividends in the future is currently, and could be further, influenced by bank regulatory policies and capital requirements. For information about the restrictions applicable to the Parent’s subsidiary banks, see\nNote 26 (Regulatory Capital Requirements and Other Restrictions) to Financial Statements in the 2024 Annual Report to Shareholders.\nFurthermore, under the Support Agreement, the IHC may be restricted from making dividend payments to the Parent if certain liquidity and/or capital metrics fall below defined triggers, or if the Parent’s board of directors authorizes it to file a case under the U.S. Bankruptcy Code. Any such restriction could materially and adversely impact the Parent’s liquidity and its ability to satisfy its debt and other obligations, as well as its ability to make dividend payments on its common and preferred stock. See the “Risk Factors” section of the 2024 Annual Report to Shareholders for additional information on the Support Agreement.\nIn addition to these restrictions on the ability of our subsidiary banks to pay dividends to us, the FRB requires large BHCs, including Wells Fargo, to submit annual capital plans describing planned capital distributions, such as the payment of dividends and share repurchases. Large BHCs, like Wells Fargo, and their insured depository institutions also must comply with various capital requirements, including the reforms known as Basel III, as well as rules that establish leverage and supplementary leverage ratio requirements. We are also subject to the FRB's rule implementing an additional capital surcharge on those U.S. banking organizations, such as the Company, that are designated as global systemically important banks (G-SIBs). The failure to meet any of these requirements could result in limitations or restrictions on our ability to make capital distributions.\nIn addition, the FRB’s enhanced supervision regulations for large BHCs, like Wells Fargo, impose capital distribution restrictions, including on the payment of dividends, upon the occurrence of capital, stress test, risk management, or liquidity risk management triggers. For additional information on regulations or arrangements that may impose capital distribution restrictions on the Company and its subsidiaries, see the “Capital Management” and “Risk Factors” sections of the 2024 Annual Report to Shareholders.\nDeposit Insurance Assessments\nThe Company’s subsidiaries include banks, such as Wells Fargo Bank, N.A., that are insured by the FDIC. Through the Deposit Insurance Fund (DIF) maintained by the FDIC, the FDIC insures the deposits of our insured banks up to prescribed limits for each depositor and funds the DIF through assessments on member banks. To maintain the DIF, member institutions are assessed an insurance premium based on an assessment base and an assessment rate.\nThe FDIC has adopted a comprehensive, long-range plan for DIF management, targeting a designated reserve ratio of 2%. In addition, the FDIC may recover by special assessment on member banks losses to the DIF as a result of resolving a failed bank. For additional information about our FDIC deposit assessment expense, see Note 21 (Revenue and Expenses) to Financial Statements in the 2024 Annual Report to Shareholders.\nThe FDIC may terminate a depository institution’s deposit insurance upon a finding that the institution’s financial condition is unsafe or unsound or that the institution or its directors have engaged in unsafe or unsound practices or have violated any applicable law, regulation, order or condition enacted or imposed by the institution’s regulatory agency. The termination of deposit insurance for one or more of our bank subsidiaries could result in a significant loss of deposits and have a material adverse effect on our liquidity and earnings, depending on the collective size of the particular banks involved.\n5\nFiscal and Monetary Policies\nOur business and earnings are affected significantly by the fiscal and monetary policies of the federal government and its agencies. We are particularly affected by the monetary policies of the FRB, which regulates the supply of money and credit in the United States. Among the instruments of monetary policy available to the FRB are (a) conducting open market operations in United States government securities, (b) changing the discount rates of borrowings of depository institutions, (c) imposing or changing reserve requirements against depository institutions’ deposits, and (d) imposing or changing reserve requirements against certain borrowings by banks and their affiliates. These methods are used in varying degrees and combinations to directly affect the availability of bank loans and deposits, as well as the interest rates charged on loans and paid on deposits. The policies of the FRB may have a material effect on our business, results of operations and financial condition.\nPrivacy Provisions and the Sharing of Personal Financial Data\nFederal banking regulators, as required under the Gramm-Leach-Bliley Act (GLB Act), have adopted rules limiting the ability of banks and other financial institutions to disclose nonpublic information about consumers to nonaffiliated third parties. The rules require disclosure of privacy policies to consumers and, in some circumstances, allow consumers to prevent disclosure of certain personal information to nonaffiliated third parties. The privacy provisions of the GLB Act affect how consumer information is transmitted through diversified financial services companies and conveyed to outside vendors. The Fair Credit Reporting Act imposes requirements regarding sharing certain information about consumers among affiliated companies. Under these requirements, consumers have the option to opt out from affiliated companies sharing certain information among the affiliates, depending on the information and purpose of sharing.\nPersonal Financial Data Rights.  \nIn October 2024, the CFPB issued a rule pursuant to section 1033 of the Dodd-Frank Act that requires financial service providers to make consumers’ data available upon request to consumers and authorized third parties. The compliance date for the rule is April 1, 2026. The rule will require the Company to update its technology systems, compliance, third-party risk management programs, and digital channels. Given the rule’s requirement to share customer information\n \nwith authorized third parties, some of whom could be non-financial institutions, the rule could result in increased fraud, data misuse, and competition.\nRegulation of Consumer Financial Products\nConsumer financial products are subject to numerous and, in many cases, highly complex federal and state consumer protection laws and regulations, as well as enhanced regulatory scrutiny and expectations. In particular, the CFPB implements and enforces regulations designed to ensure that consumers receive timely, clear, and accurate disclosures regarding financial products and are protected from unfair, deceptive or abusive practices. The CFPB has issued and proposed a number of rules impacting consumer financial products, including rules impacting residential mortgage lending, credit cards, and other financial products and banking related activities, as well as the fees that may be charged for certain banking products and services. In addition to these rulemaking activities, the CFPB may conduct ongoing supervisory examination activities of the financial services industry with respect to a number of consumer businesses and products, including mortgage lending and servicing, fair lending requirements, and auto finance.\nRegulation of Swaps and Other Derivatives Activities\nThe CFTC and the SEC have adopted comprehensive sets of rules regulating swaps and security-based swaps, respectively, and the OCC and other federal regulatory agencies have adopted margin requirements for uncleared swaps and security-based swaps. As a registered swap dealer and a conditionally-registered security-based swap dealer, Wells Fargo Bank, N.A., is subject to these rules. \nRegulatory Developments Related to Climate Change and Sustainability\nFederal, state, and non-U.S. governments and government agencies have demonstrated increased attention to the impacts and potential risks associated with climate change and sustainability-related activities. For example, federal banking regulators are reviewing the implications of climate change on the financial stability of the United States and have issued guidance on the identification and management by large banks of climate-related financial risks. In addition, the SEC adopted final rules, which have been voluntarily stayed pending legal proceedings, requiring public companies to disclose certain climate-related information, including climate-related risks and impacts, certain greenhouse gas emissions, climate-related targets and goals, and governance of climate-related risks and relevant risk management processes. Similarly, California finalized climate-related disclosure laws, while multiple other states have proposed or adopted laws and guidance with requirements for, or restrictions on, sustainability-related initiatives or disclosures. Additionally, the European Union finalized its Corporate Sustainability Reporting Directive (CSRD) requiring companies to assess climate risks, opportunities, and impacts as well as disclose certain climate-related information, and also finalized its Corporate Sustainability Due Diligence Directive (CSDDD) requiring companies to adopt and implement a transition plan for climate change mitigation. The approaches taken by various governments and government agencies can vary significantly, evolve over time, and sometimes conflict. Any current or future rules, regulations, and guidance related to climate change and its impacts could require us to change certain of our business practices or strategies, reduce our revenue and earnings, impose additional costs on us, subject us to legal or regulatory proceedings, or otherwise adversely affect our business operations and/or competitive position.\nSarbanes-Oxley Act of 2002\nThe Sarbanes-Oxley Act of 2002 (Sarbanes-Oxley) implemented a broad range of corporate governance and accounting measures designed to increase corporate responsibility, provide for enhanced penalties for accounting and auditing improprieties at publicly traded companies, and protect investors by improving the accuracy and reliability of disclosures under federal securities laws. We are subject to Sarbanes-Oxley because we are required to file periodic reports with the SEC under the Securities Exchange Act of 1934. Among other things, Sarbanes-Oxley and/or its implementing regulations established membership requirements and additional responsibilities for our audit committee, imposed restrictions on the relationship between us and our outside auditors (including restrictions on the types of non-audit services our auditors may provide to us), imposed additional responsibilities for our external financial statements on our chief executive officer and chief financial officer, expanded the disclosure requirements for our corporate insiders, required our management to evaluate our disclosure controls and procedures and our internal control over financial reporting, and \n6\nrequired our independent registered public accounting firm to issue a report on our internal control over financial reporting.\nUSA PATRIOT Act\nThe Uniting and Strengthening America by Providing Appropriate Tools Required to Intercept and Obstruct Terrorism Act of 2001 (USA PATRIOT Act) is intended to strengthen the ability of U.S. law enforcement agencies and intelligence communities to work together to combat terrorism on a variety of fronts. The USA PATRIOT Act has significant implications for depository institutions, brokers, dealers and other businesses involved in the transfer of money. The USA PATRIOT Act requires the implementation of policies and procedures relating to anti-money laundering, economic sanctions, suspicious activities, and currency transaction reporting and due diligence on customers. The USA PATRIOT Act also requires federal banking regulators to evaluate the effectiveness of an applicant in combating money laundering in determining whether to approve a proposed bank acquisition.\nOther Regulatory Related Matters\nThe Company is subject to a number of consent orders and other regulatory actions, which may require the Company, among other things, to undertake certain changes to its business, operations, products and services, and risk management practices. For a discussion of certain consent orders and other regulatory actions applicable to the Company, see the “Overview” section in the 2024 Annual Report to Shareholders.\nFuture Legislation or Regulation\nEconomic, market and political conditions during the past several years have led to a significant amount of legislation and regulation in the U.S. and abroad affecting the financial services industry, as well as heightened expectations and scrutiny of financial services companies from banking regulators. Further legislative changes and additional regulations may change our operating environment in substantial and unpredictable ways. Such legislation and regulations could increase our cost of doing business, affect our compensation structure, restrict or expand the activities in which we may engage or affect the competitive balance among banks, savings associations, credit unions, and other financial institutions. We cannot predict whether future legislative proposals will be enacted and, if enacted, the effect that they, or any implementing regulations, would have on our business, results of operations or financial condition.\nADDITIONAL INFORMATION\nAdditional information in response to this Item 1 can be found in the 2024 Annual Report to Shareholders under “Financial Review” and under “Financial Statements.” That information is incorporated into this item by reference.",
    "item1a": "Item 1A can be found in this report under Item 1 and in the 2024 Annual Report to Shareholders under “Financial Review – Risk Factors.” That information is incorporated into this item by reference.",
    "item1b": "ITEM 1B.\nUNRESOLVED STAFF COMMENTS\nNot applicable.",
    "item1c": "Item 1C can be found in the 2024 Annual Report to Shareholders under “Financial Review – Risk Management – Operational Risk Management.” That information is incorporated into this item by reference.\n7"
  }
}