{
  "ticker": "WMB",
  "cik": "0000107263",
  "company_name": "WILLIAMS COMPANIES, INC.",
  "filing_date": "2025-02-25",
  "accession": "0000107263-25-000031",
  "primary_doc": "wmb-20241231.htm",
  "item_sections": {
    "item1": "Item 1.\n \nBusiness\nThis report includes information for multiple registrants, specifically The Williams Companies, Inc. (Williams), as well as Transcontinental Gas Pipe Line Company, LLC (Transco) and Northwest Pipeline LLC (NWP) both of which are wholly owned subsidiaries of Williams (collectively, the Registrants). References to subsidiaries by name, including equity-method investees, Transco, and NWP, refer exclusively to those businesses and operations.\nGeneral\nWilliams is an energy company committed to being the leader in providing infrastructure that safely delivers natural gas products to reliably fuel the clean energy economy. Williams has operations in 12 supply areas that provide natural gas gathering, processing, and transmission services; NGLs fractionation, transportation, and storage services; and marketing services to approximately 800 customers. Williams owns an interest in and operates over 33,000 miles of pipelines in 24 states, 34 natural gas processing facilities, 9 NGL fractionation facilities, approximately 25 million barrels of NGL storage capacity, and 417 Bcf of natural gas storage capacity, and delivers natural gas that is used every day for clean-power generation, heating, and industrial use. \nWilliams was founded in 1908, originally incorporated under the laws of the state of Nevada in 1949 and reincorporated under the laws of the state of Delaware in 1987. Its common stock trades on the New York Stock Exchange under the symbol “WMB.” Its operations are located in the United States. Williams’ headquarters are located in Tulsa, Oklahoma, with other major offices in Houston, Texas; Pittsburgh, Pennsylvania; and Salt Lake City, Utah.\nTransco owns and operates an approximately 9,700-mile natural gas pipeline system extending from Texas, Louisiana, Mississippi and the Gulf of America through Alabama, Georgia, South Carolina, North Carolina, Virginia, Maryland, Delaware, Pennsylvania and New Jersey to the New York City metropolitan area. The system serves customers in Texas and the 12 southeast and Atlantic seaboard states mentioned above, including major metropolitan areas in Georgia, Washington D.C., Maryland, North Carolina, New York, New Jersey, and Pennsylvania. Transco’s principal business is the interstate transportation of natural gas, which is regulated by the FERC.\nNWP owns and operates an approximately 3,900-mile natural gas pipeline system, extending from the San Juan basin in northwestern New Mexico and southwestern Colorado through Colorado, Utah, Wyoming, Idaho, Oregon, and Washington to a point on the Canadian border near Sumas, Washington. The system serves customers in Washington, Oregon, Idaho, Wyoming, Nevada, Utah, Colorado, New Mexico, California, and Arizona, either directly or indirectly through interconnections with other pipelines. NWP’s principal business is the interstate transportation of natural gas, which is regulated by FERC.\n4\nService Assets, Customers, and Contracts\nKey variables for Williams’ businesses will continue to be: \n•\nObstacles to Williams’ expansion efforts, including delays or denials of necessary permits and opposition to hydrocarbon-based energy development;\n•\nProducer drilling activities impacting natural gas supplies supporting Williams’ gathering and processing volumes;\n•\nRetaining and attracting customers by continuing to provide reliable services;\n•\nRevenue growth associated with additional infrastructure either completed or currently under construction;\n•\nPrices impacting Williams’ commodity-based activities; \n•\nDisciplined growth in Williams’ service areas. \n5\nInterstate Natural Gas Pipeline Assets\nWilliams’ interstate natural gas pipelines, which are presented in the Transmission & Gulf of America segment as described under the heading “Business Segments,” are subject to regulation by the FERC and as such, rates and charges for the transportation of natural gas in interstate commerce are subject to regulation. The rates are established primarily through the FERC’s ratemaking process, but rates may also be negotiated with customers pursuant to the terms of tariffs and FERC policy.\nWilliams’ interstate natural gas pipelines transport and store natural gas for a broad mix of customers, including local natural gas distribution companies, public utilities, municipalities, direct industrial users, electric power generators, and natural gas marketers and producers. Most of Williams’ interstate natural gas transmission businesses are fully contracted under long-term firm reservation contracts with high credit quality customers. These contracts have various expiration dates and account for the major portion of these regulated businesses. Additionally, Williams offers storage services and interruptible transportation services under shorter-term agreements. The top ten customers of the interstate natural gas pipelines in 2024 accounted for approximately 45 percent of Williams’ regulated interstate natural gas transportation and storage revenues.\nTransco’s three largest customers in 2024 accounted for approximately 20 percent of Transco’s total operating revenues. Transco’s firm transportation agreements are generally long-term agreements with various expiration dates and account for the major portion of its business.\nDuring 2024, NWP’s three largest customers were Puget Sound Energy, Inc., Cascade Natural Gas Corporation, and Northwest Natural Gas Company, which accounted for approximately 31 percent, 10 percent, and 11 percent, respectively, of NWP total operating revenues for the year ended December 31, 2024. No other customer accounted for more than 10 percent of NWP total operating revenues during that period.\n6\nNatural Gas Gathering and Processing Assets\nWilliams’ gathering, processing, and treating operations are presented within the Transmission & Gulf of America, Northeast G&P, and West reporting segments as described under the heading “Business Segments.”\nWilliams’ gathering systems receive natural gas from producers’ crude oil and natural gas wells and gather these volumes to gas processing, treating, or redelivery facilities. Typically, natural gas, in its raw form, is not acceptable for transportation in major interstate natural gas pipelines or for commercial use as a fuel. Williams’ treating facilities remove water vapor, carbon dioxide, and other contaminants, and collect condensate. Williams is generally paid a fee based on the volume of\n \nnatural gas gathered and/or treated, generally measured in the Btu heating value.\nIn addition, natural gas contains various amounts of NGLs, which generally have a higher value when separated from the natural gas stream. Williams’ processing plants extract the NGLs, which include ethane, primarily used in the petrochemical industry; propane, used for heating, fuel, and also in the petrochemical industry; and, normal butane, isobutane, and natural gasoline, primarily used by the refining industry.\nWilliams’ gas processing services generate revenues primarily from the following types of contracts:\n•\nFee-based: A cash fee is received based on the volume of natural gas processed, generally measured in the Btu heating value. A portion of Williams’ fee-based processing revenue includes a share of the margins on the NGLs produced. For the year ended December 31, 2024, approximately 95 percent of NGL production volumes were under fee-based contracts.\n•\nNoncash commodity-based: Gas is also processed under two types of commodity-based contracts, keep-whole and percent-of-liquids, where consideration for services is received in the form of NGLs. For a keep-whole arrangement Williams replaces the Btu content of the retained NGLs with natural gas purchases, also known as shrink replacement gas. For a percent-of-liquids arrangement, Williams delivers an agreed-upon percentage of the extracted NGLs and retains the remainder. Retained NGLs, referred to as  equity NGL production, are then sold. Per-unit NGL margins are calculated based on sales of these equity volumes at the processing plants. For the year ended December 31, 2024, approximately 5 percent of NGL production volumes were under noncash commodity-based contracts. \nGenerally, Williams’ gathering and processing agreements are long-term agreements, with terms ranging from month-to-month to the life of the producing lease. Certain contracts include cost-of-service mechanisms that are designed to support a return on invested capital and allow gathering rates to be adjusted, subject to specified caps in certain cases, to account for variability in volume, capital expenditures, commodity price fluctuations, compression, and other expenses. Williams also has certain gas gathering and processing agreements with MVC, whereby the customer is obligated to pay a contractually determined fee based on any shortfall between the actual gathered and processed volumes and the MVC for a stated period.\nDemand for gas gathering and processing services is dependent on producers’ drilling activities, which is impacted by the strength of the economy, commodity prices, and the resulting demand for natural gas by manufacturing and industrial companies and consumers. Williams’ gathering, processing, and treating businesses do not have direct exposure to crude oil prices. Williams’ on-shore natural gas gathering and processing businesses are substantially focused on gas-directed drilling basins rather than crude oil, with a broad diversity of basins and customers served. Declines in crude oil drilling would be expected to result in less associated natural gas production, which could drive more demand for natural gas produced from gas-directed basins served. \nDuring 2024, Williams’ facilities gathered and processed gas for approximately 248 customers. The top ten customers accounted for approximately 59 percent of gathering and processing fee revenues and NGL margins from noncash commodity-based agreements. Williams believes counterparty credit concerns in its gathering and processing businesses are significantly mitigated by the physical nature of Williams’ services, where gathering occurs at the wellhead and therefore is critical to a producer’s ability to move product to market.\n7\nGas and NGL Marketing\nWilliams’ natural gas and NGL marketing services are presented primarily within its Gas & NGL Marketing Services segment. Williams markets natural gas and NGL products to a wide range of users in the energy and petrochemical industries. In 2024, the three largest natural gas marketing customers accounted for approximately 10 percent of Williams’ gross natural gas marketing sales, and the three largest NGL marketing customers accounted for approximately 37 percent of Williams’ NGL marketing sales.\nWilliams’ gas marketing business markets natural gas and provides natural gas asset management and wholesale marketing, trading, storage, and transportation for a diverse set of natural gas and electric utilities, municipalities, power generators, and producers, including for Williams’ upstream properties. Additionally, Williams’ gas marketing business moves and optimizes natural gas to markets through transportation and storage agreements on Williams’ own strategically positioned assets. Williams’ gas and NGL marketing services provide customers with access to diverse sources of supply and to various natural gas demand markets, including the southeastern and Gulf Coast regions which are the fastest growing natural gas demand regions in the United States. \nWilliams purchases natural gas for storage when the current market price paid to buy and transport natural gas plus the cost to store and finance the natural gas is less than an estimated, forward market price that can be received in the future, resulting in positive net product sales. Commodity-based exchange-traded futures contracts and over-the-counter (OTC) contracts are used to sell natural gas at that future price to substantially protect the natural gas revenues that will ultimately be realized when the stored natural gas is sold. Additionally, Williams enters into transactions to secure transportation capacity between delivery points in order to serve Williams’ customers and various markets. Commodity-based exchange-traded futures contracts and OTC contracts are used to capture the price differential or spread between the locations served by the capacity in order to substantially protect the natural gas revenues that will ultimately be realized when the physical flow of natural gas between receipt and delivery points occurs. \nMonthly demand charges incurred for the contracted storage and transportation capacity and payments associated with asset management agreements are substantially indirectly reimbursed by customers. As Williams is acting as an agent, natural gas marketing revenues are presented net of the related costs of those activities. In addition, all of Williams’ natural gas marketing derivative activities qualify as held for trading purposes, which requires net presentation in Williams Consolidated Statement of Income.\nWilliams’ NGL marketing business transports and markets equity NGLs from the production at Williams’ processing plants, NGLs from the production at Williams’ upstream properties, and also NGLs on behalf of third-party NGL producers, including some of our fee-based processing customers, as well as the NGL volumes owned by certain of Williams’ equity-method investments. The NGL marketing business bears the risk of price changes in these NGL volumes while they are being transported to final sales delivery points. In order to meet sales contract obligations, Williams may purchase products in the spot market for resale.\nWilliams is exposed to commodity price risk. To manage this volatility, various contracts are used in the marketing and trading activities that generally meet the definition of derivatives. Williams enters into commodity-related derivatives to hedge exposures to natural gas and NGLs and retain exposure to price changes that can, in a volatile energy market, be material and can adversely affect results of operations.\nWilliams experiences significant earnings volatility from the fair value accounting required for the derivatives used to hedge a portion of the economic value of the underlying transportation and storage portfolio as well as upstream related production. However, the unrealized fair value measurement gains and losses are generally offset by valuation changes in the economic value of the underlying production or transportation and storage contracts, which is not recognized until the underlying transaction occurs.\nCrude Oil Transportation and Production Handling Asset\ns\nWilliams’ crude oil transportation operations, which are primarily presented in the Transmission & Gulf of America segment as described under the heading “Business Segments,” earn revenues primarily from a combination of fixed-monthly fees, contractual fixed or variable fees applied to production volumes, and contributions in aid of \n8\nconstruction (CIAC) arrangements. Generally, fixed-monthly fees associated with production handling and export revenues are recognized on a units-of-production basis utilizing either contractually determined maximum daily quantities or expected remaining production. CIAC arrangements are recognized on a units of production basis, utilizing expected remaining production. Williams’ crude oil transportation business is supported mostly by major oil producers with long-cycle perspectives.  \nStandalone, Market-Based Rate Natural Gas Storage Assets\nWilliams’ standalone, market-based rate natural gas storage assets are presented in the Transmission & Gulf of America segment as described under the heading “Business Segments” and include Williams’ North Texas Assets (NorTex) acquired in August 2022 and Williams’ Gulf Coast storage assets acquired in January 2024. These natural gas storage assets provide natural gas storage services in interstate commerce under the jurisdiction of the FERC pursuant to the Natural Gas Act or Section 311 of the Natural Gas Policy Act. Williams is authorized to charge and collect market-based rates for all of the services that these natural gas storage assets provide. \nWilliams stores natural gas for a broad mix of customers, including local natural gas distribution companies, public utilities, municipalities, direct industrial users, electric power generators, and natural gas marketers and producers. Most of these natural gas storage businesses are fully contracted under long-term firm reservation contracts with high credit quality customers. The contracts have various expiration dates and account for the major portion of the entities’ businesses. The three largest customers of this business in 2024 accounted for approximately 21 percent of its total operating revenues.\nBusiness Segments\nConsistent with the manner in which Williams’ chief operating decision maker evaluates performance and allocates resources, Williams’ operations are conducted, managed, and presented in Part I of this Annual Report within the following reportable segments: Transmission & Gulf of America, Northeast G&P, West, and Gas & NGL Marketing Services. All remaining business activities, including upstream operations, certain new energy ventures, and corporate activities, are included in Other. \nWilliams’ reportable segments are comprised of the following business activities:\n•\nTransmission & Gulf of America is comprised of the Transco, NWP, and MountainWest interstate natural gas pipelines, and their related natural gas storage facilities, as well as natural gas gathering and processing and crude oil production handling and transportation assets in the Gulf Coast region, including  Discovery, a former 60 percent equity-method investment in which Williams acquired the remaining ownership interest in August 2024, a 51 percent interest in Gulfstar One LLC (Gulfstar One), and a 50 percent equity-method investment in Gulfstream Natural Gas System, L.L.C. (Gulfstream). Transmission & Gulf of America also includes natural gas storage facilities and pipelines providing services in north Texas, Louisiana, and Mississippi.\n•\nNortheast G&P is comprised of midstream gathering, processing, and fractionation businesses in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio, as well as a 65 percent interest in Ohio Valley Midstream LLC (Northeast JV) which operates in West Virginia, Ohio, and Pennsylvania, a 66 percent interest in Cardinal Gas Services, L.L.C. (Cardinal) which operates in Ohio, a 69 percent equity-method investment in Laurel Mountain Midstream, LLC (Laurel Mountain), a 50 percent equity-method investment in Blue Racer Midstream LLC (Blue Racer), and Appalachia Midstream Investments.\n•\nWest is comprised of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of south Texas, the Haynesville Shale region of east Texas and northwest Louisiana, the Mid-Continent region which includes the Anadarko and Permian basins, and the DJ Basin of Colorado which includes RMM, a former 50 percent equity-method investment in which Williams acquired the remaining ownership interest in November 2023. This segment also includes NGL storage facilities, an undivided 50 percent interest in \n9\nan NGL fractionator near Conway, Kansas, and a 50 percent equity-method investment in Overland Pass Pipeline Company LLC (OPPL). \n•\nGas & NGL Marketing Services is comprised of NGL and natural gas marketing and trading operations, which includes risk management and transactions related to the storage and transportation of natural gas and NGLs on strategically positioned assets.   \nDetailed discussion of each of our reportable segments follows. For a discussion of ongoing expansion projects, see Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nTransmission & Gulf of America\nInterstate Natural Gas Pipeline Assets\nTransco\nAt December 31, 2024, Transco’s system had a design capacity totaling approximately 19.8 MMdth/d. During 2024, Transco began full service on the Regional Energy Access expansion project which added approximately 0.4 MMdth/d of firm transportation capacity to its pipeline, partial early service on the Southside Reliability Enhancement expansion project which added approximately 0.4 MMdth/d of firm transportation capacity, and full service on Carolina Market Link expansion project which added approximately 0.1 MMdth/d of firm transportation capacity. In addition, a reduction of approximately 0.1 MMdth/d of firm transportation capacity is attributable to unsubscribed capacity as well as a reduction of approximately 0.1 MMdth/d of firm transportation capacity is attributable to termination of interim service related to the Regional Energy Access expansion project. Transco’s system includes 61 compressor stations, four underground storage fields, and one LNG storage facility. Compression facilities at sea level-rated capacity total approximately 2.6 million horsepower.\nTransco has natural gas storage capacity in four underground storage fields located on or near its pipeline system or market areas and operates two of these storage fields. Transco also has storage capacity in an LNG storage facility that it owns and operates. The total usable gas storage capacity available to Transco and its customers in such underground storage fields and LNG storage facility and through storage service contracts is approximately 188 Bcf of natural gas. At December 31, 2024, Transco’s customers had stored in its facilities approximately 137 Bcf of natural gas. Storage capacity permits Transco’s customers to inject gas into storage during the summer and off-peak periods for delivery during peak winter demand periods.\nNWP\nAt December 31, 2024, NWP’s system had a design capacity totaling approximately 3.8 MMdth/d. NWP’s system includes 42 transmission compressor stations having a combined sea level-rated capacity of approximately 476,000 horsepower.  \nNWP owns a one-third undivided interest in the Jackson Prairie underground storage facility in Washington. NWP also owns and operates an LNG storage facility in Washington. These storage facilities have an aggregate working natural gas storage capacity of approximately 10 Bcf. NWP also contracts for natural gas storage services for approximately 3 Bcf at the Clay basin underground storage reservoir with a Williams’ affiliate, MountainWest. These natural gas storage facilities, which are substantially utilized for third-party natural gas, enable NWP to balance daily receipts and deliveries and provide storage services to customers.\nMountainWest Acquisition\nOn February 14, 2023, Williams closed on the acquisition of 100 percent of MountainWest Pipelines Holding Company. MountainWest is an interstate natural gas transmission company that owns and operates an approximately 2,000-mile natural gas pipeline system which is regulated by the FERC. At December 31, 2024, MountainWest’s system has a design capacity totaling 8.0 MMdth/d. The system is comprised of MountainWest Pipeline, LLC; MountainWest Overthrust Pipeline, LLC; a 50 percent equity-method interest in White River Hub, LLC; and 64 Bcf of natural gas storage capacity, including the Clay basin underground storage reservoir in Utah. During 2024, MountainWest increased its natural gas storage capacity at the Clay basin underground storage reservoir by \n10\napproximately 8 Bcf. MountainWest is located in the Rocky Mountains near six producing areas, including the Greater Green River basin in Wyoming, the Uinta basin in Utah, and the Piceance basin in Colorado. \nGulfstream\nWilliams owns a 50 percent equity-method investment in Gulfstream, a 745-mile interstate natural gas pipeline system extending from the Mobile Bay area in Alabama to markets in Florida, which has a capacity to transport 1.4 Bcf/d. Operating responsibilities for Gulfstream are shared with the other 50 percent owner.\nStandalone, Market-Based Rate Natural Gas Storage Assets\nGulf Coast Storage Acquisition\nOn January 3, 2024, Williams closed on the Gulf Coast Storage Acquisition. At December 31, 2024, these assets include a strategic portfolio of approximately 230 miles of natural gas transmission pipelines and six underground storage facilities with a capacity of approximately 118 Bcf of natural gas storage across Louisiana and Mississippi and direct access to LNG export facilities and interstate pipelines.  These assets expand Williams’ natural gas storage footprint in the Gulf Coast region. \nNorth Texas Assets (NorTex)\nOn August 31, 2022, Williams purchased a group of assets in north Texas from NorTex Midstream Holdings, LLC. At December 31, 2024, NorTex includes approximately 94 miles of natural gas transmission pipelines and 37 Bcf of natural gas storage in the Dallas-Fort Worth market. In addition to providing gas supply to power generation in north Texas, these assets also provide storage services for Permian gas directed toward growing Gulf Coast LNG demand.\nNatural Gas Gathering and Processing Assets\nThe following tables summarize the significant owned and operated gathering and processing assets of this segment: \nOffshore Natural Gas Gathering Pipelines\nLocation\nPipeline Miles\nInlet Capacity (Bcf/d)\nOwnership Interest\nSupply Basins\nConsolidated: \nCanyon Chief, including Blind Faith and Gulfstar extensions\nDeepwater Gulf of America\n156\n0.5\n100%\nEastern Gulf of America\nNorphlet\nDeepwater Gulf of America\n58\n0.3\n100%\nEastern Gulf of America\nOther Eastern Gulf\nOffshore shelf and other\n46\n0.2\n100%\nEastern Gulf of America\nSeahawk\nDeepwater Gulf of America\n115\n0.4\n100%\nWestern Gulf of America\nPerdido Norte\nDeepwater Gulf of America\n105\n0.3\n100%\nWestern Gulf of America\nWhale\nDeepwater Gulf of America\n26\n0.2\n100%\nWestern Gulf of America\nOther Western Gulf\nOffshore shelf and other\n53\n0.2\n100%\nWestern Gulf of America\nDiscovery\nCentral Gulf of America\n594\n0.6\n100%\nCentral Gulf of America\n11\nNatural Gas Processing Facilities\nLocation\nInlet Capacity (Bcf/d)\nNGL Production Capacity (Mbbls/d)\nOwnership Interest\nSupply Basins\nConsolidated: \nMarkham\nMarkham, TX\n0.5\n45\n100%\nWestern Gulf of America\nMobile Bay\nCoden, AL\n0.7\n35\n100%\nEastern Gulf of America\nDiscovery\nLarose, LA\n0.6\n35\n100%\nCentral Gulf of America\nCrude Oil Transportation and Production Handling Assets \nIn addition to Williams’ natural gas assets, Williams owns and operates four deepwater crude oil pipelines and owns and operates production platforms serving the deepwater in the Gulf of America. Williams’ offshore floating production platforms provide centralized services to deepwater producers such as compression, separation, production handling, water removal, and pipeline landings. \nThe following tables summarize the significant operated crude oil transportation pipelines and production handling platforms of this segment:\n \nCrude Oil Pipelines\nPipeline Miles\nCapacity (Mbbls/d)\nOwnership Interest\nSupply Basins\nConsolidated:\nMountaineer, including Blind Faith and Gulfstar extensions\n155\n150\n100%\nEastern Gulf of America\nBANJO\n57\n90\n100%\nWestern Gulf of America\nAlpine\n96\n85\n100%\nWestern Gulf of America\nPerdido Norte\n74\n150\n100%\nWestern Gulf of America\nWhale\n124\n140\n100%\nWestern Gulf of America\nProduction Handling Platforms\nGas Inlet Capacity (MMcf/d)\nCrude/NGL Handling Capacity (Mbbls/d)\nOwnership Interest\nSupply Basins\nConsolidated:\nDevils Tower\n110\n60\n100%\nEastern Gulf of America\nGulfstar I FPS (1)\n172\n80\n51%\nEastern Gulf of America\nDiscovery\n75\n10\n100%\nCentral Gulf of America\n__________\n(1)\nStatistics reflect 100 percent of the assets from Williams’ 51 percent interest in Gulfstar One floating production system (FPS).\nDiscovery Acquisition\nOn August 1, 2024, Williams closed on the acquisition of the remaining 40 percent interest in Discovery, along with certain other assets. Discovery’s assets include a 600 MMcf/d cryogenic natural gas processing plant near Larose, Louisiana, a 35 Mbbls/d NGL fractionator plant near Paradis, Louisiana, and a 594-mile offshore natural gas gathering and transportation system in the Gulf of America. Discovery’s mainline has a gathering inlet capacity of 600 MMcf/d. Discovery’s assets also include a crude oil production handling platform with capacity of 10 Mbbls/d and gas handling and separation capacity of 75 MMcf/d.\nDeepwater Whale Expansion Project\nIn August 2021, Williams reached an agreement with two third-parties to provide offshore natural gas gathering and crude oil transportation services as well as onshore natural gas processing services. The project expanded its \n12\nexisting Western Gulf of America offshore infrastructure via a 26-mile gas lateral pipeline from the Whale platform to the existing Perdido gas pipeline and added a new 124-mile oil pipeline from the Whale platform to Williams’ existing junction platform. This project was placed into service in January 2025.\nTransmission & Gulf of America Operating Statistics\n2024\n2023\n2022\n(Annual Average Amounts)\nConsolidated:\n \nInterstate natural gas pipeline throughput (MMdth/d) (1) (2)\n20.2 \n20.4 \n16.9 \nGathering volumes (Bcf/d) \n0.55 \n0.26 \n0.29 \nPlant inlet natural gas volumes (Bcf/d) \n0.71 \n0.44 \n0.47 \nNGL production (Mbbls/d)\n47 \n27 \n28 \nNGL equity sales (Mbbls/d)\n10 \n6 \n6 \nCrude oil transportation (Mbbls/d)\n113 \n123 \n119 \nNon-consolidated: (3)\nInterstate natural gas pipeline throughput (MMdth/d) (1)\n1.2 \n1.2 \n1.3 \nGathering volumes (Bcf/d)\n— \n0.34 \n0.40 \nPlant inlet natural gas volumes (Bcf/d)\n— \n0.34 \n0.40 \nNGL production (Mbbls/d)\n— \n27 \n28 \nNGL equity sales (Mbbls/d)\n— \n7 \n8 \n_____________\n(1)\nTbtu converted to MMdth at one trillion British thermal units = one million dekatherms.\n(2)\nIncludes volumes for natural gas transmission assets acquired in the MountainWest Acquisition after the purchase on February 14, 2023, including 100 percent of the volumes associate with the operated equity-method investment White River Hub, LLC. Further, the amounts for the acquired assets are averaged over the period owned, not over the entire year.\n(3)\nIncludes 100 percent of the volumes associated with operated equity-method investments Gulfstream and Discovery, prior to the acquisition of the remaining 40 percent interest in Discovery on August 1, 2024. Volumes associated with the Discovery assets for 2024 are presented entirely in the Consolidated section.  \nNortheast G&P \nNatural Gas Gathering and Processing Assets\nThis segment includes Williams’ natural gas gathering, compression, processing, and NGL fractionation businesses in the Marcellus and Utica Shale regions in Pennsylvania, West Virginia, New York, and Ohio.\n13\nThe following tables summarize the significant operated assets of this segment:\n \nNatural Gas Gathering Assets\n \nLocation\nPipeline Miles\nInlet Capacity (Bcf/d)\nOwnership Interest\nSupply Basins\nConsolidated:\nOhio Valley Midstream (1)\nOhio, West Virginia, & Pennsylvania\n216\n0.8\n65%\nAppalachian\nUtica East Ohio Midstream (1) (2)\nOhio\n53\n0.6\n65%\nAppalachian\nSusquehanna Supply Hub\nPennsylvania & New York\n506\n4.6\n100%\nAppalachian\nCardinal (1)\nOhio\n429\n0.7\n66%\nAppalachian\nFlint\nOhio\n100\n0.5\n100%\nAppalachian\nNon-consolidated: (3)\nBradford Supply Hub\nPennsylvania\n754\n4.4\n66%\nAppalachian\nMarcellus South\nPennsylvania & West Virginia\n296\n1.3\n68%\nAppalachian\nLaurel Mountain\nPennsylvania\n1,147\n0.9\n69%\nAppalachian\nBlue Racer\nOhio & West Virginia\n617\n2.0\n50%\nAppalachian\n \nNatural Gas Processing Facilities\n \nLocation\nInlet Capacity (Bcf/d)\nNGL Production Capacity (Mbbls/d)\nOwnership Interest\nSupply Basins\nConsolidated: (1)\nFort Beeler\nMarshall Co., WV\n0.5\n62\n65%\nAppalachian\nOak Grove\nMarshall Co., WV\n0.6\n75\n65%\nAppalachian\nKensington\nColumbiana Co., OH\n0.6\n68\n65%\nAppalachian\nLeesville\nCarroll Co., OH\n0.2\n18\n65%\nAppalachian\nNon-consolidated: (3)\nBerne\nMonroe Co., OH\n0.4\n60\n50%\nAppalachian\nNatrium\nMarshall Co., WV\n0.8\n120\n50%\nAppalachian\n_____________\n(1)\nStatistics reflect 100 percent of the assets from Williams’ 65 percent ownership in its Northeast JV and 66 percent ownership of Cardinal gathering system.\n(2)\nUtica East Ohio Midstream inlet capacity consists of 1.3 Bcf/d of a high-pressure gathering pipeline that delivers Cardinal gathering volumes to Utica East Ohio Midstream processing facilities. The listed inlet capacity of 0.6 Bcf/d is incremental capacity to the Cardinal gathering capacity of 0.7 Bcf/d.\n(3)\nIncludes 100 percent of the statistics associated with operated equity-method investments.\nOther NGL Operations\nAs part of its Northeast G&P business, Williams owns and operates a 43 Mbbls/d NGL fractionation facility at Moundsville, West Virginia, nearby condensate stabilization facilities capable of handling approximately   17 Mbbls/d of field condensate, a de-ethanization facility at its Oak Grove processing plant, an ethane pipeline, and an NGL pipeline. The Oak Grove de-ethanizer is capable of handling up to approximately 80 Mbbls/d of mixed NGLs to extract up to approximately 40 Mbbls/d of ethane. Williams also owns and operates a 135 Mbbls/d NGL fractionation facility and approximately 970,000 barrels of NGL storage capacity in Harrison County, Ohio, as well as 44 Mbbls/d of condensate stabilization capacity, and other ancillary assets, including loading and terminal facilities in Harrison, Carroll, and Columbiana Counties, Ohio.\nNGLs are extracted from the natural gas stream in Williams’ Oak Grove and Fort Beeler cryogenic processing plants. Ethane produced at the Oak Grove de-ethanizer is transported to markets via its 50-mile ethane pipeline to Houston, Pennsylvania. The remaining mixed NGL stream from the de-ethanizer is then transported via Williams’ \n14\n50-mile NGL pipeline and fractionated at either its Moundsville or Harrison fractionation facility. The resulting products are then transported on truck, rail, or pipeline. Ohio Valley Midstream provides residue natural gas take away options for customers with interconnections to three interstate transmission pipelines.\nCertain Equity-Method Investments\nAppalachia Midstream Investments\nThrough the Appalachia Midstream Investments, Williams operates and owns an approximate average 66 percent interest in the Bradford Supply Hub gathering system and owns an approximate average 68 percent interest in the Marcellus South gathering system, together which consist of approximately 1,050 miles of gathering pipeline in the Marcellus Shale region with the capacity to gather 5,700 MMcf/d of natural gas. The majority of Williams’ volumes in the region are gathered from northern Pennsylvania, southwestern Pennsylvania, and the northwestern panhandle of West Virginia in core areas of the Marcellus Shale. Williams operates the assets primarily under long-term, 100 percent fixed-fee gathering agreements that include significant acreage dedications. Additionally, some Marcellus South agreements have MVCs.\nLaurel Mountain\nWilliams operates and owns a 69 percent interest in a joint venture, Laurel Mountain, which includes a 1,147-mile gathering system in western Pennsylvania with the capacity to gather 0.9 Bcf/d of natural gas. Laurel Mountain has a long-term, dedicated, volumetric-based fee agreement, with exposure to natural gas prices, to gather the anchor customer’s production in the western Pennsylvania area of the Marcellus Shale. Additionally, certain Laurel Mountain agreements have MVCs.\nBlue Racer\nWilliams operates and owns a 50 percent interest in Blue Racer. Blue Racer is a joint venture to own, operate, develop, and acquire midstream assets in the Utica Shale and certain adjacent areas in the Marcellus Shale. Blue Racer’s assets include 617 miles of gathering pipelines and the Natrium complex in Marshall County, West Virginia, with a cryogenic processing capacity of 800 MMcf/d and fractionation capacity of approximately 134 Mbbls/d. Blue Racer also owns the Berne complex in Monroe County, Ohio, with a cryogenic processing capacity of 400 MMcf/d, and 102 miles of NGL and condensate pipelines connecting Natrium to Berne. Blue Racer provides gathering, processing, and marketing services primarily under percent-of-liquids and fixed-fee agreements.\nNortheast G&P Operating Statistics\n2024\n2023\n2022\n(Annual Average Amounts)\nConsolidated:\nGathering volumes (Bcf/d)\n4.16 \n4.45 \n4.19 \nPlant inlet natural gas volumes (Bcf/d)\n1.86 \n1.89 \n1.65 \nNGL production (Mbbls/d)\n139 \n139 \n120 \nNGL equity sales (Mbbls/d)\n1 \n1 \n1 \nNon-consolidated: (1)\nGathering volumes (Bcf/d)\n6.46 \n6.92 \n6.61 \nPlant inlet natural gas volumes (Bcf/d)\n0.98 \n0.93 \n0.71 \nNGL production (Mbbls/d)\n72 \n65 \n51 \nNGL equity sales (Mbbls/d)\n5 \n4 \n3 \n__________\n(1)    Includes 100 percent of the volumes associated with operated equity-method investments, including Laurel Mountain and Blue Racer; as well as the Bradford Supply Hub and Marcellus South within Appalachia Midstream Investments.\n15\nWest\nNatural Gas Gathering and Processing Assets\nThe following tables summarize the significant operated assets of this segment:\nNatural Gas Gathering Assets\nLocation\nPipeline Miles\nInlet Capacity (Bcf/d)\nOwnership Interest\nSupply Basins/Shale Formations\nConsolidated:\nWamsutter\nWyoming\n2,251\n0.7\n100%\nWamsutter\nSouthwest Wyoming\nWyoming\n1,613\n0.5\n100%\nSouthwest Wyoming\nPiceance\nColorado\n352\n1.8\n100%\nPiceance\nBarnett Shale\nTexas\n815\n0.5\n100%\nBarnett Shale\nEagle Ford Shale\nTexas\n1,258\n0.5\n100%\nEagle Ford Shale\nHaynesville Shale\nLouisiana & Texas\n869\n5.0\n100%\nHaynesville Shale, Bossier Shale\nPermian\nTexas\n113\n0.1\n100%\nPermian\nMid-Continent\nOklahoma & Texas\n1,695\n0.2\n100%\nMiss-Lime, Granite Wash, Colony Wash\nDJ Basin\nColorado\n472\n0.8\n100%\nDenver-Julesburg\nNatural Gas Processing Facilities\nLocation\nInlet Capacity (Bcf/d)\nNGL Production Capacity (Mbbls/d)\nOwnership Interest\nSupply Basins\nConsolidated:\nEcho Springs\nEcho Springs, WY\n0.6\n48\n100%\nWamsutter\nOpal\nOpal, WY\n0.7\n39\n100%\nSouthwest Wyoming\nWillow Creek\nRio Blanco Co., CO\n0.5\n30\n100%\nPiceance\nParachute\nGarfield Co., CO\n1.0\n5\n100%\nPiceance\nFort Lupton\nWeld Co., CO\n0.3\n50\n100%\nDenver-Julesburg\nKeenesburg I\nWeld Co., CO\n0.2\n40\n100%\nDenver-Julesburg\nFront Range\nWeld Co., CO\n0.1\n12\n100%\nDenver-Julesburg\nDJ Basin Acquisition\ns\nOn November 30, 2023, Williams closed on the acquisition of 100 percent of Cureton Front Range, LLC and the acquisition of the remaining 50 percent interest in Rocky Mountain Midstream Holdings LLC, both of which operate midstream assets in Colorado’s DJ Basin. The Cureton Acquisition includes natural gas gathering pipelines and one in-service processing plant. The RMM Acquisition was the purchase of a partner’s 50 percent interest, resulting in 100 percent ownership by Williams. RMM includes a natural gas gathering pipeline, an approximate 100-mile crude oil transportation pipeline, and natural gas processing assets in the DJ Basin. It also includes crude oil storage and compression assets.\nTrace Acquisition\nOn April 29, 2022, Williams closed on the acquisition of 100 percent of Gemini Arklatex, LLC, through which the gas gathering and related assets of Trace Midstream were acquired. The purpose of this acquisition was to expand Williams’ footprint into the east Texas area of the Haynesville Shale region, increasing in-basin scale.\n16\nOther NGL Operations\nWilliams owns interests in and/or operates NGL fractionation and storage assets in central Kansas near Conway. These assets include a 50 percent interest in an NGL fractionation facility with capacity of slightly more than 100 Mbbls/d and also approximately 23 million barrels of NGL storage capacity. In addition, Williams owns a 189-mile NGL pipeline from a fractionator near Conway, Kansas, to an interconnection with a third-party NGL pipeline system in Oklahoma.\nOverland Pass Pipeline Equity-Method Investment\nWilliams operates and owns a 50 percent interest in OPPL. OPPL is capable of transporting 245 Mbbls/d of NGLs and includes 1,035 miles of NGL pipeline extending from Opal, Wyoming, to the Mid-Continent NGL market center near Conway, Kansas, along with extensions into the Piceance and DJ basins in Colorado and the Bakken Shale in the Williston basin in North Dakota. The equity NGL volumes from Williams’ Wyoming plants as well as certain Colorado plants are dedicated for transport on OPPL under long-term transportation agreements.\nWest Operating Statistics\n2024\n2023\n2022\n(Annual Average Amounts)\nConsolidated:\nGathering volumes (Bcf/d) (1)\n5.46 \n6.02 \n5.19 \nPlant inlet natural gas volumes (Bcf/d)\n1.54 \n1.54 \n1.15 \nNGL production (Mbbls/d)\n90 \n91 \n43 \nNGL equity sales (Mbbls/d)\n7 \n14 \n14 \nNon-Consolidated: (2)\nGathering volumes (Bcf/d)\n— \n— \n0.29 \nPlant inlet natural gas volumes (Bcf/d)\n— \n— \n0.28 \nNGL production (Mbbls/d)\n— \n— \n33 \n________________\n(1)    Includes volumes for gathering assets acquired in the Trace Acquisition after the purchase on April 29, 2022 as well as volumes for gathering assets acquired in the DJ Basin Acquisitions after the purchase on November 30, 2023. Further, the amounts for the acquired assets are averaged over the period owned, not over the entire year.\n(2)    Includes 100 percent of the volumes associated with operated equity-method investment RMM prior to acquisition of the remaining 50 percent interest on November 30, 2023. Volumes associated with the RMM assets for 2023 are presented entirely in the Consolidated section.\nGas & NGL Marketing Services\nWilliams’ natural gas marketing business provides asset management and the wholesale marketing, trading, storage, and transportation of natural gas for a diverse set of natural gas and electric utilities, municipalities, power generators, and producers and markets natural gas from the production at its upstream properties. Williams’ NGL marketing business transports and markets its equity NGLs from the production at its processing plants, NGLs from the production at its upstream properties, and NGLs on behalf of third-party NGL producers, including some of its fee-based processing customers. See the Gas and NGL Marketing section of Service Assets, Customers, and Contracts in Item 1. Business for additional information related to this business segment.\nGas & NGL Marketing Services Operating Statistics\n2024\n2023\n2022\n(Annual Average Amounts)\nSales Volumes:\nNatural Gas (Bcf/d)\n7.11 \n7.05 \n7.20 \nNGLs (Mbbls/d)\n177 \n223 \n250 \n17\nOther\nOther includes upstream operations, certain new energy ventures, and minor business activities that are not reportable segments, as well as corporate operations.\nUpstream Ventures\nWilliams acquired certain crude oil and natural gas properties in the Wamsutter basin in February 2021. Williams had an agreement regarding these properties in which it owned 75 percent of the venture’s undivided interest in each well’s working interest. In November 2024, Williams closed on the acquisition of the third-party operator Crowheart Energy, LLC. After closing on the acquisition Williams is the operator and owns more than a 90 percent working interest in each well. \nCertain natural gas properties in Louisiana were transferred to Williams in November 2020 as part of a bankruptcy resolution with a customer. In the third quarter of 2021, Williams sold 50 percent of the existing wells and wellbore rights in the South Mansfield area of the Haynesville Shale region to a third party operator, in a strategic effort to develop the acreage, thereby enhancing the value of Williams midstream natural gas infrastructure. Under the agreement, the third party operates the upstream position and develops the undeveloped acreage. The third-party’s interest in new wells increased to 75 percent in early 2023 when a certain drilling hurdle was met. Williams retained ownership in the undeveloped acreage until a separate acreage earning hurdle was met in the fourth quarter of 2023, at which time remaining undeveloped acreage was conveyed to the third party resulting in the third party owning 75 percent and Williams owning 25 percent.\nOperating Statistics\n2024 (1)\n2023\n2022\n(Annual Average Amounts)\nNet Product Sales Volumes:\nNatural Gas (Bcf/d)\n0.31 \n0.29 \n0.22 \nNGLs (Mbbls/d)\n11 \n7 \n7 \nCrude Oil (Mbbls/d)\n6 \n4 \n2 \n________________\n(1)    Includes volumes for the Crowheart Acquisition after the purchase on November 1, 2024. Further, the amounts for the acquired assets are averaged over the period owned, not over the entire year.\nNew Energy Ventures\nWilliams’ Other segment also includes investments in certain new energy ventures related to hydrogen, solar, renewable natural gas, and NextGen Gas. NextGen Gas is natural gas that has been independently certified as low emissions gas across all segments of the value chain.\nRate Matters\nFERC regulation requires all terms and conditions of service, including the rates charged, to be filed with and accepted by the FERC before any changes can go into effect. Our interstate natural gas pipelines establish their rates primarily through the FERC’s ratemaking process, but also may negotiate rates with their customers pursuant to the terms of their tariff and FERC policy. Key determinants in the ratemaking process are: (1) costs of providing service, including depreciation expense; (2) allowed rate of return, including the equity component of the capital structure and related income taxes; and (3) contract and volume throughput assumptions. The allowed rate of return is determined in each rate case. Rate design and the allocation of costs between the reservation and commodity rates also impact profitability. As a result of rate case proceedings, certain revenues may be collected subject to refund. Estimates of rate refund liabilities may be recorded considering their and third-party regulatory proceedings, advice of counsel and other risks.\nConsistent with FERC policy, our interstate natural gas pipelines design their rates using the straight fixed-variable (SFV) method of rate design. Under the SFV method of rate design, substantially all fixed costs, including \n18\nreturn on equity and income taxes, are included in a reservation charge to customers and all variable costs are recovered through a commodity charge to customers. While the use of SFV rate design limits our pipelines’ opportunity to earn incremental revenues through increased throughput, it also limits their risk associated with fluctuations in throughput.\nTransco Rate Case Filing\nOn August 30, 2024, Transco filed a general rate case with the FERC for an overall increase in rates. In September 2024, with the exception of certain rates that reflected a rate decrease, the FERC accepted and suspended our general rate filing to be effective March 1, 2025, subject to refund and the outcome of hearing procedures established by the FERC. The specific rates that reflected a rate decrease were accepted, without suspension, to be effective October 1, 2024, as requested by Transco, and will not be subject to refund. The impact of the rates reflecting a rate decrease is expected to reduce revenues by approximately $1 million per month beginning October 1, 2024.\nNWP Rate Case Settlement\nOn November 15, 2022, the FERC approved NWP’s Petition for Approval of Pre-Filing Stipulation and Settlement Agreement (Settlement) in Docket No. RP22-1155. The Settlement established a new general system firm Rate Schedule TF-1 (Large Customer) daily reservation rate of $0.37250/Dth with a $0.00935/Dth commodity rate (which were made effective January 1, 2023), resolved other rate issues, established a Modernization and Emission Reduction Program and satisfied our rate case filing obligation under our settlement in Docket No. RP17-346. Provisions were included in the Settlement that establish a moratorium on any NGA Section 4 or 5 proceedings that would seek to place new rates in effect any earlier than January 1, 2026. The Settlement also provides that Northwest Pipeline file an NGA Section 4 general rate case with rates to be effective not later than April 1, 2028, unless (a) Northwest Pipeline has entered into a pre-filing settlement or (b) a Section 5 general rate case has been filed on or before April 1, 2028. \nAs a result of the Settlement, in January 2023, NWP refunded approximately $126 million, including interest, associated with the decrease in federal tax rates due to the Tax Cuts and Jobs Act of 2017 (Tax Reform), which reduced current \nRegulatory liabilities \non NWP’s Balance Sheet.\nRegulatory Matters \nFERC\nWilliams’ natural gas pipeline interstate transmission and storage activities, including activities of Transco and NWP, are subject to FERC regulation under the NGA and under the Natural Gas Policy Act of 1978, as amended, and, as such, the rates and charges for the transportation of natural gas in interstate commerce, accounting, and the extension, enlargement, or abandonment of the jurisdictional facilities, among other things, are subject to regulation. Each of Williams’ natural gas pipeline companies, including Transco and NWP, holds certificates of public convenience and necessity issued by the FERC authorizing ownership and operation of all pipelines, facilities, and properties for which certificates are required under the NGA. FERC Standards of Conduct govern how the interstate pipelines communicate and conduct transmission transactions with an affiliate that engages in marketing functions. Among other things, the Standards of Conduct require that interstate gas pipelines treat all transmission customers, affiliated and non-affiliated, on a not unduly discriminatory basis. FERC Standards of Conduct govern the relationship between natural gas transmission providers and marketing function employees as defined by the rule. The Standards of Conduct are intended to prevent natural gas transmission providers from preferentially benefiting gas marketing functions by requiring the employees of a transmission provider that perform transmission functions to function independently from marketing function employees and by restricting the information that transmission providers may provide to marketing function employees. Under the Energy Policy Act of 2005, the FERC is authorized to impose civil penalties of more than  $1.5 million per day for each violation of its rules.\nFERC regulation requires all terms and conditions of service, including the rates charged, to be filed with and accepted by the FERC before any changes can go into effect. Williams’ interstate gas pipeline companies, including \n19\nTransco and NWP, establish rates through the FERC’s ratemaking process. In addition, Williams’ interstate gas pipelines, including Transco and NWP, may enter into agreements with customers for negotiated rates, which may be less than, equal to, or greater than the otherwise applicable cost-based recourse rates. Williams, including Transco, has also received authority to charge market-based rates for certain of our storage services. Key determinants in the FERC ratemaking process include:\n•\nCosts of providing service, including depreciation expense;\n•\nAllowed rate of return, including the equity component of the capital structure and related income taxes;\n•\nContract and volume throughput assumptions.\nThe allowed rate of return is determined in each rate case. Rate design and the allocation of costs between the reservation and commodity rates also impact profitability. During the pendency of rate case proceedings, certain revenues collected may be subject to refund.\nWilliams also owns interests in and operates natural gas liquids pipelines that are regulated by various federal and state governmental agencies. Services provided on the interstate natural gas liquids pipelines are subject to regulation under the Interstate Commerce Act by the FERC, which has authority over the terms and conditions of service; rates, including depreciation and amortization policies; and initiation of service. Williams’ intrastate natural gas liquids pipelines providing common carrier service are subject to regulation by various state regulatory agencies. \nUpdated Certificate Policy Statement and Interim Greenhouse Gas (GHG) Policy Statement\nOn February 18, 2022, the FERC issued an Updated Certificate Policy Statement and an Interim GHG Policy Statement, which were to provide guidance for consideration of interstate natural gas pipeline projects. The Updated Certificate Policy Statement was intended to provide an analytical framework for how the FERC would consider whether a project is in the public convenience and necessity. The Interim GHG Policy Statement was intended to set forth how the FERC would assess the impacts of natural gas infrastructure projects on climate change in its reviews under the National Environmental Policy Act and the NGA. On March 24, 2022, the FERC converted the Updated Certificate Policy Statement and the Interim GHG Policy Statement into draft policy statements, and on January 24, 2025, the FERC terminated the Interim GHG Policy Statement proceeding. The FERC has not yet issued final guidance on the Updated Certificate Policy Statement.\nPipeline Safety\nWilliams’ interstate natural gas pipelines, including Transco and NWP, are subject to the Natural Gas Pipeline Safety Act of 1968, as amended, the Pipeline Safety Improvement Act of 2002, the Pipeline Safety, Regulatory Certainty, and Jobs Creation Act of 2011, and the Protecting Our Infrastructure of Pipelines and Enhancing Safety Act of 2016 and 2020, which regulate safety requirements in the design, construction, operation, and maintenance of interstate natural gas transmission facilities. The United States Department of Transportation Pipeline and Hazardous Materials Safety Administration (PHMSA) administers federal pipeline safety laws.\nFederal pipeline safety laws authorize PHMSA to establish minimum safety standards for pipeline facilities and persons engaged in the transportation of gas or hazardous liquids by pipeline. These safety standards apply to the design, construction, testing, operation, and maintenance of gas and hazardous liquids pipeline facilities affecting interstate or foreign commerce. PHMSA has also established reporting requirements for operators of gas and hazardous liquid pipeline facilities, as well as provisions for establishing the qualification of pipeline personnel and requirements for managing the integrity of gas transmission and distribution lines and certain hazardous liquid pipelines. To ensure compliance with these provisions, PHMSA performs pipeline safety inspections and has the authority to initiate enforcement actions.\nIn August 2022, PHMSA published Rule 2, which is the last in the three-part Mega Rule set of regulations. Rule 2 went into effect in May 2023, but a Stay of Enforcement until February 2024 limited the amount of the regulation that was implemented. Since the rule was published in 2022, Williams, including Transco and NWP, has worked to understand the regulatory changes and modify procedures as needed and will continue to monitor impacts, if any, from recently published amendments.  \n20\nPipeline Integrity Regulations\nWilliams has an enterprise-wide Gas Integrity Management Plan, which includes Transco and NWP, that meets the PHMSA final rule issued pursuant to the requirements of the Pipeline Safety Improvement Act of 2002. To meet the PHMSA regulations, Williams has identified all pipelines in high consequence areas (HCAs) and developed baseline assessment plans for all applicable pipelines. In response to the PHMSA Mega Rule, implemented in 2021, Williams identified Moderate Consequence Areas, and integrated those segments into its integrity program along with Class 3 and 4 pipeline locations required by the rule. \nRegulatory changes as part of the Mega Rule, effective in 2024, impose stricter requirements for repairing crack-like, dent, and metal loss features. This has led to increased remediation efforts and higher costs compared to previous years. Additionally, advancements in identifying, evaluating, and remediating hard spot defects have contributed to higher spending.\nWilliams estimates that the cost to be incurred in 2025 with its entire Gas Integrity Management program to be approximately $219 million, which includes $168 million and $38 million for Transco and NWP, respectively. Management considers these costs to be prudent and incurred in the ordinary course of business and, the maintenance capital costs to be recoverable through rate case filings by Williams’ interstate pipelines.\nWilliams also has an enterprise-wide Liquid Integrity Management Plan that meets PHMSA requirements including HCA identification and a baseline assessment plan.  Williams estimates that the cost to be incurred in 2025 associated with this program will be approximately $2 million. Williams considers these costs to be prudent and incurred in the ordinary course of business.\nCybersecurity Matters \nIn 2024, the Transportation Security Administration (TSA) issued two updated security directives to further enhance cybersecurity resilience for pipeline operators. Security Directive Pipeline-2021-01D, effective May 29, 2024, continues to require owners/operators of critical pipelines to: (1) report cybersecurity incidents to the Cybersecurity and Infrastructure Security Agency (CISA) within 24 hours; (2) designate a Cybersecurity Coordinator available 24 hours a day, seven days a week, to coordinate cybersecurity practices and incident responses; and (3) conduct comprehensive reviews of cybersecurity practices, identify gaps, and report results to TSA and CISA. \nAdditionally, Security Directive Pipeline-2021-02E, effective July 27, 2024, builds on previous directives by requiring pipeline operators to: (1) implement a TSA-approved Cybersecurity Implementation Plan, incorporating network segmentation, continuous monitoring, and access control measures; (2) develop and maintain a robust Cybersecurity Incident Response Plan to reduce risks to critical systems during an incident; and (3) establish a Cybersecurity Assessment Plan with annual updates and reports to evaluate the effectiveness of implemented measures and identify vulnerabilities. \nWilliams, including Transco and NWP, has established and received TSA approval for its Cybersecurity Implementation Plan and Cybersecurity Assessment Plan, and is compliant with the remaining requirements established in Security Directives 1D and 2E.\nAdditionally, the United States Coast Guard issued a final rule in January 2025, establishing baseline cybersecurity requirements for maritime transportation assets, including vessels and facilities regulated under the Maritime Transportation Security Act. This rule mandates the development and maintenance of a Cybersecurity Plan, designation of a Cybersecurity Officer, implementation of security measures for account, device, and data protection, regular cybersecurity assessments, and reporting of cyber incidents. Compliance timelines for these requirements are phased, with key milestones such as cybersecurity assessments and plan submissions required within 24 months of the rule’s effective date.\nWilliams is actively monitoring evolving regulatory requirements to ensure compliance across its operations, including Transco and NWP. Williams is assessing the applicability of various regulations to its assets and implementing necessary measures to align with these standards. Williams, including Transco and NWP, \n \nremains \n21\ncommitted to safeguarding its infrastructure, minimizing risks, and maintaining the resilience of its operations in the face of evolving cybersecurity threats \nSee Part I,",
    "item1a": "Item 1A of this Annual Report on Form 10-K.\nManagement is committed to continually enhancing its cybersecurity processes and practices to address the dynamic nature of the threats it faces and to ensure the security and integrity of its systems and data.\nCybersecurity Governance\nCybersecurity is an important part of the risk management processes and an area of focus for the Board of Directors and management. Each member of Williams’ organization, which includes Transco and NWP, from facility operators to board members, has a responsibility to safeguard the organization’s cybersecurity. \nThe Chief Information Security Officer (CISO) is responsible for the cybersecurity strategy and execution, while the Board and the Audit Committee are responsible for oversight of cybersecurity risk.\n \nThe Cybersecurity Governance Committee is led by the CISO and includes cybersecurity managers and other subject matter experts as standing members. The Cybersecurity Governance Committee is tasked with developing, implementing, and maintaining the Cybersecurity Program. The Cybersecurity Executive Advisory Board (Executive Advisory Board) is led by the CISO, with the Chief Information Officer (CIO), Chief Financial Officer, Chief Human Resources Officer, the General Counsel, and the Chief Operations Officer as standing members. The Executive Advisory Board’s purpose is to ensure enterprise alignment with the Cybersecurity Program and provide executive oversight of the Cybersecurity Program.\n \nThe Board of Directors oversees cybersecurity-related policy and strategy. As part of this oversight, the CISO provides a cybersecurity dashboard that is reviewed by the Board at every regularly scheduled Board meeting, which includes key performance indicators for cybersecurity process maturity, operational performance, and enterprise performance toward Transportation Security Administration (TSA) compliance. Additionally, the CIO and/or CISO presents to the Board bi-annually regarding the cybersecurity risks and strategies, including as part of the Board’s annual long-term strategy session.\n The Audit Committee, comprised of independent directors, reviews the implementation and effectiveness of cybersecurity risk management protocols and reviews the effectiveness of cybersecurity as part of the Company’s accounting and internal control policies. As part of this oversight, the CIO presents to the Audit Committee bi-annually, as well as periodically in conjunction with any internal audits related to cybersecurity. Additionally, management has protocols by which cybersecurity incidents that meet established reporting thresholds are escalated internally and, where appropriate, are reported to the Board, as well as ongoing updates regarding any such incident until it has been addressed.\nWilliams’ new CIO joined the company in February 2025, and will succeed the company’s retiring CIO, who is retiring in March 2025. The new CIO brings over 20 years of experience in information technology and leadership within the energy industry and has extensive expertise in digital transformation, cloud strategies, enterprise AI initiatives, and cybersecurity, as well as managing large-scale system implementations and integrations. He holds an Executive MBA from the University of Texas at San Antonio, a Master of Computer Science and Engineering from the University of Texas at Arlington, and a Bachelor of Information Science and Engineering from Bangalore University.\nThe retiring CIO had been in his role at Williams for over 10 years and had over 30 years of combined information technology experience with a broad scope of responsibility. He provided senior leadership support of the cybersecurity and risk management programs since 2013. He holds a bachelor’s degree in management information systems (MIS) from the University of Oklahoma and a Master of Business Administration in MIS from the University of Dallas.\n49\nThe CISO has been at Williams for over 25 years. During that time, he has held a variety of information technology positions at multiple levels in the organization ranging from network engineering to application development and project management, as well as several IT Manager and Director roles. He has had oversight of the cybersecurity and risk management programs since 2017. Active in government and private sector partnerships, he is currently serving as the Chair of Emergency Response Working Group under the Oil & Natural Gas Subsector Coordinating Council and recently acted as the Chair of the Interstate Natural Gas Association of America security committee. He holds degrees in Business Administration and MIS from the University of Oklahoma and is certified in Leadership from Harvard Business School’s executive education. In 2018, he obtained his Chief Information Security Officer certification from Carnegie Mellon University.",
    "item1b": "Item 1B.  \nUnresolved Staff Comments  \nNot applicable.",
    "item1c": "Item 1C.  \nCybersecurity\nManagement for Williams, Transco, and NWP recognizes the increasing volume and sophistication of cyber threats and takes its responsibility to protect the information and systems under its purview seriously. Management’s cybersecurity processes aim to provide a comprehensive approach to assess, identify, and manage material risks arising from these cybersecurity threats.\nComprehensive Cybersecurity Program\n:\n Management has implemented a comprehensive cybersecurity risk management program (Cybersecurity Program) that is aligned with the National Institute for Standards and Technology Cybersecurity Framework. The Cybersecurity Program provides a risk-based approach to cybersecurity, and security controls are tailored so that cost-effective controls can be applied commensurate with the risk and sensitivity of specific information systems, control systems, and enterprise data. The Cybersecurity Program incorporates best practices and industry standards from multiple sources and is designed to comply with applicable regulations. The Cybersecurity Program includes, but is not limited to, the following elements: risk assessment, policies and procedures, contract management, training and awareness, auditing, compliance monitoring and testing, table-top exercises, and incident response.\nIntegration with Overall Risk Management\n:\n Management’s cybersecurity processes have been integrated into overall risk management system and processes. Management considers cybersecurity threat risks alongside other Company risks as part of its overall risk assessment process. Cybersecurity risk professionals collaborate with subject matter specialists, as necessary, to gather insights for identifying and assessing material cybersecurity threat risks, their severity, and potential mitigations.\n \nEngagement of Third Parties\n:\n Management often engages with specialized third-party assessors, consultants, auditors, and other experts to review, validate, and enhance its cybersecurity practices. Third-party independent assessments provide an external perspective on management’s cybersecurity posture, allowing it to leverage best practices from the industry and ensure its defenses remain robust. All third parties engaged for such processes are subjected to rigorous scrutiny to ensure the third parties meet management’s security standards.\n48\nOversight of Third-party Service Providers\n:\n Management acknowledges the potential risks associated with the use of third-party service providers. Therefore, management has established processes to oversee and identify material cybersecurity risks that may be associated with third-party service providers with whom it engages. This includes conducting thorough, risk-based due diligence before onboarding, performing security assessments, and confirming adherence to management’s cybersecurity requirements. Management also maintains active communication channels with these providers to stay informed about any potential security incidents or concerns.\nDisclosure of Risks\n:\n Management describes how risks from cybersecurity threats could materially affect its business strategy, results of operations, or financial condition, as part of its risk factor disclosures at Part I,"
  }
}