{
  "ticker": "WMT",
  "cik": "0000104169",
  "company_name": "Walmart Inc.",
  "filing_date": "2025-03-14",
  "accession": "0000104169-25-000021",
  "primary_doc": "wmt-20250131.htm",
  "item_sections": {
    "item1": "Item 1. Business\n.\"\n30\nITEM 3.\nLEGAL PROCEEDINGS\nI. SUPPLEMENTAL INFORMATION:\n \nThe Company is involved in legal proceedings arising in the normal course of its business, including litigation, arbitration and other claims, and investigations, inspections, subpoenas, audits, claims, inquiries and similar actions by governmental authorities. \nWe discuss certain legal proceedings in \nNote 10\n to our Consolidated Financial Statements included in \"\nItem 8. Financial Statements and Supplementary Data\n,\" which is captioned \"Contingencies,\" under the sub-caption \"Legal Proceedings.\" We refer you to that discussion for important information concerning those legal proceedings, including the basis for such actions and, where known, the relief sought. We provide the following additional information concerning those legal proceedings, including the name of the lawsuit, the court in which the lawsuit is pending, and the date on which the petition commencing the lawsuit or appeal was filed, in addition to disclosure of certain other legal matters.\nOpioid-Related Litigation:\n \nIn re National Prescription Opiate Litigation (MDL No. 2804) \n(the \"MDL\") is pending in the U.S. District Court for the Northern District of Ohio and includes approximately 250 cases with claims against the Company as of March 10, 2025. In addition, there are more than 25 other opioid-related cases against the Company and its subsidiaries pending in U.S. state and federal courts and Canadian courts as of March 10, 2025. The non-MDL case citations are listed on Exhibit 99.1 to this Annual Report on Form 10-K.\nDOJ Opioid Civil Litigation:\n \nUnited States of America v. Walmart Inc., et al.,\n USDC, Dist. of DE, 12/22/20.\nSettlement of Certain Opioid-Related Matters: \nAs described in more detail in \nNote \n10\n to our Consolidated Financial Statements, the Company accrued a liability of approximately $3.3 billion in fiscal year 2023 for certain opioid-related settlements. As of January 31, 2025, all of the accrued liability has been paid. Certain eligible political subdivisions and federally recognized Native American tribes have until July 15, 2025 and February 24, 2026, respectively, to join the settlement.\nOpioid-Related Derivative Lawsuits: \nAbt v. Alvarez et al.\n, USDC, Dist. of DE, 2/9/21; \nNguyen v. McMillon et al.,\n USDC, Dist. of DE, 4/16/21; \nOntario Provincial Council of Carpenters' Pension Trust Fund et al. v. Walton et al., \nDE Court of Chancery, 9/27/21.\nOpioid-Related Securities Class Actions:\n Stanton v. Walmart Inc.\n \net al.\n, USDC, Dist. of DE, 1/20/21 and\n Martin v. Walmart Inc. et al., \nUSDC\n, \nDist. of DE, 3/5/21, consolidated into \nIn re Walmart Inc. Securities Litigation\n, USDC, Dist. of DE, 5/11/21; \nIn re Walmart Inc. Securities Litigation, \nUSCCA, 3d Cir., 4/29/24.\nFalse Claims Act Litigation: \nUnited States of America \nex rel. \nJames Marcilla and Isela Chavez\n, USDC, Dist. of N.M., 8/23/19, transferred to USDC Dist. of DE 7/25/24.\nASDA Equal Value Claims:\n \nMs S Brierley & Others v. ASDA Stores Ltd\n (2406372/2008 &\n Others\n – Manchester Employment Tribunal); \nAbbas & Others v Asda Stores limited \n(KB-2022-003243); and \nAbusubih & Others v Asda Stores limited\n (KB-2022-003240).\nMoney Transfer Agent Services Litigation:\n \nFederal Trade Commission v. Walmart Inc.\n, USDC, N. Dist. Of Ill, 6/28/22; \nFederal Trade Commission v. Walmart Inc.\n, USCCA, 7th Cir., 10/28/24.\nDriver Platform Matter:\n \nConsumer Financial Protection Bureau v. Walmart Inc., et al.\n, USDC D. of Minn., 12/23/24.\nMexico Antitrust Matter:\n Comisión Federal de Competencia Económica of México, Investigative Authority v. Nueva Wal-Mart de México, S.de R.L. de C.V. (Docket IO-002-2020, consolidated with Docket DE-026-2020), Mexico, 10/6/23.\nIndia Antitrust Matter: \nCompetition Commission of India, Case No. 40 of 2019, order initiating investigation 1/13/20.\nII. ENVIRONMENTAL MATTERS:\n Item 103 of SEC Regulation S-K requires disclosure of certain environmental matters when a governmental authority is a party to the proceedings and such proceedings involve potential monetary sanctions that the Company reasonably believes will exceed an applied threshold not to exceed $1 million.\nIn October 2023, the Company received a Finding of Violation from the U.S. Environmental Protection Agency (the \"EPA\") alleging violations of the Clean Air Act in connection with the Company's refrigeration leak detection and repair program at certain of its facilities. The Company is evaluating the findings and cooperating with the EPA in its investigation. The EPA may seek to impose monetary and non-monetary penalties for the alleged violations of the Clean Air Act. Due to the fact that this process is in an early stage, the Company is unable to predict the final outcome of this matter. Although the Company does not believe this matter will have a material adverse effect on its business, financial position, results of operations, or cash flows, the Company can provide no assurance that its business, financial position, results of operations or cash flows will not be materially adversely affected.\nITEM 4.\nMINE SAFETY DISCLOSURES\nNot applicable.\n31\nPART II\nITEM 5.\nMARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket for Common Stock\nThe principal market on which Walmart's common stock is listed for trading is the New York Stock Exchange. The common stock trades under the symbol \"WMT.\"\nHolders of Record of Common Stock\nAs of March 12, 2025, there were 194,162 holders of record of Walmart's common stock, although there is a much larger number of beneficial owners.\nStock Performance Chart\nThis graph compares the cumulative total shareholder return on Walmart's common stock during the five fiscal years ended through fiscal 2025 to the cumulative total returns on the S&P 500 Consumer Discretionary Distribution & Retailing Index (formerly named the S&P 500 Retailing Index) and the S&P 500 Index. The comparison assumes $100 was invested on February 1, 2020 in shares of our common stock and in each of the indices shown and assumes that all of the dividends were reinvested.\n*Assumes $100 Invested on February 1, 2020\nAssumes Dividends Reinvested \nFiscal Year ended January 31, 2025\nFiscal Years Ended January 31,\n2020\n2021\n2022\n2023\n2024\n2025\nWalmart Inc.\n$\n100.00 \n$\n124.77 \n$\n126.14 \n$\n131.84 \n$\n153.75 \n$\n277.25 \nS&P 500 Index\n100.00\n117.25\n144.56\n132.68\n160.30\n202.59\nS&P 500 Consumer Discretionary Distribution & Retailing Index\n100.00\n141.39\n153.61\n125.62\n162.21\n227.91\nIssuer Repurchases of Equity Securities\nFrom time to time, the Company repurchases shares of our common stock under share repurchase programs authorized by the Company's Board of Directors. All repurchases made during fiscal 2025 were made under the current $20.0 billion share repurchase program approved in November 2022, which has no expiration date or other restrictions limiting the period over which the Company can make repurchases. As of January 31, 2025, authorization for $12.0 billion of share repurchases remained under the share repurchase program. Any repurchased shares are constructively retired and returned to an unissued status.\n32\nShare repurchase activity under our share repurchase programs, on a trade date basis, for each month in the quarter ended January 31, 2025, was as follows:\nFiscal Period\nTotal Number of\nShares Repurchased\nAverage Price Paid\nper Share\n(in dollars)\nTotal Number of\nShares Repurchased\nas Part of Publicly\nAnnounced Plans or\nPrograms\nApproximate Dollar Value of\nShares that May Yet Be\nRepurchased Under the\nPlans or Programs\n(1)\n(in billions)\nNovember 1-30, 2024\n4,701,501 \n$\n86.55 \n4,701,501 \n$\n13.1 \nDecember 1-31, 2024\n5,727,132 \n93.42 \n5,727,132 \n12.6 \nJanuary 1-31, 2025\n5,478,530 \n93.25 \n5,478,530 \n12.0 \nTotal\n15,907,163 \n15,907,163 \n(1)\n Represents the approximate dollar value of shares that could have been repurchased under the current plan at the end of the month.\nITEM 6.\nRESERVED\n33\nITEM 7.\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nThis discussion, which presents our results for the fiscal years ended January 31, 2025 (\"fiscal 2025\"), January 31, 2024 (\"fiscal 2024\") and January 31, 2023 (\"fiscal 2023\"), should be read in conjunction with our Consolidated Financial Statements and the accompanying notes. We intend for this discussion to provide the reader with information that will assist in understanding our financial statements, the changes in certain key items in those financial statements from period to period and the primary factors that accounted for those changes. We also discuss certain performance metrics that management uses to assess the Company's performance. Additionally, the discussion provides information about the financial results of each of the three segments of our business to provide a better understanding of how each of those segments and its results of operations affect the financial condition and results of operations of the Company as a whole.\nThroughout this Item 7, we discuss segment operating income, comparable store and club sales and other measures.  Management measures the results of the Company's segments using each segment's operating income, including certain corporate overhead allocations, as well as other measures. From time to time, we revise the measurement of each segment's operating income and other measures as determined by the information regularly reviewed by our chief operating decision maker. \nManagement also measures the results of comparable store and club sales, or comparable sales, a metric that indicates the performance of our existing stores and clubs by measuring the change in sales for such stores and clubs, for a particular period from the corresponding prior year period. Walmart's definition of comparable sales includes sales from stores and clubs open for the previous 12 months, including remodels, relocations, expansions and conversions, as well as eCommerce sales. We measure the eCommerce sales impact by including all sales initiated digitally, including omni-channel transactions which are fulfilled through our stores and clubs as well as certain other business offerings that are part of our ecosystem, such as our advertising net sales. Sales at a store that has changed in format are excluded from comparable sales when the conversion of that store is accompanied by a relocation or expansion that results in a change in the store's retail square feet of more than 5%. Sales related to divested businesses are excluded from comparable sales, and sales related to acquisitions are excluded until such acquisitions have been owned for 12 months. Comparable sales are also referred to as \"same-store\" sales by others within the retail industry. The method of calculating comparable sales varies across the retail industry. As a result, our calculation of comparable sales is not necessarily comparable to similarly titled measures reported by other companies.\nIn discussing our operating results, the term currency exchange rates refers to the currency exchange rates we use to convert the operating results for countries where the functional currency is not the U.S. dollar into U.S. dollars. We calculate the effect of changes in currency exchange rates as the difference between current period activity translated using the current period's currency exchange rates and the comparable prior year period's currency exchange rates. Additionally, no currency exchange rate fluctuations are calculated for non-USD acquisitions until owned for 12 months. Throughout our discussion, we refer to the results of this calculation as the impact of currency exchange rate fluctuations. Volatility in currency exchange rates have impacted and may continue to impact the results, including net sales and operating income, of the Company and the Walmart International segment.\nWe have taken certain strategic actions across our segments, including an increased emphasis on investments in automation and supply chain as well as diversifying our earnings streams through category and business mix. In December 2024, the Walmart U.S. segment completed the acquisition of VIZIO Holding Corp. for net cash consideration of $1.9 billion. Additionally, we have taken actions in the Walmart International segment to reshape our portfolio including the following highlights over the last three years:\n•\nIn November 2022, we completed the buyout of the noncontrolling interest shareholders of our Massmart subsidiary (Refer to \nNote 3\n) and in December 2022, we exited operations in certain countries in Africa. \n•\nIn December 2022, we increased our ownership in PhonePe as part of the separation from our majority-owned Flipkart subsidiary. Refer to \nNote 3\n.\n•\nIn August 2024, we sold our equity investment in JD.com for net proceeds of $3.6 billion. Refer to \nNote 8\n.\nWe operate in a highly competitive omni-channel retail industry in all of the markets we serve. We face strong sales competition from other discount, department, drug, dollar, variety and specialty stores, warehouse clubs and supermarkets, as well as eCommerce, health and wellness, financial services, advertising and data service businesses. Many of these competitors are national, regional or international chains or have a national or international omni-channel or eCommerce presence. We compete with a number of companies for attracting and retaining quality associates. We, along with other retail companies, are influenced by a number of factors including, but not limited to: catastrophic events, weather and other risks related to climate change, global health epidemics and pandemics, competitive pressures, consumer disposable income, consumer debt levels and buying patterns, consumer credit availability, disruptions in supply chain, inventory management, cost and availability of goods, currency exchange rate fluctuations, customer preferences, inflation, deflation, fuel and energy prices, general economic \n34\nconditions, insurance costs, interest rates, labor availability and costs, tax rates, the imposition of tariffs, cybersecurity attacks and unemployment. Further information on the factors that can affect our operating results and on certain risks to our Company and an investment in its securities can be found herein under \"",
    "item1a": "Item 1A. Risk Factors\n.\" \nWe are committed to helping customers save money and live better through everyday low prices, supported by everyday low \ncosts. Our net sales and gross profit margin are influenced in part by our pricing and merchandising strategies in response to cost increases. Those pricing strategies include but are not limited to: absorbing cost increases instead of passing those cost increases on to our customers and members; reducing prices in certain merchandise categories; focusing on opening price points for certain food categories; and when necessary, passing cost increases on to our customers and members. Merchandising strategies include, but are not limited to: working with our suppliers to reduce product costs and share in absorbing cost increases; focusing on private label brands and smaller pack sizes; earlier-than-usual purchasing and in greater volumes or moderating purchasing in certain categories; and securing ocean carrier and container capacity. These strategies have and may continue to impact gross profit as a percentage of net sales.\nWe expect continued uncertainty in our business and the global economy due to inflationary trends; tariffs and trade restrictions; fluctuations in global currencies; swings in macroeconomic conditions and their effect on consumer confidence; volatility in employment trends; and supply chain pressures, any of which may impact our results. For a detailed discussion on results of operations by reportable segment, refer to \"\nResults of Operations\n\" below.\nCompany Performance Metrics\nWe are committed to helping customers save money and live better through everyday low prices, supported by everyday low costs. At times, we adjust our business strategies to maintain and strengthen our competitive positions in the countries in which we operate. We define our financial priorities as follows: \n•\nGrowth - serve customers through a seamless omni-channel experience;\n•\nMargin - improve our operating income margin through productivity initiatives as well as category and business mix; and\n•\nReturns - improve our Return on Investment through margin improvement and disciplined capital spend.\nGrowth\nOur objective of prioritizing growth means we will focus on serving customers and members however they want to shop through our omni-channel business model. This includes increasing comparable store and club sales through increasing membership at Sam's Club U.S. and through Walmart+, accelerating eCommerce sales growth and expansion of omni-channel initiatives that complement our strategy.\nComparable sales is a metric that indicates the performance of our existing stores and clubs by measuring the change in sales for such stores and clubs, including eCommerce sales, for a particular period over the corresponding period in the previous year. The retail industry generally reports comparable sales using the retail calendar (also known as the 4-5-4 calendar). To be consistent with the retail industry, we provide comparable sales using the retail calendar in our quarterly earnings releases. However, when we discuss our comparable sales below, we are referring to our calendar comparable sales calculated using our fiscal calendar, which may result in differences when compared to comparable sales using the retail calendar. We report on comparable sales in the U.S. as we believe it is a meaningful metric within the context of the U.S. retail market where there is a single currency, one inflationary market and generally consistent store and club formats from year to year.\nCalendar comparable sales, as well as the impact of fuel, for fiscal 2025 and 2024, were as follows:\n \nFiscal Years Ended January 31,\n \n2025\n2024\n2025\n2024\n \nWith Fuel\nFuel Impact\nWalmart U.S.\n4.8%\n5.5%\n(0.1)%\n(0.1)%\nSam's Club U.S.\n4.7%\n2.3%\n(1.5)%\n(2.6)%\nTotal U.S.\n4.8%\n4.9%\n(0.3)%\n(0.6)%\nComparable sales in the U.S., including fuel, increased 4.8% and 4.9% in fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. Walmart U.S. comparable sales increased 4.8% and 5.5% in fiscal 2025 and 2024, respectively. For fiscal 2025, comparable sales growth was driven by growth in transactions and unit volumes, with strong sales in grocery and health and wellness. For fiscal 2024, comparable sales growth was driven by growth in transactions combined with growth in average ticket, including strong sales in grocery and health and wellness.Walmart U.S. eCommerce sales positively contributed approximately 2.9% and 2.6% to comparable sales for fiscal 2025 and 2024, respectively, which was primarily driven by store-fulfilled pickup and delivery. \nComparable sales at Sam's Club U.S. increased 4.7% and 2.3% in fiscal 2025 and 2024, respectively. For fiscal 2025, Sam's Club U.S. comparable sales increased due to growth in transactions and unit volumes, with strong sales in grocery and health and wellness. Sam's Club U.S. comparable sales for fiscal 2024 increased due to growth in transactions and average ticket, \n35\nincluding strong sales in grocery and health and wellness. Additionally, fiscal 2025 and 2024 growth was partially offset by lower fuel sales primarily due to lower market prices. Sam's Club U.S. eCommerce sales \npositively\n contributed approximately 2.3% and 1.7% to comparable sales for fiscal 2025 and 2024, respectively, which was primarily driven by club-fulfilled curbside pickup and delivery. \nMargin\nOur objective of prioritizing margin focuses on growth with a focus on incremental margin accretion through a combination of productivity improvements as well as category and business mix. We invest in technology and process improvements to increase productivity, manage inventory and reduce costs and we operate with discipline by managing expenses and optimizing the efficiency of how we work. We measure operating discipline through expense leverage, which we define as net sales growing at a faster rate than operating, selling, general and administrative (\"operating\") expenses. Additionally, we focus on our mix of businesses, including expanding our ecosystem in higher margin areas, such as digital advertising and marketplace. Our objective is to achieve operating income leverage, which we define as growing operating income at a faster rate than net sales. \nFiscal Years Ended January 31,\n(Amounts in millions, except unit counts)\n2025\n2024\nNet sales\n$\n674,538 \n$\n642,637 \nPercentage change from comparable period\n5.0 \n%\n6.1 \n%\nGross profit\n(1)\n as a percentage of net sales\n24.1 \n%\n23.7 \n%\nOperating expenses as a percentage of net sales\n20.7 \n%\n20.4 \n%\nOperating income\n$\n29,348 \n$\n27,012 \nOperating income as a percentage of net sales\n4.4 \n%\n4.2 \n%\n(1)\n  Gross profit defined as net sales less cost of sales.\nGross profit as a percentage of net sales (\"gross profit rate\") increased 40 and 27 basis points for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. The increases were primarily driven by the Walmart U.S. segment, due to managing prices aligned to our competitive historic price gaps, as well as growth in higher margin businesses globally, partially offset by mix shifts into lower margin merchandise categories. Additionally, the increase in fiscal 2024 benefited from lapping higher markdowns incurred in the prior year.    \nOperating expenses as a percentage of net sales increased 36 and decreased 60 basis points for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. The increase for fiscal 2025 was primarily due to higher variable pay as a result of exceeding planned performance, increased marketing and higher depreciation expenses. The decrease for fiscal 2024 was primarily due to lapping charges of $3.3 billion related to opioid-related legal settlements and $0.8 billion related to the reorganization and restructuring of certain businesses in the Walmart International segment in the prior year.\nOperating income as a percentage of net sales increased 15 and 83 basis points for fiscal 2025 and 2024, respectively, due to the factors described above, as well as from strong growth in membership income globally.\nReturns\nAs we execute our financial framework, we believe our return on capital will improve over time. We measure return on capital with our return on investment and free cash flow metrics. In addition, we provide returns in the form of share repurchases and dividends, which are discussed in the \nLiquidity and Capital Resources\n section.\nReturn on Assets and Return on Investment \nWe include Return on Assets (\"ROA\") and Return on Investment (\"ROI\") as metrics to assess our return on capital. ROA is the most directly comparable measure based on our financial statements presented in accordance with generally accepted accounting principles in the U.S. (\"GAAP\") while ROI is considered a non-GAAP financial measure. Management believes ROI is a meaningful metric to share with investors because it helps investors assess how effectively Walmart is deploying its assets. Trends in ROI can fluctuate over time as management balances long-term strategic initiatives with possible short-term impacts. \nOur calculation of ROI is considered a non-GAAP financial measure because we calculate ROI using financial measures that exclude and include amounts that are included and excluded in ROA, the most directly comparable GAAP financial measure. ROA is consolidated net income for the period divided by average total assets for the period. We define ROI as operating income plus interest income, depreciation and amortization, and rent expense for the trailing 12 months divided by average invested capital during the period. We consider average invested capital to be the average of our beginning and ending total assets, plus average accumulated depreciation and amortization, less average accounts payable and average accrued liabilities for that period. Although ROI is a standard financial measure, numerous methods exist for calculating a company's ROI. As a result, the method used by management to calculate our ROI may differ from the methods used by other companies to calculate their ROI.\n36\nROA was 7.9% and 6.6% for fiscal 2025 and 2024, respectively. The increase in ROA was primarily due to an increase in consolidated net income during the trailing 12 month period, as a result of higher operating income and changes in the fair value of our equity and other investments.\n \nROI was 15.5% and 15.0% for fiscal 2025 and 2024, respectively. The increase in ROI was the result of an increase in operating income, primarily due to improvements in business performance, partially offset by an increase in average invested capital primarily due to higher purchases of property and equipment. \nThe calculation of ROA and ROI, along with a reconciliation of ROI to the calculation of ROA, the most comparable GAAP financial measure, is as follows: \n \nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\nCALCULATION OF RETURN ON ASSETS\nNumerator\nConsolidated net income\n$\n20,157 \n$\n16,270 \nDenominator\nAverage total assets\n(1)\n$\n256,611 \n$\n247,798 \nReturn on assets (ROA)\n7.9 \n%\n6.6 \n%\nCALCULATION OF RETURN ON INVESTMENT\nNumerator\nOperating income\n$\n29,348 \n$\n27,012 \n+ Interest income\n483 \n546 \n+ Depreciation and amortization\n12,973 \n11,853 \n+ Rent\n2,347 \n2,277 \n= ROI operating income\n$\n45,151 \n$\n41,688 \nDenominator\nAverage total assets\n(1)\n$\n256,611 \n$\n247,798 \n  + Average accumulated depreciation and amortization\n(1)\n121,624 \n114,944 \n- Average accounts payable\n(1)\n57,739 \n55,277 \n- Average accrued liabilities\n(1)\n29,052 \n29,943 \n= Average invested capital\n$\n291,444 \n$\n277,522 \nReturn on investment (ROI)\n15.5 \n%\n15.0 \n%\n \n(1)\n  The average is based on the addition of the account balance at the end of the current period to the account balance at the end of the prior period and dividing by two.\n \nAs of January 31,\n \n2025\n2024\n2023\nCertain Balance Sheet Data \nTotal assets\n$\n260,823 \n$\n252,399 \n$\n243,197 \nAccumulated depreciation and amortization\n123,646 \n119,602 \n110,286 \nAccounts payable\n58,666 \n56,812 \n53,742 \nAccrued liabilities\n29,345 \n28,759 \n31,126 \nStrategic Capital Allocation\nOur strategy includes allocating the majority of our capital to higher-return areas focused on automation such as eCommerce, supply chain and store and club investments. The following table provides additional detail regarding our capital expenditures:\n(Amounts in millions)\nFiscal Years Ended January 31,\nAllocation of Capital Expenditures\n2025\n2024\nSupply chain, customer-facing initiatives, technology and other\n$\n14,603 \n$\n11,828 \nStore and club remodels\n5,552 \n5,792 \nNew stores and clubs, including expansions and relocations\n450 \n75 \nTotal U.S.\n$\n20,605 \n$\n17,695 \nWalmart International\n3,178 \n2,911 \nTotal Capital Expenditures\n$\n23,783 \n$\n20,606 \n37\nFree Cash Flow\nFree cash flow is considered a non-GAAP financial measure. Management believes, however, that free cash flow, which measures our ability to generate additional cash from our business operations, is an important financial measure for use in evaluating the Company's financial performance. Free cash flow should be considered in addition to, rather than as a substitute for, consolidated net income as a measure of our performance and net cash provided by operating activities as a measure of our liquidity. See \nLiquidity and Capital Resources\n for discussions of GAAP metrics including net cash provided by operating activities, net cash used in investing activities and net cash used in financing activities.\nWe define free cash flow as net cash provided by operating activities in a period minus payments for property and equipment made in that period. We had net cash provided by operating activities of $36.4 billion, $35.7 billion and $28.8 billion for fiscal 2025, 2024 and 2023, respectively. We generated free cash flow of $12.7 billion, $15.1 billion and $12.0 billion for fiscal 2025, 2024 and 2023, respectively. The increase in net cash provided by operating activities in fiscal 2025 is primarily due to an increase in cash provided by operating income and lapping the payment of accrued opioid legal charges in the prior year, partially offset by increased inventory purchases. Free cash flow for fiscal 2025 decreased when compared to fiscal 2024 due to an increase of $3.2 billion in capital expenditures to support our investment strategy, partially offset by the increase in net cash provided by operating activities described above. Net cash provided by operating activities for fiscal 2024 increased when compared to fiscal 2023 primarily due to higher cash provided by operating income, as well as timing of certain payments and strategic inventory management as part of working capital initiatives, partially offset by payment of the remaining accrued opioid legal charges. Free cash flow for fiscal 2024 increased when compared to fiscal 2023 due to the increase in net cash provided by operating activities described above, partially offset by an increase of $3.7 billion in capital expenditures to support our investment strategy.\nWalmart's definition of free cash flow is limited in that it does not represent residual cash flows available for discretionary expenditures due to the fact that the measure does not deduct the payments required for debt service and other contractual obligations or payments made for business acquisitions. Therefore, we believe it is important to view free cash flow as a measure that provides supplemental information to our \nConsolidated Statements of Cash Flows\n.\nAlthough other companies report their free cash flow, numerous methods may exist for calculating a company's free cash flow. As a result, the method used by management to calculate our free cash flow may differ from the methods used by other companies to calculate their free cash flow.\nThe following table sets forth a reconciliation of free cash flow, a non-GAAP financial measure, to net cash provided by operating activities, which we believe to be the GAAP financial measure most directly comparable to free cash flow, as well as information regarding net cash used in investing activities and net cash used in financing activities.\n \nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nNet cash provided by operating activities\n$\n36,443 \n$\n35,726 \n$\n28,841 \nPayments for property and equipment\n(23,783)\n(20,606)\n(16,857)\nFree cash flow\n$\n12,660 \n$\n15,120 \n$\n11,984 \nNet cash used in investing activities\n(1)\n$\n(21,379)\n$\n(21,287)\n$\n(17,722)\nNet cash used in financing activities\n(14,822)\n(13,414)\n(17,039)\n(1)\n  \"Net cash used in investing activities\" includes payments for property and equipment, which is also included in our computation of free cash flow.\n38\nResults of Operations\nConsolidated Results of Operations\nFiscal Years Ended January 31,\n(Dollar amounts and retail square feet in millions)\n2025\n2024\n2023\nNet sales\n$\n674,538 \n$\n642,637 \n$\n605,881 \nPercentage change from comparable period\n5.0 \n%\n6.1 \n%\n6.7 \n%\nMembership and other income\n(1)\n$\n6,447 \n$\n5,488 \n$\n5,408 \nTotal revenues\n680,985 \n648,125 \n611,289 \nPercentage change from comparable period\n5.1 \n%\n6.0 \n%\n6.7 \n%\nGross profit\n(2)\n162,785 \n152,495 \n142,160 \nOperating expenses\n(2)\n139,884 \n130,971 \n127,140 \nOperating income\n29,348 \n27,012 \n20,428 \nOther (gains) and losses\n794 \n3,027 \n1,538 \nConsolidated net income\n20,157 \n16,270 \n11,292 \nPercentage of net sales\nGross profit\n24.1 \n%\n23.7 \n%\n23.5 \n%\nOperating expenses\n20.7 \n%\n20.4 \n%\n21.0 \n%\nOperating income\n4.4 \n%\n4.2 \n%\n3.4 \n%\nUnit counts at period end\n10,771 \n10,616 \n10,623 \nRetail square feet at period end\n1,053 \n1,053 \n1,056 \n(1)\n      Membership and other income includes membership fees and other items such as rental and tenant income, recycling income, gift card breakage income, as well as other income from corporate campus facilities.\n(2)\n      Gross profit is defined as net sales less cost of sales. Operating expenses refers to operating, selling, general and administrative expenses.   \nOur total revenues increased $32.9 billion or 5.1% and $36.8 billion or 6.0% for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. These increases in revenues were primarily due to increases in net sales, which increased $31.9 billion or 5.0% and $36.8 billion or 6.1% for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. The increases were primarily due to strong positive comparable sales across our U.S. segments and international markets, driven primarily by growth in transactions and unit volumes, which included strength in eCommerce as well as strong sales in grocery, and health and wellness. Net sales were negatively impacted by $3.2 billion and positively impacted by $3.0 billion of fluctuations in currency exchange rates during fiscal 2025 and 2024, respectively. Membership and other income increased $1.0 billion and $0.1 billion for fiscal 2025 and fiscal 2024, primarily driven by growth in membership fee income globally.\nOur gross profit rate increased 40 and 27 basis points for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. The increases were primarily driven by the Walmart U.S. segment, due to managing prices aligned to our competitive historic price gaps, as well as growth in higher margin businesses globally, partially offset by mix shifts into lower margin merchandise categories. Additionally, the increase in fiscal 2024 benefited from lapping higher markdowns incurred in the prior year.\nOur operating expenses as a percentage of net sales increased 36 and decreased 60 basis points for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. The increase for fiscal 2025 was primarily due to higher variable pay as a result of exceeding planned performance, increased marketing and higher depreciation expenses. The decrease for fiscal 2024 was primarily due to lapping charges of $3.3 billion related to opioid-related legal settlements and $0.8 billion related to the reorganization and restructuring of certain businesses in the Walmart International segment in the prior year.\nOther gains and losses consist of certain non-operating items, such as the change in the fair value of our investments and gains or losses on business dispositions, which by their nature can fluctuate from period to period. Other gains and losses consisted of net losses of $0.8 billion and $3.0 billion in fiscal 2025 and 2024, respectively, which primarily consisted of changes in fair value of our equity and other investments driven by changes in their underlying stock prices. \nOur effective income tax rate was 23.4%, 25.5%, and 33.6% for fiscal 2025, 2024 and 2023, respectively. The decrease in effective tax rate in fiscal 2025 compared to fiscal 2024 is primarily due to the tax impact on changes in fair value of our investments. The higher effective tax rate in fiscal 2023 compared to fiscal 2025 and fiscal 2024 is primarily related to the tax impacts of the separation of Flipkart and PhonePe. Our effective income tax rate may also fluctuate as a result of various factors, including changes in our assessment of unrecognized tax benefits, valuation allowances, business operations, acquisitions, investments, entry into new businesses and geographies, intercompany transactions, changes in tax law, changes in the administrative practices, principles, and interpretations related to tax, and the mix and size of earnings among our U.S. operations and international operations, which are subject to statutory rates that are generally higher than the U.S. statutory rate. The reconciliation from the U.S. statutory rate to the effective income tax rates for fiscal 2025, 2024 and 2023 is provided in \nNote 9\n.\n39\nAs a result of the factors discussed above, we reported $20.2 billion and $16.3 billion of consolidated net income for fiscal 2025 and 2024, respectively, which represents an increase of $3.9 billion and $5.0 billion for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. Diluted net income per common share attributable to Walmart (\"EPS\") was $2.41, $1.91 and $1.42 for fiscal 2025, 2024 and 2023, respectively. \nWalmart U.S. Segment\n \nFiscal Years Ended January 31,\n(Dollar amounts and retail square feet in millions)\n2025\n2024\n2023\nNet sales\n$\n462,415 \n$\n441,817 \n$\n420,553 \nNet sales percentage change from comparable period\n4.7 \n%\n5.1 \n%\n6.9 \n%\nCalendar comparable sales increase\n4.8 \n%\n5.5 \n%\n7.0 \n%\nMembership and other income\n$\n2,594 \n$\n1,985 \n$\n1,845 \nGross profit\n125,964 \n118,254 \n111,748 \nOperating expenses\n104,676 \n98,085 \n92,973 \nOperating income\n23,882 \n22,154 \n20,620 \nPercentage of net sales\nGross profit\n27.2 \n%\n26.8 \n%\n26.6 \n%\nOperating expenses\n22.6 \n%\n22.2 \n%\n22.1 \n%\nOperating income\n5.2 \n%\n5.0 \n%\n4.9 \n%\nUnit counts at period end\n4,605\n4,615\n4,717\nRetail square feet at period end\n698\n699\n702\nNet sales for the Walmart U.S. segment increased $20.6 billion or 4.7% and $21.3 billion or 5.1% for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. The increases in net sales were primarily due to increases in comparable sales of 4.8% and 5.5% for fiscal 2025 and 2024, respectively. Comparable sales in fiscal 2025 were driven by growth in transactions and unit volumes, with strong sales in grocery and health and wellness. Comparable sales in fiscal 2024 were driven by growth in transactions combined with growth in average ticket, including strong sales in grocery and health and wellness. Walmart U.S. eCommerce sales positively contributed approximately 2.9% and 2.6% to comparable sales for fiscal 2025 and 2024, respectively, which was primarily driven by store-fulfilled pickup and delivery.  \nMembership and other income increased $0.6 billion and $0.1 billion for fiscal 2025 and fiscal 2024, primarily driven by growth in membership fee income from Walmart+ and recycling income. \nGross profit rate increased 47 and 20 basis points for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. The increase in fiscal 2025 gross profit rate was primarily driven by managing prices aligned to our competitive historic price gaps and growth in higher margin businesses, partially offset by mix shifts into lower margin merchandise categories. The increase in fiscal 2024 gross profit rate was primarily due to managing prices aligned to our competitive historic price gaps and lapping higher net markdowns incurred in the prior year, partially offset by product mix shifts into lower margin categories. \nOperating expenses as a percentage of segment net sales increased 44 and 9 basis points for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. The increase for fiscal 2025 was primarily due to increased marketing expenses, higher variable pay as a result of exceeding planned performance and increased depreciation expenses. For fiscal 2024, the increase was driven by higher variable pay relative to the prior year as a result of exceeding our planned performance. \nAs a result of the factors discussed above, segment operating income increased $1.7 billion and $1.5 billion for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year.\n40\nWalmart International Segment\n \nFiscal Years Ended January 31,\n(Dollar amounts and retail square feet in millions)\n2025\n2024\n2023\nNet sales\n$\n121,885 \n$\n114,641 \n$\n100,983 \nPercentage change from comparable period\n6.3 \n%\n13.5 \n%\n— \n%\nMembership and other income\n$\n1,478 \n$\n1,408 \n$\n1,621 \nGross profit\n26,618 \n24,810 \n21,651 \nOperating expenses\n22,595 \n21,309 \n20,307 \nOperating income\n5,501 \n4,909 \n2,965 \nPercentage of net sales\nGross profit\n21.8 \n%\n21.6 \n%\n21.4 \n%\nOperating expenses\n18.5 \n%\n18.6 \n%\n20.1 \n%\nOperating income\n4.5 \n%\n4.3 \n%\n2.9 \n%\nUnit counts at period end\n5,566 \n5,402 \n5,306 \nRetail square feet at period end\n274 \n274 \n273 \nNet sales for the Walmart International segment increased $7.2 billion or 6.3% and $13.7 billion or 13.5% for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. For fiscal 2025, the increase was primarily due to positive comparable sales in all of our international markets, which included strength in eCommerce, partially offset by negative fluctuations in currency exchange rates of $3.2 billion. For fiscal 2024, the increase was primarily due to positive comparable sales across our international markets and positive fluctuations in currency exchange rates of $3.0 billion.\nGross profit rate increased 20 basis points for both fiscal 2025 and 2024 when compared to the previous fiscal year. For fiscal 2025, the increase was primarily due to improved eCommerce margin and business mix changes, partially offset by ongoing channel and format mix changes. For fiscal 2024, the increase was primarily driven by supply chain efficiencies partially offset by ongoing channel and format mix shifts.\nOperating expenses as a percentage of segment net sales decreased 5 and 152 basis points for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. The decrease in operating expenses as a percentage of segment net sales for fiscal 2025 was primarily due to increased sales driving expense leverage, partially offset by planned investments in associate wages and strategic priorities in Mexico and Central America. The decrease in operating expenses as a percentage of segment net sales for fiscal 2024, was primarily due to the lapping of business reorganization and restructuring charges incurred related to Flipkart and Massmart in fiscal 2023 and an increase in sales in fiscal 2024.\nAs a result of the factors discussed above, segment operating income increased $0.6 billion and $1.9 billion for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year.\n41\nSam's Club U.S. Segment\n \nFiscal Years Ended January 31,\n(Dollar amounts and retail square feet in millions)\n2025\n2024\n2023\nIncluding Fuel\nNet sales\n$\n90,238 \n$\n86,179 \n$\n84,345 \nPercentage change from comparable period\n4.7 \n%\n2.2 \n%\n14.7 \n%\nCalendar comparable sales increase\n4.7 \n%\n2.3 \n%\n14.6 \n%\nMembership and other income\n$\n2,323 \n$\n2,051 \n$\n1,908 \nGross profit\n10,203 \n9,431 \n8,761 \nOperating expenses\n10,122 \n9,290 \n8,705 \nOperating income\n2,404 \n2,192 \n1,964 \nPercentage of net sales\nGross profit\n11.3 \n%\n10.9 \n%\n10.4 \n%\nOperating expenses\n11.2 \n%\n10.8 \n%\n10.3 \n%\nOperating income\n2.7 \n%\n2.5 \n%\n2.3 \n%\nUnit counts at period end\n600 \n599 \n600 \nRetail square feet at period end\n80 \n80 \n80 \nExcluding Fuel \n(1)\nNet sales\n$\n79,777 \n$\n75,057 \n$\n71,665 \nPercentage change from comparable period\n6.3 \n%\n4.7 \n%\n10.5 \n%\nOperating income\n$\n1,785 \n$\n1,659 \n$\n1,352 \nOperating income as a percentage of net sales\n2.2 \n%\n2.2 \n%\n1.9 \n%\n(1)\n  We believe the \"Excluding Fuel\" information is useful to investors because it permits investors to understand the effect of the Sam's Club U.S. segment's fuel sales on its results of operations, which are impacted by the volatility of fuel prices. Volatility in fuel prices may continue to impact the operating results of the Sam's Club U.S. segment in the future.\nNet sales for the Sam's Club U.S. segment increased $4.1 billion or 4.7% and $1.8 billion or 2.2% for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. The increases in net sales were primarily due to increases in comparable sales, including fuel, of 4.7% and 2.3% for fiscal 2025 and 2024, respectively. Comparable sales in fiscal 2025 were driven by growth in transactions and unit volumes, with strong sales in grocery and health and wellness. Comparable sales in fiscal 2024 were driven by growth in transactions and average ticket, including strong sales in grocery and health and wellness. Additionally, fiscal 2025 and 2024 growth was partially offset by lower fuel sales primarily due to lower market prices. Sam's Club U.S. eCommerce sales positively contributed approximately\n \n2.3%\n and \n1.7% to comparable sales for fiscal 2025 and 2024, respectively, which was primarily driven by club-fulfilled curbside pickup and delivery.\nMembership and other income increased 13.3% and 7.5% for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. For fiscal 2025 and 2024, the increases were primarily due to growth in membership base and Plus penetration. Fiscal 2025 and 2024 were also positively impacted by the expiration of a promotional offering offsetting membership fee increases during the fourth quarter of fiscal 2024. \nGross profit rate increased 37 and 55 basis points for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. For fiscal 2025, the increase in gross profit rate was primarily due to improved operational efficiencies related to merchandise flow and increased margins in fuel, partially offset by higher eCommerce fulfillment costs. For fiscal \n2024\n, the increase in gross profit rate was primarily due to the lapping of elevated markdowns in the prior year. Additionally, fiscal 2025 and 2024 gross profit rates were partially offset by product mix shifts into lower margin categories.\nOperating expenses as a percentage of segment net sales increased 44 and 46 basis points for fiscal 2025 and 2024, respectively, when compared to the previous fiscal year. Fiscal 2025 operating expenses as a percentage of net sales increased primarily due to increased compensation related expenses, including associate wage investments and higher variable pay as a result of exceeding our planned performance, as well as elevated technology spend. Fiscal 2024 operating expenses as a percentage of net sales increased primarily due to lower fuel sales and elevated technology spend.\nAs a result of the factors discussed above, segment operating income increased $0.2 billion for both fiscal \n2025 and\n 2024, respectively, when compared to the previous fiscal year.\n42\nLiquidity and Capital Resources\nLiquidity\nThe strength and stability of our operations have historically supplied us with a significant source of liquidity. Our cash flows provided by operating activities, supplemented with our long-term debt and short-term borrowings, have been sufficient to fund our operations while allowing us to invest in activities that support the long-term growth of our operations. Generally, some or all of the remaining available cash flow has been used to fund dividends on our common stock and share repurchases. We believe our sources of liquidity will continue to be sufficient to fund operations, finance our investment activities, pay dividends and fund our share repurchases for at least the next 12 months and for the foreseeable future.\nNet Cash Provided by Operating Activities\nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nNet cash provided by operating activities\n$\n36,443 \n$\n35,726 \n$\n28,841 \nNet cash provided by operating activities was $36.4 billion, $35.7 billion and $28.8 billion for fiscal 2025, 2024 and 2023, respectively. The increase in net cash provided by operating activities in fiscal 2025, when compared to the previous fiscal year, is primarily due to an increase in cash provided by operating income and lapping the payment of accrued opioid legal charges in the prior year, partially offset by increased inventory purchases. The increase in net cash provided by operating activities for fiscal 2024, when compared to the previous fiscal year, was primarily due to higher cash provided by operating income, as well as timing of certain payments and strategic inventory management as part of working capital initiatives, partially offset by payment of the remaining accrued opioid legal charges.\nCash Equivalents and Working Capital Deficit \nCash and cash equivalents were $9.0 billion and $9.9 billion as of January 31, 2025 and 2024, respectively. Our working capital deficit, defined as total current assets less total current liabilities, was $17.1 billion and $15.5 billion as of January 31, 2025 and 2024, respectively. The increase in our working capital deficit is primarily driven by an increase in short-term borrowings for general corporate purposes and accounts payable due to timing of payments, partially offset by increased inventories and receivables related to higher sales growth. We generally operate with a working capital deficit due to our efficient use of cash in funding operations, consistent access to the capital markets and returns provided to our shareholders in the form of payments of cash dividends and share repurchases. \nWe use intercompany financing arrangements in an effort to ensure cash can be made available in the country in which it is needed with the minimum cost possible. Additionally, from time-to-time, we repatriate earnings and related cash from jurisdictions outside of the U.S. Under current law, repatriations of foreign earnings will generally be free of U.S. federal tax, but may incur other taxes such as withholding or state taxes. We do not expect current local laws, or other existing limitations on anticipated future repatriations of cash amounts held outside the U.S. to have a material effect on our overall liquidity, financial position or results of operations.\nAs of January 31, 2025 and 2024, cash and cash equivalents of $3.3 billion and $3.5 billion, respectively, may not be freely transferable to the U.S. due to local laws or other restrictions or are subject to the approval of the noncontrolling interest shareholders.\nNet Cash Used in Investing Activities\n \nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nNet cash used in investing activities\n$\n(21,379)\n$\n(21,287)\n$\n(17,722)\nNet cash used in investing activities was $21.4 billion, $21.3 billion and $17.7 billion for fiscal 2025, 2024 and 2023, respectively, and generally consisted of capital expenditures. Net cash used in investing activities increased $0.1 billion for fiscal 2025 when compared to the previous fiscal year. The increase is primarily due to increased purchases of property and equipment as well as the acquisition of VIZIO for net consideration of $1.9 billion, partially offset by net proceeds received from sales of certain strategic investments, including $3.6 billion related to the sale of our JD.com investment. Net cash used in investing activities increased $3.6 billion for fiscal 2024 when compared to the previous fiscal year, primarily due to increased payments for property and equipment.\nCapital expenditures\nRefer to the \"\nStrategic Capital Allocation\n\" section in our \nCompany Performance Metrics\n for capital expenditure detail for fiscal 2025 and 2024. For the fiscal year ending January 31, 2026 (\"fiscal 2026\"), we project capital expenditures will be approximately $21 billion to $25 billion, with a focus on technology, supply chain and customer-facing initiatives.\n43\nNet Cash Used in Financing Activities\n \nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nNet cash used in financing activities\n$\n(14,822)\n$\n(13,414)\n$\n(17,039)\nNet cash used in financing activities generally consisted of debt transactions, dividends paid, repurchases of Company stock and transactions with noncontrolling interest shareholders. Fiscal 2025 net cash used in financing activities increased $1.4 billion when compared to the previous fiscal year. The increase is primarily due to lapping debt issuances in the prior fiscal year and increased share repurchases, partially offset by the purchase of certain noncontrolling interests in the prior fiscal year and higher short-term borrowings. Fiscal 2024 net cash used in financing activities decreased $3.6 billion when compared to the previous fiscal year. The decrease was primarily due to fewer share repurchases, partially offset by the purchase of certain noncontrolling interests.\nPurchase and Sale of Subsidiary Stoc\nk\nDuring fiscal 2024, we paid $3.5 billion to acquire shares from certain Flipkart noncontrolling interest holders and settle the liability to former noncontrolling interest holders of PhonePe. Additionally, we received $0.7 billion related to new rounds of equity funding for the Company's majority owned PhonePe subsidiary.\nDuring fiscal 2023, we completed a $0.4 billion buyout of the noncontrolling interest shareholders of our Massmart subsidiary and completed a $0.4 billion acquisition of Alert Innovation, bringing our ownership to approximately 100% of both Massmart and Alert Innovation. The Alert Innovation entity was subsequently sold and deconsolidated in fiscal 2025.\nShort-term Borrowings\nWe generally utilize the liquidity provided by short-term borrowings to provide funding for our operations, dividend payments, share repurchases, capital expenditures and other cash requirements. The following table includes additional information related to our short-term borrowings for fiscal 2025, 2024 and 2023:\n \nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nMaximum amount outstanding at any month-end\n$\n7,232 \n$\n9,942 \n$\n11,432 \nAverage daily short-term borrowings\n4,157 \n4,295 \n7,250 \nAnnual weighted-average interest rate\n5.1 \n%\n5.1 \n%\n2.4 \n%\nShort-term borrowings as of January 31, 2025 and 2024 were $3.1 billion and $0.9 billion, respectively, with weighted-average interest rates of 5.3% and 7.7%, respectively. We also have $15.0 billion of various undrawn committed lines of credit in the U.S. as of January 31, 2025 that provide additional liquidity, if needed. Additionally, we maintain access to various credit facilities outside of the U.S. to further support our Walmart International segment operations, as needed. \nAs of January 31, 2025, we have $2.1 billion of syndicated and fronted letters of credit available, of which $1.5 billion was drawn and represents an unrecorded current obligation.\nLong-term Debt\nThe following table provides the changes in our long-term debt for fiscal 2025: \n(Amounts in millions)\nLong-term debt due within one year\nLong-term debt\nTotal\nBalances as of February 1, 2024\n$\n3,447 \n$\n36,132 \n$\n39,579 \nRepayments of long-term debt\n(3,468)\n— \n(3,468)\nReclassifications of long-term debt\n2,625 \n(2,625)\n— \nCurrency and other adjustments\n(6)\n(106)\n(112)\nBalances as of January 31, 2025\n$\n2,598 \n$\n33,401 \n$\n35,999 \nOur total outstanding long-term debt decreased $3.6 billion during fiscal 2025, primarily due to maturities of certain long-term debt. Refer to \nNote 6\n to our Consolidated Financial Statements for details on the issuances of long-term debt.\nEstimated contractual interest payments associated with our long-term debt amount to $18.2 billion, with approximately $1.7 billion expected to be paid in fiscal 2026. Estimated interest payments are based on our principal amounts and expected maturities of all debt outstanding as of January 31, 2025, and assumes interest rates remain at current levels for our variable rate instruments. \n44\nDividends\nOur total dividend payments were $6.7 billion, $6.1 billion and $6.1 billion for fiscal 2025, 2024 and 2023, respectively. Effective February 20, 2025, the Company approved the fiscal 2026 annual dividend of $0.94 per share, an increase over the fiscal 2025 annual dividend of $0.83 per share. For fiscal 2026, the annual dividend will be paid in four quarterly installments of $0.235 per share, according to the following record and payable dates:\nRecord Date\nPayable Date\nMarch 21, 2025\nApril 7, 2025\nMay 9, 2025\nMay 27, 2025\nAugust 15, 2025\nSeptember 2, 2025\nDecember 12, 2025\nJanuary 5, 2026\nCompany Share Repurchase Program \nFrom time to time, the Company repurchases shares of its common stock under share repurchase programs authorized by the Company's Board of Directors. All repurchases made during fiscal 2025 were made under the current $20.0 billion share repurchase program approved in November 2022, which has no expiration date or other restrictions limiting the period over which the Company can make repurchases. As of January 31, 2025, authorization for $12.0 billion of share repurchases remained under the share repurchase program. Any repurchased shares are constructively retired and returned to an unissued status. \nWe regularly review share repurchase activity and consider several factors in determining when to execute share repurchases, including, among other things, current cash needs, capacity for leverage, cost of borrowings, our results of operations and the market price of our common stock. We anticipate that a majority of the ongoing share repurchase program will be funded through the Company's free cash flow. \nThe following table provides, on a settlement date basis, the number of shares repurchased, average price paid per share and total amount paid for share repurchases for fiscal 2025, 2024 and 2023: \nFiscal Years Ended January 31,\n(Amounts in millions, except per share data)\n2025\n2024\n2023\nTotal number of shares repurchased\n61.9\n54.6\n221.8\nAverage price paid per share\n$\n72.72 \n$\n50.87 \n$\n44.72 \nTotal amount paid for share repurchases\n$\n4,494 \n$\n2,779 \n$\n9,920 \nMaterial Cash Requirements\nMaterial cash requirements from operating activities primarily consist of inventory purchases, employee related costs, taxes, interest and other general operating expenses, which we expect to be primarily satisfied by our cash from operations. Other material cash requirements from known contractual and other obligations include short-term borrowings, long-term debt and related interest payments, leases and purchase obligations. See \nNote 6\n and \nNote 7\n to our Consolidated Financial Statements for information regarding outstanding short-term borrowings and long-term debt, and leases, respectively.\nAs of January 31, 2025, the Company has $37.2 billion of unrecorded purchase obligations outstanding, of which $15.9 billion is due within one year. Purchase obligations include legally binding contracts, such as firm commitments for inventory and utility purchases, as well as commitments to make capital expenditures, software acquisition and license commitments and legally binding service contracts. Contractual obligations for the purchase of goods or services are defined as agreements that are enforceable and legally binding and that specify all significant terms, including: fixed or minimum quantities to be purchased; fixed, minimum or variable price provisions; and the approximate timing of the transaction. Contracts that specify the Company will purchase all or a portion of its requirements of a specific product or service from a supplier, but do not include a fixed or minimum quantity, are excluded from the obligations quantified above. Accordingly, purchase orders for inventory are also excluded as purchase orders represent authorizations to purchase rather than binding agreements. Our purchase orders are based on our current inventory needs and are fulfilled by our suppliers within short time periods. We also enter into contracts for outsourced services; however, the obligations under these contracts are not significant and the contracts generally contain clauses allowing for cancellation without significant penalty. Timing of payments and actual amounts paid may be different depending on the timing of receipt of goods or services or changes to agreed-upon amounts for some obligations.\nCapital Resources\nWe believe our cash flows from operations, current cash position, short-term borrowings and access to capital markets will continue to be sufficient to meet our anticipated cash requirements and contractual obligations, which includes funding seasonal buildups in merchandise inventories and funding our capital expenditures, acquisitions, dividend payments and share repurchases.\n45\nWe have strong commercial paper and long-term debt ratings that have enabled and should continue to enable us to refinance our debt as it becomes due at favorable rates in capital markets. As of January 31, 2025, the ratings assigned to our commercial paper and rated series of our outstanding long-term debt were as follows:\nRating agency\n  \nCommercial paper\n  \nLong-term debt\nStandard & Poor's\n  \nA-1+\n  \nAA\nMoody's Investors Service\n  \nP-1\n  \nAa2\nFitch Ratings\n  \nF1+\n  \nAA\nCredit rating agencies review their ratings periodically, and therefore, the credit ratings assigned to us by each agency may be subject to revision at any time. Accordingly, we are not able to predict whether our current credit ratings will remain consistent over time. Factors that could affect our credit ratings include changes in our operating performance, the general economic environment, conditions in the retail industry, our financial position, including our total debt and capitalization, and changes in our business strategy. Any downgrade of our credit ratings by a credit rating agency could increase our future borrowing costs or impair our ability to access capital and credit markets on terms commercially acceptable to us. In addition, any downgrade of our current short-term credit ratings could impair our ability to access the commercial paper markets with the same flexibility that we have experienced historically, potentially requiring us to rely more heavily on more expensive types of debt financing. The credit rating agency ratings are not recommendations to buy, sell or hold our commercial paper or debt securities. Each rating may be subject to revision or withdrawal at any time by the assigning rating organization and should be evaluated independently of any other rating. Moreover, each credit rating is specific to the security to which it applies.\nOther Matters\nIn \nNote 10\n to our Consolidated Financial Statements, which is captioned \"Contingencies\" and appears in \nPart II\n of this Annual Report on Form 10-K under the caption \"\nItem 8. Financial Statements and Supplementary Data\n,\" we discuss, under the sub-captions \"\nSettlement of Certain Opioid-Related Matters,\n\" \nand \n\"\nOngoing Opioid-Related Litigation,\n\" certain opioid-related matters, as well as the Prescription Opiate Litigation, and other matters, including certain risks arising therefrom. In that \nNote 10\n, we discuss \"\nAsda Equal Value Claims\n\"\n \nthe Company's indemnification obligation for the Asda Equal Value Claims matter, \"\nMoney Transfer Agent Services Matters,\n\" a United States Federal Trade Commission complaint related to money transfers and the Company's anti-fraud program and a government investigation by the U.S. Attorney's Office for the Middle District of Pennsylvania into the Company's consumer fraud prevention and anti-money laundering compliance related to the Company's money transfer agent services, as well as matters related to independent contractor drivers on our Spark platform under \"\nDriver Platform Matters.\n\" In \nNote 10\n, under \"\nMexico Antitrust Matter\n,\" we also discuss a quasi-judicial administrative process initiated by COFECE against Walmex and Walmex's related constitutional challenge. In \nNote 10\n, we also discuss a show cause notice and requests issued by the Directorate of Enforcement to Flipkart regarding Foreign Direct Investment rules and regulations in India and an India Antitrust Matter. We reference various legal proceedings related to the Prescription Opiate Litigation, the DOJ Opioid Civil Litigation, Opioids-Related Securities Class Actions, Shareholder Derivative Litigation and False Claims Act Litigation; Asda Equal Value Claims; Money Transfer Agent Services Litigation; Driver Platform Litigation; and Mexico Antitrust Matter in \nPart I\n of this Annual Report on Form 10-K under the caption \"\nItem 3. Legal Proceedings\n,\" under the sub-caption \"I. Supplemental Information.\" The foregoing matters and other matters described elsewhere in this Annual Report on Form 10-K represent contingent liabilities of the Company that may or may not result in the incurrence of a material liability by the Company upon their final resolution.\nSummary of Critical Accounting Estimates\nManagement strives to report our financial results in a clear and understandable manner, although in some cases accounting and disclosure rules are complex and require us to use technical terminology. In preparing the Company's Consolidated Financial Statements, we follow accounting principles generally accepted in the U.S. These principles require us to make certain estimates and apply judgments that affect our financial position and results of operations as reflected in our financial statements. These judgments and estimates are based on past events and expectations of future outcomes. Actual results may differ from our estimates.\nManagement continually reviews our accounting policies including how they are applied and how they are reported and disclosed in our financial statements. Following is a summary of our critical accounting estimates and how they are applied in preparation of the financial statements.\nContingencies\nWe are involved in a number of legal proceedings and certain regulatory matters. We record a liability when it is probable that a loss has been incurred and the amount is reasonably estimable. We also perform an assessment of the materiality of loss contingencies where a loss is either reasonably possible or it is reasonably possible that a loss could be incurred in excess of amounts accrued. If a loss or an additional loss has at least a reasonable possibility of occurring and the impact on the financial statements would be material, we provide disclosure of the loss contingency in the footnotes to our financial statements. We review all contingencies at least quarterly to determine whether the likelihood of loss has changed and to assess whether a \n46\nreasonable estimate of the loss or the range of the loss can be made. Although we are not able to predict the outcome or reasonably estimate a range of possible losses in certain matters described in \nNote 10\n to our Consolidated Financial Statements and have not recorded an associated accrual related to these matters, an adverse judgment or negotiated resolution in any of these matters could have a material adverse effect on our business, reputation, financial position, results of operations or cash flows.\nUncertain Tax Positions\nWe are subject to income taxes in the U.S. and numerous foreign jurisdictions. Our tax returns are routinely audited and settlements of issues raised in these audits sometimes affect our tax provisions. The benefits of uncertain tax positions are recorded in our financial statements only after determining a more likely than not probability that the uncertain tax positions will withstand challenge, if any, from taxing authorities. When facts and circumstances change, we reassess these probabilities and record any changes in the financial statements as appropriate. We account for uncertain tax positions by determining the minimum recognition threshold that a tax position is required to meet before being recognized in the financial statements. Accordingly, the determination of our uncertain tax positions requires judgment, the use of estimates in certain cases and the interpretation and application of complex tax laws.\nITEM 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nMarket Risk\nIn addition to the risks inherent in our operations, we are exposed to certain market risks, including changes in interest rates, currency exchange rates and the fair values of certain equity and equity method investments measured on a recurring basis.\nThe analysis presented below for each of our market risk sensitive instruments is based on a hypothetical scenario used to calibrate potential risk and does not represent our view of future market changes. The effect of a change in a particular assumption is calculated without adjusting any other assumption. In reality, however, a change in one factor could cause a change in another, which may magnify or negate other sensitivities.\nInterest Rate Risk\nWe are exposed to changes in interest rates as a result of our short-term borrowings and long-term debt. We hedge a portion of our interest rate risk by managing the mix of fixed and variable rate debt and by entering into interest rate swaps. For fiscal 2025, the net fair value of our interest rate swaps increased $43 million primarily due to fluctuations in market interest rates. \nThe table below provides information about our financial instruments that are sensitive to changes in interest rates. For long-term debt, the table represents the principal cash flows and related weighted-average interest rates by expected maturity dates. For interest rate swaps, the table represents the contractual cash flows and weighted-average interest rates by the contractual maturity date, unless otherwise noted. The notional amounts are used to calculate contractual cash flows to be exchanged under the contracts. The weighted-average variable rates are based upon prevailing market rates as of January 31, 2025.\nExpected Maturity Date\n(Amounts in millions)\nFiscal 2026\nFiscal 2027\nFiscal 2028\nFiscal 2029\nFiscal 2030\nThereafter\nTotal\nLiabilities\nShort-term borrowings:\nVariable rate\n$\n3,068 \n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \n$\n3,068 \nWeighted-average interest rate\n5.3 \n%\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n5.3 \n%\nLong-term debt\n(1)\n:\nFixed rate\n$\n2,598 \n$\n3,451 \n$\n1,741 \n$\n3,340 \n$\n1,955 \n$\n22,914 \n$\n35,999 \nWeighted-average interest rate\n3.8 \n%\n2.5 \n%\n3.6 \n%\n3.1 \n%\n4.2 \n%\n4.4 \n%\n4.0 \n%\nInterest rate derivatives\nInterest rate swaps:\nFixed to variable\n$\n— \n$\n— \n$\n— \n$\n1,250 \n$\n1,052 \n$\n2,469 \n$\n4,771 \nWeighted-average pay rate\n— \n%\n— \n%\n— \n%\n4.7 \n%\n6.1 \n%\n5.9 \n%\n5.6 \n%\nWeighted-average receive rate\n— \n%\n— \n%\n— \n%\n1.5 \n%\n3.0 \n%\n2.9 \n%\n2.5 \n%\n(1)\n    Includes deferred loan costs, discounts, fair value hedges, foreign-held debt and secured debt. \nAs of January 31, 2025, our variable rate borrowings, including the effect of our commercial paper and interest rate swaps, represented 20% of our total short-term and long-term debt. Based on January 31, 2025 debt levels, a 100 basis point change in prevailing market rates would cause our annual interest costs to change by approximately $0.1 billion.\n47\nForeign Currency Risk\nWe are exposed to fluctuations in currency exchange rates as a result of our investments and operations in countries other than the U.S., as well as our foreign-currency-denominated long-term debt. For fiscal 2025, movements in currency exchange rates and the related impact on the translation of the balance sheets resulted in the $2.2 billion net loss in the currency translation and other category of accumulated other comprehensive loss. \nWe hedge a portion of our foreign currency risk by entering into currency swaps. The aggregate fair value of these swaps was in a liability position of $1.4 billion and $1.3 billion as of January 31, 2025 and January 31, 2024, respectively. The change in the fair value of these swaps was due to fluctuations in currency exchange rates, primarily due to the weakening of certain currencies relative to the U.S. dollar in fiscal 2025. The hypothetical result of a uniform 10% weakening in the value of the U.S. dollar relative to other currencies underlying these swaps would have resulted in a change in the value of the swaps of $0.6 billion. A hypothetical 10% change in interest rates underlying these swaps from the market rates in effect as of January 31, 2025 would have resulted in a change in the value of the swaps of $0.1 billion.\nIn certain countries, we also enter into immaterial foreign currency forward contracts to hedge the purchase and payment of purchase commitments denominated in non-functional currencies.\nInvestment Risk\nWe are exposed to investment risk primarily related to changes in the fair value of certain equity investments, including certain immaterial equity method investments where we have elected the fair value option, measured on a recurring basis. The amounts of gains and losses included in earnings from fair value changes for these investments are recorded within other gains and losses and, along with certain other immaterial investment activity, resulted in a net loss of $0.8 billion in fiscal 2025 primarily due to net decreases in the underlying stock prices of these investments. As of January 31, 2025, the fair value of our equity investments, including certain immaterial equity method investments where we have elected the fair value option, measured on a recurring basis was $3.0 billion. As of January 31, 2025, a hypothetical 10% change in the stock price of such investments would have changed the fair value of such investments by approximately $0.3 billion. \n48\nITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nConsolidated Financial Statements of Walmart Inc.\nFor the Fiscal Year Ended January 31, 2025\nTable of Contents\nPage\nReport\ns\n of Independent Registered Public Accounting Firm\n (PCAOB ID: \n42\n)\n50\nConsolidated Statements of Income\n53\nConsolidated Statements of Comprehensive Income\n54\nConsolidated Balance Sheets\n55\nConsolidated Statements of Shareholders' Equity\n56\nConsolidated Statements of Cash Flows\n57\nNotes to Consolidated Financial Statements\n58\n49\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Walmart Inc.\nOpinion on the Financial Statements \nWe have audited the accompanying consolidated balance sheets of Walmart Inc. (the Company) as of January 31, 2025 and 2024, the related consolidated statements of income, comprehensive income, shareholders' equity and cash flows for each of the three years in the period ended January 31, 2025, and the related notes (collectively referred to as the \"Consolidated Financial Statements\"). In our opinion, the Consolidated Financial Statements present fairly, in all material respects, the financial position of the Company at January 31, 2025 and 2024, and the results of its operations and its cash flows for each of the three years in the period ended January 31, 2025, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of January 31, 2025, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated March 14, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion \nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the Consolidated Financial Statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosures to which it relates.\nContingencies\nDescription of the Matter\nAs described in Note 10 to the Consolidated Financial Statements, at January 31, 2025, the Company is involved in a number of legal proceedings and certain regulatory matters. The Company records a liability for those legal proceedings and regulatory matters when management determines it is probable that a loss has been incurred and the amount of the loss can be reasonably estimated. The Company also discloses when it is reasonably possible that a material loss may be incurred. In assessing the probability of occurrence and whether an estimate of loss can be reasonably estimated for a particular legal proceeding, management exercises judgment on matters relevant to each proceeding. Auditing management's accounting for, and disclosure of, loss contingencies was complex and highly judgmental as it involved our assessment of the significant judgments made by management when assessing the probability of loss for contingencies or when determining whether an estimate of the loss or range of loss could be made. \n50\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the identification and evaluation of contingencies. For example, we tested controls over the Company's assessment of the likelihood of loss and the Company's determinations regarding the measurement of loss. \nTo test the Company's assessment of the probability of loss or determination of an estimate of loss, or range of loss, among other procedures, we read the minutes of the meetings of the board of directors and committees of the board of directors, reviewed documents provided to the Company by certain outside legal counsel, read letters received directly by us from internal and outside legal counsel, evaluated the current status of contingencies based on discussions with internal and outside legal counsel, and obtained representations from management. We also assessed the adequacy of the related disclosures. \n/s/  \nErnst & Young LLP\n \nWe have served as the Company's auditor since 1969.\nRogers, Arkansas\nMarch 14, 2025\n51\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Walmart Inc. \nOpinion on Internal Control Over Financial Reporting \nWe have audited Walmart Inc.'s internal control over financial reporting as of January 31, 2025, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Walmart Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of January 31, 2025, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of January 31, 2025 and 2024, the related consolidated statements of income, comprehensive income, shareholders' equity and cash flows for each of the three years in the period ended January 31, 2025, and the related notes and our report dated March 14, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion \nThe Company's management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company's internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion. \nDefinition and Limitations of Internal Control Over Financial Reporting \nA company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP \nRogers, Arkansas\nMarch 14, 2025\n52\nWalmart Inc.\nConsolidated Statements of Income\nFiscal Years Ended January 31,\n(Amounts in millions, except per share data)\n2025\n2024\n2023\nRevenues:\nNet sales\n$\n674,538\n \n$\n642,637\n \n$\n605,881\n \nMembership and other income\n6,447\n \n5,488\n \n5,408\n \nTotal revenues\n680,985\n \n648,125\n \n611,289\n \nCosts and expenses:\nCost of sales\n511,753\n \n490,142\n \n463,721\n \nOperating, selling, general and administrative expenses\n139,884\n \n130,971\n \n127,140\n \nOperating income\n29,348\n \n27,012\n \n20,428\n \nInterest:\nDebt\n2,249\n \n2,259\n \n1,787\n \nFinance lease\n479\n \n424\n \n341\n \nInterest income\n(\n483\n)\n(\n546\n)\n(\n254\n)\nInterest, net\n2,245\n \n2,137\n \n1,874\n \nOther (gains) and losses\n794\n \n3,027\n \n1,538\n \nIncome before income taxes\n26,309\n \n21,848\n \n17,016\n \nProvision for income taxes\n6,152\n \n5,578\n \n5,724\n \nConsolidated net income\n20,157\n \n16,270\n \n11,292\n \nConsolidated net (income) loss attributable to noncontrolling interest\n(\n721\n)\n(\n759\n)\n388\n \nConsolidated net income attributable to Walmart\n$\n19,436\n \n$\n15,511\n \n$\n11,680\n \nNet income per common share:\nBasic net income per common share attributable to Walmart\n$\n2.42\n \n$\n1.92\n \n$\n1.43\n \nDiluted net income per common share attributable to Walmart\n2.41\n \n1.91\n \n1.42\n \nWeighted-average common shares outstanding:\nBasic\n8,041\n \n8,077\n \n8,171\n \nDiluted\n8,081\n \n8,108\n \n8,202\n \nDividends declared per common share\n$\n0.8300\n \n$\n0.7600\n \n$\n0.7467\n \nSee accompanying notes. \n53\nWalmart Inc.\nConsolidated Statements of Comprehensive Income\n \nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nConsolidated net income\n$\n20,157\n \n$\n16,270\n \n$\n11,292\n \nConsolidated net (income) loss attributable to noncontrolling interest\n(\n721\n)\n(\n759\n)\n388\n \nConsolidated net income attributable to Walmart\n19,436\n \n15,511\n \n11,680\n \nOther comprehensive income (loss), net of income taxes\nCurrency translation and other\n(\n2,810\n)\n888\n \n(\n1,853\n)\nCash flow hedges\n(\n49\n)\n56\n \n(\n203\n)\nOther comprehensive income (loss), net of income taxes\n(\n2,859\n)\n944\n \n(\n2,056\n)\nOther comprehensive (income) loss attributable to noncontrolling interest\n556\n \n(\n566\n)\n404\n \nOther comprehensive income (loss) attributable to Walmart\n(\n2,303\n)\n378\n \n(\n1,652\n)\nComprehensive income, net of income taxes\n17,298\n \n17,214\n \n9,236\n \nComprehensive (income) loss attributable to noncontrolling interest\n(\n165\n)\n(\n1,325\n)\n792\n \nComprehensive income attributable to Walmart\n$\n17,133\n \n$\n15,889\n \n$\n10,028\n \n See accompanying notes. \n54\nWalmart Inc.\nConsolidated Balance Sheets\nAs of January 31,\n(Amounts in millions)\n2025\n2024\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n9,037\n \n$\n9,867\n \nReceivables, net\n9,975\n \n8,796\n \nInventories\n56,435\n \n54,892\n \nPrepaid expenses and other\n4,011\n \n3,322\n \nTotal current assets\n79,458\n \n76,877\n \nProperty and equipment, net\n119,993\n \n110,810\n \nOperating lease right-of-use assets\n13,599\n \n13,673\n \nFinance lease right-of-use assets, net\n6,112\n \n5,855\n \nGoodwill\n28,792\n \n28,113\n \nOther long-term assets\n12,869\n \n17,071\n \nTotal assets\n$\n260,823\n \n$\n252,399\n \nLIABILITIES, REDEEMABLE NONCONTROLLING INTEREST, AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nShort-term borrowings\n$\n3,068\n \n$\n878\n \nAccounts payable\n58,666\n \n56,812\n \nAccrued liabilities\n29,345\n \n28,759\n \nAccrued income taxes\n608\n \n307\n \nLong-term debt due within one year\n2,598\n \n3,447\n \nOperating lease obligations due within one year\n1,499\n \n1,487\n \nFinance lease obligations due within one year\n800\n \n725\n \nTotal current liabilities\n96,584\n \n92,415\n \nLong-term debt\n33,401\n \n36,132\n \nLong-term operating lease obligations\n12,825\n \n12,943\n \nLong-term finance lease obligations\n5,923\n \n5,709\n \nDeferred income taxes and other\n14,398\n \n14,629\n \nCommitments and contingencies\nRedeemable noncontrolling interest\n271\n \n222\n \nShareholders' equity:\nCommon stock\n802\n \n805\n \nCapital in excess of par value\n5,503\n \n4,544\n \nRetained earnings\n98,313\n \n89,814\n \nAccumulated other comprehensive loss\n(\n13,605\n)\n(\n11,302\n)\nTotal Walmart shareholders' equity\n91,013\n \n83,861\n \nNonredeemable noncontrolling interest\n6,408\n \n6,488\n \nTotal shareholders' equity\n97,421\n \n90,349\n \nTotal liabilities, redeemable noncontrolling interest, and shareholders' equity\n$\n260,823\n \n$\n252,399\n \n See accompanying notes. \n55\nWalmart Inc.\nConsolidated Statements of Shareholders' Equity\nAccumulated\nTotal\nCapital in\nOther\nWalmart\nNonredeemable\nTotal\n(Amounts in millions)\nCommon Stock\nExcess of\nRetained\nComprehensive\nShareholders'\nNoncontrolling\nShareholders'\nShares\nAmount\nPar Value\nEarnings\nIncome (Loss)\nEquity\nInterest\nEquity\nBalances as of February 1, 2022\n8,284\n \n$\n828\n \n$\n4,287\n \n$\n86,904\n \n$\n(\n8,766\n)\n$\n83,253\n \n$\n8,638\n \n$\n91,891\n \nConsolidated net income\n— \n— \n— \n11,680\n \n— \n11,680\n \n(\n388\n)\n11,292\n \nOther comprehensive loss, net of income taxes\n— \n— \n— \n— \n(\n1,652\n)\n(\n1,652\n)\n(\n404\n)\n(\n2,056\n)\nCash dividends declared ($\n0.7467\n per share)\n— \n— \n— \n(\n6,114\n)\n— \n(\n6,114\n)\n— \n(\n6,114\n)\nPurchase of Company stock\n(\n221\n)\n(\n22\n)\n(\n518\n)\n(\n9,326\n)\n— \n(\n9,866\n)\n— \n(\n9,866\n)\nCash dividend declared to noncontrolling interest\n— \n— \n— \n— \n— \n— \n(\n449\n)\n(\n449\n)\nPurchase of noncontrolling interest\n— \n— \n(\n18\n)\n— \n(\n1,262\n)\n(\n1,280\n)\n(\n493\n)\n(\n1,773\n)\nSale of subsidiary stock\n— \n— \n48\n \n— \n— \n48\n \n18\n \n66\n \nOther\n17\n \n2\n \n631\n \n(\n9\n)\n— \n624\n \n139\n \n763\n \nBalances as of January 31, 2023\n8,080\n \n808\n \n4,430\n \n83,135\n \n(\n11,680\n)\n76,693\n \n7,061\n \n83,754\n \nConsolidated net income\n— \n— \n— \n15,511\n \n— \n15,511\n \n774\n \n16,285\n \nOther comprehensive income, net of income taxes\n— \n— \n— \n— \n378\n \n378\n \n566\n \n944\n \nCash dividends declared ($\n0.7600\n per share)\n— \n— \n— \n(\n6,140\n)\n— \n(\n6,140\n)\n— \n(\n6,140\n)\nPurchase of Company stock\n(\n55\n)\n(\n6\n)\n(\n150\n)\n(\n2,635\n)\n— \n(\n2,791\n)\n— \n(\n2,791\n)\nCash dividend declared to noncontrolling interest\n— \n— \n— \n— \n— \n— \n(\n776\n)\n(\n776\n)\nPurchase of noncontrolling interest\n— \n— \n(\n1,076\n)\n— \n— \n(\n1,076\n)\n(\n1,367\n)\n(\n2,443\n)\nSale of subsidiary stock\n— \n— \n562\n \n— \n— \n562\n \n154\n \n716\n \nOther\n29\n \n3\n \n778\n \n(\n57\n)\n— \n724\n \n76\n \n800\n \nBalances as of January 31, 2024\n8,054\n \n805\n \n4,544\n \n89,814\n \n(\n11,302\n)\n83,861\n \n6,488\n \n90,349\n \nConsolidated net income\n— \n— \n— \n19,436\n \n— \n19,436\n \n766\n \n20,202\n \nOther comprehensive loss, net of income taxes\n— \n— \n— \n— \n(\n2,303\n)\n(\n2,303\n)\n(\n556\n)\n(\n2,859\n)\nCash dividends declared ($\n0.8300\n per share)\n— \n— \n— \n(\n6,688\n)\n— \n(\n6,688\n)\n— \n(\n6,688\n)\nPurchase of Company stock\n(\n61\n)\n(\n6\n)\n(\n230\n)\n(\n4,241\n)\n— \n(\n4,477\n)\n— \n(\n4,477\n)\nCash dividend declared to noncontrolling interest\n— \n— \n— \n— \n— \n— \n(\n648\n)\n(\n648\n)\nSale of subsidiary stock\n— \n— \n169\n \n— \n— \n169\n \n193\n \n362\n \nOther\n31\n \n3\n \n1,020\n \n(\n8\n)\n— \n1,015\n \n165\n \n1,180\n \nBalances as of January 31, 2025\n8,024\n \n802\n \n5,503\n \n98,313\n \n(\n13,605\n)\n91,013\n \n6,408\n \n97,421\n \n See accompanying notes.\n56\nWalmart Inc.\nConsolidated Statements of Cash Flows\nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nCash flows from operating activities:\nConsolidated net income\n$\n20,157\n \n$\n16,270\n \n$\n11,292\n \nAdjustments to reconcile consolidated net income to net cash provided by operating activities:\nDepreciation and amortization\n12,973\n \n11,853\n \n10,945\n \nInvestment (gains) and losses, net\n878\n \n3,193\n \n1,683\n \nDeferred income taxes\n(\n635\n)\n(\n175\n)\n449\n \nOther operating activities\n2,889\n \n2,642\n \n1,919\n \nChanges in certain assets and liabilities, net of effects of acquisitions and dispositions:\nReceivables, net\n(\n1,106\n)\n(\n797\n)\n240\n \nInventories\n(\n2,755\n)\n2,017\n \n(\n528\n)\nAccounts payable\n3,228\n \n2,515\n \n(\n1,425\n)\nAccrued liabilities\n379\n \n(\n1,324\n)\n4,393\n \nAccrued income taxes\n435\n \n(\n468\n)\n(\n127\n)\nNet cash provided by operating activities\n36,443\n \n35,726\n \n28,841\n \nCash flows from investing activities:\nPayments for property and equipment\n(\n23,783\n)\n(\n20,606\n)\n(\n16,857\n)\nProceeds from the disposal of property and equipment\n432\n \n250\n \n170\n \nProceeds from disposal of certain strategic investments\n4,080\n \n—\n \n—\n \nPayments for business acquisitions, net of cash acquired\n(\n1,896\n)\n(\n9\n)\n(\n740\n)\nOther investing activities\n(\n212\n)\n(\n922\n)\n(\n295\n)\nNet cash used in investing activities\n(\n21,379\n)\n(\n21,287\n)\n(\n17,722\n)\nCash flows from financing activities:\nNet change in short-term borrowings\n2,212\n \n512\n \n(\n34\n)\nProceeds from issuance of long-term debt\n—\n \n4,967\n \n5,041\n \nRepayments of long-term debt\n(\n3,468\n)\n(\n4,217\n)\n(\n2,689\n)\nDividends paid\n(\n6,688\n)\n(\n6,140\n)\n(\n6,114\n)\nPurchase of Company stock\n(\n4,494\n)\n(\n2,779\n)\n(\n9,920\n)\nDividends paid to noncontrolling interest\n(\n576\n)\n(\n763\n)\n(\n444\n)\nPurchase of noncontrolling interest\n—\n \n(\n3,462\n)\n(\n827\n)\nSale of subsidiary stock\n362\n \n716\n \n66\n \nOther financing activities\n(\n2,170\n)\n(\n2,248\n)\n(\n2,118\n)\nNet cash used in financing activities\n(\n14,822\n)\n(\n13,414\n)\n(\n17,039\n)\nEffect of exchange rates on cash, cash equivalents and restricted cash\n(\n641\n)\n69\n \n(\n73\n)\nNet increase (decrease) in cash, cash equivalents and restricted cash\n(\n399\n)\n1,094\n \n(\n5,993\n)\nCash, cash equivalents and restricted cash at beginning of year\n9,935\n \n8,841\n \n14,834\n \nCash, cash equivalents and restricted cash at end of year\n$\n9,536\n \n$\n9,935\n \n$\n8,841\n \nSupplemental disclosure of cash flow information:\nIncome taxes paid\n$\n5,884\n \n$\n5,879\n \n$\n3,310\n \nInterest paid \n2,739\n \n2,519\n \n2,051\n \n See accompanying notes. \n57\nWalmart Inc.\nNotes to Consolidated Financial Statements\nNote 1.  \nSummary of Significant Accounting Policies\nGeneral\nWalmart Inc. (\"Walmart\" or the \"Company\") is a people-led, technology-powered omni-channel retailer dedicated to helping people around the world save money and live better by providing the opportunity to shop in both retail stores and through eCommerce. Through innovation, the Company is striving to continuously improve a customer-centric experience that seamlessly integrates eCommerce and retail stores in an omni-channel offering that saves time for its customers. \nThe Company's operations comprise \nthree\n reportable segments: Walmart U.S., Walmart International and Sam's Club U.S.\nPrinciples of Consolidation\nThe Consolidated Financial Statements include the accounts of Walmart and its subsidiaries as of and for the fiscal years ended January 31, 2025 (\"fiscal 2025\"), January 31, 2024 (\"fiscal 2024\") and January 31, 2023 (\"fiscal 2023\"). Intercompany accounts and transactions have been eliminated in consolidation. The Company consolidates variable interest entities where it has been determined that the Company is the primary beneficiary of those entities' operations. Investments in common stock or in-substance common stock for which the Company exercises significant influence but does not have control are accounted for under the equity method. These variable interest entities and equity method investments are immaterial to the Company's Consolidated Financial Statements.\nThe Company's Consolidated Financial Statements are based on a fiscal year ending on January 31 for the United States (\"U.S.\") and Canadian operations. The Company consolidates all other operations generally using a one-month lag and based on a calendar year. There were no significant intervening events during the month of January 2025 related to the operations consolidated using a lag that materially affected the Consolidated Financial Statements.\nUse of Estimates\nThe Consolidated Financial Statements have been prepared in conformity with U.S. generally accepted accounting principles (\"GAAP\"). Those principles require management to make estimates and assumptions that affect the reported amounts of assets and liabilities. Management's estimates and assumptions also affect the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results may differ from those estimates.\nCommon Stock Split\nOn February 23, 2024, the Company effected a \n3\n-for-1 forward split of its common stock and a proportionate increase in the number of authorized shares. All share and per share information, including share based compensation, has been retroactively adjusted to reflect the stock split. The shares of common stock retain a par value of $\n0.10\n per share. Accordingly, an amount equal to the par value of the increased shares resulting from the stock split was reclassified from capital in excess of par value to common stock.\nCash and Cash Equivalents\nThe Company considers investments with a maturity when purchased of three months or less to be cash equivalents. All credit card, debit card and electronic transfer transactions that process in less than seven days are classified as cash and cash equivalents. The amounts due from banks for these transactions classified as cash and cash equivalents totaled $\n2.3\n billion and $\n2.1\n billion as of January 31, 2025 and 2024, respectively. \nThe Company's cash balances are held in various locations around the world. Of the Company's $\n9.0\n billion and $\n9.9\n billion in cash and cash equivalents as of January 31, 2025 and January 31, 2024, approximately \n62\n% and \n60\n% were held outside of the U.S., respectively. Cash and cash equivalents held outside of the U.S. are generally utilized to support liquidity needs in the Company's non-U.S. operations.\nThe Company uses intercompany financing arrangements in an effort to ensure cash can be made available in the country in which it is needed with the minimum cost possible. \nAs of January 31, 2025 and 2024, cash and cash equivalents of approximately $\n3.3\n billion and $\n3.5\n billion, respectively, may not be freely transferable to the U.S. due to local laws, other restrictions or are subject to the approval of the noncontrolling interest shareholders.\n58\nReceivables\nReceivables are stated at their carrying values, net of a reserve for credit losses, and are primarily due from the following: customers, which includes pharmacy insurance companies, advertisers, and banks for customer credit, debit cards and electronic transfer transactions that take in excess of seven days to process; suppliers for marketing or incentive programs; governments for income taxes; and real estate transactions.\n Net receivables from transactions with customers were $\n4.4\n billion and $\n3.7\n billion as of January 31, 2025 and January 31, 2024, respectively.\nInventories\nThe Company utilizes various inventory methods to account for and value its inventories depending upon the nature of the store formats and businesses in each of its segments, resulting in inventories that are recorded at the lower of cost or market or net realizable value, as appropriate. \n•\nWalmart U.S. Segment - Inventories are primarily accounted for under the retail inventory method of accounting (\"RIM\") to determine inventory cost, using the last-in, first-out (\"LIFO\") valuation method. RIM generally results in inventory being valued at the lower of cost or market as permanent markdowns are immediately recorded as a reduction of the retail value of inventory.\n•\nWalmart International Segment – Depending on the store format in each market, inventories are generally accounted for using either the RIM or weighted-average cost method, using the first-in, first-out valuation method. \n•\nSam's Club U.S. Segment - The majority of this segment's inventory is accounted for and valued using the weighted-average cost LIFO method.\nFor those segments that utilize the LIFO method, the Company records an adjustment each quarter, if necessary, for the projected annual effect of inflation or deflation. These estimates are adjusted to actual results determined at year end for inflation or deflation and inventory levels.\n \nProperty and Equipment\nProperty and equipment are initially recorded at cost. Gains or losses on disposition are recognized as earned or incurred. Costs of major improvements are capitalized, while costs of normal repairs and maintenance are expensed as incurred\n. \nThe following table summarizes the Company's property and equipment balances and includes the estimated useful lives that are generally used to depreciate the assets on a straight-line basis:\nEstimated Useful Lives\nAs of January 31,\n(Dollars in millions)\n(in Years)\n2025\n2024\nLand\nN/A\n$\n19,342\n \n$\n19,562\n \nBuildings and improvements\n3\n - \n40\n117,973\n \n111,767\n \nFixtures and equipment\n2\n - \n30\n76,226\n \n72,161\n \nTransportation equipment\n3\n - \n15\n2,673\n \n2,979\n \nConstruction in progress\nN/A\n15,403\n \n13,390\n \nProperty and equipment\n231,617\n \n219,859\n \nAccumulated depreciation\n(\n111,624\n)\n(\n109,049\n)\nProperty and equipment, net\n$\n119,993\n \n$\n110,810\n \nLeasehold improvements are depreciated or amortized over the shorter of the estimated useful life of the asset or the remaining expected lease term.\n Total depreciation and amortization expense for property and equipment, property under finance leases and intangible assets for fiscal 2025, 2024 and 2023 was $\n13.0\n billion, $\n11.9\n billion and $\n10.9\n billion, respectively.\nLeases\nFor any new or modified lease, the Company, at the inception of the contract, determines whether a contract is or contains a lease. The Company records right-of-use (\"ROU\") assets and lease obligations for its finance and operating leases, which are initially recognized based on the discounted future lease payments over the term of the lease. If the rate implicit in the Company's leases is not readily determinable, the Company's applicable incremental borrowing rate is used in calculating the present value of the sum of the lease payments.\nLease term is defined as the non-cancelable period of the lease plus any options to extend or terminate the lease when it is reasonably certain that the Company will exercise the option. The Company has elected not to recognize ROU asset and lease obligations for its short-term leases, which are defined as leases with an initial term of 12 months or less.\nFor a majority of all classes of underlying assets, the Company has elected to not separate lease from non-lease components. For leases in which the lease and non-lease components have been combined, the variable lease expense includes expenses such as common area maintenance, utilities and repairs and maintenance.\n59\nImpairment of Long-Lived Assets\nManagement reviews long-lived assets for indicators of impairment whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. The evaluation is performed at the lowest level of identifiable cash flows, which is at the individual store or club level. Undiscounted cash flows expected to be generated by the related assets are estimated over the assets' useful lives based on updated projections. If the evaluation indicates that the carrying amount of the assets may not be recoverable, any potential impairment is measured based upon the fair value of the related asset or asset group as determined by an appropriate market appraisal or other valuation technique.\n \nGoodwill and Other Acquired Intangible Assets \nGoodwill represents the excess of the purchase price over the fair value of net assets acquired in business combinations and is allocated to the appropriate reporting unit when acquired. Other acquired intangible assets are stated at the fair value acquired as determined by a valuation technique commensurate with the intended use of the related asset. Goodwill and indefinite-lived intangible assets are not amortized; rather, they are evaluated for impairment annually and whenever events or changes in circumstances indicate that the value of the asset may be impaired. Definite-lived intangible assets are considered long-lived assets and are amortized on a straight-line basis over the periods that expected economic benefits will be provided.\nGoodwill is typically assigned to the reporting unit which consolidates the acquisition. Components within the same reportable segment are aggregated and deemed a single reporting unit if the components have similar economic characteristics. Goodwill and other indefinite-lived acquired intangible assets are evaluated for impairment using either a qualitative or quantitative approach for each of the Company's reporting units. Generally, a qualitative assessment is first performed to determine whether a quantitative goodwill impairment test is necessary. If management determines, after performing an assessment based on the qualitative factors, that the fair value of the reporting unit is more likely than not less than the carrying amount, or that a fair value of the reporting unit substantially in excess of the carrying amount cannot be assured, then a quantitative goodwill impairment test would be required. The quantitative test for goodwill impairment is performed by determining the fair value of the related reporting units. Fair value is measured based on the discounted cash flow method and relative market-based approaches. Management has performed its evaluation and determined the fair value of each reporting unit is significantly greater than the carrying amount and, accordingly, the Company has not recorded any impairment charges related to goodwill during fiscal 2025, fiscal 2024 or fiscal 2023.\nThe following table reflects goodwill activity, by reportable segment, for fiscal 2025 and 2024:\n(Amounts in millions)\nWalmart U.S.\nWalmart\nInternational\nSam's Club U.S.\nTotal\nBalances as of February 1, 2023\n$\n3,374\n \n$\n24,479\n \n$\n321\n \n$\n28,174\n \nChanges in currency translation and other\n(\n10\n)\n(\n58\n)\n—\n \n(\n68\n)\nAcquisitions\n—\n \n7\n \n—\n \n7\n \nBalances as of January 31, 2024\n3,364\n \n24,428\n \n321\n \n28,113\n \nChanges in currency translation and other\n—\n \n(\n696\n)\n—\n \n(\n696\n)\nAcquisitions\n1\n1,375\n \n—\n \n—\n \n1,375\n \nBalances as of January 31, 2025\n$\n4,739\n \n$\n23,732\n \n$\n321\n \n$\n28,792\n \n1 \nGoodwill recorded in fiscal 2025 relates to the acquisition of VIZIO Holding Corp. in December 2024 within the Walmart U.S. segment.\nIntangible assets are recorded in other long-term assets in the Company's Consolidated Balance Sheets\n. As of January 31, 2025 and 2024, the Company had $\n4.5\n billion and $\n4.1\n billion, respectively, in indefinite-lived intangible assets which primarily consists of acquired trade names. There were no significant impairment charges related to intangible assets for fiscal 2025, 2024 or 2023. \nFair Value Measurement\nThe Company records and discloses certain financial and non-financial assets and liabilities at fair value. The fair value of an asset is the price at which the asset could be sold in an orderly transaction between unrelated, knowledgeable and willing parties able to engage in the transaction. The fair value of a liability is the amount that would be paid to transfer the liability to a new obligor in a transaction between such parties, not the amount that would be paid to settle the liability with the creditor.\n Refer to \nNote 8\n for more information. \nInvestments\nInvestments in equity securities are recorded in other long-term assets in the Consolidated Balance Sheets. Changes in the fair value of certain equity securities, as well as certain immaterial equity method investments where the Company has elected the fair value option, are measured on a recurring basis (generally using Level 1 and Level 2 inputs in the fair value hierarchy) and recognized within other gains and losses in the Consolidated Statements of Income. These fair value changes, along with certain other immaterial investment activity, resulted in net losses of $\n0.8\n billion, $\n3.8\n billion and $\n1.7\n billion for fiscal 2025, 2024 and \n60\n2023, respectively, primarily due to net changes in the underlying stock prices of those investments. Refer to \nNote 8\n for details. Equity investments without readily determinable fair values are carried at cost and adjusted for any observable price changes or impairments within other gains and losses in the Consolidated Statements of Income. \nInvestments in debt securities classified as trading are reported at fair value and included in other long-term assets in the Consolidated Balance Sheets, and adjustments in fair value are recorded within other gains and losses in the Consolidated Statements of Income. The Company had debt securities classified as trading of $\n1.2\n billion as of both January 31, 2025 and January 31, 2024, the majority of which is mandatorily redeemable in fiscal 2029, related to its retained investment in Asda, the Company's former retail operations in the U.K. The fair value of this investment is primarily estimated (generally using Level 3 inputs in the fair value hierarchy) by discounting the future cash flows over the remaining period until the mandatory redemption date at an appropriate discount rate reflecting Asda’s credit risk.\n \nIndemnification Liabilities\nThe Company has provided certain indemnifications in connection with previous divestitures and has recorded indemnification liabilities equal to the estimated fair value of the obligations.\n As of January 31, 2025 and January 31, 2024, the Company had $\n0.6\n billion and $\n0.7\n billion, respectively, of certain legal indemnification liabilities recorded within deferred income taxes and other in the Consolidated Balance Sheets. Maximum potential future payments under these indemnities was $\n3.1\n billion, based on exchange rates as of January 31, 2025. \nSupplier Financing Program Obligations\nThe Company has supplier financing programs with financial institutions, in which the Company agrees to pay the financial institution the stated amount of confirmed invoices on the invoice due date for participating suppliers. Participation in these programs is optional and solely up to the supplier, who negotiates the terms of the arrangement directly with the financial institution and may allow early payment. Supplier participation in these programs has no bearing on the Company's amounts due. The payment terms that the Company has with participating suppliers under these programs generally range between \n30\n and \n90\n days. The Company does not have an economic interest in a supplier's participation in the program or a direct financial relationship with the financial institution funding the program. The Company is responsible for ensuring that participating financial institutions are paid according to the terms negotiated with the supplier, regardless of whether the supplier elects to receive early payment from the financial institution\n. \nThe rollforward of the Company's outstanding payment obligations to financial institutions under these programs is as follows: \n(Amounts in millions)\nFiscal 2025\nConfirmed obligations outstanding at the beginning of the year\n$\n5,271\n \nInvoices confirmed during the year\n41,335\n \nConfirmed invoices paid during the year\n(\n40,810\n)\nTranslation and other\n(\n71\n)\nConfirmed obligations outstanding at the end of the year\n$\n5,725\n \nThese obligations are generally classified as \naccounts payable\n within the Consolidated Balance Sheets. The activity related to these programs is classified as an operating activity within the Consolidated Statements of Cash Flows.\nSelf Insurance Reserves\nThe Company self-insures a number of risks, including, but not limited to, workers' compensation, general liability, auto liability, product liability and certain employee-related healthcare benefits. Standard actuarial procedures and data analysis are used to estimate the liabilities associated with these risks on an undiscounted basis. The recorded liabilities reflect the ultimate cost for claims incurred but not paid and any estimable administrative run-out expenses related to the processing of these outstanding claim payments. On a regular basis, the liabilities are evaluated for appropriateness with claims reserve valuations. To limit exposure to some risks, the Company maintains insurance coverage with varying limits and retentions, including stop-loss insurance coverage for workers' compensation, general liability and auto liability. Refer to \nNote 5\n for the self insurance reserves which are recorded in accrued liabilities in the Company's Consolidated Balance Sheets.\n61\nDerivatives\nThe Company uses derivatives for hedging purposes to manage its exposure to changes in interest and currency exchange rates, as well as to maintain an appropriate mix of fixed- and variable-rate debt. Use of derivatives in hedging programs subjects the Company to certain risks, such as market and credit risks. The Company may be exposed to credit-related losses in the event of nonperformance by its counterparties to derivatives. Credit risk is monitored through established approval procedures, including setting concentration limits by counterparty, reviewing credit ratings and requiring collateral from the counterparty. The Company enters into derivatives with counterparties rated generally \"A-\" or better by nationally recognized credit rating agencies. The Company is subject to master netting arrangements which provides set-off and close-out netting of exposures with counterparties, but the Company does not offset derivative assets and liabilities in its Consolidated Balance Sheets. The Company's collateral arrangements require the counterparty in a net liability position in excess of pre-determined thresholds, after considering the effects of netting arrangements, to pledge cash collateral. Cash collateral received from counterparties and cash collateral provided to counterparties under these arrangements was not significant as of January 31, 2025 and 2024.\nIn order to qualify for hedge accounting, at the inception of the hedging relationship, the Company formally documents its risk management objective and strategy for undertaking the hedging transaction, as well as its designation of the hedge. If a derivative is recorded using hedge accounting, depending on the nature of the hedge, derivative gains and losses are recorded through the same financial statement line item in earnings or are recognized in accumulated other comprehensive loss until the hedged item is recognized in earnings. Derivatives that do not meet the criteria for hedge accounting, or contracts for which the Company has not elected hedge accounting, are recorded at fair value with unrealized gains or losses reported in earnings. Derivatives with an unrealized gain are recorded in the Company's Consolidated Balance Sheets as either current or non-current assets, based on maturity date, and derivatives with an unrealized loss are recorded as either current or non-current liabilities, based on maturity date. Refer to \nNote 8\n for the presentation of the Company's derivative assets and liabilities. \nFair Value Hedges\nThe Company is a party to receive fixed-rate, pay variable-rate interest rate swaps that the Company uses to hedge the fair value of fixed-rate debt. All interest rate swaps designated as fair value hedges of the related long-term debt meet the shortcut method requirements under GAAP. Accordingly, changes in the fair values of these interest rate swaps are considered to exactly offset changes in the fair value of the underlying long-term debt. These derivatives will mature on dates ranging from September 2028 to September 2031.\nCash Flow Hedges\nThe Company is a party to receive fixed-rate, pay fixed-rate cross currency interest rate swaps used to hedge the currency exposure associated with the forecasted payments of principal and interest of certain non-U.S. denominated debt. The Company records changes in the fair value of these swaps in accumulated other comprehensive loss which is subsequently reclassified into earnings in the period that the hedged forecasted transaction affects earnings. These derivatives will mature on dates ranging from April 2026 to January 2039.\nIncome Taxes\nIncome taxes are accounted for under the balance sheet method. Deferred tax assets and liabilities are recognized for the estimated future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases (\"temporary differences\"). Deferred tax assets and liabilities are measured using enacted tax rates in effect for the year in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rate is recognized in income in the period that includes the enactment date.\nDeferred tax assets are evaluated for future realization and reduced by a valuation allowance to the extent that a portion is not more likely than not to be realized. Many factors are considered when assessing whether it is more likely than not that the deferred tax assets will be realized, including recent cumulative earnings, expectations of future taxable income, carryforward periods, and other relevant quantitative and qualitative factors. The recoverability of the deferred tax assets is evaluated by assessing the adequacy of future expected taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings and available tax planning strategies. These sources of income rely on estimates.\nIn determining the provision for income taxes, an annual effective income tax rate is used based on annual income, permanent differences between book and tax income, and statutory income tax rates. Discrete events such as audit settlements or changes in tax laws are recognized in the period in which they occur.\nThe Company records a liability for unrecognized tax benefits resulting from uncertain tax positions taken or expected to be taken in a tax return. The Company records interest and penalties related to unrecognized tax benefits in interest expense and operating, selling, general and administrative expenses, respectively, in the Company's Consolidated Statements of Income. Refer to \nNote 9\n for additional income tax disclosures.\n62\nRedeemable Noncontrolling Interest\nNoncontrolling interests that are redeemable outside the Company's control at fixed or determinable prices and dates are presented as temporary equity in the Consolidated Balance Sheets. Redeemable noncontrolling interests are recorded at the greater of the redemption fair value or the carrying value of the noncontrolling interest and adjusted each reporting period for income, loss and any distributions made. Remeasurements to the redemption value of the redeemable noncontrolling interest are recognized in capital in excess of par. The Company has a redeemable noncontrolling interest related to an acquisition in the Walmart U.S. segment as the minority interest owner holds a put option which may require the Company to purchase its interest beginning in December 2027, with annual options thereafter.\nRevenue Recognition\n    \nNet Sales\nThe Company recognizes sales revenue, net of sales taxes and estimated sales returns, at the time it sells merchandise or provides services to the customer. eCommerce sales include shipping revenue and are recorded upon delivery to the customer. Estimated sales returns are calculated based on expected returns.\nFinancial, Advertising and Other Services\nThe Company recognizes revenue from service transactions at the time the service is performed. Generally, revenue from services is classified as a component of net sales in the Company's Consolidated Statements of Income.\nMembership and Other Income\nMembership and other income primarily includes membership fee revenue associated with the Company's various membership offerings for customers and members across each reportable segment. Membership fee revenue is recognized over the term of the membership, which is typically 12 months. Membership fee revenue was $\n3.8\n billion for fiscal 2025, $\n3.1\n billion for fiscal 2024 and $\n2.6\n billion for fiscal 2023. Deferred membership fee revenue is included in accrued liabilities in the Company's Consolidated Balance Sheets. Additionally, membership and other income includes items such as rental and tenant income, recycling income and gift card breakage income.\nGift Cards\nCustomer purchases of gift cards are not recognized as sales until the card is redeemed and the customer purchases merchandise using the gift card, thus a liability for deferred gift card revenue is recorded within accrued liabilities in the Consolidated Balance Sheets. Refer to \nNote 5\n. Gift cards in the U.S. and some countries do not carry an expiration date; therefore, customers and members can redeem their gift cards for merchandise and services indefinitely. Gift cards in some countries where the Company does business have expiration dates. While gift cards are generally redeemed within 12 months, a certain number of gift cards, both with and without expiration dates, will not be fully redeemed. Management estimates unredeemed balances and recognizes gift card breakage income for these amounts in membership and other income in the Company's Consolidated Statements of Income over the expected redemption period.\n \nCost of Sales\nCost of sales includes costs of merchandise sold and services performed; costs of transporting merchandise to the Company's distribution facilities, stores, clubs, and customers; and also includes warehousing costs for the Sam's Club U.S. segment and import distribution centers. Cost of sales is reduced by supplier payments, except in certain situations as described below.\nPayments from Suppliers\nThe Company receives consideration from suppliers for various programs, primarily volume incentives, warehouse allowances and reimbursements for specific programs such as markdowns, margin protection, certain advertising arrangements and supplier-specific fixtures. Payments from suppliers are accounted for as a reduction of cost of sales and recognized in the Company's Consolidated Statements of Income when the related inventory is sold, except in situations when the payment is in exchange for a distinct good or service or a reimbursement of specific, incremental and identifiable costs.\n63\nOperating, Selling, General and Administrative Expenses\nOperating, selling, general and administrative expenses include all operating costs of the Company (except cost of sales, as described above), which comprise substantially all labor-related, depreciation and amortization, maintenance and repairs, utilities, and other general operating costs incurred in stores, clubs and other facilities. The majority of the cost of warehousing and occupancy for the Walmart U.S. and Walmart International segments' distribution facilities is included in operating, selling, general and administrative expenses. Because the Company only includes a portion of the cost of its Walmart U.S. and Walmart International segments' distribution facilities in cost of sales, its gross profit and gross profit as a percentage of net sales may not be comparable to those of other retailers that may include all costs related to their distribution facilities in cost of sales and in the calculation of gross profit.\nAs a result, the Company’s cost of sales and operating, selling, general and administrative expenses for each of its reportable segments may not be comparable to those of other retailers.\n \nAdvertising Costs\nAdvertising costs are expensed as incurred, and consist primarily of digital, television and print advertisements that are recorded in operating, selling, general and administrative expenses in the Company's Consolidated Statements of Income.\n Advertising costs were $\n5.1\n billion, $\n4.4\n billion and $\n4.1\n billion for fiscal 2025, 2024 and 2023, respectively.\nCurrency Translation\nThe assets and liabilities of all international subsidiaries are translated from the respective local currency to the U.S. dollar using exchange rates at the balance sheet date. Related translation adjustments are recorded as a component of accumulated other comprehensive loss. The Company's Consolidated Statements of Income of all international subsidiaries are translated from the respective local currencies to the U.S. dollar using average exchange rates for the period covered by the income statements.\nRecent Accounting Pronouncements\nIn November 2023, the FASB issued ASU 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which updates reportable segment disclosure requirements primarily through enhanced disclosures about significant segment expenses. The amendments are effective for fiscal years beginning after December 15, 2023, and for interim periods within fiscal years beginning after December 15, 2024. The Company adopted the ASU for the fiscal year ended  January 31, 2025 on a retrospective basis for all prior periods presented in the financial statements, which includes disclosure of cost of sales and operating, selling, general and administrative expenses by segment. See \nNote \n12\n.\nIn December 2023, the FASB issued ASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n, which expands the requirements for income tax disclosures in order to provide greater transparency. The amendments are effective for fiscal years beginning after December 15, 2024. Early adoption is permitted. The amendments should be applied prospectively, although optional retrospective application is permitted. Management intends to adopt the amendments prospectively for the fiscal year ending January 31, 2026 and is currently evaluating this ASU to determine its impact on the Company's disclosures. The amendments only impact disclosures and are not expected to have an impact on the Company's financial condition and results of operations.\nIn November 2024, the FASB issued ASU 2024-03,\n Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n, which requires incremental disclosures about specific expense categories, including but not limited to, purchases of inventory, employee compensation, depreciation, amortization and selling expenses. The amendments are effective for fiscal years beginning after December 15, 2026, and for interim periods within fiscal years beginning after December 15, 2027. Early adoption is permitted and the amendments may be applied either prospectively or retrospectively. Management is currently evaluating this ASU to determine its impact on the Company's disclosures. The amendments only impact disclosures and are not expected to have an impact on the Company's financial condition and results of operations.\nNote 2.  \nNet Income Per Common Share\nBasic net income per common share attributable to Walmart is based on the weighted-average common shares outstanding during the relevant period. Diluted net income per common share attributable to Walmart is based on the weighted-average common shares outstanding during the relevant period adjusted for the dilutive effect of share-based awards as determined under the treasury stock method. The Company did not have significant share-based awards outstanding that were antidilutive and not included in the calculation of diluted net income per common share attributable to Walmart for fiscal 2025, 2024 and 2023.\n64\nThe following table provides a reconciliation of the numerators and denominators used to determine basic and diluted net income per common share attributable to Walmart:\nFiscal Years Ended January 31,\n(Amounts in millions, except per share data)\n2025\n2024\n2023\nNumerator\nConsolidated net income\n$\n20,157\n \n$\n16,270\n \n$\n11,292\n \nConsolidated net (income) loss attributable to noncontrolling interest\n(\n721\n)\n(\n759\n)\n388\n \nConsolidated net income attributable to Walmart\n$\n19,436\n \n$\n15,511\n \n$\n11,680\n \nDenominator\nWeighted-average common shares outstanding, basic\n8,041\n \n8,077\n \n8,171\n \nDilutive impact of stock options and other share-based awards\n40\n \n31\n \n31\n \nWeighted-average common shares outstanding, diluted\n8,081\n \n8,108\n \n8,202\n \nNet income per common share attributable to Walmart\nBasic\n$\n2.42\n \n$\n1.92\n \n$\n1.43\n \nDiluted\n2.41\n \n1.91\n \n1.42\n \nNote 3.  \nShareholders' Equity\nThe total authorized shares of $\n0.10\n par value common stock is \n33.0\n billion, of which \n8.0\n billion and \n8.1\n billion were issued and outstanding as of January 31, 2025 and 2024, respectively. The total authorized shares of $\n0.10\n par value preferred stock is \n0.1\n billion; \nnone\n of which were issued or outstanding for any period presented. \nPurchases and Sales of Subsidiary Stock\nDuring fiscal 2024, the Company paid $\n3.5\n billion to acquire shares from certain Flipkart noncontrolling interest holders and settle the liability to former noncontrolling interest holders of PhonePe. The Company's ownership of Flipkart increased from approximately \n75\n% as of January 31, 2023 to approximately \n85\n% as of January 31, 2024.\nAlso during fiscal 2024, the Company received $\n0.7\n billion related to new rounds of equity funding for the Company's majority owned PhonePe subsidiary, which decreased the Company's ownership from approximately \n89\n% as of January 31, 2023 to approximately \n84\n% as of January 31, 2024.\nDuring fiscal 2023, the Company completed a $\n0.4\n billion buyout of the noncontrolling interest shareholders of the Company's Massmart subsidiary. This transaction increased the Company's ownership in Massmart from approximately \n53\n% to \n100\n%. Additionally, the Company completed a $\n0.4\n billion acquisition of Alert Innovation, which was previously consolidated as a variable interest entity, and resulted in the Company becoming a \n100\n% owner. This entity was subsequently sold and deconsolidated in fiscal 2025.\nAlso during fiscal 2023, the Company increased its ownership in PhonePe from approximately \n76\n% to approximately \n89\n% as part of the separation from the Company's majority-owned Flipkart subsidiary. In consideration for the transaction, the Company initially recorded a liability to noncontrolling interest holders of $\n0.9\n billion within accrued liabilities in the Company's Consolidated Balance Sheet as of January 31, 2023, which was paid during fiscal 2024.\nShare-Based Compensation\nThe Company has awarded share-based compensation to associates and nonemployee directors of the Company. The compensation expense recognized for all stock incentive plans, including expense associated with plans of the Company's consolidated subsidiaries granted in the subsidiaries' respective stock, was $\n2.8\n billion, $\n2.1\n billion and $\n1.6\n billion for fiscal 2025, 2024 and 2023, respectively. Share-based compensation expense is generally included in operating, selling, general and administrative expenses in the Company's Consolidated Statements of Income. The total income tax benefit recognized for share-based compensation was $\n0.7\n billion, $\n0.5\n billion and $\n0.4\n billion for fiscal 2025, 2024 and 2023, respectively. \nThe following table summarizes the Company's share-based compensation expense by award type for all plans:\n \nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nRestricted stock units\n$\n1,909\n \n$\n1,258\n \n$\n927\n \nRestricted stock and performance-based restricted stock units\n632\n \n609\n \n444\n \nOther\n228\n \n226\n \n207\n \nShare-based compensation expense\n$\n2,769\n \n$\n2,093\n \n$\n1,578\n \nThe Walmart Inc. Stock Incentive Plan of 2015 (the \"Plan\"), as subsequently amended and restated, was established to grant stock options, restricted (non-vested) stock, restricted stock units, performance share units and other equity compensation awards for which \n780\n million shares of Walmart common stock issued or to be issued under the Plan have been registered \n65\nunder the Securities Act of 1933. The Company believes that such awards serve to align the interests of its associates with those of its shareholders.\nThe Plan's award types are summarized as follows:\n•\nRestricted Stock Units. \nRestricted stock units provide rights to Company stock after a specified service period. Beginning in fiscal 2023, restricted stock units generally vest at a rate of approximately \n8\n% each quarter over a \nthree year\n period from the date of grant. For grants made from fiscal 2020 through fiscal 2022, restricted stock units generally vest at a rate of \n25\n% each year over a \nfour year\n period from the date of the grant. The fair value of each restricted stock unit is determined on the date of grant using the stock price discounted for the expected dividend yield through the vesting period and is recognized ratably over the vesting period. The expected dividend yield is based on the anticipated dividends over the vesting period. The weighted-average discount for the dividend yield used to determine the fair value of restricted stock units granted in fiscal 2025, 2024 and 2023 was \n2.0\n%, \n2.2\n% and \n2.3\n%, respectively.\n•\nRestricted Stock and Performance-based Restricted Stock Units. \nRestricted stock awards are for shares that vest based on the passage of time and include restrictions related to employment. Performance-based restricted stock units generally vest based on a \none-year\n performance period followed by a \ntwo-year\n vesting period based on the passage of time. Vesting conditions during the performance period are based on achieving pre-established financial goals for metrics related to growth and returns and generally range from \n0\n% to \n150\n% of the original award amount. Vesting periods for restricted stock are generally between \none month\n and \nthree years\n. Vesting periods for performance-based restricted stock units are generally between \none\n and \nthree years\n. Restricted stock and performance-based restricted stock units may be settled or, in certain circumstances, deferred and are accounted for as equity in the Company's Consolidated Balance Sheets. The fair value of restricted stock awards is determined on the date of grant and is expensed ratably over the vesting period. The fair value of performance-based restricted stock units is determined on the date of grant using the Company's stock price discounted for the expected dividend yield through the vesting period and is recognized over the vesting period if it is probable that performance conditions will be achieved. The weighted-average discount for the dividend yield used to determine the fair value of performance-based restricted stock units in fiscal 2025, 2024 and 2023 was \n3.2\n%, \n3.3\n% and \n3.3\n%, respectively.\nIn addition to the Plan, certain of the Company's subsidiaries have share-based compensation plans for associates under which options to acquire their own common shares are issued. Share-based compensation expense associated with these plans is included in the Other line in the table above. \nThe following table shows the activity for restricted stock units and restricted stock and performance-based restricted stock units during fiscal 2025:\nRestricted Stock Units\nRestricted Stock and \nPerformance-based Restricted Stock Units\n(Shares in thousands)\nShares\nWeighted-Average Grant-Date Fair Value Per Share\nShares\nWeighted-Average Grant-Date Fair Value Per Share\nOutstanding as of February 1, 2024\n49,191\n \n$\n46.79\n \n23,103\n \n$\n48.09\n \nGranted\n46,054\n \n60.29\n \n9,887\n \n63.97\n \nAdjustment for performance achievement\n(1)\n—\n \n—\n \n3,661\n \n47.35\n \nVested/exercised\n(\n36,974\n)\n49.99\n \n(\n12,353\n)\n48.62\n \nForfeited \n(\n6,513\n)\n53.15\n \n(\n3,338\n)\n49.75\n \nOutstanding as of January 31, 2025\n51,758\n \n$\n55.72\n \n20,960\n \n$\n54.88\n \n(1)\n  Represents the adjustment to previously granted performance share units for performance achievement.\n \nThe following table includes additional information related to restricted stock units and restricted stock and performance-based restricted stock units:\n \n \nFiscal Years Ended January 31,\n(Amounts in millions, except years)\n2025\n2024\n2023\nFair value of restricted stock units vested\n$\n1,848\n \n$\n1,345\n \n$\n931\n \nFair value of restricted stock and performance-based restricted stock units vested\n602\n \n477\n \n390\n \nUnrecognized compensation cost for restricted stock units\n2,243\n \n1,686\n \n1,323\n \nUnrecognized compensation cost for restricted stock and performance-based restricted stock units\n669\n \n656\n \n548\n \nWeighted average remaining period to expense for restricted stock units (years)\n0.9\n0.9\n1.0\nWeighted average remaining period to expense for restricted stock and performance-based restricted stock units (years)\n1.3\n1.3\n1.4\n66\nAs of January 31, 2025, the Company also has approximately $\n3\n billion in unrecognized compensation cost (based on grant-date fair value) primarily associated with share-based compensation plans of certain subsidiaries which contain performance or other conditions including vesting upon an initial public offering. If such conditions are ultimately satisfied, unrecognized compensation cost would be recognized in the applicable reporting period. \nShare Repurchase Program\nFrom time to time, the Company repurchases shares of its common stock under share repurchase programs authorized by the Company's Board of Directors. All repurchases made during fiscal 2025 were made under the current $\n20.0\n billion share repurchase program approved in November 2022, which has no expiration date or other restrictions limiting the period over which the Company can make repurchases. As of January 31, 2025 authorization for $\n12.0\n billion of share repurchases remained under the share repurchase program. Any repurchased shares are constructively retired and returned to an unissued status.\nThe Company regularly reviews share repurchase activity and considers several factors in determining when to execute share repurchases, including, among other things, current cash needs, capacity for leverage, cost of borrowings, results of operations and the market price of the Company's common stock. \nThe following table provides, on a settlement date basis, the number of shares repurchased, average price paid per share and total amount paid for share repurchases for fiscal 2025, 2024 and 2023:\nFiscal Years Ended January 31,\n(Amounts in millions, except per share data)\n2025\n2024\n2023\nTotal number of shares repurchased \n61.9\n \n54.6\n \n221.8\n \nAverage price paid per share \n$\n72.72\n \n$\n50.87\n \n$\n44.72\n \nTotal cash paid for share repurchases\n$\n4,494\n \n$\n2,779\n \n$\n9,920\n \nNote 4.  \nAccumulated Other Comprehensive Loss\nThe following table provides the changes in the composition of total accumulated other comprehensive loss for fiscal 2025, 2024 and 2023: \n(Amounts in millions and net of immaterial income taxes)\nCurrency\nTranslation\nand Other\nCash Flow Hedges\nTotal\nBalances as of February 1, 2022\n$\n(\n8,018\n)\n$\n(\n748\n)\n$\n(\n8,766\n)\nOther comprehensive loss before reclassifications, net\n(\n1,140\n)\n(\n571\n)\n(\n1,711\n)\nReturn of currency translation to parent\n(1)\n(\n1,262\n)\n—\n \n(\n1,262\n)\nReclassifications to income, net\n(\n309\n)\n368\n \n59\n \nBalances as of January 31, 2023\n(\n10,729\n)\n(\n951\n)\n(\n11,680\n)\nOther comprehensive income (loss) before reclassifications, net\n322\n \n(\n8\n)\n314\n \nReclassifications to income, net\n—\n \n64\n \n64\n \nBalances as of January 31, 2024\n(\n10,407\n)\n(\n895\n)\n(\n11,302\n)\nOther comprehensive loss before reclassifications, net\n(\n2,161\n)\n(\n198\n)\n(\n2,359\n)\nReclassifications to income, net\n(\n93\n)\n149\n \n56\n \nBalances as of January 31, 2025\n$\n(\n12,661\n)\n$\n(\n944\n)\n$\n(\n13,605\n)\n(1)\n Upon closing of the noncontrolling interest shareholder buyout of the Company's Massmart subsidiary during the fourth quarter of fiscal 2023, the cumulative amount of currency translation was reallocated from the Company's noncontrolling interest back to the Company. Refer to \nNote 3\n.\nAmounts reclassified from accumulated other comprehensive loss for cash flow hedges are generally recorded in interest, net, in the Company's Consolidated Statements of Income. Amounts reclassified related to the cumulative translation for settlements of foreign-denominated bonds and associated cross-currency swaps are recorded in operating, selling, general and administrative expenses in the Company's Consolidated Statements of Income.\n \n67\nNote 5.  \nAccrued Liabilities\nThe Company's accrued liabilities consist of the following as of January 31, 2025 and 2024:\n \nJanuary 31,\n(Amounts in millions)\n2025\n2024\nAccrued wages and benefits\n(1)\n7,897\n \n8,590\n \nSelf-insurance\n(2)\n4,976\n \n4,916\n \nAccrued non-income taxes\n(3)\n3,503\n \n3,459\n \nDeferred gift card revenue\n2,755\n \n2,664\n \nOther\n(4)\n10,214\n \n9,130\n \nTotal accrued liabilities\n$\n29,345\n \n$\n28,759\n \n(1)\nAccrued wages and benefits include accrued wages, salaries, vacation, bonuses and other incentive plans.\n(2)\nSelf-insurance consists of insurance-related liabilities, such as workers' compensation, general liability, auto liability, product liability and certain employee-related healthcare benefits. \n(3)\nAccrued non-income taxes include accrued payroll, property, value-added, sales and miscellaneous other taxes.\n(4)\nOther accrued liabilities includes items such as deferred membership revenue, interest, supply chain, advertising, and maintenance and utilities.\nNote 6.  \nShort-term Borrowings and Long-term Debt\nShort-term borrowings consist of commercial paper and lines of credit. Short-term borrowings as of January 31, 2025 and 2024 were $\n3.1\n billion and $\n0.9\n billion, respectively, with weighted-average interest rates of \n5.3\n% and \n7.7\n%, respectively. \nThe Company has various committed lines of credit in the U.S. to support its commercial paper program which are summarized in the following table:\nJanuary 31, 2025\nJanuary 31, 2024\n(Amounts in millions)\nAvailable\nDrawn\nUndrawn\nAvailable\nDrawn\nUndrawn\nFive\n-year credit facility\n(1)\n$\n5,000\n \n$\n—\n \n$\n5,000\n \n$\n5,000\n \n$\n—\n \n$\n5,000\n \n364\n-day revolving credit facility\n(1)\n10,000\n \n—\n \n10,000\n \n10,000\n \n—\n \n10,000\n \nTotal\n$\n15,000\n \n$\n—\n \n$\n15,000\n \n$\n15,000\n \n$\n—\n \n$\n15,000\n \n(1)\n      In April 2024, the Company renewed and extended its existing \n364\n-day revolving credit facility as well as its \nfive year\n credit facility.\n \nThe committed lines of credit in the table above mature in April 2025 and April 2029, carry interest rates of the Secured Overnight Financing Rate plus \n55\n basis points, and incur commitment fees ranging between \n1.5\n and \n4.0\n basis points. In conjunction with the committed lines of credit listed in the table above, the Company has agreed to observe certain covenants, the most restrictive of which relates to the maximum amount of secured debt. Additionally, the Company has syndicated and fronted letters of credit available which totaled $\n2.1\n billion as of January 31, 2025 and 2024, of which $\n1.5\n billion and $\n1.7\n billion was drawn as of January 31, 2025 and 2024, respectively. \nThe Company's long-term debt, which includes the fair value instruments further discussed in \nNote 8\n, consists of the following as of January 31, 2025 and 2024:\n \nJanuary 31, 2025\nJanuary 31, 2024\n(Amounts in millions)\nMaturity Dates\nBy Fiscal Year\nAmount\nAverage Rate\n(1)\nAmount\nAverage Rate\n(1)\nUnsecured fixed-rate debt\nU.S. dollar denominated\n2026 - 2054\n$\n31,406\n \n3.8\n%\n$\n34,527\n \n3.7\n%\nEuro denominated\n2027 - 2030\n1,715\n \n4.0\n%\n1,789\n \n4.0\n%\nSterling denominated\n2031 - 2039\n3,336\n \n5.4\n%\n3,412\n \n5.4\n%\nYen denominated\n2028\n389\n \n0.5\n%\n677\n \n0.4\n%\nTotal unsecured fixed-rate debt\n36,846\n \n40,405\n \nTotal other\n(2)\n(\n847\n)\n(\n826\n)\nTotal debt\n35,999\n \n39,579\n \nLess amounts due within one year\n(\n2,598\n)\n(\n3,447\n)\nLong-term debt\n$\n33,401\n \n$\n36,132\n \n(1)\nThe average rate represents the weighted-average stated rate for each corresponding debt category, based on year-end balances and year-end interest rates. \n(2)\nIncludes deferred loan costs, discounts, fair value hedges, foreign-held debt and secured debt.\n \n68\nAnnual maturities of long-term debt during the next five years and thereafter are as follows:\n(Amounts in millions)\nAnnual\nFiscal Year\nMaturities\n2026\n$\n2,598\n \n2027\n3,451\n \n2028\n1,741\n \n2029\n3,340\n \n2030\n1,955\n \nThereafter\n22,914\n \nTotal\n$\n35,999\n \nDebt Issuances\nThere were \nno\n long-term debt issuances in fiscal 2025. \nInformation on significant long-term debt issued during fiscal 2024, for general corporate purposes, is as follows:\n(Amounts in millions)\nIssue Date\nPrincipal Amount\nMaturity Date\nFixed vs. Floating\nInterest Rate\nNet Proceeds\nApril 18, 2023\n$\n750\nApril 15, 2026\nFixed\n4.000\n%\n$\n748\n \nApril 18, 2023\n$\n750\nApril 15, 2028\nFixed\n3.900\n%\n746\n \nApril 18, 2023\n$\n500\nApril 15, 2030\nFixed\n4.000\n%\n497\n \nApril 18, 2023\n$\n1,500\nApril 15, 2033\nFixed\n4.100\n%\n1,491\n \nApril 18, 2023\n$\n1,500\nApril 15, 2053\nFixed\n4.500\n%\n1,485\n \nTotal\n$\n4,967\n \nThese issuances are senior, unsecured notes which rank equally with all other senior, unsecured debt obligations of the Company, and are not convertible or exchangeable. These issuances do not contain any financial covenants which restrict the Company's ability to pay dividends or repurchase Company stock. \nMaturities\nThe following tables provide details of significant long-term debt repayments during fiscal 2025 and 2024, respectively: \n(Amounts in millions)\nMaturity Date\nPrincipal Amount\nFixed vs. Floating\nInterest Rate\nRepayment\nApril 22, 2024\n$\n1,500\nFixed\n3.300\n%\n$\n1,500\n \nJuly 8, 2024\n$\n990\nFixed\n2.850\n%\n990\n \nJuly 18, 2024\n¥\n40,000\nFixed\n0.298\n%\n253\n \nDecember 15, 2024\n$\n630\nFixed\n2.650\n%\n630\n \nTotal repayment of matured debt\n$\n3,373\n \n(Amounts in millions)\nMaturity Date\nPrincipal Amount\nFixed vs. Floating\nInterest Rate\nRepayment\nApril 11, 2023\n$\n1,750\nFixed\n2.550\n%\n$\n1,750\n \nJune 26, 2023\n$\n2,280\nFixed\n3.400\n%\n2,280\n \nTotal repayment of matured debt\n$\n4,030\n \nNote 7.  \nLeases\nThe Company leases certain retail locations, distribution and fulfillment centers, warehouses, office spaces, land and equipment throughout the U.S. and internationally. \nThe Company's lease costs recognized in the Consolidated Statements of Income consist of the following:\nFiscal years ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nOperating lease cost\n$\n2,347\n \n$\n2,277\n$\n2,306\nFinance lease cost:\n   Amortization of right-of-use assets\n891\n \n755\n596\n   Interest on lease obligations\n381\n \n326\n256\nVariable lease cost\n1,145\n \n1,082\n899\n69\nOther lease information is as follows:\nFiscal years ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nCash paid for amounts included in measurement of lease obligations:\nOperating cash flows from operating leases\n$\n2,390\n \n2,273\n \n2,280\n \nOperating cash flows from finance leases\n375\n \n315\n \n248\n \nFinancing cash flows from finance leases\n908\n \n1,055\n \n563\n \nAssets obtained in exchange for operating lease obligations\n1,974\n \n1,514\n \n1,714\n \nAssets obtained in exchange for finance lease obligations\n1,455\n \n1,572\n \n1,226\n \nAs of January 31,\n2025\n2024\nWeighted-average remaining lease term - operating leases\n11.3\n years\n11.7\n years\nWeighted-average remaining lease term - finance leases\n11.7\n years\n12.4\n years\nWeighted-average discount rate - operating leases\n6.5\n%\n6.4\n%\nWeighted-average discount rate - finance leases\n6.7\n%\n6.8\n%\nThe aggregate annual lease obligations at January 31, 2025, are as follows:\n(Amounts in millions)\nFiscal Year\nOperating Leases\nFinance Leases\n2026\n$\n2,160\n \n$\n1,153\n \n2027\n2,111\n \n1,086\n \n2028\n1,986\n \n987\n \n2029\n1,835\n \n808\n \n2030\n1,674\n \n661\n \nThereafter\n10,837\n \n5,843\n \nTotal undiscounted lease obligations\n20,603\n \n10,538\n \nLess imputed interest\n(\n6,279\n)\n(\n3,815\n)\nNet lease obligations\n$\n14,324\n \n$\n6,723\n \nNote 8.  \nFair Value Measurements\nAssets and liabilities recorded at fair value are measured using the fair value hierarchy, which prioritizes the inputs used in measuring fair value. The levels of the fair value hierarchy are:\n•\nLevel 1: observable inputs such as quoted prices in active markets;\n•\nLevel 2: inputs other than quoted prices in active markets that are either directly or indirectly observable; and\n•\nLevel 3: unobservable inputs for which little or no market data exists, therefore requiring the Company to develop its own assumptions.\nAs described in \nNote 1\n, the Company measures the fair value of certain equity investments, including certain immaterial equity method investments where the Company has elected the fair value option, on a recurring basis within other long-term assets in the accompanying Consolidated Balance Sheets. The amounts of gains and losses included in earnings from fair value changes for these investments are recognized within other gains and losses in the Consolidated Statements of Income. \nThe fair value of these investments is as follows:\n(Amounts in millions)\nFair Value as of January 31, 2025\nFair Value as of January 31, 2024\nEquity investments measured using Level 1 inputs\n$\n959\n \n$\n2,835\n \nEquity investments measured using Level 2 inputs\n2,082\n \n4,414\n \nTotal\n$\n3,041\n \n$\n7,249\n \nThe fair value of these investments decreased $\n4.2\n billion during fiscal 2025, primarily due to the sale of the Company's investment in JD.com in August 2024, as well as gains and losses resulting from net changes in the underlying stock prices of the investments, along with certain other immaterial investment activity. The fair value of these investments decreased $\n3.4\n billion during fiscal 2024 primarily due to gains and losses resulting from net changes in the underlying stock prices, along with certain other immaterial investment activity.\nSale of Investment\nIn August 2024, the Company sold its investment in JD.com for net proceeds of approximately $\n3.6\n billion and recorded a realized loss of $\n0.3\n billion within other gains and losses.\n70\nDerivatives\nThe Company also has derivatives recorded at fair value. Derivative fair values are the estimated amounts the Company would receive or pay upon termination of the related derivative agreements as of the reporting dates. The fair values have been measured using the income approach and Level 2 inputs, which include the relevant interest rate and foreign currency forward curves. \nAs of January 31, 2025 and January 31, 2024, the notional amounts and fair values of these derivatives were as follows:\n \nJanuary 31, 2025\nJanuary 31, 2024\n(Amounts in millions)\nNotional Amount\nFair Value\nNotional Amount\nFair Value\nReceive fixed-rate, pay variable-rate interest rate swaps designated as fair value hedges\n$\n4,771\n \n$\n(\n611\n)\n(1)\n$\n6,271\n \n$\n(\n654\n)\n(1)\nReceive fixed-rate, pay fixed-rate cross-currency swaps designated as cash flow hedges\n5,452\n \n(\n1,388\n)\n(1)\n5,879\n \n(\n1,302\n)\n(1)\nTotal\n$\n10,223\n \n$\n(\n1,999\n)\n$\n12,150\n \n$\n(\n1,956\n)\n(1)\nPrimarily classified in deferred income taxes and other within the Company's Consolidated Balance Sheets.\nNonrecurring Fair Value Measurements\nIn addition to assets and liabilities recorded at fair value on a recurring basis, the Company's assets and liabilities are also subject to nonrecurring fair value measurements. Generally, assets are recorded at fair value on a nonrecurring basis as a result of impairment charges. \nThe Company did not have any material assets or liabilities resulting in nonrecurring fair value measurements as of January 31, 2025 and January 31, 2024. \nOther Fair Value Disclosures\nThe Company records cash and cash equivalents, restricted cash and short-term borrowings at cost. The carrying values of these instruments approximate their fair value due to their short-term maturities.\nThe Company's long-term debt is also recorded at cost. The fair value is estimated using Level 2 inputs based on observable prices of identical instruments in less active markets. \nThe carrying value and fair value of the Company's long-term debt as of January 31, 2025 and 2024, are as follows:\n \nJanuary 31, 2025\nJanuary 31, 2024\n(Amounts in millions)\nCarrying Value\nFair Value\nCarrying Value\nFair Value\nLong-term debt, including amounts due within one year\n$\n35,999\n \n$\n33,790\n \n$\n39,579\n \n$\n38,431\n \nNote 9.  \nTaxes\nThe components of income before income taxes are as follows: \n \nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nU.S.\n$\n18,571\n \n$\n20,092\n \n$\n15,089\n \nNon-U.S.\n7,738\n \n1,756\n \n1,927\n \nTotal income before income taxes\n$\n26,309\n \n$\n21,848\n \n$\n17,016\n \nA summary of the provision for income taxes is as follows:\n \nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nCurrent:\nU.S. federal\n$\n3,478\n \n$\n3,215\n \n$\n2,030\n \nU.S. state and local\n886\n \n762\n \n610\n \nInternational\n2,451\n \n1,772\n \n2,654\n \nTotal current tax provision\n6,815\n \n5,749\n \n5,294\n \nDeferred:\nU.S. federal\n(\n214\n)\n(\n438\n)\n608\n \nU.S. state and local\n30\n \n141\n \n119\n \nInternational\n(\n479\n)\n126\n \n(\n297\n)\nTotal deferred tax expense (benefit)\n(\n663\n)\n(\n171\n)\n430\n \nTotal provision for income taxes\n$\n6,152\n \n$\n5,578\n \n$\n5,724\n \n71\nEffective Income Tax Rate Reconciliation\nA reconciliation of the significant differences between the U.S. statutory tax rate and the effective income tax rate on pre-tax income from continuing operations is as follows:\n \nFiscal Years Ended January 31,\n \n2025\n2024\n2023\nU.S. statutory tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nU.S. state income taxes, net of federal income tax benefit\n2.8\n \n%\n3.0\n \n%\n3.1\n \n%\nIncome taxed outside the U.S.\n1.3\n \n%\n0.1\n \n%\n1.1\n \n%\nSeparation, disposal and wind-down of certain business operations\n—\n \n%\n—\n \n%\n6.3\n \n%\nValuation allowance\n0.4\n \n%\n1.2\n \n%\n1.7\n \n%\nNet impact of repatriated international earnings\n(\n0.6\n)\n%\n(\n0.4\n)\n%\n(\n0.4\n)\n%\nFederal tax credits\n(\n1.4\n)\n%\n(\n1.5\n)\n%\n(\n1.3\n)\n%\nChange in unrecognized tax benefits\n0.3\n \n%\n0.6\n \n%\n0.3\n \n%\nOther, net\n(\n0.4\n)\n%\n1.5\n \n%\n1.8\n \n%\nEffective income tax rate\n23.4\n \n%\n25.5\n \n%\n33.6\n \n%\nDeferred Taxes \nThe significant components of the Company's deferred tax account balances are as follows:\n \nJanuary 31,\n(Amounts in millions)\n2025\n2024\nDeferred tax assets:\nLoss and tax credit carryforwards\n$\n7,539\n \n$\n7,136\n \nAccrued liabilities\n3,009\n \n3,066\n \nShare-based compensation\n263\n \n238\n \nLease obligations\n4,611\n \n4,831\n \nOther\n1,076\n \n1,124\n \nTotal deferred tax assets\n16,498\n \n16,395\n \nValuation allowances\n(\n7,405\n)\n(\n7,485\n)\nDeferred tax assets, net of valuation allowances\n9,093\n \n8,910\n \nDeferred tax liabilities:\nProperty and equipment\n4,303\n \n4,813\n \nAcquired intangibles\n1,096\n \n898\n \nInventory\n3,336\n \n3,035\n \nLease right of use assets\n4,816\n \n4,941\n \nMark-to-market investments\n353\n \n322\n \nOther\n460\n \n486\n \nTotal deferred tax liabilities\n14,364\n \n14,495\n \nNet deferred tax liabilities\n$\n5,271\n \n$\n5,585\n \nThe deferred taxes noted above are classified as follows in the Company's Consolidated Balance Sheets:\n  \nJanuary 31,\n(Amounts in millions)\n2025\n2024\nBalance Sheet classification\nAssets:\nOther long-term assets\n$\n1,748\n \n$\n1,663\n \nLiabilities:\nDeferred income taxes and other\n7,019\n \n7,248\n \nNet deferred tax liabilities\n$\n5,271\n \n$\n5,585\n \nNet Operating Losses, Tax Credit Carryforwards and Valuation Allowances\nAs of January 31, 2025, the Company's net operating loss and capital loss carryforwards totaled approximately $\n32.4\n billion. Of these carryforwards, approximately $\n18.5\n billion will expire, if not utilized, in various years through 2045. The remaining carryforwards have no expiration. \nThe realizability of these future tax deductions and credits is evaluated by assessing the adequacy of future expected taxable income from all sources, including taxable income in prior carryback years, reversal of taxable temporary differences, forecasted operating earnings and available tax planning strategies. To the extent the Company does not consider it more likely than not that a deferred tax asset will be recovered, a valuation allowance is generally established. To the extent that a valuation \n72\nallowance was established and it is subsequently determined that it is more likely than not that the deferred tax assets will be recovered, the change in the valuation allowance is recognized in the Consolidated Statements of Income.\nThe Company had valuation allowances of approximately $\n7.4\n billion and $\n7.5\n billion as of January 31, 2025 and 2024, respectively, on deferred tax assets associated primarily with the net operating loss carryforwards. \nUncertain Tax Positions\nThe benefits of uncertain tax positions are recorded in the Company's Consolidated Financial Statements only after determining a more-likely-than-not probability that the uncertain tax positions will withstand challenge, if any, from taxing authorities.\nAs of January 31, 2025 and 2024, the amount of gross unrecognized tax benefits related to continuing operations was $\n3.8\n billion and $\n3.5\n billion, respectively. The amount of unrecognized tax benefits that would affect the Company's effective income tax rate was $\n2.0\n billion and $\n1.7\n billion as of January 31, 2025 and 2024, respectively.\nA reconciliation of gross unrecognized tax benefits from continuing operations is as follows:\n \nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nGross unrecognized tax benefits, beginning of year\n$\n3,540\n \n$\n3,307\n \n$\n3,245\n \nIncreases related to prior year tax positions\n445\n \n336\n \n79\n \nDecreases related to prior year tax positions\n(\n228\n)\n(\n74\n)\n(\n248\n)\nIncreases related to current year tax positions\n93\n \n102\n \n357\n \nSettlements during the period\n(\n77\n)\n(\n102\n)\n(\n89\n)\nLapse in statutes of limitations\n(\n16\n)\n(\n29\n)\n(\n37\n)\nGross unrecognized tax benefits, end of year\n$\n3,757\n \n$\n3,540\n \n$\n3,307\n \nThe Company classifies interest and penalties related to uncertain tax benefits as interest expense and as operating, selling, general and administrative expenses, respectively. Interest expense and penalties related to these positions were immaterial for fiscal 2025, 2024 and 2023. During the next twelve months, it is reasonably possible that tax audit resolutions could reduce unrecognized tax benefits by an immaterial amount, either because the tax positions are sustained on audit or because the Company agrees to their disallowance. The Company does not expect any change to have a material impact to its Consolidated Financial Statements.\nThe Company remains subject to income tax examinations for its U.S. federal income taxes generally for fiscal 2018 through 2024. The Company also remains subject to income tax examinations for international income taxes for fiscal 2013 through 2024, and for U.S. state and local income taxes generally for the fiscal years ended 2018 through 2024. With few exceptions, the Company is no longer subject to U.S. federal, state, local or foreign examinations by tax authorities for years before fiscal 2013.\nOther Taxes\nThe Company is subject to tax examinations for value added, sales-based, payroll and other non-income taxes. A number of these examinations are ongoing in various jurisdictions. In certain cases, the Company has received assessments and judgments from the respective taxing authorities in connection with these examinations. Unless otherwise indicated, the possible losses or range of possible losses associated with these matters are individually immaterial, but a group of related matters, if decided adversely to the Company, could result in a liability material to the Company's Consolidated Financial Statements.\nNote 10.  \nContingencies\nLegal Proceedings\nThe Company is involved in a number of legal proceedings and certain regulatory matters. The Company records a liability for those legal proceedings and regulatory matters when it determines it is probable that a loss has been incurred and the amount of the loss can be reasonably estimated. The Company also discloses when it is reasonably possible that a material loss may be incurred. From time to time, the Company may enter into discussions regarding settlement of these matters, and may enter into settlement agreements, if it believes settlement is in the best interest of the Company and its shareholders.\nUnless stated otherwise, the matters discussed below, if decided adversely to or settled by the Company, individually or in the aggregate, may result in a liability material to the Company's financial position, results of operations or cash flows. The Company can provide no assurance as to the scope and outcome of these matters and cannot reasonably estimate any loss or range of loss, beyond the amounts accrued, if any, that may arise from these matters.\n73\nSettlement of Certain Opioid-Related Matters\nThe Company entered into settlement agreements with all \n50\n states, the District of Columbia, Puerto Rico, \nthree\n U.S. territories, and the vast majority of eligible political subdivisions and federally recognized Native American tribes to resolve opioid-related claims against the Company. In fiscal year 2023, the Company accrued a liability of approximately $\n3.3\n billion for these settlements, which include amounts for remediation of alleged harms, attorneys' fees, and costs. As of January 31, 2025, all of the accrued liability has been paid. Remaining eligible political subdivisions and federally recognized Native American tribes have until July 15, 2025 and February 24, 2026, respectively, to join these settlements. The Company will owe no additional funds for any eligible political subdivision or federally recognized Native American tribe that elects to join the settlement. \nOngoing Opioid-Related Litigation \nThe Company will continue to vigorously defend against any opioid-related matters not settled or otherwise resolved, including, but not limited to, each of the matters described below; any other actions filed by healthcare providers, individuals, and third-party payers; and any action filed by a political subdivision or Native American tribe that elects not to join the settlement described above. Accordingly, the Company has not accrued a liability for these opioid-related matters nor can the Company reasonably estimate any loss or range of loss that may arise from these matters. The Company can provide no assurance as to the scope and outcome of any of the opioid-related matters and no assurance that its business, financial position, results of operations or cash flows will not be materially adversely affected.\nOpioid Multidistrict Litigation; Other Opioid-Related Matters in the U.S. and Canada\n. In December 2017, the United States Judicial Panel on Multidistrict Litigation consolidated numerous lawsuits filed against a wide array of defendants by various plaintiffs, including counties, cities, healthcare providers, Native American tribes, individuals and third-party payers, asserting claims generally concerning the impacts of widespread opioid abuse. The consolidated multidistrict litigation is entitled \nIn re National Prescription Opiate Litigation \n(MDL No. 2804) (the \"MDL\") and is pending in the U.S. District Court for the Northern District of Ohio. The Company is named as a defendant in some cases included in the MDL.\nA trial involving claims brought by \ntwo\n counties against certain defendants, including the Company, in the MDL resulted in a judgment on August 17, 2022 that ordered all \nthree\n defendants, including the Company, to pay an aggregate amount of approximately $\n0.7\n billion over \n15\n years, on a joint and several liability basis, and granted the plaintiffs injunctive relief. The monetary aspect of the judgment was stayed pending appeal, and the injunctive aspect of the judgment went into effect on February 20, 2023, which did not materially impact the Company's operations. The Company filed an appeal with the Sixth Circuit Court of Appeals, which issued an order certifying certain questions in the appeal for review by the Supreme Court of Ohio. On December 10, 2024, the Supreme Court of Ohio issued an order certifying the law and holding that the Ohio Product Liability Act bars all common law public nuisance claims arising from the sale of a product. On January 31, 2025, the Sixth Circuit Court of Appeals entered an order vacating the approximately $\n0.7\n billion judgment, dissolving the injunction, and remanding the case back to the MDL for further proceedings.\nAdditional opioid-related cases against the Company remain pending in the MDL and in state and federal courts. The plaintiffs include healthcare providers, third-party payers, individuals and others and seek compensatory and punitive damages and injunctive relief, including abatement. \nFour\n cases brought by third-party payers and \none\n case brought by a hospital have been selected as bellwether cases to proceed through discovery in the MDL, and the MDL Court may designate additional bellwether cases in the future. The \nFlorida Health Sciences Center \ncase pending in state court in Florida asserts claims on behalf of several hospital systems against the Company and other defendants, and this matter is scheduled for jury trial beginning on September 18, 2025.\nThe Company has been responding to subpoenas, information requests, and investigations from governmental entities related to nationwide controlled substance dispensing and distribution practices involving opioids.\nWal-Mart Canada Corp. and certain other subsidiaries of the Company have been named as defendants in \ntwo\n putative class action complaints filed in Canada related to distribution practices involving opioids. These matters remain pending. \nDepartment of Justice Opioid Civil Litigation. \nOn December 22, 2020, the U.S. Department of Justice (the \"DOJ\") filed a civil complaint in the U.S. District Court for the District of Delaware alleging that the Company unlawfully dispensed controlled substances from its pharmacies and unlawfully distributed controlled substances to those pharmacies. The complaint alleges that this conduct resulted in violations of the Controlled Substances Act. The DOJ is seeking civil penalties and injunctive relief. On March 11, 2024, the Court granted in-part Walmart's motion to dismiss by dismissing the entirety of the DOJ's claims related to distribution and dismissing the DOJ's claims arising under one of the DOJ's two dispensing liability theories. The DOJ's claims arising under its other dispensing liability theory remain pending. Trial is scheduled for November 2027.\nOpioid-Related Securities Class Actions. \nThe Company is the subject of \ntwo\n securities class actions alleging violations of the federal securities laws regarding the Company's disclosures with respect to opioids purportedly on behalf of a class of investors who acquired Walmart stock from March 31, 2017 through December 22, 2020. Those actions were filed in the U.S. District Court for the District of Delaware in 2021 and later consolidated. On April 8, 2024, the Court granted the Company's motion to dismiss these actions. On April 29, 2024, the plaintiffs appealed to the Third Circuit Court of Appeals, where the matter remains pending.\n74\nOpioid-Related Shareholder Derivative Litigation.\nThree\n shareholders of the Company filed a derivative action in the Delaware Court of Chancery alleging that certain current and former directors and officers breached their fiduciary duties by failing to adequately oversee the Company's distribution and dispensing of prescription opioids. This action was entitled \nOntario Provincial Council of Carpenters' Pension Trust Fund, et al. v. Walton, et al.\n, Delaware Court of Chancery, Case No. 2021-0827-JTL (\"Ontario Action\"). Other shareholders of the Company filed \ntwo\n derivative actions alleging that certain current and former directors and officers breached fiduciary duties and violated federal securities laws in connection with the Company's distribution and dispensing of prescription opioids. Those actions were entitled \nAbt v. Alvarez, et al.\n, U.S. District Court for the District of Delaware, Case No. 21-cv-00172-CFC and \nNguyen v. McMillon, et al.\n, U.S. District Court for the District of Delaware, Case No. 21-cv-00551-CFC (collectively with the Ontario Action, the \"Derivative Actions\"). On May 5, 2023, the Walmart Board of Directors adopted resolutions creating a special litigation committee (\"SLC\") to investigate, review, and analyze the facts and circumstances surrounding the claims and allegations in the Derivative Actions and determine whether the prosecution of such claims is in Walmart's best interest.\nThe Delaware Court of Chancery entered a final order and judgment on December 20, 2024, granting approval to a settlement of the Derivative Actions. Pursuant to this order and judgment (i) insurance carriers funded a $\n123\n million settlement, of which $\n24.6\n million was awarded to plaintiffs' counsel for attorneys' fees and the balance was awarded to the Company; and (ii) the Company agreed to maintain certain corporate governance practices for a period of at least \nfive years\n. The settlement does not include any admission of liability, and the defendants expressly deny any wrongdoing. The Company received settlement proceeds of approximately $\n99\n million on December 24, 2024 and recorded it as a reduction to operating, selling, general, and administrative expense. The \nAbt\n and \nNguyen\n actions were dismissed on January 16, 2025. \nFalse Claims Act Litigation.\n \nOn August 23, 2019, a qui tam action was filed in the U.S. District Court for the District of New Mexico. The action was partially unsealed on April 30, 2024 after the federal government declined to intervene. The DOJ informed the Company of its decision not to intervene on June 20, 2024. On July 25, 2024, the Court transferred the litigation to the U.S. District Court for the District of Delaware. On January 9, 2025, the plaintiffs filed a third amended complaint on behalf of \ntwo\n former pharmacists of the Company as relators that alleges the Company violated the Controlled Substances Act and state pharmacy regulations and that such conduct constitutes violations of the federal False Claims Act. The Company intends to file a renewed motion to dismiss.\nOther Legal Proceedings \nAsda Equal Value Claims. \nAsda, formerly a subsidiary of the Company, is a defendant in certain equal value claims that began in 2008 and are proceeding in the United Kingdom before an Employment Tribunal in Manchester and before the High Court. Claims have been brought by approximately \n70,000\n current and former Asda store employees who allege their work is of equal value to the work done by employees in Asda's distribution centers and that the difference in pay and conditions between the different jobs is not objectively justified. Additional employees may assert claims in the future. The legal proceedings to consider these equal value claims are in \nthree\n phases, and the first phase is complete. Certain claims remain under consideration in the second phase. On January 31, 2025, the Employment Tribunal issued a ruling that certain of the claims are permitted to advance to the third phase. There are factual and legal defenses to the equal value claims, and the Company intends to vigorously defend them. Subsequent to the divestiture of Asda in February 2021, the Company continues to oversee the conduct of the defense of these claims. While potential liability for these claims remains with Asda, the Company has agreed to provide indemnification with respect to certain of these claims up to a contractually determined amount. The Company cannot predict the number of such claims that may ultimately be filed and cannot reasonably estimate any loss or range of loss that may arise related to these proceedings. Accordingly, the Company can provide no assurance as to the scope and outcome of these matters.\nMoney Transfer Agent Services Matters. \nThe Company has responded to grand jury subpoenas issued by the United States Attorney's Office for the Middle District of Pennsylvania on behalf of the DOJ seeking documents regarding the Company's consumer fraud prevention program and anti-money laundering compliance related to the Company's money transfer services, where Walmart is an agent. The most recent subpoena was issued in August 2020. Walmart's responses to DOJ's subpoenas have been complete since 2021. The Company continues to cooperate with the DOJ's review. The Company has also responded to civil investigative demands from the United States Federal Trade Commission (the \"FTC\") in connection with the FTC's investigation related to money transfers and the Company's anti-fraud program in its capacity as an agent.\nOn June 28, 2022, the FTC filed a complaint against the Company in the U.S. District Court for the Northern District of Illinois alleging that Walmart violated the Federal Trade Commission Act and the Telemarketing Sales Rule regarding its money transfer agent services and is requesting non-monetary relief and civil penalties. Following rulings on Walmart's motion to dismiss, the FTC filed an amended complaint on June 30, 2023. On July 3, 2024, the Court granted in part Walmart's motion to dismiss the amended complaint by dismissing with prejudice the claims under the Telemarketing Sales Rule but denying the motion to dismiss with respect to claims for injunctive relief under Section 5 of the Federal Trade Commission Act. On October 18, 2024, the Court certified its rulings on the motions to dismiss for interlocutory appeal and stayed discovery. On October 28, 2024, Walmart filed a petition for interlocutory appeal with the Seventh Circuit Court of Appeals. The petition for interlocutory appeal was granted on November 18, 2024. The Company's appellate brief was filed on February 12, 2025. \n75\nThe Company intends to vigorously defend these matters. However, the Company can provide no assurance as to the scope and outcome of these matters and cannot reasonably estimate any loss or range of loss that may arise. Accordingly, the Company can provide no assurance that its business, financial position, results of operations or cash flows will not be materially adversely affected. \nDriver Platform Matters. \nOn December 23, 2024, the Consumer Financial Protection Bureau (\"CFPB\") filed a lawsuit against the Company and Branch Messenger, Inc. in the District of Minnesota alleging the Company violated the Consumer Financial Protection Act by allegedly requiring independent contractor drivers on the Spark platform to receive payments through a financial product offered by Branch. The CFPB seeks an injunction and unspecified restitution, damages, and civil penalties. On February 20, 2025, the Court entered an order that indefinitely stays the case and vacates all deadlines.  \nThe Company has been responding to subpoenas, information requests and investigations from other governmental entities regarding the independent contractor classification of drivers and payment and operational practices with respect to the driver platform. The Company is also defending putative class and representative action civil litigation relating to driver classification and defending other civil litigation and arbitration claims in connection with the driver platform. \nThe Company intends to vigorously defend these matters. However, the Company can provide no assurance as to the scope and outcome of these matters and cannot reasonably estimate any loss or range of loss that may arise. Accordingly, the Company can provide no assurance that its business, financial position, results of operations or cash flows will not be materially adversely affected. \nMexico Antitrust Matter. \nOn October 6, 2023, the Comisión Federal de Competencia Económica of México (\"COFECE\") notified the main Mexican operating subsidiary of Wal-Mart de México, S.A.B. de C.V. (\"Walmex\"), a majority owned subsidiary of the Company, that COFECE's Investigatory Authority (\"IA\") had recommended the initiation of a quasi-judicial administrative process against Walmex's subsidiary for alleged relative monopolistic practices in connection with the supply and wholesale distribution of certain consumer goods, retail marketing practices of such consumer goods and related services. On December 12, 2024, after Walmex provided defenses, produced expert evidence and participated in a hearing, COFECE issued a split decision that Walmex's subsidiary had engaged in a single relative monopolistic practice in relation to the negotiation of \ntwo\n types of contributions with its suppliers. The resolution imposed a monetary penalty on Walmex's subsidiary in the amount of $\n93.4\n million pesos (approximately $\n5\n million U.S. dollars) and certain non-structural conduct measures relating to the \ntwo\n prohibited types of supplier contributions (while recognizing that other supplier contributions can continue). On January 6, 2025, Walmex's subsidiary challenged COFECE's resolution through an appeal in the specialized federal courts. Until the appeal is resolved, Walmex's subsidiary will operate in compliance with COFECE's ruling. Payment of the monetary penalty is stayed until the lawsuit is resolved.\nForeign Direct Investment Matters.\n \nIn July 2021, the Directorate of Enforcement in India issued a show cause notice to Flipkart Private Limited and one of its subsidiaries (\"Flipkart\"), and to unrelated companies and individuals, including certain current and former shareholders and directors of Flipkart. The notice requests the recipients to show cause as to why further proceedings under India's Foreign Direct Investment rules and regulations (the \"Rules\") should not be initiated against them based on alleged violations during the period from 2009 to 2015, prior to the Company's acquisition of a majority stake in Flipkart in 2018 (the \"Notice\"), in addition to more recent requests for information from the Directorate of Enforcement to Flipkart for periods prior and subsequent to April 2016 regarding the Rules, including the most recent request in February 2025 (the \"Requests\"). The Notice is an initial stage of proceedings under the Rules which could, depending upon the conclusions at the end of the initial stage, lead to a hearing to consider the merits of the allegations described in the Notice. If a hearing is initiated, whether with respect to the Notice or from further proceedings related to the Requests, and if it is determined that violations of the Rules occurred, then the regulatory authority has the authority to impose monetary and/or non-monetary relief, such as share ownership restrictions. Flipkart has been responding to the Notice and, if the matter progresses to a consideration of the merits of the allegations described in the Notice, Flipkart intends to defend against the allegations vigorously. Due to the fact that the process regarding the Notice is in the early stages, the Company is unable to predict whether the Notice will lead to a hearing on the merits or, if it does, the final outcome of the resulting proceedings, as well as whether any further proceedings will arise with respect to the Requests. The Company cannot reasonably estimate any loss or range of loss that may arise from these matters and can provide no assurance as to the scope or outcome of any proceeding that might result from the Notice or the Requests, or the amount of the proceeds the Company may receive in indemnification from individuals and entities that sold shares to the Company under the 2018 agreement for the period prior to the date the Company acquired its majority stake in Flipkart, and further can provide no assurance that its business, financial position, results of operations or cash flows will not be materially adversely affected.\n76\nIndia Antitrust Matter. \nOn January 13, 2020, the Competition Commission of India (\"CCI\") ordered its Director General (the \"DG\") to investigate certain matters alleging competition law violations by certain subsidiaries of Flipkart in India and other parties. On September 13, 2024, those subsidiaries received a non-confidential version of the DG's Investigation Report (the \"Report\"), alleging certain competition law violations. CCI is not bound by the Report, and will conduct its independent analysis of the allegations, including hearing objections from the subsidiaries and other parties before issuing its final order in the matter, which could include monetary and non-monetary relief. CCI's final order would also be subject to appropriate appellate proceedings. The Company can provide no assurance as to the scope and outcome of this matter, cannot reasonably estimate any loss or range of loss that may arise, and can provide no assurance that its business, financial position, results of operations or cash flows will not be materially adversely affected.\nNote 11.  \nRetirement-Related Benefits\nThe Company offers a 401(k) plan for associates in the U.S. under which eligible associates can begin contributing to the plan immediately upon hire. The Company also offers a 401(k) type plan for associates in Puerto Rico under which associates can begin to contribute generally after \none year\n of employment. Under these plans, after \none year\n of employment, the Company matches \n100\n% of participant contributions up to \n6\n% of annual eligible earnings. The matching contributions immediately vest at \n100\n% for each associate. Participants can contribute up to \n50\n% of their pre-tax earnings, but not more than the statutory limits.\nAssociates in international countries who are not U.S. citizens are covered by various defined contribution post-employment benefit arrangements. These plans are administered based upon the legislative and tax requirements in the countries in which they are established.\nThe following table summarizes the contribution expense related to the Company's defined contribution plans for fiscal 2025, 2024 and 2023:\nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nDefined contribution plans:\nU.S.\n$\n1,751\n \n$\n1,528\n \n$\n1,491\n \nInternational\n78\n \n85\n \n74\n \nTotal contribution expense for defined contribution plans\n$\n1,829\n \n$\n1,613\n \n$\n1,565\n \nNote 12.  \nSegments and Disaggregated Revenue\nSegments\nThe Company is engaged in the operation of retail and wholesale stores and clubs, as well as eCommerce websites and mobile applications, located throughout the U.S., Africa, Canada, Central America, Chile, China, India and Mexico. The Company's operations are conducted in \nthree\n reportable segments: Walmart U.S., Walmart International and Sam's Club U.S. The Company defines its segments as those operations whose results the chief operating decision maker (\"CODM\"), the Company's Chief Executive Officer, regularly reviews to analyze performance and allocate resources. The Company sells similar individual products and services in each of its segments. It is impractical to segregate and identify revenues for each of these individual products and services.\nThe Walmart U.S. segment includes the Company's mass merchandising concept in the U.S., as well as eCommerce, which includes omni-channel initiatives and certain other business offerings such as advertising services. The Walmart International segment consists of the Company's operations outside of the U.S., as well as eCommerce and omni-channel initiatives. The Sam's Club U.S. segment includes the warehouse membership clubs in the U.S., as well as samsclub.com and omni-channel initiatives. Corporate and support consists of corporate overhead and other items not allocated to any of the Company's segments.\n77\nThe Company measures the profit or loss of its segments using operating income. The CODM uses operating income to allocate resources across the reportable segments as part of the Company's long-range and annual planning processes, and to evaluate planned versus actual results when assessing segment operating performance. From time to time, the Company may revise the measurement of each segment's operating income, including any corporate overhead allocations, and presentation of significant segment expenses, as determined by the information regularly reviewed by its CODM. The operating results of each reportable segment, including the mix of cost of sales and operating, selling, general and administrative expenses, are not directly comparable due to differences in business model, format and channel mix. Additionally, the operating results of each reportable segment may not be comparable to those of other retailers, as discussed in \nNote 1\n. \nInformation for the Company's segments, as well as for Corporate and support, including the reconciliation to income before income taxes, is provided as follows:\nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nWalmart U.S.\nNet sales\n$\n462,415\n \n$\n441,817\n \n$\n420,553\n \nMembership and other income\n2,594\n \n1,985\n \n1,845\n \nTotal revenues\n465,009\n \n443,802\n \n422,398\n \nCost of sales\n336,451\n \n323,563\n \n308,805\n \nOperating, selling, general and administrative expenses\n104,676\n \n98,085\n \n92,973\n \nOperating income\n$\n23,882\n \n$\n22,154\n \n$\n20,620\n \nWalmart International\nNet sales\n$\n121,885\n \n$\n114,641\n \n$\n100,983\n \nMembership and other income\n1,478\n \n1,408\n \n1,621\n \nTotal revenues\n123,363\n \n116,049\n \n102,604\n \nCost of sales\n95,267\n \n89,831\n \n79,332\n \nOperating, selling, general and administrative expenses\n22,595\n \n21,309\n \n20,307\n \nOperating income\n$\n5,501\n \n$\n4,909\n \n$\n2,965\n \nSam's Club U.S.\n(1)\nNet sales\n$\n90,238\n \n$\n86,179\n \n$\n84,345\n \nMembership and other income\n2,323\n \n2,051\n \n1,908\n \nTotal revenues\n92,561\n \n88,230\n \n86,253\n \nCost of sales\n80,035\n \n76,748\n \n75,584\n \nOperating, selling, general and administrative expenses\n10,122\n \n9,290\n \n8,705\n \nOperating income\n$\n2,404\n \n$\n2,192\n \n$\n1,964\n \nCorporate and support\nMembership and other income\n(2)\n$\n52\n \n$\n44\n \n$\n34\n \nOperating, selling, general and administrative expenses\n2,491\n \n2,287\n \n5,155\n \nOperating loss\n$\n(\n2,439\n)\n$\n(\n2,243\n)\n$\n(\n5,121\n)\nConsolidated\nNet sales\n$\n674,538\n \n$\n642,637\n \n$\n605,881\n \nMembership and other income\n6,447\n \n5,488\n \n5,408\n \nTotal revenues\n680,985\n \n648,125\n \n611,289\n \nCost of sales\n511,753\n \n490,142\n \n463,721\n \nOperating, selling, general and administrative expenses\n139,884\n \n130,971\n \n127,140\n \nOperating income\n29,348\n \n27,012\n \n20,428\n \nInterest, net\n2,245\n \n2,137\n \n1,874\n \nOther (gains) and losses\n794\n \n3,027\n \n1,538\n \nIncome before income taxes\n$\n26,309\n \n$\n21,848\n \n$\n17,016\n \n(1) \nTotal fuel-related expenses for Sam's Club U.S. were $\n9.9\n billion, $\n10.6\n billion, and $\n12.1\n billion in fiscal 2025, fiscal 2024, and fiscal 2023 respectively.\n(2)\n Includes other income from corporate campus facilities.\n78\nTotal assets, depreciation and amortization, and capital expenditures for the Company's segments, as well as for Corporate and support, are as follows:\nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nWalmart U.S.\nTotal assets\n$\n150,006\n \n$\n137,782\n \n$\n130,659\n \nDepreciation and amortization\n8,549\n \n7,671\n \n7,054\n \nCapital expenditures\n16,466\n \n13,877\n \n11,425\n \nWalmart International\nTotal assets\n$\n80,016\n \n$\n86,136\n \n$\n86,766\n \nDepreciation and amortization\n2,260\n \n2,159\n \n1,964\n \nCapital expenditures\n3,178\n \n2,911\n \n2,625\n \nSam's Club U.S.\nTotal assets\n$\n16,862\n \n$\n15,682\n \n$\n15,490\n \nDepreciation and amortization\n706\n \n642\n \n609\n \nCapital expenditures\n1,212\n \n1,041\n \n727\n \nCorporate\nTotal assets\n$\n13,939\n \n$\n12,799\n \n$\n10,282\n \nDepreciation and amortization\n1,458\n \n1,381\n \n1,318\n \nCapital expenditures\n2,927\n \n2,777\n \n2,080\n \nConsolidated\nTotal assets\n$\n260,823\n \n$\n252,399\n \n$\n243,197\n \nDepreciation and amortization\n12,973\n \n11,853\n \n10,945\n \nCapital expenditures\n23,783\n \n20,606\n \n16,857\n \nTotal revenues and long-lived assets, consisting primarily of net property and equipment and lease right-of-use assets, aggregated by the Company's U.S. and non-U.S. operations, are as follows:\nFiscal Years Ended January 31,\n(Amounts in millions)\n2025\n2024\n2023\nRevenues\nU.S. operations\n$\n557,622\n \n$\n532,076\n \n$\n508,685\n \nNon-U.S. operations\n123,363\n \n116,049\n \n102,604\n \nTotal revenues\n$\n680,985\n \n$\n648,125\n \n$\n611,289\n \nLong-lived assets \nU.S. operations\n$\n115,250\n \n$\n104,480\n \n$\n95,567\n \nNon-U.S. operations\n24,455\n \n25,858\n \n23,667\n \nTotal long-lived assets\n$\n139,705\n \n$\n130,338\n \n$\n119,234\n \nNo individual country outside of the U.S. had total revenues or long-lived assets that were material to the consolidated totals. Additionally, the Company did not generate material revenues from any single customer.\nDisaggregated Revenues\nIn the following tables, segment net sales are disaggregated by either merchandise category or market. In addition, net sales related to eCommerce are provided for each segment. Net sales related to eCommerce include omni-channel sales where a customer initiates an order digitally and the order is fulfilled through a store or club, as well as net sales from other business offerings that are part of the Company's ecosystem such as certain advertising arrangements, fulfillment services, and data insights. From time to time, the Company revises the assignment of net sales of a particular item to a merchandise category. When the assignment changes, previous period amounts are reclassified to be comparable to the current period's presentation. \n(Amounts in millions)\nFiscal Years Ended January 31,\nWalmart U.S. net sales by merchandise category\n2025\n2024\n2023\nGrocery\n$\n276,003\n \n$\n264,210\n \n$\n247,299\n \nGeneral merchandise\n113,921\n \n113,985\n \n118,597\n \nHealth and wellness\n62,092\n \n54,898\n \n46,591\n \nOther\n10,399\n \n8,724\n \n8,066\n \nTotal\n$\n462,415\n \n$\n441,817\n \n$\n420,553\n \nOf Walmart U.S.'s total net sales, approximately $\n79.3\n billion, $\n65.4\n billion and $\n53.4\n billion related to eCommerce for fiscal 2025, 2024 and 2023, respectively. \n79\n(Amounts in millions)\nFiscal Years Ended January 31,\nWalmart International net sales by market\n2025\n2024\n2023\nMexico and Central America\n$\n51,970\n \n$\n49,726\n \n$\n40,496\n \nCanada\n23,035\n \n22,639\n \n22,300\n \nChina\n19,975\n \n17,011\n \n14,711\n \nOther\n26,905\n \n25,265\n \n23,476\n \nTotal\n$\n121,885\n \n$\n114,641\n \n$\n100,983\n \nOf Walmart International's total net sales, approximately $\n29.5\n billion, $\n24.8\n billion and $\n20.3\n billion related to eCommerce for fiscal 2025, 2024 and 2023, respectively. \n(Amounts in millions)\nFiscal Years Ended January 31,\nSam's Club U.S. net sales by merchandise category\n2025\n2024\n2023\nGrocery\n$\n59,976\n \n$\n56,455\n \n$\n53,055\n \nFuel and other\n12,924\n \n13,678\n \n15,385\n \nGeneral merchandise\n11,249\n \n11,041\n \n11,669\n \nHealth and wellness\n6,089\n \n5,005\n \n4,236\n \nTotal\n$\n90,238\n \n$\n86,179\n \n$\n84,345\n \nOf Sam's Club U.S.'s total net sales, approximately $\n12.1\n billion, $\n9.9\n billion and $\n8.4\n billion related to eCommerce for fiscal 2025, 2024 and 2023, respectively.\n \nNote 13.  \nSubsequent Event\nDividends Declared\nThe Company approved, effective February 20, 2025, the fiscal 2026 annual dividend of $\n0.94\n per share, an increase over the fiscal 2025 dividend of $\n0.83\n per share. \nFor fiscal 2026, the annual dividend will be paid in four quarterly installments of $\n0.235\n per share, according to the following record and payable dates:\nRecord Date\n  \nPayable Date\nMarch 21, 2025\n  \nApril 7, 2025\nMay 9, 2025\n  \nMay 27, 2025\nAugust 15, 2025\n  \nSeptember 2, 2025\nDecember 12, 2025\n  \nJanuary 5, 2026\n80\nITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A.\nCONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to provide reasonable assurance that information, which is required to be timely disclosed, is accumulated and communicated to management in a timely fashion. In designing and evaluating such controls and procedures, we recognize that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. Our management is necessarily required to use judgment in evaluating controls and procedures. Also, we have investments in unconsolidated entities. Since we do not control or manage those entities, our controls and procedures with respect to those entities are substantially more limited than those we maintain with respect to our consolidated subsidiaries.\nIn the ordinary course of business, we review our internal control over financial reporting and make changes to our systems and processes to improve such controls and increase efficiency, while ensuring that we maintain an effective internal control environment. Changes may include such activities as implementing new, more efficient systems, updating existing systems, automating manual processes, standardizing controls globally, migrating certain processes to our shared services organizations and increasing monitoring controls. \nWe are continuing to upgrade our financial systems globally, and modernize functions across the business which\n will impact our internal control over financial reporting.\nAn evaluation of the effectiveness of the design and operation of our disclosure controls and procedures as of January 31, 2025 was performed under the supervision and with the participation of management, including our Chief Executive Officer and Chief Financial Officer. Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures are effective to provide reasonable assurance that information required to be disclosed by the Company in the reports that it files or submits under the Securities Exchange Act of 1934, as amended, is accumulated and communicated to management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure and are effective to provide reasonable assurance that such information is recorded, processed, summarized and reported within the time periods specified by the SEC's rules and forms.\nReport on Internal Control Over Financial Reporting\nManagement has responsibility for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external reporting purposes in accordance with accounting principles generally accepted in the United States. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Management has assessed the effectiveness of the Company's internal control over financial reporting as of January 31, 2025. In making its assessment, management has utilized the criteria set forth by the Committee of Sponsoring Organizations (\"COSO\") of the Treadway Commission in Internal Control-Integrated Framework (2013). Management concluded that based on its assessment, Walmart's internal control over financial reporting was effective as of January 31, 2025. The Company's internal control over financial reporting as of January 31, 2025, has been audited by Ernst & Young LLP as stated in their report which appears herein.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in the Company's internal control over financial reporting as of January 31, 2025, that have materially affected, or are reasonably likely to materially affect, the Company's internal control over financial reporting.\nITEM 9B.\nOTHER INFORMATION\nSecurity Trading Plans\n of Directors and Executive Officers\nOn \nNovember 22, 2024\n, \nKathryn McLay\n, \nExecutive Vice President, President and Chief Executive Officer\n, Walmart International, \nentered into a stock trading plan\n designed to comply with Rule 10b5-1 under the Securities Exchange Act of 1934. Under the terms of the plan, Ms. McLay will sell an aggregate \n40,000\n shares of common stock. The plan will terminate in \nDecember 2025\n.\nITEM 9C.\nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n81\nPART III\nITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nPlease see the information concerning our executive officers contained in \"\nItem 1. Business\n\" herein under the caption \"Information About Our Executive Officers,\" which is included in accordance with the Instruction to Item 401 of the SEC's Regulation S-K.\nInformation required by this Item 10 with respect to the Company's directors and certain family relationships is incorporated by reference to such information under the caption \"Proposal No. 1 – Election of Directors\" included in our Proxy Statement relating to our 2025 Annual Meeting of Shareholders (our \"Proxy Statement\").\nNo material changes have been made to the procedures by which shareholders of the Company may recommend nominees to our Board of Directors since those procedures were disclosed in our proxy statement relating to our 2024 Annual Shareholders' Meeting as previously filed with the SEC.\nThe information regarding our Audit Committee, including our audit committee financial experts, our Reporting Protocols for Senior Financial Officers and our Code of Conduct applicable to all of our associates, including our Chief Executive Officer, Chief Financial Officer and our Controller, who is our principal accounting officer, required by this Item 10 is incorporated herein by reference to the information under the captions \"Corporate Governance\" and \"Proposal No. 4: Ratification of Independent Accountants\" included in our Proxy Statement. \"\nItem 1. Business\n\" above contains information relating to the availability of a copy of our Reporting Protocols for Senior Financial Officers and our Code of Conduct and the posting of amendments to and any waivers of the Reporting Protocols for Senior Financial Officers and our Code of Conduct on our website.\nThe Company has an \ninsider trading policy\n (\"Insider Trading Policy\") that governs the purchase, sale and other dispositions of Walmart securities by its directors, officers, associates and the Company itself. The Insider Trading Policy states, among other things, that our directors, officers and associates are prohibited from trading in such securities while in possession of material, nonpublic information. The Company is also prohibited from trading in Walmart securities while in possession of material, nonpublic information related to the Company unless such trading activity complies with all applicable securities laws. The Company believes the Insider Trading Policy is reasonably designed to promote compliance with insider trading laws, rules and regulations, and any applicable NYSE listing standards. The foregoing summary of our Insider Trading Policy does not purport to be complete and is qualified by reference to the Insider Trading Policy filed as Exhibit 19 to this Annual Report on Form 10-K.\nITEM 11.\nEXECUTIVE COMPENSATION\nThe information required by this Item 11 is incorporated herein by reference to the information under the captions \"Corporate Governance – Director Compensation\" and \"Executive Compensation\" included in our Proxy Statement. \nITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item 12 is incorporated herein by reference to the information that appears under the caption \"Stock Ownership\" included in our Proxy Statement.\nITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item 13 is incorporated herein by reference to the information under the caption \"Corporate Governance – Board Processes and Practices\" included in our Proxy Statement.\nITEM 14.\nPRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this Item 14 is incorporated herein by reference to the information under the caption \"Proposal No. 4 – Ratification of Independent Accountants\" included in our Proxy Statement.\n82\nPART IV\nITEM 15.\nEXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a)     Documents filed as part of this report are as follows: \n1.\nFinancial Statements: See the Financial Statements in \"\nItem 8. Financial Statements and Supplementary Data\n.\"\n2.\nFinancial Statement Schedules:\nCertain schedules have been omitted because the required information is not present or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the Consolidated Financial Statements, including the notes thereto.\n3.\nExhibits:\nSee exhibits listed under part (b) below.\n(b)    The required exhibits are filed as part of this Form 10-K or are incorporated by reference herein.\n(1)\n \n3.1(a)\nRestated Certificate of Incorporation of the Company dated February 1, 2018 is incorporated herein by reference to Exhibit 3.1 to the Report on Form 8-K filed by the Company on February 1, 2018\n3.1(b)\nCertificate of Amendment to the Restated Certificate of Incorporation of the Company, effective February 23, 2024 is incorporated herein by reference to Exhibit 3.1 to the Report on Form 8-K filed by the Company on February 23, 2024\n3.2\nAmended and Restated Bylaws of the Company dated November 10, 2022 are incorporated herein by reference to Exhibit 3.1 to the Report on Form 8-K filed by the Company on November 16, 2022\n4.1\nIndenture dated as of April 1, 1991, between the Company and J.P. Morgan Trust Company, National Association, as successor trustee to Bank One Trust Company, NA, as successor trustee to The First National Bank of Chicago, Trustee, is incorporated herein by reference to Exhibit 4(a) to Registration Statement on Form S-3 (File Number 33-51344) \n(P)\n4.2\nFirst Supplemental Indenture dated as of September 9, 1992, to the Indenture dated as of April 1, 1991, between the Company and J.P. Morgan Trust Company, National Association, as successor trustee to Bank One Trust Company, NA, as successor trustee to The First National Bank of Chicago, Trustee, is incorporated herein by reference to Exhibit 4(b) to Registration Statement on Form S-3 (File Number 33-51344) \n(P)\n4.3\nIndenture dated as of December 11, 2002, between the Company and J.P. Morgan Trust Company, National Association, as successor trustee to Bank One Trust Company, NA, is incorporated by reference to Exhibit 4.5 to Registration Statement on Form S-3 (File Number 333-101847)\n4.4\nIndenture dated as of July 19, 2005, between the Company and J.P. Morgan Trust Company, National Association is incorporated by reference to Exhibit 4.5 to Registration Statement on Form S-3 (File Number 333-126512)\n4.5\nFirst Supplemental Indenture, dated December 1, 2006, between the Company and The Bank of New York Trust Company, N.A., as successor-in-interest to J.P. Morgan Trust Company, National Association, as Trustee, under the Indenture, dated as of July 19, 2005, between the Company and J.P. Morgan Trust Company, National Association, as Trustee, is incorporated herein by reference to Exhibit 4.6 to Post-Effective Amendment No. 1 to Registration Statement on Form S-3 (File Number 333-130569)\n4.6\nSecond Supplemental Indenture, dated December 19, 2014, between the Company and The Bank of New York Trust Company, N.A., as successor-in-interest to J.P. Morgan Trust Company, National Association, as Trustee, under the Indenture, dated as of July 19, 2005, between the Company and J.P. Morgan Trust Company, National Association, as Trustee, is incorporated herein by reference to Exhibit 4.3 to Registration Statement on Form S-3 (File Number 333-201074)\n4.7\nThird Supplemental Indenture, dated June 26, 2018, between the Company and The Bank of New York Trust Company, N.A., as successor-in-interest to J.P. Morgan Trust Company, National Association, as Trustee, under the Indenture, dated as of July 19, 2005, between the Company and J.P. Morgan Trust Company, National Association, as Trustee, is incorporated herein by reference to Exhibit 4(S) to Current Report on Form 8-K filed on June 26, 2018\n4.8\nDescription of Registrant's Securities\n \nis incorporated by reference to\n Exhibit 4.8 to\n the Company's Annual Report on Form 10-K for the fiscal year ended January 31, 2024 filed on March 15, 2024\n83\n10.1\nWalmart Inc. Deferred Compensation Matching Plan, as amended and restated effective November 8, 2023\n \nis incorporated by reference to Exhibit \n10.1 \nto the Company's Annual Report on Form 10-K for the fiscal year ended January 31, 2024 filed on March 15, 2024\n \n(C)\n10.2\nWalmart Inc. Management Incentive Plan, as amended effective February 1, 2018 is incorporated by reference to Exhibit 10(b) to the Annual Report on Form 10-K of the Company for the fiscal year ended January 31, 2018, filed on March 30, 2018\n (C)\n10.3\nWalmart Inc. 2016 Associate Stock Purchase Plan, as amended effective February 1, 2024\n \nis incorporated by reference to Exhibit \n10.3\n to the Company's Annual Report on Form 10-K for the fiscal year ended January 31, 2024 filed on March 15, 2024\n \n(C)\n10.4\nWalmart Inc. Stock Incentive Plan of 2015, as amended effective February 1, 2018 is incorporated by reference to Exhibit 10(d) to the Annual Report on Form 10-K of the Company for the fiscal year ended January 31, 2018, filed on March 30, 2018\n (C)\n10.5\nWalmart Inc. Supplemental Executive Retirement Plan, as amended and restated effective February 1, 2023 is incorporated by reference to Exhibit 10.5 to the Annual Report on Form 10-K of the Company for the fiscal year ended January 31, 2023 filed on March 17, 2023\n (C)\n10.6\nWalmart Inc. Director Compensation Deferral Plan, as amended effective February 1, 2018 is incorporated by reference to Exhibit 10(f) to the Annual Report on Form 10-K of the Company for the fiscal year ended January 31, 2018, filed on March 30, 2018\n (C)\n10.7\nForm of Post-Termination Agreement and Covenant Not to Compete with attached Schedule of Executive Officers who have executed a Post-Termination Agreement and Covenant Not to Compete is incorporated by reference to Exhibit 10(p) to the Annual Report on Form 10-K of the Company for the fiscal year ended January 31, 2011, filed on March 30, 2011\n \n(C)\n10.7(a)\nAmended Schedule of Executive Officers who have executed a Post-Termination Agreement and Covenant Not to Compete in the form filed as Exhibit 10(p) to the Annual Report on Form 10-K of the Company for the fiscal year ended January 31, 2011\n \nis incorporated by reference to Exhibit \n10.7\n(a)\n to the Company's Annual Report on Form 10-K for the fiscal year ended January 31, 2024 filed on March 15, 2024\n \n(C)\n10.8\nForm of Walmart Inc. Stock Incentive Plan of 2015 Restricted Stock Notification of Award and Terms and Conditions of Award is incorporated by reference to Exhibit 10.8 to the Annual Report on Form 10-K of the Company for the fiscal year ended January 31, 2022, filed March 18, 2022\n (C)\n10.9\nForm of Walmart Inc. Stock Incentive Plan of 2015 Global Share-Settled Performance-Based Restricted Stock Unit Notification and Terms and Conditions is incorporated by reference to Exhibit 10.9 to the Annual Report on Form 10-K of the Company for the fiscal year ended January 31, 2022, filed on March 18, 2022\n \n(C)\n10.10\nWalmart Inc. Officer Deferred Compensation Plan, as amended and restated effective February 1, 2023 is incorporated by reference to Exhibit 10.10 to the Annual Report on Form 10-K of the Company for the fiscal year ended January 31, 2023 filed on March 17, 2023\n (C)\n10.11\nPost Termination Agreement and Covenant Not to Compete between the Company and Suresh Kumar dated June 6, 2019 is incorporated herein by reference to Exhibit 10.16 to the Annual Report on Form 10-K for the fiscal year ended January 31, 2020 filed on March 20, 2020\n \n(C)\n10.12\nShare Issuance and Acquisition Agreement by and Between Flipkart Private Limited and Walmart Inc. dated as of May 9, 2018 is incorporated herein by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q of the Company for the fiscal quarter ended July 31, 2018 filed on September 6, 2018 (portions of this exhibit have been omitted and filed separately with the SEC pursuant to a request for confidential treatment.)\n10.13\nCounterpart Form of Share Purchase Agreement by and Among Wal-Mart International Holdings, Inc., the shareholders of Flipkart Private Limited identified on Schedule I thereto, Fortis Advisors LLC and Walmart Inc. dated as of May 9, 2018 is incorporated herein by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q of the Company for the fiscal quarter ended July 31, 2018 filed on September 6, 2018 (portions of this exhibit have been omitted and filed separately with the SEC pursuant to a request for confidential treatment.)\n10.14\nRetirement Agreement between the Company and Judith McKenna dated August 16, 2023 is incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q of the Company for the fiscal quarter ended July 31, 2023 filed on September 1, 2023\n \n(C)\n84\n19*\nInsider Trading Policy\n21*\nList of the Company's Significant Subsidiaries\n23*\nConsent of Independent Registered Public Accounting Firm\n31.1* \nChief Executive Officer Section 302 Certification\n31.2* \nChief Financial Officer Section 302 Certification\n32.1** \nChief Executive Officer Section 906 Certification\n32.2** \nChief Financial Officer Section 906 Certification\n97.1\nWalmart Executive Compensation Recoupment Polic\ny\n is\n \nincorporated by reference to \nExhibit 97.1 to \nthe Com\npa\nny\n's Annual Report on Form 10-K for the fiscal year ended January 31, 202\n4\n filed on March 15, 2024\n99.1*\nNon-MDL Opioids Litigation Case Citations\n101.INS*\nInline XBRL Instance Document\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*\nFiled herewith as an Exhibit.\n**\nFurnished herewith as an Exhibit.\n(C)\nThis Exhibit is a management contract or compensatory plan or arrangement\n(P)\nThis Exhibit was originally filed in paper format. Accordingly, a hyperlink has not been provided.\n(1)\nCertain instruments defining the rights of holders of long-term debt securities of the Registrant are omitted pursuant to Item 601(b)(4)(iii) of Regulation S-K. The Company hereby undertakes to furnish to the SEC, upon request, copies of any such instruments.\n(c)    Financial Statement Schedules: None.\nITEM 16.\nFORM 10-K SUMMARY\nNone.\n85\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nWalmart Inc.\nDate:  March 14, 2025\n \nBy\n \n/s/ C. Douglas McMillon\n \n \nC. Douglas McMillon\n \n \nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nDate:  March 14, 2025\n \nBy\n \n/s/ C. Douglas McMillon\n \n \nC. Douglas McMillon\n \n \nPresident and Chief Executive Officer and Director\n \n \n(Principal Executive Officer)\nDate:  March 14, 2025\n \nBy\n \n/s/ Gregory B. Penner\n \n \nGregory B. Penner\n \n \nChairman of the Board and Director\nDate:  March 14, 2025\n \nBy\n \n/s/ John David Rainey\n \n \nJohn David Rainey\n \n \nExecutive Vice President and Chief Financial Officer\n(Principal Financial Officer)\nDate:  March 14, 2025\n \nBy\n \n/s/ David M. Chojnowski\n \n \nDavid M. Chojnowski\n \n \nSenior Vice President and Controller\n(Principal Accounting Officer)\nSignature Page to Walmart Inc.\nForm 10-K for the Fiscal Year Ended January 31, 2025 \n86\nDate:  March 14, 2025\n \nBy\n \n/s/ Cesar Conde\n \n \nCesar Conde\n \n \nDirector\nDate:  March 14, 2025\nBy\n/s/ Timothy P. Flynn\nTimothy P. Flynn\nDirector\nDate:  March 14, 2025\nBy\n/s/ Sarah Friar\nSarah Friar\nDirector\nDate:  March 14, 2025\nBy\n/s/ Carla A. Harris\nCarla A. Harris\nDirector\nDate:  March 14, 2025\nBy\n/s/ Thomas W. Horton\nThomas W. Horton\nDirector\nDate:  March 14, 2025\nBy\n/s/ Marissa A. Mayer\nMarissa A. Mayer\nDirector\nDate:  March 14, 2025\nBy\n/s/ Robert E. Moritz, Jr.\nRobert E. Moritz, Jr.\nDirector\nDate:  March 14, 2025\nBy\n/s/ Brian Niccol\nBrian Niccol\nDirector\nDate:  March 14, 2025\nBy\n/s/ Randall L. Stephenson\nRandall L. Stephenson\nDirector\nDate:  March 14, 2025\n \nBy\n \n/s/ Steuart L. Walton\n \n \nSteuart L. Walton\n \n \nDirector\nSignature Page to Walmart Inc.\nForm 10-K for the Fiscal Year Ended January 31, 2025 \n87"
  }
}