{
  "ticker": "WSM",
  "cik": "0000719955",
  "company_name": "WILLIAMS SONOMA INC",
  "filing_date": "2025-03-27",
  "accession": "0001628280-25-015037",
  "primary_doc": "wsm-20250202.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n78\n3\nTable of \nContents\nPART I \nITEM 1.    BUSINESS \nOVERVIEW \nWilliams-Sonoma, Inc., (the “Company”, “we”, or “us”) incorporated in 1973, is an omni-channel specialty retailer of high-quality products for the home. \nIn 1956, our founder, Chuck Williams, turned a passion for cooking and eating with friends into a small business with a big idea. He opened a store in Sonoma, California to sell the French cookware that intrigued him while visiting Europe but that could not be found in America. Chuck’s business, which set a standard for customer service, took off and helped fuel a revolution in American cooking and entertaining that continues today. \nIn the decades that followed, the quality of our products, our ability to identify new opportunities in the market and our people-first approach to business have facilitated our expansion beyond the kitchen into nearly every area of the home, as well as the places where our customers work, stay and play. Our in-house design capabilities and vertically integrated sourcing organization allow us to deliver high-quality, sustainable products at competitive prices. Through our e-commerce platform, our in-house customer relationship management and data analytic teams optimize our digital spend and customer connections. We have expanded our in-store services to not only provide an exceptional customer service experience but to also serve as design centers and omni-fulfillment hubs.\nOur vision is to own the home, and the places where our customers work, stay and play. Our products in our portfolio of nine brands — Williams Sonoma, Pottery Barn, Pottery Barn Kids, Pottery Barn Teen, West Elm, Williams Sonoma Home, Rejuvenation, Mark and Graham, and GreenRow — are marketed through e-commerce websites, our retail stores and direct-mail catalogs. These brands are also part of The Key Rewards, our loyalty and credit card program that offers members exclusive benefits across the Williams-Sonoma family of brands. We operate in the U.S., Puerto Rico, Canada, Australia and the United Kingdom, offer international shipping to customers worldwide and have unaffiliated franchisees that operate stores in the Middle East, the Philippines, Mexico, South Korea and India, as well as e-commerce websites in certain locations.\nWe are focused on three key priorities — returning to growth, elevating our world-class customer service and driving earnings. We believe our growth will be driven by our business strategies in each of our core businesses, our business-to-business division and our emerging brands. We will continue to improve our world-class customer service by driving supply chain improvements from reduced out-of-market and multiple shipments, fewer customer accommodations, lower returns and damages, and reduced replacements. Additionally, we see opportunity to drive margin by focusing on full-price selling and cost negotiations. We have a powerful portfolio of brands, serving a range of categories, aesthetics, and life stages and we have built a strong omni-channel platform and infrastructure, which will position us well for the next stage of growth.\nWilliams Sonoma \nFrom the beginning, our namesake brand, Williams Sonoma, has been bringing people together around food. A leading specialty retailer of high-quality products for the kitchen and home, the brand seeks to provide world-class service and an engaging customer experience. Williams Sonoma products offer everything for cooking, dining and entertaining, including: cookware, tools, electrics, cutlery, tabletop and bar, outdoor, furniture and a vast library of cookbooks. The brand also includes Williams Sonoma Home, a premium concept that offers classic home furnishings and decorative accessories, extending the Williams Sonoma lifestyle beyond the kitchen into every room of the home. \nPottery Barn \nEstablished in 1949 and acquired by Williams-Sonoma, Inc. in 1986, Pottery Barn is a premier omni-channel home furnishings retailer. America’s most meaningful, beautiful design source, Pottery Barn brings together good products, people and values — seeking inspiration, quality and world-class customer service in everything we do. Thoughtfully designed and crafted to last, Pottery Barn’s furniture, bedding, lighting, rugs, table essentials, decorative accessories and more can be loved for a lifetime.\n4\nTable of \nContents\nPottery Barn Kids \nSince 1999, Pottery Barn Kids’ mission has been to bring the utmost in quality, safety and style into every family’s home. Kids are, and have always been, the inspiration behind Pottery Barn Kids. Pottery Barn Kids’ designs are rigorously tested to meet the highest child safety standards and are expertly crafted from the best materials to last beyond their childhood years.\nWest Elm \nBorn in Brooklyn in 2002, West Elm is dedicated to transforming people’s spaces through creativity and style. West Elm creates unique, modern and affordable home décor and curates a selection of goods that are crafted by makers from across the world.  \nPottery Barn Teen \nLaunched in 2003, Pottery Barn Teen is the first home concept to focus exclusively on the teen market. Pottery Barn Teen’s purpose is to make safe and sustainable designs that inspire teens to create the world they want to live in. Pottery Barn Teen designs everything from organic bedding to multi-purpose furniture that adapts and lasts, with a mission to create for the future.\nRejuvenation \nRejuvenation, founded in 1977 with a passion for timeless design and quality craftsmanship, was acquired by Williams-Sonoma, Inc. in 2011. With design, manufacturing and distribution facilities in Portland, Oregon, Rejuvenation offers a wide assortment of made-to-order lighting, hardware, furniture and home décor inspired by history, designed for today and made to last for years to come. \nMark and Graham \nEstablished in 2012, Mark and Graham is a leading monogrammed lifestyle brand that offers thoughtfully designed personalized products and custom gifts. The digitally-native brand is known for high quality collections, ranging from home gifts to luggage to handbags, designed in-house that can be personalized with hundreds of monograms.\nGreenRow\nGreenRow, established in 2023, is an internally designed and developed brand specializing in the use of sustainable materials and manufacturing practices to create colorful, vintage-inspired heirloom quality products. Every product in the digitally-native brand's assortment prioritizes utilizing innovative, sustainable manufacturing practices with low-impact materials wherever possible — including responsibly sourced linen, cotton, wood and recycled materials.\nOutward\nIn 2017, we acquired Outward, Inc., a 3-D imaging and augmented reality platform for the home furnishings and décor industry. Headquartered in San Jose, California, Outward’s technology enables scalable applications in product visualization, digital room design and augmented and virtual reality.\nOPERATIONS \nAs of February 2, 2025, we had the following merchandise strategies: Williams Sonoma, Pottery Barn, Pottery Barn Kids, Pottery Barn Teen, West Elm, Williams Sonoma Home, Rejuvenation, Mark and Graham, and GreenRow, which sell our products through our e-commerce websites, retail stores and direct-mail catalogs. We offer shipping from many of our brands to countries worldwide, while our catalogs reach customers throughout the U.S. The e-commerce and retail businesses complement each other by meeting customers where they are; building brand awareness and acting as effective advertising vehicles. Our ability to leverage insights, our omni-channel positioning and our marketing efforts, focused on digital advertising complemented by targeted catalogs, drive sales to each of our channels. Consistent with our published privacy policies, we leverage our proprietary customer file, which is a unified view of customers across brands and channels, for digital, email and catalog marketing purposes, augmented by models developed by our in-house analytics team. Our retail stores serve as billboards for our brands, which we believe inspires new and existing customers to also shop online. We operate 512 stores, which include 477 stores in 40 states, Washington, D.C. and Puerto Rico, 19 stores in Canada, 14 stores in Australia and 2 stores in the United Kingdom. We also have multi-year franchise agreements with third parties in the Middle East, the Philippines, Mexico, South Korea and India that currently operate 126 franchised locations as well as e-commerce websites in certain locations. \n5\nTable of \nContents\nSUPPLIERS \nWe purchase most of our merchandise from numerous foreign and domestic manufacturers and importers, the largest of which accounted for approximately 3% of our purchases during fiscal 2024. Approximately 18% of our products were produced in the U.S. in fiscal 2024. The remaining 82% of our merchandise purchases were sourced from foreign suppliers, with approximately 23% from China, 16% from India, 14% from Vietnam and 29% from the rest of the world. Merchandise purchases in fiscal 2024 from Mexico and Canada were not significant. Substantially all of these purchases were negotiated and paid for in U.S. dollars.\nWe manufacture merchandise, primarily upholstered furniture and lighting, at our facilities located in North Carolina, Oregon and Mississippi. The current macroeconomic environment is uncertain, and we are subject to risks that may disrupt our supply chain operations or regionalization efforts, such as tariffs, foreign currency exchange rate fluctuations, increasing labor costs and union organizing activity. Despite these challenges, we believe our key differentiators, growth strategies and the efficiencies of our operating model to reduce costs and manage inventory levels leave us well-positioned to mitigate these costs in both the short- and long-term. Refer to",
    "item1a": "Item 1A\n of this Annual Report on Form 10-K, which are incorporated by reference herein.\nIn the last three fiscal years, we have not experienced any material cybersecurity incidents, and the expenses we have incurred from cybersecurity incidents have been immaterial.\nGovernance\nCybersecurity is an important part of our risk management processes and an area of increasing focus for our \nBoard of Directors\n and management. \nOur Audit and Finance Committee is responsible for the oversight of risks from cybersecurity threats. \nAt least quarterly, the Audit and Finance Committee receives an overview covering current and emerging cybersecurity threat risks and the Company’s ability to mitigate those risks, and discusses these topics with our Chief Information Security Officer and Chief Technology and Digital Officer.\n Cybersecurity risk management is also considered at least annually during separate Board of Directors meeting discussions with management.\nOur cybersecurity risk management strategy process is led by our \nChief Information Security Officer, and Chief Technology and Digital Officer, and leverages the expertise of our Chief Financial Officer, General Counsel and Chief Accounting Officer.\n \nOur Chief Information Security Officer and Chief Technology and Digital Officer have extensive prior work experience in roles involving managing information security, developing cybersecurity strategy, managing incident and breach response and implementing effective information and cybersecurity programs as well as several relevant degrees and certifications.\nThese members of management are informed about and monitor the prevention, mitigation, detection, and remediation of cybersecurity incidents through their management of, and participation in, the cybersecurity risk management and strategy processes described above, including the operation of our incident response plan.\n30\nTable of \nContents",
    "item1b": "ITEM 1B.     UNRESOLVED STAFF COMMENTS\nNone. \n29\nTable of \nContents",
    "item1c": "ITEM 1C.     CYBERSECURITY\nRisk Management and Strategy\nWe recognize the importance of assessing, identifying, and managing material risks associated with cybersecurity threats, as such term is defined in Item 106(a) of Regulation S-K. These risks include, among other things, operational risks; intellectual property theft; fraud; extortion; harm to associates or customers; violation of privacy or security laws; other litigation and legal risk; and reputational risks. \nThese cybersecurity risks and other company risks are monitored and integrated into our enterprise risk management process.\n As part of this process, appropriate personnel consult with subject matter specialists as necessary to gather insights for identifying and assessing material cybersecurity threat risks, their severity, and potential mitigations.\nOur cybersecurity risk management approach includes: (i) an enterprise risk management process, which includes cybersecurity risks and is periodically refreshed; (ii) system vulnerability scanning; (iii) cybersecurity training for employees; (iv) penetration testing, which simulates cyber threats; and (v) t\nhird-party risk management\n for suppliers, vendors, and other partners, which includes risk-based diligence and contractual provisions that allow for periodic auditing. We work to continually improve each of these processes with the goal of ensuring our cybersecurity strategy remains consistent with industry best practices.\nOur incident response plan coordinates the activities we take to prepare for, detect, respond to, and recover from cybersecurity incidents, which include processes to triage, assess severity for, escalate, contain, investigate, and remediate the incident. Further, we conduct periodic tabletop exercises to test our cyber incident response plan.\nAs part of our cybersecurity risk management strategy, we periodically engage with assessors, consultants and other third-parties to evaluate and test our systems.\n We also engage an independent Qualified Security Assessor to review our Payment Card Industry compliance.\nTo date, risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have not materially affected the company, including our business strategy, results of operations, or financial condition.\n See “Risks Related to Technology” included as part of our risk factor disclosures in"
  }
}