{
  "ticker": "WTW",
  "cik": "0001140536",
  "company_name": "WILLIS TOWERS WATSON PLC",
  "filing_date": "2025-02-25",
  "accession": "0000950170-25-026278",
  "primary_doc": "wtw-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. \nBUSINESS\n \n\n\nThe Company\n\n\nWTW is a leading global advisory, broking and solutions company that provides data-driven, insight-led solutions in the areas of people, risk and capital. Utilizing the global view and local expertise of our approximately 49,000 colleagues serving more than 140 countries and markets, we help organizations sharpen strategies, enhance resilience, motivate workforces and maximize performance. We design and deliver solutions that manage risk, optimize benefits, cultivate talent and expand the power of capital to protect and strengthen institutions and individuals. Working closely with our clients, we uncover opportunities for sustainable success.\n\n\nOur clients operate on a global and local scale in a multitude of businesses and industries throughout the world and generally range in size from large, major multinational corporations to middle-market domestic and international companies. Our clients include many of the world’s leading corporations, including approximately 96% of the FTSE 100, 89% of the Fortune 1000, and 90% of the Fortune Global 500 companies. We also advise the majority of the world’s leading insurance companies. We work with major corporations, emerging growth companies, governmental agencies and not-for-profit institutions in a wide variety of industries, with many of our client relationships spanning decades. None of the Company’s clients individually represented more than 10% of its consolidated revenue for each of the years ended December 31, 2024, 2023 and 2022. We place insurance with approximately 2,500 insurance carriers, none of which individually accounted for a significant concentration of the total premiums we placed on behalf of our clients in 2024, 2023 or 2022.\n\n\nAvailable Information\n\n\nThe Company files annual, quarterly and current reports, proxy statements and other information with the SEC. The SEC maintains a website that contains annual, quarterly and current reports, proxy statements and other information that issuers (including WTW) file electronically with the SEC. The SEC’s website is www.sec.gov.\n\n\nThe Company makes available, free of charge through our website, www.wtwco.com, our Annual Report on Form 10-K, our quarterly reports on Form 10-Q, our proxy statement, current reports on Form 8-K and Forms 3, 4, and 5 filed on behalf of directors and Section 16 officers, as well as any amendments to those reports filed or furnished pursuant to the Securities Exchange Act of 1934 (the ‘Exchange Act’) as soon as reasonably practicable after such material is electronically filed with, or furnished to, the SEC. Unless specifically incorporated by reference, information on our website is not a part of this Form 10-K.\n\n\nThe Company’s Memorandum and Articles of Association,\n \nCorporate Governance Guidelines, Audit Committee Charter, Risk and Operational Oversight Committee Charter, Human Capital and Compensation Committee Charter, and Corporate Governance and Nominating Committee Charter are available on our website, www.wtwco.com, in the Investor Relations section, or upon request. Requests for copies of these documents should be directed in writing to the Company Secretary c/o Office of General Counsel, Willis Towers Watson Public Limited Company, Brookfield Place, 200 Liberty Street, New York, NY 10281.\n\n\nGeneral Information\n\n\nWTW offers its clients a broad range of services and solutions to help them to identify and control their risks, and to enhance business performance by improving their ability to attract, retain and engage a talented workforce. Our risk control services range from strategic risk consulting (including providing actuarial analysis) to a variety of due diligence services, to the provision of practical on-site risk control services (such as health and safety or property loss control consulting), as well as analytical and advisory services (such as hazard modeling and climate risk quantification). We assist clients in planning how to manage incidents or crises when they occur. These services include contingency planning, security audits and product tampering plans. We help our clients enhance their business performance by delivering consulting services, technology and solutions that help them anticipate, identify and capitalize on emerging opportunities in human capital management, as well as offer investment advice to help them develop disciplined and efficient strategies to meet their investment goals.\n\n\nAs an insurance broker, we act as an intermediary between our clients and insurance carriers by advising our clients on their risk management requirements, helping them to determine the best means of managing risk and negotiating and placing insurance with insurance carriers through our global distribution network.\n \n\n\nWe operate a private Medicare marketplace in the U.S. through which, along with our active employee marketplace, we help our clients move to a more sustainable economic model by capping and controlling the costs associated with healthcare benefits.\n\n\nWe are not an insurance company, and therefore we do not underwrite insurable risks for our own account. We help sharpen strategies, enhance organizational resilience, motivate workforces and maximize performance to uncover opportunities for sustainable success.\n\n\n3\n\n\n\n\n \n\n\nWe derive the majority of our revenue from either commissions or fees for brokerage or consulting services. We do not determine the insurance premiums on which our commissions are generally based. Commission levels generally follow the same trend as premium levels as they are derived from a percentage of the premiums paid by the insureds. Fluctuations in these premiums charged by the insurance carriers can therefore have a direct and potentially material impact on our results of operations. Our fees for consulting services are spread across a variety of complementary businesses that generally remain steady during times of uncertainty. We have some businesses, such as our health and benefits and administration businesses, which can be counter cyclical during the early period of a significant economic change.\n\n\nBusiness Strategy\n \n\n\nWe believe that a unified and integrated approach to advisory, broking and solutions can be a path to growth for organizations around the world. We harness our collective power as ‘One WTW’ to make smart connections to serve and support our clients.\n\n\nWe operate in attractive markets – both growing and mature – with a diversified platform across industries, segments and businesses globally.\n \n\n\nOur strategy is focused on extending and amplifying WTW’s strengths to deliver sustainable growth and profitability.\n\n\nWe believe we can achieve this through executing on our three objectives:\n\n\n•\nAccelerate performance\n: By executing on the segment growth strategies to strengthen business fundamentals, advance innovative solutions and capitalize on our global footprint. \n\n\n•\nEnhance efficiency\n: By having a continuous improvement mindset, delivering operating leverage in our segments and leveraging WTW Enterprise Delivery Organization (WE DO) to focus on right work, right place, right tools and real estate optimization.\n\n\n•\nOptimize portfolio\n: By intentionally managing our portfolio through inorganic and organic investment in areas of strength and deepen our large and high-growth businesses with strategic investments in corporate risk and broking, health and benefits and wealth. Also, by divesting businesses that are no longer a strategic fit or do not have our desired financial profile. \n\n\nThese objectives are enabled by a focused investment framework and capital allocation strategy.\n\n\nThrough this strategy, we aim to grow revenue, improve margins and increase free cash flow, EBITDA and earnings. In turn, we’ll be able to fulfill our shared company purpose – We transform tomorrows.\n\n\nWe care as much about how we work as we do about the impact that we make. This means commitment to our shared purpose and values, a framework that guides how we run our business and serve clients. Our values of client focus, teamwork, integrity, respect and excellence underlie all that we do, and how we behave and interact with each other, our clients and our partners.\n\n\nFor more information about risks to our strategic plans, see Part I,",
    "item1a": "Item 1A Risk Factors in this Annual Report on Form 10-K, as updated by WTW’s subsequent SEC filings. The risks described in such filings are not the only risks facing WTW. Additional risks and uncertainties not currently known or that may currently be deemed to be immaterial also may materially adversely affect WTW’s business, financial condition or results of operations.",
    "item1c": "ITEM 1C. CYBERSECURITY\n \nWTW’s management is responsible for the day-to-day management of risks, and the board, including through its committees, is responsible for understanding and overseeing the various risks facing WTW. \nAs a professional services firm providing advice, broking and solutions in the areas of people, risk and capital, and often involving confidential and sensitive information, cybersecurity risk management is an integral part of our enterprise risk management (‘ERM’) strategy.\nCybersecurity Risk Management and Strategy\nIncreased global cybersecurity vulnerabilities, threats and more sophisticated and targeted cyber-related attacks pose an ongoing risk to the security of our information systems and networks. WTW seeks to manage cybersecurity risks consistent with its general approach to ERM. As further described below, our cybersecurity risk management program is coordinated by cross-functional teams. Technology and cyber risks that meet certain thresholds are escalated and tracked by the ERM team within the WTW Risk function.\n \nWTW has been certified by ISO 27001 and identifies, categorizes and manages cyber risks according to frameworks such as SOC 2 - Type 2 and the National Institute of Standards and Technology (‘NIST’) Framework. Additionally, \nWTW undertakes vulnerability scanning, and engages third parties from time-to-time to conduct penetration testing to help WTW identify and reduce the threat of known and emerging cybersecurity risks.\nBoard Oversight and Governance\nWTW’s board of directors has delegated the oversight of cybersecurity risks to the Risk and Operational Oversight Committee (the ‘Risk Committee’), which was recently formed following the completion of the three-year term of the Operational Transformation Committee. The Risk Committee assists the board of directors in its oversight of the ERM framework, policies, and practices used by WTW to identify, assess, and manage WTW’s key operational risks, including without limitation: cybersecurity, technology, information security, privacy, and artificial intelligence risk. \nWTW’s Chief Information Security Officer (‘CISO’) and Global Head of Technology report to the Risk Committee on cybersecurity matters, including key risks. \nThe Risk Committee reports to the board of directors at each formal board meeting and the board of directors discusses those reports.\nManagement Oversight and Governance\nManagement plays an important role in assessing and managing WTW’s material risks from cybersecurity threats. The CISO is responsible for designing and implementing a security program and strategy. \nWTW's \nCISO has served in various roles in information technology and information security for over 33 years, including serving as CISO of several public companies. The CISO holds undergraduate and graduate degrees in mathematics and strategic information systems and has attained the professional certification of \n\n\n40\n\n\n\n\n \n\n\nCertified \nInformation Systems Security Professional. The CISO reports to the Global Head of Technology. WTW’s Global Head of Technology has served in various roles in information technology for over 25 years. The Global Head of Technology holds a graduate degree in business.\nAs part of the WTW cybersecurity program, cross-functional teams throughout WTW, including enterprise risk management, operational resilience, legal, compliance and information security, coordinate to monitor, consider, and, when appropriate, address cybersecurity threats and respond to cybersecurity incidents.\n Through ongoing communications among these teams, the CISO, the Global Head of Technology, and other members of senior management, as appropriate, are informed about and monitor the prevention, detection, mitigation, and remediation of cybersecurity threats and incidents and escalate such threats and incidents as appropriate through the processes described in more detail below.\nWTW’s cybersecurity program is an ongoing process designed to identify, assess and manage WTW’s risk exposures over the short-, intermediate- and long-term. Management’s cybersecurity risk management strategy and processes include the following areas of focus:\n•\nIncident Response\n \nPlanning\n: WTW has a global Information and Cyber Security Incident Response Plan (‘ICSIRP’ or ‘Plan’) for identifying and managing cyber and data security threats. The ICSIRP defines the roles and responsibilities of WTW stakeholders involved in responding to cyber and data security events, severity levels and incident categories, and it outlines a process for incident management, including escalation and communication procedures.    \n•\nTechnical Safeguards\n: WTW seeks to continuously improve implemented technical safeguards that are designed to protect WTW’s information systems. Standards include controls for access management, cyber threat and incident management, data security, encryption, human resource security, network and device security, secure asset management, secure system development, security operations and third-party security. While WTW seeks to maintain adequate controls, they may not always be effective or at the level of maturity that the Company ultimately wishes to maintain. See Part I,",
    "item1b": "ITEM 1B. UNRESOLVE\nD STAFF COMMENTS\n\n\nNone."
  }
}