{
  "ticker": "WYNN",
  "cik": "0001174922",
  "company_name": "WYNN RESORTS LTD",
  "filing_date": "2025-02-13",
  "accession": "0001174922-25-000039",
  "primary_doc": "wynn-20241231.htm",
  "item_sections": {
    "item1": "Item 1 - \"Business - Regulation and Licensing - Macau\" for further discussion). The Macau pataca, which is not a freely convertible currency, is linked to the Hong Kong dollar, and in many cases the two are used interchangeably in Macau. The Hong Kong dollar is linked to the U.S. dollar and the exchange rate between these two currencies has remained relatively stable over the past several years. However, the exchange linkages of the Hong Kong dollar and the Macau pataca, and the Hong Kong dollar and the U.S. dollar, are subject to potential changes due to, among other things, changes in Chinese governmental policies and international economic and political developments.\nIf the Hong Kong dollar and the Macau pataca are not linked to the U.S. dollar in the future, severe fluctuations in the exchange rate for these currencies may result. We also cannot assure you that the current rate of exchange fixed by the applicable monetary authorities for these currencies will remain at the same level.\n58 \nTable of Contents\nWe expect most of the revenues and expenses for any casino that we operate in Macau will be denominated in Hong Kong dollars or Macau patacas; however, a significant portion of our Wynn Macau, Limited and Wynn Macau SA debt is denominated in U.S. dollars. Fluctuations in the exchange rates resulting in weakening of the Macau pataca or the Hong Kong dollar in relation to the U.S. dollar could have materially adverse effects on our results, financial condition, and ability to service debt. Based on our balances as of December 31, 2024, an assumed 1% change in the U.S. dollar/Hong Kong dollar exchange rate would cause a foreign currency transaction gain/loss of $41.5 million.\n59 \nTable of Contents\nItem 8. Financial Statements and Supplementary Data \nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReports of Independent Registered Public Accounting Firm\n (PCAOB ID: \n42\n)\n61\nConsolidated Balance Sheets\n64\nConsolidated Statements of Operations\n65\nConsolidated Statements of Comprehensive Income (Loss\n)\n66\nConsolidated Statements of Stockholders’ Deficit\n67\nConsolidated Statements of Cash Flows\n68\nNotes to Consolidated Financial Statements\n69\nQuarterly Consolidated Financial Information (Unaudited)\n114\n60 \nTable of Contents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Wynn Resorts, Limited and subsidiaries\nOpinion on Internal Control Over Financial Reporting \nWe have audited Wynn Resorts, Limited and subsidiaries’ internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Wynn Resorts, Limited and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income (loss), stockholders' deficit and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a)2 and our report dated February 13, 2025 expressed an unqualified opinion thereon. \nBasis for Opinion \nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion. \nDefinition and Limitations of Internal Control Over Financial Reporting \nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \n/s/ Ernst & Young LLP\nLas Vegas, Nevada\nFebruary 13, 2025\n61 \nTable of Contents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nThe Board of Directors and Stockholders of Wynn Resorts, Limited and subsidiaries\nOpinion on the Financial Statements \nWe have audited the accompanying consolidated balance sheets of Wynn Resorts, Limited and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income (loss), stockholders' deficit and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a)2 (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 13, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion \nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. \nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosure to which it relates.     \n62 \nTable of Contents\nValuation of Deferred Tax Assets\nDescription of the Matter\nAs more fully described in Note 14 to the consolidated financial statements, at December 31, 2024, the Company had deferred tax assets related to foreign tax credit carryforwards, disallowed interest expense carryforwards and other U.S. and foreign deferred tax assets of $1.5 billion reduced by a $604.6 million valuation allowance. Deferred tax assets are reduced by a valuation allowance if, based on the weight of all available evidence, in management’s judgment it is more likely than not that some portion, or all, of the deferred tax assets will not be realized. \nAuditing management’s assessment of the realizability of the Company’s deferred tax assets involved complex judgments due to the significant estimation required in measuring deferred tax assets. The measurement of deferred tax assets is affected by significant assumptions, including forecasted domestic and foreign-sourced income and related intercompany royalties, the amount of interest expense and other expenses allocated to foreign sourced income and the execution of tax planning strategies. Fluctuations in actual results from those forecasted can have a material impact on the measurement of deferred tax assets.\nHow We Addressed the Matter in Our Audit \nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over management’s process for evaluating the realization of the Company’s deferred tax assets, including controls over management’s review of its significant assumptions described above and identification and use of available tax planning strategies.\nTo test the valuation of deferred tax assets, we performed audit procedures that included, among others, assessing methodologies and testing the significant assumptions described above and the underlying data used by the Company in its analysis. We compared the significant assumptions used by management to the Company’s business plans and current industry and economic trends and evaluated whether changes to the Company’s business plans, economic trends and other factors would affect the significant assumptions. We assessed the historical accuracy of management’s estimates and performed sensitivity analyses of significant assumptions to evaluate the changes in the valuation allowance that would result from changes in the assumptions. We involved our tax professionals to evaluate the application of tax law in the Company’s available tax planning strategies, the scheduling of the reversal of existing taxable temporary differences and carryforward amounts, and the evaluation of the utilization of the deferred tax assets.\n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 2006.\nLas Vegas, Nevada\nFebruary 13, 2025\n63 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except share data)\nDecember 31,\n2024\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n2,426,155\n \n$\n2,879,186\n \nRestricted cash\n—\n \n18\n \nInvestments\n—\n \n845,192\n \nAccounts receivable, net of allowance for credit losses of $\n37,694\n and $\n40,075\n \n324,016\n \n341,712\n \nInventories\n75,783\n \n75,552\n \nPrepaid expenses and other\n95,725\n \n99,961\n \nTotal current assets\n2,921,679\n \n4,241,621\n \nProperty and equipment, net\n6,521,283\n \n6,688,479\n \nRestricted cash\n95,638\n \n90,208\n \nGoodwill and intangible assets, net\n273,062\n \n329,708\n \nOperating lease assets\n1,797,276\n \n1,832,896\n \nDeferred income taxes, net\n507,716\n \n500,877\n \nOther assets\n861,309\n \n312,434\n \nTotal assets\n$\n12,977,963\n \n$\n13,996,223\n \nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent liabilities:\nAccounts and construction payables\n$\n205,146\n \n$\n208,263\n \nCustomer deposits\n508,651\n \n543,288\n \nGaming taxes payable\n171,983\n \n172,832\n \nAccrued compensation and benefits\n229,305\n \n212,645\n \nAccrued interest\n132,510\n \n141,902\n \nCurrent portion of long-term debt\n41,250\n \n709,593\n \nOther accrued liabilities\n250,689\n \n211,931\n \nTotal current liabilities\n1,539,534\n \n2,200,454\n \nLong-term debt\n10,500,484\n \n11,028,744\n \nLong-term operating lease liabilities\n1,623,890\n \n1,631,749\n \nOther long-term liabilities\n282,658\n \n236,210\n \nTotal liabilities\n13,946,566\n \n15,097,157\n \nCommitments and contingencies (Note 18)\nStockholders' deficit:\nPreferred stock, par value $\n0.01\n; \n40,000,000\n shares authorized; \nzero\n shares issued and outstanding\n—\n \n—\n \nCommon stock, par value $\n0.01\n; \n400,000,000\n shares authorized; \n133,584,126\n and \n132,998,916\n shares issued; \n107,821,567\n and \n111,737,245\n shares outstanding, respectively\n1,336\n \n1,330\n \nTreasury stock, at cost; \n25,762,599\n and \n21,261,671\n shares, respectively\n(\n2,241,607\n)\n(\n1,836,326\n)\nAdditional paid-in capital\n3,698,800\n \n3,647,161\n \nAccumulated other comprehensive income (loss)\n(\n5,700\n)\n3,406\n \nAccumulated deficit\n(\n1,676,990\n)\n(\n2,066,953\n)\nTotal Wynn Resorts, Limited stockholders' deficit\n(\n224,161\n)\n(\n251,382\n)\n        Noncontrolling interests\n(\n744,442\n)\n(\n849,552\n)\nTotal stockholders' deficit\n(\n968,603\n)\n(\n1,100,934\n)\nTotal liabilities and stockholders' deficit\n$\n12,977,963\n \n$\n13,996,223\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n64 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share data)\nYear Ended December 31,\n2024\n2023\n2022\nOperating revenues:\nCasino\n$\n4,261,357\n \n$\n3,718,402\n \n$\n1,632,541\n \nRooms\n1,242,058\n \n1,185,671\n \n802,138\n \nFood and beverage\n1,069,117\n \n1,028,637\n \n846,214\n \nEntertainment, retail and other\n555,429\n \n599,187\n \n475,932\n \nTotal operating revenues\n7,127,961\n \n6,531,897\n \n3,756,825\n \nOperating expenses:\nCasino\n2,586,960\n \n2,238,671\n \n1,099,801\n \nRooms\n330,359\n \n307,132\n \n261,343\n \nFood and beverage\n859,426\n \n822,323\n \n700,549\n \nEntertainment, retail and other\n249,679\n \n340,437\n \n328,529\n \nGeneral and administrative\n1,080,475\n \n1,065,022\n \n830,450\n \nProvision for credit losses\n4,986\n \n(\n3,964\n)\n(\n7,295\n)\nPre-opening\n9,355\n \n9,468\n \n20,643\n \nDepreciation and amortization\n658,895\n \n687,270\n \n692,318\n \nGain on EBH Transaction, net \n—\n \n—\n \n(\n181,989\n)\nImpairment of goodwill and intangible assets\n—\n \n94,490\n \n48,036\n \nProperty charges and other\n215,095\n \n130,877\n \n65,116\n \nTotal operating expenses\n5,995,230\n \n5,691,726\n \n3,857,501\n \nOperating income (loss)\n1,132,731\n \n840,171\n \n(\n100,676\n)\nOther income (expense):\nInterest income\n130,342\n \n175,785\n \n29,758\n \nInterest expense, net of amounts capitalized\n(\n688,410\n)\n(\n751,509\n)\n(\n650,885\n)\nChange in derivatives fair value\n42,478\n \n45,098\n \n15,956\n \nLoss on debt financing transactions\n(\n2,913\n)\n(\n12,683\n)\n—\n \nOther\n29,170\n \n(\n11,479\n)\n5,811\n \nOther expense, net\n(\n489,333\n)\n(\n554,788\n)\n(\n599,360\n)\nIncome (loss) before income taxes\n643,398\n \n285,383\n \n(\n700,036\n)\n(Provision) benefit for income taxes\n(\n3,682\n)\n496,834\n \n(\n9,332\n)\nNet income (loss)\n639,716\n \n782,217\n \n(\n709,368\n)\nLess: net (income) loss attributable to noncontrolling interests\n(\n138,638\n)\n(\n52,223\n)\n285,512\n \nNet income (loss) attributable to Wynn Resorts, Limited\n$\n501,078\n \n$\n729,994\n \n$\n(\n423,856\n)\nBasic and diluted net income (loss) per common share:\nNet income (loss) attributable to Wynn Resorts, Limited:\nBasic\n$\n4.56\n \n$\n6.49\n \n$\n(\n3.73\n)\nDiluted\n$\n4.35\n \n$\n6.32\n \n$\n(\n3.73\n)\nWeighted average common shares outstanding:\nBasic\n109,966\n \n112,523\n \n113,623\n \nDiluted\n110,267\n \n112,855\n \n113,623\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n65 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\n(in thousands)\n \nYear Ended December 31,\n2024\n2023\n2022\nNet income (loss)\n$\n639,716\n \n$\n782,217\n \n$\n(\n709,368\n)\nOther comprehensive income (loss):\nForeign currency translation adjustments, before and after tax\n(\n12,700\n)\n5,297\n \n(\n8,849\n)\nTotal comprehensive income (loss)\n627,016\n \n787,514\n \n(\n718,217\n)\nLess: comprehensive (income) loss attributable to noncontrolling interests\n(\n135,044\n)\n(\n53,710\n)\n287,953\n \nComprehensive income (loss) attributable to Wynn Resorts, Limited\n$\n491,972\n \n$\n733,804\n \n$\n(\n430,264\n)\nThe accompanying notes are an integral part of these consolidated financial statements.\n66 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' DEFICIT\n(in thousands, except share data)\nCommon stock\nShares\noutstanding\nPar\nvalue\nTreasury\nstock\nAdditional\npaid-in\ncapital\nAccumulated\nother\ncomprehensive\nincome (loss)\nAccumulated deficit\nTotal\nWynn Resorts,  Limited\nstockholders'\ndeficit\nNoncontrolling\ninterests\nTotal stockholders'\n deficit\nBalances, January 1, 2022\n115,714,943\n \n$\n1,314\n \n$\n(\n1,436,373\n)\n$\n3,502,715\n \n$\n6,004\n \n$\n(\n2,288,078\n)\n$\n(\n214,418\n)\n$\n(\n621,797\n)\n$\n(\n836,215\n)\nNet loss\n— \n— \n— \n— \n— \n(\n423,856\n)\n(\n423,856\n)\n(\n285,512\n)\n(\n709,368\n)\nCurrency translation adjustment\n— \n— \n— \n— \n(\n6,408\n)\n— \n(\n6,408\n)\n(\n2,441\n)\n(\n8,849\n)\nIssuance of restricted stock\n797,419\n \n9\n \n— \n9,279\n \n— \n— \n9,288\n \n— \n9,288\n \nCancellation of restricted stock\n(\n115,521\n)\n(\n1\n)\n— \n1\n \n— \n— \n— \n— \n—\n \nShares repurchased by the Company and held as treasury shares\n(\n3,151,883\n)\n— \n(\n187,499\n)\n— \n— \n— \n(\n187,499\n)\n— \n(\n187,499\n)\nDistribution to noncontrolling interest\n— \n— \n— \n— \n— \n— \n— \n(\n27,744\n)\n(\n27,744\n)\nContribution from noncontrolling interest\n— \n— \n— \n48,559\n \n— \n— \n48,559\n \n1,474\n \n50,033\n \nTransactions with subsidiary minority shareholders\n124,481\n \n1\n \n— \n(\n14,053\n)\n— \n— \n(\n14,052\n)\n14,052\n \n—\n \nSubsidiary equity issuance\n— \n— \n— \n(\n18,717\n)\n— \n— \n(\n18,717\n)\n21,613\n \n2,896\n \nStock-based compensation\n— \n— \n— \n56,139\n \n— \n126\n \n56,265\n \n10,828\n \n67,093\n \nBalances, December 31, 2022\n113,369,439\n \n1,323\n \n(\n1,623,872\n)\n3,583,923\n \n(\n404\n)\n(\n2,711,808\n)\n(\n750,838\n)\n(\n889,527\n)\n(\n1,640,365\n)\nNet income\n— \n— \n— \n— \n— \n729,994\n \n729,994\n \n52,223\n \n782,217\n \nCurrency translation adjustment\n— \n— \n— \n— \n3,810\n \n— \n3,810\n \n1,487\n \n5,297\n \nExercise of stock options\n32,284\n \n— \n— \n1,965\n \n— \n— \n1,965\n \n— \n1,965\n \nIssuance of restricted stock\n727,522\n \n7\n \n— \n6,631\n \n— \n— \n6,638\n \n— \n6,638\n \nCancellation of restricted stock\n(\n23,256\n)\n— \n— \n— \n— \n— \n— \n— \n— \nShares repurchased by the Company and held as treasury shares\n(\n2,374,925\n)\n— \n(\n212,454\n)\n— \n— \n— \n(\n212,454\n)\n— \n(\n212,454\n)\nCash dividends declared\n— \n— \n— \n— \n— \n(\n85,139\n)\n(\n85,139\n)\n— \n(\n85,139\n)\nDistribution to noncontrolling interest\n— \n— \n— \n(\n2,994\n)\n— \n— \n(\n2,994\n)\n(\n19,584\n)\n(\n22,578\n)\nTransactions with subsidiary minority shareholders\n6,181\n \n— \n— \n(\n754\n)\n— \n— \n(\n754\n)\n754\n \n—\n \nStock-based compensation\n— \n— \n— \n58,390\n \n— \n— \n58,390\n \n5,095\n \n63,485\n \nBalances, December 31, 2023\n111,737,245\n \n1,330\n \n(\n1,836,326\n)\n3,647,161\n \n3,406\n \n(\n2,066,953\n)\n(\n251,382\n)\n(\n849,552\n)\n(\n1,100,934\n)\nNet income\n— \n— \n— \n— \n— \n501,078\n \n501,078\n \n138,638\n \n639,716\n \nCurrency translation adjustment\n— \n— \n— \n— \n(\n9,106\n)\n— \n(\n9,106\n)\n(\n3,594\n)\n(\n12,700\n)\nExercise of stock options\n17,285\n \n— \n— \n1,017\n \n— \n— \n1,017\n \n— \n1,017\n \nIssuance of restricted stock\n597,633\n \n6\n \n— \n8,009\n \n— \n— \n8,015\n \n38\n \n8,053\n \nCancellation of restricted stock\n(\n29,708\n)\n— \n— \n— \n— \n— \n— \n— \n— \nShares repurchased by the Company and held as treasury shares\n(\n4,500,888\n)\n— \n(\n405,281\n)\n— \n— \n— \n(\n405,281\n)\n— \n(\n405,281\n)\nCash dividends declared\n— \n— \n— \n— \n— \n(\n111,115\n)\n(\n111,115\n)\n(\n28,779\n)\n(\n139,894\n)\nDistribution to noncontrolling interest\n— \n— \n— \n— \n— \n— \n— \n(\n16,988\n)\n(\n16,988\n)\nTransactions with subsidiary minority shareholders\n— \n— \n— \n(\n11,643\n)\n— \n— \n(\n11,643\n)\n11,643\n \n—\n \nStock-based compensation\n— \n— \n— \n54,256\n \n— \n— \n54,256\n \n4,152\n \n58,408\n \nBalances, December 31, 2024\n107,821,567\n \n$\n1,336\n \n$\n(\n2,241,607\n)\n$\n3,698,800\n \n$\n(\n5,700\n)\n$\n(\n1,676,990\n)\n$\n(\n224,161\n)\n$\n(\n744,442\n)\n$\n(\n968,603\n)\nThe accompanying notes are an integral part of these consolidated financial statements.\n67 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nYear Ended December 31,\n2024\n2023\n2022\nCash flows from operating activities:\nNet income (loss)\n$\n639,716\n \n$\n782,217\n \n$\n(\n709,368\n)\nAdjustments to reconcile net income (loss) to net cash provided by (used in) operating activities:\nDepreciation and amortization\n658,895\n \n687,270\n \n692,318\n \nDeferred income taxes\n(\n6,838\n)\n(\n502,784\n)\n3,241\n \nStock-based compensation expense\n59,029\n \n64,515\n \n67,627\n \nAmortization of debt issuance costs\n39,428\n \n39,532\n \n29,427\n \nLoss on debt financing transactions\n2,913\n \n12,683\n \n—\n \nProvision for credit losses\n4,986\n \n(\n3,964\n)\n(\n7,295\n)\nChange in derivatives fair value \n(\n42,478\n)\n(\n45,098\n)\n(\n15,956\n)\nGain on EBH Transaction, net\n—\n \n—\n \n(\n181,989\n)\nImpairment of goodwill and intangible assets\n—\n \n94,490\n \n48,036\n \nProperty charges and other\n106,332\n \n117,176\n \n59,305\n \nIncrease (decrease) in cash from changes in:\nReceivables, net\n13,478\n \n(\n123,747\n)\n(\n9,335\n)\nInventories, prepaid expenses and other\n26,632\n \n(\n6,025\n)\n(\n19,737\n)\nCustomer deposits\n(\n36,967\n)\n37,951\n \n69,692\n \nAccounts payable and accrued expenses\n(\n38,923\n)\n93,663\n \n(\n97,238\n)\nNet cash provided by (used in) operating activities\n1,426,203\n \n1,247,879\n \n(\n71,272\n)\nCash flows from investing activities:\nCapital expenditures, net of construction payables and retention\n(\n419,929\n)\n(\n442,793\n)\n(\n300,127\n)\nInvestment in unconsolidated affiliates\n(\n563,418\n)\n(\n53,631\n)\n(\n40,181\n)\nPurchase of investments\n—\n \n(\n836,519\n)\n—\n \nProceeds from maturity of investments\n850,000\n \n—\n \n—\n \nPurchase of intangible and other assets\n(\n2,615\n)\n(\n10,752\n)\n(\n12,196\n)\nProceeds from EBH Transaction\n—\n \n—\n \n1,700,000\n \nProceeds from sale of assets and other\n52,404\n \n1,162\n \n1,471\n \nNet cash (used in) provided by investing activities\n(\n83,558\n)\n(\n1,342,533\n)\n1,348,967\n \nCash flows from financing activities:\nProceeds from issuance of long-term debt\n1,883,794\n \n1,200,000\n \n211,435\n \nRepayments of long-term debt\n(\n3,059,832\n)\n(\n1,533,124\n)\n(\n50,000\n)\nRepurchase of common stock\n(\n401,802\n)\n(\n212,455\n)\n(\n187,499\n)\nProceeds from exercise of stock options\n1,017\n \n1,965\n \n—\n \nProceeds from issuance of subsidiary common stock\n—\n \n—\n \n2,895\n \nProceeds from sale of noncontrolling interest in subsidiary\n—\n \n—\n \n50,033\n \nDistribution to noncontrolling interest\n(\n16,988\n)\n(\n22,579\n)\n(\n27,744\n)\nDividends paid\n(\n139,564\n)\n(\n84,733\n)\n(\n1,445\n)\nFinance lease payments\n(\n19,219\n)\n(\n19,267\n)\n(\n18,188\n)\nPayments for financing costs\n(\n36,714\n)\n(\n41,240\n)\n(\n3,165\n)\nOther\n(\n4,486\n)\n(\n7,773\n)\n—\n \nNet cash used in financing activities\n(\n1,793,794\n)\n(\n719,206\n)\n(\n23,678\n)\nEffect of exchange rate on cash, cash equivalents and restricted cash \n3,530\n \n282\n \n(\n2,094\n)\nCash, cash equivalents and restricted cash:\n(Decrease) increase in cash, cash equivalents and restricted cash \n(\n447,619\n)\n(\n813,578\n)\n1,251,923\n \nBalance, beginning of period\n2,969,412\n \n3,782,990\n \n2,531,067\n \nBalance, end of period\n$\n2,521,793\n \n$\n2,969,412\n \n$\n3,782,990\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n68 \nTable of Contents\n    \n    \n    \nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 -    \nOrganization and Business\nOrganization\nWynn Resorts, Limited, a Nevada corporation (together with its subsidiaries, \"Wynn Resorts\" or the \"Company\") is a designer, developer, and operator of integrated resorts featuring luxury hotel rooms, high-end retail space, an array of dining and entertainment options, meeting and convention facilities, and gaming. \nIn the Macau Special Administrative Region of the People's Republic of China (\"Macau\"), the Company owns approximately \n72\n% of Wynn Macau, Limited (\"WML\"), which includes the operations of the Wynn Palace and Wynn Macau resorts. The Company refers to Wynn Palace and Wynn Macau as its Macau Operations. In Las Vegas, Nevada, the Company operates and, with the exception of certain retail space, owns \n100\n% of Wynn Las Vegas. Additionally, the Company is a \n50.1\n% owner and managing member of a joint venture that owns and leases certain retail space at Wynn Las Vegas (the \"Retail Joint Venture\"). The Company refers to Wynn Las Vegas, Encore, an expansion at Wynn Las Vegas, and the Retail Joint Venture as its Las Vegas Operations. In Everett, Massachusetts, the Company operates Encore Boston Harbor, an integrated resort. Additionally, the Company has a \n40\n% equity interest in Island 3 AMI FZ-LLC (\"Island 3\"), an unconsolidated affiliate, which is constructing an integrated resort property (\"Wynn Al Marjan Island\") in Ras Al Khaimah, United Arab Emirates, currently expected to open in 2027. \nMacau Operations\nWynn Palace features a luxury hotel tower with \n1,706\n guest rooms, suites and villas, approximately \n468,000\n square feet of casino space, \n14\n food and beverage outlets, approximately \n37,000\n square feet of meeting and convention space, approximately \n107,000\n square feet of retail space, public attractions including a performance lake, an immersive entertainment center, Western and Asian art displays, and a gondola ride offering convenient street-level access. \nWynn Macau features \ntwo\n luxury hotel towers with a total of \n1,010\n guest rooms and suites, approximately \n294,000\n square feet of casino space, \n12\n food and beverage outlets, approximately \n31,000\n square feet of meeting and convention space, approximately \n64,500\n square feet of retail space, a performance lake, a rotunda show and recreation and leisure facilities.\nIn December 2022, Wynn Resorts (Macau), S.A. (\"Wynn Macau SA\"), an indirect subsidiary of the Company, entered into a definitive gaming concession contract (the \"Gaming Concession Contract\") with the Macau government, pursuant to which Wynn Macau SA was granted a 10-year gaming concession commencing on January 1, 2023 and expiring on December 31, 2032, to operate games of chance at Wynn Palace and Wynn Macau.\nLas Vegas Operations\nWynn Las Vegas features \ntwo\n luxury hotel towers with a total of \n4,748\n guest rooms, suites and villas, approximately \n195,000\n square feet of casino space, \n34\n food and beverage outlets, approximately \n513,000\n square feet of meeting and convention space, approximately \n178,000\n square feet of retail space (the majority of which is owned and operated under a joint venture of which the Company owns \n50.1\n%), as well as \ntwo\n theaters, \ntwo\n nightclubs and a beach club and recreation and leisure facilities.\nEncore Boston Harbor\nEncore Boston Harbor, an integrated resort in Everett, Massachusetts, adjacent to Boston along the Mystic River, features a luxury hotel tower with a total of \n671\n guest rooms and suites, approximately \n210,000\n square feet of casino space, \n16\n food and beverage outlets, one nightclub, approximately \n71,000\n square feet of meeting and convention space, and approximately \n8,186\n square feet of retail space. Public attractions include a waterfront park, floral displays, and water shuttle service to downtown Boston. \nIn December 2022, the Company closed on a sale-leaseback arrangement with respect to certain real estate assets related to Encore Boston Harbor (the \"EBH Transaction\"). Upon closing of the EBH Transaction, the Company received cash proceeds of approximately $\n1.70\n billion in exchange for the sale of such real estate assets, and concurrently entered into a lease agreement for the purpose of continuing to operate the Encore Boston Harbor integrated resort. For more information on the EBH Transaction, see Note 5, \"Property and Equipment, net\" and Note 16, \"Leases.\"\n69 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nNote 2 - Basis of Presentation and \nSignificant Accounting Policies\nBasis of Presentation and Principles of Consolidation\nThe accompanying consolidated financial statements have been prepared in accordance with U.S. generally accepted accounting principles (\"GAAP\") and include the accounts of the Company, its majority-owned subsidiaries, and entities the Company identifies as variable interest entities (\"VIEs\") of which the Company is determined to be the primary beneficiary. For information on the Company's VIEs, see Note 19, \"Retail Joint Venture.\" If the entity does not qualify for consolidation and the Company has significant influence over the operating and financial decisions of the entity, the Company accounts for the entity under the equity method. For more information on the Company's equity method investments, see \nInvestments in Unconsolidated Affiliate\n within Note 2, \"Basis of Presentation and Significant Accounting Policies.\"\n \nAll significant intercompany accounts and transactions have been eliminated. Certain amounts in the consolidated financial statements for the years ended December 31, 2023 and 2022 have been reclassified to be consistent with the current period presentation. These reclassifications had no effect on the previously reported net income (loss) or operating income (loss).\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. Significant estimates and assumptions reflected in the financial statements relate to and include, but are not limited to, inputs into the Company's estimated allowance for deferred tax assets and credit losses, estimates regarding the useful lives and recoverability of long-lived and intangible assets, valuations of derivatives, and litigation and contingency estimates.\nCash, Cash Equivalents and Restricted Cash \nCash and cash equivalents consist of cash and highly liquid investments with original maturities of three months or less and include both U.S. dollar-denominated and foreign currency-denominated securities. Cash equivalents are carried at cost, which approximates fair value. Restricted cash consists of cash collateral associated with obligations, cash held in a trust in accordance with WML's share award plan, and an amount held in the form of a first demand bank guarantee in favor of the Macau government to support Wynn Macau SA's legal and contractual obligations under the Gaming Concession Contract.\nInvestments\nThe Company's investments include financial assets in the form of interest-bearing fixed deposits with original maturities of greater than three months, which are recorded at fair value (see Note 10, \"Fair Value Measurements\"), and debt securities in the form of United States treasury bills. Investments in debt securities which the Company has the positive intent and ability to hold to maturity are classified as held-to-maturity and are carried at amortized cost. Debt securities held primarily for the purpose of selling in the near term are classified as trading securities and are reported at fair value, with unrealized gains and losses included in income. Debt securities not classified as held-to-maturity or trading are classified as available-for-sale and are reported at fair value with unrealized gains and losses as a separate component of other comprehensive income. Premiums and discounts on debt securities are amortized or accreted into interest income using the effective interest method. All of the Company’s debt securities are classified as held-to-maturity.\n \nThe Company received proceeds of $\n300.0\n million upon the maturity of its investments in debt securities and $\n550.0\n million upon the maturity of its investments in fixed deposits during the year ended December 31, 2024. The Company held no short-term investments as of December 31, 2024.\nAs of December 31, 2023, the Company held $\n550.0\n million in fixed deposits, recorded at fair value, and $\n295.2\n million in debt securities, recorded at amortized cost within Investments on the Consolidated Balance Sheets. The estimated fair value of the Company's debt securities as of December 31, 2023 was approximately $\n294.8\n million and the gross unrecognized holding loss was $\n0.4\n million. As of December 31, 2023, the Company had $\n8.7\n million in accrued interest on its debt securities, recorded in \nInvestments\n on the Consolidated Balance Sheets.\nAs of the balance sheet date, the Company evaluates whether the unrealized losses are attributable to credit losses or other factors. The Company considers the severity of the decline in value, creditworthiness of the issuer and other relevant factors and \n70 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nrecords an allowance for credit losses, limited to the excess of amortized cost over fair value, with a corresponding charge to earnings. The allowance may be subsequently increased or decreased based on the prevailing facts and circumstances. During the years ended December 31, 2024 and 2023, the Company recorded no allowance for credit losses related to its investments. \nAccounts Receivable and Credit Risk\nFinancial instruments that potentially subject the Company to concentrations of credit risk consist principally of casino accounts receivable. The Company issues credit in the form of \"markers\" to approved casino customers following investigations of creditworthiness.\nAccounts receivable, including casino and hotel receivables, are typically non-interest bearing and are recorded at amortized cost. Casino receivables primarily consist of credit issued to patrons in the form of markers. The Company issues credit based on factors such as level of play and financial resources, following background and credit checks. The casino credit extended by the Company is generally unsecured and due on demand. \nAn estimated allowance for credit losses is maintained to reduce the Company's receivables to their carrying amount, which reflects the net amount the Company expects to collect. The allowance estimate reflects specific review of customer accounts taking into consideration the amount owed, the age of the account, the customer's financial condition, management's experience with historical and current collection trends, current economic and business conditions, and management's expectations of future economic and business conditions and forecasts. Accounts are written off when management deems them to be uncollectible. Recoveries of accounts previously written off are recorded when received.\nInventories \nInventories consist of retail merchandise and food and beverage items, which are stated at the lower of cost or net realizable value, and certain operating supplies. Cost is determined by the first-in, first-out, weighted average and specific identification methods.\n \nProperty and Equipment\nPurchases of property and equipment are stated at cost, and when placed into service, are depreciated over the estimated \nuseful lives of the assets using the straight-line method as follows:\nEstimated Useful Life in Years \nBuildings and improvements\n10\n - \n45\nLand improvements\n10\n - \n45\nFurniture, fixtures and equipment\n3\n - \n20\nLeasehold interest in land\n25\nAirplanes\n20\nCosts related to improvements are capitalized, while costs of repairs and maintenance are charged to expense as incurred. The cost and accumulated depreciation of property and equipment retired or otherwise disposed of are eliminated from the respective accounts and any resulting gain or loss is included in property charges and other expenses in the accompanying Consolidated Statements of Operations.\n \nCapitalized Interest\nThe interest cost associated with major development and construction projects, and interest cost associated with equity method investments incurred during the investee's initial development period, is capitalized and included in the cost of the project or investment in unconsolidated affiliate balance. Interest capitalization ceases once a project is substantially complete or no longer undergoing construction activities to prepare it for its intended use. When no debt is specifically identified as being incurred in connection with a construction project, the Company capitalizes interest on amounts expended on the project using the weighted average cost of the Company's outstanding borrowings.\n Interest of $\n23.0\n million and $\n5.8\n million was capitalized for the years ended December 31, 2024 and 2023, respectively, including $\n21.7\n million and $\n3.6\n million related to equity \n71 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nmethod investments for the years ended December 31, 2024 and 2023, respectively. \nNo\n interest was capitalized for the year ended  December 31, 2022. \nGoodwill\nGoodwill represents the excess of the purchase price in a business combination over the fair value of the tangible and intangible assets acquired and the liabilities assumed. Goodwill is not amortized, but rather is subject to an annual impairment test.\nThe Company tests goodwill for impairment annually, or more frequently if events or changes in circumstances indicate that this asset may be impaired. The Company’s test of goodwill impairment starts with a qualitative assessment to determine whether it is necessary to perform a quantitative goodwill impairment test. If qualitative factors indicate that the fair value of the reporting unit is more likely than not less than its carrying amount, then a quantitative goodwill impairment test is performed. For the quantitative analysis, the Company compares the fair value of its reporting unit to its carrying value. If the estimated fair value exceeds its carrying amount, goodwill is considered not to be impaired and no additional steps are necessary. However, if the fair value of the reporting unit is less than its carrying amount, goodwill impairment is recorded equal to the difference between the carrying amount of the reporting unit and its fair value, not to exceed the carrying amount of goodwill.\n \nIntangible Assets other than Goodwill \nThe Company's intangible assets other than goodwill consist primarily of finite-lived intangible assets, including its Macau gaming concession and Massachusetts gaming license. Finite-lived intangible assets are amortized over the shorter of their contractual terms or estimated useful lives. The Company's indefinite-lived intangible assets are not amortized, but are reviewed for impairment annually.\n \nLong-Lived Assets\nLong-lived assets, which are to be held and used, including finite-lived intangible assets and property and equipment, are periodically reviewed by management for impairment whenever events or changes in circumstances indicate that the carrying value of the asset may not be recoverable. If an indicator of impairment exists, the Company compares the estimated future cash flows of the asset, on an undiscounted basis, to the carrying value of the asset. If the undiscounted cash flows exceed the carrying value, no impairment is indicated. If the undiscounted cash flows do not exceed the carrying value, then impairment is measured as the difference between fair value and carrying value, with fair value typically based on a discounted cash flow model. If an asset is still under development, future cash flows include remaining construction costs.\nLeases\nLessee Arrangements    \nThe Company is the lessee under non-cancelable real estate and equipment leases. The Company determines if an arrangement is or contains a lease at inception or modification of the arrangement. An arrangement is or contains a lease if there are identified assets and the right to control the use of an identified asset is conveyed for a period of time in exchange for consideration. Control over the use of the identified asset means the lessee has both the right to obtain substantially all of the economic benefits from the use of the asset and the right to direct the use of the asset.\nFinance and operating lease assets and liabilities are measured and recorded upon lease commencement at the present value of the future minimum lease payments. The Company combines lease and nonlease components in its determination of minimum lease payments, except for certain asset classes that have significant nonlease components. As the interest rate implicit in its leases is not readily determinable, the Company uses its incremental borrowing rate as the discount rate to determine the present value of lease payments. Lease terms include options to extend the lease when it is reasonably certain that such option will be exercised. The Company’s triple-net operating lease related to Encore Boston Harbor contains a renewal period at the Company’s option, which is not considered to be reasonably certain of being exercised. Many of the Company’s leases include fixed rental escalation clauses that are factored into the determination of lease payments. A lessee is required to classify a lease as a finance lease if, among other factors, 1) the term is for the major part of the remaining economic life of the underlying asset or 2) the present value of the sum of the lease payments equals or exceeds substantially all of the fair value of the underlying asset. For operating leases, lease expense for minimum lease payments is recognized on a straight-line basis over \n72 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nthe expected lease term. For finance leases, the Company records depreciation of the lease asset on a straight-line basis over the shorter of the lease term or useful life of the lease asset, and the lease liability accretes interest using the discount rate determined at lease commencement. The Company does not record an asset or liability for leases with a term of less than one year. Variable lease costs generally arise from changes in an index, such as the consumer price index. Variable lease costs are expensed as incurred and are not included in the determination of lease assets or liabilities.\nFor sale-leaseback arrangements, such as the EBH Transaction, the Company is required to determine whether the transaction qualifies as a sale, which includes assessing whether a contract exists and if so, whether control has passed to the counterparty in the contract. Control indicators include, but are not limited to, whether the entity has a present right to payment for the asset, whether the customer has legal title to the asset, whether the entity has transferred physical possession of the asset, whether the customer has significant risks and rewards of ownership of the asset, and whether the customer has accepted the asset. If it is determined that a sale has occurred, the Company recognizes an operating or finance lease based on the factors outlined in the preceding paragraph. A finance lease would preclude sale accounting.\nLessor Arrangements\nThe Company is the lessor under non-cancelable operating leases for retail and food and beverage outlet space at its integrated resorts, which represents approximately \n102,000\n, \n63,000\n, \n187,000\n, and \n52,000\n square feet of space at Wynn Palace, Wynn Macau, Wynn Las Vegas, and Encore Boston Harbor, respectively. The lease arrangements generally include minimum base rent and contingent rental clauses based on a percentage of net sales. Generally, the terms of the leases range between \nfive\n and \n10\n years. The Company records revenue on a straight-line basis over the term of the lease, and recognizes revenue for contingent rentals when the contingency has been resolved. The Company has elected to combine lease and nonlease components for the purpose of measuring lease revenue.\n \nInvestments in Unconsolidated Affiliate \n The Company accounts for its investment in Island 3, an unconsolidated affiliate which is constructing Wynn Al Marjan Island, using the equity method. Under the equity method, the investment's carrying value is adjusted for the Company’s share of the investee's earnings and losses, capital contributions to and distributions from this company, and capitalization of interest cost incurred by the Company during the investee's initial development period. As of December 31, 2024 and 2023, the Company had investments in unconsolidated affiliate of $\n648.2\n million and $\n90.9\n million, respectively, recorded in noncurrent other assets in the accompanying Consolidated Balance Sheets.  \nThe Company classifies operating income and losses as well as gains and impairments related to its investment in unconsolidated affiliate as a component of Operating income (loss) within the Company's accompanying Consolidated Statements of Operations, and classifies non-operating income or losses related to its investments in unconsolidated affiliates as a component of Other income (expense) within the Company's accompanying Consolidated Statements of Operations, as the Company’s investments in unconsolidated affiliate are an extension of the Company's core business operations.\n The Company recognized a loss on investments in unconsolidated affiliate of $\n6.1\n million and $\n2.4\n million during the years ended December 31, 2024 and 2023, respectively, recorded in Pre-opening within the Company's accompanying Consolidated Statements of Operations. \nDebt Issuance Costs\nDirect and incremental costs and original issue discounts and premiums incurred in connection with the issuance of long-term debt are deferred and amortized to interest expense using the effective interest method or, if the amounts approximate the effective interest method, on a straight-line basis. Debt issuance costs incurred in connection with the issuance of the Company's revolving credit facilities are presented in noncurrent other assets on the Consolidated Balance Sheets. All other debt issuance costs are presented as a direct reduction of long-term debt on the Consolidated Balance Sheets.\n Approximately $\n39.3\n million, $\n39.5\n million, and $\n29.4\n million was amortized to interest expense during the years ended December 31, 2024, 2023, and 2022, respectively. \nDerivative Financial Instruments\nThe Company enters into interest rate protection agreements to manage interest rate exposure on certain debt. The fair value of such agreements is recognized as an \nasset\n or liability at each balance sheet date, with changes in fair value recorded in earnings as these agreements do not qualify for hedge accounting. See Note 7, \"Long-Term Debt\" for additional information.\n73 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nSee Note 8, \"WML Convertible Bond Conversion Option Derivative\" for accounting policy disclosures relating to the WML Convertible Bond Conversion Option Derivative (as defined therein).\n \nRevenue Recognition \nThe Company's revenue from contracts with customers primarily consists of casino wagers and sales of rooms, food and beverage, entertainment, retail and other goods and services.\nGross casino revenues are measured by the aggregate net difference between gaming wins and losses. The Company applies a practical expedient by accounting for its casino wagering transactions on a portfolio basis versus an individual basis as all wagers have similar characteristics. Commissions rebated to customers either directly or indirectly through games promoters and cash discounts and other cash incentives earned by customers are recorded as a reduction of casino revenues. In addition to the wager, casino transactions typically include performance obligations related to complimentary goods or services provided to incentivize future gaming or in exchange for points earned under the Company's loyalty programs. \nFor casino transactions that include complimentary goods or services provided by the Company to incentivize future gaming, the Company allocates the standalone selling price of each good or service to the appropriate revenue type based on the good or service provided. Complimentary goods or services that are provided under the Company's control and discretion and supplied by third parties are recorded as an operating expense.\nThe Company offers loyalty programs at each of its resorts. Customers earn points based on their level of table games and slots play, which can be redeemed for slots free play, gifts and complimentary goods or services provided by the Company. For casino transactions that include points earned under the Company's loyalty programs, the Company defers a portion of the revenue by recording the estimated standalone selling price of the earned points that are expected to be redeemed as a liability. \nUpon redemption of the points for Company-owned goods or services, the standalone selling price of each good or service is allocated to the appropriate revenue type based on the good or service provided. Upon the redemption of points with third parties, the redemption amount is deducted from the liability and paid directly to the third party with any difference between the amount paid and the stand-alone selling price recorded as Entertainment, retail and other revenue in the accompanying Consolidated Statements of Operations. \nAfter allocating amounts to the complimentary goods or services provided and to the points earned under the Company's loyalty programs, the residual amount is recorded as casino revenue when the wager is settled.\nThe transaction price for rooms, food and beverage, entertainment, retail and other transactions is the net amount collected from the customer for such goods and services and is recorded as revenue when the goods are provided, services are performed or events are held. Sales tax and other applicable taxes collected by the Company are excluded from revenues. Advance deposits on rooms and advance ticket sales are performance obligations that are recorded as customer deposits until services are provided to the customer. Revenues from contracts with multiple goods or services are allocated to each good or service based on its relative standalone selling price. As previously noted, Entertainment, retail and other revenue also includes lease revenue, which is recognized in accordance with the relevant accounting principles.\n \nGaming Taxes\nThe Company is subject to taxes based on gross gaming revenues in the jurisdictions in which it operates, subject to applicable jurisdictional adjustments. These gaming taxes are recorded as casino expenses in the accompanying Consolidated Statements of Operations.\n These taxes totaled $\n1.83\n billion, $\n1.57\n billion, and $\n526.3\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n74 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nAdvertising Costs \nThe cost of advertising is expensed as incurred, and totaled $\n50.9\n million, $\n112.6\n million, and $\n148.6\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n \nPre-opening Expenses\nPre-opening expenses represent personnel, advertising, and other costs incurred prior to the opening of new ventures and are expensed as incurred.\n During the year ended December 31, 2024, pre-opening expenses primarily included the Company's share of net losses from Island 3, the unconsolidated affiliate constructing Wynn Al Marjan Island. During the year ended December 31, 2023, the Company incurred pre-opening expenses primarily in connection with the launch of sports betting operations in Massachusetts\n. \nDuring the year ended December 31, 2022, the Company incurred pre-opening expenses primarily in connection with reconfiguring the theater space at Wynn Las Vegas to host an exclusive theatrical production, \nAwakening\n.\nIncome Taxes\nThe Company is subject to income taxes in the U.S. and foreign jurisdictions where it operates. Accounting standards require the recognition of deferred tax assets, net of applicable reserves, and liabilities for the estimated future tax consequences attributable to differences between financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates in effect for the year in which those temporary differences are expected to be recovered or settled. The effect of a change in tax rates on the income tax provision and deferred tax assets and liabilities generally is recognized in the results of operations in the period that includes the enactment date. Accounting standards also require recognition of a future tax benefit to the extent that realization of such benefit is more likely than not; otherwise, a valuation allowance is applied.\nThe Company's income tax returns are subject to examination by the Internal Revenue Service (\"IRS\") and other tax authorities in the locations where it operates. The Company assesses potentially unfavorable outcomes of such examinations based on accounting standards for uncertain income taxes. The accounting standards prescribe a minimum recognition threshold a tax position is required to meet before being recognized in the financial statements.\nUncertain tax position accounting standards apply to all tax positions related to income taxes. These accounting standards utilize a two-step approach for evaluating tax positions. If a tax position, based on its technical merits, is deemed more likely than not to be sustained, then the tax benefit is measured as the largest amount of benefit that is more likely than not to be realized upon settlement.  \nAs applicable, the Company will recognize accrued penalties and interest related to unrecognized tax benefits in the provision for income taxes.\nForeign Currency \nGains or losses from foreign currency remeasurements are included in Other income (expense) in the accompanying Consolidated Statements of Operations. Balance sheet accounts are translated at the exchange rate in effect at each balance sheet date and income statement accounts are translated at the average rate of exchange prevailing during the year. Translation adjustments resulting from this process are charged or credited to other comprehensive loss.\nComprehensive Income (Loss) and Accumulated Other Comprehensive Income (Loss)\nComprehensive income (loss) includes net income (loss) and all other non-stockholder changes in equity or other comprehensive income (loss). Components of the Company's comprehensive income (loss) are reported in the accompanying Consolidated Statements of Stockholders' Deficit and Consolidated Statements of Comprehensive Income (Loss).\nFair Value Measurements\nThe Company measures certain of its financial assets and liabilities, at fair value on a recurring basis pursuant to accounting standards for fair value measurements. Fair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. These accounting standards establish a three-tier fair value hierarchy, which prioritizes the inputs used to measure fair value. These tiers include: \n75 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n•\nLevel 1\n - Observable inputs such as quoted prices in active markets. \n•\nLevel 2\n - Inputs other than quoted prices in active markets that are either directly or indirectly observable.\n•\nLevel 3\n - Unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions.\n \nStock-Based Compensation\nThe Company accounts for stock-based compensation in accordance with accounting standards, which require the compensation cost relating to share-based payment transactions be recognized in the Company's Consolidated Statements of Operations. The cost is measured at the grant date, based on the estimated fair value of the award using the Black-Scholes option pricing model for stock options, based on the estimated fair value of the award using the Monte Carlo simulation approach for performance share units, and based on the closing share price of the Company's stock on the grant date for nonvested share awards. Dividend yield is based on the estimate of annual dividends expected to be paid at the time of the grant. Expected volatility is based on implied and historical factors related to the Company's common stock. The risk-free interest rate used for each period presented is based on the U.S. Treasury yield curve for stock options issued under the WRL Omnibus Plan (as defined and discussed in Note 13, \"Stock-Based Compensation\") and the Hong Kong Exchange Fund rates for stock options issued under the WML Share Option Plan (as defined in Note 13, \"Stock-Based Compensation\"), both at the time of grant for the period equal to the expected term. Expected term represents the weighted average time between the option's grant date and its exercise date. The Company uses historical award exercise activity and termination activity in estimating the expected term for the WRL Omnibus Plan and WML Share Option Plan. The cost is recognized as an expense on a straight-line basis over the employee's requisite service period (the vesting period of the award), and forfeitures are recognized as they occur. The Company's stock-based employee compensation arrangements are more fully discussed in Note 13, \"Stock-Based Compensation.\"\n \nRecently Issued Accounting Standards\nThe Company’s management has evaluated all of the recently issued, but not yet effective, accounting standards that have been issued or proposed by the Financial Accounting Standards Board (\"FASB\") or other standards-setting bodies through the filing date of these financial statements and does not believe the future adoption of any such pronouncements will have a material effect on the Company’s financial position, results of operations and cash flows.\nNote 3 - \nCash, Cash Equivalents and Restricted Cash \nCash, cash equivalents and restricted cash consisted of the following (in thousands):\nDecember 31,\n2024\n2023\nCash and cash equivalents:\nCash\n(1)\n$\n1,639,151\n \n$\n1,076,474\n \nCash equivalents\n(2)\n787,004\n \n1,802,712\n \nTotal cash and cash equivalents\n2,426,155\n \n2,879,186\n \nRestricted cash\n(3)\n95,638\n \n90,226\n \nTotal cash, cash equivalents and restricted cash \n$\n2,521,793\n \n$\n2,969,412\n \n(1)\nCash consists of cash on hand and bank deposits.\n(2)\nCash equivalents consist of bank time deposits and money market funds. \n(3)\nRestricted cash consists of cash subject to certain contractual restrictions, cash collateral associated with obligations and cash held in a trust in accordance with WML's share award plan, and as of December 31, 2024 and 2023 includes $\n87.5\n million and $\n87.0\n million, respectively, in the form of a first demand bank guarantee in favor of the Macau government to support Wynn Macau SA's legal and contractual obligations through the term of the Gaming Concession Contract.\n \n76 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe following table disclose the supplemental cash flow disclosures of the Company (in thousands):\nYear Ended December 31,\n2024\n2023\n2022\nCash paid for interest, net of amounts capitalized\n$\n658,438\n \n$\n688,350\n \n$\n618,395\n \nCapitalized stock-based compensation\n$\n5,242\n \n$\n5,268\n \n$\n3,246\n \nCash paid for income taxes \n$\n10,160\n \n$\n10,310\n \n$\n5,290\n \nFinance lease liabilities arising from obtaining finance lease assets\n$\n80,021\n \n$\n8,842\n \n$\n5,906\n \nLiability settled with shares of common stock\n$\n8,015\n \n$\n6,639\n \n$\n9,287\n \nAccounts and construction payables related to property and equipment\n$\n85,949\n \n$\n60,313\n \n$\n64,861\n \nOther liabilities related to intangible assets\n(1)\n$\n—\n \n$\n209,410\n \n$\n4,220\n \nNet settlement of liabilities in connection with an asset sale\n$\n27,655\n \n$\n—\n \n$\n—\n \n(1) For the year ended December 31, 2023, included $\n206.5\n million related to the Macau gaming premium in connection with the Gaming Concession Contract. See Note 6, \"Goodwill and Intangible Assets, net\" for further information.\nNote 4 - \nReceivables, net \nReceivables, net consisted of the following (in thousands):\nDecember 31,\n2024\n2023\nCasino\n$\n236,642\n \n$\n218,694\n \nHotel\n45,996\n \n54,596\n \nOther\n79,072\n \n108,497\n \n361,710\n \n381,787\n \nLess: allowance for credit losses \n(\n37,694\n)\n(\n40,075\n)\n$\n324,016\n \n$\n341,712\n \nAs of December 31, 2024 and 2023, approximately \n70.9\n% and \n68.2\n%, respectively, of the Company's markers were due from customers residing outside the United States, primarily in Asia. Business or economic conditions or other significant events in the countries in which the Company's customers reside could affect the collectability of such receivables.\n \nThe Company’s allowance for casino credit losses was \n14.7\n% and \n15.9\n% of gross casino receivables as of December 31, 2024 and 2023, respectively. Although the Company believes that its allowance is adequate, it is possible the estimated amounts of cash collections with respect to receivables could change. The Company’s allowance for credit losses from its hotel and other receivables is not material.\nThe following table shows the movement in the Company's allowance for credit losses recognized for receivables that occurred during the period (in thousands):\nDecember 31,\n2024\n2023\nBalance at beginning of year\n$\n40,075\n \n$\n78,842\n \n   Provision for credit losses\n4,986\n \n(\n3,964\n)\n   Write-offs\n(\n13,262\n)\n(\n47,611\n)\n   Recoveries of receivables previously written-off\n5,801\n \n12,897\n \n   Effect of exchange rate\n94\n \n(\n89\n)\nBalance at end of period\n$\n37,694\n \n$\n40,075\n \n77 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nNote 5 - \nProperty and Equipment, net\nProperty and equipment, net consisted of the following (in thousands):\n December 31,\n2024\n2023\nBuildings and improvements\n$\n8,547,922\n \n$\n8,459,085\n \nLand and improvements\n1,210,455\n \n1,228,652\n \nFurniture, fixtures and equipment\n3,424,361\n \n3,311,478\n \nAirplanes\n110,623\n \n110,623\n \nConstruction in progress\n287,436\n \n162,592\n \n13,580,797\n \n13,272,430\n \nLess: accumulated depreciation\n(\n7,059,514\n)\n(\n6,583,951\n)\n$\n6,521,283\n \n$\n6,688,479\n \nAs of December 31, 2024 and 2023, construction in progress consisted primarily of costs capitalized for various capital enhancements at the Company's properties. During the year ended December 31, 2024, the Company expensed $\n61.5\n million of project costs related to a discontinued development project, inclusive of $\n4.7\n million of internally allocated overhead, that had been previously capitalized. The expense was recorded in Property charges and other expenses in the accompanying Consolidated Statements of Operations for the year ended December 31, 2024. \nDepreciation expense for the years ended December 31, 2024, 2023 and 2022 was $\n601.4\n million, $\n625.0\n million, and $\n652.1\n million, respectively.\nEncore Boston Harbor Real Estate Sale\nUpon closing of the EBH Transaction in December 2022, the Company received cash proceeds of approximately $\n1.70\n billion in exchange for the sale of certain real estate assets associated with Encore Boston Harbor. In connection with the sale, the Company recognized a gain of $\n182.0\n million in the fourth quarter of 2022.  \nMacau Operations Property Transfer Agreements\nIn December 2022, in accordance with the requirements of the Macau Gaming Law, Wynn Macau SA and Palo Real Estate Company Limited (\"Palo\"), a subsidiary of Wynn Macau SA, entered into agreements (collectively, the \"Property Transfer Agreements\") with the Macau government, pursuant to which Wynn Macau SA and Palo transferred the casino areas and gaming equipment of the Company's Macau Operations to the Macau government without compensation on December 31, 2022, and the Macau government agreed to transfer such casino areas and gaming equipment back to Wynn Macau SA as of January 1, 2023, for its use in the operation of games of chance at Wynn Macau and Wynn Palace as permitted under the Gaming Concession Contract through December 31, 2032. As the Company expects to continue to operate the casino areas and gaming equipment at its Macau Operations in the same manner as under the previous concession, obtain substantially all of the economic benefits, and bear all of the risks arising from the use of these assets, and believes it will be awarded a new concession upon the expiration of the Gaming Concession Contract, the Company will continue to recognize the casino areas and gaming equipment as property and equipment over their remaining estimated useful lives. Pursuant to the Gaming Concession Contract, Wynn Macau SA will revert to the Macau government the casino areas and gaming equipment, without compensation and free of encumbrance, upon the rescission or termination of the gaming concession on December 31, 2032. \nIn exchange for the use of casino areas and gaming equipment in the operations of games of chance at Wynn Macau and Wynn Palace under the Property Transfer Agreements, Wynn Macau SA has agreed to pay the Macau government an annual amount of MOP\n53.1\n million (approximately $\n6.6\n million) in the year ending December 31, 2023, subject to adjustment in each year based on the average price index in Macau for the years ending December 31, 2024, and 2025, and an annual amount of MOP\n177.0\n million (approximately $\n22.1\n million) in the year ending December 31, 2026, subject to adjustment annually based on the average price index in Macau for each of the remaining years of the term of the Gaming Concession Contract through December 31, 2032.\n \n78 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nNote 6 - \nGoodwill and Intangible Assets, net\nGoodwill and intangible assets, net consisted of the following (in thousands):\n December 31,\n2024\n2023\nFinite-lived intangible assets:\n     Macau gaming concession\n$\n210,630\n \n$\n209,199\n \n     Less: accumulated amortization\n(\n42,126\n)\n(\n20,920\n)\n168,504\n \n188,279\n \n     Massachusetts gaming license\n117,700\n \n117,700\n \n     Less: accumulated amortization\n(\n43,331\n)\n(\n35,484\n)\n74,369\n \n82,216\n \n     Other finite-lived intangible assets\n5,400\n \n50,154\n \n     Less: accumulated amortization\n(\n2,071\n)\n(\n17,801\n)\n3,329\n \n32,353\n \n     Total finite-lived intangible assets\n246,202\n \n302,848\n \nIndefinite-lived intangible assets:\nWater rights and other\n8,397\n \n8,397\n \n     Total indefinite-lived intangible assets\n8,397\n \n8,397\n \nGoodwill:\nBalance at beginning of year\n18,463\n \n90,520\n \nImpairment\n—\n \n(\n72,057\n)\nBalance end of period \n18,463\n \n18,463\n \nTotal goodwill and intangible assets, net\n$\n273,062\n \n$\n329,708\n \nMassachusetts Finite-Lived Intangible Assets\nThe Massachusetts gaming license is a finite-lived intangible asset that is being amortized over the \n15\n year life of the license. The Company expects that amortization of the Massachusetts gaming license will be $\n7.8\n million each year from 2025 through 2033, and $\n3.7\n million in 2034. \nWynn Interactive Goodwill and Finite-Lived Intangible Assets\nOther finite-lived intangible assets consisted of market access rights and gaming license fees. During the year ended December 31, 2024, the Company sold its market access rights and related obligations in Michigan, and pursuant to a separate  equity purchase agreement, sold WSI US, LLC, Wynn Interactive’s domestic operating subsidiary, which included the Company’s gaming license in New York. As a result of these transactions, the Company recognized a gain of $\n24.6\n million in Property charges and other expenses in the accompanying Consolidated Statements of Operations for the year ended December 31, 2024. As of December 31, 2024, the Company had no remaining goodwill or intangible assets related to Wynn Interactive.\nDuring the year ended December 31, 2023, as a result of the Company's decision to cease operating Wynn Interactive's digital sports betting and casino platform announced in August 2023, the Company identified interim indicators of impairment related to the goodwill assigned to the WynnBet reporting unit. As a result, the Company performed an impairment test and determined that the carrying value of its goodwill exceeded the estimated fair value of that reporting unit based on a \n79 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\ncombination of the income and cost approaches, causing the Company to recognize a goodwill impairment loss of $\n72.1\n million. The Company also recognized impairment of other finite-lived intangible assets related to Wynn Interactive's closed operations totaling $\n22.4\n million during the year ended December 31, 2023. \nDuring the year ended December 31, 2022, as a result of changes in forecasts and other industry-specific factors and management's decision to cease the operations of Betbull Limited, a subsidiary of Wynn Interactive, the Company recognized \nimpairment of goodwill and other finite-lived intangible assets\n of $\n37.8\n million and $\n10.3\n million, respectively.  \nMacau Gaming Concession\nOn January 1, 2023, the Company recognized an intangible asset and financial liability of MOP\n1.68\n billion (approximately $\n208.3\n million), representing the right to operate games of chance at Wynn Palace and Wynn Macau and the unconditional obligation to make payments under the Gaming Concession Contract. This intangible asset comprises the contractually obligated annual payments of fixed and variable premiums, as well as fees associated with the Property Transfer Agreements (as described in Note 5, \"Property and Equipment, net\"). The contractually obligated annual variable premium payments associated with the intangible asset were determined using the total number of gaming tables and gaming machines that Wynn Macau SA is currently approved to operate by the Macau government. In the accompanying Consolidated Balance Sheets, the noncurrent portion of the financial liability is included in \"Other long-term liabilities\" and the current portion is included in \"Other accrued liabilities.\" The intangible asset is being amortized on a straight-line basis over the \n10\n-year term of the Gaming Concession Contract. The Company expects that amortization of the Macau Gaming Concession will be $\n21.1\n million each year from 2025 to 2032.\nAs of December 31, 2024, the Company expects to pay fixed and variable premium payment amounts of $\n14.6\n million in each of the years ending December 31, 2025, 2026, 2027, 2028, and 2029, and an aggregate amount of $\n44.7\n million thereafter through December 31, 2032.\n80 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nNote 7 - \nLong-Term Debt\nLong-term debt consisted of the following (in thousands): \nDecember 31,\n2024\n2023\nMacau Related:\nWM Cayman II Revolver, due 2028\n(1)\n$\n1,151,874\n \n$\n1,497,610\n \nWML 4 7/8% Senior Notes, due 2024\n(2)\n—\n \n600,000\n \nWML 5 1/2% Senior Notes, due 2026\n1,000,000\n \n1,000,000\n \nWML 5 1/2% Senior Notes, due 2027\n750,000\n \n750,000\n \nWML 5 5/8% Senior Notes, due 2028\n1,350,000\n \n1,350,000\n \nWML 5 1/8% Senior Notes, due 2029\n1,000,000\n \n1,000,000\n \nWML 4 1/2% Convertible Bonds, due 2029\n(3)\n600,000\n \n600,000\n \nU.S. and Corporate Related:\nWRF Credit Facilities\n(4)\n:\n   WRF Term Loan, due 2024\n—\n \n73,683\n \n   WRF Term Loan, due 2027\n763,125\n \n730,692\n \nWLV 5 1/2% Senior Notes, due 2025\n(2)\n—\n \n1,380,001\n \nWLV 5 1/4% Senior Notes, due 2027\n880,000\n \n880,000\n \nWRF 5 1/8% Senior Notes, due 2029\n750,000\n \n750,000\n \nWRF 7 1/8% Senior Notes, due 2031\n1,000,000\n \n600,000\n \nWRF 6 1/4% Senior Notes, due 2033\n800,000\n \n—\n \nRetail Term Loan, due 2027\n(5)\n600,000\n \n615,000\n \n10,644,999\n \n11,826,986\n \nWML Convertible Bond Conversion Option Derivative\n33,007\n \n73,744\n \nLess: Unamortized debt issuance costs and original issue discounts and premium, net\n(\n136,272\n)\n(\n162,393\n)\n10,541,734\n \n11,738,337\n \nLess: Current portion of long-term debt\n(\n41,250\n)\n(\n709,593\n)\nTotal long-term debt, net of current portion\n$\n10,500,484\n \n$\n11,028,744\n \n(1)\nAs of December 31, 2024, the borrowings under the WM Cayman II Revolver bear interest at the term secured overnight financing rate (\"Term SOFR\") plus a credit adjustment spread of \n0.10\n% or the Hong Kong Interbank Offered Rate (\"HIBOR\"), in each case plus a margin of \n1.875\n% to \n2.875\n% per annum based on WM Cayman II’s leverage ratio on a consolidated basis. Approximately $\n239.1\n million and $\n912.8\n million of the WM Cayman II Revolver bears interest at a rate of Term SOFR plus \n1.975\n% per year and HIBOR plus \n1.875\n% per year, respectively. As of December 31, 2024 and 2023, the weighted average interest rate was approximately \n6.43\n% and \n7.20\n%, respectively. As of December 31, 2024, the available borrowing capacity under the WM Cayman II Revolver was $\n353.8\n million. \n(2)\nIn October 2024, the Company repaid or repurchased the 2024 WML Senior Notes and 2025 WLV Senior Notes. \n(3)\nAs of December 31, 2024, the net carrying amount of the WML Convertible Bonds was $\n498.4\n million, with unamortized debt discount and debt issuance costs of $\n101.6\n million. The Company recorded contractual interest expense of $\n27.0\n million and $\n22.1\n million and amortization of discounts and issuance costs of $\n18.9\n million and $\n14.2\n million during the years ended December 31, 2024 and 2023.    \n(4)\nThe WRF Credit Facilities bear interest at a rate of Term SOFR plus \n1.75\n% per year. As of December 31, 2024 and 2023, the weighted average interest rate was approximately \n6.21\n% and \n7.21\n%, respectively. Additionally, as of December 31, 2024, the available borrowing capacity under the WRF Revolver was $\n735.3\n million, net of $\n14.7\n million in outstanding letters of credit.  \n(5)\nAs of December 31, 2024, the Retail Term Loan bears interest at a rate of adjusted daily simple secured overnight financing rate (\"SOFR\") plus \n2.15\n% per year. As of December 31, 2023, the Retail Term Loan bore interest at a rate of adjusted daily SOFR plus \n1.80\n% per year. As of December 31, 2024 and 2023, the effective interest rate was \n5.54\n% and \n5.47\n%, respectively.\n \n81 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nMacau Related Debt \nWM Cayman II Revolver\nIn September 2021, WM Cayman Holdings Limited II, an indirect wholly owned subsidiary of WML, as borrower (\"WM Cayman II\") and WML as guarantor, each an indirect subsidiary of Wynn Resorts, entered into a facility agreement with, among others, Bank of China Limited, Macau Branch as agent and a syndicate of lenders (the \"Facility Agreement\"), pursuant to which the lenders will make available in an aggregate amount of $\n1.50\n billion equivalent revolving unsecured credit facility consisting of a U.S. dollar tranche in an amount of $\n312.5\n million (\"Facility A\") and a Hong Kong dollar tranche (\"Facility B\") in an amount of HK$\n9.26\n billion (approximately $\n1.19\n billion) to WM Cayman II (the \"WM Cayman II Revolver\"). WM Cayman II has the ability to upsize the total WM Cayman II Revolver by an additional $\n1.00\n billion equivalent under the Facility Agreement and related agreements upon the satisfaction of various conditions. \nWML\n, as guarantor, may be subject to certain restrictions on payments of dividends or distributions to its shareholders, unless certain financial criteria have been satisfied through the Facility Agreement.\nPursuant to the Facility Agreement, as amended in May 2022 and as amended and restated in June 2023 (the \"Amended and Restated Facility Agreement\"), loans provided under Facility A bear interest at a variable rate per annum equal to: (a) Term SOFR, plus a credit adjustment spread of \n0.10\n% (subject to a minimum floor of \n0.00\n%), plus (b) a margin of \n1.875\n% to \n2.875\n% based on the consolidated leverage ratio of WM Cayman II and its subsidiaries (as calculated pursuant to the Amended and Restated Facility Agreement), and loans provided under Facility B bear interest at a variable rate per annum equal to: (i) HIBOR plus (ii) a margin of \n1.875\n% to \n2.875\n% based on the consolidated leverage ratio of WM Cayman II and its subsidiaries (as calculated pursuant to the Amended and Restated Facility Agreement).\nIn September 2024, WM Cayman II, as borrower and WML, as guarantor, entered into an amendment agreement (the \"Second Amendment Agreement\") to the Amended and Restated Facility Agreement, to extend the maturity date of the outstanding loans from September 16, 2025 to September 16, 2028, or the immediately preceding business day if September 16, 2028 is not a business day. In connection with the Second Amendment Agreement, the Company recorded debt issuance costs of $\n19.2\n million within the Consolidated Balance Sheet.\nWML Convertible Bonds\nIn March 2023, WML completed an offering of $\n600\n million \n4.50\n% convertible bonds due 2029 (the \"WML Convertible Bonds\"). The WML Convertible Bonds are governed by a trust deed dated March 7, 2023 (the \"Trust Deed\"), between WML and DB Trustees (Hong Kong) Limited, as trustee. WML, DB Trustees (Hong Kong) Limited, as trustee, and Deutsche Bank Trust Company Americas entered into an agency agreement, appointing Deutsche Bank Trust Company Americas as the principal paying agent, principal conversion agent, transfer agent and registrar in relation to the WML Convertible Bonds. \nThe WML Convertible Bonds bear interest on their outstanding principal amount from and including March 7, 2023 at the rate of \n4.50\n% per annum, payable semi-annually in arrears on March 7 and September 7 of each year. At any time on or after April 17, 2023, the WML Convertible Bonds are convertible at the option of the holder thereof into fully paid ordinary shares of WML, each with a nominal value of HK$\n0.001\n per share (\"Ordinary Shares\"), at the initial conversion price of approximately HK$\n10.24\n (equivalent to approximately $\n1.32\n) per share, subject to and upon compliance with the terms and conditions of the WML Convertible Bonds (the \"Terms and Conditions,\" and such right, the \"Conversion Right\"). The conversion price is at the fixed exchange rate of HK$\n7.8497\n per $1.00, subject to standard adjustments for certain dilutive events as described in the Terms and Conditions. WML has the option upon conversion by a bondholder to pay an amount of cash equivalent described in the Terms and Conditions in order to satisfy such Conversion Right in whole or in part. As of December 31, 2024, the adjusted conversion price was HK$\n10.01\n (equivalent to approximately $\n1.29\n) per share as a result of dividend payments made by WML during the year ended December 31, 2024.  \nHolders of the WML Convertible Bonds have the option to require WML to redeem all or some of such holder’s WML Convertible Bonds (i) on March 7, 2027 at their principal amount together with interest accrued but unpaid to, but excluding, the date fixed for redemption; or (ii) on the Relevant Event Redemption Date (as defined in the Terms and Conditions) at their principal amount together with interest accrued but unpaid to, but excluding, such date, following the occurrence of (a) when the Ordinary Shares cease to be listed or admitted to trading or are suspended from trading for a period equal to or exceeding 10 consecutive trading days on the Stock Exchange of Hong Kong Limited (\"HKSE\"), or if applicable, the alternative stock exchange, (b) when there is a Change of Control (as defined in the Terms and Conditions), or (c) when less than 25% of \n82 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nWML’s total number of issued Ordinary Shares are held by the public (as interpreted under Rule 8.24 of the Rules Governing the Listing of Securities on the HKSE).\nThe WML Convertible Bonds may also be redeemed at the option of WML under certain circumstances specified in the Terms and Conditions, in whole, but not in part, at any time after March 7, 2027, but prior to March 7, 2029, upon giving notice to the bondholders in accordance with the Terms and Conditions. The WML Convertible Bonds constitute direct, unsubordinated, unconditional and, subject to the Terms and Conditions, unsecured obligations of WML and rank pari passu and without any preference or priority among themselves. The Ordinary Shares to be issued upon exercise of Conversion Right will be fully-paid and will in all respects rank pari passu with the fully-paid Ordinary Shares in issue on the relevant registration date set forth in the Terms and Conditions. \nThe Trust Deed contains covenants limiting WML's and all of its subsidiaries' ability to, among other things, create, permit to subsist or arise or have outstanding any mortgage, charge, pledge, lien or other encumbrance or certain security interest; consolidate or merge with or into another company; and sell, assign, transfer, convey or otherwise dispose of all or substantially all of its and its subsidiaries’ properties or assets, with certain exceptions. The Trust Deed also contains customary events of default.\nThe Company determined that the conversion feature contained within the WML Convertible Bonds is required to be bifurcated from the debt host contract and accounted for as a free-standing derivative (the \"WML Convertible Bond Conversion Option Derivative\") recorded within Long-term debt within the accompanying Consolidated Balance Sheet. In accordance with applicable accounting standards, the WML Convertible Bond Conversion Option Derivative is reported at fair value as of the end of each reporting period, with changes recognized in the statements of operations. For more information, see \"Note 8 - WML Convertible Bond Conversion Option Derivative.\"\nWML Senior Notes \nWML 5 1/2% Senior Notes due 2026, WML 5 1/2% Senior Notes due 2027, WML 5 5/8% Senior Notes due 2028, and WML 5 1/8% Senior Notes due 2029 (collectively, the \"WML Senior Notes\") bear interest at each of their respective interest rates and interest is payable semi-annually. The WML Senior Notes are WML's general unsecured obligations and rank pari passu in right of payment with all of WML's existing and future senior unsecured indebtedness, will rank senior to all of WML's future subordinated indebtedness, if any; will be effectively subordinated to all of WML's future secured indebtedness to the extent of the value of the assets securing such debt; and will be structurally subordinated to all existing and future obligations of WML's subsidiaries, including the WM Cayman II Revolver. The WML Senior Notes are not registered under the Securities Act of 1933, as amended (the \"Securities Act\") and are subject to restrictions on transferability and resale. \nThe WML Senior Notes were issued pursuant to indentures between WML and Deutsche Bank Trust Company Americas, as trustee (the \"WML Senior Notes Indentures\"). The WML Senior Notes Indentures contain covenants limiting WML’s (and certain of its subsidiaries’) ability to, among other things: merge or consolidate with another company; transfer or sell all or substantially all of its properties or assets; and lease all or substantially all of its properties or assets. The WML Senior Notes Indentures also contain customary events of default. In the case of an event of default arising from certain events of bankruptcy or insolvency, all WML Senior Notes then outstanding will become due and payable immediately without further action or notice.\nUpon the occurrence of (a) any event after which none of WML or any subsidiary of WML has the applicable gaming concessions or authorizations in Macau in substantially the same manner and scope as WML and its subsidiaries are entitled to at the date on which each of the WML Senior Notes are issued, for a period of \n10\n consecutive days or more, and such event has a material adverse effect on WML and its subsidiaries, taken as a whole; or (b) the termination or modification of any such concessions or authorizations which has a material adverse effect on WML and its subsidiaries, taken as a whole, each holder of the WML Senior Notes will have the right to require WML to repurchase all or any part of such holder’s WML Senior Notes at a purchase price in cash equal to \n100\n% of the principal amount thereof, plus accrued and unpaid interest. \nIf WML undergoes a Change of Control (as defined in the WML Senior Notes Indentures), it must offer to repurchase the WML Senior Notes at a price equal to \n101\n% of the aggregate principal amount thereof, plus accrued and unpaid interest.\nIn October 2024, WML repaid the $\n600.0\n million aggregate principal amount of WML's 4 7/8% Senior Notes due 2024 on their stated maturity date. \n83 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nU.S. and Corporate Related Debt\nWRF Credit Facilities\nDuring 2019, WRF entered into a credit agreement (the \"WRF Credit Agreement\") providing for a first lien term loan facility in an aggregate principal amount of $\n1.00\n billion (the \"WRF Term Loan\") and a first lien revolving credit facility in an aggregate principal amount of $\n850.0\n million (the \"WRF Revolver\" and together with the WRF Term Loan, the \"WRF Credit Facilities\").   \nIn May 2023, WRF and certain of its subsidiaries entered into an amendment to the WRF Credit Facility Agreement to: (i) transition the benchmark rate from LIBOR to Term SOFR and to make conforming changes, (ii) reduce the aggregate principal amount of revolving commitments under the revolving credit facility by $\n100.0\n million, from $\n850.0\n million to $\n750.0\n million, (iii) extend the stated maturity date for lenders electing to extend their revolving commitments in an amount equal to approximately $\n681.3\n million from September 20, 2024 to September 20, 2027, and (iv) extend the stated maturity date for lenders electing to extend their term loan commitments in an amount equal to approximately $\n749.4\n million from September 20, 2024 to September 20, 2027. Lenders who elected not to extend their revolving commitments in an amount equal to approximately $\n68.7\n million remained subject to a stated maturity date of September 20, 2024, and lenders who elected not to extend their term loan commitments in an amount equal to approximately $\n75.6\n million remained subject to a stated maturity date of September 20, 2024. \nSubject to certain exceptions, the WRF Credit Facilities bear interest at Term SOFR plus \n1.75\n% per annum. The annual fee required to pay for unborrowed amounts under the WRF Revolver, if any, is \n0.25\n% per annum. The Company is required to make quarterly repayments on the WRF Term Loan of $\n10.3\n million, with any remaining principal amount outstanding repayable in full on the term loan's respective stated maturity date.\nIn September 2024, WRF and certain of its subsidiaries entered into an amendment (the \"WRF Credit Facility Amendment\") to its existing credit agreement to extend the stated maturity of $\n68.7\n million aggregate principal amount of revolving commitments and $\n71.8\n million aggregate principal of term loan commitments from September 20, 2024 to September 20, 2027. In connection with the 2024 WRF Credit Facility Amendment, the Company recognized a loss on debt financing transactions of $\n0.1\n million within the accompanying Consolidated Statement of Operations, and the Company recorded debt issuance costs of $\n0.5\n million within the Consolidated Balance Sheet.\nThe WRF Credit Agreement contains customary representations and warranties, events of default and negative and affirmative covenants, including, but not limited to, covenants that restrict our ability to pay dividends or distributions to any direct or indirect subsidiaries, to incur and/or repay indebtedness, to make certain restricted payments, and to enter into mergers and acquisitions, negative pledges, liens, transactions with affiliates, and sales of assets. In addition, WRF is subject to financial covenants, including maintaining a Consolidated First Lien Net Leverage Ratio, as defined in the WRF Credit Agreement. The Consolidated Senior Secured Net Leverage Ratio is not to exceed \n3.75\n to 1.00. \nThe WRF Credit Facilities are guaranteed by each of WRF's existing and future wholly owned domestic restricted subsidiaries (the \"Guarantors\"), subject to certain exceptions, and are secured by a first priority lien on substantially all of WRF's and each of the guarantors' existing and future property and assets, subject to certain exceptions, including a limitation on the amount of collateral granted by Wynn Las Vegas, LLC (\"WLV\") and its subsidiaries so as to not violate the indenture governing WLV's outstanding senior notes.\nWRF Senior Notes\nIn April 2020, WRF and its subsidiary Wynn Resorts Capital Corp. (collectively with WRF, the \"WRF Issuers\"), each an indirect wholly owned subsidiary of the Company, issued $\n750.0\n million aggregate principal amount of 5 1/8% Senior Notes due 2029 (the \"2029 WRF Senior Notes\"). \nIn February 2023, the WRF Issuers issued $\n600.0\n million aggregate principal amount of 7 1/8% Senior Notes due 2031 (the \"2031 WRF Senior Notes\") in a private offering. The 2031 WRF Senior Notes were issued at par, for net proceeds of $\n596.2\n million, which were used to repurchase WRF senior notes outstanding at that time.\n84 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nIn February 2024, the WRF Issuers issued an additional $\n400.0\n million aggregate principal amount of 7 1/8% Senior Notes due 2031 (the \"2031 WRF Add-On Senior Notes\"), and collectively with the 7 1/8% Senior Notes due 2031 (the \"2031 WRF Senior Notes\"). The 2031 WRF Add-On Senior Notes were issued at a price equal to \n103.00\n% of the principal amount plus accrued interest, resulting in net proceeds of $\n409.5\n million. The net proceeds from the 2031 WRF Add-On Senior Notes, together with cash held by Wynn Resorts, were used to repurchase an aggregate $\n796.7\n million of the outstanding principal amount of the 2025 WLV Senior Notes (as defined below) and to pay the applicable tender premium and related fees and expenses. In connection with the issuance of the 2031 WRF Add-On Senior Notes and the repurchase of the 2025 WLV Senior Notes in February and March 2024 (as further discussed below), the Company recognized a loss on debt financing transactions of $\n1.6\n million within the accompanying Consolidated Statements of Operations, and the Company recorded debt issuance costs of $\n5.6\n million within the accompanying Consolidated Balance Sheet.\nIn September 2024, the WRF Issuers issued $\n800.0\n million aggregate principal amount of 6 1/4% Senior Notes due 2033 (the \"2033 WRF Senior Notes\") in a private offering exempt from the registration requirements of the Securities Act, as amended. The 2033 WRF Senior Notes were issued at par, for proceeds of $\n795.0\n million, net of $\n5.0\n million of related fees and expenses. A portion of the proceeds from the offering of the 2033 WRF Senior Notes was used in October 2024 to repurchase the remaining outstanding principal amount of the 2025 WLV Senior Notes (as defined below) in full. In connection with the issuance of the 2033 WRF Senior Notes and the repurchase of the 2025 WLV Senior Notes in October 2024 (as further discussed below), the Company recognized a loss on debt financing transactions of $\n1.1\n million within the accompanying Consolidated Statements of Operations, and the Company recorded debt issuance costs of $\n8.2\n million within the accompanying Consolidated Balance Sheet.\nThe 2029 WRF Senior Notes, the 2031 WRF Senior Notes and the 2033 WRF Senior Notes (collectively the \"WRF Senior Notes\") were issued pursuant to indentures (the \"WRF Indentures\") among the WRF Issuers, the Guarantors party thereto, and U.S. Bank National Association, as trustee (the \"Trustee\"). The WRF Senior Notes bear interest at each of their respective interest rates and interest is payable semi-annually.\nThe WRF Senior Notes are the WRF Issuers' senior unsecured obligations and rank pari passu in right of payment with the WLV Senior Notes (as defined below), and rank equally in right of payment with Wynn Las Vegas' guarantee of the WRF Credit Facilities, and rank senior in right of payment to all of the WRF Issuers' existing and future subordinated debt. The WRF Senior Notes are effectively subordinated in right of payment to all of the WRF Issuers' existing and future secured debt (to the extent of the value of the collateral securing such debt), and structurally subordinated to all of the liabilities of any of the WRF Issuers' subsidiaries that do not guarantee the WRF Senior Notes, including WML and its subsidiaries.\nThe WRF Senior Notes are jointly and severally guaranteed by each of WRF's existing domestic restricted subsidiaries that guarantee indebtedness under the WRF Credit Agreement, including Wynn Las Vegas, LLC and each of its subsidiaries that guarantees the WLV Senior Notes. The guarantees are senior unsecured obligations of the Guarantors and rank senior in right of payment to all of their future subordinated debt. The guarantees rank equally in right of payment with all existing and future liabilities of the Guarantors that are not so subordinated and will be effectively subordinated in right of payment to all of such Guarantors' existing and future secured debt (to the extent of the collateral securing such debt).\nThe WRF Indentures contains covenants that limit the ability of the WRF Issuers and the Guarantors to, among other things, enter into sale-leaseback transactions, create or incur liens to secure debt, and merge, consolidate or sell all or substantially all of the WRF Issuers' assets. These covenants are subject to exceptions and qualifications set forth in the WRF Indentures. The WRF Indentures also contain customary events of default, including, but not limited to, failure to make required payments, failure to comply with certain covenants, certain events of bankruptcy and insolvency, and failure to pay certain judgments. \nThe WRF Senior Notes were offered only to qualified institutional buyers in reliance on Rule 144A under the Securities Act. The WRF Senior Notes have not been and will not be registered under the Securities Act or under any state securities laws. Therefore, the WRF Senior Notes may not be offered or sold within the United States to, or for the account or benefit of, any United States person unless the offer or sale would qualify for a registration exemption from the Securities Act and applicable state securities laws.\nWLV Senior Notes\nWynn Las Vegas, LLC and Wynn Las Vegas Capital Corp. (\"Capital Corp.\" and together with Wynn Las Vegas, LLC, the \"Issuers\") issued $\n1.80\n billion 5 1/2% Senior Notes due 2025 (the \"2025 WLV Senior Notes\"), and $\n900.0\n million 5 1/4% \n85 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nSenior Notes due 2027 (the 2027 WLV Senior Notes) pursuant to indentures, dated February 18, 2015 (the \"2025 Indenture\"), and May 11, 2017 (the \"2027 Indenture\"), respectively, among the Issuers, the WLV Guarantors (as defined below) and the Trustee. \nIn February and March 2024, Wynn Las Vegas repurchased $\n800.0\n million aggregate principal amount of 2025 WLV Senior Notes, which consisted of i) $\n681.0\n million aggregate principal amount of validly tendered notes repurchased at a price equal to \n97.2\n% of the principal amount, plus accrued interest and an early tender premium of $\n20.3\n million, and ii) $\n119.0\n million aggregate principal amount of notes repurchased on a pro-rata basis at a price equal to \n100\n% of the principal amount, plus accrued interest, under the terms of its indenture. Included in the $\n119.0\n million repurchase was $\n3.3\n million aggregate principal amount of 2025 WLV Senior Notes held by Wynn Resorts. The Company used the net proceeds from the 2031 WRF Add-On Senior Notes and cash held by WRF to purchase such validly tendered 2025 WLV Senior Notes and to pay the early tender premium and related fees and expenses. \nIn October 2024, Wynn Las Vegas repurchased the remaining $\n600.0\n million aggregate principal amount of its 2025 WLV Senior Notes at a price equal to \n100.0\n% of the principal amount, plus a \"make-whole\" amount and accrued interest, under the terms of its indenture. Included in the $\n600.0\n million repurchase was $\n16.7\n million aggregate principal amount of 2025 WLV Senior Notes held by Wynn Resorts. \nIn 2018, Wynn Resorts purchased $\n20.0\n million principal amount of 2027 WLV Senior Notes through open market purchases. As of December 31, 2024, Wynn Resorts holds the 2027 WLV Senior Notes and has not contributed it to its wholly owned subsidiary, WLV.\nThe 2027 WLV Senior Notes are the WLV Issuers' senior unsecured obligations and each rank pari passu in right of payment. The 2027 WLV Senior Notes are unsecured, except by the first priority pledge by Wynn Las Vegas Holdings, LLC (\"WLVH\"), a direct wholly owned subsidiary of Wynn Resorts Finance, LLC, of its equity interests in Wynn Las Vegas, LLC. If Wynn Resorts receives an investment grade rating from one or more ratings agencies, the first priority pledge securing the 2027 WLV Senior Notes will be released.\nThe 2027 WLV Senior Notes are jointly and severally guaranteed by all of the WLV Issuers' subsidiaries, other than Capital Corp., which was a co-issuer (the \"WLV Guarantors\"). The guarantees are senior unsecured obligations of the WLV Guarantors and rank senior in right of payment to all of their existing and future subordinated debt. The guarantees rank equally in right of payment with all existing and future liabilities of the WLV Guarantors that are not so subordinated and will be effectively subordinated in right of payment to all of such WLV Guarantors' existing and future secured debt (to the extent of the collateral securing such debt).\nThe 2027 Indenture contains covenants limiting the WLV Issuers' and the WLV Guarantors' ability to create liens on assets to secure debt; enter into sale-leaseback transactions; and merge or consolidate with another company. These covenants are subject to a number of important and significant limitations, qualifications and exceptions. Events of default under the 2027 Indenture includes, among others, the following: default for \n30\n days in the payment of interest when due on the 2027 WLV Senior Notes; default in payment of the principal or premium, if any, when due on the 2027 WLV Senior Notes; failure to comply with certain covenants in the 2027 Indenture; and certain events of bankruptcy or insolvency. In the case of an event of default arising from certain events of bankruptcy or insolvency with respect to the Issuers or any WLV Guarantor, all 2027 WLV Senior Notes then outstanding will become due and payable immediately without further action or notice.\nThe Issuers and certain of their subsidiaries will guarantee and secure their obligation under the WRF Credit Facilities with liens on substantially all of their assets, with such liens limiting the amount of such obligations secured to \n15\n% of their total assets.\nThe 2027 WLV Senior Notes were offered pursuant to an exemption under the Securities Act only to qualified institutional buyers in reliance on Rule 144A under the Securities Act. The 2027 WLV Senior Notes have not been and will not be registered under the Securities Act or under any state securities laws. Therefore, the 2027 WLV Senior Notes may not be offered or sold within the United States to, or for the account or benefit of, any United States person unless the offer or sale would qualify for a registration exemption from the Securities Act and applicable state securities laws.\n86 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nRetail Term Loan \nIn 2018, Wynn/CA Plaza Property Owner, LLC and Wynn/CA Property Owner, LLC (collectively, the \"Retail Borrowers\"), subsidiaries of the Retail Joint Venture, entered into a term loan agreement (together with its subsequent amendments, the \"Retail Term Loan Agreement\"). On June 2, 2023, the Borrowers entered into an amendment effective as of July 3, 2023, which amended the Retail Term Loan Agreement to transition the benchmark interest rate applicable to the secured loan in an aggregate principal amount of $\n615.0\n million issued to the Borrowers thereunder from LIBOR to SOFR and to make related conforming changes to the Retail Term Loan Agreement. The Retail Term Loan Agreement provides for a term loan facility to the Retail Borrowers of $\n615.0\n million (the \"Retail Term Loan\"). The Retail Term Loan is secured by substantially all of the assets of the Retail Borrowers. The Retail Borrowers distributed approximately $\n589\n million of the net proceeds of the Retail Term Loan to their members on a proportionate basis to each member's ownership percentage. The Retail Borrowers may prepay the Retail Term Loan, in whole or in part, at any time with no premium above the principal amount.\nIn accordance with the terms of the Retail Term Loan Agreement, the Retail Borrowers entered into an interest rate collar with a notional value of $\n615.0\n million and a termination date of August 1, 2024, the underlying reference rate of which was transitioned from LIBOR to SOFR concurrently with the Retail Term Loan. The Company measured the fair value of the interest rate collar based on a Black-Scholes option pricing model, which incorporates observable market inputs such as market volatility and interest rates, with changes in fair value recorded in earnings. As of December 31, 2023, the fair value of the interest rate collar was an asset of $\n5.8\n million, recorded in Prepaid expenses and other in the accompanying Consolidated Balance Sheets. \nIn October 2024, the Retail Borrowers entered into a third amendment (the \"Retail Term Loan Amendment\") to their existing term loan agreement. The Retail Term Loan Amendment, amends the Retail Term Loan Agreement to, among other things: (i) extend the scheduled maturity date of the term loan to July 24, 2027; (ii) provide for an interest rate on the term loan equal to One Month Term SOFR (as defined in, and determined in accordance with, the Retail Term Loan Agreement) plus a spread of \n215\n basis points; and (iii) require that the Retail Borrowers meet a specified maximum loan to value ratio annually (which, if not met, triggers a mandatory excess cash sweep until such ratio has been achieved) as well as certain specified minimum debt yields. In connection with, and as provided under, the Retail Term Loan Amendment, the Retail Borrowers made a principal prepayment of the term loan in the amount of $\n15.0\n million. In connection with the Retail Term Loan Amendment, the Company recognized a loss on debt financing transaction of $\n0.1\n million within the accompanying Consolidated Statements of Operations, and the Company recorded debt issuance costs of $\n2.4\n million within the accompanying Consolidated Balance Sheet. \nIn accordance with the terms of the Retail Term Loan Amendment, the Retail Borrowers entered into an interest rate swap agreement in October 2024 with a notional value of $\n600.0\n million. The interest rate swap effectively fixes the variable component of the interest rate on the Retail Term Loan at \n3.385\n% whereby the Retail Borrowers will pay the counterparty \n3.385\n% and the counterparty will pay the Retail Borrowers one-month SOFR. The interest rate swap settles monthly through the termination date in February 2027. The Company measures the fair value of the interest rate swap at each balance sheet date based on a discounting the future cash flows of both the fixed and variable rate interest payments based on market yield curves, with changes in fair value recorded in earnings. As of December 31, 2024, the fair value of the interest rate swap was an asset of $\n7.5\n million, of which $\n3.9\n million was recorded in Prepaid expenses and other and $\n3.6\n million was recorded in Other assets in the accompanying Consolidated Balance Sheets. \nThe Retail Term Loan Agreement contains customary representations and warranties, events of default and affirmative and negative covenants for debt facilities of this type, including, among other things, limitations on leasing matters, incurrence of indebtedness, distributions and transactions with affiliates. The Retail Term Loan Agreement also provides for customary sweeps of the Retail Borrowers' excess cash in the event of a default or in the event the Retail Borrowers fail to maintain certain financial ratios as defined in the Retail Term Loan Agreement. In addition, the Company will indemnify the lenders under the Retail Term Loan and be liable, in each case, for certain customary environmental and non-recourse carve out matters pursuant to a hazardous materials indemnity agreement and a recourse indemnity agreement, each entered into concurrently with the execution of the Retail Term Loan Agreement. \nDebt Covenant Compliance \nAs of December 31, 2024, management believes the Company was in compliance with all debt covenants.\n87 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nScheduled Maturities of Long-Term Debt\nScheduled maturities of long-term debt as of December 31, 2024 were as follows (in thousands):\nYears Ending December 31,\n2025\n$\n41,250\n \n2026\n1,041,250\n \n2027\n2,910,625\n \n2028\n2,501,874\n \n2029\n2,350,000\n \nThereafter\n1,800,000\n \n10,644,999\n \nWML Convertible Bond Conversion Option Derivative\n33,007\n \nUnamortized debt issuance costs and original issue discounts and premium, net\n(\n136,272\n)\n$\n10,541,734\n \nFair Value of Long-Term Debt\nThe estimated fair value of the Company's long-term debt as of December 31, 2024 and 2023, was approximately $\n10.46\n billion and $\n11.49\n billion, respectively, compared to its carrying value, excluding debt issuance costs and original issue discount and premium, of $\n10.64\n billion, and $\n11.83\n billion, respectively. The estimated fair value of the Company's long-term debt is based on recent trades, if available, and indicative pricing from market information (Level 2 inputs).\nNote 8 - WML Convertible Bond Conversion Option Derivative\nAn embedded derivative is a feature contained within a contract that affects some or all of the cash flows or the value of other exchanges required by the contract in a manner similar to a derivative instrument. Embedded derivatives are required to be bifurcated and accounted for separately from the host contract and carried at fair value when: (a) the embedded derivative possesses economic characteristics that are not clearly and closely related to the economic characteristics of the host contract; and (b) a separate, freestanding instrument with the same terms would qualify as a derivative instrument. The Company determined that the conversion feature contained within the WML Convertible Bonds is not indexed to WML's equity and, as such, is required to be bifurcated from the debt host contract and accounted for as a free-standing derivative. In accordance with applicable accounting standards, the WML Convertible Bond Conversion Option Derivative will be reported at fair value as of the end of each reporting period, with changes recognized in the statements of operations.\nThe Company used a binomial lattice model in order to estimate the fair value of the embedded derivative in the WML Convertible Bonds. Inherent in a binomial options pricing model are unobservable (Level 3) inputs and assumptions related to expected share-price volatility, risk-free interest rate, expected term, and dividend yield. The Company estimates the volatility of shares of WML common stock based on historical volatility that matches the expected remaining term to maturity of the WML Convertible Bonds. The risk-free interest rate is based on the Hong Kong and United States benchmark yield curves on the valuation date for a maturity similar to the expected remaining term of the WML Convertible Bonds. The expected life of the WML Convertible Bonds is assumed to be equivalent to their remaining term to maturity. Dividend yield is assumed to be zero due to a dividend protection feature in the WML Convertible Bond Agreement.\nThe following table sets forth the inputs to the lattice models that were used to value the embedded derivative:\n88 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nDecember 31, 2024\nDecember 31, 2023\nWML stock price\nHK$\n5.39\n \nHK$\n6.43\n \nEstimated volatility\n31.2\n \n%\n34.0\n \n%\nRisk-free interest rate\n3.6\n \n%\n3.3\n \n%\nExpected term (years)\n4.2\n5.2\nDividend yield \n(1)\n0.0\n \n%\n0.0\n \n%\n(1) Dividend yield is assumed to be zero in the lattice model used to value the WML Convertible Bond Conversion Option Derivative, due to a dividend protection feature in the WML Convertible Bond Agreement. \nIn connection with the completion of the offering of the WML Convertible Bonds in March 2023, the Company recognized a debt discount and a corresponding liability for the embedded derivative, based on an estimated fair value of $\n123.5\n million. The debt discount will be amortized to interest expense over the term of the WML Convertible Bonds using the effective interest method. As of December 31, 2024 and 2023, the estimated fair value of the embedded derivative was a liability of $\n33.0\n million and $\n73.7\n million, recorded within \nLong-term debt\n within the accompanying Consolidated Balance Sheet. In connection with the change in fair value, the Company recorded a gain of $\n40.7\n million and $\n49.7\n million within Change in derivatives fair value in the accompanying Consolidated Statements of Operations for the years ended December 31, 2024 and 2023.\nNote 9 - \nStockholders' Deficit\nEquity Repurchase Program\nIn November 2024, the Company’s Board of Directors authorized the Company to repurchase a total of up to $\n1.0\n billion of the Company’s outstanding shares of common stock, increasing the previously available repurchase authorization by approximately $\n766.0\n million. The equity repurchase program authorizes discretionary repurchases by the Company from time to time through open market purchases, including pursuant to plans designed to comply with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended, privately negotiated transactions, accelerated share repurchases, or block trades, subject to market conditions, applicable legal requirements and other factors. The repurchase authorization has no expiration date, and the equity repurchase program may be suspended, discontinued or accelerated at any time.\nDuring the year ended December 31, 2024, the Company repurchased \n4,349,779\n shares of its common stock at an average price of $\n88.75\n per share for an aggregate cost of $\n386.0\n million under the equity repurchase program. During the year ended December 31, 2023, the Company repurchased \n2,206,573\n shares of its common stock at an average price of $\n88.61\n per share for an aggregate cost of $\n195.5\n million under the equity repurchase program. As of December 31, 2024, the Company had $\n813.0\n million in repurchase authority remaining under the program.\nDividends \nThe Company paid a cash dividend of $\n0.25\n per share in each of the quarters ended March 31, 2024, June 30, 2024, September 30, 2024 and December 31, 2024 and recorded an aggregate amount of $\n111.1\n million against accumulated deficit in the year ended December 31, 2024.\nThe Company paid a cash dividend of $\n0.25\n per share in each of the quarters ended June 30, 2023, September 30, 2023 and December 31, 2023 and recorded an aggregate amount of $\n85.1\n million against accumulated deficit in the year ended December 31, 2023. No dividends were paid during the year ended December 31, 2022. \nOn February 13, 2025, the Company declared a cash dividend of $\n0.25\n per share, payable on March 5, 2025 to stockholders of record as of February 24, 2025.\nNoncontrolling Interests \nWynn Macau, Limited\nWML's ordinary shares of common stock are listed on The Stock Exchange of Hong Kong Limited. As of December 31, 2024, the Company owned approximately \n72\n% of this subsidiary's common stock. The shares of WML were not and will not be \n89 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nregistered under the Securities Act and may not be offered or sold in the United States absent a registration under the Securities Act, or an applicable exception from such registration requirements. \nIn June 2024 and September 2024, WML paid a cash dividend of HK$\n0.075\n per share for a total U.S. dollar equivalent of approximately $\n50.4\n million and $\n50.5\n million, respectively. The Company's share of these dividends were $\n36.0\n million and $\n36.1\n million, respectively, and the noncontrolling interest holders' share of this dividend was $\n14.4\n million in each of the quarters ended June 30, 2024 and September 30, 2024.\nWML Securities Lending Agreement\nIn connection with the WML Convertible Bonds Offering, WM Cayman Holdings I Limited (\"WM Cayman I\"), a wholly owned subsidiary of the Company and holder of our approximate \n72\n% ownership interest in WML, entered into a stock borrowing and lending agreement with Goldman Sachs International (the \"WML Stock Borrower\") in March 2023 (the \"Securities Lending Agreement\"), pursuant to which WM Cayman I has agreed to lend to the WML Stock Borrower up to \n459,774,985\n of its ordinary share holdings in WML, upon and subject to the terms and conditions in the Securities Lending Agreement. WM Cayman I may, at its sole discretion, terminate any stock loan by giving the WML Stock Borrower no less than five business days' notice. The Securities Lending Agreement terminates on the date on which the WML Convertible Bonds have been redeemed, or converted in full, whichever is the earlier. In March 2023, the WML Stock Borrower borrowed \n459,774,985\n ordinary shares of WML under the Securities Lending Agreement and in April 2023 returned \n280,000,000\n of such shares to WM Cayman I. As of the date of this report, the WML Stock Borrower held \n179,774,985\n WML shares under the Securities Lending Agreement.\nRetail Joint Venture\nDuring the years ended December 31, 2024, 2023 and 2022, the Retail Joint Venture made aggregate distributions of $\n17.0\n million, $\n22.6\n million and $\n27.7\n million, respectively, to its non-controlling interest holder. For more information on the Retail Joint Venture, see Note 19, \"Retail Joint Venture.\"\n \n90 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nNote 10 - \nFair Value Measurements\nThe following tables present assets and liabilities carried at fair value (in thousands):\nFair Value Measurements Using:\nDecember 31, 2024\nQuoted\nMarket\nPrices in\nActive\nMarkets\n(Level 1)\nOther\nObservable\nInputs\n(Level 2)\nUnobservable\nInputs\n(Level 3)\nAssets:\nCash equivalents\n$\n787,004\n \n$\n—\n \n$\n787,004\n \n$\n—\n \nRestricted cash\n$\n95,638\n \n$\n6,434\n \n$\n89,204\n \n$\n—\n \nInterest rate swap\n$\n7,510\n \n$\n—\n \n$\n7,510\n \n$\n—\n \nLiabilities:\nWML Convertible Bond Conversion Option Derivative (see Note 8)\n$\n33,007\n \n$\n—\n \n$\n—\n \n$\n33,007\n \nFair Value Measurements Using:\nDecember 31, 2023\nQuoted\nMarket\nPrices in\nActive\nMarkets\n(Level 1)\nOther\nObservable\nInputs\n(Level 2)\nUnobservable\nInputs\n(Level 3)\nAssets:\nCash equivalents\n$\n1,802,712\n \n$\n—\n \n$\n1,802,712\n \n$\n—\n \nRestricted cash\n$\n90,226\n \n$\n2,170\n \n$\n88,056\n \n$\n—\n \nFixed deposits\n$\n550,000\n \n$\n—\n \n$\n550,000\n \n$\n—\n \nInterest rate collar\n$\n5,769\n \n$\n—\n \n$\n5,769\n \n$\n—\n \nLiabilities:\nWML Convertible Bond Conversion Option Derivative (see Note 8)\n$\n73,744\n \n$\n—\n \n$\n—\n \n$\n73,744\n \nNote 11 - \nBenefit Plans\nDefined Contribution Plans\nThe Company established a retirement savings plan under Section 401(k) of the Internal Revenue Code covering its U.S. non-union employees in July 2000. The plan allows employees to defer, within prescribed limits, a percentage of their income through contributions to this plan. The Company matches \n50\n% of employee contributions, up to \n6\n% of employees' eligible compensation. During the years ended December 31, 2024, 2023 and 2022, the Company recorded matching contribution expenses of $\n9.6\n million, $\n10.2\n million, and $\n8.7\n million, respectively.\n91 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nWynn Macau SA also operates a defined contribution retirement benefit plan (the \"Wynn Macau Plan\"). Eligible employees are allowed to contribute \n5\n% of their base salary to the Wynn Macau Plan and the Company matches any contributions. On July 1, 2019, the Company offered the option for the eligible Macau resident employees to join the non-mandatory central provident fund (the \"CPF\") system. Eligible Macau resident employees joining the Company from July 1, 2019 onwards have the option of enrolling in the CPF system while the Company's existing Macau resident employees who are currently members of the Wynn Macau Plan will be provided with the option of joining the CPF system or staying in the existing Wynn Macau Plan, which will continue to be in effect in parallel. The CPF system allows eligible employees to contribute \n5\n% or more of their base salary to the CPF while the Company matches with a \n5\n% of such salary as employer's contribution to the CPF. The Company's matching contributions vest to the employee at \n10\n% per year with full vesting in \nten years\n. The assets of the Wynn Macau Plan and the CPF are held separately from those of the Company in independently administered funds and overseen by the Macau government. Forfeitures of unvested contributions are used to reduce the Company's liability for its contributions payable. During the years ended December 31, 2024, 2023 and 2022, the Company recorded matching contribution expenses of $\n17.1\n million, $\n16.3\n million, and $\n17.0\n million, respectively.\nMulti-Employer Pension Plans\nRisks of participating in a multi-employer plan differ from single-employer plans for the following reasons: (1) assets contributed to a multi-employer plan by one employer may be used to provide benefits to employees of other participating employers; (2) if a participating employer stops contributing to the plan, the unfunded obligations of the plan may be borne by the remaining participating employers; (3) if a participating employer stops participating, it may be required to pay those plans an amount based on the underfunded status of the plan, referred to as a withdrawal liability; and (4) if the plan is terminated by withdrawal of all employers and if the value of the nonforfeitable benefits exceeds plan assets and withdrawal liability payments, employers are required by law to make up the insufficient difference.\nThe following table outlines the Company’s participation in multi-employer pension plans. The \"EIN/Pension Plan Number\" column provides the Employer Identification Number (\"EIN\") and the three-digit plan number. The most recent Pension Protection Act Zone Status (\"Zone Status\") is based on information certified by each plan's actuary and represents plan information available in 2024 and 2023, the plans' two most recent fiscal year-ends. Plans certified in the green zone are at least 80% funded and plans certified in the red zone are generally less than 65% funded and require a rehabilitation plan. As of December 31, 2024 and 2023, all plans requiring a rehabilitation plan have had the respective plan implemented.\nThe Company participates in the following multi-employer pension plans (in thousands):\nZone Status\nContributions by the Company \nCompany Contribution > 5%\nExpiration Date of Collective Bargaining Agreements\nPension Fund\nEmployer\nEIN/ \nPension Plan Number\n2023\n(1)\n2022\n(1)\n2024\n2023\n2022\nSouthern Nevada Culinary and Bartenders Pension Plan\n(2)\nWynn Las Vegas, LLC\n88-6016617/1\nGreen\nGreen\n$\n17,272\n \n$\n15,849\n \n$\n13,462\n \nYes\n11/30/2028\nWestern Conference of Teamsters Pension Trust Fund\nWynn Las Vegas, LLC\n91-6145047/\n217718,217830\nGreen\nGreen\n285\n \n226\n \n72\n \nNo\n7/31/2029\nUNITE HERE! Workers and Hospitality Employers Variable Defined Benefit Pension Fund\n(3)\nEncore Boston Harbor\n45-4227067/026\nGreen\nGreen\n3,955\n \n—\n \n—\n \nNo\n8/31/2026\nNew England Teamster Pension Fund\n(3)\nEncore Boston Harbor\n04-6372430/001\nRed\n(4)\nRed\n(4)\n516\n \n—\n \n—\n \nNo\n8/31/2026\n(1)  Represents plan status for plan years ending in 2023 and 2022, which are the the most recent years for which plan data is available.\n(2)  Includes union employees under the terms of the collective-bargaining agreements with the Culinary Workers Union, Local 226, and Bartenders Union, Local 165. \n(3)  Contributions by the Company began on January 1, 2024.\n(4)  Plan has implemented a rehabilitation plan for the plan years presented.\nNote 12 - \nCustomer Contract Liabilities\nIn providing goods and services to its customers, there is often a timing difference between the Company receiving cash and the Company recording revenue for providing services or holding events.  \n92 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe Company's primary liabilities associated with customer contracts are as follows (in thousands):\nDecember 31, 2024\nDecember 31, 2023\nIncrease/ (Decrease)\nDecember 31, 2023\nDecember 31, 2022\nIncrease/ (Decrease)\nCasino outstanding chips and front money deposits\n(1)\n$\n409,928\n \n$\n433,269\n \n$\n(\n23,341\n)\n$\n433,269\n \n$\n390,531\n \n$\n42,738\n \nAdvance room deposits and ticket sales\n(2)\n84,460\n \n89,640\n \n(\n5,180\n)\n89,640\n \n85,019\n \n4,621\n \nOther gaming-related liabilities\n(3)\n15,458\n \n24,964\n \n(\n9,506\n)\n24,964\n \n31,265\n \n(\n6,301\n)\nLoyalty program and related liabilities\n(4)\n29,489\n \n31,106\n \n(\n1,617\n)\n31,106\n \n35,083\n \n(\n3,977\n)\n$\n539,335\n \n$\n578,979\n \n$\n(\n39,644\n)\n$\n578,979\n \n$\n541,898\n \n$\n37,081\n \n(1) Casino outstanding chips generally represent amounts owed to gaming promoters and customers for chips in their possession, and casino front money deposits represent funds deposited by customers before gaming play occurs. These amounts are included in customer deposits on the Consolidated Balance Sheets and may be recognized as revenue or redeemed for cash in the future.\n(2)  Advance room deposits and ticket sales represent cash received in advance for goods or services to be provided in the future. These amounts are included in customer deposits on the Consolidated Balance Sheets and will be recognized as revenue when the goods or services are provided or the events are held. Decreases in this balance generally represent the recognition of revenue and increases in the balance represent additional deposits made by customers. The deposits are expected to primarily be recognized as revenue within one year.\n(3)  Other gaming-related liabilities generally represent unpaid wagers primarily in the form of unredeemed slot, race and sportsbook tickets or wagers for future sporting events. The amounts are included in other accrued liabilities on the Consolidated Balance Sheets.\n(4)  Loyalty program and related liabilities represent the deferral of revenue until the loyalty points or other complimentaries are redeemed. The amounts are included in other accrued liabilities on the Consolidated Balance Sheets and are expected to be recognized as revenue within one year of being earned by customers.\nNote 13 - \nStock-Based Compensation \n The Company has adopted equity plans that allow for grants of stock-based compensation awards. The following sections describe each of these plans.\nWynn Resorts, Limited Second Amended and Restated 2014 Omnibus Incentive Plan (the \"WRL Omnibus Plan\")\nIn January 2017, the Company adopted the WRL Omnibus Plan after approval from its stockholders, which was adopted for a period of \n10\n years. From time to time, the Company reserves additional shares of its common stock for issuance under the WRL Omnibus Plan. The WRL Omnibus Plan allows for the grant of stock options, restricted stock, restricted stock units, stock appreciation rights, performance awards, and other share-based awards to eligible participants. \nIn May 2024, the Company's shareholders approved an amendment to the WRL Omnibus Plan that increases the shares authorized for issuance by \n2,000,000\n shares, for an aggregate number of shares authorized for issuance to \n7,909,390\n shares.\nAs of December 31, 2024, the Company had \n3,000,262\n shares of its common stock available for grant as share-based awards under the WRL Omnibus Plan. \nWynn Macau, Limited Share Option and Share Award Plans\nThe Company's majority-owned subsidiary, WML, has two stock-based compensation plans that provide awards based on shares of WML's common stock. The shares available for issuance under these plans are separate and distinct from the common stock of Wynn Resorts' share plan and are not available for issuance for any awards under the Wynn Resorts share plan. The maximum number of shares which may be issued pursuant to WML's stock-based compensation plans is a combined aggregate of \n523,843,160\n shares. As of December 31, 2024, there were \n512,897,160\n shares available for issuance under WML's stock-based compensation plans. \nWML Share Option Plan\n \n(\"WML Share Option Plan\") \n \nWML \nadopted\n the WML Share Option Plan in \nMay 2023 to supersede its share option plan adopted in May 2019. The WML share option plan allows\n for the grant of stock options\n to purchase shares of WML to eligible directors and employees of WML, its subsidiaries, and related entities, and service providers of WML and its subsidiaries. \nThe WML Share Option Plan is administered by WML's board of directors, which has the discretion on the vesting and service requirements, exercise price, performance targets to exercise if applicable and other conditions, subject to certain limits\n. The WML S\nhare \nO\nption \nP\nlan\n was adopted for a period of \n10\n years commencing from May 25, 2023.\n93 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nWML Employee Share Ownership Scheme (the \"WML Share Award Plan\")\nWML adopted the WML Share Award Plan in May 2023 to supersede its employee ownership scheme adopted on June 30, 2014. The Share Award Plan allows for the grant of nonvested shares of WML's common stock to eligible directors and employees of WML, its subsidiaries, and related entities, and service providers of WML and its subsidiaries. The WML Share Award Plan was adopted for a period of \n10\n years commencing from May 25, 2023. \nStock Options\nThe summary of stock option activity for the year ended December 31, 2024 is presented below: \nOptions\nWeighted\nAverage\nExercise\nPrice\nWeighted\nAverage\nRemaining\nContractual\nTerm (in years)\nAggregate\nIntrinsic\nValue\nWRL Omnibus Plan\nOutstanding as of January 1, 2024\n23,985\n \n$\n61.48\n \nGranted\n—\n \n$\n—\n \nExercised\n(\n17,285\n)\n$\n58.85\n \nForfeited or expired\n—\n \n$\n—\n \nOutstanding as of December 31, 2024\n6,700\n \n$\n68.25\n \n0.8\n$\n119,997\n \nFully vested and expected to vest as of December 31, 2024\n6,700\n \n$\n68.25\n \n0.8\n$\n119,997\n \nExercisable as of December 31, 2024\n6,700\n \n$\n68.25\n \n0.8\n$\n119,997\n \nWML Share Option Plan\nOutstanding as of January 1, 2024\n37,220,400\n \n$\n1.52\n \nGranted\n4,983,000\n \n$\n0.75\n \nExercised\n—\n \n$\n—\n \nForfeited or expired\n(\n644,000\n)\n$\n4.00\n \nOutstanding as of December 31, 2024\n41,559,400\n \n$\n1.40\n \n6.4\n$\n419,076\n \nFully vested and expected to vest as of December 31, 2024\n41,559,400\n \n$\n1.40\n \n6.4\n$\n419,076\n \nExercisable as of December 31, 2024\n24,287,400\n \n$\n1.75\n \n5.2\n$\n167,630\n \nThe following is provided for stock options under the Company's stock-based compensation plans (in thousands, except weighted average grant date fair value):\nYear Ended December 31,\n2024\n2023\n2022\nWRL Omnibus Plan\n(1)\nWeighted average grant date fair value\n$\n—\n \n$\n—\n \n$\n18.56\n \nIntrinsic value of stock options exercised\n$\n832\n \n$\n1,475\n \n$\n—\n \nCash received from the exercise of stock options\n$\n1,017\n \n$\n1,965\n \n$\n—\n \nWML Share Option Plan\n(2)\nWeighted average grant date fair value\n$\n0.25\n \n$\n0.25\n \n$\n0.26\n \nIntrinsic value of stock options exercised\n$\n—\n \n$\n—\n \n$\n—\n \nCash received from the exercise of stock options\n$\n—\n \n$\n—\n \n$\n—\n \n(1)\nAs of December 31, 2024, there was no unamortized compensation expense related to stock options.\n(2)\nAs of December 31, 2024, there was $\n4.3\n million of unamortized compensation expense related to stock options, which is expected to be recognized over a weighted average period of \n3.26\n years.\n94 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nOption Valuation Inputs\nThe fair value of stock options granted under the WRL Omnibus Plan was estimated on the date of grant using the following weighted average assumption:\nYear Ended December 31,\n2024\n2023\n2022\nExpected dividend yield\n—\n \n%\n—\n \n%\n—\n \n%\nExpected volatility\n—\n \n%\n—\n \n%\n56.9\n \n%\nRisk-free interest rate\n—\n \n%\n—\n \n%\n2.7\n \n%\nExpected term (years)\n— \n— \n1.8\nThe fair value of stock options granted under WML's Share Option Plan was estimated on the date of grant using the following weighted average assumptions:\nYear Ended December 31,\n2024\n2023\n2022\nExpected dividend yield\n5.4\n \n%\n5.7\n \n%\n1.3\n \n%\nExpected volatility\n54.2\n \n%\n53.8\n \n%\n45.7\n \n%\nRisk-free interest rate\n3.1\n \n%\n3.6\n \n%\n3.2\n \n%\nExpected term (years)\n6.5\n6.5\n6.5\nNonvested and performance nonvested shares\nThe summary of nonvested and performance nonvested share activity under the Company's stock-based compensation plans for the year ended December 31, 2024 is presented below: \nShares\nWeighted\nAverage\nGrant Date\nFair Value\nWRL Omnibus Plan\nNonvested as of January 1, 2024\n977,658\n \n$\n96.63\n \nGranted\n597,633\n \n$\n93.12\n \nVested\n(\n526,612\n)\n$\n94.62\n \nForfeited\n(\n29,708\n)\n$\n102.97\n \nNonvested as of December 31, 2024\n1,018,971\n \n$\n95.52\n \nWML Share Award Plan\nNonvested as of January 1, 2024\n22,331,806\n \n$\n0.92\n \nGranted\n8,931,255\n \n$\n0.90\n \nVested\n(\n5,487,607\n)\n$\n1.04\n \nForfeited\n(\n1,253,005\n)\n$\n0.95\n \nNonvested as of December 31, 2024\n24,522,449\n \n$\n0.89\n \nCertain members of the executive management team receive grants of nonvested share awards that are subject to service and performance conditions. Generally, these awards vest if certain fair share metrics (as approved by the Company's Compensation Committee of the Board of Directors) are attained over a \none\n-, \ntwo\n-, or \nthree-year\n performance period. The Company records expense for these awards if it determines that vesting is probable. At December 31, 2024, all performance nonvested awards were deemed to be probable of vesting; however, none of the performance criteria contingencies have been resolved. The activity for these performance nonvested shares is included in the table above.\n95 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe following is provided for the share awards under the Company's stock-based compensation plans (in thousands, except weighted average grant date fair value):\nYear Ended December 31,\n2024\n2023\n2022\nWRL Omnibus Plan\nWeighted average grant date fair value\n$\n93.12\n \n$\n94.13\n \n$\n62.34\n \nFair value of shares vested\n$\n49,544\n \n$\n56,689\n \n$\n52,965\n \nWML Share Award Plan\nWeighted average grant date fair value\n$\n0.90\n \n$\n1.08\n \n$\n0.62\n \nFair value of shares vested\n$\n4,422\n \n$\n3,941\n \n$\n20,547\n \nAs of December 31, 2024, there was $\n54.5\n million of unamortized compensation expense related to nonvested shares under the WRL Omnibus Plan, which is expected to be recognized over a weighted average period of \n1.88\n years. As of December 31, 2024, there was $\n11.2\n million of unamortized compensation expense under the WML Share Award Plan, which is expected to be recognized over a weighted average period of \n2.09\n years. \nPerformance Share Units (\"PSUs\")\nCertain members of the Wynn Resorts executive management team receive grants of PSUs that are subject to service and market conditions. Each PSU represents the right to receive between \n0\n and \n1.6\n shares of Wynn Resorts common stock depending on the performance of the common stock over a \nthree-year\n period. \nThe summary of PSU activity during the year ended December 31, 2024 is provided below:\nUnits\nWeighted\nAverage\nGrant Date\nFair Value\nNonvested as of January 1, 2024\n24,910\n \n$\n121.70\n \nGranted\n25,885\n \n$\n110.40\n \nVested\n—\n \n$\n—\n \nForfeited\n—\n \n$\n—\n \nNonvested as of December 31, 2024\n50,795\n \n$\n115.94\n \nThe fair value of PSUs granted under the WRL Omnibus Plan was estimated on the date of grant using the following weighted average assumptions:\nYear Ended December 31,\n2024\n2023\nExpected volatility\n45\n \n%\n55\n \n%\nRisk-free interest rate\n4.1\n \n%\n3.8\n \n%\nAnnual Incentive Bonus\nCertain members of the Company's management team receive a portion of their annual incentive bonus in shares of the Company's stock. The number of shares is determined based on the closing stock price on the date the annual incentive bonus is settled. As the number of shares is variable, the Company records a liability for the fixed monetary amount over the service period. The Company recorded stock-based compensation expense associated with these awards of $\n7.8\n million, $\n8.0\n million and $\n6.6\n million for each of the years ended December 31, 2024, 2023 and 2022, respectively. The Company settled its obligations for the 2024, 2023, and 2022 annual incentive bonuses by issuing \n94,350\n, \n84,130\n, and \n67,320\n of vested shares with a weighted-average grant date fair value of $\n82.45\n, $\n95.26\n, and $\n98.61\n, in January of the respective following year.\n96 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nCompensation Cost\nThe total compensation cost for stock-based compensation plans was recorded as follows (in thousands):\nYear Ended December 31,\n2024\n2023\n2022\nCasino\n$\n3,065\n \n$\n2,163\n \n$\n12,401\n \nRooms\n1,028\n \n800\n \n1,252\n \nFood and beverage\n2,197\n \n1,636\n \n2,417\n \nEntertainment, retail and other\n1,108\n \n8,230\n \n10,964\n \nGeneral and administrative\n51,631\n \n51,686\n \n40,593\n \nTotal stock-based compensation expense\n59,029\n \n64,515\n \n67,627\n \nTotal stock-based compensation capitalized\n5,242\n \n5,268\n \n3,246\n \nTotal stock-based compensation costs\n$\n64,271\n \n$\n69,783\n \n$\n70,873\n \nDuring the years ended December 31, 2024, 2023 and 2022, the Company recognized income tax benefits related to stock-based compensation expense in the Consolidated Statements of Operations of $\n9.9\n million, $\n10.0\n million, and $\n9.3\n million, respectively. Additionally, during the years ended December 31, 2024, 2023, and 2022, the Company realized tax benefits related to stock option exercises and restricted stock vesting of $\n5.8\n million, $\n7.5\n million, and $\n8.9\n million, respectively.\n \nNote 14 - \nIncome Taxes \nConsolidated income (loss) before taxes for United States (\"U.S.\") and foreign operations consisted of the following (in thousands):\nYear Ended December 31,\n2024\n2023\n2022\nUnited States \n$\n251,003\n \n$\n142,775\n \n$\n339,513\n \nForeign\n392,395\n \n142,608\n \n(\n1,039,549\n)\nTotal\n$\n643,398\n \n$\n285,383\n \n$\n(\n700,036\n)\nThe income tax provision (benefit) attributable to income before income taxes is as follows (in thousands):\nDecember 31,\n2024\n2023\n2022\nCurrent\nU.S. Federal\n$\n894\n \n$\n(\n248\n)\n$\n825\n \nU.S. State\n9,496\n \n6,337\n \n2,882\n \nForeign\n141\n \n(\n194\n)\n2,510\n \nTotal\n10,531\n \n5,895\n \n6,217\n \nDeferred\nU.S. Federal\n(\n4,585\n)\n(\n483,786\n)\n1,450\n \nU.S. State\n(\n2,264\n)\n(\n20,310\n)\n1,674\n \nForeign\n—\n \n1,367\n \n(\n9\n)\nTotal\n(\n6,849\n)\n(\n502,729\n)\n3,115\n \nTotal income tax provision (benefit)\n$\n3,682\n \n$\n(\n496,834\n)\n$\n9,332\n \n97 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe reconciliation of the U.S. federal statutory tax rate to the actual tax rate is as follows:\nDecember 31,\n2024\n2023\n2022\nU.S. Federal statutory rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState tax\n1.0\n \n%\n(\n2.8\n)\n%\n0.3\n \n%\nForeign tax credits, net of valuation allowance\n(\n12.2\n)\n%\n(\n139.8\n)\n%\n12.5\n \n%\nNon-taxable foreign income\n(\n6.3\n)\n%\n(\n9.6\n)\n%\n(\n5.7\n)\n%\nForeign tax rate differential\n(\n3.9\n)\n%\n0.4\n \n%\n(\n17.0\n)\n%\nValuation allowance, other\n(\n6.6\n)\n%\n(\n43.8\n)\n%\n(\n3.1\n)\n%\nOther, net\n7.6\n \n%\n0.5\n \n%\n(\n9.3\n)\n%\nEffective income tax rate\n0.6\n \n%\n(\n174.1\n)\n%\n(\n1.3\n)\n%\nIn 2024, Wynn Macau SA received an exemption from Macau's \n12\n% Complementary Tax on casino gaming profits from January 1, 2023 through December 31, 2027. For the year ended December 31, 2023, the Company was exempt from the payment of Macau Complementary Tax totaling $\n77.4\n million or $\n0.69\n per diluted share. For the year ended December 31, 2024, the Company was exempt from the payment of Macau Complementary Tax totaling $\n107.3\n million or $\n0.97\n per diluted share. The Company's non-gaming profits remain subject to the Macau Complementary Tax and its casino winnings remain subject to the Macau special gaming tax and other levies in accordance with its concession agreement.\n98 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe tax effects of significant temporary differences representing net deferred tax assets and liabilities consisted of the following (in thousands):\nDecember 31,\n2024\n2023\nDeferred tax assets—U.S.:\nForeign tax credit carryforwards\n$\n533,473\n \n$\n1,244,149\n \nDisallowed interest expense carryforward\n157,586\n \n156,224\n \nNet operating loss carryforward\n169,598\n \n160,778\n \nLease liability\n370,110\n \n371,032\n \nProperty and equipment\n72,286\n \n50,903\n \nReceivables, inventories, accrued liabilities and other\n21,491\n \n21,854\n \nStock-based compensation\n9,020\n \n9,984\n \nOther tax credit carryforwards\n21,562\n \n19,813\n \nIntangibles and related other\n36,371\n \n41,914\n \nOther\n1,858\n \n—\n \n1,393,355\n \n2,076,651\n \nLess: valuation allowance \n(\n479,854\n)\n(\n1,172,982\n)\n913,501\n \n903,669\n \nDeferred tax liabilities—U.S.:\nLeased asset\n(\n370,110\n)\n(\n371,032\n)\nPrepaid insurance, maintenance and taxes\n(\n15,447\n)\n(\n16,186\n)\nOther\n(\n20,228\n)\n(\n15,584\n)\n(\n405,785\n)\n(\n402,802\n)\nDeferred tax assets—Foreign:\nNet operating loss carryforwards\n32,114\n \n78,842\n \nProperty and equipment\n91,884\n \n87,849\n \nOther \n2,952\n \n3,275\n \n126,950\n \n169,966\n \nLess: valuation allowance \n(\n124,791\n)\n(\n167,599\n)\n2,159\n \n2,367\n \nDeferred tax liabilities—Foreign:\nProperty and equipment\n(\n2,159\n)\n(\n2,357\n)\n(\n2,159\n)\n(\n2,357\n)\nNet deferred tax asset\n$\n507,716\n \n$\n500,877\n \nAs of December 31, 2024, the Company had foreign tax credit (\"FTC\") carryforwards (net of uncertain tax positions) of $\n533.5\n million. Of this amount, $\n47.2\n million will expire in 2025, and $\n486.3\n million will expire in 2027. The Company has a disallowed interest carryforward of $\n688.3\n million which does not expire. As of December 31, 2024, the Company had U.S. federal and state tax loss carryforwards of $\n658.9\n million. As of December 31, 2023, the Company had U.S. federal and state tax loss carryforwards of $\n624.6\n million. U.S. federal tax loss carryforwards do not expire. State net operating losses generally carry forward 20 years and will begin to expire in 2040. The Company has foreign tax losses available of $\n38.2\n million, $\n55.1\n million and $\n154.6\n million related to losses incurred in the tax years ended December 31, 2024, 2023 and 2022, respectively. The majority of foreign tax loss carryforwards expire in 2027, 2026, and 2025, respectively. \nThe Company records valuation allowances on certain of its U.S. and foreign deferred tax assets. In assessing the need for a valuation allowance, the Company considers whether it is more likely than not that the deferred tax assets will be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income. In the assessment of the valuation allowance, appropriate consideration is given to all positive and negative evidence including recent operating \n99 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nprofitability, forecast of future earnings, ability to carry back, the reversal of net taxable temporary differences, the duration of statutory carryforward periods and tax planning strategies. The need for valuation allowances against deferred tax assets will be assessed on a continuous basis and, as a result, the allowance may increase or decrease based on changes in facts and circumstances.\nIn 2024, the Company recorded a $\n735.9\n million net decrease to valuation allowances, including a $\n693.3\n million decrease to valuation allowance on FTC carryforwards. Of the $\n693.3\n million net decrease, $\n614.9\n million relates to expirations of FTCs in 2024 and the remaining $\n78.4\n million represents FTCs more likely than not to be realized based on changes in future taxable income and tax planning strategies.\nIn 2023, the Company considered both the achievement of sustained profitability and cumulative income as well as forecasted income and tax planning strategies to be significant forms of positive evidence. The Company determined that the positive evidence outweighed the negative evidence and supported a release of a portion of the valuation allowance. Therefore, the Company recorded a $\n1.10\n billion net decrease to valuation allowances, including a $\n971.7\n million decrease to valuation allowance on FTC carryforwards. Of the $\n971.7\n million decrease, $\n97.5\n million related to utilization and $\n572.6\n million related to expirations of FTCs in 2023. The remaining $\n301.6\n million represented FTCs more likely than not to be realized based on future taxable income and tax planning strategies. The Company also recorded a $\n158.0\n million decrease in valuation allowance on disallowed interest expense carryforward. \nAs of December 31, 2024 and 2023, the Company had valuation allowances provided on its deferred tax assets as follows (in thousands): \nDecember 31,\n2024\n2023\nForeign tax credits\n$\n247,973\n \n$\n941,249\n \nIntangible assets\n36,850\n \n46,084\n \nU.S. loss carryforwards\n169,598\n \n160,778\n \nOther U.S. deferred tax assets\n25,432\n \n24,872\n \nForeign loss carryforwards\n32,674\n \n80,569\n \nOther foreign deferred tax assets\n92,118\n \n87,029\n \nTotal\n$\n604,645\n \n$\n1,340,581\n \nThe Company had the following activity for unrecognized tax benefits as follows (in thousands):\nDecember 31,\n2024\n2023\n2022\nBalance at beginning of period\n$\n135,671\n \n$\n135,979\n \n$\n141,515\n \nIncreases based on tax positions of the current year\n11,635\n \n15,818\n \n12,068\n \nReductions based on tax positions of prior years\n—\n \n—\n \n(\n2,637\n)\nReductions due to lapse in statutes of limitations\n(\n16,288\n)\n(\n16,126\n)\n(\n14,967\n)\nBalance at end of period\n$\n131,018\n \n$\n135,671\n \n$\n135,979\n \nAs of December 31, 2024, 2023 and 2022, unrecognized tax benefits of $\n130.9\n million, $\n135.7\n million and $\n135.9\n million, respectively, were recorded as reductions in deferred income taxes, net. The Company had $\n0.1\n million of unrecognized tax benefits recorded in other long-term liabilities as of December 31, 2024. The Company had no unrecognized tax benefits recorded in other long-term liabilities as of December 31, 2023 and 2022. \nAs of December 31, 2024, 2023 and 2022, $\n65.8\n million, $\n69.0\n million and $\n69.0\n million, respectively, of unrecognized tax benefits would, if recognized, impact the effective tax rate.\nThe Company recognizes penalties and interest related to unrecognized tax benefits in the provision for income taxes. During each of the years ended December 31, 2024, 2023 and 2022, the Company recognized \nno\n interest and penalties. \nThe Company anticipates that the 2020 statute of limitations will expire in the next 12 months for certain foreign tax jurisdictions. Also, the Company's unrecognized tax benefits include certain income tax accounting methods, which govern the \n100 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\ntiming and deductibility of income tax deductions. As a result, the Company's unrecognized tax benefits could increase up to $\n2.6\n million over the next 12 months.\nThe Company files income tax returns in the U.S. federal jurisdiction, various states and foreign jurisdictions. The Company's income tax returns are subject to examination by the IRS and other tax authorities in the locations where it operates. The Company's 2002 to 2020 domestic income tax returns remain subject to examination by the IRS to the extent tax attributes carryforward to future years. The Company's 2021 to 2023 domestic income tax returns also remain subject to examination by the IRS. The Company's 2020 to 2023 Macau income tax returns remain subject to examination by the Financial Services Bureau.\nThe Company has participated in the IRS Compliance Assurance Program (\"CAP\") for the 2012 through 2024 tax years and will continue to participate in the IRS CAP for the 2025 tax year. \nIn January 2025, the Financial Services Bureau commenced an examination of the 2021 Macau income tax return of Wynn Macau SA. \nOn December 31, 2024, 2023 and 2022, the statute of limitations for the 2019, 2018, and 2017 Macau Complementary tax return expired, respectively. As a result of the expiration of the statute of limitations for the Macau Complementary Tax return, the total amount of unrecognized tax benefits decreased by $\n16.3\n million, $\n16.1\n million, and $\n15.0\n million, respectively.\nNote 15 - \nEarnings Per Share\nBasic earnings per share (\"EPS\") is computed by dividing net income (loss) attributable to Wynn Resorts by the weighted average number of common shares outstanding during the period. Diluted EPS is computed by dividing net income (loss) attributable to Wynn Resorts, adjusted for the potential dilutive impact assuming that the conversion of the WML Convertible Bonds occurred as of the date of their issuance under the if-converted method, by the weighted average number of common shares outstanding during the period increased to include the number of additional shares of common stock that would have been outstanding if the potential dilutive securities had been issued, to the extent such impact is not anti-dilutive. Potentially dilutive securities include share-based awards outstanding under the WRL Omnibus Plan.\nThe weighted average number of common and common equivalent shares used in the calculation of basic and diluted EPS consisted of the following (in thousands, except per share amounts):\nYear Ended December 31,\n2024\n2023\n2022\nNumerator:\nNet income (loss) attributable to Wynn Resorts, Limited - basic\n$\n501,078\n \n$\n729,994\n \n$\n(\n423,856\n)\nEffect of dilutive securities of Wynn Resorts, Limited subsidiaries:\nAssumed conversion of WML Convertible Bonds\n(\n21,005\n)\n(\n16,495\n)\n—\n \nNet income (loss) attributable to Wynn Resorts, Limited - diluted\n$\n480,073\n \n$\n713,499\n \n$\n(\n423,856\n)\nDenominator:\nWeighted average common shares outstanding\n109,966\n \n112,523\n \n113,623\n \nPotential dilutive effect of stock options, nonvested, and performance nonvested shares\n301\n \n332\n \n—\n \nWeighted average common and common equivalent shares outstanding\n110,267\n \n112,855\n \n113,623\n \nNet income (loss) attributable to Wynn Resorts, Limited per common share, basic\n$\n4.56\n \n$\n6.49\n \n$\n(\n3.73\n)\nNet income (loss) attributable to Wynn Resorts, Limited per common share, diluted\n$\n4.35\n \n$\n6.32\n \n$\n(\n3.73\n)\nAnti-dilutive stock options, nonvested, and performance nonvested shares excluded from the calculation of diluted net income per share\n310\n \n238\n \n895\n \n101 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nNote 16 - \nLeases \nLessee Arrangements\nThe following table summarizes the balance sheet classification of the Company's lease assets and liabilities (in thousands):\nDecember 31,\nBalance Sheet Classification\n2024\n2023\nAssets\nOperating leases\nOperating lease assets \n$\n1,797,276\n \n$\n1,832,896\n \nFinance leases\nProperty and equipment, net\n$\n94,656\n \n$\n43,078\n \nCurrent liabilities\nOperating leases\nOther accrued liabilities\n$\n10,869\n \n$\n9,295\n \nFinance leases\nOther accrued liabilities\n$\n18,367\n \n$\n13,412\n \nNon-current liabilities\nOperating leases\nLong-term operating lease liabilities\n$\n1,623,890\n \n$\n1,631,749\n \nFinance leases\nOther long-term liabilities\n$\n71,592\n \n$\n24,028\n \nThe following tables disclose the components of the Company's lease cost, supplemental cash flow disclosures, and other information regarding the Company's lease arrangements (in thousands):\nYear Ended December 31,\n2024\n2023\n2022\nLease cost: \nOperating lease cost\n$\n17,146\n \n$\n17,173\n \n$\n18,321\n \nTriple-net operating lease cost related to Encore Boston Harbor\n141,576\n \n141,722\n \n11,773\n \nShort-term lease cost\n30,443\n \n27,468\n \n21,060\n \nAmortization of leasehold interests in land \n13,704\n \n13,666\n \n13,728\n \nVariable lease cost\n2,493\n \n1,868\n \n1,081\n \nFinance lease interest cost\n3,391\n \n2,363\n \n2,131\n \nTotal lease cost\n$\n208,753\n \n$\n204,260\n \n$\n68,094\n \nYear Ended December 31,\n2024\n2023\n2022\nSupplemental cash flow disclosures:\nOperating lease liabilities arising from obtaining operating lease assets\n$\n3,803\n \n$\n26,657\n \n$\n1,519,628\n \nFinance lease liabilities arising from obtaining finance lease assets\n$\n80,021\n \n$\n8,842\n \n$\n5,906\n \nCash paid for amounts included in the measurement of lease liabilities: \nCash used in operating activities - Operating leases \n$\n141,004\n \n$\n139,054\n \n$\n26,094\n \nCash used in financing activities - Finance leases\n$\n19,219\n \n$\n19,267\n \n$\n18,188\n \n102 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nYear Ended December 31,\n2024\n2023\n2022\nOther information: \nWeighted-average remaining lease term - Operating leases\n29.1\n years\n30.1\n years\n31.1\n years\nWeighted-average remaining lease term - Finance leases\n10.5\n years\n19.7\n years\n16.0\n years\nWeighted-average discount rate - Operating leases\n8.0\n \n%\n8.0\n \n%\n8.0\n \n%\nWeighted-average discount rate - Finance leases\n6.3\n \n%\n5.8\n \n%\n5.0\n \n%\nThe following table presents an analysis of lease liability maturities as of December 31, 2024 (in thousands):\nYear Ending December 31,\nOperating Leases\nFinance Leases\n2025\n$\n141,522\n \n$\n23,412\n \n2026\n142,422\n \n23,080\n \n2027\n144,767\n \n22,175\n \n2028\n145,727\n \n17,377\n \n2029\n147,932\n \n989\n \nThereafter\n3,680,177\n \n60,806\n \nTotal undiscounted cash flows\n$\n4,402,547\n \n$\n147,839\n \nPresent value\n  Short-term lease liabilities\n$\n10,869\n \n$\n18,367\n \n  Long-term lease liabilities\n1,623,890\n \n71,592\n \nTotal lease liabilities\n$\n1,634,759\n \n$\n89,959\n \nInterest on lease liabilities\n$\n2,767,788\n \n$\n57,880\n \nEncore Boston Harbor Lease\nThe Company leases the real estate assets of Encore Boston Harbor pursuant to a triple-net operating lease agreement with an initial term of \n30\n years from December 2022 to November 2052, which may be renewed for \none\n additional \nthirty-year\n term. The lease has an initial base rent of $\n100\n million per year, which increases at a fixed rate of \n1.75\n% per year for the first ten years and the greater of \n1.75\n% or change in consumer price index, subject to a cap of \n2.5\n%, each year for the remaining term of the lease. In addition, certain fixed payments in lieu of taxes (\"PILOT\") made on behalf of the lessor are included in lease payments for the purpose of measuring the associated operating lease assets and liabilities.  \nThe lease payments, inclusive of PILOT payments, are $\n126.4\n million in 2025, $\n128.8\n million in 2026, $\n131.3\n million in 2027, $\n133.7\n million in 2028, $\n136.3\n million in 2029, and $\n3.29\n billion thereafter. At December 31, 2024 and 2023, the total liability associated with the lease was $1.51 billion.\nGround Leases\nUndeveloped Land - Las Vegas\n    \nThe Company leases approximately \n16\n acres of undeveloped land on Las Vegas Boulevard directly across from Wynn Las Vegas in Las Vegas, Nevada, pursuant to a lease agreement which expires in 2097. The ground lease payments, which increase at a fixed rate over the term of the lease, are $\n4.0\n million per year from 2025 to 2029 and total payments of $\n343.8\n million thereafter. As of December 31, 2024 and 2023, the liability associated with this lease was $\n65.2\n million and $\n64.8\n million, respectively.\nAt December 31, 2024 and 2023, operating lease assets included approximately $\n81.3\n million and $\n82.5\n million, respectively, related to an amount allocated to the leasehold interest in land upon the acquisition of a group of assets in 2018. \n103 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nThe Company expects that the amortization of this amount will be $\n1.1\n million each year from 2025 through 2096 and $\n0.7\n million in 2097.\nMacau Land Concessions\nWynn Palace and Wynn Macau were built on land that is leased under Macau land concession contracts each with terms of \n25\n years from May 2012 and August 2004, respectively, which may be renewed with government approval for successive \n10\n-year periods in accordance with Macau legislation. The land concession payments are expected to be $\n1.5\n million per year through 2028, $\n1.3\n million in 2029, and total payments of $\n7.2\n million thereafter through 2037. At December 31, 2024 and 2023, the total liability associated with these leases was $\n9.8\n million and $\n10.4\n million, respectively. \nAt December 31, 2024 and 2023, operating lease assets included $\n129.5\n million and $\n141.2\n million of leasehold interests in land related to the Wynn Palace and Wynn Macau land concessions. The Company expects that the amortization associated with these leasehold interests will be approximately $\n12.6\n million per year from 2025 through 2028, approximately $\n11.3\n million in 2029, approximately $\n9.2\n million per year from 2030 through 2036 and approximately $\n3.1\n million in 2037. \nLessor Arrangements\nThe following table presents the minimum and contingent operating lease income for the periods presented (in thousands):\nYear Ended December 31,\n2024\n2023\n2022\nMinimum rental income\n$\n138,604\n \n$\n131,901\n \n$\n126,226\n \nContingent rental income\n66,526\n \n96,831\n \n62,586\n \nTotal rental income\n$\n205,130\n \n$\n228,732\n \n$\n188,812\n \nThe following table presents the future minimum rentals to be received under operating leases (in thousands): \nYear Ending December 31,\nOperating Leases\n2025\n$\n135,387\n \n2026\n104,509\n \n2027\n86,405\n \n2028\n59,360\n \n2029\n33,977\n \nThereafter\n93,451\n \nTotal future minimum rentals\n$\n513,089\n \nNote 17 - \nRelated Party Transactions\nWynn Al Marjan Island Agreements\nIn 2022, the Company, its co-investors in Wynn Al Marjan Island, and Island 3 entered into agreements whereby the Company has agreed to perform certain design and development services with respect to Wynn Al Marjan Island as well as certain related preopening services, in exchange for the reimbursement of its costs incurred in performing such services. The Company has additionally agreed to perform management services at Wynn Al Marjan Island upon its opening, expected to be in 2027. The Company billed Island 3 $\n49.5\n million and $\n28.3\n million for reimbursable costs during the years ended  December 31, 2024 and 2023, respectively. As of December 31, 2024 and 2023, the Company was owed $\n6.9\n million and $\n8.7\n million, respectively, by Island 3, for reimbursable costs recorded in \"Prepaid expenses and other\" in the accompanying consolidated balance sheets.\nIn February 2025, a wholly-owned subsidiary of Island 3 entered into a financing arrangement to fund the construction of Wynn Al Marjan Island, in connection with which the Company and the government of Ras Al Khaimah entered into a completion guarantee agreement, as described in Note 18, \"Commitments and Contingencies.\n104 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nCooperation Agreement\nOn August 3, 2018, the Company entered into a Cooperation Agreement (the \"Cooperation Agreement\") with Elaine P. Wynn regarding the composition of the Company's Board of Directors and certain other matters, including, among other things, the appointment of Mr. Philip G. Satre to the Company's Board of Directors, standstill restrictions, releases, non-disparagement, reimbursement of expenses and the grant of certain complimentary privileges. The term of the Cooperation Agreement expires on the date that Mr. Satre no longer serves as Chair of the Board, unless earlier terminated pursuant to the circumstances described in the Cooperation Agreement.\nAmounts Due to Officers, Directors and Former Directors\nThe Company periodically provides services to certain executive officers, directors or former directors of the Company, including the personal use of employees, construction work and other personal services, for which the officers, directors or former directors reimburse the Company. The Company requires prepayment for any such services, which amounts are replenished on an ongoing basis as needed. As of December 31, 2024 and 2023, these net deposit balances with the Company were immaterial, as were the services provided.\nNote 18 - \nCommitments and Contingencies\nMacau Gaming Concession\nIn addition to the fixed and variable gaming premium and property transfer agreement payment obligations as described in Note 5, \"Property and Equipment, net\" and Note 6, \"Goodwill and Intangible Assets, net,\" Wynn Macau SA committed to make certain non-gaming and gaming investments in the amount of MOP\n21.03\n billion (approximately $\n2.63\n billion) over the course of the \nten-year\n term of the Gaming Concession Contract. MOP\n19.80\n billion (approximately $\n2.48\n billion) of the committed investment will be used for non-gaming capital projects and event programming in connection with, among others, attraction of foreign tourists, conventions and exhibitions, entertainment performances, sports events, culture and art, health and wellness, themed amusement, gastronomy, community tourism and maritime tourism. \nAdditionally, Wynn Macau SA committed to make the following payments throughout the term of the Gaming Concession Contract:\n(i) Special gaming premium - The Company is obligated to pay a special annual gaming premium if the average of the gross gaming revenues of the Company's gaming tables and gaming machines is lower than a certain minimum amount determined by the Macau government. A minimum average annual gross gaming revenue of MOP\n7.0\n million (approximately $\n0.9\n million) per gaming table and MOP\n300,000\n (approximately $\n38\n thousand) per gaming machine has been set by Macau government. If Wynn Macau SA fails to reach such minimum gross gaming revenue, Wynn Macau SA will be required to pay a special premium equal to the difference between the special gaming tax calculated based on the actual gross gaming revenue and that of such minimum gross gaming revenue. No special gaming premium was paid for the year ended December 31, 2024 and 2023.\n(ii) Special levies, totaling \n5\n% of gross gaming revenues. The Macau government may reduce the special levies payable by Wynn Macau SA (1) based on Wynn Macau SA’s contribution to the attraction of tourists who enter Macau for tourism and business purposes and hold travel documents issued by countries or regions other than the People’s Republic of China; (2) if Wynn Macau SA’s operations are adversely affected by abnormal, unpredictable or force majeure circumstances associated with the prevailing economic conditions of Macau; or (3) factors as determined by the Chief Executive of Macau; \n(iii) Special gaming tax assessed at the rate of \n35\n% of gross gaming revenue.\nWynn Al Marjan Island Funding Commitment\nIn 2022, the Company, its co-investors in Wynn Al Marjan Island, and Island 3 entered into agreements whereby the Company is required to contribute capital to Island 3 to fund \n40\n% of the project design and development costs in exchange for a pro-rata share of equity in Island 3. During the year ended December 31, 2024, the Company contributed $\n541.7\n million of cash into Island 3, bringing our life-to-date cash contributions to $\n631.7\n million. The cash contributed during the year was used primarily to fund our pro rata portion of the purchase of approximately 155 acres of land underlying the Wynn Al Marjan Island development site, including the remaining 70 acres of land on Island 3 for potential future development (the \"Marjan Land \n105 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nBank\"). The remaining \n40\n% pro-rata share of the required equity for the construction of Wynn Al Marjan Island is estimated to be between $\n700\n million and $\n775\n million inclusive of capitalized interest, fees, and certain improvements on the Island. Wynn Al Marjan Island is currently expected to open in 2027.\nIn February 2025, Wynn Al Marjan Island FZ-LLC (the \"Borrower\"), a wholly-owned subsidiary of Island 3, an unconsolidated affiliate, entered into a facility agreement with a syndicate of lenders (the \"Al Marjan Facility Agreement\") which provides the Borrower with approximately $\n2.4\n billion (or equivalent in local currency) delayed draw secured term loan facility to finance the development of Wynn Al Marjan Island (the \"Al Marjan Facility\"). \nThe Company is not a party to the Al Marjan Facility Agreement, but as a condition precedent to the Al Marjan Facility being made available to the Borrower, the Company and the government of Ras Al Khaimah, acting through the Investment and Development Office of Ras Al Khaimah (collectively the \"Al Marjan Guarantors\"), entered into a guarantee (the \"Completion Guarantee\") in favor of First Abu Dhabi Bank PJSC, as security agent for itself and the other secured parties (collectively, the \"Secured Parties\") under the Al Marjan Facility Agreement (the \"Security Agent\").\n Under the terms of the Completion Guarantee, the Al Marjan Guarantors, irrevocably and unconditionally jointly and severally, (a) have guaranteed to each Secured Party punctual performance by the Borrower of certain of its obligations under the Al Marjan Facility Agreement, and (b) have undertaken with each Secured Party: (i) to provide, within 10 business days upon receiving written demand by the Security Agent, (A) sufficient funds to ensure that practical completion of the project (as provided in the Al Marjan Facility Agreement) takes place no later than June 30, 2028 and (B) to fund amounts equal to any project cost overruns, to the extent the Borrower fails to fund such overruns; and (ii) to pay, whenever the Borrower does not pay, interest, commitment fees and other finance costs payable under the Al Marjan Facility Agreement as well as scheduled payments under any interest rate hedging agreement.  \nIn addition, upon the occurrence of certain specified events of default, change of control events or credit rating downgrades under the Al Marjan Facility Agreement or the occurrence of certain commercial gaming license related events (including, among others, the loss of the commercial gaming license permitting the Borrower to conduct commercial gaming at the project and as further provided in the Al Marjan Facility Agreement), the Al Marjan Guarantors, irrevocably and unconditionally jointly and severally, have undertaken to pay, to the extent the Borrower does not pay, all then outstanding principal, interest, hedging liabilities and any and all other amounts and expenses then due and payable under the Al Marjan Facility Agreement and related agreements, within 10 business days upon receiving written demand by the Security Agent (or, in respect of the occurrence of certain commercial gaming license related events, if later, on the date falling 180 days following the occurrence of such event). \nThe guarantees and undertakings provided by the Al Marjan Guarantors under the Completion Guarantee terminate on the earlier of: (1) the date on which all secured liabilities under the Al Marjan Facility Agreement have been paid in full, and (2) the date of practical completion of the project.\nEmployment Agreements\nThe Company has entered into employment agreements with several executive officers, other members of management and certain key employees. These agreements generally have \nthree\n- to \nfive-year\n terms and typically indicate a base salary and often contain provisions for discretionary bonuses. Certain of the executives are also entitled to a separation payment if terminated without \"cause\" or upon voluntary termination of employment for \"good reason\" following a \"change of control\" (as these terms are defined in the employment contracts). As of December 31, 2024, future payment amounts of $\n106.9\n million, $\n70.2\n million, $\n32.3\n million, $\n4.6\n million, $\n1.5\n million, and $\n1.3\n million will be paid during the years ending December 31, 2025, 2026, 2027, 2028, 2029, and thereafter, respectively. \n106 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nOther Commitments \nThe Company has additional commitments for open purchase orders, construction contracts, payment obligations to communities surrounding Encore Boston Harbor, and performance and other miscellaneous contracts. \nAs of December 31, 2024, the Company was obligated under these arrangements to make future minimum payments as follows (in thousands):\nYear Ending December 31,\n2025\n$\n328,603\n \n2026\n65,906\n \n2027\n42,341\n \n2028\n34,726\n \n2029\n29,764\n \nThereafter\n78,873\n \nTotal minimum payments\n$\n580,213\n \nLetters of Credit\nAs of December 31, 2024, the Company had outstanding letters of credit of $\n14.7\n million.\nLitigation\nIn addition to the actions noted below, the Company and its affiliates are involved in litigation arising in the normal course of business. In the opinion of management, such litigation is not expected to have a material effect on the Company's financial condition, results of operations, and cash flows.\nSecurities Class Action\nOn February 20, 2018, a putative securities class action was filed against the Company and certain current and former officers of the Company in the United States District Court, Southern District of New York (which was subsequently transferred to the United States District Court, District of Nevada) by John V. Ferris and Joann M. Ferris on behalf of all persons who purchased the Company's common stock between February 28, 2014 and January 25, 2018. The complaint alleged, among other things, certain violations of federal securities laws and sought to recover unspecified damages as well as attorneys' fees, costs and related expenses for the plaintiffs. On July 28, 2021, the court dismissed certain of plaintiffs' claims, including all claims against current CEO Craig Billings and the individual directors, and allowed other claims to proceed against the Company and several of the Company's former executive officers, including Matthew Maddox, Stephen A. Wynn, Kimmarie Sinatra, and Steven Cootey. On March 2, 2023, the court granted the plaintiffs' motion for class certification and appointed lead counsel. On August 22, 2024, the parties reached an agreement to settle the action, in its entirety, for the amount of $\n70.0\n million, of which the Company contributed $\n9.4\n million. The court preliminarily approved the settlement on October 10, 2024, and issued its final approval of the settlement on January 27, 2025. The Company's $\n9.4\n million net contribution toward the settlement is recorded within Property charges and other expenses within the accompanying Consolidated Statements of Operations for the year ended December 31, 2024.\nFederal Investigation\nFrom time to time, the Company receives regulatory inquiries about compliance with anti-money laundering laws. The Company received requests for information from the U.S. Attorney’s Office for the Southern District of California (\"USAO\") relating to its anti-money laundering policies and procedures, and beginning in 2020 received several grand jury subpoenas regarding various transactions at Wynn Las Vegas relating to certain patrons and agents who reside or operate in foreign jurisdictions. On September 6, 2024, Wynn Las Vegas entered into a non-prosecution agreement (the \"NPA\") with the USAO and the United States Department of Justice (the \"DOJ\") resolving such investigation. Pursuant to the NPA, Wynn Las Vegas agreed to forfeit $\n130.0\n million in funds involved in transactions at issue and continue to make certain enhancements to its compliance program. The DOJ agreed that, subject to Wynn Las Vegas’s fulfillment of its obligations under the NPA, it will not bring any criminal charges against Wynn Las Vegas concerning the subject matter of its investigation, subject to standard reservations of rights and certain reserved claims. In reaching the resolution set forth in the NPA, the DOJ took into account the \n107 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nhistorical nature of the transactions at issue; Wynn Las Vegas’s cooperation with the DOJ’s multi-year investigation; that Wynn Las Vegas no longer employs or is affiliated with any of the individuals implicated in the transactions at issue; and Wynn Las Vegas’s extensive remedial measures, many of which were undertaken prior to the parties entering into the NPA. The NPA resolves all prior U.S. federal regulatory inquiries commenced in or about 2014 regarding compliance by Wynn Las Vegas with 18 U.S.C. § 1960 and the Bank Secrecy Act. The $\n130.0\n million forfeiture is recorded within Property charges and other expenses within the accompanying Consolidated Statements of Operations for the year ended December 31, 2024. As set forth in the NPA, Wynn Las Vegas paid $\n65.0\n million in 2024 and recorded the remaining $\n65.0\n million (which will be paid in 2025) in Other accrued liabilities on the Consolidated Balance Sheet as of December 31, 2024.\nNote 19 - \nRetail Joint Venture\nIn December 2016, the Company entered into the Retail Joint Venture with Crown Acquisitions Inc. (\"Crown\") to own and operate approximately \n88,000\n square feet of existing retail space at Wynn Las Vegas. In November 2017 and March 2022, the Company contributed approximately \n74,000\n square feet and \n70,000\n square feet of additional retail space to the Retail Joint Venture. The Company maintains a \n50.1\n% ownership in the Retail Joint Venture and is the managing member. The Company's responsibilities with respect to the Retail Joint Venture include day-to-day business operations, property management services and a role in the leasing decisions of the retail space.\nThe Company assessed its ownership in the Retail Joint Venture based on consolidation accounting guidance with an evaluation being performed to determine if the Retail Joint Venture is a VIE, if the Company has a variable interest in the Retail Joint Venture and if the Company is the primary beneficiary of the Retail Joint Venture. The primary beneficiary is the party who has the power to direct the activities of a VIE that most significantly impact the entity's economic performance and who has an obligation to absorb losses of the entity or a right to receive benefits from the entity that could potentially be significant to the entity.  \nThe Company concluded that the Retail Joint Venture is a VIE and the Company is the primary beneficiary based on its involvement in the leasing activities of the Retail Joint Venture. As a result, the Company consolidates all of the Retail Joint Venture's assets, liabilities and results of operations. The Company will evaluate its primary beneficiary designation on an ongoing basis and will assess the appropriateness of the Retail Joint Venture's VIE status when changes occur.    \nAs of December 31, 2024 and 2023, the Retail Joint Venture had total assets of $\n100.3\n million and $\n102.5\n million, respectively, and total liabilities of $\n605.8\n million and $\n621.9\n million, respectively. The Retail Joint Venture's total liabilities as of December 31, 2024 and 2023 included long-term debt of $\n597.3\n million and $\n614.1\n million, respectively, net of debt issuance costs, related to the outstanding borrowings under the Retail Term Loan.\nNote 20 - \nSegment Information\nThe Company has identified its reportable segments based on factors such as geography, regulatory environment, the Company's organizational and management reporting structure and the information reviewed by its chief operating decision maker, the Company's Chief Executive Officer. The primary profitability measure used by the Company's CEO to review segment operating results and allocate resources is Adjusted Property EBITDAR. \nThe Company has identified the following reportable segments: (i) Wynn Macau, representing the aggregate of Wynn Macau and Encore, an expansion at Wynn Macau, which are managed as a single integrated resort; (ii) Wynn Palace; (iii) Las Vegas Operations, representing the aggregate of Wynn Las Vegas, Encore, an expansion at Wynn Las Vegas, and the Retail Joint Venture, which are managed as a single integrated resort; and (iv) Encore Boston Harbor. For geographical reporting purposes, Wynn Macau, Wynn Palace, and Other Macau (which represents the assets of the Company's Macau holding company and other ancillary entities) have been aggregated into Macau Operations. Corporate and other is presented solely for the purpose of reconciliation and is not a reportable segment. During the twelve months ended December 31, 2024,\n Wynn Interactive Ltd. no longer met the requirements for a reportable segment. As a result, its assets and results of operations are presented in Corporate and other and previous period amounts have been reclassified to be consistent with the current period presentation.\nThe following tables present the Company's segment information (in thousands):\n108 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nYear Ended December 31, 2024\nWynn Palace\nWynn Macau\nLas Vegas Operations\nEncore Boston Harbor\nCorporate and Other\nTotal\nOperating revenues\nCasino\n$\n1,795,604\n \n$\n1,230,351\n \n$\n600,088\n \n$\n635,314\n \n$\n—\n \n$\n4,261,357\n \nRooms\n202,936\n \n100,631\n \n845,660\n \n92,831\n \n—\n \n1,242,058\n \nFood and beverage\n125,398\n \n80,779\n \n778,538\n \n84,402\n \n—\n \n1,069,117\n \nEntertainment, retail and other\n(1)\n93,733\n \n52,885\n \n347,627\n \n44,617\n \n16,567\n \n555,429\n \nTotal operating revenues\n2,217,671\n \n1,464,646\n \n2,571,913\n \n857,164\n \n16,567\n \n7,127,961\n \nCost of revenue\n(2)\n533,331\n \n410,810\n \n1,549,877\n \n422,974\n \n17,283\n \nGaming taxes\n(3)\n950,630\n \n611,984\n \n75,274\n \n187,062\n \n3,819\n \nAdjusted Property EBITDAR\n(4)\n$\n733,710\n \n$\n441,852\n \n$\n946,762\n \n$\n247,128\n \n$\n(\n4,535\n)\n$\n2,364,917\n \nOther operating expenses\nPre-opening\n9,355\n \nDepreciation and amortization\n658,895\n \nProperty charges and other\n(5)\n215,095\n \nCorporate expense and other\n148,236\n \nStock-based compensation\n59,029\n \nTriple-net operating lease expense\n141,576\n \nTotal other operating expenses\n1,232,186\n \nOperating income\n1,132,731\n \nOther non-operating income and expenses\nInterest income\n130,342\n \nInterest expense, net of amounts capitalized\n(\n688,410\n)\nChange in derivatives fair value\n42,478\n \nLoss on debt financing transactions\n(\n2,913\n)\nOther\n29,170\n \nTotal other non-operating income and expenses\n(\n489,333\n)\nIncome before income taxes\n643,398\n \nProvision for income taxes\n(\n3,682\n)\nNet income\n639,716\n \nNet income attributable to noncontrolling interests\n(\n138,638\n)\nNet income attributable to Wynn Resorts, Limited\n$\n501,078\n \n109 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nYear Ended December 31, 2023\nWynn Palace\nWynn Macau\nLas Vegas Operations\nEncore Boston Harbor\nCorporate and Other\nTotal\nOperating revenues\nCasino\n$\n1,471,280\n \n$\n970,269\n \n$\n628,185\n \n$\n648,668\n \n$\n—\n \n$\n3,718,402\n \nRooms\n201,783\n \n109,308\n \n784,385\n \n90,195\n \n—\n \n1,185,671\n \nFood and beverage\n104,566\n \n68,017\n \n770,401\n \n85,653\n \n—\n \n1,028,637\n \nEntertainment, retail and other\n(1)\n109,215\n \n65,940\n \n297,635\n \n41,270\n \n85,127\n \n599,187\n \nTotal operating revenues\n1,886,844\n \n1,213,534\n \n2,480,606\n \n865,786\n \n85,127\n \n6,531,897\n \nCost of revenue\n(2)\n486,909\n \n378,178\n \n1,458,789\n \n418,784\n \n106,752\n \nGaming taxes\n(3)\n784,089\n \n497,265\n \n75,574\n \n189,593\n \n21,021\n \nAdjusted Property EBITDAR\n(4)\n$\n615,846\n \n$\n338,091\n \n$\n946,243\n \n$\n257,409\n \n$\n(\n42,646\n)\n$\n2,114,943\n \nOther operating expenses\nPre-opening\n9,468\n \nDepreciation and amortization\n687,270\n \nImpairment of goodwill and intangible assets\n94,490\n \nProperty charges and other\n(5)\n130,877\n \nCorporate expense and other\n146,430\n \nStock-based compensation\n64,515\n \nTriple-net operating lease expense\n141,722\n \nTotal other operating expenses\n1,274,772\n \nOperating income\n840,171\n \nOther non-operating income and expenses\nInterest income\n175,785\n \nInterest expense, net of amounts capitalized\n(\n751,509\n)\nChange in derivatives fair value\n45,098\n \nLoss on debt financing transactions\n(\n12,683\n)\nOther\n(\n11,479\n)\nTotal other non-operating income and expenses\n(\n554,788\n)\nIncome before income taxes\n285,383\n \nBenefit for income taxes\n496,834\n \nNet income\n782,217\n \nNet loss attributable to noncontrolling interests\n(\n52,223\n)\nNet income attributable to Wynn Resorts, Limited\n$\n729,994\n \n110 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nYear Ended December 31, 2022\nWynn Palace\nWynn Macau\nLas Vegas Operations\nEncore Boston Harbor\nCorporate and Other\nTotal\nOperating revenues\nCasino\n$\n255,886\n \n$\n216,639\n \n$\n535,279\n \n$\n624,738\n \n$\n—\n \n$\n1,632,541\n \nRooms\n40,079\n \n25,691\n \n651,291\n \n85,078\n \n—\n \n802,138\n \nFood and beverage\n35,546\n \n25,334\n \n702,515\n \n82,818\n \n—\n \n846,214\n \nEntertainment, retail and other\n(1)\n78,778\n \n43,585\n \n243,051\n \n38,439\n \n72,078\n \n475,932\n \nTotal operating revenues\n410,289\n \n311,249\n \n2,132,136\n \n831,073\n \n72,078\n \n3,756,825\n \nCost of revenue\n(2)\n365,064\n \n319,443\n \n1,265,818\n \n405,413\n \n148,233\n \nGaming taxes\n(3)\n141,782\n \n115,853\n \n65,223\n \n182,274\n \n22,335\n \nAdjusted Property EBITDAR\n(4)\n$\n(\n96,557\n)\n$\n(\n124,047\n)\n$\n801,095\n \n$\n243,386\n \n$\n(\n98,490\n)\n$\n725,387\n \nOther operating expenses\nPre-opening\n20,643\n \nDepreciation and amortization\n692,318\n \nGain on EBH Transactions, net\n(\n181,989\n)\nImpairment of goodwill and intangible assets\n48,036\n \nProperty charges and other\n65,116\n \nCorporate expense and other\n102,539\n \nStock-based compensation\n67,627\n \nTriple-net operating lease expense\n11,773\n \nTotal other operating expenses\n826,063\n \nOperating loss\n(\n100,676\n)\nOther non-operating income and expenses\nInterest income\n29,758\n \nInterest expense, net of amounts capitalized\n(\n650,885\n)\nChange in derivatives fair value\n15,956\n \nLoss on debt financing transactions\n—\n \nOther\n5,811\n \nTotal other non-operating income and expenses\n(\n599,360\n)\nLoss before income taxes\n(\n700,036\n)\nProvision for income taxes\n(\n9,332\n)\nNet loss\n(\n709,368\n)\nNet income attributable to noncontrolling interests\n285,512\n \nNet loss attributable to Wynn Resorts, Limited\n$\n(\n423,856\n)\n(1)\nExcept for Corporate and other, includes lease revenue accounted for under lease accounting guidance. For more information on leases, see Note 16, \"Leases\". \n(2)\nPrimarily comprised of payroll, cost of goods sold, marketing, promotional, facilities, taxes and licenses (excluding gaming taxes) and other operating expenses.\n(3)\nFor Las Vegas Operations, includes table and slot license fees.\n111 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(4)\n\"Adjusted Property EBITDAR\" is net income (loss) before interest, income taxes, depreciation and amortization, pre-opening expenses, gain on EBH Transaction, net, impairment of goodwill and intangible assets, property charges and other expenses, triple-net operating lease rent expense related to Encore Boston Harbor, management and license fees, corporate expenses and other expenses (including intercompany golf course, meeting and convention, and water rights leases), stock-based compensation, change in derivatives fair value, loss on debt financing transactions, and other non-operating income and expenses. Adjusted Property EBITDAR is presented exclusively as a supplemental disclosure because management believes that it is widely used to measure the performance, and as a basis for valuation, of gaming companies. Management uses Adjusted Property EBITDAR as a measure of the operating performance of its segments and to compare the operating performance of its properties with those of its competitors, as well as a basis for determining certain incentive compensation. The Company also presents Adjusted Property EBITDAR because it is used by some investors to measure a company's ability to incur and service debt, make capital expenditures and meet working capital requirements. Gaming companies have historically reported EBITDAR as a supplement to GAAP. In order to view the operations of their casinos on a more stand-alone basis, gaming companies, including us, have historically excluded from their EBITDAR calculations pre-opening expenses, property charges, corporate expenses and stock-based compensation, that do not relate to the management of specific casino properties. However, Adjusted Property EBITDAR should not be considered as an alternative to operating income (loss) as an indicator of the Company's performance, as an alternative to cash flows from operating activities as a measure of liquidity, or as an alternative to any other measure determined in accordance with GAAP. Unlike net income (loss), Adjusted Property EBITDAR does not include depreciation or interest expense and therefore does not reflect current or future capital expenditures or the cost of capital. The Company has significant uses of cash flows, including capital expenditures, triple-net operating lease rent expense related to Encore Boston Harbor, interest payments, debt principal repayments, income taxes and other non-recurring charges, which are not reflected in Adjusted Property EBITDAR. Also, the Company's calculation of Adjusted Property EBITDAR may be different from the calculation methods used by other companies and, therefore, comparability may be limited.\n(5)\nFor the year ended December 31, 2024, includes $\n130.0\n million of forfeitures pursuant to the NPA, the Company's $\n9.4\n million contribution towards a legal settlement, $\n16.9\n million of contract termination and other costs related to the closure of Wynn Interactive's digital sports betting and casino gaming business. Property charges and other expenses for the year ended December 31, 2024 also included $\n61.5\n million of expensed project costs related to a discontinued development project, partially offset by a gain of $\n24.6\n million related to the sale of certain Wynn Interactive assets. For the year ended December 31, 2023, includes $\n94.9\n million related to the Company's decision to cease operating Wynn Interactive's online sports betting and iGaming platform in certain jurisdictions.\n112 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nYear Ended December 31,\n2024\n2023\n2022\nCapital expenditures\nMacau Operations:\nWynn Palace\n$\n107,458\n \n$\n66,262\n \n$\n31,946\n \nWynn Macau\n57,669\n \n25,602\n \n13,003\n \nTotal Macau Operations\n165,127\n \n91,864\n \n44,949\n \nLas Vegas Operations\n159,789\n \n187,150\n \n226,386\n \nEncore Boston Harbor\n32,652\n \n70,578\n \n20,187\n \nCorporate and other\n62,361\n \n93,201\n \n8,605\n \nTotal\n$\n419,929\n \n$\n442,793\n \n$\n300,127\n \nDecember 31,\n2024\n2023\n2022\nAssets\nMacau Operations:\nWynn Palace\n$\n2,813,190\n \n$\n2,936,264\n \n$\n2,884,073\n \nWynn Macau\n1,412,795\n \n1,864,211\n \n1,430,051\n \nOther Macau\n778,928\n \n886,175\n \n268,017\n \nTotal Macau Operations\n5,004,913\n \n5,686,650\n \n4,582,141\n \nLas Vegas Operations\n3,157,399\n \n3,173,247\n \n3,168,597\n \nEncore Boston Harbor\n1,980,420\n \n2,006,565\n \n2,080,424\n \nCorporate and other\n2,835,231\n \n3,129,761\n \n3,583,938\n \nTotal\n$\n12,977,963\n \n$\n13,996,223\n \n$\n13,415,100\n \nDecember 31,\n2024\n2023\n2022\nLong-lived assets\nMacau\n$\n3,095,411\n \n$\n3,191,134\n \n$\n3,382,284\n \nUnited States\n6,019,723\n \n5,585,943\n \n5,570,249\n \nTotal\n$\n9,115,134\n \n$\n8,777,077\n \n$\n8,952,533\n \n113 \nTable of Contents\nWYNN RESORTS, LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\nQuarterly Consolidated Financial Information (Unaudited)\nThe following tables (in thousands, except per share data) present selected quarterly financial information for 2024 and 2023, as previously reported. Because income (loss) per share amounts are calculated using the weighted average number of common and dilutive common equivalent shares outstanding during each quarter, the sum of the per share amounts for the four quarters may not equal the total income per share amounts for the year.\nYear Ended December 31, 2024\nFirst\nSecond\nThird\nFourth\nYear\nOperating revenues \n$\n1,862,909 \n$\n1,732,932 \n$\n1,693,323 \n$\n1,838,797 \n$\n7,127,961 \nOperating income\n$\n362,941 \n$\n269,658 \n$\n133,237 \n$\n366,895 \n$\n1,132,731 \nNet income (loss)\n$\n176,498 \n$\n146,273 \n$\n(5,415)\n$\n322,360 \n$\n639,716 \nNet income (loss) attributable to Wynn Resorts, Limited\n$\n144,216 \n$\n111,943 \n$\n(32,053)\n$\n276,972 \n$\n501,078 \nBasic income (loss) per share\n$\n1.30 \n$\n1.01 \n$\n(0.29)\n$\n2.56 \n$\n4.56 \nDiluted income (loss) per share\n$\n1.30 \n$\n0.91 \n$\n(0.29)\n$\n2.29 \n$\n4.35 \n \nYear Ended December 31, 2023\nFirst\nSecond\nThird\nFourth\nYear\nOperating revenues\n$\n1,423,679 \n$\n1,595,822 \n$\n1,671,936 \n$\n1,840,460 \n$\n6,531,897 \nOperating income\n$\n169,515 \n$\n250,336 \n$\n62,595 \n$\n357,725 \n$\n840,171 \nNet income (loss)\n$\n1,146 \n$\n127,835 \n$\n(120,541)\n$\n773,777 \n$\n782,217 \nNet income (loss) attributable to Wynn Resorts, Limited\n$\n12,332 \n$\n105,184 \n$\n(116,678)\n$\n729,156 \n$\n729,994 \nBasic income (loss) per share\n$\n0.11 \n$\n0.93 \n$\n(1.03)\n$\n6.53 \n$\n6.49 \nDiluted income (loss) per share\n$\n(0.02)\n$\n0.84 \n$\n(1.03)\n$\n6.19 \n$\n6.32 \n114 \nTable\n of Contents\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A. Controls and Procedures\nDisclosure Controls and Procedures\nThe Company's management, with the participation of the Company's Chief Executive Officer (\"CEO\") and Chief Financial Officer (\"CFO\"), has evaluated the effectiveness of the Company's disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\")) as of the end of the period covered by this annual report. In designing and evaluating the disclosure controls and procedures, management recognized that any controls and procedures, no matter how well designed and operated, can only provide reasonable assurance of achieving the desired control objectives and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Based on such evaluation, the Company's CEO and CFO have concluded that, as of the period covered by this annual report, the Company's disclosure controls and procedures were effective, at the reasonable assurance level, in recording, processing, summarizing and reporting, on a timely basis, information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act and were effective in ensuring that information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the Company's management, including the Company's CEO and CFO, as appropriate to allow timely decisions regarding required disclosure.\nManagement's Report on Internal Control Over Financial Reporting\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rule 13a-15(f) and 15d-15(f) under the Exchange Act.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risks that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Management assessed the effectiveness of the Company's internal control over financial reporting as of December 31, 2024. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\") in \nInternal Control-Integrated Framework \n(2013). Based on our assessment, management believes that, as of December 31, 2024, our internal control over financial reporting was effective based on those criteria.\nThe effectiveness of our internal control over financial reporting as of December 31, 2024 has been audited by Ernst & Young, LLP, an independent registered public accounting firm. Their attestation report appears under \"Report of Independent Registered Public Accounting Firm on Internal Control Over Financial Reporting.\"\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the quarter ended December 31, 2024 that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B. Other Information\nInsider Trading Arrangements.\nNone of the Company's directors or officers (as defined in Section 16 of the Exchange Act) \nadopted\n or \nterminated\n a \"Rule 10b5-1 trading arrangement\" or a \"non-Rule 10b5-1 trading arrangement\" (each as defined in Item 408(a) and (c) of Regulation S-K) during the Company’s fiscal quarter ended December 31, 2024.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections \nNot applicable. \n115 \nTable\n of Contents\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nThe \ninformation required by this item will be contained in the Registrant's definitive Proxy Statement for its 2025 Annual Meeting of Shareholders to be filed with the Securities and Exchange Commission within 120 days after December 31, 2024 (the \"2025 Proxy Statement\") under the captions \"Election of Directors,\" \"Executive Officers,\" \"Governance\" and \"Delinquent Section 16(a) Reports,\" and is incorporated herein by reference.\nAs part of the Company's commitment to integrity, the Board of Directors has adopted a Code of Business Conduct and Ethics (\"Code\") applicable to all directors, officers and employees of the Company and its subsidiaries. This Code is periodically reviewed by the Board of Directors. In the event we determine to amend certain provisions of this Code, or the Board of Directors grants any waivers of its requirements for any of our directors or executive officers, we intend to disclose such amendments or waivers on our website at https://wynnresortslimited.gcs-web.com/corporate-governance/code-business-conduct-and-ethics to the extent required by the Nasdaq listing standards.\nItem 11. Executive Compensation\nThe information called for by this item will be contained in the 2025 Proxy Statement under the captions \"Non-Employee Director Compensation Table,\" \"Compensation Committee Report,\" \"Executive Compensation Tables,\" \"Summary Compensation Table\" and \"Compensation Discussion and Analysis\" and is incorporated herein by reference. Although the Compensation Committee Report is being incorporated herein by reference, it shall not be deemed to be \"filed\" for purposes of Section 18 of the Exchange Act.  \nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nCertain information required by this item will be contained in the 2025 Proxy Statement under the caption \"Certain Beneficial Ownership and Management\" and is incorporated herein by reference. \nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following table summarizes compensation plans under which our equity securities are authorized for issuance, aggregated as to: (i) all compensation plans previously approved by stockholders, and (ii) all compensation plans not previously approved by stockholders. \nPlan Category\nNumber of\nSecurities to\nbe Issued\nUpon\nExercise of\nOutstanding\nOptions,\nWarrants\nand Rights\n(a)\nWeighted-\nAverage\nExercise\nPrice of\nOutstanding\nOptions,\nWarrants\nand Rights\n(b)\nNumber of\nSecurities\nRemaining\nAvailable for\nFuture Issuance\nUnder Equity\nCompensation\nPlans (Excluding Securities Reflected in Column (a))\n(c)\nEquity compensation plans approved by security holders\n6,700 \n$\n68.25 \n3,000,262 \nEquity compensation plans not approved by security holders\n— \n— \n— \nTotal\n6,700 \n$\n68.25 \n3,000,262 \nItem 13. Certain Relationships and Related Transactions, and Director Independence\nThe information called for by this item will be contained in the 2025 Proxy Statement under the captions \"Certain Relationships and Transactions\" and \"Governance\" and is incorporated herein by reference.\nItem 14. Principal Accountant Fees and Services\nThe information called for by this item will be contained in the 2025 Proxy Statement under the caption \"Ratification of Appointment of Registered Public Accounting Firm\" and is incorporated herein by reference.   \n116 \nTable\n of Contents\nPART IV\nItem 15. Exhibits and Financial Statement Schedules\n(a)1. The following consolidated financial statements of the Company are filed as part of this report under Item 8—\"Financial Statements and Supplementary Data.\"\n•\nReports of Independent Registered Public Accounting Firm\n•\nConsolidated Balance Sheets as of December 31, 2024 and 2023 \n•\nConsolidated Statements of Operations for the years ended December 31, 2024, 2023, and 2022 \n•\nConsolidated Statements of Comprehensive Income (Loss) for the years ended December 31, 2024, 2023, and 2022 \n•\nConsolidated Statements of Stockholders' Deficit for the years ended December 31, 2024, 2023, and 2022 \n•\nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023, and 2022 \n•\nNotes to Consolidated Financial Statements\n•\nQuarterly Consolidated Financial Information (Unaudited)\n(a)2.  Financial Statement Schedule filed in Part IV of this report:\n•\nSchedule II—Valuation and Qualifying Accounts\nWe have omitted all other financial statement schedules because they are not required or are not applicable, or the required information is shown in the consolidated financial statements or notes to the consolidated financial statements.\nSCHEDULE II\n—\nVALUATION AND QUALIFYING ACCOUNTS\n(in thousands)\nDescription\nBalance at\nBeginning of\nYear\nProvision for\nCredit Losses\nWrite-offs,\nNet of\nRecoveries\nBalance at\nEnd of Year\nAllowance for credit losses:\n2024\n$\n40,075\n \n4,986\n \n(\n7,367\n)\n$\n37,694\n \n2023\n$\n78,842\n \n(\n3,964\n)\n(\n34,803\n)\n$\n40,075\n \n2022\n$\n111,319\n \n(\n7,295\n)\n(\n25,182\n)\n$\n78,842\n \nDescription\nBalance at\nBeginning of\nYear\nAdditions\nDeductions\nBalance at\nEnd of Year\nDeferred income tax asset valuation allowance:\n2024\n$\n1,340,581\n \n50,568\n \n(\n786,504\n)\n$\n604,645\n \n2023\n$\n2,437,202\n \n96,623\n \n(\n1,193,244\n)\n$\n1,340,581\n \n2022\n$\n2,501,263\n \n108,150\n \n(\n172,211\n)\n$\n2,437,202\n \n117 \nTable\n of Contents\n(a)3. Exhibits\nExhibits that are not filed herewith have been previously filed with the SEC and are incorporated herein by reference.\nIncorporated by Reference\nExhibit\nNo.\nDescription\nForm\nFiling Date\n2.1\nEquity Purchase Agreement, dated as of February 14, 2022 by and between Wynn MA, LLC and Realty Income Corporation. \n8-K\n2/14/2022\n3.1\nThird Amended and Restated Articles of Incorporation of the Registrant.\n10-Q\n5/8/2015\n3.2\nNinth Amended and Restated Bylaws of the Registrant.\n10-K\n2/28/2020\n4.1.0\nSpecimen certificate for shares of Common Stock, $0.01 par value per share of the Registrant.\nS-1\n10/7/2002\n4.1.1\nIndenture, dated as of April 14, 2020, by and among Wynn Resorts Finance, LLC, and Wynn Resorts Capital Corp., as joint and several obligors and the Guarantors named therein and U.S. Bank National Association, as trustee.\n10-Q\n5/8/2020\n4.1.2\nIndenture, dated as of June 17, 2020, by and between Wynn Macau, Limited and Deutsche Bank Trust Company Americas, as trustee, related to senior notes due 2026.\n10-Q\n8/6/2020\n4.1.3\nIndenture, dated as of August 26, 2020, by and between Wynn Macau, Limited and Deutsche Bank Trust Company Americas, as trustee, related to senior notes due 2028.\n10-Q\n11/9/2020\n4.1.4\nSupplemental Indenture, dated February 23, 2024, by and among Wynn Resorts Finance, LLC, and Wynn Resorts Capital Corp., as joint and several obligors and the Guarantors named therein and U.S. Bank National Association, as trustee.\n8-K\n2/23/2024\n4.1.5\nIndenture, dated September 20, 2024, by and among Wynn Resorts Finance, LLC, and Wynn Resorts Capital Corp., as joint and several obligors and the Guarantors named therein and U.S. Bank National Association, as trustee.\n8-K\n9/20/2024\n4.2\nDescription of Registrant's Securities.\n10-K\n2/23/2024\n4.3\nIndenture, dated as of May 22, 2013, by and among Wynn Las Vegas, LLC, Wynn Las Vegas Capital Corp., the Guarantors named therein and U.S. Bank National Association, as trustee.\n8-K\n5/22/2013\n4.4\nSupplemental Indenture, dated as of February 18, 2015, to Indenture, dated as of May 22, 2013, by and among Wynn Las Vegas, LLC, Wynn Las Vegas Capital Corp., the Guarantors named therein and U.S. Bank National Association, as trustee.\n10-K\n3/2/2015\n4.5\nSecond Supplemental Indenture, dated as of March 20, 2018, to Indenture, dated as of May 22, 2013, by and among Wynn Las Vegas, LLC, Wynn Las Vegas Capital Corp., the guarantors party thereto and U.S. Bank National Association.\n8-K\n3/21/2018\n4.6\nIndenture, dated as of February 18, 2015, by and among Wynn Las Vegas, LLC, Wynn Las Vegas Capital Corp., the Guarantors named therein and U.S. Bank National Association, as trustee.\n8-K\n2/18/2015\n4.7\nIndenture, dated as of May 11, 2017, by and among Wynn Las Vegas, LLC, Wynn Las Vegas Capital Corp., the Guarantors named therein and U.S. Bank National Association, as trustee.\n8-K\n5/11/2017\n4.8\nIndenture, dated as of September 20, 2017, by and between Wynn Macau, Limited and Deutsche Bank Trust Company Americas, as trustee, relating to senior notes due 2024.\n10-Q\n11/8/2017\n4.9\nIndenture, dated as of September 20, 2017, by and between Wynn Macau, Limited and Deutsche Bank Trust Company Americas, as trustee, relating to senior notes due 2027.\n10-Q\n11/8/2017\n4.10\nIndenture, dated as of December 17, 2019, by and between Wynn Macau, Limited and Deutsche Bank Trust Company Americas, as trustee, related to senior notes due 2029. \n10-K\n2/28/2020\n4.11\nIndenture, dated as of September 20, 2019, by and among Wynn Resorts Finance, LLC, and Wynn Resorts Capital Corp., as joint and several obligors and the Guarantors named therein and U.S. Bank National Association, as trustee.\n10-Q\n11/6/2019\n118 \nTable\n of Contents\n4.12\nIndenture, dated as of February 16, 2023, by and among Wynn Resorts Finance, LLC, and Wynn Resorts Capital Corp., as joint and several obligors and the Guarantors named therein and U.S. Bank National Association, as trustee.\n8-K\n2/16/2023\n4.13\nTrust Deed, dated as of March 7, 2023, by and between Wynn Macau, Limited and DB Trustees (Hong Kong) Limited, as trustee, relating to convertible bonds due 2029 convertible into ordinary shares of Wynn Macau, Limited.\n8-K\n3/7/2023\n4.14\nAgency Agreement, dated as of March 7, 2023, by and between Wynn Macau, Limited, DB Trustees (Hong Kong) Limited, as trustee, and Deutsche Bank Trust Company Americas, as principal paying agent, principal conversion agent, transfer agent and registrar, relating to convertible bonds due 2029 convertible into ordinary shares of Wynn Macau, Limited.\n8-K\n3/7/2023\n4.15\nIndenture, dated September 20, 2024, by and among Wynn Resorts Finance, LLC, and Wynn Resorts Capital Corp., as joint and several obligors and the Guarantors named therein and U.S. Bank National Association, as trustee\n.\n8-K\n9/20/2024\n10.1.0\nCredit Agreement, dated as of September 20, 2019, by and among Wynn Resorts Finance, LLC, as borrower, the subsidiaries of borrower party hereto, as guarantors, Deutsche Bank AG New York Branch, as administrative agent and as collateral agent.\n10-Q\n11/6/2019\n10.1.1\nIncremental Joinder Agreement No. 1, dated as of March 8, 2019, by and among Wynn Resorts, Limited, as borrower, Wynn Group Asia, Inc. and Wynn Resorts Holdings, LLC, as Guarantors, and Deutsche Bank AG New York Branch, as administrative agent.\n10-Q\n5/9/2019\n10.1.2\nFirst Amendment to Credit Agreement, dated as of April 10, 2020, by and among Wynn Resorts Finance, LLC, as borrower, the subsidiaries of borrower party hereto, as guarantors, Deutsche Bank AG New York Branch, as administrative agent and as collateral agent.\n10-Q\n5/8/2020\n10.1.3\nFirst Amendment to Term Loan Agreement, dated as of May 5, 2020, by and among Wynn/CA Plaza Property Owner, LLC and Wynn/CA Property Owner, LLC, as borrowers, United Overseas Bank Limited, New York Agency, as administrative agent, and the lenders party thereto.\n10-Q\n8/6/2020\n10.1.4\nAmendment No. 2 to Credit Agreement, dated as of November 27, 2020, by and among Wynn Resorts Finance, LLC, as borrower, the subsidiaries of borrower party hereto, as guarantors, Deutsche Bank AG New York Branch, as administrative agent.\n10-K\n2/26/2021\n10.1.5\nAmendment No. 3 to Credit Agreement, dated as of May 17, 2023, by and among Wynn Resorts Finance, LLC, as borrower, the subsidiaries of borrower party hereto, as guarantors, Deutsche Bank AG New York Branch, as administrative agent.\n8-K\n5/17/2023\n10.1.6\nExhibit A to Amendment No. 3 - Credit Agreement, dated as of September 20, 2019 (as amended by Amendment No. 1 dated as of April 10, 2020, Amendment No. 2 dated as of November 27, 2020, and Amendment No. 3 dated as of May 17, 2023), by and among Wynn Resorts Finance, LLC, as borrower, the subsidiaries of borrower party hereto, as guarantors, Deutsche Bank AG New York Branch, as administrative agent and as collateral agent. \n8-K\n5/17/2023\n10.1.7\nConcession Extension Contract for the Operation of Games of Chance or Other Games in Casinos in the Macau Special Administrative Region, dated June 23, 2022, between the Macau Special Administrative Region and Wynn Resorts (Macau), S.A.\n10-Q\n8/9/2022\n10.1.8\nLease, dated as of December 1, 2022 by and among EBH MA Property, LLC, MDC Encore Holdings, LLC, Wynn MA, LLC and Everett Property, LLC.\n8-K\n12/1/2022\n10.1.9\nAmendment No. 4 to Credit Agreement, dated as of September 16, 2024, by and among Wynn Resorts Finance, LLC, as borrower, the subsidiaries of borrower party hereto, as guarantors, Deutsche Bank AG New York Branch, as administrative agent.\n8-K\n9/16/2024\n10.1.10\nExhibit A to Amendment No. 4 - Credit Agreement, dated as of September 20, 2019 (as amended by Amendment No. 1 dated as of April 10, 2020, Amendment No. 2 dated as of November 27, 2020, and Amendment No. 3 dated as of May 17, 2023, Amendment No. 4 dated as of September 16, 2024), by and among Wynn Resorts Finance, LLC, as borrower, the subsidiaries of borrower party hereto, as guarantors, Deutsche Bank AG New York Branch, as administrative agent and as collateral agent\n.\n8-K\n9/16/2024\n119 \nTable\n of Contents\n10.2.1\nCommon Terms Agreement Sixth Amendment Agreement, dated December 21, 2018, between, among others, Wynn Resorts (Macau) S.A. as the company and Bank of China Limited, Macau Branch as security agent. \n10-Q\n2/28/2019\n10.2.2\nTerm Facility Agreement Fifth Amendment Agreement, dated December 21, 2018, by and among Wynn Resorts (Macau) S.A. and Bank of China Limited, Macau Branch as Hotel Facility Agent and Hotel Facility Lender. \n10-Q\n2/28/2019\n10.2.3\nRevolving Credit Facility Agreement Second Amendment Agreement, dated as of December 21, 2018, by and among Wynn Resorts (Macau) S.A. and Bank of China Limited, Macau Branch as Revolving Credit Facility Agent and Revolving Credit Facility Lender. \n10-Q\n2/28/2019\n10.2.4\nCommon Terms Agreement Fifth Amendment Agreement, dated September 30, 2015, between, among others, Wynn Resorts (Macau) S.A. as the company and Bank of China Limited, Macau Branch as security agent.\n10-Q\n11/6/2015\n10.2.5\nTerm Facility Agreement Fourth Amendment Agreement, dated September 30, 2015, by and among Wynn Resorts (Macau) S.A. and Bank of China Limited, Macau Branch as Hotel Facility Agent and Hotel Facility Lender.\n10-Q\n11/6/2015\n10.2.6\nRevolving Credit Facility Agreement Amendment Agreement, dated as of September 30, 2015, by and among Wynn Resorts (Macau) S.A. and Bank of China Limited, Macau Branch as Revolving Credit Facility Agent and Revolving Credit Facility Lender.\n10-Q\n11/6/2015\n10.2.7\nDebenture, dated as of September 14, 2004, between Wynn Resorts (Macau), S.A. and Société Générale, Hong Kong Branch as the Security Agent.\n10-Q\n11/4/2004\n10.2.8\nSecond Amendment Agreement to the Existing Facility Agreement, dated as of September 20, 2024, by and among WM Cayman Holdings Limited II, as borrower, Wynn Macau, Limited, as guarantor, and Bank of China Limited, Macau Branch, as agent and a syndicate of lenders.\n8-K\n9/23/2024\n10.3.0\nTerm Loan Agreement, dated as of July 25, 2018, by and among Wynn/CA Plaza Property Owner, LLC and Wynn/CA Property Owner, LLC, as borrowers, United Overseas Bank Limited, New York Agency, as administrative agent and lead arranger, Fifth Third Bank, as joint lead arranger, Sumitomo Mitsui Banking Corporation, as joint lead arranger, Credit Agricole Corporate and Investment Bank, as managing agent, and the lenders party thereto.\n10-Q\n7/30/2018\n10.3.0.1\nSecond Amendment to Term Loan Agreement, dated as of June 2, 2023, by and among Wynn/CA Plaza Property Owner, LLC and Wynn/CA Property Owner, LLC, as borrowers, United Overseas Bank Limited, New York Agency, as administrative agent, and the lenders party thereto. \n8-K\n6/5/2023\n10.3.1\nFacility Agreement, dated as of September 16, 2021, by and among WM Cayman Holdings Limited II, as borrower, Wynn Macau, Limited, as guarantor, and Bank of China Limited, Macau Branch, as agent and a syndicate of lenders.\n10-Q\n11/9/2021\n10.3.2\nAmendment to the Facility Agreement, dated as of May 5, 2022, by and among WM Cayman Holdings Limited II, as borrower, Wynn Macau, Limited, as guarantor, and Bank of China Limited, Macau Branch, as agent and a syndicate of lenders.\n10-Q\n5/10/2022\n10.3.3\nAmendment and Restatement Agreement to Facility Agreement, dated as of June 27, 2023, by and among WM Cayman Holdings Limited II, as borrower, Wynn Macau, Limited, as guarantor, Bank of China Limited, Macau Branch, as agent and a syndicate of lenders party thereto. \n8-K\n6/30/2023\n10.3.4\nThird Amendment to Term Loan Agreement and First Amendment to Recourse Indemnity Agreement, dated as of October 2, 2024, by and among Wynn/CA Plaza Property Owner, LLC and Wynn/CA Property Owner, LLC, as borrowers, United Overseas Bank Limited, New York Agency, as administrative agent, and the guarantors and lenders party thereto.\n8-K\n10/3/2024\n10.4.1\nConcession Contract for the Operation of Games of Chance or Other Games in Casinos in the Macau Special Administrative Region, dated June 24, 2002, between the Macau Special Administrative Region and Wynn Resorts (Macau), S.A. (English translation of Portuguese version of Concession Agreement).\n10-Q\n8/20/2002\n10.4.2\nConcession Contract for Operating Casino Gaming or Other Forms of Gaming in the Macau Special Administrative Region, dated June 24, 2002, between the Macau Special Administrative Region and Wynn Resorts (Macau), S.A. (English translation of Chinese version of Concession Agreement).\n10-Q\n9/18/2002\n120 \nTable\n of Contents\n10.4.3\nUnofficial English translation of Land Concession Contract between the Macau Special Administrative Region and Wynn Resorts (Macau), S.A.\n10-Q\n8/3/2004\n10.4.4\nLand Concession Contract, published on May 2, 2012, by and among Palo Real Estate Company Limited, Wynn Resorts (Macau), S.A. and the Macau Special Administrative Region of the People's Republic of China (translated to English from traditional Chinese and Portuguese).\n10-Q\n5/2/2012\n10.4.5\nBank Guarantee Reimbursement Agreement, dated as of September 14, 2004, between Wynn Resorts (Macau), S.A. and Banco Nacional Ultramarino.\n10-Q\n11/4/2004\n10.4.6\nConcession Contract for Operating Casino Gaming or Other Forms of Gaming in the Macau Special Administrative Region, dated December 16, 2022, between the Macau Special Administrative Region and Wynn Resorts (Macau), S.A. (English translation of Chinese version).\n10-K\n2/27/2023\n10.4.7\nDeed of Reversion (Wynn Palace), dated as of December 30, 2022, by and among Wynn Resorts (Macau) S.A., Palo Real Estate Company Limited, and the Macau Special Administrative Region.\n10-K\n2/27/2023\n10.4.8\nDeed of Reversion (Wynn Macau), dated as of December 30, 2022, by and among Wynn Resorts (Macau) S.A. and the Macau Special Administrative Region.\n10-K\n2/27/2023\n10.4.9\nHandover Deed, dated as of December 30, 2022, by and between Wynn Resorts (Macau) S.A. and the Macau Special Administrative Region.\n10-K\n2/27/2023\n10.5.1\nCorporate Allocation Agreement, dated as of September 19, 2009, by Wynn Macau, Limited and Wynn Resorts, Limited.\n10-Q\n3/2/2015\n10.5.2\nAmended and Restated Corporate Allocation Agreement, dated as of September 19, 2009, by Wynn Resorts (Macau), S.A., and Wynn Resorts, Limited.\n10-Q\n3/2/2015\n10.5.3\nManagement Fee and Corporate Allocation Agreement, dated as of February 26, 2015, by and between Wynn Las Vegas, LLC and Wynn Resorts, Limited.\n10-Q\n3/2/2015\n10.5.4\nManagement Fee and Corporate Allocation Agreement, dated as of November 20, 2014, by and among Wynn MA, LLC and Wynn Resorts, Limited.\n10-Q\n2/29/2016\n10.6.1\nIntellectual Property License Agreement, dated as of September 19, 2009, by and among Wynn Resorts Holdings, LLC, Wynn Resorts, Limited and Wynn Macau, Limited.\n10-Q\n3/2/2015\n10.6.2\nAmended and Restated Intellectual Property License Agreement, dated as of September 19, 2009, by and among Wynn Resorts Holdings, LLC, Wynn Resorts, Limited and Wynn Resorts (Macau), S.A.\n10-Q\n3/2/2015\n10.6.3\n2015 Intellectual Property License Agreement, dated as of February 26, 2015, by and between Wynn Resorts Holdings, LLC, Wynn Resorts, Limited and Wynn Las Vegas, LLC.\n10-Q\n5/8/2015\n10.6.4\n2014 Intellectual Property License Agreement, dated as of November 20, 2014, by and between Wynn Resorts Holdings, LLC, Wynn Resorts, Limited and Wynn MA, LLC.\n10-Q\n2/29/2016\n10.6.5\nSurname Rights Agreement, dated as of August 6, 2004, by and between Stephen A. Wynn and Wynn Resorts Holdings, LLC.\n10-Q\n11/4/2004\n10.6.6\nRights of Publicity License, dated as of August 6, 2004, by and between Stephen A. Wynn and Wynn Resorts Holdings, LLC.\n10-Q\n11/4/2004\n10.6.7\nIntellectual Property License Agreement, dated as of January 1, 2025, by and between Wynn NKH, LLC, and Wynn Macau, Limited.\n10-K\n*\n10.6.8\nIntellectual Property License Agreement, dated as of January 1, 2025, by and between Wynn NKH, LLC, and Wynn Resorts (Macau), S.A.\n10-K\n*\n10.6.9\nIntellectual Property License Agreement, dated as of January 1, 2025, by and between Wynn Resorts, Holdings, LLC, Wynn Resorts, Limited and Wynn NKH, LLC.\n10-K\n*\n10.7.1\nSecond Amended and Restated Shareholders' Agreement, dated June 21, 2024, by and among Wynn Resorts, Limited, RAK Hospitality Holding LLC, Al Marjan Island LLC, Wynn Resorts FZ-LLC, RAK HH IR FZ-LLC, AMI Island 3 IR FZ-LLC and Island 3 AMI FZ-LLC.\n10-K\n*\n+10.7.2.0\nEmployment Agreement, dated as of January 27, 2017 by and between Wynn Resorts, Limited and Craig Billings.\n10-Q\n5/4/2017\n121 \nTable\n of Contents\n+10.7.2.1\nFirst Amendment to Employment Agreement, dated as of April 17, 2018, by and between Wynn Resorts, Limited and Craig S. Billings.\n10-Q\n5/9/2018\n+10.7.2.2\nSecond Amendment to Employment Agreement, dated as of May 29, 2019, by and between Wynn Resorts, Limited and Craig Billings.\n10-Q\n8/8/2019\n+10.7.2.3\nThird Amended and Restated Employment Agreement dated as of January 1, 2021, by and between Wynn Resorts, Limited and Craig S. Billings.\n10-K\n2/26/2021\n+10.7.2.4\nFourth Amended and Restated Employment Agreement dated as of May 24, 2021, by and between Wynn Resorts, Limited and Craig S. Billings.\n8-K\n5/24/2021\n+10.7.2.5\nEmployment Agreement, dated November 9, 2021, by and between Wynn Resorts, Limited and Craig S. Billings.\n10-Q\n11/9/2021\n+10.7.2.6\nFirst Amendment to Employment Agreement, dated as of June 1, 2023, by and between Wynn Resorts, Limited and Craig S. Billings.\n8-K\n6/2/2023\n+10.7.3.0\nEmployment Agreement, dated as of August 2, 2018, by and between Wynn Resorts, Limited and Ellen Whittemore.\n10-Q\n8/8/2018\n+10.7.3.1\nFirst Amendment to Employment Agreement, dated as of May 29, 2019, by and between Wynn Resorts, Limited and Ellen Whittemore.\n10-Q\n8/8/2019\n+10.7.3.2\nSecond Amended and Restated Employment Agreement dated as of January 1, 2021, by and between Wynn Resorts, Limited and Ellen F. Whittemore.\n10-K\n2/26/2021\n+10.7.3.3\nThird Amended and Restated Employment Agreement dated as of January 12, 2022, by and between Wynn Resorts, Limited and Ellen F. Whittemore.\n10-K\n2/28/2022\n+10.7.4.0\nEmployment Agreement, dated as of December 7, 2021 by and between Wynn Resorts, Limited and Julie Cameron-Doe.\n10-K\n2/28/2022\n+10.7.4.1\nFirst Amendment to Employment Agreement, dated as of April 13, 2022, by and between Wynn Resorts, Limited and Julie Cameron-Doe.\n10-Q\n5/10/2022\n+10.7.4.2\nSecond Amendment to Employment Agreement, dated as of June 1, 2023, by and between Wynn Resorts, Limited and Julie Cameron-Doe.\n8-K\n6/2/2023\n+10.7.5.1\nEmployment Agreement, dated as of\n September\n \n15\n, 2024 by and between Wynn Resorts, Limited and Jacqui Krum.\n10-K\n*\n+10.7.5.2\nFirst Amendment to Employment Agreement, dated as of\n November 25\n, 2024 by and between Wynn Resorts, Limited and Jacqui Krum.\n10-K\n*\n+10.8\nAmended and Restated 2014 Omnibus Incentive Plan, dated January 1, 2017.\n10-Q\n2/24/2017\n+10.9\nSecond Amended and Restated 2014 Omnibus Incentive Plan\nS-8\n8/12/2024\n10.10\nCooperation Agreement, dated as of August 3, 2018, by and between Wynn Resorts, Limited and Elaine P. Wynn. \n10-Q\n8/6/2018\n10.11\nSecond Amended and Restated Shareholders' Agreement, dated as of January 14, 2016, by and among Wynn Resorts (Macau), Ltd., Wynn Resorts International, Ltd., Chen Chi Ling Linda and Wynn Resorts (Macau), S.A.\n10-Q\n2/28/2018\n10.12\nForm of Indemnity Agreement.\n10-Q\n9/18/2002\n+10.13\nWynn Resorts, Limited Executive Retirement Plan\n10-K\n2/23/2024\n10.14\nGuarantee, dated as of February 5, 2025, between the Government of Ras Al Khaimah acting through the Investment and Development Office of Ras Al Khaimah and Wynn Resorts, Limited in favor of First Abu Dhabi Bank PJSC for itself and as security agent for the other Secured Parties.\n8-K\n2/6/2025\n19.1\nWynn Resorts, Limited Insider Trading Policy.\n10-K\n*\n21.1\nSubsidiaries of the Registrant.\n10-K\n*\n23.1\nConsent of Ernst & Young LLP, Independent Registered Accounting Firm.\n10-K\n*\n31.1\nCertification of Chief Executive Officer of Periodic Report Pursuant to Rule 13a – 14(a) and Rule 15d – 14(a).\n10-K\n*\n31.2\nCertification of Chief Financial Officer of Periodic Report pursuant to Rule 13a – 14(a) and Rule 15d – 14(a).\n10-K\n*\n32\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350 (furnished herewith)\n10-K\n*\n97\nWynn Resorts, Limited Clawback Policy\n10-K\n2/23/2024\n122 \nTable\n of Contents\n101\nThe following material from Wynn Resorts, Limited's Annual Report on Form 10-K, formatted in Inline XBRL (Inline Extensible Business Reporting Language): (i) the Consolidated Balance Sheets as of December 31, 2024 and December 31, 2023; (ii) the Consolidated Statements of Operations for the years ended December 31, 2024, 2023, and 2022; (iii) the Consolidated Statements of Comprehensive Income (Loss) for the years ended December 31, 2024, 2023, and 2022; (iv) the Consolidated Statements of Stockholders' Deficit for the years ended December 31, 2024, 2023, and 2022; (v) the Consolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 2022; and (vi) Notes to Consolidated Financial Statements. The instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n10-K\n*\n104\nCover Page Interactive Data File - The cover page XBRL tags are embedded within the Inline XBRL document.\n*    Filed herewith.\n+    Denotes management contract or compensatory plan or arrangement.\nItem 16. Form 10-K Summary\nNot applicable.\n123 \nTable\n of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nWYNN RESORTS, LIMITED\nDated: February 13, 2025\nBy:\n/s/  Craig S. Billings \nCraig S. Billings \nChief Executive Officer (Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/  Craig S. Billings\nDirector, Chief Executive Officer (Principal Executive Officer)\nFebruary 13, 2025\nCraig S. Billings\n/s/  Julie Cameron-Doe\nChief Financial Officer (Principal Financial and Accounting Officer)\nFebruary 13, 2025\nJulie Cameron-Doe \n/s/  Philip G. Satre\nNon-Executive Chair of the Board and Director\nFebruary 13, 2025\nPhilip G. Satre \n/s/  Betsy S. Atkins\nDirector\nFebruary 13, 2025\nBetsy S. Atkins\n/s/  Richard J. Byrne\nDirector\nFebruary 13, 2025\nRichard J. Byrne \n/s/  Paul Liu\nDirector\nFebruary 13, 2025\nPaul Liu\n/s/  Patricia Mulroy\nDirector\nFebruary 13, 2025\nPatricia Mulroy\n/s/  Margaret J. Myers\nDirector\nFebruary 13, 2025\nMargaret J. Myers\n/s/  Darnell Strom\nDirector\nFebruary 13, 2025\nDarnell Strom\n/s/  Winifred Webb\nDirector\nFebruary 13, 2025\nWinifred Webb\n124"
  }
}