{
  "ticker": "XEL",
  "cik": "0000072903",
  "company_name": "XCEL ENERGY INC",
  "filing_date": "2025-02-27",
  "accession": "0000072903-25-000029",
  "primary_doc": "xel-20241231.htm",
  "item_sections": {
    "item1": "Item 16 —\nForm 10-K Summary\n91\nSignatures\n92\n2\nTable of Contents\nPART I\nITEM 1 — BUSINESS\nDefinitions of Abbreviations\nXcel Energy Inc.’s Subsidiaries and Affiliates (current and former)\nCapital Services\nCapital Services, LLC\nEloigne\nEloigne Company\ne prime\ne prime inc.\nNicollet Project Holdings\nNicollet Project Holdings, LLC\nNSP-Minnesota\nNorthern States Power Company, a Minnesota corporation\nNSP System\nThe electric production and transmission system of NSP-Minnesota and NSP-Wisconsin operated on an integrated basis and managed by NSP-Minnesota\nNSP-Wisconsin\nNorthern States Power Company, a Wisconsin corporation\nPSCo\nPublic Service Company of Colorado\nSPS\nSouthwestern Public Service Co.\nUtility subsidiaries\nNSP-Minnesota, NSP-Wisconsin, PSCo and SPS\nWGI\nWestGas InterState, Inc.\nWYCO\nWYCO Development, LLC\nXcel Energy\nXcel Energy Inc. and its subsidiaries\nFederal and State Regulatory Agencies\nCPUC\nColorado Public Utilities Commission\nDOC\nMinnesota Department of Commerce\nDOE\nUnited States Department of Energy\nDOT\nUnited States Department of Transportation\nEPA\nUnited States Environmental Protection Agency\nERCOT\nElectric Reliability Council of Texas\nFASB\nFinancial accounting standards board\nFERC\nFederal Energy Regulatory Commission\nIRS\nInternal Revenue Service\nMPUC\nMinnesota Public Utilities Commission\nMPSC\nMichigan Public Service Commission\nNDPSC\nNorth Dakota Public Service Commission\nNERC\nNorth American Electric Reliability Corporation\nNIST\nNational Institute of Standards and Technology\nNMPRC\nNew Mexico Public Regulation Commission\nNRC\nNuclear Regulatory Commission\nOAG\nMinnesota Office of Attorney General\nPHMSA\nPipeline and Hazardous Materials Safety Administration\nPSCW\nPublic Service Commission of Wisconsin\nPUCT\nPublic Utility Commission of Texas\nSDPUC\nSouth Dakota Public Utility Commission\nSEC\nSecurities and Exchange Commission\nElectric, Purchased Gas and Resource Adjustment Clauses\nCIP\nConservation improvement program\nDSM\nDemand side management\nFCA\nFuel clause adjustment\nGCA\nGas cost adjustment\nRES\nRenewable energy standard \nOther\nADIT\nAccumulated deferred income taxes\nAFUDC\nAllowance for funds used during construction\nALJ\nAdministrative law judge\nARO\nAsset retirement obligation\nARRR\nApplication for rehearing, reargument or reconsideration\nASC\nFinancial Accounting Standards Board Accounting Standards Codification\nASU\nAccounting standards update\nATM\nAt-the-market\nC&I\nCommercial and industrial\nCapX2020\nAlliance of electric cooperatives, municipals and investor-owned utilities in the upper Midwest involved in a joint transmission line planning and construction effort\nCCR\nCoal combustion residuals\nCCR Rule\nFinal rule (40 CFR 257.50 - 257.107) published by the EPA regulating the management, storage and disposal of CCRs as a nonhazardous waste\nCDD\nCooling degree-days\nCEO\nChief executive officer\nCERCLA\nComprehensive Environmental Response, Compensation, and Liability Act\nCFO\nChief financial officer\nCIG\nColorado Interstate Gas Company, LLC\nCON\nCertificate of need\nCO\n2\nCarbon dioxide\nCORE\nCORE Electric Cooperative\nCPCN\nCertificate of public convenience and necessity\nCSPV\nCrystalline silicon photovoltaic\nCWIP\nConstruction work in progress\nDECON\nDecommissioning method where radioactive contamination is removed and safely disposed of at a requisite facility or decontaminated to a permitted level\nDRIP\nDividend Reinvestment Program\nEEI\nEdison Electric Institute\nEMANI\nEuropean Mutual Association for Nuclear Insurance\nEPS\nEarnings per share\nETR\nEffective tax rate\nFTR\nFinancial transmission right\nGAAP\nGenerally accepted accounting principles\nGE\nGeneral Electric\nGHG\nGreenhouse gas\nHDD\nHeating degree-days\nINPO\nInstitute of Nuclear Power Operations\nIRA\nInflation Reduction Act\nIPP\nIndependent power producing entity\nIRP\nIntegrated resource plan\nISO\nIndependent system operator\nITC\nInvestment tax credit\nLP&L\nLubbock Power & Light\nMGP\nManufactured gas plant\nMISO\nMidcontinent Independent System Operator, Inc.\nNative load\nDemand of retail and wholesale customers that a utility has an obligation to serve under statute or contract\nNAV\nNet asset value\nNEIL\nNuclear Electric Insurance Ltd.\nNOL\nNet operating loss\nNOx\nNitrogen oxides\nO&M\nOperating and maintenance\nONES\nOperations, Nuclear, Environmental and Safety\nPFAS\nPer- and polyfluoroalkyl substances\nPIM\nPerformance incentive mechanism\nPost-65\nPost-Medicare\nPPA\nPower purchase agreement\nPre-65\nPre-Medicare\nPSPS\nPublic safety power shutoff\nPTC\nProduction tax credit\nRDF\nRefuse-derived fuel\nREC\nRenewable energy credit\n3\nTable of Contents\n     \nRFP\nRequest for proposal\nROE\nReturn on equity\nROU\nRight-of-use\nRTO\nRegional transmission organization\nS&P\nStandard & Poor’s Global Ratings\nSERP\nSupplemental executive retirement plan\nSMMPA\nSouthern Minnesota Municipal Power Agency\nSPP\nSouthwest Power Pool, Inc.\nSRP\nSystem resiliency plan\nTCJA\n2017 federal tax reform enacted as Public Law No: 115-97, commonly referred to as the Tax Cuts and Jobs Act\nTHI\nTemperature-humidity index\nTSR\nTotal shareholder return\nVaR\nValue at risk\nVIE\nVariable interest entity\nWACC\nWeighted average cost of capital\nWMP\nWildfire mitigation plan\nMeasurements\nBcf\nBillion cubic feet\nKV\nKilovolts\nKWh\nKilowatt hours\nMMBtu\nMillion British thermal units\nMW\nMegawatts\nMWh\nMegawatt hours\nWhere to Find More Information\nXcel Energy’s website address is www.xcelenergy.com. Xcel Energy makes available through its website, free of charge, its annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 as soon as reasonably practicable after the reports are electronically filed with or furnished to the SEC. \nThe SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically at http://www.sec.gov. The information on Xcel Energy’s website is not a part of, or incorporated by reference in, this annual report on Form 10-K. Xcel Energy intends to make future announcements regarding Company developments and financial performance through its website, www.xcelenergy.com, as well as through press releases, filings with the SEC, conference calls and webcasts.\nForward-Looking Statements\nExcept for the historical statements contained in this report, the matters discussed herein are forward-looking statements that are subject to certain risks, uncertainties and assumptions. Such forward-looking statements, including those relating to 2025 EPS guidance, long-term EPS and dividend growth rate objectives, future sales, future expenses, future tax rates, future operating performance, estimated base capital expenditures and financing plans, projected capital additions and forecasted annual revenue requirements with respect to rider filings, expected rate increases to customers, expectations and intentions regarding regulatory proceedings, expected pension contributions and expected impact on our results of operations, financial condition and cash flows of interest rate changes, increased credit exposure, and legal proceeding outcomes, as well as assumptions and other statements are intended to be identified in this document by the words “anticipate,” “believe,” “could,” “estimate,” “expect,” “intend,” “may,” “objective,” “outlook,” “plan,” “project,” “possible,” “potential,” “should,” “will,” “would” and similar expressions. Actual results may vary materially. Forward-looking statements speak only as of the date they are made, and we expressly disclaim any obligation to update any forward-looking information. The following factors, in addition to those discussed elsewhere in this Annual Report on Form 10-K for the fiscal year ended Dec. 31, 2024 (including risk factors listed from time to time by Xcel Energy Inc. in reports filed with the SEC, including “Risk Factors” in",
    "item1a": "Item 1A for risks and uncertainties related to strategic and sustainability goals and objectives.\nZero-Carbon Electricity by 2050\nXcel Energy’s operating footprint includes some of the best wind and solar resources in the country, providing for higher capacity factors and lower electricity costs. \nXcel Energy’s wind capacity is now over 11,000 MW, including nearly 4,500 MW of owned wind. In 2024, we completed Phase 1 of our Sherco Solar project in Minnesota. Once Phases 2 and 3 are completed in 2025 and 2026, Sherco Solar’s combined capacity of 710 MW will be one of the largest solar facilities in the country and provide enough clean energy to power 150,000 homes across the upper Midwest. We have 15,000 - 29,000 MW of investment opportunity, through new and extended generation, in development across our NSP, PSCo and SPS footprint. In our base 2025 - 2029 capital investment plan, we have 3,700 MW of new and repowered wind, solar, hybrid and battery storage resources included. \nThrough 2024, we reduced carbon emissions from generation serving customers by an estimated 57% (from 2005 levels) and remain on track to achieve 80% carbon reduction and fully exit coal by the end of 2030. \nNatural Gas Use in Buildings \n–\n Net-Zero GHG by 2050\nRecognizing externalities like the pace of technology development and customer needs, Xcel Energy updated certain interim goals on the path to achieve our 2050 goal to provide net-zero natural gas service from the supply, distribution and end-use natural gas. In 2024 and early 2025, we received approvals for our modified Clean Heat Plan in Colorado and Natural Gas Innovation Plan in Minnesota, which provide starting points for this transition. \nOur net-zero natural gas frameworks include the following priorities:\n•\nOperating a safe, reliable gas system with net-zero methane gas service by 2030.\n•\nOptimize the energy system with electrification-first approaches for new growth by leading voluntary market transformation initiatives.\n•\nProvide customers with a portfolio of solutions to choose from, including natural gas, while ensuring we meet requirements of our regulators.\nElectrification of the Transportation Sector\nWe are also helping reduce carbon emissions in other sectors, including transportation. Similar to our natural gas goals, we revised the interim goals to reflect market considerations for transportation to enable the charging infrastructure for 1.5 million electric vehicles across the areas we serve by 2035. By 2050, our vision remains to run all vehicles in our service area with carbon-free electricity or other clean energy. We have approved clean transportation programs and plans in Colorado, New Mexico, Minnesota and Wisconsin. \nWildfire Resiliency and Mitigation \nProtecting our customers and our system from the threats of extreme weather is a top priority for Xcel Energy. In 2024, we filed an updated Wildfire Mitigation Plan in Colorado and our Resiliency Plan in Texas that integrates industry experience, incorporates evolving risk assessment methodologies, adds new technology and expands the scope, pace and scale of our programs to reduce wildfire risk. We also issued wildfire mitigation plans for each of our other states in 2024. \nIn 2024, we implemented the capability to deliver enhanced, wildfire safety operations and conduct proactive public safety power shutoffs across our entire system. We accelerated pole inspections and replacements on our system and expanded visual coverage of high-risk areas with our PanoAI camera system. We also deployed Technosylva’s advanced risk modelling system enterprise-wide.\nFinally, we are working at both a state and federal level on legislation to enhance the safety of our communities from evolving extreme weather risks while protecting the financial integrity of companies like Xcel Energy.\n7\nTable of Contents\n     \nUtility Subsidiaries \nNSP-Minnesota\nElectric customers\n1.6 million\nNSP-Minnesota conducts business in Minnesota, North Dakota and South Dakota and has electric operations in all three states including the generation, purchase, transmission, distribution and sale of electricity. NSP-Minnesota and NSP-Wisconsin electric operations are managed on the NSP System. NSP-Minnesota also purchases, transports, distributes and sells natural gas to retail customers and transports customer-owned natural gas in Minnesota and North Dakota.\nNatural gas customers\n0.6 million\nTotal assets\n$27.5 billion\nRate Base (estimated)\n$17.4 billion\nGAAP ROE \n9.07%\nOngoing ROE\n9.46%\nElectric generating capacity (owned)\n8,623 MW\nGas storage capacity\n16.9 Bcf\nElectric transmission lines (conductor miles)\n34,000 miles\nElectric distribution lines (conductor miles)\n87,000 miles\nNatural gas transmission lines\n78 miles\nNatural gas distribution lines\n11,000 miles\nNSP-Wisconsin\nElectric customers\n0.3 million\nNSP-Wisconsin conducts business in Wisconsin and Michigan and generates, purchases, transmits, distributes and sells electricity. NSP-Minnesota and NSP-Wisconsin electric operations are managed on the NSP System. NSP-Wisconsin also purchases, transports, distributes and sells natural gas to retail customers and transports customer-owned natural gas. \nNatural gas customers\n0.1 million\nTotal assets\n$4.1 billion\nRate Base (estimated)\n$2.7 billion\nGAAP ROE\n8.98%\nElectric generating capacity (owned)\n500 MW\nGas storage capacity\n4.3 Bcf\nElectric transmission lines (conductor miles)\n12,000 miles\nElectric distribution lines (conductor miles)\n28,000 miles\nNatural gas transmission lines\n3 miles\nNatural gas distribution lines\n3,000 miles\nPSCo\nElectric customers\n1.6 million\nPSCo conducts business in Colorado and generates, purchases, transmits, distributes and sells electricity. PSCo also purchases, transports, distributes and sells natural gas to retail customers and transports customer-owned natural gas.\nNatural gas customers\n1.5 million\nTotal assets\n$26.6 billion\nRate Base (estimated)\n$19.3 billion\nGAAP ROE\n7.63%\nElectric generating capacity (owned)\n6,203 MW\nGas storage capacity\n32.1 Bcf\nElectric transmission lines (conductor miles)\n25,000 miles\nElectric distribution lines (conductor miles)\n82,000 miles\nNatural gas transmission lines\n2,000 miles\nNatural gas distribution lines\n24,000 miles\nSPS\nSPS conducts business in Texas and New Mexico and generates, purchases, transmits, distributes and sells electricity. \nElectric customers\n0.4 million\nTotal assets\n$10.8 billion\nRate Base (estimated)\n$7.6 billion\nGAAP ROE\n9.57%\nElectric generating capacity (owned)\n5,100 MW\nElectric transmission lines (conductor miles)\n41,000 miles\nElectric distribution lines (conductor miles)\n25,000 miles\n8\nTable of Contents\n     \nOperations Overview\nUtility operations are generally conducted as either electric or gas utilities in our four utility subsidiaries.\nElectric Operations\nElectric operations consist of energy supply, generation, transmission and distribution activities across all four utility subsidiaries. Xcel Energy had electric sales volume of 112,273 (millions of KWh), 3.9 million customers and electric revenues of $11,147 million for 2024.\nElectric Operations (percentage of total)\nSales Volume\nNumber of Customers\nRevenues\nResidential\n23 \n%\n86 \n%\n32 \n%\nC&I\n59 \n12 \n49 \nOther\n18 \n2 \n19 \nRetail Sales/Revenue Statistics \n(a)\n2024\n2023\nKWh sales per retail customer\n23,908 \n23,939 \nRevenue per retail customer\n$\n2,357 \n$\n2,464 \nResidential revenue per KWh\n13.82 \n¢\n13.80 \n¢\nC&I revenue per KWh\n8.24 \n¢\n8.82 \n¢\nTotal retail revenue per KWh\n9.86 \n¢\n10.29 \n¢\n(a)\nSee Note 6 to the consolidated financial statements for further information.\nOwned and Purchased Energy Generation — 2024\nElectric Energy Sources\nTotal electric energy generation by source for the year ended Dec. 31: \n9\nTable of Contents\n     \nCarbon-Free\nXcel Energy’s carbon-free energy portfolio includes wind, nuclear, hydroelectric, biomass and solar power from both owned generation facilities and PPAs. Carbon-free percentages will vary year-over-year based on system additions, commodity costs, weather, system demand and transmission constraints.\nSee"
  }
}