{
  "ticker": "XYL",
  "cik": "0001524472",
  "company_name": "Xylem Inc.",
  "filing_date": "2025-03-03",
  "accession": "0001524472-25-000013",
  "primary_doc": "xyl-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.    BUSINESS\nBusiness Overview\nXylem is a leading global water technology company with 2024 revenues of $8.6 billion and approximately 23,000 employees worldwide. We design, manufacture and service engineered products and solutions across a wide variety of critical applications primarily in the water sector. Our broad portfolio of products, services and solutions addresses customer needs of scarcity, resilience, quality, and affordability across the water cycle, from the delivery, treatment, measurement and use of drinking water, to the collection, testing, analysis and treatment of wastewater, to the return of water to the environment. \nWe have differentiated market positions in core applications including transport and dewatering, process water and wastewater treatment, analytics, smart metering, digital software solutions and comprehensive services. Setting us apart is a unique set of global assets that include:\n•\nMarket-leading brands, some of which have been in use for more than 100 years\n•\nGlobal distribution networks consisting of direct sales forces and independent channel partners serving a diverse customer base in approximately 150 countries \n•\nA substantial global installed base of products and solutions across the water cycle that provides for steady parts, replacement and service revenue\n•\nA strong history of providing innovative products, solutions, services and business models to customers \n•\nA dedicated, experienced, qualified and technologically advanced group of employees focused on safely satisfying our customers' requirements to transport, treat or measure clean water or wastewater and measure energy usage\n•\nA strong financial position and cash generation profile that enables us to fund strategic organic and inorganic growth initiatives, and consistently return capital to shareholders \n•\nA demonstrated commitment to corporate governance, social and environmental sustainability and delivering a positive impact to our customers, communities and employees\nExcept as otherwise indicated or unless the context otherwise requires, “Xylem,” “we,” “us,” “our” and “the Company” refer to Xylem Inc. and its subsidiaries. \nOur Industry\nOur vision is to create a world in which water issues are no longer a constraint to health, prosperity and sustainable development. Our purpose is to empower our customers and communities to build a more water secure world. \nOur planet faces serious water challenges. Less than 1% of the total water available on earth is fresh water, and the supply is threatened by factors such as the draining of aquifers, increased pollution and the effects of climate change. Demand for fresh water is rising rapidly due to population growth, industrial expansion, and increased agricultural development, with consumption estimated to double every 20 years. It is expected that there will be a 40% gap between global water supply and demand by 2030. Even in developed countries with sufficient clean water supply, existing water supply infrastructure is aging and often inefficient. In the U.S., deteriorating pipe systems, theft or inaccurate meters result in approximately one out of every six gallons of treated and transported water being lost prior to reaching the end customer. This problem of \"non-revenue\" water is a major financial challenge of many utilities globally, especially in developing markets where non-revenue water can represent 10% to 60% or more of net water produced and the treatment and energy costs to transport water is substantial. These and other challenges create opportunities for growth in the global water industry. We estimate the total addressable market size of the global water industry, excluding operational expenditures related to labor, energy, and chemicals, to be approximately $750 billion. \nGlobal water needs cannot be met without streamlining the water industry’s cost structure with technologies that fundamentally change the provision and management of water. We compete in areas that are pivotal to improving \"water affordability,\" \"water quality,\" and \"resilience\", while reducing the impact of \"water scarcity\". \"Water affordability\" refers to the more efficient delivery, use and treatment of clean water and wastewater. \"Water quality\" refers to the suitability of water for a particular use based on its physical, chemical and biological characteristics. \"Resilience\" refers to the management of water-related risks, including climate change mitigation, and the resilience of water infrastructure. \"Water scarcity\" refers to the management of the limited supply of water due to climate change, overpopulation and pollution. Our customers often face all four of these challenges, ranging from inefficient and aging water distribution networks and energy-intensive or unreliable water and wastewater management \n4\nsystems (requiring improvements in water affordability); droughts and pollution which limit the amount of water readily available (causing water scarcity); or exposure to natural disasters such as floods (requiring improvements in resilience). Additionally, we also provide solutions to enhance communications and efficiency, improve safety and conserve resources to customers in the water sector. Delivering value in these areas creates significant opportunity for the Company. \nThe Global Water Industry Value Chain\nThe water industry value chain includes Equipment, Technology and Services companies, like Xylem, that address the unique challenges and demands of a diverse customer base. This customer base includes water and wastewater utilities that supply, treat and monitor clean water or transport, treat and analyze wastewater or storm water through an infrastructure network, and engineering, procurement and construction (\"EPC\") firms and third party contractors, that work with utilities to design and build water and wastewater infrastructure networks, as depicted below. Utilities and other customers require products, solutions, services, technology and application expertise from their Equipment, Technology and Services providers to address trends such as rising pollution, stricter regulations, increasing operational costs and the increased outsourcing of process knowledge. In addition to utilities, Equipment, Technology and Service companies also provide distinct technologies and application expertise and services to a wide array of entities, including farms, mines, power plants, industrial facilities (such as food and beverage and pharmaceutical manufacturers) and residential and commercial customers seeking to address similar trends.\nWater Industry Supply Chain\n \nBusiness Strategy \nOur overarching strategy is to help customers solve the world's greatest water challenges with innovative products, services and solutions to deliver sustainable economic, social and environmental benefits. The following strategic pillars guide where and how we focus our efforts and resources to implement this strategy:\n•\nCustomer Centricity.\n We are putting the needs and experiences of our customers at the forefront of everything we do. By listening to our customers and understanding their challenges, we aim to deliver innovative solutions that not only meet but exceed their expectations. This approach helps us build strong, lasting relationships and helps align our products and services with customer needs. We leverage the 80/20 principle to focus on the most impactful opportunities to drive value for our customers. Additionally, we seek to create synergies across our businesses to enhance customer value and streamline operations. We are committed to simplifying how we do business and equipping our sales teams with the tools, training, and insights needed to engage customers effectively. We emphasize transactional excellence to aim for every customer interaction to be seamless, efficient, and value-driven. We aspire for our customers to be enthusiastic advocates for our brand.\n5\n•\nProfitable Growth.\n We prioritize profitable growth to drive long-term success. By applying the 80/20 principle, we focus on the most impactful opportunities to create significant value. We aim to expand our market share, optimize our product portfolio, and drive revenue growth through strategic investments and partnerships. By implementing strategic pricing, we maximize profitability and enhance our competitive position. Additionally, we are dedicated to building high-margin, recurring revenue in growing markets, intelligent solutions, and services. Our goal is to deliver consistent financial performance that benefits our shareholders and supports our long-term vision, building a stable and prosperous future for the company.\n•\nOperational Excellence.\n We are committed to being a leading operator by continuously improving our processes, systems, and capabilities to enhance efficiency and effectiveness. By applying the 80/20 principle to streamline our business, we aim to enhance throughput, reduce inventory, and improve product quality. Implementing lean continuous improvement practices allows us to reduce waste and enhance the speed and ease of doing business, making our operations more efficient and effective. We are dedicated to modernizing our systems to support productivity for growth and maintain operations that are agile and responsive. Through our Xylem Management System and Goal Deployment Process, we align our efforts with strategic objectives, driving disciplined execution and operational excellence. This commitment to excellence helps us remain competitive and enables us to respond quickly to changing market and customer demands. Ultimately, we aim to run our company with discipline, maintaining operations that are streamlined and consistently aligned with our strategic goals.\n•\nSustainability Leadership.\n We strive to be a sustainability leader by integrating sustainability into our business strategy, with a strong emphasis on advancing favorable long-term financial and sustainability outcomes for our customers through our solutions. We also aim to minimize our environmental impact, promote resource conservation, and support customers and the communities we serve together. Our priorities are focused in three areas: decarbonizing the water sector, accelerating corporate water stewardship, and advancing WASH (Water, Sanitation, and Hygiene) access and capacity building. Additionally, we are partnering with venture impact funds, philanthropic organizations, customers, and suppliers to develop long-term commercial opportunities in new markets. Our sustainability leadership, including the skill-based volunteering by employees, provides Xylem with distinct advantages in competitive talent markets.\n•\nHigh-Impact Culture.\n We continuously refine Xylem’s operating model to better serve our customers and create value for our shareholders. Our organizational culture is fundamental to those objectives. We have activated our high-impact culture through three high-impact behaviors: inspired to innovate, accountable to deliver, and empowered to lead. These behaviors drive our employees to learn and innovate every day, to know their role in contributing to our purpose and strategy, and to deliver on our commitments to our customers and communities. Within the framework of these behaviors, we encourage a collaborative and inclusive work environment and are keenly focused on simplifying our organization and processes to drive daily and break-through efficiency and innovation. \nOur strategic plan firmly embeds sustainability at the heart of our competitive advantage and unique business model, and aligns each of our five core strategic pillars to the overarching goal of integrating sustainability into everything we do. \nWhile our strategy will evolve in response to the changing world, our four values are the enduring principles that go to the heart of who we are and guide how we conduct ourselves each day: Respect, Responsibility, Integrity and Creativity. \nBusiness Segments, Distribution and Competitive Landscape\nWe have four reportable business segments that are aligned around the critical market applications they provide: Water Infrastructure, Applied Water, Measurement and Control Solutions and Water Solutions and Services. See Note 21, “Segment and Geographic Data,” in our consolidated financial statements for financial information about segments and geographic areas.\n6\nThe table and descriptions below provide an overview of our business segments:\nMarket\nApplications\n2024 Revenue\n(in millions)\n%\nRevenue\nMajor Products\nPrimary Brands\nWater\nInfrastructure\nTransport\n$\n1,498 \n59 \n%\n•\nWater and wastewater pumps\n•\nFiltration, disinfection and biological treatment equipment\n•\nFlygt\n•\nIonpure\n•\nVortisand\n•\nWallace & Tiernan\n•\nWedeco\nTreatment\n1,057 \n41 \n%\n$\n2,555 \n100 \n%\n \n \nApplied\nWater\nBuilding Solutions\n$\n997 \n56 \n%\n•\nPumps\n•\nValves\n•\nHeat exchangers\n•\nControls\n•\nDispensing equipment systems\n•\nRule\n•\nBell & Gossett\n•\nFlojet\n•\nGoulds Water Technology\n•\nJabsco\n•\nLowara\n•\nStandard Xchange\nIndustrial Water\n796 \n44 \n%\n$\n1,793 \n100 \n%\nMeasurement and Control Solutions\nSmart Metering and Other\n$\n1,519 \n81 \n%\n•\nSmart meters\n•\nNetwork communication devices\n•\nData analytics\n•\nTest instruments\n•\nControls\n•\nSensor devices\n•\nSoftware & managed services\n•\nCritical infrastructure services \n•\nSensus\n•\nSmith Blair\n•\nWTW\n•\nYSI\n•\nXylem Vue\nAnalytics\n352 \n19 \n%\n$\n1,871 \n100 \n%\n \n \nWater Solutions and Services\nCapital and other\n$\n1,355 \n58 \n%\n•\nPreventative maintenance services\n•\nRapid response mobile services\n•\nDigitally enabled/outsourced solutions\n•\nProcess and wastewater treatment systems\n•\nEnvironmental remediation\n•\nOdor and corrosion control\n•\nFiltration\n•\nReverse osmosis\n•\nContinuous deionization\n•\nMobile dewatering equipment and rental services\n•\nAquaPro\n•\nWaterOne\n•\nIon Pure\n•\nFlygt\n•\nPure Technologies\n•\nGodwin\nServices\n988 \n42 \n%\n$\n2,343 \n100 \n%\n7\nWater Infrastructure\nThrough two closely linked applications, transport and treatment, our Water Infrastructure segment primarily supports the process that collects water from a source, treats it and distributes it to users, and then treats and returns the wastewater responsibly to the environment.\nThe customer base consists of two primary end markets: utility and industrial. The utility market includes public, private and public-private entities that support water, wastewater and storm water networks. The industrial market includes customers that require similar water and wastewater infrastructure applications to support various industrial operations.\nWater Infrastructure sells through a combination of direct channels, indirect channels and service capabilities. Both utility and industrial facility customers increasingly require our teams’ global but locally proficient expertise to use our equipment in their specific applications. Several trends are increasing demand for this application expertise: (i) the need for efficient transport and treatment solutions due to the increase in water scarcity, (ii) the increase in both the type and amount of contaminants found in the water supply, (iii) the need to increase system resilience and efficiencies due to aged infrastructure and affordability, (iv) increasing environmental regulations, and (v) the need to reduce carbon emissions generated from transporting and treating water.\nGiven the highly fragmented nature of the water industry, the Water Infrastructure segment competes with a large number of businesses and no one business competes across all the markets Water Infrastructure serves. We differentiate ourselves in the market by focusing on product and service performance, quality and reliability, innovation, speed to market with new or disruptive technologies and business models, application expertise, brand reputation, energy efficiency, product security, product life-cycle cost, timeliness of delivery, effectiveness of our distribution channels, customers' experience and our global installed base. Our key competitors in the Water Infrastructure segment include De Nora, Grundfos, KSB Inc., ProMinent, Sulzer Ltd., Trojan (Veralto Corporation), and Veolia.\nApplied Water\nApplied Water encompasses the uses of water to serve a diverse set of customers in the building solutions and industrial water end markets. Residential consumers represent the end users in the residential market, while owners and managers of properties such as apartment buildings, retail stores, institutional buildings, restaurants, schools/universities, hospitals and hotels are examples of end users in the commercial market. The industrial market includes original equipment manufacturers, exploration and production firms, agricultural customers, and developers and managers of industrial facilities, such as chemical manufacturers, marine, food and beverage companies, data centers and car washes.\nIn the Applied Water segment, end markets vary widely and, as a result, specialized distribution partners are often preferred. As such, the Applied Water segment provides the majority of its sales through strong indirect channels with the remaining sales going through our global direct sales channels. We have long-standing relationships with many of the leading independent distributors in the markets we serve and we provide incentives to distributors, such as specialized loyalty and training programs.\nPopulation growth and urbanization, climate and regulation on energy efficiency, and digitalization enabling self-service and preventive maintenance are macro growth drivers of these markets, driving the need for housing, food, community services and retail goods within growing city centers. \nCompetition in the Applied Water segment focuses on brand reputation, application expertise, product delivery, performance and energy efficiency, quality and reliability, and price. We compete by offering innovative and high-quality products, coupled with world-class application expertise. We believe our distribution through well-established channels and our reputation for quality significantly enhance our market position. Our ability to deliver innovative product offerings has enabled us to compete effectively, to cultivate and maintain customer relationships and to serve and expand into many niche and new markets. Our key competitors in the Applied Water segment include Franklin Electric Co., Inc, Grundfos, Pentair plc, and Wilo SE.\n8\nMeasurement and Control Solutions \nMeasurement and Control Solutions develops advanced technology solutions that enable intelligent use, optimization and conservation of critical water and energy resources. The segment delivers communications, smart metering, measurement and control capabilities, and critical infrastructure technologies that allow customers to more effectively use their distribution networks for the delivery, monitoring and control of critical resources such as water, electricity and natural gas. We also provide analytical instrumentation used to measure and analyze water quality, flow and level in clean water, wastewater and outdoor water environments. Additionally, we offer software and services including cloud-based analytics, and remote monitoring and data management.\nAt the heart of our leading technologies are automation, data management and decision support. Our communications networks enable customers to automate and optimize meter reading, bill customers, monitor flow rates and detect and enable rapid response to changing and unsafe conditions. In short, our communications offerings provide insight into operations and enable our customers to manage the entire scope of their operations remotely through their networks and to optimize their operational costs. At the center of our offering is the FlexNet communication network, which provides a common communications platform and infrastructure for essential metering services. This two-way communication technology remotely connects a wide variety of smart points in a given network with protocols, frequently on Federal Communications Commission (\"FCC\") licensed spectrum in the U.S., to enable reliable, resilient and secure transmissions. These technologies allow our customers to remotely and continuously monitor their water and energy distribution infrastructure, prioritize and manage maintenance, and use data to optimize many aspects of their networks. Our digital software solutions complement these offerings with intelligent applications that help utility decision-makers manage and maintain their networks more effectively in real time.\nThe majority of our sales in the U.S. are conducted through strong, long-standing relationships with leading distributors and dedicated channel partners for the water and energy markets. Internationally, direct sales are often made in markets without established distribution channels; however, some distribution channels are used in more developed markets. A direct sales approach, with key account management, is employed for large utilities and government programs.\nMacro growth drivers include increasing regulation, aging infrastructure and worldwide movement towards smart grid implementation and advanced metering infrastructure (“AMI\"). Water scarcity and conservation, as well as the need to prevent revenue loss (via inaccurate meter readings, leaks or theft) are among the drivers of smart meter and leak detection technologies. \nOur Sensus-branded meters are well positioned in the smart metering sector, the fastest growing sector of the global meter industry. We set ourselves apart in the industry by focusing on our communication network, innovation, new product development and service offerings that deliver tangible savings from efficiency of operating costs in meter reading and billing, and reduction of non-revenue water through improved meter accuracy, reduced theft and identification of leaks. Our YSI and WTW-branded instruments have a strong position in the analytical instrumentation market and provide critical readings of various water quality, level and flow parameters for customers. We provide a differentiated offering in the reliability and accuracy of our products often in rugged, remote and hazardous locations. Our key competitors in the Measurement and Control Solutions segment include Badger Meter, Echologics (Mueller Water Products), Hach (Veralto Corporation), Itron, Kamstrup, Landis+Gyr, Neptune (Roper), and Teledyne.\nWater Solutions and Services\nOur Water Solutions and Services segment provides tailored services and solutions, in collaboration with customers, including on‑demand water, outsourced water, recycle/reuse, specialty dewatering and emergency response service alternatives, to improve operational reliability, performance and environmental compliance. Key offerings within this segment also include equipment systems for industrial needs (influent water, boiler feed water, ultrahigh purity, process water, wastewater treatment, and recycle/reuse), full-scale outsourcing of operations and maintenance, and municipal services, including odor and corrosion control services, and pipeline assessment services, as well as leak detection, condition assessment and asset management and pressure monitoring solutions. The Water Solutions and Services segment also includes sales and rental of specialty dewatering pumps, scalable products, and related equipment, technology and services, which provide the safe removal or draining of groundwater and surface water from construction sites or other industrial sites, and bypass pumping for the repair of aging utility infrastructure, as well as emergency water transport and removal during severe weather events.\nOur Water Solutions and Services segment reaches customers across various municipalities as well as industrial vertical markets such as life sciences, microelectronics, food and beverage, chemical processing, and power \n9\ngeneration. In order to reach these customers, we leverage our application expertise in process water and wastewater treatment, our internal and external partners, and extensive service branch networks across the globe, including a rental fleet of transfer and treatment assets.\nMacro growth drivers include water scarcity, emerging contaminants, increasing regulation surrounding climate and energy efficiency, pressure to optimize energy efficiency and other operational cost, and demand arising from emergency response needs. Our key competitors in the Water Solutions and Services segment include Ecolab, MPW Industrial Services, Ovivo, Sunbelt Rentals and United Rentals.\nGeographic Profile\nThe table below illustrates the annual revenue and percentage of revenue by geographic area for each of the three years ended December 31.\nRevenue\n(in millions)\n2024\n2023\n2022\n$ Amount\n% of Total\n$ Amount\n% of Total\n$ Amount\n% of Total\nUnited States\n$\n4,862\n \n57\n \n%\n$\n3,956 \n54 \n%\n$\n2,573 \n47 \n%\nWestern Europe\n1,745\n \n20\n \n%\n1,655 \n22 \n%\n1,411 \n26 \n%\nEmerging Markets (a)\n1,274\n \n15\n \n%\n1,182 \n16 \n%\n1,074 \n19 \n%\nOther\n681\n \n8\n \n%\n571 \n8 \n%\n464 \n8 \n%\nTotal\n$\n8,562\n \n$\n7,364 \n$\n5,522 \n(a)\nEmerging Markets includes results from the following regions: Eastern Europe, the Middle East and Africa, Latin America and Asia Pacific (excluding Japan, Australia and New Zealand, which are included in \"Other\")\nSupply and Seasonality\nWe have a global manufacturing and assembly footprint, with production facilities in Europe, North America, Latin America, Asia and the Middle East. All of our businesses require various parts and raw materials, the availability and prices of which may fluctuate. Parts and raw materials commonly used in our products include motors, fabricated parts, castings, magnets, bearings, seals, batteries, printed circuit boards (\"PCBs\") and electronic components, including semiconductors, as well as commodities, including steel, brass, nickel, copper, aluminum, rare earth minerals, and plastics. While we may recover some cost increases through operational improvements, we are still exposed to pricing risk, including due to duty and tariff assessments by the U.S. or other governments on foreign imports. We attempt to control costs through fixed-priced contracts with suppliers and various other programs, such as our global procurement initiative.\nOur business relies on third-party suppliers, contract manufacturing and commodity markets to secure raw materials, parts and components used in our products. We typically acquire materials and components through a combination of blanket and scheduled purchase orders to support our materials requirements. For many of our products we have existing alternate sources of supply, or such sources may be readily available.\nWe have experienced price volatility and supply constraints when materials have not been available from multiple sources. From time to time, we acquire certain inventory in anticipation of supply constraints or enter into longer-term pricing commitments with suppliers to improve the priority, price and availability of supply. \nOur business segments experience a modest level of seasonality in their operations. This seasonality is dependent on factors such as customers' capital spending, as well as the effects of climate change and weather conditions, including heavy flooding, prolonged droughts and fluctuations in temperatures or weather patterns, all of which can positively or negatively impact portions of our business. \nCustomers\nOur business is not dependent on any single customer or a few customers, the loss of which would have a material adverse effect on our Company. No individual customer accounted for more than 5% of our consolidated revenues in 2024, 2023 or 2022.\nBacklog\nBacklog includes orders on hand as well as contractual customer agreements at the end of the period. Delivery schedules vary from customer to customer based on their requirements. Annual or multi-year contracts are subject to rescheduling and cancellation by customers due to the long-term nature of the contracts. As such, beginning total backlog, plus orders, minus revenues, will not equal ending total backlog due to contract adjustments, foreign \n10\ncurrency fluctuations, and other factors. Typically, capital projects require longer lead production cycles and deployment schedules, and delays occur from time to time. Total backlog was $5,070 million at December 31, 2024 and $5,088 million at December 31, 2023. We anticipate that approximately 50% of the backlog at December 31, 2024 will be recognized as revenue during 2025. \nResearch and Development\nResearch and development (“R&D”) is a key foundation of our growth strategy and we focus on the design and development of products, services, solutions and application know-how that address anticipated customer needs and emerging trends. Our engineers are involved in new product, service and solution development as well as improvement of existing products, services and solutions to increase customer value. Our businesses invest substantial resources into R&D. We anticipate we will continue to develop and invest in our R&D capabilities to promote a steady flow of innovative, high-quality and reliable products and integrated solutions to further strengthen our position in the markets we serve. In addition to investments made in software development, which were capitalized, we incurred $230 million, $232 million, and $206 million as a result of R&D investment spending in 2024, 2023 and 2022, respectively.\nWe have R&D and development capabilities around the world. R&D activities are initially conducted in our technology centers, located in conjunction with some of our major manufacturing facilities to enable an efficient and robust development process. We have several global technical centers and local development teams around the world where we are supporting global needs and accelerating the customization of our products, services and solutions to address local needs. In some cases, our R&D activities are conducted at our piloting and testing facilities and at strategic customer sites. These piloting and testing facilities enable us to serve our strategic markets globally. As part of expanding our bandwidth and to increase our access to technology, we have built innovation eco-system partnerships with academic institutions as well as other technology firms, start-up accelerators and venture capital organizations.\nCapitalized Software\nWe offer software as a product or service directly to external customers, which is included within \"Other intangible assets, net\" on our Consolidated Balance Sheets. As of December 31, 2024 and 2023 we had net capitalized software used in sales and services to external customers of $185 million and $209 million, respectively. \nIntellectual Property\nWe generally seek patent protection for inventions that we believe will improve our competitive position and are not suitable to be kept as a trade secret. While we own, control or license a significant number of patents, trade secrets, proprietary information, trademarks, trade names, copyrights and other intellectual property rights which, in the aggregate, are important to our business, management believes that our business, as a whole, as well as each of our business segments, is not materially dependent on any one intellectual property right or related group of such rights.\nPatents, patent applications and license agreements expire or terminate over time by operation of law, in accordance with their terms or otherwise. As the portfolio of our patents, patent applications and license agreements has evolved over time, we do not expect the expiration of any specific patent to have a material adverse effect on our financial position or results of operations.\nGovernmental Regulations\nEnvironmental Regulations\nOur global operations are subject to various laws and regulations governing the environment and climate change, such as those promulgated by the U.S. Environmental Protection Agency and similar state and foreign environmental agencies, including related to the discharge of pollutants and the management and disposal of hazardous substances. While environmental and climate change laws and regulations are subject to change, such changes can be difficult to predict reliably and the timing of potential changes is uncertain. We do not believe, based on current circumstances, that compliance costs pursuant to such regulations will have a material adverse effect on our financial position or results of operations. However, the effect of future legislative or regulatory changes could be material to our financial condition or results of operations.\nWe continue to be dedicated to environmental and sustainability programs to minimize the use of natural resources, reduce the utilization and generation of hazardous materials from our processes, and remediate identified environmental concerns. We are currently engaged in site investigations and remediation activities to address environmental cleanup from past operations at a number of current and former manufacturing facilities. We do not \n11\nanticipate these liabilities will have a material adverse effect on our consolidated financial position or results of operations. At December 31, 2024, we had estimated and accrued $4 million related to environmental matters.\nOther Regulations\nAs a company with global operations, we are subject to complex U.S. federal, state and local and foreign laws, regulations and permits in the countries where we conduct business, including related to trade, such as tariffs, imports and exports; anti-bribery and corruption; antitrust and competition; data security and privacy, such as the EU General Data Protection Regulation (“GDPR”) and the China Personal Information Protection Law ('PIPL\"); use of regulated radio spectrum, including that of the U.S. FCC; lobbying activity; health and safety; the environment; air emissions; potable and non-potable water; wastewater discharge; and the generation, handling, storage, use, transport, treatment and disposal of non-hazardous and hazardous materials and wastes, among other matters. We have policies and procedures in place to promote compliance with these laws, regulations and permits. Additional information about the impact of government regulations on Xylem’s business is included in",
    "item1a": "Item 1A. Risk Factors” in this Report.\n30",
    "item1b": "ITEM 1B.    UNRESOLVED STAFF COMMENTS.\nNone.\n28",
    "item1c": "ITEM 1C.    CYBER SECURITY.\nCybersecurity Risk Management and Strategy\nCybersecurity risk management is integrated into our Enterprise Risk Management (“ERM”) Program, which is our approach to identifying, assessing, prioritizing and mitigating risks to the Company, with mitigation efforts focused on the highest risks.\n Our ERM Program assesses risks, including those related to cybersecurity, annually, and monitors such risks on an ongoing basis.\nWe maintain a comprehensive cybersecurity program that encompasses our enterprise information technology, including operational technology and technology of third parties on which we rely, and connected products and services. Our enterprise cybersecurity program is guided by the National Institute of Standards and Technology’s (“NIST”) Cybersecurity Framework. Key areas of responsibility in the program include governance, risk and compliance, threat analysis and response, security architecture and engineering, security operations and secure manufacturing operations. Our connected products and services cybersecurity program is guided by the ISA/IEC 62443 standard. Key areas of responsibility include product security, software development, innovation management, threat analysis and incident response. Both the enterprise and connected products and services programs are designed to assess, identify and manage risks from cybersecurity threats in order to protect and preserve the security, resiliency, integrity and continued availability of the Company’s information technology systems and connected products and services, and also to protect the confidentiality and integrity of information owned by, or in the custody and care of, the Company. Elements of the programs include policies, standards, architecture, processes, tools, technology, employee education and training, and incident response. Our enterprise and product security programs undergo regular testing, including periodic vulnerability scanning and penetration testing. \nIn addition, we also periodically engage third parties to assess our enterprise and product security programs and provide consultation and advice to assist with assessing, identifying and managing cybersecurity risks.\n \nWe maintain cybersecurity policies that apply to all employees, businesses and functions, as well as third-party vendors and contractors as required by our legal agreements with them. These policies specify roles and responsibilities, fundamental principles and proper controls required for Xylem’s protection, and also require the use of certain cyber risk management processes to onboard new suppliers and other third parties.\n We periodically review our policies to identify potential gaps or areas for improvement, considering changes in the Company, and its connected products and services, as appropriate. \nOur Cybersecurity Incident Response Plan (“IRP”), which generally aligns with NIST's guidance, provides management with a standardized framework for responding to an actual or potential cybersecurity threat or incident. The IRP sets out a coordinated approach to investigating, containing, documenting and mitigating incidents, including reporting findings and keeping senior management and other key stakeholders informed and involved as appropriate. The IRP also specifies the use of third-party experts for legal advice, consulting and incident response, as appropriate. The IRP undergoes at least annual tabletop exercises, the results of which are used to identify areas for improvement in our processes and technologies. We have protocols and processes by which certain cybersecurity incidents, as specified by our IRP, are escalated within the Company and, as appropriate, to the Audit Committee of the Board of Directors. \nEmployees receive annual and ongoing education and training regarding relevant cybersecurity risks and practices, including how to protect information and systems from cyber threats. We also conduct monthly phishing simulations to increase employees’ ability to detect and prevent such threats. \nThe Company maintains insurance as part of its cybersecurity risk mitigation strategy to provide protection against certain potential losses arising from certain cybersecurity incidents.\nCybersecurity Governance\nIn line with its broader strategic oversight, the Board oversees cybersecurity, including strategy and processes. \nTo assist with oversight of cybersecurity, the Board has delegated to its Audit Committee responsibility to oversee certain aspects of cybersecurity,\n including controls and reporting.\n \nAt least semi-annually, the Audit Committee or full Board receive reports from the Chief Information Officer (“CIO”) and Chief Information Security Officer (“CISO”). Reports include topics such as updates on the Company’s cybersecurity risk profile, assessments of the Company’s enterprise and product security programs, management’s strategy for managing risks, measures implemented to identify and mitigate cybersecurity risks, the status of projects to strengthen the Company’s cybersecurity posture, the emerging cybersecurity threat landscape and other relevant topics. The Board also receives a report from management on the results of the Company’s annual ERM Program risk assessment, as well periodic updates on the ERM Program and ongoing monitoring of the Company’s risks, including cybersecurity risk, as appropriate.\n \n29\nThe Company’s Cyber Risk Committee (“CRC”), comprised of a cross-functional group of senior executives, provides advice and governance regarding the Company’s strategic management of cybersecurity across the Company, including cybersecurity risk posture, projects, issues, threat intelligence and escalations. \nAt its periodic meetings, the CRC receives reports and presentations from the CISO or third parties on internal and external cybersecurity matters, and, as appropriate, briefings from the CISO on cybersecurity incidents, the Company’s incident response, recovery and remediation and actual or potential impacts.\n \nOur \nCISO\n, who has extensive cybersecurity knowledge and skills gained from over 25 years of relevant work experience, and is a Certified Information Systems Security Professional,\n is responsible for assessing, monitoring and advising the Company’s various business units, management and the \nBoard\n on risks from cybersecurity threats; implementing cybersecurity strategy, programs and processes across our enterprise and connected products and services; reviewing the risk management measures implemented by the Company to identify and mitigate cybersecurity risks; and overseeing the maintenance and deployment of the Cybersecurity Incident Response Plan.\n The CISO leads the Company’s Cybersecurity Team (“Team”), comprised of individuals with a broad range of cybersecurity skills, experiences and certifications. The Team is responsible for the implementation, monitoring and maintenance of the Company’s cybersecurity practices in coordination with its businesses, operations and functions, and oversees the Company’s cybersecurity program.\n \nMaterial Cybersecurity Risks, Threats & Incidents\nAlthough we have experienced actual and attempted cybersecurity threats and incidents in the past, we do not believe that the risks from any of these events or incidents, individually or in the aggregate, have materially affected our business, operations or financial condition, or are reasonably likely to have such an effect.\n However, due to evolving cybersecurity threats, it has and will continue to be difficult to prevent, detect, mitigate, and remediate cybersecurity incidents. For a more detailed discussion of the risks we face see the discussion set forth under “"
  }
}