{
  "ticker": "YUM",
  "cik": "0001041061",
  "company_name": "YUM BRANDS INC",
  "filing_date": "2025-02-19",
  "accession": "0001041061-25-000013",
  "primary_doc": "yum-20241231.htm",
  "item_sections": {
    "item1": "Item 1.\nBusiness.\nYum! Brands, Inc. (referred to herein as “YUM”, the “Registrant” or the “Company”), was incorporated under the laws of the state of North Carolina in 1997. The principal executive offices of YUM are located at 1441 Gardiner Lane, Louisville, Kentucky 40213, and the telephone number at that location is (502) 874-8300. Our website address is \nhttps://www.yum.com\n.\nYUM, together with its subsidiaries, is referred to in this Form 10-K annual report (“Form 10-K”) as the Company. The terms “we,” “us” and “our” are also used in the Form 10-K to refer to the Company. Throughout this Form 10-K, the terms “restaurants,” “stores” and “units” are used interchangeably. While YUM does not directly own or operate any restaurants, throughout this document we may refer to restaurants that are owned or operated by our subsidiaries as being Company-owned.\nOverview of Business\nYUM has over 61,000 restaurants in more than 155 countries and territories primarily operating under the four concepts of KFC, Taco Bell, Pizza Hut and Habit Burger & Grill (the “Concepts”). The Company’s KFC, Taco Bell and Pizza Hut brands are global leaders of the chicken, Mexican-inspired food and pizza categories, respectively. Habit Burger & Grill is a fast-casual restaurant concept specializing in made-to-order chargrilled burgers, sandwiches and more. At December 31, 2024, 98% of our Concepts’ units are operated by independent franchisees or licensees under the terms of franchise or license agreements. The terms franchise or franchisee within this Form 10-K are meant to describe third parties that operate units under either franchise or license agreements.  \nThe following is a brief description of each Concept and a summary of our Concepts’ operations as of and for the year ended December 31, 2024:\nNumber of Units\n% of Units International\nNumber of Countries and Territories\n% Franchised\nSystem Sales\n(a)\n (in Millions)\nKFC Division\n31,981 \n89 \n%\n150 \n99 \n%\n$\n34,452 \nTaco Bell Division\n8,757 \n13 \n%\n33 \n94 \n%\n17,193 \nPizza Hut Division\n20,225 \n68 \n%\n111 \n99 \n%\n13,108 \nHabit Burger & Grill Division\n383 \n2 \n%\n3 \n17 \n%\n713 \nYUM\n61,346 \n70 \n%\n156 \n98 \n%\n$\n65,466 \n(a)    Constitutes sales of all restaurants, both Company-owned and franchised. See further discussion of this performance metric within Part II, Item 7 of this Form 10-K.\nKFC\nKFC was founded in Corbin, Kentucky, by Colonel Harland D. Sanders, an early developer of the quick service food business and a pioneer of the restaurant franchise concept. The Colonel perfected his secret blend of 11 herbs and spices for Kentucky Fried Chicken in 1939 and signed up his first franchisee in 1952. KFC restaurants across the world offer fried and non-fried chicken products such as sandwiches, chicken strips, chicken-on-the-bone and other chicken products marketed under a variety of names. \nTaco Bell\nThe first Taco Bell restaurant was opened in 1962 by Glen Bell in Downey, California, and in 1964, the first Taco Bell franchise was sold. Taco Bell specializes in Mexican-style food products, including various types of tacos, burritos, quesadillas, salads, nachos and other related items.\nPizza Hut\nThe first Pizza Hut restaurant was opened in 1958 in Wichita, Kansas, and within a year, the first franchise unit was opened. Today, Pizza Hut specializes in the sale of ready-to-eat pizza products and operates in the delivery, carryout and casual dining segments around the world. \n3\nHabit Burger & Grill\nThe first Habit Burger & Grill restaurant opened in 1969 in Santa Barbara, California. The Habit Burger & Grill restaurant concept is built around a distinctive and diverse menu that includes chargrilled burgers and sandwiches made-to-order over an open flame and topped with fresh ingredients.\nBusiness Strategy\nThrough our Recipe for Good Growth we intend to deliver iconic restaurant brands and consistently drive better customer experiences, improved unit economics and higher rates of growth. Key enablers include accelerated use of digital and technology, increased collaboration and better leverage of our systemwide scale. This is done through a framework of three pillars: being Loved, Trusted and Connected.\nLoved: We grow by delighting customers with craveable food and a distinctive experience. We innovate and elevate our iconic restaurant brands that people trust and champion, resulting in relevant, easy and distinctive brands.\nTrusted: We operate responsibly with consistency and efficiency in our restaurants, across our system and in our communities. This includes a commitment to our priorities for social responsibility, risk management and sustainable stewardship of our people, food and planet.\nConnected: We use our teamwork, technology and global scale to serve every customer, everywhere, anytime. Our unmatched operating capability allows us to recruit and equip the best restaurant operators in the world to deliver great customer experiences. And our commitment to bold restaurant development drives market and franchise unit expansion with strong economics. \nOur unrivaled culture and talent and leading with smart, heart and courage are key to our success, fueling brand performance and franchise success. \nInformation about Operating Segments\nAs of December 31, 2024, YUM consists of four operating segments:  \n•\nThe KFC Division which includes our worldwide operations of the KFC concept\n•\nThe Taco Bell Division which includes our worldwide operations of the Taco Bell concept\n•\nThe Pizza Hut Division which includes our worldwide operations of the Pizza Hut concept\n•\nThe Habit Burger & Grill Division which includes our worldwide operations of the Habit Burger & Grill concept\nFranchise Agreements\nThe franchise programs of the Company are designed to promote consistency and quality, and the Company is selective in granting franchises. The Company is focused on partnering with franchisees who have the commitment, capability and capitalization to grow our Concepts. Franchisees can range in size from individuals owning just one restaurant to large publicly-traded companies. The Company has franchise relationships that are particularly important to our business, such as our relationship with Yum China (defined below) and our relationships with certain other large franchisees.\nThe Company currently has approximately 1,500 franchisees with whom we have franchise contracts. The Company utilizes both store-level franchise and master franchise programs to grow our businesses. Of our over 60,000 franchised units at December 31, 2024, approximately 35% operate under our master franchise programs, including over 15,400 units in mainland China.\n \nThe remainder of our franchise units operate under store-level franchise agreements. Under both types of franchise programs, franchisees supply capital by purchasing or leasing the land, building, equipment, signs, seating, inventories and supplies and, over the longer term, by reinvesting in the business. In certain historical refranchising transactions the Company may have retained ownership of land and building and continues to lease them to the franchisee. Store-level franchise agreements typically require payment to the Company of certain upfront fees such as initial fees paid upon opening of a store, fees paid to renew the term of the franchise agreement and fees paid in the event the franchise agreement is transferred to another franchisee. Franchisees also pay monthly continuing fees based on a percentage of their restaurants’ sales (typically between 4% to 6%) and are required to spend a certain amount to advertise and promote the brand. Under master franchise arrangements, the Company enters into agreements that allow master franchisees to operate restaurants as well as sub-franchise restaurants within certain geographic territories. Master franchisees are typically responsible for overseeing development within their territories and performing certain other administrative duties with regard to the oversight of sub-franchisees. In exchange, \n4\nmaster franchisees retain a certain percentage of fees payable by the sub-franchisees under their franchise agreements and often pay lower fees for the restaurants they operate. \nOn October 31, 2016, we completed the spin-off of our China business into an independent, publicly-traded company under the name of Yum China Holdings, Inc. (“Yum China”). As our largest master franchisee, Yum China, pays the Company a continuing fee of 3% on system sales of our Concepts in mainland China. The use by Yum China of certain of our material trademarks and service marks is governed by a master license agreement between Yum Restaurants Consulting (Shanghai) Company Limited, a wholly-owned indirect subsidiary of Yum China, and YUM, through YRI China Franchising LLC, a subsidiary of YUM.\nThe Company seeks to maintain strong and open relationships with our franchisees and their representatives. To this end, the Company invests a significant amount of time working with the franchisee community and their representative organizations on key aspects of the business, including products, technology, equipment, operational improvements and standards. \nRestaurant Operations\nThrough its Concepts, YUM develops, operates and franchises a worldwide system of both traditional and non-traditional Quick Service Restaurants (“QSR”). Traditional units can feature dine-in, carryout, drive-thru and delivery services. Non-traditional units include express units that have a more limited menu, usually generate lower sales volumes and operate in non-traditional locations like malls, airports, gasoline service stations, train stations, subways, convenience stores, stadiums, amusement parks and colleges, where a full-scale traditional outlet would not be practical or efficient.\nMost restaurants in each Concept offer consumers the ability to dine in, carryout and/or have the Concepts’ food delivered either by store-level personnel or third-party delivery services such as aggregators. In addition, Taco Bell, KFC and Habit Burger & Grill offer a drive-thru option in many stores. Pizza Hut offers a drive-thru option on a much more limited basis.  \nRestaurant management structure varies by Concept, unit size and franchise organization. Generally, each restaurant is led by a restaurant general manager (“RGM”), together with one or more assistant managers, depending on the operating complexity and sales volume of the restaurant. Each Concept issues manuals, which may then be customized to meet local regulations and customs.  These manuals set forth standards and requirements for restaurant operations, including food safety and quality, food handling and product preparation procedures, equipment maintenance, facility standards and accounting control procedures. Each franchise organization and their respective restaurant management teams are responsible for the day-to-day operation of their units, including all matters related to employment of restaurant staff, and for ensuring compliance with operating standards. \nDigital and technology are at the core of our Recipe for Good Growth. In recent years the Company has focused on building and acquiring a distinctive set of solutions with next-generation capabilities tailored for our brands and scaling these common digital and technology platforms across the globe. In 2024, we accelerated our technology transformation by integrating our digital and technology teams into a unified global team. Additionally, we have introduced our Byte by Yum! platform, a comprehensive collection of proprietary software as a service and artificial intelligence (\"AI\") driven products that enables easy operations for team members and improved experiences for customers, while consolidating essential systems into a cohesive, easy-to-manage platform. The Byte by Yum! platform includes online and mobile app ordering, point of sale, kitchen and delivery optimization, menu management, inventory and labor management and team member tools. The implementation of Byte by Yum! is also designed to enable a faster and more impactful adoption of AI by YUM and its brands, and offers franchisees leading technology capabilities with advantaged economics made possible by the scale of YUM all with a goal of unlocking new insights and driving profitable sales growth. \nDigital sales include transactions where consumers at system restaurants utilize ordering interaction that is primarily facilitated by automated technology. In 2024, our system restaurants generated digital sales of $33 billion, representing over 50% of overall system sales.\nThe Company and its Concepts own numerous registered trademarks. The Company believes that many of these marks, including our Kentucky Fried Chicken®, KFC®, Taco Bell®, Pizza Hut® and The Habit® marks, have significant value and material importance to our business. The Company’s policy is to pursue registration of important marks whenever feasible and to challenge any infringement of our marks vigorously. The use of certain of these marks by franchisees has been authorized in our franchise agreements. Under current law and with proper use, the Company’s rights in our marks can generally last indefinitely. The Company also has certain patents on restaurant equipment and technology which, while valuable, are not currently considered material to our business.\n5\nSupply\n \nand Distribution\nThe Company and franchisees of the Concepts are substantial purchasers of a number of food and paper products, equipment and other restaurant supplies. The principal items purchased include chicken, cheese, beef and pork products, paper and packaging materials. Prices paid for these supplies fluctuate. When prices increase, the Concepts may attempt to pass on such increases to their customers, although there is no assurance that this can be done in practice.  The Company does not typically experience significant continuous shortages of supplies, and alternative sources for most of these supplies are generally available.  \nIn the U.S., the Company, along with the representatives of the Company’s KFC, Taco Bell and Pizza Hut franchisee groups, are members of Restaurant Supply Chain Solutions, LLC (“RSCS”), a third party which is responsible for purchasing certain restaurant products and equipment. Additionally, Habit Burger & Grill entered into a purchasing agreement with RSCS effective July 31, 2020. The core mission of RSCS is to provide the lowest possible sustainable store-delivered prices for restaurant products and equipment.  This arrangement combines the purchasing power of the Company-owned and franchisee restaurants, which the Company believes leverages the system’s scale to drive cost savings and effectiveness in the purchasing function. The Company also believes that RSCS fosters closer alignment of interests and a stronger relationship with our franchisee community.\nMost food products, paper and packaging supplies, and equipment used in restaurant operations are distributed to individual restaurant units by third-party distribution companies. In the U.S., McLane Foodservice, Inc. is the distributor for the majority of items used in Company-owned restaurants and for a substantial number of franchisee restaurants.  Outside the U.S., we and our Concepts’ franchisees primarily use decentralized sourcing and distribution systems involving many different global, regional and local suppliers and distributors. Our international franchisees generally select and manage their own third-party suppliers and distributors, subject to our internal standards. All suppliers and distributors are expected to provide products and/or services that comply with all applicable laws, rules and regulations in the state and/or country in which they operate as well as comply with our internal standards.\nAdvertising and Promotional Programs\nCompany-owned and franchise restaurants are required to spend a percentage of their respective restaurants’ sales on advertising programs with the goal of increasing sales and enhancing the reputation of the Concepts. Advertising may be conducted nationally, regionally and locally. When multiple franchisees operate in the same country or region, the national and regional advertising spending is typically conducted by a cooperative to which the franchisees and Company-owned restaurants, if any, contribute funds as a percentage of restaurants’ sales. The contributions are primarily used to pay for expenses relating to purchasing media for advertising, market research, commercial production, talent payments and other support functions for the respective Concepts. We have the right to control the advertising activities of certain advertising cooperatives, typically in markets where we have Company-owned restaurants, through our majority voting rights.\nWorking Capital\nInformation about the Company’s working capital is included in MD&A in Part II, Item 7 and the Consolidated Statements of Cash Flows in Part II, Item 8.\nSeasonal Operations\nThe Company does not consider its operations to be seasonal to any material degree.\n6\nCompetition\nThe retail food industry, in which our Concepts compete, is made up of supermarkets, supercenters, warehouse stores, convenience stores, coffee shops, snack bars, delicatessens and restaurants (including those in the QSR segment), and is intensely competitive with respect to price and quality of food products, new product development, digital engagement, advertising levels and promotional initiatives, customer service reputation, restaurant location and attractiveness and maintenance of properties. Competition has also increased from and been enabled by delivery aggregators and other food delivery services in recent years, particularly in urbanized areas. Our Concepts also face competition as a result of convergence in grocery, convenience, deli and restaurant services, including the offering by the grocery industry of convenient meals, including pizzas and entrees with side dishes. The retail food industry is often affected by: changes in consumer tastes; national, regional or local economic conditions; currency fluctuations; demographic trends; traffic patterns; the type, number and location of competing food retailers and products; and disposable purchasing power. Within the retail food industry, each of our Concepts competes with international, national and regional chains as well as locally-owned establishments, not only for customers, but also for management and hourly personnel, suitable real estate sites and qualified franchisees.  Given the various types and vast number of competitors, our Concepts do not constitute a significant portion of the retail food industry in terms of number of system units or system sales, either on a worldwide or individual country basis.\nEnvironmental Matters\nThe Company is not aware of any federal, state or local environmental laws or regulations that will materially affect our earnings or competitive position, or result in material capital expenditures. However, the Company cannot predict the effect on our operations due to possible future environmental legislation or regulations. During 2024, there were no material capital expenditures for environmental control facilities and no such material expenditures are anticipated.\nGovernment Regulation\nU.S. Operations.\n \n \nThe Company and its U.S. operations, as well as our franchisees, are subject to various federal, state and local laws affecting our business, including laws and regulations concerning information security, privacy, labor and employment, health, marketing, food labeling, competition, public accommodation, sanitation and safety. Each of our and our Concepts’ franchisees’ restaurants in the U.S. must comply with licensing requirements and regulations promulgated by a number of governmental authorities, which include health, sanitation, safety, fire and zoning agencies in the state and/or municipality in which the restaurant is located. In addition, each Concept must comply with various state and federal laws that regulate the franchisor/franchisee relationship. To date, the Company has not been materially adversely affected by such licensing requirements and regulations or by any difficulty, delay or failure to obtain required licenses or approvals.\nInternational Operations\n.\n  Our and our Concepts’ franchisees’ restaurants outside the U.S. are subject to national and local laws and regulations which have similarities to those affecting U.S. restaurants but may differ among jurisdictions. Like restaurants in the U.S., restaurants outside the U.S. are subject to certain regulations and tariffs on imported commodities and equipment, laws regulating foreign investment and anti-bribery and anti-corruption laws.  \nSee",
    "item1a": "Item 1A. “Risk Factors”.\n24\nGovernance\nThe Company’s cybersecurity risk management processes are integrated into the Company’s overall risk management processes. The Board of Directors has overall responsibility for the oversight of the Company’s risk management and has delegated the oversight of specific risk-related responsibilities to certain Board committees. The Audit Committee oversees the Company’s business and financial technology risk exposure, which includes data privacy and data protection, information security and cybersecurity, as well as the controls in place to monitor and mitigate these risks.\nAt a management level, our Program is led by our CISO, who reports to the Company’s Chief Digital and Technology Officer. Our CISO has expertise in cybersecurity risk management through, among other things, over 30 years of information security experience, prior CISO and security leadership positions at other public companies, and certain technology and information security matters certifications. Additionally, we have a formal data privacy management committee made up of privacy professionals, operational experts and specialist legal counsel which is overseen by our  Chief Legal Officer.\nWe have a Data Incident Response Plan (“the Plan”) which provides for controls and procedures in connection with cybersecurity events including escalation procedures as summarized below. Under the Plan, we have established a Data Incident Response Team (the “Response Team”), a cross-functional group comprised of certain members of senior management, including our Chief Legal Officer and CISO. The Plan provides that the Response Team is responsible for assessing, investigating and responding to any cybersecurity event elevated for its consideration by our CISO. \nIn addition, under the Plan, we have established a cross-functional management group comprised of our Chief Legal Officer, Chief Financial Officer, Chief Digital and Technology Officer, Vice President Internal Audit, Chief Compliance Officer, Senior Vice President Finance & Corporate Controller and CISO. The Plan provides that any cybersecurity incident that is elevated for the review of the Response Team will also be reviewed by this group to determine whether any such incident is material for securities laws purposes and whether public disclosure is required or advisable in connection therewith, following any necessary consultation with the Company’s senior management, Disclosure Committee, Audit Committee and/or Board of Directors.\nOur CISO and Chief Digital and Technology Officer advise the Audit Committee at least four times a year, and the Board of Directors regularly, on our  management and oversight of information security risks and data protection risks.  The Audit Committee also receives periodic updates on data privacy from members of management within our data privacy group in addition to the regular updates from our CISO. The Audit Committee provides a summary to the full Board at each regular Board meeting of the information security risk review together with any other risk related subjects discussed at the Audit Committee meeting.",
    "item1c": "Item 1C.\nCybersecurity.\nCybersecurity Risk Management Program\nInformation security and data privacy have been and remain of the utmost importance to the Company in light of the value we place on maintaining the trust and confidence of our consumers, employees and other stakeholders.\nWe have a risk-based cybersecurity risk management program (the “Program”) in place designed to assess, identify and manage material risks from cybersecurity threats. The Program falls under the oversight of our Chief Information Security Officer (“CISO”) and defines controls for access management, data protection and vulnerability detection, in addition to incident response protocols which are discussed further in the “Governance” section herein. The Program incorporates customized elements from industry-leading standards to drive robust and comprehensive protection. \nTo supplement our own internal processes and controls, we regularly engage consultants and other third parties as part of our Program, including to periodically:\n•\nTest our information security defenses and to perform external penetration assessments; and\n•\nReview and assess the Program and its maturity\nWe also have processes to oversee and identify material cybersecurity risks associated with our use of third-party service providers and their information systems. As part of these processes, we conduct cybersecurity due diligence around significant third-party service providers who access our information technology systems before their engagement. We require third-party service providers to promptly notify us of any actual or suspected breach impacting our data or operations. Additionally, we obtain Type 1 and Type 2 System and Organization Controls (“SOC”) 2 reports on an annual basis from vendors that host our significant financial applications to aid in our assessment of information security risk associated with our relationship with the host vendor. If a host vendor is not able to provide a SOC 2 report, we take additional steps to assess information security risk associated with the relationship.  \nThe vast majority (\n98\n%) of our restaurants are owned and operated by franchisees who themselves are at risk of cyber-attacks or security incidents. Whilst some of those franchisees do operate their restaurants utilizing the Company’s networks and systems, many use networks and systems which they manage themselves. In such instances, there is limited direct connectivity between the networks that the Company manages and the networks which our franchisees manage. We have established minimum information security standards for our franchisees through our Franchise Agreement Policy Manuals and Brand Standards and those minimum information security standards are in the process of being adopted. \nDespite the security measures implemented as part of our Program, the current cyber threat environment presents increased risks for all companies, and we are a frequent target of cyber-attacks and have experienced security incidents.  For example, on January 18, 2023, the Company announced a ransomware attack that impacted certain Information Technology (“IT”) systems. This incident resulted in the closure of fewer than 300 restaurants in one market for one day, and certain of the Company’s IT systems and data were affected. In addition, although data was taken from our network,  the affected data was limited to certain personal information of former and current employees, and we have no evidence that customer databases were accessed. \nWe have incurred, and may continue to incur, certain expenses related to this attack, including expenses to respond to, remediate and investigate this matter. In addition, several separate putative class actions have been filed in U.S. federal and state court by current and/or former employees alleging violations of privacy and other rights in connection with the ransomware incident.\nWe do not believe that any risks we have identified to date from cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations or financial condition. For additional information regarding the risks to us associated with cybersecurity incidents, see",
    "item1b": "Item 1B.\nUnresolved Staff Comments.\nThe Company has received no written comments regarding its periodic or current reports from the staff of the Securities and Exchange Commission that were issued 180 days or more preceding the end of its 2024 fiscal year and that remain unresolved."
  }
}