{
  "ticker": "ZBH",
  "cik": "0001136869",
  "company_name": "ZIMMER BIOMET HOLDINGS, INC.",
  "filing_date": "2025-02-25",
  "accession": "0000950170-25-026604",
  "primary_doc": "zbh-20241231.htm",
  "item_sections": {
    "item1": "Item 1A. Risk Factors - We and our business partners are dependent on sophisticated information technology and if we fail to effectively maintain or protect our information systems and data, including from cybersecurity events, our business could be adversely affected.\nGovernance\nThe Audit Committee of the Board of Directors oversees our cybersecurity program.  It considers cybersecurity risk individually and within our overall risk management framework.  We obtain periodic assessments of our cybersecurity program from independent third party experts, the results of which assessments are reported to the Audit Committee.  Additionally, cybersecurity threats and incidents determined through our cybersecurity program to present potential material impacts to our financial results, operations, and/or reputation are required to be immediately reported to the Audit Committee in accordance with our escalation framework.\nO\nur \nVP, IT Global Infrastructure (“ITGI”\n)\n \nleads our cybersecurity program through our global information security operations team and also leads our IT Governance, Risk and Compliance and Incident Response functions.  Ou\nr acting Chief Information Security Officer (“CISO”) leads our security operations functions. \n \nOur CISO has over 10 years of experience in information technology security obtained in civilian and military roles and our ITGI has over 20 years of experience in information technology and cybersecurity leadership obtained in civilian roles. \n \nAs part of our cybersecurity program, our CISO and/or our Chief Information and Technology Officer regularly report on cybersecurity matters to our Audit Committee.\n  As of December 31, 2024, our Cybersecurity, Risk and Compliance teams consisted of team members and contractors, many of whom have advanced degrees and cybersecurity-related industry certifications.  Under the direction of our ITGI and CISO, we monitor developments that could affect our long-term organizational cybersecurity strategy based on threats globally and to continually enhance our cybersecurity program in response to such developments. \nWe have established processes providing for timely review of cybersecurity incidents by a cross-functional subcommittee of our Disclosure Committee\n \nto evaluate such incidents for potential disclosure, and to ensure that the members of management responsible for overseeing the operation of our disclosure controls and procedures are informed of such cybersecurity risks and incidents. \n This subcommittee consists of leading representatives from our information security, accounting, legal and internal audit functions and may be supplemented by other subject matter experts depending on the nature of cybersecurity incidents under review.  \nThe subcommittee meets on a periodic and ad hoc basis to receive reports about cybersecurity incidents and our cybersecurity program.  The subcommittee escalates certain cybersecurity incidents to the Disclosure Committee within our escalation framework.  Additionally, our escalation framework requires that any cybersecurity incidents determined to be material be immediately reported to the Audit Committee."
  }
}