{
  "ticker": "ZBRA",
  "cik": "0000877212",
  "company_name": "ZEBRA TECHNOLOGIES CORP",
  "filing_date": "2025-02-13",
  "accession": "0000877212-25-000027",
  "primary_doc": "zbra-20241231.htm",
  "item_sections": {
    "item1": "Item 1.\nBusiness\nThe Company\nWe are a global leader in the Automatic Identification and Data Capture (“AIDC”) industry. The AIDC market consists of mobile computing, data capture, radio frequency identification devices (“RFID”), thermal barcode printing, and other workflow automation products and services. The Company’s products, services, and software solutions (“offerings”) are proven to help our customers and end-users digitize and automate their workflows to achieve their critical business objectives, including improved productivity and operational efficiency, optimized regulatory compliance, and better customer experiences.\nWe design, manufacture, and sell a broad range of AIDC offerings, including: mobile computers, barcode scanners and imagers, RFID readers, specialty printers for barcode labeling and personal identification, real-time location systems (“RTLS”), related accessories and supplies, such as labels and other consumables, and related software applications. We also provide machine vision and robotics automation solutions; a full range of services, including maintenance, technical support, repair, \n4\nTable of Contents\nmanaged and professional services; as well as cloud-based software subscriptions. End-users of our offerings include those in retail and e-commerce, manufacturing, transportation and logistics, healthcare, public sector, and other industries. We operate in 114 facilities with approximately 9,900 employees worldwide.  We provide our offerings globally through a direct sales force and an extensive network of over 10,000 channel partners, operating in approximately 176 countries.\nWe continue to advance our Enterprise Asset Intelligence (“EAI”) vision: every asset and front-line worker visible, connected, and fully optimized. Through continual innovation, we have expanded beyond the traditional AIDC market to transform activities such as factory production, packages moving through a supply chain, retail shopping, the hospital patient journey and first responders addressing public safety and emergency situations. Data from enterprise assets, including status, condition, location, utilization, and preferences, is analyzed in the cloud to provide prioritized actionable insights. As a result, our offerings enable enterprises to “sense, analyze, and act” more effectively to optimize their activities.\nThe need to transform workflows is being driven by secular trends in technology, which include the internet of things (\n“IoT”\n), cloud-based data analytics, automation, mobility, computer vision, as well as artificial intelligence and machine learning. The IoT enables the real-time exchange of an increasingly broad set of information among a proliferation of smart, connected devices. The continued rapid growth of mobile computing devices and application software is also significantly expanding use cases throughout enterprises and supply chains. With these expanded capabilities, end-users can consume and act upon dynamic enterprise data and information anytime and anywhere. Leveraging artificial intelligence through machine learning can analyze real-time data for increased visibility into workflows. Additionally, computer and machine vision technology, which enables the automatic extraction and understanding of useful information from a digital image or video, provides a key element in many of our offerings.\nAcquisitions\nMatrox: \nOn June 3, 2022, the Company acquired Matrox Electronic Systems Ltd. (“Matrox”) for $881 million in cash, net of Matrox’s cash on-hand. Matrox is a leading provider of advanced machine vision components and software serving multiple end-markets. Through its acquisition, the Company expanded its machine vision products and software offerings. The operating results of Matrox are included in the EVM segment. \nPhotoneo\n: On December 27, 2024, the Company entered into a definitive agreement to acquire Photoneo, a leading developer and manufacturer of 3D machine vision solutions. The purchase price of approximately €60 million is expected to be funded with cash on hand.  The transaction is subject to customary closing conditions and is expected to close in the first quarter of 2025. The acquired business will become part of the EVM segment.\nSee Note 5, \nBusiness Acquisitions \nin the Notes to Consolidated Financial Statements for additional details.\n \nOperations and Technologies\nOur operations consist of two reportable segments: Asset Intelligence & Tracking (“AIT”), which includes barcode and card printing, RFID and RTLS offerings, supplies, and services; and Enterprise Visibility & Mobility (“EVM”), which includes mobile computing, data capture, fixed industrial scanning and machine vision, services and workflow optimization solutions. We believe that the offerings across these segments collectively elevate Zebra’s positioning with our customers, enabling us to better transform workflows.\nAsset Intelligence & Tracking\nBarcode and Card Printing:\n We design, manufacture, and sell printers, which produce high-quality labels, wristbands, tickets, receipts, and plastic cards on demand. Our customers use our printers in a wide range of applications, including routing and tracking, patient safety, transaction processing, personal identification, product authentication, ticketing and receipts. These applications require high levels of data accuracy, speed, and reliability.\nOur printers use thermal printing technology, which creates images by heating certain pixels of an electrical printhead to selectively image a ribbon or heat-sensitive substrate.  Our printers integrate company-designed mechanisms, electrical systems, and firmware that supports serial, parallel, Ethernet, USB, Bluetooth, or 802.11 wireless communications with appropriate security protocols.  Enclosures of metal or high-impact plastic help ensure durability of our printers. Printing instructions can be received as a proprietary language such as Zebra Programming Language II, as a print driver-provided image, or as user-defined Extensible Markup Language. These features make our printers easy to integrate into most computer systems.  \nWe also provide dye-sublimination thermal card printers that produce high quality images and are used for secure, reliable personal identification (e.g. state identification cards, drivers’ licenses, and healthcare identification cards), access control (e.g. employee or student building access), and financial transactions (e.g. credit, debit and ATM cards). Additionally, we provide RFID printers that encode data into passive RFID transponders embedded in a label or card. We offer a wide range of accessories and options for our printers, including carrying cases, vehicle mounts and battery chargers. \n5\nTable of Contents\nRFID and RTLS Offerings: \nWe provide a range of hardware and software options for capturing location data to satisfy a large variety of requirements for range, accuracy, and precision. Our active and passive RFID products include fixed readers, RFID enabled mobile computers, and RFID sleds that utilize passive ultra-high frequency to provide high-speed, data capture from hundreds or thousands of RFID tags in near real-time without line of sight, complementing the barcode. Using the Electronic Product Code (“EPC”) standard, end-users across multiple industries use our RFID technology to track high-value assets, monitor shipments, and drive increased retail sales through improved inventory accuracy. Our location solutions offerings include a range of RTLS offerings that generate precise, on-demand information about the physical location and status of high-value assets, equipment, and people. These offerings incorporate active and passive RFID technologies, beacons, and other tracking technologies to enable users to locate, track, manage, and optimize the utilization of enterprise assets and personnel. We provide substantially all elements of the location solution, including tags, sensors, exciters, middleware software, and application software. We also foster a highly specialized ecosystem of location and tracking partners who complement our offerings and help integrate them into our joint customers’ operations.\nSupplies:\n We produce and sell stock and customized thermal labels, wristbands, receipts, ribbons, plastic cards, and RFID tags suitable for use with our printers, as well as wristbands for use in laser printers. We support our printing products, resellers, and end-users with an extensive line of superior quality, high-performance supplies optimized to a particular end-user’s needs, such as chemical or abrasion resistance, extreme temperature environments, exceptional image quality, or long life. We promote the use of supplies with our printing equipment. Our supplies business also includes electronic sensors and temperature-monitoring labels which incorporate chemical indicators designed to change color upon exceeding predefined time and/or temperature thresholds, used in vaccine distribution and other use cases in healthcare and food safety.  \nServices:\n We provide a full range of maintenance, technical support, and repair services. We also provide managed and professional services, including those which help customers manage their devices and related software applications. Our offerings include cloud-based subscriptions and multiple service levels. They are typically contracted through multi-year service agreements. We provide our services directly and through our global network of partners.\nEnterprise Visibility & Mobility\nMobile Computing: \nWe design, manufacture, and sell rugged and enterprise-grade mobile computing products and accessories in a variety of specialized form factors and designs to meet a wide array of enterprise applications. Purpose-built handheld and wearable mobile computers, vehicle mounted computers, tablets and kiosks ensure reliable operations for targeted use cases, surviving years of rough handling and harsh environments. Industrial applications include inventory management in warehouses and distribution centers; field mobility applications include field service, post and parcel, and direct store delivery; and retail and customer facing applications include e-commerce, omnichannel, mobile point of sale, inventory look-up, staff collaboration, and analytics. Our mobile computing products primarily incorporate the Android™ operating system with software extensions for the enterprise and support local-area and wide-area voice and data communications. Our products include software tools and services that enable secure data transmission while also supporting application development, device configuration, and field support to facilitate seamless, rapid deployment and maximum customer return on investment.  Our products often incorporate barcode scanning, global position system and RFID features, and other sensory capabilities. Additionally, specialized features, such as advanced data capture technologies, data analytics technologies, voice and video collaboration tools, and advanced battery technologies, enable our customers to work more efficiently and better serve their own customers.\nData Capture, Fixed Industrial Scanning, and Machine Vision:\n We design, manufacture, and sell barcode scanners, industrial machine vision cameras, and fixed industrial scanners. Our portfolio of scanners includes laser scanning and imager products in a variety of form factors, including fixed, handheld, and embedded original equipment manufacturer (“OEM”) modules. Our scanners incorporate a range of technologies including area imagers, linear imagers, and lasers, as well as read linear and two-dimensional barcodes.  They are used in a broad range of applications, ranging from supermarket checkouts to industrial warehouse optimization to patient management in hospitals.  The design of these offerings reflects the diverse needs of these markets, with different ergonomics, multiple communication protocols, and varying levels of ruggedness.  In 2021 we introduced fixed industrial scanning and machine vision offerings, and in 2022, we significantly expanded our machine vision offerings through the acquisition of Matrox Imaging. Our fixed industrial scanning products automatically track and trace items that move from production through distribution. Our industrial machine vision platform-independent software, software development kits, smart cameras, vision controllers, frame grabbers, input/output cards, and 3D sensors capture, inspect, assess, and record data from industrial vision systems in factory automation, semiconductor inspection, pharmaceutical packaging, food & beverage, among other use cases. We also provide related software and accessories for these offerings.\nServices:\n We provide a full range of maintenance, technical support, and repair services. We also provide managed and professional services that, among other things, help customers design, test, and deploy our offerings as well as manage their mobility devices, software applications and workflows. Our offerings include cloud-based subscriptions with multiple service levels, which are typically contracted through multi-year service agreements. We provide our services directly and through our global network of partners.\n6\nTable of Contents\nWorkflow optimization solutions:\n We provide a portfolio of offerings that help our customers improve the agility and productivity of key workflows by analyzing and acting on operational data in real-time. Our primary focus is on frontline workers in Zebra’s end markets, including retail, transportation and logistics, manufacturing, and healthcare.  Our workflow optimization solutions include:\n•\nSoftware-based offerings, which include workforce management, workflow execution and task management, demand-sensing, price optimization, and prescriptive analytics, as well as communication and collaboration-based offerings. These offerings are typically delivered through cloud-based software subscriptions and leverage big data, artificial intelligence, and mobile and web applications to provide customers with real-time visibility and actionable insights about their business.  By analyzing labor, inventory, transactional and real-time situational data, these offerings are able to forecast demand, prescribe actions, schedule workers, and enhance collaboration. Our software-based offerings are available with multiple service levels, and are often contracted through multi-year service agreements; \n•\nManaged service offerings comprised of software and hardware bundled together, which include a range of physical inventory management offerings for retail, including offerings for full store physical inventories, cycle counts, and analytics; and\n•\nRobotic automation offerings, which include software-powered autonomous robots that enable customers to orchestrate workflows alongside frontline workers, improving productivity and operational efficiency. Our robotic automation offerings are available in a variety of form factors to accommodate many use cases, from e-commerce fulfillment to material movement.\nOur Competitive Strengths \nThe following are core competitive strengths that we believe enable us to differentiate ourselves from our competitors:\nAn industry leader focused on improving enterprise workflows on the frontline\nWe are focused on the key complementary technology offerings that drive improved enterprise workflows on the frontline, including mobile computing, barcode and card printing, data capture, RFID, fixed industrial scanning, machine vision, and workflow optimization solutions, along with related software, services, and accessories. Our leadership position enables us to work with and support customers globally, in a variety of industries, who are focused on implementing leading-edge offerings.\nHigh barriers to entry\nOn a global basis, we have long-standing relationships with end-users and with our extensive network of channel partners. We believe these customer relationships and our strong partner network are critical to our success and would be difficult for a new market entrant to replicate. We believe a significant portion of our offerings are deployed with specialized product performance and software application requirements, which could result in high switching costs.\nCommitment to innovation and deep industry-specific expertise\nOver time, we have developed and delivered improved, targeted end-to-end offerings for our customers.  We remain committed to leveraging our technology portfolio and expertise in the industries that we service to continue to develop innovative offerings that meet the key needs of our customers.\nHighly diversified business mix\nWe are highly diversified across business segments, end markets, geographies, and customers. Additionally, we have strong recurring business in services, supplies, and software driven by an extensive global installed base of purpose-built offerings.\nGlobal reach and brand\nWe sell to customers directly and through our network of channel partners around the world. Our presence gives us the capability to serve our customers globally. In addition, we maintain strong brand recognition with a positive reputation in the industry as a trusted and strategic partner known for delivering high quality offerings that are reliable and durable.      \nScale advantages\nWe believe the size and scope of our operations, including market leadership, offering development investment, portfolio breadth, and global distribution, give us advantages over our competitors. We believe we have the largest installed base of offerings compared to other companies in our industry. These characteristics enable us to compete successfully, achieve economies of scale, and develop industry-leading offerings.\n7\nTable of Contents\nOur Business Strategies \nLeverage our market leadership position and innovation to profitably grow our core business\nWe expect to drive revenue growth by continuing to outpace our competition in our core businesses, including mobile computing, data capture, thermal barcode printing, and services. We expect to achieve this by leveraging our broad portfolio of offerings and product innovation and continuing to be a strategic partner to end customers. We also expect to drive growth by capitalizing on technology transitions occurring in the industry, including transitions to WiFi 7, the 5th generation mobile network (5G) and Android™ operating system in mobile computing and transitions in data capture to technologies involving 2D and 3D imaging and RFID, among others. This includes increased focus on market segments and geographies that offer share-gain opportunities. In addition, we plan to leverage our market-leading installed base to accelerate growth in attach-oriented offerings, including services, supplies, accessories, and software applications. Our global channel partner network is vital to helping us achieve these goals. As such, we will ensure that we provide the necessary value and support for our partners to be successful.\nAdvance our Enterprise Asset Intelligence vision\nOur EAI vision is for every asset and front-line worker to be connected, visible, and fully optimized. We believe that secular technology trends, particularly in IoT, cloud computing, automation, mobility, and artificial intelligence advance our vision and are transforming our customers’ businesses and our industry, providing us with significant new opportunities to create value for our customers and for the Company. We expect to capitalize on these trends, and in particular the proliferation of smart connected sensors and devices in our core market segments, by providing end-to-end offerings that integrate these sensors and devices with cloud-based software which add value to our customers’ workflows and analytics. We plan to continue investing in the development of technologies that serve as the foundation for intelligent operations, providing our customers with visibility, connected frontline workers, and intelligent automation. Our offerings will also increasingly include advanced features, functions, and user experiences to drive additional competitive differentiation and elevate our role as a solutions provider.\nIncrease our opportunity for growth through expansion in adjacent market segments\nWe plan to drive growth through expansion, organically and inorganically, in adjacent market segments that are synergistic with our core markets. We will focus specifically on segments where our offerings, workflow expertise, and customer and industry relationships enable us to provide significant value to end-users.  \nEnhance financial strength and flexibility\nWhile maintaining our strong balance sheet, we intend to continue to improve profitability and cash flow generation through operational execution and increased productivity derived from continuous business process improvement, supply chain resiliency, cost management, and focus on working capital efficiency.\nSustainable business model \nZebra’s sustainability priorities of human capital management, resource conservation, and climate align with our strategic focus and corporate values. Initiatives within these priorities are advanced by our cross-functional Sustainability Council, with executive sponsorship and board oversight. Our approach helps to ensure that our business is sustainable over the long term for the benefit of our primary stakeholder groups, including employees, customers, partners, and investors. We are driving a high-performance culture, striving to consistently be the employer of choice in the communities where we work and live. We also focus on waste reduction, circular economy product innovation with certified refurbished devices, eco-packaging and sustainable product design. Additionally, we have science-based targets for carbon emission reductions in Zebra’s operations and throughout our value chain. \nCompetition\nWe operate in a highly competitive environment. The need for companies to improve productivity and implement their strategies, as well as the secular trends around IoT, cloud computing, automation, and mobility, are some of the factors that are creating growth opportunities for established and new competitors.\nKey competitive factors include the breadth and quality of offerings, as well as pricing, design, performance, durability, geographic availability, warranty coverage, relationships with customers and channel partners, company reputation, and brand recognition. We believe we compete effectively with respect to these factors.\nBarcode and Card Printing\n: We consider our direct competition in printing to be producers of on-demand fixed, mobile, and RFID thermal printers. We also compete with companies producing printing systems that use technologies such as laser, ink-jet, and direct marking. In addition, service bureaus, which provide centralized services, represent an alternative to our card printing offerings. Competitors include: Avery Dennison, Entrust, Honeywell, Sato, Toshiba TEC, and TSC.\n8\nTable of Contents\nData Capture, Fixed Industrial Scanning, and Machine Vision\n: Competitors that provide a broad portfolio of barcode scanning products and related services that are suitable for most global market applications include Datalogic and Honeywell. We also compete against smaller companies that focus on limited product subsets or specific regions, including Newland. Competitors in our fixed industrial scanning and machine vision business include Cognex, Keyence, and SICK.\nMobile Computing\n: Competitors in mobile computing and related services include companies that have historically served enterprises with ruggedized devices. For some applications, we compete with companies that provide tablets and smart phones. Competitors include: Datalogic, Honeywell, Panasonic, and Urovo.\nRFID and RTLS Offerings\n: We compete with numerous companies operating in this market including Chainway, Impinj, Invengo, JADAK, Rodinbell, and Ubisense.\nSupplies\n: The supplies industry is highly fragmented with competition comprised of numerous companies of various sizes around the world.\nWorkflow optimization solutions:\n We compete with a diverse and varied group of companies across our offerings worldwide. Competitors range from providers of software-based offerings serving customers in the retail industry to providers of autonomous mobile robot offerings serving customers in the manufacturing, distribution, and fulfillment industries.\nCustomers\nEnd-users of our offerings are diversified across a wide variety of industries. We have three customers, who are distributors of the Company’s offerings, that individually accounted for more than 10% of our Net sales during the past three years. No other customer accounted for more than 10% of our Net sales during these years. See Note 20, \nSegment Information & Geographic Data \nin the Notes to Consolidated Financial Statements for further information.\nOur Net sales to significant customers as a percentage of the Company’s total Net sales were approximately:\n \nYear Ended December 31,\n \n2024\n2023\n2022\nCustomer A\n21 \n%\n18 \n%\n21 \n%\nCustomer B\n19 \n%\n14 \n%\n15 \n%\nCustomer C\n14 \n%\n12 \n%\n13 \n%\nSales and Marketing\nSales:\n We sell our offerings primarily through distributors (two-tier distribution), value added resellers (“VARs”), independent software vendors (“ISVs”), direct marketers, and OEMs, and our software offerings primarily through our direct sales force. We also sell our offerings directly to a select number of customers through our direct sales force. Distributors purchase our products and sell to VARs, ISVs and others, thereby increasing the distribution of our products globally. VARs, ISVs, OEMs, and systems integrators provide end users with a variety of hardware, accessories, software applications, and services. VARs and ISVs typically customize offerings for specific end-user applications using their industry, systems, and applications expertise. Some OEMs resell Zebra-manufactured offerings under their own brands as part of their own product offerings. Because these sales channels provide specific software, configuration, installation, integration, and support services to end-users within various industry segments, these relationships are highly valued and allow our products to reach end users in a wide array of industries around the world. We believe that the breadth of our distributor and channel partner network is a competitive differentiator and enhances our ability to compete. Finally, we experience some seasonality in sales, depending upon the geographic region and industry served.\nMarketing:\n Our marketing function aligns closely with sales, customer success and product management to promote our offerings that address the needs of our customers. Marketing is responsible for leading strategic cross-functional practices which benefit the broader organization including pricing, enterprise analytics, customer experience, market sizing, brand strategy and channel strategy. From a more traditional sense, the marketing organization is also comprised of regional marketing teams that interface closely with customers, partners, and sellers; plus teams that support external communications, offering marketing, digital marketing, marketing operations, and business intelligence functions.\n9\nTable of Contents\nManufacturing and Outsourcing\nFinal assembly of our hardware products is performed by third parties, including electronics manufacturing services companies (“EMSs”) and joint design manufacturers (“JDMs”). Our products are currently produced in facilities primarily located in the Asia-Pacific region, including China, Taiwan, Vietnam, Malaysia, and Mexico. The EMSs and JDMs produce our products to our design specifications. We maintain control over portions of the supply chain, including supplier selection and price negotiations for key components. The manufacturers generally purchase all the components and subassemblies used in the production of our products. Our products are shipped to regional distribution centers, operated by third-party logistics providers or the Company. A portion of products are reconfigured at the distribution centers through firmware downloads, packaging, and customer specific customization before they are shipped to customers. In addition, certain products are manufactured in accordance with procurement regulations and various international trade agreements and remain eligible for sale to the U.S. government. \nProduction facilities for our supplies products are located in the U.S. and Europe. We also supplement our in-house supplies production capabilities with third-party manufacturers, principally located in Asia-Pacific.\nRepair services for our products are performed by either our own operations or through third parties, with repair service hubs located in each of the regions in which we serve our customers.\nResearch and Development\nThe Company devotes significant resources to developing innovative offerings for our target markets and ensuring that our offerings maintain high levels of reliability and provide value to end-users. Research and development expenditures for the years ended 2024, 2023 and 2022 were $563 million, $519 million and $570 million, or 11.3%, 11.3% and 9.9% of Net sales, respectively. Worldwide, we have employed approximately 2,750 engineers and innovation and design experts, who along with contractors, are focused on strengthening and broadening our extensive portfolio of offerings.\nIntellectual Property\nWe rely on a combination of trade secrets, patents, trademarks, copyrights, and contractual rights to establish and protect our innovations, and hold a large portfolio of intellectual property rights in the U.S. and other countries. As of December 31, 2024, the Company owned approximately 1,700 trademark registrations and trademark applications, and approximately 7,150 patents and patent applications, worldwide.\nWe believe that our intellectual property will continue to provide us with a competitive advantage in our offerings as well as provide leverage for future technologies. Our success depends more upon our extensive know-how, deep understanding of end-user processes and workflows, innovative culture, technical leadership, and marketing and sales abilities. Although we do not rely only on patents or other intellectual property rights to protect or establish our market position, we will enforce our intellectual property rights when and where appropriate.\nHuman Capital\nAs of December 31, 2024, the Company had approximately 9,900 employees globally, with a majority in sales and technical roles. Our employees work in 54 countries with 45% of our employee population residing in the U.S. Some locations where business is conducted, primarily in Europe, China, and India, are subject to labor laws that differ significantly from those in the U.S.\nThe Company is committed to attracting, developing, and retaining talent to enable our strategic vision and purpose. This commitment directly shapes our approach to fostering a culture of belonging and advances employee engagement. It is Zebra’s policy to provide equal employment opportunity to all applications and employees. Our vision is to leverage the workforce where employees can bring their best selves to work, and to be a workspace where all employees are seen, heard, valued and respected. We believe this increases Zebra’s innovation.\nWe believe that our strong Company culture is a key contributor to our success. Following the refresh of Zebra’s values (Lead through Innovation; Deliver Excellence with Agility; Think and Act Customer First; Succeed as One; and Make a Positive Impact) in 2023, we launched our culture reinvigoration campaign in 2024. The campaign’s action-based workshop, experienced virtually or in person, provides employees an opportunity to learn and share experiences relating to the importance of Zebra’s culture and values. Employee engagement within the Company is consistently high and measures above relevant benchmarks for technology companies. Furthermore, as recognition of the Company’s strong culture and commitment to its employees, Zebra was ranked #78 on Newsweek’s list of Global Most Loved Workplaces, and #51 on Fast Company’s list of the Best Workplaces for Innovators.\nThe well-being of Zebra’s employees remains a core focus, and we have benefits reflecting this commitment, including zDay, (a paid, Company-wide day off for all eligible Zebra employees), summer hours, and Focus Fridays (which encourage meeting-free time on Friday afternoons).\n10\nTable of Contents\nTalent Development\nZebra is committed to creating an environment that fosters continuous learning. We believe that effective career development happens when employees and managers have open discussions regarding their development plans and how best to use Zebra’s resources to support their learning and career growth. These resources include the Zebra Education Network, an online learning platform available to all employees offering a wide variety of learning content that employees can connect to their individual development plans. We also offer annual training and certification programs, including mandatory compliance training. We also have structured mentorship programs for our employees.\nZebra’s Global Learning and Leadership Roadmap outlines our development programs and is supplemented through various functional and business unit offerings, focused on functional development needs. The Roadmap invites all employees to participate in their development at any stage of their career.  New employees complete our Foundations course where they learn about Zebra, our vision, purpose, culture, and available resources, all taught through hands-on experiences and interactive presentations. Employees who are new to leading people can complete our Leadership Essentials and our Inclusive Leadership courses, which are designed to foster their leadership and management skills.\nSenior Zebra leaders can also nominate employees for a series of leadership programs and experiences designed to advance the nominees’ development at critical stages of their careers. We connect these nominations to our annual talent review and succession planning process, which includes an assessment of our future leadership pipeline so that we can proactively develop our high potential employees for the future.\nEmployee Resource Groups (ERGs)\nZebra has ten employee-led ERGs, each of which is open to all employees. Over 25% of our employees are members of at least one ERG. We continue to expand membership across the business.\nCommunity Engagement and Philanthropy\nWe have established partnerships with local organizations to forge meaningful relationships within the communities where Zebra operates and have closely tied our outreach strategy with our work in these communities. \nOur employees actively participate in volunteering activities and are supported through our Zebra Gives programs. Through Zebra’s community partnerships, our employees leverage their talents and experience to make a positive impact on important community causes, including the advancement of STEM education. Through our partnerships to advance STEM, we sponsor educational events, mentor teams and individuals, and pilot programs to widen Zebra’s future talent pipeline. Our philanthropy efforts focus on healthcare and disaster relief where we maintain relationships with key strategic partners.\nRegulatory Matters\nWireless Regulatory Matters\nOur business is subject to certain wireless regulatory matters. The use of wireless voice, data, and video communications systems requires radio spectrum, which is regulated by government agencies throughout the world. In the U.S., the Federal Communications Commission (“FCC”) and the National Telecommunications and Information Administration (“NTIA”) regulate spectrum use by commercial entities and federal entities, respectively. Similarly, countries around the world have one or more regulatory bodies that define and implement the rules for use of the radio spectrum, pursuant to their respective national laws and international coordination under the International Telecommunications Union. We manufacture and market products to be used in spectrum bands already made available by regulatory bodies, these include voice and data infrastructure, mobile radios, and portable or hand-held devices. Consequently, our results of operations could be positively or negatively affected by the rules and regulations adopted from time-to-time by the FCC, NTIA, or regulatory agencies in other countries. Our products operate both on the licensed and unlicensed spectrum. The availability of additional radio spectrum may provide new business opportunities, and consequently, the loss of available radio spectrum may result in the loss of business opportunities. Regulatory changes in current spectrum bands may also provide opportunities or may require modifications to some products so they can continue to operate as expected. See",
    "item1a": "Item 1A of this report.",
    "item1b": "Item 1B.\nUnresolved Staff Comments\nNone.",
    "item1c": "Item 1C.     Cybersecurity\n \nZebra takes a comprehensive approach to managing cybersecurity risk, starting with the integration of cybersecurity risk into our overall enterprise risk management framework, among other significant risks to the Company.\nBoard Oversight\nOur \nBoard\n of Directors is responsible for oversight of risks to the Company and is assisted by the Audit Committee in the oversight of cybersecurity risks.\n \nManagement provides regular updates to the Board regarding the Company’s key cybersecurity activities. In connection with its oversight, the Audit Committee monitors the quality and effectiveness of the Company’s cybersecurity program, including security of its internal information technology systems and its products, services, and software solutions as well as our cybersecurity incident response plan and resources. Management provides quarterly updates to the Audit Committee about cybersecurity threat protection, detection, mitigation and remediation, including the overall status of the Company’s cybersecurity program, results of third-party assessments, and recent cybersecurity threats.   In addition, the Audit Committee reviews the Company’s cybersecurity investment methodology to determine whether cybersecurity maturity improvements and risk reductions are being made.\nManagement’s Role\nManagement is responsible for day-to-day cybersecurity risk management activities, including proactively identifying, assessing, prioritizing, managing and mitigating enterprise cybersecurity risks. Our \nChief Financial Officer (“CFO”)\n is the accountable leader in executive management for Zebra’s IT and cybersecurity programs.\nThe Chief Security Officer (“CSO”) is the senior-most security professional responsible for the implementation of the Company’s cybersecurity, product security, and corporate/physical security programs, and reports to the CFO.  The CSO also makes recommendations to the Company’s executive management regarding the Company’s cybersecurity risk mitigation priorities. The Company’s current CSO has served in that role for Zebra since 2018. He is a recognized leader in the field of cybersecurity with over 15 years of global executive cybersecurity experience.\n24\nTable of Contents\nThe Chief Information Officer (“CIO”) is a peer to the CSO, also reports to the CFO. The CIO and his team are responsible for executing cybersecurity risk mitigation plans.  Zebra’s current CIO was appointed to the role in 2022 and has nearly 20 years of experience in managing IT functions.\nThe Chief Information Security Officer (“CISO”) reports to the CSO and oversees the Company’s Security Operations Center (“SOC”).  The CISO establishes and oversees the execution of prioritized cybersecurity mitigation plans for the Company.  Zebra’s current CISO was appointed to the role in 2018 and has held multiple leadership roles overseeing IT functions since joining the Company in 2004, including driving efforts within the cybersecurity function.\nCybersecurity Risk Management\nThe underlying controls of our cybersecurity risk management program are based on recognized industry practices and standards for cybersecurity and information technology, including the National Institute of Standards and Technology Cybersecurity Framework. Our approach to cybersecurity risk management includes the following key elements:\n•\nDefense and On-going Monitoring – Our SOC is responsible for the on-going monitoring and analysis of cybersecurity threats to the Company. The SOC evaluates cybersecurity incidents according to the Company’s cyber incident response plan, appropriate cybersecurity incident playbook, and crisis communications cybersecurity incident plan. The Company also utilizes endpoint detection and response services as well as data forensic investigation services for additional capability and timely assistance with potential cybersecurity incidents. \n•\nTechnical Safeguards – The Company utilizes various tactics for cybersecurity threat protection. We periodically perform vulnerability assessments, remediate vulnerabilities, review logs and access, perform system maintenance, manage network perimeter protection, and implement and manage disaster recovery testing.\n \nFurther, Zebra relies on its information security management system supported by a comprehensive set of policies that directly align with ISO 27001 and are supported by System and Organization Controls 2 (SOC2) reports and external ISO 27001:2013 certification for certain parts of our business.   \n•\nEducation and Awareness – To foster employee awareness of cybersecurity threats, we provide periodic educational sessions to our employees, including annual training on general cybersecurity concepts and targeted educational opportunities that include real-life simulation and “tabletop exercises.” We also regularly conduct privacy and security summits that involve training and information sessions conducted by employees and by third parties. \n•\nThird-Party Risk Management (“TPRM”) – Our TPRM function focuses on mitigating cybersecurity risk from specific third-party vendor categories. This function performs initial TPRM assessments as part of the vendor selection process and regularly reassesses vendors based on vendor type and risk factors.\nWhile we have experienced and expect to continue to experience cybersecurity threats and incidents, there have been no material incidents incurred to-date at the Company. However, there can be no guarantee that our policies and procedures will be followed in every instance or that those policies and procedures will always be effective. Cybersecurity threats could materially affect our business strategy, results of operations, or financial condition, as further discussed in the risk factors in Part I,"
  }
}