{
  "ticker": "ZTS",
  "cik": "0001555280",
  "company_name": "Zoetis Inc.",
  "filing_date": "2025-02-13",
  "accession": "0001555280-25-000102",
  "primary_doc": "zts-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business – Intellectual Property\n.\nManufacturing and supply\nIn order to sell our products, we must be able to produce and ship our products in sufficient quantities. Many of our products involve complex manufacturing processes and are sole-sourced from certain manufacturing sites. Minor deviations in our manufacturing or logistical processes, such as temperature excursions or improper package sealing, could result in delays, inventory shortages, unanticipated costs, product recalls, product liability and/or regulatory action. In addition, a number of factors could cause production interruptions that could result in launch delays, inventory shortages, recalls, unanticipated costs or issues with our supply agreements with third parties. \nOur manufacturing network may be unable to meet the demand for our products or we may have excess capacity if demand for our products changes. The unpredictability of a product's regulatory or commercial success or failure, the lead time necessary to construct highly technical and complex manufacturing sites, and shifting customer demand increase the potential for capacity imbalances.\nPerceptions of product quality, safety and reliability \nWe believe that animal health customers value high-quality manufacturing and reliability of supply. The importance of quality and safety concerns to pet owners, veterinarians and livestock producers also contributes to animal health brand loyalty, which often continues after the loss of patent-based and regulatory exclusivity. We depend on positive perceptions of the safety and quality of our products by our customers, veterinarians and end-users. \nIn addition, negative beliefs about animal health products generally could impact demand for our products. For example, the issue of the potential transfer of increased antibacterial resistance in bacteria from food-producing animals to human pathogens, and the causality of that transfer, continue to be the subject of global scientific and regulatory discussion. In some countries, this issue has led to government restrictions and bans on the use of specific antibacterials in some food-producing animals, regardless of the route of administration (in feed or injectable). In addition, consumer preferences in some markets have impacted the use of antibacterials in food producing animals. Such restrictions and consumer preferences in some cases may negatively impact sales of our antibacterial products, but in other instances may increase sales of our products that can be used as antibacterial alternatives. Our total revenue attributable to antibacterials for livestock was approximately $950 million for the year ended December 31, 2024. As a result of the divestiture of our medicated feed additive product portfolio, certain water soluble products and related assets, we anticipate our total revenues attributable to antibacterials for livestock will decrease.\nSimilarly, concerns regarding greenhouse gas emissions and other potential environmental impacts of livestock production have led to some consumers opting to limit or avoid consuming animal products. However, we believe the impact of this trend is limited as the livestock industry is still expected to continue to grow in order to feed a growing global population.\n32 |\nTable of Contents\nProduct development initiatives \nOur future success depends on both our existing products and our pipeline of new products, including new products that we may develop through joint ventures and products that we are able to obtain through license or acquisition. We believe we are an industry leader in animal health R&D, with a track record of generating new products a\nnd product lifecycle innovation, which is defined as R&D programs that leverage existing animal health products by adding new species or claims, achieving approvals in new markets or creating new reformulations, modifications and combinations. \nThe majority of our R&D programs focus on new products. In addition to traditional medicines and vaccines, we develop products across additional categories to address the needs of veterinarians and producers to predict, prevent, detect and treat conditions in both companion animals and livestock, including products and services in diagnostics, genetics, precision animal health and digital and data analytics.\nChanging distribution channels for companion animal products\nIn most markets, companion animal owners typically purchase their animal health products directly from veterinarians. However, in the U.S. and certain other markets, companion animal owners increasingly have the option to purchase animal health products from sources other than veterinarians, such as internet-based retailers, “big-box” retail stores or other over-the-counter distribution channels. We believe the ability of pet owners to purchase our products online and from retail stores may increase pet owner compliance and result in increased sales. However, over time, we may be unable to sustain our current margins due to the increased purchasing power of such retailers as compared to traditional veterinary practices.\nIn addition, this trend could negatively impact the sales of products we primarily sell through the veterinarian distribution channel, as any decrease in visits to veterinarians by companion animal owners could reduce our market share and sales of such products. A reduction in the number of pet owners who purchase our products directly from their veterinarian could also lead to increased use of generic alternatives to our products or the increased substitution of our products with other animal health products or human health products if such other products are deemed to be lower-cost alternatives.\nDisease Outbreaks\nSales of our livestock products have in the past, and may in the future be, adversely affected by the outbreak of disease carried by animals. Outbreaks of disease may reduce regional or global sales of particular animal-derived food products or result in reduced exports of such products, either due to heightened export restrictions or import prohibitions, which may reduce demand for our products. Also, the outbreak of any highly contagious disease near our main production sites could require us to immediately halt production of our products at such sites or force us to incur substantial expenses in procuring raw materials or products elsewhere. Alternatively, sales of products that treat specific disease outbreaks may increase.\nForeign exchange rates \nSignificant portions of our revenue and costs are exposed to changes in foreign exchange rates. Our products are sold in more than 100 countries and, as a result, our revenue is influenced by changes in foreign exchange rates. For the year ended December 31, 2024, approximately 41% of our revenue was denominated in foreign currencies. We seek to manage our foreign exchange risk, in part, through operational means, including managing same-currency revenue in relation to same-currency costs and same-currency assets in relation to same-currency liabilities. As we operate in multiple foreign currencies, including the Australian dollar, Brazilian real, British pound, Canadian dollar, Chinese renminbi, euro and other currencies, changes in those currencies relative to the U.S. dollar will impact our revenue, cost of goods and expenses, and consequently, net income. Exchange rate fluctuations may also have an impact beyond our reported financial results and directly impact operations. These fluctuations may affect the ability to buy and sell our goods and services between markets impacted by significant exchange rate variances. For the year ended December 31, 2024, approximately 59% of our total revenue was in U.S. dollars. Our year-over-year total revenue growth was unfavorably impacted by 3% from changes in foreign currency values relative to the U.S. dollar. \nWeather conditions, climate change and the availability of natural resources \nThe animal health industry and demand for many of our animal health products in a particular region are affected by weather conditions, as usage of our products follows varying weather patterns and weather-related pressures from pests, such as ticks. As a result, we may experience regional and seasonal fluctuations in our results of operations. \nIn addition, veterinary hospitals and practitioners depend on visits from and access to the animals under their care. Veterinarians’ patient volume and ability to operate could be adversely affected if they experience prolonged snow, ice or other severe weather conditions, particularly in regions not accustomed to sustained inclement weather. Furthermore, weather conditions, including excessive cold or heat, natural disasters and other events, could negatively impact our livestock customers by impairing the health or growth of their animals or the production or availability of feed, as well as disrupting their normal operations. For example, livestock producers depend on the availability of natural resources, including large supplies of fresh water. Their animals’ health and their ability to operate could be adversely affected if they experience a shortage of fresh water due to human population growth, climate change or floods, droughts or other weather conditions. In the event of adverse weather conditions, climate-change related impacts or a shortage of fresh water, veterinarians and livestock producers may purchase less of our products. \nAdverse weather conditions, natural disasters and climate change may also impact the aquaculture business. Changes in water temperatures could affect the timing of reproduction and growth of various fish species, as well as trigger the outbreak of certain waterborne diseases. \nOur strategic pillars \nOur vision is to be the most trusted and valued animal health company, shaping the future of animal care through our innovation, customer obsession and purpose-driven colleagues. We have a global presence in both developed and emerging markets and across eight core species. We intend to grow our business by pursuing the following core strategies:\n•\nLead through innovation across our diverse portfolio - \nWe seek to define the future of animal health by delivering new products and solutions as well as lifecycle innovations across the continuum of care that span from disease prediction and prevention to detection and treatment. We are focused on innovating across vaccines, pharmaceuticals, diagnostics, genetics, biodevices, and other product segments, and across all core species. Our internal R&D capabilities are differentiators, but we also collaborate across both academia and industry partners to ensure we are bringing the best possible innovations to our customers; \n33 |\nTable of Contents\n•\nDeliver an exceptional experience to delight our customers - \nWe believe that our customers' success is our success and that the best way to realize that success is by enabling veterinarians, livestock producers and pet owners to provide the best possible care for animals. We are focused on providing greater value to our customers through the integration and connectedness of our portfolio and by reducing frictions in the way they engage with us and our products and solutions;\n•\nPower our business through digital solutions and data insights - \nWe believe that digital and data are no longer just enablers, but are core decision drivers for the future of animal health. We are leaders in the translation of digital solutions and data insights to positive outcomes for our customers and for the animals they care for, whether for better identification of health care solutions in pets or improved production capabilities in livestock;\n•\nSupport a workplace where our colleagues can thrive \n- We view the strength of our leadership team and our talented colleagues around the world as a critical component of our past and future success. We believe that by focusing on colleague well-being and providing all of our colleagues with supportive tools, training and environment that we are best positioned to succeed. With that, our colleagues are committed to our purpose, our customers and each other. We are committed to maintaining an inclusive workplace culture that attracts, retains and develops the best talent in the industry; \n•\nAdvance sustainability in animal health for a better future - \nAs the world’s leading animal health company, our business purpose is well aligned with our social purpose. We strive to make a meaningful difference in society through the three pillars of our sustainability approach: (1) by improving access to care for animals and by supporting the veterinary profession; (2) by leveraging our innovation capabilities to develop solutions that improve productivity, keep animals healthy, and fight emerging infectious diseases; and (3) by taking actions to protect our planet that reduce our footprint on the environment; and\n•\nPerform with excellence and agility - \nWe recognize the increasing uncertainty in our industry and more broadly across the world. While we aim to improve our ability to predict, we more importantly aim to be proactive in how we effectively manage our resources and how quickly we can redeploy focus to emerging themes or priorities. We actively: (1) review and manage our resource allocation; (2) continuously improve key operational processes; and (3) ensure strategic focus on our core business.\nComponents of revenue and costs and expenses \nOur revenue, costs and expenses are reported for the year ended December 31 for each year presented, except for operations outside the U.S., for which the financial information is included in our consolidated financial statements for the fiscal year ended November 30 for each year presented. \nRevenue \nOur revenue is primarily derived from our diversified product portfolio of medicines, vaccines and diagnostic products and services used to treat and protect companion animals and livestock. Generally, our products are promoted to veterinarians and livestock producers by our sales organization which includes sales representatives and technical and veterinary operations specialists, and then sold directly by us or through distributors, retailers or e-commerce outlets. The depth of our product portfolio enables us to address the varying needs of customers in different species and geographies. In 2024, our two top-selling products and product lines, Simparica/Simparica Trio and Apoquel/Apoquel Chewable, contributed approximately 15% and 11% of our revenue, respectively, and combined with our next three top-selling products and product lines, Cytopoint, Librela and our ceftiofur line, these five products and product lines contributed approximately 41% of our revenue. Our ten top-selling products and product lines contributed 55% of our revenue. For additional information regarding our products, including descriptions of our product lines that each represented approximately 1% or more of our revenue in 2024, see \nItem 1. Business—Products\n.\nCosts and expenses \nCosts of sales\n consist primarily of cost of materials, facilities and other infrastructure used to manufacture our medicine and vaccine products, as well as costs to operate our reference labs and royalty expenses associated with the intellectual property of our products, when relevant. \nSelling, general and administrative (SG&A)\n expenses consist of, among other things, the internal and external costs of marketing, promotion, advertising and shipping and handling as well as certain costs related to business technology, facilities, legal, finance, human resources, business development, public affairs and procurement. \nResearch and development (R&D)\n expenses consist primarily of project costs specific to new product R&D and product lifecycle innovation, overhead costs associated with R&D operations and investments that support local market clinical trials for approved indications and expenses related to regulatory approvals for our products. We do not disaggregate R&D expenses by research stage or by therapeutic area for purposes of managing our business. \nAmortization of intangible assets\n consists primarily of the amortization expense for identifiable finite-lived intangible assets that have been acquired through business combinations. These assets consist of, but are not limited to, developed technology, brands and trademarks. \nRestructuring charges and certain acquisition and divestiture-related costs\n consist of all restructuring charges (those associated with cost reduction/productivity initiatives and those associated with acquisition activity) and costs associated with executing the transaction which include acquiring and integrating businesses and costs associated with divesting and disintegrating businesses. Restructuring charges are associated with employees, assets and activities that will not continue in the company. Acquisition and divestiture-related costs are associated with acquiring and integrating acquired businesses, which may include expenditures for consulting and the integration of systems and processes, product transfers, transaction costs and restructuring the company, as well as costs associated with divesting and disintegrating a portion of our business which may include expenditures for consulting and the disintegration of systems and processes, transfer costs, and restructuring charges which may include charges related to employees, assets and activities that will not continue in the company's ongoing operations. \nOther (income)/deductions—net\n consists of various items, primarily net (gains)/losses on business sales and divestitures, as well as asset disposals, interest income, royalty-related income, foreign exchange translation (gains)/losses and certain asset impairment charges. \n34 |\nTable of Contents\nSignificant accounting policies and application of critical accounting estimates\nIn presenting our financial statements in conformity with U.S. GAAP, we are required to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, costs and expenses and related disclosures. For a description of our significant accounting policies, see Notes to Consolidated Financial Statements—\nNote 3. Significant Accounting Policies\n. \nWe believe that the following accounting policies are critical to an understanding of our consolidated financial statements as they require the application of the most difficult, subjective and complex judgments and, therefore, could have the greatest impact on our financial statements: (i) fair value; (ii) revenue; (iii) asset impairment reviews; and (iv) contingencies. \nBelow are some of our more critical accounting estimates. See Notes to Consolidated Financial Statements—\nNote 3. Significant Accounting Policies: Estimates and Assumptions \nfor a discussion about the risks associated with estimates and assumptions. \nFair value \nFor a discussion about the application of fair value to our long-term debt and financial instruments, see Notes to Consolidated Financial Statements—\nNote 9. Financial Instruments\n.\nFor a discussion about the application of fair value to our business combinations, see Notes to Consolidated Financial Statements—\nNote 3. Significant Accounting Policies: Fair Value\n.\nFor a discussion about the application of fair value to our asset impairment reviews, see \nAsset impairment reviews \nbelow\n.\nRevenue \nOur gross product revenue is subject to deductions that are generally estimated and recorded in the same period that the revenue is recognized and primarily represents sales returns and revenue incentives. For example: \n•\nfor sales returns, we perform calculations in each market that incorporate the following, as appropriate: local returns policies and practices; past returns as a percentage of revenue; an understanding of the reasons for past returns; estimated shelf life by product; an estimate of the amount of time between shipment and return or lag time; and any other factors that could impact the estimate of future returns, product recalls, discontinuation of products or a changing competitive environment; and \n•\nfor revenue incentives, we use our historical experience with similar incentives programs to estimate the impact of such programs on revenue. \nIf any of our ratios, factors, assessments, experiences or judgments are not indicative or accurate predictors of our future experience, our results could be materially affected. Although the amounts recorded for these revenue deductions are dependent on estimates and assumptions, historically our adjustments to actual results have not been material. The sensitivity of our estimates can vary by program, type of customer and geographic location. \nAmounts recorded for revenue deductions can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For further information about the risks associated with estimates and assumptions, see Notes to Consolidated Financial Statements—\nNote 3. Significant Accounting Policies: Estimates and Assumptions\n. \nAsset impairment reviews \nWe review all of our long-lived assets for impairment indicators throughout the year and we perform detailed testing whenever impairment indicators are present. In addition, we perform impairment testing for goodwill and indefinite-lived intangible assets at least annually. When necessary, we record charges for impairments of long-lived assets for the amount by which the fair value is less than the carrying value of these assets. \nOur impairment review processes are described below and in Notes to Consolidated Financial Statements—\nNote 3. Significant Accounting Policies: Amortization of Intangible Assets, Depreciation and Certain Long-Lived Assets\n and, for deferred tax assets, in \nNote 3. Significant Accounting Policies: Deferred Tax Assets and Liabilities and Income Tax Contingencies\n. \nExamples of events or circumstances that may be indicative of impairment include: \n•\na significant adverse change in the extent or manner in which an asset is used. For example, restrictions imposed by the regulatory authorities could affect our ability to manufacture or sell a product; and\n•\na projection or forecast that demonstrates losses or reduced profits associated with an asset. This could result, for example, from the introduction of a competitor’s product that results in a significant loss of market share or the inability to achieve the previously projected revenue growth, or from the lack of acceptance of a product by customers. \nFor finite-lived identifiable intangible assets, such as developed technology rights, and for other long-lived assets, such as property, plant and equipment, whenever impairment indicators are present, we calculate the undiscounted value of the projected cash flows associated with the asset, or asset group, and compare this estimated amount to the carrying amount. If the carrying amount is found to be greater, we record an impairment loss for the excess of book value over fair value. In addition, in all cases of an impairment review, we re-evaluate the remaining useful lives of the assets and modify them, as appropriate. \nOur impairment reviews of most of our long-lived assets depend on the determination of fair value, as defined by U.S. GAAP, and these judgments can materially impact our results of operations. A single estimate of fair value can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see Notes to Consolidated Financial Statements—\nNote 3. Significant Accounting Policies: Estimates and Assumptions\n. \nIntangible assets other than goodwill\nWe test indefinite-lived intangible assets for impairment at least annually, or more frequently if impairment indicators exist, by first assessing qualitative factors to determine whether it is more likely than not that the fair value of the indefinite-lived intangible asset is less than its carrying amount. If we conclude it is more likely than not that the fair value is less than the carrying amount, a quantitative test that compares the fair value of \n35 |\nTable of Contents\nthe indefinite-lived intangible asset with its carrying value is performed. If the fair value is less than the carrying amount, an impairment loss is recognized. Impairments of identifiable intangible assets other than goodwill, are recorded in \nRestructuring charges and certain acquisition and divestiture-related costs \nand \nOther (income)/deductions—net\n, as applicable. We did not have any material intangible asset impairment charges for the years ended December 31, 2024, 2023 and 2022. \nWhen we are required to determine the fair value of intangible assets other than goodwill, we use an income approach, specifically the multi-period excess earnings method, also known as the discounted cash flow method. We start with a forecast of all the expected net cash flows associated with the asset, which includes the application of a terminal value for indefinite-lived assets, and then we apply an asset-specific discount rate to arrive at a net present value amount. Some of the more significant estimates and assumptions inherent in this approach include: the amount and timing of the projected net cash flows, which includes the expected impact of competitive, legal and/or regulatory forces on the projections, the impact of technological risk associated with IPR&D assets, as well as the selection of a long-term growth rate; the discount rate, which seeks to reflect the risks inherent in the projected cash flows; foreign currency fluctuations; and the effective tax rate, which seeks to incorporate the geographic diversity of the projected cash flows. \nWhile all identifiable intangible assets can be impacted by events and thus lead to impairment, in general, identifiable intangible assets that are at the highest risk of impairment include IPR&D assets ($136 million as of December 31, 2024). IPR&D assets are higher-risk assets given the uncertain nature of R&D activity.\nFor a description of our accounting policy, see Notes to Consolidated Financial Statements—\nNote 3. Significant Accounting Policies: Amortization of Intangible Assets, Depreciation and Certain Long-Lived Assets\n. \nGoodwill\nGoodwill represents the excess of the consideration transferred over the fair value of net assets of businesses purchased and is assigned to reporting units. We test goodwill for impairment on at least an annual basis, or more frequently if necessary, either by assessing qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount or by performing a periodic quantitative assessment. \nFactors considered in the qualitative assessment include general macroeconomic conditions, conditions specific to the industry and market, cost factors which could have a significant effect on earnings or cash flows, the overall financial performance of the reporting unit and whether there have been sustained declines in our share price. Additionally, we evaluate the extent to which the fair value exceeded the carrying value of the reporting unit at the date of the last quantitative assessment performed. \nWhen performing a quantitative assessment to test for goodwill impairment we utilize the income approach, which is forward-looking, and relies primarily on internal forecasts. Within the income approach, the method that we use is the discounted cash flow method. We start with a forecast of all the expected net cash flows associated with the reporting unit, which includes the application of a terminal value, and then apply a reporting unit-specific discount rate to arrive at a net present value. Some of the more significant estimates and assumptions inherent in this approach include: the amount and timing of the projected net cash flows, which includes the expected impact of technological risk and competitive, legal and/or regulatory forces on the projections, as well as the selection of a long-term growth rate; the discount rate, which seeks to reflect the various risks inherent in the projected cash flows; and the effective tax rate, which seeks to incorporate the geographic diversity of the projected cash flows. \nWe test goodwill for impairment on at least an annual basis, or more frequently if necessary, either by assessing qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount or by performing a periodic quantitative assessment. In 2024, we performed a periodic quantitative impairment assessment as of September 30, 2024, which did not result in the impairment of goodwill associated with any of our reporting units. In 2023, we performed a qualitative impairment assessment as of September 30, 2023, which did not result in the impairment of goodwill associated with any of our reporting units.\nFor all of our reporting units, there are a number of future events and factors that may impact future results and that could potentially have an impact on the outcome of subsequent goodwill impairment testing. For a list of these factors, see \nForward-looking statements and factors that may affect future results.\nFor a description of our accounting policy, see Notes to Consolidated Financial Statements—\nNote 3. Significant Accounting Policies: Amortization of Intangible Assets, Depreciation and Certain Long-Lived Assets\n. \nContingencies \nFor a discussion about income tax contingencies, see Notes to Consolidated Financial Statements—\nNote 8C. Tax Matters: Tax Contingencies\n.\nFor a discussion about legal contingencies, guarantees and indemnifications, see Notes to Consolidated Financial Statement—\nNote 18. Commitments and Contingencies\n.\nNon-GAAP financial measures\nWe report information in accordance with U.S. generally accepted accounting principles (GAAP). Management also measures performance using non-GAAP financial measures that may exclude certain amounts from the most directly comparable GAAP measure. Despite the importance of these measures to management in goal setting and performance measurement, non-GAAP financial measures have no standardized meaning prescribed by U.S. GAAP and, therefore, have limits in their usefulness to investors and may not be comparable to the calculation of similar measures of other companies. We present certain identified non-GAAP measures solely to provide investors with useful information to more fully understand how management assesses performance. \nOperational Growth\nWe believe that it is important to not only understand overall revenue and earnings growth, but also “operational growth.” Operational growth is a non-GAAP financial measure defined as revenue or earnings growth excluding the impact of foreign exchange. This measure provides information on the change in revenue and earnings as if foreign currency exchange rates had not changed between the current and prior periods to facilitate a \n36 |\nTable of Contents\nperiod-to-period comparison. We believe this non-GAAP measure provides a useful comparison to previous periods for the company and investors, but should not be viewed as a substitute for U.S. GAAP reported growth. \nAdjusted Net Income and Adjusted Earnings Per Share\nAdjusted net income and the corresponding adjusted earnings per share (EPS) are non-GAAP financial measures of performance used by management. We believe these financial measures are useful supplemental information to investors when considered together with our U.S. GAAP financial measures. We report adjusted net income to portray the results of our major operations, and the discovery, development, manufacture and commercialization of our products, prior to considering certain income statement elements. We define adjusted net income and adjusted EPS as net income attributable to Zoetis and EPS before the impact of purchase accounting adjustments, acquisition and divestiture-related costs and certain significant items. \nWe recognize that, as an internal measure of performance, the adjusted net income and adjusted EPS measures have limitations, and we do not restrict our performance management process solely to these metrics. A limitation of the adjusted net income and adjusted EPS measures is that they provide a view of our operations without including all events during a period, such as the effects of an acquisition or amortization of purchased intangibles, and do not provide a comparable view of our performance to other companies. The adjusted net income and adjusted EPS measures are not, and should not be viewed as, a substitute for U.S. GAAP reported net income attributable to Zoetis and reported EPS. See the \nAdjusted Net Income\n section below for more information.\nAnalysis of the Consolidated Statements of Income \nThe following discussion and analysis of our Consolidated Statements of Income should be read along with our consolidated financial statements, and the notes thereto. \nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nRevenue\n$\n9,256\n \n$\n8,544 \n$\n8,080 \n8\n \n6 \nCosts and expenses:\nCost of sales\n(a)\n2,719\n \n2,561 \n2,454 \n6\n \n4 \n% of revenue\n29.4\n \n%\n30.0 \n%\n30.4 \n%\nSelling, general and administrative expenses\n(a)\n2,318\n \n2,151 \n2,009 \n8\n \n7 \n% of revenue\n25\n \n%\n25 \n%\n25 \n%\nResearch and development expenses\n(a)\n686\n \n614 \n539 \n12\n \n14 \n% of revenue\n7\n \n%\n7 \n%\n7 \n%\nAmortization of intangible assets\n(a)\n141\n \n149 \n150 \n(5)\n(1)\nRestructuring charges and certain acquisition and divestiture-related costs\n53\n \n53 \n11 \n—\n \n*\nInterest expense, net of capitalized interest\n225\n \n239 \n221 \n(6)\n8 \nOther (income)/deductions—net\n(19)\n(159)\n40 \n(88)\n*\nIncome before provision for taxes on income\n3,133\n \n2,936 \n2,656 \n7\n \n11 \n% of revenue\n34\n \n%\n34 \n%\n33 \n%\nProvision for taxes on income\n637\n \n596 \n545 \n7\n \n9 \nEffective tax rate\n20.3\n \n%\n20.3 \n%\n20.5 \n%\nNet income before allocation to noncontrolling interests\n2,496\n \n2,340 \n2,111 \n7\n \n11 \nLess: Net gain/(loss) attributable to noncontrolling interests\n10\n \n(4)\n(3)\n*\n33 \nNet income attributable to Zoetis\n$\n2,486\n \n$\n2,344 \n$\n2,114 \n6\n \n11 \n% of revenue\n27\n \n%\n27 \n%\n26 \n%\n* Calculation not meaningful.\n(a)\n    Amortization expense related to finite-lived acquired intangible assets that contribute to our ability to sell, manufacture, research, market and distribute products, compounds and intellectual property is included in \nAmortization of intangible assets\n as these intangible assets benefit multiple business functions. Amortization expense related to finite-lived acquired intangible assets that are associated with a single function is included in \nCost of sales\n, \nSelling, general and administrative expenses\n or \nResearch and development expenses\n, as appropriate. \nRevenue\nTotal revenue by operating segment was as follows: \nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nU.S.\n$\n5,074\n \n$\n4,555 \n$\n4,313 \n11\n \n6 \nInternational\n4,102\n \n3,911 \n3,681 \n5\n \n6 \nTotal operating segments\n9,176\n \n8,466 \n7,994 \n8\n \n6 \nContract manufacturing & human health\n80\n \n78 \n86 \n3\n \n(9)\nTotal Revenue\n$\n9,256\n \n$\n8,544 \n$\n8,080 \n8\n \n6 \n37 |\nTable of Contents\nOn a global basis, the mix of revenue between companion animal and livestock products was as follows: \nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nCompanion animal\n$\n6,278\n \n$\n5,576 \n$\n5,203 \n13\n \n7 \nLivestock\n2,898\n \n2,890 \n2,791 \n—\n \n4 \nContract manufacturing & human health\n80\n \n78 \n86 \n3\n \n(9)\nTotal Revenue\n$\n9,256\n \n$\n8,544 \n$\n8,080 \n8\n \n6 \n2024 vs. 2023\nTotal revenue increased by $712 million, or 8%, in 2024 compared with 2023 reflecting operational revenue growth of $921 million, or 11%. Operational revenue growth was primarily due to the following:\n•\nprice growth of approximately 6%;\n•\nvolume growth from new products of approximately 3%; and\n•\nvolume growth from key dermatology products of approximately 2%.\nForeign exchange decreased our reported revenue growth by approximately 3%.\nCosts and Expenses \nCost of sales\nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nCost of sales\n$\n2,719\n \n$\n2,561 \n$\n2,454 \n6\n \n4 \n% of revenue\n29.4\n \n%\n30.0 \n%\n30.4 \n%\n2024 vs. 2023\nCost of sales as a percentage of revenue was 29.4% in 2024, compared with 30.0% in 2023. The decrease was primarily as a result of:\n•\nprice increases;\n•\nfavorable product mix;\n•\nlower inventory charges; and\n•\nlower freight costs,\npartially offset by:\n•\nunfavorable manufacturing and other costs; and\n•\nunfavorable foreign exchange.\nSelling, general and administrative expenses \nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nSelling, general and administrative expenses\n$\n2,318\n \n$\n2,151 \n$\n2,009 \n8\n \n7 \n% of revenue\n25\n \n%\n25 \n%\n25 \n%\n2024 vs. 2023\nSG&A expenses increased by $167 million, or 8%, in 2024 compared with 2023, primarily as a result of: \n•\nan increase in certain compensation-related costs;\n•\nhigher selling and distribution costs;\n•\nhigher advertising and promotion expenses;\n•\nhigher professional and consulting fees; and\n•\nhigher travel and entertainment expenses,\npartially offset by:\n•\nfavorable foreign exchange;\n•\nthe reduced impact of purchase accounting adjustments; and\n•\nlower other general and administrative expenses.\n38 |\nTable of Contents\nResearch and development expenses \nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nResearch and development expenses\n$\n686\n \n$\n614 \n$\n539 \n12\n \n14 \n% of revenue\n7\n \n%\n7 \n%\n7 \n%\n2024 vs. 2023\nR&D expenses increased by $72 million, or 12%, in 2024 compared with 2023, primarily as a result of: \n•\nan increase in certain compensation-related costs to support innovation and portfolio progression; \n•\nhigher spend in project investments; and\n•\nhigher depreciation expense.\nAmortization of intangible assets \nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nAmortization of intangible assets\n$\n141\n \n$\n149 \n$\n150 \n(5)\n(1)\n2024 vs. 2023\nAmortization of intangible assets decreased in 2024 compared with 2023 primarily due to asset impairments taken in 2024 and 2023, as well as assets that became fully amortized, partially offset by intangible assets placed in service in 2024 and 2023.\nRestructuring charges and certain acquisition and divestiture-related costs\nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nRestructuring charges and certain acquisition and divestiture-related costs\n$\n53\n \n$\n53 \n$\n11 \n—\n \n*\n* Calculation not meaningful.\n2024 vs. 2023\nRestructuring charges and certain acquisition and divestiture-related costs were $53 million in 2024 and 2023. Restructuring charges and certain acquisition and divestiture-related costs in 2024 primarily consisted of employee termination costs related to organizational structure refinements, as well as costs related to the sale of our medicated feed additive product portfolio, certain water soluble products and related assets, partially offset by a reversal of certain employee termination costs as a result of a change in strategy from our 2015 operational efficiency initiative. Restructuring charges and certain acquisition and divestiture-related costs in 2023 primarily consisted of employee termination and exit costs related to organizational structure refinements and other cost-reduction and productivity initiatives, as well as costs related to recent acquisitions. \nFor additional information regarding restructuring charges and acquisition and divestiture-related costs, see Notes to Consolidated Financial Statements— \nNote 6. Restructuring Charges and Other Costs Associated with Acquisitions and Divestitures\n.\nInterest expense, net of capitalized interest\nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nInterest expense, net of capitalized interest\n$\n225\n \n$\n239 \n$\n221 \n(6)\n8 \n2024 vs. 2023\nInterest expense, net of capitalized interest, decreased by $14 million, or 6%, in 2024 compared with 2023, primarily as a result of higher capitalized interest in the current period associated with capital projects to support our future growth and a higher debt balance during a portion of the prior year.\nOther (income)/deductions—net \nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nOther (income)/deductions—net\n$\n(19)\n$\n(159)\n$\n40 \n(88)\n*\n* Calculation not meaningful. \n2024 vs. 2023\nThe change in \nOther (income)/deductions—net\n is primarily as a result of a gain on the sale of a majority interest in our pet insurance business in the prior period, royalty-related income in the prior period that was predominantly associated with a settlement received from a third-party for underpayment of royalties related to prior periods and a loss on the sale of our medicated feed additive product portfolio, certain water soluble products and related assets in the current period, partially offset by lower asset impairment charges in the current period.\n39 |\nTable of Contents\nProvision for taxes on income \nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nProvision for taxes on income\n$\n637\n \n$\n596 \n$\n545 \n7\n \n9 \nEffective tax rate\n20.3\n \n%\n20.3 \n%\n20.5 \n%\nThe income tax provision in the Consolidated Statements of Income includes tax costs and benefits, such as uncertain tax positions, repatriation decisions and audit settlements, among others.\n2024 vs. 2023\nOur effective tax rate was 20.3% for 2024 and 2023. The effective tax rate for 2024, as compared to 2023, was primarily attributable to the favorable impact of a higher benefit in the U.S. related to foreign-derived intangible income and lower net discrete tax expenses, offset by a less favorable jurisdictional mix of earnings (which includes the impact of the location of earnings, repatriation costs and the Organisation for Economic Co-operation and Development (OECD) global minimum tax provision (Pillar Two)). Jurisdictional mix of earnings can vary depending on repatriation decisions, operating fluctuations in the normal course of business and the impact of non-deductible items and non-taxable items.\nPillar Two was effective beginning in 2024 and the impact of these provisions is included in our effective tax rate for 2024.\nOperating Segment Results\nThe mix of revenue between companion animal and livestock products was as follows:\n% Change\n24/23\n23/22\nRelated to\nRelated to\nYear Ended December 31,\nForeign Exchange\nForeign Exchange\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nTotal\nOperational\nTotal\nOperational\nU.S.\nCompanion animal\n$\n4,054\n \n$\n3,529 \n$\n3,341 \n15\n \n—\n \n15\n \n6 \n— \n6 \nLivestock\n1,020\n \n1,026 \n972 \n(1)\n—\n \n(1)\n6 \n— \n6 \n5,074\n \n4,555 \n4,313 \n11\n \n—\n \n11\n \n6 \n— \n6 \nInternational\nCompanion animal\n2,224\n \n2,047 \n1,862 \n9\n \n(4)\n13\n \n10 \n(2)\n12 \nLivestock\n1,878\n \n1,864 \n1,819 \n1\n \n(7)\n8\n \n2 \n(5)\n7 \n4,102\n \n3,911 \n3,681 \n5\n \n(5)\n10\n \n6 \n(3)\n9 \nTotal\nCompanion animal\n6,278\n \n5,576 \n5,203 \n13\n \n(1)\n14\n \n7 \n(1)\n8 \nLivestock\n2,898\n \n2,890 \n2,791 \n—\n \n(5)\n5\n \n4 \n(2)\n6 \nContract manufacturing & human health\n80\n \n78 \n86 \n3\n \n—\n \n3\n \n(9)\n1 \n(10)\n$\n9,256\n \n$\n8,544 \n$\n8,080 \n8\n \n(3)\n11\n \n6 \n(1)\n7 \n40 |\nTable of Contents\nEarnings by segment and the operational and foreign exchange changes versus the comparable prior year period were as follows:\n% Change\n24/23\n23/22\nRelated to\nRelated to\nYear Ended December 31,\nForeign Exchange\nForeign Exchange\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nTotal\nOperational\nTotal\nOperational\nU.S.\n$\n3,336\n \n$\n2,863 \n$\n2,763 \n17\n \n—\n \n17\n \n4 \n— \n4 \nInternational\n2,118\n \n2,037 \n1,990 \n4\n \n(7)\n11\n \n2 \n(2)\n4 \nTotal reportable segments\n5,454\n \n4,900 \n4,753 \n11\n \n(3)\n14\n \n3 \n(1)\n4 \nOther business activities\n(562)\n(496)\n(424)\n13\n \n17 \nReconciling Items:\nCorporate\n(1,213)\n(1,042)\n(1,073)\n16\n \n(3)\nPurchase accounting adjustments\n(140)\n(159)\n(160)\n(12)\n(1)\nAcquisition and divestiture-related costs\n(18)\n(9)\n(5)\n*\n80 \nCertain significant items\n(79)\n33 \n(56)\n*\n*\nOther unallocated\n(309)\n(291)\n(379)\n6\n \n(23)\nIncome before income taxes\n$\n3,133\n \n$\n2,936 \n$\n2,656 \n7\n \n11 \n* Calculation not meaningful. \n2024 vs. 2023\nU.S. operating segment\nU.S. segment revenue increased by $519 million, or 11%, in 2024 compared with 2023, of which $525 million resulted from growth in companion animal products and $6 million decline in livestock products. \n•\nCompanion animal revenue growth was primarily due to growth in sales of Simparica Trio, our mAb products for OA pain, Librela and Solensia, and key dermatology products, partially offset by lower sales of our small animal vaccines.\n•\nLivestock revenue declined due to the impact of the divestiture of our medicated feed additive product portfolio, certain water soluble products and related as\nsets, partially offset by higher sales of \ncattle products, driven by timing of supply and strong demand for our ceftiofur product line.\nU.S. segment earnings increased by $473 million, or 17%, in 2024 compared with 2023, primarily due to higher revenue, partially offset by higher cost of sales and operating expenses. \nInternational operating segment\nInternational segment revenue increased by $191 million, or 5%, in 2024 compared with 2023. Operational revenue growth was $401 million, or 10%, reflecting growth of $257 million in companion animal products and $144 million in livestock products. \n•\nCompanion animal operational revenue growth was driven primarily by the growth in sales of our key dermatology products, mAb products for OA pain, Librela and Solensia, small animal parasiticides and vaccine products.\n•\nLivestock operational revenue growth was due to increased sales of cattle, poultry and fish products, partially offset by a decline in sales of sheep products. Sales of cattle products grew due to price, partially offset by volume declines as compared to the prior year period due to prior year supply recoveries. Sales of products in our poultry portfolio grew due to price and demand generation efforts in key poultry markets. Sales of our fish portfolio grew due to increased vaccine sales in Norway, partially offset by lower sales of parasiticides in Chile. Sales of sheep products declined primarily due to supply constraints in Australia compounded by poor market conditions.\n•\nAdditionally, International segment revenue was unfavorably impacted by foreign exchange which decreased revenue by approximately $210 million, or 5%, primarily driven by fluctuations in the Argentinian peso, Brazilian real, Turkish lira, Japanese yen and Egyptian pound.\nInternational segment earnings increased by $81 million, or 4%, in 2024 compared with 2023. Operational earnings growth was $230 million, or 11%, primarily due to higher revenue, partially offset by higher cost of sales and operating expenses.\nOther business activities\nOther business activities includes our Client Supply Services contract manufacturing results, our human health business and expenses associated with our dedicated veterinary medicine research and development organization, research alliances, U.S. regulatory affairs and other operations focused on the development of our products. Other R&D-related costs associated with non-U.S. market and regulatory activities are generally included in the International segment. \n2024 vs. 2023\nOther business activities net loss increased by $66 million, or 13%, in 2024 compared with 2023, reflecting an increase in R&D costs due to an increase in higher project investments, certain compensation-related costs to support innovation, acquisitions and other operating costs.\nReconciling items\nReconciling items include certain costs that are not allocated to our operating segments results, such as costs associated with the following:\n•\nCorporate, \nwhich includes certain costs associated with information technology, facilities, legal, finance, human resources, business development, certain diagnostics costs and communications, among others. These costs also include certain compensation costs, certain procurement costs, and other miscellaneous operating expenses that are not charged to our operating segments, as well as interest income and expense; \n41 |\nTable of Contents\n•\nCertain transactions and events such as \nPurchase accounting adjustments\n, \nAcquisition and divestiture-related activities \nand \nCertain significant items\n, which are defined below; and\n•\nOther unallocated\n, which includes (i) certain overhead expenses associated with our global manufacturing operations not charged to our operating segments; (ii) certain costs associated with finance that specifically support our global manufacturing operations; (iii) certain supply chain and global logistics costs; and (iv) certain procurement costs.\n2024 vs. 2023\nCorporate expenses increased by $171 million, or 16%, in 2024 compared with 2023, primarily due to higher compensation-related costs, a settlement received from a third-party for underpayment of royalties in the prior year period, investments in information technology and unfavorable foreign exchange.\nOther unallocated expenses increased by $18 million, or 6%, in 2024 compared with 2023, primarily due to higher manufacturing costs and unfavorable foreign exchange, partially offset by lower freight charges and lower inventory obsolescence.\nSee Notes to Consolidated Financial Statements— \nNote 19. Segment Information\n for further information.\nAdjusted net income \nGeneral description of adjusted net income (a non-GAAP financial measure) \nAdjusted net income is an alternative view of performance used by management, and we believe that investors’ understanding of our performance is enhanced by disclosing this performance measure. The adjusted net income measure is an important internal measurement for us. Additionally, we measure our overall performance on this basis in conjunction with other performance metrics. The following are examples of how the adjusted net income measure is utilized: \n•\nsenior management receives a monthly analysis of our operating results that is prepared on an adjusted net income basis; \n•\nour annual budgets are prepared on an adjusted net income basis; and \n•\nother goal setting and performance measurements.\nPurchase accounting adjustments\n \nAdjusted net income is calculated prior to considering certain significant purchase accounting impacts that result from business combinations and net asset acquisitions. These impacts, primarily associated with certain acquisitions, include amortization related to the increase in fair value of the acquired finite-lived intangible assets and depreciation related to the increase/decrease to fair value of the acquired fixed assets. Therefore, the adjusted net income measure includes the revenue earned upon the sale of the acquired products without considering the aforementioned significant charges. \nWhile certain purchase accounting adjustments can occur through 20 or more years, this presentation provides an alternative view of our performance that is used by management to internally assess business performance. We believe the elimination of amortization attributable to acquired intangible assets provides management and investors an alternative view of our business results by providing a degree of parity to internally developed intangible assets for which R&D costs previously have been expensed. \nA completely accurate comparison of internally developed intangible assets and acquired intangible assets cannot be achieved through adjusted net income. These components of adjusted net income are derived solely from the impact of the items listed above. We have not factored in the impact of any other differences in experience that might have occurred if we had discovered and developed those intangible assets on our own, and this approach does not intend to be representative of the results that would have occurred in those circumstances. For example, our R&D costs in total, and in the periods presented, may have been different; our speed to commercialization and resulting revenue, if any, may have been different; or our costs to manufacture may have been different. In addition, our marketing efforts may have been received differently by our customers. As such, in total, there can be no assurance that our adjusted net income amounts would have been the same as presented had we discovered and developed the acquired intangible assets. \nAcquisition and divestiture-related costs\n \nAdjusted net income is calculated prior to considering transaction, integration and disintegration costs associated with significant business combinations, net asset acquisitions and divestitures. These incremental costs are excluded as they are incurred to acquire and integrate, or dispose and disintegrate, certain businesses as a result of the acquisition or disposal decision and are unique to each transaction. We have made no adjustments for the resulting synergies from these transactions. \nWe believe that viewing income prior to considering these charges provides investors with a useful additional perspective because the significant costs incurred in a business combination, net asset acquisition or divestiture result primarily from the need to eliminate duplicate assets, activities or employees––a natural result of acquiring or disposing of a fully integrated set of activities. For this reason, we believe that the costs incurred to convert disparate systems, to close duplicative facilities or to eliminate duplicate positions (for example, in the context of a business combination) can be viewed differently from those costs incurred in the ordinary course of business. \nThe integration and disintegration costs associated with a business combination, asset acquisition or divestiture may occur over several years, with the more significant impacts generally ending within three years of the transaction. Because of the need for certain external approvals for some actions, the span of time needed to achieve certain restructuring and integration or disintegration activities can be lengthy. For example, due to the regulated nature of the animal health medicines, vaccines and diagnostic business, the closure of excess facilities can take several years, as all manufacturing changes are subject to extensive validation and testing and must be approved by the U.S. Food and Drug Administration and/or other regulatory authorities. \n42 |\nTable of Contents\nCertain significant items\n \nAdjusted net income is calculated excluding certain significant items. Certain significant items represent substantive, unusual items that are evaluated on an individual basis. Such evaluation considers both the quantitative and the qualitative aspect of their unusual nature. Unusual, in this context, may represent items that are not part of our ongoing business; items that, either as a result of their nature or size, we would not expect to occur as part of our normal business on a regular basis; items that would be nonrecurring; or items that relate to products that we no longer sell. While not all-inclusive, examples of items that could be included as certain significant items would be costs related to a major non-acquisition or divestiture-related restructuring charge and associated implementation costs for a program that is specific in nature with a defined term, such as those related to our non-acquisition or divestiture-related cost-reduction and productivity initiatives; amounts related to disposals of products or facilities that do not qualify as discontinued operations as defined by U.S. GAAP; certain asset impairment charges; adjustments related to the resolution of certain tax positions; significant currency devaluation; the impact of adopting certain significant, event-driven tax legislation; or charges related to legal matters. See Notes to Consolidated Financial Statements— \nNote 18. Commitments and Contingencies\n. Our normal, ongoing defense costs or settlements of and accruals on legal matters made in the normal course of our business would not be considered certain significant items. \nReconciliation \nA reconciliation of net income attributable to Zoetis, as reported under U.S. GAAP, to adjusted net income follows:  \nYear Ended December 31,\n% Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nGAAP reported net income attributable to Zoetis\n$\n2,486\n \n$\n2,344 \n$\n2,114 \n6\n \n11 \nPurchase accounting adjustments—net of tax\n109\n \n127 \n120 \n(14)\n6 \nAcquisition and divestiture-related costs—net of tax\n14\n \n7 \n4 \n*\n75 \nCertain significant items—net of tax\n84\n \n(21)\n59 \n*\n*\nNon-GAAP adjusted net income\n(a)\n$\n2,693\n \n$\n2,457 \n$\n2,297 \n10\n \n7 \n* Calculation not meaningful.\n(a)    \nThe effective tax rate on adjusted pretax income was 19.8%, 20.1% and 20.3% in 2024, 2023 and 2022, respectively. \nThe lower effective tax rate for 2024, as compared to 2023, was primarily attributable to a higher benefit in the U.S. related to foreign-derived intangible income and lower net discrete tax expenses, partially offset by a less favorable jurisdictional mix of earnings (which includes the impact of the location of earnings, repatriation costs and Pillar Two global minimum tax). Jurisdictional mix of earnings can vary depending on repatriation decisions, operating fluctuations in the normal course of business and the impact of non-deductible and non-taxable items. \nThe lower effective tax rate for 2023, as compared to 2022, was primarily attributable to a higher benefit in the U.S. related to foreign-derived intangible income, a more favorable jurisdictional mix of earnings (which includes the impact of the location of earnings and repatriation costs), partially offset by a higher net discrete tax expense in 2023, mainly related to changes to prior years’ tax positions. Jurisdictional mix of earnings can vary depending on repatriation decisions, operating fluctuations in the normal course of business and the impact of non-deductible and non-taxable items. \nA reconciliation of reported diluted earnings per share (EPS), as reported under U.S. GAAP, to non-GAAP adjusted diluted EPS follows:\nYear Ended December 31,\n% Change\n2024\n2023\n2022\n24/23\n23/22\nEarnings per share—diluted\n(a)\n:\nGAAP reported EPS attributable to Zoetis—diluted\n$\n5.47\n \n$\n5.07 \n$\n4.49 \n8\n \n13 \nPurchase accounting adjustments—net of tax\n0.24\n \n0.28 \n0.26 \n(14)\n8 \nAcquisition and divestiture-related costs—net of tax\n0.03\n \n0.02 \n0.01 \n50\n \n*\nCertain significant items—net of tax\n0.18\n \n(0.05)\n0.12 \n*\n*\nNon-GAAP adjusted EPS—diluted\n$\n5.92\n \n$\n5.32 \n$\n4.88 \n11\n \n9 \n* Calculation not meaningful. \n(a)\n    Diluted earnings per share was computed using the weighted-average common shares outstanding during the period plus the common stock equivalents related to stock options, restricted stock units, performance-vesting restricted stock units and deferred stock units.\nAdjusted net income includes the following for each of the periods presented: \nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nInterest expense, net of capitalized interest\n$\n225\n \n$\n239 \n$\n221 \nInterest income\n(106)\n(103)\n(50)\nIncome taxes\n667\n \n618 \n583 \nDepreciation\n323\n \n302 \n266 \nAmortization\n34\n \n36 \n40 \n43 |\nTable of Contents\nAdjusted net income, as shown above, excludes the following items: \nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nPurchase accounting adjustments:\nAmortization and depreciation\n$\n140\n \n$\n153 \n$\n160 \nCost of sales\n—\n \n6 \n— \nTotal purchase accounting adjustments—pre-tax\n140\n \n159 \n160 \nIncome taxes\n(a)\n31\n \n32 \n40 \nTotal purchase accounting adjustments—net of tax\n109\n \n127 \n120 \nAcquisition and divestiture-related costs:\nAcquisition-related costs\n1\n \n7 \n5 \nDivestiture-related costs\n(b)\n16\n \n— \n— \nRestructuring costs\n1\n \n2 \n— \nTotal acquisition and divestiture-related costs—pre-tax\n18\n \n9 \n5 \nIncome taxes\n(a)\n4\n \n2 \n1 \nTotal acquisition and divestiture-related costs—net of tax\n14\n \n7 \n4 \nCertain significant items:\nOther restructuring charges and cost-reduction/productivity initiatives\n(c)\n35\n \n44 \n8 \nCertain asset impairment charges\n(d)\n11\n \n24 \n47 \nNet loss/(gain) on sale of businesses\n(e)\n25\n \n(101)\n— \nOther\n8\n \n— \n1 \nTotal certain significant items—pre-tax\n79\n \n(33)\n56 \nIncome taxes\n(a)\n(5)\n(12)\n(3)\nTotal certain significant items—net of tax\n84\n \n(21)\n59 \nTotal purchase accounting adjustments, acquisition and divestiture-related costs, and certain significant items—net of tax\n$\n207\n \n$\n113 \n$\n183 \n(a)    \nIncome taxes include the tax effect of the associated pre-tax amounts, calculated by determining the jurisdictional location of the pre-tax amounts and applying that jurisdiction's applicable tax rate.\n    Income taxes in \nPurchase accounting adjustments\n also includes:\n•\nFor 2022, tax benefits related to a deferred adjustment as a result of a change in tax basis.\n      Income taxes in \nCertain significant items \nalso includes:\n•\nFor 2024, a tax expense related to the divestiture of the medicated feed additive product portfolio, certain water soluble products and related assets.\n•\nFor 2023, a benefit from the tax loss on the divestiture of Performance Livestock Analytics, partially offset by a tax expense related to changes to prior years’ tax positions with regard to the one-time mandatory deemed repatriation tax under the Tax Cuts and Jobs Act.\n•\nFor 2022, a tax expense related to changes in valuation allowances related to impairments of certain assets and changes in uncertain tax positions.\n(b)    \nRepresents costs related to the sale of our medicated feed additive product portfolio, certain water soluble products and related assets.\n(c)    \nFor 2024, primarily consisted of employee termination costs related to organizational structure refinements, partially offset by a reversal of certain employee termination costs as a result of a change in strategy from our 2015 operational efficiency initiative.\nFor 2023, primarily represents employee termination and exit costs related to organizational structure refinements and other cost-reduction and productivity initiatives.\nFor 2022, primarily represents employee termination and exit costs associated with cost-reduction and productivity initiatives in certain international markets, as well as product transfer costs. \n(d)    \nFor 2024, represents certain asset impairment charges related to our aquaculture business.\nFor 2023, primarily represents certain asset impairment charges related to our precision animal health and diagnostics businesses.\nFor 2022, primarily represents asset impairment charges related to:\n•\nCustomer relationships, developed technology rights and property, plant and equipment in our diagnostics, poultry, cattle and swine businesses;\n \nand\n•\nInventory and other charges related to the consolidation of manufacturing sites in China.\n(e)    \n    For 2024, represents a net loss related to the sale of our medicated feed additive product portfolio, certain water soluble products and related assets.\n    \nFor 2023, primarily represents a net gain on the sale of a majority interest in our pet insurance business.\n44 |\nTable of Contents\nThe classification of the above items excluded from adjusted net income are as follows:\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nCost of sales:\nPurchase accounting adjustments\n$\n4\n \n$\n10 \n$\n6 \nInventory write-offs\n—\n \n2 \n4 \nOther\n1\n \n1 \n4 \n   Total Cost of sales\n5\n \n13 \n14 \nSelling, general & administrative expenses:\nPurchase accounting adjustments\n11\n \n21 \n29 \nOther\n6\n \n— \n— \n   Total Selling, general & administrative expenses\n17\n \n21 \n29 \nResearch & development expenses:\nPurchase accounting adjustments\n2\n \n1 \n1 \n   Total Research & development expenses\n2\n \n1 \n1 \nAmortization of intangible assets:\nPurchase accounting adjustments\n123\n \n127 \n124 \n   Total Amortization of intangible assets\n123\n \n127 \n124 \nRestructuring charges and certain acquisition and divestiture-related costs:\nAcquisition-related costs\n1\n \n7 \n5 \nDivestiture-related costs\n16\n \n— \n— \nEmployee termination costs\n36\n \n41 \n3 \nAsset impairments\n—\n \n1 \n2 \nExit costs\n—\n \n4 \n1 \n   Total Restructuring charges and certain acquisition and divestiture-related costs\n53\n \n53 \n11 \nOther (income)/deductions—net:\nAsset impairments\n11\n \n21 \n41 \nNet loss/(gain) on sale of businesses\n25\n \n(101)\n— \nOther\n1\n \n— \n1 \n   Total Other (income)/deductions—net\n37\n \n(80)\n42 \nProvision for taxes on income\n30\n \n22 \n38 \nTotal purchase accounting adjustments, acquisition and divestiture-related costs, and certain significant items—net of tax\n$\n207\n \n$\n113 \n$\n183 \n \nAnalysis of the Consolidated Statements of Comprehensive Income\nChanges in other comprehensive income for the periods presented are primarily related to foreign currency translation adjustments and unrealized gains/(losses) on derivative instruments. The foreign currency translation adjustment changes result from the strengthening or weakening of the U.S. dollar as compared to the currencies in the countries in which we do business. Unrealized gains/(losses) on the changes in the fair value of derivative instruments are recorded within \nAccumulated other comprehensive income/(loss)\n and reclassified into earnings depending on the nature and purpose of the financial instrument, as described in \nNote 9. Financial Instruments\n of the Notes to Consolidated Financial Statements. \nAnalysis of the Consolidated Balance Sheets\nDecember 31, 2024 vs. December 31, 2023\nFor a discussion about the changes in \nCash and cash equivalents\n, \nShort-term borrowings,\n \nCurrent portion of long-term debt\n and \nLong-term debt, net of discount and issuance costs\n, see “Analysis of financial condition, liquidity and capital resources” below.\nInventories \ndecreased primarily due to the divestiture of our medicated feed additive product portfolio, certain water soluble products and related assets, as well as higher sales than anticipated for certain products, partially offset by the build-up of certain products for increased demand. See Notes to Consolidated Financial Statements - \nNote 11. Inventories.\nOther current assets \ndecreased primarily due to lower value-added tax receivables for our international markets and the deferral of a prepaid tax benefit in connection with a prepayment from a related foreign entity in Belgium, partially offset by the mark-to-market adjustment of derivative instruments and the jurisdictional netting of income taxes receivable and income taxes payable.\n45 |\nTable of Contents\nProperty, plant and equipment less accumulated depreciation \nincreased primarily as a result of capital spending, partially offset by depreciation expense, as well as the divestiture of our medicated feed additive product portfolio, certain water soluble products and related assets. See Notes to Consolidated Financial Statements - \nNote 12. Property, Plant and Equipment.\nIdentifiable intangible assets, less accumulated amortization \ndecreased primarily as a result of amortization expense, the divestiture of our medicated feed additive product portfolio, certain water soluble products and related assets, as well as certain asset impairment charges.\nThe net changes in\n Noncurrent deferred tax assets, Noncurrent deferred tax liabilities, Income taxes payable \nand\n Other taxes payable \nprimarily reflect adjustments to the accrual for the income tax provision, the timing of income tax payments and the tax impact of various acquisitions and divestitures.\nOther noncurrent assets \nincreased primarily due to capitalized cloud computing arrangements implementation costs. \nAccounts payable \nincreased as a result of the timing of vendor and value-added tax payments.\nDividends payable\n increased as a result of an increase in the dividend rate for the first quarter 2025 dividend, which was declared on December 12, 2024.\nAccrued expenses \nincreased primarily as a result of accrued contract rebates and the timing of payments for other accrued expenses.\nAccrued compensation and related items\n increased primarily due to the accrual of 2024 annual incentive bonuses, sales incentive bonuses and savings plan contributions to eligible employees, partially offset by the payments of 2023 annual incentive bonuses and sales incentive bonuses, as well as savings plan contributions to eligible employees.\nOther current liabilities \nincreased primarily due to collateral received related to derivative contracts, partially offset by the mark-to-market adjustment of derivative instruments. \nThe decrease in \nOperating lease liabilities \nreflects lease amortization and payments, partially offset by assets acquired through new lease obligations. See Notes to Consolidated Financial Statements—\nNote 10. Leases\n.\nOther noncurrent liabilities \ndecreased primarily due to the reversal of certain employee termination costs as a result of a change in strategy from our 2015 operational efficiency initiative and the divestiture of our medicated feed additive product portfolio, certain water soluble products and related assets. \nFor an analysis of the changes in \nTotal Equity\n, see the Consolidated Statements of Equity and Notes to Consolidated Financial Statements— \nNote 16. Stockholders' Equity\n.\nAnalysis of the Consolidated Statements of Cash Flows\nYear Ended December 31,\n$ Change\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n24/23\n23/22\nNet cash provided by (used in):\nOperating activities\n$\n2,953\n \n$\n2,353 \n$\n1,912 \n$\n600\n \n$\n441 \nInvesting activities\n(315)\n(777)\n(883)\n462\n \n106 \nFinancing activities\n(2,660)\n(3,109)\n(904)\n449\n \n(2,205)\nEffect of exchange-rate changes on cash and cash equivalents\n(32)\n(7)\n(29)\n(25)\n22 \nNet (decrease)/increase in cash and cash equivalents\n$\n(54)\n$\n(1,540)\n$\n96 \n$\n1,486\n \n$\n(1,636)\nOperating activities\n2024 vs. 2023\nNet cash provided by operating activities was $2,953 million in 2024 compared with $2,353 million in 2023. The increase in operating cash flows was primarily attributable to higher inventory build-up of certain products in the prior period for increased demand and to mitigate potential supply constraints and the timing of receipts and payments in the ordinary course of business, as well as higher net income adjusted by non-cash items.\nInvesting activities\n2024 vs. 2023\nNet cash used in investing activities was $315 million in 2024 compared with $777 million in 2023. The net cash used in investing activities for 2024 was primarily due to capital expenditures, partially offset by net proceeds on the sale of our medicated feed additive product portfolio, certain water soluble products and related assets, as well as net proceeds from derivative instrument activity. The net cash used in investing activities for 2023 was primarily due to capital expenditures and acquisitions, partially offset by net proceeds on the sale of a majority interest in our pet insurance business and net proceeds from derivative instrument activity.\nFinancing activities\n2024 vs. 2023\nNet cash used in financing activities was $2,660 million in 2024 compared with $3,109 million in 2023. The net cash used in financing activities for 2024 was primarily attributable to the purchase of treasury shares and related payment of excise taxes, the payment of dividends and taxes paid on withholding shares, partially offset by proceeds in connection with the issuance of common stock under our equity incentive plan. The net cash used in financing activities for 2023 was primarily attributable to the repayment of the $1.35 billion aggregate principal amount of our 2013 senior notes due 2023 in February 2023, the purchase of treasury shares, the payment of dividends and taxes paid on withholding shares, partially offset by proceeds in connection with the issuance of common stock under our equity incentive plan.\n46 |\nTable of Contents\nAnalysis of financial condition, liquidity and capital resources \nWhile we believe our cash and cash equivalents on hand, our operating cash flows and our existing financing arrangements will be sufficient to support our cash needs for the next twelve months and beyond, this may be subject to the environment in which we operate. Risks to our meeting future funding requirements are described in \nGlobal economic conditions\n below. \nSelected measures of liquidity and capital resources  \nCertain relevant measures of our liquidity and capital resources follow: \nDecember 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\nCash and cash equivalents\n$\n1,987 \n$\n2,041 \nAccounts receivable, net\n(a)\n1,316 \n1,304 \nShort-term borrowings\n— \n3 \nCurrent portion of long-term debt\n1,350 \n— \nLong-term debt\n5,220 \n6,564 \nWorking capital\n2,574 \n4,454 \nRatio of current assets to current liabilities\n1.75:1\n3.36:1\n(a)\n    Accounts receivable are usually collected over a period of 45 to 75 days\n. \nFor the years ended December 31, 2024 and 2023, the number of days that accounts receivables were outstanding have remained within this range. We regularly monitor our accounts receivable for collectability, particularly in markets where economic conditions remain uncertain. We believe that our allowance for doubtful accounts is appropriate. Our assessment is based on such factors as past due aging, historical and expected collection patterns, the financial condition of our customers, the robust nature of our credit and collection practices and the economic environment. \nFor additional information about the sources and uses of our funds, see the \nAnalysis of the Consolidated Balance Sheets\n and \nAnalysis of the Consolidated Statements of Cash Flows \nsections of this MD&A. \nCredit facility and other lines of credit\nIn December 2022, we entered into an amended and restated revolving credit agreement with a syndicate of banks providing for a multi-year $1.0 billion senior unsecured revolving credit facility (the credit facility), which expires in December 2027. Subject to certain conditions, we have the right to increase the credit facility up to $1.5 billion. The credit facility contains a financial covenant requiring us to not exceed a maximum total leverage ratio (the ratio of consolidated net debt as of the end of the period to consolidated Earnings Before Interest, Income Taxes, Depreciation and Amortization (EBITDA) for such period) of 3.50:1. Upon entering into a material acquisition, the maximum total leverage ratio increases to 4.00:1, and extends until the fourth full consecutive fiscal quarter ended immediately following the consummation of a material acquisition. In addition, the credit facility contains other customary covenants.\nWe were in compliance with all financial covenants as of December 31, 2024 and December 31, 2023. There were no amounts drawn under the credit facility as of December 31, 2024 or December 31, 2023.\nWe have additional lines of credit and other credit arrangements with a group of banks and other financial intermediaries for general corporate purposes. We maintain cash and cash equivalent balances in excess of our outstanding short-term borrowings. As of December 31, 2024, we had access to $50 million of lines of credit which expire at various times and are generally renewed annually. There were no borrowings outstanding related to these facilities as of December 31, 2024 and $3 million of borrowings outstanding related to these facilities as of December 31, 2023. \nDomestic and international short-term funds\nMany of our operations are conducted outside the U.S. The amount of funds held in the U.S. will fluctuate due to the timing of receipts and payments in the ordinary course of business and due to other reasons, such as business development activities. As part of our ongoing liquidity assessments, we regularly monitor the mix of U.S. and international cash flows (both inflows and outflows). Actual repatriation of overseas funds can result in additional U.S. and local income taxes, such as U.S. state income taxes, local withholding taxes, and taxes on currency gains and losses. See Notes to Consolidated Financial Statements—\nNote 8. Tax Matters\n.\nGlobal economic conditions\nGlobal financial markets may be impacted by macroeconomic, business and financial volatility. Challenging economic conditions in recent years have not had, nor do we anticipate that it will have, a significant impact on our liquidity. Due to our operating cash flows, financial assets, access to capital markets and available lines of credit and revolving credit agreements, we continue to believe that we have the ability to meet our liquidity needs for the foreseeable future. As markets change, we continue to monitor our liquidity position. There can be no assurance that a challenging economic environment or an economic downturn will not impact our liquidity or our ability to obtain financing in the future.\n47 |\nTable of Contents\nContractual obligations\n \nIn the normal course of business, we enter into contracts and commitments that obligate us to make payments in the future. These obligations include long-term debt, including interest obligations, purchase obligations, lease commitments, other liabilities, benefit plan obligations and uncertain tax positions. See Notes to Consolidated Financial Statements—\nNote 9. Financial Instruments\n, \nNote 18. Commitments and Contingencies, Note 10. Leases\n, \nNote 6. Restructuring Charges and Other Costs Associated with Acquisitions and Divestitures, Note 14. Benefit Plans \nand \nNote 8. Tax Matters\n for further information on material cash requirements from known contractual and other obligations. \nDebt securities\nOn November 8, 2022, we issued $1.35 billion aggregate principal amount of our senior notes (2022 senior notes), with an original issue discount of $2 million. These notes are comprised of $600 million aggregate principal amount of 5.400% senior notes due 2025 and $750 million aggregate principal amount of 5.600% senior notes due 2032. On February 1, 2023, the net proceeds were used to redeem in full, upon maturity, the $1.35 billion aggregate principal amount of our 3.250% 2013 senior notes due 2023. \nOur senior notes are governed by an indenture and supplemental indentures (collectively, the indenture) between us and Deutsche Bank Trust Company Americas, as trustee. The indenture contains certain covenants, including limitations on our and certain of our subsidiaries' ability to incur liens or engage in sale lease-back transactions. The indenture also contains restrictions on our ability to consolidate, merge or sell substantially all of our assets. In addition, the indenture contains other customary terms, including certain events of default, upon the occurrence of which, the senior notes may be declared immediately due and payable.\nPursuant to the indenture, we are able to redeem the senior notes of any series, in whole or in part, at any time by paying a “make whole” premium, plus accrued and unpaid interest to, but excluding, the date of redemption. Upon the occurrence of a change of control of us and a downgrade of the senior notes below an investment grade rating by each of Moody's Investors Service, Inc. and Standard & Poor's Ratings Services, we are, in certain circumstances, required to make an offer to repurchase all of the outstanding senior notes at a price equal to 101% of the aggregate principal amount of the senior notes together with accrued and unpaid interest to, but excluding, the date of repurchase.\nOur outstanding debt securities are as follows:\nDescription\nPrincipal Amount\nInterest Rate\nTerms\n2015 Senior Notes due 2025\n$750 million\n4.500%\nInterest due semi annually, not subject to amortization, aggregate principal due on November 13, 2025\n2022 Senior Notes due 2025\n$600 million\n5.400%\nInterest due semi annually, not subject to amortization, aggregate principal due on November 14, 2025\n2017 Senior Notes due 2027\n$750 million\n3.000%\nInterest due semi annually, not subject to amortization, aggregate principal due on September 12, 2027\n2018 Senior Notes due 2028\n$500 million\n3.900%\nInterest due semi annually, not subject to amortization, aggregate principal due on August 20, 2028\n2020 Senior Notes due 2030\n$750 million\n2.000%\nInterest due semi annually, not subject to amortization, aggregate principal due on May 15, 2030\n2022 Senior Notes due 2032\n$750 million\n5.600%\nInterest due semi annually, not subject to amortization, aggregate principal due on November 16, 2032\n2013 Senior Notes due 2043\n$1,150 million\n4.700%\nInterest due semi annually, not subject to amortization, aggregate principal due on February 1, 2043\n2017 Senior Notes due 2047\n$500 million\n3.950%\nInterest due semi annually, not subject to amortization, aggregate principal due on September 12, 2047\n2018 Senior Notes due 2048\n$400 million\n4.450%\nInterest due semi annually, not subject to amortization, aggregate principal due on August 20, 2048\n2020 Senior Notes due 2050\n$500 million\n3.000%\nInterest due semi annually, not subject to amortization, aggregate principal due on May 15, 2050\nCredit ratings\nTwo major corporate debt-rating organizations, Moody's and S&P, assign ratings to our short-term and long-term debt. A security rating is not a recommendation to buy, sell or hold securities and the rating is subject to revision or withdrawal at any time by the rating organization. Each rating should be evaluated independently of any other rating.\nThe following table provides the current ratings assigned by these rating agencies to our commercial paper and senior unsecured non-credit-enhanced long-term debt:\nCommercial Paper\nLong-term Debt\nDate of Last Action\nName of Rating Agency\nRating\nRating\nOutlook\nMoody’s\nP-2\nA3\nStable\nJanuary 2025\nS&P\nA-2\nBBB\nStable\nDecember 2016\nPension obligations \nAs part of the separation from Pfizer, Pfizer transferred to us the net pension obligations associated with certain international defined benefit plans. We expect to contribute a total of $6 million to these plans in 2025. \nAs of December 31, 2024, the supplemental savings plan liability was $48 million.\nFor additional information, see Notes to Consolidated Financial Statements— \nNote 14. Benefit Plans.\nShare repurchase program \nIn December 2021, our Board of Directors authorized a $3.5 billion multi-year share repurchase program. This program was completed as of December 31, 2024. In August 2024, our Board of Directors authorized a new multi-year share repurchase program of up to $6 billion of our outstanding common stock. As of December 31, 2024, there was $5.6 billion remaining under this authorization. Purchases of Zoetis shares may be made at the discretion of management, depending on market conditions and business needs. Share repurchases may be executed through various \n48 |\nTable of Contents\nmeans, including open market or privately negotiated transactions. During 2024, 10.4 million shares were repurchased for $1.8 billion, which excludes a $17 million accrual for excise tax on net share repurchases.\nOff-balance sheet arrangements \nIn the ordinary course of business and in connection with the sale of assets and businesses, we may indemnify our counterparties against certain liabilities that may arise in connection with a transaction or that are related to activities prior to a transaction. These indemnifications typically pertain to environmental, tax, employee and/or product-related matters, and patent-infringement claims. If the indemnified party were to make a successful claim pursuant to the terms of the indemnification, we would be required to reimburse the loss. These indemnifications are generally subject to threshold amounts, specified claim periods and other restrictions and limitations. Historically, we have not paid significant amounts under these provisions and, as of December 31, 2024 and 2023, recorded amounts for the estimated fair value of these indemnifications are not material. \nNew accounting standards \nSee \nNote 3. Significant Accounting Policies\n in the Notes to Consolidated Financial Statements for discussion of recent accounting pronouncements, including the respective dates of adoption or expected adoption and effects or expected effects on our consolidated financial position, results of operations and cash flows.\n49 |\nTable of Contents\nForward-looking statements and factors that may affect future results\n \nThis report contains “forward-looking” statements. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. We generally identify forward-looking statements by using words such as “anticipate,” “estimate,” “could,” “expect,” “intend,” “project,” “plan,” “predict,” “believe,” “seek,” “continue,” “outlook,” “forecast,” “objective,” “target,” “may,” “might,” “will,” “should,” “can have,” “likely” or the negative version of these words or comparable words or by using future dates in connection with any discussion of future performance, actions or events.\nIn particular, forward-looking statements include statements relating to our future actions, business plans or prospects, prospective products, product approvals or products under development, product and supply chain disruptions, R&D costs, timing and likelihood of success, future operating or financial performance, future results of current and anticipated products and services, strategies, sales efforts, expenses, production efficiencies, production margins, anticipated timing of generic market entries, integration of acquired businesses, anticipated impact or timing of divestitures, interest rates, tax rates, tariffs, changes in tax regimes and laws, foreign exchange rates, growth in emerging markets, the outcome of contingencies, such as legal proceedings, plans related to share repurchases and dividends, government regulation, taxes and financial results. These statements are not guarantees of future performance, actions or events. Forward-looking statements are subject to risks and uncertainties, many of which are beyond our control, and are based on assumptions that could prove to be inaccurate. Among the factors that could cause actual results to differ materially from past results and future plans and projected future results are the following:\n•\nthe possible impact and timing of competing products, including generic alternatives, on our products and our ability to compete against such products;\n•\nunanticipated safety, quality or efficacy concerns or issues about our products;\n•\nthe economic, political, legal and business environment of the foreign jurisdictions in which we do business;\n•\nthe decline in global economic conditions, including the regional conflict in the Middle East, economic weakness in China and inflation;\n•\nconsolidation of our customers and distributors;\n•\nchanges in the distribution channel for companion animal products;\n•\nan outbreak of infectious disease carried by animals;\n•\ndisruptive innovations and advances in medical practices and technologies;\n•\nfailure to successfully acquire businesses, license rights or products, integrate businesses, form and manage alliances or divest businesses;\n•\nrestrictions and bans on the use of and consumer preferences regarding antibacterials in food-producing animals;\n•\nperceived adverse effects linked to the consumption of food derived from animals that utilize our products or animals generally;\n•\nincreased regulation or decreased governmental support relating to the raising, processing or consumption of food-producing animals;\n•\nmodification of foreign trade policy by the U.S. or other countries or the imposition of tariffs on imported or exported goods;\n•\nadverse weather conditions and the availability of natural resources;\n•\nthe impact of climate change on our activities and the activities of our customers and suppliers;\n•\nan inability to hire and retain executive officers and other key personnel;\n•\nproduct launch delays, inventory shortages, recalls or unanticipated costs caused by manufacturing problems and capacity imbalances;\n•\nfailure of our R&D, acquisition and licensing efforts to generate new products and product lifecycle innovations;\n•\ndifficulties or delays in the development or commercialization of new products;\n•\nillegal distribution and/or sale of our products or the misuse or off-label use of our products;\n•\nlegal factors, including product liability claims, antitrust litigation and governmental investigations, including tax disputes, environmental concerns, laws and regulations regarding data privacy, commercial disputes and patent disputes with branded and generic competitors, any of which could preclude commercialization of products or negatively affect the profitability of existing products;\n•\nfluctuations in foreign exchange rates and potential currency controls;\n•\na cyberattack, information security breach or other misappropriation of our data;\n•\ngovernmental laws and regulations affecting domestic and foreign operations, including without limitation, tax obligations and changes affecting the tax treatment by the U.S. of income earned outside the U.S. that may result from pending or possible future proposals;\n•\nfailure to protect our intellectual property rights or to operate our business without infringing the intellectual property rights of others;\n•\nfailure to generate sufficient cash to service our substantial indebtedness; and\n•\nthe other factors set forth under “Risk Factors” in",
    "item1a": "Item 1A of Part I of this 2024 Annual Report.\nHowever, there may also be other risks that we are unable to predict at this time. These risks or uncertainties may cause actual results to differ materially from those contemplated by a forward-looking statement. You should not put undue reliance on forward-looking statements. Forward-looking statements speak only as of the date on which they are made. We undertake no obligation to publicly update forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law or by the rules and regulations of the SEC. You are advised, however, to consult any further disclosures we make on related subjects in our Form 10-Q and 8-K reports and our other filings with the SEC. You should understand that it is not possible to predict or identify all such factors. Consequently, you should not consider the above to be a complete discussion of all potential risks or uncertainties.\n50 |\nTable of Contents\nItem 7A.    Quantitative and Qualitative Disclosures About Market Risk. \nA significant portion of our revenue and costs are exposed to changes in foreign exchange rates. In addition, our outstanding borrowings may be subject to risk from changes in interest rates and foreign exchange rates. The overall objective of our financial risk management program is to seek to manage the impact of foreign exchange rate movements and interest rate movements on our earnings. We manage these financial exposures through operational means and by using certain financial instruments. These practices may change as economic conditions change.\nForeign exchange risk\n \nOur primary net foreign currency translation exposures are the Australian dollar, Brazilian real, British pound, Canadian dollar, Chinese renminbi and euro. We seek to manage our foreign exchange risk, in part, through operational means, including managing same-currency revenue in relation to same-currency costs and same-currency assets in relation to same-currency liabilities. \nWe use foreign exchange derivative instruments designated as net investment hedges to hedge the foreign currency risks related to our investment in foreign subsidiaries. These foreign exchange derivative instruments serve to offset the foreign currency translation risk from certain of our foreign operations.\nOur foreign exchange derivative instruments at December 31, 2024 were analyzed to determine their sensitivity to foreign exchange rate changes. If the U.S. dollar were to strengthen or weaken against all other currencies by 10%, the amount recorded in cumulative translation adjustment (CTA) within \nAccumulated other comprehensive loss\n related to our net investment hedge would increase or decrease, respectively, by approximately $91 million. The change in value recorded to CTA would be expected to offset a corresponding foreign currency translation gain or loss from our investment in foreign subsidiaries. See Notes to Consolidated Financial Statements—\nNote 9. Financial Instruments\n: \nB.    Derivative Financial Instruments\n.\nForeign exchange risk is also managed through the use of foreign currency forward-exchange contracts. These contracts are used to offset the potential earnings effects from mostly intercompany short-term foreign currency assets and liabilities that arise from operations but are not designated as hedges. \nOur foreign currency forward-exchange contracts at December 31, 2024 were analyzed to determine their sensitivity to foreign exchange rate changes. If the U.S. dollar were to strengthen or weaken against all other currencies by 10%, the fair value of these contracts would decrease or increase, respectively, by $33 million. The foreign currency gains and losses on the assets and liabilities are recorded in \nOther (income)/deductions-net\n. See Notes to Consolidated Financial Statements—\nNote 9. Financial Instruments: B.    Derivative Financial Instruments\n.\nInterest rate risk\nOur outstanding debt balances are predominantly fixed rate debt. While changes in interest rates will have no impact on the interest we pay on our fixed rate debt, interest on our commercial paper and revolving credit facility will be exposed to interest rate fluctuations. Additionally, as of December 31, 2024, because we held certain interest rate swap agreements that have the economic effect of modifying the fixed-interest obligations associated with our 3.900% Senior Notes due 2028 and our 2.00% Senior Notes due 2030, a portion of the fixed-rate interest payable on these senior notes effectively became variable based on SOFR. At December 31, 2024, there were no commercial paper borrowings outstanding and no outstanding principal balance under our revolving credit facility. \nBy entering into the aforementioned swap arrangements, we have assumed risks associated with variable interest rates based upon SOFR. Changes in the overall level of interest rates affect the interest expense that we recognize in our Consolidated Statements of Income. An interest rate risk sensitivity analysis is used to measure interest rate risk by computing estimated changes in cash flows as a result of assumed changes in market interest rates. As of December 31, 2024, if SOFR-based interest rates would have been higher by 100 basis points, the change would have increased our interest expense annually by approximately $3 million, as it relates to our fixed to floating interest rate swap agreements. See Notes to Consolidated Financial Statements—\nNote 9. Financial Instruments\n. \nIn anticipation of issuing fixed-rate debt, we may use forward-starting interest rate swaps that are designated as cash flow hedges to hedge against changes in interest rates that could impact expected future issuances of debt. A 100-basis point increase or (decrease) in SOFR-based interest rates would have resulted in a increase or (decrease) in the fair value of our forward-starting interest rate swaps by $20 million and $(23) million, respectively at December 31, 2024.\nAt December 31, 2024, our cash equivalents were primarily invested in money market funds. Interest paid on such funds fluctuates with the prevailing interest rate.\n51 |\nTable of Contents\nItem 8. Financial Statements and Supplementary Data.\nINDEX TO FINANCIAL STATEMENTS\nPage\nAudited Consolidated Financial Statements of Zoetis Inc. and Subsidiaries:\nReports of Independent Registered Public Accounting Firm\n53\nConsolidated Statements of Income for the Years Ended December 31, 2024, 2023 and 2022 \n56\nConsolidated Statements of Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022\n57\nConsolidated Balance Sheets as of December 31, 2024 and 2023\n58\nConsolidated Statements of Equity for the Years Ended December 31, 2024, 2023 and 2022\n59\nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022\n60\nNotes to Consolidated Financial Statements\n61\nSchedule II—Valuation and Qualifying Accounts\n90\n52 |\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nZoetis Inc.: \nOpinion on the Consolidated\n \nFinancial Statements\nWe have audited the accompanying consolidated balance sheets of Zoetis Inc. and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes and financial statement Schedule II - Valuation and Qualifying Accounts (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the years in the three-year period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated February 13, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nEvaluation of gross unrecognized tax benefits\nAs discussed in Notes 3 and 8C in the consolidated financial statements, the Company’s tax positions are subject to examination by local taxing authorities in each respective tax jurisdiction, and the resolution of such examinations may span multiple years. Since tax law is complex and often subject to varied interpretations and judgments, it is uncertain whether some of the Company’s tax positions will be sustained upon examination. The Company accounts for income tax contingencies using a benefit recognition model. If a tax position is more likely than not (more than a 50% likelihood) to be sustained upon examination, based solely on the technical merits of the position, a benefit is recognized. As of December 31, 2024, the Company has recorded gross unrecognized tax benefits of $213 million.\nWe identified the evaluation of gross unrecognized tax benefits as a critical audit matter. Complex auditor judgment, including the involvement of tax professionals with specialized skills and knowledge was required to assess the valuation of a tax position, which included interpretation of relevant tax law, identification of relevant tax elements, the estimate of the more likely than not assessment of tax positions being sustained under examination and the estimate of the amount of the gross unrecognized tax benefit.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s unrecognized tax benefit process. This included controls related to (a) interpretation of relevant tax law, (b) evaluation of which of the Company’s tax positions may not be sustained upon examination, and (c) estimation of the gross unrecognized tax benefits. We involved tax professionals, with specialized skills and knowledge, who assisted in:\n•\nevaluating the Company’s interpretation of relevant tax laws and the potential impact on the unrecognized tax benefits by developing an independent assessment of the tax position’s more likely than not to be sustained under examination determination as well as the estimate of the amount of the gross unrecognized tax benefit, if any, based on our understanding and interpretation of tax laws,\n•\nreading and evaluating the tax opinion, and\n•\nassessing the Company’s transfer pricing policies for compliance with applicable laws and regulations.\n53 |\nTable of Contents\nDeductions from revenue related to the rebates accrual for the U.S. segment\nAs discussed in Note 3 to the consolidated financial statements, the Company records an accrual for estimated rebates as a deduction from revenue when the related revenue is recognized. Included in the rebates accrual are estimated revenue deductions for future payments to distributors, clinics, veterinarians and pet owners under various programs offered by the Company. The volume of varied rebate programs offered, each with varying terms and conditions covering how the rebate is measured and earned, requires the Company to estimate the accrual using a number of inputs from multiple sources. Accruals for deductions from revenue are recorded as either a reduction in accounts receivable or within accrued expenses, depending on the nature of the contract and method of expected payment. Amounts recorded as a reduction in accounts receivable as of December 31, 2024 are approximately $257 million and accruals for deductions from revenue included in accrued expenses are approximately $344 million. These amounts include rebate accruals for both the U.S. and international segments.\nWe identified assessing deductions from revenue related to the rebates accrual for the U.S. segment as a critical audit matter. Because of the variety of programs offered by the Company in the U.S., the size of the U.S. market, and the length of time between when a sale is made and when the related rebate is settled by the Company, challenging auditor judgment was required in assessing the estimate of the required rebates accrual. In particular, the identification of which revenue transactions were subject to a rebate and the relevance and reliability of information used to estimate an individual rebate programs’ accrual required challenging auditor judgment.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s rebate accrual process for the U.S. segment. This included controls related to the identification of revenue transactions subject to a rebate and the relevance and reliability of information used in the estimated rebates accrual. We identified and considered the relevance, reliability and sufficiency of sources of data used by the Company in developing the estimate. We tested the estimate of the rebates accrual for a sample of U.S. programs, using a combination of Company internal data, historical information, executed contracts, and third-party data and compared our estimate to the amount recorded by the Company. We evaluated the historical accuracy of the Company’s U.S. rebates accrual by comparing the previously recorded accrual as of December 31, 2023 to the actual amount that ultimately was paid by the Company during 2024.\n \n/s/ KPMG LLP \nWe have served as the Company’s auditor since 2011.\nShort Hills, New Jersey \nFebruary 13, 2025\n54 |\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors \nZoetis Inc.:\nOpinion on Internal Control Over Financial Reporting \nWe have audited Zoetis Inc. and subsidiaries’ (the Company) internal control over financial reporting as of December 31, 2024, based on criteria established in\n Internal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes and financial statement Schedule\n \nII - Valuation and Qualifying Accounts (collectively, the consolidated financial statements), and our report dated February 13, 2025 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion \nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting \nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nShort Hills, New Jersey\nFebruary 13, 2025\n55 |\nTable of Contents\nZOETIS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\nYear Ended December 31,\n(MILLIONS OF DOLLARS AND SHARES, EXCEPT PER SHARE DATA)\n2024\n2023\n2022\nRevenue\n$\n9,256\n \n$\n8,544\n \n$\n8,080\n \nCosts and expenses:\nCost of sales\n(a)\n2,719\n \n2,561\n \n2,454\n \nSelling, general and administrative expenses\n(a)\n2,318\n \n2,151\n \n2,009\n \nResearch and development expenses\n(a)\n686\n \n614\n \n539\n \nAmortization of intangible assets\n141\n \n149\n \n150\n \nRestructuring charges and certain acquisition and divestiture-related costs\n53\n \n53\n \n11\n \nInterest expense, net of capitalized interest\n225\n \n239\n \n221\n \nOther (income)/deductions––net\n(\n19\n)\n(\n159\n)\n40\n \nIncome before provision for taxes on income\n3,133\n \n2,936\n \n2,656\n \nProvision for taxes on income\n637\n \n596\n \n545\n \nNet income before allocation to noncontrolling interests\n2,496\n \n2,340\n \n2,111\n \nLess: Net income/(loss) attributable to noncontrolling interests\n10\n \n(\n4\n)\n(\n3\n)\nNet income attributable to Zoetis Inc.\n$\n2,486\n \n$\n2,344\n \n$\n2,114\n \nEarnings per share attributable to Zoetis Inc. stockholders:\n Basic\n$\n5.47\n \n$\n5.08\n \n$\n4.51\n \n Diluted\n$\n5.47\n \n$\n5.07\n \n$\n4.49\n \nWeighted-average common shares outstanding:\n Basic\n454.200\n \n461.172\n \n468.891\n \n Diluted\n454.848\n \n462.269\n \n470.385\n \nDividends declared per common share\n$\n1.796\n \n$\n1.557\n \n$\n1.350\n \n(a)    \nExclusive of amortization of intangible assets, except as disclosed in \nNote 3. Significant Accounting Policies—Amortization of Intangible Assets, Depreciation and Certain Long-Lived Assets. \n56 |\nTable of Contents\nZOETIS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME \nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nNet income before allocation to noncontrolling interests\n$\n2,496\n \n$\n2,340\n \n$\n2,111\n \nOther comprehensive loss, net of tax\n(a)\n:\nUnrealized gains/(losses) on derivatives for cash flow hedges, net of tax of $\n1\n, $(\n2\n) and $\n26\n for the years ended December 31, 2024, 2023 and 2022, respectively\n4\n \n(\n5\n)\n86\n \nUnrealized gains/(losses) on derivatives for net investment hedges, net of tax of $\n13\n, $(\n7\n) and $\n11\n for the years ended December 31, 2024, 2023 and 2022, respectively\n44\n \n(\n23\n)\n36\n \nForeign currency translation adjustments, net\n(\n147\n)\n—\n \n(\n188\n)\nBenefit plans: Actuarial (losses)/gains, net of tax of $\n—\n, $\n2\n and $\n6\n for the years ended December 31, 2024, 2023 and 2022, respectively\n(\n2\n)\n6\n \n13\n \nTotal other comprehensive loss, net of tax\n(\n101\n)\n(\n22\n)\n(\n53\n)\nComprehensive income before allocation to noncontrolling interests\n2,395\n \n2,318\n \n2,058\n \nLess: Comprehensive income/(loss) attributable to noncontrolling interests\n10\n \n(\n4\n)\n(\n3\n)\nComprehensive income attributable to Zoetis Inc.\n$\n2,385\n \n$\n2,322\n \n$\n2,061\n \n(a)\n    \nPresented net of reclassification adjustments, which are not material in any period presented. Reclassification adjustments related to benefit plans are generally reclassified, as part of net periodic pension cost, into Cost of sales, Selling, general and administrative expenses, and/or Research and development expenses, as appropriate, in the Consolidated Statements of Income.\n57 |\nTable of Contents\nZOETIS INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS \nDecember 31,\nDecember 31,\n(MILLIONS OF DOLLARS, EXCEPT PER SHARE DATA)\n2024\n2023\nAssets\nCash and cash equivalents\n(a)\n$\n1,987\n \n$\n2,041\n \nAccounts receivable, less allowance for doubtful accounts of $\n18\n in 2024 and 2023\n1,316\n \n1,304\n \nInventories\n2,306\n \n2,564\n \nOther current assets\n377\n \n434\n \nTotal current assets\n5,986\n \n6,343\n \nProperty, plant and equipment, less accumulated depreciation of $\n2,635\n in 2024 and $\n2,594\n in 2023\n3,391\n \n3,204\n \nOperating lease right-of-use assets\n219\n \n230\n \nGoodwill\n2,724\n \n2,759\n \nIdentifiable intangible assets, less accumulated amortization\n1,127\n \n1,338\n \nNoncurrent deferred tax assets\n540\n \n206\n \nOther noncurrent assets\n250\n \n206\n \nTotal assets\n$\n14,237\n \n$\n14,286\n \nLiabilities and Equity\nShort-term borrowings\n$\n—\n \n$\n3\n \nCurrent portion of long-term debt\n1,350\n \n—\n \nAccounts payable\n433\n \n411\n \nDividends payable\n224\n \n198\n \nAccrued expenses\n746\n \n683\n \nAccrued compensation and related items\n441\n \n382\n \nIncome taxes payable\n93\n \n110\n \nOther current liabilities\n125\n \n102\n \nTotal current liabilities\n3,412\n \n1,889\n \nLong-term debt, net of discount and issuance costs\n5,220\n \n6,564\n \nNoncurrent deferred tax liabilities\n167\n \n146\n \nOperating lease liabilities\n174\n \n188\n \nOther taxes payable\n272\n \n271\n \nOther noncurrent liabilities\n222\n \n237\n \nTotal liabilities\n9,467\n \n9,295\n \nCommitments and contingencies (Note 18)\nStockholders' equity:\nCommon stock, $\n0.01\n par value: \n6,000,000,000\n authorized, \n501,891,243\n and \n501,891,243\n shares issued; \n448,473,073\n and \n458,367,358\n shares outstanding at December 31, 2024 and 2023, respectively\n5\n \n5\n \nTreasury stock, at cost, \n53,418,170\n and \n43,523,885\n shares of common stock at December 31, 2024 and 2023, respectively\n(\n7,445\n)\n(\n5,597\n)\nAdditional paid-in capital\n1,182\n \n1,133\n \nRetained earnings\n11,968\n \n10,295\n \nAccumulated other comprehensive loss\n(\n940\n)\n(\n839\n)\nTotal Zoetis Inc. equity\n4,770\n \n4,997\n \nEquity attributable to noncontrolling interests\n—\n \n(\n6\n)\nTotal equity\n4,770\n \n4,991\n \nTotal liabilities and equity\n$\n14,237\n \n$\n14,286\n \n(a)\n    \nAs of December 31, 2024 and 2023, includes $\n2\n million, of restricted cash.\n58 |\nTable of Contents\nZOETIS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EQUITY\nZoetis\nAccumulated\nEquity\nAdditional\nOther\nAttributable to\n(MILLIONS OF DOLLARS, EXCEPT SHARE DATA)\nCommon Stock\nTreasury Stock\nPaid-in\nRetained\nComprehensive\nNoncontrolling\nTotal\nShares\nAmount\nShares\nAmount\nCapital\nEarnings\nLoss\nInterests\nEquity\nBalance, December 31, 2021\n501.9\n \n$\n5\n \n29.3\n \n$\n(\n2,952\n)\n$\n1,068\n \n$\n7,186\n \n$\n(\n764\n)\n$\n1\n \n$\n4,544\n \nNet income/(loss)\n— \n— \n— \n— \n2,114\n \n— \n(\n3\n)\n2,111\n \nOther comprehensive loss\n— \n— \n— \n— \n— \n— \n(\n53\n)\n—\n \n(\n53\n)\nShare-based compensation awards\n(a)\n—\n \n— \n(\n0.7\n)\n7\n \n17\n \n(\n1\n)\n— \n— \n23\n \nTreasury stock acquired\n(b)\n—\n \n— \n9.5\n \n(\n1,594\n)\n— \n— \n— \n— \n(\n1,594\n)\nEmployee benefit plan contribution from Pfizer Inc.\n(c)\n— \n— \n— \n— \n3\n \n— \n— \n— \n3\n \nDividends declared\n— \n— \n— \n— \n— \n(\n631\n)\n— \n— \n(\n631\n)\nBalance, December 31, 2022\n501.9\n \n$\n5\n \n38.1\n \n$\n(\n4,539\n)\n$\n1,088\n \n$\n8,668\n \n$\n(\n817\n)\n$\n(\n2\n)\n$\n4,403\n \nNet income/(loss)\n— \n— \n— \n2,344\n \n— \n(\n4\n)\n2,340\n \nOther comprehensive loss\n— \n— \n— \n— \n— \n(\n22\n)\n—\n \n(\n22\n)\nShare-based compensation awards\n(a)\n—\n \n— \n(\n0.9\n)\n44\n \n45\n \n(\n1\n)\n— \n— \n88\n \nTreasury stock acquired\n(b)\n—\n \n— \n6.3\n \n(\n1,102\n)\n— \n— \n— \n— \n(\n1,102\n)\nDividends declared \n— \n— \n— \n— \n(\n716\n)\n— \n— \n(\n716\n)\nBalance, December 31, 2023\n501.9\n \n$\n5\n \n43.5\n \n$\n(\n5,597\n)\n$\n1,133\n \n$\n10,295\n \n$\n(\n839\n)\n$\n(\n6\n)\n$\n4,991\n \nNet income\n—\n \n—\n \n—\n \n—\n \n—\n \n2,486\n \n—\n \n10\n \n2,496\n \nOther comprehensive loss\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n(\n101\n)\n—\n \n(\n101\n)\nDeconsolidation of noncontrolling interests\n— \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n(\n4\n)\n(\n4\n)\nShare-based compensation awards\n(a)\n—\n \n—\n \n(\n0.6\n)\n17\n \n49\n \n(\n1\n)\n—\n \n—\n \n65\n \nTreasury stock acquired\n(b)\n—\n \n—\n \n10.5\n \n(\n1,865\n)\n—\n \n—\n \n—\n \n—\n \n(\n1,865\n)\nDividends declared \n—\n \n—\n \n—\n \n—\n \n—\n \n(\n812\n)\n—\n \n—\n \n(\n812\n)\nBalance, December 31, 2024\n501.9\n \n$\n5\n \n53.4\n \n$\n(\n7,445\n)\n$\n1,182\n \n$\n11,968\n \n$\n(\n940\n)\n$\n—\n \n$\n4,770\n \nShares may not add due to rounding.\n(a)    \nIncludes the issuance of shares of Zoetis Inc. common stock and the reacquisition of shares of treasury stock associated with exercises of employee share-based awards. Also includes the reacquisition of shares of treasury stock associated with the vesting of employee share-based awards to satisfy tax withholding requirements. For additional information, see \nNote 15. Share-based Payments\n and \nNote 16. Stockholders' Equity\n.\n(b)\n    \nReflects the acquisition of treasury shares in connection with the share repurchase program. For 2024 and 2023, includes excise tax accrued on net share repurchases. For additional information, see \nNote 16. Stockholders' Equity\n.\n(c)    \nRepresents contributed capital from Pfizer Inc. associated with service credit continuation for certain Zoetis Inc. employees in Pfizer Inc.'s U.S. qualified defined benefit and U.S. retiree medical plans. See\n Note 14. Benefit Plans.\n \n59 |\nTable of Contents\nZOETIS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nOperating Activities\nNet income before allocation to noncontrolling interests\n$\n2,496\n \n$\n2,340\n \n$\n2,111\n \nAdjustments to reconcile net income before noncontrolling interests to net cash provided by operating activities:\nDepreciation and amortization expense\n497\n \n491\n \n465\n \nShare-based compensation expense\n74\n \n60\n \n62\n \nAsset write-offs and asset impairments\n31\n \n46\n \n53\n \nNet loss/(gain) on sale of businesses, excluding transaction costs\n23\n \n(\n118\n)\n—\n \nProvision for losses on inventory\n97\n \n115\n \n76\n \nDeferred taxes\n(\n338\n)\n(\n61\n)\n(\n286\n)\nSettlement of derivative contracts\n—\n \n—\n \n114\n \nEmployee benefit plan contribution from Pfizer Inc.\n—\n \n—\n \n3\n \nOther non-cash adjustments\n(\n6\n)\n(\n8\n)\n13\n \nOther changes in assets and liabilities, net of acquisitions and divestitures:\nAccounts receivable\n(\n61\n)\n(\n102\n)\n(\n137\n)\nInventories\n(\n40\n)\n(\n361\n)\n(\n486\n)\nOther assets\n52\n \n(\n95\n)\n35\n \nAccounts payable\n31\n \n13\n \n(\n29\n)\nOther liabilities\n114\n \n67\n \n(\n180\n)\nOther tax accounts, net\n(\n17\n)\n(\n34\n)\n98\n \nNet cash provided by operating activities\n2,953\n \n2,353\n \n1,912\n \nInvesting Activities\nCapital expenditures\n(\n655\n)\n(\n732\n)\n(\n586\n)\nAcquisitions, net of cash acquired\n(\n8\n)\n(\n155\n)\n(\n312\n)\nPurchase of investments\n(\n5\n)\n(\n4\n)\n(\n9\n)\nProceeds from derivative instrument activity, net\n62\n \n12\n \n23\n \nProceeds from sale of businesses, net of cash sold\n293\n \n96\n \n—\n \nNet proceeds from sale of assets\n1\n \n4\n \n1\n \nOther investing activities\n(\n3\n)\n2\n \n—\n \nNet cash used in investing activities\n(\n315\n)\n(\n777\n)\n(\n883\n)\nFinancing Activities\n(Decrease)/increase in short-term borrowings, net\n(\n3\n)\n1\n \n2\n \nPrincipal payments on long-term debt\n—\n \n(\n1,350\n)\n—\n \nProceeds from issuance of long-term debt—senior notes, net of discount\n—\n \n—\n \n1,348\n \nPayment of debt issuance costs\n—\n \n—\n \n(\n10\n)\nPayment of consideration related to previous acquisitions\n(\n5\n)\n(\n3\n)\n(\n1\n)\nShare-based compensation-related proceeds, net of taxes paid on withholding shares \n(\n8\n)\n27\n \n(\n38\n)\nPurchases of treasury stock, including excise taxes paid\n(\n1,858\n)\n(\n1,092\n)\n(\n1,594\n)\nCash dividends paid\n(\n786\n)\n(\n692\n)\n(\n611\n)\nNet cash used in financing activities\n(\n2,660\n)\n(\n3,109\n)\n(\n904\n)\nEffect of exchange-rate changes on cash and cash equivalents\n(\n32\n)\n(\n7\n)\n(\n29\n)\nNet (decrease)/increase in cash and cash equivalents\n(\n54\n)\n(\n1,540\n)\n96\n \nCash and cash equivalents at beginning of period\n2,041\n \n3,581\n \n3,485\n \nCash and cash equivalents at end of period\n$\n1,987\n \n$\n2,041\n \n$\n3,581\n \nSupplemental cash flow information\nCash paid during the period for:\n  Income taxes\n$\n892\n \n$\n754\n \n$\n638\n \n  Interest, net of capitalized interest\n274\n \n295\n \n242\n \nNon-cash transactions:\n  Capital expenditures\n$\n3\n \n$\n2\n \n$\n3\n \n  Dividends declared, not paid\n224\n \n198\n \n174\n \n  Excise tax accrued on net share repurchases, not paid\n17\n \n10\n \n—\n \n60 |\nTable of Contents\nZOETIS INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.     Business Description \nZoetis Inc. (including its subsidiaries, collectively, Zoetis, the company, we, us or our) is a global leader in the animal health industry, focused on the discovery, development, manufacture and commercialization of medicines, vaccines, diagnostic products and services, biodevices, genetic tests and precision animal health. We organize and operate our business in \ntwo\n geographic regions: the United States (U.S.) and International. \nWe directly market our products in approximately \n45\n countries across North America, Europe, Africa, Asia, Australia and South America. Our products are sold in more than \n100\n countries, including developed markets and emerging markets. We have a diversified business, marketing products across \neight\n core species: dogs, cats and horses (collectively, companion animals) and cattle, swine, poultry, fish and sheep (collectively, livestock); and within \nseven\n major product categories: parasiticides, vaccines, dermatology, anti-infectives, pain and sedation, other pharmaceutical and animal health diagnostics. On October 31, 2024, we completed the divestiture of our medicated feed additive product portfolio, certain water soluble products and related assets, and, as a result, our major product categories no longer include the category of medicated feed additives. See \nNote 5. Acquisitions and Divestitures\n.\nWe were incorporated in Delaware in July 2012 and prior to that the company was a business unit of Pfizer Inc. (Pfizer).\n2.     Basis of Presentation \nThe consolidated financial statements were prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP). For subsidiaries operating outside the United States, the consolidated financial information is included as of and for the fiscal year ended November 30 for each year presented. All significant intercompany balances and transactions between the legal entities that comprise Zoetis have been eliminated\n.\nCertain reclassifications of prior year information have been made to conform to the current year's presentation.\nIn the third quarter of 2024, we concluded that we were no longer the primary beneficiary of a variable interest entity (VIE) that was previously consolidated. The effects of the deconsolidation were not material to the consolidated financial statements.\n3.     Significant Accounting Policies \nRecently Adopted Accounting Standards\nIn November 2023, the FASB issued ASU No. 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures. The new guidance requires expanded annual and interim disclosures for significant segment expenses that are regularly provided to the chief operating decision maker and included within each reported measure of segment profit or loss. We adopted this guidance as of January 1, 2024, which resulted in additional disclosures in the notes to our consolidated financial statements that we applied retrospectively to all prior periods presented. See \nNote 19. Segment Information.\nRecently Issued Accounting Standards\nIn December 2023, the FASB issued ASU No. 2023-09, Income Taxes (Topic 740): Improvements to Income Tax disclosures. The new guidance requires standardized categories for the effective tax rate reconciliation, disaggregation of income taxes paid and other income tax-related disclosures. This update is effective for fiscal years beginning after December 15, 2024. We are currently evaluating the impact that the new guidance will have on our notes to the consolidated financial statements.\nIn November 2024, the FASB issued ASU No. 2024-03, Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses. The new guidance requires a public business entity to provide disaggregated disclosures, in the notes to the financial statements, of certain categories of expenses that are included in expense line items on the face of the income statement. The amendments in this Update are effective for annual reporting periods beginning after December 15, 2026, and interim reporting periods beginning after December 15, 2027. Early adoption is permitted. We are currently evaluating the impact that the new guidance will have on our notes to the consolidated financial statements.\nEstimates and Assumptions\nIn preparing the consolidated financial statements, we use certain estimates and assumptions that affect reported amounts and disclosures, including amounts recorded in connection with acquisitions. These estimates and underlying assumptions can impact all elements of our consolidated financial statements. For example, in the Consolidated Statements of Income, estimates are used when accounting for deductions from revenue (such as rebates, sales allowances, product returns and discounts), determining cost of sales, allocating cost in the form of depreciation and amortization, and estimating restructuring charges and the impact of contingencies. On the Consolidated Balance Sheets, estimates are used in determining the valuation and recoverability of assets, such as accounts receivables, inventories, fixed assets, goodwill and other identifiable intangible assets, and estimates are used in determining the reported amounts of liabilities, such as taxes payable, uncertain tax positions, benefit obligations, the impact of contingencies, deductions from revenue and restructuring reserves, all of which also impact the Consolidated Statements of Income. \nOur estimates are often based on complex judgments, probabilities and assumptions that we believe to be reasonable but that can be inherently uncertain and unpredictable. If our estimates and assumptions are not representative of actual outcomes, our results could be materially impacted. \nAs future events and their effects cannot be determined with precision, our estimates and assumptions may prove to be incomplete or inaccurate, or unanticipated events and circumstances may occur that might cause us to change those estimates and assumptions. We are subject to risks and uncertainties that may cause actual results to differ from estimated amounts, such as changes in competition, litigation, legislation and regulations. We regularly evaluate our estimates and assumptions using historical experience and expectations about the future. We adjust our estimates and \n61 |\nTable of Contents\nassumptions when facts and circumstances indicate the need for change. Those changes generally will be reflected in our consolidated financial statements on a prospective basis unless they are required to be treated retrospectively under relevant accounting standards. It is possible that others, applying reasonable judgment to the same facts and circumstances, could develop and support a range of alternative estimated amounts.\n \nAcquisitions\nOur consolidated financial statements include the operations of acquired businesses from the date of acquisition. We account for acquired businesses using the acquisition method of accounting, which requires, among other things, that most assets acquired and liabilities assumed be recognized at their estimated fair values as of the acquisition date and that the fair value of acquired in-process research and development (IPR&D) be recorded on the balance sheet. Transaction costs are expensed as incurred. Any excess of the consideration transferred over the assigned values of the net assets acquired is recorded as goodwill. When we acquire net assets that do not constitute a business as defined in U.S. GAAP, no goodwill is recognized. \nAmounts recorded for acquisitions can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nEstimates and Assumptions\n.\n \nLeases\nWe determine if a contract contains a lease at inception. Leases are recorded as a right of use asset, as of the lease commencement date, in an amount equal to the present value of future payments over the lease term. A corresponding lease liability is also recorded. We have elected not to recognize right of use assets and lease liabilities for short-term leases of vehicles and equipment with a lease term of twelve months or less. \nOptions to extend or terminate a lease are considered in the lease term to the extent that the option is reasonably certain of exercise. The present value of future payments is discounted using the rate implicit in the lease, when available. When the implicit rate is not available, as is frequently the case with our lease portfolio, the present value is calculated using our incremental borrowing rate, which is determined on the commencement date. The incremental borrowing rate represents the rate of interest that we would expect to pay on a collateralized basis to borrow an amount equal to the lease payments under similar terms. As we do not borrow on a collateralized basis, our non-collateralized borrowing rate is used as an input in deriving the incremental borrowing rate.\nOur lease portfolio primarily consists of operating leases, in which fixed lease payments are recognized on a straight-line basis over the lease term. Operating lease assets are recorded within Operating lease right of use assets with the corresponding operating lease liabilities recorded within Other current liabilities and Operating lease liabilities on the Consolidated Balance Sheets. Finance lease assets are recorded within Other noncurrent assets with the corresponding finance lease liabilities recorded within Other current liabilities and Other noncurrent liabilities on the Consolidated Balance Sheets. Variable payments are recognized in the period incurred. Variable lease payments include real estate taxes and charges for other non-lease services due to lessors that are not dependent on an index or rate and utilization based charges associated with fleet vehicles.\nOur real estate and fleet lease contracts may include fixed consideration attributable to both lease and non-lease components, including non-lease services provided by the vendor, which are accounted for as a single fixed minimum payment. For leases of certain classes of machinery and equipment, contract consideration is allocated to lease and non-lease components on the basis of relative standalone price.\n \nForeign Currency Translation\nFor most of our international operations, local currencies have been determined to be the functional currencies. We translate functional currency assets and liabilities to their U.S. dollar equivalents at exchange rates in effect at the balance sheet date and we translate functional currency income and expense amounts to their U.S. dollar equivalents at average exchange rates for the period. The U.S. dollar effects that arise from changing translation rates are recorded in \nOther comprehensive income/(loss), net of tax.\n The effects of converting non-functional currency assets and liabilities into the functional currency are recorded in \nOther (income)/deductions––net. \nFor operations in highly inflationary economies, we translate monetary items at rates in effect at the balance sheet date, with translation adjustments recorded in \nOther (income)/deductions––net\n, and we translate non-monetary items at historical rates.\n \nRevenue, Deductions from Revenue and the Allowance for Doubtful Accounts\nWe recognize revenue from product sales when control of the goods has transferred to the customer, which is typically once the goods have shipped and the customer has assumed title.\n \nRevenue reflects the total consideration to which we expect to be entitled (i.e., the transaction price), in exchange for products sold, after considering various types of variable consideration including rebates, sales allowances, product returns and discounts. \nVariable consideration is estimated and recorded at the time that related revenue is recognized. Our estimates reflect the amount by which we expect variable consideration to impact revenue recognized and are generally based on contractual terms or historical experience, adjusted as necessary to reflect our expectations about the future. Our customer payment terms generally range from \n30\n to \n90\n days.\nEstimates of variable consideration utilize a complex series of judgments and assumptions to determine the amount by which we expect revenue to be reduced, for example;\n•\nfor sales returns, we perform calculations in each market that incorporate the following, as appropriate: local returns policies and practices; historic returns as a percentage of revenue; estimated shelf life by product; an estimate of the amount of time between shipment and return or lag time; and any other factors that could impact the estimate of future returns, product recalls, discontinuation of products or a changing competitive environment; and \n•\nfor revenue incentives, we use our historical experience with similar incentives programs to estimate the impact of such programs on revenue for the current period. \nAlthough the amounts recorded for these deductions from revenue are dependent on estimates and assumptions, historically our adjustments to actual results have not been material. The sensitivity of our estimates can vary by program, type of customer and geographic location.\nAccruals for deductions from revenue are recorded as either a reduction in \nAccounts receivable\n or within \nAccrued expenses\n, depending on the nature of the contract and method of expected payment. Amounts recorded as a reduction in \nAccounts receivable \nas of December 31, 2024 and 2023 are \n62 |\nTable of Contents\napproximately $\n257\n million and $\n301\n million, respectively. As of December 31, 2024, and 2023, accruals for deductions from revenue included in \nAccrued expenses \nare approximately $\n344\n million and $\n323\n million, respectively. \nA deferral of revenue may be required in the event that we have not satisfied all customer obligations for which we have been compensated. The transaction price is allocated to the individual performance obligations on the basis of relative stand-alone selling price, which is typically based on actual sales prices. Revenue associated with unsatisfied performance obligations are contract liabilities is recorded within \nOther current liabilities \nand\n Other noncurrent liabilities.\n Recognition of revenue occurs once control of the underlying products has transferred to the customer. Contract liabilities reflected within \nOther current liabilities\n as of December 31, 2023 and subsequently recognized as revenue during 2024 were approximately $\n4\n million. Contract liabilities as of December 31, 2024 were approximately $\n18\n million.\nWe do not disclose the transaction price allocated to unsatisfied performance obligations related to contracts with an original expected duration of one year or less, or for contracts for which we recognize revenue in line with our right to invoice the customer. Estimated future revenue expected to be generated from long-term contracts with unsatisfied performance obligations as of December 31, 2024 is not material. \nTaxes collected from customers relating to product sales and remitted to governmental authorities are excluded from \nRevenue.\n Shipping and handling costs incurred after control of the purchased product has transferred to the customer are accounted for as a fulfillment cost, within \nSelling, general and administrative expenses.\nWe also record estimates for bad debts. We periodically assess the adequacy of the allowance for doubtful accounts by evaluating the collectability of outstanding receivables based on factors such as past due history, historical and expected collection patterns, the financial condition of our customers, the robust nature of our credit and collection practices and the economic environment. \nAmounts recorded for sales deductions and bad debts can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nEstimates and Assumptions.\n \nCost of Sales and Inventories\nInventories are carried at the lower of cost or net realizable value. The cost of finished goods, work-in-process and raw materials is determined using average actual cost. We regularly review our inventories for impairment and adjustments are recorded when necessary.\n \nSelling, General and Administrative Expenses\nSelling, general and administrative costs are expensed as incurred. Among other things, these expenses include the internal and external costs of marketing, advertising, and shipping and handling as well as certain costs related to business technology, facilities, legal, finance, human resources, business development, public affairs and procurement, among others. \nAdvertising expenses relating to production costs are expensed as incurred, and the costs of space in publications are expensed when the related advertising occurs. Advertising and promotion expenses totaled approximately $\n302\n million in 2024, $\n281\n million in 2023 and $\n287\n million in 2022. \nShipping and handling costs totaled approximately $\n107\n million in 2024, $\n101\n million in 2023 and $\n82\n million in 2022.\n \nResearch and Development Expenses\nResearch and development (R&D) costs are expensed as incurred. Research is the effort associated with the discovery of new knowledge that will be useful in developing a new product or in significantly improving an existing product. Development is the implementation of the research findings. Before a compound receives regulatory approval, we record upfront and milestone payments made by us to third parties under licensing arrangements as expense. Upfront payments are recorded when incurred, and milestone payments are recorded when the specific milestone has been achieved. Once a compound receives regulatory approval in a major market, we record any milestone payments in \nIdentifiable intangible assets, less accumulated amortization \nand, unless the assets are determined to have an indefinite life, we amortize them on a straight-line basis over the remaining agreement term or the expected product life cycle, whichever is shorter.\n \nAmortization of Intangible Assets, Depreciation and Certain Long-Lived Assets\nLong-lived assets include: \n•    \nGoodwill\n—goodwill represents the excess of the consideration transferred for an acquired business over the assigned values of its net assets. Goodwill is not amortized. \n•    \nIdentifiable intangible assets, less accumulated amortization\n—these acquired assets are recorded at our cost. Identifiable intangible assets with finite lives are amortized on a straight-line basis over their estimated useful lives. Identifiable intangible assets with indefinite lives that are associated with marketed products are not amortized until a useful life can be determined. Identifiable intangible assets associated with IPR&D projects are not amortized until regulatory approval is obtained. The useful life of an amortizing asset generally is determined by identifying the period in which substantially all of the cash flows are expected to be generated. \n•    \nProperty, plant and equipment, less accumulated depreciation\n––these assets are recorded at our cost and are increased by the cost of any significant improvements after purchase. Property, plant and equipment assets, other than land and construction-in-progress, are depreciated on a straight-line basis over the estimated useful life of the individual assets. Depreciation begins when the asset is ready for its intended use. For tax purposes, accelerated depreciation methods are used as allowed by tax laws. \nAmortization expense related to finite-lived identifiable intangible assets that contribute to our ability to sell, manufacture, research, market and distribute products, compounds and intellectual property are included in \nAmortization of\n \nintangible assets\n as they benefit multiple business functions. Amortization expense related to intangible assets that are associated with a single function and depreciation of property, plant and equipment are included in \nCost of sales\n, \nSelling, general and administrative expenses\n and \nResearch and development expenses\n, as appropriate. \nWe review all of our long-lived assets for impairment indicators throughout the year and we perform detailed testing whenever impairment indicators are present. In addition, we perform impairment testing for goodwill and indefinite-lived assets at least annually. When necessary, we record charges for impairments. Specifically: \n63 |\nTable of Contents\n•    For finite-lived identifiable intangible assets, such as developed technology rights, and for other long-lived assets, such as property, plant and equipment, whenever impairment indicators are present, we calculate the undiscounted value of the projected cash flows associated with the asset, or asset group, and compare this estimated amount to the carrying amount. If the carrying amount is found to be greater, we record an impairment loss for the excess of book value over fair value. In addition, in all cases of an impairment review, we re-evaluate the remaining useful lives of the assets and modify them, as appropriate. \n•    For indefinite-lived identifiable intangible assets, such as brands and IPR&D assets, we test for impairment at least annually, or more frequently if impairment indicators exist, by first assessing qualitative factors to determine whether it is more likely than not that the fair value of the indefinite-lived intangible asset is less than its carrying amount. If we conclude it is more likely than not that the fair value is less than the carrying amount, a quantitative test that compares the fair value of the indefinite-lived intangible asset with its carrying value is performed. If the fair value is less than the carrying amount, an impairment loss is recognized. We record an impairment loss, if any, for the excess of book value over fair value. In addition, in all cases of an impairment review other than for IPR&D assets, we re-evaluate whether continuing to characterize the asset as indefinite-lived is appropriate. \n•    For goodwill, we test for impairment on at least an annual basis, or more frequently if necessary, either by assessing qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, or by performing a periodic quantitative assessment. If we choose to perform a qualitative analysis and conclude it is more likely than not that the fair value of a reporting unit is less than its carrying amount, a quantitative fair value test is performed. We determine the implied fair value of goodwill by subtracting the fair value of all the identifiable net assets other than goodwill from the fair value of the reporting unit and record an impairment loss for the excess, if any, of book value of goodwill over the implied fair value. In 2024 we performed a periodic quantitative impairment assessment as of September 30, 2024, which did not result in the impairment of goodwill associated with any of our reporting units. In 2023, we performed a qualitative impairment assessment as of September 30, 2023, which did not result in the impairment of goodwill associated with any of our reporting units. \nImpairment reviews can involve a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nEstimates and Assumptions.\n \nSoftware Capitalization and Depreciation\nWe capitalize certain costs incurred in connection with obtaining or developing internal-use software, including payroll and payroll-related costs for employees who are directly associated with the internal-use software project, external direct costs of materials and services and interest costs while developing the software. Capitalized software costs are included in \nProperty, plant and equipment \nand are amortized using the straight-line method over the estimated useful life of \n5\n to \n10\n years. Capitalization of such costs ceases when the project is substantially complete and ready for its intended purpose. Costs incurred during the preliminary project and post-implementation stages, as well as software maintenance and training costs, are expensed in the period in which they are incurred. The company capitalized $\n18\n million and $\n35\n million of internal-use software for the years ended December 31, 2024 and 2023, respectively. Depreciation expense for capitalized software was $\n61\n million in 2024, $\n75\n million in 2023 and $\n69\n million in 2022. \nIn addition, we capitalize qualifying implementation costs under cloud computing arrangements (“CCA”). The capitalized CCA implementation costs are allocated between Other current assets and Other noncurrent assets on the accompanying Consolidated Balance Sheets based on the expected period that amortization will be recognized. CCA implementation costs are amortized using the straight-line method over the expected term of the related service contract.\nRestructuring Charges and Certain Acquisition and Divestiture-Related Costs\nWe may incur restructuring charges in connection with acquisitions when we implement plans to restructure and integrate the acquired operations or in connection with cost-reduction and productivity initiatives. Included in \nRestructuring charges and certain acquisition and divestiture-related costs\n are all restructuring charges and certain costs associated with acquiring and integrating an acquired business and divesting and disintegrating divested businesses. Transaction costs and integration costs are expensed as incurred. Termination costs are a significant component of restructuring charges and are generally recorded when the actions are probable and estimable. \nAmounts recorded for restructuring charges and other associated costs can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nEstimates and Assumptions\n.\n \nEarnings per Share\nBasic earnings per share is computed by dividing net income attributable to Zoetis by the weighted-average number of common shares outstanding during the period. Diluted earnings per share adjusts the weighted-average number of common shares outstanding for the potential dilution that could occur if common stock equivalents (stock options, restricted stock units, and performance-vesting restricted stock units) were exercised or converted into common stock, calculated using the treasury stock method.\nCash Equivalents\nCash equivalents include items almost as liquid as cash, such as money market funds, certificates of deposit and time deposits with maturity periods of three months or less when purchased.\n \n64 |\nTable of Contents\nFair Value\nCertain assets and liabilities are required to be measured at fair value, either upon initial recognition or for subsequent accounting or reporting. For example, we use fair value extensively in the initial recognition of net assets acquired in a business combination. Fair value is estimated using an exit price approach, which requires, among other things, that we determine the price that would be received to sell an asset or paid to transfer a liability in an orderly market. The determination of an exit price is considered from the perspective of market participants, considering the highest and best use of assets and, for liabilities, assuming that the risk of non-performance will be the same before and after the transfer. \nWhen estimating fair value, depending on the nature and complexity of the asset or liability, we may use one or all of the following approaches: \n•    Income approach, which is based on the present value of a future stream of net cash flows. \n•    Market approach, which is based on market prices and other information from market transactions involving identical or comparable assets or liabilities. \n•    Cost approach, which is based on the cost to acquire or construct comparable assets less an allowance for functional and/or economic obsolescence. \nThese fair value methodologies depend on the following types of inputs: \n•    Quoted prices for identical assets or liabilities in active markets (Level 1 inputs). \n•    Quoted prices for similar assets or liabilities in active markets or quoted prices for identical or similar assets or liabilities in markets that are not active or are directly or indirectly observable (Level 2 inputs). \n•    Unobservable inputs that reflect estimates and assumptions (Level 3 inputs). \nA single estimate of fair value can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nEstimates and Assumptions\n.\n \nAccounts Receivable \nThe recorded amounts of accounts receivable approximate fair value because of their relatively short-term nature. As of December 31, 2024 and 2023, \nAccounts receivable, less allowance for doubtful accounts,\n of $\n1,316\n million and $\n1,304\n million, respectively, includes approximately $\n79\n million and $\n58\n million, respectively, of other receivables, such as trade notes receivable and royalty receivables, among others.\n \nDe\nferred Tax Assets and Liabilities and Income Tax Contingencies\nDeferred tax assets and liabilities are recognized for the expected future tax consequences of differences between the financial reporting and tax bases of assets and liabilities using enacted tax rates and laws. We provide a valuation allowance when we believe that our deferred tax assets are not recoverable based on an assessment of estimated future taxable income that incorporates ongoing, prudent and feasible tax planning strategies. \nWe account for income tax contingencies using a benefit recognition model. If we consider that a tax position is more likely than not to be sustained upon audit, based solely on the technical merits of the position, we recognize the benefit. We measure the benefit by determining the amount that is greater than \n50\n% likely of being realized upon settlement, presuming that the tax position is examined by the appropriate taxing authority that has full knowledge of all relevant information. Under the benefit recognition model, if the initial assessment fails to result in the recognition of a tax benefit, we regularly monitor our position and subsequently recognize the tax benefit: (i) if there are changes in tax law, analogous case law or there is new information that sufficiently raise the likelihood of prevailing on the technical merits of the position to more likely than not; (ii) if the statute of limitations expires; or (iii) if there is a completion of an audit resulting in a favorable settlement of that tax year with the appropriate agency. We regularly re-evaluate our tax positions based on the results of audits of federal, state and foreign income tax filings, statute of limitations expirations, changes in tax law or receipt of new information that would either increase or decrease the technical merits of a position relative to the “more-likely-than-not” standard. Liabilities associated with uncertain tax positions are classified as current only when we expect to pay cash within the next 12 months. Interest and penalties, if any, are recorded in \nProvision for taxes on income \nand are classified on our Consolidated Balance Sheets with the related tax liability. \nAmounts recorded for valuation allowances and income tax contingencies can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nEstimates and Assumptions. \nB\nenefit Plans\nAll dedicated benefit plans are pension plans. For our dedicated benefit plans, we recognize the overfunded or underfunded status of defined benefit plans as an asset or liability on the Consolidated Balance Sheets and the obligations generally are measured at the actuarial present value of all benefits attributable to employee service rendered, as provided by the applicable benefit formula. Pension obligations may include assumptions such as long-term rate of return on plan assets, expected employee turnover, participant mortality, and future compensation levels. Plan assets are measured at fair value. Net periodic benefit costs are recognized, as required, into \nCost of sales, Selling, general and administrative expenses \nand \nResearch and development expenses\n, as appropriate. \nAmounts recorded for benefit plans can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nEstimates and Assumptions.\n \nAsset Retirement Obligations\nWe record accruals for the legal obligations associated with the retirement of tangible long-lived assets, including obligations under the doctrine of promissory estoppel and those that are conditioned upon the occurrence of future events. These obligations generally result from the acquisition, construction, development and/or normal operation of long-lived assets. We recognize the fair value of these obligations in the period in which they are incurred by increasing the carrying amount of the related asset. Over time, we recognize expense for the accretion of the liability and for the amortization of the asset. \n65 |\nTable of Contents\nAs of December 31, 2024 and 2023, accruals for asset retirement obligations are $\n23\n million and $\n28\n million, respectively, and are included in \nOther noncurrent liabilities.\nAmounts recorded for asset retirement obligations can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nEstimates and Assumptions.\n \nLegal and Environmental Contingencies\nWe are subject to numerous contingencies arising in the ordinary course of business, such as product liability and other product-related litigation, commercial litigation, patent litigation, environmental claims and proceedings, government investigations and guarantees and indemnifications. We record accruals for these contingencies to the extent that we conclude that a loss is both probable and reasonably estimable. If some amount within a range of loss appears to be a better estimate than any other amount within the range, we accrue that amount. Alternatively, when no amount within a range of loss appears to be a better estimate than any other amount, we accrue the lowest amount in the range. We record anticipated recoveries under existing insurance contracts when recovery is assured. \nAmounts recorded for contingencies can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nEstimates and Assumptions.\n \nShare-Based Payments\nOur compensation programs can include share-based payment plans. All grants under share-based payment programs are accounted for at fair value and such amounts generally are amortized on a straight-line basis over the vesting term to \nCost of sales, Selling, general and administrative expenses, \nand \nResearch and development expenses\n, as appropriate. We include the impact of estimated forfeitures when determining share-based compensation expense. \nAmounts recorded for share-based compensation can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nEstimates and Assumptions\n.\n \n4.     Revenue \nA.    Revenue from Product Sales \nWe offer a diversified portfolio of products which allows us to capitalize on local and regional customer needs. Generally, our products are promoted to veterinarians and livestock producers by our sales organization which includes sales representatives and technical and veterinary operations specialists, and then sold directly by us or through distributors, retailers or e-commerce outlets. The depth of our product portfolio enables us to address the varying needs of customers in different species and geographies. Many of our top-selling product lines are distributed across both of our operating segments, leveraging our R&D operations and manufacturing and supply chain network.\nOver the course of our history, we have focused on developing a diverse portfolio of animal health products, including medicines, vaccines and diagnostics, complemented by biodevices, genetic tests and a range of services. We refer to all different brands of a particular product, or its dosage forms for all species, as a product line. We have approximately \n300\n comprehensive product lines, including products for both companion animals and livestock within each of our major product categories.\nIn the first quarter of 2024, we modified the list of major product categories to include a category for pain and sedation products, which were previously included within other pharmaceutical products. The prior period presentation has been revised to reflect the new product category.\nOn October 31, 2024, we completed the divestiture of our medicated feed additive product portfolio, certain water soluble products and related assets, and, as a result, our major product categories no longer include the category of medicated feed additives. See \nNote 5. Acquisitions and Divestitures\n.\nOur major product categories are:\n•\nparasiticides:\n products that prevent or eliminate external and internal parasites such as fleas, ticks, lice and worms;\n•\nvaccines:\n biological preparations that help prevent diseases of the respiratory, gastrointestinal and reproductive tracts or induce a specific immune response;\n•\ndermatology:\n products that relieve itch associated with allergic conditions and atopic dermatitis;\n•\nanti-infectives: \nproducts that prevent, kill or slow the growth of bacteria, fungi or protozoa;\n•\npain and sedation:\n products that alleviate pain, primarily associated with osteoarthritis and postoperative pain;\n•\nother pharmaceutical:\n antiemetic, reproductive and oncology products; and\n•\nanimal health diagnostics:\n testing and analysis of blood, urine and other animal samples and related products and services, including point-of-care diagnostic products, instruments and reagents, rapid immunoassay tests, reference laboratory kits and services and blood glucose monitors.\nOur remaining revenue is derived from other non-pharmaceutical product categories, such as nutritionals, as well as products and services in biodevices, genetic tests and precision animal health. \nOur companion animal products help extend and improve the quality of life for pets; increase convenience and compliance for pet owners; and help veterinarians improve the quality of their care and the efficiency of their businesses. Growth in the companion animal medicines, vaccines and diagnostics sector is driven by economic development, related increases in disposable income and increases in pet ownership and spending on pet care. Companion animals are also living longer, deepening the human-animal bond, receiving increased medical treatment and benefiting from advances in animal health medicine, vaccines and diagnostics. \nOur livestock products primarily help prevent or treat diseases and conditions to allow veterinarians and producers to care for their animals and to enable the cost-effective production of safe, high-quality animal protein. Human population growth and increasing standards of living are \n66 |\nTable of Contents\nimportant long-term growth drivers for our livestock products in three major ways. First, population growth and increasing standards of living drive demand for improved nutrition, particularly through increased consumption of animal protein. Second, population growth leads to greater natural resource constraints driving a need for enhanced productivity. Finally, as standards of living improve and the global chain faces increased scrutiny, there is more focus on food quality, safety, and reliability of supply. \nThe following tables present our revenue disaggregated by geographic area, species, and major product category:\nRevenue by geographic area\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nUnited States\n$\n5,074\n \n$\n4,555\n \n$\n4,313\n \nAustralia\n319\n \n323\n \n289\n \nBrazil\n414\n \n393\n \n330\n \nCanada\n277\n \n255\n \n238\n \nChile\n123\n \n140\n \n141\n \nChina\n270\n \n320\n \n382\n \nFrance\n156\n \n142\n \n126\n \nGermany\n225\n \n202\n \n176\n \nItaly\n129\n \n121\n \n111\n \nJapan\n147\n \n158\n \n173\n \nMexico\n169\n \n162\n \n136\n \nSpain\n130\n \n122\n \n118\n \nUnited Kingdom\n314\n \n277\n \n235\n \nOther developed markets\n564\n \n512\n \n468\n \nOther emerging markets\n865\n \n784\n \n758\n \n9,176\n \n8,466\n \n7,994\n \nContract manufacturing & human health\n80\n \n78\n \n86\n \nTotal Revenue\n$\n9,256\n \n$\n8,544\n \n$\n8,080\n \nRevenue exceeded $\n100\n million in \nthirteen\n countries outside the U.S. in 2024 and \ntwelve\n countries outside the U.S. in 2023 and 2022. The U.S. was the only country to contribute more than 10% of total revenue in each year. \nRevenue by major species\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nU.S.\nCompanion animal\n$\n4,054\n \n$\n3,529\n \n$\n3,341\n \nLivestock\n1,020\n \n1,026\n \n972\n \n5,074\n \n4,555\n \n4,313\n \nInternational\nCompanion animal\n2,224\n \n2,047\n \n1,862\n \nLivestock\n1,878\n \n1,864\n \n1,819\n \n4,102\n \n3,911\n \n3,681\n \nTotal\nCompanion animal\n6,278\n \n5,576\n \n5,203\n \nLivestock\n2,898\n \n2,890\n \n2,791\n \nContract manufacturing & human health\n80\n \n78\n \n86\n \nTotal Revenue\n$\n9,256\n \n$\n8,544\n \n$\n8,080\n \n67 |\nTable of Contents\nRevenue by species\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nCompanion Animal:\nDogs and Cats\n$\n5,993\n \n$\n5,291\n \n$\n4,939\n \nHorses\n285\n \n285\n \n264\n \n6,278\n \n5,576\n \n5,203\n \nLivestock:\nCattle\n1,531\n \n1,503\n \n1,440\n \nPoultry\n527\n \n524\n \n476\n \nSwine\n516\n \n543\n \n565\n \nFish\n242\n \n220\n \n212\n \nSheep and other\n82\n \n100\n \n98\n \n2,898\n \n2,890\n \n2,791\n \nContract manufacturing & human health\n80\n \n78\n \n86\n \nTotal Revenue\n$\n9,256\n \n$\n8,544\n \n$\n8,080\n \nRevenue by product category\nYear Ended December 31, \n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nParasiticides\n$\n2,153\n \n$\n1,947\n \n$\n1,860\n \nVaccines\n1,827\n \n1,771\n \n1,718\n \nDermatology\n1,655\n \n1,427\n \n1,329\n \nAnti-infectives\n1,100\n \n1,057\n \n1,081\n \nPain and sedation\n851\n \n602\n \n420\n \nOther pharmaceuticals\n658\n \n678\n \n623\n \nAnimal health diagnostics\n386\n \n376\n \n353\n \nMedicated feed additives\n293\n \n354\n \n360\n \nOther non-pharmaceuticals\n253\n \n254\n \n250\n \n9,176\n \n8,466\n \n7,994\n \nContract manufacturing & human health\n80\n \n78\n \n86\n \nTotal Revenue\n$\n9,256\n \n$\n8,544\n \n$\n8,080\n \nB.    Other Revenue Information\nSignificant Customers\nWe primarily sell our companion animal products to veterinarians or to third-party veterinary distributors that typically then sell our products to veterinarians, and in each case, veterinarians then typically sell our products to pet owners. In certain markets, we also sell certain companion animal products through retail and e-commerce outlets. We sell our livestock products primarily to veterinarians and livestock producers, including beef and dairy farmers as well as pork and poultry operations, in addition to third-party veterinary distributors and retail outlets who then typically sell the products to livestock producers. Sales to our largest customer, a U.S. veterinary distributor, represented approximately \n14\n% of total revenue for 2024, \n15\n% of total revenue for 2023 and \n14\n% of total revenue for 2022.\n5.     Acquisitions and Divestitures\nA.    Acquisitions\nDuring 2023, we acquired \n100\n% of the issued share capital of PetMedix Ltd (PetMedix), a privately held research and development stage animal health biopharmaceutical company based in the U.K., which develops antibody-based therapeutics for companion animals. The purchase price included upfront cash consideration of $\n111\n million, excluding $\n19\n million of cash acquired, $\n5\n million in cash withheld for customary post-closing adjustments, and contingent consideration up to $\n100\n million based on the achievement of certain milestones. There are additional contingent payments to be made to the seller upon receipt of payments from a third party related to a preexisting collaboration arrangement between PetMedix and the third party. The initial fair value assessment of the contingent consideration and additional contingent payments is not material and the transaction did not have a material impact on our consolidated financial statements. We also completed the acquisition of adivo GmbH (adivo), a privately held research and development stage animal health biopharmaceutical company based in Germany. The transaction did not have a material impact on our consolidated financial statements. \nDuring 2022, we completed the acquisition of Basepaws, a privately held petcare genetics company based in the U.S., which provides pet owners with genetic tests, analytics and early health risk assessments that can help manage the health, wellness and quality of care for their pets and helps Zoetis identify solutions to complex diseases by informing our research and innovation. We also completed the acquisition of NewMetrica, a privately held company based in Scotland, that provides scientifically-developed instruments to measure quality of life in companion animals. These transactions did not have a material impact on our consolidated financial statements. \n68 |\nTable of Contents\nDuring 2021, we entered into an agreement to acquire Jurox, a privately held animal health company based in Australia, which develops, manufactures and markets a wide range of veterinary medicines for treating companion animals and livestock. On September 30, 2022, after satisfying all customary closing conditions, including clearance from the Australian Competition and Consumer Commission, we completed the acquisition of Jurox. We acquired \n100\n% of the outstanding shares for an aggregate cash purchase price of $\n226\n million, which was adjusted to $\n240\n million for cash and working capital and other adjustments as of the closing date. Net cash consideration transferred to the seller was $\n215\n million during 2022 and $\n5\n million during 2023. The transaction was accounted for as a business combination, with the assets acquired and liabilities assumed measured at their respective acquisition date fair values. The valuation was finalized during 2023. \nThe table below presents the final fair values allocated to the assets and liabilities of Jurox as of the acquisition date:\n(MILLIONS OF DOLLARS)\nAmounts\nCash and cash equivalents\n$\n20\n \nAccounts receivable\n8\n \nInventories\n(a)\n21\n \nOther current assets\n1\n \nProperty, plant and equipment\n(b)\n25\n \nIdentifiable intangible assets\n(c)\n135\n \nOther noncurrent assets\n7\n \nAccounts payable\n2\n \nOther current liabilities\n12\n \nOther noncurrent liabilities\n1\n \nTotal net assets acquired\n202\n \nGoodwill\n(d)\n38\n \nTotal consideration\n$\n240\n \n(a)\n        Acquired inventory is comprised of finished goods, work in process and raw materials. The fair value of finished goods was determined based on net realizable value adjusted for the costs of the selling effort, a reasonable profit allowance for the selling effort, and estimated holding costs. The fair value of work in process was determined based on net realizable value adjusted for costs to complete the manufacturing process, costs of the selling effort, a reasonable profit allowance for the remaining manufacturing and selling effort, and an estimate of holding costs. The fair value of raw materials was determined to approximate book value. \n(b)\n    Property, plant and equipment is comprised of buildings, machinery and equipment, land, construction in progress and furniture and fixtures. The fair value was primarily determined using a reproduction/replacement cost approach which measures the value of an asset by estimating the cost to acquire or construct comparable assets adjusted for age and condition of the asset.\n(c)\n    Identifiable intangible assets consist of developed technology rights. The fair value of identifiable intangible assets was determined using the income approach, which includes a forecast of expected future cash flows. For additional information regarding identifiable intangible assets, see \nNote 13. Goodwill and Other Intangible Assets\n.\n(d)\n        Goodwill represents the excess of consideration transferred over the fair values of the assets acquired and liabilities assumed. It is allocated to our International segment and is primarily attributable to cost and revenue synergies including market share capture, elimination of cost redundancies and gain of cost efficiencies, and intangible assets such as assembled workforce which are not separately recognizable. The primary strategic purpose of the acquisition was to enhance the company’s existing product portfolio.\n \nB.    Divestitures\nOn October 31, 2024, we completed the divestiture of our medicated feed additive product portfolio, certain water soluble products and related as\nsets to Phibro Animal Healt\nh for an estimated net purchase price of $\n309\n million, including $\n6\n million\n \nof estimated post-closing adjustments subject to finalization. We received $\n303\n million sales proceeds as of the end of the reporting period, less cash sold of $\n11\n million resulting in $\n292\n million net sales proceeds. We \nhave determined that this divestiture does not qualify for reporting as a discontinued operation, as it does not represent a strategic shift that has or will have a major effect on our operations and/or financial results. We recorded a net pre-tax loss of \n$\n25\n million\n within \nOther (income)/deductions—net\n, inclusive of costs to sell and foreign currency translation losses reclassified out of accumulated other comprehensive income into earnings. \n69 |\nTable of Contents\nAs of the disposal date, the carrying amounts of the following major assets and liabilities were derecognized from our consolidated balance sheets:\nOctober 31,\n(MILLIONS OF DOLLARS)\n2024\nAssets\nInventories\n$\n154\n \nOther current assets\n3\n \nProperty, plant and equipment, less accumulated depreciation\n108\n \nOperating lease right-of-use assets\n2\n \nGoodwill\n(a)\n12\n \nIdentifiable intangible assets, less accumulated amortization\n26\n \nNoncurrent deferred tax assets\n2\n \nOther noncurrent assets\n9\n \nTotal Assets\n$\n316\n \nLiabilities\nAccounts payable\n$\n3\n \nAccrued expenses\n3\n \nAccrued compensation and related items\n2\n \nOther noncurrent liabilities\n8\n \nTotal Liabilities\n$\n16\n \n(a)\n Net of $\n12\n million\n \nloss recognized during 2024.\nDuring 2023, we received net cash proceeds of $\n93\n million ($\n99\n million sales proceeds, net of cash sold of $\n6\n million) for the sale of a majority interest in our pet insurance business, Pumpkin Insurance Services. We recorded a net pre-tax gain of $\n101\n million within \nOther (income)/deductions—net\n, which includes $\n24\n million related to the remeasurement of our retained noncontrolling investment to fair value. We also completed the divestiture of Performance Livestock Analytics, part of our precision animal health business. This transaction did not have a material impact on our consolidated financial statements.\n6.     Restructuring Charges and Other Costs Associated with Acquisitions and Divestitures \nIn connection with our cost-reduction/productivity initiatives, we typically incur restructuring costs and charges associated with workforce reductions and site closings. In connection with our acquisition and divestiture activities, we typically incur costs and charges associated with executing the transactions. Acquisition activity may also include integrating the acquired operations, which may include expenditures for consulting and the integration of systems and processes, product transfers and restructuring the company, which may include charges related to employees, assets, and activities that will not continue in the company. Divestiture activity may also include costs to separate the divested operations, which may include expenditures for consulting and the disintegration of systems and processes, transfer costs, and restructuring charges, which may include charges related to employees, assets and activities that will not continue in the company's ongoing operations. All operating functions can be impacted by these actions, including sales and marketing, manufacturing and R&D, as well as functions such as business technology, shared services and corporate operations. \nThe components of costs incurred in connection with restructuring initiatives, acquisitions, divestitures and cost-reduction/productivity initiatives are as follows:\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nRestructuring charges and certain acquisition and divestiture-related costs:\nAcquisition-related costs\n(a)\n$\n1\n \n$\n7\n \n$\n5\n \nDivestiture-related costs\n(b)\n16\n \n—\n \n—\n \nRestructuring charges\n(c)(d)\n:\nEmployee termination costs\n36\n \n41\n \n3\n \nAsset impairment charges\n—\n \n1\n \n2\n \nExit costs\n—\n \n4\n \n1\n \nTotal \nRestructuring charges and certain acquisition and divestiture-related costs\n$\n53\n \n$\n53\n \n$\n11\n \n(a)\n    Acquisition-related costs represent external, incremental costs directly related to integrating acquired businesses and primarily include expenditures for consulting and the integration of systems and processes, as well as product transfer costs as well as transaction costs that represent external costs directly related to acquiring businesses and primarily include expenditures for banking, legal, accounting and other similar services.\n(b)\n    Divestiture-related costs consisted of costs related to the sale of our medicated feed additive product portfolio, certain water soluble products and related assets.                                                                                                                                                                                                                                                                                                                                                                                                              \n(c)    \nThe restructuring charges for the year ended December 31, 2024 primarily consisted of employee termination costs related to organizational structure refinements, partially offset by a reversal of certain employee termination costs as a result of a change in strategy from our 2015 operational efficiency initiative.\n    The restructuring charges for the year ended December 31, 2023 primarily consisted of employee termination and exit costs related to organizational structure refinements and other cost-reduction and productivity initiatives.\n70 |\nTable of Contents\n     The restructuring charges for the year ended December 31, 2022 primarily relates to employee termination and exit costs associated with cost-reduction and productivity initiatives in certain international markets, as well as asset impairment charges primarily related to the consolidation of manufacturing sites in China.\n(d)    \nThe restructuring charges are associated with the following: \n•\nFor the year ended December 31, 2024, Manufacturing/research/corporate of $\n14\n million, U.S. of $\n7\n million and International of $\n15\n million.\n•\nFor the year ended December 31, 2023, Manufacturing/research/corporate of $\n22\n million and International of $\n21\n million.\n•\nFor the year ended December 31, 2022, Manufacturing/research/corporate of $\n2\n million and International of $\n4\n million. \nThe components of, and changes in, our restructuring accruals are as follows: \nEmployee\nAsset\nTermination\nImpairment\nExit\n(MILLIONS OF DOLLARS)\nCosts\nCharges\nCosts\nAccrual\nBalance, December 31, 2021\n$\n23\n \n$\n— \n$\n2\n \n$\n25\n \nProvision\n3\n \n2\n \n1\n \n6\n \nNon-cash activity\n— \n(\n2\n)\n—\n \n(\n2\n)\nUtilization and other\n(a)\n(\n12\n)\n— \n(\n2\n)\n(\n14\n)\nBalance, December 31, 2022\n$\n14\n \n$\n— \n$\n1\n \n$\n15\n \nProvision\n41\n \n1\n \n4\n \n46\n \nNon-cash activity\n—\n \n(\n1\n)\n—\n \n(\n1\n)\nUtilization and other\n(a)\n(\n23\n)\n— \n(\n2\n)\n(\n25\n)\nBalance, December 31, 2023\n(b)\n$\n32\n \n$\n— \n$\n3\n \n$\n35\n \nProvision\n43\n \n—\n \n—\n \n43\n \nReserve adjustment\n(\n7\n)\n—\n \n—\n \n(\n7\n)\nUtilization and other\n(a)\n(\n42\n)\n—\n \n(\n1\n)\n(\n43\n)\nBalance, December 31, 2024\n(b)(c)\n$\n26\n \n$\n—\n \n$\n2\n \n$\n28\n \n(a)\n    \nIncludes adjustments for foreign currency translation. \n(b)\n    \nAt December 31, 2024 and 2023, included in \nAccrued Expenses \n($\n26\n million) and\n Other noncurrent liabilities \n($\n2\n million and $\n9\n million, respectively).\n(c)\n    Includes contractual obligations of $\n28\n million, of which payments are expected to be approximately $\n26\n million in 2025 and $\n2\n million thereafter.\n7.     Other (Income)/Deductions—Net \nThe components of \nOther (income)/deductions—net\n follow: \nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nRoyalty-related income\n(a)\n$\n(\n5\n)\n$\n(\n37\n)\n$\n(\n4\n)\nInterest income\n(\n106\n)\n(\n105\n)\n(\n50\n)\nIdentifiable intangible asset impairment charges\n(b)\n15\n \n35\n \n39\n \nOther asset impairment charges\n—\n \n1\n \n7\n \nNet loss/(gain) on sale of businesses\n(c)\n23\n \n(\n101\n)\n—\n \nForeign currency loss\n(d)\n50\n \n47\n \n62\n \nOther, net\n4\n \n1\n \n(\n14\n)\nOther (income)/deductions—net\n$\n(\n19\n)\n$\n(\n159\n)\n$\n40\n \n(a)\n    For 2023, primarily associated with a settlement received from a third-party for underpayment of royalties related to prior periods.\n(b)    \nFor 2024, primarily represents asset impairment charges related to our aquaculture business.\nFor 2023, p\nrimarily re\npresents certain asset impairment charges related to our precision animal health and diagnostics businesses. \nFor 2022, primarily represents asset impairment charges related to customer relationships and developed technology rights in our diagnostics, poultry, cattle and swine businesses.\n(c)\n    For 2024, primarily represents a net loss related to the sale of our medicated feed additive product portfolio, certain water soluble products and related assets. For additional information, see \nNote 5. Acquisitions and Divestitures\n.\n            \nFor 2023, primarily relates to the gain on sale of a majority interest in our pet insurance business. For additional information, see \nNote 5. Acquisitions and Divestitures\n.\n(d)\n    \nPrimarily driven by costs related to hedging and exposures to certain developed and emerging market currencies.\n8.     Tax Matters  \nA.    Taxes on Income\n \nThe income tax provision in the Consolidated Statements of Income includes tax costs and benefits, such as uncertain tax positions, repatriation decisions and audit settlements, among others.\n71 |\nTable of Contents\nThe components of \nIncome before provision for taxes on income\n follow:\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nUnited States\n$\n1,867\n \n$\n1,636\n \n$\n1,645\n \nInternational\n1,266\n \n1,300\n \n1,011\n \nIncome before provision for taxes on income\n$\n3,133\n \n$\n2,936\n \n$\n2,656\n \nThe components of \nProvision for taxes on income\n based on the location of the taxing authorities follow:\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nUnited States:\nCurrent income taxes:\nFederal\n$\n645\n \n$\n341\n \n$\n514\n \nState and local\n65\n \n35\n \n81\n \nDeferred income taxes:\nFederal\n(\n297\n)\n(\n40\n)\n(\n198\n)\nState and local\n(\n42\n)\n25\n \n(\n49\n)\nTotal U.S. tax provision\n371\n \n361\n \n348\n \nInternational:\nCurrent income taxes\n265\n \n281\n \n235\n \nDeferred income taxes\n1\n \n(\n46\n)\n(\n38\n)\nTotal international tax provision\n266\n \n235\n \n197\n \nProvision for taxes on income\n$\n637\n \n$\n596\n \n$\n545\n \nTax Rate Reconciliation \nThe reconciliation of the U.S. statutory income tax rate to our effective tax rate follows:\nYear Ended December 31,\n2024\n2023\n2022\nU.S. statutory income tax rate\n21\n \n%\n21\n \n%\n21\n \n%\nState and local taxes, net of federal benefits\n0.6\n \n1.6\n \n0.9\n \nUnrecognized tax benefits and tax settlements and resolution of certain tax positions\n(a)\n0.4\n \n0.9\n \n0.1\n \nForeign Derived Intangible Income\n(\n1.5\n)\n(\n0.7\n)\n(\n0.2\n)\nU.S. Research and Development Tax Credit \n(\n0.6\n)\n(\n0.7\n)\n(\n0.7\n)\nShare-based payments\n(\n0.2\n)\n(\n0.3\n)\n(\n0.6\n)\nNon-deductible / non-taxable items\n0.2\n \n0.2\n \n0.1\n \nTaxation of non-U.S. operations\n0.2\n \n(\n0.8\n)\n(\n0.4\n)\nAll other—net\n0.2\n \n(\n0.9\n)\n0.3\n \nEffective tax rate \n20.3\n \n%\n20.3\n \n%\n20.5\n \n%\n(a)\n    \nFor a discussion about unrecognized tax benefits and tax settlements and resolution of certain tax positions, see \nC. Tax Contingencies\n.\n \nOur effective income tax rate was \n20.3\n%, \n20.3\n% and \n20.5\n% in 2024, 2023 and 2022, respectively. \nThe effective tax rate for 2024, as compared to 2023, was primarily attributable to the favorable impact of a higher benefit in the U.S. related to foreign-derived intangible income and lower net discrete tax expenses, offset by a less favorable jurisdictional mix of earnings (which includes the impact of the location of earnings, repatriation costs and Pillar Two global minimum tax). Jurisdictional mix of earnings can vary depending on repatriation decisions, operating fluctuations in the normal course of business and the impact of non-deductible items and non-taxable items.\nThe global minimum tax provisions (Pillar Two) resulting from the Organisation for Economic Co-operation and Development (OECD) Base Erosion and Profit Shifting project are effective beginning in 2024 and the impact of these provisions is included in our effective tax rate for 2024.\nThe lower effective tax rate for 2023, as compared to 2022, was primarily attributable to a higher benefit in the U.S. related to foreign-derived intangible income, a more favorable jurisdictional mix of earnings (which includes the impact of the location of earnings and repatriation costs), partially offset by a higher net discrete tax expense in 2023, mainly related to changes to prior years’ tax positions. Jurisdictional mix of earnings can vary depending on repatriation decisions, operating fluctuations in the normal course of business and the impact of non-deductible items and non-taxable items.\nIn 2022 and 2024, the company implemented an initiative to maximize its cash position in the U.S. This initiative resulted in a tax benefit in the U.S. in connection with a prepayment from a related foreign entity in Belgium which qualifies as foreign-derived intangible income; however, the 2022 income tax benefit was deferred to 2023 and 2024 and the 2024 income tax benefit was deferred to 2025 and 2026. A portion of the 2022 benefit was recognized during 2024. The remaining deferred benefit is included in \nOther current assets\n on our Consolidated Balance Sheets as of December 31, 2024 in the amount of $\n43\n million.\n72 |\nTable of Contents\nB.    Deferred Taxes\nDeferred taxes arise as a result of basis differentials between financial statement accounting and tax amounts.\nThe components of our deferred tax assets and liabilities follow:\nAs of December 31,\n2024\n2023\n(MILLIONS OF DOLLARS)\nAssets (Liabilities)\nPrepaid/deferred items\n$\n219\n \n$\n72\n \nInventories\n21\n \n30\n \nCapitalized research and development for tax\n301\n \n224\n \nIdentifiable intangible assets\n(\n103\n)\n(\n154\n)\nProperty, plant and equipment\n(\n179\n)\n(\n199\n)\nEmployee benefits\n74\n \n62\n \nRestructuring and other charges\n10\n \n(\n1\n)\nLegal and product liability reserves\n14\n \n12\n \nNet operating loss/credit carryforwards\n139\n \n133\n \nUnremitted earnings\n(\n3\n)\n(\n4\n)\nAll other\n3\n \n16\n \nSubtotal\n496\n \n191\n \nValuation allowance\n(\n123\n)\n(\n131\n)\nNet deferred tax asset/(liability)\n(a)(b)\n$\n373\n \n$\n60\n \n(a)\n    \nThe change in the total net deferred tax asset/(liability) from December 31, 2023 to December 31, 2024 is primarily attributable to an increase in deferred tax assets related to (i) prepaid/deferred items as a result of a prepayment from a related foreign entity in Belgium; and (ii) the capitalization and amortization of research and development costs for U.S. tax purposes, as well as a decrease in deferred tax liabilities related to identifiable intangible assets.\n(b)\n    \nIn 2024, included in \nNoncurrent deferred tax assets\n ($\n540\n million) and \nNoncurrent deferred tax liabilities\n ($\n167\n million). In 2023, included in \nNoncurrent deferred tax assets\n ($\n206\n million) and \nNoncurrent deferred tax liabilities\n ($\n146\n million).\n \nWe have carryforwards, primarily related to net operating losses, which are available to reduce future foreign, U.S. federal, and U.S. state income taxes payable with either an indefinite life or expiring at various times from 2025 to 2044. \nValuation allowances are provided when we believe that our deferred tax assets are not recoverable based on an assessment of estimated future taxable income that incorporates ongoing, prudent and feasible tax planning strategies. On the basis of this evaluation, as of December 31, 2024 and 2023, a valuation allowance of $\n123\n million and $\n131\n million, respectively, has been recorded to reflect only the portion of the deferred tax asset that is more likely than not to be realized. The amount of the deferred tax asset considered realizable, however, could be adjusted if estimates of future taxable income during the carryforward period are reduced or increased or if objective negative evidence in the form of cumulative losses is no longer present and additional weight may be given to subjective evidence such as projections for growth.\nIn general, it is our practice and intention to permanently reinvest the majority of the earnings of the company’s non-U.S. subsidiaries. As of December 31, 2024, the cumulative amount of such undistributed earnings was approximately $\n8.5\n billion, for which we have not provided U.S. and local income taxes, such as U.S. state income taxes, local withholding taxes, and taxes on currency gains and losses. Since these earnings are intended to be indefinitely reinvested overseas as of December 31, 2024, we cannot predict the time or manner of a potential repatriation. As such, other than the deferred tax liability associated with the one-time mandatory deemed repatriation tax on such undistributed earnings imposed by the Tax Cuts and Jobs Act of 2017, it is not practicable to estimate the additional deferred tax liability associated with the potential repatriation of the unremitted earnings. \nC.    Tax Contingencies\nWe are subject to income tax in many jurisdictions, and a certain degree of estimation is required in recording the assets and liabilities related to income taxes. All of our tax positions are subject to audit by the local taxing authorities in each tax jurisdiction. These tax audits can involve complex issues, interpretations and judgments\n \nand the resolution of matters may span multiple years, particularly if subject to negotiation or litigation. Our assessments are based on estimates and assumptions that have been deemed reasonable by management, but our estimates of unrecognized tax benefits and potential tax benefits may not be representative of actual outcomes, and variation from such estimates could materially affect our financial statements in the period of settlement or when the statute of limitations expire. We treat these events as discrete items in the period of resolution.\nFor a\n \ndescription of our accounting policies associated with accounting for income tax contingencies, see \nNote 3. Significant Accounting Policies: Deferred Tax Assets and Liabilities and Income Tax Contingencies. \nFor a description of the risks associated with estimates and assumptions, see \nNote 3. Significant Accounting Policies: Estimates and Assumptions.\n \nUncertain Tax Positions \nAs tax law is complex and often subject to varied interpretations, it is uncertain whether some of our tax positions will be sustained upon audit. As of December 31, 2024\n, \n2023 and 2022, we had approximately $\n214\n million\n, \n$\n209\n million and $\n192\n million, respectively, in net liabilities associated with uncertain tax positions, excluding associated interest and penalties. As of December 31, 2024, 2023 and 2022, we had approximately $\n1\n million, \n73 |\nTable of Contents\n$\n0\n million and $\n11\n million, respectively, in assets associated with uncertain tax benefits recorded in \nNoncurrent deferred tax assets\n and \nOther noncurrent assets\n. \n•\nTax liabilities associated with uncertain tax positions represent unrecognized tax benefits, which arise when the estimated benefit recorded in our financial statements differs from the amounts taken or expected to be taken in a tax return because of the uncertainties described above. These unrecognized tax benefits relate primarily to issues common among multinational corporations. Substantially all of these unrecognized tax benefits, if recognized, would impact our effective income tax rate. \nThe reconciliation of the beginning and ending amounts of gross unrecognized tax benefits follows: \n \n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nBalance, January 1\n$\n(\n209\n)\n$\n(\n194\n)\n$\n(\n189\n)\nIncreases based on tax positions taken during a prior period\n(a)\n(\n1\n)\n(\n27\n)\n(\n20\n)\nDecreases based on tax positions taken during a prior period\n(a)\n—\n \n20\n \n9\n \nIncreases based on tax positions taken during the current period\n(a)\n(\n7\n)\n(\n13\n)\n(\n4\n)\nSettlements\n1\n \n—\n \n7\n \nLapse in statute of limitations\n(a)\n3\n \n5\n \n3\n \nBalance, December 31\n(b)\n$\n(\n213\n)\n$\n(\n209\n)\n$\n(\n194\n)\n(a)    \nPrimarily included in \nProvision for taxes on income.\n \n(b)    \nIn 2024, included in \nOther taxes payable\n ($\n213\n million). In 2023, included in \nOther taxes payable\n ($\n209\n million). In 2022, included in \nNoncurrent deferred tax assets\n and \nOther noncurrent assets \n($\n2\n million) and \nOther taxes payable\n ($\n192\n million).\n•\nInterest related to our unrecognized tax benefits is recorded in accordance with the laws of each jurisdiction and is recorded in \nProvision for taxes on income\n in our Consolidated Statements of Income. We recorded net interest expense of $\n12\n million, $\n10\n million and $\n4\n million in 2024, 2023 and 2022, respectively. Gross accrued interest totaled $\n37\n million, $\n26\n million and $\n16\n million as of December 31, 2024, 2023 and 2022, respectively, and were included in \nOther taxes payable\n. As of December 31, 2024, 2023 and 2022, gross accrued penalties totaled $\n1\n million, $\n1\n million and $\n3\n million, respectively, and were included in \nOther taxes payable\n.\nStatus of Tax Audits and Potential Impact on Accruals for Uncertain Tax Positions\nWe are subject to taxation in the U.S. including various states, and foreign jurisdictions. The U.S. is one of our major tax jurisdictions, and we are currently under income tax audit by the U.S. Internal Revenue Service (IRS) for tax years 2017 through 2018. For U.S. state tax purposes, tax years 2017 through 2024 are open for examination. In July 2024, the IRS issued Notices of Proposed Adjustment (NOPA) related to the one-time mandatory deemed repatriation tax incurred on the 2018 U.S. Federal Income Tax return. In September 2024, the IRS issued a Revenue Agent Report (RAR) for the adjustments identified in the NOPA and a protest was filed with the IRS on November 15, 2024. As of December 31, 2024, the additional tax liability, based on the income adjustment proposed by the IRS under the RAR, is approximately $450 million, excluding interest and penalties.\nBased on current facts and circumstances, we disagree with the IRS' position and will defend our position taken on the 2018 U.S. Federal Income tax return. We believe the amount previously accrued related to this uncertain tax position remains appropriate, but we will continue to evaluate the adequacy of our tax reserve as the audit progresses. However, the outcome of the tax audits cannot be predicted with certainty. If any issues addressed in our tax audits are not consistent with management's expectations, we could be required to adjust our provision for income taxes and this amount could be material to our financial statements.\nIn addition to the open audit years in the U.S., we have open audit years in other major foreign tax jurisdictions, such as Canada (2021-2024), Asia-Pacific (2015-2024, primarily reflecting Australia\n,\n China and Japan), Europe (2012-2024, primarily reflecting France, Germany, Italy, Spain and the U.K.) and Latin America (2016-2024, primarily reflecting Brazil and Mexico).\nAny settlements or statute of limitations expirations could result in a significant decrease in our uncertain tax positions. We do not expect that within the next twelve months any of our gross unrecognized tax benefits, exclusive of interest, could significantly decrease as a result of settlements with taxing authorities or the expiration of the statutes of limitations. Our assessments are based on estimates and assumptions that have been deemed reasonable by management, but our estimates of unrecognized tax benefits and potential tax benefits may not be representative of actual outcomes, and any variation from such estimates could materially affect our financial statements in the period of settlement or when the statutes of limitations expire, as we treat these events as discrete items in the period of resolution. Finalizing audits with the relevant taxing authorities can include formal administrative and legal proceedings, and, as a result, it is difficult to estimate the timing and range of possible change related to our uncertain tax positions, and such changes could be significant.\n \n9.     Financial Instruments \nA.    Debt\nCredit Facilities\nIn December 2022, we entered into an amended and restated revolving credit agreement with a syndicate of banks providing for a multi-year $\n1.0\n billion senior unsecured revolving credit facility (the credit facility), which expires in December 2027. Subject to certain conditions, we have the right to increase the credit facility up to $\n1.5\n billion. The credit facility contains a financial covenant requiring us to not exceed a maximum total leverage ratio (the ratio of consolidated net debt as of the end of the period to consolidated Earnings Before Interest, Income Taxes, Depreciation and Amortization (EBITDA) for such period) of \n3.50\n:1. Upon entering into a material acquisition, the maximum total leverage ratio increases to \n4.00\n:1, and extends until the fourth full consecutive fiscal quarter ended immediately following the consummation of a material acquisition. In addition, the credit facility contains other customary covenants.\n74 |\nTable of Contents\nWe were in compliance with all financial covenants as of December 31, 2024 and 2023. There were \nno\n amounts drawn under the credit facility as of December 31, 2024 and 2023.\nWe have additional lines of credit and other credit arrangements with a group of banks and other financial intermediaries for general corporate purposes. We maintain cash and cash equivalent balances in excess of our outstanding short-term borrowings. As of December 31, 2024, we had access to $\n50\n million of lines of credit which expire at various times and are generally renewed annually. As of December 31, 2024 we had no  borrowings outstanding related to these facilities and $\n3\n million borrowings outstanding related to these facilities as of December 31, 2023. \nCommercial Paper Program\nIn February 2013, we entered into a commercial paper program with a capacity of up to $\n1.0\n billion. As of December 31, 2024 and 2023, there was \nno\n commercial paper outstanding under this program. \nSenior Notes and Other Long-Term Debt\nOn November 8, 2022, we issued $\n1.35\n billion aggregate principal amount of our senior notes (2022 senior notes), with an original issue discount of $\n2\n million. These notes are comprised of $\n600\n million aggregate principal amount of \n5.400\n% senior notes due 2025 and $\n750\n million aggregate principal amount of \n5.600\n% senior notes due 2032. On February 1, 2023, the net proceeds were used to redeem in full, upon maturity, the $\n1.35\n billion aggregate principal amount of our \n3.250\n% 2013 senior notes due 2023.\nOur senior notes are governed by an indenture and supplemental indentures (collectively, the indenture) between us and Deutsche Bank Trust Company Americas, as trustee. The indenture contains certain covenants, including limitations on our and certain of our subsidiaries' ability to incur liens or engage in sale lease-back transactions. The indenture also contains restrictions on our ability to consolidate, merge or sell substantially all of our assets. In addition, the indenture contains other customary terms, including certain events of default, upon the occurrence of which the senior notes may be declared immediately due and payable.\nPursuant to the indenture, we are able to redeem the senior notes of any series, in whole or in part, at any time by paying a “make whole” premium, plus accrued and unpaid interest to, but excluding, the date of redemption. Upon the occurrence of a change of control of us and a downgrade of the senior notes below an investment grade rating by each of Moody's Investors Service, Inc. and Standard & Poor's Ratings Services, we are, in certain circumstances, required to make an offer to repurchase all of the outstanding senior notes at a price equal to \n101\n% of the aggregate principal amount of the senior notes together with accrued and unpaid interest to, but excluding, the date of repurchase.\nThe components of our long-term debt are as follows:\nAs of December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n4.500\n% 2015 senior notes due 2025\n$\n750\n \n$\n750\n \n5.400\n% 2022 senior notes due 2025\n600\n \n600\n \n3.000\n% 2017 senior notes due 2027\n750\n \n750\n \n3.900\n% 2018 senior notes due 2028\n500\n \n500\n \n2.000\n% 2020 senior notes due 2030\n750\n \n750\n \n5.600\n% 2022 senior notes due 2032\n750\n \n750\n \n4.700\n% 2013 senior notes due 2043\n1,150\n \n1,150\n \n3.950\n% 2017 senior notes due 2047\n500\n \n500\n \n4.450\n% 2018 senior notes due 2048\n400\n \n400\n \n3.000\n% 2020 senior notes due 2050\n500\n \n500\n \n6,650\n \n6,650\n \nUnamortized debt discount / debt issuance costs\n(\n54\n)\n(\n60\n)\nLess current portion of long-term debt\n1,350\n \n—\n \nCumulative fair value adjustment for interest rate swap contracts\n(\n26\n)\n(\n26\n)\nLong-term debt, net of discount and issuance costs\n$\n5,220\n \n$\n6,564\n \nThe fair value of our long-term debt was $\n6,097\n million and $\n6,319\n million as of December 31, 2024 and 2023, respectively, and has been determined using a third-party model that uses significant inputs derived from, or corroborated by, observable market data and Zoetis’ credit rating (Level 2 inputs). See \nNote 3. Significant Accounting Policies— Fair Value.\n \nThe following table provides the principal amount of debt outstanding as of December 31, 2024 by scheduled maturity date. The table also provides the expected interest payments on these borrowings as of December 31, 2024.\nAfter\n(MILLIONS OF DOLLARS)\n2025\n2026\n2027\n2028\n2029\n2029\nTotal\nMaturities\n$\n1,350\n \n$\n—\n \n$\n750\n \n$\n500\n \n$\n—\n \n$\n4,050\n \n$\n6,650\n \nInterest payments \n$\n272\n \n$\n206\n \n$\n206\n \n$\n183\n \n$\n164\n \n$\n1,863\n \n$\n2,894\n \nInterest Expense\nInterest expense, net of capitalized interest, was $\n225\n million, $\n239\n million and $\n221\n million for 2024, 2023 and 2022, respectively. Capitalized interest expense was $\n39\n million, $\n27\n million and $\n21\n million for 2024, 2023 and 2022, respectively.\n75 |\nTable of Contents\nB.    Derivative Financial Instruments\nForeign Exchange Risk\nA significant portion of our revenue, earnings and net investment in foreign affiliates is exposed to changes in foreign exchange rates. We seek to manage our foreign exchange risk, in part, through operational means, including managing same-currency revenue in relation to same-currency costs and same-currency assets in relation to same-currency liabilities. Depending on market conditions, foreign exchange risk is also managed through the use of various derivative financial instruments. These derivative financial instruments serve to manage the exposure of our net investment in certain foreign operations to changes in foreign exchange rates and protect net income against the impact of translation into U.S. dollars of certain foreign exchange-denominated transactions.\n \nAll derivative financial instruments used to manage foreign currency risk are measured at fair value and are reported as assets or liabilities on the Consolidated Balance Sheets. The derivative financial instruments primarily offset exposures in the Australian dollar, British pound, Canadian dollar, Chinese renminbi, euro and Norwegian krone. Changes in fair value are reported in earnings or in \nAccumulated other comprehensive loss\n, depending on the nature and purpose of the financial instrument, as follows: \n•\nFor foreign currency forward-exchange contracts not designated as hedging instruments, we recognize the gains and losses that are used to offset the same foreign currency assets or liabilities immediately into earnings along with the earnings impact of the items they generally offset. These contracts essentially take the opposite currency position of that reflected in the month-end balance sheet to counterbalance the effect of any currency movement. The vast majority of the foreign currency forward-exchange contracts mature within \n60\n days and all mature within \nthree years\n.\n•\nFor foreign exchange derivative instruments that are designated as hedging instruments against our net investment in foreign operations, changes in the fair value are recorded as a component of cumulative translation adjustment within \nAccumulated other comprehensive loss \nand reclassified into earnings when the foreign investment is sold or substantially liquidated. These instruments include cross-currency interest rate swaps and foreign currency forward-exchange contracts. Gains and losses excluded from the assessment of hedge effectiveness are recognized in earnings (\nInterest expense—net of capitalized interest)\n. The cash flows from these contracts are reflected within the investing section of our Consolidated Statements of Cash Flows\n.\n These contracts have varying maturities of up to \nthree years\n.\nInterest Rate Risk\nThe company may use interest rate swap contracts on certain investing and borrowing transactions to manage its net exposure to interest rates and to reduce its overall cost of borrowing. \n•\nIn anticipation of issuing fixed-rate debt, we may use forward-starting interest rate swaps that are designated as cash flow hedges to hedge against changes in interest rates that could impact expected future issuances of debt. Unrealized gains or losses on the forward-starting interest rate swaps are reported in \nAccumulated other comprehensive loss\n and are recognized in earnings over the life of the future fixed rate notes. When the company discontinues hedge accounting because it is no longer probable that an anticipated transaction will occur within the originally expected period of execution, or within an additional two-month period thereafter, changes to fair value accumulated in other comprehensive income are recognized immediately in earnings.\n•\nDuring the period from 2019 to 2022, we entered into forward-starting interest rate swaps with an aggregate notional value of $\n650\n million. We designated these swaps as cash flow hedges against interest rate exposure related principally to the issuance of fixed-rate debt to refinance our \n3.250\n% 2013 senior notes due 2023. Upon issuance of our 2022 senior notes, we terminated these contracts and received $\n114\n million in cash from the counterparties for settlement, included in \nNet cash provided by operating activities\n in the Consolidated Statements of Cash Flows. The settlement amount, which represented the fair value of the contracts at the time of termination, was recorded in \nAccumulated other comprehensive loss\n, and will be amortized into income over the life of the \n5.600\n% 2022 senior notes due 2032. \n•\nAs of December 31, 2024, we had outstanding forward-starting interest rate swaps, having an effective date and mandatory termination date in March 2026, to hedge against interest rate exposure related principally to the anticipated future issuance of fixed-rate debt to be used primarily to refinance our \n4.500\n% 2015 senior notes due 2025.\n•\nWe may use fixed-to-floating interest rate swaps that are designated as fair value hedges to hedge against changes in the fair value of certain fixed-rate debt attributable to changes in the benchmark the Secured Overnight Financing Rate (SOFR). These derivative instruments effectively convert a portion of the company’s long-term debt from fixed-rate to floating-rate debt based on the daily SOFR rate plus a spread. Gains or losses on the fixed-to-floating interest rate swaps due to changes in SOFR are recorded in \nInterest expense, net of capitalized interest.\n Changes in the fair value of the fixed-to-floating interest rate swaps are offset by changes in the fair value of the underlying fixed-rate debt. As of December 31, 2024, we had outstanding fixed-to-floating interest rate swaps that correspond to a portion of the \n3.900\n% 2018 senior notes due 2028 and the \n2.000\n% 2020 senior notes due 2030. The amounts recorded during 2024 for changes in the fair value of these hedges are not material to our consolidated financial statements. \nDuring the first quarter of 2023, we executed amendments to certain of our interest rate swap contract, which changed the floating rate index from LIBOR to SOFR. These amendments did not have a material impact on our consolidated financial statements.\n76 |\nTable of Contents\nOutstanding Positions\nThe aggregate notional amount of derivative instruments are as follows:\nNotional \nAs of December 31,\n(MILLIONS)\n2024\n2023\nDerivatives not Designated as Hedging Instruments\n     Foreign currency forward-exchange contracts\n$\n2,070\n \n$\n1,948\n \nDerivatives Designated as Hedging Instruments\n     Foreign exchange derivative instruments (in foreign currency):\n         Euro\n800\n \n650\n \n         Danish krone\n475\n \n600\n \n         Swiss franc\n25\n \n25\n \n     Forward-starting interest rate swaps \n$\n300\n \n$\n100\n \n     Fixed-to-floating interest rate swap contracts\n$\n250\n \n$\n250\n \nFair Value of Derivative Instruments\nThe classification and fair values of derivative instruments are as follows:\nFair Value of Derivatives\nAs of December 31,\n(MILLIONS OF DOLLARS)\nBalance Sheet Location\n2024\n2023\nDerivatives Not Designated as Hedging Instruments:\n   Foreign currency forward-exchange contracts\nOther current assets\n$\n18\n \n$\n11\n \n   Foreign currency forward-exchange contracts\nOther current liabilities \n(\n6\n)\n(\n11\n)\nTotal derivatives not designated as hedging instruments\n12\n \n—\n \nDerivatives Designated as Hedging Instruments:\n   Forward-starting interest rate swap contracts\nOther non-current assets\n$\n26\n \n$\n12\n \n   Foreign exchange derivative instruments\nOther current assets\n55\n \n5\n \n   Foreign exchange derivative instruments\nOther non-current assets\n4\n \n11\n \n   Foreign exchange derivative instruments\nOther current liabilities\n—\n \n(\n20\n)\n   Foreign exchange derivative instruments\nOther non-current liabilities\n—\n \n(\n1\n)\n   Fixed-to-floating interest rate swap contracts\nOther non-current liabilities\n(\n26\n)\n(\n26\n)\nTotal derivatives designated as hedging instruments\n59\n \n(\n19\n)\nTotal derivatives\n$\n71\n \n$\n(\n19\n)\nThe company’s derivative transactions are subject to master netting agreements that mitigate credit risk by permitting net settlement of transactions with the same counterparty. The company also has collateral security agreements with certain of its counterparties. Under these collateral security agreements either party is required to post cash collateral when the net fair value of derivative instruments covered by the collateral agreement exceeds contractually established thresholds. At December 31, 2024, there was $\n51\n million of collateral received and $\n20\n million posted related to derivative instruments recorded in \nOther current liabilities\n and \nOther current assets\n, respectively. At December 31, 2023, there was $\n13\n million of collateral received and $\n33\n million of collateral posted related to derivative instruments recorded in \nOther current liabilities\n and \nOther current assets, \nrespectively.\nWe use a market approach in valuing financial instruments on a recurring basis. Our derivative financial instruments are measured at fair value on a recurring basis using Level 2 inputs in the calculation of fair value. See \nNote 3. Significant Accounting Policies— Fair Value.\n \nThe amounts of net losses on derivative instruments not designated as hedging instruments, recorded in\n Other (income)/deductions - net, \nare as follows:\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\nForeign currency forward-exchange contracts\n$\n(\n11\n)\n$\n(\n25\n)\nThese amounts were substantially offset in \nOther (income)/deductions—net \nby the effect of changing exchange rates on the underlying foreign currency exposures.\nThe amounts of unrecognized net gains/(losses) on interest rate swap contracts, recorded, net of tax, in \nAccumulated other comprehensive loss\n, are as follows:\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\nForward starting interest rate swap contracts\n$\n11\n \n$\n2\n \nForeign exchange derivative instruments\n$\n44\n \n$\n(\n23\n)\n77 |\nTable of Contents\nGains on interest rate swap contracts, recognized within \nInterest expense, net of capitalized interest, \nare as follows:\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\nForeign exchange derivative instruments\n$\n17\n \n$\n19\n \nThe net amount of deferred losses related to derivative instruments designated as cash flow hedges that is expected to be reclassified from\n \nAccumulated other comprehensive loss\n into earnings over the next 12 months is not material.\n10.   Leases\n \nWe have facilities and vehicles under various non-cancellable operating leases with third parties and an equipment finance lease with a third party. The operating leases generally have remaining terms ranging from \n1\n to \n14\n years, inclusive of renewal options that are reasonably certain of exercise. The finance lease has a remaining term of \n29\n years.\nSupplemental information for our lease portfolio is as follows:\nAs of December 31,\n(MILLIONS OF DOLLARS, EXCEPT LEASE TERM AND DISCOUNT RATE AMOUNTS)\n2024\n2023\nSupplemental Balance Sheet information:\nOperating lease right-of-use assets\n$\n219\n \n$\n230\n \nFinance lease right of use assets (in \nOther noncurrent assets\n)\n9\n \n9\n \nTotal lease assets\n$\n228\n \n$\n239\n \nLease liabilities:\nOperating lease liabilities - current (in \nOther current liabilities\n)\n$\n51\n \n$\n48\n \nFinance lease liabilities - current (in \nOther current liabilities\n)\n1\n \n1\n \nOperating lease liabilities - noncurrent\n174\n \n188\n \nFinance lease liabilities - noncurrent (in \nOther noncurrent liabilities\n)\n7\n \n8\n \nTotal lease liabilities\n$\n233\n \n$\n245\n \nWeighted-average remaining lease term—operating leases (years)\n6.57\n7.26\nWeighted-average remaining lease term—finance leases (years)\n29.19\n30.27\nWeighted-average discount rate—operating leases\n3.65\n \n%\n3.41\n \n%\nWeighted-average discount rate—finance leases\n4.97\n \n%\n4.99\n \n%\nYear Ended December 31, \n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nSupplemental Income Statement information for operating leases:\nOperating lease expense\n$\n59\n \n$\n56\n \n$\n51\n \nVariable lease costs\n18\n \n20\n \n12\n \nShort-term lease costs not included in the measurement of lease liabilities\n13\n \n11\n \n12\n \nSupplemental Income Statement information for finance leases:\nAmortization of right-of-use assets\n1\n \n1\n \n—\n \nTotal lease costs\n$\n91\n \n$\n88\n \n$\n75\n \nSupplemental Cash Flow information for leases\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows – operating leases\n$\n61\n \n$\n57\n \n$\n51\n \nFinancing cash flows – finance leases\n1\n \n—\n \n—\n \nLease obligations obtained in exchange for right-of-use assets - operating (non-cash)\n46\n \n73\n \n99\n \nLease obligations obtained in exchange for right-of-use assets – finance (non-cash)\n—\n \n9\n \n—\n \n78 |\nTable of Contents\nFuture minimum lease payments under non-cancellable lease contracts as of December 31, 2024 are as follows:\nTotal\nLess:\nAfter\nLease\nImputed\n(MILLIONS OF DOLLARS)\n2025\n2026\n2027\n2028\n2029\n2029\nPayments\nInterest\nTotal\nOperating leases\n$\n59\n \n$\n50\n \n$\n39\n \n$\n29\n \n$\n18\n \n$\n63\n \n$\n258\n \n$\n(\n33\n)\n$\n225\n \nFinance leases\n$\n1\n \n$\n1\n \n$\n1\n \n$\n1\n \n$\n1\n \n$\n7\n \n$\n12\n \n$\n(\n4\n)\n$\n8\n \n11.   Inventories \nThe components of inventory follow: \nAs of December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\nFinished goods\n$\n996\n \n$\n1,147\n \nWork-in-process\n933\n \n966\n \nRaw materials and supplies\n377\n \n451\n \nInventories\n$\n2,306\n \n$\n2,564\n \n12.   Property, Plant and Equipment\nThe components of property, plant and equipment follow:\nUseful Lives\nAs of December 31,\n(MILLIONS OF DOLLARS)\n(Years)\n2024\n2023\nLand\n—\n$\n28\n \n$\n25\n \nBuildings\n33\n \n1,292\n \n1,316\n \nMachinery, equipment and fixtures\n3\n - \n20\n3,353\n \n3,372\n \nConstruction-in-progress\n—\n1,353\n \n1,085\n \n6,026\n \n5,798\n \nLess: Accumulated depreciation\n2,635\n \n2,594\n \nProperty, plant and equipment\n$\n3,391\n \n$\n3,204\n \nDepreciation expense was $\n327\n million in 2024, $\n306\n million in 2023 and $\n272\n million in 2022.\n13.   Goodwill and Other Intangible Assets \nA.    Goodwill\nThe components of, and changes in, the carrying amount of goodwill follow: \n(MILLIONS OF DOLLARS)\nU.S.\nInternational\nTotal\nBalance, December 31, 2022\n$\n1,485\n \n$\n1,261\n \n$\n2,746\n \nAdditions\n(a)\n24\n \n14\n \n38\n \nTransfers/Adjustments\n(b)\n25\n \n(\n34\n)\n(\n9\n)\nOther\n(c)\n(\n2\n)\n(\n14\n)\n(\n16\n)\nBalance, December 31, 2023\n$\n1,532\n \n$\n1,227\n \n$\n2,759\n \nOther\n(c)\n(\n17\n)\n(\n18\n)\n(\n35\n)\nBalance, December 31, 2024\n$\n1,515\n \n$\n1,209\n \n$\n2,724\n \n(a)\n     Primarily relates to the acquisitions of PetMedix and adivo. See \nNote 5. Acquisitions and Divestitures.\n(b)      \nPrimarily relates to asset transfers from international markets to the U.S. \n(c)      \nIncludes adjustments for foreign currency translation. \nFor 2024, also includes adjustments for the derecognition of goodwill of $\n24\n million related to the sale of our medicated feed additive product portfolio, certain water soluble products and related assets. S\nee \nNote 5. Acquisitions and Divestitures. \nFor 2023, also includes the sale of a majority interest in our pet insurance business within our U.S. segment.\nThe gross goodwill balance was $\n3,260\n million as of December 31, 2024 and $\n3,295\n million as of December 31, 2023. Accumulated goodwill impairment losses were $\n536\n million as of December 31, 2024 and 2023.\n79 |\nT\nable of Contents\nB.    Other Intangible Assets\nThe components of identifiable intangible assets follow: \nAs of December 31, 2024\nAs of December 31, 2023\nIdentifiable\nIdentifiable\nGross\nIntangible Assets,\nGross\nIntangible Assets,\nCarrying\nAccumulated\nLess Accumulated\nCarrying\nAccumulated\nLess Accumulated\n(MILLIONS OF DOLLARS)\nAmount\nAmortization\nAmortization\nAmount\nAmortization\nAmortization\nFinite-lived intangible assets:\nDeveloped technology rights\n(a)\n$\n1,891\n \n$\n(\n1,175\n)\n$\n716\n \n$\n1,986\n \n$\n(\n1,101\n)\n$\n885\n \nBrands and tradenames\n(a)\n367\n \n(\n246\n)\n121\n \n383\n \n(\n246\n)\n137\n \nOther\n278\n \n(\n197\n)\n81\n \n270\n \n(\n190\n)\n80\n \nTotal finite-lived intangible assets\n2,536\n \n(\n1,618\n)\n918\n \n2,639\n \n(\n1,537\n)\n1,102\n \nIndefinite-lived intangible assets:\nBrands and tradenames\n(a)\n66\n \n—\n \n66\n \n88\n \n— \n88\n \nIn-process research and development\n136\n \n—\n \n136\n \n141\n \n— \n141\n \nProduct rights\n7\n \n—\n \n7\n \n7\n \n— \n7\n \nTotal indefinite-lived intangible assets\n209\n \n—\n \n209\n \n236\n \n— \n236\n \nIdentifiable intangible assets\n$\n2,745\n \n$\n(\n1,618\n)\n$\n1,127\n \n$\n2,875\n \n$\n(\n1,537\n)\n$\n1,338\n \nDeveloped Technology Rights\nDeveloped technology rights represent the amortized cost associated with developed technology, which has been acquired from third parties and which can include the right to develop, use, market, sell and/or offer for sale the product, compounds and intellectual property that we have acquired with respect to products, compounds and/or processes that have been completed. These assets include technologies related to the care and treatment of dogs, cats, horses, cattle, swine, poultry, fish and sheep. \nBrands and Tradenames\nBrands and tradenames represent the amortized or unamortized cost associated with product name recognition, as the products themselves do not receive patent protection. The most significant finite-lived brands and tradenames are related to Abaxis, Platinum Performance, and Lutalyse. The most significant indefinite-lived brands and tradenames were acquired from SmithKlineBeecham and the Linco family of products. \nIn-Process Research and Development\nIPR&D assets represent R&D assets that have not yet received regulatory approval in a major market. The majority of these IPR&D assets were acquired in connection with our acquisition of two research and development stage animal health biopharmaceutical companies, PetMedix and adivo.\nIPR&D assets are required to be classified as indefinite-lived assets until the successful completion or abandonment of the associated R&D effort. Accordingly, during the development period after the date of acquisition, these assets will not be amortized until approval is obtained in a major market, typically either the U.S., U.K. or the EU, or in a series of other countries, subject to certain specified conditions and management judgment. At that time, we will determine the useful life of the asset, reclassify the asset out of IPR&D and begin amortization. If the associated R&D effort is abandoned, the related IPR&D assets will be written-off and we will record an impairment charge. \nThere can be no certainty that IPR&D assets ultimately will yield a successful product. \nProduct Rights\nProduct rights represent product registration and application rights that were acquired from Pfizer in 2014.\nC.    Amortization\nThe weighted average life of our total finite-lived intangible assets is approximately \n8.2\n years. Total amortization expense for finite-lived intangible assets was $\n170\n million in 2024, $\n185\n million in 2023 and $\n193\n million in 2022.\nThe annual amortization expense expected for the years 2025 through 2029 is as follows: \n(MILLIONS OF DOLLARS)\n2025\n2026\n2027\n2028\n2029\nAmortization expense\n$\n154\n \n$\n147\n \n$\n143\n \n$\n114\n \n$\n77\n \n80 |\nT\nable of Contents\n14.   Benefit Plans\nPension expense associated with the U.S. and certain significant international locations totaled $\n7\n million in 2024, $\n6\n million in 2023 and $\n12\n million in 2022.\nA.    International Pension Plans \nInformation about the dedicated pension plans is provided in the tables below. \nObligations and Funded Status––Dedicated Plans \nThe following table provides an analysis of the changes in the benefit obligations, plan assets and funded status of our dedicated pension plans (including those transferred to us): \nAs of and for the\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\nChange in benefit obligation:\nProjected benefit obligation, beginning\n$\n129\n \n$\n122\n \nService cost\n5\n \n5\n \nInterest cost\n5\n \n5\n \nChanges in actuarial assumptions and other\n9\n \n(\n4\n)\nSettlements and curtailments\n(\n2\n)\n—\n \nBenefits paid\n(\n4\n)\n(\n3\n)\nAdjustments for foreign currency translation\n(\n5\n)\n5\n \nOther––net\n(\n1\n)\n(\n1\n)\nBenefit obligation, ending\n136\n \n129\n \nChange in plan assets:\nFair value of plan assets, beginning\n86\n \n78\n \nActual return on plan assets\n12\n \n3\n \nCompany contributions\n6\n \n6\n \nSettlements and curtailments\n(\n3\n)\n—\n \nBenefits paid\n(\n4\n)\n(\n3\n)\nAdjustments for foreign currency translation\n(\n3\n)\n2\n \nOther––net\n—\n \n—\n \nFair value of plan assets, ending\n94\n \n86\n \nFunded status—Projected benefit obligation in excess of plan assets at end of year\n(a)\n$\n(\n42\n)\n$\n(\n43\n)\n(a)  \nIncluded in \nOther noncurrent liabilities\n.\nChanges in the benefit obligation resulted in a net loss of $\n9\n million in 2024 and a net gain of $\n4\n million in 2023. \nActuarial gains were $\n3\n million ($\n2\n million, net of tax) at December 31, 2024 and $\n4\n million ($\n4\n million, net of tax) at December 31, 2023. The actuarial gains and losses primarily represent the cumulative difference between the actuarial assumptions and actual return on plan assets, changes in discount rates and changes in other assumptions used in measuring the benefit obligations. These actuarial gains and losses are recognized in \nAccumulated other comprehensive loss\n. The actuarial losses will be amortized into net periodic benefit costs over an average period of \n9.8\n years.\nInformation related to the funded status of selected plans follows: \nAs of December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\nPension plans with an accumulated benefit obligation in excess of plan assets:\nFair value of plan assets\n$\n9\n \n$\n8\n \nAccumulated benefit obligation\n50\n \n45\n \nPension plans with a projected benefit obligation in excess of plan assets:\nFair value of plan assets\n9\n \n64\n \nProjected benefit obligation\n55\n \n109\n \n81 |\nT\nable of Contents\nNet Periodic Benefit Costs––Dedicated Plans \nThe following table provides the net periodic benefit cost associated with dedicated pension plans (including those transferred to us): \nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nService cost\n$\n5\n \n$\n5\n \n$\n6\n \nInterest cost\n5\n \n5\n \n2\n \nExpected return on plan assets\n(\n4\n)\n(\n4\n)\n(\n3\n)\nAmortization of net losses\n—\n \n—\n \n1\n \nSettlement and curtailments (gains) / losses\n1\n \n—\n \n—\n \nNet periodic benefit cost\n$\n7\n \n$\n6\n \n$\n6\n \nActuarial Assumptions––Dedicated Plans \nThe following table provides the weighted average actuarial assumptions for the dedicated pension plans (including those transferred to us): \nAs of December 31,\n(PERCENTAGES)\n2024\n2023\n2022\nWeighted average assumptions used to determine benefit obligations:\nDiscount rate\n3.5\n \n%\n4.2\n \n%\n3.7\n \n%\nRate of compensation increase\n3.5\n \n%\n3.6\n \n%\n3.5\n \n%\nCash balance credit interest rate\n1.7\n \n%\n1.6\n \n%\n1.7\n \n%\nWeighted average assumptions used to determine net benefit cost for the year ended December 31:\nDiscount rate\n4.2\n \n%\n3.7\n \n%\n1.4\n \n%\nExpected return on plan assets\n4.6\n \n%\n4.7\n \n%\n3.3\n \n%\nRate of compensation increase\n3.6\n \n%\n3.5\n \n%\n3.4\n \n%\nCash balance credit interest rate\n1.6\n \n%\n1.7\n \n%\n1.5\n \n%\nThe assumptions above are used to develop the benefit obligations at the end of the year and to develop the net periodic benefit cost for the following year. Therefore, the assumptions used to determine the net periodic benefit cost for each year are established at the end of each previous year, while the assumptions used to determine the benefit obligations are established at each year-end. The net periodic benefit cost and the benefit obligations are based on actuarial assumptions that are reviewed on an annual basis. The assumptions are revised based on an annual evaluation of long-term trends, as well as market conditions that may have an impact on the cost of providing retirement benefits. \nActuarial and other assumptions for pension plans can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For a description of the risks associated with estimates and assumptions, see \nNote 3. Significant Accounting Policies—Estimates and Assumptions\n. \nPlan Assets—Dedicated Plans  \nThe components of plan assets follow:  \nAs of December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\nCash and cash equivalents\n$\n1\n \n$\n1\n \nEquity securities: Equity commingled funds\n37\n \n34\n \nDebt securities: Government bonds\n46\n \n40\n \nOther investments\n10\n \n11\n \nTotal\n(a)\n$\n94\n \n$\n86\n \n(a)    \nFair values are determined based on valuation inputs categorized as Level 1, 2 or 3 (see \nNote 3. Significant Accounting Policies—Fair Value\n). Investment plan assets are valued using Level 1 or Level 2 inputs.\nA single estimate of fair value can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions. For information about the risks associated with estimates and assumptions, see \nNote 3. Significant Accounting Policies—Estimates and Assumptions.\n \nSpecifically, the following methods and assumptions were used to estimate the fair value of our pension assets: \n•    Equity commingled funds––observable market prices (Level 1). \n•    Government bonds and other investments––principally observable market prices (Level 2). \n82 |\nT\nable of Contents\nThe long-term target asset allocations and the percentage of the fair value of plans assets for dedicated benefit plans follow:\n \nAs of December 31,\nTarget allocation\npercentage\nPercentage of Plan Assets\n(PERCENTAGES)\n2024\n2024\n2023\nCash and cash equivalents\n0\n-\n10\n%\n1.4\n \n%\n1.7\n \n%\nEquity securities\n0\n-\n60\n%\n39.2\n \n%\n39.4\n \n%\nDebt securities\n15\n-\n100\n%\n48.4\n \n%\n46.9\n \n%\nOther investments\n0\n-\n100\n%\n11.0\n \n%\n12.0\n \n%\nTotal\n100\n%\n100\n \n%\n100\n \n%\nZoetis utilizes long-term asset allocation ranges in the management of our plans’ invested assets. Long-term return expectations are developed with input from outside investment consultants based on the company’s investment strategy, which takes into account historical experience, as well as the impact of portfolio diversification, active portfolio management, and the investment consultant’s view of current and future economic and financial market conditions. As market conditions and other factors change, the targets may be adjusted accordingly and actual asset allocations may vary from the target allocations. \nThe long-term asset allocation ranges reflect the asset class return expectations and tolerance for investment risk within the context of the respective plans’ long-term benefit obligations. These ranges are supported by an analysis that incorporates historical and expected returns by asset class, as well as volatilities and correlations across asset classes and our liability profile. This analysis, referred to as an asset-liability analysis, also provides an estimate of expected returns on plan assets, as well as a forecast of potential future asset and liability balances. \nThe investment consultants review investment performance with Zoetis on a quarterly basis in total, as well as by asset class, relative to one or more benchmarks. \nCash Flows—Dedicated Plans \nOur plans are generally funded in amounts that are at least sufficient to meet the minimum requirements set forth in applicable employee benefit laws and local tax and other laws. \nWe expect to contribute approximately $\n6\n million to our dedicated pension plans in 2025. Benefit payments are expected to be approximately $\n6\n million for 2025, $\n10\n million for 2026, $\n7\n million for 2027, $\n6\n million for 2028 and $\n13\n million for 2029. Benefit payments are expected to be approximately $\n51\n million in the aggregate for the five years thereafter. These expected benefit payments reflect the future plan benefits subsequent to 2025 projected to be paid from the plans or from the general assets of Zoetis entities under the current actuarial assumptions used for the calculation of the projected benefit obligation and, therefore, actual benefit payments may differ from projected benefit payments.\nB.    Postretirement Plans \nPostretirement benefit expense associated with these U.S. retiree medical plans totaled $\n0\n million per year in 2024 and 2023, and \n$\n4\n million\n in  2022. \nC.    Defined Contribution Plans \nZoetis has a voluntary defined contribution plan, the Zoetis Savings Plan (ZSP) that allows participation by substantially all U.S. employees. Zoetis matches \n100\n% of employee contributions, up to a maximum of \n5\n% of each employee’s eligible compensation. The ZSP also includes a profit-sharing feature that provides for an additional contribution ranging between \n0\n and \n8\n percent of each employee’s eligible compensation. All eligible employees receive the profit-sharing contribution regardless of the amount they choose to contribute to the ZSP. The profit-sharing contribution is a discretionary amount provided by Zoetis and is determined on an annual basis. Employees can direct their contributions and the company's matching and profit-sharing contributions into any of the funds offered. These funds provide participants with a cross section of investing options, including the Zoetis stock fund. The matching and profit-sharing contributions are cash funded.\nEmployees are permitted to diversify all or any portion of their company matching or profit-sharing contribution. Once the contributions have been paid, Zoetis has no further payment obligations. Contribution expense, associated with the ZSP, totaled $\n79\n million in 2024, $\n69\n million in 2023 and $\n57\n million in 2022.\nEmployees in the U.S. who meet certain eligibility requirements participate in a supplemental (non-qualified) savings plan sponsored by Zoetis. The cost/(benefit) of the supplemental savings plan was $\n3\n million in 2024, $\n11\n million in 2023 and $(\n9\n) million in 2022. Benefit payments for this plan are expected to be approximately $\n5\n million in 2025 and $\n43\n million thereafter.\n15.   Share-based Payments \nThe Zoetis 2013 Equity and Incentive Plan, Amended and Restated as of May 19, 2022 (Equity Plan), provides long-term incentives to our employees and non-employee directors. The principal types of share-based awards available under the Equity Plan may include, but are not limited to, stock options, restricted stock and restricted stock units (RSUs), deferred stock units (DSUs), performance-vesting restricted stock units (PSUs), and other equity-based or cash-based awards. \nThirty million\n shares of stock were approved and registered with the Securities and Exchange Commission for grants to participants under the Equity Plan. The shares reserved may be used for any type of award under the Equity Plan. At December 31, 2024, the aggregate number of remaining shares available for future grant under the Equity Plan was approximately \n13\n million shares.\n83 |\nT\nable of Contents\nA.    Share-Based Compensation Expense\nThe components of share-based compensation expense follow: \nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\nStock options / stock appreciation rights\n$\n11\n \n$\n8\n \n$\n10\n \nRSUs / DSUs\n42\n \n37\n \n34\n \nPSUs\n21\n \n15\n \n18\n \nShare-based compensation expense—total\n(a)\n$\n74\n \n$\n60\n \n$\n62\n \nTax benefit for share-based compensation expense\n(\n9\n)\n(\n8\n)\n(\n8\n)\nShare-based compensation expense, net of tax\n$\n65\n \n$\n52\n \n$\n54\n \n \n(a)    \nFor each of the years ended December 31, 2024, 2023 and 2022, we capitalized up to $\n1\n million of share-based compensation expense to inventory\n.\nB.    Stock Options\nStock options represent the right to purchase shares of our common stock within a specified period of time at a specified price. The exercise price for a stock option will be not less than \n100\n% of the fair market value of the common stock as of the NYSE market close on the date of grant. Stock options granted may include those intended to be “incentive stock options” within the meaning of Section 422 of the U.S. Internal Revenue Code of 1986 (the Code). \nStock options are accounted for using a fair-value-based method at the date of grant in the Consolidated Statements of Income. The values determined through this fair-value-based method generally are amortized on a straight-line basis over the vesting term. \nEligible employees may receive Zoetis stock option awards. Zoetis stock option awards granted prior to 2023 generally vest after \nthree years\n of continuous service from the date of grant and have a contractual term of \n10\n years while stock option awards granted in and after 2023 are subject to graded vesting over \nthree years\n from the date of grant and have a contractual term of \n10\n years.\nThe fair-value-based method for valuing each Zoetis stock option grant on the grant date uses the Black-Scholes-Merton option-pricing model, which incorporates a number of valuation assumptions noted in the following table, shown at their weighted-average values: \nYear Ended December 31,\n2024\n2023\n2022\nExpected dividend yield\n(a)\n0.87\n \n%\n0.92\n \n%\n0.64\n \n%\nRisk-free interest rate\n(b)\n4.06\n \n%\n3.84\n \n%\n1.81\n \n%\nExpected stock price volatility\n(c)\n26.99\n \n%\n28.63\n \n%\n27.64\n \n%\nExpected term\n(d)\n (years)\n4.1\n4.2\n4.9\n(a)    \nDetermined using a constant dividend yield during the expected term of the Zoetis stock option.\n \n(b)\n     \nDetermined using the interpolated yield on U.S. Treasury zero-coupon issues.\n \n(c)\n     \nDetermined using an equal weighting between historical volatility of the Zoetis stock price and implied volatility. The selection of the blended historical and implied volatility approach was based on our assessment that this calculation of expected volatility is more representative of future stock price trends.\n(d)\n     \nDetermined using expected exercise and post-vesting termination patterns.\n \nThe following table provides an analysis of stock option activity for the year ended December 31, 2024:\nWeighted-Average Remaining Contractual Term\nAggregate Intrinsic Value(a)\nWeighted-Average\nShares\nExercise Price\n(Years)\n(Millions)\nOutstanding, December 31, 2023\n1,526,502\n \n$\n119.13\n \nGranted\n276,086\n \n195.49\n \nExercised\n(\n315,736\n)\n64.82\n \nForfeited\n(\n38,903\n)\n182.58\n \nOutstanding, December 31, 2024\n1,447,949\n \n$\n143.83\n \n6.0\n$\n43,065,332\n \nExercisable, December 31, 2024\n846,647\n \n$\n112.36\n \n4.4\n$\n42,923,962\n \n(a)\n    \nMarket price of underlying Zoetis common stock less exercise price.\nAs of December 31, 2024, there was approximately $\n11\n million of unrecognized compensation costs related to nonvested stock options, which will be recognized over an expected remaining weighted-average period of \neight months\n.\n84 |\nT\nable of Contents\nThe following table summarizes data related to stock option activity:\nYear Ended/As of December 31,\n(MILLIONS OF DOLLARS, EXCEPT PER STOCK OPTION AMOUNTS)\n2024\n2023\n2022\nWeighted-average grant date fair value per stock option\n$\n50.77\n \n$\n43.56\n \n$\n51.13\n \nAggregate intrinsic value on exercise\n40\n \n81\n \n31\n \nCash received upon exercise\n20\n \n42\n \n15\n \nTax benefits realized related to exercise \n17\n \n17\n \n19\n \nC.    Restricted Stock Units (RSUs)\nRestricted stock units represent the right to receive a share of our common stock that is subject to a risk of forfeiture until the restrictions lapse at the end of the vesting period subject to the recipient's continued employment. RSUs accrue dividend equivalent units and are paid in shares of our common stock upon vesting (or cash determined by reference to the value of our common stock).\nRSUs are accounted for using a fair-value-based method that utilizes the closing price of Zoetis common stock on the date of grant. Zoetis RSUs granted prior to 2023 generally vest after \nthree years\n of continuous service from the grant date while RSUs granted in and after 2023 are subject to graded vesting over \nthree years\n. These values are amortized on a straight-line basis over the vest terms.\nThe following table provides an analysis of RSU activity for the year ended December 31, 2024:\nWeighted-Average\nRSUs\nGrant Date Fair Value\nNonvested, December 31, 2023\n655,851\n \n$\n173.49\n \nGranted\n256,149\n \n194.75\n \nVested\n(\n324,151\n)\n165.08\n \nReinvested dividend equivalents\n6,288\n \n182.21\n \nForfeited\n(\n38,031\n)\n182.84\n \nNonvested, December 31, 2024\n556,106\n \n$\n187.61\n \nAs of December 31, 2024, there was approximately $\n45\n million of unrecognized compensation costs related to nonvested RSUs, which will be recognized over an expected remaining weighted-average period of \neight months\n. \nD.    Deferred Stock Units (DSUs)\nDeferred stock units, which were granted to non-employee compensated Directors in 2013 and 2014, represent the right to receive shares of our common stock at a future date. The DSU awards will be automatically settled and paid in shares within \n60\n days following the Director’s separation from service on the Board of Directors. \nDSUs are accounted for using a fair-value-based method that utilizes the closing price of Zoetis common stock on the date of grant. DSUs vested immediately as of the grant date and the values were expensed at the time of grant into \nSelling, general and administrative expenses\n.\nFor the years ended December 31, 2024 and 2023, there were \nno\n DSUs granted. As of December 31, 2024 and 2023, there were \n66,318\n and \n65,654\n DSUs outstanding, respectively, including dividend equivalents.\nE.    Performance-Vesting Restricted Stock Units (PSUs)\nPerformance-vesting restricted stock units, which are granted to eligible senior management, represent the right to receive a share of our common stock that is subject to a risk of forfeiture until the restrictions lapse, which include continued employment through the end of the vesting period and the attainment of performance goals. PSUs represent the right to receive shares of our common stock in the future (or cash determined by reference to the value of our common stock).\nPSUs are accounted for using a Monte Carlo simulation model. The units underlying the PSUs will be earned and vested over a three-year performance period, based upon the total shareholder return of the company in comparison to the total shareholder return of the companies comprising the S&P 500 index at the start of the performance period, excluding companies that during the performance period are acquired or are no longer publicly traded (Relative TSR). The weighted-average fair value was estimated based on volatility assumptions of Zoetis common stock and an average of peer companies, which were \n26.2\n% and \n30.6\n%, respectively, in 2024, and \n38.1\n% and \n40.9\n%, respectively, in 2023. Depending on the company’s Relative TSR performance at the end of the performance period, the recipient may earn between \n0\n% and \n200\n% of the target number of \n85 |\nT\nable of Contents\nunits. Vested units, including dividend equivalent units, are paid in shares of the company’s common stock. PSU values are amortized on a straight-line basis over the vesting term.\nThe following table provides an analysis of PSU activity for the year ended December 31, 2024:\nWeighted-Average\nPSUs\nGrant Date Fair Value\nNonvested, December 31, 2023\n251,780\n \n$\n228.99\n \nGranted\n101,099\n \n268.71\n \nVested\n(\n82,688\n)\n213.05\n \nReinvested dividend equivalents\n2,742\n \n243.86\n \nForfeited\n(\n16,366\n)\n248.41\n \nNonvested, December 31, 2024\n256,567\n \n$\n248.68\n \nShares issued, December 31, 2024\n78,230\n \n$\n208.87\n \nAs of December 31, 2024, there was approximately $\n27\n million of unrecognized compensation costs related to nonvested PSUs, which will be recognized over an expected remaining weighted-average period of \n1.2\n years.\nF.    Other Equity-Based or Cash-Based Awards\nOur Compensation Committee is authorized to grant awards in the form of other equity-based awards or other cash-based awards, as deemed to be consistent with the purposes of the Equity Plan.\n16.   Stockholders' Equity\nZoetis is authorized to issue \n6\n billion shares of common stock and \n1\n billion shares of preferred stock. \nIn December 2021, our Board of Directors authorized a $\n3.5\n billion multi-year share repurchase program. This program was completed as of December 31, 2024. In August 2024, our Board of Directors authorized a new multi-year share repurchase program of up to $\n6\n billion of our outstanding common stock. As of December 31, 2024, there was $\n5.6\n billion remaining under this authorization. Purchases of Zoetis shares may be made at the discretion of management, depending on market conditions and business needs.\nAccumulated other comprehensive loss\nChanges, net of tax, in accumulated other comprehensive loss, excluding noncontrolling interest, follow: \nCurrency Translation Adjustments\nBenefit Plans\nAccumulated Other\nCash Flow \nNet Investment\nOther Currency\nActuarial\nComprehensive\n(MILLIONS OF DOLLARS)\nHedges\nHedges\nTranslation Adj\n(Losses)/Gains\nLoss\nBalance, December 31, 2021\n$\n4\n \n$\n5\n \n$\n(\n756\n)\n$\n(\n17\n)\n$\n(\n764\n)\nOther comprehensive gain/(loss), net of tax\n86\n \n36\n \n(\n188\n)\n13\n \n(\n53\n)\nBalance, December 31, 2022\n90\n \n41\n \n(\n944\n)\n(\n4\n)\n(\n817\n)\nOther comprehensive (loss)/gain, net of tax\n(\n5\n)\n(\n23\n)\n—\n \n6\n \n(\n22\n)\nBalance, December 31, 2023\n85\n \n18\n \n(\n944\n)\n2\n \n(\n839\n)\nOther comprehensive gain/(loss), net of tax\n4\n \n44\n \n(\n147\n)\n(\n2\n)\n(\n101\n)\nBalance, December 31, 2024\n$\n89\n \n$\n62\n \n$\n(\n1,091\n)\n$\n—\n \n$\n(\n940\n)\n17.   Earnings per Share\nThe following table presents the calculation of basic and diluted earnings per share:\nYear Ended December 31,\n(MILLIONS OF DOLLARS AND SHARES, EXCEPT PER SHARE DATA)\n2024\n2023\n2022\nNumerator\nNet income before allocation to noncontrolling interests\n$\n2,496\n \n$\n2,340\n \n$\n2,111\n \nLess: net income/(loss) attributable to noncontrolling interests\n10\n \n(\n4\n)\n(\n3\n)\nNet income attributable to Zoetis Inc.\n$\n2,486\n \n$\n2,344\n \n$\n2,114\n \nDenominator\nWeighted-average common shares outstanding\n454.200\n \n461.172\n \n468.891\n \nCommon stock equivalents: stock options, RSUs, DSUs and PSUs\n0.648\n \n1.097\n \n1.494\n \nWeighted-average common and potential dilutive shares outstanding\n454.848\n \n462.269\n \n470.385\n \nEarnings per share attributable to Zoetis Inc. stockholders—basic\n$\n5.47\n \n$\n5.08\n \n$\n4.51\n \nEarnings per share attributable to Zoetis Inc. stockholders—diluted\n$\n5.47\n \n$\n5.07\n \n$\n4.49\n \nThe number of stock options outstanding under the company's Equity Plan that were excluded from the computation of diluted earnings per share, as the effect would have been antidilutive, were not material for the years ended December 31, 2024, 2023 and 2022.\n86 |\nTable of Contents\n18.   Commitments and Contingencies\nWe and certain of our subsidiaries are subject to numerous contingencies arising in the ordinary course of business. For a discussion of our tax contingencies, see \nNote 8. Tax Matters\n.\nA.    Legal Proceedings\nOur non-tax contingencies include, among others, the following: \n•    Product liability and other product-related litigation, which can include injury, consumer, off-label promotion, antitrust and breach of contract claims. \n•    Commercial and other matters, which can include product-pricing claims and environmental claims and proceedings. \n•    Patent litigation, which typically involves challenges to the coverage and/or validity of our patents or those of third parties on various products or processes. \n•    Government investigations, which can involve regulation by national, state and local government agencies in the U.S. and in other countries. \nCertain of these contingencies could result in losses, including damages, fines and/or civil penalties, and/or criminal charges, which could be substantial. \nWe believe that we have strong defenses in these types of matters, but litigation is inherently unpredictable and excessive verdicts do occur. We do not believe that any of these matters will have a material adverse effect on our financial position. However, we could incur judgments, enter into settlements or revise our expectations regarding the outcome of certain matters, and such developments could have a material adverse effect on our results of operations or cash flows in the period in which the amounts are paid.\nWe have accrued for losses that are both probable and reasonably estimable. Substantially all of these contingencies are subject to significant uncertainties and, therefore, determining the likelihood of a loss and/or the measurement of any loss can be complex. Consequently, we are unable to estimate the range of reasonably possible loss in excess of amounts accrued. Our assessments are based on estimates and assumptions that have been deemed reasonable by management, but the assessment process relies on estimates and assumptions that may prove to be incomplete or inaccurate, and unanticipated events and circumstances may occur that might cause us to change those estimates and assumptions. \nAmounts recorded for legal and environmental contingencies can result from a complex series of judgments about future events and uncertainties and can rely on estimates and assumptions.\nThe principal matters to which we are a party are discussed below. In determining whether a pending matter is significant for financial reporting and disclosure purposes, we consider both quantitative and qualitative factors in order to assess materiality, such as, among other things, the amount of damages and the nature of any other relief sought in the proceeding, if such damages and other relief are specified; our view of the merits of the claims and of the strength of our defenses; whether the action purports to be a class action and our view of the likelihood that a class will be certified by the court; the jurisdiction in which the proceeding is pending; any experience that we or, to our knowledge, other companies have had in similar proceedings; whether disclosure of the action would be important to a reader of our financial statements, including whether disclosure might change a reader’s judgment about our financial statements in light of all of the information about the company that is available to the reader; the potential impact of the proceeding on our reputation; and the extent of public interest in the matter. In addition, with respect to patent matters, we consider, among other things, the financial significance of the product protected by the patent.\n \nUlianopolis, Brazil\nIn February 2012, the Municipality of Ulianopolis (State of Para, Brazil) filed a complaint against Fort Dodge Saúde Animal Ltda. (FDSAL), a Zoetis entity, and \nfive\n other large companies alleging that waste sent to a local waste incineration facility for destruction, but that was not ultimately destroyed as the facility lost its operating permit, caused environmental impacts requiring cleanup. \nThe Municipality is seeking recovery of cleanup costs purportedly related to FDSAL's share of all waste accumulated at the incineration facility awaiting destruction, and compensatory damages to be allocated among the \nsix\n defendants. We believe we have strong arguments against the claim, including defense strategies against any claim of joint and several liability. \nAt the request of the Municipal prosecutor, in April 2012, the lawsuit was suspended for \none year\n. Since that time, the prosecutor has initiated investigations into the Municipality's actions in the matter as well as the efforts undertaken by the \nsix\n defendants to remove and dispose of their individual waste from the incineration facility. On October 3, 2014, the Municipal prosecutor announced that the investigation remained ongoing and outlined the terms of a proposed Term of Reference (a document that establishes the minimum elements to be addressed in the preparation of an Environmental Impact Assessment), under which the companies would be liable to withdraw the waste and remediate the area. \nOn March 5, 2015, we presented our response to the prosecutor’s proposed Term of Reference, arguing that the proposed terms were overly general in nature and expressing our interest in discussing alternatives to address the matter. The prosecutor agreed to consider our request to engage a technical consultant to conduct an environmental diagnostic of the contaminated area. On May 29, 2015, we, in conjunction with the other defendant companies, submitted a draft cooperation agreement to the prosecutor, which outlined the proposed terms and conditions for the engagement of a technical consultant to conduct the environmental diagnostic. On August 19, 2016, the parties and the prosecutor agreed to engage the services of a third-party consultant to conduct a limited environmental assessment of the site. The site assessment was conducted during June 2017, and a written report summarizing the results of the assessment was provided to the parties and the prosecutor in November 2017. The report noted that waste is still present on the site and that further (Phase II) environmental assessments are needed before a plan to manage that remaining waste can be prepared. On April 1, 2019, the defendants met with the Prosecutor to discuss the conclusions set forth in the written report. Following that discussion, on April 10, 2019, the Prosecutor issued a procedural order requesting that the defendants prepare and submit a technical proposal outlining the steps needed to conduct the additional Phase II environmental assessments. The defendants presented the technical proposal to the Prosecutor on October 21, 2019. On March 3, 2020, the Prosecutor notified the defendants that he submitted the proposal to the Ministry of the Environment for its review and consideration by the Prosecutor. On July 15, 2020, the Prosecutor recommended certain amendments to the proposal for the Phase II testing. On \n87 |\nTable of Contents\nSeptember 28, 2020, the parties and the Prosecutor agreed to the final terms and conditions concerning the cooperation agreement with respect to the Phase II testing. Phase II testing began the week of October 14, 2024, and the consultant will provide a report upon completion of the testing.\nBelgium Excess Profit Tax Regime\nOn February 14, 2019, the General Court of the European Union (General Court) annulled the January 11, 2016 decision of the European Commission (EC) that selective tax advantages granted by Belgium under its “excess profit” tax scheme constitute illegal state aid. As a result of the 2016 decision, the company recorded a net tax charge of approximately $\n35\n million in the first half of 2016. After several appeals and judgements, on September 20, 2023, the General Court confirmed the decision of the EC that the Belgium excess profit tax scheme constitutes illegal state aid. We have filed an appeal of the General Court’s decision. The company has not reflected any potential benefits in its consolidated financial statements as a result of the 2019 annulment. We will continue to monitor the developments of the appeal and its ultimate resolution. \nB.    Guarantees and Indemnifications\nIn the ordinary course of business and in connection with the sale of assets and businesses, we indemnify our counterparties against certain liabilities that may arise in connection with the transaction or related to activities prior to the transaction. These indemnifications typically pertain to environmental, tax, employee and/or product-related matters and patent-infringement claims. If the indemnified party were to make a successful claim pursuant to the terms of the indemnification, we would be required to reimburse the loss. These indemnifications are generally subject to threshold amounts, specified claim periods and other restrictions and limitations. Historically, we have not paid significant amounts under these provisions and, as of December 31, 2024, recorded amounts for the estimated fair value of these indemnifications were not material.\nC.    Purchase Commitments\nAs of December 31, 2024, we have agreements totaling $\n512\n million to purchase goods and services, as well as commitments for capital expenditures, that are enforceable and legally binding and include amounts relating to contract manufacturing, information technology services and site acquisitions deemed reasonably likely to occur. Payments for these obligations are expected to be approximately $\n210\n million in 2025 and $\n302\n million thereafter.\n19.   Segment Information\nA.    Segment Information\nWe manage our operations through \ntwo\n geographic regions. Each operating segment has responsibility for its commercial activities. Within each of these operating segments, we offer a diversified product portfolio, including parasiticides, vaccines, dermatology, anti-infectives, pain and sedation, other pharmaceutical and animal health diagnostics, for both companion animal and livestock customers. \nOn October 31, 2024, we completed the divestiture of our medicated feed additive product portfolio, certain water soluble products and related assets, and, as a result, our major product categories no longer include the category of medicated feed additives. See \nNote 5. Acquisitions and Divestitures\n.\nOperating Segments\nOur operating segments are the U.S. and International. The chief operating decision maker (CODM), our Chief Executive Officer and Chief Financial Officer, uses the information provided to compare segment performance with segment resource requests and allocates human and capital resources  based on segment’s actual results and expected future results.\nOther Costs and Business Activities\nCertain costs are not allocated to our operating segment results, such as costs associated with the following: \n•    \nOther business activities\n, includes our CSS contract manufacturing results, our human health business, and expenses associated with our dedicated veterinary medicine research and development organization, research alliances, U.S. regulatory affairs and other operations focused on the development of our products. Other R&D-related costs associated with non-U.S. market and regulatory activities are generally included in the international commercial segment. \n•    \nCorporate\n, includes enabling functions such as information technology, facilities, legal, finance, human resources, business development, certain diagnostic costs and communications, among others. These costs also include certain compensation costs, certain procurement costs and other miscellaneous operating expenses not charged to our operating segments, as well as interest income and expense. \n•    Certain transactions and events such as (i) \nPurchase accounting adjustments\n, where we incur expenses associated with the amortization of fair value adjustments to inventory, intangible assets and property, plant and equipment; (ii) \nAcquisition and divestiture-related activities\n, where we incur costs associated with acquiring and integrating newly acquired businesses, such as transaction costs and integration costs as well as divestiture-related costs; and (iii) \nCertain significant items\n, which comprise substantive, unusual items that, either as a result of their nature or size, would not be expected to occur as part of our normal business on a regular basis, such as restructuring charges and implementation costs associated with our cost-reduction/productivity initiatives that are not associated with an acquisition, certain asset impairment charges, certain legal and commercial settlements and the impact of divestiture-related gains and losses.\n•\nOther unallocated\n includes (i) certain overhead expenses associated with our global manufacturing operations not charged to our operating segments; (ii) certain costs associated with finance that specifically support our global manufacturing operations; (iii) certain supply chain and global logistics costs; and (iv) certain procurement costs.\nSegment Assets\nWe manage our assets on a total company basis, not by operating segment. Therefore, our CODM does not regularly review any asset information by operating segment and, accordingly, we do not report asset information by operating segment. Total assets were approximately $\n14.2\n billion and $\n14.3\n billion at December 31, 2024 and 2023, respectively.\n88 |\nTable of Contents\nSelected Statement of Income Information\n                                \nEarnings\nDepreciation and Amortization\n(a)\nYear Ended December 31,\nYear Ended December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\n2022\n2024\n2023\n2022\nU.S.\nRevenue\n$\n5,074\n \n$\n4,555\n \n$\n4,313\n \nCost of Sales\n936\n \n900\n \n803\n \nGross Profit\n4,138\n \n3,655\n \n3,510\n \n    Gross Margin\n81.6\n \n%\n80.2\n \n%\n81.4\n \n%\nOperating expenses\n(b)\n805\n \n786\n \n765\n \nOther (income)/deductions-net\n(\n3\n)\n6\n \n(\n18\n)\nU.S. Earnings\n3,336\n \n2,863\n \n2,763\n \n$\n85\n \n$\n80\n \n$\n55\n \nInternational\nRevenue\n(c)\n4,102\n \n3,911\n \n3,681\n \nCost of Sales\n1,312\n \n1,234\n \n1,083\n \nGross Profit\n2,790\n \n2,677\n \n2,598\n \n    Gross Margin\n68.0\n \n%\n68.4\n \n%\n70.6\n \n%\nOperating expenses\n(b)\n671\n \n638\n \n611\n \nOther (income)/deductions-net\n1\n \n2\n \n(\n3\n)\nInternational Earnings\n2,118\n \n2,037\n \n1,990\n \n96\n \n92\n \n86\n \nTotal operating segments\n5,454\n \n4,900\n \n4,753\n \n181\n \n172\n \n141\n \nOther business activities\n(\n562\n)\n(\n496\n)\n(\n424\n)\n43\n \n33\n \n28\n \nReconciling Items:\nCorporate\n(\n1,213\n)\n(\n1,042\n)\n(\n1,073\n)\n128\n \n128\n \n132\n \nPurchase accounting adjustments\n(\n140\n)\n(\n159\n)\n(\n160\n)\n140\n \n153\n \n159\n \nAcquisition and divestiture-related costs\n(\n18\n)\n(\n9\n)\n(\n5\n)\n—\n \n—\n \n—\n \nCertain significant items\n(d)\n(\n79\n)\n33\n \n(\n56\n)\n—\n \n—\n \n—\n \nOther unallocated\n(\n309\n)\n(\n291\n)\n(\n379\n)\n5\n \n5\n \n5\n \nTotal Earnings\n(e)\n$\n3,133\n \n$\n2,936\n \n$\n2,656\n \n$\n497\n \n$\n491\n \n$\n465\n \n(a)\n    \nCertain production facilities are shared. Depreciation and amortization is allocated to the reportable operating segments based on estimates of where the benefits of the related assets are realized. \n(b)    \nOperating expenses primarily consisted of field selling, advertising and promotions, other marketing expenses, and freight and logistics costs.\n(c)         \nRevenue denominated in euros was $\n937\n million in 2024, $\n853\n million in 2023 and $\n774\n million in 2022. \n(d)    \nFor 2024, certain significant items primarily consisted of employee termination costs related to organizational structure refinements, a net loss related to the sale\nof our medicated feed additive product portfolio, certain water soluble products and related assets, as well as asset impairment charges related to our aquaculture business, partially offset by a reversal of certain employee termination costs as a result of a change in strategy from our 2015 operational efficiency initiative.\nFor 2023, certain significant items primarily consisted of a gain on the sale of a majority interest in our pet insurance business of $\n101\n million, partially offset by employee termination and exit costs related to organizational structure refinements of $\n43\n million and certain asset impairment charges primarily related to our precision animal health and diagnostics businesses of $\n24\n million.\nFor 2022, certain significant items primarily represents inventory and asset impairment charges related to customer relationships, developed technology rights and property, plant and equipment in our diagnostics, poultry, cattle and swine businesses and the consolidation of manufacturing sites in China of $\n47\n million, as well as employee termination and exit costs associated with cost-reduction and productivity initiatives in certain international markets of $\n4\n million.\n(e)\n    \nDefined as income before provision for taxes on income.\nB.    Geographic Information\nProperty, plant and equipment, less accumulated depreciation, by geographic region follow:\n \nAs of December 31,\n(MILLIONS OF DOLLARS)\n2024\n2023\nU.S.\n$\n2,249\n \n$\n2,092\n \nInternational\n1,142\n \n1,112\n \nProperty, plant and equipment, less accumulated depreciation\n$\n3,391\n \n$\n3,204\n \n89 |\nTable of Contents\nZoetis Inc. and Subsidiaries\nSchedule II—Valuation and Qualifying Accounts\nBalance,\nBalance,\nBeginning of\nEnd of\n(MILLIONS OF DOLLARS)\nPeriod\nAdditions\nDeductions\nPeriod\nYear Ended December 31, 2024\nAllowance for doubtful accounts\n$\n18\n \n$\n3\n \n$\n(\n3\n)\n$\n18\n \nYear Ended December 31, 2023\nAllowance for doubtful accounts\n$\n19\n \n$\n—\n \n$\n(\n1\n)\n$\n18\n \nYear Ended December 31, 2022\nAllowance for doubtful accounts\n$\n17\n \n$\n4\n \n$\n(\n2\n)\n$\n19\n \n90 |\nTable of Contents\nItem 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone.\nItem 9A.    Controls and Procedures.\nDisclosure Controls and Procedures\nAn evaluation was carried out under the supervision and with the participation of the company's management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934). Based upon that evaluation as of December 31, 2024, the company's Chief Executive Officer and Chief Financial Officer concluded that the company's disclosure controls and procedures are effective at a reasonable level of assurance in alerting them in a timely manner to material information required to be disclosed in our periodic reports filed with the SEC. \nManagement's Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined under Rule 13a-15(f) and 15d-15(f) of the Securities Exchange Act of 1934. Under the supervision and with the participation of management, including the company's Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on our evaluation under the framework in \nInternal Control - Integrated Framework\n, our management concluded that our internal control over financial reporting was effective as of December 31, 2024. The effectiveness of our internal control over financial reporting as of December 31, 2024, has been audited by KPMG LLP, an independent registered public accounting firm, as stated in its report included herein.\nChanges in Internal Control over Financial Reporting\nDuring our most recent fiscal quarter, there has not been any change in our internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934) that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B. Other Information.\nRule 10b5-1 Trading Arrangements\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNone.\n91 |\nTable of Contents\nPART III \nItem 10. Directors, Executive Officers and Corporate Governance.\nInformation about our directors is incorporated by reference from the discussion under the heading \nItem 1\n-\nElection of Directors\n in our 2025 Proxy Statement. Information about the Zoetis Code of Conduct governing our employees, including our Chief Executive Officer, Chief Financial Officer and Principal Accounting Officer and Controller, and our Board of Directors, is incorporated by reference from the discussions under the heading \nCorporate Governance at Zoetis\n in our 2025 Proxy Statement. If we make any substantive amendments to the Code of Conduct or grant any waiver from a provision of the Code of Conduct to any executive officer or director, we will promptly disclose the nature of the amendment or waiver on our website. The full text of our Code of Conduct is available at the Investor Relations section of our website at www.zoetis.com. The reference to our website address does not constitute incorporation by reference of the information contained at or available through our website, and you should not consider it to be part of this Annual Report on Form 10-K. Information regarding the procedures by which our stockholders may recommend nominees to our Board of Directors is incorporated by reference from the discussion under the heading \nCorporate Governance at Zoetis\n in our 2025 Proxy Statement. Information about our Audit Committee, including the members of the Committee, and our Audit Committee financial experts, is incorporated by reference from the discussion under the heading \nCorporate Governance at Zoetis\n in our 2025 Proxy Statement. Information about our insider trading policies and procedures is incorporated by reference from the discussion under the heading \nInsider Trading Policy\n in our 2025 Proxy Statement.\nItem 11. Executive Compensation.\nInformation about director compensation is incorporated by reference from the discussion under the heading \nCorporate Governance at Zoetis \nin our 2025 Proxy Statement. Information about executive compensation is incorporated by reference from the discussion under the heading \nExecutive\n \nCompensation \nin our 2025 Proxy Statement. \nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters. \nInformation required by this item is incorporated by reference from the discussion under the heading \nOwnership of Our Common Stock\n in our 2025 Proxy Statement. \nItem 13. Certain Relationships and Related Transactions, and Director Independence. \nInformation about certain relationships and transactions with related parties and our policies and procedures in relation to such transactions is incorporated by reference from the discussion under the heading \nTransactions with Related Persons \nin our 2025 Proxy Statement. Information about director independence is incorporated by reference from the discussion under the heading \nCorporate Governance at Zoetis\n in our 2025 Proxy Statement.\nItem 14. Principal Accountant Fees and Services.\nOur independent registered public accounting firm is \nKPMG LLP\n, \nShort Hills, NJ\n, Auditor Firm ID: \n185\n.\nInformation about the fees for professional services rendered by our independent registered public accounting firm in 2024 and 2023, is incorporated by reference from the discussion under the heading \nItem 3\n—\nRatification of Appointment of KPMG as our Independent Registered Public Accounting Firm for 2025 \nin our 2025 Proxy Statement. Our Audit Committee's policy on pre-approval of audit and permissible non-audit services of our independent registered public accounting firm is incorporated by reference from the discussion under the heading \nItem 3\n—\nRatification of Appointment of KPMG as our Independent Registered Public Accounting Firm for 2025 \nin our 2025 Proxy Statement.\n92 |\nTable of Contents\nPART IV\nItem 15. Exhibit and Financial Statement Schedules.\nThe following entire exhibits are included:\n     (1)    The financial statements and notes to financial statements are filed as part of this report in Item 8. Financial Statements and Supplementary Data.\n    (2)    The financial statement schedule is listed in the Index to Financial Statements.\n    (3)    The exhibits are listed in the Index to Exhibits.\nItem 16. Form 10-K Summary.\nNone.\n93 |\nTable of Contents\nEXHIBITS\nThe exhibits listed below and designated with a \n†\n are filed with this report. The exhibits listed below and not so designated are incorporated by reference to the documents following the descriptions of the exhibits. \nExhibit 3.1\nRestated Certificate of Incorporation of the Registrant (incorporated by reference to Exhibit 3.1 to Zoetis Inc.'s Current\nReport on Form 8-K filed on May 23, 2024 (File No. 001-35797))\nExhibit 3.2\nAmended and Restated By-laws of the Registrant, (incorporated by reference to Exhibit 3.2 to Zoetis Inc.'s Current\n    Report on Form 8-K filed on May 19, 2023 (File No. 001-35797))  \nExhibit 4.1\nSpecimen Common Stock Certificate (incorporated by reference to Exhibit 4.1 to Zoetis Inc.'s Annual Report on Form 10-K\nfiled on February 15, 2022 (File No. 001-35797))\nExhibit 4.2\nIndenture, dated as of January 28, 2013, between Zoetis Inc. and Deutsche Bank Trust Company Americas, as trustee\n (incorporated by reference to Zoetis Inc.'s registration statement on Form S-1 (File No. 333-183254))\nExhibit 4.3\nFirst Supplemental Indenture, dated as of January 28, 2013, between Zoetis Inc. and Deutsche Bank Trust Company \nAmericas, as trustee (incorporated by reference to Exhibit 4.3 of Zoetis Inc.'s registration statement on Form S-1 \n(File No. 333-183254))\nExhibit 4.4\nSecond Supplemental Indenture, dated November 13, 2015, between Zoetis Inc. and Deutsche Bank Trust Company \n   Americas, as trustee (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on Form 8-K filed on\n   November 13, 2015 (File No. 001-35797))\nExhibit 4.5\nThird Supplemental Indenture, dated September 12, 2017, between Zoetis Inc. and Deutsche Bank Trust Company Americas,\nas trustee (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on Form 8-K filed on September 12, 2017  \n(File No. 001-35797))\nExhibit 4.6\nFourth Supplemental Indenture, dated August 20, 2018, between Zoetis Inc. and Deutsche Bank Trust Company Americas,\nas trustee (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on Form 8-K \nfiled on August 20, 2018 (File No. 001-35797))\nExhibit 4.7\nFifth Supplemental Indenture, dated May 12, 2020, between Zoetis Inc. and Deutsche Bank Trust Company Americas,\n   as trustee (incorporated by reference to Exhibit 4.2 to Zoetis Inc.'s Current Report on Form 8-K filed on May 12, 2020\n(File No. 001-35797))\nExhibit 4.8\nSixth Supplemental Indenture, dated November 16, 2022, between Zoetis Inc. and Deutsche Bank Trust Company Americas, as\n   trustee (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on Form 8-K filed on November 16, 2022 \n(File No. 001-35797))\nExhibit 4.9\nForm of 4.500% Senior Notes due 2025 (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on\nForm 8-K filed on November 13, 2015 (File No. 001-35797))\nExhibit 4.10\nForm of 4.700% Senior Notes due 2043 (incorporated by reference to Exhibit 4.3 of Zoetis Inc.'s registration statement on \nForm S-1 (File No. 333-183254))\nExhibit 4.11\nForm of 3.000% Senior Notes due 2027 (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on Form 8-K\nfiled on September 12, 2017 (File No. 001-35797))\nExhibit 4.12\nForm of 3.950% Senior Notes due 2027 (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on Form 8-K\nfiled on September 12, 2017 (File No. 001-35797))\nExhibit 4.13\nForm of 3.900% Senior Notes due 2028 (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on Form 8-K\nfiled on August 20, 2018 (File No. 001-35797))\nExhibit 4.14\nForm of 4.450% Senior Notes due 2048 (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on Form 8-K\nfiled on August 20, 2018 (File No. 001-35797))\nExhibit 4.15\nForm of 2.000% Senior Notes due 2030 (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on Form 8-K\n   filed on May 12, 2020 (File No. 001-35797))\nExhibit 4.16\nForm of 3.000% Senior Notes due 2050 (incorporated by reference to Exhibit 4.2 to Zoetis Inc.’s Current Report on Form 8-K\n   filed on May 12, 2020 (File No. 001-35797))\nExhibit 4.17\nForm of 5.400% Senior Notes due 2025 (incorporated by reference to Exhibit 4.3 to Zoetis Inc.’s Current Report on Form 8-K\n   filed on November 16, 2022 (File No. 001-35797))\n94 |\nTable of Contents\nExhibit 4.18\nForm of 5.600% Senior Notes due 2032 (incorporated by reference to Exhibit 4.4 to Zoetis Inc.’s Current Report on Form 8-K\n   filed on November 16, 2022 (File No. 001-35797))\nExhibit 4.19\nDescription of the Registrant’s Securities†\n \nExhibit 10.1\nGlobal Separation Agreement, dated February 6, 2013, by and between Zoetis Inc. and Pfizer Inc. (incorporated by reference to \n   Exhibit 10.1 to Zoetis Inc.’s 2012 Annual Report on Form 10-K filed on March 28, 2013 (File No. 001-35797))\nExhibit 10.2\nResearch and Development Collaboration and License Agreement, dated February 6, 2013, by and between Zoetis Inc. \n   and Pfizer Inc. (incorporated by reference to Exhibit 10.4 to Zoetis Inc.’s 2012 Annual Report on Form 10-K filed on\nMarch 28, 2013 (File No. 001-35797))\nExhibit 10.3\nPfizer Inc. 2004 Stock Plan, as amended and restated (incorporated by reference to Exhibit 10.6 of Zoetis Inc.'s registration \n   statement on Form S-1 (File No. 333-183254))*\nExhibit 10.4\nPatent and Know-How License Agreement (Zoetis as licensor), dated February 6, 2013, by and between Zoetis Inc. and\n   Pfizer Inc. (incorporated by reference to Exhibit 10.8 to Zoetis Inc.’s 2012 Annual Report on Form 10-K filed on\n   March 28, 2013 (File No. 001-35797))\nExhibit 10.5\nPatent and Know-How License Agreement (Pfizer as licensor), dated February 6, 2013, by and between Zoetis Inc. and\n   Pfizer Inc. (incorporated by reference to Exhibit 10.9 to Zoetis Inc.’s 2012 Annual Report on Form 10-K filed on\n   March 28, 2013 (File No. 001-35797))\nExhibit 10.6\nTrademark and Copyright License Agreement, dated February 6, 2013, by and between Zoetis Inc. and Pfizer Inc. \n   (incorporated by reference to Exhibit 10.10 to Zoetis Inc.’s 2012 Annual Report on Form 10-K filed on March 28, 2013  \n   (File No. 001-35797))\nExhibit 10.7\nEnvironmental Matters Agreement, dated February 6, 2013, by and between Zoetis Inc. and Pfizer Inc. (incorporated by\n    reference to Exhibit 10.13 to Zoetis Inc.’s 2012 Annual Report on Form 10-K filed on March 28, 2013) (File No. 001-35797))\nExhibit 10.8\nZoetis Inc. 2013 Equity and Incentive Plan, as amended and restated as of May 19, 2022 (incorporated by reference to Exhibit \n   10.1 to Zoetis Inc.’s Quarterly Report on Form 10-Q filed on August 4, 2022 (File No. 001-35797))*\nExhibit 10.9\nRevolving Credit Agreement, dated as of December 21, 2022, among Zoetis Inc., the lenders party thereto and JPMorgan \n   Chase Bank, N.A., as administrative agent (incorporated by reference to Exhibit 10.1 of Zoetis Inc.'s Current Report \n   on Form 8-K filed on December 21, 2022 (File No. 001-35797))\nExhibit 10.10\nForm of Indemnification Agreement for directors and officers (incorporated by reference to Exhibit 10.19 of Zoetis Inc's\n   registration statement on Form S-1 (File No. 333-183254))\nExhibit 10.11\nForm of Restricted Stock Unit Award agreement (incorporated by reference to Exhibit 10.21 to Zoetis Inc.’s 2012 Annual\n   Report on Form 10-K filed on March 28, 2013 (File No. 001-35797))*\nExhibit 10.12\nForm of Stock Option Award agreement (incorporated by reference to Exhibit 10.22 to Zoetis Inc.’s 2012 Annual Report\n   on Form 10-K filed on March 28, 2013 (File No. 001-35797))*\nExhibit 10.13\nForm of Non-Employee Director Deferred Stock Unit Award agreement (incorporated by reference to Exhibit 10.23\n   on Form 10-K filed on March 28, 2013 (File No. 001-35797))*\nExhibit 10.14\nForm of Cash Award agreement (incorporated by reference to Exhibit 10.24 to Zoetis Inc.’s 2012 Annual Report on\n   Form 10-K filed on March 28, 2013 (File No. 001-35797))*\nExhibit 10.15\nForm of Performance Restricted Stock Unit Award Agreement, effective as of February 27, 2015 (incorporated by\n   reference to Exhibit 99.1 to Zoetis Inc.’s Current Report on Form 8-K filed on March 4, 2015 (File No. 001-35797))*\nExhibit 10.16\nForm of Restricted Stock Unit Award Agreement, effective as of February 27, 2015 (incorporated by reference to\n   Exhibit 99.2 to Zoetis Inc.’s Current Report on Form 8-K filed on March 4, 2015 (File No. 001-35797))*\nExhibit 10.17\nForm of Stock Option Award Agreement, effective as of February 27, 2015 (incorporated by reference to Exhibit 99.3\n   to Zoetis Inc.’s Current Report on Form 8-K filed on March 4, 2015 (File No. 001-35797))*\nExhibit 10.18\nForm of Cash Award Agreement, effective as of February 27, 2015 (incorporated by reference to Exhibit 99.4 to\n   Zoetis Inc.’s Current Report on Form 8-K filed on March 4, 2015 (File No. 001-35797))*\nExhibit 10.19\nZoetis Amended and Restated Non-Employee Director Deferred Compensation Plan (incorporated by reference to\n   Exhibit 10.1 to Zoetis Inc.’s Quarterly Report on Form 10-Q filed on November 1, 2018 (File No. 001-35797))*\nExhibit 10.20\nZoetis Executive Severance Plan (incorporated by reference to Exhibit 10.1 to Zoetis Inc.’s Quarterly Report on Form 10-Q\n   filed on August 14, 2013 (File No. 001-35797))*\n95 |\nTable of Contents\nExhibit 10.21\nZoetis Supplemental Savings Plan, as amended and restated, effective September 15, 2014 (incorporated by reference to \n   Exhibit 10.4 to Zoetis Inc.'s Quarterly Report on Form 10-Q filed on November 10, 2014 (File No. 001-35797))*\nExhibit 10.22\nAmendment No. 1 to Zoetis Supplemental Savings Plan effective December 21, 2020 (incorporated by reference to Exhibit 10.24\n   to Zoetis Inc.'s 2020 Annual Report on Form 10-K filed on February 16, 2021 (File No. 001-35797))*\nExhibit 10.23\nZoetis Equity Deferral Plan, effective November 1, 2014 (incorporated by reference to Exhibit 10.5 to Zoetis Inc.’s\n   Quarterly Report on Form 10-Q filed on November 10, 2014 (File No. 001-35797))*\nExhibit 10.24\nAmendment No. 1 to Zoetis Equity Deferral Plan effective December 21, 2020 (incorporated by reference to Exhibit 10.26\n   to Zoetis Inc.'s 2020 Annual Report on Form 10-K filed on February 16, 2021 (File No. 001-35797))*\nExhibit 10.25\nLetter Agreement dated as of October 2, 2019, by and between Juan Ramón Alaix and Zoetis Inc. (incorporated by \n   reference to Exhibit 10.1 to Zoetis Inc.'s Current Report on Form 8-K filed on October 3, 2019 (File No. 001-35797))\nExhibit 10.26\nLetter Agreement dated as of December 9, 2019, by and between Clinton A. Lewis, Jr. and Zoetis Inc. (incorporated by\n  reference to Exhibit 10.1 to Zoetis Inc.'s Current Report on Form 8-K filed on December 12, 2019 (File No. 001-35797))\nExhibit 10.27\nOffer Letter, dated as of May 6, 2021, by and between Wetteny Joseph and Zoetis Inc. (incorporated by reference to Exhibit 10.1\n   to Zoetis Inc.'s Current Report on Form 8-K filed on May 11, 2021 (File No. 001-35797))*\nExhibit 10.28\nAmendment No. 2 to Zoetis Supplemental Savings Plan effective May 15, 2021 (incorporated by reference to Exhibit 10.1 to\n   Zoetis Inc.'s Quarterly Report on Form 10-Q filed on August 5, 2021 (File No. 001-35797))*\nExhibit 10.29\nForm of Restricted Stock Unit Award Agreement, effective as of July 27, 2022 (incorporated by reference to Exhibit 10.1 to \n   Zoetis Inc.’s Quarterly Report on Form 10-Q filed on November 3, 2022 (File No 001-35797))*\nExhibit 10.30\nForm of Stock Option Award Agreement, effective as of July 27, 2022 (incorporated by reference to Exhibit 10.2 to Zoetis Inc.’s \n   Quarterly Report on Form 10-Q filed on November 3, 2022 (File No 001-35797))*\nExhibit 10.31\nForm of Performance Restricted Stock Unit Award Agreement, effective as of July 27, 2022 (incorporated by reference to Exhibit \n   10.3 to Zoetis Inc.’s Quarterly Report on Form 10-Q filed on November 3, 2022 (File No 001-35797))*\nExhibit 10.32\nForm of Cash Award Agreement, effective as of July 27, 2022 (incorporated by reference to Exhibit 10.1 to Zoetis Inc.’s\n   Quarterly Report on Form 10-Q filed on November 3, 2022 (File No 001-35797))*\nExhibit 10.33\nForm of Non-Employee Director Restricted Stock Unit Award Agreement, effective as of July 27, 2022 (incorporated by\n   reference to Exhibit 10.5 to Zoetis Inc.’s Quarterly Report on Form 10-Q filed on November 3, 2022 (File No 001-35797))*\nExhibit 10.34\nForm of Restricted Stock Unit Award Agreement, effective as of December 8, 2022 (incorporated by reference to Exhibit 10.36\n   to Zoetis Inc.'s Annual Report on Form 10-K filed on February 14, 2023 (File No 001-35797))*\nExhibit 10.35\nForm of Stock Option Award Agreement, effective as of December 8, 2022 (incorporated by reference to Exhibit 10.37\n   to Zoetis Inc.'s Annual Report on Form 10-K filed on February 14, 2023 (File No 001-35797))*\nExhibit 10.36\nForm of Performance Restricted Stock Unit Award Agreement, effective as of December 8, 2022 (incorporated by reference to \n   Exhibit 10.38 to Zoetis Inc.'s Annual Report on Form 10-K filed on February 14, 2023 (File No 001-35797))*\nExhibit 10.37\nForm of Non-Employee Director Restricted Stock Unit Award Agreement, effective as of February 8, 2023 (incorporated by\n   reference to Exhibit 10.1 to Zoetis Inc.'s Quarterly Report on Form 10Q filed on May 4, 2023 (File No 001-35797))*\nExhibit 10.38\nForm of Cash Restricted Stock Unit Award Agreement, effective as of February 8, 2023 (incorporated by reference to\n   Exhibit 10.2 to Zoetis Inc.'s Quarterly Report on Form 10Q filed on May 4, 2023 (File No 001-35797))*\nExhibit 10.39\nForm of Performance Restricted Stock Unit Award Agreement (Revenue), effective as of February 5, 2025*†\nExhibit 10.40\nLetter Agreement dated as of May 20, 2024, by and between Heidi C. Chen and Zoetis Inc. (incorporated by reference to \n   Exhibit 10.1 to Zoetis Inc.'s Current Report on Form 8-K filed on May 24, 2024 (File No 001-35797))*\nExhibit 10.41\nForm of Performance Restricted Stock Unit Award Agreement (Relative TSR), effective as of February 5, 2025*†\nExhibit 10.42\nZoetis Inc. 2013 Equity and Incentive Plan, as amended and restated as of May 19, 2022 – Sub-Plan for UK Employees *†\nExhibit 19\nZoetis Inc. Insider Trading and Protection of Material Nonpublic Information Policy†\n \nExhibit 21.1\nSubsidiaries of the Registrant †\nExhibit 2\n3.1\nConsent of KPMG LLP †\nExhibit 24.1\nPower of Attorney (included as part of signature page) †\nExhibit 31.1\nCertification by the Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 †\nExhibit 31.2\nCertification by the Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 †\nExhibit 32.1\nCertification by the Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the \n96 |\nTable of Contents\n   Sarbanes-Oxley Act of 2002 ††\nExhibit 32.2\nCertification by the Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the \n   Sarbanes-Oxley Act of 2002 ††\nExhibit 97\nZoetis Inc. Compensation Recovery Policy (incorporated by reference to Exhibit 97 to Zoetis Inc.’s Annual Report on Form 10-K\n    filed on February 13, 2024 (File No 001-35797))\nEX-101.INS\nInline XBRL INSTANCE DOCUMENT\nEX-101.SCH\nInline XBRL TAXONOMY EXTENSION SCHEMA DOCUMENT\nEX-101.CAL\nInline XBRL TAXONOMY EXTENSION CALCULATION LINKBASE DOCUMENT\nEX-101.LAB\nInline XBRL TAXONOMY EXTENSION LABEL LINKBASE DOCUMENT\nEX-101.PRE\nInline XBRL TAXONOMY EXTENSION PRESENTATION LINKBASE DOCUMENT\nEX-101.DEF\nInline XBRL TAXONOMY EXTENSION DEFINITION LINKBASE DOCUMENT\nEX-104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101) \n†\nFiled herewith\n††\nFurnished herewith\n*\nManagement contracts or compensatory plans or arrangements\n97 |\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nZoetis Inc.\nDated:  February 13, 2025\nBy:\n/S/ KRISTIN C. PECK\nKristin C. Peck\nChief Executive Officer and Director\nWe, the undersigned directors and officers of Zoetis Inc., hereby severally constitute Kristin C. Peck and Roxanne Lagano, and each of them singly, our true and lawful attorneys with full power to them and each of them to sign for us, in our names in the capacities indicated below, any and all amendments to this Annual Report on Form 10-K filed with the Securities and Exchange Commission.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/S/ KRISTIN C. PECK\nChief Executive Officer and Director\nFebruary 13, 2025\nKristin C. Peck\n(Principal Executive Officer)\n/S/ WETTENY JOSEPH\nExecutive Vice President and Chief Financial Officer  \n(Principal Financial Officer and\nPrincipal Accounting Officer)\nFebruary 13, 2025\nWetteny Joseph\n/S/ MICHAEL B. MCCALLISTER\nChairman and Director\nFebruary 13, 2025\nMichael B. McCallister\n/S/ PAUL M. BISARO\nDirector\nFebruary 13, 2025\nPaul M. Bisaro\n/S/ VANESSA BROADHURST\nDirector\nFebruary 13, 2025\nVanessa Broadhurst\n/S/ FRANK A. D'AMELIO\nDirector\nFebruary 13, 2025\nFrank A. D’Amelio\n/S/ GAVIN D.K. HATTERSLEY\nDirector\nFebruary 13, 2025\nGavin D.K. Hattersley\n/S/ SANJAY KHOSLA\nDirector\nFebruary 13, 2025\nSanjay Khosla\n/S/ ANTOINETTE R. LEATHERBERRY\nDirector\nFebruary 13, 2025\nAntoinette R. Leatherberry\n/S/ GREGORY NORDEN\nDirector\nFebruary 13, 2025\nGregory Norden\n/S/ LOUISE M. PARENT\nDirector\nFebruary 13, 2025\nLouise M. Parent\n/S/ WILLIE M. REED\nDirector\nFebruary 13, 2025\nWillie M. Reed\n/S/ ROBERT W. SCULLY\nDirector\nFebruary 13, 2025\nRobert W. Scully\n98 |"
  }
}