{
  "ticker": "ABNB",
  "cik": "0001559720",
  "company_name": "Airbnb, Inc.",
  "filing_date": "2025-02-13",
  "accession": "0001559720-25-000010",
  "primary_doc": "abnb-20241231.htm",
  "item1_text": "Item 1A. Risk Factors\nOur business, operations, and financial results are subject to various risks and uncertainties, including those described below, that could materially adversely affect our business, results of operations, financial condition, and the trading price of our Class A common stock. The following material factors, among others, could cause our actual results to differ materially from historical results and those expressed in forward-looking statements made by us or on our behalf in filings with the SEC, press releases, communications with investors, and oral statements.\nRisks Related to Our Business and Operations\nRevenue and Growth Risks\nWe may not be able to sustain our revenue growth rate or effectively manage growth or new opportunities.\nOur future revenue growth depends on the growth of supply and demand for listings on our platform and the development and adoption of new offerings and initiatives. Our business is also affected by general economic and business conditions worldwide as well as trends in the global travel and hospitality industries and the short and long-term accommodation regulatory landscape. A softening of supply or demand for our current or future offerings, whether caused by events outside of our control, challenging macroeconomic and political conditions, changes in host and guest preferences, public health crises such as pandemics, and any of the other factors described in these Risk Factors and elsewhere in this Annual Report on Form 10-K, or otherwise, may result in decreased revenue and our business, results of operations, and financial condition could be materially adversely affected. \nIf we fail to retain or add hosts and guests, if hosts fail to provide high-quality stays and experiences, if our new offerings and initiatives are unsuccessful, or if our community support offerings are inadequate, our business, results of operations, and financial condition would be materially adversely affected. \nOur business success is heavily reliant on both hosts and guests engaging with our platform. Hosts must maintain and enhance their listings by offering a variety of desirable, competitively priced, and high-quality stays and experiences, while providing exceptional hospitality and timely responses to guest inquiries. These factors are largely outside our direct control, and if hosts fail to meet these expectations, or if they choose to cross-list or list exclusively with competitors, or if we are unable to attract and retain hosts in a cost-effective manner, or at all, our revenue and business operations could be adversely affected. \nOur ability to attract and retain guests is crucial and can be impacted by external factors such as pandemics, political instability, climate change, and economic downturns, as well as internal factors like competition, brand perception, and platform usability. Additionally, our brand and reputation are critical to our success, as they influence our ability to attract and retain hosts, guests, and employees. Any negative perceptions or incidents related to safety, security, or quality could harm our public image and business operations. Issues such as unreliable reviews, regulatory scrutiny, or negative media coverage can further damage trust within our community, materially adversely affecting our business, results of operations, and financial condition.\nWe continue to invest in the development of new offerings and initiatives, including innovations focused on improving our host and guest experiences; however, developing and delivering these new offerings and initiatives increase our expenses and our organizational complexity, and we may experience difficulties in developing and implementing these new offerings and initiatives. Our new offerings and initiatives have a high degree of risk, as they may involve unproven businesses with which we have limited or no prior development or operating experience. There can be no assurance that our hosts and guests will adopt or respond positively to such offerings and initiatives, that we will be able to successfully manage the development and delivery of such offerings and initiatives, or that any of these offerings or initiatives will help attract and retain users on our platform and gain sufficient market acceptance to generate sufficient revenue to offset associated expenses or liabilities. If our new offerings and initiatives are not successful, or if we fail to provide a seamless and satisfactory experience for both hosts and guests, or if our host protection programs, including those provided through AirCover for hosts, become ineffective, our business, results of operations, and financial condition could be materially adversely affected.\nFurthermore, our growth relies on delivering high-quality support to our community, which requires significant investment in staffing, technology, infrastructure, and training. As our global customer base expands, particularly outside of North America and Europe, we face increased pressure to provide efficient, multilingual support. The vast majority of our community support is performed by third-party service providers, and our reliance on third-party service providers necessitates stringent guidance and quality control to maintain satisfactory service levels. Inadequate support or dispute resolution can harm our reputation and affect retention, leading to potential revenue reductions through refunds or coupons. The cost of maintaining robust community support is expected to rise, and efforts to reduce support requests may not offset these costs, materially adversely affecting our business, results of operations, and financial condition.\nIf we are unable to successfully expand our global network or manage the risks presented by our business model internationally, our business, results of operations, and financial condition would be materially adversely affected. \nWe are a global platform with hosts in more than 220 countries and regions and over 100,000 cities and towns, and we serve a global guest community. For the year ended December 31, 2024, 58% of our revenue was generated from listings outside of the United States. We expect to continue to make investments to expand our international operations; however, there can be no assurance that our international expansion efforts will be successful or result in revenue growth. Managing a global organization is difficult, time consuming, and expensive, and requires significant management attention and careful prioritization. As such, any international expansion efforts that we may undertake may not be successful. In addition, conducting international operations subjects us to operational, tax, regulatory, and compliance risks. \n8\nTable of Contents\nIncreased operating expenses, decreased revenue, negative publicity, negative reaction from our hosts and guests and other stakeholders, or other adverse impacts from any of the risks related to our international operations could materially adversely affect our brand, reputation, business, results of operations, and financial condition. \nWe rely on the value of our brand and traffic to our platform to grow revenue, and if we are unable to market our brand and drive traffic cost-effectively, it would materially adversely affect our business, results of operations, and financial condition. \nWe believe maintaining and strengthening our brand is crucial for attracting and retaining hosts and guests. We invest significantly in brand marketing across various channels to drive traffic to our platform, but these efforts may not always be cost-effective or successful. Additionally, increased spending by competitors on brand marketing could hinder our ability to grow platform traffic.\nOur marketing strategy includes performance marketing through search engines and social media, as well as paid and unpaid channels like search engine optimization (“SEO”). However, rising costs for keywords and changes in search engine algorithms can impact our visibility and increase customer acquisition costs. If we cannot effectively grow traffic without increasing performance marketing spend, our business, results of operations, and financial condition could be adversely affected.\nSEO efforts are vulnerable to changes in search engine algorithms and consumer behavior, which can reduce our platform's prominence. If our listings are less visible, we may need to increase paid marketing, raising costs and affecting our business, results of operations, and financial condition. If consumers become less reliant on search engines for travel searches and instead incorporate AI and machine learning and other channels, we may not be able to optimize for searches on these emerging channels and may risk losing traffic to competitors. Additionally, if major platforms like Google or Apple favor their own services or other partner services, our ability to engage users via mobile app or search could be impacted.\nAs guests compare offerings across multiple sites, our marketing efficiency may decline, necessitating increased expenditures that may not yield additional revenue. Additionally, negative publicity or complaints could harm our reputation, reducing platform usage and requiring further marketing spend to recover traffic.\nBrand and Reputation Risks \nHost, guest, or third-party actions that are criminal, violent, inappropriate, dangerous, or fraudulent, may undermine the safety or the perception of safety on our platform and our ability to attract and retain hosts and guests and materially adversely affect our reputation, business, results of operations, and financial condition\n. \nWe cannot control or predict the actions of users and third parties, such as neighbors or invitees, during stays or experiences, including actions that may compromise the safety of hosts, guests, and others. Incidents involving alleged fatalities, injuries, sexual violence, fraud, privacy invasion, property damage, and discrimination have occurred and may occur in the future, potentially leading to legal liabilities and reputational damage. When a user is identity verified, it means that they provided information we validated through our process. In addition, we do not currently and may not in the future require users to re-verify their identity following their successful completion of the initial verification process. We conduct background checks for certain U.S. and Indian users and we screen users against sanctions watch lists, but these are not exhaustive due to regulatory, information, and frequency limitations. We do not verify all listings for safety or compliance, relying instead on user-reported issues, which may be incomplete or inaccurate. We have not in the past and may not in the future undertake to independently verify the safety, suitability, location, quality, compliance with Airbnb policies or standards, and legal compliance, such as fire code compliance or the presence of carbon monoxide detectors, hidden cameras or pool safety, of all our hosts’ listings or experiences. We have not in the past and may not in the future undertake to independently verify the location, safety, or suitability of experiences for individual guests, the suitability, qualifications, or credentials of experiences hosts, or the qualifications of individual experiences guests.\nWe have faced civil litigation, regulatory investigations, and inquiries involving allegations related to unsafe listings, discriminatory practices, and other misconduct. Despite efforts to enhance trust and safety, we may not fully succeed, impacting public perception and platform adoption. \nIf hosts, guests, or third parties engage in criminal activity, misconduct, fraudulent, negligent, or inappropriate conduct, or use our platform as a conduit for criminal activity, we may receive negative media coverage, or be subject to involvement in a government investigation concerning such activity, which could adversely impact our brand and reputation, potentially leading consumers to think our platform and the listings on our platform are not safe, and lower the adoption rate of our platform.\nIn addition, certain regions where we operate have higher reported rates of violent crime or varying safety requirements, which can lead to more safety and security incidents, and may adversely impact the adoption of our platform in those regions and elsewhere. \nFurther, claims have been asserted against us from our hosts, guests, and third parties for compensation due to alleged fatalities, shootings, other violent acts, carbon monoxide incidents, hidden camera incidents, accidents, injuries, assaults, theft, property damage, data privacy and data security issues, fraudulent listings, and other incidents that are caused by other hosts, guests, or third parties while using our platform. These claims subject us to potentially significant liability and reputational damage, increase our operating costs and could materially adversely affect our business, results of operations, and financial condition. We have obtained some third-party insurance, which is subject to certain conditions and exclusions, for claims and losses incurred based on incidents related to bookings on our platform. Our insurance policies, which may or may not be applicable to all claims and may not be available to us in the future on economically reasonable terms or at all, may be inadequate to fully cover alleged claims of liability, investigation costs, defense costs, and/or payouts. Even if these claims do not result in liability, we could incur significant time and cost investigating and defending against them. As we expand our offerings, or if the quantity or severity of incidents increases, our insurance rates and our financial exposure will grow, which could materially adversely affect our business, results of operations, and financial condition. \n9\nTable of Contents\nWe track certain operational metrics, which are subject to inherent challenges in measurement, and real or perceived inaccuracies in such metrics may harm our reputation and materially adversely affect our stock price, business, results of operations, and financial condition. \nWe track operational metrics such as Nights and Experiences Booked, GBV, Average Daily Rate (“ADR”), active listings, active bookers, hosts, guest arrivals, greenhouse gas emissions, and other ESG metrics, which may differ from third-party estimates due to varying methodologies and assumptions. Our internal systems have limitations, and changes in tracking methods could lead to unexpected metric variations. Errors in these systems may result in inaccurate data reporting. Metrics like Nights and Experiences Booked and GBV are adjusted for cancellations and alterations that happen in the reporting period, but such cancellations and alterations can occur beyond the reporting period and can affect future metrics. Calculating these operational metrics requires ongoing data collection on new offerings that are added to our platform over time. Our business is complex, and the methodology used to calculate these metrics may require adjustments to accurately represent the full value of new offerings.\nAn active booker is a unique guest who has booked a stay or experience in a given time period. Certain individuals may have more than one guest account and therefore may be counted more than once in our count of active bookers. We count the number of hosts on our platform based on the number of hosts with an available listing as of a certain date. Some individuals may have more than one host account and therefore may be counted more than once as hosts. \nFraudulent activities not identified by our systems can also skew metrics, impacting their accuracy. Inaccurate metrics or perceptions of inaccuracy could harm our reputation, affect our stock price, lead to litigation, and materially adversely affect our business, results of operations, and financial condition.\nFinancial and Insurance Risks \nOur failure to properly manage funds held on behalf of customers could materially adversely affect our business, results of operations, and financial condition. \nWe offer integrated payments in approximately 50 currencies to allow access to guest demand from more than 220 countries and regions and the ability for many hosts to be paid in their local currency or payment method of choice. When a guest books and pays for a stay or experience on our platform, we hold the total amount the guest has paid until check-in, at which time we recognize our service fee as revenue and initiate the process to remit the payment to the host, which generally occurs 24 hours after the scheduled check-in, barring any alterations or cancellations, which may result in funds being returned to the guest. Accordingly, at any given time, we hold on behalf of our hosts and guests a substantial amount of funds, which are generally held in bank deposit accounts and in U.S. government money market funds and recorded on our consolidated balance sheets as funds receivable and amounts held on behalf of customers. In certain jurisdictions, we are required to either safeguard customer funds in bankruptcy-remote bank accounts, or hold such funds in eligible liquid assets, as defined by the relevant regulators in such jurisdictions, equal to at least 100% of the aggregate amount held on behalf of customers. Our ability to manage and account accurately for the cash underlying our customer funds requires a high level of internal controls. As our business continues to grow and we expand our offerings, we must continue to strengthen our associated internal controls. Our success requires significant public confidence in our ability to handle large and growing transaction volumes and amounts of customer funds. Any failure to maintain the necessary controls or to manage the assets underlying our customer funds accurately could result in reputational harm, lead customers to discontinue or reduce their use of our platform and services, and result in significant penalties and fines from regulators, each of which could materially adversely affect our business, results of operations, and financial condition. \nThe insurance coverage afforded by or available from our insurers may be inadequate for the needs of our business, and losses under our damage protection program could materially adversely affect our business, results of operations, and financial condition. \nWe use a combination of insurance and self-insurance, including a wholly-owned captive insurance subsidiary, to manage the exposures related to our business operations. We support our host community by maintaining a variety of host protection programs, such as AirCover for Hosts, which includes Host Liability Insurance, Experiences Liability Insurance, and our Host Damage Protection program. \nIn relation to Airbnb’s insurance programs, our business, results of operations, and financial condition would be materially adversely affected if (i) cost per claim, premiums, or the number of claims significantly exceeds our expectations; (ii) we experience a claim in excess of our coverage limits; (iii) our insurance providers become insolvent or otherwise fail to pay on our insurance claims; (iv) we experience a claim for which coverage is denied by or disputed by our insurance providers; (v) claims costs exceed our captive insurance subsidiary’s forecast or reserves; or (vi) the number of claims under our deductibles or self-insured retentions differs from historic averages. Our spending for insurance has increased as our business has grown and losses from covered claims have increased. Premiums have increased as a result, and we have experienced and expect to continue to experience increased difficulty in obtaining appropriate policy limits and levels of coverage at a reasonable cost and with reasonable terms and conditions. Our costs for obtaining these policies will continue to increase as our business grows and continues to evolve. Furthermore, as our business continues to develop and diversify, we may experience difficulty in obtaining insurance coverage for new and evolving offerings, which could require us to incur greater costs and materially adversely affect our business, results of operations, and financial condition. \nIn relation to our Host Damage Protection program, which is a commercial guaranty agreement that provides reimbursement of up to $3 million for certain guest-caused loss or damages to a host property that are not reimbursed by the guest, we maintain a contractual liability insurance policy to provide coverage to us for losses incurred by us under the Host Damage Protection program. Increased frequency and severity and increased fraud could result in greater payouts, increased investigation costs, premium increases, and/or difficulty securing insurance coverage. \n10\nTable of Contents\nAdditionally, if we fail to comply with insurance regulatory requirements in the regions where we operate, or other regulations governing insurance coverage, our brand, reputation, business, results of operations, and financial condition could be materially adversely affected. \nWe rely on third-party payment service providers to process payments made by guests and payments made to hosts on our platform. If these third-party payment service providers become unavailable or if we are subject to increased fees, our business, results of operations, and financial condition could be materially adversely affected. \nWe rely on a number of third-party payment service providers, including payment card networks, banks, payment processors, and payment gateways, to link us to payment card and bank clearing networks to process payments made by our guests and to remit payments to hosts on our platform. If these providers, some of whom are the sole providers of their particular service, become unable or unwilling to offer services on acceptable terms or at all, our business could be disrupted, requiring us to find alternatives providers and they may not be able to be replaced in a timely manner, or at all, or on favorable terms. Transitioning to new providers would demand significant resources and might not be well-received by users, potentially leading to losses and necessitating payments to hosts from our funds, which could materially adversely affect our business, results of operations, and financial condition.\nIn addition, the software and services from these providers may fail to meet our expectations, contain errors or vulnerabilities, be compromised, or experience outages, all of which could impact our ability to process payments, make timely payments to hosts, or comply with regulatory requirements, which could deter users and harm our reputation, possibly leading to regulatory scrutiny, investigations, or enforcement action. Agreements with providers may even allow them to hold our cash as a reserve under certain conditions, such as adverse business changes, which could materially affect our business, results of operations, and financial condition.\nFor certain payment methods, including credit and debit cards, we pay interchange and other fees, and such fees result in significant costs. Payment card networks may impose special fees or assessments on any transaction that accesses their network. Our payment card processors have the right to pass any increases in interchange fees, assessments or special fees on to us. Such interchange and other fees may increase over time and raise our operating costs and lower profitability.\nCredit card transactions result in higher fees to us than transactions made through debit cards. Any material increase in interchange fees in the United States or other geographies, including as a result of changes in interchange fee limitations imposed by law in some geographies, or other network fees or assessments, or a shift from payment with debit cards to credit cards among our guests could increase our operating costs and materially adversely affect our business, results of operations, and financial condition.\nAdditionally, inadequate investment in our payment infrastructure could hinder functionality and competitiveness, affecting usage. Further, expanding our payment services into additional geographies or offering new methods may introduce additional regulations and fraud risks, which would increase operating expenses. \nIf one or more of our counterparty financial institutions default on their financial or performance obligations to us or fail, we may incur significant losses or be unable to process payment transactions. \nWe have significant amounts of cash, cash equivalents, and other investments, including money market funds, certificates of deposit, U.S. government debt securities, commercial paper, corporate debt securities, government agency debt securities, mortgaged-backed and asset-backed securities, with banks or other financial institutions in the United States and abroad for both our corporate balances and for funds held on behalf of our hosts and guests. We also rely on such banks and financial institutions to help process payments transactions. We have both significant funds flows from and to various financial institutions as a result of our processing of payments from guests to hosts. As part of our currency hedging activities on these balances, we enter into transactions involving derivative financial instruments with various financial institutions. We regularly monitor our exposure to counterparty credit risk and manage this exposure in an attempt to mitigate the associated risk. Despite these efforts, we may be exposed to the risk of default by, or deteriorating operating results or financial condition, or service interruptions at, or failure of, these counterparty financial institutions. If one of our counterparties were to become insolvent or file for bankruptcy, our ability to recover losses or to access or recover our assets may be limited by the counterparty’s liquidity or the applicable laws governing the insolvency or bankruptcy proceedings. Furthermore, our ability to process payment transactions via such counterparties would be severely limited or cease. In the event of default or failure of one or more of our counterparties, we could incur significant losses and be required to make payments to hosts and/or refunds to guests out of our own funds, which could materially adversely affect our results of operations and financial condition. \nOur indebtedness could materially adversely affect our financial condition. Our indebtedness and liabilities could limit the cash flow available for our operations, expose us to risks that could materially adversely affect our business, results of operations, and financial condition, and impair our ability to satisfy our obligations under our indebtedness.\nIn March 2021, we issued $2.0 billion aggregate principal amount of 0% convertible senior notes due 2026 (the “2026 Notes”). In addition, on October 31, 2022, we entered into a five-year unsecured revolving credit facility with $1.0 billion of initial commitments from a group of lenders (“2022 Credit Facility”). As of December 31, 2024, there were no borrowings outstanding under the 2022 Credit Facility, and we had total outstanding letters of credit of $19 million under the 2022 Credit Facility. We may also incur additional indebtedness to meet future financing needs. \nOur ability to make payments under or to refinance our indebtedness, including the 2026 Notes, depends on our future performance, which is subject to economic, financial, competitive and other factors beyond our control. Our business may not generate sufficient funds, and we may otherwise be unable to maintain sufficient cash reserves, to pay amounts due under our indebtedness, including the 2026 Notes, and our cash needs may increase in the future. \n11\nTable of Contents\nAdditionally, certain provisions of our 2026 Notes and related agreements could complicate or increase the cost for a third-party seeking to acquire us. Noteholders may require us to repurchase their notes for cash following a fundamental change, potentially straining our financial resources and leading to defaults under the indenture or other debt agreements. \nIn addition, the accounting treatment of the 2026 Notes as a liability and the use of the \"if-converted\" method for earnings per share calculations may negatively impact our reported financials.\nMoreover, the capped call transactions entered into in connection with the pricing of the 2026 Notes may affect the value of our Class A common stock.\nIn addition, our existing credit agreement for our 2022 Credit Facility contains, and any future indebtedness that we may incur may contain, financial and other restrictive covenants, including a leverage ratio and fixed charge coverage ratio covenants, that limit our ability to operate our business, raise capital, or make payments under our other indebtedness. The covenants in the agreement governing our 2022 Credit Facility, among other things, limit our and our subsidiaries’ abilities to (i) incur additional indebtedness at subsidiaries that are not guarantors of the 2022 Credit Facility; (ii) create or incur additional liens; (iii) partake in sale/leaseback transactions; (iv) engage in certain fundamental changes, including mergers or consolidations; and (v) enter into negative pledge clauses and clauses restricting subsidiary distributions. \nIf we fail to comply with these covenants or to make payments under our indebtedness when due, then we would be in default under that indebtedness, which could, in turn, result in that and our other indebtedness becoming immediately payable in full.\nOperational Risks \nThe failure to successfully execute and integrate acquisitions could materially adversely affect our business, results of operations, and financial condition. \nWe have acquired multiple businesses and we regularly evaluate potential acquisitions. We may expend significant cash or incur substantial debt to finance such acquisitions, which indebtedness could result in restrictions on our business and significant use of available cash to make payments of interest and principal. In addition, we may finance acquisitions by issuing equity or convertible debt securities, which could result in further dilution to our existing stockholders. We may enter into negotiations for acquisitions that are not ultimately consummated. Those negotiations could result in diversion of management time and significant out-of-pocket costs. If we fail to evaluate and execute acquisitions successfully, our business, results of operations, and financial condition could be materially adversely affected. \nIn addition, we may not be successful in integrating acquisitions, or the businesses we acquire may not perform as well as we expect. While our acquisitions to date have not caused major disruptions in our business, any future failure to manage and successfully integrate acquired businesses could materially adversely affect our business, results of operations, and financial condition. Acquisitions involve numerous risks, including the following: \n•\ndifficulties in integrating and managing the combined operations, technology platforms, or offerings of the acquired companies and realizing the anticipated economic, operational, and other benefits in a timely manner, which could result in substantial costs and delays, and failure to execute on the intended strategy and synergies; \n•\nfailure of the acquired businesses to achieve anticipated revenue, earnings, or cash flow; \n•\ndiversion of management’s attention or other resources from our existing business; \n•\nour inability to maintain the key customers, business relationships, suppliers, and brand potential of acquired businesses; \n•\nuncertainty of entry into businesses or geographies in which we have limited or no prior experience or in which competitors have stronger positions; \n•\nunanticipated costs associated with pursuing acquisitions or greater than expected costs in integrating the acquired businesses; \n•\nresponsibility for the liabilities of acquired businesses, including those that were not disclosed to us or exceed our estimates, such as liabilities arising out of the failure to maintain effective data protection and privacy controls, and liabilities arising out of the failure to comply with applicable laws and regulations, including tax laws; \n•\ndifficulties in or costs associated with assigning or transferring to us or our subsidiaries the acquired companies’ intellectual property or its licenses to third-party intellectual property; \n•\ninability to maintain our culture and values, ethical standards, controls, procedures, and policies; \n•\nchallenges in integrating the workforce of acquired companies and the potential loss of key employees of the acquired companies; \n•\nchallenges in integrating and auditing the financial statements of acquired companies that have not historically prepared financial statements in accordance with GAAP; and \n•\npotential accounting charges to the extent goodwill and intangible assets recorded in connection with an acquisition, such as trademarks, customer relationships, or intellectual property, are later determined to be impaired and written down in value. \nFrom time to time, we also make investments in private companies, which are inherently risky. To the extent our investments in such companies have experienced a decline in value, we have recognized an expense to adjust the carrying value to its estimated fair value. Negative changes in the estimated fair value of private companies in which we invest could have a material adverse effect on our results of operations and financial condition. \nOur results of operations and financial condition could be materially adversely affected by changes in accounting principles. \nThe accounting for our business is subject to change based on the evolution of our business model, interpretations of relevant accounting principles, enforcement of existing or new regulations, and changes in policies, rules, regulations, and interpretations of accounting and financial reporting requirements of the SEC or other regulatory agencies. Adoption of a change in accounting principles or interpretations \n12\nTable of Contents\ncould have a significant effect on our reported results of operations and could affect the reporting of transactions completed before the adoption of such change. It is difficult to predict the impact of future changes to accounting principles and accounting policies over financial reporting, any of which could adversely affect our results of operations and financial condition and could require significant investment in systems and personnel. \nOur business depends on attracting and retaining capable management and employees, and the loss of any key personnel could materially adversely affect our business, results of operations, and financial condition.\n \nOur success depends in large part on our ability to attract and retain high-quality management and employees. Our founders and other members of our senior management team, as well as other employees, may terminate their employment with us at any time, which could materially adversely affect our business, results of operations, and financial condition. \nAs we continue to grow, we cannot guarantee that we will be able to attract and retain the personnel we need. The loss of qualified employees, or an inability to attract, retain, and motivate employees required for the planned expansion of our business, would materially adversely affect our business, results of operations, and financial condition and impair our ability to grow. To attract and retain key personnel, we use various measures, including an equity incentive program, and our ability to attract, retain, and motivate employees may be adversely affected by declines in our stock price. Additionally, if we issue significant equity to attract employees or to retain our existing employees, we would incur substantial additional stock-based compensation expense and the ownership of our existing stockholders would be further diluted.\nWe have adopted a Live and Work Anywhere policy. The increase in remote working subjects us to certain operational challenges and could have adverse tax implications, which could materially adversely affect our business, results of operations, and financial condition.\nIn 2022, we adopted our Live and Work Anywhere policy, which permits the majority of our employees to work remotely. Remote working subjects us to operational challenges and risks. For example, a natural disaster, power outage, connectivity issue, or other event may impact our employees’ ability to work remotely. In addition, members of our workforce who work remotely may not have access to technology that is as robust as that in our offices, which could cause the networks, information systems, applications, and other tools available to those remote workers to be more limited or less reliable than in our offices. We are also exposed to risks associated with the locations of remote workers, including compliance with local laws and regulations or exposure to compromised internet infrastructure. Allowing members of our workforce to work remotely creates intellectual property risk if employees create intellectual property on our behalf while residing in a jurisdiction with unenforced or uncertain intellectual property laws. Further, if employees fail to inform us of changes in their work location, we may unknowingly be exposed to additional risks. Remote working at our company (and at many third-party providers) also results in consumer, privacy, information technology and cybersecurity, and fraud risks due to the challenges associated with managing remote computing assets and security vulnerabilities that are present in many non-corporate and home networks. \nOur transition to full or predominantly remote work environments also presents significant challenges to maintaining compliance with country and state requirements such as employee income tax withholding, the recording of reserves to cover withholding corrections or penalties, payroll tax remittance and reporting, payroll registration, and workers’ compensation insurance. Additionally, foreign tax authorities may assert that certain of our entities have created permanent establishment in their countries\n,\n which could result in additional corporate income taxes and employee payroll withholding obligations. Any of these operational challenges or tax implications resulting from our Live and Work Anywhere policy may materially adversely affect our business, results of operations, and financial condition.\nIndustry, Economic and Market Risks \nIndustry and Climate Risks \nAny decline or disruption in the travel and hospitality industries or economic downturn could materially adversely affect our business, results of operations, and financial condition. \nOur financial performance is dependent on the strength of the travel and hospitality industries, which can be significantly impacted by events beyond our control such as extreme weather, natural disasters, pandemics or public health crises, economic downturns, political unrest, wars, and changes in travel-related policies. These unpredictable events can abruptly alter consumer travel behavior, reducing demand for our platform and services, and materially adversely affecting our business, results of operations, and financial condition. Climate change and other environmental or social pressures, as well as societal responses to same, may exacerbate or lead to additional impacts from such events. For more information, see our risk factor titled “We are subject to risks associated with the physical impacts of climate change as well as various efforts to transition to a low-carbon society.” \nMacroeconomic conditions, including economic downturns, inflation, tariffs, and currency fluctuations, also influence consumer discretionary spending, which is crucial for our business. Factors like unemployment, consumer debt, and financial market volatility can decrease consumer confidence and spending, particularly affecting leisure travel, which forms a substantial part of our business. Economic downturns have historically reduced travel spending, and future downturns could similarly decrease demand for our platform, leading to lower bookings, increased cancellations, and reduced revenue, thereby materially adversely affecting our business, results of operations, and financial condition.\nThe business and industry in which we participate are highly competitive, and we may be unable to compete successfully with our current or future competitors. \nWe operate in a highly competitive environment, and we face significant competition in attracting hosts and guests. Hosts have numerous options for listing their spaces and experiences, both online and offline, and often cross-list their offerings. We compete for hosts based on factors like booking volume, platform usability, service fees, host protections, and brand and reputation. Guests also have various options \n13\nTable of Contents\nfor booking accommodations and experiences, and we compete on inventory uniqueness, value and all-in cost, brand and reputation, platform usability, search relevance and personalization, trust and safety, and customer support.\nOur competitors include OTAs, search engines, listing and meta-search websites, hotel chains, property management companies, and online experience platforms. Many competitors have advantages such as greater brand recognition, larger marketing budgets, and more resources. They may offer a more comprehensive product experience and respond more effectively to market changes. They may develop technological advancements that allow them to offer better products and services at a lower price. Failure to offer or deploy new technologies as effectively as our competitors could adversely affect our business. Industry consolidation and emerging start-ups further intensify competition, potentially impacting our growth and financial condition.\nNumerous companies offer homes for booking, often cross-listed on multiple platforms, which can make our pricing appear less competitive for a number of reasons, including differences in fee structure and policies. Some property managers and hosts encourage direct bookings, bypassing our platform, which reduces our usage. Competitors with established consumer relationships may leverage these to enter the travel market, creating “super-apps” that integrate multiple services, potentially increasing our customer acquisition costs and affecting our competitive position.\nWe also face competition from search engines like Google, which can influence search traffic and promote their own travel services, potentially disintermediating our platform. If major technology companies favor their own travel offerings or restrict our app distribution, it could impact our ability to engage with users, materially affecting our business, results of operations, and financial condition.\nWe are subject to risks associated with the physical impacts of climate change as well as various efforts to transition to a low-carbon society. \nThere are inherent climate-related risks wherever business is conducted. For example, the physical impacts of climate change (which may include more frequent or severe storms, extreme weather events, extreme temperatures and ambient temperature increases, hurricanes, flooding, rising sea levels, shortages of water, droughts, wildfires, and natural disasters) may interrupt infrastructure on which our platform relies, impact demand or supply for lodging, or otherwise adversely impact our business. Climate change is expected to increase the frequency and severity of certain such events, as well as contribute to chronic changes (such as changes to meteorological and hydrological patterns) that may also impact the behaviors of guests and hosts or infrastructure on which we rely.\nGrowing awareness of climate and other environmental or social pressures, including over-tourism, has also prompted responses by various actors in society, which may adversely impact the travel and hospitality industries and demand for our platform and services, whether due to the imposition of policies and regulations or changing societal attitudes towards travel. For example, both we and hosts are increasingly subject to regulatory requirements related to climate-related considerations, and any additional regulations may require increased costs or attention for compliance. Our platform and services may also be adversely impacted to the extent travel behavior or other societal expectations shift in response to climate considerations, including if we do not successfully navigate stakeholder expectations regarding our own response to climate change.\nEconomic and Market Risks \nWe may experience significant fluctuations in our results of operations, which make it difficult to forecast our future results. \nOur results of operations can vary significantly and are not necessarily indicative of future performance due to seasonal fluctuations and other factors. We experience seasonality in our Nights and Experiences Booked and GBV, and seasonality in Adjusted Earnings Before Interest, Taxes, Depreciation, and Amortization (“EBITDA”) that is consistent with seasonality of our revenue, which has historically been, and is expected to continue to be, highest in the third quarter when we have the most check-ins as it is the peak travel season for North America and EMEA. Revenue is recognized upon check-in, and as our business evolves, seasonal trends may change. \nIn addition, our results of operations may fluctuate as a result of a variety of other factors, some of which are beyond our control, including: \n•\nreduced travel and cancellations due to events such as health concerns, including epidemics and pandemics, natural disasters, wars, political instability, regional hostilities or law enforcement demands, and other regulatory actions; \n•\nglobal macroeconomic conditions;\n•\nperiods with increased investments in our platform for existing offerings, new offerings and initiatives, marketing, and the accompanying growth in headcount; \n•\nour ability to maintain growth and effectively manage that growth; \n•\nincreased competition; \n•\nour ability to expand our operations in new and existing regions; \n•\nchanges in governmental or other regulations affecting our business; \n•\nchanges to our internal policies or strategies; \n•\nharm to our brand or reputation; and \n•\nother risks described in these Risk Factors and elsewhere in this Annual Report on Form 10-K. \nIn addition, we may not accurately forecast our results of operations due to timing differences between when bookings are made and revenue recognition, which occurs at check-in. For example, the effect of significant downturns in bookings in a particular quarter may not be fully reflected in our financial results until future periods due to this timing difference. Our expense levels are based on revenue estimates that may be inaccurate, and fixed expenses may lead to greater-than-expected losses if revenue falls short. Incorrect assumptions or failure to address risks could materially affect our business, results of operations, and financial condition.\nA significant portion of our bookings and revenue are denominated in foreign currencies, and our financial results are exposed to changes in foreign exchange rates.\n \n14\nTable of Contents\nA significant portion of our business is denominated and transacted in foreign currencies, which subjects us to foreign exchange risk. We offer integrated payments to our hosts and guests in approximately 50 currencies. Revenue could be negatively impacted by currency fluctuations. \nGenerally speaking, a strong U.S. dollar can negatively impact our revenue, as approximately 54% of our revenue in 2024 was in non-U.S. dollar currencies. We also face foreign exchange risk with certain assets, like cash balances held for hosts and guests, affecting our financial results through currency remeasurement and translation. Our platform allows guests to pay in their preferred currency, which may differ from the host's payment currency, leading to currency risk due to timing differences. \nWe utilize a foreign exchange cash flow hedging program to reduce the impact of currency fluctuations on our revenue. However, hedging may not fully mitigate losses, and our hedging positions may be incomplete or absent in the future. While we may hedge revenue and balance sheet exposures, predicting or eliminating foreign exchange rate effects is not possible.\nLegal, Regulatory and Compliance Risks \nTax Compliance\nChanges in tax laws or tax rulings could materially adversely affect our business, results of operations and financial condition. \nWe are subject to evolving global tax regimes, which could materially adversely affect our business, results of operations, and financial condition. The U.S. Inflation Reduction Act (the “IRA”) introduced a corporate alternative minimum tax and an excise tax on stock repurchases. In the year ended December 31, 2024, we accrued approximately \n$95 million \nof corporate alternative minimum tax, and approximately \n$20 million\n of excise tax on stock repurchases. Additionally, the U.S. government may implement further changes, such as increasing the corporate income tax rate or altering the taxation of international income.\nMany countries in Europe, as well as a number of other countries and states, have recently proposed or recommended changes to existing tax laws or have enacted new laws that could significantly increase our tax obligations in many countries and states where we do business or require us to change the manner in which we operate our business. For example, in Italy, a law enacted in 2017 purports to require short-term rental platforms that process payments to withhold and remit host income tax and collect and remit tourist tax, amongst other obligations. In December 2023, without admitting any liability, Airbnb Ireland signed an agreement with the Italian Revenue Agency in settlement of the 2017-2021 audit periods for an aggregate payment of 576 million Euro ($621 million). Additionally, in December 2024, Airbnb Ireland signed a similar agreement in settlement of the 2022 audit period for an aggregate payment of 139 million Euro ($150 million). Such agreements settle a dispute about Airbnb Ireland’s obligations to withhold and remit host income tax, including taxes, interest, and penalties, for those relevant periods. Airbnb’s subsidiary in Italy and Airbnb Ireland continue to be, or could in the future be, subject to tax audits in Italy, including in relation to permanent establishment, transfer pricing, withholding obligations, and tourist taxes. Such audits could result in the imposition of additional potentially significant prior and future tax obligations.\nThe Organization for Economic Cooperation and Development (the “OECD”) is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. Our effective tax rate and cash tax payments could increase in future years as a result of these changes.\nThe European Commission is also conducting investigations into preferential tax treatments, which may lead to changes in how our foreign operations are taxed. As our international business expands, these developments could raise our effective tax rate and non-income tax obligations, materially adversely affecting our business, results of operations, and financial conditions. Additionally, some changes may apply retroactively, leading to unexpected tax liabilities beyond our current estimates.\nWe may have exposure to greater than anticipated income tax liabilities. \nOur income tax obligations are based in part on our corporate operating structure and intercompany arrangements, including the manner in which we operate our business, develop, value, manage, protect, and use our intellectual property, and determine the value of our intercompany transactions. The tax laws applicable to our business, including those of the United States and other jurisdictions, are subject to interpretation, and certain jurisdictions are aggressively interpreting their laws in new ways in an effort to raise additional tax revenue from companies such as Airbnb. The taxing authorities of the jurisdictions in which we operate may challenge our methodologies for valuing developed technology or intercompany arrangements, which could increase our worldwide effective tax rate and materially adversely affect our results of operations and financial condition. \nWe are subject to regular review and audit by U.S. federal, state, local, and foreign tax authorities. For example, our 2008 to 2024 tax years remain subject to examination in the United States and California due to tax attributes and statutes of limitations, and our 2020 to 2024 tax years remain subject to examination in Ireland. We are currently under examination for income taxes by the Internal Revenue Service (“IRS”) for the years 2013, 2016, 2017 and 2018. We are continuing to respond to inquiries related to these examinations. In December 2020, we received a Notice of Proposed Adjustment (“NOPA”) from the IRS for the 2013 tax year relating to the valuation of our international intellectual property which was sold to a subsidiary in 2013. The notice proposed an increase to our U.S. taxable income that could result in additional income tax expense and cash tax liability of $1.3 billion, plus penalties and interest, which exceeds our current reserve recorded in our consolidated financial statements by more than $1.0 billion. We disagree with the proposed adjustment and intend to vigorously contest it. In January 2022, we entered into an administrative dispute process with the IRS Independent Office of Appeals (“IRS Appeals”) regarding the proposed adjustment. An acceptable outcome was not reached with IRS Appeals, and in May 2024, we received a Statutory Notice of Deficiency (“Notice”) from the IRS related to the aforementioned valuation of our international intellectual property. The Notice claims that we owe $1.3 billion in tax, plus penalties and interest. We will continue to pursue all available remedies to resolve this dispute. In July 2024, we petitioned the U.S. Tax Court (“Tax Court”) for redetermination, and if necessary, we will appeal the Tax Court’s decision to the \n15\nTable of Contents\nappropriate appellate court. If the IRS prevails in the assessment of additional tax due based on its position and such tax and related interest and penalties, if any, exceeds our current reserves, such outcome could have a material adverse impact on our financial position and results of operations, and any assessment of additional tax could require a significant cash payment and have a material adverse impact on our cash flow. \nUncertainty in the application of taxes to our hosts, guests, or platform could increase our tax liabilities and may discourage hosts and guests from conducting business on our platform. \nWe face complex and evolving tax obligations across various jurisdictions, which could significantly impact our business. We are subject to numerous taxes, including income and indirect taxes, and have received demands from governments for data to enforce tax laws against our hosts and guests. We collect and remit taxes on behalf of hosts when legally required, but disputes and lawsuits over tax responsibilities persist. New or revised tax laws could increase our tax liabilities and operational costs, potentially leading to penalties for non-compliance.\nThe application of indirect taxes, such as lodging taxes, transactional taxes, hotel, sales and use tax, privilege taxes, excise taxes, VAT, goods and services tax, digital services taxes, harmonized sales taxes, business tax, and gross receipt taxes (together, “indirect taxes”) to e-commerce activities such as ours and to our hosts or guests is a complex and evolving issue. These taxes could raise costs for hosts and guests, discourage platform use, and reduce revenue. For example, we recorded approximately $53 million in expense related to digital service taxes relating to prior periods as a result of refining our interpretation of the law as it applies to us. Additionally, we recorded $18 million of lodging tax expense in a particular jurisdiction over uncertainty as to how a new law applies to us. Compliance with tax reporting may require disclosing personal data, risking privacy concerns and regulatory actions. Competitors may adopt different tax strategies, potentially attracting our hosts and guests.\nWe devote significant resources, including management time, to the application and interpretation of laws and working with various jurisdictions to clarify whether taxes are applicable and the amount of taxes that apply. Rapid regulatory changes and lack of uniformity complicate compliance, risking errors and enforcement actions. As our business evolves, tax obligations may increase, further affecting our financial condition and platform usage.\nOur ability to use our net operating loss carryforwards and certain other tax attributes may be limited. \nWhile federal net operating loss carryforwards generated on or after January 1, 2018 are not subject to expiration, the deductibility of such net operating loss carryforwards is limited to 80% of our taxable income for taxable years beginning on or after January 1, 2021. Utilization of our net operating loss carryforwards depends on our future taxable income, and there is a risk that some of our existing net operating loss carryforwards and tax credits could expire unused (to the extent subject to expiration) and be unavailable to offset future taxable income, which could materially adversely affect our results of operations and financial condition. In addition, under Sections 382 and 383 of the Internal Revenue Code of 1986, as amended (the “Code”), if a corporation undergoes an “ownership change,” generally defined as a greater than 50 percentage point change (by value) in its equity ownership by significant stockholders or groups of stockholders over a three-year period, the corporation’s ability to use its pre-change net operating loss carryforwards and other pre-change tax attributes, such as research tax credits, to offset its post-change taxable income or income tax liabilities may be limited. Similar rules may apply under state tax laws. We may have undergone ownership changes in the past, and we may experience ownership changes in the future because of shifts in our stock ownership, many of which are outside of our control. As a result, our ability to use our net operating loss carryforwards and other tax attributes to offset future U.S. federal taxable income or income tax liabilities may be, or may become, subject to limitations, which could result in increased future tax liability to us. \nCompliance with Laws and Regulations, Litigation and Disputes\nWe are subject to a wide variety of laws, regulations\n,\n and rules applicable to short-term rental, long-term rental, and home sharing businesses, or that govern our business practices, including among others, e-commerce, data privacy, payment services, advertising, consumer protection, employment, and commercial practices. Such laws and regulations are complex, evolving, and sometimes inconsistent and have limited and may continue to limit the ability or willingness of new or existing hosts to share their spaces through our platform. These regulations may expose our users or us to regulatory inquiries, litigation, and/or other disputes and to potentially significant liabilities, including taxes, compliance costs, fines, and criminal or other penalties, which have had and could continue to have a material effect on our business, results of operations, and financial condition. \nHosts list, and guests search for, stays and experiences on our platform in more than 220 countries and regions across the globe. There are national, state, local, and foreign laws and regulations in jurisdictions that relate to or affect our business and, since we began our operations in 2008, there have been and continue to be legal and regulatory developments and inconsistent or ambiguous interpretations among local, regional, or national laws or regulations that affect the short-term rental, experiences, long-term rental, and home sharing business. These laws and regulations may impact the ability of hosts to list properties entirely and/or may limit the location and/or duration of stays permitted, or may establish other conditions upon which they are allowed to host. In addition, regulations may require that we, rather than local, state or national regulatory enforcement agencies, limit hosts’ ability to list within those requirements.\nCompliance Costs\nCompliance with diverse and evolving laws across jurisdictions is costly and complex, increasing our operational expenses and potential liabilities (including potential criminal or other penalties). For example, we incur significant operational costs to comply with requirements of jurisdictions and cities that have disparate requirements around tax collection, tax reporting, data sharing, host registration, limits on lengths of stays, and other regulations, each of which may require us to dedicate significant resources to provide the infrastructure and tools needed on our platform for our hosts to meet these legal requirements and for us to fulfill any obligations we may have. Environmental, health, and safety requirements have also become increasingly stringent, and our costs, and our hosts’ costs, to comply with such requirements may increase as a result. The complexity of our platform and changes required to comply with the large number of varying \n16\nTable of Contents\nrequirements can lead to constraints on supply as well as compliance gaps. Additionally, unclear and changing laws can deter hosts and guests from using our platform, reduce supply and demand, and increase litigation risks, adversely affecting our business. Failure or delays in complying with laws, even if unclear or in dispute, could subject us to penalties, including fines, business disruption and site blocking.\nWe require hosts and guests to comply with all applicable legal obligations under our terms of service, but governments may nonetheless seek to hold us accountable for hosts’ and guests’ compliance. This can lead to penalties and costs that impact our reputation and financial condition. \nOur compliance measures, such as requiring hosts to include registration numbers for listings in some jurisdictions, may increase platform friction and reduce listings and bookings. Host listings may also be limited by night caps, density restrictions, onerous permitting requirements, primary residence or host presence requirements, permit caps, minimum night stays, and/or discretionary permitting or lottery systems. Additional regulations could necessitate significant platform changes, discouraging use and increasing scrutiny and liability.\nWe are subject to laws and regulations governing our business practices, the Internet, e-commerce, and electronic devices, including those relating to taxation, data privacy, data security, pricing, content, advertising, discrimination, consumer protection, protection of minors, insurance, copyrights, distribution, messaging, mobile communications, electronic device certification, electronic waste, electronic contracts, communications, Internet access, competition, AI, and unfair commercial practices as well as federal, state, local, and foreign laws regulating employment, employee working conditions, including wage and hour laws, employment dispute and employee bargaining processes, collective and representative actions, employment classification, and other employment compliance requirements. Violation of these laws could subject the company to fines and penalties, including in some cases, criminal penalties.\nRegulatory Developments \nHotels and groups affiliated with hotels have engaged and will likely continue to engage in various lobbying and political efforts for stricter regulations governing our business in both local and national jurisdictions. Additionally, private groups, such as homeowners and neighborhood associations, may adopt contracts or regulations that purport to ban or otherwise restrict the ability of hosts to list their spaces. In some jurisdictions, regulations imposing restrictions on short-term rentals are increasingly fragmented at the local level, leading to increased compliance burden. These efforts, along with existing and potential new laws, could restrict short-term rentals, impose registration requirements and other limits to hosts’ ability to list, and lead to significant fines and liabilities, materially affecting our platform's operations and financial condition. For instance, EU Member State laws pertaining to the recently enacted EU STR Regulation will require additional compliance efforts, potentially discouraging and prohibiting current and potential hosts from listing properties. As another example, the City of New York has effectively banned short-term rentals, and this has led to similar restrictions being considered throughout the State of New York. If other geographies emulate these regulations, it could have a material adverse effect on our business and financial condition.\nWe face ongoing disputes with government agencies over regulations, which may result in fines and operational changes. Some jurisdictions have imposed or may seek to impose taxes and licensing requirements on our platform and failure to comply could lead to penalties. We have resolved some disputes by agreeing to remove listings or share data with authorities. From time to time, we attempt to defend against application of laws and regulations that limit hosts’ or guests’ ability or willingness to list and search for accommodations, but have sometimes been and may continue to be unsuccessful in certain of those efforts. \nIncreased regulatory interest in technology companies, particularly regarding AI, data privacy, competition, and sustainability, could lead to further compliance challenges. New or changing laws could impose significant costs and liabilities, affecting our business operations and financial condition. Our attempts to influence legislation face uncertainty and may divert resources from core operations.\nRegulatory Inquiries, Litigation & Disputes\nWe are frequently involved in legal and regulatory claims, including government inquiries and litigation related to short-term rentals, taxes, consumer protection, payment services, insurance, and data privacy. These proceedings are complex, costly, and time-consuming, requiring significant resources and potentially leading to fines, penalties, and operational changes. As our business grows, the number and complexity of these claims are expected to increase, potentially impacting our brand and financial condition.\nWe face litigation, inquiries, investigations, audits, and proceedings with governments and other entities over regulations affecting short-term rentals and platform liability. Changes in legal interpretations could further impact our operations. Additionally, we are subject to claims related to incidents at listings, such as personal injuries, cancellations and refunds, and privacy violations, as well as class action lawsuits and government inquiries. If we become more involved in hosts’ listings and conduct related to bookings, then we are more likely to draw scrutiny and additional regulations from governments and undercut various defenses we may have to claims or attempts to regulate us, which further constrain our business and impose additional liability on us as a platform.\nWe may also become more vulnerable to third-party claims as U.S. laws such as the Digital Millennium Copyright Act (“DMCA”), the Stored Communications Act, and the Communications Decency Act (“CDA”), and non-U.S. laws such as the Digital Services Act (“DSA”), the EU STR Regulation, and the European E-Commerce Directive and their national transpositions are interpreted by the courts or if they are otherwise modified or amended, as our platform and services to our hosts and guests continue to expand, and as we expand geographically into jurisdictions where the underlying laws with respect to the potential liability of online intermediaries such as ourselves are either unclear or less favorable.\nWe also face intellectual property disputes and indemnification obligations, which could lead to further litigation. In addition, compliance with escheatment laws and audits could result in additional liabilities and impact our financial results.\n17\nTable of Contents\nAdverse outcomes in legal proceedings may result in significant financial penalties, changes to business practices, increased costs and reputational damage. Litigation diverts resources and may not be fully covered by our existing insurance policies, which may not be available to us on financially reasonable terms in the future or at all. Additionally, if we enter an agreement with a government or governmental agency to resolve a dispute, the terms of such agreement may be publicly available and could create a precedent that may lead to similar disputes in other jurisdictions and may put us in a weaker bargaining position in future disputes with other governments. As we expand, we anticipate continued legal challenges that could materially adversely affect our business, results of operations, and financial condition. \nWe offer travel insurance products to guests, which subject us and our business to extensive laws, regulations, and supervision.\nSince June 2022, guests in certain jurisdictions have had the opportunity to purchase travel insurance when they make a booking. Over time, we expect to make travel insurance available to guests in additional countries. In the United States, travel insurance products are subject to extensive regulation in the states in which we transact business by state insurance departments. This regulation is generally designed to protect the interests of consumers. States have also adopted legislation defining and prohibiting unfair methods of competition and unfair or deceptive acts and practices in the business of insurance that may apply to insurance agencies. Noncompliance with any of such state statutes may subject us to regulatory action by the relevant state insurance regulator, and, in certain states, private litigation. In addition, we cannot predict the impact that any new laws, rules, or regulations, or unfavorable changes in or interpretations of existing laws, rules or regulations, may have on our business and financial results. States also regulate various aspects of the contractual relationships between insurers and independent agents. State insurance regulators may also conduct periodic examinations, the results of which could give rise to regulatory orders requiring remedial, injunctive, or other corrective action. Similarly, travel insurance products are subject to extensive regulation and supervision by the applicable regulators in the United Kingdom, Canada, Australia and the European Union. The failure to comply with applicable state and foreign laws and regulations could result in fines, investigations and/or civil or criminal proceedings against us by governmental agencies and/or consumers which, if material, could adversely affect our business, results of operations, and financial condition.\nAdditionally, insurance carriers with which we place business are subject to regulations, which may affect how we conduct our operations. We may need to expend resources to address questions or concerns regarding our relationships with these insurers and underwriters, diverting resources away from operating our business, which could adversely affect our business, results of operations, and financial condition.\nOur payments operations are subject to extensive, complex, overlapping and frequently changing government regulation and oversight and any failure or perceived failure to comply with such laws, rules, regulations, policies, legal interpretations, and regulatory guidance could materially adversely affect our business, results of operations, and financial condition. \nOur payments platform is subject to various laws, rules, regulations, policies, legal interpretations, and regulatory guidance, including those governing: cross-border and domestic money transmission and funds transfers; stored value and prepaid access; foreign exchange; data privacy, and data security; banking secrecy; payment services (including payment processing and settlement services); consumer protection; economic and trade sanctions; anti-corruption and anti-bribery; and anti-money laundering (“AML”) and counter-terrorist financing (“CTF”). As we expand further, we face varying and sometimes conflicting legal obligations. For example, certain transactions that may be permissible in one jurisdiction may be prohibited by sanctions, AML, CTF, or other regulations in a different jurisdiction. We regularly assess our compliance programs and may identify gaps requiring costly enhancements to our policies and controls.\nNon-compliance or perceived failure to comply with these existing or new laws and regulations, including changes to or expansion of their interpretations, can lead to significant fines, lawsuits, regulatory and/or governmental investigations, enforcement actions, loss of required licenses and other civil and criminal penalties, forcing us to alter operations or delay product launches, adversely affecting our brand, business, results of operations, financial condition and future prospects. The complexity of global regulations may trigger overlapping investigations by multiple authorities, impacting our relationships with financial institutions. Maintaining robust internal controls is essential to comply with these regulations, and failure to do so could result in reputational damage and substantial penalties.\nAirbnb Ireland Unlimited Company (“AIUC”) and Airbnb UK Services Limited (“AUKSL\") each operate as an “appointed representative” and utilize the license of regulated third parties (“principal firms”) to: (i) in the case of AIUC, act as a credit broker (presenting regulated third party consumer credit products to UK customers); and (ii) in the case of AUKSL, distribute guest travel insurance and host and experiences liability insurance. We are reliant on the principal firms to continue to permit us to use their licenses to offer or distribute these services/products and they can cancel our agreement, with notice, at any time, which could have an adverse impact on these revenue streams if we were unable to find suitable replacement principal firms. If we were found to have breached the terms of our agreement with the principal firms and/or breached regulatory requirements applicable to us, for example, by misrepresenting credit products to UK consumers, despite our not holding the licenses to perform these activities, we could nevertheless be liable to penalties imposed by the UK regulators. This could potentially also impact the UK licenses from the Financial Conduct Authority other of our group entities do currently hold (see \nPayments Regulation\n below).\nPayments Regulation \nIn the United States, our wholly-owned subsidiary, Airbnb Payments, Inc. (“Airbnb Payments”), is regulated as a “Money Services Business” by the Financial Crimes Enforcement Network and requires state licenses to act as a money transmitter. Compliance involves handling customer funds, record-keeping, and reporting, with potential licensing needs in unlicensed states due to regulatory changes. \nAirbnb Payments Luxembourg SA (“APLux”) operates as a licensed payments institution across the EEA from Luxembourg, while Airbnb Payments UK Limited (“APUK”) is licensed as an electronic money institution (“EMI”) providing payment services from the United Kingdom. Compliance with EEA and UK regulations, such as the EU Digital Operational Resilience Act Regulation, the Luxembourg implementation of the EU Second Payment Services Directive (“PSD2”) and the UK's Payment Services Regulations 2017 (“UK PSR”), involves complex and \n18\nTable of Contents\npotentially onerous requirements, including operational and payment security and strong customer authentication, which may increase compliance costs, raise risk of non-compliance, and impact the ease of usage of the payment features of the platform. \nAdditionally, the proposed EU Third Payment Services Directive (“PSD3”) and proposed regulation on the same (“EU PSR”) will include amendments to strong customer authentication and anti-fraud obligations amongst other day-to-day requirements. The United Kingdom is also considering areas for reform for its payment services regime, including information requirements regarding currency conversion charges, and notice provisions for the termination of customer contracts. When these proposed measures are finalized and in-force, they may increase our compliance costs and require additional resources as well as changes to our processes and operations. \nFrom time to time, we apply for licenses in new jurisdictions, which subject us to additional compliance requirements and regulatory scrutiny. In unclear regulatory environments, we partner with local banks and processors, but may face restrictions from local regulators or need additional licenses or approvals. Obtaining and maintaining compliance with global licensing and regulatory requirements incurs significant costs and operational changes, with potential fines or other enforcement actions for violations. These challenges could delay or restrict our services, affecting our business, results of operations, financial condition, and future prospects. \nConsumer Protection \nWe are subject to consumer protection laws in the United States and other countries where we operate. In the United States, the Dodd-Frank Act established the Consumer Financial Protection Bureau (“CFPB”), which enforces federal consumer financial protection laws. We must comply with these laws, including the Electronic Fund Transfer Act and Regulation E, which require service disclosures, error resolution, and consumer reimbursement for unauthorized transactions. The CFPB may adopt other regulations governing consumer financial services, including regulations defining unfair, deceptive, or abusive acts, potentially increasing our compliance costs and litigation risks. Consumer protection laws could also be violated inadvertently, for example as a result of technical bugs.\nViolations of consumer protection laws could lead to fines, penalties, and changes in business practices, incurring substantial costs. State attorneys general and other officials can enforce federal consumer protection laws, and various agencies can conduct investigations that may result in significant penalties.\nIn the United Kingdom and Luxembourg, payments-related consumer protection laws apply to APUK and APLux, and EU regulators may impose additional local requirements, including on our local banks and processors, potentially increasing costs or delaying business expansion in EU countries.\nWe also issue gift cards in the United States, United Kingdom, European Union and many other jurisdictions, which are subject to consumer protection laws, and may face additional regulations if we expand these services. \nAdditionally, our payment services are subject to U.S. data privacy laws, including the Gramm-Leach-Bliley Act of 1999 (“GLBA”), which governs the handling of personal information and imposes data security standards. Non-compliance could result in financial penalties. See our risk factor on data privacy and security compliance for more details.\nAnti-Money Laundering and Counter-Terrorist Financing \nWe are subject to various AML and CTF laws and regulations around the world, including the BSA and the UK Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017 (as amended) (the “MLRs”). Among other things, the BSA and MLRs require money services businesses (including money transmitters like Airbnb Payments) to implement risk-based AML and CTF programs, report suspicious transactions or activities, and maintain transaction records. We must also comply with, among other requirements, the UK Proceeds of Crime Act 2002 and Terrorism Act 2000, which prohibit the handling of criminal proceeds. We provide information to government agencies to assist in the detection and prevention of illegal activities and may be required to deny certain transactions, risking inadvertent denials of legal transfers.\nRegulators may demand enhancements to our compliance programs, including customer identity verification and transaction monitoring. In the United Kingdom and European Union, stricter AML regulations could increase compliance costs and operational challenges and/or require us not to provide services to certain clients, potentially reducing business. Non-compliance with local laws implementing EU directives could result in fines up to 10% of APLux’s annual revenue, and similar penalties apply to APUK under the MLRs. \nThe EU has agreed and adopted a comprehensive package of measures to reform the primary AML, CTF legislation across all EU 27 Member States (the package together is known as “MLD6”). This means that APLux will need to undertake a detailed impact assessment to the required uplifts to existing policies and procedures. This will likely result in material changes to the day to day AML and CTF operating procedures of APLux and material divergence between the AML and CTF rules applicable to APUK in the UK and those applicable to APLux, bringing with it increased costs and the regulatory enforcement risks (such as fines, censures and potentially the suspension or removal of regulatory licenses or controls placed on APLux’s ability to onboard new customers) associated with designing compliance with a nascent regime.\nWe are subject to governmental economic and trade sanctions laws and regulations that limit the scope of our offerings. Additionally, failure to comply with applicable economic and trade sanctions laws and regulations could subject us to liability and negatively affect our business, results of operations\n,\n and financial condition. \nWe must comply with economic and trade sanctions from governments where we operate, including U.S. agencies like the U.S. Treasury Department’s Office of Foreign Assets Control (“OFAC”), the Council of the European Union, the Office of Financial Sanctions Implementation of His Majesty’s Treasury in the United Kingdom (“OFSI”), and Luxembourg's Ministry of Finance. These sanctions restrict transactions or dealings with certain countries, regions, and governments, and certain individuals or entities, such as those operating, \n19\nTable of Contents\norganized, or resident in certain countries or regions or those listed on OFAC’s List of Specially Designated Nationals and Blocked Persons. Future sanctions in key business areas could materially impact our business, results of operations and financial condition.\nTo comply, we maintain and regularly update internal controls and report to OFAC, OFSI, and Luxembourg authorities on blocked or rejected payments and potential violations. Despite having these controls in place, there is a risk that we might inadvertently engage in transactions inconsistent with applicable sanctions laws. Any breaches or investigations could lead to claims or actions against us, affecting our business, results of operations, and financial condition. As we grow and as regulations evolve, we may need to invest further in our internal controls or adjust our operations.\nWe are subject to payment network rules\n,\n and any material modification of our payment card acceptance privileges could have a material adverse effect on our business, results of operations, and financial condition. \nThe loss of our credit and debit card acceptance privileges or the significant modification of the terms under which we obtain card acceptance privileges would significantly limit our business model since a vast majority of our guests pay using credit or debit cards. We must comply with payment card network rules, including the Payment Card Industry Data Security Standards (the “PCI DSS”), which requires robust internal controls over the use, storage, and transmission of card data to help prevent fraud. Compliance demands significant resources and ongoing attention, and any system failures could materially adversely affect our business, results of operations, and financial condition.\nNon-compliance with PCI DSS or payment network rules could breach our contracts with payment processors, leading to fines, penalties, and potential loss of card processing capabilities. Payment networks may also change rules, causing operational disruptions and compliance challenges. Even with compliance, we cannot guarantee the maintenance of our card acceptance privileges or the prevention of data or security breaches, illegal or improper use of our payments platform, or the theft, loss, or misuse of card data or the maintenance of card acceptance privileges.\nWe are also subject to network operating rules and guidelines promulgated by the National Automated Clearing House Association (“NACHA”) relating to payment transactions we process using the Automated Clearing House (“ACH”) Network, which may change and result in costly compliance measures. Failure to comply with these standards could result in losing our payment card acceptance privileges, materially affecting our business, results of operations, and financial condition.\nAvoiding regulation under the Investment Company Act may adversely affect our operations. \nThe Investment Company Act of 1940, as amended (the “Investment Company Act”), contains substantive legal requirements that regulate the manner in which “investment companies” are permitted to conduct their business activities. We currently conduct, and intend to continue to conduct, our operations so that neither we nor any of our subsidiaries are required to register as an investment company under the Investment Company Act. We are not engaged primarily, nor do we hold ourselves out as being engaged primarily, in the business of investing, reinvesting, or trading in securities. We do, however, make minority investments in companies and acquire other financial instruments from time to time that may be deemed investment securities. As such, there is no guarantee that we will continue to be exempt from registration under the Investment Company Act without taking actions that may adversely affect our operations. For example, to avoid being deemed an investment company we may be required to sell certain of our assets and pay significant taxes upon the sale or transfer of such assets, which may have a material adverse effect on our business, results of operations, and financial condition. \nEvolving focus on environmental, social, and governance issues by shareholders, customers, regulators, politicians, employees, and other stakeholders may impose additional risks and costs on our business.\nESG matters are an area of growing and evolving focus among our shareholders and other stakeholders, including customers, employees, regulators, politicians, and the general public in the United States and abroad. Companies like Airbnb face heightened expectations regarding matters such as environmental sustainability, diversity, human rights, and data privacy. We engage in various initiatives to serve our stakeholders in these and other areas, and to respond to stakeholder expectations regarding ESG, but such initiatives can be costly and may not have the desired effect. For example, many ESG initiatives (including related metrics and targets) are based on methodologies, standards, and data that are still evolving or are subject to variable interpretation; as with other companies, our approach to such matters evolves, and we cannot guarantee that our approach, either now or in future, will align with the expectations or preferences of any particular stakeholder or that certain disclosures will not be considered erroneous or subject to misinterpretation. \nMoreover, stakeholders have varying and sometimes conflicting perceptions of ESG matters. Both advocates and opponents of various issues are increasingly resorting to activism (including media campaigns and litigation) to advocate for their positions. Responding to such issues involves inherent costs, and any failure to successfully navigate stakeholder expectations could negatively impact our business, results of operations, financial condition, and stock price.\nThe regulatory landscape for ESG issues is also rapidly evolving, and various policymakers, including the European Union and State of California, among others, have adopted (or are considering adopting) requirements for climate- or other ESG-related disclosures or other actions. We may face risks related to sustainability reporting obligations under the evolving regulatory landscape in the European Union. Specifically, the Corporate Sustainability Reporting Directive (“CSRD”) and the Corporate Sustainability Due Diligence Directive (“CSDDD”) impose stringent requirements on companies to disclose detailed information regarding their ESG practices. Furthermore, the transposition of the CSRD by EU member states will also impact the scope of these requirements. Many member states have not yet transposed the directive, adding another layer of uncertainty to compliance efforts. Additionally, the EU's Omnibus Simplification Package introduces further complexity and uncertainty in the European Union. Compliance involves significant expenses and resources, with risks of errors in implementing necessary changes. These requirements are not uniform, and may not be interpreted or applied uniformly, which may increase the cost and complexity of compliance, as well as any related risks. Various of our suppliers and other stakeholders are subject to similar risks, which may exacerbate, or create additional, risks on such matters.\n20\nTable of Contents\nWe have been, and may in the future be, subject to claims that we or others violated certain third-party intellectual property rights, which, even where meritless, can be costly to defend and could materially adversely affect our business, results of operations, and financial condition. \nThe Internet and technology industries frequently face litigation over intellectual property rights, including allegations of infringement or misappropriation. We may encounter claims from third parties, including practicing and non-practicing entities, asserting that our platform, technologies, or branding infringe on or misappropriate their intellectual property rights. These claims can be costly and time-consuming to address, potentially diverting management's attention and resources.\nIntellectual property disputes could lead to significant liabilities, force us to cease using certain technologies or branding, or require us to obtain costly licenses or develop alternative solutions. These outcomes could increase our expenses and reduce our competitiveness, adversely affecting our business, results of operations, and financial condition.\nWe receive from time to time, communications from third parties, including practicing and non-practicing entities, claiming that we have infringed, misused, or otherwise misappropriated their intellectual property rights, including alleged patent infringement. Additionally, from time to time we have been involved in claims, suits, regulatory proceedings, and other proceedings involving alleged infringement, misuse, or misappropriation of third-party intellectual property rights, or relating to our intellectual property holdings and rights. While a number of the infringement claims raised against us have been based on our use or implementation of third-party technologies for which those third parties have been required to defend against the claims on our behalf and indemnify us from liability, intellectual property claims against us, regardless of merit, could be time consuming and expensive to litigate or settle, and could divert our management’s attention and other resources. \nAs we expand our offerings or acquire new businesses, our exposure to intellectual property claims may increase. Third parties may assert infringement claims related to newly acquired technologies or business areas, which could materially adversely affect our ability to compete and our business, results of operations, and financial condition.\nClaims for indemnification by our directors and officers may reduce our available funds to satisfy successful third-party claims against us and may reduce the amount of money available to us. \nOur restated certificate of incorporation and amended and restated bylaws provide that we will indemnify our directors and officers who are, or are threatened to be, made a party to or otherwise involved in an action, suit or proceeding by reason of the fact of their service to the Company, in each case to the fullest extent permitted by Delaware law. \nIn addition, as permitted by Section 145 of the Delaware General Corporation Law, our amended and restated bylaws and/or our indemnification agreements that we have entered or intend to enter into with our directors and officers and certain other employees provide that:\n•\nwe will indemnify our directors and officers to the fullest extent permitted by Delaware law. Delaware law provides that a corporation may indemnify such person if such person acted in good faith and in a manner such person reasonably believed to be in or not opposed to the best interests of the registrant and, with respect to any criminal proceeding, had no reasonable cause to believe such person’s conduct was unlawful; \n•\nunder certain circumstances we are required to advance expenses, as incurred, to our directors and officers in connection with defending a proceeding in advance of its final disposition, except that our obligation to provide advancement to such directors or officers is contingent upon their agreement to repay such advances if it is ultimately determined that such person is not entitled to indemnification; \n•\nwe may, in our discretion, (i) indemnify employees and agents in those circumstances where indemnification is permitted by applicable law, and (ii) advance expenses, as incurred, to our employees and agents in connection with defending a proceeding in advance of its final disposition, contingent on such employees’ or agents’ agreement to repay such advances if it is ultimately determined that such person is not entitled to indemnification;\n•\nwe are bound by any existing indemnification agreements for employees or agents;\n•\nthe rights conferred in our amended and restated bylaws are not exclusive, and we are authorized to enter into indemnification agreements with our directors, officers, employees, and agents and to obtain insurance to indemnify such persons; and \n•\nwe may not retroactively amend or repeal our amended and restated bylaws to reduce our indemnification or advancement obligations relating to any act or omission occurring prior to the time of such amendment or repeal. \nWhile we have procured directors’ and officers’ liability insurance policies, such insurance policies may not be available to us in the future at a reasonable rate, may not cover all potential claims for indemnification, and may not be adequate to indemnify us for all liability that may be imposed. \nWe have operations in countries known to experience high levels of corruption\n,\n and any violation of anti-corruption laws could subject us to penalties and other adverse consequences. \nWe are subject to anti-corruption laws and regulations including the U.S. Foreign Corrupt Practices Act (“FCPA”) and other laws in the United States and elsewhere (including the UK Bribery Act 2010) that prohibit improper payments or offers of payments to foreign governments and their officials, political parties, state-owned or controlled enterprises, and/or private entities and individuals for the purpose of obtaining or retaining business. We have operations in and deal with countries known to experience corruption. Our activities in these countries create the risk of unauthorized payments or offers of payments by one of our employees, contractors, agents, or users that could be in violation of various laws, including the FCPA and anti-corruption and anti-bribery laws in these countries. We have implemented policies, procedures, systems, and controls designed to ensure compliance with applicable laws and to discourage corrupt practices by our employees, consultants, and agents, and to identify and address potentially impermissible transactions under such laws and regulations; however, our \n21\nTable of Contents\nexisting and future safeguards, including training and compliance programs to discourage corrupt practices by such parties, may not prove effective, and we cannot ensure that all such parties, including those that may be based in or from countries where practices that violate U.S. or other laws may be customary, will not take actions in violation of our policies, for which we may be ultimately responsible. Additional compliance requirements may require us to revise or expand our compliance programs, including the procedures we use to monitor international and domestic transactions. Failure to comply with any of these laws and regulations may result in extensive internal or external investigations as well as significant financial penalties and reputational harm, which could materially adversely affect our business, results of operations, and financial condition.\nTechnology, Data and Cybersecurity Risks\nTechnology, Data Security and Cybersecurity \nCompliance with federal, state, and foreign laws relating to data privacy, data security, artificial intelligence, marketing and consumer protection involves significant expenditure and resources, and any actual or perceived failure by us or our vendors to comply may result in significant liability, litigation or other legal action against us, negative publicity, an erosion of trust, and/or result in regulatory scrutiny, fines and penalties and could materially adversely affect our business, results of operations, and financial condition. \nData privacy, data security, AI, marketing and consumer protection laws, rules, and regulations are complex and rapidly evolving and we could be materially adversely affected by new legal requirements or changes to existing requirements including their interpretations and enforcement practices. Compliance with such laws may require changes to our data processing practices, potentially increasing compliance costs or adversely affecting our business. We process personal data, such as names, dates of birth, email addresses, nationality, location information, Social Security numbers, phone numbers, and identity verification information (for example, government issued identification or passport), as well as credit card, bank account or other financial information, from and about hosts and guests, as well as our employees, job applicants, contractors and representatives of our third-party vendors, and other companies we do business with. We utilize third-party vendors, some of whom process data for us and provide various services, including but not limited to digital storage technology, business technology support, and other support functions. We and our vendors must comply with various state, federal, and foreign data privacy and security laws, rules, regulations, industry standards and other requirements, including those that generally require that we implement reasonable measures to keep such information secure and otherwise restrict the ways in which such information can be collected and used. These requirements, and their application, interpretation, and amendment are constantly evolving. \nAdditionally, we note that as the use of AI and machine learning technologies (“AI and ML Technologies”) continues to grow, regulators (including data protection regulators) are expected to take an increased interest in issues, such as how we and our vendors collect, maintain and process and provide transparency on the use of personal data of our users and/ or hosts in that context. Our technology platform incorporates the use of AI and ML Technologies, for example, for fraud detection, search, enabling customized features and enhancing community support. Enhanced scrutiny of the use of AI and ML Technologies means that regulators may increasingly seek advance engagement with businesses like ours in respect of certain types of data processing. In addition, certain existing legal regimes, including those relating to data privacy and consumer protection, regulate certain aspects of AI and ML Technologies, and new laws regulating AI and ML Technologies have been or may be enacted or have entered into force in jurisdictions that we operate. This may affect our use of AI and ML Technologies and our ability to provide, improve or commercialize our services effectively and efficiently and result in increased costs. For example, in the United States, California enacted seventeen new laws in 2024 that further regulate the use of AI and ML Technologies and provide consumers with additional protections around companies’ use of AI and ML Technologies, such as requiring companies to disclose certain uses of generative AI. Other states have also passed AI-focused legislation, such as Colorado’s Artificial Intelligence Act, which will require developers and deployers of “high-risk” AI systems to implement certain safeguards against algorithmic discrimination, and Utah’s Artificial Intelligence Policy Act, which establishes disclosure requirements and accountability measures for the use of generative AI in certain consumer interactions. Other legislation has been introduced or proposed at the federal and state level, and there remains uncertainty at the federal level regarding the regulation of AI and ML Technologies. Further, the EU Artificial Intelligence Act (the “EU AI Act”) entered into force in August 2024, and establishes a comprehensive, risk-based governance framework for AI in the EU market. The majority of the substantive requirements will apply from August 2026. The EU AI Act applies to companies that develop, use and/or provide AI in the EU and – depending on the AI use case – includes requirements around transparency, conformity assessments and monitoring, risk assessments, human oversight, security, accuracy, general purpose AI and foundation models, and fines for breach of up to 7% of worldwide annual turnover. These regulations may impact our ability to use, procure and commercialize AI and ML Technologies in the future, and we may need to expend resources to adjust our products or services, including if the laws are not consistent across jurisdictions.\nIn the European Union and the UK, we are subject to the European Union General Data Protection Regulation (the “EU GDPR”) and to the UK General Data Protection Regulation and Data Protection Act 2018 (the “UK GDPR”), respectively (the EU GDPR and UK GDPR together referred to as the “GDPR”), both of which have resulted, and will continue to result, in significantly greater compliance burdens and costs for companies like ours. The GDPR comprehensively regulates our use of personal data, including cross-border transfers of personal data out of Europe. Many large geographies in which we operate, including Australia, Brazil, Canada, China, India, and South Korea have passed or are in the process of passing comparable or other robust data privacy and security legislation or regulation, which may lead to additional costs and increase our overall risk exposure.\nIn relation to cross-border transfers of personal data outside of Europe, we expect the existing legal complexity and uncertainty regarding international personal data transfers to continue. In particular, the European Commission approval of the current EU-US Data Privacy Framework for data transfers to certified entities in the United States may be challenged, which could also lead to challenges to, or impact the effectiveness of, other data transfer mechanisms such as the standard contractual clauses (a standard form of contract approved by the European Commission as an adequate personal data transfer mechanism). In general, we expect that international transfers to the United States and to other jurisdictions more generally to continue to be subject to enhanced scrutiny by regulators and we cannot guarantee the ongoing efficacy of our data transfer mechanisms. It is also possible that transfers of personal data outside the United States could be restricted or impacted by developments at the federal level. As the regulatory guidance and enforcement landscape in relation to data transfers continue to develop, we could suffer additional costs, complaints, and/or regulatory investigations or fines, we may have to stop using certain tools and vendors and make other operational changes, including updating agreements or implementing additional safeguards which could otherwise affect the manner in which we provide our services, our ability to provide our services and adversely affect our business, results of operations, and financial condition.\n22\nTable of Contents\nFrom time to time, we receive correspondence, and are subject to more formal inquiries, from regulators including the Irish Data Protection Commission, our lead EU data protection regulator, regarding our personal data processing activities. To date, we have not received any fines in respect of statutory inquiries and have in place an internal process to review and process such inquiries to ensure we respond appropriately and update our privacy compliance with any findings.\nIn the United States, there are numerous federal and state data privacy and security laws, rules, and regulations governing the collection, maintenance, disclosure and processing of personal data, including federal and state data privacy laws, data breach notification laws, electronic communications laws, and marketing and consumer protection laws. For example, the Federal Trade Commission (“FTC”) and state regulators enforce a variety of data privacy issues, such as misrepresentations in privacy policies or failures to appropriately protect information about individuals, as unfair or deceptive acts or practices in or affecting commerce in violation of the FTC Act or similar state laws. Additionally, the GLBA and its implementing regulations, restrict and impose certain requirements on the processing of personal data, including notice to individuals of privacy practices and requirements for the safeguarding and proper destruction of personal data. Moreover, as we send marketing messages via email and short message service, or SMS, text messages, we are subject to the CAN-SPAM Act, which imposes certain obligations regarding the content of emails and providing and honoring opt-outs, and the Telephone Consumer Protection Act, which imposes restrictions on the ability to send text messages without prior consent.\nThe U.S. government, including Congress, the FTC, the CFPB and the Department of Commerce, has announced that it is reviewing the need for greater regulation for the collection of information concerning personal data processing practices and consumer behavior on the Internet, including regulation aimed at restricting certain targeted advertising practices. In addition, numerous states have enacted or are in the process of enacting state level data privacy laws and regulations governing the processing of state residents’ personal data that have and may continue to require us to modify our data processing practices and policies and incur related costs and expenses. For example, the California Consumer Privacy Act (“CCPA”) provides enhanced data privacy rights to California residents, such as affording residents the right to access and delete their data and to opt out of certain sharing and sales of personal data. The CCPA imposes a range of other compliance obligations and imposes severe statutory damages, which could lead to injunctive relief or agreed settlements providing for ongoing audit and reporting requirements, as well as a private right of action, for certain data breaches. This private right of action has increased the risks associated with data breach litigation. The enactment of the CCPA prompted a wave of similar legislative developments in other states, which creates a patchwork of overlapping but different state laws. For example, since the CCPA went into effect, comprehensive privacy statutes that share similarities with the CCPA are now in effect and enforceable in other states. Many other states have passed or proposed similar laws and there remains increased interest at the federal level as well.\nWe are also subject to evolving EU and UK privacy laws on cookies, tracking technologies and e-marketing. In the European Union and United Kingdom, informed consent is required for the placement of certain cookies or similar tracking technologies on an individual’s device and for direct electronic marketing. Recent European court and regulator decisions are driving increased attention to cookies and similar tracking technologies, which may lead to additional costs and increase our overall risk exposure.\nFurther, the majority of the substantive provisions of the DSA took effect in February 2024. The DSA governs, among other things, our potential liability for illegal services/products or content on our platform, obligations around traceability of business users, and requires enhanced transparency measures. In particular our obligations to diligence the services offered on our platform could require significant additional resources. Further, the DSA contains general requirements that user interfaces may not deceive or manipulate users which are yet to be clarified further by guidance. The DSA may increase our compliance costs, require changes to our user interfaces, processes, operations, and business practices which may adversely affect our ability to attract, retain and provide our services to customers, and may otherwise adversely affect our business, operations and financial condition. Failure to comply with the DSA can result in fines of up to 6% of total annual worldwide turnover and recipients of services have the right to seek compensation from providers in respect of damage or loss suffered due to infringement by the provider to comply with the DSA. Similarly, in the United Kingdom, the Online Safety Act 2023, or the OSA, establishes an extensive regulatory framework for certain user-to-user and search services and imposes obligations to protect users from illegal content which, if applicable, may increase compliance costs and may otherwise adversely affect our business, operations and financial condition. Failure to comply with the OSA can result in fines of up to 10% of total annual worldwide turnover or £18 million (whichever is greater).\nVarious other governments and consumer agencies around the world have also called for new regulation and changes in industry practices for protecting personal information collected and maintained electronically. Together, these existing and proposed laws add additional complexity, variation in requirements, restrictions and potential legal risk, require additional investment in resources to compliance programs and cybersecurity, which could impact strategies, and could result in increased compliance costs and/or changes in business practices and policies. Compliance with numerous and often contradictory requirements of different jurisdictions is particularly difficult for an online business such as ours, which collects personal information from hosts, guests, and other individuals in multiple jurisdictions. If any jurisdiction in which we operate adopts new laws or changes its interpretation of its laws, rules, or regulations relating to data residency or localization such that we are unable to comply in a timely manner or at all, we could risk losing our rights to operate in such jurisdictions. As in many cases these laws are relatively new and the interpretation and application of these laws is uncertain. There may be litigation, claims and enforcement relating to data privacy, and the processing of personal data may involve new interpretations of privacy laws. For example, there has been a noticeable increase in class actions in the United States where plaintiffs have utilized a variety of laws, including state wiretapping laws, in relation to the use of tracking technologies, such as cookies and pixels.\nFurthermore, to help improve the trust and safety on our platform, we conduct certain verification procedures aimed at our hosts, guests, and listings in certain jurisdictions. Such verification procedures may include utilizing public information on the Internet, accessing public databases such as court records, utilizing third-party vendors to analyze host or guest data, or physical inspection. These types of activities expose us to requirements of other laws and regulations, and to the risk of regulatory engagement and/or enforcement from privacy regulators, consumer protection agencies, consumer credit reporting agencies, and civil litigation. \nWhen we are required to disclose personal data to government agencies, such as tax authorities and law enforcement agencies, this could be perceived by third parties as non-compliance with data privacy and security laws, potentially leading to legal proceedings or actions \n23\nTable of Contents\nagainst us. Conversely, if we refuse to provide requested information due to a disagreement, such as on the interpretation of the law, we may face actions, litigation, and increased regulatory scrutiny, which could harm our relationships with governments and limit our ability to operate in certain regions. Any of the foregoing could materially adversely affect our brand, reputation, business, results of operations, and financial condition. \nAny failure or perceived failure by us and/or our vendors or third-party providers to comply with data privacy and data security laws, rules, or regulations could expose us to material penalties, significant legal liability, changes in how we operate or offer our products, and interruptions or cessation of our ability to operate in key geographies, any of which could materially adversely affect our business, results of operations, and financial condition. For example, as we are subject to both the EU GDPR and the UK GDPR, we could be fined under each regime independently in respect of the same breach. Penalties for certain breaches are up to the greater of €20 million or £17.5 million, or up to 4% of the annual global revenue of the infringer, whichever is greater. \nIn addition, any failure or perceived failure to comply with consumer protection, marketing, data privacy or data security laws, rules, and regulations; policies; industry standards; or enforcement notices and/or assessment notices (for a compulsory audit) could lead to legal actions by individuals, consumer rights groups, government agencies, or others. We may also face civil claims including representative actions and other class action type litigation (where individuals have suffered harm), potentially amounting to significant compensation, injunctive relief, or damages liabilities, as well as associated costs, and diversion of internal resources or other regulatory orders adversely impacting the ways our business can use personal data. These proceedings could be costly to litigate, whether or not they have merit, and result in negative publicity and erode trust, potentially requiring us to make costly changes to our business practices. If these events occur, they could materially and adversely impact our business operations, financial condition, and overall results.\nIT System capacity constraints, system or other operational failures could materially adversely affect our business, results of operations, and financial condition. \nSince our founding, we have experienced rapid growth in consumer traffic to our platform. We rely on computer systems, hardware, software, technology infrastructure, and online sites and networks for both internal and external operations that are critical to our business (collectively, “IT Systems”). We own and manage some of these IT Systems but also rely on third-party IT Systems for certain operations, including payment processing and accounting. Significant consumer growth or third-party failures may require costly upgrades, potentially affecting our business, and if our systems and network infrastructure cannot be expanded or are not scaled to cope with increased demand or fail to perform, we could experience significant operational interruptions, including poor performance, incorrect payments, search ranking issues, unanticipated disruptions in service, slower response times, and delays in the introduction of new offerings, decreased customer satisfaction, and loss of users. Our reliance on the Internet and mobile networks could also lead to disruptions in access. Our IT Systems, including those from third-party providers, are also vulnerable to damage or interruption from natural disasters. For example, our San Francisco operations are at risk from earthquakes and power outages, which could disrupt business operations. Such disruptions could materially adversely impact our business, results of operations, and financial condition. We have experienced IT System failures from time to time. While we invest in system reliability, these measures may not fully prevent downtime, and our existing business interruption insurance may not cover all losses or be available to us on economically reasonable terms in the future or at all. For further information, see the risk factor titled “If we or our third-party providers fail to protect confidential information and/or experience security incidents, there may be damage to our brand and reputation, material financial penalties, and legal liability, along with a decline in use of our platform, which would materially adversely affect our business, results of operations, and financial condition.”\nIf we do not adequately protect our intellectual property and our data, then our business, results of operations, and financial condition could be materially adversely affected. \nWe hold a broad collection of intellectual property rights, including those related to our brand; certain content and design elements on our platform; our code and our data; inventions and processes related to our platform, services, and research and development efforts; an extensive repository of wholly-owned audio and visual assets; marketing and promotional concepts and materials; a collection of editorial content; and certain entertainment-related assets. This includes registered domain names, registered and unregistered trademarks, service marks, and copyrights, patents, and patent applications, trade secret rights, licenses of intellectual property rights of various kinds, and other forms of intellectual property rights in the United States and in a number of countries around the world. To further protect our proprietary rights, from time to time we have acquired or licensed patents, trademarks, domain name registrations, and copyrights from third parties. Despite these protections, the use or misappropriation of our intellectual property rights by third parties can diminish the value of our brand and allow competitors to replicate our offerings. \nOur intellectual property assets and rights are essential to our business, and in the future, we may acquire or license additional patents or patent portfolios, or other intellectual property assets and rights from third parties, which could require significant cash expenditures. If the protection of our proprietary rights and data is inadequate to prevent unauthorized use or misappropriation by third parties, the value of our brand and other intangible assets may be diminished and competitors may be able to mimic our technologies, offerings, or features or methods of operations more effectively. If we fail to protect our intellectual property and data in a cost-effective and meaningful manner, our competitive standing could be harmed; our hosts, guests, other consumers, and corporate and community partners could devalue the content of our platform; and our brand, reputation, business, results of operations, and financial condition could be materially adversely affected. \nOur use of artificial intelligence and machine learning gives rise to legal, business, and operational risks, which may result in diminished performance, regulatory scrutiny, social impacts, reputational harm, and liability arising from the use of this technology. \nWe currently use AI and ML Technologies in our offerings, for example with respect to fraud detection, search, enabling customized features and enhancing community support.\nThe rapid evolution of AI and ML Technologies will continue to require the application of significant resources to adopt, develop, test, integrate, and maintain AI and ML Technologies included in our offerings in order to remain competitive and to help implement these \n24\nTable of Contents\ntechnologies responsibly and minimize unintended or harmful impacts. There are significant risks involved in adopting, developing, maintaining, and deploying these technologies, and there can be no assurance that the usage of such technologies will enhance our products or services or be beneficial to our business, including our efficiency or profitability. In particular, AI and ML Technologies may be incorrectly designed or implemented; may be trained or reliant on incomplete, inadequate, inaccurate, biased, or otherwise poor quality data or on data to which we or third parties do not have sufficient rights; and/or may be adversely impacted by unforeseen defects, technical challenges, cybersecurity threats, third-party litigation or regulatory action, or material performance issues. Any of the above could negatively impact the performance of our products, services and business, as well as our reputation, and we could incur liability and costs resulting from the actual or perceived violation of laws or contracts to which we are a party or civil claims. \nIn addition, AI and ML Technologies, including generative AI, may be vulnerable to adversarial user behavior or create inaccurate or misleading content or other discriminatory or unexpected results or behaviors, such as hallucinatory behavior that can generate irrelevant, unintended, nonsensical, or factually incorrect results. Our hosts, guests or others may rely on or use this flawed content or information to their detriment, which may expose us to brand or reputational harm, competitive harm, consumer complaints, legal liability, and other adverse consequences, any of which could materially adversely affect our business, results of operations, and financial condition. The use of AI and ML Technologies presents emerging ethical and social issues, and if we enable or offer solutions that draw scrutiny or controversy due to their perceived or actual impact on our customers or on society as a whole, we may experience brand or reputational harm, competitive harm, consumer complaints, legal liability, and other adverse consequences, any of which could materially adversely affect our business, results of operations, and financial condition.\nDevelopment, maintenance and operation of AI and ML Technologies requires additional investment in the development of proprietary datasets, machine learning models, and systems to monitor and test for accuracy, bias, and other variables, which are complex, costly, and could impact our profit margin as we expand the use of AI and ML Technologies in our offerings. Developing, testing, and deploying AI and ML Technologies also increase associated computing costs. \nIn addition to our proprietary technologies, we use AI and ML Technologies licensed from third parties. Our ability to continue to adopt, integrate and use such technologies at the scale we may need may be dependent on access to specific third-party software and infrastructure, such as processing hardware or third-party AI models, and we cannot control the quality, availability or pricing of such third-party software and infrastructure, especially in a highly competitive environment. If any such third-party AI and ML Technologies become incompatible with our offerings or unavailable for use or have degradations in performance, or if the providers of such models unfavorably change the terms on which their AI and ML Technologies are offered or terminate their relationship with us, our solutions may become less appealing to our customers. In addition, to the extent any third-party AI and ML Technologies are used as a vendor hosted service, any disruption, outage, or loss of information through such hosted services could disrupt our operations or solutions, damage our reputation, cause a loss of confidence in our solutions, or result in legal claims or proceedings, for which we may be unable to recover damages from the affected provider.\nWe face competition from other companies in our industry with respect to the development and deployment of AI and ML Technologies to enhance our competitive offerings. Those other companies may develop AI and ML Technologies that are similar or superior to ours and/or are more cost-effective and/or quicker to develop, deploy and maintain. Any inability to develop, offer or deploy new AI and ML Technologies as effectively, quickly and/or as cost-efficiently as our competitors could have a materially adverse impact on our operating results, customer relationships and growth.\nThe regulatory and intellectual property frameworks governing the use and protection of AI and ML Technologies and of its outputs are rapidly evolving, and we cannot predict how future legislation and regulation will impact our ability to offer and protect products or services that we develop which leverage AI and ML Technologies. Many federal, state and foreign government bodies and agencies have introduced or proposed additional laws and regulations. Additionally, existing laws and regulations may be interpreted in ways that would affect the operation of and availability of IP protection for our AI and ML Technologies. As a result, implementation standards, enforcement practices, and available scope of protection are likely to remain uncertain for the foreseeable future, and we cannot yet determine the impact future laws, regulations, or standards may have on our business (including our positioning with respect to our competition) and may not always be able to anticipate how to respond to these laws or regulations. Already, certain existing legal regimes (e.g., relating to data privacy) regulate certain aspects of AI and ML Technologies, and new laws regulating AI and ML Technologies are expected to continue to be proposed and enacted in the United States and globally. For further information related to AI laws and regulations that may affect our business, see the risk factor titled “Compliance with federal, state, and foreign laws relating to data privacy, data security, artificial intelligence, marketing and consumer protection involves significant expenditure and resources, and any actual or perceived failure by us or our vendors to comply may result in significant liability, litigation or other legal action against us, negative publicity, an erosion of trust, and/or result in regulatory scrutiny, fines and penalties and could materially adversely affect our business, results of operations, and financial condition.”\nIt is also possible that new laws and regulations will be adopted in the United States and in other non-U.S. jurisdictions, or that existing laws and regulations, including data privacy, consumer protection, competition laws, may be interpreted in ways that would limit our ability to use AI and ML Technologies for our business, or require us to change the way we use AI and ML Technologies in a manner that negatively affects the performance of our products, services, and business and requires us to expend resources and adjust our products or services in certain jurisdictions. Further, the cost to comply with such laws, regulations, or decisions and/or guidance interpreting existing laws, could be significant and would increase our operating expenses (such as by imposing additional reporting obligations regarding our use of AI and ML Technologies). Such an increase in operating expenses, as well as any actual or perceived failure to comply with such laws and regulations, could adversely affect our business, financial condition and results of operations.\nPlatform Performance and Integrity\nWe could face liability for information or content on or accessible through our platform. \n25\nTable of Contents\nWe could face claims relating to information or content that is made available on our platform. Our platform relies upon content that is created and posted by hosts, guests, or other third parties. Although content on our platform is typically generated by third parties, and not by us, claims of defamation, disparagement, negligence, warranty, personal harm, intellectual property infringement, or other alleged damages could be asserted against us, in addition to our hosts and guests. While we rely on legal exemptions and protections like the DMCA and CDA in the United States and the E-Commerce Directive in the European Union, varying laws and interpretations regarding immunity and responsibility across jurisdictions may limit these exemptions or defenses or create uncertainty regarding liability for information or content uploaded by hosts, guests, or other third parties. To the extent that Airbnb creates or is deemed to create or facilitate such content on the platform, these defenses may be less available. New regulations could increase our liability and compliance costs, impacting our business.\nIn the United States, changes to the CDA could reduce protections for online platforms. In the EU, the DSA and Digital Markets Act (“DMA”) introduced new compliance requirements and potential fines. Other regions, like Asia and Latin America, have or are developing regulations that could impose direct or secondary liability on platforms for harmful content. These laws may require us to implement costly measures to mitigate liability, affecting our platform's appeal and our brand reputation.\nThe EU's Consumer Rights Directive and the Unfair Commercial Practices Directive impose strict consumer protection requirements, with potential fines for non-compliance. Consumers and certain Consumer Protection Associations may bring individual claims against us, and the Collective Redress Directive allows for class actions across the EU, increasing our litigation risk. Compliance with these evolving regulations may increase operational costs and materially adversely affect our business, results of operations, and financial condition.\nMeasures that we are taking to improve the trust and safety of our platform may cause us to incur significant expenditures and may not be successful. \nWe have taken and continue to take measures to help improve the trust and safety on our platform, combat fraudulent activities and other misconduct, and help improve community trust, such as requiring identity and other information from hosts and guests, attempting to confirm the location of listings, removing suspected fraudulent listings or listings repeatedly reported by guests to be significantly not as described, and removing hosts and guests who fail to comply with our policies. While these initiatives are crucial for community trust, they can increase platform friction, potentially reducing host and guest activity and materially adversely affecting our business. These trust and safety efforts, including limited verification of hosts and listings and restrictions on certain types of bookings, our neighborhood hotline, or other initiatives, incur significant costs and may lead to fewer listings and bookings.\nAs a global platform, the implementation of these measures varies by region and may be limited by local laws. Despite our investments, we cannot guarantee these measures will be successful, significantly reduce criminal or fraudulent activity on or off our platform, or be sufficient to protect our reputation in the event of such activity. Additionally, our community standards, including commitments to inclusion and belonging that are required when a user joins Airbnb, may not always be clearly communicated or well understood by all parts of our community, leading to unmet expectations among hosts and guests, which may lead to fewer listings and bookings. \nWe are subject to payment-related fraud\n,\n and an increase in or failure to deal effectively with fraud, fraudulent activities, fictitious transactions, or illegal transactions would materially adversely affect our business, results of operations, and financial condition. \nWe process a significant volume and dollar value of transactions on a daily basis. When hosts do not fulfill their obligations to guests, there are fictitious listings or fraudulent bookings on our platform, or there are host account takeovers, we have incurred and will continue to incur losses from claims by hosts and guests, and these losses may be substantial. Such instances have and can lead to the reversal of payments received by us for such bookings, referred to as a “chargeback.” For the year ended December 31, 2024, total chargeback expense was $96 million. The capabilities of criminal fraudsters and the susceptibility of individuals to fraud pose ongoing risks. Despite measures to detect and reduce fraud, these efforts require continuous improvement to address evolving threats, especially with new payment methods and technology platforms.\nOur payments platform is vulnerable to illegal uses, such as money laundering and fraudulent listings, which can lead to legal claims, regulatory investigations, and reputational harm. While we strive to combat these activities, our measures may not always be effective, and failure to reduce fraud could result in fines, higher fees, or loss of payment card network access, which could materially adversely affect our business, results of operations and financial condition.\nOur use of third-party open-source software and our open-source contributions could adversely affect our ability to offer or protect our platform and services and subject us to costly litigation and other disputes. \nFrom time to time, we incorporate certain open-source software into our code base as we continue to develop our platform and services. Open source software is licensed by its authors or owners under open source licenses, which in some instances may subject us to certain unfavorable conditions, including requirements that we offer our products that incorporate the open source software for no cost, that we make publicly available the source code for any modifications or derivative works we create based upon, incorporating, or using the open source software, or that we license such modifications or derivative works under the terms of the particular open source license. In addition, the use of third-party open-source software could expose us to greater risks than the use of third-party commercial software to the extent open-source licensors do not provide warranties or controls on the functionality or origin of the software equivalent to those provided by third-party commercial software providers. We also license to others some of our software through open-source projects. Open sourcing our own software requires us to make the source code publicly available, and therefore can limit our ability to protect our intellectual property rights with respect to that software. From time to time, companies that use open-source software have faced claims challenging the use of open-source software or compliance with open-source license terms. Furthermore, there is an increasing number of open-source software license types, almost none of which have been tested in a court of law, resulting in a dearth of guidance regarding the proper legal interpretation of such licenses. We could be subject to suits by parties claiming ownership of what we believe to be open-source software or claiming noncompliance with open-source licensing terms. \n26\nTable of Contents\nInadvertent use of open-source software can occur in software development in the Internet and technology industries. Such inadvertent use of open source software could expose us to claims of non-compliance with the applicable terms of the underlying licenses, which could lead to unforeseen business disruptions, including being restricted from offering parts of our platform which incorporate the software, being required to publicly release proprietary source code, being required to re-engineer parts of our code base to comply with license terms, or being required to extract the open source software at issue. Our exposure to these risks may be increased as a result of evolving our core source code base, introducing new offerings, integrating acquired-company technologies, or making other business changes, including in areas where we do not currently compete. Any of the foregoing could adversely impact the value or enforceability of our intellectual property, and materially adversely affect our business, results of operations, and financial condition. \nIf we or our third-party providers fail to protect confidential information and/or experience security incidents, there may be damage to our brand and reputation, material financial penalties, and legal liability, along with a decline in use of our platform, which would materially adversely affect our business, results of operations, and financial condition. \nWe own and manage some IT Systems but also rely on third parties for a range of IT Systems and related products and services, including, among others, cloud computing services and other third parties for the provision of our community support operations. We face evolving cybersecurity risks that threaten the confidentiality, integrity, and availability of our and our third-party providers’ IT Systems and confidential information, including personal data and proprietary information. As we expand our technology use and collaborate with third parties, managing these threats becomes more challenging. These risks come from diverse threat actors, such as state-sponsored organizations, opportunistic hackers and hacktivists, as well as through diverse attack vectors, such as social engineering/phishing, malware (including ransomware), malfeasance by company insiders, suppliers or providers, and human or technological error, and as a result of malicious code embedded in open-source software, or misconfigurations, bugs, or other vulnerabilities in software and hardware that is integrated into our or our providers’ IT Systems, products or services. We have, from time to time, found defects or errors in our IT Systems that have resulted in, and may discover additional issues in the future that could result in, platform unavailability or system disruption, or the inability of our systems to implement timely updates that are required for regulatory compliance. Additionally, any integration of AI or machine learning in our or any providers’ operations, products or services poses new or unknown cybersecurity risks and challenges. Acquisitions of companies with vulnerable IT Systems further expose us to cybersecurity risks. \nWe encrypt certain data in transit and at rest, but advances in hacking and AI and machine learning may challenge our defenses. We and certain of our third-party service providers have experienced cyberattacks and other security incidents in the past, including distributed denial-of-service type attacks on our IT Systems that have made portions of our platform slow or unavailable for periods of time. Cyberattacks are expected to accelerate on a global basis in both frequency and magnitude as threat actors are becoming increasingly sophisticated in using techniques—including AI—that circumvent controls, evade detection, and remove forensic evidence, which means that we and our third-party providers may be unable to detect, investigate, contain or recover from future attacks or incidents in a timely or effective manner. Despite significant investments in security, we cannot fully mitigate these risks, and such security incidents could disrupt operations and lead to negative publicity, reputational damage, loss of users, increased support costs, regulatory fines, legal claims (including class actions), and significant financial losses, especially under laws which impose statutory damages per breached record, all of which could materially impact our business, results of operations, and financial condition.\nWe currently rely on a number of third-party service providers to host and deliver a significant portion of our platform and services, and any interruptions or delays in services from these third parties, such as those resulting from cybersecurity incidents, could impair the delivery of our platform and services, and our business, results of operations, and financial condition could be materially adversely affected. \nWe rely primarily on Amazon Web Services in the United States and abroad to host and deliver our platform. Third parties also provide services to key aspects of our operations, including Internet connections and networking, messaging, data storage and processing, trust and safety, security infrastructure, source code management, and testing and deployment. In addition, we rely on third parties for many aspects of our payments platform, and the vast majority of our community support operations is performed by a limited number of third-party service providers. We also rely on Google Maps and other third-party services for maps and location data that are core to the functionality of our platform, and we integrate applications, content, and data from third parties to deliver our platform and services. \nWe do not control the operation, physical security, or data security of any of these third-party providers. Despite our efforts to use commercially reasonable diligence in the selection and retention of such third-party providers, such efforts may be insufficient or inadequate to prevent or remediate such risks. Some of our third-party providers, including our cloud computing providers and our payment processing partners, have been and may be subject to further intrusions, computer viruses, malicious software (such as ransomware), denial-of-service attacks, phishing attacks, sabotage, acts of vandalism, terrorism, or other misconduct, and incidents due to inadvertent error or malfeasance by employees, contractors or other parties. There can be no assurance that our service providers will anticipate or prevent all types of attacks or that any security measures will be effective against all types of cybersecurity threats and risks. Our service providers are vulnerable to damage or interruption from power loss, telecommunications failures, fires, floods, earthquakes, hurricanes, tornadoes, and similar events, and they may be subject to financial, legal, regulatory, and labor issues, each of which may impose additional costs or requirements on us or prevent these third parties from providing services to us or our customers on our behalf. In addition, these third parties may breach their agreements with us, disagree with our interpretation of contract terms or applicable laws and regulations, refuse to continue or renew these agreements on commercially reasonable terms or at all, fail to or refuse to process transactions or provide other services adequately, take actions that degrade the functionality of our platform and services, increase prices, impose additional costs or requirements on us or our customers, or give preferential treatment to our competitors. If we are unable to procure alternatives in a timely and efficient manner and on acceptable terms, or at all, we may be subject to business disruptions, losses, or costs to remediate any of these deficiencies and reputational harm. Our systems currently do not provide complete redundancy of data storage or processing or payment processing, and business continuity and disaster recovery plans may not be effective. The occurrence of any of the above events could result in hosts and guests ceasing to use our platform, reputational damage, legal or regulatory proceedings, or other adverse consequences, which could materially adversely affect our business, results of operations, and financial condition. \n27\nTable of Contents\nRisks Related to Ownership of Our Class A Common Stock\n \nStock Price and Volatility Risks \nOur focus on the long-term best interests of our Company and our consideration of all of our stakeholders, including our hosts, guests, the communities in which we operate, employees, and shareholders, may conflict with short- or medium-term financial interests and business performance, which may negatively impact the value of our Class A common stock. \nWe believe that prioritizing the long-term interests of our Company and stakeholders, including hosts, guests, the communities in which we operate, employees, and shareholders, will help ensure sustained success and long-term shareholder value. This focus may lead us to make decisions that negatively impact short- or medium-term business performance or the trading price of our Class A common stock, potentially making it less attractive to short-term investors. Our long-term strategies, such as enhancing platform trust and safety, improving community support, investing in relationships, and adapting to regulations, may not result in the long-term benefits that we expect, in which case our business, results of operations, and financial condition, as well as the trading price of our Class A common stock, could be materially adversely affected.\nOur share price has been, and may continue to be, volatile, and the value of our Class A common stock may decline. \nThe market price of our Class A common stock has been, and may continue to be, volatile and could be subject to wide fluctuations in response to the Risk Factors described in this Annual Report on Form 10-K, and others beyond our control, including: \n•\nactual or anticipated fluctuations in our revenue or other operating metrics; \n•\nour actual or anticipated operating performance and the operating performance of our competitors; \n•\nchanges in the financial projections we provide to the public or our failure to meet these projections; \n•\nfailure of securities analysts to initiate or maintain coverage of us, changes in financial estimates by any securities analysts who follow our Company, or our failure to meet the estimates or the expectations of investors; \n•\nany major change in our board of directors, management, or key personnel; \n•\nthe economy as a whole and market conditions in our industry; \n•\nrumors and market speculation involving us or other companies in our industry; \n•\nannouncements by us or our competitors of significant innovations, new products, services, features, integrations, or capabilities, acquisitions, strategic investments, partnerships, joint ventures, or capital commitments; \n•\nthe legal and regulatory landscape and changes in the application of existing laws or adoption of new laws that impact our business, hosts, and/or guests, including changes in short-term occupancy and tax laws; \n•\nlegal and regulatory claims, litigation, or pre-litigation disputes and other proceedings; \n•\nthe impact of pandemics, epidemics, or other health emergencies on the travel and accommodations industries; \n•\nother events or factors, including those resulting from war, incidents of terrorism, or responses to these events; and \n•\nsales or expected sales of our Class A common stock by us, our officers, directors, principal stockholders, and employees. \nIn addition, stock markets, and the trading of travel companies’ and technology companies’ stocks in particular, have experienced significant price and volume fluctuations that have affected and continue to affect the market prices of equity securities of many companies. Stock prices of many companies, including travel companies and technology companies, have fluctuated in a manner often unrelated to the operating performance of those companies. In the past, stockholders have instituted securities class action litigation following periods of stock volatility. If we were to become involved in securities litigation, it could subject us to substantial costs, divert resources and the attention of management from our business, and materially adversely affect our business, results of operations, and financial condition. \nOur multi-series structure may have a material adverse effect on the market price of our Class A common stock. \nOur multi-series structure may result in a lower or more volatile market price of our Class A common stock, adverse publicity, or other adverse consequences. The multi-series structure of our common stock could make us ineligible for inclusion in certain indices and, as a result, mutual funds, exchange-traded funds, and other investment vehicles that attempt to passively track those indices may not invest in our Class A common stock. It is unclear what effect, if any, such policies and restrictions could have on the valuations of publicly-traded companies excluded from such indices, but it is possible that they may depress valuations, as compared to similar companies that are included, and could make our Class A common stock less attractive to other investors. As a result, the market price of our Class A common stock could be adversely affected. \nWe cannot guarantee that our share repurchase program will be utilized to the full value approved or that it will enhance long-term stockholder value.\nOur board of directors has authorized management to repurchase shares of our Class A common stock at management’s discretion. Share repurchases may be made through a variety of methods, which may include open market purchases, privately negotiated transactions, block trades, or accelerated share repurchase transactions or by any combination of such methods. Any such repurchases will be made from time to time subject to market and economic conditions, applicable legal requirements, and other relevant factors. The manner, timing and amount of any share repurchases may fluctuate and will be determined by us based on a variety of factors, including the market price of our common stock, our priorities for the use of cash to support our business operations and plans, general business and market conditions, tax laws, and alternative investment opportunities, all of which may be further impacted by macroeconomic conditions and factors, including rising interest rates, and inflation, tariffs, global conflicts, and public health crises. Our share repurchase program authorizations do not have an expiration date nor do they obligate us to acquire any specific number or dollar value of shares. Our share repurchase programs may be modified, suspended, or terminated at any time, which may result in a decrease in the trading prices of our Class A common stock. Additionally, the Inflation Reduction Act of 2022 introduced a 1% excise tax on share repurchases, which increases the costs associated with \n28\nTable of Contents\nrepurchasing shares of our common stock. Even if our share repurchase programs are fully implemented, they may not enhance long-term stockholder value or may not prove to be the best use of our cash. Share repurchases could have an impact on our share trading prices, increase the volatility of the price of our Class A common stock, or reduce our available cash balance such that we will be required to seek financing to support our operations.\nUnder our restated certificate of incorporation, we are authorized to issue 2,000,000,000 shares of Class C common stock. Any future issuance of Class C common stock may have the effect of further concentrating voting control in the holders of our Class B common stock, including the Class B common stock held by our founders, and may discourage potential acquisitions of our business, and could have an adverse effect on the trading price of our Class A common stock. \nUnder our restated certificate of incorporation, we are authorized to issue 2,000,000,000 shares of Class C common stock. We may in the future issue shares of Class C common stock for a variety of corporate purposes, including financings, acquisitions, investments, and equity incentives to our employees, consultants, and directors. Our authorized but unissued shares of Class C common stock are available for issuance with the approval of our board of directors without stockholder approval, except as may be required by the Listing Rules of The Nasdaq Stock Market LLC (“Nasdaq”). Because the Class C common stock carries no voting rights (except as otherwise required by law), is not convertible into any other capital stock, and is not listed for trading on an exchange or registered for sale with the SEC, shares of Class C common stock may be less liquid and less attractive to any future recipients of these shares than shares of Class A common stock, although we may seek to list the Class C common stock for trading and register shares of Class C common stock for sale in the future. In addition, because our Class C common stock carries no voting rights (except as otherwise required by law), if we issue shares of Class C common stock in the future, the holders of our Class B common stock, including our founders who are parties to a Nominating Agreement and a Voting Agreement, may be able to elect all of our directors and to determine the outcome of most matters submitted to a vote of our stockholders for a longer period of time than would be the case if we issued Class A common stock rather than Class C common stock in such transactions. This concentrated control could delay, defer, or prevent a change of control, merger, consolidation, takeover, or other business combination involving us that stockholders may otherwise support, and could allow us to take actions that some of our stockholders do not view as beneficial, which could reduce the trading price of our Class A common stock. Furthermore, this concentrated control could also discourage a potential investor from acquiring our Class A common stock due to the limited voting power of such stock relative to the Class B common stock and might harm the trading price of our Class A common stock. In addition, if we issue shares of Class C common stock in the future, such issuances would have a dilutive effect on the economic interests of our Class A and Class B common stock. Any such issuance of Class C common stock could also cause the trading price of our Class A common stock to decline. \nWe may raise additional capital in the future or otherwise issue equity, which could have a dilutive effect on existing stockholders and adversely affect the market price of our common stock. If we require additional funding to support our business, this additional funding may not be available on reasonable terms or at all. \nWe may from time to time issue additional shares of common stock, including as consideration for any future acquisitions. As a result, our stockholders may experience immediate dilution. We may engage in equity or debt financings to secure additional funds. If we raise additional funds through future issuances of equity or convertible debt securities, our existing stockholders could suffer significant dilution, and any new equity securities we issue could have rights, preferences, and privileges superior to those of holders of our Class A common stock. In addition, our stockholders will experience additional dilution when option holders exercise their right to purchase common stock under our equity incentive plans, when RSUs vest and settle, when we issue equity awards to our employees under our equity incentive plans, or when we otherwise issue additional equity. Additionally, the terms of future debt agreements could include more restrictive covenants, which could further restrict our business operations.\nThere has been increased volatility in the financial and securities markets, which has generally made access to capital less certain and increased the cost of obtaining new capital. Should we require additional funding, we cannot be sure that additional financing will be available to us on reasonable terms or at all. If we cannot raise additional funds when we need them, our ability to continue to support our business and to respond to business challenges would be significantly limited, and our business, results of operations, and financial condition would be materially adversely affected.\nCorporate Governance and Control\nThe multi-series structure of our common stock has the effect of concentrating voting control with certain holders of our common stock, including our directors, executive officers, and 5% stockholders, and their respective affiliates. This ownership limits or precludes other stockholders’ ability to influence corporate matters, including the election of directors, amendments of our organizational documents, and any merger, consolidation, sale of all or substantially all of our assets, or other major corporate transaction requiring stockholder approval. \nOur Class A common stock has one vote per share, our Class B common stock has 20 votes per share, our Class C common stock has no votes per share, and our Class H common stock has no votes per share. Because of the 20-to-one voting ratio between our Class B and Class A common stock, the holders of our Class B common stock collectively continue to control a significant percentage of the combined voting power of our common stock and therefore are able to control all matters submitted to our stockholders for approval until all such outstanding shares of Class B common stock have converted into shares of our Class A common stock. Furthermore, our founders, who collectively hold a majority of the voting power of our outstanding capital stock, are party to a Voting Agreement under which each founder and his affiliates and certain other entities agree to vote their shares for the election of each individual founder to our board of directors. We and each of our founders are party to a Nominating Agreement under which we and the founders are required to take certain actions to include the founders in the slate of nominees nominated by our board of directors for the applicable class of directors, include them in our proxy statement, and solicit proxies or consents in favor of electing each founder to our board of directors. This concentrated control limits or precludes other stockholders’ ability to influence corporate matters for the foreseeable future, including the election of directors, amendments of our organizational documents, and any merger, consolidation, sale of all or substantially all of our assets, or other major \n29\nTable of Contents\ncorporate transaction requiring stockholder approval. In addition, this may prevent or discourage unsolicited acquisition proposals or offers for our capital stock that stockholders may believe are in their best interest. \nTransfers by holders of Class B common stock will generally result in those shares converting to Class A common stock, subject to limited exceptions, such as certain transfers effected for estate planning purposes or transfers among our founders, if all of our founders agree to such transfers. Each share of our Class B common stock is convertible at any time at the option of the Class B holder into one share of Class A common stock. The conversion of Class B common stock to Class A common stock will have the effect, over time, of increasing the relative voting power of those holders of Class B common stock who retain their shares in the long term. As a result, it is possible that one or more of the persons or entities holding our Class B common stock could gain significant voting control as other holders of Class B common stock sell or otherwise convert their shares into Class A common stock. In addition, the conversion of Class B common stock to Class A common stock dilutes holders of Class A common stock in terms of voting power within the Class A common stock. In addition, any future issuances of common stock would be dilutive to holders of Class A common stock. For example, because our Class C common stock carries no voting rights (except as otherwise required by law), if we issue Class C common stock in the future, the holders of Class B common stock may be able to elect all of our directors and to determine the outcome of most matters submitted to a vote of our stockholders for a longer period of time than would be the case if we issued Class A common stock rather than Class C common stock in such transactions. Further, each outstanding share of Class H common stock will convert into a share of Class A common stock on a share-for-share basis upon the sale of such share of Class H common stock to any person or entity that is not our subsidiary, which would dilute holders of Class A common stock in terms of voting power within the Class A common stock. \nAnti-takeover provisions contained in our restated certificate of incorporation and amended and restated bylaws, as well as provisions of Delaware law, could impair a takeover attempt. \nOur restated certificate of incorporation and amended and restated bylaws contain, and Delaware law contains, provisions which could have the effect of rendering more difficult, delaying, or preventing an acquisition deemed undesirable by our board of directors. These provisions provide for the following: \n•\na multi-series structure which provides our holders of Class B common stock with the ability to significantly influence the outcome of matters requiring stockholder approval, even if they own significantly less than a majority of the shares of our outstanding Class A common stock, Class B common stock, Class C common stock, and Class H common stock; \n•\na classified board of directors with three-year staggered terms, who can only be removed for cause, which may delay the ability of stockholders to change the membership of a majority of our board of directors; \n•\nno cumulative voting in the election of directors, which limits the ability of minority stockholders to elect director candidates; \n•\nthe exclusive right of our board of directors to set the size of the board of directors and to elect a director to fill a vacancy, however occurring, including by an expansion of the board of directors, which prevents stockholders from being able to fill vacancies on our board of directors; \n•\nthe ability of our board of directors to authorize the issuance of shares of preferred stock and to determine the price and other terms of those shares, including voting or other rights or preferences, without stockholder approval, which could be used to significantly dilute the ownership of a hostile acquiror; \n•\nthe ability of our board of directors to alter our amended and restated bylaws without obtaining stockholder approval; \n•\nin addition to our board of directors’ ability to adopt, amend, or repeal our amended and restated bylaws, our stockholders may adopt, amend, or repeal our amended and restated bylaws only with the affirmative vote of the holders of at least 66 2/3% of the voting power of all our then-outstanding shares of capital stock; \n•\nthe required approval of (i) at least 66 2/3% of the voting power of the outstanding shares of capital stock entitled to vote generally in the election of directors, voting together as a single class, to adopt, amend, or repeal certain provisions of our restated certificate of incorporation and (ii) for so long as any shares of Class B common stock are outstanding, the holders of at least 80% of the shares of Class B common stock outstanding at the time of such vote, voting as a separate series, to adopt, amend, or repeal certain provisions of our restated certificate of incorporation; \n•\nthe ability of stockholders to act by written consent only as long as holders of our Class B common stock hold at least 50% of the voting power of our capital stock; \n•\nthe requirement that a special meeting of stockholders may be called only by an officer of our Company pursuant to a resolution adopted by a majority of our board of directors then in office or the chairperson of our board; \n•\nadvance notice procedures that stockholders must comply with in order to nominate candidates to our board of directors or to propose matters to be acted upon at a stockholders’ meeting, which may discourage or deter a potential acquiror from conducting a solicitation of proxies to elect the acquiror’s own slate of directors or otherwise attempting to obtain control of us; and \n•\nthe limitation of liability of, and provision of indemnification to, our directors and officers. \nThese provisions, alone or together, could delay or prevent hostile takeovers and changes in control or changes in our management. \nAs a Delaware corporation, we are also subject to provisions of Delaware law, including Section 203 of the General Corporation Law of the State of Delaware (the “Delaware General Corporation Law”), which prevents some stockholders holding more than 15% of our outstanding common stock from engaging in certain business combinations without approval of the holders of substantially all of our outstanding common stock. \nAny provision of our certificate of incorporation, bylaws or Delaware law that has the effect of delaying or deterring a change in control could limit the opportunity for our stockholders to receive a premium for their shares of our common stock, and could also affect the price that some investors are willing to pay for our common stock. \nOur restated certificate of incorporation and amended and restated bylaws provide for an exclusive forum in the Court of Chancery of the State of Delaware for certain disputes between us and our stockholders, and that the federal district courts of the United States \n30\nTable of Contents\nwill be the exclusive forum for the resolution of any complaint asserting a cause of action under the Securities Act, which could limit our stockholders’ ability to obtain a favorable judicial forum for disputes with us or our directors, officers, or other employees.\nOur restated certificate of incorporation and amended and restated bylaws provide, that: (i) unless we consent in writing to the selection of an alternative forum, the Court of Chancery of the State of Delaware (or, if such court does not have subject matter jurisdiction thereof, the federal district court of the State of Delaware) will, to the fullest extent permitted by law, be the sole and exclusive forum for: (a) any derivative action or proceeding brought on behalf of the Company, (b) any action asserting a claim for or based on a breach of a fiduciary duty owed by any of our current or former director, officer, other employee, agent, or stockholder to the Company or our stockholders, including without limitation a claim alleging the aiding and abetting of such a breach of fiduciary duty, (c) any action asserting a claim against the Company or any of our current or former director, officer, employee, agent, or stockholder arising pursuant to any provision of the Delaware General Corporation Law or our certificate of incorporation or bylaws or as to which the Delaware General Corporation Law confers jurisdiction on the Court of Chancery of the State of Delaware, or (d) any action asserting a claim related to or involving the Company that is governed by the internal affairs doctrine; (ii) unless we consent in writing to the selection of an alternative forum, the federal district courts of the United States will, to the fullest extent permitted by law, be the sole and exclusive forum for the resolution of any complaint asserting a cause of action arising under the Securities Act, and the rules and regulations promulgated thereunder; (iii) any person or entity purchasing or otherwise acquiring or holding any interest in shares of capital stock of the Company will be deemed to have notice of and consented to these provisions; and (iv) failure to enforce the foregoing provisions would cause us irreparable harm, and we will be entitled to equitable relief, including injunctive relief and specific performance, to enforce the foregoing provisions. Nothing in our restated certificate of incorporation or amended and restated bylaws precludes stockholders that assert claims under the Securities Exchange Act of 1934, as amended (the “Exchange Act”), from bringing such claims in federal court to the extent that the Exchange Act confers exclusive federal jurisdiction over such claims, subject to applicable law. \nWe believe these provisions may benefit us by providing increased consistency in the application of Delaware law and federal securities laws by chancellors and judges, as applicable, particularly experienced in resolving corporate disputes, efficient administration of cases on a more expedited schedule relative to other forums, and protection against the burdens of multi-forum litigation. If a court were to find the choice of forum provision that is contained in our restated certificate of incorporation or amended and restated bylaws to be inapplicable or unenforceable in an action, we may incur additional costs associated with resolving such action in other jurisdictions, which could materially adversely affect our business, results of operations, and financial condition. For example, Section 22 of the Securities Act creates concurrent jurisdiction for federal and state courts over all suits brought to enforce any duty or liability created by the Securities Act or the rules and regulations thereunder. Accordingly, there is uncertainty as to whether a court would enforce such a forum selection provision as written in connection with claims arising under the Securities Act. \nThe choice of forum provisions may limit a stockholder’s ability to bring a claim in a judicial forum that it finds favorable for disputes with us or any of our current or former directors, officers, other employees, agents, or stockholders of the Company, which may discourage such claims against us or any of our current or former directors, officers, other employees, agents, or stockholders of the Company and result in increased costs for investors to bring a claim. \nItem 1B. Unresolved Staff Comments\nNone. \nItem 1C. Cybersecurity\nCybersecurity Risk Management and Strategy\nWe have developed and implemented a cybersecurity risk management program intended to protect the confidentiality, integrity, and availability of our critical systems and information, including information pertaining to hosts, guests, employees, and other users. Our cybersecurity risk management program includes a cybersecurity incident response plan (“Incident Response Plan”). \nOur cybersecurity risk management program is integrated into our overall enterprise risk management program and, while distinct in certain aspects described below, the program shares common methodologies, reporting channels and governance processes that apply across the enterprise risk management program to other legal, compliance, strategic, operational, and financial risk areas.\nOur cybersecurity risk management program includes:\n•\nrisk assessments designed to help identify material cybersecurity risks to our critical systems, information, products, services, and our broader enterprise IT environment;\n•\nan information security team who, in collaboration with the broader technology organization, manages and maintains our (1) cybersecurity risk assessment processes including our Incident Response Plan, (2) security controls, and (3) response to cybersecurity incidents;\n•\nthe use of external service providers, where appropriate, to assess, test or otherwise assist with aspects of our security controls\n;\n•\ncybersecurity awareness training of our employees, incident response personnel, and senior management; \n•\nan Incident Response Plan that includes procedures for recognizing and responding to cybersecurity incidents; and\n•\na third-party risk management process for service providers, suppliers, and vendors who have access to our critical systems and information.\nThere can be no assurance that our cybersecurity risk management program and processes, including our policies, controls or procedures, will be fully implemented, complied with or effective in protecting our systems and confidential information. \nWe have not identified risks from known cybersecurity threats, including as a result of any prior cybersecurity incidents, that have materially affected or are reasonably likely to materially affect us, including our operations, business strategy, results of operations, or financial condition.\n31\nTable of Contents\nCybersecurity Governance\nOur board of directors considers cybersecurity risk as part of its risk oversight function and has delegated to the Audit Risk and Compliance Committee (the “Audit Committee”) oversight of cybersecurity, privacy and other information technology risks. The Audit Committee has responsibility for oversight of management’s implementation of our cybersecurity risk management program.\n \nThe Audit Committee receives regular reports and briefings from management on our cybersecurity risks and cybersecurity risk management program updates. In addition, management updates the Audit Committee, as necessary, regarding any material cybersecurity incidents, as well as any incidents with lesser impact potential.\n \nOur management team, including our Chief Legal Officer, our Chief Security Officer and our Chief Technology Officer, is responsible for assessing and managing our material risks from cybersecurity threats.\n The team has primary responsibility for our overall cybersecurity risk management program and supervises both our internal information security team and our retained external cybersecurity consultants. \nOur management team has over 20 years of cybersecurity technology leadership experience.\n \nOur management team supervises our information security team’s efforts to prevent, detect, mitigate, and remediate cybersecurity risks and incidents through various means, which may include briefings from internal security personnel; threat intelligence and other information obtained from governmental, public or private sources, or external consultants engaged by us; and alerts and reports produced by security tools deployed in the IT environment."
}