{
  "ticker": "ABT",
  "cik": "0000001800",
  "company_name": "ABBOTT LABORATORIES",
  "filing_date": "2025-02-21",
  "accession": "0001628280-25-007110",
  "primary_doc": "abt-20241231.htm",
  "item1_text": "Item 16.\nForm 10-K Summary\n89\nSignatures\n90\nTable of Contents\nPART I\nITEM 1. BUSINESS\nGENERAL DEVELOPMENT OF BUSINESS\nAbbott Laboratories is an Illinois corporation, incorporated in 1900. Abbott’s* principal business is the discovery, development, manufacture, and sale of a broad and diversified line of healthcare products.\nNARRATIVE DESCRIPTION OF BUSINESS\nAbbott has four reportable segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices.\nEstablished Pharmaceutical Products\nThese products include a broad line of branded generic pharmaceuticals manufactured worldwide and marketed and sold outside the United States in emerging markets. These products are generally sold directly to wholesalers, distributors, government agencies, healthcare facilities, pharmacies, and independent retailers from Abbott-owned distribution centers or public warehouses, depending on the market served. Certain products are co-marketed or co-promoted with, or licensed from, other companies.\nThe principal products included in the broad therapeutic area portfolios of the Established Pharmaceutical Products segment are:\n•\ngastroenterology products, including Creon™, for the treatment of pancreatic exocrine insufficiency associated with several underlying conditions, including cystic fibrosis and chronic pancreatitis; Duspatal™ and Dicetel™, for the treatment of irritable bowel syndrome or biliary spasm; Heptral™, Transmetil™, and Samyr™, for the treatment of intrahepatic cholestasis (associated with liver disease) or depressive symptoms; and Duphalac™, for regulation of the physiological rhythm of the colon;\n•\nwomen’s health products, including Duphaston™, for the treatment of many different gynecological disorders; and Femoston™, a hormone replacement therapy for postmenopausal women;\n•\ncardiovascular and metabolic products, including Lipanthyl™ and TriCor™, for the treatment of dyslipidemia; Omacor™, for the treatment of hypertriglyceridemia; Physiotens™, for the treatment of hypertension; and Synthroid™, for the treatment of hypothyroidism;\n•\npain and central nervous system products, including Serc™, for the treatment of Ménière’s disease and vestibular vertigo; Brufen™, for the treatment of pain, fever, and inflammation; and Sevedol™, for the treatment of severe migraines; \n•\nrespiratory drugs and vaccines, including the anti-infective clarithromycin (sold under the trademarks Klacid™, Claribid™, and Klaricid™); and Influvac™, an influenza vaccine; and\n•\nbiosimilar products, including the areas of oncology and women's health.\nThe Established Pharmaceutical Products segment directs its primary marketing efforts toward building strong brands with key stakeholders, including consumers, pharmacists, physicians, and other healthcare providers. Government agencies are also important customers.\nCompetition in the Established Pharmaceutical Products segment is generally from other healthcare and pharmaceutical companies. In addition, the substitution of generic drugs for the brand prescribed and introduction of additional forms of already marketed established products by generic or branded competitors may increase competitive pressures.\n________________________________________________________\n*\nAs used throughout the text of this report on Form 10-K, the term “Abbott” refers to Abbott Laboratories, an Illinois corporation, or Abbott Laboratories and its consolidated subsidiaries, as the context requires.\n1\nTable of Contents\nDiagnostic Products\nThese products include a broad line of diagnostic systems and tests manufactured, marketed, and sold worldwide. These products are generally marketed and sold directly to blood banks, hospitals, commercial laboratories, clinics, physicians’ offices, retailers, government agencies, alternate care testing sites, and plasma protein therapeutic companies from Abbott-owned distribution centers, public warehouses or third party distributors.\nThe principal products included in the Diagnostic Products segment are:\n•\ncore laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion serology testing, including the Alinity\n®\n family of instruments along with the ARCHITECT\n®\n and Cell-Dyn\n®\n systems. These systems are used for screening and/or diagnosis for cancer, cardiac and metabolic disorders, drugs of abuse, thyroid function, fertility, neurologic and general chemistries, infectious diseases such as hepatitis and HIV, therapeutic drug monitoring, and a suite of SARS-CoV-2 serology assays;\n•\nmolecular diagnostics polymerase chain reaction (PCR) instrument systems, including Alinity\n®\n m and m2000™ that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents including HIV, hepatitis, HPV, sexually transmitted infections, SARS-CoV-2 and influenza A & B, and respiratory syncytial virus (RSV); and products for oncology with the Vysis\n®\n FISH product line of genomic-based tests;\n•\npoint-of-care systems, including the i-STAT\n®\n and i-STAT\n®\n Alinity\n®\n and cartridges for testing blood gas, chemistry, electrolytes, coagulation and immunoassay;\n•\nrapid diagnostics lateral flow testing products in the area of infectious diseases such as SARS-CoV-2, including the BinaxNOW\n®\n and Panbio\n®\n rapid testing platforms, influenza, HIV, hepatitis, and tropical diseases such as malaria and dengue fever; molecular point-of-care testing for HIV, including the m-PIMA\n®\n HIV-1/2 Viral Load Test, and for SARS-CoV-2 and influenza A & B, RSV and strep A, including the ID NOW\n®\n rapid molecular system; cardiometabolic testing, including Afinion\n®\n and Cholestech LDX\n®\n platforms and tests; and a toxicology business for drug and alcohol testing; and\n•\ninformatics and automation solutions for use in laboratories, including laboratory automation systems such as the GLP systems Track™, the RALS\n®\n point-of-care solution, and AlinIQ\n®\n, a suite of informatics tools and professional services.\nThe Diagnostic Products segment’s products are subject to competition in technological innovation, price, convenience of use, service, instrument warranty provisions, product performance, laboratory efficiency, long-term supply contracts, and product potential for overall cost-effectiveness and productivity gains. Some products in this segment can be subject to rapid product obsolescence or regulatory changes. Although Abbott has benefited from technological advantages of certain of its current products, these advantages may be reduced or eliminated as competitors introduce new products.\nNutritional Products\nThese products include a broad line of pediatric and adult nutritional products manufactured, marketed, and sold worldwide. These products are generally marketed and sold directly to consumers and to institutions, wholesalers, retailers, healthcare facilities, government agencies, and third-party distributors from Abbott-owned distribution centers or third-party distributors.\nThe principal products included in the Nutritional Products segment are:\n•\nvarious forms of infant formula and follow-on formula, including Similac\n®\n, Similac\n®\n 360 Total Care\n®\n, Similac Pro-Advance\n®\n, Similac\n®\n Advance\n®\n, Similac 360 Total Care\n®\n Sensitive, Similac Sensitive\n®\n, Go & Grow by Similac\n®\n, Similac\n®\n NeoSure\n®\n, Similac\n®\n Organic, Similac\n®\n Special Care\n®\n, Similac Total Comfort\n®\n, Similac\n®\n Soy Isomil\n®\n,  Similac\n®\n Alimentum\n®\n, EleCare\n®\n, Gain™, and Grow™;\n•\nadult and other pediatric nutritional products, including Ensure\n®\n, Ensure Plus\n®\n, Ensure\n®\n Enlive\n®\n, Ensure\n®\n NutriVigor™, Ensure\n®\n Max Protein, Ensure\n®\n High Protein, Glucerna\n®\n, Glucerna Hunger Smart\n®\n, ProSure™, PediaSure\n®\n, PediaSure SideKicks\n®\n, PediaSure\n®\n Peptide, Juven\n®\n, Abound™, and Pedialyte\n®\n; and\n•\nnutritional products used in enteral feeding in healthcare institutions, including Jevity\n®\n, Glucerna\n®\n 1.2 Cal, Glucerna\n®\n 1.5 Cal, Osmolite\n®\n, Oxepa\n®\n, Freego™ (Enteral Pump) and Freego™ sets, Nepro\n®\n, and Vital\n®\n.\nPrimary marketing efforts for nutritional products are directed toward consumers or physicians or other healthcare professionals. In addition, nutritional products are also promoted directly to the public by consumer marketing efforts in markets where permitted.\n2\nTable of Contents\nCompetition for nutritional products in the segment is generally from other diversified consumer and healthcare manufacturers. Competitive factors include consumer advertising, formulation, packaging, scientific innovation, price, retail distribution, and availability of product forms. A significant aspect of competition is the search for ingredient innovations. The introduction of new products by competitors, changes in medical practices and procedures, and regulatory changes can result in product obsolescence. In addition, private label and local manufacturers’ products may increase competitive pressure.\nMedical Devices\nThese products include a broad line of rhythm management, electrophysiology, heart failure, vascular and structural heart devices for the treatment of cardiovascular diseases, and diabetes care and continuous glucose monitoring products, as well as neuromodulation devices for the management of chronic pain and movement disorders. Medical devices are manufactured, marketed and sold worldwide. In the United States, depending upon the product, medical devices are generally marketed and sold directly to wholesalers, hospitals, ambulatory surgery centers, physicians’ offices, consumers, and distributors from Abbott-owned distribution centers, public warehouses or third party distributors. Outside the United States, sales are made either directly to customers or through distributors, depending on the market served.\nThe principal products included in the Medical Devices segment are:\n•\nrhythm management products, including Assurity MRI\n®\n and Endurity MRI\n®\n pacemaker systems, and Aveir\n®\n single-chamber (VR and AR) and Aveir\n®\n dual chamber (DR) leadless pacemaker systems; Ellipse\n®\n, Fortify Assura\n®\n, and Gallant\n®\n implantable cardioverter defibrillators and Gallant and Quadra Assura MP\n®\n implantable cardioverter defibrillator with cardiac resynchronization therapy and MultiPoint™ Pacing technology; and Confirm Rx\n®\n, Jot Dx\n®\n and ASSERT-IQ\n®\n implantable cardiac monitors;\n•\nelectrophysiology products, including the TactiFlex\n®\n and TactiCath\n®\n families of ablation catheters, and FlexAbility\n®\n irrigated ablation catheters; EnSite\n®\n family of cardiac mapping systems; Agilis\n®\n NxT and Swartz™ introducer catheters; the Advisor\n®\n HD Grid mapping catheter; and ViewFlex\n®\n family of intracardiac echocardiography catheters;\n•\nheart failure related products, including the HeartMate\n®\n left ventricular assist device family; the CardioMEMS\n®\n HF System pulmonary artery sensor, a heart failure monitoring system; the CentriMag\n®\n System, an acute mechanical circulatory support system; and patient self-testing products and services;\n•\nvascular products, including the XIENCE\n®\n family of drug-eluting coronary stent systems developed on the Multi-Link Vision\n®\n platform; StarClose SE\n®\n, Perclose ProGlide\n®\n and Perclose ProStyle\n®\n vessel closure devices, TREK\n®\n coronary balloon dilatation products, Hi-Torque Balance Middleweight Universal II\n®\n guidewires, Supera\n®\n Peripheral Stent System, a peripheral vascular stent system; Acculink\n®\n/Accunet\n®\n and Xact\n®\n/Emboshield NAV6\n®\n, carotid stent systems; the OPTIS\n®\n integrated systems with Ultreon\n®\n 1.0 and 2.0 Software, compatible with the Dragonfly OPTIS\n®\n and OpStar\n®\n imaging catheters and PressureWire\n®\n fractional flow reserve measurement systems; Diamondback 360\n®\n coronary and peripheral orbital atherectomy systems; and Esprit™ BTK everolimus eluting resorbable scaffold system;\n•\nstructural heart products, including MitraClip\n®\n, a mitral valve transcatheter edge-to-edge repair system; TriClip\n®\n, a tricuspid valve transcatheter edge-to-edge repair system; Epic\n®\n, a surgical family of aortic valve and mitral valve replacement devices; Portico\n®\n and Navitor\n®\n transcatheter aortic heart valves; Regent™ and Masters Series\n®\n mechanical heart valves; Amplatzer\n®\n PFO occluders; Amplatzer Amulet\n®\n occluder devices; and the Tendyne\n®\n transcatheter mitral valve replacement system; \n•\ncontinuous glucose and blood glucose monitoring systems under the FreeStyle\n®\n brand such as the FreeStyle Libre\n®\n system, including sensors, data management decision software, test strips, and accessories for people with diabetes; and the Lingo\n®\n continuous glucose monitoring system, including sensors and data management decision software for people’s health and wellness; and\n•\nneuromodulation products, including spinal cord stimulators Proclaim\n®\n Plus and Proclaim\n®\n XR recharge-free implantable pulse generators (IPG) and rechargeable Eterna\n® \nIPG, each with BurstDR\n®\n stimulation, and Proclaim\n®\n DRG IPG, a neurostimulation device designed for dorsal root ganglion therapy, for the treatment of chronic pain disorders; and the non-rechargeable Infinity™ deep brain stimulation (DBS) system and the rechargeable Liberta RC™ DBS system, each with directional lead technology for the treatment of movement disorders.\n3\nTable of Contents\nThese products are subject to competition in technological innovation, price, convenience of use, service, product performance, long-term supply contracts, and product potential for overall cost-effectiveness and productivity gains. Some products in this segment can be subject to rapid product obsolescence or regulatory changes. Although Abbott has benefited from technological advantages of certain of its current products, these advantages may be reduced or eliminated as competitors introduce new products.\nINFORMATION WITH RESPECT TO ABBOTT’S BUSINESS IN GENERAL\nSources and Availability of Raw Materials\nAbbott purchases, in the ordinary course of business, raw materials and supplies essential to Abbott’s operations from numerous suppliers in the United States and around the world. There have been no recent significant availability problems or supply shortages for raw materials or supplies. \nPatents, Trademarks, and Licenses\nAbbott is aware of the desirability for patent and trademark protection for its products. Accordingly, where possible, patents and trademarks are sought and obtained for Abbott’s products in the United States and countries of interest to Abbott. Abbott owns or has licenses under a substantial number of patents and patent applications. Principal trademarks and the products they cover are discussed in the Narrative Description of Business on pages 1 through 4. These, and various patents that expire during the period from 2025 to 2045, in the aggregate, are believed to be of material importance in the operation of Abbott’s business. Abbott believes that no single patent, license, or trademark is material in relation to Abbott’s business as a whole.\nSeasonal Aspects, Customers, and Renegotiation\nThere are no significant seasonal aspects to Abbott’s business. Abbott has no single customer that, if the customer was lost, would have a material adverse effect on Abbott. No material portion of Abbott’s business is subject to renegotiation of profits or termination of contracts at the election of a government.\nEnvironmental Matters\nAbbott believes that its operations comply in all material respects with applicable laws and regulations concerning environmental protection. Regulations under federal, state, and various other countries’ environmental laws impose stringent limitations on emissions and discharges to the environment from various manufacturing operations. Abbott’s capital and operating expenditures for pollution control in 2024 were not material and are not expected to be material in 2025.\nAbbott has been identified as one of many potentially responsible parties in investigations and/or remediations at several locations in the United States, including Puerto Rico, under the Comprehensive Environmental Response, Compensation, and Liability Act, commonly known as Superfund. Abbott is also engaged in remediation at several other sites, some of which are owned by Abbott, in cooperation with the Environmental Protection Agency or similar agencies. While it is not feasible to predict with certainty the final costs related to those investigations and remediation activities, Abbott believes that such costs, together with other expenditures to maintain compliance with applicable laws and regulations concerning environmental protection, should not have a material adverse effect on Abbott’s financial position, cash flows, or results of operations.\nHuman Capital\nThe sustainability of Abbott’s business depends on attracting, engaging and developing talented people with diverse backgrounds who share Abbott’s mission to help people live their healthiest possible lives. Abbott provides its employees opportunities to grow and develop their careers, market competitive compensation and benefit programs, and the satisfaction of being part of a global company dedicated to improving health in more than 160 countries.\nAs of December 31, 2024, Abbott employed approximately 114,000 people, 69% of whom were employed outside of the U.S. Women represented 47% of Abbott’s U.S. workforce, 46% of its global workforce, and 43% of its managers.\n4\nTable of Contents\nTalent Management\nAbbott has an integrated global talent management process that is designed to identify and assess talent across the organization and provide equal and consistent opportunities for employees to develop their skills. All levels of employees participate in Abbott’s annual performance management process to create development plans that support their particular career objectives, and Abbott provides a broad range of training, mentoring and other development opportunities to help its employees meet these objectives. The board of directors conducts an annual Talent Management Review, focusing on development of talent, diversity, and succession planning for critical positions. Similar reviews take place across Abbott to develop talent and diversity across the organization. \nDiversity and Inclusion \nAbbott is committed to fostering a workplace that is inclusive for all. Abbott ties executive compensation to human capital management to sustain an inclusive culture and the fair and balanced treatment of Abbott’s employees. Abbott's diversity, equity, and inclusion report provides an update on the plans, strategies, and actions undertaken to ensure that Abbott continues to attract, retain, and develop the best talent from the more than 160 countries in which it does business. \nAbbott’s employee networks play an important role in building an inclusive culture across all Abbott operations. A corporate officer serves as a sponsor for each of these networks, helping to align their objectives with Abbott’s business strategies. Abbott has nine such networks, which are: Asian Leadership and Cultural Network, Black Business Network, disABILITY Network (supporting employees with disabilities), Early Career Network (supporting early career employees), LA VOICE Network (supporting Hispanic and Latino employees), PRIDE (supporting LGBTQ employees), Veterans Network, Women Leaders of Abbott, and Women in STEM. All networks are open to all Abbott employees.\nAbbott offers professional development programs, which provide recent college graduates the opportunity to rotate through different areas of Abbott, often with the chance to work outside their home country. Also, Abbott hosts hundreds of college students for paid internships. Further, Abbott has offered a STEM internship program for high school students in the U.S. since 2012 and since 2021, students who complete the program receive a college credit recommendation from the American Council on Education. The program’s objective is to increase the number of students pursuing STEM-related careers and contribute to a more diverse talent pipeline for Abbott. \nHealth and Safety\nThe health, safety and wellness of its employees is an Abbott priority embedded at every level of its business. Abbott’s integrated Environmental, Health and Safety organization governs health, safety and wellness at Abbott’s facilities. Abbott also maintains global policies and standards for managing employee health and safety.\nAbbott takes a holistic approach to employee well-being. Abbott’s global wellness programs are designed to meet the unique needs of employees across businesses and geographies and offer a wide range of programs, including supporting the emotional, physical, and financial health of employees and their families. For example, for over 20 years, Abbott has annually offered Exercise Across Abbott, which is a four-week physical wellness program that encourages employees to team up with colleagues and track how many minutes they exercise each day. Over 40,000 Abbott employees across 75 countries took part in 2024.\nCompensation and Benefits\nAbbott is committed to building, retaining, and motivating a diverse talent pipeline that can meet the current and future needs of its businesses. To that end, Abbott provides market competitive compensation, healthcare benefits, continuing education benefits, pension and/or retirement savings plans, financial support for employees with student loan debt, and several programs to facilitate employees building an ownership stake in Abbott, including a global long-term incentive program for employees generally beginning at the manager level. Abbott also has procedures and processes focused on ensuring employees receive equitable compensation, regardless of race or gender or other personal characteristics.\n5\nTable of Contents\nRegulation\nThe development, manufacture, marketing, sale, promotion, and distribution of Abbott’s products are subject to comprehensive government regulation by the U.S. Food and Drug Administration (FDA) and similar national and international regulatory agencies. Government regulation by various international, supranational, federal and state agencies addresses (among other matters) the development and approval to market Abbott’s products, as well as the inspection of, and controls over, research and laboratory procedures, clinical investigations, product approvals and manufacturing, postmarket changes to products, labeling, packaging, supply chains, marketing and promotion, pricing and reimbursement, sampling, distribution, quality control, post-market surveillance, record keeping, storage, and disposal practices. In addition, Abbott’s laboratories and associated testing services are subject to comprehensive government regulation, including registration, certification, and licensure, by federal, state, and local agencies, such as the Centers for Medicare & Medicaid Services, the Drug Enforcement Administration, the Substance Abuse and Mental Health Services Administration, and their respective foreign counterparts. Certain of these agencies require Abbott's laboratories to meet quality assurance, quality control, and personnel standards and undergo inspections.\nAbbott’s international operations are also affected by trade and investment regulations in many countries. These may require local investment, restrict Abbott’s investments, or limit the import of raw materials and finished products.\nAbbott’s laboratory facilities, home monitoring services, and durable medical equipment suppliers, which provide services, related products and medical devices to consumers, are subject to additional laws and regulations applicable to healthcare providers and suppliers that submit claims for reimbursement or payment to third-party payors, including government agencies such as Medicare and Medicaid, or governments. In the United States, these entities may from time to time conduct inquiries, claims audits, investigations, and enforcement actions relating to the claims or enrollment criteria.\nAbbott is subject to laws and regulations pertaining to healthcare fraud and abuse, including state and federal anti-kickback, anti-self-referral, and false claims laws in the United States. Prescription drug, nutrition, and medical device manufacturers such as Abbott are also subject to taxes, as well as application, product, user, establishment, and other fees. Governmental agencies can also invalidate intellectual property rights.\nCompliance with these laws and regulations is costly and materially affects Abbott’s business. Among other effects, healthcare regulations and significant changes thereto (such as the introduction of the Medical Devices Regulation and the In Vitro Diagnostic Medical Devices Regulation in the European Union) substantially increase the time, difficulty, and costs incurred in developing, obtaining and maintaining approval to market, and marketing newly developed and existing products. Abbott expects this regulatory environment will continue to require significant technical expertise and investment to ensure compliance. Failure to comply can delay the release of a new product or result in regulatory and enforcement actions, the seizure or recall of a product, the suspension or revocation of the authority necessary for a product’s production and sale, suspension or revocation of billing privileges, and other civil or criminal sanctions, including fines and penalties. Similarly, compliance with the laws and regulations governing laboratories and testing services requires specialized expertise. Failure to comply with these regulatory requirements can result in sanctions, including suspension, revocation, or limitation of a laboratory’s certification, which is necessary to conduct business, as well as significant fines or criminal penalties.\nAbbott’s business can also be affected by ongoing studies of the utilization, safety, efficacy, and outcomes of healthcare products and their components that are regularly conducted by industry participants, government agencies, and others. These studies can call into question the utilization, safety, and efficacy of previously marketed products. In some cases, these studies have resulted, and may in the future result, in the discontinuation of marketing of such products in one or more countries, and may give rise to claims for damages from persons who believe they have been injured as a result of their use.\n6\nTable of Contents\nAccess to human healthcare products continues to be a subject of investigation and action by governmental agencies, legislative bodies, and private organizations in many countries. A major focus is cost containment. Efforts to reduce health care costs are also being made in the private sector, notably by healthcare payors and providers, which have instituted various cost reduction and containment measures. Abbott expects that insurers and providers will continue attempts to reduce the cost or utilization of healthcare products. Many countries control the price of healthcare products directly or indirectly, through reimbursement, payment, pricing, or coverage limitations. Budgetary pressures on healthcare payors may also heighten the scope and severity of pricing pressures on Abbott’s products for the foreseeable future. In the United States, the federal government regularly evaluates reimbursement for medical devices, diagnostics, supplies, and other products, as well as the procedures in which these products may be used. The government follows a diagnosis-related group (DRG) payment system for certain institutional services provided under Medicare or Medicaid and has implemented a prospective payment system (PPS) for services delivered in hospital outpatient, nursing home, and home health settings. DRG and PPS entitle a healthcare facility to a fixed reimbursement based on the diagnosis and/or procedure rather than actual costs incurred in patient treatment, thereby increasing the incentive for the facility to limit or control expenditures for many healthcare products. Other payment methodology changes have been proposed and implemented from time to time. For example, Medicare implemented a competitive bidding system for certain durable medical equipment (including diabetes products), enteral nutrition products, and supplies. \nGovernmental cost containment efforts also affect Abbott’s nutritional products business. In the United States, for example, under regulations governing the federally funded Special Supplemental Nutrition Program for Women, Infants, and Children (WIC), all states must have a cost containment program for infant formula. As a result, through competitive bidding states obtain rebates from manufacturers of infant formula whose products are used in the program.\nThe Patient Protection and Affordable Care Act (the Affordable Care Act) includes provisions known as the Physician Payments Sunshine Act, which requires manufacturers of drugs, devices, and medical supplies covered under Medicare and Medicaid to record any transfers of value to physicians and teaching hospitals and to report this data to the Centers for Medicare & Medicaid Services for subsequent public disclosure. Similar reporting requirements have also been enacted at the state level domestically, and an increasing number of governments worldwide either have adopted or are considering similar laws requiring transparency of interactions with healthcare professionals. Failure to report appropriate data may result in civil or criminal fines and/or penalties.\nPolicy changes or implementation of new healthcare legislation could result in significant changes to healthcare systems. In the United States, this could include potential modification, including expansion or repeal of all or parts of the Affordable Care Act.\nThe regulation of data privacy and security, and the protection of the confidentiality of certain personal information (including patient health information, financial information and other sensitive personal information), is increasing. For example, the European Union, China, various other countries, and various U.S. states have enacted or are considering enacting data protection laws that contain significant compliance obligations and financial penalties for noncompliance. In addition, regulators with general consumer protection authority, such as the U.S. Federal Trade Commission and U.S. states Attorneys General, are focused on how consumer data is used by entities in the healthcare industry. Further, there are regulations of data privacy and security that are specific to healthcare companies. For example, the U.S. Department of Health and Human Services has issued rules governing the use, disclosure, and security of protected health information, and the FDA has issued further guidance concerning cybersecurity for medical devices. In addition, certain countries have issued or are considering “data localization” laws, which limit companies’ ability to transfer protected data across country borders. Failure to comply with data privacy and security laws and regulations can result in business disruption and enforcement actions, which could include civil or criminal penalties. Transferring and managing protected information will become more challenging as laws and regulations are enacted or amended, and Abbott expects there will be increasing complexity in this area. \nAbbott expects debate to continue at all government levels worldwide over the manufacture, quality assurance requirements, marketing authorization processes, post-market surveillance requirements, availability, method of delivery, and payment for healthcare products and services, as well as data privacy and security. Abbott believes that future legislation and regulation in the markets it serves could affect the timing and expense associated with bringing healthcare products or services to market, access to healthcare products and services, increase rebates, reduce prices or reimbursements or the rate of price increases for healthcare products and services, change healthcare delivery systems, create new fees and obligations for the pharmaceutical, nutrition, diagnostic, and medical device industries, or require additional reporting and disclosure. It is not possible to predict the extent to which Abbott or the healthcare industry in general might be affected by the matters discussed above.\n7\nTable of Contents\nINTERNET INFORMATION\nCopies of Abbott’s Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 are available, free of charge, through Abbott’s investor relations website (\nwww.abbottinvestor.com\n) as soon as reasonably practicable after Abbott electronically files the material with, or furnishes it to, the Securities and Exchange Commission (the Commission). These reports and other information are also available, free of charge, at www.sec.gov.\nAbbott’s corporate governance guidelines, outline of directorship qualifications, code of business conduct and the charters of Abbott’s audit committee, compensation committee, nominations and governance committee, and public policy committee are all available on Abbott’s investor relations website (\nwww.abbottinvestor.com\n).\n8\nTable of Contents"
}