{
  "ticker": "ACN",
  "cik": "0001467373",
  "company_name": "Accenture plc",
  "filing_date": "2025-10-10",
  "accession": "0001467373-25-000217",
  "primary_doc": "acn-20250831.htm",
  "item1_text": "Item 1. Business\n6\nProducts\nFY25 Revenues of $21.2B\nPercent of Group’s FY25 Revenue\n45%\n35%\n20%\nConsumer Goods, Retail & Travel Services\nIndustrials\nLife Sciences\nFood and beverage, household goods, personal care, fashion/apparel; supermarkets, mass-merchandise discounters, department, quick serve and convenience stores and specialty retailers; aviation, hospitality and travel services companies, tobacco, agribusiness and consumer health companies\nAutomotive & mobility, industrial & electrical equipment manufacturers, industrial suppliers, construction, infrastructure, heavy equipment,  consumer durables, business services, freight, logistics, aerospace & defense, rail and public transportation companies\nBiopharmaceutical, medical technology and distributors\nResources\nFY25 Revenues of $9.5B\nPercent of Group’s FY25 Revenue\n28%\n25%\n47%\nChemicals & Natural Resources\nEnergy\nUtilities\nMining, petrochemicals, specialty chemicals, polymers and plastics, gases and agricultural chemicals companies, as well as the metals and forest products industries\nOil and gas companies, including upstream, midstream, downstream, oilfield services, clean energy and energy trading companies\nPower generators and developers, including nuclear, renewables and other conventional generators; electric and gas transmission and distribution operators, energy and energy service retailers;  water, waste and recycling service providers\nPeople\nWe are a value and solution-led company with approximately 779,000 people as of August 31, 2025, whose skills and specialization are a significant source of competitive differentiation. We serve clients at any given time in more than 120  countries, with offices and operations in 52 countries and the majority of our people are in India, the Philippines and the U.S. \nWe have a culture of shared success, which is defined as success for our clients, our people, our shareholders, our partners and our communities. Our Code of Business Ethics, which applies to all of our people, reinforces our core values and helps drive our culture of compliance, ethical conduct and accountability.\nOur strategy is to be the most AI-enabled, client-focused, great place to work for reinventors, which is how we refer to our people, because we are the reinvention partner of choice for our clients. We were pleased that among our people who participated in the globally recognized Great Place To Work\n®\n Trust Index Survey™ in June 2025, 75% agreed that “Taking everything into account, I would say this is a great place to work.” In addition to earning the No. 6 spot on the Great Place To Work® list of the World’s Best Workplaces™, we are recognized as a Great Place To Work\n®\n in 12 countries, representing nearly 80% of our people.\nTo drive reinvention, innovation must be at the forefront, which requires us to attract, develop and inspire top talent. \nOur focus is to create talent and unlock the potential of our people, to create strong leaders, and to help them achieve their professional and personal aspirations, while continuously evolving to meet new client needs.\nWe are implementing a refreshed three-pronged talent strategy to meet current and future client demand: investing in upskilling people, which has been and continues to be our primary focus; exiting people in a compressed timeline where reskilling is not a viable path for the skills we need; and identifying areas to drive even more operating efficiencies in our business, including through AI.\nDuring fiscal 2025, we invested approximately $1.0 billion in learning and professional development. With our digital learning platform, we delivered approximately 47 million training hours, an increase of 9% compared with fiscal 2024. We continually invest in strengthening the industry, technology, functional and AI skills of our people. As part of our strategic \nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n7\nfocus on driving reinvention and growth with AI, we are launching a global learning program that integrates tools, platforms, and role-based learning, along with partnerships with leading educational institutions and certification programs. Additionally, Accenture’s industry learning framework and technology certification strategy are an important part of our competitive differentiation. \nWe also continue to steadily increase our AI and data workforce, reaching approximately \n77,000\n skilled AI and data practitioners at the end of fiscal 2025, against our goal of doubling our AI and data workforce to \n80,000\n by the end of fiscal 2026.\nWe promoted approximately 97,000 people in fiscal 2025, demonstrating our continued commitment to creating vibrant careers and opportunities for our people.\nWe balance our supply of skills with changes in client demand. We do this through adjusting levels of new hiring and managing our attrition (both voluntary and involuntary). We believe people are drawn to our strong purpose, values and reputation. For fiscal 2025, attrition, excluding involuntary terminations, was 14%, compared to 13% in fiscal 2024. For the fourth quarter of fiscal 2025, annualized attrition, excluding involuntary terminations, was 15%, down from 16% in the third quarter of fiscal 2025.\nAccenture’s total rewards consist of cash compensation, equity and a wide range of benefits. Our total rewards program is designed to recognize our people’s skills, contributions and career progression. Base salary, bonus and equity are tailored to the market where our people work and live. Certain rewards, like equity and bonuses, are opportunities for our people to share in the overall success of our company. As our people advance in their careers, they have greater opportunities to be rewarded. Accenture’s equitable rewards go beyond financial rewards and include health and well-being programs and practices—including physical, mental, emotional and financial well-being—that care for our people.\nGlobal Delivery Capability \nA key differentiator is our global delivery capability. We have one of the world’s largest networks of centers with deep capabilities that allow us to help our clients create exceptional business value. Our global approach provides scalable innovation; standardized processes, methods and tools; automation and AI; industry expertise and specialized capabilities; cost advantages; foreign language fluency; proximity to clients; and time zone advantages—to deliver high-quality solutions and services. Emphasizing quality, productivity, reduced risk, speed-to-market and predictability, our global delivery model supports all parts of our business to provide clients with price-competitive solutions and services. \nInnovation and Intellectual Property \nWe are committed to developing leading-edge ideas and leveraging emerging technologies and we see innovation as a source of competitive advantage. We use our investment in R&D—on which we spent $0.8 billion, $1.2 billion and $1.3 billion in fiscal 2025, 2024 and 2023, respectively—to help clients address new realities in the marketplace and to face the future with confidence.\nOur innovation experts work with clients across the world to imagine their future, build and co-create innovative business strategies and technology solutions, and then scale those solutions to sustain innovation. We believe our combination of people, platforms, assets and capabilities, including our global network of Innovation Centers, makes Accenture one of the leading strategic innovation partners for our clients.\nThis is all supported by our innovation approach, which includes Accenture Research, Accenture Ventures and Accenture Labs, our Innovation Centers as well as our Delivery Centers. Our research and thought leadership teams help identify market, technology and industry trends. Accenture Ventures partners with and invests in growth-stage companies that create innovative enterprise technologies. Accenture Labs incubate and prototype new concepts through applied research and development projects. Within this, we incubate and apply emerging technology innovation to business architectures, including robotics, quantum and advanced AI along with many other disruptive technologies and ideas.\nWe harness our unique intellectual property to deliver these innovation services. We have a global portfolio of patents and pending patent applications covering various technology areas, including AI, cloud, cybersecurity, automation, analytics and quantum. We leverage patent, trade secret and copyright laws as well as contractual arrangements and confidentiality procedures to protect the intellectual property in our innovative solutions and services. These include our proprietary platforms, software, reusable knowledge capital, and other innovations. We also have policies to respect the intellectual property rights of third parties, such as our clients, partners, vendors and others. \nTo protect Accenture’s brands, we rely on intellectual property laws and trademark registrations held around the world. Trademarks appearing in this report are the trademarks or registered trademarks of Accenture Global Services Limited, Accenture Global Solutions Limited, or third parties, as applicable.\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n8\nAssets and Platforms\nWe bring industry specific solutions and services as well as cross industry expertise and leverage our scale and global footprint, innovation capabilities, and strong ecosystem partnerships together with our proprietary assets and platforms including GenWizard, myNav, SynOps and AI Navigator for Enterprise to deliver tangible value for our clients. We have significantly embedded advanced AI into our proprietary platforms like GenWizard, which enables us to deliver differently for our clients.\nCompetition\nAccenture operates in a highly competitive and rapidly changing global marketplace. We compete with a variety of organizations that offer solutions and services competitive with those we offer—but we believe no other company offers the full range of services at scale that Accenture does, which uniquely positions us in a highly competitive market. Our clients typically retain us on a non-exclusive basis. \nOur competitors include large multinational IT service providers, including the services arms of large global technology providers; off-shore IT service providers in lower-cost locations, particularly in India; accounting firms and consultancies that provide consulting, managed services and other IT solutions and services; solution or service providers that compete with us in a specific geographic market, industry or service area, including advertising agency holding companies, engineering services providers and technology start-ups and other companies that can scaled rapidly to focus on or disrupt certain markets and provide new or alternative products, end-to-end solutions, services, or commercial or delivery models; and in-house IT departments of large corporations that use their own resources rather than engage an outside firm, such as global capability centers (“GCC’s”).\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n9\nInformation About Our Executive Officers \nOur executive officers as of October 10, 2025 are as follows:\nMelissa Burgum,\n 53, became our chief accounting officer in September 2022 and has served as our corporate controller since September 2021. Prior to that, Ms. Burgum served as our assistant corporate controller from December 2016 to September 2021 and as controller for Accenture Federal Services from May 2013 to December 2016. Prior to joining Accenture, Ms. Burgum held controllership roles at two public companies and was previously an auditor and consultant for Arthur Andersen. Ms. Burgum has been with Accenture for 12 years.\nKate Clifford,\n 48, became our chief leadership and human resources officer in September 2025. From September 2024 to September 2025, Ms. Clifford was our chief human resources officer—the Americas. From June 2022 to September 2024, she served as our chief human resources officer—North America. Prior to that, she served as our North America human resources service delivery lead from December 2018 to June 2022. Ms. Clifford has been with Accenture for 27 years.\nAtsushi Egawa,\n 60, became our co-chief executive officer—Asia Pacific and chief executive officer —Japan in September 2024. Since September 2015, Mr. Egawa has served as our market unit lead in Japan. Prior to September 2015, Mr. Egawa led our Products industry group in Japan. Prior to that role, he led our Consumer Goods business in Japan. He has partnered closely with numerous global clients on their digital transformations and was integral in the opening of Accenture’s Innovation Hub in Tokyo. Mr. Egawa has been with Accenture for 36 years.\nKate Hogan,\n 49, became our chief operating officer in September 2025. From September 2024 to September 2025, she served as our chief operating officer—the Americas. From September 2023 to September 2024, she served as chief operating officer—North America. Prior to that, Ms. Hogan served as our US West lead from September 2022 to September 2023 and chief operating officer—North America from March 2020 to August 2022. Ms. Hogan has been with Accenture for 27 years. \nMauro Macchi, \n60, became our chief executive officer—EMEA in September 2024. From September 2021 to September 2024, Mr. Macchi served as our market unit lead for Italy, Central Europe and Greece. From March 2020 to September 2021, Mr. Macchi served as the Strategy & Consulting lead for Europe. Previously, he served as our Financial Services lead for Europe from November 2019 to March 2020, Financial Services lead for Italy, Central Europe and Greece from October 2017 to October 2019 and global Banking industry lead for Strategy from March 2015 to September 2017. Mr. Macchi has been with Accenture for 35 years.\nAngie Park, \n53, became our chief financial officer in December 2024. From September 2023 to December 2024, she served as our Business and Commercial Finance lead. From September 2022 to September 2023, she served as our chief financial officer—Technology. Prior to assuming that role, she served as our head of investor relations from December 2016 to September 2022 and finance director—Health & Public Service from April 2014 to September 2023. Ms. Park has been with Accenture for 29 years\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n10\nRyoji Sekido,\n 58, became our co-chief executive officer—Asia Pacific and chief executive officer—Asia Oceania in September 2024. From April 2023 to September 2024, Mr. Sekido served as our Technology lead for Growth Markets. Prior to March 2023, Mr. Sekido served as the Technology and Cloud First lead for Asia Pacific, Middle East and Africa. In his earlier roles, he led several industry and technology teams and served as the Financial Services client service group lead and the Financial Services technology consulting lead for APAC. Mr. Sekido has been with Accenture for 33 years.\nManish Sharma,\n 57, became our chief strategy and services officer in September 2025. Prior to that, Mr. Sharma served as our chief executive officer—the Americas from September 2024 to September 2025, chief executive officer—North America from September 2023 to September 2024 and chief operating officer from March 2022 to September 2023. From March 2020 to March 2022, Mr. Sharma served as our group chief executive—Operations. Prior to that, he held key leadership positions in Operations, including as group chief operating officer and global business process outsourcing delivery lead. Mr. Sharma has been with Accenture for 30 years.\nJulie Sweet,\n 58, became chair of our Board of Directors in September 2021 and has served as our chief executive officer since September 2019. From June 2015 to September 2019, she served as our chief executive officer—North America. From March 2010 to June 2015, she served as our general counsel, secretary and chief compliance officer. Prior to joining Accenture in 2010, Ms. Sweet was a partner for 10 years in the law firm Cravath, Swaine & Moore LLP, which she joined as an associate in 1992. Ms. Sweet has been with Accenture for 15 years and has served as a director since September 2019.\nJoel Unruch,\n 47, became our general counsel in September 2019 and has served as our corporate secretary since June 2015. Mr. Unruch also served as our chief compliance officer from September 2019 to January 2020. Mr. Unruch joined Accenture in 2011 as our assistant general counsel and assistant secretary and also oversaw ventures & acquisitions and alliances & ecosystems practices for our legal group. Prior to joining Accenture, Mr. Unruch was corporate counsel at Amazon.com and previously an associate in the corporate department of the law firm Cravath, Swaine & Moore LLP. Mr. Unruch has been with Accenture for 14 years.\nJohn Walsh, \n61, became our chief executive officer—the Americas in September 2025. Prior\nto that, Mr. Walsh served as our chief operating officer from September 2023 to September 2025. From March 2020 to September 2023, Mr. Walsh served as our chief strategic accounts and global sales officer. From November 2019 to March 2020, he served as our group chief executive—Communications, Media & Technology. He served as senior managing director—Communications, Media & Technology in North America, from 2013 to 2019. Mr. Walsh has been with Accenture for 39 years.\nOrganizational Structure \nAccenture plc was incorporated in Ireland on June 10, 2009 as a public limited company. We operate our business through subsidiaries of Accenture plc. \nThe Consolidated Financial Statements reflect the ownership interests in Accenture Canada Holdings Inc. held by certain current and former members of Accenture Leadership as noncontrolling interests. The noncontrolling ownership interests were less than 1% as of August 31, 2025. “Accenture Leadership” is comprised of members of our global management committee (our primary management and leadership team, which consists of approximately 55 of our most senior leaders), senior managing directors and managing directors.  \nTable of Contents\nACCENTURE\n 2025 FORM 10-K"
}