{
  "ticker": "ADBE",
  "cik": "0000796343",
  "company_name": "ADOBE INC.",
  "filing_date": "2025-01-13",
  "accession": "0000796343-25-000004",
  "primary_doc": "adbe-20241129.htm",
  "item1_text": "Item 1A of this report. Based on our current business plan and revenue prospects, we believe that our existing cash, cash equivalents and investment balances, our anticipated cash flows from operations and our available credit facility will be sufficient to meet our working capital, operating resource expenditure and capital expenditure requirements for the next twelve months and for the foreseeable future.\nOur cash equivalent and short-term investment portfolio as of November 29, 2024 consisted of money market funds, corporate debt securities, U.S. Treasury securities, time deposits, U.S. agency securities and asset-backed securities. We use professional investment management firms to manage a large portion of our invested cash.\nWe expect to continue our investing activities, including short-term and long-term investments, purchases of computer and server hardware to operate our network infrastructure, sales and marketing, product support and administrative staff. Furthermore, cash reserves may be used to repurchase stock under our stock repurchase program and to strategically acquire companies, products or technologies that are complementary to our business.\nRevolving Credit Agreement\nWe have a $1.5 billion senior unsecured revolving credit agreement (the “Revolving Credit Agreement”) with a syndicate of lenders, providing for loans to us and certain of our subsidiaries through June 30, 2027. Subject to the agreement of lenders, we may obtain up to an additional $500 million in commitments, for a maximum aggregate commitment of $2 billion. As of November 29, 2024, there were no outstanding borrowings under the Revolving Credit Agreement and the entire $1.5 billion credit line remains available for borrowing. Under the terms of our Revolving Credit Agreement, we are not prohibited from paying cash dividends unless payment would trigger an event of default or if one currently exists. We do not anticipate paying any cash dividends in the foreseeable future.\nCommercial Paper Program \nWe have a commercial paper program under which we may issue unsecured commercial paper up to a total of $3 billion outstanding at any time, with maturities of up to 397 days from the date of issue. The net proceeds from the issuance of commercial paper are expected to be used for general corporate purposes, which may include working capital, capital expenditures, acquisitions, stock repurchases, refinancing indebtedness or any other general corporate purposes. As of November 29, 2024, there were no outstanding borrowings under the commercial paper program.\nSenior Notes\nIn April 2024, we issued $500 million of senior notes due April 4, 2027, $750 million of senior notes due April 4, 2029 and $750 million of senior notes due April 4, 2034. In total, we have $5.65 billion of senior notes outstanding, which rank equally with our other unsecured and unsubordinated indebtedness. As of November 29, 2024, the carrying value of our senior notes was $5.63 billion and our maximum commitment for interest payments was $806 million for the remaining duration of our outstanding senior notes. Interest is payable semi-annually, in arrears. Our senior notes do not contain any financial covenants. \nSee Note 17 of our Notes to Consolidated Financial Statements for further details regarding our debt.\n49\nTable of Contents\nDuring the first quarter of fiscal 2024, we reclassified the senior notes due February 1, 2025 as current debt in our Consolidated Balance Sheets. As of November 29, 2024, the carrying value of our current debt was $1.50 billion, net of the related discount and issuance costs. Though we intend to refinance the current portion of our debt on or before the due date, the timing of the refinancing may be impacted by market conditions.\nContractual Obligations\nOur principal commitments consist of purchase obligations resulting from agreements to purchase goods and services in the ordinary course of business. As of November 29, 2024, the value of our non-cancellable unconditional purchase obligations was $5.79 billion, primarily relating to contracts with vendors for third-party hosting and data center services. \nSee Note 16 of our Notes to Consolidated Financial Statements for additional information regarding our purchase obligations.\nWe lease certain facilities and data centers under non-cancellable operating lease arrangements that expire at various dates through 2034. As of November 29, 2024, the value of our obligations under operating leases was $463 million. \nS\nee Note 18 of our Notes to Consolidated Financial Statements for additional information regarding our lease obligations\n.\nStock Repurchase Program\nTo facilitate our stock repurchase program, designed to return value to our stockholders and minimize dilution from stock issuances, we may repurchase our shares in the open market or enter into structured repurchase agreements with third parties. In December 2020, our Board of Directors granted authority to repurchase up to $15 billion in our common stock, which became fully utilized during fiscal 2024. In March 2024, our Board of Directors granted additional authority to repurchase up to $25 billion in our common stock through March 14, 2028.\nDuring fiscal 2024, we entered into accelerated share repurchase agreements (“ASRs”) with large financial institutions whereupon we provided them with prepayments totaling $9.5 billion. Subsequent to November 29, 2024, as part of the March 2024 stock repurchase authority, we entered into stock repurchase arrangements with a large financial institution which totaled $3.25 billion, including a $2.75 billion ASR and a trading plan under which we may execute up to $500 million in open market repurchases.\nSee section titled \n“\nMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\n”\n in Part II, Item 5 of this report for stock repurchases during the quarter ended \nNovember 29, 2024 \nand Note 14 of our Notes to Consolidated Financial Statements for further details regarding our stock repurchase program.\nIndemnifications\nIn the ordinary course of business, we provide indemnifications of varying scope to our customers and channel partners against claims of intellectual property infringement made by third parties arising from the use of our products and from time to time, we are subject to claims by our customers under these indemnification provisions. Historically, costs related to these indemnification provisions have not been significant and we are unable to estimate the maximum potential impact of these indemnification provisions on our future results of operations.\nTo the extent permitted under Delaware law, we have agreements whereby we indemnify our officers and directors for certain events or occurrences while the officer or director is or was serving at our request in such capacity. The indemnification period covers all pertinent events and occurrences during the officer’s or director’s lifetime. The maximum potential amount of future payments we could be required to make under these indemnification agreements is unlimited; however, we have director and officer insurance coverage that reduces our exposure and enables us to recover a portion of any future amounts paid.\n50\nTable of Contents\nITEM 7A.  QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAll market risk sensitive instruments were entered into for non-trading purposes.\nForeign Currency Risk\nForeign Currency Exposures and Hedging Instruments\nIn countries outside the United States, we transact business in U.S. Dollars and various other currencies, which subject us to exposure from movements in exchange rates. We may use foreign exchange forward contracts and option contracts to hedge a portion of our forecasted foreign currency denominated revenue and expenses. Additionally, we hedge our net recognized foreign currency monetary assets and liabilities with foreign exchange forward contracts to reduce the risk that our earnings and cash flows will be adversely affected by changes in exchange rates. \nOur significant foreign currency revenue exposures for fiscal 2024, 2023 and 2022 were as follows:\n(in millions)\n2024\n2023\n2022\nEuro\n€\n3,149 \n€\n2,842 \n€\n2,487 \nJapanese Yen\n¥\n144,800 \n¥\n129,127 \n¥\n118,456 \nBritish Pounds\n£\n887 \n£\n818 \n£\n737 \nAustralian Dollars\n$\n1,064 \n$\n973 \n$\n876 \nAs of November 29, 2024, the total notional amounts of all outstanding foreign exchange contracts were $5.89 billion, which included the notional equivalent of $2.73 billion in Euros, $791 million in Japanese Yen, $714 million in British Pounds, $609 million in Indian Rupees, $585 million in Australian Dollars, $386 million in Canadian dollars and $76 million in other foreign currencies. As of November 29, 2024, all contracts were set to expire at various dates through September 2026. The bank counterparties in these contracts could expose us to credit-related losses that would be largely mitigated with master netting arrangements with the same counterparty by permitting net settlement transactions. In addition, we enter into collateral security agreements that provide for collateral to be received or posted when the net fair value of these contracts fluctuates from contractually established thresholds.\nA sensitivity analysis was performed on all of our foreign exchange derivatives as of November 29, 2024. This sensitivity analysis measures the hypothetical market value resulting from a 10% shift in the value of exchange rates relative to the U.S. Dollar. A 10% increase in the value of the U.S. Dollar and a corresponding decrease in the value of the hedged foreign currency asset would lead to an increase in the fair value of our financial hedging instruments by $434 million. A 10% decrease in the value of the U.S. Dollar would lead to a decrease in the fair value of these financial instruments by $434 million.\nAs a general rule, we do not use foreign exchange contracts to hedge local currency denominated operating expenses in countries where a natural hedge exists. For example, in many countries, revenue in the local currencies substantially offsets the local currency denominated operating expenses. We also have long-term investment exposures consisting of the capitalization and retained earnings in our non-U.S. Dollar functional currency foreign subsidiaries. As of November 29, 2024 and December 1, 2023, this long-term investment exposure totaled an absolute notional equivalent of $1.19 billion and $1.03 billion, respectively. At this time, we do not hedge these long-term investment exposures.\nWe do not use foreign exchange contracts for speculative trading purposes, nor do we hedge our foreign currency exposure in a manner that entirely offsets the effects of changes in foreign exchange rates. We regularly review our hedging program and assess the need to utilize financial instruments to hedge currency exposures on an ongoing basis.\nCash Flow Hedges of Forecasted Foreign Currency Revenue and Expenses\nWe may use foreign exchange purchased forward contracts or option contracts to hedge foreign currency revenue denominated in Euros, Japanese Yen, British Pounds, Australian Dollars and Canadian Dollars, or foreign currency expenses in Indian Rupees. We hedge these cash flow exposures to reduce the risk that our earnings and cash flows will be adversely affected by changes in exchange rates. These foreign exchange contracts, carried at fair value, have maturities of up to 24 months. We enter into these foreign exchange contracts to hedge forecasted revenue and expenses in the normal course of business and accordingly, they are not speculative in nature.\nWe record changes in fair value of these cash flow hedges of foreign currency denominated revenue and expenses in accumulated other comprehensive income (loss) in our Consolidated Balance Sheets, until the forecasted transaction occurs. When the forecasted transaction affects earnings, we reclassify the related gain or loss on the cash flow hedge to revenue or operating expenses, as applicable. In the event the underlying forecasted transaction does not occur, or it becomes probable that \n51\nTable of Contents\nit will not occur, we reclassify the gain or loss on the related cash flow hedge from accumulated other comprehensive income (loss) to revenue or operating expenses, as applicable. For the fiscal year ended November 29, 2024, there were no net gains or losses recognized in revenue or operating expenses relating to hedges of forecasted transactions that did not occur.\nNon-Designated Hedges of Foreign Currency Assets and Liabilities\nOur derivatives not designated as hedging instruments consist of foreign currency forward contracts that we primarily use to hedge monetary assets and liabilities denominated in non-functional currencies to reduce the risk that our earnings and cash flows will be adversely affected by changes in foreign currency exchange rates. These foreign exchange contracts are carried at fair value with changes in fair value of these contracts recorded to other income (expense), net in our Consolidated Statements of Income. These contracts reduce the impact of currency exchange rate movements on our assets and liabilities. At November 29, 2024, the outstanding balance sheet hedging derivatives had maturities of 180 days or less.\nSee Note 6 of our Notes to Consolidated Financial Statements for information regarding our derivative financial instruments.\nInterest Rate Risk\nShort-Term Investments and Fixed Income Securities\nAt November 29, 2024, we had debt securities classified as short-term investments of $273 million. Changes in interest rates could adversely affect the market value of these investments. A sensitivity analysis was performed on our short-term investment portfolio as of November 29, 2024, based on an estimate of the hypothetical changes in market value of the portfolio that would result from an immediate parallel shift in the yield curve. A 150 basis point increase in interest rates would lead to a $1 million decrease in the market value of our short-term investments. Conversely, a 150 basis point decrease in interest rates would lead to a $1 million increase in the market value of our short-term investments.\nSenior Notes\nAs of November 29, 2024, we had $5.65 billion of senior notes outstanding which bear interest at fixed rates, and therefore do not subject us to financial statement risk associated with changes in interest rates. As of November 29, 2024, the total carrying amount of our senior notes was $5.63 billion and the related fair value based on observable market prices in less active markets was $5.51 billion.\nSee Note 17 of our Notes to Consolidated Financial Statements for information regarding our senior notes.\n52\nTable of Contents\nITEM 8.  FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\n \nPage No.\nConsolidated Balance Sheets\n54\nConsolidated Statements of Income\n55\nConsolidated Statements of Comprehensive Income\n56\nConsolidated Statements of Stockholders' Equity\n57\nConsolidated Statements of Cash Flows\n58\nNotes to Consolidated Financial Statements\n59\nReport of Independent Registered Public Accounting Firm\n (\nKPMG LLP\n, \nSanta Clara, California\n,\n PCAOB ID \n185\n)\n91\nAll financial statement schedules have been omitted, since the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the Consolidated Financial Statements and Notes thereto. \n53\nTable of Contents\nADOBE INC.\n CONSOLIDATED BALANCE SHEETS\n(In millions, except par value)\n \nNovember 29,\n2024\nDecember 1,\n2023\nASSETS\nCurrent assets:\n \n \nCash and cash equivalents\n$\n7,613\n \n$\n7,141\n \nShort-term investments\n273\n \n701\n \nTrade receivables, net of allowances for doubtful accounts of $\n14\n and of $\n16\n, respectively\n2,072\n \n2,224\n \nPrepaid expenses and other current assets\n1,274\n \n1,018\n \nTotal current assets\n11,232\n \n11,084\n \nProperty and equipment, net\n1,936\n \n2,030\n \nOperating lease right-of-use assets, net\n281\n \n358\n \nGoodwill\n12,788\n \n12,805\n \nOther intangibles, net\n782\n \n1,088\n \nDeferred income taxes\n1,657\n \n1,191\n \nOther assets\n1,554\n \n1,223\n \nTotal assets\n$\n30,230\n \n$\n29,779\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\n \n \nTrade payables\n$\n361\n \n$\n314\n \nAccrued expenses\n2,336\n \n1,942\n \nDebt\n1,499\n \n—\n \nDeferred revenue\n6,131\n \n5,837\n \nIncome taxes payable\n119\n \n85\n \nOperating lease liabilities\n75\n \n73\n \nTotal current liabilities\n10,521\n \n8,251\n \nLong-term liabilities:\nDebt\n4,129\n \n3,634\n \nDeferred revenue\n128\n \n113\n \nIncome taxes payable\n548\n \n514\n \nOperating lease liabilities\n353\n \n373\n \nOther liabilities\n446\n \n376\n \nTotal liabilities\n16,125\n \n13,261\n \nCommitments and contingencies\nStockholders’ equity:\n \n \nPreferred stock, $\n0.0001\n par value; \n2\n shares authorized; \nnone\n issued\n—\n \n—\n \nCommon stock, $\n0.0001\n par value; \n900\n shares authorized; \n601\n shares issued; \n  \n441\n and \n455\n shares outstanding, respectively\n—\n \n—\n \nAdditional paid-in capital\n13,419\n \n11,586\n \nRetained earnings\n38,470\n \n33,346\n \nAccumulated other comprehensive income (loss)\n(\n201\n)\n(\n285\n)\nTreasury stock, at cost (\n160\n and \n146\n shares, respectively)\n(\n37,583\n)\n(\n28,129\n)\nTotal stockholders’ equity\n14,105\n \n16,518\n \nTotal liabilities and stockholders’ equity\n$\n30,230\n \n$\n29,779\n \nSee accompanying Notes to Consolidated Financial Statements.\n54\nTable of Contents\nADOBE INC.\nCONSOLIDATED STATEMENTS OF INCOME\n(In millions, except per share data)\n \nYears Ended\n \nNovember 29,\n2024\nDecember 1,\n2023\nDecember 2,\n2022\nRevenue:\n \nSubscription\n$\n20,521\n \n$\n18,284\n \n$\n16,388\n \nProduct\n386\n \n460\n \n532\n \nServices and other\n598\n \n665\n \n686\n \nTotal revenue\n21,505\n \n19,409\n \n17,606\n \n \nCost of revenue:\nSubscription\n1,799\n \n1,822\n \n1,646\n \nProduct\n25\n \n29\n \n35\n \nServices and other\n534\n \n503\n \n484\n \nTotal cost of revenue\n2,358\n \n2,354\n \n2,165\n \n \nGross profit\n19,147\n \n17,055\n \n15,441\n \n \nOperating expenses:\nResearch and development\n3,944\n \n3,473\n \n2,987\n \nSales and marketing\n5,764\n \n5,351\n \n4,968\n \nGeneral and administrative\n1,529\n \n1,413\n \n1,219\n \nAcquisition termination fee\n1,000\n \n—\n \n—\n \nAmortization of intangibles\n169\n \n168\n \n169\n \nTotal operating expenses\n12,406\n \n10,405\n \n9,343\n \n \nOperating income\n6,741\n \n6,650\n \n6,098\n \n \nNon-operating income (expense):\nInterest expense\n(\n169\n)\n(\n113\n)\n(\n112\n)\nInvestment gains (losses), net\n48\n \n16\n \n(\n19\n)\nOther income (expense), net\n311\n \n246\n \n41\n \nTotal non-operating income (expense), net\n190\n \n149\n \n(\n90\n)\nIncome before income taxes\n6,931\n \n6,799\n \n6,008\n \nProvision for income taxes\n1,371\n \n1,371\n \n1,252\n \nNet income\n$\n5,560\n \n$\n5,428\n \n$\n4,756\n \nBasic net income per share\n$\n12.43\n \n$\n11.87\n \n$\n10.13\n \nShares used to compute basic net income per share\n447\n \n457\n \n470\n \nDiluted net income per share\n$\n12.36\n \n$\n11.82\n \n$\n10.10\n \nShares used to compute diluted net income per share\n450\n \n459\n \n471\n \nSee accompanying Notes to Consolidated Financial Statements.\n55\nTable of Contents\nADOBE INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In millions)\nYears Ended\nNovember 29,\n2024\nDecember 1,\n2023\nDecember 2,\n2022\nIncrease/(Decrease)\nNet income\n$\n5,560\n \n$\n5,428\n \n$\n4,756\n \nOther comprehensive income (loss), net of taxes:\nAvailable-for-sale securities:\nUnrealized gains / losses on available-for-sale securities\n11\n \n24\n \n(\n39\n)\nReclassification adjustment for recognized gains / losses on available-for-sale securities\n—\n \n5\n \n—\n \nNet increase (decrease) from available-for-sale securities\n11\n \n29\n \n(\n39\n)\nDerivatives designated as hedging instruments:\nUnrealized gains / losses on derivative instruments\n89\n \n(\n12\n)\n139\n \nReclassification adjustment for realized gains / losses on derivative instruments\n17\n \n(\n31\n)\n(\n151\n)\nNet increase (decrease) from derivatives designated as hedging instruments\n106\n \n(\n43\n)\n(\n12\n)\nForeign currency translation adjustments\n(\n33\n)\n22\n \n(\n105\n)\nOther comprehensive income (loss), net of taxes\n84\n \n8\n \n(\n156\n)\nTotal comprehensive income, net of taxes\n$\n5,644\n \n$\n5,436\n \n$\n4,600\n \nSee accompanying Notes to Consolidated Financial Statements.\n56\nTable of Contents\nADOBE INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY \n(In millions)\n \nCommon Stock\nAdditional\nPaid-In\nCapital\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nTreasury Stock\n \n \nShares\nAmount\nShares\nAmount\nTotal\nBalances at December 3, 2021\n601\n \n$\n—\n \n$\n8,428\n \n$\n23,905\n \n$\n(\n137\n)\n(\n126\n)\n$\n(\n17,399\n)\n$\n14,797\n \nNet income\n— \n— \n— \n4,756\n \n— \n— \n— \n4,756\n \nOther comprehensive income (loss), net of taxes\n— \n— \n— \n— \n(\n156\n)\n— \n— \n(\n156\n)\nRe-issuance of treasury stock under stock compensation plans\n— \n— \n— \n(\n342\n)\n— \n3\n \n102\n \n(\n240\n)\nRepurchases of common stock\n— \n— \n— \n— \n— \n(\n16\n)\n(\n6,550\n)\n(\n6,550\n)\nStock-based compensation\n— \n— \n1,440\n \n— \n— \n— \n— \n1,440\n \nValue of shares in deferred compensation plan\n— \n— \n— \n— \n— \n— \n4\n \n4\n \nBalances at December 2, 2022\n601\n \n$\n—\n \n$\n9,868\n \n$\n28,319\n \n$\n(\n293\n)\n(\n139\n)\n$\n(\n23,843\n)\n$\n14,051\n \nNet income\n— \n— \n— \n5,428\n \n— \n— \n— \n5,428\n \nOther comprehensive income (loss), net of taxes\n— \n— \n— \n— \n8\n \n— \n— \n8\n \nRe-issuance of treasury stock under stock compensation plans\n— \n— \n— \n(\n401\n)\n— \n5\n \n126\n \n(\n275\n)\nRepurchases of common stock\n— \n— \n— \n— \n— \n(\n12\n)\n(\n4,414\n)\n(\n4,414\n)\nStock-based compensation\n— \n— \n1,718\n \n— \n— \n— \n— \n1,718\n \nValue of shares in deferred compensation plan\n— \n— \n— \n— \n— \n— \n2\n \n2\n \nBalances at December 1, 2023\n601\n \n$\n—\n \n$\n11,586\n \n$\n33,346\n \n$\n(\n285\n)\n(\n146\n)\n$\n(\n28,129\n)\n$\n16,518\n \nNet income\n— \n— \n— \n5,560\n \n— \n— \n— \n5,560\n \nOther comprehensive income (loss), net of taxes\n— \n— \n— \n— \n84\n \n— \n— \n84\n \nRe-issuance of treasury stock under stock compensation plans\n— \n— \n— \n(\n436\n)\n— \n4\n \n120\n \n(\n316\n)\nRepurchases of common stock\n— \n— \n— \n— \n— \n(\n18\n)\n(\n9,574\n)\n(\n9,574\n)\nStock-based compensation\n— \n— \n1,833\n \n— \n— \n— \n— \n1,833\n \nBalances at November 29, 2024\n601\n \n$\n—\n \n$\n13,419\n \n$\n38,470\n \n$\n(\n201\n)\n(\n160\n)\n$\n(\n37,583\n)\n$\n14,105\n \nSee accompanying Notes to Consolidated Financial Statements.\n57\nTable of Contents\nADOBE INC.\n CONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\n \nYears Ended\n \nNovember 29,\n2024\nDecember 1,\n2023\nDecember 2,\n2022\nCash flows from operating activities:\n \n \nNet income\n$\n5,560\n \n$\n5,428\n \n$\n4,756\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation, amortization and accretion\n857\n \n872\n \n856\n \nStock-based compensation\n1,833\n \n1,718\n \n1,440\n \nReduction of operating lease right-of-use assets\n77\n \n72\n \n83\n \nLease-related asset impairments\n78\n \n—\n \n—\n \nDeferred income taxes\n(\n468\n)\n(\n426\n)\n328\n \nUnrealized losses (gains) on investments, net\n(\n35\n)\n(\n10\n)\n29\n \nOther non-cash items\n10\n \n3\n \n10\n \nChanges in operating assets and liabilities, net of acquired assets and \n    assumed liabilities:\nTrade receivables, net\n143\n \n(\n159\n)\n(\n198\n)\nPrepaid expenses and other assets\n(\n616\n)\n(\n818\n)\n(\n94\n)\nTrade payables\n44\n \n(\n49\n)\n66\n \nAccrued expenses and other liabilities\n196\n \n146\n \n7\n \nIncome taxes payable\n68\n \n(\n11\n)\n19\n \nDeferred revenue\n309\n \n536\n \n536\n \nNet cash provided by operating activities\n8,056\n \n7,302\n \n7,838\n \nCash flows from investing activities:\n \n \nPurchases of short-term investments\n(\n59\n)\n—\n \n(\n909\n)\nMaturities of short-term investments\n486\n \n965\n \n683\n \nProceeds from sales of short-term investments\n11\n \n223\n \n270\n \nAcquisitions, net of cash acquired\n—\n \n—\n \n(\n126\n)\nPurchases of property and equipment\n(\n183\n)\n(\n360\n)\n(\n442\n)\nPurchases of long-term investments, intangibles and other assets\n(\n108\n)\n(\n53\n)\n(\n46\n)\nProceeds from sales of long-term investments and other assets\n2\n \n1\n \n—\n \nNet cash provided by (used for) investing activities\n149\n \n776\n \n(\n570\n)\nCash flows from financing activities:\n \n \nRepurchases of common stock\n(\n9,500\n)\n(\n4,400\n)\n(\n6,550\n)\nProceeds from re-issuance of treasury stock\n361\n \n314\n \n278\n \nTaxes paid related to net share settlement of equity awards\n(\n677\n)\n(\n589\n)\n(\n518\n)\nProceeds from issuance of debt\n1,997\n \n—\n \n—\n \nRepayment of debt\n—\n \n(\n500\n)\n—\n \nOther financing activities, net\n95\n \n(\n7\n)\n(\n35\n)\nNet cash used for financing activities\n(\n7,724\n)\n(\n5,182\n)\n(\n6,825\n)\nEffect of foreign currency exchange rates on cash and cash equivalents\n(\n9\n)\n9\n \n(\n51\n)\nNet change in cash and cash equivalents\n472\n \n2,905\n \n392\n \nCash and cash equivalents at beginning of year\n7,141\n \n4,236\n \n3,844\n \nCash and cash equivalents at end of year\n$\n7,613\n \n$\n7,141\n \n$\n4,236\n \nSupplemental disclosures:\n \nCash paid for income taxes, net of refunds\n$\n1,727\n \n$\n1,854\n \n$\n778\n \nCash paid for interest\n$\n143\n \n$\n106\n \n$\n103\n \nSee accompanying Notes to Consolidated Financial Statements.\n58\nTable of Contents\nADOBE INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \n \nNOTE 1.  \nBASIS OF PRESENTATION AND SIGNIFICANT ACCOUNTING POLICIES\nOperations\nAdobe is a global technology company with a mission to change the world through personalized digital experiences. For over four decades, Adobe’s innovations have transformed how individuals, teams, businesses, enterprises, institutions, and governments engage and interact across all types of media. Our products, services and solutions are used around the world to imagine, create, manage, deliver, measure, optimize and engage with content across surfaces and fuel digital experiences. We have a diverse user base that includes consumers, communicators, creative professionals, developers, students, small and medium businesses and enterprises. We are also empowering creators by putting the power of artificial intelligence (“AI”) in their hands, and doing so in ways we believe are responsible. Our products and services help unleash creativity, accelerate document productivity and power businesses in a digital world. We have operations in the Americas; Europe, Middle East and Africa (“EMEA”); and Asia-Pacific (“APAC”).\nBasis of Presentation\nThe accompanying Consolidated Financial Statements include those of Adobe and its subsidiaries, after elimination of all intercompany accounts and transactions. We have prepared the accompanying Consolidated Financial Statements in accordance with generally accepted accounting principles in the United States (“GAAP”) and pursuant to the rules and regulations of the U.S. Securities and Exchange Commission (the “SEC”).\nUse of Estimates\nIn preparing the Consolidated Financial Statements and related disclosures in conformity with GAAP and pursuant to the rules and regulations of the SEC, we must make estimates and judgments that affect the amounts reported in the Consolidated Financial Statements and accompanying Notes. Estimates are used for, but not limited to, sales allowances and programs, bad debts, stock-based compensation, determining the fair value of acquired assets and assumed liabilities, litigation and income taxes. Actual results may differ materially from these estimates.\nFiscal Year\nOur fiscal year is a 52- or 53-week year that ends on the Friday closest to November 30. Fiscal years 2024, 2023 and 2022 were \n52\n-week years.\nReclassifications\nCertain prior year amounts, which are not material, have been reclassified to conform to current year presentation in the Notes to Consolidated Financial Statements.\nSignificant Accounting Policies\nRevenue Recognition\nOur revenue is derived from the sale of cloud-enabled software subscriptions, cloud-hosted offerings, term-based, royalty, and perpetual software licenses, associated software maintenance and support plans, consulting services, training and technical support. Most of our enterprise customer arrangements involve multiple promises to our customers.\nRevenue is recognized when a contract exists between us and a customer and upon transfer of control of promised products or services to customers in an amount that reflects the consideration we expect to receive in exchange for those products or services. We enter into contracts that can include various combinations of products and services, which may be capable of being distinct and accounted for as separate performance obligations, or in the case of offerings such as cloud-enabled Creative Cloud and Document Cloud, accounted for as a single performance obligation. Revenue is recognized net of allowances for returns and any taxes collected from customers, which are subsequently remitted to governmental authorities.\n59\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nSubscription, Product and Services Offerings\nWe enter into revenue arrangements in which a customer may purchase a combination of our products, services and/or solutions as described above. Certain revenue arrangements provide customers with unilateral cancellation rights, or options to either renew monthly on-premise term-based licenses or use committed funds to purchase other Adobe products or services.\nFully hosted subscription services (“SaaS”) allow customers to access hosted software during the contractual term without taking possession of the software. Cloud-hosted subscription services may be sold on a fee-per-subscription period basis or based on consumption or usage.\nWe recognize revenue ratably over the contractual service term, which typically ranges from \n1\n to \n36\n months, for hosted services that are priced based on a committed number of transactions where the delivery and consumption of the benefit of the services occur evenly over time, beginning on the date the services associated with the committed transactions are first made available to the customer and continuing through the end of the contractual service term. Over-usage fees and fees based on the actual number of transactions are billed in accordance with contract terms as these fees are incurred and are included in the transaction price of an arrangement as variable consideration. Fees based on a number of transactions, where invoicing is aligned to the pattern of performance, customer benefit and consumption, are typically accounted for utilizing the “as-invoiced” practical expedient. Revenue for subscriptions sold as a fee per period is recognized ratably over the contractual term as the customer simultaneously receives and consumes the benefit of the underlying service.\nWhen cloud-enabled services are highly integrated and interrelated with on-premise software, such as in our cloud-enabled Creative Cloud and Document Cloud offerings, the individual components are not considered distinct and revenue is recognized ratably over the subscription period for which the cloud-enabled services are provided.\nThe subscription support plans related to those customer arrangements whose revenues we classify as subscription revenues represent stand-ready performance obligations. Revenue from these subscription support plans is recognized ratably over their respective contractual terms and classified as subscription revenue.\nLicenses for on-premise software may be purchased on a perpetual basis, as a subscription for a fixed period of time or based on usage for certain of our original equipment manufacturer (“OEM”) and royalty agreements. Revenue from non-cloud enabled on-premise licenses without unilateral cancellation rights or monthly renewal options is recognized at the point in time the software is available to the customer, provided all other revenue recognition criteria are met, and classified as product revenue on our Consolidated Statements of Income. Revenue from on-premise term license or term licensing arrangements with unilateral cancellation rights or monthly renewal options, and any associated maintenance and support, is classified as subscription revenue.\nOur services and other revenue is comprised primarily of fees related to consulting, training, maintenance and support for certain on-premise licenses that are recognized at a point in time and our advertising offerings. We typically sell our consulting contracts on a time-and-materials or fixed-fee basis. These revenues are recognized as the services are performed for time-and-materials contracts and on a relative performance basis for fixed-fee contracts. Training revenues are recognized as the services are performed. Our maintenance and support offerings, which entitle customers, partners and developers to receive desktop product upgrades and enhancements or technical support, depending on the offering, are generally recognized ratably over the term of the arrangement. Our transaction-based advertising offerings, where fees are based on a number of impressions per month and invoicing is aligned to the pattern of performance, customer benefit and consumption, are typically accounted for utilizing the “as-invoiced” practical expedient.\nJudgments\nOur contracts with customers may include multiple goods and services. For example, some of our offerings include both on-premise and/or on-device software licenses and cloud services. Determining whether the software licenses and the cloud services are distinct from each other, and therefore performance obligations to be accounted for separately, or not distinct from each other, and therefore part of a single performance obligation, may require significant judgment. We have concluded that the on-premise/on-device software licenses and cloud services provided in our Creative Cloud and Document Cloud subscription offerings are not distinct from each other such that revenue from each offering should be recognized ratably over the subscription period for which the cloud services are provided. In reaching this conclusion, we considered the nature of our \n60\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\npromise to Creative Cloud and Document Cloud customers, which is to provide a complete end-to-end creative design or document workflow solution that operates seamlessly across multiple devices and teams. We fulfill this promise by providing access to a solution that integrates cloud-based and on-premise/on-device features that, together through their integration, provide functionalities, utility and workflow efficiencies that could not be obtained from either the on-premise/on-device software or cloud services on their own.\nCloud-based features that are integral to our Creative Cloud and Document Cloud offerings and that work together with the on-premise/on-device software include, but are not limited to: Creative Cloud Libraries, which enable customers to access their work, settings, preferences and other assets seamlessly across desktop and mobile devices and collaborate across teams in real time; shared reviews which enable simultaneous editing and commenting of digital assets across desktop, mobile and web; automatic cloud rendering of a design which enables it to be worked on in multiple mediums; and Sensei, Adobe’s cloud-hosted artificial intelligence and machine learning framework, which enables features such as automated photo-editing, photograph content-awareness, natural language processing, optical character recognition and automated document tagging.\nStandalone selling price is established by maximizing the amount of observable inputs, primarily actual historical selling prices for performance obligations where available, and includes consideration of factors such as go-to-market model and geography. Individual products may have multiple values for standalone selling price depending on factors such as where they are sold and what channel they are sold through. Where standalone selling price may not be directly observable (e.g., the performance obligation is not sold separately), we maximize the use of observable inputs by using information that may include reviewing pricing practices, performance obligations with similar customers and selling models.\nCapitalized costs to obtain a contract are amortized over the expected period of benefit, which we have determined, based on analysis, to be \n5\n years. We evaluated qualitative and quantitative factors to determine the period of amortization, including contract length, renewals, customer life and the useful lives of our products and acquired products. When the expected period of benefit of an asset which would be capitalized is less than one year, we expense the amount as incurred, utilizing the practical expedient. We regularly evaluate whether there have been changes in the underlying assumptions and data used to determine the amortization period. \nWhen revenue arrangements include components of third-party goods and services, for example in transactions which involve resale, fulfillment or providing advertising impressions to our end customer, we evaluate whether we are the principal, and report revenues on a gross basis, or an agent, and report revenues on a net basis. In this assessment, we consider if we obtain control of the specified goods or services before they are transferred to the customer by evaluating indicators such as which party is primarily responsible for fulfilling the promise to provide the goods or services, which party has discretion in establishing price and the underlying terms and conditions between the parties to the transaction.\nWe offer limited rights of return, rebates and price protection of our products under various policies and programs with our distributors, resellers and/or end-user customers. We estimate and record reserves for these programs as variable consideration when estimating transaction price. Returns, rebates and other offsets to transaction price are estimated at contract inception on a portfolio basis and assessed for reasonableness each reporting period when additional information becomes available.\nGeneral Contract Provisions\nWe maintain revenue reserves for rebates, rights of return and other limited price adjustments. Distributors are allowed limited rights of return of products purchased during the previous quarter. In addition, distributors are allowed to return products that have reached the end of their lives, as defined by us, and for products that are being replaced by new versions. We offer rebates to our distributors, resellers and/or end-user customers. Transaction price is reduced for these amounts based on actual performance against objectives set forth by us for a particular reporting period, such as volume and timely reporting. \nOn a quarterly basis, the amount of revenue that is reserved is calculated based on our historical trends and data specific to each reporting period. The primary method of establishing these reserves is to review historical data from prior periods as a percent of revenue to determine a historical reserve rate. We then apply the historical rate to the current period revenue as a basis for estimating future returns. When necessary, we also provide a specific reserve in excess of portfolio-level estimated requirements. This estimate can be affected by the amount of a particular product in the channel, the rate of sell-through, product plans and other factors.\n61\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nAlthough our subscription contracts are generally non-cancellable, a limited number of customers have the right to cancel their contracts by providing prior written notice to us of their intent to cancel the remainder of the contract term and consumers have a period of time to terminate certain agreements without penalty. In the event a customer cancels their contract, they are generally not entitled to a refund for prior services we have provided to them. Contracts that include termination rights without substantive penalty are accounted for as contracts only for the committed period. Periods of time after the right of termination are accounted for as optional purchases when they do not represent material rights. For certain of our usage-based license agreements, typically in our royalty and OEM businesses, reporting may be received after the end of a fiscal period. In such instances, we estimate and accrue license revenue. We base our estimates on multiple factors, including historical sales information, seasonality and other business information which may impact our estimates. We do not estimate variable consideration for our sales and usage-based license royalty agreements, consistent with the associated exception for sales and usage-based royalties for the license of intellectual property under the revenue recognition standard.\nProperty and Equipment\nWe record property and equipment at cost less accumulated depreciation and amortization. Property and equipment are depreciated using the straight-line method over their estimated useful lives, generally as follows: \n3\n to \n20\n years for computers and other equipment, which includes our corporate jet, \n5\n years for furniture and fixtures, \n15\n years for building improvements and \n35\n years for buildings. Leasehold improvements are amortized using the straight-line method over the lesser of the remaining respective lease term or estimated useful life of the asset.\nLeases\nWe determine if an arrangement is or contains a lease at contract inception. In certain of our lease arrangements, primarily those related to our data center arrangements, judgment is required in determining if a contract contains a lease. For these arrangements, there is judgment in evaluating if the arrangement involves an identified asset that is physically distinct or whether we have the right to substantially all of the capacity of an identified asset that is not physically distinct. In arrangements that involve an identified asset, there is also judgment in evaluating if we have the right to direct the use of that asset. \nWe do not have any finance leases. Operating leases are recorded in our Consolidated Balance Sheets. Right-of-use assets and lease liabilities are measured at the lease commencement date based on the present value of the remaining lease payments over the lease term, determined using the discount rate for the lease at the commencement date. Because the rate implicit in our leases is not readily determinable, we use our incremental borrowing rate as the discount rate, which approximates the interest rate at which we could borrow on a collateralized basis with similar terms and payments and in similar economic environments. Our lease terms include optional periods to extend or terminate the lease when it is reasonably certain that the option will be exercised. Operating lease expense is recognized on a straight-line basis over the lease term. We generally account for lease and non-lease components, principally common area maintenance for our facilities leases, as a single lease component for our facilities and data center leases.\nIn accordance with accounting requirements, leases with an initial term of 12 months or less are recorded on the balance sheet, with lease expense for these leases recognized on a straight-line basis over the lease term.\n \nGoodwill, Intangibles and Other Long-Lived Assets\nGoodwill is assigned to one or more reporting units on the date of acquisition. We review our goodwill for impairment annually during our second quarter of each fiscal year and between annual tests if an event occurs or circumstances change that would more likely than not reduce the fair value of any one of our reporting units below its respective carrying amount. In performing our goodwill impairment test, we first perform a qualitative assessment, which requires that we consider events or circumstances including macroeconomic conditions, industry and market considerations, cost factors, overall financial performance, changes in management or key personnel, changes in strategy, changes in customers, changes in the composition or carrying amount of a reporting unit’s net assets and changes in our stock price. If, after assessing the totality of events or circumstances, we determine that it is more likely than not that the fair values of our reporting units are greater than the carrying amounts, then the quantitative goodwill impairment test is not performed.\n62\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nIf the qualitative assessment indicates that the quantitative analysis should be performed, we then evaluate goodwill for impairment by comparing the fair value of each of our reporting units to its carrying value, including the associated goodwill. To determine the fair values, we use the equal weighting of the market approach based on comparable publicly traded companies in similar lines of businesses and the income approach based on estimated discounted future cash flows. Our cash flow assumptions consider historical and forecasted revenue, operating costs and other relevant factors.\nWe amortize intangible assets with finite lives over their estimated useful lives and review them for impairment whenever an impairment indicator exists. Amortization is based on the pattern in which the economic benefits of the intangible asset will be consumed or on a straight-line basis when the consumption pattern is not apparent. \nWe continually monitor events and changes in circumstances that could indicate that the carrying amounts of our long-lived assets, including our property and equipment, leases and intangible assets, may not be recoverable. When such events or changes in circumstances occur, we assess recoverability by determining whether the carrying value of such assets will be recovered through the undiscounted expected future cash flows. If the future undiscounted cash flows are less than the carrying amount of these assets, we recognize an impairment loss based on any excess of the carrying amount over the fair value of the assets.\nIncome Taxes\nWe use the asset and liability method of accounting for income taxes. Under this method, income tax expense is recognized for the amount of taxes payable or refundable for the current year. In addition, deferred tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax bases of assets and liabilities, and for tax loss and credit carryforwards. Significant judgment is required in determining our current provision for income taxes and deferred tax assets or liabilities. We record a valuation allowance to reduce deferred tax assets to an amount for which realization is more likely than not.\nOur assumptions, judgments and estimates relative to the current provision for income taxes take into account our interpretation and application of current tax laws and possible outcomes of current and future examinations conducted by domestic and foreign tax authorities. We have established reserves for income taxes to address potential exposures involving tax positions that could be challenged by tax authorities. We regularly assess the likelihood of outcomes resulting from these examinations to determine the adequacy of our provision for income taxes and associated reserves. Our policy is to record interest and penalties related to unrecognized tax benefits in income tax expense.\nTaxes Collected from Customers\nWe net taxes collected from customers against those remitted to government authorities in our financial statements. Accordingly, taxes collected from customers are not reported as revenue.\nTreasury Stock\nPrepayments made for repurchases of our common stock are classified as treasury stock on our Consolidated Balance Sheets and only shares physically delivered to us by each period end are excluded from the computation of net income per share.\nWe account for treasury stock under the cost method. When treasury stock is re-issued at a price higher than its cost, the difference is recorded as a component of additional paid-in capital in our Consolidated Balance Sheets. When treasury stock is re-issued at a price lower than its cost, the difference is recorded as a component of additional paid-in capital to the extent that there are previously recorded gains to offset the losses. If there are no treasury stock gains in additional paid-in capital, the losses upon re-issuance of treasury stock are recorded as a reduction of retained earnings in our Consolidated Balance Sheets.\nAdvertising Expenses\nAdvertising costs are expensed as incurred. Advertising expenses for fiscal 2024, 2023 and 2022 were $\n1.04\n billion, $\n970\n million and $\n1.04\n billion, respectively.\n63\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nForeign Currency Translation\nWe translate assets and liabilities of foreign subsidiaries, whose functional currency is their local currency, at exchange rates in effect at the balance sheet date. We translate revenue and expenses at the monthly average exchange rates. We include accumulated net translation adjustments in stockholders’ equity as a component of accumulated other comprehensive income (loss).\nDerivative Financial Instruments\nIn countries outside the United States, we transact business in U.S. Dollars and in various other currencies. We may use foreign exchange forward contracts and option contracts to hedge a portion of our forecasted foreign currency denominated revenue and expenses primarily in Euros, Japanese Yen, British Pounds, Indian Rupees, Australian Dollars and Canadian Dollars. Additionally, we hedge our net recognized foreign currency monetary assets and liabilities with foreign exchange forward contracts to reduce the risk that our earnings and cash flows will be adversely affected by changes in exchange rates. \nWe recognize all derivative instruments as either assets or liabilities in our Consolidated Balance Sheets and measure them at fair value. Gains and losses resulting from changes in fair value are accounted for depending on the use of the derivative and whether it is designated and qualifies for hedge accounting. Contracts that do not qualify for hedge accounting are adjusted to fair value through earnings. \nGains and losses related to changes in the fair value of foreign exchange forward contracts which hedge certain balance sheet positions are recorded each period as a component of other income (expense), net in our Consolidated Statements of Income. Foreign exchange forward contracts and option contracts hedging forecasted foreign currency revenue and expenses and Treasury lock agreements are designated as cash flow hedges with gains and losses recorded net of tax as a component of accumulated other comprehensive income (loss) in our Consolidated Balance Sheets until the forecasted transaction occurs. When the forecasted transaction affects earnings, we reclassify the related gain or loss on the foreign currency revenue, foreign currency expense or Treasury lock cash flow hedge to revenue, operating expense or interest expense, as applicable.\nConcentration of Risk\nFinancial instruments that potentially subject us to concentrations of credit risk are short-term fixed-income investments, structured repurchase transactions, foreign currency and interest rate hedge contracts and trade receivables.\nOur investment portfolio consists of investment-grade securities diversified among security types, industries and issuers. Our cash and investments are held and primarily managed by recognized financial institutions that follow our investment policy. Our policy limits the amount of credit exposure to any one security issue or issuer and we believe no significant concentration of credit risk exists with respect to these investments.\nWe enter into master netting arrangements to mitigate credit risk in derivative transactions by permitting net settlement of transactions with the same counterparty. We also enter into collateral security agreements with certain of our counterparties to exchange cash collateral when the net fair value of certain derivative instruments fluctuates from contractually established thresholds.\nCredit risk in receivables is limited to OEMs, dealers and distributors of hardware and software products to the retail market, customers to whom we license software directly and our SaaS offerings. A credit review is completed for our new distributors, dealers and OEMs. We also perform ongoing credit evaluations of our customers’ financial condition and require letters of credit or other guarantees, whenever deemed necessary. The credit limit given to the customer is based on our risk assessment of their ability to pay, country risk and other factors and is not contingent on the resale of the product or on the collection of payments from their customers. Certain contracts with advertising agencies contain sequential liability provisions, under which the agency is not required to pay until payment is received from the agency’s customers. In these circumstances, we evaluate the credit-worthiness of the agency’s customers in addition to the agency itself. If we license our software or provide SaaS services to a customer where we have a reason to believe the customer’s ability and intention to pay is not probable, the arrangement is not considered to be a revenue contract. Accordingly, we will not recognize any consideration received as revenue until termination or substantive completion of the services.\n64\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nRecent Accounting Pronouncements Not Yet Effective\nIn November 2023, the Financial Accounting Standards Board (the “FASB”) issued Accounting Standards Update (“ASU”) No. 2023-07, Segment Reporting, which expands annual and interim disclosure requirements for reportable segments, primarily through enhanced disclosures about significant segment expenses. The updated standard is effective for our annual periods beginning in fiscal 2025 and interim periods beginning in the first quarter of fiscal 2026. Early adoption is permitted. We are currently evaluating the impact that the updated standard will have on our financial statement disclosures.\nIn December 2023, the FASB issued ASU No. 2023-09, Income Taxes, which prescribes standardized categories and disaggregation of information in the reconciliation of provision for income taxes, requires disclosure of disaggregated income taxes paid, and modifies other income tax-related disclosure requirements. The updated standard is effective for us beginning with our fiscal year 2026 annual reporting period. Early adoption is permitted. We are currently evaluating the impact that the updated standard will have on our financial statement disclosures.\nIn November 2024, the FASB issued ASU No. 2024-03, Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures, which requires additional disclosure of certain costs and expenses within the notes to the financial statements. The updated standard is effective for our annual periods beginning in fiscal 2028 and interim periods beginning in the first quarter of fiscal 2029. Early adoption is permitted. We are currently evaluating the impact that the updated standard will have on our financial statement disclosures.\nThere have been no other recent accounting pronouncements, changes in accounting pronouncements or recently adopted accounting guidance during fiscal 2024 that are of significance or potential significance to us.\nNOTE 2.  \nREVENUE\nSegment Information\nWe report segment information based on the “management” approach. The management approach designates the internal reporting used by management for making decisions and assessing performance as the source of our reportable segments.\nOur Chief Executive Officer, the chief operating decision maker, reviews revenue and gross margin information for each of our reportable segments, but does not review operating expenses on a segment by segment basis. In addition, with the exception of goodwill, we do not identify or allocate our assets by the reportable segments.\nOur business is organized into the following reportable segments:\n•\nDigital Media\n—Our Digital Media segment provides products and services that enable individuals, teams, businesses, and enterprises to create, publish and promote their content anywhere and accelerate their productivity by transforming how they view, share, engage with and collaborate on documents and creative content. Our customers include creative professionals, including photographers, video editors, graphic and experience designers and game developers; communicators, including content creators, students, marketers and knowledge workers; and consumers. \n•\nDigital Experience\n—Our Digital Experience segment provides an integrated platform and set of products, services and solutions that enable businesses to create, manage, execute, measure, monetize and optimize customer experiences that span from analytics to commerce. Our customers include marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers and executives across the C-suite. \n•\nPublishing and Advertising\n—Our Publishing and Advertising segment contains legacy products and services that address diverse market opportunities, including eLearning solutions, technical document publishing, web conferencing, document and forms platform, web app development, high-end printing and our Adobe Advertising offerings.\n65\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nOur segment revenue and results for fiscal 2024, 2023 and 2022 were as follows:\n(dollars in millions)\nDigital \nMedia\nDigital \nExperience\nPublishing and \nAdvertising\nTotal\nFiscal 2024\nRevenue\n$\n15,864\n \n$\n5,366\n \n$\n275\n \n$\n21,505\n \nCost of revenue\n680\n \n1,589\n \n89\n \n2,358\n \nGross profit\n$\n15,184\n \n$\n3,777\n \n$\n186\n \n$\n19,147\n \nGross profit as a percentage of revenue\n96\n \n%\n70\n \n%\n68\n \n%\n89\n \n%\nFiscal 2023\nRevenue\n$\n14,216\n \n$\n4,893\n \n$\n300\n \n$\n19,409\n \nCost of revenue\n665\n \n1,603\n \n86\n \n2,354\n \nGross profit\n$\n13,551\n \n$\n3,290\n \n$\n214\n \n$\n17,055\n \nGross profit as a percentage of revenue\n95\n \n%\n67\n \n%\n71\n \n%\n88\n \n%\nFiscal 2022\nRevenue\n$\n12,842\n \n$\n4,422\n \n$\n342\n \n$\n17,606\n \nCost of revenue\n561\n \n1,502\n \n102\n \n2,165\n \nGross profit\n$\n12,281\n \n$\n2,920\n \n$\n240\n \n$\n15,441\n \nGross profit as a percentage of revenue\n96\n \n%\n66\n \n%\n70\n \n%\n88\n \n%\nWe generally categorize revenue by geographic area based on where the customer manages their utilization of our offerings. \nRevenue by geographic area for fiscal 2024, 2023 and 2022 were as follows:\n(in millions)\n2024\n2023\n2022\nAmericas:\n \n \n \nUnited States\n$\n11,499\n \n$\n10,460\n \n$\n9,217\n \nOther\n1,392\n \n1,194\n \n1,034\n \nTotal Americas\n12,891\n \n11,654\n \n10,251\n \nEMEA\n5,554\n \n4,881\n \n4,593\n \nAPAC\n3,060\n \n2,874\n \n2,762\n \nRevenue\n$\n21,505\n \n$\n19,409\n \n$\n17,606\n \nRevenue by major offerings in our Digital Media reportable segment for fiscal 2024, 2023 and 2022 were as follows:\n(in millions)\n2024\n2023\n2022\nCreative Cloud\n$\n12,682\n \n$\n11,517\n \n$\n10,459\n \nDocument Cloud\n3,182\n \n2,699\n \n2,383\n \nTotal Digital Media revenue\n$\n15,864\n \n$\n14,216\n \n$\n12,842\n \nSubscription revenue by segment for fiscal 2024, 2023 and 2022 were as follows:\n(in millions)\n2024\n2023\n2022\nDigital Media \n$\n15,547\n \n$\n13,838\n \n$\n12,385\n \nDigital Experience\n4,864\n \n4,331\n \n3,880\n \nPublishing and Advertising\n110\n \n115\n \n123\n \nTotal subscription revenue\n$\n20,521\n \n$\n18,284\n \n$\n16,388\n \n66\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nContract Balances\nTrade Receivables\nA receivable is recorded when an unconditional right to invoice and receive payment exists, such that only the passage of time is required before payment of consideration is due. Timing of revenue recognition may differ from the timing of invoicing to customers. Certain performance obligations may require payment before delivery of the license or service to the customer. Included in trade receivables on the Consolidated Balance Sheets are unbilled receivable balances which have not yet been invoiced, and are typically related to license revenue or services which are delivered prior to invoicing. As of November 29, 2024, the balance of trade receivables, net of allowances for doubtful accounts, was $\n2.07\n billion, inclusive of unbilled receivables of $\n66\n million. As of December 1, 2023, the balance of trade receivables, net of allowances for doubtful accounts, was $\n2.22\n billion, inclusive of unbilled receivables of $\n80\n million.\nAllowance for Doubtful Accounts\nWe maintain an allowance for doubtful accounts which reflects our best estimate of potentially uncollectible trade receivables and is based on both specific and general reserves. We maintain general reserves on a collective basis by considering factors such as historical experience, credit-worthiness, the age of the trade receivable balances, current economic conditions and a reasonable and supportable forecast of future economic conditions.\n The allowance for doubtful accounts was $\n14\n million and $\n16\n million as of November 29, 2024 and December 1, 2023, respectively.\nContract Assets\nA contract asset is recognized when a conditional right to consideration exists and transfer of control has occurred. Contract assets are typically related to subscription and hosted service contracts where the transaction price allocated to the satisfied performance obligations exceeds the value of billings to date. Contract assets are included in prepaid expenses and other current assets for the current portion and other assets for the long-term portion on the Consolidated Balance Sheets. We regularly review contract asset balances for impairment, considering factors such as historical experience, credit-worthiness, age of the balance, current economic conditions and a reasonable and supportable forecast of future economic conditions. Contract asset impairments were not material in fiscal 2024 and 2023. Contract assets were $\n248\n million and $\n141\n million as of November 29, 2024 and December 1, 2023, respectively.\nDeferred Revenue and Remaining Performance Obligations\nDeferred revenue primarily consists of billings or payments received in advance of revenue recognition from subscription services, including non-cancellable and non-refundable committed funds and refundable customer deposits. Deferred revenue is recognized as revenue when transfer of control to customers has occurred. Customers are typically invoiced for these agreements in regular installments and revenue is recognized ratably over the contractual subscription period. The deferred revenue balance is influenced by several factors, including the compounding effects of renewals, invoice duration, invoice timing, size and new business linearity within the quarter. Deferred revenue does not represent the total contract value of annual or multi-year non-cancellable subscription agreements. \nPayment terms and conditions vary by contract type, although terms generally include a requirement of payment within 30 to 60 days. In instances where the timing of revenue recognition differs from the timing of invoicing, we have determined our contracts generally do not include a significant financing component. The primary purpose of our invoicing terms is to provide customers with simplified and predictable ways of purchasing our products and services, such as invoicing at the beginning of a subscription term with revenue recognized ratably over the contract period, and not to receive financing from our customers. Any potential financing fees are considered insignificant in the context of our contracts.\nAs of November 29, 2024, the balance of deferred revenue was $\n6.26\n billion, which includes $\n83\n million of refundable customer deposits. Refundable customer deposits represent arrangements in which the customer has a unilateral cancellation right for which we are obligated to refund amounts paid related to products or services not yet delivered or provided at the time of cancellation on a prorated basis. Arrangements with some of our enterprise customers with non-cancellable and non-refundable committed funds provide options to either renew monthly on-premise term-based licenses or use some or all funds to purchase other Adobe products or services. Non-cancellable and non-refundable committed funds related to these agreements comprised approximately \n4\n% of the total deferred revenue. \n67\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nAs of December 1, 2023, the balance of deferred revenue was $\n5.95\n billion. Significant movements in the deferred revenue balance during the period consisted of increases due to payments received prior to transfer of control of the underlying performance obligations to the customer, which were offset by decreases due to revenue recognized in the period. During the year ended November 29, 2024, approximately $\n5.87\n billion of revenue was recognized that was included in the balance of deferred revenue as of December 1, 2023.\nTransaction price allocated to remaining performance obligations represents contracted revenue that has not yet been recognized, which includes deferred revenue and unbilled amounts that will be recognized as revenue in future periods. Transaction price allocated to remaining performance obligations is influenced by several factors, including the timing of renewals and average contract term. We applied practical expedients to exclude amounts related to performance obligations that are billed and recognized as they are delivered, optional purchases that do not represent material rights, sales and usage-based royalties not yet consumed and any estimated amounts of variable consideration that are subject to constraint. \nRemaining performance obligations were approximately $\n19.96\n billion as of November 29, 2024. Non-cancellable and non-refundable committed funds related to some of our enterprise customer agreements referred to in the paragraph above comprised approximately \n4\n% of the total remaining performance obligations. Approximately \n67\n% of the remaining performance obligations, excluding the aforementioned enterprise customer agreements, are expected to be recognized over the next 12 months with the remainder recognized thereafter.\nContract Acquisition Costs\nWe recognize an asset for the incremental costs of obtaining a contract with a customer if we expect the benefit of those costs to be longer than one year. We have determined that certain sales incentive programs meet the requirements to be capitalized. \nThe costs capitalized are primarily sales commissions paid to our sales force personnel. Capitalized costs may also include portions of fringe benefits and payroll taxes associated with compensation for incremental costs to acquire customer contracts and incentive payments to partners.\nCapitalized costs to obtain a contract are amortized over the expected period of benefit, which we have determined, based on analysis, to be \n5\n years. Amortization of capitalized costs are included in sales and marketing expense in our Consolidated Statements of Income. During fiscal 2024, 2023 and 2022, we amortized $\n272\n million, $\n254\n million and $\n238\n million of capitalized contract acquisition costs into sales and marketing expense, respectively. We did not incur any impairment losses for all periods presented.\nCapitalized contract acquisition costs were $\n717\n million and $\n656\n million as of November 29, 2024 and December 1, 2023, of which $\n464\n million and $\n422\n million was long-term and included in other assets in the Consolidated Balance Sheets, respectively. The remaining balance of the capitalized costs to obtain contracts was current and included in prepaid expenses and other current assets.\nRefund Liabilities \nWe record refund liabilities for amounts that may be subject to future refunds, which include sales returns reserves and customer rebates and credits. Refund liabilities are included in accrued expenses on the Consolidated Balance Sheets. Refund liabilities were $\n141\n million and $\n111\n million as of November 29, 2024 and December 1, 2023, respectively.\nSignificant Customers\nFor all periods presented, there were no customers that represented at least 10% of net revenue or that were responsible for over 10% of our trade receivables.\n \n68\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNOTE 3.  \nACQUISITIONS\nFigma\nOn September 15, 2022, we entered into a definitive merger agreement under which we intended to acquire Figma, Inc. (“Figma”) for approximately $\n20\n billion, comprised of approximately half cash and half stock.\nOn December 17, 2023, we entered into a mutual termination agreement with Figma to terminate the proposed merger. In accordance with the terms of the termination agreement, we paid Figma a termination fee of $\n1\n billion. The termination fee was recorded in operating expenses in our Consolidated Statements of Income during fiscal 2024, and was not tax-deductible for financial statement purposes.\nNOTE 4.  \nCASH, CASH EQUIVALENTS AND SHORT-TERM INVESTMENTS\nCash equivalents consist of highly liquid marketable securities with remaining maturities of three months or less at the date of purchase. We classify our investments in marketable debt securities as “available-for-sale.” We carry these investments at fair value, based on quoted market prices or other readily available market information. Unrealized gains and unrealized non-credit-related losses of marketable debt securities are included in accumulated other comprehensive income, net of taxes, in our Consolidated Balance Sheets. Unrealized credit-related losses are recorded to other income (expense), net in our Consolidated Statements of Income with a corresponding allowance for credit-related losses in our Consolidated Balance Sheets. Gains and losses are determined using the specific identification method and recognized when realized in our Consolidated Statements of Income.\nCash, cash equivalents and short-term investments consisted of the following as of November 29, 2024:\n(in millions)\nAmortized\nCost\nUnrealized\nGains\nUnrealized\nLosses\nEstimated\nFair Value\nCurrent assets:\n \n \n \n \nCash\n$\n787\n \n$\n—\n \n$\n—\n \n$\n787\n \nCash equivalents:\nCorporate debt securities\n41\n \n—\n \n—\n \n41\n \nMoney market funds\n6,726\n \n—\n \n—\n \n6,726\n \nTime deposits\n57\n \n—\n \n—\n \n57\n \nU.S. Treasury securities\n2\n \n—\n \n—\n \n2\n \nTotal cash equivalents\n6,826\n \n—\n \n—\n \n6,826\n \nTotal cash and cash equivalents\n7,613\n \n—\n \n—\n \n7,613\n \nShort-term fixed income securities:\nAsset-backed securities\n4\n \n—\n \n—\n \n4\n \nCorporate debt securities\n120\n \n—\n \n—\n \n120\n \nU.S. agency securities\n11\n \n—\n \n—\n \n11\n \nU.S. Treasury securities\n139\n \n—\n \n(\n1\n)\n138\n \nTotal short-term investments\n274\n \n—\n \n(\n1\n)\n273\n \nTotal cash, cash equivalents and short-term investments\n$\n7,887\n \n$\n—\n \n$\n(\n1\n)\n$\n7,886\n \n69\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nCash, cash equivalents and short-term investments consisted of the following as of December 1, 2023:\n(in millions)\nAmortized\nCost\nUnrealized\nGains\nUnrealized\nLosses\nEstimated\nFair Value\nCurrent assets:\n \n \n \n \nCash\n$\n618\n \n$\n—\n \n$\n—\n \n$\n618\n \nCash equivalents:\n \n \nMoney market funds\n6,498\n \n—\n \n—\n \n6,498\n \nTime deposits\n25\n \n—\n \n—\n \n25\n \nTotal cash equivalents\n6,523\n \n—\n \n—\n \n6,523\n \nTotal cash and cash equivalents\n7,141\n \n—\n \n—\n \n7,141\n \nShort-term fixed income securities:\n \nAsset-backed securities\n15\n \n—\n \n—\n \n15\n \nCorporate debt securities\n438\n \n—\n \n(\n4\n)\n434\n \nU.S. agency securities\n13\n \n—\n \n(\n1\n)\n12\n \nU.S. Treasury securities\n247\n \n—\n \n(\n7\n)\n240\n \nTotal short-term investments\n713\n \n—\n \n(\n12\n)\n701\n \nTotal cash, cash equivalents and short-term investments\n$\n7,854\n \n$\n—\n \n$\n(\n12\n)\n$\n7,842\n \nSee Note 5 for further information regarding the fair value of our financial instruments.\nThe following table summarizes the estimated fair value of short-term fixed income debt securities classified as short-term investments based on stated effective maturities as of November 29, 2024:\n(in millions)\nEstimated\nFair Value\nDue within one year\n$\n269\n \nDue between one and two years\n4\n \nTotal\n$\n273\n \nWe review our debt securities classified as short-term investments on a regular basis for impairment. For debt securities in unrealized loss positions, we determine whether any portion of the decline in fair value below the amortized cost basis is due to credit-related factors if we neither intend to sell nor anticipate that it is more likely than not that we will be required to sell prior to recovery of the amortized cost basis. We consider factors such as the extent to which the market value has been less than the cost, any noted failure of the issuer to make scheduled payments, changes to the rating of the security and other relevant credit-related factors in determining whether or not a credit loss exists. During fiscal 2024 and 2023, we did not recognize an allowance for credit-related losses on any of our investments.\n \n70\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNOTE 5.  \nFAIR VALUE MEASUREMENTS\nAssets and Liabilities Measured and Recorded at Fair Value on a Recurring Basis\n \nThe fair value of our financial assets and liabilities at November 29, 2024 was determined using the following inputs:\n(in millions)\nFair Value Measurements at Reporting Date Using\n \n \nQuoted Prices\nin Active\nMarkets for\nIdentical Assets\nSignificant\nOther\nObservable\nInputs\nSignificant\nUnobservable\nInputs\n \nTotal\n(Level 1)\n(Level 2)\n(Level 3)\nAssets:\n \n \n \n \nCash equivalents:\n \n \n \n \nCorporate debt securities\n$\n41\n \n$\n—\n \n$\n41\n \n$\n—\n \nMoney market funds\n6,726\n \n6,726\n \n—\n \n—\n \nTime deposits\n57\n \n57\n \n—\n \n—\n \nU.S. Treasury securities\n2\n \n—\n \n2\n \n—\n \nShort-term investments:\nAsset-backed securities\n4\n \n—\n \n4\n \n—\n \nCorporate debt securities\n120\n \n—\n \n120\n \n—\n \nU.S. agency securities\n11\n \n—\n \n11\n \n—\n \nU.S. Treasury securities\n138\n \n—\n \n138\n \n—\n \nPrepaid expenses and other current assets:\n \n \n \nForeign currency derivatives\n105\n \n—\n \n105\n \n—\n \nOther assets:\n \n \n \nDeferred compensation plan assets\n283\n \n283\n \n—\n \n—\n \nForeign currency derivatives\n24\n \n—\n \n24\n \n—\n \nTotal assets\n$\n7,511\n \n$\n7,066\n \n$\n445\n \n$\n—\n \nLiabilities:\n \n \n \n \nAccrued expenses:\n \n \n \n \nForeign currency derivatives\n$\n9\n \n$\n—\n \n$\n9\n \n$\n—\n \nOther liabilities:\nForeign currency derivatives\n2\n \n—\n \n2\n \n—\n \nTotal liabilities\n$\n11\n \n$\n—\n \n$\n11\n \n$\n—\n \n71\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe fair value of our financial assets and liabilities at December 1, 2023 was determined using the following inputs:\n(in millions)\nFair Value Measurements at Reporting Date Using\n \n \nQuoted Prices\nin Active\nMarkets for\nIdentical Assets\nSignificant\nOther\nObservable\nInputs\nSignificant\nUnobservable\nInputs\n \nTotal\n(Level 1)\n(Level 2)\n(Level 3)\nAssets:\n \n \n \n \nCash equivalents:\n \n \n \n \nMoney market funds\n$\n6,498\n \n$\n6,498\n \n$\n—\n \n$\n—\n \nTime deposits\n25\n \n25\n \n—\n \n—\n \nShort-term investments:\n \nAsset-backed securities\n15\n \n—\n \n15\n \n—\n \nCorporate debt securities\n434\n \n—\n \n434\n \n—\n \nU.S. agency securities\n12\n \n—\n \n12\n \n—\n \nU.S. Treasury securities \n240\n \n—\n \n240\n \n—\n \nPrepaid expenses and other current assets:\n \n \n \n \nForeign currency derivatives\n52\n \n—\n \n52\n \n—\n \nOther assets:\n \n \n \n \nDeferred compensation plan assets\n206\n \n206\n \n—\n \n—\n \nTotal assets\n$\n7,482\n \n$\n6,729\n \n$\n753\n \n$\n—\n \nLiabilities:\n \n \n \n \nAccrued expenses:\n \n \n \n \nForeign currency derivatives\n$\n4\n \n$\n—\n \n$\n4\n \n$\n—\n \nSee Note 4 for further information regarding the fair value of our financial instruments. \nOur fixed income available-for-sale debt securities consist of high quality, investment grade securities from diverse issuers with a weighted average credit rating of AA. We value these securities based on pricing from independent pricing vendors who use matrix pricing valuation techniques including market approach methodologies that model information generated by market transactions involving identical or comparable assets, as well as discounted cash flow methodologies. Inputs include quoted prices in active markets for identical assets or inputs other than quoted prices that are observable either directly or indirectly in determining fair value, including benchmark yields, issuer spreads off benchmark yields, interest rates and U.S. Treasury or swap curves. We therefore categorize all of our fixed income available-for-sale securities as Level 2. We perform routine procedures such as comparing prices obtained from multiple independent sources to ensure that appropriate fair values are recorded. \nThe fair values of our money market funds, time deposits and deferred compensation plan assets, which consist of money market and other mutual funds, are based on quoted prices in active markets at the measurement date.\nOur over-the-counter foreign currency derivatives are valued using pricing models and discounted cash flow methodologies based on observable foreign exchange and interest rate data at the measurement date. \nOur other current financial assets and current financial liabilities have fair values that approximate their carrying values.\nAssets and Liabilities Measured at Fair Value on a Nonrecurring Basis\nThe fair value of our senior notes was $\n5.51\n billion as of November 29, 2024, based on observable market prices in less active markets and categorized as Level 2. \nSee Note 17 for further details regarding our debt.\n72\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNOTE 6.  \nDERIVATIVE FINANCIAL INSTRUMENTS\nWe may use derivatives to partially offset our business exposure to foreign currency and interest rate risk on expected future cash flows and certain existing assets and liabilities. We do not use any of our derivative instruments for trading purposes.\nWe enter into master netting arrangements to mitigate credit risk in derivative transactions by permitting net settlement of transactions with the same counterparty. We do not offset fair value amounts recognized for derivative instruments under master netting arrangements. We also enter into collateral security agreements with certain of our counterparties to exchange cash collateral when the net fair value of certain derivative instruments fluctuates from contractually established thresholds. Collateral posted is included in prepaid expenses and other current assets and collateral received is included in accrued expenses on our Consolidated Balance Sheets.\nCash Flow Hedges\nIn countries outside the United States, we transact business in U.S. Dollars and in various other currencies. We may use foreign exchange forward contracts and option contracts to hedge a portion of our forecasted foreign currency denominated revenue and expenses. These foreign exchange contracts, carried at fair value, have maturities of up to \n24\n months. As of November 29, 2024 and December 1, 2023, total notional amounts of outstanding cash flow hedges were $\n5.51\n billion and $\n2.83\n billion, respectively, hedging exposures denominated in Euros, Japanese Yen, British Pounds, Indian Rupees, Australian Dollars and Canadian Dollars.\nIn June 2019, we entered into Treasury lock agreements with large financial institutions which fixed benchmark U.S. Treasury rates for an aggregate notional amount of $\n1\n billion of our future debt issuance. These derivative instruments hedged the impact of changes in the benchmark interest rate to future interest payments and were settled upon debt issuance in the first quarter of fiscal 2020. We incurred a loss related to the settlement of the instruments which is amortized to interest expense over the term of our debt due February 1, 2030. \nSee Note 17 for further details regarding our debt.\nAs of November 29, 2024, we had net derivative gains on our foreign currency cash flow hedges expected to be recognized within the next \n36\n months, of which $\n64\n million of net gains are expected to be recognized into revenue within the next 12 months and $\n1\n million of net losses are expected to be recognized into operating expenses within the next 12 months. We also had net derivative losses on our Treasury lock agreements, of which $\n3\n million is expected to be recognized into interest expense within the next 12 months.\nTo receive hedge accounting treatment, all hedging relationships are formally documented at the inception of the hedge, and the hedges must be highly effective in offsetting changes to future cash flows on hedged transactions. We record changes in fair value of these cash flow hedges in accumulated other comprehensive income (loss) in our Consolidated Balance Sheets, until the forecasted transaction occurs. When the forecasted transaction affects earnings, we reclassify the related gain or loss on the foreign currency revenue, foreign currency expense or Treasury lock cash flow hedge to revenue, operating expense or interest expense, as applicable. In the event the underlying forecasted transaction does not occur, or it becomes probable that it will not occur, we reclassify the gain or loss on the related cash flow hedge from accumulated other comprehensive income (loss) to the same income statement line item as the hedged item. We evaluate hedge effectiveness at the inception of the hedge prospectively, and on an ongoing basis both retrospectively and prospectively. If we do not elect hedge accounting, or the contract does not qualify for hedge accounting treatment, the changes in fair value from period to period are recorded in the same income statement line item as the hedged item.\nFor fiscal 2024, 2023 and 2022, there were no net gains or losses recognized in income relating to hedges of forecasted transactions that did not occur. \nNon-Designated Hedges\nOur derivatives not designated as hedging instruments consist of foreign currency forward contracts that we primarily use to hedge monetary assets and liabilities denominated in non-functional currencies. The changes in fair value of these contracts are recorded to other income (expense), net in our Consolidated Statements of Income. Changes in the fair value of the underlying assets and liabilities associated with the hedged risk are generally offset by the changes in the fair value of the related contracts.\n73\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nAs of November 29, 2024, total notional amounts of outstanding foreign currency forward contracts hedging monetary assets and liabilities were $\n381\n million, primarily hedging exposures denominated in Indian Rupees, Australian Dollars, British Pounds and Euros. As of December 1, 2023, total notional amounts of outstanding contracts were $\n998\n million, primarily hedging exposures denominated in Euros, Indian Rupees, British Pounds and Australian Dollars. At November 29, 2024 and December 1, 2023, the outstanding balance sheet hedging derivatives had maturities of \n180\n days or less.\nFair value asset derivatives are included in prepaid expenses and other current assets for the current portion and other assets for the long-term portion, and fair value liability derivatives are included in accrued expenses for the current portion and other liabilities for the long-term portion on our Consolidated Balance Sheets. The fair value of derivative instruments as of November 29, 2024 and December 1, 2023 were as follows:\n(in millions)\n2024\n2023\n \nFair Value \nAsset\nDerivatives\nFair Value\nLiability\nDerivatives\nFair Value \nAsset\nDerivatives\nFair Value\nLiability\nDerivatives\nDerivatives designated as hedging instruments:\n \n \n \n \nForeign exchange contracts\n$\n128\n \n$\n10\n \n$\n43\n \n$\n—\n \nDerivatives not designated as hedging instruments:\n Foreign exchange contracts\n1\n \n1\n \n9\n \n4\n \nTotal derivatives\n$\n129\n \n$\n11\n \n$\n52\n \n$\n4\n \nGains (losses) on derivative instruments, net of tax, recognized in our Consolidated Statements of Comprehensive Income for fiscal 2024, 2023 and 2022 were as follows:\n(in millions)\n2024\n2023\n2022\nDerivatives in cash flow hedging relationships:\nForeign exchange contracts\n$\n89\n \n$\n(\n12\n)\n$\n139\n \nThe effects of derivative instruments on our Consolidated Statements of Income for fiscal 2024, 2023 and 2022 were as follows:\n(in millions)\nFinancial Statement Classification\n2024\n2023\n2022\nDerivatives in cash flow hedging relationships:\nForeign exchange contracts\n \nNet gain (loss) reclassified from accumulated OCI into income\nRevenue\n$\n(\n20\n)\n$\n41\n \n$\n176\n \nNet gain (loss) reclassified from accumulated OCI into income\nOperating expenses\n$\n4\n \n$\n(\n2\n)\n$\n—\n \nTreasury lock\nNet gain (loss) reclassified from accumulated OCI into income\nInterest expense\n$\n(\n5\n)\n$\n(\n5\n)\n$\n(\n4\n)\nDerivatives not designated as hedging relationships:\nForeign exchange contracts\nOther income (expense), net\n$\n3\n \n$\n12\n \n$\n(\n29\n)\n74\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNOTE 7.  \nPROPERTY AND EQUIPMENT\nProperty and equipment, net, consisted of the following as of November 29, 2024 and December 1, 2023:\n(in millions)\n2024\n2023\nComputers and other equipment\n$\n1,405\n \n$\n1,490\n \nBuildings\n1,067\n \n1,069\n \nBuilding improvements\n561\n \n591\n \nLeasehold improvements\n222\n \n275\n \nFurniture and fixtures\n146\n \n171\n \nLand\n163\n \n163\n \nCapital projects in-progress\n27\n \n2\n \nTotal\n3,591\n \n3,761\n \nLess: Accumulated depreciation and amortization\n(\n1,655\n)\n(\n1,731\n)\nProperty and equipment, net\n$\n1,936\n \n$\n2,030\n \nDepreciation and amortization expense of property and equipment for fiscal 2024, 2023 and 2022 was $\n239\n million, $\n235\n million and $\n189\n million, respectively.\nProperty and equipment, net, by geographic area as of November 29, 2024 and December 1, 2023 was as follows:\n(in millions)\n2024\n2023\nAmericas:\n \n \nUnited States\n$\n1,651\n \n$\n1,740\n \nOther\n1\n \n1\n \nTotal Americas\n1,652\n \n1,741\n \nEMEA\n86\n \n87\n \nAPAC\n198\n \n202\n \nProperty and equipment, net\n$\n1,936\n \n$\n2,030\n \nNOTE 8.  \nGOODWILL AND OTHER INTANGIBLES\n \nGoodwill by reportable segment and activity was as follows:\n(in millions)\nDigital \nMedia\nDigital \nExperience\nPublishing and \nAdvertising\nTotal Goodwill\nBalances at December 2, 2022\n$\n3,889\n \n$\n8,500\n \n$\n398\n \n$\n12,787\n \nForeign currency translation\n1\n \n17\n \n—\n \n18\n \nBalances at December 1, 2023\n$\n3,890\n \n$\n8,517\n \n$\n398\n \n$\n12,805\n \nForeign currency translation\n(\n1\n)\n(\n16\n)\n—\n \n(\n17\n)\nBalances at November 29, 2024\n$\n3,889\n \n$\n8,501\n \n$\n398\n \n$\n12,788\n \nDuring the second quarter of fiscal 2024, we completed our annual goodwill impairment test associated with our reporting units and, based on the qualitative assessment, determined there was no impairment of goodwill. We did not identify any events or changes in circumstances since the performance of our annual goodwill impairment test that would require us to perform another goodwill impairment test during the fiscal year.\n75\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nOther intangibles, net, as of November 29, 2024 and December 1, 2023 were as follows: \n(dollars in millions)\n2024\n2023\n \nGross Carrying Amount\nAccumulated Amortization\nNet\nWeighted Average\nUseful Life (years)\nGross Carrying Amount\nAccumulated Amortization\nNet\nCustomer contracts and relationships\n$\n1,203\n \n$\n(\n742\n)\n$\n461\n \n10\n$\n1,204\n \n$\n(\n619\n)\n$\n585\n \nPurchased technology\n877\n \n(\n704\n)\n173\n \n6\n984\n \n(\n647\n)\n337\n \nTrademarks\n372\n \n(\n258\n)\n114\n \n9\n376\n \n(\n217\n)\n159\n \nOther\n42\n \n(\n8\n)\n34\n \n6\n22\n \n(\n15\n)\n7\n \nOther intangibles, net\n$\n2,494\n \n$\n(\n1,712\n)\n$\n782\n \n$\n2,586\n \n$\n(\n1,498\n)\n$\n1,088\n \nAmortization expense related to other intangibles was $\n336\n million, $\n375\n million and $\n405\n million for fiscal 2024, 2023 and 2022 respectively. Of these amounts, $\n167\n million, $\n207\n million and $\n236\n million was included in cost of sales for fiscal 2024, 2023 and 2022 respectively. We did not recognize any intangible asset impairment charges for all periods presented.\nOther intangibles are amortized over their estimated useful lives of \n3\n to \n14\n years. \nAs of November 29, 2024, the estimated aggregate amortization expense for each of the five succeeding fiscal years was as follows:\n(in millions)\nFiscal Year\nOther Intangibles\n2025\n$\n309\n \n2026\n158\n \n2027\n116\n \n2028\n71\n \n2029\n67\n \nThereafter\n61\n \nTotal expected amortization expense\n$\n782\n \nNOTE 9.  \nACCRUED EXPENSES\nAccrued expenses as of November 29, 2024 and December 1, 2023 consisted of the following:\n(in millions)\n2024\n2023\nAccrued compensation and benefits\n$\n646\n \n$\n535\n \nAccrued bonuses\n575\n \n547\n \nAccrued corporate marketing\n176\n \n132\n \nDerivative collateral liabilities\n168\n \n50\n \nRefund liabilities\n141\n \n111\n \nSales and use taxes\n121\n \n122\n \nOther\n509\n \n445\n \nAccrued expenses\n$\n2,336\n \n$\n1,942\n \nOther primarily includes general business accruals, accrued hosting fees and royalties payable.\n76\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNOTE 10.  \nINCOME TAXES\nIncome before income taxes for fiscal 2024, 2023 and 2022 consisted of the following:\n(in millions)\n2024\n2023\n2022\nDomestic\n$\n4,160\n \n$\n3,465\n \n$\n1,958\n \nForeign\n2,771\n \n3,334\n \n4,050\n \nIncome before income taxes\n$\n6,931\n \n$\n6,799\n \n$\n6,008\n \nThe provision for income taxes for fiscal 2024, 2023 and 2022 consisted of the following:\n(in millions)\n2024\n2023\n2022\nCurrent:\n \n \n \nUnited States federal\n$\n1,292\n \n$\n1,198\n \n$\n465\n \nForeign\n315\n \n335\n \n329\n \nState and local\n232\n \n260\n \n132\n \nTotal current\n1,839\n \n1,793\n \n926\n \nDeferred:\n \n \n \nUnited States federal\n(\n580\n)\n(\n556\n)\n(\n45\n)\nForeign\n179\n \n227\n \n360\n \nState and local\n(\n67\n)\n(\n93\n)\n11\n \nTotal deferred\n(\n468\n)\n(\n422\n)\n326\n \nProvision for income taxes\n$\n1,371\n \n$\n1,371\n \n$\n1,252\n \nReconciliation of Provision for Income Taxes \nTotal income tax expense differed from the income tax expense computed at the U.S. federal statutory rate of \n21\n% as a result of the following:\n(in millions)\n2024\n2023\n2022\nTax expense computed at U.S. federal statutory rate\n$\n1,456\n \n$\n1,428\n \n$\n1,262\n \nEffects of non-U.S. operations\n(\n198\n)\n(\n116\n)\n(\n7\n)\nTax credits\n(\n150\n)\n(\n130\n)\n(\n116\n)\nTax settlements\n(\n85\n)\n(\n14\n)\n(\n14\n)\nStock-based compensation\n(\n23\n)\n29\n \n—\n \nAcquisition termination fee\n210\n \n—\n \n—\n \nState tax expense, net of federal benefit\n139\n \n132\n \n113\n \nOther\n22\n \n42\n \n14\n \nProvision for income taxes\n$\n1,371\n \n$\n1,371\n \n$\n1,252\n \n77\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nDeferred Tax Assets and Liabilities\nThe tax effects of the temporary differences that gave rise to significant portions of the deferred tax assets and liabilities as of November 29, 2024 and December 1, 2023 were as follows:\n(in millions)\n2024\n2023\nDeferred tax assets:\n \n \nCapitalized expenses\n$\n1,625\n \n$\n984\n \nCredit carryforwards\n343\n \n366\n \nNet operating loss and capital loss carryforwards\n308\n \n44\n \nIntangible assets\n117\n \n320\n \nReserves and accruals\n129\n \n125\n \nOperating lease liabilities\n79\n \n97\n \nStock-based compensation\n66\n \n65\n \nBenefits relating to tax positions\n64\n \n68\n \nOther\n34\n \n48\n \nTotal gross deferred tax assets\n2,765\n \n2,117\n \nValuation allowance\n(\n725\n)\n(\n405\n)\nTotal deferred tax assets\n2,040\n \n1,712\n \nDeferred tax liabilities:\nAcquired intangible assets\n180\n \n263\n \nPrepaid expenses\n112\n \n107\n \nDepreciation and amortization\n70\n \n77\n \nOperating lease right-of-use assets\n52\n \n89\n \nTotal deferred tax liabilities\n414\n \n536\n \nNet deferred tax assets\n$\n1,626\n \n$\n1,176\n \nDeferred tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax bases of assets and liabilities, and for tax loss and credit carryforwards.\nAs of November 29, 2024, we had federal and state tax credit carryforwards of approximately $\n93\n million and $\n308\n million, respectively, as well as state net operating loss carryforwards of approximately $\n408\n million. We also had federal and state capital loss carryforwards of $\n1.15\n billion mainly from the Figma acquisition termination fee which was not deductible for financial statement purposes. The majority of the state tax credits can be carried forward indefinitely, and the remaining federal and state tax loss and credit carryforwards will expire in various years from fiscal 2025 through 2040. Certain tax loss and credit carryforwards are subject to an annual limitation and/or are reduced by a valuation allowance. The net carrying amount of such assets is expected to be fully realized.\nIn assessing the realizability of deferred tax assets, management determined that it is more likely than not that we will not fully realize certain available tax assets in domestic and foreign jurisdictions. Deferred tax assets are offset by a valuation allowance to the extent it is more likely than not that they are not expected to be realized. As of November 29, 2024, we continue to maintain a valuation allowance of $\n725\n million primarily related to certain state credits and federal capital loss carryforwards. For fiscal 2024, the increase in the valuation allowance was $\n321\n million, mainly related to the capital loss generated from the Figma acquisition termination fee.\nAs we repatriate foreign earnings for use in the United States, the distributions will generally be exempt from federal income taxes. As of November 29, 2024, the cumulative amount of foreign earnings considered permanently reinvested upon which taxes have not been provided, and the corresponding unrecognized deferred tax liability, was not material.\n78\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nAccounting for Uncertainty in Income Taxes\nDuring fiscal 2024 and 2023, the aggregate changes in our total gross amount of unrecognized tax benefits were as follows:\n(in millions)\n2024\n2023\nBeginning balance\n$\n501\n \n$\n321\n \nGross increases in unrecognized tax benefits – prior year tax positions\n6\n \n103\n \nGross decreases in unrecognized tax benefits – prior year tax positions\n(\n10\n)\n(\n9\n)\nGross increases in unrecognized tax benefits – current year tax positions\n269\n \n108\n \nLapse of statute of limitations\n(\n63\n)\n(\n14\n)\nTax settlements\n(\n20\n)\n(\n13\n)\nForeign exchange gains and losses\n—\n \n5\n \nEnding balance\n$\n683\n \n$\n501\n \nOur policy is to record interest and penalties related to uncertain tax positions within the provision for income taxes. As of November 29, 2024 and December 1, 2023, the combined amounts of accrued interest and penalties included in long-term income taxes payable related to tax positions taken on our tax returns were not material.\nWhile we file federal, state and local income tax returns globally, our major tax jurisdictions are Ireland, California and the United States. We are subject to the examination of our income tax returns by various domestic and foreign tax authorities with 2020 being the earliest fiscal year open for examination in all of our major tax jurisdictions. We regularly assess the likelihood of outcomes resulting from examinations to determine the adequacy of our provision for income taxes and have reserved for potential adjustments that may result. While we believe our tax estimates are reasonable, we cannot provide assurance that the final determination of any of these examinations will not have an adverse effect on our financial position and results of operations.\nThe timing of the resolution of income tax examinations is highly uncertain as are the amounts and timing of tax payments that are part of any audit settlement process. These events could cause large fluctuations in the balance sheet classification of our tax assets and liabilities. We believe that within the next 12 months, it is reasonably possible that either certain audits will conclude or statutes of limitations on certain income tax examination periods will expire, or both. Although the timing of resolution, settlement and closing of audits is not certain, it is reasonably possible that the underlying unrecognized tax benefits may decrease by up to $\n50\n million over the next 12 months.\nNOTE 11.  \nBENEFIT PLANS\nRetirement Savings Plan\nThe Adobe Inc. 401(k) Retirement Savings Plan, qualified under Section 401(k) of the Internal Revenue Code, is a retirement savings plan covering substantially all of our U.S. employees. Under the plan, eligible employees may contribute up to \n65\n% of their pretax or after-tax salary, subject to the IRS annual contribution limits. In fiscal 2024, we matched \n50\n% of the first \n6\n% of the employee’s eligible compensation. We contributed $\n91\n million, $\n85\n million and $\n76\n million in fiscal 2024, 2023 and 2022, respectively. We are under no obligation to continue matching future employee contributions and, at our discretion, may change our practices at any time.\nDeferred Compensation Plan\nThe Adobe Inc. Deferred Compensation Plan is an unfunded, non-qualified, deferred compensation arrangement under which certain executives are able to defer a portion of their annual compensation. Participants may elect to contribute up to \n75\n% of their base salary and \n100\n% of other specified compensation, including commissions and bonuses. Members of the Board of Directors are also eligible to participate and are able to defer their directors’ fees and elect cash benefit distributions in the same manner as executives. Additionally, members of the Board are permitted to defer equity awards. Participants are able to elect the payment of benefits to begin on a specified date at least three years after the end of the plan year in which election is made or, with respect to equity awards, vests. For cash benefit elections, distributions are made in cash in the form of a lump sum, or \n79\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nfive, ten, or fifteen-year annual installments. For equity award elections, distributions are made in stock in the form of a lump sum payment only.\nCertain deferred compensation is invested in money market and other mutual funds and subsequently recorded as other assets on our Consolidated Balance Sheets, with corresponding unrealized holding gains and losses recorded as investment gains (losses) in our Consolidated Statements of Income. Undistributed deferred compensation is recorded as other liabilities on our Consolidated Balance Sheets.\nAs of November 29, 2024 and December 1, 2023, the invested amounts under the plan totaled $\n283\n million and $\n206\n million, respectively. As of November 29, 2024 and December 1, 2023, undistributed deferred compensation due to participants totaled $\n297\n million and $\n222\n million, respectively.\nNOTE 12.  \nSTOCK-BASED COMPENSATION\nOur stock-based compensation programs are long-term retention programs that are intended to attract, retain and provide incentives for employees, officers and directors, and to align stockholder and employee interests. We have the following stock-based compensation plans and programs:\nRestricted Stock Units and Performance Share Programs\nWe grant restricted stock units and performance share awards to eligible employees under our 2019 Equity Incentive Plan (“2019 Plan”). Restricted stock units generally vest over \nfour years\n. Certain grants have other vesting periods approved by the Executive Compensation Committee of our Board of Directors (the “ECC”).\nAs of November 29, 2024, we had reserved \n69.0\n million shares of our common stock for issuance under our 2019 Plan and had \n34.3\n million shares available for grant.\nOur Performance Share Programs aim to help focus key employees on building stockholder value, provide significant award potential for achieving outstanding company performance and enhance our ability to attract and retain highly talented and competent individuals. The ECC approves the terms of each of our Performance Share Programs, including the award calculation methodology. In January 2024, the ECC approved the 2024 Performance Share Program.\nShares outstanding under our 2024, 2023 and 2022 Performance Share Programs may be earned based on the achievement of (i) an objective relative total stockholder return measured over a \nthree-year\n performance period, as well as (ii) revenue-based financial metrics measured over \nthree\n \none-year\n performance periods. Each type of performance goal is weighted \n50\n% and achievement of each performance goal is determined independently of the other. Shares associated with each performance goal are not awarded until the corresponding performance targets are defined. \nPerformance share awards in each of our 2024, 2023 and 2022 Performance Share Programs will cliff-vest upon the later of (i) the \nthree\n-year anniversary of the earliest vesting commencement date in the respective Performance Share Program, or (ii) the ECC's certification of the level of achievement of the final performance period in the respective Performance Share Program, contingent upon the participant’s continued service. Participants can earn between \n0\n% and \n200\n% of the target number of performance shares.\nAs of November 29, 2024, the shares awarded under our 2024, 2023 and 2022 Performance Share Programs remained outstanding and unvested.\nEmployee Stock Purchase Plan\nOur Employee Stock Purchase Plan (“ESPP”) allows eligible employee participants to purchase shares of our common stock at a discount through payroll deductions. The ESPP consists of \ntwenty-four\n-month offering periods with \nfour\n \nsix\n-month purchase periods in each offering period. Employees purchase shares in each purchase period at \n85\n% of the market value of our common stock at either the beginning of the offering period or the end of the purchase period, whichever price is lower. If the market value of our common stock at the end of a purchase period is lower than the market value at the beginning of the offering period, participants are rolled over into the subsequent offering, resulting in a reset of the offering price and the \ntwenty-four\n month offering period.\n80\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe ESPP will continue until the earlier of termination by the Board of Directors or the date on which all of the shares available for issuance under the plan have been issued.\nAs of November 29, 2024, we had reserved \n103.0\n million shares of our common stock for issuance under the ESPP and approximately \n8.4\n million shares remain available for future issuance.\nIssuance of Shares\nUpon vesting of restricted stock units and performance shares or purchase of shares under the ESPP, we will issue treasury stock. If treasury stock is not available, common stock will be issued. In order to minimize the impact of ongoing dilution from issuance of shares, we instituted a stock repurchase program. \nSee Note 14 for information regarding our stock repurchase programs.\nValuation of Stock-Based Compensation\nStock-based compensation cost is measured at the grant date based on the fair value of the award. \nOur restricted stock units are valued based on the fair market value of the award on the grant date. Our performance share awards which are contingent upon achievement of relative total stockholder return are valued using a Monte Carlo Simulation model. Our performance share awards which are contingent upon achievement of revenue-based financial metrics are valued based on the fair market value of the award on the grant date.\n We use the Black-Scholes option pricing model to determine the fair value of ESPP purchase rights. The determination of the grant date fair value of our ESPP purchase rights is affected by our stock price as well as assumptions regarding a number of complex and subjective variables. These variables include our expected stock price volatility over the expected term of the awards, actual and projected employee stock option exercise behaviors, a risk-free interest rate and any expected dividends.\nSummary of Restricted Stock Units\nRestricted stock unit activity for fiscal 2024 was as follows:\nNumber of\nShares\n(in millions)\nWeighted Average\nGrant Date \nFair Value\nAggregate\nFair Value \n(1)\n(in millions)\nWeighted Average\nRemaining Contractual Life\n(years)\nBeginning outstanding balance\n7.8\n \n$\n418.63\n \nAwarded\n3.2\n \n$\n579.87\n \nReleased\n(\n3.5\n)\n$\n451.27\n \nForfeited\n(\n0.5\n)\n$\n451.39\n \nEnding outstanding balance\n7.0\n \n$\n473.28\n \n$\n3,591\n \n1.25\nExpected to vest\n6.5\n \n$\n472.01\n \n$\n3,331\n \n1.20\n_________________________________________\n(1)    \nThe aggregate fair value is calculated using the closing stock price as of November 29, 2024 of $\n515.93\n.\nThe weighted average grant date fair values of restricted stock units granted during fiscal 2024, 2023 and 2022 were $\n579.87\n, $\n376.83\n and $\n457.96\n, respectively. The total fair value of restricted stock units vested during fiscal 2024, 2023 and 2022 was $\n1.87\n billion, $\n1.71\n billion and $\n1.30\n billion, respectively.\n81\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nSummary of Performance Shares\n \nPerformance share activity for fiscal 2024 was as follows: \n \nNumber of\nShares\n(in millions)\nWeighted Average\nGrant Date \nFair Value\nAggregate\nFair Value \n(1)\n(in millions)\nWeighted Average\nRemaining Contractual Life\n(years)\nBeginning outstanding balance\n0.5\n \n$\n465.71\n \nAwarded\n0.2\n \n$\n645.40\n \nReleased\n(\n0.1\n)\n$\n455.65\n \nForfeited\n(\n0.1\n)\n$\n505.61\n \nEnding outstanding balance\n0.5\n \n$\n537.00\n \n$\n256\n \n1.11\nExpected to vest\n0.5\n \n$\n534.75\n \n$\n239\n \n1.18\n_________________________________________\n(1)    \nThe aggregate fair value is calculated using the closing stock price as of November 29, 2024 of $\n515.93\n.\nShares released during fiscal 2024 resulted from \n83\n% achievement of target for the 2021 Performance Share Program, as certified by the ECC in the first quarter of fiscal 2024.\nThe weighted average grant date fair values of performance share awards granted during fiscal 2024, 2023 and 2022 were $\n645.40\n, $\n437.58\n and $\n402.24\n, respectively. The total fair value of performance share awards vested during fiscal 2024, 2023 and 2022 was $\n63\n million, $\n39\n million and $\n192\n million, respectively.\nSummary of Employee Stock Purchase Plan Shares\nEmployees purchased \n1.2\n million shares at an average price of $\n298.53\n, \n1.1\n million shares at an average price of $\n286.31\n, and \n0.8\n million shares at an average price of $\n333.92\n for fiscal 2024, 2023 and 2022, respectively. The intrinsic value of shares purchased during fiscal 2024, 2023 and 2022 was $\n324\n million, $\n185\n million and $\n73\n million, respectively. The intrinsic value is calculated as the difference between the market value on the date of purchase and the purchase price of the shares.\nCompensation Costs\nWe recognize the estimated compensation costs of restricted stock units, net of estimated forfeitures, on a straight-line basis over the requisite service period of the entire award, which is generally the vesting period. The estimated compensation cost is based on the fair value of our common stock on the date of grant. \nCompensation costs for our performance share awards which are contingent upon achievement of relative total stockholder return are recognized, net of estimated forfeitures, on a straight-line basis over the requisite performance period or service period of the entire award, whichever is longer. Compensation costs for our performance share awards which are contingent upon achievement of revenue-based financial metrics are recognized, net of estimated forfeitures, based upon the expected levels of achievement, which are assessed periodically until certification by the ECC.\nWe estimate forfeitures at the time of grant and revise those estimates in subsequent periods if actual forfeitures differ from those estimates. We use historical data to estimate forfeitures and record stock-based compensation expense only for those awards that are expected to vest.\nAs of November 29, 2024, there was $\n2.93\n billion of unrecognized compensation cost, adjusted for estimated forfeitures, related to unvested stock-based awards and purchase rights which will be recognized over a weighted average period of \n2.19\n years. Total unrecognized compensation cost will be adjusted for future changes in estimated forfeitures. \n82\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nTotal stock-based compensation costs included in our Consolidated Statements of Income for fiscal 2024, 2023 and 2022 were as follows:\n(in millions)\n2024\n2023\n2022\nCost of revenue\n$\n117\n \n$\n115\n \n$\n97\n \nResearch and development\n932\n \n874\n \n726\n \nSales and marketing\n535\n \n495\n \n417\n \nGeneral and administrative\n249\n \n234\n \n200\n \nTotal \n(1)\n$\n1,833\n \n$\n1,718\n \n$\n1,440\n \n_________________________________________\n(1)\nDuring fiscal 2024, 2023 and 2022, we recorded tax benefits related to stock-based compensation costs of $\n372\n million, $\n299\n million and $\n291\n million, respectively.\nNOTE 13.  \nACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS)\nThe components of accumulated other comprehensive income (loss) and activity, net of related taxes, for fiscal 2024 were as follows:\n(in millions)\nDecember 1,\n2023\nIncrease / Decrease\nReclassification Adjustments\nNovember 29,\n2024\nNet unrealized gains / losses on available-for-sale securities\n$\n(\n12\n)\n$\n11\n \n$\n—\n \n(1)\n$\n(\n1\n)\nNet unrealized gains / losses on derivative instruments designated as hedging instruments\n(\n26\n)\n89\n \n17\n \n(2)\n80\n \nCumulative foreign currency translation adjustments\n(\n247\n)\n(\n33\n)\n—\n \n(\n280\n)\nTotal accumulated other comprehensive income (loss), net of taxes\n$\n(\n285\n)\n$\n67\n \n$\n17\n \n$\n(\n201\n)\n_________________________________________\n(1)    \nReclassification adjustments for gains / losses on available-for-sale securities are classified in other income (expense), net. \n(2)\nReclassification adjustments for gains / losses on foreign currency hedges are classified in revenue or operating expenses, depending on the nature of the underlying transaction, and reclassification adjustments for gains / losses on Treasury lock hedges are classified in interest expense.\n \nTaxes related to each component of other comprehensive income (loss) were immaterial for the fiscal years presented.\nNOTE 14.  \nSTOCK REPURCHASE PROGRAM\nTo facilitate our stock repurchase program, designed to return value to our stockholders and minimize dilution from stock issuances, we may repurchase our shares in the open market or enter into structured repurchase agreements with third parties. In December 2020, our Board of Directors granted authority to repurchase up to $\n15\n billion in our common stock, which became fully utilized during fiscal 2024. In March 2024, our Board of Directors granted additional authority to repurchase up to $25 billion in our common stock through March 14, 2028.\nDuring fiscal 2024, 2023 and 2022, we entered into accelerated share repurchase agreements (“ASRs”) with large financial institutions whereupon we provided them with prepayments totaling $\n9.5\n billion, $\n1.4\n billion and $\n2.4\n billion, respectively. Under the terms of our ASRs, the financial institutions agree to deliver a portion of shares to us at contract inception and the remaining shares at settlement. The total number of shares delivered and average purchase price paid per share are determined upon settlement based on the Volume Weighted Average Price (“VWAP”) over the term of the ASR, less an agreed upon discount.\n83\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nDuring fiscal 2023 and 2022, we also entered into structured stock repurchase agreements with large financial institutions whereupon we provided them with prepayments totaling $\n3\n billion and $\n4.15\n billion, respectively. Under the terms of these structured stock repurchase agreements, the financial institutions agree to deliver shares to us at monthly intervals during the respective contract terms, and the number of shares delivered each month are determined based on the total notional amount of the contracts, the number of trading days in the intervals and the VWAP during the intervals, less an agreed upon discount.\nShare repurchase activities for fiscal 2024, 2023 and 2022 were as follows:\nNumber of Shares Delivered\n(in millions)\nAverage Price Paid Per Share\nFiscal 2024\nStructured stock repurchase agreement entered into in fiscal 2023\n0.6\n \n$\n626.68\n \nASR entered into in December 2023\n3.5\n \n$\n578.11\n \nASR entered into in March 2024\n5.2\n \n$\n475.94\n \nASR entered into in June 2024\n4.6\n \n$\n546.30\n \nASR entered into in September 2024\n3.6\n \n$\n—\n \n(1)\nTotal shares delivered\n17.5\n \nFiscal 2023\nStructured stock repurchase agreements entered into in fiscal 2023 and 2022\n7.5\n \n$\n429.65\n \nASR entered into in December 2022\n4.0\n \n$\n348.46\n \nTotal shares delivered\n11.5\n \nFiscal 2022\nStructured stock repurchase agreements entered into in fiscal 2022 and 2021\n10.4\n \n$\n375.03\n \nASR entered into in December 2021\n5.3\n \n$\n451.55\n \nTotal shares delivered\n15.7\n \n_________________________________________\n(1)    \nDuring fiscal 2024, we received the initial delivery of shares under the ASR entered into in September 2024, which remained outstanding as of November 29, 2024. Subsequent to November 29, 2024, the outstanding ASR was settled which resulted in total repurchases of \n5.0\n million shares at an average price of $\n501.37\n.\nPrepayments for stock repurchases are classified as treasury stock, a component of stockholders’ equity on our Consolidated Balance Sheets, at the payment date, though only shares physically delivered to us by the end of the respective period are excluded from the computation of net income per share. As of November 29, 2024, a portion of the $\n2.5\n billion prepayment under the ASR entered into in September 2024 was evaluated as an unsettled forward contract indexed to our own stock, classified within stockholders’ equity.\nSubsequent to November 29, 2024, as part of the March 2024 stock repurchase authority, we entered into stock repurchase arrangements with a large financial institution which totaled $\n3.25\n billion, including a $\n2.75\n billion ASR and a trading plan under which we may execute up to $\n500\n million in open market repurchases. Under the ASR, we received an initial delivery of \n4.5\n million shares, which represents approximately \n75\n% of our $\n2.75\n billion prepayment.\n84\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNOTE 15.  \nNET INCOME PER SHARE\nBasic net income per share is computed using the weighted average number of common shares outstanding for the period, excluding unvested stock-based awards and purchase rights. Diluted net income per share is based upon the weighted average common shares outstanding for the period plus dilutive potential common shares, including unvested restricted stock units, stock purchase rights and performance share awards using the treasury stock method. Performance share awards are included based on the number of shares that would be issued as if the end of the reporting period was the end of the performance period and the result was dilutive.\nThe following table sets forth the computation of basic and diluted net income per share for fiscal 2024, 2023 and 2022:\n(in millions, except per share data)\n2024\n2023\n2022\nNet income\n$\n5,560\n \n$\n5,428\n \n$\n4,756\n \nShares used to compute basic net income per share\n447.1\n \n457.1\n \n469.5\n \nDilutive potential common shares from stock plans and programs\n2.6\n \n2.0\n \n1.4\n \nShares used to compute diluted net income per share\n449.7\n \n459.1\n \n470.9\n \nBasic net income per share\n$\n12.43\n \n$\n11.87\n \n$\n10.13\n \nDiluted net income per share\n$\n12.36\n \n$\n11.82\n \n$\n10.10\n \nAnti-dilutive potential common shares\n1.9\n \n2.7\n \n4.2\n \nNOTE 16.  \nCOMMITMENTS AND CONTINGENCIES\nUnconditional Purchase Obligations\nOur principal commitments consist of purchase obligations resulting from agreements to purchase goods and services in the ordinary course of business. \nThe following table summarizes our non-cancellable unconditional purchase obligations for each of the next five years and thereafter as of November 29, 2024, primarily relating to contracts with vendors for third-party hosting and data center services:\n(in millions)\n \nFiscal Year\nPurchase Obligations\n2025\n$\n1,523\n \n2026\n1,227\n \n2027\n1,269\n \n2028\n1,345\n \n2029\n416\n \nThereafter\n9\n \nTotal\n$\n5,789\n \nRoyalties\nWe have royalty commitments associated with the licensing of certain offerings and products. Royalty expense is generally based on a dollar amount per unit or a percentage of the underlying revenue. Royalty expense, which was recorded in our cost of revenue on our Consolidated Statements of Income, was approximately $\n259\n million, $\n246\n million and $\n228\n million in fiscal 2024, 2023 and 2022, respectively.\n85\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nIndemnifications\nIn the ordinary course of business, we provide indemnifications of varying scope to our customers and channel partners against claims of intellectual property infringement made by third parties arising from the use of our products and from time to time, we are subject to claims by our customers under these indemnification provisions. Historically, costs related to these indemnification provisions have not been significant and we are unable to estimate the maximum potential impact of these indemnification provisions on our future results of operations.\nTo the extent permitted under Delaware law, we have agreements whereby we indemnify our officers and directors for certain events or occurrences while the officer or director is or was serving at our request in such capacity. The indemnification period covers all pertinent events and occurrences during the officer’s or director’s lifetime. The maximum potential amount of future payments we could be required to make under these indemnification agreements is unlimited; however, we have director and officer insurance coverage that reduces our exposure and enables us to recover a portion of any future amounts paid. We believe the estimated fair value of these indemnification agreements in excess of applicable insurance coverage is minimal.\nLegal Proceedings\nWe are subject to legal proceedings, claims, including claims relating to intellectual property, commercial, employment and other matters, and investigations, including government investigations, that arise in the ordinary course of our business. Some of these disputes, legal proceedings and investigations may include speculative claims for substantial or indeterminate amounts of damages. We consider all claims on a quarterly basis in accordance with GAAP and based on known facts assess whether potential losses are considered reasonably possible or probable and estimable. Based upon this assessment, we then evaluate disclosure requirements and whether to accrue for such claims in our financial statements. This determination is then reviewed and discussed with the Audit Committee of the Board of Directors.\nWe make a provision for a liability when it is both probable that a liability has been incurred and the amount of the loss can be reasonably estimated. These provisions are reviewed at least quarterly and adjusted to reflect the impacts of negotiations, settlements, rulings, advice of legal counsel and other information and events pertaining to a particular case. As of November 29, 2024, accrued provisions for legal proceedings were immaterial. Unless otherwise specifically disclosed in this note, we have determined that no disclosure is required related to any claim against us because: (a) there is not a reasonable possibility that a loss exceeding amounts already recognized (if any) may be incurred with respect to such claim; (b) a reasonably possible loss or range of loss cannot be estimated; or (c) such estimate is immaterial.\nAll legal costs associated with litigation are expensed as incurred. Litigation is inherently unpredictable. However, we believe that we have valid defenses with respect to the legal matters pending against us. It is possible, nevertheless, that our consolidated financial position, results of operations or cash flows could be negatively affected by an unfavorable resolution of one or more of such proceedings, claims or investigations.\nSince June 2022, we have been cooperating with the Federal Trade Commission (the “FTC”) staff in response to a Civil Investigative Demand seeking information regarding our disclosure and subscription cancellation practices relative to the Restore Online Shoppers’ Confidence Act (“ROSCA”). In November 2023, the FTC staff asserted that they had the authority to enter into consent negotiations to determine if a settlement regarding their investigation of these issues could be reached. On March 20, 2024, we were informed that the FTC had voted to authorize a filing of the case. The FTC then referred the case to the Department of Justice (the “DOJ”), and on June 17, 2024, the DOJ filed a civil complaint in the United States District Court for the Northern District of California, naming Adobe and certain of our employees as defendants. The complaint alleges that Adobe failed to clearly and conspicuously disclose material terms, failed to obtain express informed consent and failed to provide a simple cancellation mechanism regarding our disclosure and subscription cancellation practices in violation of ROSCA and the FTC Act. The DOJ is seeking injunctive relief, civil penalties, equitable monetary relief and other relief. On October 7, 2024, we filed a motion to dismiss the DOJ’s civil complaint, and that motion was fully briefed as of December 23, 2024. The defense or resolution of this matter could involve significant monetary costs or penalties and have a significant impact on our financial results and operations. There can be no assurance that we will be successful in negotiating a favorable settlement or in litigation. Any remedies or compliance requirements could adversely affect our ability to operate our business or have a materially adverse impact on our financial results. At this stage, we are unable to estimate a reasonably possible financial loss or range of any potential financial loss, if any, as a result of this litigation.\n86\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nOn October 20, 2023, a securities class action captioned Pembroke Pines Firefighters & Police Officers Pension Fund et al v. Adobe, Inc. et al, renamed as In Re Adobe Inc. Securities Litigation, Case No. 1:23-cv-09260, was filed in the U.S. District Court for the Southern District of New York (the “Securities Action”) naming Adobe and certain of our current and former officers as defendants. The Securities Action purports to be brought on behalf of purchasers of the Company’s stock between July 23, 2021 and September 22, 2022 (the “Class Period”). The complaint, which was amended on February 23, 2024, alleges that certain public statements made by Adobe during the Class Period related to competition from Figma and the adequacy of Adobe’s existing offerings to counter harms Adobe may have faced due to Figma’s growing market position were materially false and misleading. The Securities Action seeks unspecified compensatory damages, attorneys’ fees and costs, and extraordinary equitable and/or injunctive relief. We filed a motion to dismiss the Securities Action, which was fully briefed as of May 23, 2024.\nOn November 16, 2023, a shareholder derivative action captioned Shah v. Narayen et al, Case No. 1:23-cv-01315, was filed in the U.S. District Court for the District of Delaware (the “Shah Action”), purportedly on behalf of Adobe. On January 3, 2024, a second shareholder derivative action captioned Gervat v. Narayen et al, Case No. 1:24-cv-00006, was filed in the U.S. District Court for the District of Delaware (the “Gervat Action”), purportedly on behalf of Adobe. On January 24, 2024, the Court consolidated the Shah and Gervat Actions (together, the “Consolidated Derivative Action”). On January 18, 2024, a shareholder derivative action captioned Sbriglio v. Narayen et al., Case No. 24-cv-429458, was filed in California Superior Court (the “Sbriglio Action”), purportedly on behalf of Adobe. On January 29, 2024, a shareholder derivative action captioned Roy v. Narayen et al., No. 1:24-cv-00633, was filed in the U.S. District Court for the Southern District of New York, (the “Roy Action,” and together with the Consolidated Derivative Action and the Sbriglio Action, the “Derivative Actions”), purportedly on behalf of Adobe. The Derivative Actions are based largely on the same alleged facts and circumstances as the Securities Action, and name certain of our current and former officers and members of our Board of Directors as defendants and Adobe as a nominal defendant. The Derivative Actions together allege claims for breach of fiduciary duty and/or aiding and abetting breach of fiduciary duties, unjust enrichment, waste of corporate assets, abuse of control, and violations of Section 10(b) (and Rule 10b-5 promulgated thereunder), Section 20(a), and/or Section 21D of the Securities Exchange Act of 1934, as amended, and seek recovery of unspecified damages, restitution, and attorney’s fees and costs, as well as disgorgement of profits and certain payments and benefits, in the case of the Gervat Action, and improvements to Adobe’s corporate governance and internal procedures, in the case of the Shah Action, on behalf of Adobe. The Derivative Actions are presently stayed pending the final resolution of the motion to dismiss in the Securities Action.\nWe dispute the allegations of wrongdoing in the Securities Action and the Derivative Actions and intend to vigorously defend ourselves in these matters. In view of the complexity and ongoing and uncertain nature of the outstanding proceedings and inquiries, at this time we are unable to estimate a reasonably possible financial loss or range of financial loss, if any, that we may incur to resolve or settle the Securities Action and the Derivative Actions.\nIn connection with disputes relating to the validity or alleged infringement of third-party intellectual property rights, including patent rights, we have been, are currently and may in the future be subject to claims, negotiations or complex, protracted litigation. Intellectual property disputes and litigation may be very costly and can be disruptive to our business operations by diverting the attention and energies of management and key technical personnel. Although we have successfully defended or resolved past litigation and disputes, we may not prevail in any ongoing or future litigation and disputes. Third-party intellectual property disputes could subject us to significant liabilities, require us to enter into royalty and licensing arrangements on unfavorable terms, prevent us from licensing certain of our products or offering certain of our services, subject us to injunctions restricting our sale of products or services, cause severe disruptions to our operations or the markets in which we compete, or require us to satisfy indemnification commitments with our customers including contractual provisions under various license arrangements and service agreements.\n87\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNOTE 17.  \nDEBT\nThe carrying value of our borrowings as of November 29, 2024 and December 1, 2023 were as follows:\n(dollars in millions)\nIssuance Date\nDue Date\nEffective Interest Rate\n2024\n2023\n1.90\n% 2025 Notes\nFebruary 2020\nFebruary 2025\n2.07\n%\n$\n500\n \n$\n500\n \n3.25\n% 2025 Notes\nJanuary 2015\nFebruary 2025\n3.67\n%\n1,000\n \n1,000\n \n2.15\n% 2027 Notes\nFebruary 2020\nFebruary 2027\n2.26\n%\n850\n \n850\n \n4.85\n% 2027 Notes\nApril 2024\nApril 2027\n5.03\n%\n500\n \n—\n \n4.80\n% 2029 Notes\nApril 2024\nApril 2029\n4.93\n%\n750\n \n—\n \n2.30\n% 2030 Notes\nFebruary 2020\nFebruary 2030\n2.69\n%\n1,300\n \n1,300\n \n4.95\n% 2034 Notes\nApril 2024\nApril 2034\n5.03\n%\n750\n \n—\n \nTotal debt outstanding, at par\n$\n5,650\n \n$\n3,650\n \nLess: Current portion of debt, at par\n(\n1,500\n)\n—\n \nUnamortized discount and debt issuance costs\n(\n21\n)\n(\n16\n)\nCarrying value of long-term debt\n$\n4,129\n \n$\n3,634\n \nCurrent portion of debt, at par\n$\n1,500\n \n$\n—\n \nUnamortized discount and debt issuance costs\n(\n1\n)\n—\n \nCarrying value of current debt\n$\n1,499\n \n$\n—\n \nSenior Notes\nIn January 2015, we issued $\n1\n billion of senior notes due February 1, 2025. The related discount and issuance costs are amortized to interest expense over the term of the notes using the effective interest method. Interest is payable semi-annually, in arrears, on February 1 and August 1.\nIn February 2020, we issued $\n500\n million of senior notes due February 1, 2025, $\n850\n million of senior notes due February 1, 2027 and $\n1.30\n billion of senior notes due February 1, 2030. The related discount and issuance costs are amortized to interest expense over the respective terms of the notes using the effective interest method. Interest is payable semi-annually, in arrears, on February 1 and August 1.\nIn April 2024, we issued $\n500\n million of senior notes due April 4, 2027, $\n750\n million of senior notes due April 4, 2029 and $\n750\n million of senior notes due April 4, 2034. Our total proceeds were approximately $\n1.99\n billion, net of an issuance discount of $\n3\n million and total issuance costs of $\n9\n million. The related discount and issuance costs are amortized to interest expense over the respective terms of the notes using the effective interest method. Interest is payable semi-annually, in arrears, on April 4 and October 4.\nDuring the first quarter of fiscal 2024, we reclassified the senior notes due February 1, 2025 as current debt in our Consolidated Balance Sheets. As of November 29, 2024, the carrying value of our current debt was $\n1.50\n billion, net of the related discount and issuance costs.\nOur senior notes rank equally with our other unsecured and unsubordinated indebtedness, and do not contain financial covenants. We may redeem the notes at any time, subject to a make-whole premium.\nFor the senior notes issued in January 2015 and February 2020, upon the occurrence of certain change of control triggering events, we may be required to repurchase the notes, at a price equal to \n101\n% of their principal amount, plus accrued and unpaid interest to the date of repurchase. In addition, these notes include covenants that limit our ability to grant liens on assets and to enter into sale and leaseback transactions, subject to significant allowances.\n88\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nRevolving Credit Agreement\nIn June 2022, we entered into a credit agreement (the “Revolving Credit Agreement”), providing for a \nfive-year\n $\n1.5\n billion senior unsecured revolving credit facility, which replaced our previous \nfive-year\n $\n1\n billion senior unsecured revolving credit agreement entered into in October 2018. The Revolving Credit Agreement provides for loans to Adobe and certain of its subsidiaries that may be designated from time to time as additional borrowers. Pursuant to the terms of the Revolving Credit Agreement, we may, subject to the agreement of lenders to provide additional commitments, obtain up to an additional $\n500\n million in commitments, for a maximum aggregate commitment of $\n2\n billion. At our election, loans under the Revolving Credit Agreement will bear interest at either (i) term Secured Overnight Financing Rate (“SOFR”), plus a margin, (ii) adjusted daily SOFR, plus a margin, (iii) alternative currency rate, plus a margin, or (iv) base rate, which is defined as the highest of (a) the federal funds rate plus \n0.50\n%, (b) the agent’s prime rate, or (c) term SOFR plus \n1.00\n%. The margin for term SOFR, adjusted daily SOFR and alternative currency rate loans is based on our debt ratings, and ranges from \n0.460\n% to \n0.900\n%. In addition, facility fees determined according to our debt ratings are payable on the aggregate commitments, regardless of usage, quarterly in an amount ranging from \n0.040\n% to \n0.100\n% per annum. We are permitted to permanently reduce the aggregate commitment under the Revolving Credit Agreement at any time. Subject to certain conditions stated in the Revolving Credit Agreement, Adobe and any of its subsidiaries designated as additional borrowers may borrow, prepay and re-borrow amounts at any time during the term of the Revolving Credit Agreement.\nThe Revolving Credit Agreement contains customary representations, warranties, affirmative and negative covenants, including events of default and indemnification provisions in favor of the lenders. The negative covenants include restrictions regarding the incurrence of liens and indebtedness, certain merger transactions, dispositions and other matters, all subject to certain exceptions. \nThe facility will terminate and all amounts owing thereunder will be due and payable on the maturity date unless (a) the commitments are terminated earlier upon the occurrence of certain events, including an event of default, or (b) the maturity date is further extended upon our request, subject to the agreement of the lenders.\nAs of November 29, 2024, there were \nno\n outstanding borrowings under this Revolving Credit Agreement.\nCommercial Paper Program\nIn September 2023, we established a commercial paper program under which we may issue unsecured commercial paper up to a total of $\n3\n billion outstanding at any time, with maturities of up to \n397\n days from the date of issue. The net proceeds from the issuance of commercial paper are expected to be used for general corporate purposes, which may include working capital, capital expenditures, acquisitions, stock repurchases, refinancing indebtedness or any other general corporate purposes. As of November 29, 2024, there were \nno\n outstanding borrowings under the commercial paper program.\nTerm Loan Credit Agreement\nIn January 2023, we entered into a delayed draw term loan credit agreement (the “Term Loan Credit Agreement”), providing for a senior unsecured term loan of up to $\n3.5\n billion for the purpose of partially funding the purchase price for our intended acquisition of Figma and the related fees and expenses. During fiscal 2024, we entered into a mutual termination agreement with Figma to terminate the previously announced merger agreement. Consequently, the Term Loan Credit Agreement was terminated. There were \nno\n outstanding borrowings under the Term Loan Credit Agreement at the time of termination.\nNOTE 18.  \nLEASES\nWe lease certain facilities and data centers under non-cancellable operating lease arrangements that expire at various dates through 2034. We also have one land lease that expires in 2091. Our lease agreements do not contain any material residual value guarantees, material variable payment provisions or material restrictive covenants. \nOperating lease expense was $\n106\n million, $\n117\n million and $\n121\n million for fiscal 2024, 2023 and 2022, respectively. We recognized operating lease expense in cost of revenue and operating expenses in our Consolidated Statements of Income. Our operating lease expense includes variable lease costs and is net of sublease income, both of which are not material.\n89\nTable of Contents\nADOBE INC.\n \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nDuring fiscal 2024, we recognized impairment charges of $\n78\n million associated with the optimization of our leased facilities, primarily for operating lease right-of-use assets and leasehold improvements, which were recorded as general and administrative expenses. There was no impairment recognized in the other periods presented.\nSupplemental cash flow information for fiscal 2024, 2023 and 2022 related to operating leases was as follows:\n(in millions)\n2024\n2023\n2022\nCash paid for amounts included in the measurement of operating lease liabilities\n$\n85\n \n$\n97\n \n$\n107\n \nRight-of-use assets obtained in exchange for operating lease liabilities\n$\n62\n \n$\n32\n \n$\n59\n \nThe weighted-average remaining lease term and weighted-average discount rate for our operating lease liabilities as of November 29, 2024 were \n6\n years and \n2.69\n%, respectively. \nAs of November 29, 2024, the maturities of lease liabilities under operating leases were as follows:\n(in millions)\nFiscal Year\nOperating Leases\n2025\n$\n85\n \n2026\n83\n \n2027\n83\n \n2028\n70\n \n2029\n52\n \nThereafter\n90\n \nTotal lease liabilities\n$\n463\n \nLess: Imputed interest\n(\n35\n)\nPresent value of lease liabilities\n$\n428\n \nNOTE 19.  \nNON-OPERATING INCOME (EXPENSE)\nNon-operating income (expense) for fiscal 2024, 2023 and 2022 included the following:\n(in millions)\n2024\n2023\n2022\nInterest expense\n$\n(\n169\n)\n$\n(\n113\n)\n$\n(\n112\n)\nInvestment gains (losses), net:\n \nRealized investment gains\n$\n12\n \n$\n6\n \n$\n11\n \nRealized investment losses\n—\n \n—\n \n(\n1\n)\nUnrealized investment gains (losses), net\n36\n \n10\n \n(\n29\n)\nInvestment gains (losses), net\n$\n48\n \n$\n16\n \n$\n(\n19\n)\nOther income (expense), net:\nInterest income\n$\n341\n \n$\n269\n \n$\n61\n \nForeign exchange gains (losses)\n(\n29\n)\n(\n17\n)\n(\n21\n)\nRealized losses on fixed income investments\n(\n1\n)\n(\n7\n)\n—\n \nOther\n—\n \n1\n \n1\n \nOther income (expense), net\n$\n311\n \n$\n246\n \n$\n41\n \nNon-operating income (expense), net\n$\n190\n \n$\n149\n \n$\n(\n90\n)\n90\nTable of Contents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors\nAdobe Inc.:\n    \nOpinions on the Consolidated Financial Statements and Internal Control Over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Adobe Inc. and subsidiaries (the Company) as of November 29, 2024 and December 1, 2023, the related consolidated statements of income, comprehensive income, stockholders’ equity, and cash flows for each of the fiscal years in the three fiscal year period ended November 29, 2024, and the related notes (collectively, the consolidated financial statements). We also have audited the Company’s internal control over financial reporting as of November 29, 2024, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of November 29, 2024 and December 1, 2023, and the results of its operations and its cash flows for each of the fiscal years in the three fiscal year period ended November 29, 2024, in conformity with U.S. generally accepted accounting principles. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of November 29, 2024 based on criteria established in \nInternal Control – Integrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission.\nBasis for Opinions\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s consolidated financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting \nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n91\nTable of Contents\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nPerformance obligations in cloud-enabled software subscriptions\nAs discussed in Note 1 to the consolidated financial statements, cloud-enabled services are highly integrated and interrelated with on-premise or on-device software licenses in the Company’s Creative Cloud and Document Cloud subscription offerings. Because of this, the cloud-based services and the on-premise/on-device software licenses are not considered distinct from each other and the applicable subscription is accounted for as a single performance obligation.\nWe identified the assessment of performance obligations in these cloud-enabled software subscription offerings as a critical audit matter. A high degree of subjective auditor judgment was required to assess the nature of the Company’s Creative Cloud and Document Cloud offerings, their intended benefit to customers as an integrated offering, and the level of integration that exists between the cloud-enabled services and the on-premise/on-device licenses.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of an internal control related to the assessment of distinct performance obligations. We read the Creative Cloud and Document Cloud subscription offering agreements to understand the contractual terms and conditions. We participated in product demonstrations and performed interviews with the Company’s product and engineering department to both understand and observe specific functionalities of the integrated offering and evaluate the nature of the promise made to the Company’s Creative Cloud and Document Cloud customers. We evaluated the features and functionalities of the Creative Cloud and Document Cloud subscription that can be accessed only when using the on-premise/on-device software while connected to the Adobe cloud to assess that customers receive the intended benefit from each solution only as an integrated offering.\n/s/ \nKPMG LLP\nWe have served as the Company’s auditor since 1983. \nSanta Clara, California\nJanuary 13, 2025\n92\nTable of Contents\nITEM 9.  CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A.  CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nOur management has evaluated, under the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, the effectiveness of our disclosure controls and procedures as of November 29, 2024. Based on their evaluation as of November 29, 2024, our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended) were effective at the reasonable assurance level to ensure that the information required to be disclosed by us in this Annual Report on Form 10-K was (i) recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and regulations and (ii) accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure.\nOur management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal control over financial reporting will prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within Adobe have been detected.\nManagement’s Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934, as amended). Our management assessed the effectiveness of our internal control over financial reporting as of November 29, 2024. In making this assessment, our management used the criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Our management has concluded that, as of November 29, 2024, our internal control over financial reporting is effective based on these criteria.\nKPMG LLP, the independent registered public accounting firm that audited our financial statements included in this Annual Report on Form 10-K, has issued an attestation report on our internal control over financial reporting, which is included herein.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting during the quarter ended November 29, 2024 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. \nITEM 9B.  OTHER INFORMATION\nOn January 9, 2025, Brett Biggs notified the Board of Directors of the Company (the “Board”) that he has decided not to stand for re-election at the Company’s 2025 Annual Meeting of Stockholders (the “Annual Meeting”) but will serve out his term as a director until the Annual Meeting. The Board expresses its gratitude for Mr. Biggs, and his decision was not due to any disagreement with the Company or any refusal to stand for re-election.\nTrading Arrangements\nNone.\nITEM 9C.  DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n93\nTable of Contents\nPART III\nITEM 10.  DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item 10 of Form 10-K that is found in our 2025 Proxy Statement to be filed with the SEC in connection with the solicitation of proxies for Adobe’s 2025 Annual Meeting of Stockholders (“2025 Proxy Statement”) is incorporated herein by reference to our 2025 Proxy Statement. The 2025 Proxy Statement will be filed with the SEC within 120 days after the end of the fiscal year to which this report relates. \nFor information with respect to our executive officers, \nsee the section titled “Executive Officers” \nin\n Part I, Item 1\n of this report.\nAdobe has an \ninsider trading policy\n governing the purchase, sale and other dispositions of Adobe’s securities that applies to all personnel of Adobe and its subsidiaries, including directors, officers and employees and other covered persons, as well as Adobe itself. Adobe believes that its insider trading policy is reasonably designed to promote compliance with insider trading laws, rules and regulations, as well as applicable listing standards. A copy of Adobe’s insider trading policy is filed as Exhibit 19.1 to this report.\nITEM 11.  EXECUTIVE COMPENSATION\nThe information required by this Item 11 of Form 10-K is incorporated herein by reference to our 2025 Proxy Statement.\nITEM 12.  SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item 12 of Form 10-K is incorporated herein by reference to our 2025 Proxy Statement.\nITEM 13.  CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item 13 of Form 10-K is incorporated herein by reference to our 2025 Proxy Statement. \nITEM 14.  PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item 14 of Form 10-K is incorporated herein by reference to our 2025 Proxy Statement.\n94\nTable of Contents\nPART IV\nITEM 15.  EXHIBITS, FINANCIAL STATEMENT SCHEDULES \n1.    Financial Statements. \nSee Index to Consolidated Financial Statements in Part II, Item 8\n of this Form 10-K. \n \nIncorporated by Reference\nExhibit\nNumber\nExhibit Description\nForm\nFiling Date\nExhibit Number\nSEC File No.\nFiled\nHerewith\n2.1\nAgreement and Plan of Merger, dated as of September 15, 2022, by and among Adobe Inc., Figma, Inc., Saratoga Merger Sub I, Inc., Saratoga Merger Sub II, LLC and Fortis Advisors LLC\n8-K\n9/15/22\n2.1\n000-15175\n3.1\nRestated Certificate of Incorporation of Adobe\n8-K\n4/26/11\n3.3 \n000-15175\n3.2\nCertificate of Amendment to Restated Certificate of Adobe\n8-K\n10/9/18\n3.1 \n000-15175\n3.3\nAmended and Restated Bylaws\n8-K\n1/18/22\n3.1 \n000-15175\n4.1\nSpecimen Common Stock Certificate\n10-K\n1/25/19\n4.1 \n000-15175\n4.2\nForm of Indenture dated as of January 25, 2010 by and between Adobe and Wells Fargo Bank, National Association, as trustee\nS-3\n2/26/16\n4.1 \n333-209764\n4.3\nForms of Global Note for Adobe Inc.’s 1.700% Notes due 2023, 1.900% Notes due 2025, 2.150% Notes due 2027, and 2.300% Notes due 2030, together with an Officer’s Certificate setting forth the terms of the Notes\n8-K\n2/3/20\n4.1 \n000-15175\n4.4\nForm of Global Note for Adobe’s 3.250% Notes due 2025, together with Form of Officer’s Certificate setting forth the terms of the Note\n8-K\n1/26/15\n4.1 \n000-15175\n4.5\nForms of Global Note for Adobe Inc.\n’\ns 4.850% Notes due 2027, 4.800% Notes due 2029, and 4.950% Notes due 2034, together with an Officer’s Certificate setting forth the terms of the Notes\n8-K\n4/4/24\n4.1\n000-15175\n4.6\nDescription of Registrant's Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934\n10-K\n1/17/24\n4.5 \n000-15175\n10.1\n2020 Employee Stock Purchase Plan, as amended*\n10-K\n1/15/21\n10.1 \n000-15175\n10.2A\n2019 Equity Incentive Plan, as amended*\n8-K\n4/19/24\n10.1 \n000-15175\n10.2B\n2022 Performance Share Program\n, as amended and restated*\n8-K\n1/26/23\n10.4 \n000-15175\n10.2C\nForm of 2022 Performance Share Award Grant Notice and Award Agreement pursuant to 2022 Performance Share Program\n*\n8-K\n1/27/22\n10.3 \n000-15175\n10.2D\n2023 Performance Share Program\n*\n8-K\n1/26/23\n10.2 \n000-15175\n10.2E\nForm of 2023 Performance Share Award Grant Notice and Award Agreement pursuant to 2023 Performance Share Program\n*\n8-K\n1/26/23\n10.3 \n000-15175\n10.2F\n2024 Performance Share Program\n*\n8-K\n1/26/24\n10.2 \n000-15175\n95\nTable of Contents\n \nIncorporated by Reference\nExhibit\nNumber\nExhibit Description\nForm\nFiling Date\nExhibit Number\nSEC File No.\nFiled\nHerewith\n10.2G\nForm of 2024 Performance Share Award Grant Notice and Award Agreement pursuant to 2024 Performance Share Program\n*\n8-K\n1/26/24\n10.3 \n000-15175\n10.2H\nForm of Restricted Stock Unit Grant Notice and Award Agreement pursuant to 2019 Equity Incentive Plan, as amended*\nX\n10.2I\nForm of Non-Employee Director Grant Restricted Stock Unit Grant Notice and Award Agreement pursuant to 2019 Equity Incentive Plan, as amended\n*\nX\n10.3\nRetention Agreement between Adobe and Shantanu Narayen, effective December 5, 2014\n*\n8-K\n12/11/14\n10.2 \n000-15175\n10.4\nForm of Indemnity Agreement*\n10-K\n1/17/24\n10.5 \n000-15175\n10.5A\nAdobe Deferred Compensation Plan, as \na\nmended and \nr\nestated*\n10-K\n1/20/15\n10.19 \n000-15175\n10.5B\nAmendment No. One to Adobe Deferred Compensation \nPlan\n, as amended and restated\n*\n10-K\n1/21/20\n10.6B\n000-15175\n10.6\nCredit Agreement, dated as of June 30, 2022, among the Company, certain subsidiaries of the Company party thereto, Bank of America, N.A. as Administrative Agent and the other lenders party thereto\n8-K\n7/1/22\n10.1 \n000-15175\n10.7\nAdobe Inc. 2023 Executive Severance Plan in the Event of a Change of Control* \n8-K\n12/13/23\n10.1 \n000-15175\n10.8\n202\n4\n Executive Annual Incentive Plan*\n8-K\n1/26/24\n10.4\n000-15175\n10.9\n2023 and 2024 Non-Employee Director Compensation Policy\n*\n10-K\n1/17/23\n10.11\n000-15175\n10.10\n202\n5\n and 202\n6\n Non-Employee Director Compensation Policy\n*\nX\n10.11\nForm of Commercial Paper Dealer Agreement between the Company, as issuer, and the applicable Dealer party thereto.\n8-K\n9/14/23\n10.1\n000-15175\n10.12\nTermination Agreement, dated as of December 17, 2023, by and among Adobe Inc., Saratoga Merger Sub I, Inc., Saratoga Merger Sub II, LLC and Figma, Inc.\n8-K\n12/18/23\n10.1\n000-15175\n19.1\nA\ndobe Inc. Insider Trading Po\nlicy\nX\n21.1\nSubsidiaries of the Registrant\nX\n23.1\nConsent of Independent Registered Public Accounting Firm, KPMG LLP\nX\n24.1\nPower of Attorney (set forth on the signature page to this Annual Report on Form 10-K)\nX\n31.1\nCertification of Chief Executive Officer, as required by Rule 13a-14(a) of the Securities Exchange Act of 1934\n \n \n \nX\n96\nTable of Contents\n \nIncorporated by Reference\nExhibit\nNumber\nExhibit Description\nForm\nFiling Date\nExhibit Number\nSEC File No.\nFiled\nHerewith\n31.2\nCertification of Chief Financial Officer, as required by Rule 13a-14(a) of the Securities Exchange Act of 1934\n \n \n \nX\n32.1\nCertification of Chief Executive Officer, as required by Rule 13a-14(b) of the Securities Exchange Act of 1934†\n \n \n \nX\n32.2\nCertification of Chief Financial Officer, as required by Rule 13a-14(b) of the Securities Exchange Act of 1934†\n \n \n \nX\n97\nAdobe Inc. Incentive Compensation Recovery Policy\n*\n10-K\n1/17/24\n97\n000-15175\n101.INS\nInline XBRL Instance - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n \n \n \nX\n101.SCH\nInline XBRL Taxonomy Extension Schema\n \n \n \nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation\n \n \n \nX\n101.LAB\nInline XBRL Taxonomy Extension Labels\n \n \n \nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation\n \n \n \nX\n101.DEF\nInline XBRL Taxonomy Extension Definition\nX\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n___________________________\n*\nManagement contract or compensatory plan or arrangement. \n†\nThe certifications attached as Exhibits 32.1 and 32.2 that accompany this Annual Report on Form 10-K, are not deemed filed with the Securities and Exchange Commission and are not to be incorporated by reference into any filing of Adobe Inc. under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended, whether made before or after the date of this Form 10-K, irrespective of any general incorporation language contained in such filing.\nITEM 16.  FORM 10-K SUMMARY\nNone.\n97\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nADOBE INC.\n \n \n \nBy:\n/s/ DANIEL DURN\n \n \nDaniel Durn\n \n \nChief Financial Officer and\n \n \nExecutive Vice President, Finance,\nTechnology, Security and Operations\n \n \n(Principal Financial Officer)\nDate: January 13, 2025\nPOWER OF ATTORNEY\n \nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Shantanu Narayen and Daniel Durn, and each or any one of them, his or her lawful attorneys-in-fact and agents, for such person in any and all capacities, to sign any and all amendments to this report and to file the same, with all exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that either of said attorneys-in-fact and agent, or substitute or substitutes, may do or cause to be done by virtue hereof. \nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ SHANTANU NARAYEN\nJanuary 13, 2025\nShantanu Narayen\nChair of the Board of Directors and \nChief Executive Officer\n(Principal Executive Officer)\n/s/ DANIEL DURN\nJanuary 13, 2025\nDaniel Durn\nChief Financial Officer and \nExecutive Vice President, Finance, \nTechnology, Security and Operations\n(Principal Financial Officer)\n/s/ JILLIAN FORUSZ\nJanuary 13, 2025\nJillian Forusz\nSenior Vice President,\nChief Accounting Officer and\nCorporate Controller\n(Principal Accounting Officer)\n/s/ FRANK CALDERONI\nJanuary 13, 2025\nFrank Calderoni\nDirector\n/s/ CRISTIANO AMON\nJanuary 13, 2025\nCristiano Amon\nDirector\n98\nTable of Contents\nSignature\nTitle\nDate\n/s/ AMY BANSE\nJanuary 13, 2025\nAmy Banse\nDirector\n/s/ BRETT BIGGS\nJanuary 13, 2025\nBrett Biggs\nDirector\n/s/ MELANIE BOULDEN\nJanuary 13, 2025\nMelanie Boulden\nDirector\n/s/ LAURA DESMOND\nJanuary 13, 2025\nLaura Desmond\nDirector\n/s/ SPENCER NEUMANN\nJanuary 13, 2025\nSpencer Neumann\nDirector\n/s/ KATHLEEN OBERG\nJanuary 13, 2025\nKathleen Oberg\nDirector\n/s/ DHEERAJ PANDEY\nJanuary 13, 2025\nDheeraj Pandey\nDirector\n/s/ DAVID RICKS\nJanuary 13, 2025\nDavid Ricks\nDirector\n/s/ DAN ROSENSWEIG\nJanuary 13, 2025\nDan Rosensweig\nDirector\n99\nTable of Contents\nSUMMARY OF TRADEMARKS\n \n The following trademarks of Adobe Inc. or its subsidiaries, which may be registered in the United States and/or other countries, are referenced in this Form 10-K:\nAcrobat\nAcrobat AI Assistant\nAcrobat Reader\nAcrobat Sign\nAdobe\nAdobe Audition\nAdobe Campaign\nAdobe Commerce\nAdobe Experience Cloud\nAdobe Express\nAdobe Firefly\nAdobe Fonts\nAdobe Fresco\nAdobe GenStudio\nAdobe Mix Modeler\nAdobe Premiere\nAdobe Scan\nAdobe Sensei\nAdobe Stock\nAdobe Target\nAfter Effects\nBehance\nCamera to Cloud\nCreative Cloud\nDocument Cloud\nFrame.io\nIllustrator\nInCopy\nInDesign\nJourney Optimizer\nLightroom\nMarketo Engage\nPhotoshop\nPostScript\nPremiere Pro\nReader\nSensei\nSubstance 3D\nSubstance 3D Designer\nSubstance 3D Modeler\nSubstance 3D Painter\nSubstance 3D Sampler\nSubstance 3D Stager\nWorkfront\nAll other trademarks are the property of their respective owners.\n100"
}