{
  "ticker": "AES",
  "cik": "0000874761",
  "company_name": "AES CORP",
  "filing_date": "2025-03-11",
  "accession": "0000874761-25-000013",
  "primary_doc": "aes-20241231.htm",
  "item1_text": "Item 1\n—\nBusiness\n \nof this Form 10-K, are subject to mortgages or other liens or encumbrances as part of the project's related finance facility. In addition, the majority of our facilities are located on land that is leased. However, in a few instances, no accompanying project financing exists for the facility, and in a few of these cases, the land interest may not be subject to any encumbrance and is owned outright by the subsidiary or affiliate.\n75 | 2024 Annual Report\nITEM 3. LEGAL PROCEEDINGS \nThe Company is involved in certain claims, suits and legal proceedings in the normal course of business. The Company has accrued for litigation and claims when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. The Company believes, based upon information it currently possesses and taking into account established reserves for estimated liabilities and its insurance coverage, that the ultimate outcome of these proceedings and actions is unlikely to have a material adverse effect on the Company's consolidated financial statements. It is reasonably possible, however, that some matters could be decided unfavorably to the Company and could require the Company to pay damages or make expenditures in amounts that could be material, but cannot be estimated as of December 31, 2024. Pursuant to SEC amendments Item 103 of SEC Regulation S-K, AES’ policy is to disclose environmental legal proceedings to which a governmental authority is a party if such proceedings are reasonably expected to result in monetary sanctions of greater than or equal to $1 million.\nIn December 2001, Grid Corporation of Odisha (“GRIDCO”) served a notice to arbitrate pursuant to the Indian Arbitration and Conciliation Act of 1996 on the Company, AES Orissa Distribution Private Limited (“AES ODPL”), and Jyoti Structures (“Jyoti”) pursuant to the terms of the shareholders agreement between GRIDCO, the Company, AES ODPL, Jyoti and the Central Electricity Supply Company of Orissa Ltd. (“CESCO”), an affiliate of the Company. In the arbitration, GRIDCO asserted that a comfort letter issued by the Company in connection with the Company's indirect investment in CESCO obligates the Company to provide additional financial support to cover all of CESCO's financial obligations to GRIDCO. GRIDCO appeared to be seeking approximately $189 million in damages, plus undisclosed penalties and interest, but a detailed alleged damage analysis was not filed by GRIDCO. The Company counterclaimed against GRIDCO for damages. In June 2007, a 2-to-1 majority of the arbitral tribunal rendered its award rejecting GRIDCO's claims and holding that none of the respondents, the Company, AES ODPL, or Jyoti, had any liability to GRIDCO. The respondents' counterclaims were also rejected. A majority of the tribunal later awarded the respondents, including the Company, some of their costs relating to the arbitration. GRIDCO filed challenges of the tribunal's awards with the local Indian court. GRIDCO's challenge of the costs award has been dismissed by the court, but its challenge of the liability award remains pending. A hearing on the liability award has not taken place to date. The Company believes that it has meritorious defenses to the claims asserted against it and will defend itself vigorously in these proceedings; however, there can be no assurances that it will be successful in its efforts.\nPursuant to their environmental audit, AES Sul and AES Florestal discovered 200 barrels of solid creosote waste and other contaminants at a pole factory that AES Florestal had been operating. The conclusion of the audit was that a prior operator of the pole factory, Companhia Estadual de Energia (“CEEE”), had been using those contaminants to treat the poles that were manufactured at the factory. On their initiative, AES Sul and AES Florestal communicated with Brazilian authorities and CEEE about the adoption of containment and remediation measures. In March 2008, the State Attorney of the state of Rio Grande do Sul, Brazil filed a public civil action against AES Sul, AES Florestal and CEEE seeking an order requiring the companies to mitigate the contaminated area located on the grounds of the pole factory and an indemnity payment of approximately R$6 million ($1 million). In October 2011, the State Attorney filed a request for an injunction ordering the defendant companies to contain and remove the contamination immediately. The court granted injunctive relief on October 18, 2011, but determined that only CEEE was required to perform the removal work. In May 2012, CEEE began the removal work in compliance with the injunction. The case is now awaiting judgment. The removal and remediation costs are estimated to be approximately R$\n15\n million to R$\n60\n million ($\n2\n million to $\n10\n million), and there could be additional costs which cannot be estimated at this time. In June 2016, the Company sold AES Sul to CPFL Energia S.A. and as part of the sale, AES Guaiba, a holding company of AES Sul, retained the potential liability relating to this matter. The Company believes that there are meritorious defenses to the claims asserted against it and will defend itself vigorously in these proceedings; however, there can be no assurances that it will be successful in its efforts.\nIn September 2015, AES Southland Development, LLC and AES Redondo Beach, LLC filed a lawsuit against the California Coastal Commission (the “CCC”) over the CCC's determination that the site of AES Redondo Beach included approximately 5.93 acres of CCC-jurisdictional wetlands. The CCC has asserted that AES Redondo Beach has improperly installed and operated water pumps affecting the alleged wetlands in violation of the California Coastal Act and Redondo Beach Local Coastal Program (“LCP”). Potential outcomes of the CCC determination could include an order requiring AES Redondo Beach to perform a restoration and/or pay fines or penalties. AES Redondo Beach believes that it has meritorious arguments concerning the underlying CCC determination, but there can be no assurances that it will be successful. On March 27, 2020, AES Redondo Beach, LLC sold the site to an unaffiliated third-party purchaser that assumed the obligations contained within these proceedings. On May 26, 2020, CCC staff sent AES an NOV directing AES to discontinue any operation of the water pumps in the alleged \n76 | 2024 Annual Report\nwetlands and to submit a Coastal Development Permit (“CDP”) application for the removal of the water pumps within the alleged wetlands. The NOV also directed AES to submit technical analysis regarding additional water pumps located within onsite electrical vaults and, if necessary, a CDP application for their continued operation. With respect to the vault pumps, AES provided the CCC, with the requested analysis, and the CCC has not required further action. With respect to the pumps in the alleged wetlands, AES locked out those pumps to prevent further operation and submitted the CDP to the permitting authority, the City of Redondo Beach (the “City”), with respect to AES’ plans to disable or remove the pumps. On October 14, 2020, the City deemed the CDP application to be complete and indicated a public hearing will be required. AES submitted all required information and waited for the City to continue processing the application. In December 2023, the City indicated it would continue processing the CDP application. AES will vigorously defend its interests with regard to the NOV, but we cannot predict the outcome of the matter at this time. However, settlements and litigated outcomes of Coastal Act and LCP claims alleged against other companies have required them to pay significant civil penalties and undertake remedial measures.\nIn October 2015, AES Indiana received an NOV alleging violations of the Clean Air Act (“CAA”), the Indiana State Implementation Plan (“SIP”), and the Title V operating permit related to alleged particulate and opacity violations at Petersburg Station Unit 3. In addition, in February 2016, AES Indiana received an NOV from the EPA alleging violations of New Source Review and other CAA regulations, the Indiana SIP, and the Title V operating permit at Petersburg Station. On August 31, 2020, AES Indiana reached a settlement with the EPA, the DOJ and the Indiana Department of Environmental Management (“IDEM”), resolving these purported violations of the CAA at Petersburg Station. The settlement agreement, in the form of a proposed judicial consent decree, was approved and entered by the U.S. District Court for the Southern District of Indiana on March 23, 2021, and includes, among other items, the following requirements: annual caps on NO\nx\n and SO\n2\n emissions and more stringent emissions limits than AES Indiana's current Title V air permit; payment of civil penalties totaling $1.5 million; a $5 million environmental mitigation project consisting of the construction and operation of a new, non-emitting source of generation at the site; expenditure of $0.3 million on a state-only environmentally beneficial project to preserve local, ecologically-significant lands; and retirement of Units 1 and 2 prior to July 1, 2023. \nIn December 2018, a lawsuit was filed in Dominican Republic civil court against the Company, AES Puerto Rico, and three other AES affiliates. The lawsuit purports to be brought on behalf of over 100 Dominican claimants, living and deceased, and appears to seek relief relating to CCRs that were delivered to the Dominican Republic in 2004. The lawsuit generally alleges that the CCRs caused personal injuries and deaths and demands $476 million in alleged damages. The lawsuit does not identify, or provide any supporting information concerning, the alleged injuries of the claimants individually. Nor does the lawsuit provide any information supporting the demand for damages or explaining how the quantum was derived. Preliminary hearings have taken place. The relevant AES companies believe that they have meritorious defenses to the claims asserted against them and will defend themselves vigorously in this proceeding; however, there can be no assurances that they will be successful in their efforts.\nIn February 2019, a separate lawsuit was filed in Dominican Republic civil court against the Company, AES Puerto Rico, two other AES affiliates, and an unaffiliated company and its principal. Subsequently, the claimants withdrew the lawsuit with respect to AES Puerto Rico. The lawsuit remains pending against the other AES defendants (“AES Defendants”) and the unaffiliated defendants. The lawsuit purports to be brought on behalf of over 200 Dominican claimants, living and deceased, and appears to seek relief relating to CCRs that were delivered to the Dominican Republic in 2003 and 2004. The lawsuit generally alleges that the CCRs caused personal injuries and deaths and demands over $900 million in alleged damages. The lawsuit does not identify, or provide any supporting information concerning, the alleged injuries of the claimants individually, nor does the lawsuit provide any information supporting the demand for damages or explaining how the quantum was derived. In August 2020, at the request of the relevant AES companies, the case was transferred to a different civil court, namely, the Civil Court of La Vega (“CFI”). In May 2024, the CFI dismissed the entire case due to the expiry of the statute of limitations. Later in 2024, the claimants appealed the dismissal to the relevant intermediate appellate court. The claimants are attempting to formally serve the appeal on all defendants. The AES Defendants believe that they have meritorious defenses to the claims asserted against them and will defend themselves vigorously in this proceeding; however, there can be no assurances that they will be successful in their efforts.\nIn October 2019, the Superintendency of the Environment (the \"SMA\") notified AES Andes of certain alleged breaches associated with the environmental permit of the Ventanas Complex, initiating a sanctioning process through Exempt Resolution N° 1 / ROL D-129-2019. The alleged charges include exceeding generation limits, failing to reduce emissions during episodes of poor air quality, exceeding limits on discharges to the sea, and exceeding noise limits. AES Andes has submitted a proposed “Compliance Program” to the SMA for the Ventanas Complex. \n77 | 2024 Annual Report\nThe latest version of this Compliance Program was submitted on May 26, 2021. On December 30, 2021, the Compliance Program was approved by the SMA. However, an ex officio action was brought by the SMA due to alleged exceedances of generation limits, which would require the Company to reduce SO\n2\n, NO\nX\n and PM emissions in order to achieve the emissions offset established in the Compliance Program. On January 6, 2022, AES Andes filed a reposition with the SMA seeking modification of the means for compliance with the ex officio action. On January 17, 2023, the SMA approved street paving measures, or alternatively a program providing heaters for community members, as the means to satisfy the air emissions offsets in the approved Compliance Plan. The cost of the proposed Compliance Program is approximately $10.8 million and is in the execution stage. Fines are possible if the SMA determines there is an unsatisfactory execution of the Compliance Program. On April 21, 2023, the SMA notified AES Andes of a resolution alleging an additional “serious” non-compliance of the Ventanas Complex failing to reduce emissions during episodes of poor air quality. On May 24, 2023, AES Andes submitted disclaimers to the SMA in response to this resolution. On May 10, 2024, the Company was notified of a fine for $180,515. On June 3, 2024, the Company appealed this fine to the Environmental Court. The Company believes that it has meritorious defenses and will continue to assert them vigorously in this dispute; however, there can be no assurances that it will be successful.\nIn March 2020, Mexico’s Comisión Federal de Electricidad (“CFE”) served an arbitration demand upon AES Mérida III. CFE alleged that AES Mérida was in breach of a power and capacity purchase agreement (“Contract”) between the two parties, even though the allegations relate to CFE’s own failure to provide fuel within the specifications of the Contract. CFE sought to recover approximately $200 million in payments made to AES Mérida under the Contract, plus approximately $480 million in alleged damages for having to acquire power from alternative sources in the Yucatan Peninsula. AES Mérida filed an answer denying liability to CFE and asserted a counterclaim for damages due to CFE’s breach of its obligations. The evidentiary hearing took place in November 2021. Closing arguments were heard in May 2022. In November 2022, the arbitration Tribunal issued its decision in the case, rejecting CFE’s claims for damages and awarding AES Mérida a net amount of damages on AES Mérida’s counterclaims (\"Award\"). There are ongoing proceedings in the Mexican courts concerning AES Mérida's attempt to enforce the Award and CFE's attempt to challenge the Award. At AES Mérida's request, in November 2024, the court of first instance confirmed the award and ordered its enforcement against CFE. This decision is subject to further review within the Mexican judiciary. Separately, in March 2024, the relevant court of first instance denied CFE’s request to nullify the Award. The March 2024 decision was upheld by the relevant federal District Court and later by the Collegiate Circuit Court. AES Mérida believes that it has meritorious claims and defenses and will assert them vigorously in this dispute; however, there can be no assurances that it will be successful in its efforts.\nOn May 12, 2021, the Mexican Federal Attorney for Environmental Protection (the “Authority”) initiated an environmental audit at the TEP thermal generating facility. On January 20, 2023, TEP was notified of the resolution issued by the Authority, which alleges breaches of air emission regulations, including the failure to submit reports. The resolution imposes a fine of $27,615,140 pesos (approximately $1.3 million). On March 3, 2023, the facility filed a nullity judgment to challenge such resolution, which has been admitted by the local judge with an injunction granted against execution of the proposed fine during the course of the underlying proceedings. However, the local tax authority rejected receiving the bond that is required to guarantee the injunction, and as a result, on September 18, 2023, TEP filed a complaint seeking to compel the tax authority to accept the bond and recognize the validity of the injunction. The Specialized Chamber has not issued a response to the complaint, despite the fact that the Company has taken several legal actions to try to expedite the proceedings. The Company believes that it has meritorious defenses to the claims asserted against it and will defend itself vigorously in these proceedings; however, there can be no assurances that it will be successful in its efforts.\nIn February 2022, a lawsuit was filed in Dominican Republic civil court against the Company. The lawsuit purports to be brought on behalf of over 425 Dominican claimants, living and deceased, and appears to seek relief relating to CCRs that were delivered to the Dominican Republic in 2003 and 2004. The lawsuit generally alleges that the CCRs caused personal injuries and deaths and demands over $600 million in alleged damages. The lawsuit does not identify or provide any supporting information concerning the alleged injuries of the claimants individually. Nor does the lawsuit provide any information supporting the demand for damages or explaining how the quantum was derived. In February 2024, at the request of the Company, the Dominican Supreme Court of Justice transferred the case to a different civil court, namely, the Civil Court of La Vega. The claimants' attempt to recuse the presiding judge has been rejected by the relevant Dominican appellate court. The Company believes that it has meritorious defenses to the claims asserted against it and will defend itself vigorously in this proceeding; however, there can be no assurances that it will be successful in its efforts.\n78 | 2024 Annual Report\nOn January 26, 2023, the SMA notified Alto Maipo SpA of four alleged charges relating to the Alto Maipo facility, all of which are categorized by the SMA as “serious.” The alleged charges include untimely completion of intake works and insufficient capture by the provisional works, irrigation water outlet and canal contemplated by an agreement with local communities; non-compliance with the details of the forest management plans and intervention in unauthorized areas; construction of a road in a restricted paleontological area; and unlawful moving of fauna. On February 16, 2023, the Alto Maipo project submitted an initial compliance program to the SMA, which has undergone observations by the SMA and interested third parties, and been resubmitted by the project. On December 9, 2024, the SMA rejected the latest version of the Compliance Program. On December 16, Alto Maipo submitted a petition for reconsideration. If appeals are unsuccessful, the imposition of fines are possible.\nIn May 2024, the Chilean competition agency (the Fiscalía Nacional Económica or “FNE”) opened an investigation regarding AES Andes’s declarations with respect to coal prices and coal blends used to generate electricity in Chile. The investigation was prompted by a confidential complaint filed in December 2023, which has not been disclosed to AES Andes. In general terms, the investigation seeks to determine whether the facts alleged in the complaint could be considered as an abuse of a dominant position by AES Andes. The investigation is at a very early stage; AES Andes is currently responding to the FNE’s information requests. The FNE will independently conduct the investigation and will ultimately decide whether to dismiss the matter or initiate a judicial proceeding on the allegations in the confidential complaint. These types of investigations in Chile commonly last for years. AES Andes does not believe that it has violated any competition laws. Further, if the FNE ever initiates a judicial proceeding on this matter, AES Andes will defend itself vigorously. Given the early nature of this investigation, we are unable to estimate any potential impact of the investigation or its eventual outcome on our business, financial condition or results of operations.\nITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\n79 | 2024 Annual Report\nPART II\n ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nRecent Sales of Unregistered Securities\nNone.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nStock Repurchase Program \n— The Board authorization permits the Parent Company to repurchase stock through a variety of methods, including open market repurchases, purchases by contract (including, without limitation, accelerated stock repurchase programs or 10b5-1 plans), and/or privately negotiated transactions. There can be no assurances as to the amount, timing or prices of repurchases, which may vary based on market conditions and other factors. The Stock Repurchase Program does not have an expiration date and can be modified or terminated by the Board of Directors at any time. The cumulative repurchases from the commencement of the Stock Repurchase Program in July 2010 through December 31, 2024 totaled 154.3 million shares for a total cost of $1.9 billion, at an average price per share of $12.12 (including a nominal amount of commissions). As of December 31, 2024, $264 million remained available for repurchase under the Stock Repurchase Program. No repurchases were made by The AES Corporation of its common stock in 2024, 2023, and 2022. \nMarket Information\nOur common stock is traded on the New York Stock Exchange under the symbol \"AES.\" \nDividends\nThe Parent Company commenced a quarterly cash dividend in the fourth quarter of 2012. The Parent Company has increased this dividend annually. The quarterly per-share cash dividends for the last three years are displayed below.\nCommencing the fourth quarter of\n2024\n2023\n2022\nCash dividend\n$0.17595\n$0.1725\n$0.1659\nThe fourth quarter 2024 cash dividend was paid on February 14, 2025\n.\n There can be no assurance the AES Board will declare a dividend in the future or, if declared, the amount of any dividend. Our ability to pay dividends will also depend on receipt of dividends from our various subsidiaries across our portfolio.\nUnder the terms of our revolving credit facilities, which we entered into with commercial bank syndicates, we have limitations on our ability to pay cash dividends and/or repurchase stock. Our subsidiaries' ability to declare and pay cash dividends to us is also subject to certain limitations contained in the project loans, governmental provisions and other agreements to which our subsidiaries are subject. See the information contained under Item 12.—\nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters—Securities Authorized for Issuance under Equity Compensation Plans\n of this Form 10-K.\nHolders\nAs of March 6, 2025, there were approximately 3,301 record holders of our common stock.\n80 | 2024 Annual Report\nPerformance Graph\nTHE AES CORPORATION\nPEER GROUP INDEX/STOCK PRICE PERFORMANCE\nSource: Bloomberg\nWe have selected the Standard and Poor's (\"S&P\") 500 Utilities Index as our peer group index. The S&P 500 Utilities Index is a published sector index comprising the 31 electric and gas utilities included in the S&P 500.\nThe five year total return chart assumes $100 invested on December 31, 2019 in AES Common Stock, the S&P 500 Index and the S&P 500 Utilities Index. The information included under the heading \nPerformance Graph\n shall not be considered \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934 or incorporated by reference in any filing under the Securities Act of 1933 or the Securities Exchange Act of 1934.\nITEM 6. [RESERVED]\n81 | 2024 Annual Report\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFor discussion of the Company's year ended December 31, 2023 compared to the year ended December 31, 2022, refer to Item 7.\n—Management's Discussion and Analysis of Financial Condition and Results of Operations \nin our 2023 Form 10-K filed with the SEC on February 26, 2024.\nExecutive Summary \nIn 2024, AES delivered on its strategic and financial objectives. We completed construction or the acquisition of 3.0 GW of renewables and energy storage, construction of a 670 MW combined cycle gas plant, and signed long-term PPAs for an additional 4.4 GW of new renewable energy. See \nOverview of our Strategy\n included in Item 1.—\nBusiness\n of this Form 10-K for further information.\nCompared with last year, net income increased $984 million, from a net loss of $182 million in 2023 to net income of $802 million in 2024. This increase is the result of lower impairments, unrealized foreign currency gains in the current year versus losses in the prior year, gain on sale of AES Brasil, favorable contributions at the Utilities and New Energy Technologies SBUs, and higher contributions from renewables projects placed in service in the current year; partially offset by higher interest expense and lower interest income, and the prior year gain on sell-down of Fluence.\nAdjusted EBITDA, a non-GAAP measure, decreased $189 million, from $2,828 million to $2,639 million, mainly driven by record-breaking drought conditions and outages in Colombia at the Renewables SBU, lower margins at the Energy Infrastructure SBU due to prior year margin at the hedged merchant Southland facilities that are contracted primarily for capacity in the current year and higher outages; partially offset by higher contributions at the Utilities SBU and higher revenues from new projects at the Renewables SBU.\nAdjusted EBITDA with Tax Attributes, a non-GAAP measure, increased $513 million, from $3,439 million to $3,952 million, primarily due to higher realized tax attributes driven by more renewables projects placed in service, partially offset by the drivers above.\nCompared with last year, diluted earnings per share from continuing operations increased $2.03, from $0.34 to $2.37. This increase is mainly driven by lower long-lived asset impairments in the current year, higher contributions from renewables projects placed in service in the current year, prior year unrealized foreign currency losses at the Energy Infrastructure SBU, the gain on sale of AES Brasil, and lower income tax expense. This was partially offset by higher interest expense and lower interest income, and lower margins due to outages.\nAdjusted EPS, a non-GAAP measure, increased $0.38 from $1.76 to $2.14, mainly driven by higher contributions from renewables projects placed in service in the current year, a lower adjusted tax rate, and higher contributions from the Utilities SBU; partially offset by lower contributions from the Energy Infrastructure SBU.\n82 | 2024 Annual Report\nReview of Consolidated Results of Operations\nYears Ended December 31,\n2024\n2023\n$ Change\n% Change\n(in millions, except per share amounts)\nRevenue:\nRenewables SBU\n$\n2,510 \n$\n2,339 \n$\n171 \n7 \n%\nUtilities SBU\n3,608 \n3,495 \n113 \n3 \n%\nEnergy Infrastructure SBU\n6,238 \n6,836 \n(598)\n-9 \n%\nNew Energy Technologies SBU\n1 \n76 \n(75)\n-99 \n%\nCorporate and Other\n162 \n138 \n24 \n17 \n%\nEliminations\n(241)\n(216)\n(25)\n12 \n%\nTotal Revenue\n12,278 \n12,668 \n(390)\n-3 \n%\nOperating Margin:\nRenewables SBU\n359 \n492 \n(133)\n-27 \n%\nUtilities SBU\n543 \n433 \n110 \n25 \n%\nEnergy Infrastructure SBU\n1,273 \n1,418 \n(145)\n-10 \n%\nNew Energy Technologies SBU\n(7)\n(9)\n2 \n-22 \n%\nCorporate and Other\n267 \n239 \n28 \n12 \n%\nEliminations\n(121)\n(69)\n(52)\n75 \n%\nTotal Operating Margin\n2,314 \n2,504 \n(190)\n-8 \n%\nGeneral and administrative expenses\n(288)\n(255)\n(33)\n13 \n%\nInterest expense\n(1,485)\n(1,319)\n(166)\n13 \n%\nInterest income\n381 \n551 \n(170)\n-31 \n%\nLoss on extinguishment of debt\n(17)\n(63)\n46 \n-73 \n%\nOther expense\n(175)\n(99)\n(76)\n77 \n%\nOther income\n156 \n89 \n67 \n75 \n%\nGain (loss) on disposal and sale of business interests\n351 \n134 \n217 \nNM\nGoodwill impairment expense\n— \n(12)\n12 \n-100 \n%\nAsset impairment expense\n(374)\n(1,067)\n693 \n-65 \n%\nForeign currency transaction gains (losses)\n31 \n(359)\n390 \nNM\nIncome tax expense\n(59)\n(261)\n202 \n-77 \n%\nNet equity in losses of affiliates\n(26)\n(32)\n6 \n-19 \n%\nINCOME (LOSS) FROM CONTINUING OPERATIONS\n809 \n(189)\n998 \nNM\nGain (loss) from disposal of discontinued businesses, net of income tax benefit (expense) of $7, $7, and $0, respectively\n(7)\n7 \n(14)\nNM\nNET INCOME (LOSS)\n802 \n(182)\n984 \nNM\nLess: Net loss (income) attributable to noncontrolling interests and redeemable stock of subsidiaries\n877 \n431 \n446 \nNM\nNET INCOME (LOSS) ATTRIBUTABLE TO THE AES CORPORATION\n$\n1,679 \n$\n249 \n$\n1,430 \nNM\nAMOUNTS ATTRIBUTABLE TO THE AES CORPORATION COMMON STOCKHOLDERS:\n— \n%\nIncome (loss) from continuing operations, net of tax\n$\n1,686 \n$\n242 \n$\n1,444 \nNM\nIncome (loss) from discontinued operations, net of tax\n(7)\n7 \n(14)\nNM\nNET INCOME (LOSS) ATTRIBUTABLE TO THE AES CORPORATION\n$\n1,679 \n$\n249 \n$\n1,430 \nNM\nNet cash provided by operating activities\n$\n2,752 \n$\n3,034 \n$\n(282)\n-9 \n%\nComponents of Revenue, Cost of Sales and Operating Margin — \nRevenue includes revenue earned from the sale of energy from our utilities and the production and sale of energy from our generation plants, which are classified as regulated and non-regulated, respectively, on the Consolidated Statements of Operations. Revenue also includes the gains or losses on derivatives associated with the sale of electricity. \nCost of sales includes costs incurred directly by the businesses in the ordinary course of business. Examples include electricity and fuel purchases, operations and maintenance costs, depreciation and amortization expenses, bad debt expense and recoveries, and general administrative and support costs (including employee-related costs directly associated with the operations of the business). Cost of sales also includes the gains or losses on derivatives (including embedded derivatives other than foreign currency embedded derivatives) associated with the purchase of electricity or fuel.\nOperating margin is defined as revenue less cost of sales.\n83 | 2024 Annual Report\nConsolidated Revenue and Operating Margin\nYear Ended December 31, 2024\nRevenue\n(in millions)\n    \nConsolidated Revenue\n \n— \nRevenue decreased $390 million, or 3%, in 2024 compared to 2023, driven by: \n•\n$598 million at Energy Infrastructure primarily driven by a $398 million decrease in regulated contract sales and prices, $319 million due to higher revenues from our hedged merchant Southland facilities in the prior year that are contracted primarily for capacity in the current year, $73 million due to lower generation driven by lower dispatch in Argentina, and $69 million impact from the selldown of Amman East and IPP4 in Jordan; partially offset by $195 million higher realized gains on power swaps; and\n•\n$75 million at New Energy Technologies mainly driven by the sale of the Fallbrook project in March 2023.\nThese unfavorable impacts were partially offset by increases of:\n•\n$171 million at Renewables mainly driven by $205 million due to new projects in service, $61 million of unrealized derivative gains, $58 million of higher contracted energy sales, and $35 million due to the appreciation of the Colombian peso; partially offset by $125 million impact from the sale of our controlling interest in AES Brasil, and $69 million due to higher outages and record-breaking drought conditions in Colombia; and\n•\n$113 million at Utilities mainly driven by a $252 million increase in transmission, distribution, and rider revenues mainly due to higher rates, and $57 million due to higher net retail demand mainly driven by favorable weather; partially offset by $181 million of lower Fuel Adjustment Charge rider revenue.\nOperating Margin\n(in millions)\nConsolidated Operating Margin\n \n— \nOperating margin decreased $190 million, or 8%, in 2024 compared to 2023, driven by:\n84 | 2024 Annual Report\n•\n$145 million at Energy Infrastructure mainly driven by $110 million due to higher energy margin from our hedged merchant Southland facilities in the prior year that are contracted primarily for capacity in the current year, $54 million impact from the selldown of Amman East and IPP4 in Jordan, $51 million due to higher outages, $39 million due to end of commercial operations at Warrior Run in May 2024, and $31 million due to lower LNG transactions; partially offset by $82 million from a PPA termination loss recognized in the prior year and $45 million of unrealized derivative gains;\n•\n$133 million at Renewables driven by $148 million impact primarily from record-breaking drought conditions in Colombia, alongside drier hydrological conditions in Brazil, $45 million impact of outages at Colombia due to a flooding incident at the Chivor plant which occurred in June 2024, $44 million impact from the sale of our controlling interest in AES Brasil, and $29 million higher fixed costs primarily due to an accelerated growth plan; partially offset by unrealized derivative gains of $61 million and higher contracted energy sales of $58 million; and\n•\n$24 million at Corporate and Other primarily driven by higher eliminations of insurance recoveries booked at the businesses related to AES' self-insurance company.\nThese unfavorable impacts were partially offset by an increase of $110 million at Utilities primarily driven by $83 million due to higher transmission and rider revenues, $76 million due to higher retail rates as a result of the 2024 Base Rate Order, and $72 million due to higher demand primarily from the impact of weather; partially offset by $57 million higher depreciation from additional assets placed in service, the prior year $29 million deferral of power purchase costs associated with the approval of ESP 4, and $25 million higher expected credit losses due to the one-time implementation of customer billing system upgrades.\nSee Item 7.\n—\nManagement's Discussion and Analysis of Financial Condition and Results of Operations—SBU Performance Analysis\n \nof this Form 10-K for additional discussion and analysis of operating results for each SBU.\nConsolidated Results of Operations — Other\nGeneral and administrative expenses\n \nGeneral and administrative expenses include expenses related to corporate staff functions and initiatives, executive management, finance, legal, human resources, and information systems, as well as global development costs.\nGeneral and administrative expenses increased $33 million, or 13%, to $288 million in 2024 compared to $255 million in 2023, primarily due to increased business development costs, higher people costs, higher professional fees, and higher IT costs.\nInterest expense \nInterest expense increased $166 million, or 13%, to $1,485 million in 2024, compared to $1,319 million in 2023. This increase was driven by higher interest expense of $67 million and $52 million at the Renewables and Utilities SBUs, respectively, primarily due to new debt issued, net of increased capitalized interest, and higher interest at Corporate of $63 million primarily due to a higher weighted average interest rate and debt balance at the Parent Company; partially offset by a $16 million decrease at the Energy Infrastructure SBU primarily due to lower debt balances.\nInterest income \nInterest income decreased $170 million, or 31%, to $381 million in 2024, compared to $551 million in 2023 primarily due to a decrease in Argentina of $138 million primarily due to lower short-term investments at lower rates and a decrease in Brazil of $51 million due to lower short-term investments and the sale of AES Brasil in October 2024; partially offset by an increase in Chile of $30 million mainly driven by interest recognized on the Stabilization Fund receivables.\nLoss on extinguishment of debt\nLoss on extinguishment of debt decreased $46 million to $17 million in 2024, compared to $63 million in 2023. This decrease was primarily due to prior year losses of $47 million and $10 million due to prepayments at AES Andes and AES Hispanola Holdings BV, respectively, partially offset by a current year loss of $10 million due to a prepayment at AES Andes.\n85 | 2024 Annual Report\nSee Note 12—\nO\nbligations\n included in Item 8.—\nFinancial Statements and Supplementary Data\n of this Form 10-K for further information.\nOther income\nOther income increased $67 million, or 75%, to $156 million in 2024, compared to $89 million in 2023 primarily due to the bargain purchase gain recognized on the Madison and Birdseye acquisition for $20 million, a $17 million increase in gains on remeasurement of contingent consideration primarily on projects acquired at AES Clean Energy, a $14 million gain corresponding to the step acquisition of Felix, and an indexation adjustment of Stabilization Fund receivables at AES Andes of $12 million.\nOther expense\nOther expense increased $76 million, or 77%, to $175 million in 2024, compared to $99 million in 2023 primarily driven by $52 million higher losses on commencement of sales-type leases at AES Renewable Holdings, a $43 million increase in losses on remeasurement of contingent consideration primarily on projects acquired at AES Clean Energy, and a $20 million loss related to legal expenses and other direct costs associated with the troubled debt restructuring at Puerto Rico. This was partially offset by a $36 million decrease in loss on sale and disposal of assets, mainly driven by prior year impairments of inventory due to the planned early plant closures at Ventanas 2, Norgener, and Warrior Run.\nSee Note 22—\nOther Income and Expense\n included in Item 8.—\nFinancial Statements and Supplementary Data\n of this Form 10-K for further information.\nGain (loss) on disposal and sale of business interests \nGain on disposal and sale of business increased $217 million to $351 million in 2024, compared to $134 million in 2023. This increase was driven by the gain on sale of AES Brasil of $312 million and a $52 million gain corresponding to the dilution of AES' ownership in Uplight as a result of the AutoGrid acquisition; partially offset by a $136 million gain on sale of shares of Fluence, our equity method investment, in 2023, and the $10 million loss on the selldown of Amman East and IPP4 in Jordan, which is now accounted for as an equity method investment.\nSee Note 9—\nInvestments in and Advances to Affiliates\n and Note 25—\nHeld-for-Sale and Dispositions\n \nincluded in Item 8.—\nFinancial Statements and Supplementary Data\n of this Form 10-K for further information.\nGoodwill impairment expense \nGoodwill impairment expense was $12 million in 2023 due to impairment at the TEG TEP reporting unit primarily driven by an increase in the discount rate due to increasing risk of non-renewal of operating permits required after March 31, 2024.\nSee Note 10—\nGoodwill and Other Intangible Assets\n included in Item 8.—\nFinancial Statements and Supplementary Data\n of this Form 10-K for further information.\nAsset impairment expense \nAsset impairment expense decreased $693 million, or 65%, to $374 million in 2024, compared to $1.1 billion in 2023. This decrease was primarily due to higher prior year impairments, including a $198 million impairment associated with PJM's approval to retire the Warrior Run coal-fired facility; a $186 million impairment at New York Wind related to a repowering project that will result in decommissioning the existing turbines and reducing their depreciable lives; a $137 million impairment associated with the commitment to accelerate the retirement of the Norgener coal-fired facility in Chile; a $77 million and $59 million impairment at TEG and TEP, respectively, due to a reduction in expected capacity cash flows after expiration of the current PPA; and a $59 million impairment at Amman East and IPP4 in Jordan due to the delay in closing the sale transaction. In addition, the decrease was driven by lower impairment expense of $105 million associated with the held-for-sale classification of Mong Duong and lower impairment expense of $56 million at AES Clean Energy Development related to the write-off of project development intangibles for projects that were determined to be no longer viable. This was partially offset by current year impairments of $125 million and $80 million at Ventanas and AES Brasil, respectively, after meeting held-for-sale criteria.\nSee Note 23—\nAsset Impairment Expense\n included in Item 8.—\nFinancial Statements and Supplementary Data\n of this Form 10-K for further information.\n86 | 2024 Annual Report\nForeign currency transaction gains (losses) \nForeign currency transaction gains (losses) in millions were as follows:\nYears Ended December 31,\n2024\n2023\nCorporate\n$\n33 \n$\n(19)\nChile\n(5)\n(40)\nArgentina\n \n(1)\n2\n(312)\nOther\n1 \n12 \nTotal\n \n(2)\n$\n31 \n$\n(359)\n_____________________________\n(1)\n    Includes peso-denominated energy receivable indexed to the USD through the FONINVEMEM agreement which is considered a foreign currency derivative. See Note 7—\nFinancing Receivables\n included in Item 8.—\nFinancial Statements and Supplementary Data\n of this Form 10-K for further information.\n(2)\n    Includes gains of $137 million and losses of $28 million on foreign currency derivative contracts for the years ended December 31, 2024 and 2023, respectively.\nThe Company recognized net foreign currency transaction gains of $31 million in 2024, primarily driven by realized gains on swaps and options denominated in the Brazilian real.\nThe Company recognized net foreign currency transaction losses of $359 million in 2023, primarily driven by the depreciation of the Argentine peso, unrealized losses related to an intercompany loan denominated in the Colombian peso, and realized and unrealized foreign currency derivative losses in South America due to the depreciating Colombian peso.\nIncome tax expense \nIncome tax expense was $59 million in 2024 compared to $261 million in 2023. The Company's effective tax rates were 7% and 251% for the years ended December 31, 2024 and 2023, respectively.\nThe 2024 effective tax rate was impacted by the current year benefits associated with ITCs and the restructuring of a foreign holding company. These drivers were partially offset by the impacts of allocations of losses to tax equity investors on renewables projects.\nThe 2023 effective tax rate was impacted by the allocation of losses to noncontrolling interest in U.S. tax-equity partnerships and pretax impairments at certain Mexican subsidiaries and at the Mong Duong coal-fired plant in Vietnam. These impacts were partially offset by inflationary and foreign currency impacts at certain Argentine businesses, net of valuation allowances, as well as the recognition of U.S. investment tax credits for renewables projects placed in service in 2023. See Note 23—\nAsset Impairment Expense\n included in Item 8.—\nFinancial Statements and Supplementary Data\n of this Form 10-K for details of the asset impairments. \nOur effective tax rate reflects the tax effect of significant operations outside the U.S., which are generally taxed at rates different than the U.S. statutory rate. Foreign earnings may be taxed at rates higher than the U.S. corporate rate of 21% and are also subject to current U.S. taxation under the GILTI rule. A future proportionate change in the composition of income before income taxes from foreign and domestic tax jurisdictions could impact our periodic effective tax rate. The Company also benefits from reduced tax rates in certain countries as a result of satisfying specific commitments regarding employment and capital investment. See Note 24—\nIncome Taxes\n included in Item 8.—\nFinancial Statements and Supplementary Data\n of this Form 10-K for additional information regarding these reduced rates.\nNet equity in losses of affiliates\nNet equity in losses of affiliates decreased $6 million, or 19%, to $26 million in 2024, compared to $32 million in 2023. This decrease was primarily driven by a $30 million decrease in losses from Fluence, mainly attributable to improved margins on a new product line. This was partially offset by a $13 million decrease in earnings from Mesa La Paz, primarily due to the prior year termination of derivative positions due to a contract amendment; lower earnings from sPower of $7 million, mainly due to lower earnings from renewables projects that came online; and lower earnings from Energía Natural Dominicana Enadom of $7 million due to lower capitalized interest and higher depreciation.\nSee Note 9—\nInvestments In and Advances to Affiliates\n included in Item 8.—\nFinancial Statements and Supplementary Data\n of this Form 10-K for further information.\n87 | 2024 Annual Report\nNet income (loss) attributable to noncontrolling interests and redeemable stock of subsidiaries\nNet loss attributable to noncontrolling interests and redeemable stock of subsidiaries increased $446 million to $877 million in 2024, compared to $431 million in 2023. This increase was primarily due to:\n•\nHigher allocation of losses to tax equity investors on renewables projects placed in service of $496 million; and\n•\nHigher losses at Brazil of $60 million, primarily due to held-for-sale impairment.\nThese drivers were partially offset by:\n•\nHigher held-for-sale impairment at Mong Duong in the prior year than the current year of $48 million; and\n•\nSelldowns of business interests resulting in larger shares of income attributable to minority shareholders at the Energy Infrastructure SBU of $46 million.\nNet income (loss) attributable to The AES Corporation\nNet income attributable to The AES Corporation increased $1,430 million to $1,679 million in 2024, compared to $249 million in 2023. This increase was primarily due to:\n•\nLower long-lived asset impairments in the current year of $589 million;\n•\nHigher contributions from renewables projects placed in service in the current year of $496 million;\n•\nUnrealized foreign currency losses in the prior year exceeding current year gains by $345 million, primarily driven by higher losses in the prior year at the Energy Infrastructure SBU;\n•\nGain on sale of AES Brasil in the current year of $312 million;\n•\nLower income tax expense attributable to AES, primarily driven by $273 million of tax benefit resulting from the transfer of ITCs directly to third parties; and\n•\nHigher margin from the Utilities SBU impacting net income attributable to AES by $77 million, mainly driven by higher transmission and rider revenues and higher retail rates.\nThese drivers were partially offset by:\n•\nHigher interest expense and lower interest income in the current year of $245 million;\n•\nLower margin from the Energy Infrastructure SBU impacting net income attributable to AES by $147 million, mainly driven by selldowns, higher energy margin from our hedged merchant Southland facilities in the prior year that are contracted primarily for capacity in the current year, and higher outages;\n•\nLower margin at the Renewables SBU impacting net income attributable to AES by $145 million, mainly driven by record-breaking drought conditions and partial outage due to a flooding incident in Colombia; and\n•\nGain on sale of shares in Fluence in the prior year of $136 million.\nSBU Performance Analysis\nSegments\nWe are organized into \nfour\n technology-based SBUs: \nRenewables\n (solar, wind, energy storage, and hydro generation facilities); \nUtilities\n (AES Indiana, AES Ohio, and AES El Salvador regulated utilities and their generation facilities); \nEnergy Infrastructure\n (natural gas, LNG, coal, pet coke, diesel, and oil generation facilities, and our businesses in Chile); and \nNew Energy Technologies\n (investments in Fluence, Uplight, Maximo, and other new and innovative energy technology businesses). Our businesses in Chile, which have a mix of generation sources, including renewables, are included within the Energy Infrastructure SBU, as the generation from all sources is pooled to service our existing PPAs.\nNon-GAAP Measures\nEBITDA, Adjusted EBITDA, Adjusted EBITDA with Tax Attributes, Adjusted PTC, and Adjusted EPS are non-GAAP supplemental measures that are used by management and external users of our Consolidated Financial Statements such as investors, industry analysts, and lenders.\n88 | 2024 Annual Report\nFor the year ended December 31, 2024, the Company updated the definitions of EBITDA and Adjusted EBITDA to include accretion of AROs in the \ndepreciation and amortization\n add-back. We believe excluding accretion of AROs from these metrics better reflects the underlying business performance of the Company and is aligned with the metrics of our industry peers. For comparability and consistency, all prior period EBITDA and Adjusted EBITDA measures have been recast to conform to the current presentation. The impact of this update resulted in an increase to Adjusted EBITDA of $22 million and $16 million in each of the years ended December 31, 2024 and 2023, respectively.\nDuring the first quarter of 2024, the Company updated the definitions of Adjusted EBITDA, Adjusted PTC, and Adjusted EPS add-back (a) \nunrealized gains or losses related to derivative transactions and equity securities\n to include financial assets and liabilities measured using the fair value option, and updated add-back (e) \ngains, losses, and costs due to the early retirement of debt\n to include troubled debt restructuring. We believe excluding these gains or losses better reflects the underlying business performance of the Company. The Company also removed the adjustment for net gains at Angamos, one of our businesses in the Energy Infrastructure SBU, associated with the early contract terminations with Minera Escondida and Minera Spence. As this adjustment was specific to certain contract terminations that occurred in 2020, we believe removing this adjustment from our non-GAAP definitions provides simplification and clarity for our investors. There were no such impacts in 2023 or 2024.\nFor the year ended December 31, 2023, the Company changed the definition of Adjusted EPS to remove the adjustment for \ntax benefit or expense related to the enactment effects of 2017 U.S. tax law reform and related regulations and any subsequent period adjustments related to enactment effects, including the 2021 tax benefit on reversal of uncertain tax positions effectively settled upon the closure of the Company's U.S. tax return exam\n. As this adjustment was specific to the impacts of tax law reform enacted in 2017, we believe removing this adjustment from our non-GAAP definition provides simplification and clarity for our investors. There were no such impacts in 2022 or 2023.\nEBITDA, Adjusted EBITDA and Adjusted EBITDA with Tax Attributes \nWe define EBITDA as earnings before interest income and expense, taxes, depreciation, amortization, and accretion of AROs. We define Adjusted EBITDA as EBITDA adjusted for the impact of NCI and interest, taxes, depreciation, amortization, and accretion of AROs of our equity affiliates, adding back interest income recognized under service concession arrangements, and excluding gains or losses of both consolidated entities and entities accounted for under the equity method due to (a) unrealized gains or losses pertaining to derivative transactions, equity securities, and financial assets and liabilities measured using the fair value option; (b) unrealized foreign currency gains or losses; (c) gains, losses, benefits, and costs associated with dispositions and acquisitions of business interests, including early plant closures, and gains and losses recognized at commencement of sales-type leases; (d) losses due to impairments; and (e) gains, losses, and costs due to the early retirement of debt or troubled debt restructuring.\nIn addition to the revenue and cost of sales reflected in Operating Margin, Adjusted EBITDA includes the other components of our Consolidated Statement of Operations, such as \ngeneral and administrative expenses\n in Corporate and Other as well as business development costs, \nother expense\n and \nother income,\n \nrealized foreign currency transaction gains and losses,\n and \nnet equity in earnings of affiliates\n.\nWe further define Adjusted EBITDA with Tax Attributes as Adjusted EBITDA, adding back the pre-tax effect of Production Tax Credits (“PTCs”), Investment Tax Credits (“ITCs”), and depreciation tax deductions allocated to tax equity investors, as well as the tax benefit recorded from tax credits retained or transferred to third parties.\nThe GAAP measure most comparable to EBITDA, Adjusted EBITDA, and Adjusted EBITDA with Tax Attributes is \nNet income\n. We believe that EBITDA, Adjusted EBITDA, and Adjusted EBITDA with Tax Attributes better reflect the underlying business performance of the Company. Adjusted EBITDA is the most relevant measure considered in the Company’s internal evaluation of the financial performance of its segments. Factors in this determination include the variability due to unrealized gains or losses pertaining to derivative transactions, equity securities, or financial assets and liabilities remeasurement, unrealized foreign currency gains or losses, losses due to impairments, strategic decisions to dispose of or acquire business interests or retire debt, and the variability of allocations of earnings to tax equity investors, which affect results in a given period or periods. In addition, each of these metrics represent the business performance of the Company before the application of statutory income tax rates and tax adjustments, including the effects of tax planning, corresponding to the various jurisdictions in which the Company operates. Given its large number of businesses and overall complexity, the Company concluded that Adjusted \n89 | 2024 Annual Report\nEBITDA is a more transparent measure than \nNet income\n that better assists investors in determining which businesses have the greatest impact on the Company’s results.\nEBITDA, Adjusted EBITDA, and Adjusted EBITDA with Tax Attributes should not be construed as alternatives to \nNet income\n, which is determined in accordance with GAAP.\nYears Ended December 31,\nReconciliation of Adjusted EBITDA and Adjusted EBITDA with Tax Attributes (in millions)\n2024\n2023\nNet income (loss)\n$\n802 \n$\n(182)\nIncome tax expense\n59 \n261 \nInterest expense\n1,485 \n1,319 \nInterest income\n(381)\n(551)\nDepreciation, amortization, and accretion of AROs\n1,264 \n1,147 \nEBITDA\n$\n3,229 \n$\n1,994 \nLess: (Income) loss from discontinued operations\n7 \n(7)\nLess: Adjustment for noncontrolling interests and redeemable stock of subsidiaries \n(1)\n(734)\n(556)\nLess: Income tax expense (benefit), interest expense (income) and depreciation, amortization, and accretion of AROs from equity affiliates\n136 \n131 \nInterest income recognized under service concession arrangements\n65 \n71 \nUnrealized derivative and equity securities losses (gains)\n(94)\n34 \nUnrealized foreign currency losses\n16 \n301 \nDisposition/acquisition gains\n(323)\n(79)\nImpairment losses\n280 \n877 \nLoss on extinguishment of debt\n57 \n62 \nAdjusted EBITDA\n \n(1)\n$\n2,639 \n$\n2,828 \nTax attributes\n1,313 \n611 \nAdjusted EBITDA with Tax Attributes \n(2)\n$\n3,952 \n$\n3,439 \n_____________________________\n(1)\nThe allocation of earnings and losses to tax equity investors from both consolidated entities and equity affiliates is removed from Adjusted EBITDA. NCI also excludes amounts allocated to preferred shareholders during the construction phase before a project becomes operational, as this is akin to a financing arrangement.\n(2)         \nAdjusted EBITDA with Tax Attributes includes the impact of the share of the ITCs, PTCs, and depreciation deductions allocated to tax equity investors under the HLBV accounting method and recognized as \nNet loss (income) attributable to noncontrolling interests and redeemable stock of subsidiaries \non the Consolidated Statements of Operations. It also includes the tax benefit recorded from tax credits retained or transferred to third parties. The tax attributes are related to the Renewables and Utilities SBUs.\n90 | 2024 Annual Report\nAdjusted PTC \nWe define Adjusted PTC as pre-tax income from continuing operations attributable to The AES Corporation excluding gains or losses of the consolidated entity due to (a) unrealized gains or losses pertaining to derivative transactions, equity securities, and financial assets and liabilities measured using the fair value option; (b) unrealized foreign currency gains or losses; (c) gains, losses, benefits, and costs associated with dispositions and acquisitions of business interests, including early plant closures, and gains and losses recognized at commencement of sales-type leases; (d) losses due to impairments; and (e) gains, losses and costs due to the early retirement of debt or troubled debt restructuring. Adjusted PTC also includes net equity in earnings of affiliates on an after-tax basis adjusted for the same gains or losses excluded from consolidated entities.\nAdjusted PTC reflects the impact of NCI and excludes the items specified in the definition above. In addition to the revenue and cost of sales reflected in Operating Margin, Adjusted PTC includes the other components of our Consolidated Statement of Operations, such as \ngeneral and administrative expenses\n in the Corporate segment, as well as business development costs, \ninterest expense\n and \ninterest income,\n \nother expense\n and \nother income,\n \nrealized foreign currency transaction gains and losses,\n and \nnet equity in earnings of affiliates\n.\nThe GAAP measure most comparable to Adjusted PTC is \nincome from continuing operations attributable to The AES Corporation\n. We believe that Adjusted PTC better reflects the underlying business performance of the Company and is the most relevant measure considered in the Company's internal evaluation of the financial performance of its segments. Factors in this determination include the variability due to unrealized gains or losses pertaining to derivative transactions, equity securities, or financial assets and liabilities remeasurement, unrealized foreign currency gains or losses, losses due to impairments, and strategic decisions to dispose of or acquire business interests or retire debt, which affect results in a given period or periods. In addition, Adjusted PTC represents the business performance of the Company before the application of statutory income tax rates and tax adjustments, including the effects of tax planning, corresponding to the various jurisdictions in which the Company operates. Given its large number of businesses and complexity, the Company concluded that Adjusted PTC is a more transparent measure that better assists investors in determining which businesses have the greatest impact on the Company's results. \nAdjusted PTC should not be construed as an alternative to \nincome from continuing operations attributable to The AES Corporation\n, which is determined in accordance with GAAP.\nYears Ended December 31,\nReconciliation of Adjusted PTC (in millions)\n2024\n2023\nIncome from continuing operations, net of tax, attributable to The AES Corporation\n$\n1,686\n \n$\n242\n \nIncome tax expense (benefit) attributable to The AES Corporation\n(19)\n206 \nPre-tax contribution\n1,667 \n448 \nUnrealized derivative and equity securities losses (gains)\n(94)\n41 \nUnrealized foreign currency losses\n16 \n301 \nDisposition/acquisition gains\n(320)\n(79)\nImpairment losses\n280 \n877 \nLoss on extinguishment of debt\n65 \n70 \nTotal Adjusted PTC\n$\n1,614 \n$\n1,658 \n91 | 2024 Annual Report\nAdjusted EPS \nWe define Adjusted EPS as diluted earnings per share from continuing operations excluding gains or losses of both consolidated entities and entities accounted for under the equity method due to (a) unrealized gains or losses pertaining to derivative transactions, equity securities, and financial assets and liabilities measured using the fair value option; (b) unrealized foreign currency gains or losses; (c) gains, losses, benefits and costs associated with dispositions and acquisitions of business interests, including early plant closures, the tax impact from the repatriation of sales proceeds, and gains and losses recognized at commencement of sales-type leases; (d) losses due to impairments; and (e) gains, losses and costs due to the early retirement of debt or troubled debt restructuring.\nThe GAAP measure most comparable to Adjusted EPS is diluted earnings per share from continuing operations. We believe that Adjusted EPS better reflects the underlying business performance of the Company and is considered in the Company's internal evaluation of financial performance. Factors in this determination include the variability due to unrealized gains or losses pertaining to derivative transactions, equity securities, or financial assets and liabilities remeasurement, unrealized foreign currency gains or losses, losses due to impairments, and strategic decisions to dispose of or acquire business interests or retire debt, which affect results in a given period or periods. Adjusted EPS should not be construed as an alternative to diluted earnings per share from continuing operations, which is determined in accordance with GAAP. \nYears Ended December 31,\nReconciliation of Adjusted EPS\n2024\n2023\nDiluted earnings per share from continuing operations\n$\n2.37 \n$\n0.34 \nUnrealized derivative and equity securities (gains) losses\n(0.13)\n(1)\n0.06 \n(2)\nUnrealized foreign currency losses\n0.02 \n0.42 \n(3)\nDisposition/acquisition gains\n(0.45)\n(4)\n(0.11)\n(5)\nImpairment losses\n0.39 \n(6)\n1.23 \n(7)\nLoss on extinguishment of debt\n0.09 \n(8)\n0.10 \n(9)\nLess: Net income tax benefit\n(0.15)\n(10)\n(0.28)\n(11)\nAdjusted EPS\n$\n2.14 \n$\n1.76 \n_____________________________\n(1)\nAmount primarily relates to unrealized gains on cross currency swaps in Brazil of $39 million, or $0.05 per share, unrealized gains on commodity derivatives at AES Clean Energy of $38 million, or $0.05 per share, and net unrealized derivative gains at the Energy Infrastructure SBU of $25 million, or $0.04 per share.\n(2)\nAmount primarily relates to unrealized derivative losses due to the termination of a PPA of $72 million, or $0.10 per share and net unrealized derivative losses at AES Clean Energy of $20 million, or $0.03 per share, offset by net unrealized derivative gains at the Energy Infrastructure SBU of $46 million, or $0.06 per share. \n(3)\nAmount primarily relates to unrealized foreign currency losses in Argentina of $262 million, or $0.37 per share, mainly associated with the devaluation of long-term receivables denominated in Argentine pesos, and unrealized foreign currency losses at AES Andes of $25 million, or $0.03 per share. \n92 | 2024 Annual Report\n(4)\nAmount primarily relates to gain on sale of AES Brasil of $312 million, or $0.44 per share, a gain on dilution of ownership in Uplight due to its acquisition of AutoGrid of $53 million, or $0.07 per share, and realized gains on cross currency swaps hedging the AES Brasil sale proceeds of $34 million, or $0.05 per share; partially offset by day-one losses at commencement of sales-type leases at AES Renewable Holdings of $63 million, or $0.09 per share, and loss on partial sale of our ownership interest in Amman East and IPP4 in Jordan of $10 million, or $0.01 per share.\n(5)\nAmount primarily relates to the gain on sale of Fluence shares of $136 million, or $0.19 per share, partially offset by costs due to early plant closure at the Ventanas 2 and Norgener coal-fired plants in Chile of $37 million, or $0.05 per share and at Warrior Run of $6 million, or $0.01 per share, and day-one losses recognized at commencement of sales-type leases at AES Renewable Holdings of $20 million, or $0.03 per share.\n(6)\nAmount primarily relates to impairments at Ventanas of $125 million, or $0.18 per share, at AES Clean Energy Development projects of $70 million, or $0.10 per share, at Brazil of $38 million, or $0.05 per share, and at Mong Duong of $32 million, or $0.04 per share.\n(7)\nAmount primarily relates to asset impairments at Warrior Run of $198 million, or $0.28 per share, at New York Wind of $139 million, or $0.20 per share, at the Norgener coal-fired plant in Chile of $136 million, or $0.19 per share, at TEG and TEP of $76 million and $58 million, respectively, or $0.19 per share, AES Clean Energy development projects of $114 million, or $0.16 per share, at Mong Duong of $88 million, or $0.12 per share, at Jordan of $21 million, or $0.03 per share, and at the GAF Projects at AES Renewable Holdings of $18 million, or $0.03 per share, and a goodwill impairment at the TEG TEP reporting unit of $12 million, or $0.02 per share. \n(8)\nAmount primarily relates to losses incurred at AES Andes due to early retirement of debt of $29 million, or $0.04 per share, and costs incurred due to troubled debt restructuring at Puerto Rico of $20 million, or $0.03 per share.\n(9)\nAmount primarily relates to losses incurred at AES Andes due to early retirement of debt of $46 million, or $0.07 per share, and loss on early retirement of debt at AES Hispanola Holdings BV of $10 million, or $0.01 per share. \n(10)\nAmount primarily relates to income tax benefits associated with the impairment and tax over book investment basis difference related to AES Ventanas of $68 million, or $0.09 per share, the sale of AES Brasil of $18 million, or $0.02 per share, the impairment at AES Clean Energy Development projects of $16 million, or $0.02 per share, and the day-one sales-type lease loss at AES Renewable Holdings of $13 million, or $0.02 per share.\n(11)\nAmount primarily relates to income tax benefits associated with the asset impairments at Warrior Run of $46 million, or $0.06 per share, at the Norgener coal-fired plant in Chile of $37 million, or $0.05 per share, at New York Wind of $32 million, or $0.05 per share, at TEG and TEP of $27 million, or $0.04 per share, and at AES Clean Energy development projects of $26 million, or $0.04 per share; income tax benefits associated with the recognition of unrealized losses due to the termination of a PPA of $17 million, or $0.02 per share; and income tax benefits associated with losses incurred at AES Andes due to early retirement of debt of $13 million, or $0.02 per share; partially offset by income tax expense associated with the gain on sale of Fluence shares of $31 million, or $0.04 per share.\nRenewables SBU\nThe following table summarizes Operating Margin, Adjusted EBITDA, and Adjusted EBITDA with Tax Attributes (in millions) for the periods indicated:\nFor the Years Ended December 31,\n2024\n2023\n$ Change\n% Change\nOperating Margin\n$\n359 \n$\n492 \n$\n(133)\n-27 \n%\nAdjusted EBITDA\n \n(1)\n552 \n652 \n(100)\n-15 \n%\nAdjusted EBITDA with Tax Attributes \n(1)\n1,845 \n1,245 \n600 \n48 \n%\n_____________________________\n(1)    \nA non-GAAP financial measure. See S\nBU Performance Analysis—Non-GAAP Measures \nfor definition and Item 1.\n—\nBusiness\n for the respective ownership interest for key businesses.\nOperating Margin decreased $133 million driven by a $148 million impact primarily from record-breaking drought conditions in Colombia, alongside drier hydrological conditions in Brazil, a $45 million impact from outages at Colombia due to a flooding incident at the Chivor plant which occurred in June 2024, a $44 million impact from the sale of our controlling interest in AES Brasil, and a $29 million impact from higher fixed costs primarily due to an accelerated growth plan. These negative impacts were partially offset by a $33 million positive impact from new businesses, unrealized derivative gains of $61 million, and a $58 million impact from higher contracted energy sales.\nAdjusted EBITDA decreased $100 million primarily due to the drivers mentioned above, adjusted for NCI, unrealized derivatives, and depreciation expense.\nAdjusted EBITDA with Tax Attributes increased $600 million, primarily due to higher realized tax attributes driven by more projects being placed in service, partially offset by the decrease in Adjusted EBITDA. For the year ended December 31, 2024 and 2023, we realized $1,293 million and $593 million, respectively, from tax attributes earned by AES Clean Energy businesses.\n93 | 2024 Annual Report\nUtilities SBU\nThe following table summarizes Operating Margin, Adjusted EBITDA, Adjusted EBITDA with Tax Attributes, and Adjusted PTC (in millions) for the periods indicated:\nFor the Years Ended December 31, \n2024\n2023\n$ Change\n% Change\nOperating Margin\n$\n543 \n$\n433 \n$\n110 \n25 \n%\nAdjusted EBITDA\n (1)\n792 \n678 \n114 \n17 \n%\nAdjusted EBITDA with Tax Attributes \n(1)\n812 \n696 \n116 \n17 \n%\nAdjusted PTC\n (1) (2)\n225 \n196 \n29 \n15 \n%\n_____________________________\n(1)    \nA non-GAAP financial measure. See S\nBU Performance Analysis—Non-GAAP Measures \nfor definition and Item 1.\n—\nBusiness\n for the respective ownership interest for key businesses.\n(2)    \nAdjusted PTC remains a key metric used by management for analyzing our businesses in the utilities industry\n.\nOperating Margin increased $110 million mainly driven by $83 million due to higher transmission and rider revenues, $76 million due to higher retail rates as a result of the 2024 Base Rate Order, and $72 million due to higher demand primarily from the impact of weather. These increases are partially offset by $57 million due to higher depreciation expense from additional assets placed in service, higher amortization of regulatory assets and changes in depreciation rates as a result of the 2024 Base Rate Order, $29 million due to the prior year one-time deferral of purchased power costs associated with the approval of ESP 4, and $25 million higher expected credit losses due to the temporary pause of customer disconnections related to the implementation of customer billing system upgrades.\nAdjusted EBITDA increased $114 million primarily due to the drivers above, adjusted for NCI and depreciation expense.\nAdjusted EBITDA with Tax Attributes increased $116 million mainly due to the drivers above.\nAdjusted PTC increased $29 million primarily due to the operating margin drivers above, partially offset by higher interest expense due to increased borrowings and the prior year one-time deferral of carrying costs associated with the approval of ESP 4, and NCI adjustments.\nEnergy Infrastructure SBU\nThe following table summarizes Operating Margin and Adjusted EBITDA (in millions) for the periods indicated:\nFor the Years Ended December 31,\n2024\n2023\n$ Change\n% Change\nOperating Margin\n$\n1,273 \n$\n1,418 \n$\n(145)\n-10 \n%\nAdjusted EBITDA\n (1)\n1,366 \n1,540 \n(174)\n-11 \n%\n_____________________________\n(1)    \nA non-GAAP financial measure. See S\nBU Performance Analysis—Non-GAAP Measures \nfor definition and Item 1.\n—\nBusiness\n for the respective ownership interest for key businesses.\nOperating Margin decreased $145 million, mainly driven by $110 million due to higher energy margin from our hedged merchant Southland facilities in the prior year that are contracted primarily for capacity in the current year, $54 million due to the impact of the selldown of Amman East and IPP4 in Jordan, $51 million due to higher outages, $39 million due to end of commercial operations at Warrior Run in May 2024, and $31 million from lower LNG transactions.\nThe decrease in Operating Margin is partially offset by $82 million from a PPA termination loss recognized in the prior year and $45 million of unrealized gains resulting from derivatives. \nAdjusted EBITDA decreased $174 million, primarily due to the drivers above, adjusted for NCI and unrealized derivatives, and lower realized foreign currency losses.\n94 | 2024 Annual Report\nNew Energy Technologies SBU\nThe following table summarizes Operating Margin and Adjusted EBITDA (in millions) for the periods indicated:\nFor the Years Ended December 31, \n2024\n2023\n$ Change\n% Change\nOperating Margin\n$\n(7)\n$\n(9)\n$\n2 \n22 \n%\nAdjusted EBITDA\n (1)\n(38)\n(62)\n24 \n39 \n%\n_____________________________\n(1)    \nA non-GAAP financial measure. See S\nBU Performance Analysis—Non-GAAP Measures \nfor definition and Item 1.\n—\nBusiness\n for the respective ownership interest for key businesses.\nOperating Margin increased $2 million, with no material drivers.\nAdjusted EBITDA increased $24 million, primarily driven by a $44 million improvement in the share of results at Fluence mainly due to improved margins, partially offset by the prior year settlement of contractual claims with a battery module vendor. This increase was partially offset by $21 million higher general and administrative expenses mainly related to higher development costs.\nKey Trends and Uncertainties \nDuring 2025 and beyond, we expect to face the following challenges at certain of our businesses. Management expects that improved operating performance at certain businesses, growth from new businesses, and global cost reduction initiatives may lessen or offset their impact. If these favorable effects do not occur, or if the challenges described below and elsewhere in this section impact us more significantly than we currently anticipate, or if volatile foreign currencies and commodities move more unfavorably, then these adverse factors (or other adverse factors unknown to us) may have a material impact on our operating margin, net income attributable to The AES Corporation and cash flows. We continue to monitor our operations and address challenges as they arise. For the risk factors related to our business, see Item 1.—\nBusiness\n and"
}