{
  "ticker": "AFL",
  "cik": "0000004977",
  "company_name": "AFLAC INC",
  "filing_date": "2025-02-26",
  "accession": "0000004977-25-000047",
  "primary_doc": "afl-20241231.htm",
  "item1_text": "Item 1. Business for a summary of each segment's products and distribution channels. \nConsistent with U.S. GAAP guidance for segment reporting, pretax adjusted earnings is the Company's U.S. GAAP measure of segment performance. The Company believes that a presentation of this measure is vitally important to an understanding of the underlying profitability drivers and trends of its business. Additional performance measures used to evaluate the financial condition and performance of the Company's segments are listed below. \n•\nOperating Ratios\n•\nNew Annualized Premium Sales\n•\nNew Money Yield \n•\nReturn on Average Invested Assets\n•\nAverage Weekly Producer\n•\nPremium Persistency\nFor additional information on the Company’s performance measures included in this MD&A, see the Glossary of Selected Terms found directly following Part IV. See Note 2 of the Notes to the Consolidated Financial Statements for the reconciliation of segment results to the Company's consolidated U.S. GAAP results and additional information.\n42\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \nAFLAC JAPAN SEGMENT\nAflac Japan Pretax Adjusted Earnings\nChanges in Aflac Japan's pretax adjusted earnings and profit margins are primarily affected by morbidity, mortality, expenses, persistency and investment yields. The following table presents a summary of operating results for Aflac Japan for the years ended December 31.\nAflac Japan Summary of Operating Results\nIn Dollars\nIn Yen\n(In millions of dollars and billions of yen)\n2024\n2023\n2024\n2023\nNet earned premiums \n(1)\n$\n6,930\n$\n8,047\n¥\n1,050\n¥\n1,128\nNet investment income: \n(2)\nYen-denominated investment income\n879\n985\n133\n138\nU.S. dollar-denominated investment income\n1,849\n1,755\n281\n247\nNet investment income\n2,727\n2,739\n414\n385\nAmortized hedge costs\n26\n157\n4\n20\nAdjusted net investment income\n2,701\n2,582\n410\n366\nOther income (loss)\n28\n35\n4\n5\nTotal adjusted revenues\n9,659\n10,664\n1,464\n1,498\nBenefits and claims:\nBenefits and claims, excluding reserve remeasurement\n4,761\n5,409\n721\n757\nReserve remeasurement (gains) losses\n(444)\n(96)\n(64)\n(13)\nTotal benefits and claims, net\n4,317\n5,313\n657\n744\nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n321\n326\n49\n46\nInsurance commissions\n435\n491\n66\n69\nInsurance and other expenses\n1,092\n1,300\n165\n182\nTotal adjusted expenses\n1,848\n2,117\n280\n297\nTotal benefits and adjusted expenses\n6,165\n7,430\n936\n1,041\nPretax adjusted earnings\n$\n3,494\n$\n3,234\n¥\n528\n¥\n457\nWeighted-average yen/dollar exchange rate\n150.97\n140.57\n—\n—\nPercentage change over previous period:\nNet earned premiums\n(13.9)\n%\n(12.4)\n%\n(6.9)\n%\n(5.9)\n%\nAdjusted net investment income\n4.6\n \n(3.3)\n12.1\n \n4.0 \nTotal adjusted revenues\n(9.4)\n(10.3)\n(2.3)\n(3.6)\nTotal benefits and claims, net\n(18.7)\n(14.2)\n(11.8)\n(7.8)\nTotal adjusted expenses\n(12.7)\n(12.4)\n(5.8)\n(6.1)\nPretax adjusted earnings\n8.0\n \n(1.4)\n15.5\n \n6.0 \n(1) \nIncludes a gain (loss) of $(81) and $20 in 2024 and 2023, respectively, related to remeasurement of the deferred profit liability for limited-payment contracts.\n(2)\n Net interest income/expense from derivatives associated with certain investment strategies of $(305) and $(294) in 2024 and 2023, respectively, have been reclassified from net investment gains (losses) and included in adjusted earnings as a component of net investment income.\nIn 2024, operating results in yen terms compared to the previous year were as follows:\n•\nNet earned premiums decreased primarily due to approximately ¥29 billion related to the internal cancer reinsurance transactions with Aflac Re established in the fourth quarter of 2024 and 2023, approximately ¥20 billion from limited-pay products reaching premium paid-up status and approximately ¥11 billion related to the remeasurement of the deferred profit liability for limited-pay contracts in the third quarter of 2024.\n•\nAdjusted net investment income increased primarily due to higher variable net investment income of ¥18 billion, the weakening of the yen on U.S. dollar investments of ¥17 billion and lower amortized hedge cost of ¥16 billion.\n•\nTotal adjusted revenues decreased primarily due to the decrease in net earned premiums, partially offset by the increase in adjusted net investment income.\n43\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \n•\nTotal benefits and claims decreased primarily due to ¥50 billion of reserve remeasurement gains related to assumption updates in the third quarter of 2024 as well as internal reinsurance activity.\n•\nTotal adjusted expenses decreased primarily due to internal reinsurance activity.\n•\nPretax adjusted earnings increased primarily due to the decrease in both total benefits and claims and total adjusted expenses, partially offset by the decrease in total adjusted revenues.\nAnnualized premiums in force decreased 3.0% to ¥1.21 trillion as of December 31, 2024, compared with ¥1.25 trillion in 2023. The decrease in annualized premiums in force in yen of 3.0% in 2024 was driven primarily by limited-pay products reaching premium paid-up status. Annualized premiums in force, translated into dollars at respective year-end exchange rates, were $7.6 billion in 2024, compared with $8.8 billion in 2023. As of December 31, 2024, Aflac Japan exceeded 22 million individual policies in force in Japan, with more than 14 million cancer policies in force in Japan.\nAflac Japan's investment portfolios include U.S. dollar-denominated securities and reverse dual-currency securities (yen-denominated debt securities with dollar coupon payments). In years when the yen strengthens in relation to the dollar, translating Aflac Japan's U.S. dollar-denominated investment income into yen lowers growth rates for net investment income, total adjusted revenues, and pretax adjusted earnings in yen terms. In years when the yen weakens, translating U.S. dollar-denominated investment income into yen magnifies growth rates for net investment income, total adjusted revenues, and pretax adjusted earnings in yen terms. \nThe following table illustrates the effect of translating Aflac Japan's U.S. dollar-denominated investment income and related items into yen by comparing certain segment results with those that would have been reported had foreign currency exchange rates remained unchanged from the prior year. Amounts excluding foreign currency impact on U.S. dollar-denominated investment income were determined using the average foreign currency exchange rate for the comparable prior year period. See non-U.S. GAAP financial measures defined above.\nAflac Japan Percentage Changes Over Prior Year\n(Yen Operating Results)\nFor the Years Ended December 31,\n  \nIncluding Foreign\nCurrency Changes\nExcluding Foreign\nCurrency Changes\n  \n2024\n2023\n2024\n2023\nAdjusted net investment income\n12.1\n \n%\n4.0 \n%\n6.5\n \n%\n(1.4)\n%\nTotal adjusted revenues\n(2.3)\n(3.6)\n(3.7)\n(4.8)\nPretax adjusted earnings\n15.5\n \n6.0 \n11.1\n \n1.8 \nThe following table presents a summary of operating ratios in yen terms for Aflac Japan for the years ended December 31 followed by a discussion of the significant drivers of changes in operating ratios in yen compared to the previous year.\nRatios to total adjusted revenues:\n2024\n2023\nTotal benefits and claims, net\n44.8\n \n%\n49.7 \n%\nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n3.3\n \n3.1 \nInsurance commissions\n4.5\n \n4.6 \nInsurance and other expenses\n11.3\n \n12.2 \nTotal adjusted expenses\n19.1\n \n19.8 \nPretax adjusted earnings\n36.0\n \n30.5 \nRatios to total premiums:\nTotal benefits and claims, net\n62.5\n \n%\n66.0 \n%\nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n4.6\n \n4.1 \n•\nIn 2024, the total benefits and claims to total premiums ratio decreased primarily due to a decrease in total benefits and claims resulting from reserve remeasurement gains related to assumption updates in the third quarter of 2024, partially offset by the decline in net earned premiums resulting from reinsurance activity, limited-pay products reaching premium paid-up status, and a deferred profit liability remeasurement loss.\n44\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \n•\nThe total adjusted expense ratio decreased in 2024 primarily due to the decrease in total adjusted expenses associated with reinsurance activity. \n•\nIn total, the pretax adjusted profit margin increased in 2024 primarily due to the decrease in total benefits and claims.\nThe following table presents Aflac Japan's premium persistency on a 12-month rolling basis as of December 31.\n2024\n2023\nPremium persistency\n93.4\n \n%\n93.4 \n%\nAflac Japan Sales\nThe following table presents Aflac Japan's new annualized premium sales for the years ended December 31.\n  \nIn Dollars\nIn Yen\n(In millions of dollars and billions of yen)\n2024\n2023\n2024\n2023\nNew annualized premium sales\n$\n422\n \n$\n432 \n¥\n64.1\n \n¥\n60.7\nIncrease (decrease) over prior period\n(2.2)\n%\n3.8 \n%\n5.6\n \n%\n10.9 \n%\nIn 2024, the increase in new annualized premium sales on a yen basis was primarily driven by sales of Aflac Japan's new life insurance product, \nTsumitasu\n, that was launched in June 2024 and offers an asset formation component and a nursing care option.\nThe following table details the contributions to Aflac Japan's new annualized premium sales by major insurance product for the years ended December 31.\n2024\n2023\nCancer\n57.5\n \n%\n64.1 \n%\nMedical and other health\n16.1\n \n20.6 \nLife insurance:\nTraditional life\n (1)\n23.0\n \n6.5 \nWAYS\n2.2\n \n6.8 \nChild endowment\n.2\n \n.4 \nOther\n1.0\n \n1.6 \n    Total\n100.0\n \n%\n100.0 \n%\n(1) \nIncludes term life, whole life and Tsumitasu\nThe foundation of Aflac Japan's product portfolio has been, and continues to be, third sector products, which include cancer, medical and other products. With continued cost pressure on Japan’s health care system, the Company expects the need for third sector products will continue to rise in the future and that the medical and cancer insurance products Aflac Japan provides will continue to be an important part of its product portfolio. Additionally, the Company believes that sales of first sector products, including \nTsumitasu\n, WAYS and Child Endowment, position Aflac Japan for potential future long-term sales opportunities by marketing these products to a younger demographic as well as potential cross-selling opportunities of Aflac Japan's third sector products.\nAflac Japan continues to promote digital and web-based sales to groups and use of its system that enables smart device-based insurance application by allowing the customer and an Aflac Japan operator to see the same screen through their smart devices. Further, Aflac Japan continues to utilize its virtual sales tool that enables online consultations and policy applications to be completed entirely online.\n45\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \nThe following table details the contributions to Aflac Japan's new annualized premium sales by agency type for the years ended December 31.\n2024\n2023\nIndependent corporate and individual\n48.2\n \n%\n46.7 \n%\nAffiliated corporate \n(1)\n48.6\n \n50.0 \nBank\n3.2\n \n3.3 \n    Total\n100.0\n \n%\n100.0 \n%\n(1) \nIncludes Japan Post Group, Dai-ichi Life and Daido Life\nIn 2024, Aflac Japan recruited 50 new sales agencies. At December 31, 2024, Aflac Japan was represented by approximately 6,600 sales agencies, with approximately 114,000 licensed sales associates employed by those agencies. The number of sales agencies has declined in recent years due to Aflac Japan's focus on supporting agencies with strong management frameworks, high productivity and more producing agents.\nAt December 31, 2024, Aflac Japan had agreements to sell its products at 360 banks, approximately 90% of the total number of banks in Japan.\nStrategic Alliance with Japan Post Holdings\nOn May 10, 2024, the Parent Company reported that the shares owned by the J&A Alliance Trust (Trust) represented, in aggregate, 20% of the voting power of the Parent Company's common stock. The Shareholders Agreement, entered into on February 28, 2019, by the Parent Company, Japan Post Holdings Co., Ltd., J&A Alliance Holdings Corporation, solely in its capacity as trustee of the Trust and General Incorporated Association J&A Alliance, provides voting restrictions that require the Trust to vote (i) all shares representing voting rights in excess of 20% of the voting rights in the Parent Company and (ii) all of its shares in connection with a change in control transaction, in each case, in a manner proportionally equal to votes of shares not beneficially owned by the Trust. Japan Post Holdings Co., Ltd. does not have a board seat on the Parent Company’s board of directors and does not have rights to control, manage or intervene in the management of the Parent Company. According to a Form 13F filed by Japan Post Holdings with the SEC on January 16, 2025, Japan Post Holdings owned 52.3 million Aflac Incorporated common shares as of December 31, 2024.\nAs previously reported, on December 19, 2018, the Parent Company and Aflac Japan entered into a Basic Agreement with Japan Post Holdings Co., Ltd., a Japanese corporation (Japan Post Holdings). Pursuant to the terms of the Basic Agreement, among other items, Japan Post Holdings and Aflac Japan agreed to reconfirm existing initiatives regarding cancer insurance and to consider new joint initiatives. In June 2021, the Parent Company, Aflac Japan and Japan Post Group agreed to pursue several specific initiatives toward building a \"'Co-creation Platform' to support customers and local communities,\" consistent with Japan Post Group's medium-term management plan announced in May 2021. The initiatives are directed at, among other items, the promotion of Aflac Japan cancer insurance, digital transformation within the Japan Post Group, and certain diversity efforts.\nOn May 1, 2023, the Parent Company filed a registration statement on Form S-3 that registered the sale of its common stock from time to time by J&A Alliance Holdings Corporation in its capacity as trustee of the Trust. The filing was made pursuant to a contractual requirement contained in the Shareholders Agreement. The Trust has agreed not to own more than the greater of 10% of the Parent Company’s outstanding shares or such shares representing 22.5% of the voting rights in the Parent Company.\nThe foregoing is subject to and qualified in its entirety by reference to the full text of the Basic Agreement, a copy of which is attached as Exhibit 10.1 to the Company’s Current Report on Form 8-K filed December 19, 2018, and the Shareholders Agreement, a copy of which is attached as Exhibit 10.50 to the Company’s Quarterly Report on Form 10-Q filed April 26, 2019, the terms of which exhibits are incorporated herein by reference. \nAflac Japan Investments\nThe level of investment income in yen is affected by available cash flow from operations, the timing of investing the cash flow, yields on new investments, the effect of yen/dollar exchange rates on U.S. dollar-denominated investment income, and other factors.\nAs part of the Company's portfolio management and asset allocation process, Aflac Japan invests in yen and U.S. dollar-denominated investments. Yen-denominated investments primarily consist of JGBs, public and private fixed maturity \n46\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \nsecurities and public equity securities. Aflac Japan's U.S. dollar-denominated investments include fixed maturity investments, loan receivables, and growth assets, including alternative investments in limited partnerships or similar investment vehicles. Aflac Japan invests in both publicly traded and privately originated U.S. dollar-denominated investment-grade and below-investment-grade fixed maturity securities and loan receivables, and has entered into foreign currency forwards and options to hedge the currency risk on the fair value of a portion of the U.S. dollar investments.\nThe following table details the investment purchases for Aflac Japan for the years ended December 31.\n(In millions)\n2024\n2023\nYen-denominated:\n  Fixed maturity securities:\n     Japan government and agencies\n$\n0\n \n$\n357 \n     Private placements\n131\n \n510 \n     Other fixed maturity securities\n290\n \n102 \n  Equity securities \n407\n \n346 \n  Commercial mortgage and other loans:\n      Other loans\n0\n \n77 \n  Other investments\n28\n \n16 \n        Total yen-denominated\n$\n856\n \n$\n1,408 \nU.S. dollar-denominated:\n  Fixed maturity securities:\n     Other fixed maturity securities\n$\n2,532\n \n$\n606 \n     Infrastructure debt\n291\n \n50 \n     Collateralized loan obligations\n30\n \n0 \n  Commercial mortgage and other loans:\n     Transitional real estate loans\n79\n \n247 \n     Middle market loans\n987\n \n446 \n     Other loans\n74\n \n0 \n  Other investments\n349\n \n393 \n        Total U.S. dollar-denominated\n$\n4,342\n \n$\n1,742 \nOther currencies:\nFixed maturity securities:\nInfrastructure debt\n$\n26\n \n$\n0 \nCommercial mortgage and other loans:\nOther loans\n47\n \n0 \nOther investments\n5\n \n0 \nTotal other currencies\n$\n78\n \n$\n0 \n            Total Aflac Japan purchases\n$\n5,276\n \n$\n3,150 \nSee the Investments section of this MD&A for further discussion of these investment programs, and see Notes 1, 3 and 4 of the Notes to the Consolidated Financial Statements for additional information regarding loans and loan receivables.\nFunds available for investment include cash flows from operations, investment income, and funds generated from maturities, redemptions, securities lending, and other securities transactions. Securities lending is also used from time to time to accelerate the availability of funds for investment. Purchases of securities from period to period are determined based on multiple objectives including appropriate portfolio diversification, the relative value of a potential investment and availability of investment opportunities, liquidity, credit and other risk factors while adhering to the Company's investment policy guidelines.\n47\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \nThe following table presents the results of Aflac Japan's investment yields for the years ended and as of December 31\n2024\n2023\nTotal purchases for the period (in millions) \n(1)\n$\n4,894\n \n$\n2,741 \nNew money yield \n(1),(2)\n6.11\n \n%\n5.18 \n%\nReturn on average invested assets \n(3)\n3.33\n \n2.90 \nPortfolio book yield, including U.S. dollar-denominated investments, \n  end of period \n(1),(2)\n3.22\n \n%\n3.18 \n%\n(1)\n \nIncludes fixed maturity securities, commercial mortgage and other loans, equity securities, and excludes alternative investments in limited partnerships\n(2)\n \nReported on a gross yield basis; excludes investment expenses, external management fees, and amortized hedge costs\n(3)\n \nNet of investment expenses and amortized hedge costs, year-to-date number reflected on a quarterly average basis\nThe increase in the Aflac Japan new money yield in 2024 was primarily due to higher allocations to higher yielding asset classes. \nSee Notes 3, 4 and 5 of the Notes to the Consolidated Financial Statements and the Investments and Hedging Activities sections of this MD&A for additional information on the Company's investments and hedging strategies.\nAFLAC U.S. SEGMENT\nAflac U.S. Pretax Adjusted Earnings\nChanges in Aflac U.S. pretax adjusted earnings and profit margins are primarily affected by morbidity, mortality, expenses, persistency and investment yields. The following table presents a summary of operating results for Aflac U.S. for the years ended December 31. \nAflac U.S. Summary of Operating Results\n \n(In millions)\n2024\n2023\nNet earned premiums\n$\n5,829\n \n$\n5,675 \nAdjusted net investment income \n(1)\n847\n \n820 \nOther income\n63\n \n128 \nTotal adjusted revenues\n6,739\n \n6,623 \nBenefits and claims:\nBenefits and claims, excluding reserve remeasurement\n2,821\n \n2,715 \nReserve remeasurement (gains) losses\n(95)\n(284)\nTotal benefits and claims, net\n2,726\n \n2,431 \nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n530\n \n490 \nInsurance commissions\n563\n \n561 \nInsurance and other expenses\n1,501\n \n1,640 \nTotal adjusted expenses\n2,594\n \n2,691 \nTotal benefits and adjusted expenses\n5,320\n \n5,122 \nPretax adjusted earnings\n$\n1,419\n \n$\n1,501 \nPercentage change over previous period:\nNet earned premiums\n2.7\n \n%\n1.9 \n%\nAdjusted net investment income\n3.3\n \n8.6 \nTotal adjusted revenues\n1.8\n \n2.1 \nTotal benefits and claims, net\n12.1\n \n(4.9)\nTotal adjusted expenses\n(3.6)\n4.6 \nPretax adjusted earnings\n(5.5)\n10.4 \n(1) \nNet interest income/expense from derivatives associated with certain investment strategies of $(36) and $(34) in 2024 and 2023, respectively, have been reclassified from net investment gains (losses) and included in adjusted earnings as a component of net investment income.\n48\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \nIn 2024, operating results compared to the previous year were as follows:\n•\nNet earned premiums increased primarily due to higher net earned premiums from growth initiatives including group life and disability and consumer markets businesses.\n•\nAdjusted net investment income increased primarily due to higher fixed rate income and higher variable income.\n•\nTotal adjusted revenues increased primarily due to the increase in both net earned premiums and adjusted net investment income.\n•\nTotal benefits and claims increased primarily due to a decrease of approximately $139 million in reserve remeasurement gains related to assumption updates in the third quarter of 2024 and higher incurred claims.\n•\nTotal adjusted expenses decreased primarily due to improved expense efficiency.\n•\nPretax adjusted earnings decreased primarily due to the increase in total benefits and claims, partially offset by the increase in total adjusted revenues and the decrease in total adjusted expenses.\nAnnualized premiums in force increased 3.6% in 2024 and 3.3% in 2023. Annualized premiums in force at December 31 were $6.4 billion in 2024, compared with $6.2 billion in 2023.\nThe following table presents a summary of operating ratios for Aflac U.S. for the years ended December 31 followed by a discussion of the significant drivers of changes in operating ratios compared to the previous year.\n \nRatios to total adjusted revenues:\n2024\n2023\nTotal benefits and claims\n40.5\n \n%\n36.7 \n%\nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n7.9\n \n7.4 \nInsurance commissions\n8.4\n \n8.5 \nInsurance and other expenses\n22.3\n \n24.8 \nTotal adjusted expenses\n38.5\n \n40.6 \nPretax adjusted earnings\n21.1\n \n22.7 \nRatios to total premiums:\nTotal benefits and claims\n46.8\n \n%\n42.8 \n%\nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n9.1\n \n8.6 \n•\nIn 2024, the total benefits and claims to total premiums ratio increased primarily due to the decrease in reserve remeasurement gains related to assumption updates in the third quarter of 2024 as well as higher incurred claims.\n•\nThe total adjusted expense ratio decreased in 2024 primarily due to expense efficiency efforts. \n•\nIn total, the pretax adjusted profit margin decreased in 2024 primarily due to the increase in total benefits and claims partially offset by higher total adjusted revenues and lower total adjusted expenses.\nThe following table presents premium persistency for Aflac U.S. on a 12-month rolling basis as of December 31.\n2024\n2023\nPremium persistency\n79.3\n \n%\n78.6 \n%\nAflac U.S. Sales\nThe following table presents Aflac's U.S. new annualized premium sales for the years ended December 31.\n(In millions)\n2024\n2023\nNew annualized premium sales\n$\n1,543\n \n$\n1,558 \nIncrease (decrease) over prior period\n(1.0)\n%\n5.0 \n%\nThe decrease in new annualized premium sales for Aflac U.S. in 2024 primarily reflects lower sales of group voluntary benefit products impacted by a continued focus on profitable growth, as well as softer sales of network dental.\n    \n49\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \nThe following table details the contributions to Aflac's U.S. new annualized premium sales by major insurance product category for the years ended December 31.\n2024\n2023\nAccident\n19.6\n \n%\n20.9 \n%\nDisability\n26.3\n \n25.6 \nCritical care \n(1)\n20.9\n \n20.7 \nHospital indemnity\n13.7\n \n14.5 \nDental/vision\n5.3\n \n6.3 \nLife\n14.2\n \n12.0 \nTotal\n100.0\n \n%\n100.0 \n%\n(1) \nIncludes cancer, critical illness and hospital intensive care products\nIn 2024, the Aflac U.S. sales force included an average of approximately 6,000 U.S. agents, including brokers, who were actively producing business on a weekly basis. The Company believes that this average weekly producer equivalent metric allows sales management to monitor progress and needs, as well as serve as a leading indicator of future production capacity. \nAflac U.S. Investments\nThe level of investment income is affected by available cash flow from operations, the timing of investing the cash flow, yields on new investments, and other factors. \nAs part of the Company's portfolio management and asset allocation process, Aflac U.S. invests in fixed maturity investments, loan receivables, and growth assets, including public equity securities and alternative investments in limited partnerships. Aflac U.S. invests in both publicly traded and privately originated investment-grade and below-investment-grade fixed maturity securities and loan receivables.\nThe following table details the investment purchases for Aflac U.S. as of December 31.\n(In millions)\n2024\n2023\nFixed maturity securities:\n     Other fixed maturity securities\n$\n654\n \n$\n587 \n     Infrastructure debt\n64\n \n83 \n     Collateralized loan obligations\n12\n \n0 \nEquity securities\n26\n \n11 \nCommercial mortgage and other loans:\n     Transitional real estate loans\n21\n \n78 \n     Commercial mortgage loans\n13\n \n33 \n     Middle market loans\n133\n \n85 \n     Other loans\n11\n \n30 \nOther investments\n39\n \n44 \n        Total Aflac U.S. Purchases\n$\n973\n \n$\n951 \nFunds available for investment include cash flows from operations, investment income, and funds generated from maturities, redemptions, and other securities transactions. Purchases of securities from period to period are determined based on multiple objectives, including appropriate portfolio diversification, the relative value of a potential investment and availability of investment opportunities, liquidity, credit and other risk factors while adhering to the Company's investment policy guidelines. \n50\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \nThe following table presents the results of Aflac's U.S. investment yields for the years ended and as of December 31.\n2024\n2023\nTotal purchases for period (in millions) \n(1)\n$\n934\n \n$\n907 \nNew money yield \n(1),(2)\n6.90\n \n%\n7.56 \n%\nReturn on average invested assets \n(3)\n5.00\n \n4.88 \nPortfolio book yield, end of period \n(1),(2)\n5.58\n \n%\n5.53 \n%\n(1) \nIncludes fixed maturity securities, commercial mortgage and other loans, equity securities, and excludes alternative investments in limited partnerships\n(2) \nReported on a gross yield basis; excludes investment expenses and external management fees\n(3)\n \nNet of investment expenses, year-to-date number reflected on a quarterly average basis\nThe decrease in the Aflac U.S. new money yield in 2024 was primarily due to higher allocations to lower yielding asset classes. See Note 3 of the Notes to the Consolidated Financial Statements and the Market Risks of Financial Instruments - Credit Risk subsection of Item 7A. for additional information regarding the sector concentrations of the Company's investments.\nCORPORATE AND OTHER \nChanges in the pretax adjusted earnings of Corporate and other are primarily affected by internal reinsurance activity and net investment income. The following table presents a summary of operating results for Corporate and other for the years ended December 31. \nCorporate and Other Summary of Operating Results\n(In millions)\n2024\n2023\nNet earned premiums\n$\n680\n \n$\n400 \nNet investment income (loss) \n(1)\n201\n \n(77)\nAmortized hedge income\n113\n \n121 \nAdjusted net investment income\n314\n \n44 \nOther income\n13\n \n15 \nTotal adjusted revenues\n1,007\n \n460 \nBenefits and claims:\nBenefits and claims, excluding reserve remeasurement\n426\n \n470 \nReserve remeasurement (gains) losses\n(19)\n(3)\nTotal benefits and claims, net\n407\n \n467 \nAdjusted expenses:\nInterest expense\n156\n \n144 \nOther adjusted expenses\n412\n \n273 \nTotal adjusted expenses\n568\n \n417 \nTotal benefits and adjusted expenses\n975\n \n885 \nPretax adjusted earnings\n$\n32\n \n$\n(425)\nPercentage change over previous period:\nNet earned premiums\n70.0\n \n%\n175.9 \n%\nAdjusted net investment income\n613.6\n \n(55.1)\nTotal adjusted revenues\n118.9\n \n72.3 \nTotal benefits and claims, net\n(12.8)\n231.2 \nTotal adjusted expenses\n36.2\n \n50.0 \nPretax adjusted earnings\n107.5\n \n(95.0)\n(1)\n The change in value of federal historic rehabilitation and solar investments in partnerships of $165 and $343 in 2024 and 2023, respectively, is included as a reduction to net investment income. Tax credits on these investments of $164 and $334 in 2024 and 2023, respectively, have been recorded as an income tax benefit in the consolidated statements of earnings. See Note 3 of the Notes to the Consolidated Financial Statements for additional information on these investments.\n51\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \nIn 2024, operating results compared to the previous year were as follows:\n•\nNet earned premiums increased primarily due to higher reinsurance activity resulting from agreements established in the fourth quarter of 2024 and 2023. \n•\nAdjusted net investment income increased primarily due to $178 million from a lower volume of federal historic rehabilitation and solar tax credit investments, with offsetting tax benefits recognized as a corresponding lower income tax expense, and higher Aflac Re consolidated investment income of $68 million primarily due to a higher volume of assets as part of the reinsurance agreements established in the fourth quarter of 2024 and 2023. \n•\nTotal adjusted revenues increased primarily due to higher net earned premiums and higher adjusted net investment income.\n•\nTotal benefits and claims decreased primarily due to the impact of $163 million in the fourth quarter of 2023 related to a novation agreement under which Aflac Re assumed the duties, obligations and liabilities through a reinsurance of business ALIJ previously ceded to an external reinsurer, which was partially offset by higher benefits from the reinsurance agreements established in the fourth quarter of 2024 and 2023.\n•\nTotal adjusted expenses increased primarily due to the higher reinsurance activity of $137 million and higher interest expense of $12 million.\n•\nPretax adjusted earnings increased primarily due to higher total adjusted revenues and lower total benefits and claims partially offset by higher total adjusted expenses.\nThe Parent Company invests in partnerships that specialize in rehabilitating historic structures or the installation of solar equipment in order to receive federal historic rehabilitation and solar tax credits. These investments are classified as limited partnerships and included in other investments in the consolidated balance sheets. The change in value of each investment is recorded as a reduction to net investment income. Tax credits generated by these investments are recorded as an income tax benefit in the consolidated statements of earnings. \nINVESTMENTS\nThe Company’s investment strategy utilizes disciplined asset and liability management while seeking long-term risk-adjusted investment returns and the delivery of stable income within regulatory and capital objectives, and preserving shareholder value. In attempting to optimally balance these objectives, the Company seeks to maintain on behalf of Aflac Japan a diversified portfolio of yen-denominated investment assets, a U.S. dollar-denominated investment portfolio hedged back to yen and a portfolio of unhedged U.S. dollar-denominated assets. As part of the Company's portfolio management and asset allocation process, Aflac U.S. invests in fixed maturity investments and growth assets, including public equity securities and alternative investments in limited partnerships. Aflac U.S. invests in both publicly traded and privately originated investment-grade and below-investment-grade fixed maturity securities and loans.  \nFor additional information concerning the Company's investments, see Notes 3, 4, and 5 of the Notes to the Consolidated Financial Statements.\n52\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \nThe following tables detail investments by segment as of December 31.\nInvestment Securities by Segment \n2024\n(In millions)\nAflac Japan\nAflac U.S.\nCorporate and Other\n \nTotal\nAvailable-for-sale, fixed maturity securities, \n   at fair value\n$\n45,970\n \n$\n12,296\n \n$\n7,003\n \n$\n65,269\n \nHeld-to-maturity, fixed maturity securities, \n   at amortized cost \n(1)\n15,966\n \n0\n \n0\n \n15,966\n \nEquity securities\n458\n \n2\n \n336\n \n796\n \nCommercial mortgage and other loans: \n(1)\nTransitional real estate loans\n3,648\n \n866\n \n189\n \n4,703\n \nCommercial mortgage loans\n915\n \n608\n \n0\n \n1,523\n \nMiddle market loans\n3,847\n \n436\n \n0\n \n4,283\n \nOther loans\n284\n \n61\n \n15\n \n360\n \nOther investments:\nPolicy loans\n168\n \n35\n \n0\n \n203\n \nShort-term investments \n(2)\n484\n \n366\n \n749\n \n1,599\n \nLimited partnerships\n2,861\n \n306\n \n268\n \n3,435\n \nReal estate owned\n570\n \n112\n \n0\n \n682\n \nOther\n0\n \n39\n \n0\n \n39\n \nInvestment in affiliate \n(3)\n0\n \n638\n \n(638)\n0\n \n     Total investments\n75,171\n \n15,765\n \n7,922\n \n98,858\n \nCash and cash equivalents\n2,062\n \n1,010\n \n3,157\n \n6,229\n \n              Total investments and cash\n$\n77,233\n \n$\n16,775\n \n$\n11,079\n \n$\n105,087\n \n(1) \nNet of allowance for credit losses\n(2) \nIncludes securities lending collateral\n(3)\n For consolidated reporting, Aflac U.S.'s investment in Aflac Re is eliminated in Corporate and other \n53\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \n2023\n(In millions)\nAflac Japan\nAflac U.S.\nCorporate and Other\n \nTotal\nAvailable-for-sale, fixed maturity securities, \n   at fair value\n$\n54,983 \n$\n12,884 \n$\n5,423 \n$\n73,290 \nHeld-to-maturity, fixed maturity securities, \n   at amortized cost \n(1)\n17,819 \n0 \n0 \n17,819 \nEquity securities\n720 \n2 \n366 \n1,088 \nCommercial mortgage and other loans: \n(1)\nTransitional real estate loans \n4,795 \n1,011 \n192 \n5,998 \nCommercial mortgage loans\n1,075 \n622 \n0 \n1,697 \nMiddle market loans\n4,095 \n436 \n0 \n4,531 \nOther loans\n185 \n101 \n15 \n301 \nOther investments:\nPolicy loans\n186 \n28 \n0 \n214 \nShort-term investments \n(2)\n347 \n204 \n753 \n1,304 \nLimited partnerships\n2,360 \n258 \n132 \n2,750 \nReal estate owned\n180 \n47 \n0 \n227 \nOther\n0 \n35 \n0 \n35 \nInvestment in affiliate \n(3)\n0 \n439 \n(439)\n0 \n     Total investments\n86,745 \n16,067 \n6,442 \n109,254 \nCash and cash equivalents\n1,861 \n651 \n1,794 \n4,306 \n              Total investments and cash\n$\n88,606 \n$\n16,718 \n$\n8,236 \n$\n113,560 \n(1) \nNet of allowance for credit losses\n(2) \nIncludes securities lending collateral\n(3)\n For consolidated reporting, Aflac U.S.'s investment in Aflac Re is eliminated in Corporate and other\n \nThe Company has invested in a variety of commercial mortgage loans (CMLs) and other loans including transitional real estate loans (TREs). The Company's TRE and CML investments are collateralized by commercial real estate, including some office properties. The Company considers these investments to be well diversified by geography and among property types. Further, the Company believes that the portfolio is generally well positioned with exposures concentrated in high quality underlying properties with institutional investors who are experienced in managing their assets during periods of market volatility.\nWhile generally resilient, the Company's investments in TREs and CMLs have been affected by conditions in the commercial real estate market, with a greater impact on mortgages secured by office properties. The Company invested in certain TREs and CMLs that are currently in default of interest or maturity payments. The Company works with the affected borrowers to resolve specific situations through loan continuance with potential modifications, through loan sales, or through the process of foreclosure or deed in lieu of foreclosure. Since the third quarter of 2023, the Company has taken possession, through foreclosure or deed in lieu of foreclosure, of certain commercial real estate properties, which secured defaulted loans. Properties acquired by the Company through foreclosure and deed in lieu of foreclosure are reported as real estate owned (REO) in other investments in the Company's consolidated balance sheets. \nIn 2024, the Company completed foreclosure or deed in lieu of foreclosure on TREs collateralized with commercial real estate properties with an amortized cost of $502 million. As a result of the amortized cost of the TREs exceeding the estimated fair value of the collateral upon consummating the foreclosures or deed in lieu of foreclosure transactions, the Company recognized a net loss of $34 million in net investment gains (losses) for the year ended December 31, 2024. In 2023, the Company completed foreclosure or deed in lieu of foreclosure on TREs collateralized with commercial real estate properties with an amortized cost of $284 million. As a result of the amortized cost of the TREs exceeding the estimated fair value of the collateral upon consummating the foreclosures or deed in lieu of foreclosure transactions, the Company recognized a net loss of $66 million in net investment gains (losses) for the year ended December 31, 2023.\n54\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \nThe Company utilizes third-party asset managers to source, underwrite and manage each loan, as well as any resulting REO. The Company closely monitors the activities of these managers. In the event that a loan workout is necessary, the Company believes these external managers have the experience and resources to manage the process to maximize recovery.\nThe Company also monitors its commercial mortgage and other loan investments internally on an ongoing basis, including a review of loans' credit quality indicators and payment status as current, past due, restructured or under foreclosure. See Note 3 of the Notes to the Consolidated Financial Statements for further information concerning credit quality indicators, information on loans that are on nonaccrual status, and REO obtained through foreclosure or deed in lieu of foreclosure. See also Part I,"
}