{
  "ticker": "ALB",
  "cik": "0000915913",
  "company_name": "ALBEMARLE CORP",
  "filing_date": "2025-02-12",
  "accession": "0000915913-25-000026",
  "primary_doc": "alb-20241231.htm",
  "item1_text": "Item 1. Business. Our significant manufacturing presence and sales activities in the E.U. require significant compliance costs and may result in increases in the costs of raw materials we purchase and the products we sell. Increases in the costs of our products could result in a decrease in their overall demand; additionally, customers may seek products with lower regulatory compliance requirements, which could also result in a decrease in the demand of certain products subject to the REACH regulations.\nThe U.S. Toxic Substances Control Act (TSCA) requires chemicals to be assessed against a risk-based safety standard and calls for the elimination of unreasonable risks identified during risk evaluation. This regulation and other pending initiatives at the U.S. state level, as well as initiatives in Canada, Asia and other regions, could potentially require toxicological testing and risk assessments of a wide variety of chemicals, including chemicals used or produced by us. These assessments may result in heightened concerns about the chemicals involved and additional requirements being placed on the production, handling, labeling or use of the subject chemicals. Such concerns and additional requirements could also increase the cost incurred by our customers to use our chemical products and otherwise limit the use of these products, which could lead to a decrease in demand for these products. Such a decrease in demand could have an adverse impact on our business and results of operations.\nWe could be subject to damages based on claims brought against us by our customers or lose customers as a result of the failure of our products to meet certain quality specifications.\nOur products enable important performance attributes of our customers’ products. If a product fails to perform in a manner consistent with quality specifications or has a shorter useful life than guaranteed, a customer of ours could seek the replacement of the product or damages for costs incurred as a result of the product failing to perform as guaranteed. These risks apply to our refinery catalysts in particular because, in certain instances, we sell our refinery catalysts under agreements that contain limited performance and life cycle guarantees. Also, because many of our products are integrated into our customers’ products, we may be requested to participate in, or fund in whole or in part the costs of, a product recall conducted by a customer. For example, some of our businesses supply products to customers in the automotive industry. In the event one of these customers conducts a product recall that it believes is related to one of our products, we may be asked to participate in, or fund in whole or in part, such a recall.\nOur customers often require our subsidiaries to represent that our products conform to certain product specifications provided by our customers. Any failure to comply with such specifications could result in claims or legal action against us. \nA successful claim or series of claims against us could have a material adverse effect on our financial condition and results of operations and could result in our loss of one or more customers.\nOur business is subject to hazards common to chemical and natural resource extraction businesses, any of which could injure our employees or other persons, damage our facilities or other properties, interrupt our production and adversely affect our reputation and results of operations.\nOur business is subject to hazards common to chemical manufacturing, storage, handling and transportation, as well as natural resource extraction, including explosions, fires, severe weather, natural disasters, mechanical failure, unscheduled downtime, transportation interruptions, remediation, chemical spills, discharges or releases of toxic or hazardous substances or gases and other risks. These hazards can cause personal injury and loss of life to our employees and other persons, severe damage to, or destruction of, property and equipment and environmental contamination. In addition, the occurrence of disruptions, shutdowns or other material operating problems at our facilities due to any of these hazards may diminish our ability to meet our output goals. Accordingly, these hazards and their consequences could adversely affect our reputation and have a material adverse effect on our operations as a whole, including our results of operations and cash flows, both during and after the period of operational difficulties.\n16\nAlbemarle Corporation and Subsidiaries\nOur business could be adversely affected by environmental, health and safety laws and regulations.\nThe nature of our business, including historical operations at our current and former facilities, exposes us to risks of liability under environmental laws and regulations due to the production, storage, use, transportation and sale of materials that can cause contamination or personal injury if released into the environment. In the jurisdictions in which we operate, we are subject to numerous U.S. and non-U.S. national, federal, state and local environmental, health and safety laws and regulations, including those governing the discharge of pollutants into the air and water, the management and disposal of hazardous substances and wastes and the cleanup of contaminated properties. We currently use, and in the past have used, hazardous substances at many of our facilities, and we have in the past been, and may in the future be, subject to claims relating to exposure to hazardous materials. We also have generated, and continue to generate, hazardous wastes at a number of our facilities. Some of our facilities also have lengthy histories of manufacturing or other activities that may have resulted in site contamination. Liabilities associated with the investigation and cleanup of hazardous substances, as well as personal injury, property damages or natural resource damages arising from the release of, or exposure to, such hazardous substances, may be imposed in many situations without regard to violations of laws or regulations or other fault, and may also be imposed jointly and severally (so that a responsible party may be held liable for more than its share of the losses involved, or even the entire loss). Such liabilities may also be imposed on many different entities, including, for example, current and prior property owners or operators, as well as entities that arranged for the disposal of the hazardous substances. Such liabilities may be material and can be difficult to identify or quantify.\nFurther, some of the raw materials we handle are subject to government regulation. These regulations affect the manufacturing processes, handling, uses and applications of our products. In addition, our production facilities and a number of our distribution centers require numerous operating permits. Due to the nature of these requirements and changes in our operations, our operations may exceed limits under permits or we may not have the proper permits to conduct our operations. Ongoing compliance with such laws, regulations and permits is an important consideration for us and we incur substantial capital and operating costs in our compliance efforts.\nCompliance with environmental laws generally increases the costs of manufacturing, registration/approval requirements, transportation and storage of raw materials and finished products, and storage and disposal of wastes, and could have a material adverse effect on our results of operations. For example, we may be subject to carbon pricing or taxation proposals in some jurisdictions where we operate. We may incur substantial costs, including fines, damages, criminal or civil sanctions and remediation costs, or experience interruptions in our operations, for violations arising under these laws or permit requirements. Additional information may arise in the future concerning the nature or extent of our liability with respect to identified sites, and additional sites may be identified for which we are alleged to be liable, that could cause us to materially increase our environmental accrual or the upper range of the costs we believe we could reasonably incur for such matters. Furthermore, environmental laws are subject to change and have become increasingly stringent in recent years. We expect this trend to continue and to require materially increased capital expenditures and operating and compliance costs.\nCertain of our operations could be adversely affected by local communities and/or other stakeholders.\nRelationships with local communities and other stakeholders may impact our operations, particularly in Chile and Western Australia. We may become impacted by the interests of local communities and other stakeholders, including in some cases, indigenous peoples. Certain of these communities or other stakeholders may have or may develop interests or objectives which are different from, or even in conflict with, our objectives, including the use of our lands and waterways near our operations. Our relationships with the communities near our sites and other stakeholders are critical to the future success of our sites, as well as at any future development. There is an increasing level of public concern relating to the perceived effect of mining activities on the environment and on communities impacted by such activities. Publicity adverse to our operations, or the mining industry generally, could have an adverse effect on our development plans or future operations and may impact relationships with the communities in which we ultimately operate and other associated stakeholders.\nWe may in the future, be subject to disputes with local communities, including indigenous peoples, regarding the use of certain aspects of our assets, facilities and land and may in the future, be required to enter into settlement agreements providing for such use, on terms that include, among others, lump sum payments, royalty payments or restrictions on our business.\nIn addition, disputes surrounding indigenous land claims regarding lands on or near our operations could interfere with future operations and/or result in additional operating costs or restrictions, as well as adversely impact the use and enjoyment of our real property rights with respect to our assets.\nWhile we are committed to operating in a socially responsible manner, there can be no assurance that our efforts in this respect will mitigate this potential risk. All the foregoing could have a material adverse effect on our business, financial \n17\nAlbemarle Corporation and Subsidiaries\ncondition and results of operations, including, but not limited to, as a result of increased costs, reduced revenues, diversion of management attention, reputational harm, disruptions to our operations and other reasons.\nWe may be subject to indemnity claims and liable for other payments relating to properties or businesses we have divested. \nIn connection with the sale of certain properties and businesses, we have agreed to indemnify the purchasers of such properties for certain types of matters, such as certain breaches of representations and warranties, taxes and certain environmental matters. With respect to environmental matters, the discovery of contamination arising from properties that we have divested may expose us to indemnity obligations under the sale agreements with the buyers of such properties or cleanup obligations and other damages under applicable environmental laws. We may not have insurance coverage for such indemnity obligations or cash flows to make such indemnity or other payments. Further, we cannot predict the nature of and the amount of any indemnity or other obligations we may have to the applicable purchaser. Such payments may be costly and may adversely affect our financial condition and results of operations. For example, in 2021, we agreed to pay $665 million to settle claims related to a legacy Rockwood Holdings, Inc. (“Rockwood”) business sold to a third party prior to our acquisition of Rockwood in 2015.\nAt several of our properties where hazardous substances are known to exist (including some sites where hazardous substances are being investigated or remediated), we believe we are entitled to contractual indemnification from one or more former owners or operators; however, in the event we make a claim, the indemnifier may disagree with us regarding, or not have the financial capacity to fulfill, its indemnity obligation. If our contractual indemnity is not upheld or effective, our accrual and/or our costs for the investigation and cleanup of hazardous substances could increase materially.\nWe could be adversely affected by violations of the U.S. Foreign Corrupt Practices Act and similar foreign anti-corruption laws, and in the past have paid fines in order to resolve self-reported potential violations of such laws.\nThe U.S. Foreign Corrupt Practices Act (the “FCPA”) and similar foreign anti-corruption laws in other jurisdictions around the world generally prohibit companies and their intermediaries from making improper payments or providing anything of value to non-U.S. government officials for the purpose of obtaining or retaining business or securing an unfair advantage. We operate in some parts of the world that have experienced governmental corruption to some degree, and, in certain circumstances, strict compliance with anti-bribery laws may conflict with local customs and practices. Although we have established formal policies or procedures for prohibiting or monitoring this conduct, we cannot assure you that our employees or other agents will not engage in such conduct for which we might be held responsible. In the event that we believe or have reason to believe that our employees, agents or distributors have or may have violated applicable anti-corruption laws, including the FCPA, we may be required to investigate or have outside counsel investigate the relevant facts and circumstances, which can be expensive and require significant time and attention from senior management. If we are found to be liable for violations of the FCPA or other applicable anti-corruption laws (either due to our own acts or our inadvertence, or due to the acts or inadvertence of others, including employees of our joint ventures), we could suffer from civil and criminal penalties or other sanctions, which could have a material adverse effect on our business and results of operations.\nIn September 2023, following an internal investigation and voluntary self-reporting of potential violations of the FCPA, we finalized agreements with the U.S. Department of Justice (“DOJ”) and the SEC relative to improper payments made, prior to 2018, by third-party sales representatives of our Refining Solutions business (now Ketjen).  In connection with this resolution, we entered into a non-prosecution agreement with the DOJ and an administrative resolution with the SEC, pursuant to which we paid a total of $218.5 million in aggregate fines, disgorgement, and prejudgment interest. We also agreed to certain ongoing compliance reporting obligations.\nWe are subject to extensive foreign government regulation that can negatively impact our business.\nWe are subject to government regulation in non-U.S. jurisdictions in which we conduct our business. The requirements for compliance with these laws and regulations may be unclear or indeterminate and may involve significant costs, including additional capital expenditures or increased operating expenses, or require changes in business practice, in each case that could result in reduced profitability for our business. Our having to comply with these foreign laws or regulations may provide a competitive advantage to competitors who are not subject to comparable restrictions or prevent us from taking advantage of growth opportunities. Determination of noncompliance can result in penalties or sanctions that could also adversely impact our operating results and financial condition.\nOur inability to protect our intellectual property rights, or being accused of infringing on intellectual property rights of third parties,\n \ncould have a material adverse effect on our business, financial condition and results of operations.\nProtection of our proprietary processes, methods and compounds and other technology is important to our business. We generally rely on patent, trade secret, trademark and copyright laws of the U.S. and certain other countries in which our \n18\nAlbemarle Corporation and Subsidiaries\nproducts are produced or sold, as well as licenses and nondisclosure and confidentiality agreements, to protect our intellectual property rights. The patent, trade secret, trademark and copyright laws of some countries, or their enforcement, may not protect our intellectual property rights to the same extent as the laws of the U.S. Failure to protect our intellectual property rights may result in the loss of valuable proprietary technologies. Additionally, some of our technologies are not covered by any patent or patent application and, even if a patent application has been filed, it may not result in an issued patent. If patents are issued to us, those patents may not provide meaningful protection against competitors or against competitive technologies. We cannot assure you that our intellectual property rights will not be challenged, invalidated, circumvented or rendered unenforceable.\nWe also conduct research and development activities with third parties and license certain intellectual property rights from third parties and we plan to continue to do so in the future. We endeavor to license or otherwise obtain intellectual property rights on terms favorable to us. However, we may not be able to license or otherwise obtain intellectual property rights on such terms or at all. Our inability to license or otherwise obtain such intellectual property rights could have a material adverse effect on our ability to create a competitive advantage and create innovative solutions for our customers, which will adversely affect our net sales and our relationships with our customers.\nWe could face patent infringement claims from our competitors or others alleging that our processes or products infringe on their proprietary technologies. If we are found to be infringing on the proprietary technology of others, we may be liable for damages and we may be required to change our processes, redesign our products partially or completely, pay to use the technology of others, stop using certain technologies or stop producing the infringing product entirely. Even if we ultimately prevail in an infringement suit, the existence of the suit could prompt customers to switch to products that are not the subject of infringement suits. We may not prevail in intellectual property litigation and such litigation may result in significant legal costs or otherwise impede our ability to produce and distribute key products.\nWe also rely upon unpatented proprietary manufacturing expertise, continuing technological innovation and other trade secrets to develop and maintain our competitive position. While we generally enter into confidentiality agreements with our employees and third parties to protect our intellectual property, we cannot assure you that our confidentiality agreements will not be breached, that they will provide meaningful protection for our trade secrets and proprietary manufacturing expertise or that adequate remedies will be available in the event of an unauthorized use or disclosure of our trade secrets or manufacturing expertise. In addition, our trade secrets and know-how may be improperly obtained by other means, such as a breach of our information technologies security systems or direct theft.\nOur inability to acquire or develop additional lithium reserves that are economically viable could have a material adverse effect on our future profitability.\nOur lithium reserves will, without acquiring or developing additional reserves, decline as we continue to extract these raw materials. Accordingly, our future profitability depends upon our ability to operate in a way that optimizes extraction of raw materials from the reserves we have and acquire additional lithium reserves that are economically viable to replace the reserves we will extract. Exploration and development of lithium resources are highly speculative in nature. Exploration projects involve many risks, require substantial expenditures and may not result in the discovery of sufficient additional resources that can be extracted profitably. Once a site with potential resources is discovered, it may take several years of development until production is possible, during which time the economic viability of production may change. Substantial expenditures are required to establish recoverable proven and probable reserves and to construct extraction and production facilities. As a result, there is no assurance that current or future exploration programs will be successful and there is a risk that depletion of reserves will not be offset by discoveries or acquisitions. \nWe utilize feasibility studies to estimate the anticipated economic returns of an exploration project. The actual project profitability or economic feasibility may differ from such estimates as a result of factors such as, but not limited to, changes in volumes, grades and characteristics of resources to be mined and processed; changes in labor costs or availability of adequate and skilled labor force; the quality of the data on which engineering assumptions were made; adverse geotechnical conditions; availability, supply and cost of water and power; fluctuations in inflation and currency exchange rates; delays in obtaining environmental or other government permits or approvals or changes in the laws and regulations related to our operations or project development; changes in royalty agreements, laws and/or regulations around royalties and other taxes; and weather or severe climate impacts.\nFor our existing operations, we utilize geological, hydrogeological and metallurgical assumptions, financial projections and price estimates. These estimates are periodically updated to reflect changes in our operations, including modifications to our proven and probable reserves and mineralized material, revisions to environmental obligations, changes in legislation and/or social, political or economic environment, and other significant events associated with natural resource extraction operations. There are numerous uncertainties inherent in estimating quantities and qualities of lithium and costs to extract recoverable \n19\nAlbemarle Corporation and Subsidiaries\nreserves, including many factors beyond our control, that could cause results to differ materially from expected financial and operating results or result in future impairment charges. In addition, it cannot be assumed that any part or all of the inferred mineral resources will ever be converted into mineral reserves, as defined by the SEC. See"
}