{
  "ticker": "ALGN",
  "cik": "0001097149",
  "company_name": "ALIGN TECHNOLOGY INC",
  "filing_date": "2025-02-28",
  "accession": "0001097149-25-000012",
  "primary_doc": "algn-20241231.htm",
  "item1_text": "Item 1A.  Risk Factors. \nOur business, reputation, results of operations, financial condition, cash flows and stock price can be affected by a number of factors, whether currently known or unknown, or that we currently believe to be immaterial. including those described below. When any one or more of these risks materialize from time to time, our business, reputation, results of operations, financial condition, cash flows and stock price can be materially and adversely affected. The risks below are not the only ones we face. Because of the following factors, as well as other factors affecting our results of operations and financial condition, past financial performance should not be considered to be a reliable indicator of future performance, and investors should not use historical trends to anticipate results or trends in future periods. Therefore, you should review this section carefully, as well as our consolidated financial statements and notes thereto and other information appearing in this Annual Report on Form 10-K, for important information regarding these and other risks that may affect us. Additionally, you should consider these risk factors in connection with evaluating the forward-looking statements contained in this Annual Report on Form 10-K. \nMacroeconomic and External Risks\nOur business, financial condition and results of operations depend on global and regional economic conditions. Inflation, fluctuations in foreign currency exchange rates, changes in consumer confidence and demand, general economic weakness and actual or potential slowdowns or recessions have and could in the future materially affect our business, financial condition, and results of operations.\nMacroeconomic conditions impact consumer confidence and discretionary spending, which can adversely affect demand for our products. Consumer spending habits are affected by, among other things, inflation, fluctuations in foreign currency exchange rates, consumer confidence, general economic weakness, actual or potential slowdowns or recessions, pandemics, wars and military actions, employment levels, wages, debt obligations, discretionary income, interest rates, volatility in capital and perceptions of current and future economic conditions. Macroeconomic conditions can, among other things, reduce or shift spending away from elective procedures, drive patients to pursue less costly orthodontic treatments, decrease the number of orthodontic case starts, reduce patient traffic in dentists’ offices, or reduce demand for dental services generally. Further, decreased demand for dental services can cause dentists and labs to postpone investments in capital equipment, such as intraoral scanners and CAD/CAM equipment and software. The declines in, or uncertain economic outlooks for, the United States, Chinese, European and certain other international economies have and could in the future materially adversely affect consumer and dental practice spending. Increases in the cost of fuel and energy, food and other essential items as well as higher interest \n20\nrates have and could in the future reduce consumers’ disposable income, which could cause a decrease in discretionary spending for our products.  \nInflation has and may continue to adversely impact spending and trade activities, and may unpredictably impact global and regional economies. Efforts by central banks and federal, state and local governments to combat inflation could result in an economic recession or slowdown or adversely impact consumer spending for a prolonged period of time. Higher inflation has and may continue to increase domestic and international shipping costs, raw material prices and labor rates, which could  adversely impact the costs of producing, procuring and shipping our products. Our products or one or more of the materials or components of our products may also be subject to tariffs imposed by the United States or other countries. We may not be able to fully mitigate the impact of the increased costs or pass price increases on to our customers, resulting in downward pressure on our operating results. Attempts to offset cost increases with price increases may reduce sales, increase customer dissatisfaction or otherwise harm our reputation. Any of these events could materially affect our business, financial condition or results of operations.\nWe have significant international operations and sales and are therefore exposed to fluctuations in foreign currencies that have and may continue to adversely impact our business, financial condition or results of operations. Although the U.S. dollar is our reporting currency, a large portion of our net revenues and expenses are generated in foreign currencies. While we forecast our balance sheet exposures to foreign currency fluctuations and utilize foreign currency forward contracts to moderate the impact of exchange rate fluctuations on certain assets and liabilities, these contracts may not eliminate our exposure to fluctuations in foreign currency. Currency exchange rate fluctuations have and may continue to materially adversely affect our results of operations and cash flows. \nOur business, financial condition and results of operations could be impacted by geopolitical events, tariffs, trade and international disputes, wars, military actions and terrorism, or major public health crises\n.\nGeopolitical events, tariffs, trade and international disputes, wars, military actions and terrorism, or major public health crises have and could in the future harm or disrupt international commerce and the global economy, and could materially adversely affect our business with our customers and consumers, suppliers, contract manufacturers, distributors and other business partners. Such events have and could result in, among other things, supply chain and trade disruptions, changes in diplomatic and trade relationships, new tariffs and retaliatory tariffs, trade protection measures, trade sanctions, customs inquiries or restrictions, boycotts, reduced consumer spending, government shut downs, cyberattacks, energy shortages or power outages, energy rationing that adversely impacts our manufacturing facilities, rising fuel or rising costs of producing, procuring, and shipping our products, constraints, volatility or disruption in the financial markets, deaths or injuries to our employees, restrictions and shortages of food, water, shelter and medical supplies, \ndata or information exchange, disruptions, \ninterruptions or limitations in telecommunication services, critical systems or applications reliant on a stable and uninterrupted communications infrastructure, and protests that may impact delivery of our products to customers or destruction of property.\nTariffs or proposed tariffs, such as those on Chinese, Mexican, Canadian or other foreign goods, and any retaliatory trade measures in response may increase the cost of our products and the components and raw materials used to make them. Specifically, we manufacture clear aligners in our facility in Mexico and ship them to the United States, primarily for our United States customers with the remainder eventually shipping to other international locations. Tariffs would result in additional costs for our products, which may impact operating margin, reduce demand for our products and adversely impact our gross margin. Foreign countries may also adopt or rescind other measures, such as controls on the import or export of goods, technology or data, including personal data, that could adversely impact our operations and supply chains or limit our ability to offer certain products and services. These measures could require us to take various actions, including changing suppliers, where we manufacture our products, or restructuring business relationships. Complying with new or revised trade restrictions may be expensive, time-consuming, disruptive to our logistics and operations, and more costly for us and our customers. Such restrictions may be announced with little or no advance notice and we may be unable to effectively mitigate any adverse impacts in a timely manner or at all. \nMilitary conflicts \nhave and may in the future\n materially adversely impact the economies in which we operate.\n Our iTero operations, headquartered in Israel, are close to areas that have been affected by ongoing violence and military action, which may impact our employees and our iTero business and operations. Some employees and consultants in Israel have been called for military service in the current conflict and they may be absent for certain periods of time. Furthermore, our facilities may be damaged or our manufacturing capability or delivery schedules may be impacted as a result of the ongoing conflict. Our supply chains and demand for our products could be impaired as a result of hostilities, export and import restrictions, sanctions or boycotts. These events could disrupt ongoing operations and may materially impact the logistics, timing and cost of shipping of our products and materials or our ability to operate out of impacted areas. Additionally, China’s territorial conflicts with other neighboring countries may impact our operations and sales in China. We cannot predict the progress or outcome of these events or the reactions by governments, businesses or consumers and each event could, individually or in the aggregate, materially adversely affect our business, financial condition, and results of operations.\nOur operations may be impacted by natural disasters, which may become more frequent or severe as a result of climate change, and may adversely impact our business, financial condition and results of operations, as well as those of our customers and consumers, suppliers, contract manufacturers, distributors and other business partners.\n21\nNatural disasters such as earthquakes, tsunamis, floods, droughts, hurricanes, wildfires, urban fires and extreme weather conditions can cause deaths, injuries and major public health crises, power outages, property damage, restrictions and shortages of food, water, shelter and medical supplies, telecommunications failures, materials scarcity, price volatility and other adverse consequences. If a natural disaster occurs in a region where one of our facilities or those of our customers or suppliers are located, our or their employees or facilities could be impacted, valuable research could be lost, and our ability to create treatment plans, respond to customer inquiries or manufacture and ship our products could be compromised, causing significant delays and reputational harm. Climate change could increase the frequency and severity of natural disasters and could change the supply, demand or availability of sources of energy or resources material to manufacturing our products and operations. It could also affect the availability or cost of materials, goods, and services on which we and our suppliers, contract manufacturers, distributors and other business partners rely, which could materially adversely impact our business, financial condition and results of operations. \nBusiness and Industry Risks\nDemand for our products and services may not increase or may decrease for many reasons, including resistance to the innovative and business-model-disruptive nature of some of our products and services, which could have a material impact on our business, financial condition and results of operations.\nOur products and services require our customers and consumers to forego traditional treatment methods. For example, Invisalign treatment is a significant departure from traditional orthodontic wires and brackets, and our customers and consumers may not find it cost-effective or preferable. A number of dental professionals believe Invisalign treatment is only appropriate for a limited percentage of patients. Additionally, our clear aligners and iTero products utilize digital technology and some dental professionals have and may continue to resist moving to a digital platform. Increased acceptance of our products and services depends in part on the recommendations of dental professionals, professional associations, societies and organizations, as well as other factors, including efficacy, safety, ease of use, reliability, aesthetics, third-party reimbursement and price compared to competing products and traditional treatment methods. If demand for our products or services fails to increase, or decreases, our business, financial condition and results of operations may be materially adversely affected.\nOur net revenues depend primarily on sales of the Invisalign System and iTero intraoral scanners and declines in sales or the average selling price (“ASP”) of these products may adversely affect net revenues, gross profit, and net income.\nOur net revenues are primarily dependent on sales of the Invisalign System an\nd iTero intraoral scanners. Of the two, we expect the Invisalign System to continue to represent the majority of our net revenues, making \nsales of it critical to our success. \nThe ASPs of our products, particularly the Invisalign System, are influenced by numerous factors, including the mix of product treatment packages, geographical mix, channel mix and timing of products sold (particularly the timing and quantity of orders for additional clear aligners for certain Invisalign products) and foreign currency exchange rates. In addition, we sell our products at different prices and with varying shipping and handling charges or processing fees that may differ by country. Our ASPs for the Invisalign System and iTero intraoral scanners have been and could in the future be adversely affected if: \n•\nwe offer promotions or general or volume-based discount programs, product or services bundles, large account sales or consumer rebate programs;\n•\nparticipation in promotions or programs unexpectedly increases, decreases or changes demand in material ways; \n•\nour geographic, channel or product mix shifts to lower-priced products or to products with a higher percentage of deferred revenue;\n•\nwe decrease prices or are unable to increase prices on one or more products or services in response to increasing competitive pricing pressures;\n•\nwe introduce new or change existing products or services, or modify how we market or sell any of our new or existing products or services;\n•\nwe modify our pricing strategies for certain products or adjust pricing for certain items based on cancellation fees, shipping and handling charges or processing fees;\n•\nwe participate in government tenders, such as volume-based procurement in China; or\n•\nour critical accounting estimates materially differ from actual results. \nTo stimulate product and services demand, we have a history of offering volume discounts, price reductions, and other promotions to targeted customers and consumers and releasing lower priced products. These promotional campaigns and lower-priced products have had, and may in the future have, unexpected and unintended consequences, including reduced net revenues, gross margins, operating margin and net income, ASPs and volume.\nCompetition in the markets for our products and services is increasing and we expect aggressive competition from existing competitors, other companies that introduce new technologies, products or services in the future, and customers who alone or with others create orthodontic appliances and solutions or other products or services that compete with us.\nThe dental industry is experiencing immense and rapid digital transformation. While solutions such as the Invisalign System, iTero intraoral scanners, CAD/CAM software and digital platform facilitate this transition, we face competition from companies that seek to introduce new technologies and products and companies that remain dedicated to traditional products. We may be unable to compete with these competitors or they may render our technology or products obsolete or economically \n22\nunattractive, particularly as competitors incorporate AI and machine learning into new or existing services and technologies that facilitate changes in doctor-patient interactions, expectations and treatment workflows. We may be unable to devote adequate financial resources to develop or acquire new AI technologies and systems in the future and sufficiently meet evolving industry trends and consumer demands.\nThe number and types of competitors we face are diverse and growing rapidly. The Invisalign System competes primarily against traditional wires and brackets and increasingly with clear aligners manufactured and distributed by new market entrants and existing competitors, including traditional medical device companies, laboratories, startups and, in some cases, doctors and DSOs. Our competitors also include DTC companies that provide clear aligners using a business model requiring little or no in-office care from trained and licensed doctors, and doctors and DSOs who manufacture custom aligners in their offices using 3D printing technology. Large consumer product companies may also start supplying orthodontic products. Orthodontists, GPs and DSOs have and may continue to sample competitive and alternative products and take advantage of competitive promotions and sale opportunities. \nOur iTero intraoral scanners are also facing increased competition from new and existing competitors. Our scanners compete with polyvinyl siloxane impressions and numerous new or existing intraoral scanners, as well as traditional bite wing 2D dental x-rays for detecting interproximal caries. We have and may continue to experience competition with our scanners by competitors who introduce products at lower prices or with functionality that better meets customer demand. \nIf we are unable to compete effectively with existing products, existing competitors, new market entrants, or respond effectively to new technologies, our business, financial condition, and results of operations could be materially adversely impacted.\nOur success depends on our ability to successfully develop, introduce, achieve market acceptance of, and manage new or improved products and services.\nOur success depends on our ability to quickly and profitably develop, manufacture, market, and obtain and maintain regulatory approval or clearance of new, improved or refurbished products and services. We cannot assure successful development, sales or acceptance of our products and services. The extent and rate at which our new, improved or refurbished products or services achieve market acceptance and penetration depends on many factors, including our ability to:\n•\nsuccessfully predict, timely innovate, develop, and launch new or improved technologies, applications, features, products and services to meet market demand and keep pace with changes in technology, customers\n’\n demands and industry standards;\n•\nsuccessfully and \ntimely obtain regulatory approval or clearance of new or improved products or services from government agencies such as the FDA and analogous agencies in other countries\n;\n•\ncost-effectively and efficiently develop, manufacture, quality test, market, dispose of and sell new or improved products and services, including localized versions for international markets;\n•\nproperly forecast the amount and timing of new or improved product and services demand; \n•\nallocate our research and development funding to products and services with higher growth prospects;\n•\nensure the compatibility of our technology, services and systems with those of our customers;\n•\nanticipate and rapidly innovate in response to new competitive offerings and technologies;\n•\ndifferentiate our products and services from those of our competitors as well as other products and services in our own portfolio and successfully articulate the benefits to potential customers;\n•\ndesign and manufacture products that achieve the clinical and practice outcomes we believe necessary for market acceptance;\n•\nmanage the impact of nationalism or initiatives encouraging consumer purchases from domestic vendors;\n•\nqualify for third-party reimbursement for procedures involving our products or services; \n•\noffer attractive and competitive products, services and subscription plans; \n•\nencourage customers to adopt new or improved technologies and provide the needed technical, sales and marketing support to make new or improved product and services launches successful; \n•\nmanage government procurement program restrictions; and\n•\nsource and receive quality raw materials or parts from our suppliers.\nIf we fail to accurately predict the needs and preferences of customers and their patients, or fail to offer viable products or services, we may invest heavily in research and development that does not lead to significant revenues. Even if we successfully innovate and develop new or improved products and services, we may incur substantial costs doing so and our profitability may suffer. Introduction and acceptance of any products and services may take significant time and effort, particularly if they require doctor education and training to understand their benefits or doctors choose to withhold judgment on a product until patients complete their treatments. \nIn addition, we periodically introduce new business and sales initiatives to meet customers’ needs and demands. In general, our internal resources support these initiatives without clear indications they will prove successful or be without short-term execution challenges. Should these initiatives fail, our business, financial condition and results of operations could be materially adversely impacted.\n23\nWe may invest in or acquire other businesses, products, technologies or other assets which may require significant management attention, disrupt our business, dilute stockholder value or adversely affect our business, financial condition and results of operations.\nWe have and may in the future acquire, or make investments in, companies, technologies or other assets. Alternatively, we may be unable to find suitable investment or acquisition opportunities or be unable to complete investments or acquisitions on favorable terms. If we make such investments or complete acquisitions, we may not ultimately strengthen our competitive position or achieve desired synergies and integration. Investments or acquisitions we complete could be viewed negatively and may lead to negative ratings by analysts or investors, or give rise to stockholder objections or activism, which could disrupt our operations or harm our stock price. Moreover, to the extent we make strategic investments, the companies in which we invest may fail or we may ultimately own less than a majority of the outstanding shares of the company and be unable to control or have significant influence over critical issues that could harm the value of our investment.\nWe are subject to various risks when making a strategic investment or acquisition and integrating the operations and cultures of acquired businesses within our own, which could materially impact our business, financial condition or results of operations, including that we may:\n•\nfail to perform proper due diligence and inherit unexpected material issues or assets, including intellectual property (“IP”) or other litigation or ongoing investigations, accounting irregularities or compliance liabilities; \n•\nfail to comply with regulations, governmental orders or decrees;\n•\nexperience information technology (“IT”) security and privacy compliance issues;\n•\ninvest in companies that generate net losses or are slow or fail to develop;\n•\nnot realize a positive return on our investment or determine that investments have declined in value, which could potentially require recording impairments;\n•\nneed to pay cash, incur debt or issue equity securities to pay for an acquisition, adversely affecting our liquidity, financial condition or the trading price of our common stock;\n•\nfind it difficult to implement and harmonize company-wide financial reporting, forecasting and budgeting, accounting, billing, IT and other systems due to inconsistencies in standards, internal controls, procedures and policies;\n•\nrequire significant time and resources to effectuate the integration;\n•\nfail to retain key personnel or harm our existing culture or the culture of an acquired entity;\n•\nnot realize material portions of the expected synergies and benefits of the investment or acquisition; or\n•\nunsuccessfully evaluate or utilize the acquired technology or acquired company’s know-how or fail to successfully integrate the technologies acquired.\nOperational Risks\nOur operating results have and will continue to fluctuate in the future, which makes predicting the timing and amount of customer demand and our revenues, costs, and expenditures difficult.\nOur quarterly and annual operating results have and will continue to fluctuate for a variety of reasons. Some of the factors that have and could in the future cause our operating results to fluctuate include:\n•\nchanges in consumer and doctor demand;\n•\nchanges in manufacturing, packaging, delivery and inventory costs;\n•\nthe creditworthiness, liquidity and solvency of our customers and their ability to timely make payments when due; \n•\nour ability to collect payments; \n•\nour acceptance of longer customer payment cycles; \n•\nchanges in the timing of revenue recognition and our ASPs;\n•\nseasonal fluctuations;\n•\ngeographic, channel or product mix shifts to lower priced products or to products with a higher percentage of deferred revenue;\n•\nimprovements to or changes in our products, capabilities or technologies that replace or shorten the life cycles of legacy products or cause customers to defer or stop purchasing legacy products until new products become available;\n•\nchanges in costs and expenditures, including in connection with new treatment planning and fabrication facilities and the hiring and deployment of personnel; \n•\nthe timing of clear aligner treatment order submissions, acceptance, processing and fulfillment, which can cause fluctuations in our backlog; and \n•\ntiming and fluctuation of spending around marketing and brand awareness campaigns and industry trade shows.\nIf we fail to accurately predict product demand, we may not have the appropriate level of our manufacturing capacity or that of one or more of our suppliers, staffing, materials, components, space, equipment or finished products. Specifically, our manufacturing process relies on sophisticated computer software and requires new technicians to undergo a long training process, often 120 days or longer. Additionally, production levels for our iTero intraoral scanners are generally based on forecasts and historic demand and we often place orders with suppliers for materials, components, sub-assemblies and finished products weeks or more in advance of projected orders. If we do not hire and train the appropriate number of technicians in anticipation of demand, our costs and expenditures may not align with our revenues or revenue growth. Additionally, to secure supplies for production of products, we periodically enter into non-cancelable minimum purchase commitments with vendors, \n24\nwhich could impact our ability to adjust inventory for declining demand. In addition, we may be required to purchase or lease additional or larger facilities and equipment to manage demand. If we fail to timely manufacture and deliver products to meet demand, this could damage our relationships with existing customers or harm our ability to attract new customers and adversely affect our business, financial condition and results of operations.\nWe may make business decisions that adversely affect our operating results such as modifications to our pricing policies and payment terms, promotions, development efforts, product releases, business structure or operations. The majority of our expenses, such as employee compensation and lease obligations, are relatively fixed in the short term. Moreover, our expense levels are based, in part, on expectations for future revenues. As a result, if our net revenues for a particular period are below expectations, we may be unable to timely or effectively reduce spending to offset any shortfalls. This variability and unpredictability could also result in our failing to meet the expectations of industry, financial analysts or investors. \nWe are subject to operating risks, including excess or constrained capacity and operational inefficiencies, which could adversely affect our results of operations.\nWe are subject to operating risks, including excess or constrained capacity, operational inefficiencies and pressure on our internal systems, personnel and suppliers. To manage current and anticipated future operations effectively, we must continually implement and improve our operational, financial and management information systems, hire, train, motivate, manage and retain employees, and ensure our suppliers remain diverse and capable of meeting demand for the systems, raw materials, parts and components essential to product manufacturing and delivery. We may fail to balance near-term efforts to meet existing demand with future demand, including adding personnel, creating scalable, secure and robust systems and operations, and automating processes for long-term efficiencies. Production of the Invisalign System and iTero intraoral scanners could also be limited by capacity constraints due to a variety of factors, including labor shortages, shipping delays, our dependency on third-party vendors for key materials, parts, components and equipment, the quality of or changes in product components, and limited production yields. Any such failure could materially impact our business, financial condition and results of operations. \nAdditionally, we have established treatment planning and manufacturing facilities closer to our international customers to provide better experiences, create efficiencies and provide redundancy should other facilities become unavailable. If one of these facilities is temporarily, partially or fully shut down, we may be unable to timely fulfill orders, which may negatively impact our reputation, business, financial condition and results of operations. \nOur IT systems are critical to our business. Issues with IT system and software integration, implementation, updates, and upgrades, or third-party software have previously and could again in the future disrupt our operations and have a material impact on our business, our reputation, and operating results.\nWe rely on the efficient, uninterrupted, and secure operation of complex IT systems and are dependent on key third-party software embedded in IT systems as well as third-party hosted IT systems to support our operations, including third-party cloud platforms. All software and IT systems are vulnerable to damage, cybersecurity attacks, or interruptions or other disruptions from a variety of sources, including rapidly developing AI technologies. To effectively manage and improve our operations, our IT systems and applications require an ongoing commitment of significant expenditures and resources to maintain, protect, upgrade, enhance, and restore existing systems and develop new systems to keep pace with continuing changes in information processing technology, evolving industry and regulatory standards, including privacy, security and data protection laws and regulations,\n \nincreasingly sophisticated cybersecurity threats, and changing customer preferences. Usage of online and hosted technology platforms by us, our customers, and suppliers, including remote working, teledentistry, and new or expanded use of online service platforms, products, and solutions such as doctor, consumer, and patient apps have increased the demands on and risks to our IT systems and personnel. Moreover, we continue to transform business processes, extend established processes to new subsidiaries, and implement additional functionality in our enterprise resource planning, product development, manufacturing, and other software and IT systems. This entails certain risks, including operational disruptions, such as our ability to continue developing and updating products while addressing safety and security, track orders and timely ship products, manage our supply chain, and aggregate financial and operational data. Failure to adequately protect and maintain the integrity of our products and IT systems and those of our suppliers and customers may materially impact our business, financial condition, and results of operations. \nAdditionally, we continuously upgrade and issue new software releases upon which customer facing manufacturing and treatment planning operations depend. Software applications and products containing software may contain errors or defects, especially when first introduced or released. The discovery of a defect, error, or security vulnerability in our products, software applications or IT systems, incompatibility with customers’ computer operating systems and hardware configurations with a new release or upgraded version or the failure of our products or primary IT systems, which we are unable to cure in a timely fashion, may cause adverse consequences. These may include delays or loss of revenues, significant remediation costs, market acceptance delays, data damage, loss, or unavailability, unintended disclosure or other processing of financial, health or other information relating to individuals, product recalls, loss of market share or increased service costs, any of which could have a material effect on our reputation, business, financial condition or results of our operations and the operations of our customers or our business partners.\nProducts in our Systems and Services segment, such as our iTero intraoral scanners, are subject to software and hardware risks that, if improperly managed, could have a material adverse impact on our business and financial results.\n25\nThe success of our Systems and Services segment depends on the quality and reliability of our products. We face software and hardware risks related to the manufacturing, design, quality and safety of our complex, global installed base of iTero intraoral scanners, which are continually updated to add, expand, or improve features with new hardware we manufacture or components that we source, to integrate new or existing software or other components manufactured by third parties, or to provide repair or replacement parts, any of which may contain errors or exhibit failures, especially when products are first introduced. We may be unable to ensure that third party components or changes to them will be completely compatible with our iTero intraoral scanners, which could result in failures of our iTero intraoral scanners to perform as anticipated. Additionally, the third-party software integrated into or interoperable with our iTero intraoral scanners will routinely reach end of life, and as a consequence, certain applications and models may be exposed to additional vulnerabilities, including security risks, errors, and malfunctions that may be irreparable or difficult to repair. We may not timely and adequately remediate or implement corrective measures for such failures, including due to reliance on third-party providers or suppliers. Consequently, any remediation may be time-consuming and difficult to achieve, which may materially impact our customers and business partners, damage our reputation, and result in lost business and revenue opportunities, and could be materially costly. If our products experience component aging, errors, or performance problems, or do not otherwise satisfy our stringent quality processes and controls we may choose to or be compelled to recall certain products, which may include, product withdrawals from the market, labeling changes, design changes, customer notifications, and notifications to global regulatory bodies.\nA significant portion of our clear aligner production is dependent on digital scans from our globally dispersed and decentralized installed base of iTero and third-party intraoral scanners. Failures of all or any portion of our or third-party software or other components or systems to interoperate with iTero or third-party intraoral scanners, termination of interoperability with third-party intraoral scanners, malware or ransomware attacks, product or system vulnerabilities or defects, interference or disruptions for us, our customers, labs or other business partners in the use of our products or the transmission or processing of data needed for the use or ordering of our products, or system outages, regardless of cause, have harmed our operations previously and in the future could materially and adversely affect our ability to accept scans, manufacture clear aligners or restorative procedures or treatments and services, or otherwise service our customers. Any of these events could harm our sales, damage our reputation, adversely impact our strategic partners, or result in claims, demands, litigation, and liabilities, which could have a material effect on our reputation, business, financial condition or results of our operations and the operations of our customers or business partners. \nWe are highly dependent on third-party suppliers, some of whom are sole source suppliers, for certain key machines, components and materials, and our business, financial condition and results of operations could be materially adversely affected if supply is restricted or ends or the price materially increases.\nWe are highly dependent on our supply chain, particularly manufacturers of specialized and customized scanning equipment, rapid prototyping machines, resin and other advanced materials, as well as the optics, electronic and other mechanical components of our iTero intraoral scanners. We maintain single and sole supply relationships for many of these machines and materials. By using single and sole suppliers in limited locations for materials and manufacturing, we are exposed to multiple supply chain vulnerabilities. We are reliant upon manufacturers that we contract with for quality and stability and any failures on their part may have an impact on our ability to supply our products. \nBecause of our dependence on our suppliers, changes in key relationships can materially disrupt our supply chain. For instance, we may be unable to quickly establish or qualify replacement suppliers, which could create production interruptions, delays and inefficiencies. Finding substitute manufacturers may be expensive, time-consuming or impossible and could result in significant interruptions in the supply of one or more products, product retesting or additional product registration, causing us to lose revenues and damage customer relationships. Technology changes by our service providers, vendors and other third parties could disrupt access to required manufacturing capacity or require expensive, time-consuming development efforts to adapt and integrate new equipment or processes. In the event of technology changes, delivery delays, labor stoppages or shortages, or increases in price for these items, sales may decrease and our business and prospects may be harmed.\nWe use distributors for a portion of the importation, marketing and sales of our products and services, which exposes us to risks to our sales, operations and reputation, including the risk these distributors do not comply with applicable laws or our internal procedures.\nIn addition to our direct sales force, we have and expect to continue to use distributors to import, market, sell, service and support our products and services. Our distribution agreements are generally non-exclusive and terminable by either party with customary notice. If alternative distributors cannot be quickly found and trained in the use, marketing, sales and support of our products and services, our revenues and ability to sell or service our products and services in key markets could be adversely affected. These distributors may also choose to sell alternative or competing products or services. In addition, we may be held responsible for the actions of these distributors, their employees and agents for compliance with laws and regulations, including fair competition, bribery and corruption, import and export compliance, safety, data privacy, false advertising or unfair and deceptive trade practices, and marketing and sales activities. The conduct of these distributors may impact our reputation and brand and if they fail to satisfy customers, our reputation and brand loyalty could be harmed. A distributor may also affect our ability to effectively market our products in certain foreign countries or regulatory jurisdictions if it holds the regulatory authorization in such countries or within such regions and causes, by action or inaction, the suspension of such marketing authorization or sanctions for non-compliance or prevents us from taking control of any such authorization. It may be difficult, expensive, and time-consuming for us to re-establish market access or regulatory compliance.\n26\nA disruption in the operations of a primary freight carrier, higher shipping costs or shipping delays could disrupt our supply chain and impact our operating and financial results.\nWe depend on commercial freight carriers, primarily United Parcel Service, Inc., to deliver our products. If the operations of commercial freight carriers are disrupted or we fail to mitigate any disruptions, we may be unable to timely deliver products to our customers who may choose alternative products, causing our net revenues and gross margin to decline, possibly materially. Moreover, when fuel costs increase, our freight costs generally do as well. In addition, we earn an increasingly larger portion of our total revenues from international sales, which carry higher shipping costs that negatively impact our gross margin and results of operations. If freight costs materially increase and we are unable to successfully pass all or significant portions of the increases along to our customers, or we cannot otherwise offset such increases, our gross margin and financial results could be materially affected.\nOur success depends on our personnel. If we cannot attract, motivate, train or retain personnel, it will be difficult to achieve our strategic priorities, which could materially adversely affect our business, financial condition and results of operations.\nWe are highly dependent on the talent and efforts of our personnel. We strive to retain our personnel by providing competitive compensation and benefits, development opportunities and training, flexible work options and an inclusive corporate culture. However, competition for highly-skilled personnel, particularly technical and digital talent, is intense, and our competitors have and are likely to continue to recruit our personnel. Our compensation and benefit arrangements may not successfully attract new personnel or retain and\n motivate existing personnel. In addition, other internal and external factors can impact our ability to hire and retain talent, including insufficient advancement or career opportunities, in office or hybrid work policies and restrictive immigration policies\n. The loss of any key personnel, particularly executive management, research and development, or sales personnel, could harm our business and prospects and impede the achievement of our research and development, operational or strategic objectives. \nWe provide significant training to our personnel and our business will be harmed if our training fails to properly prepare them to perform the work required, we are unable to successfully instill technical expertise in new and existing personnel, or if our techniques prove unsuccessful or are not cost-effective. Moreover, for certain roles, this training and experience can make key personnel, such as our sales personnel, highly desirable to competitors and lead to increased attrition. It can take 12 months or more to train sales representatives to successfully market and sell our products and services and for them to establish strong customer relationships. The loss of the services and knowledge of our highly-skilled personnel may significantly delay or prevent the achievement of our development, operational or strategic objectives. \nAdditionally, seamless leadership transitions for key positions are critical to sustaining our culture and organizational success. If our succession planning is ineffective, it could adversely impact our business. We continually assess key personnel we believe are essential to our long-term success. Moreover, future organizational changes may cause attrition rates to increase. If we fail to effectively manage any organizational or strategic changes, our financial condition, results of operations, and reputation, as well as our ability to successfully attract, motivate, and retain key personnel, may be adversely affected.\nWe have adopted a hybrid work schedule in many of our offices, allowing employees to collaborate and connect with others several days each week while providing the option to work remotely other days. This hybrid work approach may create challenges with maintaining our corporate culture, employee satisfaction, and hiring, promotion and retention.\nWe believe a key to our success has been the culture we have created that emphasizes a shared vision and core values of Agility, Customer and Accountability. We have experienced and may continue to experience difficulties attracting and retaining personnel that meet the qualifications, experience, compliance mindset and values we expect. If we cannot attract and retain personnel that meet our selection criteria or relax our standards, our corporate culture, ability to achieve our strategic objectives and our compliance with obligations under our internal controls and other requirements may be harmed. \nThis could have a material adverse effect on our results of operations\n and our ability to maintain market share.\nWe have personnel represented by works councils and trade unions in certain countries and others that may be or may become eligible to be represented by works councils, trade unions and other employee associations. Labor disputes and work stoppages involving our personnel may disrupt our operations and could materially impact our results or operations.\nWe depend on our marketing activities to deepen our market penetration and raise awareness of our brands, products, and services, which may prove unsuccessful or may become less effective or more costly to maintain in the long term.\nOur marketing efforts and costs are significant and include national and regional campaigns in multiple countries involving television, print, social media and alliances with professional sports teams, social media influencers and other strategic partners. There is no assurance our advertising campaigns will achieve the desired returns on advertising spend, increase brand, product or services awareness sufficiently or generate goodwill and positive reputational goals, or that we will be able to maintain commercial relationships with social media influencers and other strategic partners. Moreover, should any entity or individual endorsing us, our products or services take actions, make or publish statements in support of, or lend support to events or causes which are perceived by a portion of society negatively, our sponsorships or support of these entities or individuals may be questioned, our products and services boycotted and our reputation harmed, any of which could materially affect our business, financial condition and results of operations. \n27\nIn addition, many countries prohibit certain types of marketing activities. For example, some countries restrict direct to consumer advertising of medical devices. We have and may in the future be alleged to violate marketing restrictions and be ordered to stop certain marketing activities or prevented from selling our products and services. Moreover, competitors do not always follow these restrictions, which can create an unfair advantage and make it more difficult and costly to compete.\n \nAdditionally, we rely heavily on data generated from our campaigns to target specific audiences and evaluate their effectiveness, particularly data generated from internet activities on mobile devices. To obtain this data, we are dependent on third parties and popular mobile operating systems, networks, technologies, products and standards we do not control, such as the Android and iOS operating systems, and mobile browsers. Changes in such systems that degrade or eliminate our ability to target or measure the results of ads or increase costs to target audiences could adversely affect our campaigns. Operating systems could also include data privacy settings that may limit our ability to interpret, target and measure ads effectively. \nLegal, Regulatory and Compliance Risks\nWe are subject to antitrust and competition regulations, litigation and enforcement that may result in fines, penalties, restrictions on our business practices, and product, services or operational changes which could materially impact our business, financial condition and results of operations.\nWe currently are and may in the future be subject to antitrust, competition or unfair competition-related investigations, enforcement actions or claims by governmental agencies, competitors, consumers, customers and others which, even if unfounded, could cause us to incur substantial costs, enter into settlements, consent decrees, be subject to judgments, involve negative publicity and divert management time and attention, which may materially impact our business, financial condition and results of operations. Resolving these matters may require us to change our business practices in materially adverse ways. Governments and regulators are actively developing new competition laws and regulations aimed at the technology sector, AI and digital platforms, and global activities and expansion, including in large markets such as the United States, the European Union, and China. Government regulatory actions and court decisions may result in fines or hinder our ability to provide certain benefits to our customers and consumers, reducing the attractiveness of our products, services and the net revenue derived from them. These actions and decisions may also hinder our ability to pursue certain mergers, acquisitions, business combinations, investments or other transactions.\nFailure to obtain or maintain approvals or comply with regulations regarding our products or services or those of our suppliers could materially harm our sales, result in substantial penalties and fines, interrupt our supply chain and cause harm to our reputation.\nWe and many of our healthcare provider customers, suppliers and distributors are subject to extensive and frequently changing regulations under numerous federal, state, local, and foreign laws, including those regulating:\n•\nthe storage, transmission, disclosure, and other processing of, and security measures with respect to, personal, financial and medical information as well as healthcare records; \n•\nprocessing and use of children’s personal and health data;\n•\nwebsites and application advertising, including that involving the use of cookies or involving the collection, use, disclosure, or other processing of data relating to individuals for marketing purposes; \n•\nprohibitions against the offer, payment or receipt of remuneration to induce referrals to entities providing healthcare services or goods or to induce the order, purchase or recommendation of our products and services; and\n•\nthe design, manufacture, marketing and advertising of our products and services.\nThe healthcare and technology markets are also highly regulated and subject to evolving political, economic and regulatory influences. Global regulators are expanding and changing regulations and guidance for products and services, which can limit their potential benefits and cause protracted review timelines for new products and services. Our critical third-party vendors and service providers are subject to similar regulations. Our failure or the failure of our suppliers, customers, advertisers, consultants, and influencers to strictly adhere to clearances or approvals in the labeling, marketing and sales of our products and services could subject us to claims or litigation, including allegations of false or misleading advertising or violations of laws or regulations, which may result in costly investigations, fines, penalties, as well as material judgments, settlements or decrees. We are also subject to complex, new and evolving environmental, health and safety regulations. There can be no assurance we will adequately address the risks associated with the implementation and compliance with such laws and our internal processes and procedures to comply with such laws or that we will be able to take advantage of any resulting business opportunities.\nFurthermore, before we can sell a new medical device or market a new use of, or claim for, an existing product, we frequently must obtain regulatory clearance or approval. For instance, in the United States, FDA regulations are wide-ranging and govern, among other things, product design, product materials, development, manufacturing and testing, product labeling and product storage. It takes significant time, effort, and expense to obtain and maintain clearances and approvals of products and services, and there is no guarantee we will timely succeed, if at all, in the countries in which we do business. In other countries, the requirements, time, effort and expense to obtain and maintain clearances may differ materially. Moreover, these laws may change, resulting in additional time, expense or loss of market access. If the requirements to market our products or services are delayed, we may be unable to offer them in markets we deem important. Additionally, failure to comply with applicable regulatory requirements could result in enforcement actions with sanctions, including fines, civil penalties and \n28\ncriminal prosecution. Delays or failures to obtain or maintain regulatory approvals, clearances or to comply with regulatory requirements may materially adversely affect our domestic or international operations, and adversely impact our business. \nWe and certain of our third-party vendors must also comply with and adhere to facility registration and product listing requirements for Quality System regulations. The FDA enforces its Quality System regulations through periodic unannounced inspections. Failure to satisfactorily correct an adverse inspection finding or comply with applicable regulations can result in enforcement actions, or require us to find alternative manufacturers, which could be a long and costly process and may cause reputational harm. Enforcement actions by regulators could have a material effect on our business, financial condition and results of operations.\nWe are also subject to anti-corruption and anti-bribery (“ABAC”) laws such as the Foreign Corrupt Practices Act (“FCPA”) and the U.K. Bribery Act of 2010, which generally prohibit payments to foreign officials for the purpose of obtaining or maintaining business, securing an advantage and directing business to another. To comply with ABAC laws, regulators require we maintain accurate books and records and a system of internal accounting controls. Under the FCPA, we may be held liable for corruption by directors, officers, employees, agents, or other strategic or local partners, intermediaries or representatives acting on our behalf. \nWhile we have policies and procedures requiring compliance with applicable laws and regulations and we provide training to foster compliance, our employees, third parties acting on our behalf, and customers may not adhere to our policies and procedures or applicable laws or regulations, including the use of certain electronic communications and maintaining accurate books and records. If our personnel or the personnel of our agents or suppliers fail to comply with any laws, regulations, policies or procedures, or we fail to audit and enforce compliance, our reputation may be harmed, we may lose customers or revenues or we may face regulatory investigations, actions and fines.\nIn June 2024, the U.S. Supreme Court reversed its longstanding approach to evaluating administrative rulemaking under the \nChevron\n doctrine, which provided for judicial deference to regulatory agencies, including the FDA. There may be increased challenges to existing agency regulations or how lower courts will apply the decision in the context of other regulatory schemes without more specific guidance from the courts. For example, this decision may result in more companies suing the FDA to challenge its longstanding decisions and policies, which could undermine the FDA's authority, lead to uncertainties in the industry, and disrupt the FDA’s normal operations, which could impact the timely review of any regulatory filings or applications we submit.\nSecurity breaches, data breaches, cybersecurity attacks, other cybersecurity incidents, or the failure to comply with privacy, security and data protection laws could materially adversely impact our operations and patient care, and we could be liable for damages, and our reputation, business, financial condition and results of operations could be harmed.\nWe retain confidential employee, applicant and customer personal, health and financial, and our own proprietary information and data essential to our operations. We rely on the effectiveness of our IT systems, policies and contracts and the policies of our third-party vendors, and their IT systems to safeguard information and data. Additionally, our cybersecurity controls depend on our customers, many of whom are individual or small healthcare providers with limited IT experience and inadequate or untested security protocols, to successfully manage data privacy and security requirements. It is critical that the facilities, infrastructure and IT systems on which we depend and the products and services we develop remain secure and be perceived as secure. Despite the implementation of security features in our products and services and security measures in our IT systems, we and our service providers, third-party vendors and other third parties could be targeted by or subject to physical break-ins, computer viruses and other malicious code, unauthorized or fraudulent access, programming errors or other technical malfunctions, hacking attacks, phishing and other social engineering attacks, malware, ransomware, employee error or malfeasance, cybersecurity attacks, malicious code, and other breaches of, or incidents impacting, IT systems or similar malicious or otherwise disruptive actions, including by organized groups and nation-state actors, which may disrupt or limit the availability of, or result in damage to, our IT systems and result in loss or unavailability of, damage to, or the unauthorized acquisition, use, disclosure, or other processing of confidential information. For example, we have experienced, and may again experience in the future, cybersecurity incidents, data incidents, and unauthorized internal employee exfiltration of information. This risk is exacerbated with the advancement of technologies like AI, which malicious third parties can use to create new, more sophisticated and more frequent or other attacks. There can be no assurance our cybersecurity risk management program and processes, including our policies, controls or procedures, will be fully implemented, complied with or effective in protecting our systems and information or any other information we maintain or otherwise process. \nFurther, the frequency and sophistication of third-party cybersecurity attacks are increasing. Significant service disruptions, breaches, incidents, interruptions or other disruptive events impacting our infrastructure and IT systems, or other cybersecurity incidents, or any belief or reporting that any of the foregoing has occurred, could expose us to regulatory investigations, or other proceedings, private claims, demands, and litigation, impair our reputation and competitive position, distract management and require significant time and resources to address. Legal or regulatory action against us could prevent us from resolving issues quickly or force us to resolve them in unanticipated ways, cause us to incur significant expense and damages, or result in orders forcing us to cease operations or modify our business practices in ways that materially limit or restrict our products and services. Concerns over our practices with respect to privacy, data protection, data governance, and cybersecurity could adversely affect our reputation and deter customers and consumers from using our products and services. In addition, patient care could suffer, and we could be liable if our products, services or IT systems fail to timely deliver accurate and complete information. We have cybersecurity and other forms of insurance coverage related to cyberattacks, breaches, and other incidents \n29\nor security problems, but we cannot guarantee applicable insurance will be available to us in the future on economically reasonable terms or at all. Damages and claims arising from incidents may not be covered, may exceed coverage limits, and may not cover the time and effort we incur investigating and responding to any incidents, or other costs or liabilities, which may be material. The costs to eliminate, mitigate, or recover from security problems and cybersecurity attacks and incidents could be material and require us to implement additional or different security controls or other measures and, depending on the nature and extent of the problem and the products, services or IT systems impacted, such security problems and cybersecurity attacks and incidents may result in network, IT system interruptions or other disruptions, decreased product sales, data loss, damage, unavailability, or other liabilities, any of which may have a material impact on our operations, net revenues and operating results.\nAdditionally, our iTero intraoral scanners may be independently or collectively the target of cybersecurity incidents or attacks or subject to security vulnerabilities, bugs, errors, defects, or viruses or other malicious code. Due to the large and growing number of these decentralized devices, we may be unable, or not have the capacity, knowledge or infrastructure, to respond to or remedy a cybersecurity incident in a timely manner. Any such cybersecurity incident may cause loss or damage to us, our customers or strategic business partners or may cause further malfunctions in, or damage to, our products, services, or IT systems, damage to, or loss, unavailability, or unauthorized acquisition, use, or other processing of our data, or disruption, interruption or temporary cessation of our operations. Further, any such security breach or incident, or other cybersecurity incident, or any belief or reporting that any of the foregoing has occurred, may otherwise have a negative impact upon our business or reputation.\nWe are also subject to federal, state, and foreign laws and regulations respecting the security and privacy of patient healthcare information applicable to healthcare providers and their business associates, such as HIPPA, the HITECH Act, and the Privacy Standards and Security Standards, as well as those relating to privacy, data security, content regulation and consumer protection, such as the California Consumer Protection Act, as amended by the California Privacy Rights Act (as amended, the “CCPA”). The CCPA requires covered businesses that process personal information of California residents to disclose certain practices, provides California residents with data privacy rights, imposes operational requirements, and provides for significant civil penalties for violations as well as a private right of action for certain data breaches and statutory damages. There are limited exemptions under the CCPA for protected health information covered by HIPAA and certain other state laws, but the CCPA and other new and evolving state laws could impact our business activities. Numerous other states have enacted laws relating to privacy, data protection, data governance and cybersecurity that either are in operation or slated to go into operation over the next several years. Many of these laws are comprehensive privacy laws similar to the CCPA. States also are enacting laws addressing specific subject matter, such as Washington’s My Health, My Data Act, which includes a private right of action. Laws in all 50 U.S. states may require businesses to provide notice to individuals whose personal data has been disclosed as a result of a data breach. Outside of the U.S., relevant legal requirements continue to evolve. For example, the collection and use of health data and other personal information is governed in the EU by the General Data Protection Regulation (“GDPR”), which imposes significant obligations upon companies and rights for individuals, with substantial penalties for noncompliance up to the greater of €20,000,000 or 4% of the total worldwide annual turnover of the preceding financial year, and by certain EU member state-level legislation. Numerous other jurisdictions maintain similar legislation or other laws or regulations addressing privacy, data protection, data governance, or cybersecurity. \nWe are also subject to data export restrictions and international transfer laws and regulations that prohibit or impose conditions upon certain data transfers. The mechanisms upon which we and many other companies rely upon for European data transfers have been the subject of legal challenge, regulatory interpretation and judicial decisions by the EU courts and regulators, and may be subject to significant changes. Several countries, including the United States, China, Australia, and Japan, have established legal requirements for cross-border transfers of all or certain personal information and certain countries have also established legal requirements for data localization. These laws and regulations are constantly evolving and may be created, interpreted, applied or amended in ways that could restrict our activities in certain jurisdictions, limit our ability to provide our products and services in those jurisdictions, require us to modify our policies and practices and to engage in additional contractual negotiations, or increase our costs and obligations and impose limitations upon our ability to efficiently transfer personal data across borders. We have and likely will again in the future be required to implement new or expand existing data storage protocols, build new storage facilities, devote additional resources, and modify relevant policies or procedures to comply with the foregoing laws, any of which could be costly and which may adversely affect our business and our customers' businesses, our financial condition and our results of operations in those jurisdictions.\nWith laws, regulations and other obligations relating to privacy, data protection, data governance and cybersecurity imposing new and relatively burdensome obligations, and with substantial uncertainty over the interpretation and application of these and other obligations, we may face challenges in addressing their requirements and making necessary changes to our policies and practices and may incur significant costs and expenses in an effort to do so. Further, any failure or perceived failure by us or our vendors, customers, or service providers to comply with our applicable policies or notices relating to privacy, data protection, data governance or cybersecurity, our contractual or other obligations to third parties, or any of our other legal obligations, laws, rules, regulations or standards relating to privacy, data protection, data governance or cybersecurity, may result in governmental investigations or enforcement actions, litigation, claims and other proceedings, harm our reputation, and could result in significant liability.\nOur business exposes us to potential liability for the quality and safety of our products and services, how we advertise and market those products and services, and how and to whom we sell them, and we may incur substantial expenses or be found liable for substantial damages or penalties if we are subject to claims or litigation.\n30\nOur products and services involve an inherent risk of claims concerning their design, materials, manufacture, safety, and performance, how we package, bundle, or sell them to individual customers or companies, including hospitals and clinics, and how we train and support doctors, their staffs and patients who use our products and services. Moreover, consumer products and services are routinely subject to claims of false, deceptive or misleading advertising, consumer fraud and unfair business practices. Additionally, we may be held liable if our products or services cause injury or are otherwise found unhealthy. If our products and services are safe but they are promoted for use or used in unintended or unexpected ways or for which we have not obtained clearance (“off-label” usage), we may be investigated, fined or have our products or services enjoined or approvals rescinded or we may be required to defend ourselves in litigation. Although we maintain insurance for product liability, business practices, and other types of activities we make or offer, coverage may not be available on acceptable terms, if at all, and may be insufficient for actual liabilities. Any claim for product liability, sales, advertising and business practices, regardless of its merit or eventual outcome, could result in material legal defense costs and damage our reputation, increase our expenses, and divert management’s attention.\nCurrent and anticipated sustainability and social (“Sustainability”) laws and scrutiny of our Sustainability policies and practices may materially increase our costs, expose us to liability, and adversely impact our reputation, employee retention, willingness of customers and suppliers to do business with us and willingness of investors to invest in us. \nOur operations are subject to a variety of existing local, regional and global Sustainability laws and regulations, and we are and may be required to comply with new, broader, more complex and more costly Sustainability laws and regulations, such as the EU’s Corporate Sustainability Reporting Directive. Our compliance obligations span all aspects of our business and operations, including product design and development, materials sourcing and other procurement activities, product packaging, product safety, energy and natural resources usage, facilities design and utilization, recycling and collection, transportation, disposal activities and workers’ rights. \nSustainability regulations are expected to have an increasingly larger impact on us or our suppliers. Many U.S. and foreign regulators have or are considering enacting new or additional disclosure requirements or limits on the emissions of greenhouse gases from power generated using fossil fuels. The effects of greenhouse gas emission limits on power generation are subject to significant uncertainties, including the timing of new requirements, levels of emissions reductions and the scope and types of emissions regulated. Additionally, as Sustainability laws are increasing, customers and consumers may demand our products, packaging and operations be more sustainable, affect how we manufacture and package our products, increase our costs and those of our suppliers, and may result in manufacturing, transportation and supply chain disruptions if sustainable clean energy is not readily available in adequate amounts when required. Moreover, clean energy sources, coupled with reduced investments in traditional energy production and infrastructure, may not provide the predictable, reliable and consistent energy we, our suppliers and other business partners require.\nAdditionally, the sourcing and availability of metals used in the manufacture of, or contained in, our products may be affected by laws and regulations governing the use of minerals obtained from certain regions of the world like the Democratic Republic of Congo and adjoining countries. Our expanding geographic operations may increase the risk of purchasing “conflict minerals” and our diligence efforts to identify whether any of our products contain minerals impacted by these laws and regulations may not be accurate, adequate or complete. Other restrictions apply to the substances incorporated into our products, including the chemical compounds in our clear aligners, the electronics in our iTero intraoral scanners and the packaging in which they are shipped. These laws are proliferating and new substances subject to restrictions are added regularly and may require additional reporting or phasing out of certain chemicals and compounds such as per- and polyfluoroalkyl substances (PFAS). We may be required to re-design our products or identify new suppliers to maintain our compliance with these laws. Further, these laws and regulations may decrease the number of suppliers capable of supplying our needs, thereby negatively affecting our ability to manufacture products in sufficient quantities at competitive prices, leading customers to potentially choose competitive goods and services. \nMeeting our obligations under existing Sustainability laws and regulations is costly for us and our suppliers, and we expect these regulations and costs to increase, in particular as the regulatory frameworks in each jurisdiction in which we operate become more complex and distinct. Additionally, regulators may perform investigations, inspections and periodically audit our compliance with these laws and regulations, and our efforts or operations may not be compliant. If we fail to comply with any requirements, we could be subject to significant penalties or liabilities and we may be required to implement new and materially more costly processes and procedures. Even if we successfully comply with these laws and regulations, our suppliers may not. We may also suffer financial and reputational harm if customers require, and we are unable to deliver, certification that our products are compliant. In all of these situations, customers may stop purchasing products from us, and may take legal action against us, which could harm our reputation, business, financial condition and results of operations.\nInvestor advocacy groups, institutional investors, investment funds, proxy advisory services, stockholders and customers have and could in the future focus on corporate Sustainability practices. Additionally, public interest and legislative pressure related to companies’ Sustainability practices has been evolving in recent years. If we fail to adopt Sustainability standards or practices as quickly as stakeholders desire, comply with or timely report on our Sustainability efforts or practices accurately, or satisfy the disclosure and other expectations of stakeholders, our brand, reputation, employee retention, business, financial performance, growth, and stock price may be adversely impacted.\n31\nWe have been incorporating and continue to work to further incorporate AI technologies into our products, services and IT systems. Implementation of AI and machine learning technologies may result in legal and regulatory risks, reputational harm or have other adverse consequences to our business.\nWe have and are continuing to incorporate AI, including machine learning and independent algorithms, in certain of our products, services and IT systems, which is intended to enhance their operation and effectiveness internally and for our customers, consumers and suppliers. There can be no assurance that we or our customers will realize the expected benefits from these investments. AI innovation presents risks and challenges that could impact our business. Our, or our vendors’, AI algorithms may be flawed. Our datasets or AI training algorithms may be insufficient or contain biased information. \nAdditionally, many countries and regions, including the EU, have proposed new and evolving regulations related to the use of AI and machine learning technologies. In Europe, the EU AI Act entered into force on August 1, 2024 which will become fully effective on August 2, 2026, with some provisions effective in February 2025. Other jurisdictions are considering similarly focused legislation. Although we do not engage in developing or providing AI systems for which their placement on the market, putting into service, or use would qualify as “prohibited AI practices,” restrictions and obligations under this regulation, to the extent applicable to us, could have a negative impact on our business, financial condition and results of operations. Additionally, other jurisdictions have proposed, and in certain cases enacted, laws and regulations addressing aspects of the use and development of AI. The evolving AI regulatory environment may, among other impacts, result in:\n•\ninconsistencies among AI regulations and frameworks across jurisdictions; \n•\nonerous compliance, governance, research and development obligations that may require us to rework or reevaluate improvements to be compliant or result in the development of products that are unacceptable under new or revised regulatory frameworks; \n•\nincreased risk of regulatory enforcement and litigation related to our AI models; \n•\nincreased liability related to the use of AI by our customers, consumers or suppliers that are beyond our control; \n•\ndelays in the deployment of new products and services; \n•\ncompetitive and reputational harm; and \n•\nincreased cybersecurity risks. \nIntellectual Property Risks\nOur success depends in part on our proprietary technology, and if we fail to successfully obtain or enforce our IP rights, our competitive position may be harmed. \nOur success depends in part on our ability to maintain existing IP rights and obtain, maintain and enforce further IP protections for our products. Our inability to do so could harm our competitive position.\nWe rely on our portfolio of issued and pending patent applications in the United States and other countries to protect a large part of our IP and our competitive position; however, these patents may not prevent third parties from producing competing products similar in design to ours if they are invalidated, held unenforceable, circumvented or otherwise limited in scope. Furthermore, our foreign patent protections may be more limited in geographic scope than those under U.S. patent and IP laws. \nAdditionally, any of our patent applications may not result in an issued patent or the scope of the patent ultimately issued may be narrower than initially sought. We may not be afforded the protection of a patent if our currently pending or future patent filings do not result in the issuance of patents or we fail to timely apply for patent protection. We may not apply for a patent if our personnel fail to disclose or recognize new patentable ideas or innovations. We may choose not to file a foreign patent application if the limited protections provided by a foreign patent do not outweigh the costs to obtain it. Further, third parties may file patents or develop IP strategies that prevent or limit the effectiveness of our patents.\nWe also protect our IP through copyrights, trademarks, trade secrets and confidentiality obligations. We generally enter into confidentiality agreements with our employees, consultants and collaborative partners upon commencement of a relationship with us. However, despite the existence of these protections, we have experienced incidents in which our proprietary information has been misappropriated and believe it could be misappropriated in the future. If these agreements do not provide meaningful protection against the unauthorized use or disclosure of our trade secrets or other confidential information, adequate remedies may not exist to prevent unauthorized uses or disclosures.\nEnforcement of our IP rights is time-consuming and costly, and could ultimately prove to be unsuccessful. In certain jurisdictions, enforcement of IP rights is more difficult due to legislation and geopolitical circumstances. As we launch our products in different regions at different times, our products may be acquired and reverse engineered by potential competitors in regions where infringement is more difficult to pursue. \nOur inability to maintain the proprietary nature of our technology through patents, copyrights, or trade secrets would impair our competitive advantages and could have a material effect on our operating results, financial condition, and future growth prospects. In particular, a failure to protect our IP rights might allow competitors to copy our technology or create counterfeit or pirated versions of our products, which could adversely affect our reputation, pricing, and market share. \n32\nLitigation regarding our IP rights, rights claimed by third parties or IP litigation by any vendors on whose products or services we rely for our products and services may impact our ability to grow our business and adversely impact our reputation and results of operations.\nExtensive litigation over IP rights is common in technologies and industries on which our products and services are based. Litigation, interferences, oppositions, re-exams, \ninter partes\n reviews, post grant reviews or other proceedings have been necessary and will likely be needed in the future to determine the validity and scope of certain of our IP rights and those claimed by third parties. These proceedings are used to determine the validity, scope or non-infringement of certain patent rights pertinent to the manufacture, use or sale of our products and the products of competitors. We have been sued for infringement of third parties’ patents in the past and are currently defending patent infringement lawsuits and other legal claims. In addition, we periodically receive letters from third parties drawing our attention to their IP rights and there may be other third-party IP rights of which we are presently unaware. As dentistry continues to become more digital, competitors may make defense of our IP more challenging. Asserting or defending these proceedings can be unpredictable, protracted, time-consuming, expensive, and distracting to management and technical personnel. Their outcomes may adversely affect our ability to manufacture and market our products and services, require us to seek licenses for infringing products or technologies, or result in the assessment of significant monetary damages. Unfavorable rulings could include monetary damages, injunctions prohibiting us from selling our products, or exclusion orders preventing us from importing our products in one or more countries. Moreover, independent actions by competitors, customers, or others have alleged that our efforts to enforce our IP rights constitute unfair competition or violations of antitrust laws and investigations and additional litigation based on the same or similar claims may be brought in the future. The potential effects on our business operations resulting from litigation, whether or not ultimately determined in our favor or settled by us, are costly and could materially affect our reputation, business, financial condition and results of operations.\nFinancial, Tax and Accounting Risks\nIf our goodwill, intangible or long-lived assets become impaired, we may be required to record material charges to income.\nUnder U.S. GAAP, we review our goodwill annually and more frequently if we identify events or circumstances that indicate it is more likely than not the fair value of a reporting unit has been reduced below its carrying value. We review finite-lived intangible assets and long-lived assets for impairment when events or circumstances indicate the carrying value of the asset (asset group) may not be recoverable. The qualitative analysis performed by management to identify indicators of impairment or the quantitative analysis used to determine fair value requires management to exercise significant judgement in determining appropriate assumptions and estimates, including revenue growth rates, gross and operating margins, and discount rates. Management is responsible for continually assessing qualitative factors that could negatively impact the fair value of goodwill and intangible and long-lived assets and if required, assesses the fair value of each to determine if they have become impaired. Consequently, we may be required to record material charges to earnings on our financial statements during the period in which any impairment of goodwill, intangible assets or long-lived assets is determined.\nChanges in, or interpretations of, accounting rules and regulations, could result in unfavorable accounting charges.\nWe prepare our consolidated financial statements in conformity with U.S. GAAP. These principles are subject to interpretation by the SEC and various bodies formed to interpret and create appropriate accounting principles. A change in these principles or in the way these principles are interpreted by us or by our regulators could materially affect our current or previously issued financial statements.\nWe are required to annually assess our internal control over financial reporting and any adverse results from such assessment may result in a loss of investor confidence in our financial reports and adversely affect our stock price.\nWe are required to furnish in our Annual Report on Form 10-K a report by our management regarding the effectiveness of our internal control over financial reporting that includes, among other things, an assessment of the effectiveness of our internal control over financial reporting as of the end of our fiscal year, including an assertion by management that our internal control over financial reporting were effective as of the end of our fiscal year. Our internal controls may become ineffective because of changes in personnel, updates and upgrades to or migration away from existing software, failure to maintain accurate books and records, changes in accounting standards or interpretations of existing standards, or changes to business models that may require adjustments to our financial reporting and, as a result, the degree of compliance of our internal control over financial reporting with the existing policies or procedures may become ineffective. Establishing, testing and maintaining an effective system of internal control over financial reporting requires significant resources and time commitments on the part of our management and our finance staff, and may require additional staffing and infrastructure investments and increases our costs of doing business. If we are unable to assert that our internal control over financial reporting is effective, if our auditors are unable to express an opinion on the effectiveness of our internal controls, or conclude that our internal controls are ineffective, the timely filing of our financial reports could be delayed or we could be required to restate past reports. This could cause our investors to lose confidence in the accuracy and completeness of our financial reports, which could have an adverse effect on our stock price.\nOur effective tax rate may vary significantly from period to period, which could result in volatility of our operating results and adversely affect our financial results.\n33\nWe are subject to taxes in the United States and foreign countries. Various internal and external factors may impact our future effective tax rate. These include changes in the global economic environment, our legal entity structure or activities performed within our entities, our business operations, tax laws, regulations and/or rates, changes to existing accounting pronouncements, changes in interpretations of existing tax laws or regulations, the relative proportions of revenues and income before taxes in the various jurisdictions in which we operate that have differing statutory tax rates, overall levels of pretax earnings, settlements of income tax audits, non-deductible goodwill impairments, and changes in the valuation allowance offsetting deferred tax assets. Furthermore, we may continue to experience variation in our effective tax rate related to excess tax benefits or tax expense on stock-based compensation, particularly in the first quarter of each year when the majority of our equity awards vest.\nNew tax laws and practices, changes to existing tax laws and practices, or disputes regarding the positions we take regarding tax laws, could negatively affect our provision for income taxes as well as our ongoing operations.\nCompliance with tax laws requires significant judgment concerning our worldwide provision for income taxes. Changes in tax laws or changes to how those laws are applied to our business could affect the amount of tax which we are subject to and the manner in which we operate. Specifically, the Organization for Economic Cooperation and Development (“OECD”) established the Inclusive Framework on Base Erosion and Profit Shifting (“BEPS”) to among other things, allocate greater taxing rights to countries where customers are located and establish a global minimum tax rate. Countries including EU member countries have enacted, are considering enacting, or have committed to enact the OECD/G20 Framework’s Pillar Two 15% global minimum tax, including Switzerland which is a significant jurisdiction for us. We continue to monitor the enactment of legislation to evaluate the impact of changing global tax laws, which could adversely affect our provision for income taxes or operations.\n \nMoreover, the application of indirect taxes (such as sales and use tax (“SUT”), value-added tax (“VAT”), goods and services tax (“GST”), and other indirect taxes) to our operations is complex and evolving. U.S. states, local and foreign taxing jurisdictions have differing rules and regulations governing differing types of taxes, and these rules and regulations are subject to varying interpretations and exemptions that may change over time. We collect and remit SUT, VAT, GST and other taxes in many jurisdictions and we are routinely subject to audits. The positions we take regarding taxes as well as the amounts we collect or remit have and may continue to be challenged and we may be liable for failing to collect or remit all taxes deemed owed or the taxes could exceed our estimates. We have and may continue to dispute rulings or positions taken by tax authorities, which have and may continue to incur significant expenses, time, and effort to defend our positions. \nThe application of existing and new tax laws, and the results of audits could harm our business. Furthermore, there have been and will continue to be substantial ongoing costs associated with complying with the various tax requirements and defending our positions in the numerous markets in which we conduct or will conduct business.\nHistorically, the market price for our common stock has been volatile.\nThe market price of our common stock is subject to rapid and large price fluctuations attributable to various factors, many of which are beyond our control. The factors include:\n•\nquarterly variations in our results of operations and liquidity, our ability to meet or exceed our forecasts and guidance or changes to or withdrawal of our previous forecasts and guidance;\n•\nour ability to\n regain or sustain our historical growth rates; \n•\nchanges in recommendations or valuation models for our stock by the investment community, or speculation in the press or investment community regarding estimates of our net revenues, results of operations, or other key performance indicators;\n•\nannouncements by us, our competitors, or new market entrants, including strategic actions, management changes, and material transactions or acquisitions;\n•\ntechnical factors in the public trading markets for our stock that may produce price movements inconsistent with macroeconomic, industry, or company-specific fundamentals, including the sentiment of retail investors (as it may be expressed on financial trading and other social media sites), the amount and status of short interest in our securities, access to margin debt, trading in options and other derivatives on our common stock, fractional share trading, and other technical trading factors or strategies;\n•\nstockholder activism or securities class action litigation;\n•\nannouncements regarding stock repurchases, sales or purchases of our common stock by us, our officers or directors, credit agreements, and debt issuances;\n•\nannouncements of technological innovations or new, additional or revised programs, business models, products, or product offerings by us, our customers, or competitors; \n•\nkey decisions in pending litigation, new litigation, settlements, judgments, or decrees; \n•\nshort selling or other hedging activity in our stock; and \n•\ngeneral economic market conditions, including rising interest rates, tariffs, inflationary pressures, recessions, consumer sentiment and demand, global geopolitical conflict, and industry factors unrelated to our actual performance.\nIn addition, the stock market in general, and the market for technology and medical device companies, in particular, often experience extreme price and volume fluctuations unrelated or disproportionate to corporate operating performance. Any such \n34\nfluctuations have and may continue to adversely affect the market price of our common stock. These broad market and industry factors may include market expectations of, or actual changes in, monetary policies that have the goal of easing or tightening interest rates such as the U.S. federal funds rate and austerity measures of governments intended to control budget deficits. Securities litigation, including securities class action lawsuits and securities derivative lawsuits, is often brought against an issuer following periods of volatility in the market price of its securities and we have not been exempt from such litigation. \nWe cannot guarantee that we will continue to repurchase our common stock in the future, and any repurchases we may make may not achieve our desired objectives.\nWe have a history of recurring stock repurchase programs intended to return capital to our investors. Future stock repurchase programs are contingent on a variety of factors, including our financial condition, market conditions, results of operations, business requirements, and our continuing determination that stock repurchases are in the best interests of our stockholders and in compliance with all applicable laws and agreements. There is no assurance that we will continue repurchasing our common stock in the future at historical levels or at all, or that our stock repurchase programs will beneficially impact our stock price. Additionally, effective January 1, 2023, the Inflation Reduction Act imposes a 1% excise tax on our stock repurchases, net of certain stock issuances, which will increase our tax liabilities and the cost to repurchase stock and may impact if and how much stock we choose to repurchase in the future.\nFuture sales of significant amounts of our common stock may depress our stock price.\nA significant percentage of our outstanding common stock is currently owned by a small number of stockholders. These stockholders have sold in the past, and may sell in the future, large amounts of our stock over relatively short periods of time. Sales of substantial amounts of our stock by existing stockholders may adversely affect the market price of our stock by creating the perception of difficulties or problems with our business, which may depress our stock price.\nItem 1B.  Unresolved Staff Comments.\nNone.\nItem 1C.  Cybersecurity. \nOverview\nWe have \nimplemented\n a cross-functional information security program to assess, identify and manage material risks from cybersecurity risk, which includes seeking input from our employees, management, third-party vendors, the Audit Committee of the Board of Directors (“Audit Committee”) and the Board of Directors.\n \nOur information security program’s ultimate goal is preventing cybersecurity incidents to the extent feasible, while simultaneously increasing our system resilience to minimize the business impact should an incident occur. In the event of an identified cybersecurity incident, we have developed a detailed cybersecurity incident response process, which outlines the steps to be followed from incident detection, analysis, containment, eradication, recovery and notification, including notifying functional areas (e.g. information technology, legal, finance, operations, privacy), as well as senior leadership and the Audit Committee, as appropriate. In certain instances, incidents are escalated to certain members of our legal team who are responsible for, among other things, the accurate and timely disclosure of material cybersecurity incidents required under federal securities laws, including making the materiality determination and approving related securities disclosures.\nRisk Management and Strategy\nOur information security program devotes significant resources to cybersecurity and risk management processes to adapt to the changing cybersecurity landscape and respond to emerging threats in a timely and effective manner. We regularly assess the threat landscape and take a holistic view of cybersecurity risks, with a layered cybersecurity strategy based on prevention, detection and response. Our information security program leverages the National Institute of Standards and Technology (NIST) and International Organization for Standardization (ISO) 27001 frameworks choosing to organize our cybersecurity risks into five categories: identify, protect, detect, respond and recover. This does not imply that we meet any particular technical standards, specifications, or requirements, only that we use the NIST and ISO frameworks as a guide to help us identify, assess, and manage cybersecurity risks relevant to our business.\nOur information security program is integrated into our overall enterprise risk management program. Our information security program includes, among other things: \n•\ncybersecurity incident response;\n•\nvulnerability management;\n35\n•\nantivirus and malware protection;\n•\ntechnology compliance and risk management; \n•\nencryption; \n•\nidentity and access management; \n•\napplication security; and\n•\nsecurity monitoring. \nOur information security program also includes an information security awareness program, which includes annual training regarding our acceptable use and information classification and handling policies, regular phishing campaigns complemented by additional employee training as appropriate, and communications and companion trainings to keep users informed on current events. \nOur information security team engages third-party services to conduct evaluations of our security controls, including penetration testing and independent audits.\n Annually, an external auditor conducts a System and Organization Controls (“SOC”) type 2 audit covering the security principle for systems supporting our products. \nOur assessment of risks associated with the use of third-party vendors is part of our overall cybersecurity risk management framework.\n If a third-party vendor is unable to provide a SOC 1 or SOC 2 report, our information security team takes additional steps to assess its cybersecurity preparedness and our initiation or continued engagement with it. Additionally, third-party vendors are required to include security and privacy addenda to our contracts where determined applicable and are reassessed periodically as necessary depending on the risk level that has been assigned to the third-party vendor. Our legal team also requires that our third-party vendors report cybersecurity incidents to us so the impact of the incident on us can be assessed. \nAs of the date of this Annual Report on Form 10-K, we have \nnot identified\n any risks from known cybersecurity threats, including as a result of any previous cybersecurity incidents, that have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations or financial condition. Notwithstanding the approach we take to cybersecurity, we may not successfully prevent or mitigate cybersecurity incidents that could have a material adverse effect on us. While we maintain cybersecurity insurance, the costs related to cybersecurity threats or disruptions may not be covered or, if covered, fully insured. \nFor a discussion of our cybersecurity-related risks, see Part I,"
}