{
  "ticker": "ALLE",
  "cik": "0001579241",
  "company_name": "Allegion plc",
  "filing_date": "2025-02-18",
  "accession": "0001579241-25-000008",
  "primary_doc": "alle-20241231.htm",
  "item1_text": "Item 1.\n    \nBUSINESS\nOverview\nAllegion plc (\"Allegion,\" \"we,\" \"us\" or \"the Company\") is a leading global provider of security products and solutions that keep people and assets safe and secure in the places they live, learn, work and connect. We pioneer safety and security to create a safer and more accessible world. Central to our work is partnering and developing ecosystems to create flawless, seamless access experiences and enable an uninterrupted and secure flow of people and assets. We offer an extensive and versatile portfolio of security and access control security products and solutions across a range of market-leading brands. Our experts across the globe deliver high-quality hardware, software, services and systems, and we use our deep expertise to serve as trusted partners to end-users who seek customized solutions to their security needs.\nAllegion Principal Products and Services\nDoor controls, door control systems, and exit devices\nDoors, glass and door systems, and accessories\nElectronic security products and access control systems, including time, attendance and workforce productivity \nLocks, locksets, portable locks, and key systems\nServices and software\nSecurity and access control security products and solutions are critical elements in every building and home. Many door openings are configured to maximize a room’s particular form and function while also meeting local and national building and safety code requirements and end-user security needs. Most buildings have multiple door openings, each serving its own purpose and requiring different specific access control solutions. Each door must fit exactly within its frame, be prepared precisely for its hinges, synchronize with its specific lockset and corresponding latch and align with a specific key to secure the door. Moreover, with the growing adoption of connected hardware and software solutions, security products – including credentials – are increasingly linked electronically, integrated into access control software and popular consumer technology platforms and controlled with mobile applications, creating additional functionality and complexity.\nWe believe our ability to deliver a wide range of solutions that can be custom configured to meet end-users’ security needs is a key driver of our success. We accomplish this with: \n•\nOur extensive and versatile product and service portfolio, combined with our deep expertise, which enables us to deliver the right products and solutions to meet diverse security and functional specifications and to successfully and securely integrate into leading technologies and systems; \n•\nOur consultative approach and expertise, which enables us to develop the most efficient and appropriate building security and access control specifications to fulfill the unique needs of our end-users and their partners, including architects, designers, security consultants, contractors, homebuilders and engineers;\n•\nOur access to and management of key channels in the market, which is critical to delivering our products in an efficient and consistent manner; and \n•\nOur enterprise excellence capabilities, including our global manufacturing operations and agile supply chain, which facilitate our ability to deliver specific product and system configurations to end-users and consumers worldwide, quickly and efficiently. \nWe believe the security products industry will continue to benefit from several global macroeconomic trends, including:\n•\nExpected growth in global electronic and electromechanical products and solutions as end-users adopt newer technologies in their facilities and homes;\n•\nHeightened awareness of security and privacy requirements;\n•\nIncreased focus and adoption of mobile technology; and\n•\nThe shift to a digital, interconnected and increasingly interoperable environments that require a strong ecosystem of partners.\nWe operate in and report financial results for two segments: Allegion Americas and Allegion International, the latter of which provides security and access control security products, services and solutions primarily throughout Europe, Asia and Oceania. We sell our products and solutions under the following brands:\n4\nTable of Contents\n5\nTable of Contents\n6\nTable of Contents\nWe sell a wide range of security and access control solutions for end-users in commercial, institutional and residential facilities worldwide, including the education, healthcare, government, hospitality, retail, commercial office and single and multi-family residential markets. Our leading brands include CISA®, Interflex®, LCN®, Schlage®, SimonsVoss®, and Von Duprin®.\nDuring the year ended December 31, 2024, we generated Net revenues of $3,772.2 million and Operating income of $780.7 million. \nHistory and Developments\nWe were incorporated in Ireland on May 9, 2013, to hold the commercial and residential security businesses of what was then Ingersoll Rand plc (\"Ingersoll Rand\"). On December 1, 2013, we became a stand-alone public company after Ingersoll Rand completed the separation of these businesses from the rest of Ingersoll Rand via the transfer of these businesses from Ingersoll Rand to us and the issuance by us of ordinary shares directly to Ingersoll Rand’s shareholders. Our security businesses have long and distinguished operating histories. Several of our brands were established more than 100 years ago, and many originally created their categories: \n•\nVon Duprin, established in 1908, was awarded the first exit device patent;\n•\nSchlage, established in 1920, was awarded the first patents granted for the cylindrical lock and the push button lock; \n•\nLCN, established in 1926, created the first door closer; \n•\nCISA, established in 1926, devised the first electronically controlled lock; \n•\nSimonsVoss, established in 1995, created the first keyless digital transponder; and\n•\nStanley Access Technologies patented the world's first hands-free door operator in 1931.\nWe have built upon these founding legacies since our entry into the security products market through the acquisition of Schlage, Von Duprin and LCN. Today, we continue to develop, acquire and introduce innovative products.\n7\nTable of Contents\nIn 2018, we announced the formation of Allegion Ventures to invest in and help accelerate the growth of companies that have innovative, digital-first technologies and products such as touchless access and workspace monitoring solutions that complement our core business solutions. Building on this success, in December 2021, Allegion Ventures announced a second fund with an additional allocation of $100 million to focus on investing in technologies like artificial intelligence, video monitoring, machine learning and cybersecurity. \nRecent examples of successful product launches by Allegion are illustrated in the table below:\nProducts and Services\nBrands\nYear\nInnovation\nDoor controls, door control systems, and exit devices\nCISA, \nStanley Access Technologies, Von Duprin\n2023/2024\nCISA Multitop Matic Exit, a secondary lock for single and double leaf aluminum and iron panic doors, brings to market the only \"Made in Italy\" counter-lock featuring a long faceplate. Enables the automatic and secure locking of the main leaf against the door jam. \nStanley Access Technologies new automatic door/window solution for increased efficiencies for drive-through restaurants (DuraGlide DT). Telescopic manual and automatic version of ICU doors, providing the biggest clear door opening in the industry, proprietary handle design and the slimmest header (ProCare 8500). More energy-efficient and robust hurricane-rated sliding doors (DuraStorm Class E).\nVon Duprin 70 series delivering both performance and value at a medium price point and is ideal for heavy duty warehouse, industrial, office, multifamily, retail and hospitality applications.\nDoors, glass and door systems, and accessories\nTGP, Unicel\n2023/2024\nSmoke-rated partition featuring doors, sidelites/transoms and standalone windows suitable for enclosed elevator lobbies in multifamily buildings.  It is comprised of glass, frames and hardware and is the first system fully tested to UL 1784 (TGP SmokeSafe™ Window & Door System). \nNorth America’s first fire-rated full-lite door system certified to forced-entry standards (TGP TGProtect™ FR System). \nUL Certification of American Architectural Manufacturers Association (AAMA) 501.8 human impact resistant curtain wall using durable SentryGlas Plus (SGP) laminated glass (Unicel). \n8\nTable of Contents\nProducts and Services\nBrands\nYear\nInnovation\nElectronic security products and access control systems, including time, attendance, and workforce productivity\nGainsborough,Schlage, SimonsVoss, \n2023/2024\nSchlage XE360 series electronic lock is the next generation wireless lock from Schlage, designed specifically for multifamily properties. It delivers innovation, intelligence and reliability wrapped in a modern, sleek design for a variety of lock applications (mortice, tubular and exit device).   \nSchlage, in collaboration with Airbnb, was the first to launch the “airkey” integration, connecting Schlage smart locks and Airbnb accounts for easy guest check-ins. \nSchlage Encode Smart WiFi Lever is for use in doors without a deadbolt; connects to home WiFi and pairs with the Schlage app.  \nGainsborough Freestyle Trilock now has built-in Wi-Fi, no longer needing a separate bridge to communicate to the router. The latest version of this residential product includes Matter over Thread - the first smart lock in Australia to feature this technology.\nNarrow profile smart lock for Australia and New Zealand for use on aluminum and timber doors, utilizing the Schlage Breeze app (Schlage Artus). Next-generation smart entry door lock for the New Zealand market, operating on the Schlage Breeze app and offering a retrofit solution to Schlage S-6000 and competitor products (Schlage Resolute). \nSimonsVoss AX2Go, a BLE-based mobile app for iOS and Android, supporting the same user experience, regardless the OS of the smartphone. Users can place unlocked smartphone on the lock and the app will send the needed data in the background.\nSimonsVoss PinCode keypad AX, a BLE-based pincode keypad suitable for communication with SimonsVoss based AX products, with a range up to 1.5 meters. \nLocks, locksets, portable locks, and key systems\nBricard, Legge\n2023/2024\nBricard Evidence handle range for commercial and residential markets, with an exclusive and unique rose fixation and adjustment design, functionality and finishes.   \nBricard Bi-Pass key is equipped with an integrated RFID tag, enabling seamless operation of both mechanical and electronic access control devices.\nNext generation of multi-function mortice locks, 991 Multi-Function Mortice Lock Series (Legge), allows easy conversions and anti-lockout function. \nServices and software\nSimonsVoss, Zentra\n2023/2024\nSimonsVoss AXM Plus Software, first on-premise software variant with an optional cloud con\nnection, to give customers the opportunity to deploy mobile credentials in a virtual networked environment.\nMultifamily access control solution providing a turnkey, simple, secure and smart offering of software and integrated hardware covering all access needs for the building (Zentra). \n9\nTable of Contents\nIndustry and Competition \nWe serve customers within institutional, commercial and residential construction and remodeling markets throughout North America, Europe, Asia and Oceania. We expect the security products industry will continue to benefit from favorable trends such as increased concerns about safety and security, and technology-driven innovation that enables seamless access and a better user experience as people and assets traverse multiple locations and facilities. Further, we expect continued growth in connected security products and solutions as end-users continue to adopt newer technologies, including mobile solutions and artificial intelligence, in their facilities and single and multi-family homes.\nThe security products markets are highly competitive and fragmented throughout the world, with a number of large multi-national companies and thousands of smaller regional and local companies. This high degree of fragmentation primarily reflects local regulatory requirements and highly variable end-user needs. We believe our principal global competitors are Assa Abloy AB and dormakaba Group. We also face competition in various markets and product categories throughout the world, including Fortune Brands Innovations, Inc. in the North American residential market. As we move into more technologically advanced product categories, we may also compete against new, more specialized competitors.\nOur success depends on a variety of factors, including brand and reputation, knowledge and expertise in our industry, product breadth, innovation, integration with popular technology platforms, quality and delivery capabilities, price and service capabilities. As many of our businesses sell through distribution, our success also depends on building and partnering with a strong channel network. We compete based on the breadth, innovation and quality of our products and solutions, pricing, our ability to custom-configure solutions to meet individual end-user requirements and our global supply chain.\nProducts and Services\nWe offer the following extensive and versatile portfolio of security and access control products and solutions across a range of market-leading brands:\n•\nDoor controls, door control systems, and exit devices\n: An extensive portfolio of life-safety products and solutions generally installed on fire doors and facility entrances and exits. Exit devices, also known as panic hardware, provide rapid egress to allow building occupants to exit safely in an emergency. Door controls and systems include mechanical door closers, automatic door operators, as well as high-performance interior and storefront door systems. In addition, we offer a full range of automatic entrance solutions, including sliding, swing, folding and ICU doors, as well as an array of sensors, controls and security options for commercial and institutional buildings;\n•\nDoors, glass and door systems, and accessories\n: A portfolio of hollow metal doors and frames, glass and specialty door systems, as well as a variety of additional security products and components, including hinges, door pulls, door stops, bike lights, louvers, weather stripping, thresholds and other accessories, as well as certain bathroom fittings and accessibility aids;\n•\nElectronic security products and access control systems, including time, attendance and workforce productivity\n: A broad range of electronic locks, electronic door closers and exit devices, access control products and systems, credentials and credential readers and accessories, including Bluetooth Low Energy, Power over Ethernet and cloud-based solutions, including products designed to help business customers manage and monitor workforce access, attendance and employee scheduling;\n•\nLocks, locksets, portable locks, and key systems\n: A broad array of cylindrical, tubular and mortice door locksets, security levers and master key systems that are used to protect and control access and a range of portable security products, including bicycle, small vehicle and travel locks; and\n•\nServices and software\n: Our Stanley Access Technologies business offers extensive planned inspection, maintenance and repair services for its automatic entrance solutions throughout the U.S. and Canada. Additionally, we offer software as a service (\"SaaS\") offerings throughout the U.S. and internationally, including access control, platform integration and workforce management solutions through our Interflex business. We also offer ongoing aftermarket services, design and installation offerings and locksmith services in select locations.\nCustomers\nWe sell most of our products and solutions through distribution and retail channels, including specialty distribution, e-commerce and wholesalers. We have built a network of channel partners that help our customers choose the right solution to meet their security needs and help commercial and institutional end-users fulfill and install orders. We also sell through a variety of retail channels, including large do-it-yourself home improvement centers, multiple online and e-commerce platforms, as well as small, specialty showroom outlets. We work with our retail partners on developing marketing and merchandising strategies to maximize their sales per square foot of shelf space. Through a few of our businesses, most notably Stanley Access Technologies, Interflex and our Global Portable Security brands, we also provide products and services directly to end-users.\nOur 10 largest customers represented approximately 27% of our total Net revenues in 2024. No single customer represented 10% or more of our total Net revenues in 2024.\n10\nTable of Contents\nSales and Marketing\nIn markets where we sell through commercial and institutional distribution channels, we employ sales professionals around the world who work with a combination of end-users, security professionals, architects, contractors, engineers and distribution partners to develop specific, custom-configured solutions to meet our end-users’ needs. Our field sales professionals are assisted by specification writers who work with architects, engineers and consultants to help design door openings and security systems to meet end-users’ functional, aesthetic and regulatory requirements. Both groups are supported by dedicated customer care and technical sales-support specialists worldwide. We also support our sales efforts with a variety of marketing efforts, including trade-specific advertising, cooperative distributor merchandising, digital marketing and marketing at a variety of industry trade shows.\nIn markets where we sell through retail and homebuilder distribution channels, we have teams of sales, merchandising and marketing professionals who help drive brand and product awareness through our channel partners and to consumers. We utilize a variety of advertising and marketing strategies, including traditional consumer media, retail merchandising, digital marketing, retail promotions and builder and consumer trade shows, to support these teams. \nWe also work actively with several industry bodies around the world to help promote effective and consistent safety and security open platform standards. For example, we are members of the American Association of Automatic Door Manufacturers (AAADM), Builders Hardware Manufacturers Association (BHMA), Connectivity Standards Alliance (CSA), Construction Specification Institute, Door and Hardware Institute (DHI), FiRa Consortium, National Association of State Fire Marshals (NASFM), Partner Alliance for Safer Schools (PASS), Physical Security Interoperability Alliance (PSIA), Security Industry Association (SIA), Security Technology Alliance, Z-Wave Alliance, The European Federation of Associations of Locks and Builders Hardware Manufacturers (ARGE), ASSOFERMA (Italy), BHE (Germany), Door Hardware Federation (UK), Open Security Standards Association (Germany) and UNIQ (France).\nProduction and Distribution\nWe manufacture products in several geographic markets around the world. We operate 34 principal production and assembly facilities – 21 in our Allegion Americas segment and 13 in our Allegion International segment. We own 16 of these facilities and lease the others. Our strategy is to produce in the region of use, wherever appropriate, to allow us to be closer to the end-user and increase efficiency and timely product delivery. Much of our U.S. based residential portfolio is manufactured in the Baja region of Mexico under the Maquiladora, Manufacturing and Export Services Industry (\"IMMEX\") program. In managing our network of production and assembly facilities, we focus on continuous improvement in customer experience, employee health and safety, productivity, resource utilization and operational excellence.\nWe distribute our products through a broad network of channel partners. In addition, third-party manufacturing and logistics providers perform certain manufacturing, storage and distribution services for us to support certain parts of our manufacturing and distribution network.\nRaw Materials\nWe continue to support our region-of-use production strategy with corresponding region-of-use supplier partners for much of our supply base. Our global and regional commodity teams work with production leadership, product management and materials management teams to source materials for production. Where appropriate, we may enter fixed-cost contracts to lower overall costs.\nWe purchase a wide range of raw materials, including steel, zinc, brass and other non-ferrous metals, as well as other parts and components, such as electronic components, to support our production facilities. \nIntellectual Property\nIntellectual property, inclusive of certain patents, trademarks, copyrights, know-how, trade secrets and other proprietary rights, is important to our business. We create, protect and enforce our intellectual property investments in a variety of ways. We work actively in the U.S. and internationally to try to ensure the protection and enforcement of our intellectual property rights. We use trademarks on nearly all of our products and believe such distinctive marks are an important factor in creating a market for our goods, in identifying us and in distinguishing our products from others. We consider our CISA, Interflex, LCN, Schlage, SimonsVoss, Von Duprin and other associated trademarks to be among our most valuable assets, and we have registered these trademarks in a number of countries. Although certain proprietary intellectual property rights are important to our success, we do not believe we are materially dependent on any particular patent or license, or any particular group of patents or licenses. \nFacilities\nWe operate through a broad network of sales offices, engineering centers, 34 principal production and assembly facilities and several distribution centers throughout the world. Our active properties represent approximately 7.7\n \nmillion square feet, of which approximately 44%\n \nis leased. The following table shows the location of our principal production and assembly facilities under the business segments in which they operate:\n11\nTable of Contents\nProduction and Assembly Facilities\nAllegion Americas\nAllegion International\nBlue Ash, Ohio\nAuckland, New Zealand\nChino, California\nBlackburn, Australia\nEnsenada, Mexico\nBrooklyn, Australia\nEverett, Washington\nClamecy, France\nFarmington, Connecticut\nDurchhausen, Germany\nGreenfield, Indiana (2)\nFaenza, Italy\nIndianapolis, Indiana\nFeuquieres, France\nIrving, Texas\nMonsampolo, Italy\nJurong, Singapore\nOsterfeld, Germany\nLongueuil, Canada\nRenchen, Germany\nMcKenzie, Tennessee\nValencia, Spain\nMississauga, Canada\nVeenendaal, Netherlands\nPerrysburg, Ohio\nZawiercie, Poland\nPico Rivera, California\nPrinceton, Illinois\nQueretaro, Mexico\nSecurity, Colorado\nSnoqualmie, Washington\nTecate, Mexico\nTijuana, Mexico\nResearch and Development\nWe are committed to investing in our research and development capabilities with a focus on innovations that will deliver growth through the introduction of new products and solutions. In addition, we invest in initiatives that continuously drive improvements in product cost, quality, safety and sustainability.\nOur research and development resources are managed globally to permit leveraging of innovative technologies and product platforms across businesses as well as to optimize development cost and resource efficiency. Our regionally located resources leverage expertise in local standards and configurations and apply those to adapt products for the benefit of our customers. Further, we operate a global technology center in Bengaluru, India, which augments and supports our regional engineering and technology teams.\nSeasonality\nOur business experiences seasonality that varies by product and service line. For instance, as more construction and do-it-yourself projects occur during the second and third calendar quarters in the Northern Hemisphere, our security product sales related to those projects are typically higher in those quarters than in the first and fourth quarters. However, certain other businesses typically experience higher sales in the fourth quarter due to demand for services and project timing. \nHuman Capital\nOur human capital strategy is based on our values and is foundational to achieving our business strategy. Our workplace culture is based on practices that reward performance, provide growth and development opportunities, and support employees with competitive compensation and benefits packages. As a testament to this, Allegion received the 2024 Gallup Exceptional Workplace Award. This award recognizes the most engaged workplace cultures in the world. \nAs of December 31, 2024, we had approximately 14,400 employees worldwide. Approximately 48% of employees are employed within the U.S. and approximately 52% based outside the U.S. Among our U.S. based employees, approximately 14% were subject to collective bargaining agreements with various labor unions. Outside the U.S., we have employees in certain countries, particularly in Europe, that are represented by an employee representative organization, such as a works council. Our employee base is supplemented by contingent labor where business demand fluctuates or we experience short-term needs for specialized skills. We believe our relations with our workforce in both unionized and non-unionized settings are generally positive.\n12\nTable of Contents\nTalent Attraction and Retention\nOur employer brand creates a differentiated employee experience intended to attract and retain the right talent for Allegion. Our talent attraction efforts are focused on and highlight a culture that reflects our core values, Allegion leadership behaviors and business objectives. \nWe want to attract talent with core capabilities relevant to our long-term corporate business strategy: customer focus, innovation, partnering, pace and agility and collaboration. We use a variety of recruitment tactics to ensure a strong base of labor for manufacturing operations and to build the base of talent with these capabilities. Throughout the recruitment cycle, we provide a technology-enabled seamless experience for internal and external candidates and hiring managers. Our compensation and benefit programs are designed to be competitive in the geographies where we work, including a total rewards package (which varies by country/region) that includes hourly and salaried compensation, performance-based incentive and long-term equity incentive plans, retirement, insurance and government social welfare programs, disability and family leave, health and wellness programs, education benefits to pursue degrees and certifications and additional offerings to support financial stability and personal planning.\nTalent Development and Succession Planning\nTalent development and succession planning are key components of the Allegion Operating System, which supports governance, reporting processes and management of the business. Our performance management system includes annual performance reviews for all permanent salaried employees. Talent development and succession planning takes place at all levels of the organization and is supported through individual career mapping, assessment of performance and talent pipeline planning up to and including the executive leadership team (\"ELT\"). As part of their quarterly business review, the ELT reviews talent development, focusing on developing a diverse succession pipeline. These cross-functional reviews highlight individuals who are ready for new opportunities, individuals who are on a special assignment or project and individuals early in their career that demonstrate emerging leadership skills.\nLearning and Development \nOpportunities for ongoing learning and development are delivered to employees through structured coursework, on-site and expert-led training and experiential, applied development. The Allegion Academy is offered globally, supporting multiple languages and providing thousands of self-guided online courses. We offer programs to provide successive levels of development, including re-skilling and upskilling existing employees, as well as strengths-based leadership curriculum and global programs for employee mentoring and coaching. \nCulture and Engagement\nCulture and engagement are also parts of the Allegion Operating System. Engagement surveys provide a mechanism to gather direct employee feedback, give team leaders insights on potential areas of focus and allow leaders to prioritize and act on their teams’ foundational, inclusion, growth and development needs. Strengths-based leadership is an element of our commitment to inclusion: the more employees understand their own strengths, the better equipped they are to add value and appreciate the contributions of diverse members of their teams.\nWe believe in fundamental standards that support our employees, while building and maintaining diverse and inclusive workplaces. Employee-led resource and affinity groups provide opportunities for women's leadership, early career professionals, allies and members of the LGBTQIA+, Black, veteran and Hispanic communities, among others.\nEmployee Health and Safety \nEmployee health and safety are top priorities and integral to the Company's growth strategy. ‘Be safe, be healthy’ is a core organizational value in our proactive safety culture.\nThe ELT, with oversight from our Board of Directors, is responsible for risk management, employee accountability, safety hazard recognition and executing safety initiatives. We monitor leading and lagging indicators related to health and safety as part of our ongoing management of the Allegion Operating System and regularly update the Corporate Governance and Nominating Committee of the Board of Directors on key developments and employee health and safety topics.\nRegulatory Matters\nWe are subject to a variety of federal, state and local laws and regulations, both within and outside the U.S., relating to Environmental, Health and Safety (\"EHS\") matters. We are committed to conducting business in a safe, environmentally responsible and sustainable manner, in compliance with all applicable EHS laws and regulations, as well as some applicable voluntary programs and collective agreements. We continously work to promote and protect the health and safety of our environment, associates, customers, contractors and members of our local communities worldwide.\n \nWe operate with principles and practices that support our commitments, including:\n•\nIntegrating sound EHS and sustainability strategies in all elements of our business, we set quantitative metrics and targets to provide clear accountability and to monitor and measure improvement in EHS performance;\n13\nTable of Contents\n•\nConducting periodic, formal evaluations and audits of our compliance status, while also routinely reviewing our objectives and metrics;\n•\nFostering a workplace culture where everyone at Allegion is responsible for safety;\n•\nImplementing measures to enhance internal and external stakeholder awareness of our environmental management policy and its impacts;\n•\nEstablishing prioritization and action plans to continuously improve our EHS and sustainability management systems and performance; this includes reduction in use of natural resources, minimization of waste and prevention of pollution, as well as prevention and elimination of workplace accidents, injuries and risks;\n•\nDesigning, operating and maintaining our facilities in a manner that minimizes negative EHS and sustainability impacts;\n•\nUsing materials responsibly, including, where feasible, the recycling and reuse of materials; and\n•\nActing in a way that shows sensitivity to community concerns about EHS and sustainability issues.\nWe recognize that these principles are critical to our future success. We are currently engaged in site investigations and remediation activities to address environmental cleanup from past operations at current and former production facilities. We also regularly evaluate our remediation methods that are in addition to, or in replacement of, those we currently utilize based upon enhanced technology and regulatory changes. We are sometimes a party to environmental lawsuits and claims and have, from time to time, received notices of potential violations of environmental laws and regulations from the U.S. Environmental Protection Agency (\"EPA\") and similar state authorities. We have also been identified as a potentially responsible party (\"PRP\") for cleanup costs associated with off-site waste disposal at federal Superfund and state remediation sites. For all such sites, there are other PRPs and we believe our involvement is minimal.\nIn estimating our liability, we have assumed that we will not bear the entire cost of remediation of any site to the exclusion of other PRPs who may be jointly and severally liable. The ability of other PRPs to participate has been taken into account, based on our understanding of the parties’ financial condition and probable contributions on a per site basis. Additional lawsuits and claims involving environmental matters are likely to arise from time to time in the future. For a further discussion of our potential environmental liabilities, see Notes 2 and 21 to the Consolidated Financial Statements. \nEnvironmental, social and governance (\"ESG\") factors important to our business are embedded into our values and our leadership's commitment to create a workplace culture committed to doing the right thing in the right way. Our Board of Directors oversees the Company's ESG strategies, goals and performance, and both our leadership and employees all have a responsibility to uphold excellence, as we believe our commitment to ESG matters helps advance engagement and business vitality. Additional information about our ESG priorities and progress may be found in the ESG section of our website (found under the ESG tab at \nwww.allegion.com\n). The website highlights our ongoing progress and advancements in ESG matters, and includes our materiality matrix of ESG priorities.\nAvailable Information\nWe are required to file annual, quarterly and current reports, proxy statements and other documents with the SEC under the Exchange Act. The SEC maintains an Internet website that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC. The public can obtain any documents that are filed by us at www.sec.gov.\nIn addition, the Company's Annual Report on Form 10-K, as well as future quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to all of the foregoing reports, are made available free of charge on our investor website (investor\n.allegion.com\n) as soon as reasonably practicable after such reports are electronically filed with or furnished to the SEC. \nThroughout this Annual Report on Form 10-K, we refer to additional information that may be found or is available on our websites. The information contained on, or that may be accessed through, our websites is not incorporated by reference into, and is not part of, this Annual Report on Form 10-K.\n14\nTable of Contents"
}