{
  "ticker": "AME",
  "cik": "0001037868",
  "company_name": "AMETEK INC/",
  "filing_date": "2025-02-20",
  "accession": "0001037868-25-000012",
  "primary_doc": "ame-20241231.htm",
  "item1_text": "Item 16.\nForm 10-K Summary\n86\nSIGNATURES\n87\n1\nTable of Contents\nPART I\nItem 1.    Business\nGeneral Development of Business \nAMETEK, Inc. (“AMETEK” or the “Company”) is incorporated in Delaware. Its predecessor was originally incorporated in Delaware in 1930 under the name American Machine and Metals, Inc. AMETEK is a leading global manufacturer of electronic instruments and electromechanical devices with operations in North America, Europe, Asia and South America. AMETEK maintains its principal executive offices at 1100 Cassatt Road, Berwyn, Pennsylvania, 19312. Listed on the New York Stock Exchange (symbol: AME), the common stock of AMETEK is a component of the Standard and Poor’s 500 and the Russell 1000 Indices.\nProducts and Services \nAMETEK’s products are marketed and sold worldwide through two operating groups: Electronic Instruments (“EIG”) and Electromechanical (“EMG”). Electronic Instruments is a leader in the design and manufacture of advanced instruments for the process, power and industrial, and aerospace markets. Electromechanical is a differentiated supplier of precision motion control solutions, highly engineered medical components and devices, thermal management systems, specialty metals and electrical interconnects. Its end markets include aerospace and defense, medical, automation and other industrial markets. \nCompetitive Strengths \nManagement believes AMETEK has significant competitive advantages that help strengthen and sustain its market positions. Those advantages include: \nSignificant Market Share\n.    AMETEK maintains significant market share in a number of targeted niche markets through its ability to produce and deliver high-quality, differentiated products at competitive prices. EIG has significant market positions in niche segments of the process, power and industrial, and aerospace markets. EMG holds significant positions in niche segments of the aerospace and defense, automation and medical markets.\nTechnological and Development Capabilities\n.    AMETEK believes it has certain technological advantages over its competitors that allow it to maintain its leading market positions. Historically, the Company has demonstrated an ability to develop innovative new products and solutions that support customer needs. AMETEK has consistently added to its investment in research, development and engineering, and improved its new product development efforts with the adoption of Design for Six Sigma and Value Analysis/Value Engineering methodologies. These have improved the pace and quality of product innovation and resulted in the introduction of a steady stream of new products across all of AMETEK’s businesses and aligned with attractive secular growth markets.\nEfficient and Flexible Manufacturing Operations.    \nThrough its Operational Excellence initiatives, AMETEK has established a lean and flexible manufacturing platform for its businesses. In its effort to achieve best-cost manufacturing, AMETEK has operating facilities, as of December 31, 2024, in China, Czechia, Malaysia, Mexico, and Serbia. These facilities offer proximity to customers and provide opportunities for increasing international sales. Acquisitions also have allowed AMETEK to achieve operating synergies by consolidating operations, product lines and distribution channels, benefiting both of AMETEK’s operating groups.\nExperienced Management Team\n.    Another component of AMETEK’s success is the strength of its management team and that team’s commitment to improving Company performance. AMETEK senior management has extensive industry experience and an average of approximately 23 years of AMETEK service. The management team is focused on delivering strong, consistent and profitable growth, growing \n2\nTable of Contents\nshareholder value, and creating a sustainable future for all stakeholders. Individual performance is tied to financial results through Company-established stock ownership guidelines and equity incentive programs.\nBusiness Strategy \nAMETEK is committed to achieving earnings growth through the successful implementation of the AMETEK Growth Model. The goal of the Growth Model is high single digit annual percentage growth in sales and double digit annual percentage growth in earnings per share over the business cycle, strong cash flow generation, and a superior return on total capital. Other financial initiatives have been or may be undertaken, including public and private debt or equity issuance, bank debt refinancing, local financing in certain foreign countries and share repurchases. \nAMETEK’s Growth Model integrates the four growth strategies of Operational Excellence, Strategic Acquisitions, Global and Market Expansion, and New Product Development with a focus on cash generation and capital deployment. \nOperational Excellence.    \nOperational Excellence is AMETEK’s cornerstone strategy for accelerating growth, improving profit margins and strengthening its competitive position across its businesses. Operational Excellence focuses on initiatives to drive increased organic sales growth, improvements in operating   efficiencies and sustainable practices. It emphasizes team building and a participative management culture. AMETEK’s Operational Excellence strategies include lean manufacturing, global sourcing, Design for Six Sigma, Value Engineering/Value Analysis, growth kaizens, and digitalization. Each plays an important role in improving efficiency, enhancing the pace and quality of innovation and driving profitable sales growth. Operational Excellence initiatives have yielded lower operating and administrative costs, shortened manufacturing cycle times, resulted in higher cash flow from operations and increased customer satisfaction. They also have played a key role in achieving synergies with newly acquired companies.\nStrategic Acquisitions\n.    Acquisitions are a key to achieving the goals of the AMETEK Growth Model. Since the beginning of 2020 through December 31, 2024, AMETEK has completed 14 acquisitions with annualized sales totaling approximately $1.4 billion. AMETEK targets companies that offer a compelling strategic, technical and cultural fit. It seeks to acquire businesses in adjacent markets with complementary products and technologies. It also looks for businesses that provide attractive growth opportunities aligned with strong secular growth themes, often in new and emerging markets. AMETEK’s management team has developed considerable skill in identifying, acquiring and integrating new businesses. As it has executed its acquisition strategy, AMETEK’s mix of businesses has shifted toward those that are more highly differentiated and, therefore, offer better opportunities for growth and profitability.\nGlobal & Market Expansion\n.    AMETEK has experienced significant growth outside the United States, reflecting an expanding international customer base, investments in its global infrastructure and the attractive growth potential of its businesses in overseas markets. While Europe remains its largest overseas market, AMETEK has pursued growth opportunities worldwide, especially in key emerging markets. It has grown sales in Latin America and Asia by driving its global and market expansion strategy and initiatives. AMETEK also has expanded its sales, service, and engineering capabilities globally. Recently acquired businesses have further added to AMETEK’s international presence. \nNew Product Development\n.    New products are essential to AMETEK’s long-term growth. As a result, AMETEK has maintained a consistent investment in new product development and engineering. AMETEK's businesses help solve our customers' most complex challenges with differentiated technology solutions. In 2024, AMETEK added to its highly differentiated product portfolio with a range of new products across many of its businesses. \nAMETEK focuses on cash generation and capital deployment.  AMETEK generates strong cash flow given its asset-light business model and strong operational execution. This cash flow supports AMETEK’s capital \n3\nTable of Contents\ndeployment strategy with its primary focus on strategic, value-enhancing acquisitions. AMETEK is also committed to paying a consistently increasing cash dividend.\nAttracting, retaining, and developing talent is critical to the success and sustainability of the AMETEK Growth Model as our employees are responsible for successfully driving these strategies.\n2024 Overview\nOperating Performance\nIn 2024, the Company posted record sales, operating income, net income, diluted earnings per share, and operating cash flow.  The Company achieved these results from contributions from recent acquisitions, as well as the Company's Operational Excellence initiatives. See \"Results of Operations\" in Part II, Item 7 Management's Discussion and Analysis of Financial Condition and Results of Operations for further details.\nIn 2024, the Company achieved record sales of $6,941.2 million, an increase of 5.2% from 2023. Diluted earnings per share for 2024 were a record $5.93, an increase of $0.26 or 4.5%, compared with $5.67 per diluted share in 2023.\nRecent Acquisitions\nAMETEK spent $117.5 million in cash in October 2024, net of cash acquired, to purchase Virtek Vision International (\"Virtek\"), a leading provider of advanced laser-based projection and inspection systems. \nFinancing\nIn the third quarter of 2024, the Company paid in full, at maturity, a $300 million in aggregate principal amount of 3.73% senior notes.\nRecently Adopted Accounting Pronouncement\nIn November 2023, the FASB issued ASU No. 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures (“ASU 2023-07”), which requires disclosure of significant segment expenses and other segment items on an annual and interim basis under ASC 280. The Company retrospectively adopted ASU 2023-07, effective December 31, 2024, and the adoption resulted in additional disclosures in the Reportable Segments footnote.\nDescription of Business \nDescribed below are the products and markets of each reportable segment: \nEIG \nEIG is a leader in the design and manufacture of advanced analytical, test and measurement instruments for the process, aerospace, medical, research, power and industrial markets. \nEIG is a leader in many of the specialized markets it serves. Products supplied to these markets include process control instruments for the life sciences, pharmaceutical, semiconductor, automation, power, food and beverage, oil and gas, and petrochemical industries. It provides a growing range of instruments to the research and laboratory equipment, ultra-precision manufacturing, optics, medical, and test and measurement markets. It is a leader in power quality monitoring and metering, uninterruptible power systems, programmable power equipment, electromagnetic compatibility test equipment, sensors for gas turbines, dashboard instruments for heavy trucks, and instrumentation and controls for the food and beverage industries. EIG supplies the aerospace industry with aircraft \n4\nTable of Contents\nand engine sensors, monitoring systems, embedded computing systems, power supplies, fuel and fluid measurement systems, and data acquisition systems. \nIn many instances, EIG's products differ from or are technologically superior to its competitors’ products. EIG has achieved competitive advantage through continued investment in research, development and engineering to develop market-leading products and solutions that serve niche markets.\nIn 2024, 51% of EIG’s net sales were to customers outside the United States. At December 31, 2024, EIG employed approximately 11,600 people, of whom approximately 900 were covered by collective bargaining agreements. At December 31, 2024, EIG had operating facilities in the United States, the United Kingdom, Germany, Canada, Denmark, Finland, France, Switzerland, Argentina, Austria, Serbia, and Mexico. EIG also shares operating facilities with EMG in China, Serbia, and Mexico. \nProcess and Analytical Instrumentation Markets and Products \nProcess and analytical instrumentation sales represented 69% of EIG’s 2024 net sales. These businesses include process analyzers, emission monitors and spectrometers; elemental and surface analysis instruments; level, pressure and temperature sensors and transmitters; radiation measurement devices; level measurement devices; precision manufacturing systems; materials- and force-testing instruments; contact and non-contact metrology products; and clinical and educational communication solutions. Among the industries it serves are power generation; pharmaceutical manufacturing; medical and healthcare; research and development; water and waste treatment; renewable energy production, semiconductor manufacturing; natural gas distribution; emissions monitoring, and oil, gas, and petrochemical refining. Its instruments are used for precision measurement in a number of applications, including radiation detection, trace element and materials analysis, nanotechnology research, ultraprecise manufacturing, advanced optical metrology, and test and measurement.\nAcquired in October 2024, Virtek is a leading provider of advanced laser-based projection and inspection systems. Virtek's advanced 3D laser projectors, smart cameras, and quality control inspection systems complement the Company's existing Creaform business capabilities. \nAerospace and Power Instrumentation Markets and Products \nAerospace and Power Instrumentation sales represented 31% of EIG’s 2024 net sales. These businesses produce a wide array of instrumentation, systems and sensors for applications in the aerospace, power and industrial markets. \nThese businesses produce power monitoring and metering instruments, uninterruptible power supply systems and programmable power supplies used in a wide range of industrial settings. It is a leader in the design and manufacture of power measurement, quality monitoring and event recorders for use in power generation, transmission and distribution. These businesses provide uninterruptible power supply systems, multifunction electric meters, and highly specialized communications equipment for smart grid applications and renewable energy applications. It also offers precision power supplies and power conditioning products, and electrical immunity and EMC test equipment, sensors for electric vehicle testing, gas turbines, dashboard instruments for heavy trucks and other vehicles, and instrumentation and controls for the food and beverage industries. \nAMETEK’s aerospace products are designed to customer specifications and manufactured to stringent operational and reliability requirements. These products include airborne data systems, turbine engine temperature measurement products, vibration-monitoring systems, cockpit instruments and displays, fuel and fluid measurement products, embedded computing systems, and sensors and switches. AMETEK serves all segments of the commercial and military aerospace market, including commercial airliners, business jets, regional aircraft and helicopters. \nAMETEK operates in highly specialized aerospace market segments in which it has proven technological or manufacturing advantages versus its competition. Among its more significant competitive advantages is its 70-year-plus reputation as an established aerospace supplier. AMETEK has long-standing relationships with the world’s \n5\nTable of Contents\nleading commercial and military aircraft, jet engine and original equipment manufacturers and aerospace system integrators. AMETEK also is a leading provider of spare part sales, repairs and overhaul services to commercial aerospace. \nAcquired in October 2023, Amplifier Research is a leading provider of amplifiers and electromagnetic compatibility testing equipment. Amplifier Research's diverse product portfolio complements the Company's existing capabilities in the electromagnetic compatibility testing market. \nAcquired in August 2023, UEI is a designer and manufacturer of high-performance test, measurement, simulation and control solutions.  UEI's innovative solutions complement the Company's existing testing and data acquisition expertise.\nCustomers \nEIG is not dependent on any single customer such that the loss of that customer would have a material adverse effect on EIG’s operations. Approximately 6% of EIG’s 2024 net sales were made to its five largest customers. No single customer comprises more than 2% of net sales. \nEMG\nEMG is a leader in the design and manufacture of highly engineered medical components and devices, automation solutions, thermal management systems, specialty metals and electrical interconnects. EMG is a leader in many of the niche markets in which it competes. Products supplied to these markets include single-use and consumable surgical instruments, implantable components, and drug delivery systems used across a wide range of medical applications, advanced precision motion control solutions, which are used in a wide range of automation applications across the medical, semiconductor, aerospace, defense, and food and beverage industries, as well as highly engineered electrical connectors and electronics packaging used in aerospace and defense, medical, and industrial applications. \nEMG supplies high-purity powdered metals, strip and foil, specialty clad metals and metal matrix composites. EMG's heat exchangers provide electronic cooling and environmental control for the aerospace and defense and semiconductor industries. EMG's motors are widely used in commercial appliances, food and beverage machines, hydraulic pumps and industrial blowers. Additionally, EMG operates a global network of aviation maintenance, repair and overhaul (“MRO”) facilities. \nEMG designs and manufactures products that, in many instances, are significantly different from or technologically superior to competitors’ products. It has achieved competitive advantage through continued investment in research, development and engineering, efficiency improvements from operational excellence, acquisition synergies and improved supply chain management. \nIn 2024, 41% of EMG’s net sales were to customers outside the United States. At December 31, 2024, EMG employed approximately 9,500 people, of whom approximately 2,300 were covered by collective bargaining agreements. At December 31, 2024, EMG had operating facilities in the United States, the United Kingdom, China, Germany, France, Italy, Poland, Mexico, Serbia, Czechia, Malaysia, and Taiwan. EMG also shares operating facilities with EIG in China, Serbia, and Mexico. \nAutomation and Engineered Solutions Markets and Products \nAutomation and Engineered Solution sales represented 73% of EMG’s 2024 net sales. These businesses produce precision motion control solutions, brushless motors, blowers and pumps, heat exchangers and other electromechanical systems. These products are used in a wide variety of high-precision automation applications, including semiconductor equipment, and laboratory and medical equipment.  \n6\nTable of Contents\nAMETEK is a leader in highly engineered single-use and consumable surgical instruments, implantable components and drug delivery systems. Its electrical connectors and electronics packaging are designed specifically for harsh environments and highly customized applications, and are used to protect sensitive devices and mission-critical electronics. In addition, AMETEK is an innovator and market leader in specialized metal powder, strip, wire and bonded products used in medical, aerospace and defense, telecommunications, automotive and general industrial applications. \nAcquired in March 2023, Bison is a designer and manufacturer of custom motion control solutions.  Bison's engineering expertise and broad product portfolio complement the Company's existing motion control and automation solutions business.\nAcquired in December 2023, Paragon is a leading provider of highly engineered medical components and instruments.  Paragon's product portfolio includes single-use and consumable surgical instruments and implantable components sold to a diverse blue-chip customer base of leading medical device manufacturers.  Paragon expands the Company's presence in the MedTech space and provides access to new market segments with strong growth rates.\nAerospace Markets and Products \nAerospace sales represented 27% of EMG’s 2024 net sales. These businesses produce motor-blower systems and heat exchangers used in thermal management and other applications on a variety of military and commercial aircraft and military ground vehicles. In addition, these businesses provide the commercial and military aerospace industry with third-party MRO services on a global basis with facilities in the United States, Europe and Asia. \nCustomers \nEMG is not dependent on any single customer such that the loss of that customer would have a material adverse effect on EMG’s operations. Approximately 14% of EMG’s 2024 net sales were made to its five largest customers. No single customer comprises greater than 4% of net sales. \nMarketing \nAMETEK’s marketing efforts generally are organized and carried out at the business level. EIG makes use of specialized distributors and sales representatives to market its products along with a direct sales force for its technically sophisticated products. Within aerospace, the specialized customer base of aircraft and jet engine manufacturers is served primarily by direct sales engineers. Given the technical nature of its many products, as well as its significant market share, EMG conducts much of its domestic and international marketing activities through a direct sales force and makes some use of sales representatives and distributors, both in the United States and in other countries. \nCompetition \nIn general, AMETEK’s markets are highly competitive with competition based on technology, performance, quality, service and price. \nIn EIG’s markets, AMETEK believes it ranks as a leader in certain analytical measurement and control instruments, and power and industrial markets. It also is a major instrument and sensor supplier to commercial aviation. In process and analytical instruments, numerous companies compete in each market on the basis of product quality, performance and innovation. In power and industrial and in aerospace, AMETEK competes with a number of companies depending on the specific market segment. \nEMG’s businesses compete with a number of companies in each of its markets. Competition is generally based on product innovation, performance and price. There also is competition from alternative materials and processes.\n7\nTable of Contents\nAvailability of Raw Materials \nAMETEK’s reportable segments obtain raw materials and supplies from a variety of sources and generally from more than one supplier. For EMG, however, certain items, including various base metals and certain steel components, are available from only a limited number of suppliers. AMETEK believes its sources and supplies of raw materials are adequate for its needs. \nEnvironmental and Other Governmental Regulation\nAMETEK's operations and properties are subject to laws and regulations relating to environmental protection, including those governing air emissions, water discharges, waste management, and workplace safety. The Company uses, generates and disposes of hazardous substances and waste in its operations and could be subject to material liabilities relating to the investigation and clean-up of contaminated properties and related claims. The Company is required to conform our operations and properties to these laws and adapt to regulatory requirements in all countries as these requirements change. The Company has a robust Environmental Health and Safety program responsible for supporting its environmental monitoring and compliance efforts. In connection with acquisitions, the Company will assess potential material environmental liabilities, and determine regulatory and fiduciary obligations during the course of the due diligence process. In addition, new laws and regulations, the discovery of previously unknown contamination or the imposition of new requirements could increase costs or subject AMETEK to new or increased liabilities. \nInformation with respect to environmental matters is set forth in Note 13 to the Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nPatents, Licenses and Trademarks \nAMETEK owns numerous unexpired U.S. and foreign patents, including counterparts of its more important U.S. patents, in the major industrial countries of the world. It is a licensor or licensee under patent agreements of various types, and its products are marketed under various registered and unregistered U.S. and foreign trademarks and trade names. AMETEK, however, does not consider any single patent or trademark, or any group of them, essential either to its business as a whole or to either one of its reportable segments. The annual royalties received or paid under license agreements are not significant to either of its reportable segments or to AMETEK’s overall operations.\nSustainability and Human Capital Management\nSustainability\nAMETEK is committed to providing a consistent and excellent return to our stakeholders, all while maintaining a strong commitment to environmental stewardship, social responsibility, inclusion, and sound corporate governance. We believe that effectively prioritizing and managing our sustainability initiatives will help create long-term value and a better future for our stakeholders. \nOur Sustainability Report highlights our sustainability initiatives and is available on our website at https://www.ametek.com/who-we-are/sustainability.\nKey elements in the Company’s approach to sustainability include the following:\nCore Values.\n \nOur core values — Ethics and Integrity, Respect for the Individual, Inclusion, Teamwork, and Social Responsibility — remain the most critical components of our sustainability efforts. Sustainability is an integral aspect of the core values that guide the way we do business\n.\nUpholding Sound Governance\n. Our commitment to transparency, accountability, and ethical and responsible decision-making is demonstrated through our core values, corporate governance structure, compliance measures, and focus on sustainability oversight. Together, AMETEK’s governance structure underpins our distributed \n8\nTable of Contents\noperating structure and provides our colleagues with the foundation to advance sustainability initiatives across their businesses.\nProtecting Our Environment.\n   Our ongoing commitment to serve as environmental stewards and protect the environment for future generations is reflected in our proactive approach to environmental management and sustainability. From emissions reduction initiatives to optimizing resource consumption, we emphasize environmental protection in every facet of our operations. We are firmly committed to reducing our carbon footprint and have made outstanding progress toward our stated greenhouse gas emissions reduction target.  \nInvesting in Our People.\n   Our people are the most essential resource in driving AMETEK’s long-term success and in achieving our sustainability ambitions. AMETEK is committed to developing an inclusive culture to help power innovation, growth, and greater opportunities for all employees.  Through strategic investments in talent acquisition, learning and development, and employee well-being, we foster a culture of empowerment, innovation, and inclusivity, driving our collective success and sustainable growth.  We are continually expanding our employee development, engagement, and training initiatives to provide meaningful opportunities for personal and professional development. \nDriving Sustainable Product Solutions.\n   AMETEK is committed to advancing a low-carbon economy. Our growing portfolio of clean technology and sustainability-related solutions includes a wide range of products and solutions that have a positive, global environmental impact across a broad set of diverse end markets, supporting customers in achieving their sustainability goals and creating a more sustainable future. Through collaborative partnerships with our customers, we develop solutions which help reduce carbon emissions, promote renewable energy adoption, improve efficiency and productivity, and improve healthcare outcomes.\nPartnering with Our Communities\n.   We cultivate strong and lasting relationships with the communities in which we operate, actively contributing to their social and economic prosperity. Our charitable arm, the AMETEK Foundation, provides wide-ranging support to non-profit and educational organizations. Through employee volunteerism, financial support, and contributions from the AMETEK Foundation, we partner to strengthen the work of non-profit charities around the world.\nHuman Capital Management\nAs a global organization, we have seen firsthand that the innovation needed to solve our customers’ biggest challenges can only come from employees that are fully engaged and committed, and who have diverse perspectives and backgrounds. Our Board regularly receives updates and presentations on key topics, including sustainability, compliance, inclusion, and employee development and succession.\nOur executive management team reviews the key talent across our company and assesses the adequacy of talent to meet business challenges and future growth needs. We have an active Inclusion Council, which drives initiatives focused on mentorship, education and career guidance.\nWe have created a leadership development program for employees on track to become P&L leaders in the company. This focused and intensive program involves both internal and external training on leadership effectiveness as well as specific job-related skills.  In addition, participants receive hands-on experience in key AMETEK business system processes such as growth kaizens and acquisition due diligence. We have a long-standing commitment to responsible corporate conduct.  Each employee is provided with annual performance goals which are reviewed in a performance review with their manager.  Employee feedback is actively encouraged through an open-door policy for all managers, regular town hall/all hands meetings, executive presentations with Q&A sessions, a regular CEO podcast for all employees, and a hotline that can be used to report complaints.\nGiving back to our community is an important part of our culture. Established in 1960, the AMETEK Foundation’s mission is to empower AMETEK colleagues making a positive impact in their local communities, with a focus on health and welfare, civic and social service programs, and education.\nAs of December 31, 2024, we have approximately 21,500 employees. Our compensation programs are designed to provide competitive salaries and benefit programs to attract, retain and motivate a world-class \n9\nTable of Contents\nworkforce. Selected employees participate in short and long-term incentive programs that align employee and shareholder interests and promote long-term retention. Additionally, we strive to protect health and safety in every aspect of our enterprise – from the way we design, manufacture and deliver our products to the way our customers use them. We continue to drive towards our goal of zero lost-time work incidents.  In 2024, we achieved a lost-time incident rate that was significantly below the industry average.  We continue to enhance our safety initiatives as each facility is tasked with identifying opportunities for additional safety measures. Businesses with zero incidents share best practices and ensure ongoing training to maintain their safety excellence. In addition to our EHS facility audits, our facilities include safety committees, continual training, documented self-audits, and behavior-based safety observations and feedback.\nOur U.S. Federal Employment Information Report (EEO-1) for 2023 is available at www.ametek.com.\nAvailable Information \nAMETEK’s annual report on Form  10-K, quarterly reports on Form  10-Q, current reports on Form  8-K and all amendments to those reports filed or furnished pursuant to Section 13(a) of the Securities Exchange Act of 1934 are made available free of charge on the Company’s website at \nwww.ametek.com\n in the “Investors – Reporting” section as soon as reasonably practicable after such material is electronically filed with, or furnished to, the U.S. Securities and Exchange Commission. All reports filed with the Securities Exchange Commission can also be viewed on their website at \nwww.sec.gov\n. AMETEK has posted in the “Investors – Governance” section of its website its corporate governance guidelines, Board committee charters, codes of ethics, and social and environmental policies. Those documents also are available free of charge in published form to any stockholder who requests them by writing to the Investor Relations Department at AMETEK, Inc., 1100 Cassatt Road, Berwyn, Pennsylvania, 19312."
}