{
  "ticker": "AMGN",
  "cik": "0000318154",
  "company_name": "AMGEN INC",
  "filing_date": "2025-02-14",
  "accession": "0000318154-25-000010",
  "primary_doc": "amgn-20241231.htm",
  "item1_text": "em 1. Business—Information about our Executive Officers.\nCode of Ethics\nWe maintain a Code of Ethics for the Chief Executive Officer and Senior Financial Officers applicable to our principal executive officer, principal financial officer, principal accounting officer or controller and other persons performing similar functions. To view this code of ethics free of charge, please visit our website at www.amgen.com. (The website address is not intended to function as a hyperlink, and the information contained in our website is not intended to be a part of this filing.) We intend to satisfy the disclosure requirements under Item 5.05 of Form 8-K regarding an amendment to or a waiver from a provision of this code of ethics, if any, by posting such information on our website as set forth above.\nItem 11.\nEXECUTIVE COMPENSATION\nInformation about director and executive compensation is incorporated by reference from the sections entitled COMPENSATION DISCUSSION AND ANALYSIS, EXECUTIVE COMPENSATION TABLES, DIRECTOR COMPENSATION and CORPORATE GOVERNANCE—Pay Ratio in our Proxy Statement. Information about compensation committee matters is incorporated by reference from the sections entitled CORPORATE GOVERNANCE—Compensation and Management Development Committee and CORPORATE GOVERNANCE—Compensation Committee Report in our Proxy Statement.\n85\nItem 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nSecurities Authorized for Issuance Under Existing Equity Compensation Plans\nThe following table sets forth certain information as of December 31, 2024, concerning the shares of our common stock that may be issued under any form of award granted under our equity compensation plans in effect as of December 31, 2024, including upon the exercise of options, upon the vesting of awards of RSUs or when performance units are earned and related dividend equivalents have been granted.\n(a)\n(b)\n(c)\nPlan category\nNumber of securities to be issued upon exercise of outstanding options and rights\nWeighted-average exercise price of outstanding options and rights\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in\ncolumn (a))\nEquity compensation plans approved by Amgen security holders:\nAmended and Restated 2009 Equity Incentive Plan\n(1)\n10,714,775 \n$\n225.84 \n59,435,223 \nAmended and Restated 1991 Equity Incentive Plan\n(2)\n100 \nAmended and Restated Employee Stock Purchase Plan\n3,946,553 \nTotal approved plans\n10,714,875 \n$\n225.84 \n63,381,776 \nEquity compensation plan not approved by Amgen security holders:\nAmgen Profit Sharing Plan for Employees in Ireland\n(3)\n175,345 \nHorizon stock plans\n(4)\n467,296 \nTotal unapproved plans\n467,296 \n— \n175,345 \nTotal all plans\n11,182,171 \n$\n225.84 \n63,557,121 \n(1)\nThe Amended 2009 Plan employs a fungible share-counting formula for determining the number of shares available for issuance under the plan. In accordance with this formula, each option or stock appreciation right counts as one share, while each RSU, performance unit or dividend equivalent counts as 1.9 shares. The number under column (a) represents the actual number of shares issuable under our outstanding awards without giving effect to the fungible share-counting formula. The number under column (c) represents the number of shares available for issuance under this plan based on each such available share counting as one share. Commencing with the grants made in April 2012, RSUs and performance units accrue dividend equivalents that are payable in shares only to the extent and when the underlying RSUs vest or underlying performance units have been earned and the related shares are issued to the grantee. The performance units granted under this plan are earned based on the accomplishment of specified performance goals at the end of their respective three-year performance periods; the number of performance units granted represent target performance, and the maximum number of units that could be earned based on our performance is 200% of the performance units granted in 2022, 2023 and 2024.\nAs of December 31, 2024, the number of outstanding awards under column (a) includes (i) 5,909,018 shares issuable upon the exercise of outstanding options with a weighted-average exercise price of $225.84; (ii) 3,289,089 shares issuable upon the vesting of outstanding RSUs, including 198,925 related dividend equivalents; and (iii) 1,516,669 shares subject to outstanding 2022, 2023 and 2024 performance units, including 91,901 related dividend equivalents. The weighted-average exercise price shown in column (b) is for the outstanding options only. The number of available shares under column (c) represents the number of shares that remain available for future issuance under this plan as of December 31, 2024, employing the fungible share formula and presumes the issuance of target shares under the performance units granted in 2022, 2023 and 2024 and related dividend equivalents. The numbers under columns (a) and (c) do not give effect to the additional shares that could be issuable in the event that above target performance on the performance goals under these outstanding performance units is achieved. Maximum performance under these goals could result in 200% of target shares being awarded for performance units granted in 2022, 2023 and 2024.\n(2)\nThis plan has terminated as to future grants. The number under column (a) with respect to this plan includes 100 shares issuable upon the settlement of deferred RSUs.\n(3)\nThe Profit Sharing Plan was approved by the Board of Directors on July 28, 2011. The Profit Sharing Plan permits eligible employees of the Company’s subsidiaries located in Ireland who participate in the Profit Sharing Plan to apply a \n86\nportion of their qualifying bonus and salary to the purchase of the Company’s common stock on the open market at the market price by a third-party trustee as described in the Profit Sharing Plan.\n(4)\nThe Horizon Therapeutics Public Limited Company Amended and Restated 2014 Equity Incentive Plan, the Horizon Therapeutics Public Limited Company Amended and Restated 2020 Equity Incentive Plan and 2020 Restricted Stock Unit Award Sub-Plan and the Horizon Therapeutics Public Limited Company Amended and Restated 2018 Equity Incentive Plan and 2018 Restricted Stock Unit Award Sub-Plan (collectively, the “Horizon stock plans”) were acquired on October 6, 2023, pursuant to our acquisition of Horizon. In connection with the closing of the Horizon acquisition and pursuant to its terms, outstanding RSUs issued under the Horizon stock plans were converted into Amgen RSUs, and these plans terminated as to future grants on October 6, 2023.\nSecurity Ownership of Directors and Executive Officers and Certain Beneficial Owners\nInformation about security ownership of certain beneficial owners and management is incorporated by reference from the sections entitled SECURITY OWNERSHIP OF DIRECTORS AND EXECUTIVE OFFICERS and SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS in our Proxy Statement.\nItem 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nInformation about certain relationships and related transactions and director independence is incorporated by reference from the sections entitled CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS and CORPORATE GOVERNANCE—Director Independence in our Proxy Statement.\nItem 14.\nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation about the fees for professional services rendered by our independent registered public accountants is incorporated by reference from the section entitled AUDIT MATTERS—Independent Registered Public Accountants in our Proxy Statement.\n87\nPART IV\nItem 15.\nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)1.\nIndex to Financial Statements\nThe following Consolidated Financial Statements are included herein:\n \nPage\nnumber\nReport of Independent Registered Public Accounting Firm (PCAOB ID: \n42\n)\nF-\n1\nConsolidated Statements of Income for each of the three years in the period ended December 31, 2024\nF-4\nConsolidated Statements of Comprehensive Income for each of the three years in the period ended December 31, 2024\nF-5\nConsolidated Balance Sheets as of December 31, 2024 and 2023\nF-6\nConsolidated Statements of Stockholders’ Equity for each of the three years in the period ended December 31, 2024\nF-7\nConsolidated Statements of Cash Flows for each of the three years in the period ended December 31, 2024\nF-8\nNotes to Consolidated Financial Statements\nF-9\n(a)2.\nIndex to Financial Statement Schedules\nThe following Schedule is filed as part of this Annual Report on Form 10-K:\n \nPage\nnumber\nSchedule II. Valuation and Qualifying Accounts\nF-58\nAll other schedules are omitted because they are not applicable, not required or because the required information is included in the consolidated financial statements or notes thereto.\n(a)3.\nExhibits\nExhibit No.\nDescription\n2.1\nAgreement and Plan of Merger, dated July 27, 2021, by and among Amgen Inc., Teneobio, Inc., Tuxedo Merger Sub, Inc., and Fortis Advisors LLC.\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential) (Filed as an exhibit to Form 10-Q for the quarter ended September 30, 2021 on November 3, 2021 and incorporated herein by reference.)\n2.2\nAgreement and Plan of Merger, dated as of August 3, 2022, among ChemoCentryx, Inc., Amgen Inc. and Carnation Merger Sub, Inc.\n (Filed as an exhibit to Form 8-K on August 4, 2022 and incorporated herein by reference.)\n2.3\nTransaction Agreement, dated as of December 11, 2022, by and among Amgen Inc., Pillartree Limited and Horizon Therapeutics plc.\n (Filed as an exhibit to Form 8-K on December 12, 2022 and incorporated herein by reference.)\n2.4\nAppendix 3 to the Rule 2.7 Announcement, dated as of December 12, 2022 (Conditions Appendix).\n (Filed as an exhibit to Form 8-K on December 12, 2022 and incorporated herein by reference.)\n3.1\nRestated Certificate of Incorporation of Amgen Inc.\n (As Restated March 6, 2013.) (Filed as an exhibit to Form 10-Q for the quarter ended March 31, 2013 on May 3, 2013 and incorporated herein by reference.)\n3.2\nAmended and Restated Bylaws of Amgen Inc.\n (As Amended and Restated February 15, 2016.) (Filed as an exhibit to Form 8-K on February 17, 2016 and incorporated herein by reference.)\n4.1\nForm of stock certificate for the common stock, par value $.0001 of the Company.\n (Filed as an exhibit to Form 10-Q for the quarter ended March 31, 1997 on May 14, 1997 and incorporated herein by reference.)\n88\nExhibit No.\nDescription\n4.2\nForm of Indenture, dated January 1, 1992. (Filed as an exhibit to Form S-3 Registration Statement filed on December 19, 1991 and incorporated herein by reference.)\n4.3\nAgreement of Resignation, Appointment and Acceptance dated February 15, 2008.\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2007 on February 28, 2008 and incorporated herein by reference.)\n4.4\nFirst Supplemental Indenture, dated February 26, 1997.\n (Filed as an exhibit to Form 8-K on March 14, 1997 and incorporated herein by reference.)\n4.5\n8-1/8% Debentures due April 1, 2097.\n (Filed as an exhibit to Form 8-K on April 8, 1997 and incorporated herein by reference.)\n4.6\nOfficer’s Certificate of Amgen Inc., dated April 8, 1997, establishing a series of securities entitled “8 1/8% Debentures due April 1, 2097.”\n (Filed as an exhibit to Form 8-K on April 8, 1997 and incorporated herein by reference.)\n4.7\nIndenture, dated August 4, 2003.\n (Filed as an exhibit to Form S-3 Registration Statement on August 4, 2003 and incorporated herein by reference.)\n4.8\nCorporate Commercial Paper - Master Note between and among Amgen Inc., as Issuer, Cede & Co., as Nominee of The Depository Trust Company, and Citibank, N.A., as Paying Agent.\n (Filed as an exhibit to Form 10-Q for the quarter ended March 31, 1998 on May 13, 1998 and incorporated herein by reference.)\n4.9\nOfficers’ Certificate of Amgen Inc., dated May 30, 2007, including form of the Company’s 6.375% Senior Notes due 2037.\n (Filed as an exhibit to Form 8-K on May 30, 2007 and incorporated herein by reference.)\n4.10\nOfficers’ Certificate of Amgen Inc., dated May 23, 2008, including form of the Company’s 6.90% Senior Notes due 2038.\n (Filed as exhibit to Form 8-K on May 23, 2008 and incorporated herein by reference.)\n4.11\nOfficers’ Certificate of Amgen Inc., dated January 16, 2009, including form of the Company’s 6.40% Senior Notes due 2039.\n (Filed as exhibit to Form 8-K on January 16, 2009 and incorporated herein by reference.)\n4.12\nOfficers’ Certificate of Amgen Inc., dated March 12, 2010, including form of the Company’s 5.75% Senior Notes due 2040.\n (Filed as exhibit to Form 8-K on March 12, 2010 and incorporated herein by reference.)\n4.13\nOfficers’ Certificate of Amgen Inc., dated September 16, 2010, including form of the Company’s 4.95% Senior Notes due 2041.\n (Filed as an exhibit to Form 8-K on September 17, 2010 and incorporated herein by reference.)\n4.14\nOfficers’ Certificate of Amgen Inc., dated June 30, 2011, including form of the Company’s 5.65% Senior Notes due 2042.\n (Filed as an exhibit to Form 8-K on June 30, 2011 and incorporated herein by reference.)\n4.15\nOfficers’ Certificate of Amgen Inc., dated November 10, 2011, including form of the Company’s 5.15% Senior Notes due 2041.\n (Filed as an exhibit to Form 8-K on November 10, 2011 and incorporated herein by reference.)\n4.16\nOfficers’ Certificate of Amgen Inc., dated December 5, 2011, including form of the Company’s 5.50% Senior Notes due 2026.\n (Filed as an exhibit to Form 8-K on December 5, 2011 and incorporated herein by reference.)\n4.17\nOfficers’ Certificate of Amgen Inc., dated May 15, 2012, including form of the Company’s 5.375% Senior Notes due 2043.\n (Filed as an exhibit to Form 8-K on May 15, 2012 and incorporated herein by reference.)\n4.18\nOfficers’ Certificate of Amgen Inc., dated September 13, 2012, including form of the Company’s 4.000% Senior Notes due 2029.\n (Filed as an exhibit to Form 8-K on September 13, 2012 and incorporated herein by reference.)\n4.19\nIndenture, dated May 22, 2014, between Amgen Inc. and The Bank of New York Mellon Trust Company, N.A., as Trustee.\n (Filed as an exhibit to Form 8-K on May 22, 2014 and incorporated herein by reference.)\n4.20\nOfficer’s Certificate of Amgen Inc., dated May 1, 2015, including forms of the Company’s 3.125% Senior Notes due 2025 and 4.400% Senior Notes due 2045.\n (Filed as an exhibit on Form 8-K on May 1, 2015 and incorporated herein by reference.)\n4.21\nOfficer’s Certificate of Amgen Inc., dated as of February 25, 2016, including form of the Company’s 2.000% Senior Notes due 2026.\n (Filed as an exhibit on Form 8-K on February 26, 2016 and incorporated herein by reference.)\n89\nExhibit No.\nDescription\n4.22\nOfficer’s Certificate of Amgen Inc., dated as of June 14, 2016, including forms of the Company’s 4.563% Senior Notes due 2048 and 4.663% Senior Notes due 2051.\n (Filed as an exhibit to Form 8-K on June 14, 2016 and incorporated herein by reference.)\n4.23\nOfficer’s Certificate of Amgen Inc., dated as of August 19, 2016, including forms of the Company’s 2.600% Senior Notes due 2026.\n (Filed as an exhibit to Form 8-K on August 19, 2016 and incorporated herein by reference.)\n4.24\nOfficer’s Certificate of Amgen Inc., dated as of November 2, 2017, including in the form of the Company’s 3.200% Senior Notes due 2027.\n (Filed as an exhibit to Form 8-K on November 2, 2017 and incorporated herein by reference.)\n4.25\nOfficer’s Certificate of Amgen Inc., dated as of February 21, 2020, including forms of the Company’s 1.900% Senior Notes due 2025, 2.200% Senior Notes due 2027, 2.450% Senior Notes due 2030, 3.150% Senior Notes due 2040 and 3.375% Senior Notes due 2050.\n (Filed as an exhibit to Form 8-K on February 21, 2020 and incorporated herein by reference.)\n4.26\nOfficer’s Certificate of Amgen Inc., dated as of May 6, 2020, including form of the Company’s 2.300% Senior Notes due 2031.\n (Filed as an exhibit to Form 8-K on May 6, 2020 and incorporated herein by reference.)\n4.27\nOfficer’s Certificate of Amgen Inc., dated as of August 17, 2020, including forms of the Company’s 2.770% Senior Notes due 2053.\n (Filed as an exhibit to Form 8-K on August 18, 2020 and incorporated herein by reference.) \n4.28\nOfficer’s Certificate of Amgen Inc., dated as of August 9, 2021, including forms of the Company’s 1.650% Senior Notes due 2028, 2.000% Senior Notes due 2032, 2.800% Senior Notes due 2041 and 3.000% Senior Notes due 2052.\n (Filed as an exhibit to Form 8-K on August 9, 2021 and incorporated herein by reference.)\n4.29\nOfficer’s Certificate of Amgen Inc., dated as of February 22, 2022, including forms of the Company’s 3.000% Senior Notes due 2029, 3.350% Senior Notes due 2032, 4.200% Senior Notes due 2052 and 4.400% Senior Notes due 2062.\n (Filed as an exhibit to Form 8-K on February 22, 2022 and incorporated herein by reference.)\n4.30\nOfficer’s Certificate of Amgen Inc., dated as of August 18, 2022, including forms of the Company’s 4.050% Senior Notes due 2029, 4.200% Senior Notes due 2033 and 4.875% Senior Notes due 2053.\n (Filed as an exhibit to Form 8-K on August 18, 2022 and incorporated herein by reference.)\n4.31\nOfficer’s Certificate of the Company, dated as of March 2, 2023, including forms of the Company’s 5.250% Senior Notes due 2025, 5.507% Senior Notes due 2026, 5.150% Senior Notes due 2028, 5.250% Senior Notes due 2030, 5.250% Senior Notes due 2033, 5.600% Senior Notes due 2043, 5.650% Senior Notes due 2053 and 5.750% Senior Notes due 2063.\n (Filed as an exhibit to Form 8-K on March 2, 2023 and incorporated herein by reference.)\n4.32*\nDescription of Amgen Inc.’s Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n \n10.1+\nAmgen Inc. Second Amended and Restated 2009 Equity Incentive Plan.\n (Filed as Appendix C to the Definitive Proxy Statement on Schedule 14A on April 17, 2024 and incorporated herein by reference.)\n10.2*+\nForm of Grant of Stock Option Agreement for the Amgen Inc. Second Amended and Restated 2009 Equity Incentive Plan.\n (As Amended and Restated on December 9, 2024.)\n10.3*+\nForm of Restricted Stock Unit Agreement for the Amgen Inc. Second Amended and Restated 2009 Equity Incentive Plan.\n (As Amended and Restated on December 9, 2024.)\n10.4+\nAmgen Inc. 2009 Performance Award Program.\n (As Amended and Restated on May 31, 2024.) (Filed as an exhibit to Form 10-Q for the quarter ended June 30, 2024 on August 7, 2024 and incorporated herein by reference.)\n10.5*+\nForm of Performance Unit Agreement for the Amgen Inc. 2009 Performance Award Program.\n (As Amended and Restated on December 9, 2024.)\n10.6+\nAmgen Inc. 2009 Director Equity Incentive Program.\n (As Amended and Restated on May 31, 2024.) (Filed as an exhibit to Form 10-Q for the quarter ended June 30, 2024 on August 7, 2024 and incorporated herein by reference.)\n90\nExhibit No.\nDescription\n10.7+\nForm of Restricted Stock Unit Agreement for the Amgen Inc. 2009 Director Equity Incentive Program.\n (As Amended and Restated on May 31, 2024.) (Filed as an exhibit to Form 10-Q for the quarter ended June 30, 2024 on August 7, 2024 and incorporated herein by reference.)\n10.8+\nForm of Cash-Settled Restricted Stock Unit Agreement for the Amgen Inc. 2009 Director Equity Incentive Program.\n (As Amended and Restated on May 31, 2024.) (Filed as an exhibit to Form 10-Q for the quarter ended June 30, 2024 on August 7, 2024 and incorporated herein by reference.)\n10.9+\nAmgen Inc. Supplemental Retirement Plan. (As Amended and Restated effective October 16, 2013.)\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2013 on February 24, 2014 and incorporated herein by reference.)\n10.9.1+\nFirst Amendment to the Amgen Inc. Supplemental Retirement Plan, effective October 14, 2016.\n (Filed as an exhibit to Form 10-Q for the quarter ended September 30, 2016 on October 28, 2016 and incorporated herein by reference.)\n10.9.2+\nSecond Amendment to the Amgen Inc. Supplemental Retirement Plan, effective October 23, 2019.\n \n(Filed as an exhibit to Form 10-K for the year ended December 31, 2019 on February 12, 2020 and incorporated herein by reference.)\n10.9.3+\nThird Amendment to the Amgen Inc. Supplemental Retirement Plan, effective October 20, 2021.\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2021 on February 16, 2022 and incorporated herein by reference.)\n10.9.4+\nFourth Amendment to the Amgen Inc. Supplemental Retirement Plan, effective October 20, 2022.\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2022 on February 9, 2023 and incorporated herein by reference.)\n10.9.5+\nFifth Amendment to the Amgen Inc. Supplemental Retirement Plan, effective January 1, 2024.\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2023 on February 14, 2024 and incorporated herein by reference.)\n10.10+\nAmended and Restated Amgen Change of Control Severance Plan. (As Amended and Restated effective December 9, 2010 and subsequently amended effective March 2, 2011.)\n (Filed as an exhibit to Form 10-Q for the quarter ended March 31, 2011 on May 10, 2011 and incorporated herein by reference.)\n10.11+\nAmgen Inc. Executive Incentive Plan.\n (As Amended and Restated effective January 1, 2022.) (Filed as an exhibit to Form 10-Q for the quarter ended March 31, 2022 on April 28, 2022 and incorporated herein by reference.)\n10.12+\nAmgen Nonqualified Deferred Compensation Plan. (As Amended and Restated effective October 16, 2013.)\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2013 on February 24, 2014 and incorporated herein by reference.)\n10.12.1+\nFirst Amendment to the Amgen Nonqualified Deferred Compensation Plan, effective October 14, 2016.\n (Filed as an exhibit to Form 10-Q for the quarter ended September 30, 2016 on October 28, 2016 and incorporated herein by reference.)\n10.12.2+\nSecond Amendment to the Amgen Nonqualified Deferred Compensation Plan, effective January 1, 2020.\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2019 on February 12, 2020 and incorporated herein by reference.)\n10.12.3+\nThird Amendment to the Amgen Nonqualified Deferred Compensation Plan, effective January 1, 2022.\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2021 on February 16, 2022 and incorporated herein by reference.)\n10.12.4+\nFourth Amendment to the Amgen Nonqualified Deferred Compensation Plan, effective January 1, 2024.\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2023 on February 14, 2024 and incorporated herein by reference.)\n10.13+\nAircraft Time Sharing Agreement, dated December 3, 2021, by and between Amgen Inc. and Robert A. Bradway.\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2021 on February 16, 2022 and incorporated herein by reference.)\n10.14+\nAgreement between Amgen Inc. and James Bradner, dated December 13, 2023.\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2023 on February 14, 2024 and incorporated herein by reference.)\n91\nExhibit No.\nDescription\n10.15\nTerm Loan Credit Agreement, dated as of December 22, 2022, by and among Amgen Inc., Citibank, N.A., as administrative agent, Bank of America, N.A., as syndication agent, Citibank, N.A., Bank of America, N.A., Goldman Sachs Bank USA and Mizuho Bank, Ltd., as lead arrangers and book runners, Goldman Sachs Bank USA and Mizuho Bank, Ltd. as documentation agents, and the other banks party thereto.\n (Filed as an exhibit to Form 8-K on December 22, 2022 and incorporated herein by reference.)\n10.16\nThird Amended and Restated Credit Agreement, dated as of March 9, 2023, among Amgen Inc., the Banks therein named, Citibank, N.A., as Administrative Agent, and JPMorgan Chase Bank, N.A., as Syndication Agent.\n (Filed as an exhibit to Form 8-K on March 9, 2023 and incorporated herein by reference.)\n10.17\nCollaboration and License Agreement between Amgen Inc. and Celltech R&D Limited dated May 10, 2002\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential.) \nand Amendment No. 1, effective June 9, 2003, to Collaboration and License Agreement between Amgen Inc. and Celltech R&D Limited\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential.) (Filed as an exhibit to Form 10-K for the year ended December 31, 2023 on February 14, 2024 and incorporated herein by reference.)\n10.17.1\nAmendment No. 2 to Collaboration and License Agreement, effective November 14, 2016, between Amgen Inc. and Celltech R&D Limited.\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential.) (Filed as an exhibit to Form 10-K for the year ended December 31, 2023 on February 14, 2024 and incorporated herein by reference.)\n10.18\nLetter Agreement, dated June 25, 2019, by and between Amgen Inc. and UCB Celltech (portions of the exhibit have been omitted because they are both (i) not material and (ii) would be competitively harmful if publicly disclosed).\n (Filed as an exhibit to Form 10-Q for the quarter ended June 30, 2019 on July 31, 2019 and incorporated herein by reference.)\n10.19\nCollaboration Agreement, dated October 31, 2019, by and between Amgen Inc. and BeiGene Switzerland GmbH, a wholly-owned subsidiary of BeiGene, Ltd.\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) would be competitively harmful if publicly disclosed).\n \n(Filed as an exhibit to Form 10-K for the year ended December 31, 2019 on February 12, 2020 and incorporated herein by reference.)\n10.19.1\nFirst Amendment to Collaboration Agreement, dated April 20, 2022, by and between Amgen Inc. and BeiGene Switzerland GmbH, and BeiGene, Ltd.\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential.) (Filed as an exhibit to Form 10-Q for the quarter ended June 30, 2022 on August 5, 2022 and incorporated herein by reference.)\n10.19.2\nSecond Amendment to Collaboration Agreement, entered into as of February 26, 2023, by and between Amgen Inc. and BeiGene Switzerland GmbH, and BeiGene, Ltd.\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential.) (Filed as an exhibit to Form 10-Q for the quarter ended March 31, 2023 on April 28, 2023 and incorporated herein by reference.)\n10.20\nGuarantee, dated as of October 31, 2019, made by and among BeiGene, Ltd. and Amgen Inc.\n (Filed as an exhibit to Form 10-K for the year ended December 31, 2019 on February 12, 2020 and incorporated herein by reference.)\n10.21\nShare Purchase Agreement, dated October 31, 2019, by and between Amgen Inc. and BeiGene, Ltd.\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) would be competitively harmful if publicly disclosed). (Filed as an exhibit to Schedule 13D on January 8, 2020 and incorporated herein by reference.)\n10.21.1\nAmendment No. 1 to Share Purchase Agreement, dated December 6, 2019, by and among BeiGene, Ltd. and Amgen Inc.\n (Filed as an exhibit to Schedule 13D on January 8, 2020 and incorporated herein by reference.)\n10.21.2\nRestated Amendment No. 2 to Share Purchase Agreement, dated September 24, 2020, by and among BeiGene, Ltd. and Amgen Inc. \n(Filed as an exhibit to Form 10-Q for the quarter ended September 30, 2020 on October 29, 2020 and incorporated herein by reference.)\n10.21.3\nAmendment No. 3 to Share Purchase Agreement, dated January 30, 2023, by and among BeiGene, Ltd. and Amgen Inc.\n (Filed as an exhibit to Form 8-K on January 31, 2023 and incorporated herein by reference.)\n92\nExhibit No.\nDescription\n10.22\nCollaboration Agreement dated March 30, 2012 by and between Amgen Inc. and AstraZeneca Collaboration Ventures, LLC, a wholly owned subsidiary of AstraZeneca Pharmaceuticals LP\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential.) (Filed as an exhibit to Form 10-Q for the quarter ended June 30, 2022 on August 5, 2022 and incorporated herein by reference.)\n10.22.1\nAmendment No. 1 to the Collaboration Agreement, dated October 1, 2014, by and among Amgen Inc., AstraZeneca Collaboration Ventures, LLC and AstraZeneca Pharmaceuticals LP\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential.) (Filed as an exhibit to Form 10-Q for the quarter ended June 30, 2022 on August 5, 2022 and incorporated herein by reference.)\n10.22.2\nAmendment Nos. 2 through 6 to the March 30, 2012 Collaboration Agreement between Amgen Inc. and AstraZeneca Collaboration Ventures, LLC, dated May 2 and 27 and October 2, 2016, January 31, 2018, and May 15, 2020, respectively\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) would be competitively harmful if publicly disclosed.) (Filed as an exhibit to Form 10-Q for the quarter ended June 30, 2020 on July 29, 2020 and incorporated herein by reference.)\n10.22.3\nAmendment No. 7 to the Collaboration Agreement, dated December 17, 2020, by and between Amgen Inc. and AstraZeneca Collaboration Ventures, LLC\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) would be competitively harmful if publicly disclosed.) (Filed as an exhibit to Form 10-K for the year ended December 31, 2020 on February 9, 2021 and incorporated herein by reference.)\n10.22.4\nAmendment No. 8 to the Collaboration Agreement, dated November 19, 2021, by and between Amgen Inc. and AstraZeneca Collaboration Ventures, LLC\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential.) (Filed as an exhibit to Form 10-K for the year ended December 31, 2021 on February 16, 2022 and incorporated herein by reference.)\n10.22.5\nLetter Agreement Regarding the Collaboration Agreement, dated as of December 1, 2023, by and between Amgen Inc. and AstraZeneca Collaboration Ventures, LLC\n (portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential.) (Filed as an exhibit to Form 10-K for the year ended December 31, 2023 on February 14, 2024 and incorporated herein by reference.)\n10.23\nLicense and Collaboration Agreement, dated June 1, 2021, by and between Amgen Inc. and Kyowa Kirin Co., Ltd. \n(portions of the exhibit have been omitted because they are both (i) not material and (ii) is the type of information that the Company treats as private or confidential). (Filed as an exhibit to Form 10-Q for the quarter ended June 30, 2021 on August 4, 2021 and incorporated herein by reference.)\n19.1*\nAmgen Inc. Insider Trading Policy.\n19.2*\nAmgen Inc. Securities Transactions Blackout and Pre-Clearance Practices and Procedures.\n21*\nSubsidiaries of the Company.\n23\nConsent of the Independent Registered Public Accounting Firm. The consent is set forth on page 96 of this Annual Report on the 10-K.\n24\nPower of Attorney. The Power of Attorney is set forth on page 97 of this Annual Report on Form 10-K.\n31*\nRule 13a-14(a) Certifications.\n32**\nSection 1350 Certifications.\n97*\nPolicy Relating to Recovery of Erroneously Awarded Compensation.\n101.INS\nInline XBRL Instance Document - The instance document does not appear in the interactive data file because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n93\nExhibit No.\nDescription\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n____________________________\n* = filed herewith\n** = furnished herewith and not “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended\n+ = management contract or compensatory plan or arrangement\nItem 16.\nFORM 10-K SUMMARY\nNot applicable.\n94\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this Annual Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAMGEN INC.\n(Registrant)\nDate:\nFebruary 14, 2025\nBy:\n \n/s/    PETER H. GRIFFITH\n \nPeter H. Griffith\n \nExecutive Vice President and Chief Financial Officer\n \n(Principal Financial Officer)\n95\nEXHIBIT 23\nCONSENT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nWe consent to the incorporation by reference in the following Registration Statements:\n•\nRegistration Statement (Form S-3 No. 333-269670) of Amgen Inc.,\n•\nRegistration Statements (Form S-8 Nos. 333-159377 and 333-280155) pertaining to the Amgen Inc. Second Amended and Restated 2009 Equity Incentive Plan, \n•\nRegistration Statement (Form S-8 No. 33-39183) pertaining to the Amgen Inc. Amended and Restated Employee Stock Purchase Plan, \n•\nRegistration Statements (Form S-8 Nos. 33-39104, 333-144581 and 333-216719) pertaining to the Amgen Retirement and Savings Plan,\n•\nRegistration Statements (Form S-8 Nos. 33-47605, 333-144580 and 333-216715) pertaining to The Retirement and Savings Plan for Amgen Manufacturing Limited LLC (formerly known as The Retirement and Savings Plan for Amgen Manufacturing, Limited), \n•\nRegistration Statements (Form S-8 Nos. 333-81284, 333-177868, 333-216723 and 333-260723) pertaining to the Amgen Nonqualified Deferred Compensation Plan,\n•\nRegistration Statements (Form S-8 Nos. 333-176240 and 333-260724) pertaining to the Amgen Profit Sharing Plan for Employees in Ireland, and\n•\nRegistration Statement (Form S-8 No. 333-274900) pertaining to the Horizon Therapeutics Public Limited Company Amended and Restated 2014 Equity Incentive Plan, Horizon Therapeutics Public Limited Company Amended and Restated 2018 Equity Incentive Plan and 2018 Restricted Stock Unit Award Sub-Plan, and Horizon Therapeutics Public Limited Company Amended and Restated 2020 Equity Incentive Plan and 2020 Restricted Stock Unit Award Sub-Plan;\nof our reports dated February 14, 2025, with respect to the consolidated financial statements of Amgen Inc. and the effectiveness of internal control over financial reporting of Amgen Inc. included in this Annual Report (Form 10-K) of Amgen Inc. for the year ended December 31, 2024.\n/s/ Ernst & Young LLP\nLos Angeles, California\nFebruary 14, 2025\n96\nEXHIBIT 24\nPOWER OF ATTORNEY\nKNOW ALL MEN AND WOMEN BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Robert A. Bradway, Peter H. Griffith and Jonathan P. Graham, or any of them, his or her attorney-in-fact, each with the power of substitution and re-substitution, for him or her in any and all capacities, to sign any amendments to this Report, and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his or her substitute or substitutes, may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nSignature\nTitle\nDate\n/S/    ROBERT A. BRADWAY\nChairman of the Board, Chief Executive Officer\nand President, and Director\n(Principal Executive Officer)\n2/14/2025\nRobert A. Bradway\n/S/    PETER H. GRIFFITH\nExecutive Vice President and\nChief Financial Officer\n(Principal Financial Officer)\n2/14/2025\nPeter H. Griffith\n/S/    MATTHEW C. BUSCH\nVice President, Finance and\nChief Accounting Officer\n(Principal Accounting Officer)\n2/14/2025\nMatthew C. Busch\n/S/    WANDA M. AUSTIN\nDirector\n2/14/2025\nWanda M. Austin\n/S/    MICHAEL V. DRAKE\nDirector\n2/14/2025\nMichael V. Drake\n/S/    BRIAN J. DRUKER\nDirector\n2/14/2025\nBrian J. Druker\n/S/    ROBERT A. ECKERT\nDirector\n2/14/2025\nRobert A. Eckert\n/S/    GREG C. GARLAND\nDirector\n2/14/2025\nGreg C. Garland\n/S/    CHARLES M. HOLLEY, JR.\nDirector\n2/14/2025\nCharles M. Holley, Jr.\n/S/    S. OMAR ISHRAK\nDirector\n2/14/2025\nS. Omar Ishrak\n/S/    TYLER JACKS\nDirector\n2/14/2025\nTyler Jacks\n/S/    MARY E. KLOTMAN\nDirector\n2/14/2025\nMary E. Klotman\n/S/    ELLEN J. KULLMAN\nDirector\n2/14/2025\nEllen J. Kullman\n/S/    AMY E. MILES\nDirector\n2/14/2025\nAmy E. Miles\n97\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Amgen Inc.\nOpinion on the Financial Statements \nWe have audited the accompanying consolidated balance sheets of Amgen Inc. (the Company) as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and the financial statement schedule listed in the Index at Item 15(a)2 (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated February 14, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion \nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nF-1\nSales deductions\nDescription of the Matter\nAs of December 31, 2024, the Company recorded accrued sales deductions of $8.4 billion. As described in Note 1 to the financial statements under the caption “Product sales and sales deductions,” revenues from product sales are recognized net of accruals for estimated rebates, wholesaler chargebacks, discounts and other deductions (collectively sales deductions), which are established at the time of sale.\nAuditing the estimation of sales deductions, specifically estimated chargebacks, commercial rebates, and Medicaid rebates related to U.S. product sales, which are netted against product sales, is complex, requires significant judgment, and the amounts involved are material to the financial statements taken as a whole. Revenue from product sales is recognized upon transfer of control of a product to a customer, generally upon delivery, and is based on an amount that reflects the consideration to which the Company expects to be entitled, which represents an amount that is net of accruals for estimated sales deductions. The estimated sales deductions are based on current contractual and statutory requirements, market events and trends, internal and external historical data, and forecasted customer buying patterns.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of internal controls over the sales deduction processes. This included testing controls over management’s review of significant assumptions and inputs used in the estimate of sales deductions, including actual sales, contractual terms, historical experience, wholesaler inventory levels, demand data and estimated patient population. We also tested management’s controls over the accuracy of forecasting demand activity as well as the completeness and accuracy of the significant components included in the final sales deduction estimates. \nTo test management’s estimated sales deductions, we obtained management’s calculations for the respective estimates and performed the following procedures, among others. We tested management’s estimation process over the determination of sales discount accruals by developing an independent expectation of the estimated accrual balances, including comparing accrual balances recorded by management to those implied by historical payment trends, evaluating trends in actual sales and discount accrual balances, testing a sample of credits issued and payments made throughout the year, and agreeing rates to underlying contract terms.\nF-2\nUnrecognized tax benefits\nDescription of the Matter\nAs discussed in Notes 1 and 7 to the consolidated financial statements, the Company operates in various jurisdictions in which differing interpretations of complex tax laws and regulations create uncertainty and necessitate the use of significant judgment in the determination of the Company’s unrecognized tax benefits, particularly in the U.S. federal tax jurisdiction where the Company has significant assets and operations. In this regard, the Company uses significant judgment in (1) determining whether a tax position’s technical merits are more-likely-than-not to be sustained and (2) measuring the amount of tax benefit that qualifies for recognition. As of December 31, 2024, the Company accrued $4.2 billion of gross unrecognized tax benefits. Auditing the assessment of the technical merits and measurement of the Company’s unrecognized tax benefits is challenging due to the high degree of estimation and management judgement, given the ultimate resolution is dependent on uncontrollable factors such as the resolution of audit disputes with the IRS and results of the U.S. Tax Court case.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of internal controls over the Company’s process to assess the technical merits of its tax positions, as well as management’s process to measure the unrecognized tax benefits of those tax positions, particularly in regard to matters in dispute with the IRS. This included testing controls over management’s review of the inputs, calculations, assumptions and methods selected to measure the amount of tax benefits that qualify for recognition.\nWe involved tax controversy and transfer pricing specialists to assist in assessing the technical merits and measurement of certain of the Company’s unrecognized tax benefits. Depending on the nature of the specific tax position and, as applicable, developments with the relevant tax authorities, our procedures included obtaining and reviewing the Company’s correspondence with such tax authorities and evaluating certain third-party advice to support the Company’s evaluations and recorded positions. We evaluated the status of the ongoing U.S. Tax Court case and developments in the applicable regulatory environments to assess potential effects on the Company’s recorded positions. We assessed management’s consideration of current tax controversy, litigation and tax litigation trends. We analyzed the assumptions and data used by the Company when it determined the amount of tax benefits to recognize, including applicable interest and penalties, and we tested the accuracy of those underlying calculations. We have also evaluated the Company’s income tax disclosures included in Note 7 in relation to these matters.\n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 1980.\nLos Angeles, California\nFebruary 14, 2025\nF-3\nAMGEN INC.\nCONSOLIDATED STATEMENTS OF INCOME\nYears ended December 31, 2024, 2023 and 2022 \n(In millions, except per-share data)\n2024\n2023\n2022\nRevenues:\nProduct sales\n$\n32,026\n \n$\n26,910\n \n$\n24,801\n \nOther revenues\n1,398\n \n1,280\n \n1,522\n \nTotal revenues\n33,424\n \n28,190\n \n26,323\n \nOperating expenses:\nCost of sales\n12,858\n \n8,451\n \n6,406\n \nResearch and development\n5,964\n \n4,784\n \n4,434\n \nSelling, general and administrative\n7,096\n \n6,179\n \n5,414\n \nOther\n248\n \n879\n \n503\n \nTotal operating expenses\n26,166\n \n20,293\n \n16,757\n \nOperating income\n7,258\n \n7,897\n \n9,566\n \nOther income (expense):\nInterest expense, net\n(\n3,155\n)\n(\n2,875\n)\n(\n1,406\n)\nOther income (expense), net\n506\n \n2,833\n \n(\n814\n)\nIncome before income taxes\n4,609\n \n7,855\n \n7,346\n \nProvision for income taxes\n519\n \n1,138\n \n794\n \nNet income\n$\n4,090\n \n$\n6,717\n \n$\n6,552\n \nEarnings per share:\nBasic\n$\n7.62\n \n$\n12.56\n \n$\n12.18\n \nDiluted\n$\n7.56\n \n$\n12.49\n \n$\n12.11\n \nWeighted-average shares used in the calculation of earnings per share:\nBasic\n537\n535\n538\nDiluted\n541\n538\n541\nSee accompanying notes.\nF-4\nAMGEN INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYears ended December 31, 2024, 2023 and 2022 \n(In millions)\n2024\n2023\n2022\nNet income\n$\n4,090\n \n$\n6,717\n \n$\n6,552\n \nOther comprehensive income (loss), net of reclassification adjustments and taxes:\n(Losses) gains on foreign currency translation adjustments\n(\n76\n)\n50\n \n496\n \nGains (losses) on cash flow hedges\n309\n \n(\n150\n)\n67\n \nOther\n(\n10\n)\n42\n \n2\n \nOther comprehensive income (loss), net of reclassification adjustments and taxes\n223\n \n(\n58\n)\n565\n \nComprehensive income\n$\n4,313\n \n$\n6,659\n \n$\n7,117\n \nSee accompanying notes.\nF-5\nAMGEN INC.\nCONSOLIDATED BALANCE SHEETS\nDecember 31, 2024 and 2023 \n(In millions, except per-share data)\n2024\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n11,973\n \n$\n10,944\n \nTrade receivables, net\n6,782\n \n7,268\n \nInventories\n6,998\n \n9,518\n \nOther current assets\n3,277\n \n2,602\n \nTotal current assets\n29,030\n \n30,332\n \nProperty, plant and equipment, net\n6,543\n \n5,941\n \nIntangible assets, net\n27,699\n \n32,641\n \nGoodwill\n18,637\n \n18,629\n \nOther noncurrent assets\n9,930\n \n9,611\n \nTotal assets\n$\n91,839\n \n$\n97,154\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable\n$\n1,908\n \n$\n1,590\n \nAccrued liabilities\n17,641\n \n15,359\n \nCurrent portion of long-term debt\n3,550\n \n1,443\n \nTotal current liabilities\n23,099\n \n18,392\n \nLong-term debt\n56,549\n \n63,170\n \nLong-term deferred tax liabilities\n1,616\n \n2,354\n \nLong-term tax liabilities\n2,349\n \n4,680\n \nOther noncurrent liabilities\n2,349\n \n2,326\n \nContingencies and commitments (see Note 20)\nStockholders’ equity:\nCommon stock and additional paid-in capital; $\n0.0001\n par value per share; \n2,750.0\n shares authorized; outstanding—\n536.9\n shares in 2024 and \n535.4\n shares in 2023\n33,533\n \n33,070\n \nAccumulated deficit\n(\n27,590\n)\n(\n26,549\n)\nAccumulated other comprehensive loss\n(\n66\n)\n(\n289\n)\nTotal stockholders’ equity\n5,877\n \n6,232\n \nTotal liabilities and stockholders’ equity\n$\n91,839\n \n$\n97,154\n \nSee accompanying notes.\nF-6\nAMGEN INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\nYears ended December 31, 2024, 2023 and 2022 \n(In millions, except per-share data)\nNumber\nof shares\nof common\nstock\nCommon\nstock and\nadditional\npaid-in capital\nAccumulated\ndeficit\nAccumulated\nother\ncomprehensive\nloss\nTotal\nBalance as of December 31, 2021\n558.3\n \n$\n32,096\n \n$\n(\n24,600\n)\n$\n(\n796\n)\n$\n6,700\n \nNet income\n— \n— \n6,552\n \n— \n6,552\n \nOther comprehensive income, net of taxes\n— \n— \n— \n565\n \n565\n \nDividends declared on common stock ($\n7.95\n per share)\n— \n— \n(\n4,264\n)\n— \n(\n4,264\n)\nIssuance of common stock in connection with equity award programs\n1.8\n \n138\n \n— \n— \n138\n \nStock-based compensation expense\n— \n419\n \n— \n— \n419\n \nTax impact related to employee stock-based compensation expense\n— \n(\n139\n)\n— \n— \n(\n139\n)\nRepurchases of common stock\n(\n26.1\n)\n— \n(\n6,310\n)\n— \n(\n6,310\n)\nBalance as of December 31, 2022\n534.0\n \n32,514\n \n(\n28,622\n)\n(\n231\n)\n3,661\n \nNet income\n— \n— \n6,717\n \n— \n6,717\n \nOther comprehensive loss, net of taxes\n— \n— \n— \n(\n58\n)\n(\n58\n)\nDividends declared on common stock ($\n8.64\n per share)\n— \n— \n(\n4,644\n)\n— \n(\n4,644\n)\nIssuance of common stock in connection with equity award programs\n1.4\n \n95\n \n— \n— \n95\n \nStock-based compensation expense\n— \n454\n \n— \n— \n454\n \nEquity awards issued for Horizon acquisition, net\n— \n141\n \n— \n— \n141\n \nTax impact related to employee stock-based compensation expense\n— \n(\n134\n)\n— \n— \n(\n134\n)\nBalance as of December 31, 2023\n535.4\n \n33,070\n \n(\n26,549\n)\n(\n289\n)\n6,232\n \nNet income\n— \n— \n4,090\n \n— \n4,090\n \nOther comprehensive income, net of taxes\n— \n— \n— \n223\n \n223\n \nDividends declared on common stock ($\n9.13\n per share)\n— \n— \n(\n4,931\n)\n— \n(\n4,931\n)\nIssuance of common stock in connection with equity award programs\n2.2\n \n189\n \n— \n— \n189\n \nStock-based compensation expense\n— \n530\n \n— \n— \n530\n \nTax impact related to employee stock-based compensation expense\n— \n(\n256\n)\n— \n— \n(\n256\n)\nRepurchases of common stock\n(\n0.7\n)\n— \n(\n200\n)\n— \n(\n200\n)\nBalance as of December 31, 2024\n536.9\n \n$\n33,533\n \n$\n(\n27,590\n)\n$\n(\n66\n)\n$\n5,877\n \nSee accompanying notes.\nF-7\nAMGEN INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears ended December 31, 2024, 2023 and 2022 \n(In millions)\n2024\n2023\n2022\nCash flows from operating activities:\nNet income\n$\n4,090\n \n$\n6,717\n \n$\n6,552\n \nNoncash adjustments to reconcile net income to net cash provided by operating activities:\nDepreciation, amortization and other\n5,592\n \n4,071\n \n3,417\n \nStock-based compensation expense\n530\n \n431\n \n401\n \nDeferred income taxes\n(\n1,228\n)\n(\n1,273\n)\n(\n1,198\n)\nAdjustments for equity method investments\n(\n10\n)\n11\n \n891\n \nLoss on divestiture\n—\n \n—\n \n567\n \nLosses (gains) on equity securities\n159\n \n(\n1,565\n)\n127\n \nOther items, net\n(\n8\n)\n563\n \n(\n303\n)\nChanges in operating assets and liabilities, net of acquisitions:\nTrade receivables, net\n441\n \n(\n1,015\n)\n(\n746\n)\nInventories\n2,532\n \n491\n \n(\n742\n)\nOther assets\n(\n652\n)\n(\n564\n)\n258\n \nAccounts payable\n312\n \n(\n402\n)\n154\n \nAccrued income taxes, net\n(\n1,011\n)\n(\n1,031\n)\n(\n647\n)\nLong-term tax liabilities\n(\n492\n)\n371\n \n229\n \nAccrued liabilities\n92\n \n953\n \n97\n \nAccrued sales incentives and allowance\n1,194\n \n935\n \n846\n \nOther liabilities\n(\n51\n)\n(\n222\n)\n(\n182\n)\nNet cash provided by operating activities\n11,490\n \n8,471\n \n9,721\n \nCash flows from investing activities:\nCash paid for acquisitions, net of cash acquired\n—\n \n(\n26,989\n)\n(\n3,839\n)\nPurchases of marketable securities\n—\n \n(\n1\n)\n(\n2,587\n)\nProceeds from sales of marketable securities\n—\n \n1,123\n \n98\n \nProceeds from maturities of marketable securities\n—\n \n550\n \n1,120\n \nPurchases of property, plant and equipment\n(\n1,096\n)\n(\n1,112\n)\n(\n936\n)\nOther\n50\n \n225\n \n100\n \nNet cash used in investing activities\n(\n1,046\n)\n(\n26,204\n)\n(\n6,044\n)\nCash flows from financing activities:\nNet proceeds from issuance of debt\n—\n \n27,777\n \n6,919\n \nExtinguishment of debt\n(\n659\n)\n(\n647\n)\n(\n297\n)\nRepayment of debt\n(\n3,600\n)\n(\n1,454\n)\n—\n \nRepurchases of common stock\n(\n200\n)\n—\n \n(\n6,360\n)\nDividends paid\n(\n4,832\n)\n(\n4,556\n)\n(\n4,196\n)\nOther\n(\n124\n)\n(\n72\n)\n(\n103\n)\nNet cash (used in) provided by financing activities\n(\n9,415\n)\n21,048\n \n(\n4,037\n)\nIncrease (decrease) in cash and cash equivalents\n1,029\n \n3,315\n \n(\n360\n)\nCash and cash equivalents at beginning of year\n10,944\n \n7,629\n \n7,989\n \nCash and cash equivalents at end of year\n$\n11,973\n \n$\n10,944\n \n$\n7,629\n \nSee accompanying notes.\nF-8\nAMGEN INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024 \n1. \nSummary of significant accounting policies\nBusiness\nAmgen Inc. (including its consolidated subsidiaries, referred to as “Amgen,” “the Company,” “we,” “our” or “us”) is a global biotechnology pioneer that discovers, develops, manufactures and delivers innovative human therapeutics. We operate our business in \none\n operating segment: human therapeutics. See Note 2, Segment and other information.\nPrinciples of consolidation\nThe consolidated financial statements include the accounts of Amgen as well as its majority-owned subsidiaries. In determining whether we are the primary beneficiary of a variable interest entity, we consider whether we have both the power to direct activities of the entity that most significantly impact the entity’s economic performance and the obligation to absorb losses of, or the right to receive benefits from, the entity that could potentially be significant to that entity. We do not have any significant interests in any variable interest entities of which we are the primary beneficiary. All material intercompany transactions and balances have been eliminated in consolidation. Certain reclassifications have been made to prior periods in the consolidated financial statements and accompanying notes to conform with the current presentation.\nUse of estimates\nThe preparation of consolidated financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. Actual results may differ from those estimates.\nRevenues\nProduct sales and sales deductions\nRevenue from product sales is recognized upon transfer of control of a product to a customer, generally upon delivery, based on an amount that reflects the consideration to which we expect to be entitled, net of accruals for estimated rebates, wholesaler chargebacks, discounts and other deductions (collectively, sales deductions) and returns established at the time of sale.\nWe analyze the adequacy of our accruals for sales deductions quarterly. Amounts accrued for sales deductions are adjusted when trends or significant events indicate that an adjustment is appropriate. Accruals are also adjusted to reflect actual results. Accruals for sales deductions are based primarily on estimates of the amounts earned or to be claimed on the related sales. These estimates take into consideration current contractual and statutory requirements, specific known market events and trends, internal and external historical data and forecasted customer buying patterns. Sales deductions are substantially product specific and therefore, for any given period, can be affected by the mix of products sold. Included in sales deductions are immaterial net adjustments related to prior-period sales due to changes in estimates.\nReturns are estimated through comparison of historical return data with their related sales on a production lot basis. Historical rates of return are determined for each product and are adjusted for known or expected changes in the marketplace specific to each product, when appropriate. Historically, sales return provisions have amounted to less than \n1\n% of gross product sales. Changes in estimates for prior-period sales return provisions have historically been immaterial.\nOur payment terms vary by types and locations of customers and by products or services offered. Payment terms differ by jurisdiction and customer, but payment is generally required in a term ranging from \n30\n to \n120\n days from date of shipment or satisfaction of the performance obligation. For certain products or services and certain customer types, we may require payment before products are delivered or services are rendered to customers.\nIndirect taxes collected from customers and remitted to government authorities that are related to sales of the Company’s products, primarily in Europe, are excluded from revenues.\nAs a practical expedient, sales commissions are expensed when incurred because the amortization period would have been one year or less. These costs are recorded in SG&A expense in the Consolidated Statements of Income.\nF-9\nOther revenues\nOther revenues consist primarily of royalty income and corporate partner revenues. Royalties from licensees are based on third-party sales of licensed products and are recorded when the related third-party product sale occurs. Royalty income is estimated based on historical and forecasted sales trends. Corporate partner revenues are composed mainly of license fees and milestones earned and our share of commercial profits generated from collaborations. See Arrangements with multiple-performance obligations, discussed below.\nArrangements with multiple-performance obligations\nFrom time to time, we enter into arrangements for the R&D, manufacture and/or commercialization of products and product candidates. Such arrangements may require us to deliver various rights, services and/or goods, including intellectual property rights/licenses, R&D services, manufacturing services and/or commercialization services. The underlying terms of these arrangements generally provide for consideration to Amgen in the form of nonrefundable, upfront license fees; development and commercial-performance milestone payments; royalty payments; and/or profit sharing.\nIn arrangements involving more than one performance obligation, each required performance obligation is evaluated to determine whether it qualifies as a distinct performance obligation based on whether (i) the customer can benefit from the good or service either on its own or together with other resources that are readily available and (ii) the good or service is separately identifiable from other promises in the contract. The consideration under the arrangement is then allocated to each separate distinct performance obligation based on its respective relative stand-alone selling price. The estimated selling price of each deliverable reflects our best estimate of what the selling price would be if the deliverable was regularly sold by us on a stand-alone basis or by using an adjusted market assessment approach if selling price on a stand-alone basis is not available.\nThe consideration allocated to each distinct performance obligation is recognized as revenue when control of the related goods or services is transferred. Consideration associated with at-risk substantive performance milestones is recognized as revenue when it is probable that a significant reversal of the cumulative revenue recognized will not occur. We utilize the sales- and usage-based royalty exception in arrangements that resulted from the license of intellectual property, recognizing revenues generated from royalties or profit sharing as the underlying sales occur.\nResearch and development costs\nR&D costs are expensed as incurred and primarily include salaries, benefits and other staff-related costs; facilities and overhead costs; clinical trial and related clinical manufacturing costs; contract services and other outside costs; information systems’ costs; and amortization of acquired technology used in R&D with alternative future uses. R&D expenses also include costs and cost recoveries associated with third-party R&D arrangements, including upfront fees and milestones paid to third parties in connection with technologies that had not reached technological feasibility and did not have an alternative future use. Net payment or reimbursement of R&D costs is recognized when the obligations are incurred or as we become entitled to the cost recovery. See Note 9, Collaborations.\nSelling, general and administrative costs\nSG&A costs are primarily composed of salaries, benefits and other staff-related costs associated with sales and marketing, finance, legal and other administrative personnel; facilities and overhead costs; outside marketing, advertising and legal expenses; the U.S. healthcare reform federal excise fee on Branded Prescription Pharmaceutical Manufacturers and Importers; and other general and administrative costs. Advertising costs are expensed as incurred and were $\n987\n million, $\n647\n million and $\n841\n million during the years ended December 31, 2024, 2023 and 2022, respectively. SG&A expenses also include costs and cost recoveries associated with marketing and promotion efforts under certain collaborative arrangements. Net payment or reimbursement of SG&A costs is recognized when the obligations are incurred or we become entitled to the cost recovery. See Note 9, Collaborations.\nLeases\nAt inception of a contract, we determine whether an arrangement is or contains a lease. For all leases, we determine the classification as either operating or financing. Operating leases are included in Other noncurrent assets, Accrued liabilities and Other noncurrent liabilities in our Consolidated Balance Sheets.\nROU assets represent our right to use an underlying asset for the lease term, and lease liabilities represent our obligation to make lease payments under the lease. Lease recognition occurs at the commencement date, and lease liability amounts are based on the present value of lease payments made during the lease term. Our lease terms may include options to extend or terminate a lease when it is reasonably certain that we will exercise that option. Because most of our leases do not provide information to determine an implicit interest rate, we use our incremental borrowing rate in determining the present value of \nF-10\nlease payments. ROU assets also include any lease payments made prior to the commencement date less lease incentives received. Operating lease expense is recognized on a straight-line basis over the lease term.\nWe have lease agreements with both lease and nonlease components, which are generally accounted for together as a single lease component. In addition, for certain vehicle and equipment leases, we apply a portfolio approach to determine the lease term and discount rate.\nStock-based compensation\nWe have stock-based compensation plans under which various types of equity-based awards are granted, including RSUs, performance units and stock options. The fair values of RSUs and stock option awards, which are subject only to service conditions with graded vesting, are recognized as compensation expense, generally on a straight-line basis over the service period, net of estimated forfeitures. The fair values of performance unit awards are recognized as compensation expense, generally on a straight-line basis from the grant date to the end of the performance period. See Note 5, Stock-based compensation.\nIncome taxes\nWe provide for income taxes based on pretax income and applicable tax rates in the various jurisdictions in which we operate. Significant judgment is required in determining our provision for income taxes and income tax assets and liabilities, including evaluating uncertainties in the application of accounting principles and complex tax laws. Deferred income taxes are recorded for the expected tax consequences of temporary differences between the bases of assets and liabilities, as well as for loss and tax credit carryforwards for financial reporting purposes and amounts recognized for income tax purposes. We record a valuation allowance to reduce our deferred tax assets to the amount of future tax benefit that is more likely than not to be realized.\nWe recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained upon examination by tax authorities based on the technical merits of the position. The tax benefit recognized in the consolidated financial statements for a particular tax position is based on the largest benefit that is more likely than not to be realized. The amount of UTBs is adjusted as appropriate for changes in facts and circumstances, such as significant amendments to existing tax law, new regulations or interpretations by tax authorities, new information obtained during a tax examination or resolution of an examination. We recognize both accrued interest and penalties, when appropriate, related to UTBs in income tax expense. See Note 7, Income taxes.\nAmgen is subject to current U.S. minimum tax on foreign subsidiaries. Based on our election beginning in 2022, we have established deferred taxes with respect to the U.S. minimum tax on the earnings of our foreign subsidiaries. This requires us to recognize deferred taxes for temporary basis differences expected to reverse as global intangible low-taxed income in future years. These are ongoing adjustments that are likely to occur in the future.\n \nAcquisitions\nWe first determine whether a set of assets acquired constitutes a business and should be accounted for as a business combination. If the assets acquired do not constitute a business, we account for the transaction as an asset acquisition. Business combinations are accounted for by means of the acquisition method of accounting. Under the acquisition method, assets acquired, including IPR&D projects, and liabilities assumed are recorded in our consolidated financial statements at their respective fair values as of the acquisition date. The excess of the fair value of consideration transferred over the fair value of the net assets acquired is recorded as goodwill. Contingent consideration obligations incurred in connection with a business combination, including the assumption of an acquiree’s liability arising from an acquisition it consummated prior to our acquisition, are recorded at their fair values on the acquisition date and remeasured at their fair values each subsequent reporting period until the related contingencies have been resolved. The resulting changes in fair values are recorded in earnings. In contrast, asset acquisitions are accounted for by using a cost accumulation and allocation model. Under this model, the cost of the acquisition is allocated to the assets acquired and liabilities assumed. IPR&D projects with no alternative future use are recorded in R&D expense upon acquisition, and contingent consideration obligations incurred in connection with an asset acquisition are recorded when it is probable that they will occur and they can be reasonably estimated. See Note 4, Acquisitions and divestitures, and Note 18, Fair value measurement.\nCash equivalents\nWe consider cash equivalents to be only those investments that are highly liquid, that are readily convertible to cash and that mature within three months from the date of purchase.\nF-11\nInterest-bearing securities\nWe consider our interest-bearing securities investment portfolio as available-for-sale, and accordingly, these investments are recorded at fair value, with unrealized gains and losses recorded in AOCI. Investments with maturities beyond one year may be classified as short-term marketable securities in the Consolidated Balance Sheets due to their highly liquid nature and because they represent the Company’s investments that are available for current operations. See Note 10, Investments, and Note 18, Fair value measurement.\nInventories\nInventories are stated at the lower of cost or net realizable value. Cost, which includes amounts related to materials, labor and overhead, is determined in a manner that approximates the first-in, first-out method. Net realizable value is the estimated selling price in the ordinary course of business less reasonably predictable costs of completion, disposal and transportation. See Note 11, Inventories.\nDerivatives\nWe recognize all of our derivative instruments as either assets or liabilities at fair value in the Consolidated Balance Sheets. The accounting for changes in the fair value of a derivative instrument depends on whether the derivative has been formally designated and qualifies as part of a hedging relationship under the applicable accounting standards and, further, on the type of hedging relationship. For derivatives formally designated as hedges, we assess both at inception and quarterly thereafter whether the hedging derivatives are highly effective in offsetting changes in either the fair value or cash flows of the hedged item. Our derivatives that are not designated and do not qualify as hedges are adjusted to fair value through current earnings. See Note 18, Fair value measurement, and Note 19, Derivative instruments.\nProperty, plant and equipment, net\nProperty, plant and equipment is recorded at historical cost, net of accumulated depreciation, amortization and, if applicable, impairment charges. We review our property, plant and equipment assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Depreciation is recorded over the assets’ useful lives on a straight-line basis. Leasehold improvements are amortized on a straight-line basis over the shorter of their estimated useful lives or lease terms. See Note 12, Property, plant and equipment.\nGoodwill and other intangible assets\nFinite-lived intangible assets are recorded at cost, net of accumulated amortization and, if applicable, impairment charges. Amortization of finite-lived intangible assets is recorded over the assets’ estimated useful lives on a straight-line basis or based on the pattern in which economic benefits are consumed, if reliably determinable. We review our finite-lived intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. See Note 13, Goodwill and other intangible assets.\nThe fair values of IPR&D projects acquired in a business combination that are not complete are capitalized and accounted for as indefinite-lived intangible assets until completion or abandonment of the related R&D efforts. Upon successful completion of the project, the capitalized amount is amortized over its estimated useful life. If a project is abandoned, all remaining capitalized amounts are written off immediately. Major risks and uncertainties are often associated with IPR&D projects because we are required to obtain regulatory approvals before marketing the resulting products. Such approvals require completing clinical trials that demonstrate a product candidate is safe and effective. Consequently, the eventual realized value of the acquired IPR&D project may vary from its fair value at the date of acquisition, and IPR&D impairment charges may occur in future periods.\nCapitalized IPR&D projects are reviewed for impairment annually and whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. We consider various factors for potential impairment, including the current legal and regulatory environment and the competitive landscape. Adverse clinical trial results, significant delays in obtaining marketing approval, the inability to bring a product to market and the introduction or advancement of competitors’ products could result in partial or full impairment of the related intangible assets.\nWe perform an impairment test of goodwill annually and whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. To date, an impairment of goodwill has not been recorded. See Note 13, Goodwill and other intangible assets.\nF-12\nContingencies\nIn the ordinary course of business, we are involved in various legal proceedings, government investigations and other matters that are complex in nature and have outcomes that are difficult to predict. Certain of these proceedings are discussed in Note 20, Contingencies and commitments. We record accruals for loss contingencies to the extent that we conclude it is probable that a liability has been incurred and the amount of the related loss can be reasonably estimated. We evaluate, on a quarterly basis, developments in legal proceedings and other matters that could cause an increase or decrease in the amount of the liability that has been accrued previously.\nForeign currency translation\nThe net assets of international subsidiaries whose functional currencies are not in U.S. dollars are translated into U.S. dollars using current exchange rates. The U.S. dollar effects that arise from translation of the net assets of these subsidiaries at changing rates are recognized in AOCI. The subsidiaries’ earnings are translated into U.S. dollars by using average exchange rates.\nEquity investments\nMarketable and nonmarketable equity securities\nInvestments in publicly traded equity securities with readily determinable fair values are recorded at quoted market prices for identical securities, with changes in fair value recorded in Other income (expense), net, in the Consolidated Statements of Income. Investments in equity securities without readily determinable fair values are recorded at cost less impairment, if any, adjusted for changes resulting from observable price changes in orderly transactions for identical or similar securities. Such adjustments are recorded in Other income (expense), net, in the Consolidated Statements of Income.\nEquity method investments\nEquity investments that give us the ability to exert significant influence, but not control, over an investee for which we have not elected the fair value option are accounted for under the equity method of accounting. In concluding whether we have the ability to exercise significant influence over an investee, we consider factors such as our ownership percentage, voting and other shareholder rights, board of directors representation and the existence of other collaborative or business relationships. The equity method of accounting requires us to allocate the difference between the fair value of securities acquired and our proportionate share of the carrying value of the underlying assets (the basis difference) to various items and amortize such differences over their useful lives. Our share of investees’ earnings or losses and amortization of basis differences, if any, are recorded one quarter in arrears in Other income (expense), net, in the Consolidated Statements of Income. We record impairment losses on our equity method investments if we deem the impairment to be other-than-temporary. We deem an impairment to be other-than-temporary based on various factors, including, but not limited to, the length of time the fair value is below the carrying value, volatility of the security price and our intent and ability to retain the investment to allow for a recovery in fair value.\nFor equity method investments for which we have elected the fair value option, changes in fair value are recorded in Other income (expense), net, in the Consolidated Statements of Income.\nAdditionally, we hold investments in limited partnerships, which primarily invest in early-stage biotechnology companies. As a practical expedient, such limited partnership investments are measured by using our proportionate share of the net asset values of the underlying investments held by the limited partnerships, with such changes included in Other income (expense), net, in the Consolidated Statements of Income.\nRecently adopted accounting pronouncements\nIn November 2023, the FASB issued ASU No. 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures, to improve reportable segment disclosure requirements through enhanced disclosures about significant segment expenses and additional interim segment reporting disclosures, including for companies with a single reportable segment. The standard is effective for public business entities such as Amgen for annual periods beginning after December 15, 2023, and interim periods beginning after December 15, 2024, with retrospective application required for all prior periods presented. We adopted this standard in fiscal year 2024, which resulted in incremental segment disclosures. See Note 2, Segment and other information.\nRecent accounting pronouncements not yet adopted\nIn December 2023, the FASB issued ASU No. 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures, to improve income tax disclosure requirements by requiring more detailed information on several income tax \nF-13\ndisclosures, such as enhancing disclosure of income taxes paid and requiring disaggregation of the effective income tax rate reconciliation. The standard is effective for public business entities such as Amgen for annual periods beginning after December 15, 2024. Early adoption is permitted, and entities may apply the standard prospectively or retrospectively. We are currently evaluating the impact of adopting this standard on our consolidated financial statements and related disclosures.\nIn November 2024, the FASB issued ASU No. 2024-03, Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses, to improve disclosures about a public business entity’s expenses by requiring disaggregated disclosures of certain types of expenses, including purchases of inventory, employee compensation, depreciation, intangible amortization and depletion, as applicable, for each income statement caption that includes those expenses. In addition, the standard will require entities to define and disclose total selling expenses. The standard is effective for public business entities such as Amgen for annual periods beginning after December 15, 2026, and interim periods beginning after December 15, 2027. Early adoption is permitted, and entities may apply the standard prospectively or retrospectively. We are currently evaluating the impact of adopting this standard on our consolidated financial statements and related disclosures.\n2. \nSegment and other information\nWe operate our business in \none\n operating segment, which also represents \none\n reportable segment: human therapeutics. Therefore, results of our operations are reported on a consolidated basis for purposes of segment reporting, consistent with internal management reporting.\nThe human therapeutics segment is engaged in the discovery, development, manufacturing and delivery of innovative medicines to fight some of the world’s toughest diseases. The Company’s Chief Executive Officer has been identified as the chief operating decision maker (CODM). The CODM manages and allocates resources on a consolidated basis. The determination of a single segment is consistent with the financial information regularly reviewed by the CODM for purposes of evaluating performance and allocating resources, which is reviewed on a consolidated basis. \nAs the Company’s CODM evaluates the financial performance of the Company’s human therapeutics segment on a consolidated basis, the measure of segment performance is net income, as reflected in the Consolidated Statements of Income. The CODM uses net income to allocate resources on a consolidated basis, which enables the CODM to assess both the overall level of resources available and optimize distribution of resources across functions, therapeutic areas, regions and research and development programs in line with our long-term corporate-wide strategic goals. In addition, the CODM may also evaluate financial performance based on net income adjusted for certain items that are unusual and non-recurring. As the Company manages its assets on a consolidated basis, the measure of segment assets is total assets, as reflected in the Consolidated Balance Sheets. See Note 10, Investments, for further information regarding equity method investments, and Net cash used in investing activities in the Consolidated Statements of Cash Flows for further information regarding capital expenditures.\nF-14\nThe following table provides segment revenues, significant segment expenses, other segment items, reported segment net income and a reconciliation of segment net income to the Company’s total consolidated net income for the years ended December 31, 2024, 2023 and 2022 (in millions):\nYears ended December 31,\n2024\n2023\n2022\nRevenues:\nProduct sales\n$\n32,026\n \n$\n26,910\n \n$\n24,801\n \nOther revenues\n1,398\n \n1,280\n \n1,522\n \nTotal revenues\n33,424\n \n28,190\n \n26,323\n \nLess:\nManufacturing cost of sales\n(1)(2)\n11,118\n \n7,347\n \n5,776\n \nProfit share and royalties in cost of sales\n(1)\n1,740\n \n1,104\n \n630\n \nResearch and development\n(1)\n5,964\n \n4,784\n \n4,434\n \nSales and marketing\n(1)\n4,713\n \n3,784\n \n3,736\n \nGeneral and administrative\n(1)\n2,383\n \n2,395\n \n1,678\n \nOther segment items\n(3)\n262\n \n(\n743\n)\n777\n \nEquity in (income) loss of equity method investments\n(\n10\n)\n14\n \n667\n \nInterest income\n(\n510\n)\n(\n1,225\n)\n(\n127\n)\nInterest expense, net\n3,155\n \n2,875\n \n1,406\n \nProvision for income taxes\n519\n \n1,138\n \n794\n \nSegment net income\n4,090\n \n6,717\n \n6,552\n \nReconciliation of profit or loss:\nAdjustments and reconciling items\n—\n \n—\n \n—\n \nConsolidated net income\n$\n4,090\n \n$\n6,717\n \n$\n6,552\n \n____________\n(1)    \nDuring the years ended December 31, 2024, 2023 and 2022, we recognized amortization expense on our intangible assets of $\n4.8\n billion, $\n3.2\n billion and $\n2.6\n billion, respectively. Amortization of intangible assets is included primarily in Cost of sales in the Consolidated Statements of Income. In addition, during the years ended December 31, 2024, 2023 and 2022, we recognized depreciation and ROU asset amortization expense of $\n805\n million, $\n824\n million and $\n818\n million, respectively.\n(2)    \nDuring the years ended December 31, 2024, 2023 and 2022, manufacturing cost of sales included amortization of step-up to fair value of inventory acquired in business combinations of $\n2.4\n billion, $\n656\n million and $\n30\n million, respectively.\n(3)    \nOther segment items included in Segment net income primarily consists of: (i) fair value adjustments on equity securities (see Note 10, Investments) and (ii) net impairment charges on intangible assets (see Note 13, Goodwill and other intangible assets). For the year ended December 31, 2023, other segment items also included expenses related to our restructuring plan that was both initiated and substantially completed in 2023. For the year ended December 31, 2022, other segment items also included a loss on the divestiture of Gensenta (see Note 4, Acquisitions and divestitures).\nF-15\n3. \nRevenues\nWe operate our business in \none\n operating segment: human therapeutics. Therefore, results of our operations are reported on a consolidated basis for purposes of segment reporting, consistent with internal management reporting. Revenues by product and by geographic area, based on customers’ locations, are presented below. The majority of ROW product sales relates to products sold in Europe.\nRevenues were as follows (in millions):\nYear ended December 31, 2024\nYear ended December 31, 2023\nYear ended December 31, 2022\nU.S.\nROW\nTotal\nU.S.\nROW\nTotal\nU.S.\nROW\nTotal\nProlia\n$\n2,885\n \n$\n1,489\n \n$\n4,374\n \n$\n2,733\n \n$\n1,315\n \n$\n4,048\n \n$\n2,465\n \n$\n1,163\n \n$\n3,628\n \nENBREL\n3,288\n \n28\n \n3,316\n \n3,650\n \n47\n \n3,697\n \n4,044\n \n73\n \n4,117\n \nXGEVA\n1,507\n \n718\n \n2,225\n \n1,527\n \n585\n \n2,112\n \n1,480\n \n534\n \n2,014\n \nRepatha\n1,139\n \n1,083\n \n2,222\n \n793\n \n842\n \n1,635\n \n608\n \n688\n \n1,296\n \nOtezla\n1,699\n \n427\n \n2,126\n \n1,777\n \n411\n \n2,188\n \n1,886\n \n402\n \n2,288\n \nTEPEZZA\n(1)\n1,835\n \n16\n \n1,851\n \n441\n \n7\n \n448\n \n—\n \n—\n \n—\n \nEVENITY\n1,131\n \n432\n \n1,563\n \n809\n \n351\n \n1,160\n \n533\n \n254\n \n787\n \nKYPROLIS\n948\n \n555\n \n1,503\n \n921\n \n482\n \n1,403\n \n850\n \n397\n \n1,247\n \nNplate\n970\n \n486\n \n1,456\n \n996\n \n481\n \n1,477\n \n848\n \n459\n \n1,307\n \nAranesp\n386\n \n956\n \n1,342\n \n452\n \n910\n \n1,362\n \n521\n \n900\n \n1,421\n \nBLINCYTO\n800\n \n416\n \n1,216\n \n566\n \n295\n \n861\n \n336\n \n247\n \n583\n \nKRYSTEXXA\n(1)\n1,185\n \n—\n \n1,185\n \n272\n \n—\n \n272\n \n—\n \n—\n \n—\n \nVectibix\n519\n \n526\n \n1,045\n \n461\n \n523\n \n984\n \n396\n \n497\n \n893\n \nTEZSPIRE\n972\n \n—\n \n972\n \n567\n \n—\n \n567\n \n170\n \n—\n \n170\n \nOther products\n(2)\n4,037\n \n1,593\n \n5,630\n \n3,307\n \n1,389\n \n4,696\n \n3,606\n \n1,444\n \n5,050\n \nTotal product sales\n(3)\n23,301\n \n8,725\n \n32,026\n \n19,272\n \n7,638\n \n26,910\n \n17,743\n \n7,058\n \n24,801\n \nOther revenues\n562\n \n836\n \n1,398\n \n534\n \n746\n \n1,280\n \n852\n \n670\n \n1,522\n \nTotal revenues\n$\n23,863\n \n$\n9,561\n \n$\n33,424\n \n$\n19,806\n \n$\n8,384\n \n$\n28,190\n \n$\n18,595\n \n$\n7,728\n \n$\n26,323\n \n____________\n(1)    \nTEPEZZA and KRYSTEXXA were acquired from the acquisition of Horizon on October 6, 2023, and include product sales in the periods after the acquisition date.\n(2)    \nConsists of product sales of our non-principal products.\n(3)    \nHedging gains and losses, which are included in product sales, were not material for the years ended December 31, 2024, 2023 and 2022.\nIn the United States, we sell primarily to pharmaceutical wholesale distributors that we use as the principal means of distributing our products to healthcare providers. Outside the United States, we sell principally to healthcare providers and/or pharmaceutical wholesale distributors depending on the distribution practice in each country. We monitor the financial condition of our larger customers and limit our credit exposure by setting credit limits and, in certain circumstances, by requiring letters of credit or obtaining credit insurance.\nF-16\nFor each of the years ended December 31, 2024, 2023 and 2022, we had product sales to three customers that individually accounted for more than 10% of total revenues. \nFor the year ended December 31, 2024, on a combined basis, these customers accounted for \n77\n% of total gross revenues as shown in the following table. Certain information with respect to these customers was as follows (dollar amounts in millions):\nYears ended December 31,\n2024\n2023\n2022\nMcKesson Corporation:\nGross product sales\n$\n22,173\n \n$\n19,035\n \n$\n17,305\n \n% of total gross revenues\n33\n \n%\n33\n \n%\n35\n \n%\nCencora, Inc.:\nGross product sales\n$\n18,387\n \n$\n16,625\n \n$\n15,443\n \n% of total gross revenues\n27\n \n%\n29\n \n%\n31\n \n%\nCardinal Health, Inc.:\nGross product sales\n$\n11,278\n \n$\n9,775\n \n$\n8,319\n \n% of total gross revenues\n17\n \n%\n17\n \n%\n16\n \n%\nAs of December 31, 2024 and 2023, amounts due from these three customers each exceeded 10% of gross trade receivables and accounted for \n70\n% and \n75\n%, respectively, of net trade receivables on a combined basis. As of December 31, 2024 and 2023, \n26\n% and \n22\n%, respectively, of net trade receivables were due from customers located outside the United States, the majority of which were from Europe. Our total allowance for doubtful accounts as of December 31, 2024 and 2023, was not material.\nF-17\n4. \nAcquisitions and divestitures \nAcquisition of Horizon Therapeutics plc\nOn October 6, 2023, Amgen completed its acquisition of Horizon by acquiring all of the outstanding shares of Horizon for $\n116.50\n per share in cash, representing a total consideration of approximately $\n27.8\n billion. Horizon is a global biotechnology company focused on the discovery, development and commercialization of medicines that address critical needs of patients impacted by rare, autoimmune and severe inflammatory diseases. The acquisition, which was accounted for as a business combination, aligns with Amgen’s core strategy of delivering innovative medicines that make a significant difference for patients suffering from serious diseases and strengthens Amgen’s leading rare disease portfolio by adding first-in-class, early-in-lifecycle medicines, including TEPEZZA for thyroid eye disease, KRYSTEXXA for chronic refractory gout and UPLIZNA for neuromyelitis optica spectrum disorder. Upon its acquisition, Horizon became a wholly owned subsidiary of Amgen, and its operations have been included in our consolidated financial statements commencing on the acquisition date.\nDuring the year ended December 31, 2024, the purchase price allocation of the acquisition was completed and measurement period adjustments were finalized, which included changes to the purchase price allocation that resulted in a net increase of approximately $\n25\n million to goodwill. The measurement period adjustments resulted primarily from adjustments to acquired assets and liabilities, including deferred tax attributes, based on facts and circumstances that existed as of the acquisition date and did not result from events subsequent to the acquisition date. The adjustments did not have a significant impact on Amgen’s results of operations during the year ended December 31, 2024, and would not have had a significant impact on prior-period results if the adjustments had been made as of the acquisition date.\nThe following table summarizes the final total consideration and allocated acquisition date fair values of assets acquired and liabilities assumed, inclusive of measurement-period adjustments (in millions):\nCash and cash equivalents\n$\n681\n \nInventories\n5,014\n \nProperty, plant and equipment, net\n318\n \nFinite-lived intangible assets—developed-product-technology rights\n19,590\n \nIPR&D\n1,060\n \nGoodwill\n3,136\n \nDeferred tax asset\n795\n \nDeferred tax liability\n(\n2,488\n)\nOther assets and liabilities, net\n(\n273\n)\nTotal assets acquired, net of liabilities assumed\n$\n27,833\n \nThe $\n27.8\n billion total consideration for this transaction consisted of (i) cash consideration transferred to common shareholders of $\n26.7\n billion; (ii) cash consideration transferred to vested and outstanding options, outstanding RSU awards and outstanding performance share unit awards of $\n523\n million; (iii) fair value of Amgen replacement awards (based on conversion of outstanding employee RSU awards) of $\n180\n million representing noncash consideration; and (iv) a portion of Horizon’s debt, settled by Amgen on the acquisition closing date, of $\n382\n million. Amgen issued \n1.7\n million replacement equity awards with the original vesting conditions, the fair value of which was determined based on the acquisition date fair value based on the conversion calculation. See Note 5, Stock-based compensation.\nThe estimated fair values of $\n20.7\n billion for the developed-product-technology rights and IPR&D intangible assets were determined using a multi-period excess earnings income approach that discounts expected future cash flows to present value by applying a discount rate that represents the estimated rate that market participants would use to value the intangible assets. The projected cash flows were based on certain assumptions attributable to the respective intangible asset, including estimates of future revenues and expenses, the time and resources needed to complete development and the probabilities of obtaining marketing approval from the FDA and other regulatory agencies. The developed-product-technology rights are being amortized on a straight-line basis over a weighted-average period of approximately\n \n10\n years from the acquisition date using the straight-line methodology.\nF-18\nThe estimated fair value of the acquired inventory of $\n5.0\n billion was determined using the comparative sales method, which uses actual or expected selling prices of inventory as the base amount to which adjustments for selling effort and a profit on the buyer’s effort are applied. The inventory fair value adjustment is being amortized using a weighted-average inventory turnover, which we estimate to approximate \n27\n months from the acquisition date.\nA deferred tax liability of $\n2.5\n billion was recognized on the temporary differences related to the book bases and tax bases of the acquired identifiable assets and assumed liabilities, primarily driven by the intangible assets acquired, as well as associated deferred tax asset for anticipatory foreign tax credits of $\n795\n million.\nThe excess of the acquisition date consideration over the fair values assigned to the assets acquired and the liabilities assumed of $\n3.1\n billion was recorded as goodwill, which is not deductible for tax purposes. The goodwill value represents expected synergies from the marketed products acquired and other benefits.\nDuring the three months ended December 31, 2023, the Company incurred approximately $\n487\n million of acquisition costs related to the closing of our Horizon acquisition, consisting of $\n167\n million for share-based payments to settle non-vested equity awards attributable to post-combination services, severance and other employee-related expenses and $\n320\n million for transaction costs. These costs were included primarily in SG&A expense in the Consolidated Statements of Income.\nSupplemental Pro Forma Financial Information\nThe following table presents the unaudited supplemental pro forma results of a hypothetical combined\n \nAmgen and Horizon entity for the years ended December 31, 2023 and 2022, as if the acquisition of Horizon had occurred on January 1, 2022 (in millions):\nYears ended December 31,\n2023\n2022\nTotal revenues\n$\n30,969\n \n$\n29,964\n \nNet income\n$\n5,383\n \n$\n2,381\n \nThe unaudited supplemental pro forma combined financial information was prepared using the acquisition method of accounting and was based on the historical financial information of Amgen and Horizon. In order to reflect the occurrence of the acquisition on January 1, 2022, the unaudited supplemental pro forma financial information includes adjustments to reflect: (i) incremental amortization expense based on the fair values of the identifiable intangible assets and inventory step-up; (ii) the additional interest expense associated with the issuance of debt to finance the acquisition; (iii) the reclassification of transaction and other acquisition-related costs incurred during the three months ended December 31, 2023, to the year ended December 31, 2022; and (iv) the income tax impact using an estimated effective tax rate applied to the combined entity. The unaudited supplemental pro forma financial information is not necessarily indicative of what the consolidated results of operations would have been had the acquisition been completed on January 1, 2022. In addition, the unaudited pro forma financial information is not a projection of future results of operations of the combined company, nor does it reflect the expected realization of any synergies or cost savings associated with the acquisition.\nAcquisition of ChemoCentryx, Inc.\nOn October 20, 2022, we acquired all of the outstanding stock of ChemoCentryx, a publicly traded biotechnology company focused on orally administered therapeutics to treat autoimmune diseases, inflammatory disorders and cancer, for $\n52.00\n per share in cash, representing a total consideration of $\n3.9\n billion. The acquisition, which was accounted for as a business combination, includes TAVNEOS, an orally administered selective complement 5a receptor inhibitor that was approved by the FDA in October 2021 as an adjunctive therapy for adults with severe active antineutrophil cytoplasmic autoantibody-associated vasculitis (ANCA-associated vasculitis). TAVNEOS is commercialized by us in the United States; for markets outside the United States, TAVNEOS is commercialized by a collaboration partner, and Amgen is entitled to royalties and milestones based on future sales of the product. Upon its acquisition, ChemoCentryx became a wholly owned subsidiary of Amgen, and its operations became included in our consolidated financial statements commencing on the acquisition date.\nMeasurement-period adjustments during the year ended December 31, 2023, included changes in the purchase price allocation and total consideration, resulting in a net decrease of approximately $\n18\n million to goodwill. The adjustments did not have a significant impact on Amgen’s results of operations during the year ended December 31, 2023, and would not have had a significant impact on prior-period results if the adjustments had been made as of the acquisition date.\nF-19\nThe following table summarizes the final total consideration and allocated acquisition date fair values of assets acquired and liabilities assumed, inclusive of measurement-period adjustments (in millions):\nCash and cash equivalents\n$\n86\n \nMarketable securities\n235\n \nInventories\n41\n \nFinite-lived intangible assets—developed-product-technology rights\n3,499\n \nGoodwill\n649\n \nOther liabilities, net\n(\n83\n)\nDeferred tax liability, net\n(\n502\n)\nTotal assets acquired, net of liabilities assumed\n$\n3,925\n \nThe $\n3.9\n billion total consideration consisted of (i) a $\n3.7\n billion cash payment to outstanding common stockholders of ChemoCentryx and (ii) a $\n181\n million cash payment to equity award holders of ChemoCentryx for services rendered prior to the acquisition date of October 20, 2022, under the ChemoCentryx equity award plans.\nThe developed-product-technology rights acquired relates to TAVNEOS, which is approved in the United States and the EU for ANCA-associated vasculitis. The estimated fair value of $\n3.5\n billion was determined by using a multi-period excess earnings income approach that discounts expected future cash flows to present value by applying a discount rate that represents the estimated rate that market participants would use to value the intangible assets. The developed-product-technology rights are being amortized on a straight-line basis over a weighted-average period of approximately \n11\n years from the acquisition date using the straight-line methodology.\nThe estimated fair value of the acquired inventory of $\n41\n million was determined using the comparative sales method, which uses actual or expected selling prices of inventory as the base amount to which adjustments for selling effort and a profit on the buyer’s effort are applied. The inventory fair value adjustment was amortized as inventory turned over, which we estimated to be approximately \n13\n months from the acquisition date.\nA net deferred tax liability of $\n502\n million was recognized on the temporary differences related to the book bases and tax bases of the acquired identifiable assets and assumed liabilities, primarily driven by the intangible assets acquired.\nThe excess of the acquisition date consideration over the fair values assigned to the assets acquired and the liabilities assumed of $\n649\n million was recorded as goodwill, which is not deductible for tax purposes. The goodwill value is primarily attributable to the expected synergies from the TAVNEOS asset.\nDivestiture of Gensenta İlaç Sanayi ve Ticaret A.Ş.\nOn November 2, 2022, we sold our shares in Gensenta, a subsidiary in Turkey, to Eczacıbaşı for net cash proceeds of approximately $\n130\n million. The transaction was accounted for as a sale of a business and did not meet the criteria to be classified as discontinued operations. Upon closing of this transaction, net assets related to Gensenta of $\n86\n million were divested, and during the year ended December 31, 2022, we recognized a loss on divestiture of $\n567\n million recorded in Other operating expenses in the Consolidated Statements of Income, primarily due to the reclassification of $\n615\n million of cumulative foreign currency translation losses from AOCI into earnings. See Note 17, Stockholders’ equity.\nF-20\n5. \nStock-based compensation\nOur Amended 2009 Plan authorizes for issuance to employees of Amgen and nonemployee members of our Board of Directors shares of our common stock pursuant to grants of equity-based awards, including RSUs, stock options and performance units. The pool of shares available under the Amended 2009 Plan is reduced by \none\n share for each stock option granted and by \n1.9\n shares for other types of awards granted, including full-value awards. In general, if any shares subject to an award granted under the Amended 2009 Plan expire or become forfeited, terminated or canceled without the issuance of shares, the shares subject to such awards are added back into the authorized pool on the same basis that they were removed. In addition, under the Amended 2009 Plan, shares withheld to pay for minimum statutory tax obligations with respect to full-value awards are added back into the authorized pool on the basis of \n1.9\n shares. As of December 31, 2024, the Amended 2009 Plan provides for future grants and/or issuances of up to approximately \n59\n million shares of our common stock. Stock-based awards under our employee compensation plans are made with newly issued shares reserved for this purpose.\nThe following table reflects the components of stock-based compensation expense recognized in our Consolidated Statements of Income (in millions):\nYears ended December 31,\n2024\n2023\n2022\nRSUs\n$\n351\n \n$\n309\n \n$\n227\n \nPerformance units\n133\n \n121\n \n132\n \nStock options\n46\n \n43\n \n42\n \nTotal stock-based compensation expense, pretax\n530\n \n473\n \n401\n \nTax benefit from stock-based compensation expense\n(\n114\n)\n(\n102\n)\n(\n86\n)\nTotal stock-based compensation expense, net of tax\n$\n416\n \n$\n371\n \n$\n315\n \nRestricted stock units and stock options\nEligible employees generally receive an annual grant of RSUs and, for certain executive-level employees, stock options, with the size and type of award generally determined by the employee’s salary grade and performance level. Certain management and professional-level employees typically receive RSU grants upon commencement of employment. Nonemployee members of our Board of Directors also receive an annual grant of RSUs.\nOur RSU and stock option grants provide for accelerated or continued vesting in certain circumstances as defined in the plans and related grant agreements, including upon death, disability, termination in connection with a change in control and the retirement of employees who meet certain service and/or age requirements. RSUs and stock options generally vest in equal amounts on the second, third and fourth anniversaries of the grant date. RSUs accrue dividend equivalents, which are typically payable in shares only when and to the extent the underlying RSUs vest and are issued to the recipient.\nRestricted stock units\nThe grant date fair value of an RSU equals the closing price of our common stock on the grant date, as RSUs accrue dividend equivalents during their vesting period, except with respect to certain holders of Horizon unvested RSUs who were granted replacement Amgen RSUs in 2023 under the original terms of the awards in connection with the Horizon acquisition based on the terms of the transaction. See Note 4, Acquisitions and divestitures. Subsequent to the Horizon acquisition, $\n42\n million of the RSUs were accelerated and cash settled in 2023. The weighted-average grant date fair values per unit of RSUs granted (excluding replacement awards granted to Horizon RSU holders) during the years ended December 31, 2024, 2023 and 2022, were $\n301.36\n, $\n237.70\n and $\n234.47\n, respectively.\nF-21\nThe following table summarizes information regarding our RSUs:\nYear ended December 31, 2024\nUnits\n(in millions)\nWeighted-average\ngrant date\nfair value\nBalance nonvested as of December 31, 2023\n3.9\n \n$\n246.43\n \nGranted\n1.5\n \n$\n301.36\n \nVested\n(\n1.6\n)\n$\n250.80\n \nForfeited\n(\n0.3\n)\n$\n267.28\n \nBalance nonvested as of December 31, 2024\n3.5\n \n$\n265.07\n \nThe total grant date fair values of RSUs that vested during the years ended December 31, 2024, 2023 and 2022, were $\n401\n million, $\n309\n million and $\n192\n million, respectively.\nStock options\nThe exercise price of stock options is set as the closing price of our common stock on the grant date, and the related number of shares granted is fixed at that point in time. Awards expire \n10\n years from the date of grant. We use the Black–Scholes option valuation model to estimate the grant date fair value of stock options.\nThe weighted-average assumptions used in the option valuation model and the resulting weighted-average grant date fair values of stock options granted were as follows:\nYears ended December 31,\n2024\n2023\n2022\nClosing price of our common stock on grant date\n$\n300.30\n$\n235.97\n \n$\n230.92\n \nExpected volatility (average of implied and historical volatility)\n26.9\n \n%\n23.3\n \n%\n24.5\n \n%\nExpected life (in years)\n5.7\n5.7\n5.7\nRisk-free interest rate\n4.4\n \n%\n3.4\n \n%\n2.8\n \n%\nExpected dividend yield\n3.2\n \n%\n3.5\n \n%\n3.3\n \n%\nFair value of stock options granted\n$\n69.34\n$\n41.86\n \n$\n42.43\n \nThe following table summarizes information regarding our stock options:\nYear ended December 31, 2024\nOptions\n(in millions)\nWeighted-\naverage\nexercise price\nWeighted-\naverage\nremaining\ncontractual\nlife (in years)\nAggregate\nintrinsic\nvalue\n(in millions)\nBalance unexercised as of December 31, 2023\n5.9\n \n$\n213.90\n \nGranted\n0.8\n \n$\n300.32\n \nExercised\n(\n0.6\n)\n$\n201.22\n \nExpired/forfeited\n(\n0.2\n)\n$\n248.94\n \nBalance unexercised as of December 31, 2024\n5.9\n \n$\n225.84\n \n6.3\n$\n236\n \nVested or expected to vest as of December 31, 2024\n5.7\n \n$\n224.34\n \n6.2\n$\n234\n \nExercisable as of December 31, 2024\n3.1\n \n$\n202.02\n \n4.6\n$\n182\n \nThe total intrinsic values of options exercised during the years ended December 31, 2024, 2023 and 2022, were $\n70\n million, $\n33\n million and $\n67\n million, respectively. The actual tax benefits realized from tax deductions from option exercises during the years ended December 31, 2024, 2023 and 2022, were $\n15\n million, $\n7\n million and $\n14\n million, respectively.\nAs of December 31, 2024, $\n510\n million of unrecognized compensation cost was related to nonvested RSUs and unvested stock options, which is expected to be recognized over a weighted-average period of \n1.8\n years.\nF-22\nPerformance units\nCertain management-level employees also receive annual grants of performance units, which give the recipient the right to receive common stock that is contingent upon achievement of specified preestablished goals over the performance period, which is generally \nthree years\n. The performance goals for the units granted during the years ended December 31, 2024, 2023 and 2022, which are accounted for as equity awards, are based on (i) Amgen’s total stockholder return compared with a comparator group of companies, which are considered market conditions and are therefore reflected in the grant date fair values of the units, and (ii) Amgen’s stand-alone financial performance measures, which are considered performance conditions. The expense recognized for awards is based on the grant date fair value of a unit multiplied by the number of units expected to be earned with respect to the related performance conditions, net of estimated forfeitures. Depending on the outcome of these performance goals, a recipient may ultimately earn a number of units greater or less than the number of units granted. Shares of our common stock are issued on a \none\n-for-one basis for each performance unit earned. In general, performance unit awards vest at the end of the performance period. The performance award program provides for accelerated or continued vesting in certain circumstances as defined in the plan, including upon death, disability, a change in control and retirement of employees who meet certain service and/or age requirements. Performance units accrue dividend equivalents that are typically payable in shares only when and to the extent the underlying performance units vest and are issued to the recipient, including with respect to market and performance conditions that affect the number of performance units earned.\nWe use a payout simulation model to estimate the grant date fair value of performance units. \nThe weighted-average assumptions used in the payout simulation model and the resulting weighted-average grant date fair values of performance units granted were as follows:\nYears ended December 31,\n2024\n2023\n2022\nClosing price of our common stock on grant date\n$\n300.30\n \n$\n235.97\n \n$\n230.92\n \nVolatility\n22.1\n \n%\n21.6\n \n%\n28.1\n \n%\nRisk-free interest rate\n4.6\n \n%\n3.7\n \n%\n0.3\n \n%\nFair value of units granted\n$\n321.61\n \n$\n252.49\n \n$\n247.48\n \nThe payout simulation model assumes correlations of returns of the stock prices of our common stock and the common stocks of the comparator groups of companies and stock price volatilities of the comparator groups of companies to simulate stockholder returns over the performance periods and their resulting impact on the payout percentages based on the contractual terms of the performance units.\nAs of December 31, 2024 and 2023, \n1.4\n million and \n1.7\n million performance units were outstanding, respectively, with weighted-average grant date fair values per unit of $\n263.86\n and $\n251.41\n per unit, respectively. During the year ended December 31, 2024, \n0.3\n million performance units with a weighted-average grant date fair value per unit of $\n321.61\n were granted, and \n0.1\n million performance units with a weighted-average grant date fair value per unit of $\n261.03\n were forfeited.\nThe total fair values of performance units paid during the years ended December 31, 2024, 2023 and 2022, were $\n182\n million, $\n109\n million and $\n150\n million, respectively, based on the number of performance units earned multiplied by the closing stock price of our common stock on the last day of the performance period.\nAs of December 31, 2024, $\n87\n million of unrecognized compensation cost was related to nonvested performance units, which is expected to be recognized over a weighted-average period of \none year\n.\n6. \nDefined contribution plan\nThe Company has defined contribution plans to which certain employees of the Company and participating subsidiaries may defer compensation for income tax purposes. Participants are eligible to receive matching contributions based on their contributions, in addition to other Company contributions. Defined contribution plan expenses were $\n375\n million, $\n311\n million and $\n243\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nF-23\n7. \nIncome taxes\nIncome before income taxes included the following (in millions):\nYears ended December 31,\n2024\n2023\n2022\nDomestic\n$\n4,040\n \n$\n4,047\n \n$\n3,026\n \nForeign\n569\n \n3,808\n \n4,320\n \nTotal income before income taxes\n$\n4,609\n \n$\n7,855\n \n$\n7,346\n \nThe provision for income taxes included the following (in millions):\nYears ended December 31,\n2024\n2023\n2022\nCurrent provision:\nFederal\n$\n965\n \n$\n1,524\n \n$\n1,721\n \nState\n33\n \n43\n \n44\n \nForeign\n759\n \n786\n \n304\n \nTotal current provision\n1,757\n \n2,353\n \n2,069\n \nDeferred benefit:\nFederal\n(\n860\n)\n(\n1,124\n)\n(\n1,185\n)\nState\n(\n18\n)\n(\n25\n)\n(\n27\n)\nForeign\n(\n360\n)\n(\n66\n)\n(\n63\n)\nTotal deferred benefit\n(\n1,238\n)\n(\n1,215\n)\n(\n1,275\n)\nTotal provision for income taxes\n$\n519\n \n$\n1,138\n \n$\n794\n \nF-24\nDeferred income taxes reflect the tax effect of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes, tax credit carryforwards and the tax effects of NOL carryforwards. As of December 31, 2022, we elected to establish deferred taxes with respect to the U.S. minimum tax on the earnings of our foreign subsidiaries for the reversal of temporary items in future years. \nSignificant components of our deferred tax assets and liabilities were as follows (in millions):\nDecember 31,\n2024\n2023\nDeferred income tax assets:\nNOL and credit carryforwards\n$\n1,352\n \n$\n1,465\n \nAccrued expenses\n693\n \n668\n \nCapitalized research and development expenses\n1,762\n \n1,333\n \nInvestments\n1\n \n—\n \nExpenses capitalized for tax\n200\n \n210\n \nEarnings of foreign subsidiaries\n1,496\n \n1,260\n \nStock-based compensation\n130\n \n159\n \nOther\n361\n \n416\n \nTotal deferred income tax assets\n5,995\n \n5,511\n \nValuation allowance\n(\n1,019\n)\n(\n957\n)\nNet deferred income tax assets\n4,976\n \n4,554\n \nDeferred income tax liabilities:\nAcquired intangible assets\n(\n2,573\n)\n(\n3,028\n)\nDebt\n(\n264\n)\n(\n268\n)\nFixed assets\n(\n143\n)\n(\n140\n)\nFair value of acquired inventory\n(\n114\n)\n(\n349\n)\nInvestments\n—\n \n(\n99\n)\nOther\n(\n244\n)\n(\n224\n)\nTotal deferred income tax liabilities\n(\n3,338\n)\n(\n4,108\n)\nTotal deferred income taxes, net\n$\n1,638\n \n$\n446\n \nThe Company has determined that unremitted foreign earnings are not considered indefinitely reinvested to the extent foreign earnings can be distributed without a significant tax cost. For the amount considered to be indefinitely reinvested, it is not practicable to determine the amount of the related deferred income tax liability due to the complexities of the tax laws and assumptions we would have to make.\nValuation allowances are provided to reduce the amounts of our deferred tax assets to an amount that is more likely than not to be realized based on an assessment of positive and negative evidence, including estimates of future taxable income necessary to realize future deductible amounts.\nThe valuation allowance increased in 2024, primarily driven by the Company’s expectation that certain state R&D credits will expire unused. \nAs of December 31, 2024, we had $\n195\n million of federal tax credit carryforwards available to reduce future federal income taxes and have provided a $\n17\n million valuation allowance on those federal tax credit carryforwards. The federal tax credit carryforwards expire between 2025 and 2045. We had $\n1.2\n billion of state tax credit carryforwards available to reduce future state income taxes and have provided a valuation allowance for $\n1.1\n billion of those state tax credit carryforwards. We had $\n83\n million of tax credit carryforwards related to our foreign jurisdictions available to offset future foreign income taxes for which we have provided a $\n53\n million valuation allowance.\nAs of December 31, 2024, we had $\n239\n million of federal NOL carryforwards available to reduce future federal income taxes and have provided \nno\n valuation allowance on those federal NOL carryforwards. Additionally, $\n201\n million of those federal NOL carryforwards have no expiration; the remainder begin to expire between 2025 and 2033. We had $\n957\n million of state NOL carryforwards available to reduce future state income taxes and have provided a valuation allowance for \nF-25\n$\n822\n million of those state NOL carryforwards. We had $\n1.1\n billion of foreign NOL carryforwards available to reduce future foreign income taxes and have provided a valuation allowance for $\n164\n million of those foreign NOL carryforwards. For the foreign NOLs with \nno\n valuation allowance provided, $\n160\n million have no expiration; and the remainder will expire between 2025 and 2034.\nThe reconciliations of the total gross amounts of UTBs were as follows (in millions):\nYears ended December 31,\n2024\n2023\n2022\nBeginning balance\n$\n4,012\n \n$\n3,770\n \n$\n3,546\n \nAdditions based on tax positions related to the current year\n188\n \n196\n \n151\n \nAdditions based on tax positions related to prior years\n9\n \n56\n \n90\n \nReductions for tax positions of prior years\n(\n12\n)\n—\n \n(\n14\n)\nReductions for expiration of statute of limitations\n(\n9\n)\n(\n4\n)\n(\n3\n)\nSettlements \n(\n4\n)\n(\n6\n)\n—\n \nEnding balance\n$\n4,184\n \n$\n4,012\n \n$\n3,770\n \nSubstantially all of the UTBs as of December 31, 2024, if recognized, would affect our effective tax rate\n.\n As a result, we remeasured our UTBs accordingly.\nInterest and penalties related to UTBs are included in our provision for income taxes. During the years ended December 31, 2024, 2023 and 2022, we recognized $\n282\n million, $\n287\n million and $\n189\n million, respectively, of interest and penalties through the income tax provision in the Consolidated Statements of Income. The decrease in interest expense for the year ended December 31, 2024, was primarily due to an IRS advance deposit of $\n800\n million paid during the first quarter of 2024. As of December 31, 2024 and 2023, accrued interest and penalties associated with UTBs were $\n1.6\n billion and $\n1.4\n billion, respectively.\nThe reconciliations between the federal statutory tax rate applied to income before income taxes and our effective tax rate were as follows:\nYears ended December 31,\n2024\n2023\n2022\nFederal statutory tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nForeign earnings\n(\n5.8\n)\n%\n(\n5.1\n)\n%\n(\n5.6\n)\n%\nForeign-derived intangible income\n(\n3.0\n)\n%\n(\n1.3\n)\n%\n(\n1.3\n)\n%\nCredits, Puerto Rico excise tax\n—\n \n%\n0.3\n \n%\n(\n2.8\n)\n%\nInterest on uncertain tax positions\n4.2\n \n%\n2.6\n \n%\n1.9\n \n%\nCredits, primarily federal R&D\n(\n5.4\n)\n%\n(\n3.5\n)\n%\n(\n2.0\n)\n%\nOther, net\n0.3\n \n%\n0.5\n \n%\n(\n0.4\n)\n%\nEffective tax rate\n11.3\n \n%\n14.5\n \n%\n10.8\n \n%\nThe effective tax rates for the years ended December 31, 2024, 2023 and 2022, differ from the federal statutory rate primarily due to impacts of the jurisdictional mix of income and expenses. Substantially all of the benefit to our effective tax rate from foreign earnings results from locations where the Company has significant manufacturing operations, including Singapore, Ireland and Puerto Rico, a territory of the United States that is treated as a foreign jurisdiction for U.S. tax purposes. Our operations in Puerto Rico are subject to tax incentive grants through 2050. Additionally, the Company’s operations conducted in Singapore are subject to a tax incentive grant through 2036. Our foreign earnings are also subject to U.S. tax at a reduced rate of 10.5% and to the OECD’s 15% global minimum tax in jurisdictions where enacted.\nBeginning on January 1, 2023, we were no longer subject to a 4% excise tax in the U.S. territory of Puerto Rico on the gross intercompany purchase price of goods and services from our manufacturer in Puerto Rico. We qualify for and are subject to the alternative income tax rate on industrial development income of our Puerto Rico affiliate. In the United States, this income tax qualifies for foreign tax credits. Both this income tax and the associated foreign tax credits are generally recognized in our provision for income taxes. We accounted for the 2022 excise tax that was capitalized in Inventories as an expense in Cost of sales when the related products were sold in the first half of 2023, and a foreign tax credit was not recognized with respect to the excise tax expense in 2023. We did not have this excise tax exposure in 2024.\nF-26\nIncome taxes paid during the years ended December 31, 2024, 2023 and 2022, were $\n2.9\n billion, $\n3.4\n billion and $\n2.4\n billion, respectively.\nOne or more of our legal entities file income tax returns in the U.S. federal jurisdiction, various U.S. state jurisdictions and certain foreign jurisdictions. Our income tax returns are routinely examined by tax authorities in those jurisdictions. Significant disputes can arise and have arisen with tax authorities involving issues regarding the timing and amount of deductions, the use of tax credits and allocations of income and expenses among various tax jurisdictions because of differing interpretations of tax laws, regulations and relevant facts. Tax authorities, including the IRS, are becoming more aggressive and are particularly focused on such matters.\nIn 2017, we received an RAR and a modified RAR from the IRS for the years 2010–2012, proposing significant adjustments that primarily relate to the allocation of profits between certain of our entities in the United States and the U.S. territory of Puerto Rico. We disagreed with the proposed adjustments and calculations and pursued resolution with the IRS appeals office but were unable to reach resolution. In July 2021, we filed a petition in the U.S. Tax Court to contest \ntwo\n duplicate Statutory Notices of Deficiency (Notices) for the years 2010–2012 that we received in May and July 2021, which seek to increase our U.S. taxable income for the years 2010–2012 by an amount that would result in additional federal tax of approximately $\n3.6\n billion plus interest. Any additional tax that could be imposed for the years 2010–2012 would be reduced by up to approximately $\n900\n million of repatriation tax previously accrued on our foreign earnings.\nIn 2020, we received an RAR and a modified RAR from the IRS for the years 2013–2015, also proposing significant adjustments that primarily relate to the allocation of profits between certain of our entities in the United States and the U.S. territory of Puerto Rico similar to those proposed for the years 2010–2012. We disagreed with the proposed adjustments and calculations and pursued resolution with the IRS appeals office but were unable to reach resolution. In July 2022, we filed a petition in the U.S. Tax Court to contest a Notice for the years 2013–2015 that we previously reported receiving in April 2022 that seeks to increase our U.S. taxable income for the years 2013–2015 by an amount that would result in additional federal tax of approximately $\n5.1\n billion, plus interest. In addition, the Notice asserts penalties of approximately $\n2.0\n billion. Any additional tax that could be imposed for the years 2013–2015 would be reduced by up to approximately $\n2.2\n billion of repatriation tax previously accrued on our foreign earnings.\nWe firmly believe that the IRS positions set forth in the 2010–2012 and 2013–2015 Notices are without merit. We are contesting the 2010–2012 and 2013–2015 Notices through the judicial process. The \ntwo\n cases were consolidated in the U.S. Tax Court on December 19, 2022. The trial began on November 4, 2024 and concluded on January 17, 2025. With the conclusion of the trial, the parties will file post-trial briefs and make closing arguments in 2025. The Company expects a decision from the Tax Court no earlier than 2026.\nWe are currently under examination by the IRS for the years 2016–2018 with respect to issues similar to those for the 2010 through 2015 period. We believe that the IRS may also seek to continue to audit similar issues related to the allocation of income between the United States and the U.S. territory of Puerto Rico for years beyond 2018. In addition, we are under examination by a number of state and foreign tax jurisdictions.\nFinal resolution of these complex matters is not likely within the next 12 months. We continue to believe our accrual for income tax liabilities is appropriate based on past experience, interpretations of tax law, application of the tax law to our facts and judgments about potential actions by tax authorities; however, due to the complexity of the provision for income taxes and uncertain resolution of these matters, the ultimate outcome of any tax matters may result in payments substantially greater than amounts accrued and could have a material adverse impact on our consolidated financial statements.\nWe are no longer subject to U.S. federal income tax examinations for years ended on or before December 31, 2009.\nF-27\n8. \nEarnings per share\nThe computation of basic EPS is based on the weighted-average number of our common shares outstanding. The computation of diluted EPS is based on the weighted-average number of our common shares outstanding and dilutive potential common shares, which primarily include shares that may be issued under our stock option, restricted stock and performance unit award programs (collectively, dilutive securities), as determined by using the treasury stock method.\nThe computations for basic and diluted EPS were as follows (in millions, except per-share data):\nYears ended December 31,\n2024\n2023\n2022\nIncome (Numerator):\nNet income for basic and diluted EPS\n$\n4,090\n \n$\n6,717\n \n$\n6,552\n \nShares (Denominator):\nWeighted-average shares for basic EPS\n537\n \n535\n \n538\n \nEffect of dilutive securities\n4\n \n3\n \n3\n \nWeighted-average shares for diluted EPS\n541\n \n538\n \n541\n \nBasic EPS\n$\n7.62\n \n$\n12.56\n \n$\n12.18\n \nDiluted EPS\n$\n7.56\n \n$\n12.49\n \n$\n12.11\n \nFor each of the three years ended December 31, 2024, the number of antidilutive employee stock-based awards excluded from the computation of diluted EPS was not significant.\n9. \nCollaborations\nA collaborative arrangement is a contractual arrangement that involves a joint operating activity. Such arrangements involve two or more parties that are both (i) active participants in the activity and (ii) exposed to significant risks and rewards dependent on the commercial success of the activity.\nFrom time to time, we enter into collaborative arrangements for the R&D, manufacture and/or commercialization of products and/or product candidates. These collaborations generally provide for nonrefundable upfront license fees, development and commercial-performance milestone payments, cost sharing, royalties and/or profit sharing. Our collaboration arrangements are performed with no guarantee of either technological or commercial success, and each arrangement is unique in nature. See Note 1, Summary of significant accounting policies, for additional discussion of revenues recognized under these types of arrangements. Operating expenses for costs incurred pursuant to these arrangements are reported in their respective expense line items in the Consolidated Statements of Income, net of any payments due to or reimbursements due from our collaboration partners, with such reimbursements being recognized at the time the party becomes obligated to pay. Our significant arrangements are discussed below.\nAstraZeneca plc\nWe are in a collaboration with AstraZeneca for the development and commercialization of TEZSPIRE. Under our collaboration, both companies share global costs, profits and losses equally after payment by AstraZeneca of a mid-single-digit royalty to Amgen. AstraZeneca leads global development. In North America, Amgen, as the principal, recognizes product sales of TEZSPIRE in the United States, and AstraZeneca, as the principal, recognizes product sales of TEZSPIRE in Canada. AstraZeneca leads commercialization for TEZSPIRE outside North America. Amgen manufactures and supplies TEZSPIRE worldwide.\nDuring the years ended December 31, 2024, 2023 and 2022, global profit and loss share expenses were $\n412\n million, $\n310\n million and $\n119\n million, respectively, and were recorded in Cost of sales in the Consolidated Statements of Income. Net costs due to AstraZeneca for global development and commercialization were not material during the years ended December 31, 2024, 2023 and 2022. TEZSPIRE launched in the United States in January 2022.\nF-28\nUCB\nWe are in a collaboration with UCB for the development and commercialization of EVENITY. Under our collaboration, UCB has rights to lead commercialization for EVENITY in most countries in Europe. Amgen, as the principal, leads commercialization for EVENITY and recognizes product sales in all other territories, including the United States. Global development costs and commercialization profits and losses related to the collaboration are shared equally. Amgen manufactures and supplies EVENITY worldwide.\nDuring the years ended December 31, 2024, 2023 and 2022, global profit and loss share expenses were $\n547\n million, $\n396\n million and $\n255\n million, respectively, and were recorded in Cost of sales in the Consolidated Statements of Income. Net costs recovered from and due to UCB during the years ended December 31, 2024, 2023 and 2022, were not material.\nBeiGene, Ltd.\nIn January 2020, we acquired an equity stake in BeiGene for approximately $\n2.8\n billion in cash as part of a collaboration to expand our oncology presence in China. For additional information regarding our equity investment in BeiGene, see Note 10, Investments. Under the collaboration, BeiGene began selling XGEVA in 2020, BLINCYTO in 2021 and KYPROLIS in 2022 in China, and Amgen shares profits and losses equally during the initial product-specific commercialization periods; thereafter, product rights may revert to Amgen, and Amgen would pay royalties to BeiGene on sales in China of such products for a specified period. Amgen manufactures and supplies the collaboration products to BeiGene.\nIn addition, we jointly develop a portion of our oncology portfolio with BeiGene, which shares in global R&D costs by providing cash and development services of up to $\n1.25\n billion. Upon regulatory approval, BeiGene will assume commercialization rights in China for a specified period, and Amgen and BeiGene will share profits and losses equally until certain of these product rights revert to Amgen. Upon return of the product rights, Amgen will pay royalties to BeiGene on sales in China for a specified period. For product sales outside China, Amgen also pays royalties to BeiGene.\nDuring the years ended December 31, 2024, 2023 and 2022, net costs recovered from BeiGene for oncology product candidates were $\n122\n million, $\n109\n million and $\n199\n million, respectively, and were recorded as an offset to R&D expense in the Consolidated Statements of Income. During the years ended December 31, 2024, 2023 and 2022, product sales from Amgen to BeiGene under the collaboration were $\n259\n million, $\n125\n million and $\n64\n million, respectively, and were recorded in Product sales in the Consolidated Statements of Income. Profit and loss share expenses related to the initial product-specific commercialization period were not material during the years ended December 31, 2024, 2023 and 2022.\nKyowa Kirin Co., Ltd.\nWe are in a collaboration and licensing agreement with Kyowa Kirin to jointly develop and commercialize rocatinlimab, an anti-OX40 fully human monoclonal antibody, worldwide, except in Japan. Rocatinlimab is for the treatment of atopic dermatitis, with potential for treatment of other autoimmune diseases.\nUnder the terms of the agreement, we lead the global development, manufacture and commercialization of rocatinlimab, except in Japan. Kyowa Kirin will co-promote rocatinlimab with Amgen in the United States and have opt in rights to co-promote rocatinlimab in various other markets outside the United States, including in Europe and Asia.\nWe made an upfront payment of $\n400\n million to Kyowa Kirin that was recognized in R&D expense in the third quarter of 2021. Amgen and Kyowa Kirin share equally the global development costs, except in Japan, and the U.S. commercialization costs. Outside the United States and Japan, any commercialization costs incurred by Kyowa Kirin will be reimbursed by Amgen. We may also be required to make milestone payments of up to $\n850\n million contingent upon the achievement of certain regulatory events and commercial thresholds. We will also pay Kyowa Kirin significant double-digit royalties on global sales, except in Japan. During the years ended December 31, 2024, 2023 and 2022, net costs recovered from Kyowa Kirin were $\n166\n million, $\n93\n million and $\n23\n million, respectively, and were recorded as an offset to R&D expense in the Consolidated Statements of Income.\nOther\nIn addition to the collaborations discussed above, we have various other collaborations that are not individually significant to our business at this time. Pursuant to the terms of those agreements, we may be required to pay additional amounts, or we may receive additional amounts upon the achievement of various development and commercial milestones that in the aggregate could be significant. We may also incur or have reimbursed to us significant R&D costs if a related product candidate were to advance to late-stage clinical trials. In addition, if any products related to these collaborations are approved for sale, we may be required to pay significant royalties, or we may receive significant royalties on future sales. The payments of these amounts, however, are contingent upon the occurrence of various future events that have high degrees of uncertainty of occurrence.\nF-29\n10. \nInvestments\nAvailable-for-sale investments\nThe amortized cost, gross unrealized gains, gross unrealized losses and fair values of interest-bearing securities, which are classified as available for sale, by type of security were as follows (in millions):\nTypes of securities as of December 31, 2024\nAmortized\ncost\nGross\nunrealized\ngains\nGross\nunrealized\nlosses\nFair\nvalues\nU.S. Treasury bills\n$\n997\n \n$\n—\n \n$\n—\n \n$\n997\n \nMoney market mutual funds\n10,354\n \n—\n \n—\n \n10,354\n \nOther short-term interest-bearing securities\n135\n \n—\n \n—\n \n135\n \nTotal available-for-sale investments\n$\n11,486\n \n$\n—\n \n$\n—\n \n$\n11,486\n \nTypes of securities as of December 31, 2023\nAmortized\ncost\nGross\nunrealized\ngains\nGross\nunrealized\nlosses\nFair\nvalues\nU.S. Treasury bills\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \nMoney market mutual funds\n10,266\n \n—\n \n—\n \n10,266\n \nOther short-term interest-bearing securities\n138\n \n—\n \n—\n \n138\n \nTotal available-for-sale investments\n$\n10,404\n \n$\n—\n \n$\n—\n \n$\n10,404\n \nThe fair values of available-for-sale investments by location in the Consolidated Balance Sheets were as follows (in millions):\nDecember 31,\nConsolidated Balance Sheets locations\n2024\n2023\nCash and cash equivalents\n$\n11,486\n \n$\n10,404\n \nTotal available-for-sale investments\n$\n11,486\n \n$\n10,404\n \nCash and cash equivalents in the above table excludes bank account cash of $\n487\n million and $\n540\n million as of December 31, 2024 and 2023, respectively.\nAll interest-bearing securities as of December 31, 2024 and 2023, mature in one year or less. For the years ended December 31, 2024, 2023 and 2022, interest income on these investments was $\n510\n million, $\n1.2\n billion and $\n127\n million, respectively.\nFor the years ended December 31, 2024, 2023 and 2022, realized gains and losses on interest-bearing securities were not material. Realized gains and losses on interest-bearing securities are recorded in Other income (expense), net, in the Consolidated Statements of Income. The cost of securities sold is based on the specific-identification method.\nThe primary objective of our investment portfolio is to maintain safety of principal, prudent levels of liquidity and acceptable levels of risk. Our investment policy limits interest-bearing security investments to certain types of debt and money market instruments issued by institutions with investment-grade credit ratings, and it places restrictions on maturities and concentration by asset class and issuer.\nF-30\nEquity securities\nBeiGene, Ltd.\nOn January 2, 2020, we acquired a \n20.5\n% ownership interest in BeiGene for $\n2.8\n billion, substantially all of which was attributed to the fair value of equity securities, and we began using the equity method of accounting for this investment. Since the fair value of equity securities acquired exceeded our proportionate share of the carrying value of BeiGene’s underlying net assets, we began amortizing the intangible assets that gave rise to this basis difference over their useful lives.\nEffective January 30, 2023, we relinquished our right to appoint a director to BeiGene’s Board of Directors. We no longer have the ability to exert significant influence over BeiGene. As a result, in the first quarter of 2023, we began to account for our ownership interest as an equity security with a readily determinable fair value, which is carried at fair value with changes in fair value recorded in Other income (expense), net, in the Consolidated Statements of Income. See Note 18, Fair value measurement. During the years ended December 31, 2024 and 2023, we recognized unrealized gains of\n \n$\n82\n million and $\n1.2\n billion, respectively,\n \nin Other income (expense), net, in the Consolidated Statements of Income. As of December 31, 2024 and 2023, the fair values of our investment in BeiGene were $\n3.5\n billion and $\n3.4\n billion, respectively,\n \nand were included in Other noncurrent assets in the Consolidated Balance Sheets.\nDuring the year ended December 31, 2022, under the equity method of accounting, the carrying value of the investment was reduced by our share of BeiGene’s net losses of $\n394\n million and amortization of the basis difference of $\n190\n million, with such amounts recognized in Other income (expense), net. In addition, during the year ended December 31,\n \n2022, the carrying value increased by $\n11\n million from the impact of other BeiGene ownership transactions. For information on a collaboration agreement we entered into with BeiGene in connection with this investment, see Note 9, Collaborations.\nSubject to certain exceptions or otherwise agreed to by BeiGene, while Amgen holds at least \n5.0\n% of BeiGene’s outstanding common stock, (A) we may only sell our BeiGene equity investment via: (i) a registered public offering, (ii) a sale under Rule 144 of the Securities Act of 1933 (the “Securities Act”) or (iii) a private sale exempt from registration requirements under the Securities Act, and (B) we may not sell more than \n5.0\n% of BeiGene’s outstanding common stock in any rolling 12-month period.\nOther equity securities \nExcluding our equity investments in BeiGene (discussed above) and Neumora (discussed below), we held investments in other equity securities with readily determinable fair values (publicly traded securities) \nof $\n314\n million and \n$\n494\n million\n as of December 31, 2024 and 2023, respectively, which are included in Other noncurrent assets in the Consolidated Balance Sheets. For the years ended December 31, 2024, 2023 and 2022, net unrealized gains and losses on publicly traded securities resulted in a net \nloss\n of \n$\n21\n million\n, a net \ngain\n of \n$\n98\n million\n and a net \nloss\n of \n$\n165\n million\n, respectively. Realized gains and losses on publicly traded securities for the years ended December 31, 2024, 2023 and 2022, were \nnot\n material.\nWe held investments of $\n319\n million and $\n309\n million in equity securities without readily determinable fair values as of December 31, 2024 and 2023, respectively, which are included in Other noncurrent ass\nets in the Consolidated Balance Sheets. For the years ended \nDecember 31, 2024, 2023 and 2022\n, gains due to upward adjustments and gains realized upon dispositions of these securities were not material. \nFor the years ended December 31, 2024 and\n \n2023\n, downward adjustments were \nnot\n material. For the year ended December 31, 2022, down\nward adjustments to the carrying values of these securities were\n $\n67\n million. Adjustments were based on observable price transactions.\nEquity Method Investments\nNeumora Therapeutics, Inc.\nAs of December 31, 2024 and 2023, our ownership interests in Neumora were approximately \n21.9\n%\n \nand \n23.2\n%, respectively, and the fair values of our investment were $\n375\n million and $\n603\n million, respectively, which are included in Other noncurrent assets in the Consolidated Balance Sheets. Although our equity investment qualifies us for the equity method of accounting, we have elected the fair value option to account for our investment. See Note 18, Fair value measurement. Under the fair value option, changes in the fair value of the investment are recognized through earnings in Other income (expense), net, in the Consolidated Statements of Income each reporting period. We believe the fair value option best reflects the economics of the underlying transaction. During the years ended December 31, 2024, 2023 and \n2022\n, we recognized unrealized losses of $\n228\n million and unrealized gains of $\n238\n million and $\n105\n million, respectively, for the change in fair values in Other income (expense), net, in the Consolidated Statements of Income.\nOn January 2, 2025, Neumora released results of a Phase 3 study of navacaprant, and Neumora’s stock price declined.\nF-31\nWe are contractually restricted from selling more than \n5.0\n% of Neumora’s outstanding common stock in any rolling 12-month period for as long as we hold at least \n10.0\n% of their outstanding common stock, subject to certain exceptions or otherwise agreed to by Neumora.\nLimited partnerships\nWe held limited \npartnership investments\n of $\n262\n million and $\n251\n million as of December 31, 2024 and 2023, respectively, which are included in Other noncurrent assets in the Consolidated Balance Sheets. These investments, which are primarily investment funds of early-stage biotechnology companies, are accounted for by using the equity method of accounting and are measured by using our proportionate share of the net asset values of the underlying investments held by the limited partnerships as a practical expedient. These investments are typically redeemable only through distributions upon liquidation of the underlying assets. As of December 31, 2024, unfunded additional commitments to be made for these investments during the next several years were \n$\n133\n million\n. For the years ended December 31, 2024 and 2023, net gains and losses recognized from our limited partnership investments were \nnot\n material. For the year ended December 31, 2022, net losses recognized from our limited partnership investments were \n$\n284\n million\n.\n11. \nInventories\nInventories consisted of the following (in millions):\nDecember 31,\n2024\n2023\nRaw materials\n$\n818\n \n$\n993\n \nWork in process\n4,120\n \n5,747\n \nFinished goods\n2,060\n \n2,778\n \nTotal inventories\n (1)\n$\n6,998\n \n$\n9,518\n \n____________\n(1)    \nThe decrease to Inventories during the year ended December 31, 2024,\n \nwas primarily due to amortization of the inventory step-up to fair value related to acquired inventory from the Horizon acquisition. See Note 4, Acquisitions and divestitures.\n12. \nProperty, plant and equipment\nProperty, plant and equipment consisted of the following (dollar amounts in millions):\nDecember 31,\nUseful life (in years)\n2024\n2023\nLand\n—\n$\n346\n \n$\n339\n \nBuildings and improvements\n10\n-\n40\n4,803\n \n4,507\n \nManufacturing equipment\n8\n-\n12\n3,291\n \n3,220\n \nLaboratory equipment\n8\n-\n12\n1,345\n \n1,346\n \nFixed equipment\n12\n2,592\n \n2,526\n \nCapitalized software\n3\n-\n5\n1,442\n \n1,320\n \nOther\n5\n-\n10\n1,059\n \n941\n \nConstruction in progress\n—\n2,053\n \n1,550\n \nProperty, plant and equipment, gross\n16,931\n \n15,749\n \nLess accumulated depreciation and amortization\n(\n10,388\n)\n(\n9,808\n)\nProperty, plant and equipment, net\n$\n6,543\n \n$\n5,941\n \nDuring the years ended December 31, 2024, 2023 and 2022, we recognized depreciation and amortization expense associated with our property, plant and equipment of $\n694\n million, $\n685\n million and $\n661\n million, respectively.\nF-32\nGeographic information\nCertain geographic information with respect to property, plant and equipment, net, was as follows (in millions):\n \nDecember 31,\n \n2024\n2023\nU.S.\n$\n4,156\n \n$\n3,658\n \nPuerto Rico\n1,174\n \n1,148\n \nROW\n1,213\n \n1,135\n \nTotal property, plant and equipment, net\n$\n6,543\n \n$\n5,941\n \n13. \nGoodwill and other intangible assets\nGoodwill\nThe changes in the carrying amounts of goodwill were as follows (in millions):\nDecember 31,\n2024\n2023\nBeginning balance\n$\n18,629\n \n$\n15,529\n \nChanges to goodwill resulting from acquisitions, net\n(1)\n25\n \n3,089\n \nForeign currency translation adjustments\n(\n17\n)\n11\n \nEnding balance\n$\n18,637\n \n$\n18,629\n \n____________\n(1)    \nFor 2024, changes to Goodwill consisted of measurement-period adjustments related to our Horizon acquisition. For 2023, changes to Goodwill primarily consisted of goodwill resulting from our Horizon acquisition. See Note 4, Acquisitions and divestitures.\nOther intangible assets\nOther intangible assets consisted of the following (in millions):\nDecember 31,\n \n2024\n2023\n \nGross\ncarrying\namounts\nAccumulated\namortization\nOther intangible\nassets, net\nGross\ncarrying\namounts\nAccumulated\namortization\nOther intangible\nassets, net\nFinite-lived intangible assets:\nDeveloped-product-technology rights\n$\n48,611\n \n$\n(\n22,594\n)\n$\n26,017\n \n$\n48,631\n \n$\n(\n18,049\n)\n$\n30,582\n \nLicensing rights\n3,875\n \n(\n3,392\n)\n483\n \n3,865\n \n(\n3,265\n)\n600\n \nMarketing-related rights\n1,202\n \n(\n1,202\n)\n—\n \n1,339\n \n(\n1,264\n)\n75\n \nR&D technology rights\n1,374\n \n(\n1,235\n)\n139\n \n1,394\n \n(\n1,228\n)\n166\n \nTotal finite-lived intangible assets\n55,062\n \n(\n28,423\n)\n26,639\n \n55,229\n \n(\n23,806\n)\n31,423\n \nIndefinite-lived intangible assets:\nIn-process research and development\n1,060\n \n— \n1,060\n \n1,218\n \n— \n1,218\n \nTotal other intangible assets\n$\n56,122\n \n$\n(\n28,423\n)\n$\n27,699\n \n$\n56,447\n \n$\n(\n23,806\n)\n$\n32,641\n \nDeveloped-product-technology rights consists of rights related to marketed products acquired in acquisitions. Licensing rights primarily consists of contractual rights to receive future milestone, royalty and profit-sharing payments; capitalized payments to third parties for milestones related to regulatory approvals to commercialize products; and upfront payments associated with royalty obligations for marketed products. Marketing-related rights primarily consists of rights related to the sale and distribution of marketed products. R&D technology rights pertain to technologies used in R&D that have alternative future uses.\nIPR&D consists of R&D projects acquired in a business combination that are not complete at the time of acquisition due to remaining technological risks and/or lack of receipt of required regulatory approvals. All IPR&D projects have major risks \nF-33\nand uncertainties associated with the timely and successful completion of the development and commercialization of product candidates, including our ability to confirm safety and efficacy based on data from clinical trials, our ability to obtain necessary regulatory approvals and our ability to successfully complete these tasks within budgeted costs. We are not permitted to market a human therapeutic without obtaining regulatory approvals, and such approvals require the completion of clinical trials that demonstrate that a product candidate is safe and effective. In addition, the availability and extent of coverage and reimbursement from third-party payers, including government healthcare programs and private insurance plans as well as competitive product launches, affect the revenues a product can generate. Consequently, the eventual realized values, if any, of acquired IPR&D projects may vary from their estimated fair values. We review IPR&D projects for impairment annually, whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable and upon the establishment of technological feasibility or regulatory approval. During the year ended December 31, 2023, the development of AMG 340 acquired in connection with our Teneobio acquisition was terminated, resulting in an impairment charge of $\n783\n million, which was recognized in \nOther operating expenses\n in the Consolidated Statements of Income and included in Other items, net, in the Consolidated Statements of Cash Flows. See Note 18, Fair value measurement, for the impact on the related contingent consideration liability.\nThe Company monitors intangible assets for impairment on a quarterly basis. The Developed-product-technology rights intangible asset related to Otezla has a carrying value of $\n5.2\n billion as of December 31, 2024. In January 2025, Otezla was selected by CMS for Medicare price setting under the IRA that will be applicable beginning on January 1, 2027. Future changes to the Company’s estimates of the impact of the price negotiations under the IRA, as well as regulatory, market and competitive developments, could unfavorably impact the Company’s ability to recover the carrying value of the related intangible asset.\nDuring the years ended December 31, 2024, 2023 and 2022, we recognized amortization associated with our finite-lived intangible assets of $\n4.8\n billion, $\n3.2\n billion and $\n2.6\n billion, respectively. Amortization of intangible assets is included primarily in Cost of sales in the Consolidated Statements of Income. The total estimated amortization for our finite-lived intangible assets for the years ending December 31, 2025, 2026, 2027, 2028 and 2029, is $\n4.5\n billion, $\n3.9\n billion, $\n3.9\n billion, $\n2.9\n billion and $\n2.2\n billion, respectively.\n14. \nLeases\nWe lease certain facilities and equipment related primarily to R&D, administrative and commercial activities. Leases with terms of 12 months or less are expensed as incurred and are not recorded in the Consolidated Balance Sheets.\nMost leases include one or more options to renew, with renewal terms that may extend the lease term up to \nten years\n. The exercise of lease renewal options is at our sole discretion. In addition, some of our lease agreements include rental payments adjusted periodically for inflation. Our lease agreements neither contain residual value guarantees nor impose significant restrictions or covenants. We sublease certain real estate to third parties. Our sublease portfolio consists of operating leases from former R&D and administrative spaces.\nThe following table summarizes information related to our leases, all of which are classified as operating, included in our Consolidated Balance Sheets (in millions):\nDecember 31,\nConsolidated Balance Sheets locations\n2024\n2023\nAssets:\nOther noncurrent assets\n$\n557\n \n$\n651\n \nLiabilities:\nAccrued liabilities\n$\n107\n \n$\n119\n \nOther noncurrent liabilities\n673\n \n691\n \nTotal lease liabilities\n$\n780\n \n$\n810\n \nF-34\nThe components of net lease costs were as follows (in millions): \nYears ended December 31,\nLease costs\n2024\n2023\n2022\nOperating\n(1)\n$\n219\n \n$\n208\n \n$\n218\n \nSublease income\n(\n17\n)\n(\n28\n)\n(\n32\n)\nTotal net lease costs\n$\n202\n \n$\n180\n \n$\n186\n \n____________\n(1)    \nIncludes short-term leases and variable lease costs, which were not material for the years ended December 31, 2024, 2023 and 2022.\nMaturities of lease liabilities as of December 31, 2024, were as follows (in millions): \nMaturity dates\nAmounts\n2025\n$\n110\n \n2026\n129\n \n2027\n112\n \n2028\n91\n \n2029\n73\n \nThereafter\n426\n \nTotal lease payments\n(1)\n941\n \nLess imputed interest\n(\n161\n)\nPresent value of lease liabilities\n$\n780\n \n____________\n(1)    \nIncludes future rental commitments for abandoned leases of $\n51\n million. We expect to receive total future rental income of $\n54\n million related to noncancellable subleases for abandoned facilities.\nThe weighted-average remaining lease terms and weighted-average discount rates were as follows:\nDecember 31,\n2024\n2023\nWeighted-average remaining lease term (in years)\n9.3\n9.7\nWeighted-average discount rate\n3.7\n \n%\n3.6\n \n%\nCash and noncash information related to our leases was as follows (in millions): \nYears ended December 31,\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows for operating leases\n$\n156\n \n$\n182\n \n$\n171\n \nROU assets obtained in exchange for lease obligations:\nOperating leases\n$\n126\n \n$\n245\n \n$\n191\n \nAs of December 31, 2024, there were no future lease payments for leases that have not yet commenced.\nF-35\n15. \nOther current assets and accrued liabilities\nOther current assets consisted of the following (in millions):\nDecember 31,\n2024\n2023\nPrepaid expenses\n$\n2,139\n \n$\n1,647\n \nCorporate partner receivables\n521\n \n502\n \nTax receivables\n198\n \n172\n \nOther\n419\n \n281\n \nTotal other current assets\n$\n3,277\n \n$\n2,602\n \nAccrued liabilities consisted of the following (in millions):\nDecember 31,\n2024\n2023\nSales deductions\n$\n8,405\n \n$\n7,271\n \nIncome taxes payable\n2,583\n \n1,664\n \nEmployee compensation and benefits\n1,329\n \n1,381\n \nDividends payable\n1,278\n \n1,205\n \nAccrued interest payable\n867\n \n936\n \nOther\n3,179\n \n2,902\n \nTotal accrued liabilities\n$\n17,641\n \n$\n15,359\n \nF-36\n16. \nFinancing arrangements\nOur borrowings consisted of the following (in millions):\nDecember 31,\n2024\n2023\n3.625\n% notes due 2024 (\n3.625\n% 2024 Notes)\n$\n—\n \n$\n1,400\n \n1.90\n% notes due 2025 (\n1.90\n% 2025 Notes)\n500\n \n500\n \n5.25\n% notes due 2025 (\n5.25\n% 2025 Notes)\n2,000\n \n2,000\n \nTerm loan due April 2025\n—\n \n2,000\n \n3.125\n% notes due 2025 (\n3.125\n% 2025 Notes)\n1,000\n \n1,000\n \n2.00\n% €\n750\n million notes due 2026 (\n2.00\n% 2026 euro Notes)\n777\n \n828\n \n5.507\n% notes due 2026 (\n5.507\n% 2026 Notes)\n1,500\n \n1,500\n \n2.60\n% notes due 2026 (\n2.60\n% 2026 Notes)\n1,250\n \n1,250\n \nTerm loan due October 2026\n1,800\n \n2,000\n \n5.50\n% £\n475\n million notes due 2026 (\n5.50\n% 2026 pound sterling Notes)\n595\n \n605\n \n2.20\n% notes due 2027 (\n2.20\n% 2027 Notes)\n1,724\n \n1,724\n \n3.20\n% notes due 2027 (\n3.20\n% 2027 Notes)\n1,000\n \n1,000\n \n5.15\n% notes due 2028 (\n5.15\n% 2028 Notes)\n3,750\n \n3,750\n \n1.65\n% notes due in 2028 (\n1.65\n% 2028 Notes)\n1,234\n \n1,234\n \n3.00\n% notes due 2029 (\n3.00\n% 2029 Notes)\n750\n \n750\n \n4.05\n% notes due 2029 (\n4.05\n% 2029 Notes)\n1,250\n \n1,250\n \n4.00\n% £\n700\n million notes due 2029 (\n4.00\n% 2029 pound sterling Notes)\n876\n \n892\n \n2.45\n% notes due 2030 (\n2.45\n% 2030 Notes)\n1,250\n \n1,250\n \n5.25\n% notes due 2030 (\n5.25\n% 2030 Notes)\n2,750\n \n2,750\n \n2.30\n% notes due 2031 (\n2.30\n% 2031 Notes)\n1,250\n \n1,250\n \n2.00\n% notes due 2032 (\n2.00\n% 2032 Notes)\n1,001\n \n1,001\n \n3.35\n% notes due 2032 (\n3.35\n% 2032 Notes)\n1,000\n \n1,000\n \n4.20\n% notes due 2033 (\n4.20\n% 2033 Notes)\n750\n \n750\n \n5.25\n% notes due 2033 (\n5.25\n% 2033 Notes)\n4,250\n \n4,250\n \n6.375\n% notes due 2037 (\n6.375\n% 2037 Notes)\n478\n \n478\n \n6.90\n% notes due 2038 (\n6.90\n% 2038 Notes)\n254\n \n254\n \n6.40\n% notes due 2039 (\n6.40\n% 2039 Notes)\n333\n \n333\n \n3.15\n% notes due 2040 (\n3.15\n% 2040 Notes)\n1,668\n \n1,803\n \n5.75\n% notes due 2040 (\n5.75\n% 2040 Notes)\n373\n \n373\n \n2.80\n% notes due 2041 (\n2.80\n% 2041 Notes)\n776\n \n949\n \n4.95\n% notes due 2041 (\n4.95\n% 2041 Notes)\n600\n \n600\n \n5.15\n% notes due 2041 (\n5.15\n% 2041 Notes)\n729\n \n729\n \n5.65\n% notes due 2042 (\n5.65\n% 2042 Notes)\n415\n \n415\n \n5.60\n% notes due 2043 (\n5.60\n% 2043 Notes)\n2,750\n \n2,750\n \n5.375\n% notes due 2043 (\n5.375\n% 2043 Notes)\n185\n \n185\n \n4.40\n% notes due 2045 (\n4.40\n% 2045 Notes)\n2,250\n \n2,250\n \n4.563\n% notes due 2048 (\n4.563\n% 2048 Notes)\n1,415\n \n1,415\n \n3.375\n% notes due 2050 (\n3.375\n% 2050 Notes)\n1,764\n \n2,132\n \n4.663\n% notes due 2051 (\n4.663\n% 2051 Notes)\n3,541\n \n3,541\n \n3.00\n% notes due 2052 (\n3.00\n% 2052 Notes)\n890\n \n999\n \n4.20\n% notes due 2052 (\n4.20\n% 2052 Notes)\n895\n \n950\n \n4.875\n% notes due 2053 (\n4.875\n% 2053 Notes)\n1,000\n \n1,000\n \n5.65\n% notes due 2053 (\n5.65\n% 2053 Notes)\n4,250\n \n4,250\n \n2.77\n% notes due 2053 (\n2.77\n% 2053 Notes)\n940\n \n940\n \nF-37\nDecember 31,\n2024\n2023\n4.40\n% notes due 2062 (\n4.40\n% 2062 Notes)\n1,165\n \n1,200\n \n5.75\n% notes due 2063 (\n5.75\n% 2063 Notes)\n2,750\n \n2,750\n \nOther notes due 2097\n100\n \n100\n \nTotal principal amount of debt\n61,778\n \n66,330\n \nUnamortized bond discounts, premiums and issuance costs, net\n(\n1,360\n)\n(\n1,420\n)\nFair value adjustments\n(\n343\n)\n(\n314\n)\nOther\n24\n \n17\n \nTotal carrying value of debt\n60,099\n \n64,613\n \nLess current portion\n(\n3,550\n)\n(\n1,443\n)\nTotal long-term debt\n$\n56,549\n \n$\n63,170\n \nThere are no material differences between the effective interest rates and coupon rates of our notes, except for the \n4.563\n% 2048 Notes, the \n4.663\n% 2051 Notes and the \n2.77\n% 2053 Notes, which have effective interest rates of \n6.3\n%, \n5.6\n% and \n5.2\n%, respectively.\nUnder the terms of all of our outstanding notes, except our Other notes due 2097, in the event of a change-in-control triggering event we may be required to purchase all or a portion of these debt securities at prices equal to \n101\n% of the principal amounts of the notes plus accrued and unpaid interest. In addition, all of our outstanding notes—except our Other notes due 2097—may be redeemed at any time at our option—in whole or in part—at the principal amounts of the notes being redeemed plus accrued and unpaid interest and make-whole amounts, which are defined by the terms of the notes. Certain of the redeemable notes do not require the payment of make-whole amounts if redeemed during a specified period of time immediately prior to the maturity of the notes. Such time periods range from \none month\n to \nsix months\n prior to maturity, except for the \n5.507\n% 2026 Notes, which may be redeemed without payment of the make-whole amount if redemption occurs after \ntwo years\n prior to maturity.\nDebt issuances and acquisition-related financing\nWe did \nnot\n issue debt securities during the year ended December 31, 2024.\nIn March 2023, in connection with the acquisition of Horizon (see Note 4, Acquisitions and divestitures\n—Acquisition of Horizon Therapeutics plc\n), we issued the following series of notes (in millions):\nPrincipal Amount\n5.25\n% 2025 Notes\n$\n2,000\n \n5.507\n% 2026 Notes\n1,500\n \n5.15\n% 2028 Notes\n3,750\n \n5.25\n% 2030 Notes\n2,750\n \n5.25\n% 2033 Notes\n4,250\n \n5.60\n% 2043 Notes\n2,750\n \n5.65\n% 2053 Notes\n4,250\n \n5.75\n% 2063 Notes\n2,750\n \nTotal\n$\n24,000\n \nAlso in connection with the acquisition of Horizon, we entered into a $\n4.0\n billion term loan credit agreement in December 2022. In October 2023, in connection with the completion of the acquisition of Horizon, we borrowed $\n4.0\n billion under the term loan credit agreement, of which $\n2.2\n billion was repaid during 2024. As of December 31, 2024, we had $\n1.8\n billion of borrowings outstanding under the term loan credit agreement, which has an interest rate of three-month SOFR plus \n1.225\n% and is due in October 2026.\nIn 2022, we issued $\n7.0\n billion of debt consisting of $\n750\n million of the \n3.00\n% 2029 Notes, $\n1.25\n billion of the \n4.05\n% 2029 Notes, $\n1.0\n billion of the \n3.35\n% 2032 Notes, $\n750\n million of the \n4.20\n% 2033 Notes, $\n1.0\n billion of the \n4.20\n% 2052 Notes, $\n1.0\n billion of the \n4.875\n% 2053 Notes and $\n1.25\n billion of the \n4.40\n% 2062 Notes. The \n3.00\n% 2029 Notes were issued and used to finance eligible projects that met specified criteria to reduce our impact on the environment.\nF-38\nDebt extinguishment\nIn 2024, we repurchased an aggregate principal amount of our debt of $\n875\n million, including portions of the \n3.15\n% 2040 Notes, \n2.80\n% 2041 Notes, \n3.375\n% 2050 Notes, \n3.00\n% 2052 Notes, \n4.20\n% 2052 Notes and \n4.40\n% 2062 Notes, for an aggregate cost of $\n659\n million, which resulted in a $\n215\n million gain on extinguishment of debt recorded in Other income (expense), net, in the Consolidated Statements of Income.\nIn 2023, we repurchased an aggregate principal amount of our debt of $\n881\n million, including portions of the \n2.00\n% 2032 Notes, \n3.15\n% 2040 Notes, \n2.80\n% 2041 Notes, \n3.375\n% 2050 Notes, \n3.00\n% 2052 Notes, \n4.20\n% 2052 Notes and \n4.40\n% 2062 Notes, for an aggregate cost of $\n647\n million, which resulted in a $\n225\n million gain on extinguishment of debt recorded in Other income (expense), net, in the Consolidated Statements of Income.\nIn 2022, we repurchased an aggregate principal amount of our debt of $\n378\n million, including portions of the \n2.20\n% 2027 Notes, \n1.65\n% 2028 Notes, \n2.00\n% 2032 Notes, \n2.80\n% 2041 Notes and \n3.00\n% 2052 Notes, for an aggregate cost of $\n297\n million, which resulted in a $\n78\n million gain on extinguishment of debt recorded in Other income (expense), net, in the Consolidated Statements of Income.\nDebt repayments\nIn 2024, we repaid the full $\n2.0\n billion aggregate principal amount on the term loan due April 2025, $\n200\n million of the aggregate principal amount on the term loan due October 2026 and the full $\n1.4\n billion aggregate principal amount of the \n3.625\n% 2024 Notes.\nIn 2023, we repaid the full $\n750\n million aggregate principal amount of the \n2.25\n% 2023 Notes and the full CHF\n700\n million aggregate principal amount ($\n704\n million upon settlement of the related cross-currency swap) of the \n0.41\n% 2023 Swiss franc Bonds.\nIn 2022, \nno\n debt was repaid or redeemed.\nInterest rate swaps\nTo achieve a desired mix of fixed-rate and floating-rate debt, we enter into interest rate swap contracts that effectively convert fixed-rate interest coupons for certain of our debt instruments to floating SOFR-based coupons over the terms of the respective debt instruments. These interest rate swap contracts qualify and are designated as fair value hedges. For information regarding the terms of these contracts, see Note 19, Derivative instruments.\nCross-currency swaps\nTo hedge our exposure to foreign currency exchange rate risk associated with certain of our long-term notes denominated in foreign currencies, we entered into cross-currency swap contracts. The terms of these contracts outstanding as of December 31, 2024, effectively convert the interest payments and principal repayments on our \n2.00\n% 2026 euro Notes, \n5.50\n% 2026 pound sterling Notes and \n4.00\n% 2029 pound sterling Notes from euros and pounds sterling to U.S. dollars. These cross-currency swap contracts have been designated as cash flow hedges. For information regarding the terms of these contracts, see Note 19, Derivative instruments. Cross-currency swap contracts associated with other foreign denominated debt previously outstanding were settled in connection with the repayment of such debt, as discussed above.\nShelf registration statement and other facilities\nAs of December 31, 2024, we have a commercial paper program that allows us to issue up to $\n2.5\n billion of unsecured commercial paper to fund our working-capital needs. As of December 31, 2024 and 2023, we had \nno\n amounts outstanding under our commercial paper program.\nIn the first quarter of 2023, we amended and restated our syndicated, unsecured, revolving credit agreement, under which we may borrow up to $\n4.0\n billion for general corporate purposes, including as a liquidity backstop for our commercial paper program. The commitments under the revolving credit agreement may be increased by up to $\n1.25\n billion with the agreement of the banks. Each bank that is a party to the agreement has an initial commitment term of \nfive years\n. This term may be extended for up to \ntwo\n additional \none-year\n periods with the agreement of the banks. Annual commitment fees for this agreement are \n0.09\n% of the unused portion of the facility based on our current credit rating. Generally, we would be charged interest for any amounts borrowed under this facility, based on our current credit rating, at (i) SOFR plus \n1.01\n% or (ii) the highest of (A) the administrative agent bank base commercial lending rate, (B) the overnight federal funds rate plus \n0.50\n% or (C) one-month SOFR plus \n1.1\n%. As of December 31, 2024 and 2023, \nno\n amounts were outstanding under this facility.\nIn February 2023, we filed a shelf registration statement with the SEC that allows us to issue unspecified amounts of debt securities; common stock; preferred stock; warrants to purchase debt securities, common stock, preferred stock or depositary \nF-39\nshares; rights to purchase common stock or preferred stock; securities purchase contracts; securities purchase units; and depositary shares. Under this shelf registration statement, all of the securities available for issuance may be offered from time to time, with terms to be determined at the time of issuance. This shelf registration statement expires in February 2026.\nCertain of our financing arrangements contain nonfinancial covenants. In addition, our revolving credit agreement and term loan agreement include a financial covenant, which requires us to maintain a specified minimum interest coverage ratio of (i) the sum of consolidated net income, interest expense, provision for income taxes, depreciation expense, amortization expense, unusual or nonrecurring charges and other noncash items (Consolidated EBITDA) to (ii) Consolidated Interest Expense, each as defined and described in the respective agreements. We were in compliance with all applicable covenants under these arrangements as of December 31, 2024.\nContractual maturities of debt obligations\nThe aggregate contractual maturities of our debt obligations as of December 31, 2024, were as follows (in millions):\nMaturity dates\nAmounts\n2025\n$\n3,500\n \n2026\n5,922\n \n2027\n2,724\n \n2028\n4,984\n \n2029\n2,876\n \nThereafter\n41,772\n \nTotal\n$\n61,778\n \nInterest costs\nInterest costs are expensed as incurred except to the extent such interest is related to construction in progress, in which case interest is capitalized. Interest costs capitalized for the years ended December 31, 2024, 2023 and 2022, were not material. Interest paid, including the ongoing impact of interest rate and cross-currency swap contracts, during the years ended December 31, 2024, 2023 and 2022 was $\n3.3\n billion, $\n2.4\n billion and $\n1.2\n billion, respectively.\n17. \nStockholders’ equity\nStock repurchase program\nDuring the year ended December 31, 2024, we repurchased \n0.7\n million shares of our common stock for a total cost of $\n200\n million under our stock repurchase program. During the year ended December 31, 2023, we did \nnot\n repurchase any shares of our common stock under our stock repurchase program. During the year ended December 31, 2022, we repurchased \n26.1\n million shares of our common stock under our stock repurchase program, consisting primarily of \n24.8\n million shares received under ASR agreements, for a total cost of $\n6.3\n billion. As of December 31, 2024, $\n6.8\n billion remained available under our stock repurchase program.\nDividends\nOur Board of Directors declared quarterly dividends per share of $\n2.25\n, $\n2.13\n and $\n1.94\n, which were paid in each of the four quarters of 2024, 2023 and 2022, respectively.\nHistorically, we have declared dividends in December of each year, which were paid in the first quarter of the following fiscal year and in March, July and October, which were paid in the second, third and fourth quarters, respectively, of the same fiscal year. Additionally, on December 10, 2024, the Board of Directors declared a quarterly cash dividend of $\n2.38\n per share of common stock, which will be paid in March 2025, to all stockholders of record as of the close of business on February 14, 2025.\nF-40\nAccumulated other comprehensive loss\nThe components of AOCI were as follows (in millions):\nForeign\ncurrency\ntranslation adjustments\nCash flow\nhedges\nOther\nAOCI\nBalance as of December 31, 2021\n$\n(\n844\n)\n$\n61\n \n$\n(\n13\n)\n$\n(\n796\n)\nForeign currency translation adjustments\n496\n \n—\n \n—\n \n496\n \nUnrealized gains\n—\n \n84\n \n—\n \n84\n \nReclassification adjustments to earnings\n—\n \n2\n \n—\n \n2\n \nOther\n—\n \n—\n \n2\n \n2\n \nIncome taxes\n—\n \n(\n19\n)\n—\n \n(\n19\n)\nBalance as of December 31, 2022\n(\n348\n)\n128\n \n(\n11\n)\n(\n231\n)\nForeign currency translation adjustments\n50\n \n—\n \n—\n \n50\n \nUnrealized gains\n—\n \n28\n \n—\n \n28\n \nReclassification adjustments to earnings\n—\n \n(\n222\n)\n—\n \n(\n222\n)\nOther\n—\n \n—\n \n42\n \n42\n \nIncome taxes\n—\n \n44\n \n—\n \n44\n \nBalance as of December 31, 2023\n(\n298\n)\n(\n22\n)\n31\n \n(\n289\n)\nForeign currency translation adjustments\n(\n76\n)\n—\n \n—\n \n(\n76\n)\nUnrealized gains\n—\n \n506\n \n—\n \n506\n \nReclassification adjustments to earnings\n—\n \n(\n117\n)\n—\n \n(\n117\n)\nOther\n—\n \n—\n \n(\n10\n)\n(\n10\n)\nIncome taxes\n—\n \n(\n80\n)\n—\n \n(\n80\n)\nBalance as of December 31, 2024\n$\n(\n374\n)\n$\n287\n \n$\n21\n \n$\n(\n66\n)\nWith respect to the table above, income tax expenses or benefits for unrealized gains and losses and the related reclassification adjustments to earnings for cash flow hedges were a $\n105\n million expense and a $\n25\n million benefit in 2024, a $\n6\n million expense and a $\n50\n million benefit in 2023 and a $\n19\n million expense and a $\n0\n million benefit in 2022, respectively. \nReclassifications out of AOCI and into earnings were as follows (in millions):\nYears ended December 31,\nComponents of AOCI\n2024\n2023\n2022\nConsolidated Statements of Income locations\nCash flow hedges:\nForeign currency contract gains\n$\n192\n \n$\n180\n \n$\n231\n \nProduct sales\nCross-currency swap contract (losses) gains\n(\n75\n)\n42\n \n(\n233\n)\nOther income (expense), net\n117\n \n222\n \n(\n2\n)\nIncome before income taxes\n(\n25\n)\n(\n50\n)\n—\n \nProvision for income taxes\n$\n92\n \n$\n172\n \n$\n(\n2\n)\nNet income\nOther\nIn addition to common stock, our authorized capital includes \n5\n million shares of preferred stock, $\n0.0001\n par value. As of December 31, 2024 and 2023, \nno\n shares of preferred stock were issued or outstanding.\nF-41\n18. \nFair value measurement\nTo estimate the fair value of our financial assets and liabilities, we use valuation approaches within a hierarchy that maximizes the use of observable inputs and minimizes the use of unobservable inputs by requiring that observable inputs be used when available. Observable inputs are inputs that market participants would use in pricing an asset or liability based on market data obtained from sources independent of the Company. Unobservable inputs are inputs that reflect the Company’s assumptions about the inputs that market participants would use in pricing an asset or liability and are developed based on the best information available in the circumstances. The fair value hierarchy is divided into three levels based on the source of inputs as follows:\nLevel 1\n—\nValuations based on unadjusted quoted prices in active markets for identical assets or liabilities that the Company has the ability to access\nLevel 2\n—\nValuations for which all significant inputs are observable either directly or indirectly—other than Level 1 inputs\nLevel 3\n—\nValuations based on inputs that are unobservable and significant to the overall fair value measurement\nThe availability of observable inputs can vary among the various types of financial assets and liabilities. To the extent that the valuation is based on models or inputs that are less observable or unobservable in the market, the determination of fair value requires more judgment. In certain cases, the inputs used for measuring fair value may fall into different levels of the fair value hierarchy. In such cases, for financial statement disclosure purposes, the level in the fair value hierarchy within which the fair value measurement is categorized is based on the lowest level of input used that is significant to the overall fair value measurement.\nThe fair values of each major class of the Company’s financial assets and liabilities measured at fair value on a recurring basis were as follows (in millions):\nFair value measurement as of December 31, 2024, using:\nQuoted prices in\nactive markets for\nidentical assets\n(Level 1)\nSignificant other\nobservable\ninputs\n(Level 2)\nSignificant\nunobservable\ninputs\n(Level 3)\nTotal\nAssets:\nAvailable-for-sale securities:\nU.S. Treasury bills\n$\n—\n \n$\n997\n \n$\n—\n \n$\n997\n \nMoney market mutual funds\n10,354\n \n—\n \n—\n \n10,354\n \nOther short-term interest-bearing securities\n—\n \n135\n \n—\n \n135\n \nEquity securities\n4,188\n \n—\n \n—\n \n4,188\n \nDerivatives:\nForeign currency forward contracts\n—\n \n420\n \n—\n \n420\n \nCross-currency swap contracts\n—\n \n—\n \n—\n \n—\n \nInterest rate swap contracts\n—\n \n—\n \n—\n \n—\n \nTotal assets\n$\n14,542\n \n$\n1,552\n \n$\n—\n \n$\n16,094\n \nLiabilities:\nDerivatives:\nForeign currency forward contracts\n$\n—\n \n$\n8\n \n$\n—\n \n$\n8\n \nCross-currency swap contracts\n—\n \n483\n \n—\n \n483\n \nInterest rate swap contracts\n—\n \n531\n \n—\n \n531\n \nContingent consideration obligations \n—\n \n—\n \n106\n \n106\n \nTotal liabilities\n$\n—\n \n$\n1,022\n \n$\n106\n \n$\n1,128\n \nF-42\nFair value measurement as of December 31, 2023, using:\nQuoted prices in\nactive markets for\nidentical assets\n(Level 1)\nSignificant other\nobservable\ninputs\n(Level 2)\nSignificant\nunobservable\ninputs\n(Level 3)\nTotal\nAssets:\nAvailable-for-sale securities:\nU.S. Treasury bills\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \nMoney market mutual funds\n10,266\n \n—\n \n—\n \n10,266\n \nOther short-term interest-bearing securities\n—\n \n138\n \n—\n \n138\n \nEquity securities\n4,514\n \n—\n \n—\n \n4,514\n \nDerivatives:\nForeign currency forward contracts\n—\n \n145\n \n—\n \n145\n \nCross-currency swap contracts\n—\n \n—\n \n—\n \n—\n \nInterest rate swap contracts\n—\n \n—\n \n—\n \n—\n \nTotal assets\n$\n14,780\n \n$\n283\n \n$\n—\n \n$\n15,063\n \nLiabilities:\nDerivatives:\nForeign currency forward contracts\n$\n—\n \n$\n116\n \n$\n—\n \n$\n116\n \nCross-currency swap contracts\n—\n \n405\n \n—\n \n405\n \nInterest rate swap contracts\n—\n \n571\n \n—\n \n571\n \nContingent consideration obligations\n—\n \n—\n \n96\n \n96\n \nTotal liabilities\n$\n—\n \n$\n1,092\n \n$\n96\n \n$\n1,188\n \nInterest-bearing and equity securities\nThe fair values of our U.S. Treasury bills are determined by utilizing third-party pricing services, which obtain pricing data from active market makers and brokers. The fair values of our money market mutual funds and equity investments in publicly traded securities, including our equity investments in BeiGene and Neumora, as of December 31, 2024 and 2023, are based on quoted market prices in active markets, with no valuation adjustment\n.\nDerivatives\nAll of our foreign currency forward contracts, cross-currency swap contracts and interest rate swap contracts are with counterparties that have minimum credit ratings of A– or equivalent by S&P, Moody’s or Fitch. We estimate the fair values of these contracts by taking into consideration valuations obtained from a third-party valuation service that uses an income-based industry-standard valuation model for which all significant inputs are observable either directly or indirectly. These inputs, as applicable, include foreign currency exchange rates, SOFR, swap rates, obligor credit default swap rates and cross-currency basis swap spreads. Certain inputs, when applicable, are at commonly quoted intervals. See Note 19, Derivative instruments.\nContingent consideration obligations\nAs a result of our business acquisitions, we have incurred contingent consideration obligations as discussed below. The contingent consideration obligations are recorded at their fair values by using probability-adjusted discounted cash flows, and we revalue these obligations each reporting period until the related contingencies have been resolved. The fair value measurements of these obligations are based on significant unobservable inputs related to licensing rights and product candidates acquired in business combinations, and they are reviewed quarterly by management in our R&D and commercial sales organizations. The inputs include, as applicable, estimated probabilities and the timing of achieving specified development, regulatory and commercial milestones as well as estimated annual sales. Significant changes that increase or decrease the probabilities of achieving the related development, regulatory and commercial events or that shorten or lengthen the time required to achieve such events or that increase or decrease estimated annual sales would result in corresponding increases or decreases in the fair values of the obligations, as applicable. Changes in the fair values of contingent consideration obligations are recognized in Other operating expenses in the Consolidated Statements of Income.\nF-43\nChanges in the carrying amounts of contingent consideration obligations were as follows (in millions):\nYears ended December 31,\n2024\n2023\n2022\nBeginning balance\n$\n96\n \n$\n270\n \n$\n342\n \nPayments\n(\n8\n)\n(\n9\n)\n(\n7\n)\nNet changes in valuations\n18\n \n(\n165\n)\n(\n65\n)\nEnding balance\n$\n106\n \n$\n96\n \n$\n270\n \nAs of December 31, 2024 and 2023, our contingent consideration obligations are primarily the result of our acquisition of Teneobio in October 2021, which obligates us to make payments to the former shareholders upon achievement of separate development and regulatory milestones with regard to various R&D programs. In 2023, the development of AMG 340 was terminated, resulting in a decrease of the related contingent consideration liability. During the year ended December 31, 2023, the remeasurement of our contingent consideration liability of $\n165\n million, which was primarily related to the termination of AMG 340, was recognized in Other operating expenses in the Consolidated Statements of Income and included in Other items, net, in the Consolidated Statements of Cash Flows. See Note 13, Goodwill and other intangible assets, for the impact on the related IPR&D asset.\nSummary of the fair values of other financial instruments\nCash equivalents\nThe fair values of cash equivalents are approximated at their carrying values due to the short-term nature of such financial instruments.\nBorrowings\nWe estimate the fair values of our fixed-rate notes by using Level 2 inputs. As of December 31, 2024 and 2023, the aggregate fair values of our fixed-rate notes were $\n54.9\n billion and $\n59.2\n billion, respectively, and the carrying values of our fixed-rate notes were $\n58.3\n billion and $\n60.6\n billion, respectively. The estimates of the fair values of our term loans approximate their carrying values as of December 31, 2024 and 2023 as these debt instruments bear interest at floating rates.\nDuring the years ended December 31, 2024 and 2023, there were no transfers of assets or liabilities between fair value measurement levels, and except with respect to the IPR&D intangible impairment of AMG 340 in 2023 as disclosed in Note 13, Goodwill and other intangible assets, there were no material remeasurements to the fair values of assets and liabilities that are not measured at fair value on a recurring basis.\n19. \nDerivative instruments\nThe Company is exposed to foreign currency exchange rate and interest rate risks related to its business operations. To reduce our risks related to such exposures, we use or have used certain derivative instruments, including foreign currency forward, foreign currency option, cross-currency swap, forward interest rate and interest rate swap contracts. We have designated certain of our derivatives as cash flow and fair value hedges; we also have derivatives not designated as hedges. We do not use derivatives for speculative trading purposes.\nCash flow hedges\nWe are exposed to possible changes in the values of certain anticipated foreign currency cash flows resulting from changes in foreign currency exchange rates primarily associated with our euro-denominated international product sales. The foreign currency exchange rate fluctuation exposure associated with cash inflows from our international product sales is partially offset by corresponding cash outflows from our international operating expenses. To further reduce this exposure, we enter into foreign currency forward contracts to hedge a portion of our projected international product sales up to a maximum of \nthree years\n into the future; and at any given point in time, a higher percentage of nearer-term projected product sales is being hedged than in successive periods.\nAs of December 31, 2024, 2023 and 2022, we had outstanding foreign currency forward contracts with aggregate notional amounts of $\n7.2\n billion, $\n6.6\n billion and $\n6.0\n billion, respectively. We have designated these foreign currency forward contracts, which are primarily euro based, as cash flow hedges. Accordingly, we record unrealized gains and losses on these contracts in AOCI in the Consolidated Balance Sheets, and we reclassify them to Product sales in the Consolidated Statements of Income in the same periods during which the hedged transactions affect earnings.\nF-44\nTo hedge our exposure to foreign currency exchange rate risk associated with certain of our long-term debt denominated in foreign currencies, we enter into cross-currency swap contracts. Under the terms of such contracts, we paid euros and pounds sterling and received U.S. dollars for the notional amounts at the inception of the contracts; and based on these notional amounts, we exchange interest payments at fixed rates over the terms of the contracts by paying U.S. dollars and receiving euros and pounds sterling. In addition, we will pay U.S. dollars to and receive euros and pounds sterling from the counterparties at the maturities of the contracts for these same notional amounts. The terms of these contracts correspond to the related hedged debt, thereby effectively converting the interest payments and principal repayment on the debt from euros and pounds sterling to U.S. dollars. We have designated these cross-currency swap contracts as cash flow hedges. Accordingly, the unrealized gains and losses on these contracts are recorded in AOCI in the Consolidated Balance Sheets and reclassified to Other income (expense), net, in the Consolidated Statements of Income in the same periods during which the hedged debt affects earnings.\n \nThe notional amounts and interest rates of our cross-currency swaps as of December 31, 2024, were as follows (notional amounts in millions):\nForeign currency\nU.S. dollars\nHedged notes\nNotional amounts\nInterest rates\nNotional amounts\nInterest rates\n2.00\n% 2026 euro Notes\n€\n750\n \n2.0\n \n%\n$\n833\n \n3.9\n \n%\n5.50\n% 2026 pound sterling Notes\n£\n475\n \n5.5\n \n%\n$\n747\n \n6.0\n \n%\n4.00\n% 2029 pound sterling Notes\n£\n700\n \n4.0\n \n%\n$\n1,111\n \n4.6\n \n%\nIn connection with the anticipated issuance of long-term fixed-rate debt, we occasionally enter into forward interest rate contracts in order to hedge the variability in cash flows due to changes in the applicable U.S. Treasury rate between the time we enter into these contracts and the time the related debt is issued. Gains and losses on forward interest rate contracts, which are designated as cash flow hedges, are recognized in AOCI in the Consolidated Balance Sheets and are amortized into Interest expense, net, in the Consolidated Statements of Income over the terms of the associated debt issuances. Amounts expected to be recognized during the subsequent 12 months on forward interest rate contracts are not material.\nThe unrealized gains and losses recognized in AOCI for our derivative instruments designated as cash flow hedges were as follows (in millions):\nYears ended December 31,\nDerivatives in cash flow hedging relationships\n2024\n2023\n2022\nForeign currency forward contracts\n$\n585\n \n$\n(\n14\n)\n$\n308\n \nCross-currency swap contracts\n(\n79\n)\n73\n \n(\n219\n)\nForward interest rate contracts\n—\n \n(\n31\n)\n(\n5\n)\nTotal unrealized gains\n$\n506\n \n$\n28\n \n$\n84\n \nFair value hedges\nTo achieve a desired mix of fixed-rate and floating-rate debt, we enter into interest rate swap contracts that qualify for and were designated as fair value hedges. These interest rate swap contracts effectively convert fixed-rate coupons to floating-rate SOFR-based coupons over the terms of the related hedge contracts. As of both December 31, 2024 and 2023, we had interest rate swap contracts with an aggregate notional amount of $\n6.7\n billion that hedge certain portions of our long-term debt issuances. \nDuring the year ended December 31, 2024, interest rate swap contracts with an aggregate notional amount of $\n1.4\n billion matured in connection with the repayment of the \n3.625\n% 2024 Notes. In addition, we entered into new interest rate swap contracts with respect to the \n5.25\n% 2033 Notes for an aggregate notional amount of $\n1.4\n billion at an interest rate of SOFR plus \n1.8\n%. \nF-45\nAs of December 31, 2024 and 2023, the interest rates on the portion of notes for which we have entered into interest rate swap contracts and the related notional amounts of these contracts were as follows (dollar amounts in millions):\nDecember 31,\n2024\n2023\nNotes\nNotional amounts\nInterest rates\nNotional amounts\nInterest rates\n3.625\n% 2024 Notes\n$\n—\n \nN/A\n$\n1,400\n \nSOFR + \n3.4\n%\n3.125\n% 2025 Notes\n1,000\n \nSOFR + \n2.1\n%\n1,000\n \nSOFR + \n2.1\n%\n2.60\n% 2026 Notes\n1,250\n \nSOFR + \n2.1\n%\n1,250\n \nSOFR + \n2.1\n%\n2.45\n% 2030 Notes\n1,000\n \nSOFR + \n1.3\n%\n1,000\n \nSOFR + \n1.3\n%\n2.30\n% 2031 Notes\n500\n \nSOFR + \n1.1\n%\n500\n \nSOFR + \n1.1\n%\n5.25\n% 2033 Notes\n1,400\n \nSOFR + \n1.8\n%\n—\n \nN/A\n4.663\n% 2051 Notes\n1,500\n \nSOFR + \n4.3\n%\n1,500\n \nSOFR + \n4.3\n%\nTotal notional amounts\n$\n6,650\n \n$\n6,650\n \nN/A = not applicable\nFor interest rate swap contracts that qualify for and are designated as fair value hedges, we recognize in Interest expense, net, in the Consolidated Statements of Income the unrealized gain or loss on the derivative resulting from the change in fair value during the period, as well as the offsetting unrealized loss or gain of the hedged item resulting from the change in fair value during the period attributable to the hedged risk. If a hedging relationship involving an interest rate swap contract is terminated, the gain or loss realized on contract termination is recorded as an adjustment to the carrying value of the debt and amortized into Interest expense, net, over the remaining term of the previously hedged debt.\nThe hedged liabilities and related cumulative-basis adjustments for fair value hedges of those liabilities were recorded in the Consolidated Balance Sheets as follows (in millions):\nCarrying amounts of hedged liabilities\n(1)\nCumulative amounts of fair value hedging adjustments related to the carrying amounts of the hedged liabilities\n(2)\nDecember 31,\nDecember 31,\nConsolidated Balance Sheets locations\n2024\n2023\n2024\n2023\nCurrent portion of long-term debt\n$\n1,045\n \n$\n1,441\n \n$\n45\n \n$\n41\n \nLong-term debt\n$\n5,152\n \n$\n4,788\n \n$\n(\n388\n)\n$\n(\n355\n)\n____________\n(1)\nCurrent portion of long-term debt includes $\n56\n million and $\n69\n million of carrying value with discontinued hedging relationships as of December 31, 2024 and 2023, respectively. Long-term debt includes $\n232\n million and $\n288\n million of carrying value with discontinued hedging relationships as of December 31, 2024 and 2023, respectively.\n(2)\nCurrent portion of long-term debt includes $\n56\n million and $\n69\n million of hedging adjustments on discontinued hedging relationships as of December 31, 2024 and 2023, respectively. Long-term debt includes $\n132\n million and $\n188\n million of hedging adjustments on discontinued hedging relationships as of December 31, 2024 and 2023, respectively.\nF-46\nImpact of hedging transactions\nThe following tables summarize the amounts recorded in income and expense line items and the effects thereon from fair value and cash flow hedging, including discontinued hedging relationships (in millions):\nYear ended December 31, 2024\nProduct sales\nOther income (expense), net\nInterest expense, net\nTotal amounts recorded in income and (expense) line items presented in the Consolidated Statements of Income\n$\n32,026\n \n$\n506\n \n$\n(\n3,155\n)\nThe effects of cash flow and fair value hedging:\nGains (losses) on cash flow hedging relationships reclassified out of AOCI:\nForeign currency forward contracts\n$\n192\n \n$\n— \n$\n— \nCross-currency swap contracts\n$\n— \n$\n(\n75\n)\n$\n— \nGains on fair value hedging relationships—interest rate swap agreements:\nHedged items\n(1)\n$\n— \n$\n— \n$\n29\n \nDerivatives designated as hedging instruments\n$\n— \n$\n— \n$\n40\n \nYear ended December 31, 2023\nProduct sales\nOther income (expense), net\nInterest expense, net\nTotal amounts recorded in income and (expense) line items presented in the Consolidated Statements of Income\n$\n26,910\n \n$\n2,833\n \n$\n(\n2,875\n)\nThe effects of cash flow and fair value hedging:\nGains on cash flow hedging relationships reclassified out of AOCI:\nForeign currency forward contracts\n$\n180\n \n$\n— \n$\n— \nCross-currency swap contracts\n$\n— \n$\n42\n \n$\n— \n(Losses) gains on fair value hedging relationships—interest rate swap agreements:\nHedged items\n(1)\n$\n— \n$\n— \n$\n(\n118\n)\nDerivatives designated as hedging instruments\n$\n— \n$\n— \n$\n205\n \nYear ended December 31, 2022\nProduct sales\nOther income (expense), net\nInterest expense, net\nTotal amounts recorded in income and (expense) line items presented in the Consolidated Statements of Income\n$\n24,801\n \n$\n(\n814\n)\n$\n(\n1,406\n)\nThe effects of cash flow and fair value hedging:\nGains (losses) on cash flow hedging relationships reclassified out of AOCI:\nForeign currency forward contracts\n$\n231\n \n$\n— \n$\n— \nCross-currency swap contracts\n$\n— \n$\n(\n233\n)\n$\n— \nGains (losses) on fair value hedging relationships—interest rate swap agreements:\nHedged items\n(1)\n$\n— \n$\n— \n$\n716\n \nDerivatives designated as hedging instruments\n$\n— \n$\n— \n$\n(\n636\n)\n__________\n(1)\n    Gains (losses) on hedged items do not exactly offset losses (gains) on the related designated hedging instruments due to amortization of the cumulative amounts of fair value hedging adjustments included in the carrying amount of the hedged debt for discontinued hedging relationships and the recognition of gains on terminated hedges when the corresponding hedged item was paid down in the period.\n \nF-47\nNo portions of our cash flow hedge contracts were excluded from the assessment of hedge effectiveness. As of December 31, 2024, we expected to reclassify $\n170\n million of net gains on our foreign currency and cross-currency swap contracts out of AOCI and into earnings during the next 12 months.\nDerivatives not designated as hedges\nTo reduce our exposure to foreign currency fluctuations in certain assets and liabilities denominated in foreign currencies, we enter into foreign currency forward contracts that are not designated as hedging transactions. Most of these exposures are hedged on a month-to-month basis. As of December 31, 2024, 2023 and 2022, the total notional amounts of these foreign currency forward contracts were $\n148\n million, $\n457\n million and $\n517\n million, respectively. Gains and losses recognized in earnings for our derivative instruments not designated as hedging instruments were not material for the years ended December 31, 2024, 2023 and 2022.\nFair values of derivatives\nThe fair values of derivatives included in the Consolidated Balance Sheets were as follows (in millions):\n \nDerivative assets\nDerivative liabilities\nDecember 31, 2024\nConsolidated Balance Sheets locations\nFair values\nConsolidated Balance Sheets locations\nFair values\nDerivatives designated as hedging instruments:\nForeign currency forward contracts\nOther current assets/ Other noncurrent assets\n$\n420\n \nAccrued liabilities/ Other noncurrent liabilities\n$\n8\n \nCross-currency swap contracts\nOther current assets/ Other noncurrent assets\n—\n \nAccrued liabilities/ Other noncurrent liabilities\n483\n \nInterest rate swap contracts\nOther current assets/ Other noncurrent assets\n—\n \nAccrued liabilities/ Other noncurrent liabilities\n531\n \nTotal derivatives designated as hedging instruments\n420\n \n1,022\n \nTotal derivatives\n$\n420\n \n$\n1,022\n \n \nDerivative assets\nDerivative liabilities\nDecember 31, 2023\nConsolidated Balance Sheets locations\nFair values\nConsolidated Balance Sheets locations\nFair values\nDerivatives designated as hedging instruments:\nForeign currency forward contracts\nOther current assets/ Other noncurrent assets\n$\n145\n \nAccrued liabilities/ Other noncurrent liabilities\n$\n116\n \nCross-currency swap contracts\nOther current assets/ Other noncurrent assets\n—\n \nAccrued liabilities/ Other noncurrent liabilities\n405\n \nInterest rate swap contracts\nOther current assets/ Other noncurrent assets\n—\n \nAccrued liabilities/ Other noncurrent liabilities\n571\n \nTotal derivatives designated as hedging instruments\n145\n \n1,092\n \nTotal derivatives\n$\n145\n \n$\n1,092\n \nFor additional information, see Note 18, Fair value measurement.\nOur derivative contracts that were in liability positions as of December 31, 2024, contain certain credit-risk-related contingent provisions that would be triggered if (i) we were to undergo a change-in-control and (ii) our or the surviving entity’s creditworthiness deteriorates, which is generally defined as having either a credit rating that is below investment grade or a materially weaker creditworthiness after the change-in-control. If these events were to occur, the counterparties would have the right, but not the obligation, to close the contracts under early-termination provisions. In such circumstances, the counterparties \nF-48\ncould request immediate settlement of these contracts for amounts that approximate the then current fair values of the contracts. In addition, our derivative contracts are not subject to any type of master netting arrangement, and amounts due either to or from a counterparty under the contracts may be offset against other amounts due either to or from the same counterparty only if an event of default or termination, as defined, were to occur.\nThe cash flow effects of our derivative contracts in the Consolidated Statements of Cash Flows are included in Net cash provided by operating activities, except for the settlement of notional amounts of cross-currency swaps, which are included in Net cash (used in) provided by financing activities.\n20. \nContingencies and commitments \nContingencies\nIn the ordinary course of business, we are involved in various legal proceedings, government investigations and other matters that are complex in nature and have outcomes that are difficult to predict. See Part I, Ite"
}