{
  "ticker": "AMP",
  "cik": "0000820027",
  "company_name": "AMERIPRISE FINANCIAL INC",
  "filing_date": "2025-02-20",
  "accession": "0000820027-25-000013",
  "primary_doc": "amp-20241231.htm",
  "item1_text": "Item 1.  Business \nOverview\nAmeriprise Financial, Inc. is a diversified financial services company with a 130-year history of providing solutions to help clients confidently achieve their financial objectives. Ameriprise Financial, Inc. is a holding company incorporated in Delaware that primarily engages in business through its subsidiaries. Accordingly, references to “Ameriprise,” “Ameriprise Financial,” the “Company,” “we,” “us,” and “our” may refer to Ameriprise Financial, Inc. exclusively, to our entire family of companies, or to one or more of our subsidiaries. \nWe are a long-standing leader in financial planning and advice offering a broad range of products and services designed to assist individual and institutional clients achieve their financial objectives. Our strategy is centered on helping clients confidently achieve their goals by providing holistic advice and by managing and protecting their assets and income. We utilize two go-to-market approaches in carrying out this strategy: Wealth Management and Asset Management.\nWealth Management\nOur wealth management business is the primary growth engine of Ameriprise with a significant market opportunity. We are in a compelling position to capitalize on significant demographic and market trends driving increased demand for financial advice and solutions. In the United States (“U.S.”), the ongoing transition of baby boomers into retirement, as well as younger generations currently building their wealth and planning for retirement, continues to drive demand for financial advice and solutions. Our primary target market is households with $500,000 to $5,000,000 in investable assets. We are also well-suited to serve those outside this asset range as we also offer products and services designed for higher-net worth households. \nWe are an industry-leading wealth manager with a differentiated advice value proposition. Our network of more than 10,000 financial advisors (our “advisors”) is the primary channel through which we carry out our wealth management activities. Our capabilities are centered on establishing long-term personal relationships between clients and advisors. Through our affiliated advisors, we offer financial planning and advice, cash management and banking products, and full-service brokerage services, primarily to retail clients.\nOur branded advisor force is among the largest in the industry and is central to how we serve our clients. We support our advisors with an integrated technology platform, training, leadership and marketing programs to assist them in serving clients and growing their practices. Our nationally recognized brand, combined with these programs and other support, creates a compelling value proposition for financial advisors relative to the broader financial services industry. This is evidenced by our strong advisor retention and satisfaction and our ability to attract and retain experienced and productive advisors. We continuously invest in, develop, and refine capabilities and tools designed to maximize advisor productivity and client satisfaction.\nWe design products and services as solutions for clients’ cash and liquidity, asset accumulation, retirement, protection, income generation and disbursement and estate and wealth transfer needs. The financial solutions we offer through our advisors include our own products and services as well as other providers’ products. We distribute our life and disability income insurance, as well as annuity products, through our advisor channel under the\n RiverSource\n®\n brand.\nAsset Management\nOur global asset management business, represented by the \nColumbia Threadneedle Investments\n®\n brand, offers a broad spectrum of capabilities to individual, institutional and high net worth investors. \nColumbia Threadneedle\n®\n \ninvestment products are primarily offered through third parties, though we also provide our asset management products through our advisor network, direct retail and through our institutional sales force. Our underlying asset management philosophy is rooted in delivering consistently strong, competitive investment performance.\nWe are positioned to grow our assets under management and advisement and strengthen our asset management offerings to existing and new clients. We benefit from key strategic relationships we have established and have a strong institutional presence. Our asset management capabilities are designed to address mature markets in the U.S. and Europe while expanding into new global and emerging markets. We have expanded beyond our traditional strengths in the U.S. and the United Kingdom (“U.K.”) to serve more clients and gather assets worldwide. We continue to pursue opportunities to leverage the collective capabilities of our global asset management business in order to enhance our investment solutions and to develop new solutions that are responsive to client demand in an increasingly complex and competitive marketplace.\nHistory and Development\nOur company has provided solutions to help clients confidently achieve their financial objectives for 130 years. Our earliest predecessor company, Investors Syndicate, was founded in 1894 to provide face-amount certificates to consumers. In 1983, our company was formed as a Delaware corporation in connection with American Express’ acquisition of IDS Financial Services from Alleghany Corporation. We changed our name to “American Express Financial Corporation” (“AEFC”) and began marketing our \n1\nIndex\nAmeriprise Financial, Inc.\nproducts and services under the American Express brand in 1994. In 2005, AEFC spun off from American Express to form Ameriprise Financial, Inc.\nWe have grown both organically through the products and services we provide, as well as inorganically through strategic acquisitions. This has allowed us to significantly enhance the scale, performance, and product offerings of our brokerage, financial planning, managed accounts, retail mutual fund and institutional asset management businesses to best serve clients. Our acquisitions have included, among others, Threadneedle Asset Management Holdings, H&R Block Financial Advisors, Inc., J. & W. Seligman & Co. Incorporated, Columbia Management, Investment Professionals, Inc., and, most recently, BMO Financial Group’s European-based asset management business. Beyond traditional acquisitions, we pursue other strategies to grow our wealth management business such as experienced advisor recruiting, practice acquisitions, advisor loans, and partnerships with banks and credit unions.\nOver the years, we have also sought to optimize the organizational structure in which we offer certain banking products. In May 2019, we converted Ameriprise National Trust Bank to Ameriprise Bank, FSB (“Ameriprise Bank”) to expand the products and services we provide directly to our clients. At that time, Ameriprise Financial became a savings and loan holding company subject to regulation, supervision and examination by the Board of Governors for the Federal Reserve System (“FRB”), and Ameriprise Financial elected to be classified as a financial holding company subject to applicable regulation under the Bank Holding Company Act of 1956, as amended. \nOur Business Mix and Integrated Model \nThe financial results from the businesses underlying our go-to-market approaches are reflected in our operating segments:\n•\nAdvice & Wealth Management;\n•\nAsset Management;\n•\nRetirement & Protection Solutions; and                      \n•\nCorporate & Other.\nAs a diversified financial services firm, we believe our ability to gather and retain assets is best measured by our aggregate assets under management and administration metric. As of December 31, 2024, we had $1.5 trillion in assets under management, administration, and advisement, compared to $1.4 trillion as of December 31, 2023. For a more detailed discussion of assets under management, administration, and advisement, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in Part II, Item 7 of this Annual Report on Form 10-K.\n2\nIndex\nAmeriprise Financial, Inc.\nWe continue to execute on our strategy to grow our Advice & Wealth Management business with complementary Asset Management and Retirement & Protection Solutions businesses. Our integrated model leverages key business linkages to drive growth and consistency across market cycles. The following chart shows our current business mix represented by the contributions of each segment to our pretax adjusted operating earnings (excluding Corporate & Other segment) as well as a historical comparison. \nOur Principal Brands\nOur diversified products and services are offered through our brands: \nWe use the \nAmeriprise Financial\n®\n brand as our enterprise brand, as well as the name of our advisor network and certain of our retail products and services.\nOur global \nColumbia Threadneedle\n®\n and \nColumbia Threadneedle Investments\n®\n brands represent the combined capabilities, resources and reach of Columbia Management Investment Advisers, LLC (including its subsidiaries, “Columbia Management”), other U.S.-based entities and Threadneedle. The foreign operations of Ameriprise Financial, Inc. are conducted primarily through Columbia Threadneedle Investments UK International Limited, TAM UK International Holdings Limited and Ameriprise Asset Management Holdings Singapore (Pte.) Ltd. and their respective subsidiaries (collectively, “Threadneedle”).\nWe use our \nRiverSource\n®\n brand for our annuity and protection products issued by RiverSource Life Insurance Company (“RiverSource Life”) and RiverSource Life Insurance Co. of New York (“RiverSource Life of NY” and, together with RiverSource Life, the “RiverSource Life companies” or “RiverSource”).\nOur Segments - Advice & Wealth Management\nWe provide financial planning and advice, as well as full-service brokerage services, primarily to retail clients through our financial advisors. These services are centered on long-term, personal relationships between our advisors and our clients and focus on helping clients confidently achieve their financial goals. Our financial advisors provide a distinctive, holistic approach to financial planning and have access to a broad selection of both our and other providers’ products to help clients meet their financial needs and goals. Banking, lending, and cash management solutions help clients establish financial flexibility while planning for both short and long-term needs. As part of our goal-based approach to financial advice, our advisors help clients actively manage investing, saving and spending so they have a more complete financial picture. \n3\nIndex\nAmeriprise Financial, Inc.\nA significant portion of revenues in this segment are fee-based and driven by the level of client assets, which is impacted by both market movements and net flows. We also earn revenue and income through other sources, including the following:\n•\nWe earn net investment income on owned assets from Ameriprise Certificate Company (“ACC”) and Ameriprise Bank, both wholly owned subsidiaries of Ameriprise.\n•\nWe earn financial planning fees as well as transaction and other fees. \n•\nWe earn distribution fees for providing non-affiliated products and intersegment revenues for providing our affiliated products and services to our retail clients. Intersegment expenses for this segment include investment management services provided by our Asset Management segment. All intersegment activity is eliminated in our consolidated results.\nOur Financial Advisor Platform\nWith more than 10,000 advisors, we are one of the top branded advisor platforms in the U.S. market. Advisors can choose to affiliate with us in multiple ways as noted below, and each option offers different levels of support and compensation. \nWe offer the following products and services through our Advice & Wealth Management segment: \n•\nFinancial planning and advice services to provide personalized financial planning and financial solutions for which we charge fees and may receive sales commissions for selling products that aid in our clients’ plans. \n•\nDiscretionary and non-discretionary investment advisory accounts (also known as managed accounts) for which we receive fees based on the assets held in that account, as well as related fees or costs associated with the underlying securities held in that account. \n•\nBrokerage products and services for retail and institutional clients.\n•\nCash management and banking products, including brokerage sweep programs, cash management accounts, savings accounts, residential mortgage loans, credit cards, margin loans and pledged asset lines of credit.\n•\nFace-amount certificates through ACC. \n•\nMutual fund offerings from our Columbia funds as well as approximately 130 unaffiliated mutual fund families, representing approximately 2,125 mutual funds on our brokerage platform for which mutual fund families and other companies generally pay us a portion of the revenue generated from sales of those funds, administrative fees, and fees from the ongoing management attributable to our clients’ ownership in the fund.\n•\nInsurance and annuities products from both RiverSource Life companies as well as third parties, and we receive a portion of the revenue generated from the sale of unaffiliated products and certain administrative fees.\nOur Segments - Asset Management\nThrough Columbia Threadneedle, we provide investment management, advice and products to retail, high net worth and institutional clients on a global scale.\nColumbia Management primarily provides products and services in the U.S. Threadneedle primarily provides products and services internationally. \n4\nIndex\nAmeriprise Financial, Inc.\nRevenues in the Asset Management segment are primarily earned based on managed asset balances, which are impacted by market movements, net asset flows, asset allocation and product mix. We may also earn performance fees from certain accounts where investment performance meets or exceeds certain pre-identified targets. As of December 31, 2024, our Asset Management segment had $681 billion in managed and advised assets.\nOur Asset Management segment also provides asset management services for Ameriprise Financial subsidiaries. The fees for such services are reflected within the Asset Management segment results through intersegment transfer pricing. Intersegment expenses for this segment include distribution expenses for services provided by our Advice & Wealth Management and Retirement & Protection Solutions segments. All intersegment activity is eliminated in our consolidated results.\nManaged assets include external client assets and owned assets. Managed external client assets include client assets for which we provide investment management services, such as the assets of the \nColumbia Threadneedle Investments\n fund families and the assets of institutional clients. Managed external client assets also include assets managed by sub-advisers we select but do not include client assets that we advise on a non-discretionary basis such as those assets where we provide voting recommendations and engagement services but do not manage the underlying assets. Our external client assets are not reported on our Consolidated Balance Sheets, although certain investment funds marketed to investors may be consolidated at certain times. See Note 2 and Note 5 to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional information on consolidation principles and details regarding the consolidated collateralized loan obligations (“CLOs”). Managed owned assets include certain assets on our Consolidated Balance Sheets (such as the assets of the general account, cash balances invested by Ameriprise Bank and from certificate products, and the variable product funds held in the separate accounts of RiverSource Life companies) for which the Asset Management segment provides management services and receives management fees. For additional details regarding our assets under management and administration, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in Part II, Item 7 of this Annual Report on Form 10-K.\nInvestment Management Capabilities and Products\nOur investment management business has a presence in 16 key markets globally, including France, Germany, Luxembourg, the Netherlands, Singapore, the U.K. and the U.S. \nOur investment management capabilities and products span a broad range of asset classes and investment styles to meet a variety of client needs with our $645 billion in assets under management diversified across geographies, strategies and clients as depicted in the graphic below. \n5\nIndex\nAmeriprise Financial, Inc.\nWe offer or make available the following products and services through our Asset Management segment with a range of investment strategies across these different vehicles and accounts:\n•\nU.S. registered funds through the \nColumbia Management\n family of funds, including retail mutual funds, exchange-traded funds and U.S. closed-end funds and variable insurance trust funds (“VIT Funds”) on which we earn management fees based on the underlying value of the assets and service fees.\n•\nNon-U.S. retail focused funds through Columbia Threadneedle, which include different risk-return options across regions, markets, asset classes and product structures, including retail funds that are similar to U.S. mutual funds (such as Undertakings for the Collective Investment in Transferable Securities (“UCITS”) funds organized as Luxembourg-based investment companies with variable capital (“SICAVs”) and Irish and U.K. open-end investment companies (“OEICs”)). In addition, this also includes a range of listed Investment Trusts.\n•\nEuropean-based pooled investment funds designed for pensions, insurance companies and other institutional investors seeking solutions for liability or balance sheet asset management (“Liability Driven Investment” or “LDI”). \n•\nInstitutional and retail separately managed accounts for a range of clients, including pension, profit-sharing, employee savings, sovereign wealth funds and endowment funds, accounts of large- and medium-sized businesses and governmental clients, as well as the accounts of high net worth individuals and smaller institutional clients, including tax-exempt and not-for-profit organizations for which we receive management and performance-related fees.\n•\nOther separately managed accounts, including those offered through models that represent assets under advisement, for which we earn asset management fees based on model delivery assets under advisement. \n•\nManagement of owned assets such as assets held in the general account of our RiverSource Life companies, ACC and Ameriprise Bank. \n•\nManagement of CLOs, which includes providing collateral management services to special purpose vehicles that primarily invest in syndicated bank loans and issue multiple tranches of securities collateralized by the assets for which we earn fees based on the value of assets and performance-based fees.\n•\nPrivate funds of various types where we provide investment management and related services to private, pooled investment vehicles organized as limited partnerships, limited liability companies, or other entities for which we may receive fees based on the value of the assets or performance-based fees.\n•\nCollective funds and separately managed accounts sponsored by Ameriprise Trust Company (“ATC”), a wholly owned subsidiary, and offered to certain qualified institutional clients such as retirement, pension, and profit-sharing plans for which we receive management fees. \n•\nSub-advised accounts for certain U.S. and non-U.S. funds, private banking individually managed accounts, common trust funds, and other portfolios sponsored or advised by other firms for which we earn management fees and performance-based fees.\nDistribution\nWe maintain distribution teams and capabilities that aid the sales, marketing, and support of the products and services of our global asset management business. These distribution activities are generally organized into two major categories: retail distribution and institutional/high net worth distribution. However, alternatives and certain other areas have a level of specialized distribution.\nOur Segments - Retirement & Protection Solutions\nRiverSource solutions are available within the Ameriprise client experience and \nConfident Retirement\n®\n approach. We offer clients annuities, life insurance and disability income insurance products to meet their needs or current stage in life—whether that is covering essentials, ensuring lifestyle, preparing for the unexpected or leaving a legacy. RiverSource seeks to partner with our advisors to address clients’ goals and long-term needs at a differentiated level and provide a strong risk profile.\nRetirement Solutions\nThrough our advisors, we provide \nRiverSource\n annuity products to help clients address their asset accumulation and income goals. Our advisor network is the only distributor of new \nRiverSource\n annuity products, although our advisors offer fixed, variable, and structured annuities from selected unaffiliated insurers. As part of the continued evolution of the business model for our Retirement & Protection Solutions segment, we focus on the accumulation solutions clients want (such as the structured variable annuity, a registered index-linked annuity).\nRevenues for our variable annuity products are primarily earned as fees based on a contractholder’s benefit base, contract value or separate account values, which is impacted by both market movements and net asset flows. We also earn net investment income on general account assets supporting reserves for non-life contingent payout annuities, structured variable annuities, certain guaranteed benefits and fixed investment options offered with variable annuities, and on capital supporting the business. In addition, we receive fees charged on assets allocated to our separate accounts to cover administrative costs and a portion of the management fees from the underlying investment accounts in which assets are invested. Revenues for our payout annuities with a life contingent feature are earned as premium revenue. Intersegment revenues for this segment reflect fees paid by our Asset Management segment for marketing support and other services provided in connection with the availability of VIT Funds. Intersegment expenses for this segment include \n6\nIndex\nAmeriprise Financial, Inc.\ndistribution expenses for services provided by our Advice & Wealth Management segment, as well as expenses for investment management services provided by our Asset Management segment. All intersegment activity is eliminated in our consolidated results.\nProtection Solutions\nWe provide life and disability income insurance products to address the protection and risk management needs of our retail clients. New \nRiverSource\n insurance products are exclusively offered through our advisor network. Our advisors also offer insurance products of unaffiliated carriers. The primary sources of revenues for our protection business are premiums, fees, and charges we receive to assume insurance-related risk. We earn net investment income on owned assets supporting insurance reserves and on capital supporting the business. We also receive fees based on the level of the RiverSource Life companies’ separate account assets supporting variable universal life investment options. The protection products earn intersegment revenues from fees paid by our Asset Management segment for marketing support and other services provided in connection with the availability of VIT Funds under the variable universal life contracts. Intersegment expenses for the protection products include distribution expenses for services provided by our Advice & Wealth Management segment, as well as expenses for investment management services provided by our Asset Management segment. All intersegment activity is eliminated in our consolidated results.\nProducts\nWe currently offer the following RiverSource Life products:\n•\nVariable annuities that provide returns linked to underlying investments of the contractholder’s choice of certain funds, as well as additional benefits, such as guaranteed minimum death benefits (but without living benefits for new sales after mid-2022). \n•\nStructured variable annuities that use the performance of an underlying equity market index to determine earnings, subject to either a cap or floor. \n•\nVariable universal life insurance that provides life insurance coverage along with investment returns linked to underlying investment accounts of the policyholder’s choice. \n•\nUniversal life insurance that credits interest at fixed interest rates. Universal life insurance may also contain product features that credit interest at a rate linked to an underlying equity market index.  \n•\nTerm life insurance that provides a death benefit, but does not accumulate cash value. \n•\nDisability income insurance that provides monthly benefits to individuals who are unable to earn income either at their occupation at time of disability or at any suitable occupation for premium payments that are guaranteed not to change.\nOur sales of \nRiverSource\n individual life insurance in 2024, as measured by scheduled annual premiums, lump sum and excess premiums and single premiums, consisted of approximately 96% variable universal life, 1% universal life and 3% term life. \nReinsurance\nWe reinsure a portion of the insurance risks associated with our currently offered life and disability income products (as well as previously sold fixed annuity, fixed indexed annuity, life contingent payout annuity and long term care products) through reinsurance agreements with unaffiliated reinsurance companies. We use reinsurance to limit losses, reduce exposure to large risks and provide additional capacity for continued product offerings. To manage exposure to losses from reinsurer insolvencies, we evaluate the financial condition of reinsurers prior to entering into new reinsurance treaties and on a periodic basis during the terms of the treaties. Our RiverSource Life companies remain primarily liable as the direct insurers on all risks reinsured. See Note 7 and Note 8 to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional information on reinsurance. At a general level, we reinsure some or all of the following (with the closed blocks in our Corporate & Other segment):\nProduct\nReinsurance Type\nTerm Life and Disability Income\nCoinsurance\nUniversal Life & Variable Universal Life\nRenewable Term\nLife Contingent Payout Annuity\nCoinsurance\nFixed Annuity (closed block in Corporate & Other)\nCoinsurance\nLong Term Care (closed block in Corporate & Other)\nCoinsurance\nOur Segments - Corporate & Other\nOur Corporate & Other segment consists of closed blocks of business and net investment income or loss on corporate level assets, including excess capital held in our subsidiaries and other unallocated equity and other revenues as well as unallocated corporate expenses.\nClosed Block Long Term Care Insurance\nPrior to December 31, 2002, the RiverSource Life companies underwrote stand-alone long term care (“LTC”) insurance. We discontinued offering LTC insurance as of December 31, 2002. A large majority of our closed block LTC is comprised of nursing home indemnity LTC or comprehensive reimbursement LTC. Generally, our policyholders are eligible for LTC benefits if they become cognitively impaired or unable to perform certain activities of daily living.\n7\nIndex\nAmeriprise Financial, Inc.\nNursing home indemnity LTC policies provide a predefined daily benefit if the insured is confined to a nursing home, subject to various maximum benefit periods, regardless of actual expenses of the policyholder. Our older generation nursing home indemnity LTC policies were primarily written between 1989 through 1999 and represent nearly one half of our policies. \nComprehensive reimbursement LTC policies provide a predefined maximum daily benefit if the insured is confined to a nursing home and covers a variety of LTC expenses, including assisted living, home and community care, adult day care and similar placement programs, subject to various maximum total benefit payment pools, on a cost-reimbursement basis. Our second-generation comprehensive reimbursement LTC policies were written from 1997 until 2002. \nOur closed block of LTC policies was sold on a guaranteed renewable basis which allows us to re-price in force policies, subject to regulatory approval. Premium rates for LTC policies vary by age, benefit period, elimination period, home care coverage and benefit increase option. Premium rates are based on assumptions concerning morbidity, mortality, persistency, administrative expenses, investment income and profit. We develop our assumptions based on our own claims and persistency experience. In line with the market, we have pursued nationwide premium rate increases for many years and expect to continue to pursue rate increases over the next several years. In general, since very little of our LTC business is subject to rate stability regulation, we have historically followed a policy of pursuing smaller, more frequent increases in order to align policyholder and historic shareholder objectives but modified our approach in 2019 to seek larger increases as an additional method to manage our LTC business. We also provide policyholders with options to reduce their coverage to lessen or eliminate the additional financial outlay that would otherwise result. \nFor existing LTC policies, RiverSource Life has continued ceding 50% of the risk on a coinsurance basis to subsidiaries of Genworth Financial, Inc. (“Genworth”) and retains the remaining risk. For RiverSource Life of NY, this reinsurance arrangement applies for 1996 and later issues only. Under these agreements, we have the right, but never the obligation, to recapture some, or all, of the risk ceded to Genworth.\nFor more information regarding LTC, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Corporate & Other” included in Part II, Item 7 of this Annual Report on Form 10-K.\nClosed Block Fixed Annuities \nIn 2020, we discontinued new sales of fixed annuities and moved the Fixed Annuities and Fixed Indexed Annuities blocks to the Corporate & Other segment as a closed block. In this closed block, as of December 31, 2024, we have $5.7 billion of account value associated with our fixed annuities of which 89% has been ceded by RiverSource Life on a coinsurance basis to Global Atlantic Financial Group’s subsidiary Commonwealth Annuity and Life Insurance Company (“Commonwealth”) under customary reinsurance arrangements with a comfort trust. For the ceded policies, RiverSource Life ceded 100% of the risk on a coinsurance basis. \nCompetition\nWe operate in a highly competitive global industry. As a diversified financial services firm, we compete directly with a variety of financial institutions, including registered investment advisers, securities brokers, asset managers, banks and insurance companies. We directly compete for the provision of products and services to clients, as well as for our financial advisors and investment management personnel. Certain of our competitors offer web-based or mobile-based financial services and discount brokerage services, usually with lower levels of service, to individual clients, and we increasingly compete with various financial technology companies.\nOur Advice & Wealth Management segment competes with securities broker-dealers, independent broker-dealers, financial planning firms, registered investment advisers, insurance companies and other banks and financial institutions to attract and retain financial advisors and clients. Competitive factors influencing our ability to attract and retain financial advisors include compensation structures, brand recognition and reputation, product offerings and innovation, growth opportunities, and technology and service capabilities and support. Further, our financial advisors compete for clients with a range of other advisors, broker-dealers and direct channels. This includes wirehouses, regional broker-dealers, independent broker-dealers, insurers, banks, asset managers, registered investment advisers and direct distributors. Competitive factors influencing our ability to attract and retain clients include quality of advice provided, price, reputation, advertising and brand recognition, product offerings, technology offerings for clients and advisors and service quality.\nOur Asset Management segment competes on a global basis against a substantial number of firms to acquire and retain managed and administered assets, including firms in the categories listed above. Competitive factors influencing our performance in this industry include investment performance, product offerings and innovation, product ratings, fee structures, advertising, technology and service quality, brand recognition, reputation and the ability to attract and retain investment personnel. Furthermore, changes in investment preferences or investment management strategy (for example, “active” or “passive” investing styles), client interest in funds with particular environmental, social, or governance practices, client or regulatory requirements on use of client commissions for research, and downward pressure on fees may present various challenges to our business and could cause clients to favor certain competitors. The impact of these factors on our business may vary from country to country and certain competitors may have competitive advantage in certain jurisdictions. \nCompetitors of our Retirement & Protection Solutions segment consist of both stock and mutual insurance companies. Competitive factors affecting the sale of variable annuity and insurance products include distribution capabilities, price, product features and innovation, hedging capability, investment performance, commission structure, reinsurance availability and pricing, perceived \n8\nIndex\nAmeriprise Financial, Inc.\nfinancial strength and financial strength ratings, claims-paying ratings, technology and service, advertising, brand recognition and financial strength ratings from rating agencies.\nHuman Capital Management\nAmeriprise Financial has a strong values-driven and inclusive culture that is the foundation of all that we do. While our individual business lines serve different client needs, we have a common vision and values that drive our business and how we work with clients and each other. \nOur values are the following:\n•\nClient focused;\n•\nIntegrity always;\n•\nExcellence in all we do; and\n•\nRespect for the individuals and for the communities in which we live and work.\nTo ensure our long-term success, we must continue to attract, retain, engage and develop a high-performing workforce. We are committed to providing an excellent employee and advisor experience for our global workforce. This includes approximately 13,600 employees, including our corporate employees and employee financial advisors. We have approximately 8,200 non-employee advisors who choose to affiliate with us through our franchise advisor group. \nLeadership skills and development of all our employees are core to our culture and history. We continue to invest in the development of our leaders and employees with a comprehensive and modern learning strategy to help them grow and achieve their career potential at Ameriprise. We work closely with leaders to prioritize organizational stewardship, leadership excellence and operating effectiveness as we executed our business plans.\nWe continually invest in our human capital programs and capabilities to ensure a highly competitive employee value proposition. We seek to offer a comprehensive and competitive total rewards program that supports our employees in their overall financial and personal health and well-being. Our total rewards programs are designed to attract, retain, and motivate employees and align their pay outcomes to the achievement of the organization and business unit results, in addition to their individual performance. Weighing both individual goal achievement (the “what”) and leadership performance (the “how”) is critical to driving strong business results. We have a competitive total compensation approach that includes base salary, annual cash awards and long-term incentives, as well as a comprehensive benefits strategy for employees that focuses on physical, social, emotional and financial wellness. We have enhanced our employee value proposition and framework so that current and prospective employees better understand and appreciate the investments we make in them, including our culture, compensation and benefits, well-being, work environment and career development.\nOur Board of Directors engages in these topics and annually reviews our senior executive succession plans and broader talent development approach in support of our corporate strategy, and frequently discusses human capital topics at its meetings. The Board and the Compensation and Benefits Committee are regularly updated on topics impacting our workforce and dedicate time to reviewing and discussing our company culture, talent development, retention and recruiting initiatives, and engagement survey feedback.\nIn 2024, our strong corporate culture yielded the following results:\n•\nOur overall employee engagement remains strong at 84% favorable - exceeding external benchmarks with key strengths in the categories of integrity, leader effectiveness, respect, and client focus. Consistent with prior years, we had strong input with 93% of employees participating in the survey.\n•\nWe prioritize professional development, and in 2024, we introduced an enhanced learning curriculum to support leadership excellence across the firm. Over 90% of our global people leaders participated in these leadership development programs. In addition, we invested in a comprehensive modern learning platform for all employees to ensure they have access to relevant curriculum to help support their growth and career development, while still prioritizing our annual compliance training. \n•\nIn addition to recruiting talented professionals to join Ameriprise, we retained 95% of our high-performing employees. \n•\nWithin our advisor force, the retention rate among affiliated advisors who have been with us for more than 10 years remained strong at 94%. \n•\nWe have also continued to attract experienced, productive advisors, with 278 experienced advisors moving their practices to Ameriprise in 2024 and approximately 1,691 over the last 5 years.\nOur vision is to continue to foster an inclusive culture where everyone at Ameriprise can belong, grow and contribute to realize their potential and deliver value for our clients, community and shareholders. We ensure employees and advisors understand the goals and needs of our diverse client base and deliver on our value proposition to meet those needs. And we provide the tools, resources and leadership to support them. Our global workforce is comprised of 40% women and, among our U.S. based employees, 22% are ethnically diverse. In our Inclusion Index from our employee engagement survey, we achieved a score of 84% in 2024, which exceeds the industry benchmark.  \n9\nIndex\nAmeriprise Financial, Inc.\nOur focus on fostering an inclusive culture is also reflected in the policies and practices that promote a safe, inclusive and respectful workplace. Our 13 global business resource networks, with over 23,000 employee engagements, are open to everyone and provide opportunities for connection, community and career development, supporting business growth.\nIn an evolving and highly competitive industry, we have continued to successfully execute on our strategy while delivering solid performance, reflecting the strength and resiliency of our values-based, inclusive culture and the effectiveness of our human capital strategy.\nIntellectual Property\nWe rely on a combination of contractual rights and copyright, trademark, and patent registrations and trade secret laws to establish and protect our intellectual property. In the U.S. and other jurisdictions, we have established and registered, or filed applications to register, certain trademarks and service marks that we consider important to the marketing of our products and services, including but not limited to the \nAmeriprise Financial, Threadneedle, RiverSource, Columbia Threadneedle and Columbia Threadneedle Investments \nbrands. \nEnterprise Risk Management\nEnterprise risk management and our risk management program is an important component in how we manage our business. All operating subsidiaries of Ameriprise must comply with our enterprise risk management policy and framework, which: (i) establishes a structure for effective enterprise risk management, including oversight and governance; (ii) delineates key constituent roles and responsibilities; and (iii) imposes a number of core risk management processes. The enterprise risk management policy is designed to manage risks that may impact Ameriprise, including capital, credit, market, liquidity, operational, strategic, reputational, legal and compliance, and product. The enterprise risk management policy is supported by underlying risk policies at business units that provide further detail on the business unit’s risk governance, appetite, and tolerance. \nRegulation\nVirtually all aspects of our business, including the activities of our parent company and subsidiaries, are subject to various federal, state, local and foreign laws and regulations. These laws and regulations provide broad regulatory, administrative and enforcement powers to supervisory agencies and other bodies, including U.S. federal and state regulatory and law enforcement agencies, foreign government agencies or regulatory bodies and U.S. and foreign securities exchanges. The costs of complying with such laws and regulations are significant and increasing, and the consequences for failing to comply may include civil or criminal charges, fines, censure, the suspension of individual employees, restrictions on or prohibitions from engaging in certain lines of business (or in certain states or countries), revocation of certain registrations and reputational damage. We have made and expect to continue to make significant investments in our compliance and supervision processes, enhancing policies, procedures and oversight to monitor our compliance with the many legal and regulatory requirements applicable to our business.\nWe operate in a highly scrutinized regulatory environment that remains subject to change. Regulatory developments, both in and outside of the U.S., have resulted or are expected to result in greater regulatory oversight and internal compliance obligations for firms across the financial services industry. We expect the current U.S. administration will seek to implement a regulatory reform agenda that is significantly different from that of the previous administration, impacting the rulemaking, supervision, examination and enforcement priorities of the federal regulators and agencies. In addition, we continue to see enhanced legislative and regulatory interest regarding retirement investing and fiduciary initiatives, as well as environmental, social and governance (“ESG”) consideration and responsible investing; cybersecurity and resilience; the use of artificial intelligence; responsible information and data collection, storage and use; financial crime prevention; and privacy matters, and we will continue to closely review and monitor any legislative or regulatory proposals and changes. For example, the enacted European Union (“EU”) Artificial Intelligence (“AI”) Act and proposed U.S. laws on AI are likely to influence how financial services firms design, build and deploy products and services incorporating AI, and process non-personal data. States in the U.S. and jurisdictions outside the U.S. continue to add new complexity to the patchwork of laws and regulations already in existence relating to privacy, cybersecurity, artificial intelligence and other areas, and we expect this to continue at the federal and state level. Similar complexity resulting from multiple standards exists for retirement investing where individual states and federal regulators continue to propose or enact their own rules. These legal and regulatory changes have impacted and may in the future impact how we are regulated and how we operate and govern our businesses.\nThe discussion and overview set forth below provides a general framework of the primary laws and regulations impacting our businesses. Certain of our subsidiaries may be subject to one or more elements of this regulatory framework depending on the nature of their business, the products and services they provide and the geographic locations in which they operate. To the extent the discussion includes references to statutory and regulatory provisions, it is qualified in its entirety by reference to these statutory and regulatory provisions and is current only as of the date of this report.\n10\nIndex\nAmeriprise Financial, Inc.\nAdvice & Wealth Management Regulation\nCertain of our subsidiaries are registered with the  U.S. Securities and Exchange Commission (“SEC”) as broker-dealers under the Securities Exchange Act of 1934 (“Exchange Act”) and with certain states, the District of Columbia and other U.S. territories. Our broker-dealer subsidiaries are also members of self-regulatory organizations, including the Financial Industry Regulatory Authority (“FINRA”), and are subject to the regulations of these organizations. The SEC and FINRA have stringent rules with respect to the net capital requirements (which includes rules around customer protection) and the marketing and trading activities of broker-dealers. Our broker-dealer subsidiaries, as well as our financial advisors and other personnel, must obtain all required state and FINRA licenses and registrations to engage in the securities business and take certain steps to maintain such registrations in good standing. SEC regulations also impose notice requirements and capital limitations on the payment of dividends by a broker-dealer to a parent, and they have proposed regulations regarding cybersecurity programs and the public reporting of incidents impacting broker-dealers like ours.\n11\nIndex\nAmeriprise Financial, Inc.\nOur financial advisors are representatives of a dual registrant, meaning it is registered both as an investment adviser under the Investment Advisers Act of 1940 (“Advisers Act”) and as a broker-dealer. Our advisors are subject to various regulations that impact how they operate their practices, including those related to supervision, sales methods, trading practices, information security, record-keeping and financial reporting. In addition, because our independent contractor advisor platform is structured as a franchise system, we are also subject to Federal Trade Commission and state franchise requirements. We continue to see enhanced legislative and regulatory interest regarding investing and financial advisors, including proposed rules, regulatory priorities or general discussions around transparency and disclosure in advisor compensation and recruiting, identifying and managing conflicts of interest and enhanced data collection.\nThe SEC’s Regulation Best Interest standard of care became effective June 30, 2020 and the SEC continues to issue various statements and other guidance on complying with the regulation. Furthermore, several states have either issued their own best interest or fiduciary rules or are considering doing so and those rules may be limited to certain types of products (e.g., insurance and annuities, financial planning, etc.) or may broadly cover all recommendations made by financial advisors. The U.S. Department of Labor (“DOL”) finalized its voluntary exemption for providing investment advice to retirement account clients and has reinstated prior guidance for determining who is an investment advice fiduciary under pension regulations. The DOL finalized a new regulation expanding the definition of investment advice fiduciary, but that regulation has been stayed by the courts. While not a regulator, the Certified Financial Planner Board professional standards of conduct includes a fiduciary standard that applies to financial advisors who hold a Certified Financial Planner designation. Considering the various fiduciary rules and regulations that continue to be proposed, finalized, and sometimes withdrawn or amended, we continue to exert significant efforts to evaluate and prepare to comply with each rule. \nOther agencies, exchanges and self-regulatory organizations of which certain of our broker-dealer subsidiaries are members, and subject to applicable rules and regulations of, include the Commodities Futures Trading Commission (“CFTC”) and the National Futures Association (“NFA”). Certain subsidiaries may also be registered as insurance agencies and may be subject to the regulations described in the following sections.\nAsset Management Regulation\nU.S. Regulation\nCertain of our asset management subsidiaries are registered as investment advisers under the Advisers Act and are subject to regulation by the SEC. The Advisers Act imposes numerous obligations on registered investment advisers, including fiduciary duties, disclosure obligations and record-keeping, and operational and marketing restrictions. Our registered investment advisers may also be subject to certain obligations of the Investment Company Act based on their status as investment advisers to U.S. registered investment companies that we, or third parties, sponsor. As noted earlier, we continue to see enhanced legislative and regulatory interest regarding financial services in the U.S. through rules, regulatory priorities or general discussion. This trend is especially true globally where regulators remain active, including in Europe. Any future regulation could potentially require new approaches which increase our regulatory burdens and costs.\nMany aspects of the regulation that applies to our Advice & Wealth Management segment also apply to our Asset Management segment. For example, Columbia Management Investment Distributors, Inc., a wholly owned subsidiary, is registered as a broker-dealer for the limited purpose of acting as the principal underwriter and distributor for \nColumbia Management\n funds and other products. Additionally, the Employee Retirement Income Security Act of 1974, as amended (“ERISA”), the SEC’s best interest standards, state and other fiduciary or best interest rules, as well as other similar standards and any rulemaking from the DOL would be relevant to our global asset management business. We continue to review and analyze the potential impact of these regulations across each of our business lines.\nIn addition, certain of our asset management subsidiaries are registered with the CFTC as a commodity trading advisor and commodity pool operator and are also members of the NFA. In this regard, we are subject to additional registration and reporting requirements with respect to certain registered investment companies and other pooled vehicles that use or trade in futures, swaps and other derivatives that are subject to CFTC regulation.\nU.K. Regulation\nOutside of the U.S., Columbia Threadneedle is authorized to conduct its financial services business in the U.K. under the Financial Services and Markets Act 2000. A number of legal entities in the\n Columbia Threadneedle\n business are currently regulated by the Financial Conduct Authority (“FCA”) and one entity in the \nColumbia Threadneedle\n business is also regulated by the Prudential Regulation Authority (“PRA”). FCA and PRA rules impose certain capital, operational and compliance requirements and allow for disciplinary action in the event of noncompliance. As with the U.S. regulatory environment, we continue to see enhanced legislative and regulatory interest regarding financial services. Key U.K. regulatory developments and trends include the following:\n•\nOperational Resilience:\n Under this new U.K. regulatory requirement, in scope firms must identify their important business services, which, if unavailable, could cause intolerable harm to clients, which they could not reasonably recover, or market disruption. The regulations introduce a new concept of impact tolerance and firms are also required to stress test their important business services and appoint a senior manager accountable for the regime.\n12\nIndex\nAmeriprise Financial, Inc.\n•\nFinancial Resilience:\n U.K. regulators have revised the prudential regime applying to asset managers. This is being phased in over a five-year period and introduces a number of new capital requirements.\n•\nFCA Consumer Duty:\n The FCA recently introduced a new Consumer Duty that sets higher expectations for the standard of care that firms provide to retail consumers.\n•\nSustainability Disclosure Requirements\n: The FCA recently finalized new requirements that have started to take effect relating to new sustainability product labels, naming and marketing rules, additional ESG disclosure requirements both at an entity and product level, and an anti-greenwashing rule covering client communications.\n•\nDiversity, Equity and Inclusion\n: The FCA recently launched a consultation on a potential new regulatory framework on diversity and inclusion in the financial sector. The consultation also incorporated additional proposed rules around firms’ handling of non-financial misconduct in the context of adherence to the FCA’s conduct and fitness and propriety regimes.\nOur U.K. asset management business must comply with local EU and country requirements as a non-EU firm, which includes leveraging our various EU-based affiliated entities (such as those in Luxembourg and the Netherlands) to provide services and marketing to EU clients and investors. We have an established fund range domiciled in Luxembourg (both UCITS and Alternative Investment Funds), Ireland and the Netherlands, along with Luxembourg-based and Netherlands-based affiliated management companies. Our Luxembourg and Netherlands affiliates may perform fund management, administration and distribution functions. Therefore, we are well placed to continue to serve investors in the EU. \nPan-European and Other Non-U.S. Regulation\nIn addition to the above, certain of our asset management subsidiaries and branches are required to comply with pan-European directives as issued by the European Commission and adopted by EU member states. Certain of these directives have impacted and will continue to impact our global asset management business. For example, certain of our asset management subsidiaries are required to comply with the Markets in Financial Instruments Directive (“MiFID II”), the Alternative Investment Fund Managers Directive (“AIFMD”), the European Market Infrastructure Regulation (“EMIR”), UCITS, the Sustainable Finance Disclosure Regulation (“SFDR”) and the Packaged Retail and Insurance-based Investment Products Regulation (“PRIIPs”).  These requirements impact the way we manage assets and place, settle and report on trades for our clients, as well as market to clients and prospects. Similar to the developments in the U.S., we continue to see enhanced legislative and regulatory interest regarding financial services through international markets, including in the U.K. and EU where we have a substantial asset management business. These international rules, proposed rules, regulatory priorities or general discussions may impact us directly or indirectly, including as a regulated entity or as a service provider to, or a business receiving services from or engaging in transactions with, regulated entities. In addition to regulations noted in this section, within the EU and the U.K. we have been and will continue to address regulatory reforms or structural changes including but not limited to: Consumer Composite Investments, Retail Investment Strategy, AIFMD 2.0,\n \nEMIR 3.0\n,\n SFDR 2.0, Digital Operational Resilience Act (“DORA”), Corporate Sustainability Reporting Directive (“CSRD”), and Corporate Sustainability Due Diligence Directive (“CSDDD”). In addition , although the U.K. is not a part of the EU, the U.K. regulators may choose to implement future EU regulations and apply them in the U.K. potentially with significant variation from the EU regulations and potentially increasing the complexity and costs for our compliance with divergent sets of rules.\nColumbia Threadneedle \ncompanies or activities are also subject to various local country or jurisdiction regulations and to corresponding regulators in Europe, Canada, Dubai, Hong Kong, Singapore, South America and Australia. With our growth in the EU, we have (and will continue to have) greater engagement with the Luxembourg, Irish and Dutch regulators. \nOther Securities Regulation\nACC is regulated as an investment company under the Investment Company Act. As a registered investment company, ACC must observe certain governance, disclosure, record-keeping, operational and marketing requirements. Ameriprise Certificate Company pays dividends to the parent company and is subject to capital requirements under applicable law and understandings with the SEC and the Minnesota Department of Commerce (“MN DOC”) (Banking Division).\nATC is primarily regulated by the MN DOC (Banking Division) and is subject to capital adequacy requirements under Minnesota law. It is prohibited from accepting deposits or making personal or commercial loans. As a provider of products and services to tax-qualified retirement plans and IRAs, certain aspects of our business, including the activities of our trust company, fall within the compliance oversight of the DOL and the Department of Treasury, particularly regarding the enforcement of ERISA, and the tax reporting requirements applicable to such accounts. ATC, as well as our investment adviser subsidiaries, may be subject to ERISA, and the regulations thereunder, insofar as they act as a “fiduciary” under ERISA with respect to certain ERISA clients.\nInsurance Regulation\nOur insurance subsidiaries are subject to supervision and regulation by states and other territories where they are domiciled or otherwise licensed to do business. These regulations impact our Retirement & Protection Solutions segment and our closed blocks included in Corporate & Other segment. The primary purpose of this regulation and supervision is to protect the interests of contractholders and policyholders. In general, state insurance laws and regulations govern standards of solvency, capital requirements, the licensing of insurers and their agents, premium rates, policy forms, the nature of and limitations on investments, periodic reporting requirements and other matters. In addition, state regulators conduct periodic examinations into insurer market conduct and \n13\nIndex\nAmeriprise Financial, Inc.\ncompliance with insurance and securities laws. RiverSource Life Insurance Company is domiciled in Minnesota and regulated by the MN DOC and RiverSource Life Insurance Co. of New York is domiciled in New York and regulated by the New York State Department of Financial Services (“NY DFS”), and together with MN DOC are the “Domiciliary Regulators”. In addition to being regulated by their Domiciliary Regulators, our RiverSource Life companies are regulated by each of the insurance regulators in the states where each is authorized to transact business. Financial regulation of our RiverSource Life companies is extensive, and their financial transactions (such as intercompany dividends and investment activity) may be subject to pre-approval and/or continuing evaluation by the Domiciliary Regulators.\nAspects of the regulation applicable to our Advice & Wealth Management segment also apply to our Retirement & Protection Solutions segment and the closed blocks in our Corporate & Other segment. For example, RiverSource Distributors, Inc., a wholly owned subsidiary, is registered as a broker-dealer for the limited purpose of acting as the principal underwriter and/or distributor for our \nRiverSource\n annuities and insurance products sold through Ameriprise Financial Services, LLC (“AFS”), a wholly owned subsidiary, and third-party channels. Additionally, ERISA, the SEC’s best interest standards, state and other fiduciary or best interest rules, as well as other similar standards and any rulemaking from the DOL are relevant to our insurance and annuities business or products. We continue to review and analyze the potential impact of these regulations across each of our business lines.\nAll states require participation in insurance guaranty associations, which assess fees (subject to statutory limits) to insurance companies in order to fund claims of policyholders and contractholders of insolvent insurance companies. These assessments are generally based on a member insurer’s proportionate share of all premiums written by member insurers in the state during a specified period prior to an insurer’s insolvency. See Note 26 to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional information regarding guaranty association assessments.\nCertain variable annuity and variable life insurance contracts offered by the RiverSource Life companies, and certain separate accounts supporting such contracts, constitute and are registered as securities under the Securities Act of 1933 and as investment companies under the Investment Company Act of 1940, as amended. As such, these products are subject to regulation by the SEC and FINRA. \nThe Federal Insurance Office (“FIO”) within the U.S. Department of Treasury does not have substantive regulatory responsibilities, though it is tasked with monitoring the insurance industry and the effectiveness of its regulatory framework in addition to providing periodic reports to the President of the U.S. and Congress. We monitor the FIO’s activity to identify and assess emerging regulatory priorities with potential application to our business.\nEach of our insurance subsidiaries is subject to risk-based capital (“RBC”) requirements designed to assess the adequacy of an insurance company’s total adjusted capital in relation to its investment, insurance and other risks. The National Association of Insurance Commissioners (“NAIC”) has established RBC standards that all state insurance departments have adopted. The RBC requirements are used by the NAIC and state insurance regulators to identify companies that merit regulatory actions designed to protect policyholders. The NAIC RBC report is completed as of December 31 and filed annually, along with the statutory financial statements. \nOur RiverSource Life companies would be subject to various levels of regulatory intervention if their total adjusted statutory capital falls below defined RBC action levels. At the “company action level,” defined as total adjusted capital level between 100% and 75% of the RBC requirement, an insurer must submit a plan for corrective action with its primary state regulator. The level of regulatory intervention is greater at lower levels of total adjusted capital relative to the RBC requirement. \nRiverSource Life and RiverSource Life of NY maintain capital levels well in excess of the company action level required by state insurance regulators as noted below as of December 31, 2024:\nEntity\nCompany Action Level RBC\nTotal Adjusted Capital\n% of Company Action Level RBC\n(in millions, except percentages)\nRiverSource Life\n$\n489 \n$\n2,700 \n552 \n%\nRiverSource Life of NY\n38 \n219 \n579 \n%\nAmeriprise Financial, as a direct and indirect owner of its insurance subsidiaries, is subject to the insurance holding company laws of Minnesota and New York (the states where its insurance subsidiaries are domiciled). These laws generally require insurance holding companies to register with the insurance department of the insurance company’s state of domicile and to provide certain financial and other information about the operations of the companies within the holding company structure.\nAs part of its Solvency Modernization Initiative, in 2010 the NAIC adopted revisions to its Insurance Holding Company System Regulatory Act (“Holding Company Act”) to enhance insurer group supervision and create a new Risk Management and Own Risk and Solvency Assessment (“ORSA”) Model Act. The Holding Company Act revisions focus on the overall insurance holding company system, establish a framework of regulator supervisory colleges, enhancements to corporate governance, and require the annual filing of an Enterprise Risk Management Report. The ORSA Model Act requires that an insurer create and file, annually, its ORSA, which is a complete self-assessment of its risk management functions and capital adequacy. These laws were enacted by the  \n14\nIndex\nAmeriprise Financial, Inc.\nDomiciliary Regulators. We complete and file these reports as required by the laws and regulations of those states. Insurance regulation and supervision also goes beyond direct regulation of our insurance companies in other ways.  For example, while we are now subject to the FRB’s “Building Block Approach” (discussed below in more detail), once Minnesota implements the NAIC’s “Group Capital Calculation,” a new capital calculation will exist for many insurance companies like ours that are not subject to the FRB regulation as we are. And from time to time, we must report other enterprise activities to our state insurance regulators (such as the NAIC’s Liquidity Stress Testing Framework).\nFederal Banking and Financial Holding Company Regulation\nAmeriprise Bank is subject to regulation by the Office of the Comptroller of the Currency (“OCC”), which is the primary regulator of federal savings banks, the Consumer Financial Protection Bureau (“CFPB”) and by the Federal Deposit Insurance Corporation (“FDIC”) in its role as insurer of Ameriprise Bank's deposits. As a federally chartered savings bank, Ameriprise Bank is subject to numerous rules and regulations governing all aspects of the banking business, including lending practices and transactions with affiliates. Ameriprise Bank is also subject to specific capital rules and limits on capital distributions, including payment of dividends. If Ameriprise Bank's capital falls below certain levels, the OCC would be required to take remedial actions and could take other actions, including imposing further limits on dividends or business activities. In addition, an array of Community Reinvestment Act (“CRA”), fair lending and other consumer protection laws and regulations apply to Ameriprise Bank. \nAs the controlling company of Ameriprise Bank, Ameriprise Financial is a savings and loan holding company that is subject to regulation, supervision, and examination by the FRB. Ameriprise Financial has elected to be classified as a financial holding company subject to applicable regulation under the Bank Holding Company Act of 1956 (the “Bank Holding Company Act”). Further, FRB regulation and supervisory oversight of Ameriprise Financial includes examinations, regular financial reporting, and prudential standards, such as capital, liquidity risk management, and parameters for business conduct and internal governance.\nUnder the Bank Holding Company Act, bank holding companies and their banking subsidiaries are generally limited to the business of banking and activities closely related or incidental to banking, and going beyond these activities would require a conformance period request from the FRB. As a financial holding company, we may engage in activities that are financial in nature, incidental to an activity that is financial in nature, or complementary to a financial activity and that do not pose a substantial risk to the safety and soundness of depository institutions or the financial system generally. We may not, however, directly or indirectly acquire the ownership or control of more than 5% of any class of voting shares, or substantially all of the assets, of either a bank holding company (or a bank) without the prior approval of the FRB or of a non-financial company absent an available exemption.\nIn order to maintain our status as a financial holding company, Ameriprise Bank, as our sole insured depository institution subsidiary, must remain “well-capitalized” and “well-managed” under applicable regulations, and must receive at least a “satisfactory” rating in its most recent examination under the CRA. In addition, Ameriprise, as a financial holding company, must remain “well-capitalized” and “well-managed” in order to maintain its status as a financial holding company. Failure to meet one or more of these requirements would mean, depending on the violation and any agreement then reached with the FRB, Ameriprise Financial could not undertake new activities, continue certain activities or make acquisitions other than those generally permissible for bank holding companies until such violation is cured.\nWe are subject to what is commonly referred to as the Volcker Rule. The Volcker Rule prohibits “banking entities,” including Ameriprise and our affiliates, from engaging in certain “proprietary trading” activities, as defined in the Volcker Rule, subject to exemptions for underwriting, market-making-related activities, asset management, risk-mitigating hedging and certain other activities. The Volcker Rule also prohibits certain investments and relationships by banking entities with “covered funds,” with a number of exemptions and exclusions. It also requires banking entities to have comprehensive compliance programs reasonably designed to ensure and monitor compliance with the Volcker Rule.\nAmeriprise Financial reports to the FRB under a consolidated capital framework termed the “Building Block Approach” (“BBA”) for savings and loan holding companies that are significantly engaged in insurance activities (commonly referred to as insurance savings and loan holding companies). In general, under the rule, insurance savings and loan holding companies like us are required to aggregate state-based insurance capital requirements with banking capital requirements for non-insurance businesses to satisfy specific minimum total requirements and hold an additional capital conservation buffer. The ratio of the amount of available capital to the capital requirement amount is referred to as the BBA ratio and is subject to a 250% minimum, effective January 1, 2024. An additional capital conservation buffer of 150% will be effective as of December 31, 2025, for a total capital requirement of at least 400%.\nThe BBA available capital, BBA capital requirement, and BBA ratio as of December 31, 2024  are as follows:\n(in millions, except percentages)\nBBA available capital\n$\n3,833 \nBBA capital requirement\n392 \nBBA ratio\n978 \n%\n15\nIndex\nAmeriprise Financial, Inc.\nAdditional Parent Company Regulation and Other Regulation\nWe are a publicly traded company subject to SEC and New York Stock Exchange (“NYSE”) rules and regulation and have operations in a number of geographical regions across the U.S. and outside of the U.S. Certain states enact regulations or requirements that can drive enterprise-wide action or disclosures. We evaluate these laws and changes to understand if and when they impact our business, such as the laws in California requiring certain climate-related disclosure. As an international company, we continuously monitor developments in EU legislation, as well as in the other markets in which we operate, to ensure that we comply with all applicable legal requirements, including EU directives applicable to financial institutions as implemented in the various member states. Because of the mix of business activities we conduct, we assess the impact of, and monitor our status under, the EU Financial Conglomerates Directive, which contemplates global supervision and prudential regulation of certain financial conglomerates involved in banking, insurance and investment activities. \nPrivacy, Environmental and Anti-Money Laundering Laws \nMany aspects of our business are subject to comprehensive legal requirements concerning the use and protection of personal information, including client and employee information, from a multitude of different functional regulators and law enforcement bodies. This includes rules adopted pursuant to the Gramm-Leach-Bliley Act, the Fair and Accurate Credit Transactions Act, the Health Insurance Portability and Accountability Act (“HIPAA”), as amended by the Health Information Technology for Economic and Clinical Health (“HITECH”) Act, an ever increasing number of state laws and regulations such as the NY DFS’ Cybersecurity Requirements for Financial Services Companies, and California privacy legislation, as recently amended, EU data protection legislation, known as the Global Data Protection Regulation (“GDPR”), as implemented in the respective EU member states, the U.K. Data Protection Act, 2018 and U.K. GDPR, and data protection rules in other regions in which we operate outside the U.S. and the EU. We have also implemented policies and procedures in response to such requirements. We continue our efforts to safeguard the data entrusted to us in accordance with applicable laws and our internal data protection policies, including taking steps to reduce the potential for identity theft or other improper use or disclosure of personal information, while seeking to collect only the data that is necessary to properly achieve our business objectives and best serve our clients. To the extent we do experience an incident, we have developed and implemented a cybersecurity incident response manual, which we regularly exercise and update, as appropriate.\nAs the owner and operator of real property, we are subject to federal, state, local and foreign environmental laws and regulations. We periodically conduct certain air and water reviews on our own real estate as well as investment real estate to assess and support our compliance with these laws and regulations.\nThe Uniting and Strengthening America by Providing Appropriate Tools Required to Intercept and Obstruct Terrorism Act, commonly referred to as the USA Patriot Act, was enacted in October 2001. It substantially broadened existing anti-money laundering legislation and the extraterritorial jurisdiction of the U.S. In response, we enhanced our existing anti-money laundering programs and developed new procedures and programs, including enhancing our “know your customer” and “due diligence” programs. We continuously review, update and enhance our anti-money laundering procedures and programs. In addition, we will continue to comply with anti-money laundering legislation in the U.K. derived from applicable EU directives and international initiatives adopted in other jurisdictions in which we conduct business.\nExchange Act Reports and Additional Information\nWe maintain an Investor Relations website at ir.ameriprise.com. Investors can also access the website through our main website at ameriprise.com by clicking on the “Investor Relations” link located at the bottom of our homepage (ameriprise.com). We use our Investor Relations website to announce financial and other information to investors and to make available SEC filings, press releases, public conference calls, other communications and webcasts. Investors and others interested in the Company are encouraged to visit the Investor Relations website from time to time, as information is frequently updated and posted. Additionally, users can sign up to receive automatic notifications when new materials are posted. The information found on the website is not incorporated by reference into this report or in any other report or document we furnish or file with the SEC."
}