{
  "ticker": "AON",
  "cik": "0000315293",
  "company_name": "Aon plc",
  "filing_date": "2025-02-18",
  "accession": "0001628280-25-006093",
  "primary_doc": "aon-20241231.htm",
  "item1_text": "Item 1.    Business\nOVERVIEW\nAon plc (which may be referred to as “Aon,” the “Company,” “we,” “us,” or “our”) is a leading global professional services firm providing a broad range of Risk Capital and Human Capital solutions. Through our experience, global reach, and comprehensive analytics, we help clients meet rapidly changing, increasingly complex, and interconnected challenges related to risk and people. We are committed to accelerating innovation to address unmet and evolving client needs so that our clients are better informed, better advised, and able to make better decisions to protect and grow their business. Management remains focused on strengthening Aon and uniting the firm through its Aon United strategy, with capabilities delivered through Risk Capital and Human Capital and enabled by data and analytics to deliver additional insight, connectivity, and efficiency.\nOur clients are in over 120 countries and include all market segments and almost every industry. This diversification of our customer base helps provide us stability in different economic scenarios that could affect specific industries, customer segments, or geographies.\nWe have continued to focus our portfolio on higher-margin, capital-light professional services businesses that have high recurring revenue streams and strong cash flow generation. We endeavor to make capital allocation decisions in order to maximize value for Aon and its shareholders.\nBUSINESS SEGMENTS\nThe Company formerly operated as one reportable segment under Aon United, which included all of Aon’s operations. Beginning in the fourth quarter of 2024, the CODM assesses the performance of the Company and allocates resources based on two segments: Risk Capital and Human Capital. This segmentation will align with how the Company addresses client needs, accelerating its Aon United strategy and maximizing value for Aon and its shareholders. Differences between the reportable segments’ results and Aon’s consolidated results include certain inter-segment revenues, as well as unallocated expenses. Prior period comparative segment information has been recast to conform with current year presentation, which reflects the way our CODM internally receives information and manages and monitors our reportable operating segment performance. The accounting policies of the reportable segments are the same as those described in Note 2 “Summary of Significant Accounting Principles and Practices.”\nIn 2024, our consolidated Total revenue was $15,698 million. This includes $10,517 million in Risk Capital and $5,209 million in Human Capital before certain intercompany eliminations.\nPrincipal Products and Services\nRisk Capital\nCommercial Risk Solutions \nuses Risk Capital’s extensive data and analytics capabilities to provide brokerage and consulting services that help organizations develop, improve, and implement their risk management strategies. Commercial Risk Solutions includes insurance and specialty brokerage, global risk consulting, captives management, and Affinity programs. In insurance brokerage, our dedicated teams of risk professionals utilize comprehensive analytics to design strategically resilient insurance programs and provide our clients access to Aon’s proprietary facilities, such as Aon Client Treaty and all other forms of capital, regardless of insurance carrier, placement structure or geography. Throughout the year, we review analytics specific to clients’ losses and exposures, and we evaluate new risk transfer techniques to be considered in the current market conditions. Commercial Risk Solutions is organized around industry and product, including but not limited to property, casualty, financial and professional lines, construction, transportation, energy, cyber, surety, trade credit, crisis management, transaction liability, and climate. Aon’s Global Risk Consulting and Captive Management teams use quantitative analytics to advise on the trade-offs between risk retention and risk transfer as well as to provide claims consulting and advocacy to ensure optimal financial recovery. Aon’s Affinity business collaborates with sponsored groups and other distribution channels to develop, market, and administer customized insurance programs. Commercial Risk’s global reach enables seamless client service in all geographies including Aon’s Global Broking Centers in London, Bermuda and Singapore.\nReinsurance Solutions\n includes treaty reinsurance, facultative reinsurance, Strategy and Technology Group and capital markets. Treaty reinsurance addresses underwriting and capital objectives on a portfolio level, allowing our clients to more effectively manage the combination of premium growth, return on capital, and rating agency interests on an integrated basis. This includes the development of more competitive, innovative, and efficient risk transfer options. Facultative reinsurance empowers clients to better understand, manage, and transfer risk through innovative facultative solutions and provides the most efficient access to the global facultative reinsurance markets. Strategy and Technology Group combines strategic advice with \n5\ndata-driven consulting, analytics, and modeling tools, including Tyche, ReMetrica, and PathWise, to help clients deploy capital efficiently and effectively. We develop highly customized solutions, enabled by innovative technology, that help clients drive growth and operational efficiency, improve balance sheet strength and resiliency, and comply with regulatory and operational requirements, including through the execution of reinsurance transactions. Capital markets is a global investment bank with expertise in insurance-linked securities, capital raising, strategic advice, restructuring, and mergers and acquisitions. We partner with insurers, reinsurers, investment firms, and corporations in executing innovative risk management products, capital market solutions and corporate finance advisory services.\nHuman Capital\nHealth Solutions \nincludes consulting and brokerage, consumer benefits, and talent advisory services. Consulting and brokerage develops and implements innovative, customized health and benefits strategies for our clients to manage risk, drive engagement, and strengthen their workforce through improved health and wellbeing. We partner with insurers and other strategic partners to develop and implement new and innovative solutions and leverage world-class analytics and technology to help clients make informed decisions and manage healthcare outcomes. Consulting and brokerage also advises multinational companies on global benefits programs, including program design and management, financing optimization, and enhanced employee experience, as well as assists in navigating global regulatory and compliance requirements in over 120 countries. Consumer benefits solutions designs and delivers innovative voluntary consumer benefits programs that improve an employer’s total rewards strategy and positively impacts their employees’ financial and overall wellbeing. We leverage our proprietary digital platform to provide efficient enrollment strategies through an effective combination of data, analytics, and tailored products. Our talent team delivers data, analytics, and advice to business leaders so they can make better workforce decisions and align their business and people strategies. We support clients across the full employee lifecycle, including talent assessment and selection, compensation benchmarking, total rewards strategy optimization, Corporate Governance, ESG consulting, and strategic employee communications.\nWealth Solutions \nincludes retirement consulting, pension administration, and investments consulting. Retirement consulting provides clients strategic design advice, actuarial services, risk management solutions including pension risk transfer, and integrated pension administration. We also help organizations manage their balance sheet volatility. Our investments advisory team provides corporations, public pensions, endowments and foundations with advice on developing and maintaining investment programs across a broad range of plan types, including defined benefit plans, defined contribution plans and Master Trusts. Our delegated investment solutions provide ongoing management of investment programs in both partial or full discretionary models. We partner with clients leveraging our expertise and scale to help them effectively manage their investment portfolio.\nRevenue and Compensation\nOur business generates revenues primarily through commissions, compensation from insurance and reinsurance companies for services we provide to them, and fees from customers. Commissions and fees for brokerage services vary depending upon several factors, which may include the amount of premium, the type of insurance or reinsurance coverage provided, the particular services provided to a client, insurer, or reinsurer, and the capacity in which we act. Compensation from insurance and reinsurance companies includes: (1) fees for consulting and analytics services, and (2) fees and commissions for administrative and other services provided to or on behalf of insurers and reinsurers. Fees from clients for advice and consulting services are dependent on the extent and value of the services we provide. Payment terms are consistent with current industry practices.\nFunds Held on Behalf of Clients\nWe typically hold funds on behalf of clients, including premiums received from clients and claims due to clients that are in transit to and from insurers. Certain funds held on behalf of clients are invested in interest-bearing premium trust accounts and can fluctuate significantly depending on when we collect and remit cash. The principal is segregated and not available for general operating purposes, although we may earn interest on these accounts.\nCompetition\nOur business operates in a highly competitive and fragmented environment. We compete with numerous other global insurance brokers and consulting companies, including, among others, Marsh & McLennan Companies, Inc., Willis Towers Watson Public Limited Company, Arthur J Gallagher & Company, and Lockton Companies, Inc., as well as numerous other global, regional, and local firms in almost every area of our business. We also compete with insurance and reinsurance companies that directly market and service their insurance products without the assistance of brokers or agents. Additionally, we compete with other businesses that do not fall into the categories above, including large financial institutions and independent consulting firms and consulting organizations affiliated with accounting, information systems, technology, human resources, and financial services firms.\n6\nSeasonality\nDue to buying patterns and delivery of certain products and services in the markets we serve, revenues recognized tend to be higher in the first and fourth quarters of each fiscal year.\nLicensing and Regulation\nOur business activities are subject to licensing requirements and extensive regulation under the laws of countries in which we operate, including U.S. federal and state laws. See the “Risk Factors” section in Part I,"
}