{
  "ticker": "APH",
  "cik": "0000820313",
  "company_name": "AMPHENOL CORP /DE/",
  "filing_date": "2025-02-07",
  "accession": "0001558370-25-000714",
  "primary_doc": "aph-20241231x10k.htm",
  "item1_text": "Item 1A. Risk Factors\n​\nThe Company’s business, operations, financial condition, liquidity, results of operations and stock price can be negatively affected by many risk factors.  Investors should carefully consider the risks described below and all other information in this Annual Report.  The Company’s past financial performance, including historical trends, should not be considered a reliable indicator of future performance. The risks and uncertainties described below are not the only ones facing the Company.  Additional risks and uncertainties not presently known to the Company or that we currently consider immaterial may materialize and impair the Company’s business, operations, financial condition, liquidity, results of operations and/or stock price.  \n​\nIf actions taken by management to limit, monitor or control enterprise risk exposures are not successful, the Company’s business, operations, financial condition, liquidity and results of operations could be materially adversely affected.  In such case, the trading price of the Company’s Common Stock and debt securities could decline and investors may lose all or part of their investment.\n​\nRISKS RELATED TO OUR GLOBAL OPERATIONS\n​\nThe Company is exposed to political, economic, military and other risks related to operating in countries outside the United States, and changes in general economic conditions, geopolitical conditions, U.S. and other countries’ trade policies and other factors beyond the Company’s control may adversely impact its business and operating results.\n​\nThe Company’s operations and performance depend significantly on global, regional and U.S. economic and geopolitical conditions.  During 2024, non-U.S. markets constituted approximately 65% of the Company’s net sales, with China constituting approximately 22% of the Company’s net sales. The Company employs nearly 90% of its \n12\n\n\nTable of Contents\nworkforce outside the United States. The Company’s customers are located throughout the world, and the Company has many manufacturing, administrative and sales facilities outside the United States. \n​\nDuring the last few years, there have also been significant changes to U.S. and other countries’ trade policies, export control laws, sanctions, legislation, treaties and tariffs, including, but not limited to, U.S. trade policies and tariffs affecting China and certain of the other countries in which we operate.  These changes have, in certain cases, increased our costs of doing business.  There is significant uncertainty about the future of trade relationships around the world, including potential changes to trade laws and regulations, trade policies, and tariffs.  For example, effective February 4, 2025, the U.S. government implemented an additional 10% tariff on goods being imported from China and, in response, the Chinese government implemented a 15% tariff on certain goods being imported into China from the U.S.  The U.S. has also announced additional 25% tariffs for goods imported into the U.S. from Mexico and Canada beginning in March 2025.  We cannot predict what additional actions may ultimately be taken by the U.S. or other governments with respect to tariffs or trade relations, what products may be subject to such actions (including subject to U.S. export control restrictions), or what actions may be taken by the other countries in retaliation.  The imposition of additional tariffs or other trade barriers could increase our costs in certain markets and may cause our customers to find alternative sourcing or could make it more difficult for us to sell our products in some markets or to some customers, which may result in declines in our sales and operating income.  We have manufacturing facilities in certain jurisdictions that are authorized to operate under preferential duty and/or tariff programs that provide for reduced tariffs and/or eased import and export regulations and are subject to compliance with the terms of such programs, which have become stricter.  Failure to comply with the terms of such programs could increase our manufacturing costs and adversely affect our business, operating results and financial condition.  Additionally, it is possible that government policy changes and uncertainty about such changes could increase market volatility and currency exchange rate fluctuations.  As a result of these dynamics, we cannot predict the impact to our business of any future changes to the U.S.’s or other countries’ trading relationships or the impact of new laws or regulations adopted by the U.S. or other countries.\n​\nIn addition to the risks noted above, a number of other legal, economic and geopolitical factors could have a material adverse effect on the Company’s business, operations, financial condition, liquidity and/or results of operations, such as:\n​\n●\na global or regional economic slowdown or recession in any of the Company’s end markets (or a prolonging or intensification of such a slowdown or recession), which could negatively affect the financial condition of our customers and result in reduced demand;\n●\npostponement of customer spending, in response to tighter credit, inflationary pressures, financial market volatility and other global economic factors;\n●\neffects of significant changes in economic, monetary and/or fiscal policies, including interest rate changes by the U.S. Federal Reserve or other international central banking systems, foreign currency fluctuations, significant income tax changes and inflationary pressures;\n●\nintergovernmental and other conflicts or actions, including, but not limited to, armed conflict, such as the ongoing military conflicts between Ukraine and Russia, as well as between Israel and its adversaries in the Middle East, trade wars, cyberattacks and acts of terrorism or war;\n●\nemployment regulations and local labor conditions, including increases in employment costs, particularly in low-cost regions in which the Company currently operates;\n●\nindustrial policies in various countries that favor domestic industries over multinationals or that restrict foreign companies altogether;\n●\ndifficulties protecting intellectual property;\n●\nlonger payment cycles;\n●\nchanges in exchange control regulations, including any government actions that prohibit, limit or increase the cost of paying a dividend or otherwise moving cash between the Company’s subsidiaries located in different countries;\n●\ncredit risks and other challenges in collecting accounts receivable; and\n●\nchanges in assumptions, such as discount rates, along with lower than expected investment returns and performance related to the Company’s benefit plans.\n​\nWe may be negatively impacted by adverse public health developments, including epidemics and pandemics.\n​\nAny outbreaks of contagious diseases and other adverse public health developments in countries where we operate could have a material and adverse effect on our business, operations, financial condition, liquidity and results of operations.  This was particularly evident during the COVID-19 pandemic, which resulted in disruptions to\n our offices \n13\n\n\nTable of Contents\nand manufacturing facilities around the world, as well as the facilities of our suppliers, customers and our customers’ contract manufacturers.\n  These disruptions included government regulations that inhibited our ability to operate certain of our facilities in the ordinary course, travel restrictions, supplier constraints, supply chain interruptions, logistics challenges and limitations, labor disruptions and reduced demand from certain customers.  Future disruptions from similar harmful public health developments could have a material adverse impact on our business, operations, financial condition, liquidity and results of operations.\n​\nThe Company and certain of its suppliers and customers have experienced, and may in the future experience, difficulties obtaining certain raw materials and components, and the cost of certain of the Company’s raw materials and components may increase.\n​\nThe Company uses basic materials like aluminum, steel, copper, titanium, metal alloys, gold, silver, palladium and plastic resins in its manufacturing processes as well as a variety of components and relies on third-party suppliers to secure these materials and components.  \nIn the past, prices for these and certain other basic materials have experienced significant volatility.  While the Company does not currently anticipate significant, broad-based difficulties in obtaining raw materials or components necessary for production, it has, from time to time, experienced certain difficulties, and inflationary pressures and increased commodity prices may impact the cost and availability of certain raw materials and components used by the Company and result in supply shortages for discrete raw materials or components.  Moreover, the Company may not be able to pass along any increased raw material or component prices to its customers and may not be able to procure and obtain sufficient quantities of raw materials and components in a timely manner and at acceptable prices from our suppliers.  In limited instances, we depend on a single source of supply or participate in commodity markets that may be served by a limited number of suppliers.  Delays in obtaining supplies may result from a number of factors affecting our suppliers, and any delay could impair our ability to deliver products to our customers.  The cost and availability of raw materials may fluctuate significantly due to external factors including, but not limited to, product scarcity, war or other armed conflict, logistical challenges, disruptions caused by climate change and adverse weather conditions, commodity market fluctuations, currency fluctuations, governmental policies and regulations such as trade tariffs and import restrictions, as well as pandemics and epidemics, which may, in turn, negatively impact our results of operations and financial condition.\n​\nCybersecurity incidents affecting our information technology systems could disrupt business operations or cause the release of highly sensitive confidential or personal information, resulting in adverse impacts to our reputation and operating results and potentially leading to litigation and/or governmental investigations, fines and other penalties.\n​\nWe rely on information technology systems provided by third-party providers and our own information technology systems for critical operations and face numerous and evolving cybersecurity threats and techniques used to disrupt operations and gain unauthorized access to these systems.  These threats may arise from diverse threat actors such as state-sponsored organizations and opportunistic hackers and hacktivists, as well as through diverse attack vectors, including, but not limited to, malware, social engineering/phishing, credential harvesting, ransomware, malfeasance by insiders, human or technological error and other increasingly sophisticated attacks.  Cyberattacks continue to expand and evolve, making it difficult to detect and prevent such threats from impacting the Company.  Globally, there continues to be an elevated volume of cyber threats, exploitation of previously unknown software vulnerabilities, ransomware attempts and social engineering attacks, such as phishing and impersonation, and attackers increasingly use tools and techniques that are designed to circumvent controls, avoid detection, and remove or obfuscate forensic evidence.  The proliferation of Internet of Things (“IoT”) devices and Operational Technology (“OT”) systems has expanded the potential points of entry for an unauthorized user to access a system or network.  Threat actors are targeting IoT and OT systems to disrupt critical infrastructure or gain lateral access to corporate networks.  In addition, the rise of AI and machine learning has led to more sophisticated and deceptive attacks.  Cybercriminals are increasingly using AI-generated deepfake videos, audio and text to deceive individuals and organizations.  These attacks can be used for impersonation in social engineering and fraud.  Attackers can manipulate systems in new ways and more easily perform functions at scale.  As a result, we may be unable to detect, investigate, remediate, or recover from future attacks or incidents, or avoid a material adverse impact to our business.  \n​\nIn addition, global remote working dynamics continue to present additional risk that threat actors will engage in social engineering (for example, phishing) and exploit vulnerabilities in corporate and non-corporate networks.  Ransomware attacks have become easier to execute, and with the rise of ransomware as a service, it has become an increasingly popular business model to lease or sell ransomware variants to anyone willing to pay the fee.  \n​\n14\n\n\nTable of Contents\nThere can be no assurance that our cybersecurity risk management program and processes, including our policies, controls or procedures, will be fully complied with or effective in protecting our information technology systems. The Company and third-party providers upon whom we may rely for certain information technology services have been, and expect to continue to be, a target of various cybersecurity attacks, including, but not limited to, ransomware attacks, phishing and other sophisticated threats.  While the impact of previous attacks has not been material, future cybersecurity incidents could lead to unauthorized access to and potentially impair the Company’s information technology systems, products, customers, suppliers and third-party service providers.  Cybersecurity incidents could potentially result in the disruption of our business operations and/or misappropriation, destruction or corruption of critical data and confidential, personal, or proprietary information.  Cybersecurity events could also result in the loss of or inability to access confidential information and critical business, financial or other data, and/or cause the release of highly sensitive confidential or personal information.  Cybersecurity incidents could also result from unauthorized parties gaining access to our systems or information through fraudulent or other means of deceiving our employees, suppliers or third-party service providers.  Our and key third-party information technology systems and infrastructure are susceptible to disruptions from cybersecurity incidents, ransomware attacks, security breaches, computer viruses, security vulnerabilities or “bugs” in software or hardware, outages, systems failures, natural disasters, adverse public health developments, or other catastrophic events, any of which could result in reputational damage that may cause the loss of existing or future customers, the loss of our intellectual property, the release of highly sensitive confidential or personal information, the inability to access critical data and other operational disruptions, litigation with third parties (including class actions) and/or governmental investigations, fines and other penalties, among other things, which could have a material adverse effect on our business, financial condition and results of operations.  Finally, we cannot guarantee that any costs and liabilities incurred in relation to an attack or incident will be covered by our existing insurance policies or that applicable insurance will be available to us in the future on economically reasonable terms or at all.\n​\nWe and our business partners maintain significant amounts of data electronically in locations around the world.  This data relates to all aspects of our business, including financial information and current and future products under development, and also contains certain customer, supplier, partner and employee data, such as personal information.  There is a risk of intrusion, cyberattacks or tampering that could compromise the integrity and privacy of this data or make the data inaccessible to us.  In addition, in certain cases, we outsource to third-party business partners.  Those partners may also be subject to data intrusion or a cyberattack.  Any compromise of the data could substantially disrupt our operations, impact future business opportunities, harm our customers, employees and other business partners, damage our reputation, violate applicable laws, regulations, policies and contractual obligations and subject us to potentially significant costs and liabilities, including litigation or other enforcement actions.  \n​\nThe regulatory environment surrounding information security and privacy is increasingly demanding, with frequent imposition of new and changing requirements.  Privacy laws and regulations around the world including, for example, in the European Union (“EU”), People’s Republic of China, the state of California, and several other U.S. states, impose significant obligations for companies on how they collect, store, protect, process and transfer personal information and can impose significant fines for non-compliance.  The potential for fines, penalties and other related costs in the event of a breach of or non-compliance with any existing and forthcoming information security or privacy laws and requirements may have an adverse effect on our financial results.  For further discussion of the Company’s risk management, strategy, and governance around cybersecurity, refer to Part I, Item 1C. \nCybersecurity\n herein.\n​\nThe Company may be negatively impacted by extreme weather conditions and natural catastrophic events, including those caused or intensified by climate change and global warming.\n​\nFrom time to time, extreme weather conditions and natural disasters have negatively impacted, and may continue to negatively impact, portions of our operations, as well as the operations of our suppliers, vendors, customers and distributors.  Such unpredictable weather conditions and \nnatural disasters including, but not limited to, severe storms, earthquakes, fires, droughts, floods, hurricanes, tornadoes\n, and stronger and longer-lasting weather patterns, including heat waves and freezes and ambient temperature or precipitation changes, and their consequences and effects have, in the past, temporarily disrupted our business operations both in the United States and abroad.  Climate change may exacerbate certain such events and may also contribute to other changes that could also adversely impact our operations.  These events could cause some of the Company’s operations to suffer from supply chain disruptions and potential delays in fulfilling customer orders or order cancellations altogether, lost business and sales, increased costs, energy and water scarcity, changing costs or availability of insurance, and/or property damage or harm to our people, each and all of which could have an adverse effect on our business, operations, financial condition and results of operations.\n​\n15\n\n\nTable of Contents\nOur international operations require us to comply with anti-corruption laws and regulations of the U.S. government and various foreign jurisdictions, and our business reputation and financial results may be impaired by improper conduct by any of our employees, customers, suppliers, distributors or any other business partners.\n​\nDoing business on a worldwide basis requires us and our subsidiaries to comply with the anti-corruption laws and regulations of the U.S. government and various foreign jurisdictions, and our failure to comply with these rules and regulations may expose us to significant liabilities.  These laws and regulations may apply to companies, individual directors, officers, employees, subcontractors and agents, and may restrict our operations, trade practices, investment decisions and partnering activities.  In particular, our international operations are subject to U.S. and foreign anti-corruption laws and regulations, such as the Foreign Corrupt Practices Act of 1977, as amended (“FCPA”).  As part of our business, we deal with state-owned business enterprises, the employees and representatives of which may be considered foreign officials for purposes of the FCPA.  In addition, some of the foreign locations in which we operate lack a developed legal system and have elevated levels of corruption. As a result of the above activities, we are exposed to the risk of violating U.S. and foreign anti-corruption laws.\n​\nThere can be no assurance that our policies and procedures designed for complying with applicable U.S. and foreign laws and regulations will be effective in preventing our directors, officers, employees, subcontractors and agents from taking actions that violate these legal requirements.  Violations of these legal requirements could subject us to criminal fines and imprisonment, civil penalties, disgorgement of profits, injunctions, debarment from government contracts and other remedial measures.  In addition, any actual or alleged violations could disrupt our operations, cause reputational harm, involve significant management distraction and result in a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\n​\nThe Company’s results can be positively or negatively affected by changes in foreign currency exchange rates.\n​\nThe Company conducts business in many foreign currencies through its worldwide operations, and as a result, is subject to foreign exchange exposure due to changes in exchange rates of the various currencies, including possible foreign currency restrictions and/or devaluations.  Changes in exchange rates can positively or negatively affect the Company’s sales, operating margins and equity.  There can be no assurance that any or all actions taken by the Company to mitigate currency risk, such as locating factories in the same country or region in which products are sold, hedging contracts, cost reduction and pricing actions or working capital management, will be fully effective in successfully managing currency risk.  A significant and sudden decline in the value of any of the foreign currencies of the Company’s worldwide operations could have an adverse effect on the Company’s business, financial condition, results of operations and cash flows.\n​\nThe Company is dependent on attracting, recruiting, hiring and retaining skilled employees, including our various management teams.\n​\nOur performance is dependent on our ability to attract, recruit, hire and retain skilled personnel, including our various management teams.  It is possible that scarce labor market conditions, which the Company has experienced from time to time, could have an adverse effect on our ability to attract, recruit, hire and retain skilled employees, which in turn, could have an adverse effect on the Company’s business, financial condition and results of operations.  In addition, our business could also be adversely impacted by any ongoing increases in labor costs, including wages and benefits.\n​\nRISKS RELATED TO OUR END MARKETS\n​\nThe Company encounters competition in all areas of our business.\n​\nThe Company competes primarily on the basis of technology innovation, product quality and performance, price, customer service and delivery time. Competitors include large, diversified companies, some of which have greater assets and financial resources than the Company, as well as medium- to small-sized companies.  Rapid technological changes could also lead to the entry of new competitors of various sizes against whom we may not be able to successfully compete.  There can be no assurance that the Company will be able to compete successfully against existing or new competition, and the inability to do so may result in price reductions, reduced margins, or loss of market share, any of which could have an adverse effect on the Company’s business, financial condition and results of operations.\n​\n16\n\n\nTable of Contents\nThe Company is dependent on end market dynamics to sell its products, and some of the Company’s end markets are subject to cyclical and at times rapid periods of reduced demand.\n​\nThe Company is dependent on end market dynamics to sell its products, and its operating results could be adversely affected by cyclical and at times rapid periods of reduced demand in any of its end markets.  Demand for products can be subject to rapid changes arising from a wide variety of factors, including new technology developments, changes in general economic conditions, consolidation within an industry, changes in access to financing, competition, new legislation and regulation, prolonged work stoppages or other disputes with labor unions and governmental budgetary constraints, among many other factors.  Periodic downturns in any of our customers’ end markets can significantly reduce demand for certain of our products, which could have a material adverse effect on the Company’s business, financial condition and results of operations.\n​\nRISKS RELATED TO ACQUISITIONS\n​\nThe Company has at times experienced difficulties and unanticipated expenses in connection with purchasing and integrating newly acquired businesses.\n​\nThe Company has completed numerous acquisitions in recent years, including two in 2024 and 10 in 2023.  The Company anticipates that it will continue to pursue acquisition opportunities as part of its growth strategy.  From time to time, the Company experiences difficulty and unanticipated expenses associated with purchasing and integrating acquisitions, and acquisitions do not always perform and deliver the financial benefits expected.  In addition, the Company may not be able to close acquisitions as anticipated, or at all.  The Company has also experienced challenges at times following the acquisition of a new company or business, including, but not limited to, managing the operations, manufacturing facilities and technology; maintaining and increasing the customer base; or retaining key employees, suppliers and distributors.  In certain limited cases, the Company has pursued indemnification claims against seller(s) of an acquired business or sought recovery under third party insurance policies for pre-acquisition liabilities, breaches of representations, warranties or covenants or for other reasons provided for in the relevant acquisition agreement or insurance policy.  To the extent we pursue indemnification claims against such seller(s) or insurers, such seller(s) or insurers may successfully contest such claims and/or may not have the financial capacity to compensate us for such claims, or such claims may otherwise be difficult or impractical to enforce.  We cannot predict or guarantee whether and to what extent anticipated cost savings, benefits, margin improvements and growth prospects will be achieved from recent or future acquisitions.\n​\nThe Company may in the future incur goodwill and other intangible asset impairment charges.\n​\nOn December 31, 2024, the total assets of the Company were $21.4 billion, \nwhich included $8.2 billion of goodwill (the excess of fair value of consideration paid over the fair value of net identifiable assets of businesses acquired) and $1.2 billion of other intangible assets, net.  The Company performs annual evaluations (or more frequently, if necessary) for the potential impairment of the carrying value of goodwill and other intangible assets.  Such evaluations to date have not resulted in the need to recognize an impairment. However, if the financial performance of the Company’s businesses were to decline significantly, the Company could incur a material non-cash charge to its income statement for the impairment of goodwill and other intangible assets.  Furthermore, we cannot provide assurance that impairment charges in the future will not be required if the expected cash flow estimates as projected by management do not occur, especially if an economic recession occurs and continues for a lengthy period or becomes more severe, or if acquisitions and investments made by the Company fail to achieve expected returns.\n​\nRISKS RELATED TO OUR LIQUIDITY AND CAPITAL RESOURCES\n​\nThe Company’s credit agreement and senior notes contain certain requirements, which if breached, could have a material adverse effect on the Company.\n​\nThe third amended and restated credit agreement governs our $3.0 billion unsecured revolving credit facility (the “Revolving Credit Facility”), which also backstops the Company’s U.S. commercial paper program (“U.S. Commercial Paper Program”) and Euro commercial paper program (“Euro Commercial Paper Program”, and together with the U.S. Commercial Paper Program, “Commercial Paper Programs”).  The Revolving Credit Facility contains financial and other covenants, such as a limit on the ratio of debt to earnings before interest, taxes, depreciation and amortization, a limit on priority indebtedness and limits on incurrence of liens.  The ability to meet the financial covenants can be affected by events beyond the Company’s control, and the Company cannot provide assurance that it will meet those \n17\n\n\nTable of Contents\ntests.  A breach of any of these covenants could result in a default under the Revolving Credit Facility.  Upon the occurrence of an event of default under the Revolving Credit Facility, the lenders could terminate all commitments to extend further credit and elect to declare amounts outstanding thereunder to be immediately due and payable, which could result in the acceleration of certain of the Company’s other indebtedness and the Company not having sufficient assets to repay indebtedness under the Revolving Credit Facility and such other debt instruments.  As of December 31, 2024, the Company had no borrowings outstanding under the Revolving Credit Facility, U.S. Commercial Paper Program and Euro Commercial Paper Program.  However, the Company borrowed under the U.S. Commercial Paper Program throughout much of 2024, and the Company may make additional borrowings under any of its debt instruments from time to time.\n​\nIn addition to the Revolving Credit Facility, the Company’s various senior notes, some of which were issued during 2024, also impose certain obligations on the Company and prohibit various actions by the Company unless it satisfies certain financial requirements.  While the Company is compliant with all such requirements as of December 31, 2024, there can be no assurance that the Company will remain in compliance with such requirements.\n​\nThe Company relies on the global capital markets, and an inability to access those markets on favorable terms could adversely affect the Company’s results.\n​\nThe Company has used the global capital markets to raise capital to invest in its business and make strategic acquisitions.  The capital and credit markets have experienced significant volatility in the past.  If general economic and capital market conditions deteriorate significantly, it could become more difficult to access capital to finance capital investments, acquisitions and other initiatives including dividends and share repurchases, which could have a material adverse effect on the Company’s business, financial condition, results of operations or cash flows.  In addition, if the credit rating agencies that rate the Company’s debt were to downgrade the Company’s credit rating, it would likely increase the Company’s cost of capital and make it more difficult for the Company to obtain new financing and access capital markets, which could also have a material adverse effect on the Company’s business, financial condition, results of operations or cash flows.\n​\nThe Company’s results may be negatively affected by changing interest rates\n.\n​\nThe Company is subject to interest rate volatility with regard to existing and future issuances of debt.  The Company monitors its mix of fixed-rate and variable-rate debt, as well as its mix of short-term and long-term debt.  As of December \n31, 2024, less than 1% of the Company’s outstanding borrowings were subject to floating interest rates.  To the extent that interest rates change related to floating rate debt and the Company borrows under any of our floating rate debt instruments in the future (Commercial Paper Programs as well as our Revolving Credit Facility), our interest expense and interest payments will be impacted accordingly.  There can be no assurance that interest rates will not change significantly from current levels.\n​\nRISKS RELATED TO LEGAL AND REGULATORY MATTERS\n​\nOur business and financial results may be adversely affected by government contracting risks. \n​\nWe are subject to various laws and regulations applicable to parties doing business with the U.S. and other governments, including laws and regulations governing reporting obligations, interactions with government officials, performance of government contracts, the use and treatment of government furnished property and the nature of materials used in our products. We may be unilaterally suspended or barred from conducting business with the U.S. and other foreign governments or their suppliers (both directly and indirectly) or become subject to fines or other sanctions if we are found to have violated such laws or regulations. As a result of the need to comply with these laws and regulations, we are subject to increased risks of governmental investigations, civil fraud actions, criminal prosecutions, whistleblower lawsuits and other enforcement actions.  The U.S. laws and regulations to which we are subject include, but are not limited to, the Export Administration Regulations, the Federal Acquisition Regulation, the False Claims Act, International Traffic in Arms Regulations, regulations from the Bureau of Alcohol, Tobacco and Firearms and the FCPA.  Moreover, we are subject to a wide range of similar laws and regulations in other countries throughout the world.  Failure, or the perceived failure, to comply with applicable requirements also could harm our reputation and our ability to compete for future government contracts or sell commercial equivalent products. Any of these outcomes could have a material adverse effect on our business, operations, financial condition, liquidity, and results of operations.\n​\n18\n\n\nTable of Contents\nIn addition, U.S. government contracts are subject to modification, curtailment or termination by the U.S. government without prior written notice, either for convenience or for default as a result of our failure to perform under the applicable contract.  If our contracts are terminated by the U.S. government as a result of our default, we could be liable for additional costs the U.S. government incurs in acquiring undelivered goods or services from another source and any other damages it suffers.  Furthermore, the U.S. government periodically audits our governmental contract costs, which could result in fines, penalties or adjustment of costs and prices under the contracts.  Any such fines, penalties or payment adjustments resulting from such audits could adversely affect our reputation, business, operations, financial condition, liquidity, and results of operations.\n​\nThe Company must comply with complex export and import controls as well as economic sanctions and trade embargoes imposed by the United States government and other countries.\n​\nCertain of our products, including purchased components of such products, are subject to U.S. and non-U.S. export control laws and regulations, and may be exported only with the required export license or through an export license exception.  In addition, we are required to comply with certain U.S. and non-U.S. economic sanctions and trade embargoes that restrict our ability to transact or deal with certain persons, countries, regions, and governments.  These laws and regulations are complex, may change frequently and without prior notice, have generally become more stringent over time and have intensified under recent U.S. administrations, especially in light of ongoing tensions between the U.S. and China, as well as other countries.  For example, in 2019, the U.S. government added certain companies based in China to the “Entity List” maintained by the U.S. Department of Commerce, which imposes additional restrictions on sales to such companies.  Since 2019, numerous other companies have been added to that list.  Further, in 2022, the U.S. Commerce Department’s Bureau of Industry Security (“BIS”) released new export control regulations that restrict the provision to China of certain technology, software, manufacturing equipment and commodities that are used to make certain advanced computing integrated circuits (“ICs”) and supercomputers.  These changes include new restrictions on the ability of U.S. companies to provide certain services to any facility in China that manufactures certain advanced ICs.  Since 2022, numerous other related rules and regulations have been implemented by BIS.  In response to these regulations, the Chinese government has implemented its own set of import and export rules and regulations and added certain U.S.-based companies to the Chinese government’s “Unreliable Entity List”, which imposes additional restrictions on such companies.  Although, to date, none of such restrictions have had a material adverse effect on the Company’s business, financial condition and results of operations, the U.S. and Chinese governments have the power to place even greater restrictions, and such restrictions could further limit or prohibit the Company from selling its products or providing its services.  In addition, we cannot ensure that our policies and procedures designed to maintain compliance with applicable rules and regulations will be effective in preventing instances of non-compliance.  If we were to fail to comply with applicable export control restrictions (for example, by failing to obtain required export licensing), customs regulations, economic sanctions and other laws, we could be subject to substantial civil and criminal penalties, including fines, the incarceration of responsible employees and managers, reputational harm, and the possible loss of export or import privileges.  In addition, if our distributors fail to obtain appropriate import, export or re-export licenses or permits, we may also be adversely affected through reputational harm and penalties. Obtaining the necessary export license for a particular sale may be time-consuming and may result in the delay or loss of sales opportunities.\n​\nChanges in fiscal and tax policies, audits and examinations by taxing authorities could impact the Company’s results.\n​\nThe Company is subject to tax in all jurisdictions in which it operates, including the Company’s two largest markets, the U.S. and China.  Any future examinations, changes in tax laws, regulations, accounting standards for \nincome taxes and/or other tax guidance could materially impact the Company’s current and non-current tax liabilities, along with deferred tax assets and liabilities, and consequently, our financial condition, results of operations or cash flows.\n​\nThe Inflation Reduction Act of 2022 (the “IRA”), a tax and spending package that introduced several tax-related provisions, including a 15% corporate alternative minimum tax (“CAMT”) on certain large corporations and a 1% excise tax on certain corporate stock repurchases, was enacted into law in 2022.  Companies were required to reassess their valuation allowances for certain affected deferred tax assets in the period of enactment but did not need to remeasure deferred tax balances for the related tax accounting implications of the CAMT.  Th\ne IRA provisions, which became effective for Amphenol beginning on January 1, 2023\n, did not have a material impact on the Company during the years ended December 31, 2024 and 2023.  However, the full impact of these provisions in the future depends on several factors, including interpretive regulatory guidance, which has not yet been released.\n​\n19\n\n\nTable of Contents\nThe Organization for Economic Co-operation and Development (OECD)/G20 Inclusive Framework, known as Pillar Two, provides guidance for a global minimum tax.  This guidance lays out a common approach for adopting the global minimum tax and enacting local legislation codifying the provisions that all 142 countries in the Inclusive Framework agreed to by consensus.  The EU member states have agreed to adopt these rules in two stages.  The first component became effective on January 1, 2024, and the second component became effective on January 1, 2025.  Non-EU countries have enacted or are expected to enact legislation on a similar timeline.  Certain countries in which we operate have already enacted legislation to adopt the Pillar Two framework, while several other countries are expected to also implement similar legislation with varying effective dates in the future. When and how this framework is adopted or enacted by the various countries in which we do business will increase tax complexity and may increase uncertainty and adversely affect our provision for income taxes in the U.S. and non-U.S. jurisdictions.\n​\nWe may experience difficulties in enforcing our intellectual property rights, which could result in loss of market share, and we may be subject to claims of infringement of the intellectual property rights of others.\n​\nWe rely on patent and trade secret laws, copyright, trademark, confidentiality procedures, controls and contractual commitments to protect our intellectual property rights.  Despite our efforts, these protections may be limited and, from time to time, we encounter difficulties in protecting our intellectual property rights, particularly in certain countries outside the U.S.  We cannot provide assurance that the patents that we hold or may obtain will provide meaningful protection against our competitors.  Changes in laws concerning intellectual property, or the enforcement of such laws, may affect our ability to prevent or address the misappropriation of, or the unauthorized use of, our intellectual property, potentially resulting in loss of market share.  Litigation may be necessary to enforce our intellectual property rights. Litigation is inherently uncertain, and outcomes are unpredictable.  If we cannot protect our intellectual property rights against unauthorized copying or use, or other misappropriation, we may not remain competitive.\n​\nThe intellectual property rights of others could inhibit our ability to introduce new products.  Other companies hold patents on technologies used in our industries and are aggressively seeking to expand, enforce and license their patent portfolios.  We periodically receive notices from, or have lawsuits filed against us by, third parties claiming infringement, misappropriation or other misuse of their intellectual property rights and/or breach of our agreements with them.  These third parties may include entities that do not have the capabilities to design, manufacture, or distribute products or that acquire intellectual property like patents for the sole purpose of monetizing their acquired intellectual property through asserting claims of infringement and misuse.  In addition, some foreign competitors may take advantage of the intellectual property laws in their home countries and the more favorable litigation and regulatory environment to our detriment.  Third-party claims of infringement may result in loss of revenue, substantial costs or lead to monetary damages or injunctive relief against us.\n​\nThe Company is subject to customer claims, litigation and other regulatory or legal proceedings.\n​\nThe Company is currently engaged in, or subject to, various customer claims, litigation and other regulatory and legal matters and may be subject to additional claims, litigation and other regulatory or legal proceedings in the future. Such matters expose the Company to risks that could be material, including, but not limited to, risks related to employment disputes, tax controversies, government investigations, intellectual property infringement, compliance with environmental laws, unfair sales practices, product safety and liability, and product warranty, indemnity and other contract-related claims.  These matters may subject the Company to lawsuits, voluntary or forced product recalls, government investigations and criminal liability, including claims for compensatory, punitive or consequential damages, and could result in disruptions to our business and significant legal expense\ns.  These matters could also damage our reputation, harm our relationships with customers or negatively affect product demand.\n​\nThe insurance coverages that the Company maintains may not apply to all types of claims and proceedings, and, where insurance exists, the amount of insurance coverage may not be adequate to cover the total claims and liabilities.  In some cases, particularly with respect to product warranty claims from customers, we self-insure against this risk, meaning that any product liability claims will likely have to be paid from Company funds and not by insurance.  Any current or future substantial liabilities or regulatory actions could have a material adverse effect on our business,\n financial condition, cash flows and reputation.\n​\nThe Company is subject to environmental laws and regulations that could adversely affect our business.\n​\nThe Company operates in both the United States and various foreign jurisdictions, and we must comply with locally enacted laws and regulations addressing health, safety and environmental matters in such jurisdictions in which we \n20\n\n\nTable of Contents\nmanufacture and/or sell our products.  Certain operations of the Company are subject to locally enacted environmental laws and regulations that govern the discharge of pollutants into the air and water, as well as the handling and disposal of solid and hazardous wastes.  The Company and its operations may be subject to liabilities, regardless of fault, for investigative and/or remediation efforts on such matters that may arise at any of the Company’s former or current properties, either owned or leased.  Environmental liabilities can result from the use of hazardous materials in production, the disposal of products, damages associated with the use of any of our products or other related matters.  We cannot be certain as to the potential impact of any changes to environmental conditions or environmental policies that may arise in any of our jurisdictions.  Our failure to comply with these local environmental laws and regulations could result in fines or other punitive damages and/or modifications to our production processes as well as subject us to reputational harm, any of which could adversely impact our financial position, results of operations, or cash flows\n.\n​\nThe Company is subject to, and may continue to be subject to, incremental costs, risks and regulations associated with efforts to combat the negative effects of climate change.\n​\nThere is increased public awareness regarding climate change.  This increased focus has led to certain international treaties and agreements and legislative and regulatory efforts.  In addition to the risks discussed under the risk factor titled “\nThe Company may be negatively impacted by extreme weather conditions and natural catastrophic events, including those caused or intensified by climate change and global warming,\n” the Company may also be subject to larger, global climate change initiatives, laws, regulations or orders which seek to reduce greenhouse gas (“GHG”) emissions.  In addition to government requirements, certain of our customers are also imposing climate-related requirements on their suppliers, including us.  Any failure, or perceived failure, to comply with these requirements may result in reduced demand for our products, reputational harm, or other adverse impacts to our business.\n​\nGiven our global manufacturing presence, any future regulations relating to GHG emissions and/or other climate change-related laws and regulations, beyond initiatives already in process at the Company, could subject us to additional and/or unforeseen compliance costs and limitations, increased energy and raw material costs and incremental capital expenditure requirements.  In addition, certain governmental bodies have adopted, and are considering adopting additional, mandatory climate-related reporting obligations, and potentially GHG emissions reduction requirements, and these regulatory developments, to the extent we are subject to them, will likely result in increased corporate and operational general and administrative efforts and associated costs and expenses. \n​\nIn recent years, both U.S. and foreign regulations have evolved, and there have been various new laws around the world that have been passed and will require additional ESG-related disclosure.  For example, in Europe, the EU finalized the Corporate Sustainability Reporting Directive, which introduces more prescriptive sustainability reporting requirements for EU companies as well as certain non-EU companies.  In March 2024, in the U.S., the SEC issued a new rule (Final Rule 33-11275\n: The Enhancement and Standardization of Climate-Related Disclosures for Investors\n), which mandates certain climate- and emissions-related disclosure and financial statement requirements that SEC registrants will be required to comply with in their public filings.  Although the SEC issued an order staying the new rule in April 2024 pending litigation challenging the new rule, the Company continues to review, evaluate and implement the necessary processes in order to comply with this new rule.  The Company’s adoption of and compliance with this new rule could result in additional costs to the Company or other adverse impacts to our business, financial condition or results of operations.   This new SEC rule follows actions from certain U.S. states that continue to propose and/or pass their own ESG-related laws, certain of which came into effect in the last few years.  For example, on October 7, 2023, the governor of California signed and enacted into law two climate-related disclosure bills (\nSenate Bill-253, Climate Corporate Data Accountability Act \nand\n Senate Bill-261, Greenhouse Gases: Climate-Related Financial Risk\n), which will require compliance as early as 2026.  Such laws are not uniform and may be inconsistently applied, which can increase the complexity and cost of compliance as well as any associated litigation or enforcement risks.\n​\nIn addition to the requirement to comply with these enacted laws and regulations and other potential mandatory ESG requirements, any future regulatory changes in any of the jurisdictions in which we operate, in addition to those already enacted, could result in transition risks to the Company, including, but not limited to: (i) the nature and timing of any requirement to lower GHG emissions and adopt more energy-efficient energy use, which could result in changes or disruptions to the way the Company operates, (ii) financial risks where the compliance with such regulations requires unforeseen capital expenditures and becomes costly or financially burdensome, (iii) legal risks associated with the failure to adapt to or comply with future climate change-related regulations, (iv) risks of climate litigation associated with our disclosures and/or operations; (v) risks associated with the implementation of any new technologies required to comply with such regulations, which could impede our ability to develop new products, meet customer and market demand or compete on pricing and quality in the market, and/or (vi) reputational risks associated with our customers’ \n21\n\n\nTable of Contents\nand investors’ perceptions of the Company and their preferences for maintaining relationships with companies with lower emissions, all of which could harm our reputation in the marketplace.\n​\nItem 1B. Unresolved Staff Comments\n​\nNone.\n​\nItem 1C. Cybersecurity\n​\nCybersecurity Risk Management and Strategy\n​\nWe have developed and implemented an information security and cybersecurity risk management program (“Program”) intended to protect and preserve the confidentiality, integrity and availability of our data and information technology systems.  \nOur Program takes a risk-based approach and is \nintegrated\n into our overall enterprise risk management program.  We use the National Institute of Standards and Technology Cybersecurity Framework (the “NIST CSF”) as a benchmark to ensure that our Program is maintained in line with industry best practices. This does not imply that we meet any particular technical standards, specifications or requirements, but it does mean that we use the NIST CSF as a guide to help us identify, assess and manage cybersecurity risks relevant to our business. \n​\nThe Company maintains a decentralized information technology infrastructure, where each of our business units utilizes a separate and distinct information technology system.  This means that if any business unit’s systems are compromised, there is less risk that another business unit will be impacted by that event.  This decentralized structure also allows our information security professionals embedded within an individual business unit to make quick, efficient decisions when changes or actions are needed and provides an additional safeguard for our data and systems.\n​\nOur Program includes:\n​\n●\nperiodic risk assessments and penetration tests, which are integrated within our enterprise risk management framework processes, designed to identify cybersecurity and technology risks, as well as to formulate management actions to respond to, mitigate and remediate material issues (if any);\n​\n●\nannual management reporting to the Board;\n​\n●\nreporting of the scope, objectives and results of internal audits on the procedures performed to validate the effectiveness of our control environment related to our information security systems and security controls to the Audit Committee at least two times a year;\n​\n●\nannual cybersecurity awareness training, including phishing simulation campaigns, to educate employees on recognizing cybersecurity threats and preventing actions that could unintentionally grant unauthorized access to our systems;\n​\n●\ndeployment of endpoint protection software, supported by external managed services, to attempt to proactively detect and block malicious code from affecting our systems;\n​\n●\na cross-functional team principally responsible for managing our cybersecurity risk assessment processes and our response to cybersecurity incidents;\n​\n●\nthe use of \nexternal service providers\n, where appropriate, to assess risk, monitor alerts, perform penetration testing or otherwise assist with aspects of our security controls and response to cybersecurity incidents; and\n​\n●\na documented framework and supporting processes for handling security incidents that facilitates coordination across multiple parts of the Company.\n​\nWe have not identified risks from known cybersecurity threats, including as a result of any prior security breach, that have materially affected or are reasonably likely to materially affect us, including our business strategy, financial condition and results of operations.\n   We face certain ongoing risks from cybersecurity threats that, if realized, are reasonably likely to materially affect us, including our operations, business strategy, results of operations or financial condition.  \nFor a discussion of certain risks related to cybersecurity, refer to the risk factor titled “\nCybersecurity incidents affecting our information technology systems could disrupt business operations or cause the release of highly sensitive confidential or personal information, resulting in adverse impacts to our reputation and operating results and potentially leading to litigation and/or governmental investigations, fines and other penalties\n” in Part I,"
}