{
  "ticker": "ARE",
  "cik": "0001035443",
  "company_name": "ALEXANDRIA REAL ESTATE EQUITIES, INC.",
  "filing_date": "2025-01-27",
  "accession": "0001035443-25-000067",
  "primary_doc": "are-20241231.htm",
  "item1_text": "Item 15. Exhibits and financial statement schedules” in this annual report on Form 10-K.\nITEM 1. BUSINESS\nOverview\nWe are a Maryland corporation formed in October 1994 that has elected to be taxed as a REIT for federal income tax \npurposes. \nAlexandria Real Estate Equities, Inc. (NYSE: ARE),\n an\n \nS&P 500\n®\n company, is a best-in-class, mission-driven life science \nREIT making a positive and lasting impact on the world. With our founding in 1994, Alexandria pioneered the life science real estate \nniche. Alexandria is the preeminent and longest-tenured owner, operator, and developer of collaborative Megacampus™\n \necosystems \nin AAA life science innovation cluster locations, including Greater Boston, the San Francisco Bay Area, San Diego, Seattle, \nMaryland, Research Triangle, and New York City. As of \nDecember 31, 2024\n, Alexandria has a total market capitalization of \n$29.0 billion\n and an asset base in North America that includes\n \n39.8 million\n RSF of operating properties \nand\n \n4.4 million\n RSF of Class \nA/A+ properties undergoing construction\n.\nWe develop dynamic Megacampus ecosystems that enable and inspire the world’s most brilliant minds and innovative \ncompanies to create life-changing scientific and technological innovations. We believe in the utmost professionalism, humility, and \nteamwork. Our tenants include multinational pharmaceutical companies; public and private biotechnology companies; life science \nproduct, service, and medical device companies; digital health, technology, and agtech companies; academic and medical research \ninstitutions; U.S. government research agencies; non-profit organizations; and venture capital firms. Alexandria has a longstanding \nand proven track record of developing Class A/A+ properties clustered in highly dynamic and collaborative Megacampus \nenvironments that enhance our tenants’ ability to successfully recruit and retain world-class talent and inspire productivity, efficiency, \ncreativity, and success. Alexandria also provides strategic capital to transformative life science companies through our venture \ncapital platform. We believe our unique business model and diligent underwriting ensure a high-quality and diverse tenant base that \nresults in higher occupancy levels, longer lease terms, higher rental income, higher returns, and greater long-term asset value.\nAs of \nDecember 31, 2024\n, we had \n391\n \nproperties in North America consisting of approximately \n44.1 million\n RSF of \noperating properties and \nnew Class A/A+ development and redevelopment properties under construction\n, including \n67\n operating \nproperties and development projects that are held by consolidated real estate joint ventures and \nfour\n properties that are held by \nunconsolidated real estate joint ventures. \nThe occupancy percentage of our operating properties in North America was \n94.6%\n as of \nDecember 31, 2024\n. The 10-year average occupancy percentage of our operating properties as of \nDecember 31, 2024\n was\n \n96%\n. \nInvestment-grade or publicly traded large cap tenants represented \n52%\n of our total annual rental revenue in effect as of \nDecember 31, 2024\n. Additional information regarding our consolidated and unconsolidated real estate joint ventures is included in \n“\nItem 7. Management’s discussion and analysis of financial condition and results of operations\n” in this annual report on Form 10-K. \nFor information regarding risk factors that may affect us, refer to “"
}