{
  "ticker": "AVB",
  "cik": "0000915912",
  "company_name": "AVALONBAY COMMUNITIES INC",
  "filing_date": "2025-02-27",
  "accession": "0000915912-25-000005",
  "primary_doc": "avb-20241231.htm",
  "item1_text": "Item 1A. \"Risk Factors\" for a discussion of various risks that could adversely affect us.\nITEM 1.    BUSINESS\nGeneral\nAvalonBay Communities, Inc. (the \"Company,\" \"we,\" \"our\" and \"us\" which terms, unless the context otherwise requires, refer to AvalonBay Communities, Inc. together with its subsidiaries), is a Maryland corporation that has elected to be treated as a real estate investment trust (\"REIT\") for federal income tax purposes. We develop, redevelop, acquire, own and operate apartment communities in New England, the New York/New Jersey metro area, the Mid-Atlantic, the Pacific Northwest, and Northern and Southern California, as well as in our expansion regions of Raleigh-Durham and Charlotte, North Carolina, Southeast Florida, Dallas and Austin, Texas, and Denver, Colorado. We focus on leading metropolitan areas that we believe are generally characterized by growing employment in high wage sectors of the economy, higher cost of home ownership and a diverse and vibrant quality of life. We believe these market characteristics have offered, and will continue to offer, the opportunity for superior risk-adjusted returns over the long-term on apartment community investments relative to other markets that do not have these characteristics. \nAt January 31, 2025, we owned or held a direct or indirect ownership interest in:\n•\n284 operating apartment communities containing 86,111 apartment homes in 11 states and the District of Columbia, of which 275 communities containing 83,389 apartment homes were consolidated for financial reporting purposes and nine communities containing 2,722 apartment homes were held by unconsolidated entities in which we hold an ownership interest.\n•\n21 wholly-owned development apartment communities that are under construction or completed and in lease-up and are expected to contain an aggregate of 7,305 apartment homes when completed.\n•\nRights to develop an additional 30 communities that, if developed as expected, will contain 9,336 apartment homes.\nWe generally obtain ownership in an apartment community by developing a new community on either vacant land or land with improvements that we raze, or by acquiring an existing community. In selecting sites for development or acquisition, we favor locations that are near expanding employment centers and convenient to transportation, recreation areas, entertainment, shopping and dining.\nOur principal financial goal is to increase long-term shareholder value through the development, redevelopment, acquisition, ownership, operation and asset management and, when appropriate, disposition of apartment communities in our markets. To help meet this goal, we regularly (i) monitor our investment allocation by geographic market and product type, (ii) develop, redevelop and acquire interests in apartment communities in our selected markets, (iii) efficiently operate our communities to maximize resident satisfaction and shareholder return, (iv) selectively sell apartment communities that no longer meet our long-term strategy or when opportunities are presented to realize a portion of the value created through our investment and redeploy the proceeds from those sales and (v) maintain a capital structure that we believe is aligned with our business risks and allows us to maintain continuous access to cost-effective capital. We also seek to generate additional shareholder value from investments in other real estate-related ventures, including through our Structured Investment Program (\"SIP\"), our platform to provide mezzanine loans or preferred equity to third-party multifamily developers in our existing regions. We undertake our development and redevelopment activities primarily through in-house development and redevelopment teams, and buy and dispose of assets through our in-house investments platform. We believe that our organizational structure, which includes dedicated development and operational teams, and strong culture are key differentiators. We pursue our development, redevelopment, investment and operating activities with the purpose of \"Creating a Better Way to Live.\"\n1\nTable of Contents\nWe seek to be the leading rental housing company in select U.S. markets by delivering distinctive experiences that customers value, creating a workplace where associates thrive, and achieving superior results for shareholders. We focus on markets that are characterized by growing employment in high wage sectors of the economy, higher home prices and a diverse and vibrant quality of life. From an operating perspective, we seek to deliver seamless, personalized experiences for our residents on an efficient and effective basis by our resident-focused on-site associates that are supported by our centralized shared services operating organization and flexible technology platform that incorporates automation and artificial intelligence. We operate our apartment communities under four core brands:\n•\nAvalon, our core \"Avalon\" brand, focuses on upscale apartment living and high end amenities and services;\n•\nAVA targets customers in high energy, transit-served neighborhoods and generally feature smaller apartments, many of which are designed for roommate living, and a variety of active common spaces that encourage socialization;\n•\neaves by Avalon is targeted to the cost conscious, \"value\" segment primarily in suburban areas; and\n•\nKanso is designed to create an apartment living experience that offers simplicity without sacrifice at a more moderate price point, featuring high-quality apartment homes, limited-to-no community amenities and a low-touch, largely self- service operating model that leverages technology and smart access.\nWe believe that this branding differentiation allows us to target our product offerings to multiple customer groups and submarkets within our existing geographic footprint.\nDuring the three years ended December 31, 2024, we: \n•\nacquired 13 apartment communities, excluding unconsolidated investments; \n•\ndisposed of 21 apartment communities, excluding unconsolidated investments;\n•\nrealized our pro rata share of the gain from the sale of three communities owned by unconsolidated real estate entities; and\n•\ncompleted the development of 22 apartment communities, including unconsolidated investments, and the redevelopment of two apartment communities.\nA more detailed description of our unconsolidated real estate entities and the related investment activity can be found in Note 5, \"Investments,\" of the Consolidated Financial Statements in Item 8 of this report and in Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\nA further discussion of our development, redevelopment, disposition, acquisition, operating and property management and related strategies follows.\nDevelopment Strategy.\n    We select land for development and follow established procedures that we believe minimize both the cost and the risks of development. As one of the largest developers of multifamily rental apartment communities in our selected markets, we maintain regional offices to identify and support development opportunities through local market presence and access to local market information. In addition to our principal executive office in Arlington, Virginia, we also have regional offices, administrative offices or specialty offices, including offices that are in or near the following cities:\n2 \nTable of Contents\n•\nAustin, Texas;\n•\nBellevue, Washington;\n•\nBoston, Massachusetts;\n•\nDurham, North Carolina;\n•\nDenver, Colorado;\n•\nFort Lauderdale, Florida;\n•\nIrvine, California;\n•\nLos Angeles, California;\n•\nNew York, New York;\n•\nSan Antonio, Texas;\n•\nSan Francisco, California;\n•\nSan Jose, California;\n•\nVirginia Beach, Virginia; and\n•\nWestfield, New Jersey.\nAfter selecting a site for development, we usually negotiate for the right to acquire the site either through an option or a long-term conditional contract. Options and long-term conditional contracts generally allow us to acquire an interest in the site after the completion of entitlements and shortly before the start of construction, which reduces development-related risks and preserves capital. However, as a result of competitive market conditions for land suitable for development, we have sometimes acquired and held land prior to construction for extended periods while entitlements are obtained. When acquiring improved land with existing commercial uses prior to development, any rent received in excess of expenses from these operations, which we consider to be incidental, is accounted for as a reduction in our investment in the development pursuit and not as net income. Any expenses relating to these operations, in excess of any rents received, are recognized in net income. In addition, we have previously identified, and may again in the future identify, opportunities to increase value by expanding the density of certain existing operating communities. We have also participated, and may in the future participate, in master planned or other large multi-use developments where we commit to build infrastructure (such as roads) to be used by other participants or commit to act as construction manager or general contractor in building structures or spaces for third parties (such as unimproved ground floor commercial space, municipal garages or parks). Costs we incur in connection with these activities may be accounted for as additional invested capital in the community or we may earn fee income for providing these services. Particularly with large scale, urban in-fill developments, we may engage in significant environmental remediation efforts to prepare a site for construction. For further discussion of our Development Rights, refer to"
}