{
  "ticker": "AVGO",
  "cik": "0001730168",
  "company_name": "Broadcom Inc.",
  "filing_date": "2024-12-20",
  "accession": "0001730168-24-000139",
  "primary_doc": "avgo-20241103.htm",
  "item1_text": "Item 1. \nBusiness\n under “Seasonality” of this Annual Report on Form 10-K.\nDistributors and original equipment manufacturers (“OEMs”), or their contract manufacturers, typically account for the substantial majority of our semiconductor sales. To serve customers around the world, we have strategically developed relationships with large global electronic component distributors, complemented by a number of regional distributors with customer relationships based on their respective product ranges. We have established strong relationships with leading OEM customers across multiple target markets. Our direct sales force focuses on supporting our large OEM customers and has specialized product and service knowledge that enables us to sell specific offerings at key levels throughout a customer’s organization. Certain customers require us to contract with them directly and with specified intermediaries, such as contract manufacturers. Many of our major customer relationships have been in place for many years and are often the result of years of collaborative product development. This has enabled us to build our extensive IP portfolio and develop critical expertise regarding our customers’ requirements, including substantial system-level knowledge. This collaboration has provided us with key insights into our customers' businesses and has enabled us to be more efficient and productive and to better serve our target markets and customers. We recognize revenue upon the delivery of our products to the distributors, which can cause our quarterly net revenue to fluctuate significantly. Such revenue is reduced for estimated returns and distributor allowances. \n37\nTable of Contents\nOur software customers generally consist of large enterprises that have computing environments from multiple vendors and are highly complex. Our private cloud infrastructure suite of solutions are available directly from Broadcom, resellers and distributors, hyperscale cloud providers, value-added OEMs and VMware cloud service provider partners. VMware Cloud Foundation (“VCF”) provides license portability, which enables customers to purchase subscriptions of VCF software and move their VCF environments between on-premises data centers and supported cloud endpoints. We remain focused on strengthening relationships and increasing penetration within our existing core, mainframe, VMware, and Symantec endpoint customers and expanding the adoption of our enterprise software offerings with these customers. We believe our enterprise-wide license model will continue to offer our customers reduced complexity, more flexibility and an easier renewal process that will help drive revenue growth.\nCosts and Expenses\nCost of products sold.\n  Cost of products sold consists primarily of the costs for semiconductor wafers and other materials, as well as the costs of assembling and testing those products and materials. Such costs include personnel and overhead related to our manufacturing operations, which include stock-based compensation expense, related occupancy, computer services, equipment costs, manufacturing quality, order fulfillment, warranty adjustments, and inventory adjustments including write-downs for inventory obsolescence. \nAlthough we outsource a significant portion of our manufacturing activities, we do have some proprietary semiconductor fabrication facilities. If we are unable to utilize our owned fabrication facilities at a desired level, the fixed costs associated with these facilities will not be fully absorbed, resulting in higher average unit costs and lower gross margins.\nCost of subscriptions and services.\n  Cost of subscriptions and services consists of personnel, project costs associated with professional services or support of our subscriptions and services revenue, and allocated facilities costs and other corporate expenses. Personnel costs include stock-based compensation expense.\nTotal cost of revenue also includes amortization of acquisition-related intangible assets and restructuring charges.\nResearch and development.\n  Research and development expense consists primarily of personnel costs for our engineers engaged in the design and development of our products and technologies, including stock-based compensation expense. These expenses also include project material costs, third-party fees paid to consultants, prototype development expense, allocated facilities costs and other corporate expenses and computer services costs related to supporting computer tools used in the engineering and design process.\nSelling\n, \ngeneral and administrative.\n  Selling expense consists primarily of compensation and associated costs for sales and marketing personnel, including stock-based compensation expense, sales commissions paid to our independent sales representatives, advertising costs, trade shows, corporate marketing, promotion, travel related to our sales and marketing operations, related occupancy and equipment costs, and other marketing costs. General and administrative expense consists primarily of compensation and associated costs for executive management, finance, human resources and other administrative personnel, including stock-based compensation expense, outside professional fees, allocated facilities costs, acquisition-related costs, which include direct transaction costs and integration costs, and other corporate expenses.\nAmortization of acquisition-related intangible assets.\n  In connection with our acquisitions, we recognize intangible assets that are amortized over their estimated useful lives. We also recognize goodwill, which is not amortized, and in-process research and development (“IPR&D”), which is initially capitalized as an indefinite-lived intangible asset, in connection with our acquisitions. Upon completion of each underlying project, IPR&D assets are reclassified as amortizable purchased intangible assets and amortized over their estimated useful lives.\nRestructuring and other charges.  \nRestructuring and other charges consist primarily of non-recurring charges related to compensation costs associated with employee exit programs, IP litigation, alignment of our global manufacturing operations, rationalization of product development program costs, facility and lease abandonments, fixed asset impairment, IPR&D impairment, and other exit costs, including curtailment of service or supply agreements.\nInterest expense. \n Interest expense includes coupon interest, commitment fees, accretion of original issue discount, amortization of debt premiums and debt issuance costs, and expenses related to debt modifications or extinguishments. \nOther income (expense), net.\n  Other income (expense), net includes interest income, gains and losses on investments, foreign currency remeasurement, and other miscellaneous items.\nProvision for income taxes.\n  We benefit from the tax incentives extended to us in various jurisdictions to encourage investment or employment. Our tax incentives from the Singapore Economic Development Board provide that any qualifying income earned in Singapore is subject to tax incentives or reduced rates of Singapore income tax, subject to our compliance with the conditions specified in these incentives and legislative developments. These Singapore tax incentives are scheduled \n38\nTable of Contents\nto expire in November 2030. The corporate income tax rate in Singapore that would otherwise apply to us would be 17%. We also have a tax holiday from our qualifying income earned in Malaysia, which is scheduled to expire in 2028.\nEach tax incentive and tax holiday is subject to our compliance with various operating and other conditions. If we cannot, or elect not to, comply with any such operating conditions specified, we could, in some instances, be required to refund previously realized material tax benefits, or if such tax incentive or tax holiday is terminated prior to its expiration absent a new incentive applying, we will lose the related tax benefits earlier than scheduled. We may elect to modify our operational structure and tax strategy, which may not be as beneficial to us as the benefits provided under the present tax concession arrangements. Before taking into consideration the effects of the U.S. Tax Cuts and Jobs Act and other indirect tax impacts, the effect of these tax incentives and tax holiday decreased the provision for income taxes by approximately $2,261 million and $2,104 million for fiscal years 2024 and 2023, respectively.\nOur interpretations and conclusions regarding the tax incentives are not binding on any taxing authority, and if our assumptions about tax and other laws are incorrect, the benefits of the tax incentives may be adversely affected.\nCritical Accounting Estimates\nThe preparation of financial statements in accordance with generally accepted accounting principles in the United States (“GAAP”) requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. We base our estimates and assumptions on current facts, historical experience and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. Our actual financial results may differ materially and adversely from our estimates. Our critical accounting policies are those that affect our financial statements materially and involve difficult, subjective or complex judgments by management. Those policies include revenue recognition, business combinations, valuation of goodwill and long-lived assets, and income taxes. See Note 2. “Summary of Significant Accounting Policies” included in Part II, Item 8 of this Annual Report on Form 10-K for further information on our critical accounting policies and estimates.\nRevenue recognition. \n We account for a contract with a customer when both parties have approved the contract and are committed to perform their respective obligations, each party’s rights can be identified, payment terms can be identified, the contract has commercial substance, and it is probable we will collect substantially all of the consideration we are entitled to. Revenue is recognized when, or as, performance obligations are satisfied by transferring control of a promised product or service to a customer. Our products and services can be broadly categorized as sales of products and subscriptions and services. \nWe recognize products revenue from sales to direct customers and distributors when control transfers to the customer. An allowance for distributor credits covering price adjustments is made based on our estimate of historical experience rates as well as considering economic conditions and contractual terms. To date, actual distributor claims activity has been materially consistent with the provisions we have made based on our historical estimates. However, because of the inherent nature of estimates, there is always a risk that there could be significant differences between actual amounts and our estimates. Different judgments or estimates could result in variances that might be significant to reported operating results. We also record reductions of revenue for rebates in the same period that the related revenue is recorded. We accrue 100% of potential rebates at the time of sale. We reverse the accrual of unclaimed rebate amounts as specific rebate programs contractually end and when we believe unclaimed rebates are no longer subject to payment and will not be paid. Thus, the reversal of unclaimed rebates may have a positive impact on our net revenue and net income in subsequent periods.\nBusiness combinations. \n Accounting for business combinations requires our management to make significant estimates and assumptions, especially at the acquisition date, for intangible assets, contractual obligations assumed, restructuring liabilities, pre-acquisition contingencies, and contingent consideration, where applicable. Although we believe the assumptions and estimates we have made in the past have been reasonable and appropriate, they are based, in part, on historical experience and information obtained from the management of the acquired companies and are inherently uncertain. Critical estimates in valuing certain acquired intangible assets include, the present value of projected cash flows regarding the projected revenues, projected expenses which include cost of revenue, research and development and selling, general and administrative expenses, technology obsolescence rate, contributory asset charges, discount rate and income tax rate for developed technology; the projected revenues, customer retention rate, customer ramp up period, discount rate and income tax rate for the customer contracts and related relationships; the projected revenues, technology obsolescence rate, expected costs to develop IPR&D into commercially viable products, discount rate and income tax rate for the IPR&D; and the projected revenues, brand asset phase-out pattern, brand asset royalty rate, discount rate and the income tax rate for the trade name. Unanticipated events and circumstances may occur which could affect the accuracy or validity of such assumptions, estimates or actual results.\n39\nTable of Contents\nValuation of goodwill and long-lived assets. \n We perform an annual impairment review of our goodwill during the fourth fiscal quarter of each year, and more frequently if we believe indicators of impairment exist. The process of evaluating the potential impairment of goodwill is highly subjective and requires significant judgment. To review for impairment, we first assess qualitative factors to determine whether events or circumstances lead to a determination that it is more likely than not that the fair value of any of our reporting units is less than its carrying amount. Our qualitative assessment of the recoverability of goodwill, whether performed annually or based on specific events or circumstances, considers various macroeconomic, industry-specific and company-specific factors. These factors include: (i) severe adverse industry or economic trends; (ii) significant company-specific actions, including exiting an activity in conjunction with restructuring of operations; (iii) current, historical or projected deterioration of our financial performance; or (iv) a sustained decrease in our market capitalization below our net book value. After assessing the totality of events and circumstances, if we determine that it is not more likely than not that the fair value of any of our reporting units is less than its carrying amount, no further assessment is performed. If we determine that it is more likely than not that the fair value of any of our reporting units is less than its carrying amount, we calculate the fair value of that reporting unit and compare the fair value to the reporting unit’s net book value. \nDetermining the fair value of a reporting unit involves the use of significant estimates and assumptions. Our goodwill impairment test uses both the income approach and the market approach to estimate a reporting unit's fair value. The income approach is based on the discounted cash flow method that uses the reporting unit estimates for forecasted future financial performance, including revenues, operating expenses, and taxes, as well as working capital and capital asset requirements. These estimates are developed as part of our long-term planning process based on assumed market segment growth rates and our assumed market segment share, estimated costs based on historical data and various internal estimates. Projected cash flows are then discounted to a present value employing a discount rate that properly accounts for the estimated market weighted-average cost of capital, as well as any risk unique to the subject cash flows. The market approach is based on weighting the financial multiples of comparable companies and applying a control premium. A reporting unit's carrying value represents the assignment of various assets and liabilities, excluding certain corporate assets and liabilities, such as cash and debt. \nWe assess the impairment of long-lived assets, including purchased IPR&D, property, plant and equipment, right-of-use assets, and intangible assets, whenever events or changes in circumstances indicate that the carrying value of such assets may not be recoverable. Factors we consider important which could trigger an impairment review include: (i) significant under-performance relative to historical or projected future operating results, (ii) significant changes in the manner of our use of the acquired assets or the strategy for our overall business, or (iii) significant negative industry or economic trends. The process of evaluating the potential impairment of long-lived assets under the accounting guidance on property, plant and equipment, and intangible assets is also highly subjective and requires significant judgment. In order to estimate the fair value of long-lived assets, we typically make various assumptions about the future prospects of our business or the part of our business to which the long-lived assets relate. We also consider market factors specific to the business and estimate future cash flows to be generated by the business, which requires significant judgment as it is based on assumptions about market demand for our products over a number of future years. Based on these assumptions and estimates, we determine whether we need to take an impairment charge to reduce the value of the long-lived assets stated on our consolidated balance sheets to reflect their estimated fair value. Assumptions and estimates about future values and remaining useful lives are complex and often subjective. They can be affected by a variety of factors, including external factors, such as the real estate market, industry and economic trends, and internal factors, such as changes in our business strategy and our internal forecasts. Although we believe the assumptions and estimates we have made in the past have been reasonable and appropriate, changes in assumptions and estimates could materially impact our reported financial results.\nIncome taxes.\n  Significant management judgment is required in developing our provision for or benefit from income taxes, including the determination of deferred tax assets and liabilities and any valuation allowances that might be required against the deferred tax assets. We have considered projected future taxable income and ongoing prudent and feasible tax planning strategies in assessing the need for valuation allowances. An adjustment to the valuation allowance will either increase or decrease our provision for or benefit from income taxes in the period such determination is made. In evaluating the exposure associated with various tax filing positions, we accrue an income tax liability when such positions do not meet the more-likely-than-not threshold for recognition.\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in a multitude of jurisdictions. We recognize potential liabilities for anticipated tax audit issues in the U.S. and other tax jurisdictions based on our estimate of whether, and the extent to which, additional taxes, interest, and penalties will be due. If our estimate of income tax liabilities proves to be less than the actual amount ultimately assessed, a further charge to tax expense would be required. If the payment of these amounts ultimately proves to be unnecessary, the reversal of the accrued liabilities would result in tax benefits being recognized in the period when we determine the liabilities no longer exist.\n40\nTable of Contents\nFiscal Year Presentation\nWe operate on a 52- or 53-week fiscal year ending on the Sunday closest to October 31. Our fiscal year 2024 was a 53-week fiscal year. Fiscal years 2023 and 2022 each consisted of 52 weeks. \nThe financial statements included in Part II, Item 8 of this Annual Report on Form 10-K are presented in accordance with GAAP and expressed in U.S. dollars.\n41\nTable of Contents\nResults of Operations\nFiscal Year 2024 Compared to Fiscal Year 2023\nThe following table sets forth our results of operations for the periods presented:\n \nFiscal Year Ended\nNovember 3,\n2024\nOctober 29,\n2023\nNovember 3,\n2024\nOctober 29,\n2023\n \n(In millions)\n(As a percentage of net revenue)\nStatements of Operations Data:\n \n \n \n \nNet revenue:\nProducts\n$\n30,359 \n$\n27,891 \n59 \n%\n78 \n%\nSubscriptions and services\n21,215 \n7,928 \n41 \n22 \nTotal net revenue\n51,574 \n35,819 \n100 \n100 \nCost of revenue:\nCost of products sold\n9,797 \n8,636 \n19 \n24 \nCost of subscriptions and services\n2,991 \n636 \n6 \n2 \nAmortization of acquisition-related intangible assets\n6,023 \n1,853 \n12 \n5 \nRestructuring charges\n254 \n4 \n— \n— \nTotal cost of revenue\n19,065 \n11,129 \n37 \n31 \nGross margin\n32,509 \n24,690 \n63 \n69 \nResearch and development\n9,310 \n5,253 \n18 \n15 \nSelling, general and administrative\n4,959 \n1,592 \n10 \n4 \nAmortization of acquisition-related intangible assets\n3,244 \n1,394 \n6 \n4 \nRestructuring and other charges\n1,533 \n244 \n3 \n1 \nTotal operating expenses\n19,046 \n8,483 \n37 \n24 \nOperating income\n$\n13,463 \n$\n16,207 \n26 \n%\n45 \n%\nNet Revenue\nA relatively small number of customers account for a significant portion of our net revenue. Direct sales to one customer, which is a distributor, accounted for 28% and 21% of our net revenue for fiscal years 2024 and 2023, respectively. \nWe believe aggregate sales to our top five end customers, through all channels, accounted for approximately 40% and 35% of our net revenue for fiscal years 2024 and 2023, respectively. We expect to continue to experience significant customer concentration in future periods. The loss of, or significant decrease in demand from, any of our top five end customers could have a material adverse effect on our business, results of operations and financial condition. \nFrom time to time, some of our key semiconductor customers place large orders or delay orders, causing our quarterly net revenue to fluctuate significantly. This is particularly true of our products used in AI and wireless applications as fluctuations may be magnified by the timing of customer deployments and product launches, and seasonal variations in sales. In addition, the macroeconomic environment remains uncertain and may cause our net revenue to fluctuate significantly and impact our results of operations.\nAlthough we recognize revenue for the majority of our products when title and control transfer in Penang, Malaysia, we disclose net revenue by country based primarily on the geographic shipment or delivery location specified by our distributors, OEMs, contract manufacturers, channel partners, or software customers. In fiscal years 2024 and 2023, 20% and 32%, respectively, of our net revenue came from shipments or deliveries to China (including Hong Kong). However, the end customers for either our products or for the end products into which our products are incorporated, are frequently located in countries other than China (including Hong Kong). As a result, we believe that a substantially smaller percentage of our net revenue is ultimately dependent on sales of either our product or our customers’ product incorporating our product, to end customers located in China (including Hong Kong). \n42\nTable of Contents\nThe following tables set forth net revenue by segment for the periods presented:\nFiscal Year Ended\nNet Revenue by Segment\nNovember 3,\n2024\nOctober 29,\n2023\n$ Change\n% Change\n(In millions, except percentages)\nSemiconductor solutions\n$\n30,096 \n$\n28,182 \n$\n1,914 \n7 \n%\nInfrastructure software\n21,478 \n7,637 \n13,841 \n181 \n%\nTotal net revenue\n$\n51,574 \n$\n35,819 \n$\n15,755 \n44 \n%\nFiscal Year Ended\nNet Revenue by Segment\nNovember 3, 2024\nOctober 29, 2023\n(As a percentage of net revenue)\nSemiconductor solutions\n58 \n%\n79 \n%\nInfrastructure software\n42 \n21 \nTotal net revenue\n100 \n%\n100 \n%\nNet revenue from our semiconductor solutions segment increased due to strong product demand for our networking products, primarily AI networking products, partially offset by lower demand for our broadband and server storage products. Net revenue from our infrastructure software segment increased primarily due to contributions from VMware.\nGross Margin\nGross margin was $32,509 million for fiscal year 2024 compared to $24,690 million for fiscal year 2023. The increase was primarily due to contributions from VMware, partially offset by higher amortization of acquisition-related intangible assets from the VMware Merger.\nAs a percentage of net revenue, gross margin was 63% and 69% of net revenue for the fiscal years 2024 and 2023, respectively. The decrease was primarily due to higher amortization of acquisition-related intangible assets from the VMware Merger. In addition, gross margin contributions from our infrastructure software segment were partially offset by less favorable margin within the semiconductor solutions segment driven by product mix.  \nResearch and Development Expense\nResearch and development expense increased $4,057 million, or 77%, in fiscal year 2024, compared to the prior fiscal year. The increase was primarily due to higher compensation, including higher stock-based compensation, as a result of an increase in headcount from the VMware Merger. The increase in stock-based compensation expense was also due to annual employee equity awards granted at higher grant-date fair values.\nSelling, General and Administrative Expense\nSelling, general and administrative expense increased $3,367 million, or 211%, in fiscal year 2024, compared to the prior fiscal year. The increase was primarily due to higher compensation, including higher stock-based compensation, as a result of an increase in headcount from the VMware Merger. The increase in stock-based compensation expense was also due to annual employee equity awards granted at higher grant-date fair values.\nAmortization of Acquisition-Related Intangible Assets\nAmortization of acquisition-related intangible assets recognized in operating expenses increased $1,850 million, or 133%, in fiscal year 2024, compared to the prior fiscal year primarily due to higher amortization of customer-related intangible assets from the VMware Merger.\nRestructuring and Other Charges\nRestructuring and other charges recognized in operating expenses were $1,533 million and $244 million in fiscal years 2024 and 2023, respectively. The fiscal year 2024 charges primarily included employee termination costs from cost reduction activities related to the VMware Merger. The fiscal year 2023 charges primarily included non-recurring charges related to IP litigation.\n43\nTable of Contents\nStock-Based Compensation Expense\nTotal stock-based compensation expense was $5,670 million and $2,171 million for fiscal years 2024 and 2023, respectively. The increase was primarily due to equity awards assumed and granted in connection with the VMware Merger and annual employee equity awards granted at higher grant-date fair values.\nThe following table sets forth the total unrecognized compensation cost related to unvested stock-based awards outstanding and expected to vest as of November 3, 2024. The remaining weighted-average service period was 3.0 years. \nFiscal Year:\nUnrecognized Compensation Cost, Net of Expected Forfeitures\n(In millions)\n2025\n$\n4,429 \n2026\n3,607 \n2027\n2,643 \n2028\n580 \nTotal\n$\n11,259 \nDuring the first quarter of fiscal year ended November 3, 2019 (“fiscal year 2019”), our Compensation Committee approved a broad-based program of multi-year equity grants of time- and market-based RSUs (the “Multi-Year Equity Awards”) in lieu of our annual employee equity awards historically granted on March 15 of each year. Each Multi-Year Equity Award vests on the same basis as four annual grants made on March 15 of each year, beginning in fiscal year 2019, with successive four-year vesting periods. We recognize stock-based compensation expense related to the Multi-Year Equity Awards from the grant date through their respective vesting date, ranging from 4 years to 7 years.\nSegment Operating Results \nFiscal Year Ended\nOperating Income by Segment\nNovember 3, 2024\nOctober 29, 2023\n$ Change\n% Change\n(In millions, except percentages)\nSemiconductor solutions\n$\n16,759 \n$\n16,486 \n$\n273 \n2 \n%\nInfrastructure software\n13,977 \n5,639 \n8,338 \n148 \n%\nUnallocated expenses\n(17,273)\n(5,918)\n(11,355)\n192 \n%\nTotal operating income\n$\n13,463 \n$\n16,207 \n$\n(2,744)\n(17)\n%\nOperating income from our semiconductor solutions segment increased mainly driven by revenue growth from networking products, primarily AI networking products, partially offset by lower net revenue from our broadband and server storage products. Operating income from our infrastructure software segment increased primarily due to contributions from VMware.\nUnallocated expenses include amortization of acquisition-related intangible assets; stock-based compensation expense; restructuring and other charges; acquisition-related costs; and other costs that are not used in evaluating the results of, or in allocating resources to, our segments. Unallocated expenses increased 192% in fiscal year 2024, compared to the prior fiscal year, primarily due to higher amortization of acquisition-related intangible assets, stock-based compensation expense and restructuring and other charges. These increases were primarily due to the VMware Merger. The increase in stock-based compensation expense was also due to \nannual employee equity awards granted at higher grant-date fair values\n.\nNon-Operating Income and Expenses\nInterest expense.\n  Interest expense was $3,953 million and $1,622 million for fiscal years 2024 and 2023, respectively. The increase was primarily due to interest on debt incurred for the VMware Merger.\nOther income (expense), net.  \nOther income (expense), net includes interest income, gains and losses on investments, foreign currency remeasurement and other miscellaneous items. Other income, net, was $406 million and $512 million for fiscal years 2024 and 2023, respectively. The decrease was primarily due to lower interest income as a result of a lower invested balance.\n44\nTable of Contents\nProvision for income taxes.\n  The provision for income taxes was $3,748 million and $1,015 million for fiscal years 2024 and 2023, respectively. The increase was primarily due to the impact of a non-recurring intra-group transfer of certain IP rights to the United States as a result of supply chain realignment and the resulting shift in the jurisdictional mix of income.\nLiquidity and Capital Resources\nThe following section discusses our principal liquidity and capital resources as well as our primary liquidity requirements and uses of cash. Our cash and cash equivalents are maintained in highly liquid investments with remaining maturities of 90 days or less at the time of purchase. We believe our cash equivalents are liquid and accessible. \nOur primary sources of liquidity as of November 3, 2024 consisted of: (i) $9,348 million in cash and cash equivalents, (ii) cash we expect to generate from operations and (iii) available capacity under our $7.5 billion unsecured revolving credit facility. In addition, we may also generate cash from the sale of assets and debt or equity financings from time to time.\nOur short-term and long-term liquidity requirements primarily arise from: (i) business acquisitions and investments we may make from time to time, (ii) working capital requirements, (iii) research and development and capital expenditure needs, (iv) cash dividend payments (if and when declared by our Board of Directors), (v) interest and principal payments related to our $69,847 million of outstanding indebtedness, and (vi) payment of income taxes. Our ability to fund these requirements will depend, in part, on our future cash flows, which are determined by our future operating performance and, therefore, subject to prevailing global macroeconomic conditions and financial, business and other factors, some of which are beyond our control. We expect capital expenditures to be higher in the fiscal year ending November 2, 2025 as compared to fiscal year 2024. Our debt and liquidity needs increased in fiscal year 2024 as a result of completing the VMware Merger. We funded the cash portion of the consideration with net proceeds from the issuance of $30,390 million in term loans (the “2023 Term Loans”), as well as cash on hand. We also assumed $8,250 million of VMware’s outstanding senior unsecured notes. During fiscal year 2024, we made repayments of $16,795 million on our 2023 Term Loans.\nWe believe that our cash and cash equivalents on hand, cash flows from operations and our revolving credit facility will provide sufficient liquidity to operate our business and fund our current and assumed obligations for at least the next 12 months. For additional information regarding our cash requirement from contractual obligations, indebtedness and lease obligations, see Note 14. “Commitments and Contingencies”, Note 10. “Borrowings” and Note 6. “Leases” in Part II, Item 8 of this Annual Report on Form 10-K.\nFrom time to time, we engage in discussions with third parties regarding potential acquisitions of, or investments in, businesses, technologies and product lines. Any such transaction, or evaluation of potential transactions, could require significant use of our cash and cash equivalents, or require us to increase our borrowings to fund such transactions. If we do not have sufficient cash to fund our operations or finance growth opportunities, including acquisitions, or unanticipated capital expenditures, our business and financial condition could suffer. In such circumstances, we may seek to obtain new debt or equity financing. However, we cannot assure you that such additional financing will be available on terms acceptable to us or at all. Our ability to service our senior unsecured notes, the 2023 Term Loans and any other indebtedness we may incur will depend on our ability to generate cash in the future. We may also elect to sell additional debt or equity securities for reasons other than those specified above.\nIn addition, we may, at any time and from time to time, seek to retire or purchase our outstanding debt through cash tenders and/or exchanges for equity or debt, in open-market purchases, privately negotiated transactions or otherwise. Such tenders, exchanges or purchases, if any, will be upon such terms and at such prices as we may determine, and will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. We may also make additional prepayments of the 2023 Term Loans. The amounts involved may be material. \n45\nTable of Contents\nWorking Capital\nOn November 22, 2023, we completed the VMware Merger. The following table presents the changes in selected balance sheet captions other than assets acquired and liabilities assumed from the VMware Merger during fiscal year 2024.\nBalances at \nOctober 29, \n2023\nBalances Acquired and Assumed from VMware (a)\nBalances at \nNovember 3, \n2024\nNon-VMware Acquisition \nChange\n(In millions)\nTrade accounts receivable, net\n$\n3,154 \n$\n3,571 \n$\n4,416 \n$\n(2,309)\nOther current assets\n$\n1,606 \n$\n1,108 \n$\n4,071 \n$\n1,357 \nAccounts payable\n$\n1,210 \n$\n359 \n$\n1,662 \n$\n93 \nEmployee compensation and benefits\n$\n935 \n$\n848 \n$\n1,971 \n$\n188 \nCurrent portion of long-term debt\n$\n1,608 \n$\n1,264 \n$\n1,271 \n$\n(1,601)\nOther current liabilities\n$\n3,652 \n$\n11,217 \n$\n11,793 \n$\n(3,076)\n_____________________________\n(a)\nExcludes VMware’s EUC assets and liabilities held for sale. \n•\nTrade accounts receivable, net decreased primarily due to strong collections and additional receivables sold through factoring arrangements.\n•\nOther current assets increased from higher contract assets due to the timing of software revenue recognition.\n•\nCurrent portion of long-term debt decreased primarily due to $2,813 million of repayments, offset in part by $1,245 million becoming due within the next twelve months.\n•\nOther current liabilities decreased primarily from lower contract liabilities as software revenue was recognized from previous software contracts. \nCapital Returns\nFiscal Year Ended\nCash Dividends Declared and Paid\nNovember 3, 2024\nOctober 29, 2023\n(In millions, except per share data)\nDividends per share to common stockholders\n$\n2.105 \n$\n1.840 \nDividends to common stockholders\n$\n9,814 \n$\n7,645 \nIn December 2021, our Board of Directors authorized a stock repurchase program to repurchase up to $10 billion of our common stock from time to time through December 31, 2022, which was subsequently extended to December 31, 2023. In May 2022, our Board of Directors authorized another stock repurchase program to repurchase up to an additional $10 billion of our common stock from time to time through December 31, 2023. During fiscal years 2024 and 2023, we repurchased and retired approximately 67 million and 91 million shares of our common stock for $7,176 million and $5,824 million, respectively. All $20 billion of the authorized amount under these stock repurchase programs was utilized prior to expiration on December 31, 2023. \n46\nTable of Contents\nDuring fiscal years 2024 and 2023, we paid approximately $5,216 million and $1,861 million, respectively, in employee withholding taxes due upon the vesting of net settled equity awards. We withheld approximately 38 million and 26 million shares of common stock from employees in connection with such net share settlements during fiscal years 2024 and 2023, respectively.\nCash Flows\n \nFiscal Year Ended\nNovember 3, 2024\nOctober 29, 2023\n(In millions)\nNet cash provided by operating activities\n$\n19,962 \n$\n18,085 \nNet cash used in investing activities\n(23,070)\n(689)\nNet cash used in financing activities\n(1,733)\n(15,623)\nNet change in cash and cash equivalents\n$\n(4,841)\n$\n1,773 \nOperating Activities\nCash flows from operating activities consisted of net income adjusted for certain non-cash and other items and changes in assets and liabilities. The $1,877 million increase in cash provided by operations during fiscal year 2024 compared to fiscal year 2023 was primarily due to contributions from VMware. The $8,187 million decrease in net income was largely driven by $13,058 million higher non-cash adjustments including amortization of intangible assets, stock-based compensation, and deferred taxes and other non-cash taxes related to the VMware Merger. \nInvesting Activities \nCash flows from investing activities primarily consisted of cash used for acquisitions, proceeds from the sale of a business, capital expenditures, and proceeds and payments related to investments. The $22,381 million increase in cash used in investing activities for fiscal year 2024 compared to fiscal year 2023 was primarily due to a $25,925 million increase in cash used for acquisitions due to the VMware Merger and the acquisition of Seagate’s SoC operations, net of cash acquired, offset in part by $3,485 million proceeds from the sale of the EUC business. \nFinancing Activities\nCash flows from financing activities primarily consisted of proceeds and payments related to our long-term borrowings, dividend payments, stock repurchases, and employee withholding tax payments related to net settled equity awards. The $13,890 million increase in cash flows from financing activities for fiscal year 2024 compared to fiscal year 2023 was primarily due to $39,954 million of net proceeds from the 2023 Term Loans and the issuance of senior notes, offset in part by a $19,205 million increase in payments on debt obligations, a $3,355 million increase in employee withholding tax payments related to net settled equity awards, a $2,169 million increase in dividend payments, and a $1,352 million increase in stock repurchases.\nITEM 7A.     QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nForeign Currency Exchange Risk\nFrom time to time, we use foreign exchange forward contracts to hedge a portion of our exposures to changes in currency exchange rates, which result from our global operating and financing activities. We do not use derivative financial instruments for trading or speculative purposes. A hypothetical 10% change in currency exchange rates would not have a material impact on our consolidated financial statements.\n47\nTable of Contents\nInterest Rate Risk\nChanges in interest rates affect the fair value of our outstanding fixed rate senior notes. As of November 3, 2024 and October 29, 2023, we had $56.3 billion and $40.8 billion in principal amount of fixed rate senior notes outstanding, and the estimated aggregate fair value of these senior notes was $51.4 billion and $33.2 billion, respectively. As of November 3, 2024 and October 29, 2023, a hypothetical 50 basis point increase or decrease in market interest rates would change the fair value of our fixed rate senior notes by approximately $1.7 billion and $1.4 billion, respectively. However, this hypothetical change in interest rates would not impact the interest expense on our fixed rate senior notes outstanding. To hedge variability of cash flows due to changes in the benchmark interest rate of anticipated future debt issuances, we have entered, and in the future may enter, into treasury rate lock contracts.\nAs of November 3, 2024, we had $13.6 billion of outstanding 2023 Term Loans, which are subject to floating interest rates. A hypothetical 100 basis point change in the interest rate would increase or decrease the interest expense on the 2023 Term Loans for the next 12 months by approximately $137 million. The carrying value of the 2023 Term Loans approximates their fair value as the underlying interest rates are tied to the Secured Overnight Financing Rate. We had no floating rate debt outstanding as of October 29, 2023. \n48\nTable of Contents\nITEM 8.     FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA \nBROADCOM INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\n \nPage\nReport of Independent Registered Public Accounting Firm\n (PCAOB ID \n238\n)\n50\nConsolidated Balance Sheets\n51\nConsolidated Statements of Operations\n52\nConsolidated Statements of Comprehensive Income\n53\nConsolidated Statements of Cash Flows\n54\nConsolidated Statements of Stockholders' Equity\n55\nNotes to Consolidated Financial Statements\n56\nSchedule II — Valuation and Qualifying Accounts\n92\n49\nTable of Contents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Broadcom Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Broadcom Inc. and its subsidiaries (the “Company”) as of November 3, 2024 and October 29, 2023, and the related consolidated statements of operations, of comprehensive income, of stockholders’ equity and of cash flows for each of the three years in the period ended November 3, 2024, including the related notes and financial statement schedule listed in the index appearing under Item 15(a)(2) (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of November 3, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of November 3, 2024 and October 29, 2023, and the results of its operations and its cash flows for each of the three years in the period ended November 3, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of November 3, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management’s Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAcquisition of VMware — Valuation of VMware Cloud Foundation (“VCF”) Developed Technology, Certain Customer Contracts and Related Relationships, VCF In-process Research and Development, and VMware Trade Name Intangible Assets\nAs described in Notes 2 and 4 of the consolidated financial statements, on November 22, 2023, the Company completed the acquisition of VMware LLC for total consideration of $86,290 million. The Company acquired $45,572 million of intangible assets in connection with the acquisition. Of these acquired intangible assets, $24,156 million related to developed technology valued using the multi-period excess earnings method under the income approach, of which a significant portion related to VCF; $15,239 million related to customer contracts and related relationships valued using the with-and-without method under the income approach, of which a significant portion related to certain customer contracts and relationships; $4,730 million related to in-process research and development valued using the multi-period excess earnings method under the income approach, of which $4,705 million related to VCF; and $1,205 million related to trade names valued using the relief-from-royalty method, of which a significant portion related to the VMware trade name. The present value of projected cash flows included significant judgment and assumptions regarding (a) the projected revenues, projected expenses, technology obsolescence rate, contributory asset charges, and the discount rate for the VCF developed technology, (b) the projected revenues, customer retention rate, customer ramp up period, and the discount rate for the certain customer contracts and related relationships, (c) the projected revenues, technology obsolescence rate and the discount rate for the VCF in-process research and development, and (d) the projected revenues, brand asset phase-out pattern, brand asset royalty rate, and the discount rate for the VMware trade name.\nThe principal considerations for our determination that performing procedures relating to the valuation of the VCF developed technology, certain customer contracts and related relationships, VCF in-process research and development, and the VMware trade name intangible assets acquired in the VMware acquisition is a critical audit matter are (i) the significant judgment by management when developing the fair value estimates; (ii) a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating management’s significant assumptions related to (a) the projected revenues, projected expenses, technology obsolescence rate, contributory asset charges, and discount rate for the VCF developed technology, (b) certain projected revenues, customer retention rate, customer ramp up period, and discount rate for the certain customer contracts and related relationships, (c) the projected revenues, technology obsolescence rate and discount rate for the VCF in-process research and development, and (d) certain projected revenues, brand asset phase-out pattern, brand asset royalty rate, and discount rate for the VMware trade name (collectively referred to as “the aforementioned significant assumptions”); and (iii) the audit effort involved the use of professionals with specialized skill and knowledge.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the acquisition accounting, including controls over management’s valuation of the acquired developed technology, customer contracts and related relationships, in-process research and development, and the trade names. These procedures also included, among others, (i) reading the purchase agreement; (ii) testing management’s process for developing the fair value estimate of the acquired VCF developed technology, certain customer contracts and related relationships, VCF in-process research and development, and the VMware trade name; (iii) evaluating the appropriateness of the multi-period excess earnings, with-and-without, and relief-from-royalty methods used by management; (iv) testing the completeness and accuracy of underlying data used in the multi-period excess earnings, with-and-without, and relief-from-royalty methods; and (v) evaluating the reasonableness of the aforementioned significant assumptions used by management. Evaluating management’s assumptions related to (a) the projected revenues and projected expenses for the VCF developed technology, (b) certain projected revenues, customer retention rate, and customer ramp up period for the certain customer contracts and related relationships, (c) projected revenues for the VCF in-process research and development, and (d) certain projected revenues for the VMware trade name involved considering (i) the current and past performance of VMware; (ii) the consistency with external market and industry data; and (iii) whether the assumptions were consistent with evidence obtained in other areas of the audit. Professionals with specialized skill and knowledge were used to assist in (i) evaluating the appropriateness of multi-period excess earnings, with-and-without, and relief-from-royalty methods and (ii) the reasonableness of (a) the technology obsolescence rate, contributory asset charge, and discount rate for the VCF developed technology, (b) the discount rate for the certain customer contracts and related relationships, (c) the technology obsolescence rate and discount rate for the VCF in-process research and development, and (d) brand asset phase-out pattern, brand asset royalty rate, and discount rate for the VMware trade name.   \n/s/ \nPricewaterhouseCoopers LLP\nSan Jose, California\nDecember 20, 2024\nWe have served as the Company’s auditor since 2006.\n50\nTable of Contents\nBROADCOM INC.\nCONSOLIDATED BALANCE SHEETS\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions, except par value)\nASSETS\n \n \nCurrent assets:\n \n \nCash and cash equivalents\n$\n9,348\n \n$\n14,189\n \nTrade accounts receivable, net\n4,416\n \n3,154\n \nInventory\n1,760\n \n1,898\n \nOther current assets\n4,071\n \n1,606\n \nTotal current assets\n19,595\n \n20,847\n \nLong-term assets:\nProperty, plant and equipment, net\n2,521\n \n2,154\n \nGoodwill\n97,873\n \n43,653\n \nIntangible assets, net\n40,583\n \n3,867\n \nOther long-term assets\n5,073\n \n2,340\n \nTotal assets\n$\n165,645\n \n$\n72,861\n \nLIABILITIES AND EQUITY\n \n \nCurrent liabilities:\n \n \nAccounts payable\n$\n1,662\n \n$\n1,210\n \nEmployee compensation and benefits\n1,971\n \n935\n \nCurrent portion of long-term debt\n1,271\n \n1,608\n \nOther current liabilities\n11,793\n \n3,652\n \nTotal current liabilities\n16,697\n \n7,405\n \nLong-term liabilities:\n \n \nLong-term debt\n66,295\n \n37,621\n \nOther long-term liabilities\n14,975\n \n3,847\n \nTotal liabilities\n97,967\n \n48,873\n \nCommitments and contingencies (Note 14)\nStockholders’ equity:\n \n \nPreferred stock, $\n0.001\n par value; \n100\n shares authorized; \nnone\n issued and outstanding \n—\n \n—\n \nCommon stock, $\n0.001\n par value; \n29,000\n shares authorized; \n4,686\n and \n4,139\n shares issued and outstanding as of November 3, 2024 and October 29, 2023, respectively\n5\n \n4\n \nAdditional paid-in capital\n67,466\n \n21,095\n \nRetained earnings\n—\n \n2,682\n \nAccumulated other comprehensive income\n207\n \n207\n \nTotal stockholders’ equity\n67,678\n \n23,988\n \nTotal liabilities and equity\n$\n165,645\n \n$\n72,861\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n51\nTable of Contents\nBROADCOM INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFiscal Year Ended\nNovember 3,\n2024\nOctober 29,\n2023\nOctober 30,\n2022\n(In millions, except per share data)\nNet revenue:\nProducts\n$\n30,359\n \n$\n27,891\n \n$\n26,277\n \nSubscriptions and services\n21,215\n \n7,928\n \n6,926\n \nTotal net revenue\n51,574\n \n35,819\n \n33,203\n \nCost of revenue:\n \nCost of products sold\n9,797\n \n8,636\n \n7,629\n \nCost of subscriptions and services\n2,991\n \n636\n \n627\n \nAmortization of acquisition-related intangible assets\n6,023\n \n1,853\n \n2,847\n \nRestructuring charges\n254\n \n4\n \n5\n \nTotal cost of revenue\n19,065\n \n11,129\n \n11,108\n \nGross margin\n32,509\n \n24,690\n \n22,095\n \nResearch and development\n9,310\n \n5,253\n \n4,919\n \nSelling, general and administrative\n4,959\n \n1,592\n \n1,382\n \nAmortization of acquisition-related intangible assets\n3,244\n \n1,394\n \n1,512\n \nRestructuring and other charges\n1,533\n \n244\n \n57\n \nTotal operating expenses\n19,046\n \n8,483\n \n7,870\n \nOperating income\n13,463\n \n16,207\n \n14,225\n \nInterest expense\n(\n3,953\n)\n(\n1,622\n)\n(\n1,737\n)\nOther income (expense), net\n406\n \n512\n \n(\n54\n)\nIncome from continuing operations before income taxes\n9,916\n \n15,097\n \n12,434\n \nProvision for income taxes\n3,748\n \n1,015\n \n939\n \nIncome from continuing operations\n6,168\n \n14,082\n \n11,495\n \nLoss from discontinued operations, net of income taxes\n(\n273\n)\n—\n \n—\n \nNet income\n5,895\n \n14,082\n \n11,495\n \nDividends on preferred stock\n—\n \n—\n \n(\n272\n)\nNet income attributable to common stock\n$\n5,895\n \n$\n14,082\n \n$\n11,223\n \nBasic income per share attributable to common stock:\nIncome per share from continuing operations\n$\n1.33\n \n$\n3.39\n \n$\n2.74\n \nLoss per share from discontinued operations\n(\n0.06\n)\n—\n \n—\n \nNet income per share\n$\n1.27\n \n$\n3.39\n \n$\n2.74\n \nDiluted income per share attributable to common stock:\nIncome per share from continuing operations\n$\n1.29\n \n$\n3.30\n \n$\n2.65\n \nLoss per share from discontinued operations\n(\n0.06\n)\n—\n \n—\n \nNet income per share\n$\n1.23\n \n$\n3.30\n \n$\n2.65\n \nWeighted-average shares used in per share calculations:\n \nBasic\n4,624\n \n4,149\n \n4,089\n \nDiluted\n4,778\n \n4,272\n \n4,232\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n52\nTable of Contents\nBROADCOM INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nFiscal Year Ended\nNovember 3,\n2024\nOctober 29,\n2023\nOctober 30,\n2022\n(In millions)\nNet income\n$\n5,895\n \n$\n14,082\n \n$\n11,495\n \nOther comprehensive income, net of tax:\nChange in unrealized gain on derivative instruments\n(\n1\n)\n290\n \n37\n \nChange in actuarial loss and prior service costs associated with defined benefit plans \n1\n \n(\n29\n)\n25\n \nOther comprehensive income, net of tax\n—\n \n261\n \n62\n \nComprehensive income\n$\n5,895\n \n$\n14,343\n \n$\n11,557\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n53\nTable of Contents\nBROADCOM INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS \nFiscal Year Ended\nNovember 3,\n2024\nOctober 29,\n2023\nOctober 30,\n2022\n(In millions)\nCash flows from operating activities:\n \n \nNet income\n$\n5,895\n \n$\n14,082\n \n$\n11,495\n \nAdjustments to reconcile net income to net cash provided by operating activities:\n \n \nAmortization of intangible and right-of-use assets\n9,417\n \n3,333\n \n4,455\n \nDepreciation\n593\n \n502\n \n529\n \nStock-based compensation\n5,741\n \n2,171\n \n1,533\n \nDeferred taxes and other non-cash taxes\n1,965\n \n(\n501\n)\n(\n34\n)\nLoss on debt extinguishment\n157\n \n—\n \n100\n \nNon-cash interest expense\n427\n \n132\n \n129\n \nOther\n404\n \n9\n \n183\n \nChanges in assets and liabilities, net of acquisitions and disposals:\nTrade accounts receivable, net\n2,327\n \n(\n187\n)\n(\n870\n)\nInventory\n150\n \n27\n \n(\n627\n)\nAccounts payable\n121\n \n209\n \n(\n79\n)\nEmployee compensation and benefits\n78\n \n(\n279\n)\n136\n \nOther current assets and current liabilities\n(\n5,323\n)\n(\n628\n)\n222\n \nOther long-term assets and long-term liabilities\n(\n1,990\n)\n(\n785\n)\n(\n436\n)\nNet cash provided by operating activities\n19,962\n \n18,085\n \n16,736\n \nCash flows from investing activities:\nAcquisitions of businesses, net of cash acquired\n(\n25,978\n)\n(\n53\n)\n(\n246\n)\nProceeds from sale of business\n3,485\n \n—\n \n—\n \nPurchases of property, plant and equipment\n(\n548\n)\n(\n452\n)\n(\n424\n)\nPurchases of investments\n(\n175\n)\n(\n346\n)\n(\n200\n)\nSales of investments\n156\n \n228\n \n200\n \nOther\n(\n10\n)\n(\n66\n)\n3\n \nNet cash used in investing activities\n(\n23,070\n)\n(\n689\n)\n(\n667\n)\nCash flows from financing activities:\nProceeds from long-term borrowings\n39,954\n \n—\n \n1,935\n \nPayments on debt obligations\n(\n19,608\n)\n(\n403\n)\n(\n2,361\n)\nPayments of dividends\n(\n9,814\n)\n(\n7,645\n)\n(\n7,032\n)\nRepurchases of common stock - repurchase program\n(\n7,176\n)\n(\n5,824\n)\n(\n7,000\n)\nShares repurchased for tax withholdings on vesting of equity awards\n(\n5,216\n)\n(\n1,861\n)\n(\n1,455\n)\nIssuance of common stock\n190\n \n122\n \n114\n \nOther\n(\n63\n)\n(\n12\n)\n(\n17\n)\nNet cash used in financing activities\n(\n1,733\n)\n(\n15,623\n)\n(\n15,816\n)\nNet change in cash and cash equivalents\n(\n4,841\n)\n1,773\n \n253\n \nCash and cash equivalents at beginning of period\n14,189\n \n12,416\n \n12,163\n \nCash and cash equivalents at end of period\n$\n9,348\n \n$\n14,189\n \n$\n12,416\n \nSupplemental disclosure of cash flow information:\nCash paid for interest\n$\n3,250\n \n$\n1,503\n \n$\n1,386\n \nCash paid for income taxes\n$\n3,155\n \n$\n1,782\n \n$\n908\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n54\nTable of Contents\nBROADCOM INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n8.00\n% Mandatory Convertible Preferred Stock\nCommon Stock\nAdditional Paid-in Capital\nRetained \nEarnings\nAccumulated \nOther \nComprehensive \nIncome (Loss)\nTotal \nStockholders’ \nEquity\nShares\nPar Value\nShares\nPar Value\n(In millions)\nBalance as of October 31, 2021\n4\n \n$\n—\n \n4,129\n \n$\n4\n \n$\n24,326\n \n$\n748\n \n$\n(\n116\n)\n$\n24,962\n \nNet income\n— \n— \n— \n— \n— \n11,495\n \n— \n11,495\n \nOther comprehensive income\n— \n— \n— \n— \n— \n— \n62\n \n62\n \nFair value of partially vested equity awards assumed in connection with an acquisition\n— \n— \n— \n— \n4\n \n— \n— \n4\n \nDividends to common stockholders\n— \n— \n— \n— \n(\n50\n)\n(\n6,683\n)\n— \n(\n6,733\n)\nDividends to preferred stockholders\n— \n— \n— \n— \n— \n(\n272\n)\n— \n(\n272\n)\nCommon stock issued\n— \n— \n77\n \n—\n \n114\n \n— \n— \n114\n \nStock-based compensation\n— \n— \n— \n— \n1,533\n \n— \n— \n1,533\n \nRepurchases of common stock\n— \n— \n(\n117\n)\n—\n \n(\n3,316\n)\n(\n3,684\n)\n— \n(\n7,000\n)\nCommon stock issued in connection with Mandatory Convertible Preferred Stock conversion\n(\n4\n)\n— \n116\n \n— \n— \n— \n— \n— \nShares repurchased for tax withholdings on vesting of equity awards\n— \n— \n(\n26\n)\n—\n \n(\n1,456\n)\n— \n— \n(\n1,456\n)\nBalance as of October 30, 2022\n—\n \n—\n \n4,179\n \n4\n \n21,155\n \n1,604\n \n(\n54\n)\n22,709\n \nNet income\n— \n— \n— \n— \n— \n14,082\n \n— \n14,082\n \nOther comprehensive income\n— \n— \n— \n— \n— \n— \n261\n \n261\n \nDividends to common stockholders\n— \n— \n— \n— \n—\n \n(\n7,645\n)\n— \n(\n7,645\n)\nCommon stock issued\n— \n— \n77\n \n—\n \n122\n \n— \n— \n122\n \nStock-based compensation\n— \n— \n— \n— \n2,171\n \n— \n— \n2,171\n \nRepurchases of common stock\n— \n— \n(\n91\n)\n—\n \n(\n481\n)\n(\n5,359\n)\n— \n(\n5,840\n)\nShares repurchased for tax withholdings on vesting of equity awards\n— \n— \n(\n26\n)\n—\n \n(\n1,872\n)\n— \n— \n(\n1,872\n)\nBalance as of October 29, 2023\n—\n \n—\n \n4,139\n \n4\n \n21,095\n \n2,682\n \n207\n \n23,988\n \nNet income\n— \n— \n— \n— \n— \n5,895\n \n— \n5,895\n \nIssuance of common stock upon the acquisition of VMware, Inc.\n— \n— \n544\n \n1\n \n53,420\n \n— \n— \n53,421\n \nFair value of partially vested equity awards assumed in connection with the acquisition of VMware, Inc.\n— \n— \n— \n— \n750\n \n— \n— \n750\n \nDividends to common stockholders\n— \n— \n— \n— \n(\n2,809\n)\n(\n7,005\n)\n— \n(\n9,814\n)\nCommon stock issued\n— \n— \n108\n \n—\n \n190\n \n— \n— \n190\n \nStock-based compensation\n— \n— \n— \n— \n5,747\n \n— \n— \n5,747\n \nRepurchases of common stock\n— \n— \n(\n67\n)\n—\n \n(\n5,604\n)\n(\n1,572\n)\n— \n(\n7,176\n)\nShares repurchased for tax withholdings on vesting of equity awards\n— \n— \n(\n38\n)\n—\n \n(\n5,323\n)\n— \n— \n(\n5,323\n)\nBalance as of November 3, 2024\n—\n \n$\n—\n \n4,686\n \n$\n5\n \n$\n67,466\n \n$\n—\n \n$\n207\n \n$\n67,678\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n55\nTable of Contents\nBROADCOM INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. \nOverview and Basis of Presentation \nOverview\nBroadcom Inc. (“Broadcom”), a Delaware corporation, is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. We develop semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products. We offer thousands of products that are used in end products such as enterprise and data center networking, including artificial intelligence (“AI”) networking and connectivity, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Our infrastructure software solutions help enterprises simplify their information technology (“IT”) environments so they can increase business velocity and flexibility, and enable customers to plan, develop, deliver, automate, manage and secure applications across mainframe, distributed, edge, mobile, and private and hybrid cloud platforms. Our portfolio of infrastructure and security software is designed to modernize, optimize, and secure the most complex private and hybrid cloud environments, enabling scalability, agility, automation, insights, resiliency and security making it easy for customers to run their mission-critical workloads. We also offer mission-critical fibre channel storage area networking (“FC SAN”) products and related software in the form of modules, switches and subsystems incorporating multiple semiconductor products. Unless stated otherwise or the context otherwise requires, references to “Broadcom,” “we,” “our,” and “us” mean Broadcom and its consolidated subsidiaries. We have \ntwo\n reportable segments: semiconductor solutions and infrastructure software. See Note 13. “Segment Information” for additional information.\nOn November 22, 2023, we completed the acquisition of VMware, Inc. (“VMware”) in a cash-and-stock transaction (the “VMware Merger”). The VMware stockholders received approximately $\n30,788\n million in cash and \n544\n million shares of Broadcom common stock (on a split adjusted basis) with a fair value of $\n53,398\n million. VMware was a leading provider of multi-cloud services for all applications, enabling digital innovation with enterprise control. We acquired VMware to enhance our infrastructure software capabilities. The accompanying consolidated financial statements include the results of operations of VMware commencing on November 22, 2023. See Note 4. “Acquisitions” for additional information.\nBasis of Presentation\nWe operate on a \n52- or 53-week\n fiscal year ending on the Sunday closest to October 31. Our fiscal year ended November 3, 2024 (“fiscal year 2024”) was a 53-week fiscal year, with the first fiscal quarter containing 14 weeks. Our fiscal year ended October 29, 2023 (“fiscal year 2023”) and fiscal year ended October 30, 2022 (“fiscal year 2022”) were both 52-week fiscal years.\nThe accompanying consolidated financial statements include the accounts of Broadcom and its subsidiaries and have been prepared in accordance with generally accepted accounting principles in the United States (“GAAP”). All intercompany balances and transactions have been eliminated in consolidation.\nOn July 12, 2024, we completed a \nten\n-for-one forward stock split of our common stock through the filing of an amendment (“Amendment”) to our Amended and Restated Certificate of Incorporation. The Amendment proportionately increased the number of shares of our authorized common stock without changing the par value of $\n0.001\n per share. All share, equity award and per share amounts and related stockholders’ equity balances presented in the accompanying consolidated financial statements and notes thereto have been retroactively adjusted, where applicable, to reflect the stock split.\n2. \nSummary of Significant Accounting Policies \nForeign currency remeasurement.\n  We operate in a U.S. dollar functional currency environment. Foreign currency assets and liabilities for monetary accounts are remeasured into U.S. dollars at current exchange rates. Non-monetary items such as inventory and property, plant and equipment, are measured and recorded at historical exchange rates. The effects of foreign currency remeasurement were not material for any period presented.\nUse of estimates.\n  The preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ materially from these estimates, and such differences could affect the results of operations reported in future periods.\n \n56\nTable of Contents\nCash and cash equivalents.\n  We consider all highly liquid investment securities with original maturities of \nthree months\n or less at the date of purchase to be cash equivalents. We determine the appropriate classification of our cash and cash equivalents at the time of purchase.\nTrade accounts receivable, net.\n  Trade accounts receivable are recognized at the invoiced amount and do not bear interest. Accounts receivable are reduced by an allowance for doubtful accounts, which is our best estimate of the expected credit losses in our existing accounts receivable. We determine the allowance based on historical experience and current economic conditions, among other factors. Allowances for doubtful accounts were not material as of November 3, 2024 or October 29, 2023. Accounts receivable are also recognized net of sales returns and distributor credit allowances. These amounts are recognized when it is both probable and estimable that discounts will be granted or products will be returned. Allowances for sales returns and distributor credit allowances as of November 3, 2024 and October 29, 2023 were $\n101\n million and $\n137\n million, respectively.\nConcentrations of credit risk and significant customers.\n  Our cash, cash equivalents and accounts receivable are potentially subject to concentration of credit risk. Cash and cash equivalents may be redeemable upon demand and are maintained with financial institutions that management believes are of high credit quality and therefore bear minimal credit risk. We seek to mitigate our credit risks by spreading such risks across multiple counterparties and monitoring the risk profile of these counterparties. Our accounts receivable are derived from revenue earned from customers located both within and outside the U.S. We mitigate collection risks from our customers by performing regular credit evaluations of our customers’ financial conditions, and require collateral, such as letters of credit and bank guarantees, in certain circumstances.\nConcentration of other risks.\n  We operate in markets that are highly competitive and rapidly changing. Significant technological changes, shifting customer needs, the emergence of competitive products with new capabilities, general economic conditions worldwide, the ability to safeguard patents and other intellectual property (“IP”) in a rapidly evolving market and reliance on third-party wafer fabricators, assembly and test subcontractors and independent distributors and other factors could affect our financial results.\nInventory.\n  We value our inventory at the lower of actual cost or net realizable value of the inventory, with cost being determined under the first-in, first-out method. We record a provision for excess and obsolete inventory based primarily on our forecast of product demand and production requirements. The excess and obsolete balance determined by this analysis becomes the basis for our excess and obsolete inventory charge and the written-down value of the inventory becomes its new cost basis.\n \nRetirement benefit plans. \nFor defined benefit pension plans, we consider various factors in determining our respective benefit obligations and net periodic benefit cost, including the number of employees that we expect to receive benefits, their salary levels and years of service, the expected return on plan assets, the discount rate, the timing of the payment of benefits, and other actuarial assumptions. If the actual results and events of the benefit plans differ from our current assumptions, the benefit obligations may be over- or under-valued.\nThe key assumptions are the discount rate and the expected rate of return on plan assets. The U.S. discount rates are based on a hypothetical yield curve constructed using high-quality corporate bonds selected to yield cash flows that match the expected timing and amount of the benefit payments. The U.S. expected rate of return on plan assets is set equal to the discount rate due to the implementation of our fully-matched, liability-driven investment strategy. We evaluate these assumptions at least annually. For the non-U.S. plans, we set assumptions specific to each country. We have elected to measure defined benefit pension plan assets and liabilities as of October 31, which is the month end that is closest to our fiscal year end.\nDerivative instruments.\n  We use derivative financial instruments to manage exposure to foreign exchange risk and interest rate risk. We do not use derivative financial instruments for speculative or trading purposes.\nOutstanding derivatives are recognized as assets or liabilities at their fair values based on Level 2 inputs, as defined in the fair value hierarchy. For derivative instruments designated as cash flow hedges, the changes in fair value are initially recognized in other comprehensive income, net of tax in the period of change, and are subsequently reclassified and recognized in the same line item as the hedged item when either the hedged transactions affect earnings or it becomes probable that the hedged transactions will not occur.\nWe use foreign exchange forward contracts to manage exposure to foreign exchange risk. These forward contracts are not designated as hedging instruments, and the changes in fair value are recognized in other income (expense), net in the period of change. We did not have any material foreign exchange forward contracts outstanding as of November 3, 2024 or October 29, 2023. The gains and losses recorded in other income (expense), net for derivative instruments not designated as hedges were not material.\n57\nTable of Contents\nDuring fiscal years 2023 and 2022, we entered into treasury rate lock contracts that mature in approximately one year to hedge variability of cash flows due to changes in the benchmark interest rate of anticipated future debt issuances. These treasury rate locks were designated and accounted for as cash flow hedging instruments. In August 2023, we early settled all treasury rate lock contracts, which had a $\n5.5\n billion notional amount, for a cumulative gain of $\n371\n million. The cumulative gain was recorded net of tax of $\n44\n million as a component of accumulated other comprehensive income as of October 29, 2023. The cash receipts from the settlement were included in cash flows from operating activities in the consolidated statement of cash flows during fiscal year 2023. In fiscal year 2024, upon the issuance of our $\n1.75\n billion \n4.800\n% senior notes due October 2034 as discussed in Note 10. “Borrowings”, $\n75\n million out of the $\n371\n million pre-tax cumulative gain in accumulated other comprehensive income will be amortized to interest expense through October 15, 2034 using the effective interest method. The remaining cumulative gain will be amortized to interest expense associated with future debt referencing the hedged treasury rates.\nProperty, plant and equipment.\n  Property, plant and equipment are stated at cost less accumulated depreciation and amortization. Additions, improvements and major renewals are capitalized, and maintenance, repairs and minor renewals are expensed as incurred. Assets are held in construction in progress until placed in service, upon which date, we begin to depreciate these assets. When assets are retired or disposed of, the assets and related accumulated depreciation and amortization are removed from our property, plant and equipment balances and the resulting gain or loss is reflected in the consolidated statements of operations. Buildings and leasehold improvements are generally depreciated over \n15\n to \n40\n years, or over the lease period, whichever is shorter, and machinery and equipment are generally depreciated over \n3\n to \n10\n years. We use the straight-line method of depreciation for all property, plant and equipment.\nLeases.  \nWe determine if an arrangement is a lease, or contains a lease, at the inception of the arrangement and evaluate whether the lease is an operating lease or a finance lease at the commencement date. We recognize right-of-use (“ROU”) assets and lease liabilities for operating and finance leases with terms greater than 12 months, and account for the lease and non-lease components as a single component. ROU assets represent our right to use an asset for the lease term, while lease liabilities represent our obligation to make lease payments. Operating and finance lease ROU assets and liabilities are recognized based on the present value of lease payments over the lease term at the lease commencement date. We use the implicit interest rate or, if not readily determinable, our incremental borrowing rate as of the lease commencement date to determine the present value of lease payments. The incremental borrowing rate is based on our unsecured borrowing rate, adjusted for the effects of collateral. Operating and finance lease ROU assets are recognized net of any lease prepayments and incentives. Lease terms may include options to extend or terminate the lease when it is reasonably certain that we will exercise that option. Operating lease expense is recognized on a straight-line basis over the lease term. Finance lease expense is recognized based on the effective interest method over the lease term.\nFair value measurement.  \nFair value is defined as the price that would be received upon sale of an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. A three-level hierarchy is applied to prioritize the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to unobservable inputs (Level 3 measurements). \nThe three levels of the fair value hierarchy under the guidance on fair value measurements are described below:\nLevel 1 — Level 1 inputs are quoted prices (unadjusted) in active markets for identical assets or liabilities that the reporting entity has the ability to access at the measurement date. Our Level 1 assets include cash equivalents, banker's acceptances, trading securities investments and investment funds. We measure trading securities investments and investment funds at quoted market prices as they are traded in active markets with sufficient volume and frequency of transactions. \nLevel 2 — Level 2 inputs are inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly. If the asset or liability has a specified contractual term, a Level 2 input must be observable for substantially the full term of the asset or liability. \nLevel 3 — Level 3 inputs are unobservable inputs for the asset or liability in which there is little, if any, market activity for the asset or liability at the measurement date. Level 3 assets and liabilities include investment in equity securities without readily determinable fair values, goodwill, intangible assets, and property, plant and equipment, which are measured at fair value using a discounted cash flow approach when they are impaired. Quantitative information for Level 3 assets and liabilities reviewed at each reporting period includes indicators of significant deterioration in the earnings performance, credit rating, asset quality, business prospects of the investee, and financial indicators of the investee's ability to continue as a going concern.\n \nBusiness combinations.\n  We account for business combinations under the acquisition method of accounting, which requires us to recognize separately from goodwill the assets acquired and the liabilities assumed at their acquisition date fair \n58\nTable of Contents\nvalues, except for revenue contracts acquired, which are recognized in accordance with our revenue recognition policy. While we use our best estimates and assumptions to accurately value assets acquired and liabilities assumed at the acquisition date as well as contingent consideration, where applicable, our estimates are inherently uncertain and subject to refinement. As a result, during the measurement period, which may be up to one year from the acquisition date, we record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill. Upon the conclusion of the measurement period or final determination of the values of assets acquired or liabilities assumed, whichever comes first, any subsequent adjustments are recognized in our consolidated statements of operations. Accounting for business combinations requires our management to make significant estimates and assumptions, especially at the acquisition date, for intangible assets, contractual obligations assumed, restructuring liabilities, pre-acquisition contingencies, and contingent consideration, where applicable. Although we believe the assumptions and estimates we have made in the past have been reasonable and appropriate, they are based, in part, on historical experience and information obtained from the management of the acquired companies and are inherently uncertain. Critical estimates in valuing certain acquired intangible assets include the present value of projected cash flows regarding the projected revenues, projected expenses which include cost of revenue, research and development and selling, general and administrative expenses, technology obsolescence rate, contributory asset charges, discount rate and income tax rate for developed technology; the projected revenues, customer retention rate, customer ramp up period, discount rate and income tax rate for the customer contracts and related relationships; the projected revenues, technology obsolescence rate, expected costs to develop in-process research and development (“IPR&D”) into commercially viable products, discount rate and income tax rate for the IPR&D; and the projected revenues, brand asset phase-out pattern, brand asset royalty rate, discount rate and the income tax rate for the trade name. Unanticipated events and circumstances may occur which could affect the accuracy or validity of such assumptions, estimates or actual results.\n \nGoodwill.\n  Goodwill represents the excess of purchase price and related costs over the value assigned to the net tangible and identifiable intangible assets of businesses acquired. Goodwill is not amortized but is reviewed annually (or more frequently if impairment indicators arise) for impairment. To review for impairment, we first assess qualitative factors to determine whether events or circumstances lead to a determination that it is more likely than not that the fair value of any of our reporting units is less than its carrying amount. Our qualitative assessment of the recoverability of goodwill, whether performed annually or based on specific events or circumstances, considers various macroeconomic, industry-specific and company-specific factors. Those factors include: (i) severe adverse industry or economic trends; (ii) significant company-specific actions, including exiting an activity in conjunction with restructuring of operations; (iii) current, historical or projected deterioration of our financial performance; or (iv) a sustained decrease in our market capitalization below our net book value. After assessing the totality of events and circumstances, if we determine that it is not more likely than not that the fair value of any of our reporting units is less than its carrying amount, no further assessment is performed. If we determine that it is more likely than not that the fair value of any of our reporting units is less than its carrying amount, we calculate the fair value of that reporting unit and compare the fair value to the reporting unit’s net book value. If the fair value of the reporting unit is greater than its net book value, there is no impairment. Otherwise, we calculate the implied fair value of goodwill by deducting the fair value of all tangible and intangible assets, excluding goodwill, of the reporting unit from the fair value of the reporting unit. The implied fair value of goodwill is compared to the carrying value of goodwill. If the implied fair value of goodwill is less than the carrying value of goodwill, an impairment loss is recognized equal to the difference. Determining the fair value of a reporting unit involves the use of significant estimates and assumptions.\nLong-lived assets.  \nPurchased finite-lived intangible assets are carried at cost less accumulated amortization. Amortization is recognized over the periods during which the intangible assets are expected to contribute to our cash flows. Purchased IPR&D projects are capitalized at fair value as an indefinite-lived intangible asset and assessed for impairment thereafter. Upon completion of each underlying project, IPR&D assets are reclassified as amortizable purchased intangible assets and amortized over their estimated useful lives. If an IPR&D project is abandoned, we recognize the carrying value of the related intangible asset in our consolidated statements of operations in the period it is abandoned. On a quarterly basis, we monitor factors and changes in circumstances that could indicate carrying amounts of long-lived assets, including purchased intangible assets, ROU assets, and property, plant and equipment, may not be recoverable. Factors we consider important which could trigger an impairment review include: (i) significant under-performance relative to historical or projected future operating results, (ii) significant changes in the manner of our use of the acquired assets or the strategy for our overall business, and (iii) significant negative industry or economic trends. An impairment loss must be measured if the sum of the expected future cash flows (undiscounted and before interest) from the use and eventual disposition of the asset (or asset group) is less than the net book value of the asset (or asset group). The amount of the impairment loss will generally be measured as the difference between the net book value of the asset (or asset group) and the estimated fair value.\nWarranty.\n  We accrue for the estimated costs of product warranties at the time revenue is recognized. Product warranty costs are estimated based upon our historical experience and specific identification of the product requirements, which may fluctuate based on product mix. Additionally, we accrue for warranty costs associated with occasional or unanticipated product quality issues if a loss is probable and can be reasonably estimated.\n59\nTable of Contents\nRevenue recognition.\n  We account for a contract with a customer when both parties have approved the contract and are committed to perform their respective obligations, each party’s rights can be identified, payment terms can be identified, the contract has commercial substance, and it is probable we will collect substantially all of the consideration we are entitled to. Revenue is recognized when, or as, performance obligations are satisfied by transferring control of a promised product or service to a customer.\nPayment terms and conditions vary by contract type, and terms between invoicing and when payment is due are short-term in duration. The timing of revenue recognition and required payments can differ and payment terms are generally structured to provide the customer with predictable and dependable ways to procure our products, not to provide or receive financing from the customer.\nNature of Products and Services\nOur products and services can be broadly categorized as sales of products and subscriptions and services. The following is a description of the principal activities from which we generate revenue.\nProducts.\n  We recognize revenue from sales to direct customers and distributors when control transfers to the customer. Rebates and incentives offered to distributors, which are earned when sales to end customers are completed, are estimated at the point of revenue recognition. We have elected to exclude from the transaction price any taxes collected from a customer and to account for shipping and handling activities performed after a customer obtains control of the product as activities to fulfill the promise to transfer the product. From time to time, certain customers agree to pay us secure supply fees in exchange for prioritized fulfillment of product orders. Such fees are included in the transaction price of the product orders and are recognized as revenue in the period that control over the products is transferred to the customer. \nSubscriptions and services. \n Our subscriptions and services revenue consists of sales and royalties from software arrangements, support services, professional services, transfer of IP, and non-recurring engineering (“NRE”) arrangements.\nRevenue from software arrangements primarily consists of fees, which may be paid either at contract inception or in installments over the contract term, that provide customers with a right to use the software, access general support and maintenance, and utilize our professional services.\nOur software licenses have standalone functionality from which customers derive benefit, and the customer obtains control of the software when it is delivered or made available for download. We believe that for the majority of software arrangements, customers derive significant benefit from the ongoing support we provide. Certain of our subscriptions and services arrangements permit our customers to unilaterally terminate or cancel these arrangements at any time at the customer’s convenience, referred to as termination for convenience provisions, without substantive termination penalty and receive a pro-rata refund of any prepaid fees. Accordingly, we account for arrangements with these termination for convenience provisions as a series of daily contracts, resulting in ratable revenue recognition of software revenue over the contractual period.\nSupport services consist primarily of telephone support and the provision of unspecified updates and upgrades on a when-and-if-available basis. Support services represent stand-ready obligations for which revenue is recognized ratably over the term of the arrangement.\nProfessional services consist of implementation, consulting, customer education and customer training services. The obligation to provide professional services is generally satisfied over time, with the customer simultaneously receiving and consuming the benefits as we satisfy our performance obligations. \nRights to our IP are either sold or licensed to a customer. IP revenue recognition is dependent on the nature and terms of each agreement. We recognize IP revenue upon delivery of the IP if there are no substantive future obligations to perform under the arrangement. Sales-based or usage-based royalties from the license of IP are recognized at the later of the period the sales or usages occur or the satisfaction of the performance obligation to which some or all of the sales-based or usage-based royalties have been allocated.\nThere are two main categories of NRE contracts that we enter into with our customers: (a) NRE contracts in which we develop a custom chip and (b) NRE contracts in which we accelerate our development of a new chip upon the customer’s request. The majority of our NRE contract revenues meet the over time criteria. As such, revenue is recognized over the development period with the measure of progress using the input method based on costs incurred to total cost as the services are provided. For NRE contracts that do not meet the over time criteria, revenue is recognized at a point in time when the NRE services are complete.\nMaterial rights.  \nContracts with customers may also include material rights that are also performance obligations. These include the right to renew or receive products or services at a discounted price in the future. Revenue allocated to material rights is recognized when the customer exercises the right or the right expires.\n60\nTable of Contents\nArrangements with Multiple Performance Obligations\nOur contracts may contain more than one of the products and services listed above, each of which is separately accounted for as a distinct performance obligation. \nAllocation of consideration.\n  We allocate total contract consideration to each distinct performance obligation in a bundled arrangement on a relative standalone selling price basis. The standalone selling price reflects the price we would charge for a specific product or service if it were sold separately in similar circumstances and to similar customers.\nStandalone selling price.\n  When available, we use directly observable transactions to determine the standalone selling prices for performance obligations. When directly observable transactions are not available, our estimates of standalone selling price for each performance obligation require judgment that considers multiple factors, including, but not limited to, reasonably available data points such as costs incurred to provide the good or service, market conditions, entity-specific factors such as pricing strategies and objectives, and information about the customer.\nWe separately determine the standalone selling prices by product or service type. Additionally, we segment the standalone selling prices for products where the pricing strategies differ, and where there are differences in customers and circumstances that warrant segmentation.\nWe also estimate the standalone selling price of our material rights. We estimate the value of the customer’s option to purchase or receive additional products or services at a discounted price by estimating the incremental discount the customer would obtain when exercising the option and the likelihood that the option would be exercised.\nOther Policies and Judgments\nContract modifications.  \nWe may modify contracts to offer customers additional products or services. Each of the additional products and services is generally considered distinct from those products or services transferred to the customer before the modification. We evaluate whether the contract price for the additional products and services reflects the standalone selling price as adjusted for facts and circumstances applicable to that contract. In these cases, we account for the additional products or services as a separate contract. In other cases where the pricing in the modification does not reflect the standalone selling price as adjusted for facts and circumstances applicable to that contract, we account for the additional products or services as part of the existing contract on a prospective basis, on a cumulative catch-up basis, or a combination of both based on the nature of the modification. In instances where the pricing in the modification offers the customer a credit for a prior arrangement, we adjust our variable consideration reserves for returns and other concessions. \nRight of return.  \nCertain contracts contain a right of return that allows the customer to cancel all or a portion of the product or service and receive a credit. We estimate returns based on historical returns data which is constrained to an amount for which a material revenue reversal is not probable. We do not recognize revenue for products or services that are expected to be returned.\nPractical expedient elected.\n  We do not disclose the value of unsatisfied performance obligations for (i) contracts with an original expected length of one year or less and (ii) contracts for which we recognize revenue at the amount to which we have the right to invoice for services performed. For contracts that were modified before the beginning of the earliest reporting period presented, we have not retrospectively restated the contract for those modifications. We have disclosed the aggregate effect of all modifications when identifying the satisfied and unsatisfied performance obligations for purposes of determining the transaction price and allocating the transaction price at transition.\nResearch and development.\n  Research and development expense consists primarily of personnel costs for our engineers and third parties engaged in the design and development of our products, software and technologies, including salary, bonus and stock-based compensation expense, project material costs, services and depreciation. Such costs are charged to research and development expense as they are incurred.\nStock-based compensation expense.\n  We recognize compensation expense for time-based restricted stock units (“RSUs”) using the straight-line amortization method based on the fair value of RSUs on the date of grant. The fair value of RSUs is the closing market price of Broadcom common stock on the date of grant, reduced by the present value of dividends expected to be paid on Broadcom common stock prior to vesting. We recognize compensation expense for time-based stock options and employee stock purchase plan rights under the Broadcom Inc. Employee Stock Purchase Plan, as amended (“ESPP”) based on the estimated grant-date fair value determined using the Black-Scholes valuation model with a straight-line amortization method.\nCertain equity awards include both service and market conditions. The fair value of market-based awards is estimated on the date of grant using the Monte Carlo simulation technique. Compensation expense for market-based awards is amortized based upon a graded vesting method over the service period.\n61\nTable of Contents\nWe estimate forfeitures expected to occur and recognize stock-based compensation expense for such awards expected to vest. We will recognize additional expense if actual forfeitures are lower than we estimated, and will recognize a benefit if actual forfeitures are higher than we estimated. Changes in the estimated forfeiture rates can have a significant effect on stock-based compensation expense since the effect of adjusting the rate is recognized in the period the forfeiture estimate is changed.\nShipping and handling costs.\n  Our shipping and handling costs charged to customers are included in net revenue and the associated expense is included in cost of revenue for all periods presented.\nLitigation and settlement costs.  \nWe are involved in legal actions and other matters arising in our recent business acquisitions and in the normal course of business. We recognize an estimated loss contingency when the outcome is probable prior to issuance of the consolidated financial statements and we are able to reasonably estimate the amount or range of any possible loss.\nIncome taxes.\n  We account for income taxes under the asset and liability method, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the consolidated financial statements. Under this method, deferred tax assets and liabilities are determined based on the differences between the consolidated financial statements and tax basis of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in income in the period that includes the enactment date.\nWe recognize net deferred tax assets to the extent we believe these assets will more likely than not be realized. In making such determination, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies and recent financial operations. If we determine that we are able to realize our deferred income tax assets in the future in excess of their net carrying values, we adjust the valuation allowance and reduce the provision for income taxes or increase the benefit from income taxes. Likewise, if we determine that we are not able to realize all or part of our net deferred tax assets, we increase the provision for income taxes or decrease the benefit from income taxes in the period such determination is made.\nThe U.S. Tax Cuts and Jobs Act enacted on December 22, 2017 (the “2017 Tax Act”) introduced significant changes to U.S. income tax law. The Global Intangible Low-Taxed Income (“GILTI”) provisions of the 2017 Tax Act require Broadcom to include in its U.S. income tax return foreign subsidiary earnings in excess of an allowable return on the foreign subsidiary’s tangible assets. We have elected to record the impacts of GILTI during the period incurred.\nWe account for uncertainty in income taxes in accordance with the applicable accounting guidance on income taxes. This guidance provides that a tax benefit from an uncertain tax position may be recognized when it is more likely than not that the position will be sustained upon examination, including resolutions of any related appeals or litigation processes, based on the technical merits.\nNet income per share.\n  Basic net income per share is computed by dividing net income attributable to common stock by the weighted-average number of shares of common stock outstanding during the period. Diluted net income per share is computed by dividing net income attributable to common stock by the weighted-average number of shares of common stock and potentially dilutive shares of common stock outstanding during the period. Potentially dilutive shares outstanding include the dilutive effect of unvested RSUs and ESPP rights (together referred to as “equity awards”), as well as convertible preferred stock. Potentially dilutive shares whose effect would have been antidilutive are excluded from the computation of diluted net income per share.\nThe dilutive effect of equity awards is calculated based on the average stock price for each fiscal period, using the treasury stock method. Under the treasury stock method, the amount the employee must pay for purchasing shares under the ESPP and the amount of compensation expense for future service that we have not yet recognized are collectively assumed to be used to repurchase shares. The dilutive effect of convertible preferred stock is calculated using the if-converted method. The if-converted method assumes that these securities were converted at the beginning of the reporting period to the extent that the effect is dilutive.\n3. \nRevenue from Contracts with Customers\n \nDisaggregation\nWe have considered (1) information that is regularly reviewed by our Chief Executive Officer, who has been identified as the chief operating decision maker (the “CODM”) as defined by the authoritative guidance on segment reporting, in evaluating financial performance and (2) disclosures presented outside of our financial statements in our earnings releases and used in investor presentations to disaggregate revenues. The principal category we use to disaggregate revenues is the nature of our products and subscriptions and services, as presented in our consolidated statements of operations. In addition, revenues by reportable segment are presented in Note 13. “Segment Information.”\n62\nTable of Contents\nThe following tables present revenue disaggregated by type of revenue and by region for the periods presented:\nFiscal Year 2024\nAmericas\nAsia Pacific\nEurope, the Middle East and Africa\nTotal\n(In millions)\nProducts\n$\n2,244\n \n$\n26,219\n \n$\n1,896\n \n$\n30,359\n \nSubscriptions and services\n12,726\n \n2,203\n \n6,286\n \n21,215\n \nTotal\n$\n14,970\n \n$\n28,422\n \n$\n8,182\n \n$\n51,574\n \nFiscal Year 2023\nAmericas\nAsia Pacific\nEurope, the Middle East and Africa\nTotal\n(In millions)\nProducts\n$\n2,601\n \n$\n23,263\n \n$\n2,027\n \n$\n27,891\n \nSubscriptions and services\n5,678\n \n657\n \n1,593\n \n7,928\n \nTotal\n$\n8,279\n \n$\n23,920\n \n$\n3,620\n \n$\n35,819\n \nFiscal Year 2022\nAmericas\nAsia Pacific\nEurope, the Middle East and Africa\nTotal\n(In millions)\nProducts\n$\n2,371\n \n$\n21,761\n \n$\n2,145\n \n$\n26,277\n \nSubscriptions and services\n4,573\n \n744\n \n1,609\n \n6,926\n \nTotal\n$\n6,944\n \n$\n22,505\n \n$\n3,754\n \n$\n33,203\n \nAlthough we recognize revenue for the majority of our products when title and control transfer in Penang, Malaysia, we disclose net revenue by region based primarily on the geographic shipment location or delivery location specified by our distributors, original equipment manufacturer (“OEM”) customers, contract manufacturers, channel partners, or software customers.\nContract Balances\nContract assets and contract liabilities balances were as follows:\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nContract Assets\n$\n4,402\n \n$\n955\n \nContract Liabilities\n$\n14,495\n \n$\n2,786\n \nChanges in our contract assets and contract liabilities primarily result from the timing difference between our performance and the customer’s payment. Contract assets and contract liabilities as of November 3, 2024 included the impact of VMware balances acquired on November 22, 2023. We fulfill our obligations under a contract with a customer by transferring products and services in exchange for consideration from the customer. We recognize a contract asset when we transfer products or services to a customer and the right to consideration is conditional on something other than the passage of time. Accounts receivable are recorded when the customer has been billed or the right to consideration is unconditional. We recognize contract liabilities when we have received consideration or an amount of consideration is due from the customer and we have a future obligation to transfer products or services. \nAs of \nNovember 3, 2024\n, approximately \n55\n% of contract liabilities related to contracts subject to termination for convenience provisions\n. The amount of revenue recognized during fiscal year 2024 that was included in the contract liabilities balance as of October 29, 2023 was $\n2,440\n million. The amount of revenue recognized during fiscal year 2023 that was included in the contract liabilities balance as of October 30, 2022 was $\n2,915\n million.\n63\nTable of Contents\nRemaining Performance Obligations\nRevenue allocated to remaining performance obligations represents the transaction price allocated to unsatisfied or partially unsatisfied performance obligations. Remaining performance obligations include unearned revenue and amounts that will be invoiced and recognized as revenue in future periods, but do not include contracts for software, subscriptions or services where the customer is not committed. The customer is not considered committed when termination for convenience without payment of a substantive penalty exists, either contractually or through customary business practice. Additionally, as a practical expedient, we have not included contracts that have an original duration of one year or less, nor have we included contracts with sales-based or usage-based royalties promised in exchange for a license of IP.\nCertain multi-year customer contracts in our semiconductor solutions and infrastructure software segments contain firmly committed amounts and the remaining performance obligations under these contracts as of November 3, 2024 were approximately $\n20.5\n billion. We expect approximately \n43\n% of this amount to be recognized as revenue over the next \n12\n months. For contracts with termination for convenience rights, our customers generally do not exercise those rights. In addition, the majority of our revenue is from contracts with a duration of one year or less. Accordingly, our remaining performance obligations disclosed above are not indicative of revenue for future periods\n.\n4. \nAcquisitions \nAcquisition of VMware, Inc.\nOn \nNovember 22, 2023\n, we completed the VMware Merger. Pursuant to the Agreement and Plan of Merger, each share of VMware common stock issued and outstanding immediately prior to the VMware Merger was indirectly converted into the right to receive, at the election of the holder of such share of VMware common stock, either $\n142.50\n in cash or \n2.52\n shares of Broadcom common stock (on a split adjusted basis). The stockholder election was prorated, such that the total number of shares of VMware common stock entitled to receive cash and the total number of shares of VMware common stock entitled to receive Broadcom common stock, in each case, was equal to \n50\n% of the aggregate number of shares of VMware common stock issued and outstanding immediately prior to the VMware Merger. Based on the VMware stockholders’ elections, the VMware stockholders received approximately $\n30,788\n million in cash and \n544\n million shares of Broadcom common stock with a fair value of $\n53,398\n million.\n We funded the cash portion of the VMware Merger with the net proceeds from the issuance of the 2023 Term Loans, as defined and discussed in Note 10. “Borrowings”, as well as cash on hand. We assumed $\n8,250\n million of VMware’s outstanding senior unsecured notes.\nPurchase Consideration\n(In millions)\nFair value of Broadcom common stock issued for outstanding VMware common stock\n$\n53,398\n \nCash paid for outstanding VMware common stock\n30,788\n \nCash paid by Broadcom to retire VMware’s term loan\n1,257\n \nFair value of partially vested assumed VMware equity awards\n805\n \nFair value of Broadcom common stock issued for accelerated VMware equity awards\n23\n \nCash paid for accelerated VMware equity awards\n13\n \nEffective settlement of pre-existing relationships\n6\n \nTotal purchase consideration\n86,290\n \nLess: cash acquired\n6,642\n \nTotal purchase consideration, net of cash acquired\n$\n79,648\n \nWe assumed all outstanding VMware RSU awards and performance stock unit (“PSU”) awards held by continuing employees. The assumed awards were converted into RSU awards for shares of Broadcom common stock. All outstanding in-the-money VMware stock options and RSU awards held by non-employee directors were accelerated and converted into the right to receive cash and shares of Broadcom common stock, in equal parts. \n64\nTable of Contents\nThe following table presents our allocation of the total purchase price, net of cash acquired:\nFair Value\n(In millions)\nTrade accounts receivable\n$\n3,571\n \nInventory\n15\n \nAssets held-for-sale\n5,206\n \nOther current assets\n757\n \nProperty, plant and equipment\n531\n \nGoodwill\n54,206\n \nIntangible assets\n45,572\n \nOther long-term assets\n1,064\n \nTotal assets acquired\n110,922\n \nAccounts payable\n(\n359\n)\nEmployee compensation and benefits\n(\n848\n)\nCurrent portion of long-term debt\n(\n1,264\n)\nLiabilities held-for-sale\n(\n1,901\n)\nOther current liabilities\n(\n11,041\n)\nLong-term debt\n(\n6,254\n)\nOther long-term liabilities\n(\n9,607\n)\nTotal liabilities assumed\n(\n31,274\n)\nFair value of net assets acquired\n$\n79,648\n \nGoodwill is primarily attributable to the assembled workforce and anticipated synergies and economies of scale expected from the integration of the VMware business. The synergies include certain cost savings, operating efficiencies and other strategic benefits projected to be achieved as a result of the VMware Merger. Goodwill is not deductible for tax purposes.\nAssets and liabilities held-for-sale primarily included the end-user computing (“EUC”) business and certain other assets and liabilities, which were not aligned with our strategic objectives. On July 1, 2024, we sold the EUC business to KKR & Co. Inc. for cash consideration of $\n3.5\n billion\n, after working capital adjustments\n. We do not have any material continuing involvement with this business and have presented its results in discontinued operations. \nOur results of continuing operations included $\n12,384\n million of net revenue attributable to VMware for\n fiscal year 2024\n. It is impracticable to determine the effect on net income attributable to VMware as we immediately integrated VMware into our ongoing operations. Transaction costs related to the VMware Merger of $\n255\n million were primarily included in selling, general and administrative expense for fiscal year\n 2024\n.\n65\nTable of Contents\nIntangible Assets\nFair Value\nWeighted-Average Amortization Periods\n(In millions)\n(In years)\nDeveloped technology\n$\n24,156\n \n8\nCustomer contracts and related relationships\n15,239\n \n8\nTrade name\n1,205\n \n14\nOff-market component of customer contracts\n242\n \n2\nTotal identified finite-lived intangible assets\n40,842\n \nIPR&D\n4,730\n \nN/A\nTotal identified intangible assets\n$\n45,572\n \nDeveloped technology relates to products used for VMware cloud foundation, application management, security, application networking and security, and software-defined edge. We valued the developed technology using the multi-period excess earnings method under the income approach. This method reflects the present value of the projected cash flows that are expected to be generated by the developed technology less charges representing the contribution of other assets to those cash flows. The economic useful life was determined based on the technology cycle related to each developed technology, as well as the cash flows over the forecast period.\nCustomer contracts and related relationships represent the fair value of future projected revenue that will be derived from sales of products to existing customers of VMware. Customer contracts and related relationships were valued using the with-and-without-method under the income approach. In the with-and-without method, the fair value was measured by the difference between the present values of the cash flows with and without the existing customers in place over the period of time necessary to reacquire the customers. The economic useful life was determined by evaluating many factors, including the useful life of other intangible assets, the length of time remaining on the acquired contracts and the historical customer turnover rates.\nTrade name relates to the “VMware” trade name. The fair value was determined by applying the relief-from-royalty method under the income approach. This method is based on the application of a royalty rate to forecasted revenue under the trade name. The economic useful life was determined based on the expected life of the trade name and the cash flows anticipated over the forecast period.\nOff-market component of customer contracts relate to rebates and marketing development funds provided to customers prior to the VMware Merger. We valued these contracts based on their remaining unamortized balances, which approximate their fair value. The economic useful life was determined based on the remaining terms of customer contracts. \nThe fair value of IPR&D was determined using the multi-period excess earnings method under the income approach. This method reflects the present value of the projected cash flows that are expected to be generated by the IPR&D, less charges representing the contribution of other assets to those cash flows. \n66\nTable of Contents\nThe following table presents the details of IPR&D by category as of the date of the VMware Merger:\nDescription\nIPR&D\nPercentage of Completion \nEstimated Cost to Complete\nExpected Release Date\n(By Fiscal Year)\n(Dollars in millions)\nVMware cloud foundation July 2024 releases\n$\n790\n \n67\n \n%\n$\n38\n \n2024\n(a)\nVMware cloud foundation March 2025 releases\n$\n2,900\n \n58\n \n%\n$\n185\n \n2025\n(b)\nVMware cloud foundation July 2025 releases\n$\n750\n \n43\n \n%\n$\n65\n \n2025\n(c)\nVMware cloud foundation networking and security virtualization\n$\n265\n \n21\n \n%\n$\n59\n \n2024\n(a)\nApplication networking and security \n$\n25\n \n21\n \n%\n$\n47\n \n2024\n(a)\n____________________________\n(a) Released during fiscal year 2024.\n(b) \n$\n1,380\n million of the $\n2,900\n million was released during fiscal year 2024. The remaining balance is expected to be released during the second half of the fiscal year ending November 2, 2025 (“fiscal year 2025”)\n.\n(c) Expected to be released during the first half of the fiscal year ending November 1, 2026\n.\nVMware cloud foundation is a private cloud platform that integrates compute, storage, networking, and management into a single solution and provides license portability. It enables customers to modernize infrastructure and accelerate developer productivity with greater resilience and security.  \nWe believe the amounts of purchased intangible assets recorded above represent the fair values of, and approximate the amounts a market participant would pay for, these intangible assets as of the date of the VMware Merger. \nUnaudited Pro Forma Information \nThe following unaudited pro forma financial information presents combined results of operations for each of the periods presented, as if VMware had been acquired as of the beginning of fiscal year 2023. The unaudited pro forma information includes adjustments to amortization for intangible assets acquired, stock-based compensation expense, interest expense for acquisition financing, amortization of deferred assets and liabilities, and depreciation for property and equipment acquired. The unaudited pro forma information presented below is for informational purposes only and is not necessarily indicative of our consolidated results of operations of the combined business had the acquisition actually occurred at the beginning of fiscal year 2023 or of the results of our future operations of the combined business. \nFiscal Year\n2024\n2023\n(In millions)\nPro forma net revenue\n$\n52,188\n \n$\n48,227\n \nPro forma net income \n$\n6,473\n \n$\n8,215\n \nAcquisition of Seagate’s SoC Operations\nOn April 23, 2024, we acquired certain assets related to the design, development, and manufacture of System-on-Chip (“SoC”) operations of Seagate Technology Holdings plc for \n$\n600\n million\n. We acquired these assets to strengthen our portfolio of SoC products. \nThe following table presents our allocation of the total purchase price. Goodwill is allocated to the semiconductor solutions segment and is deductible for tax purposes.\nFair Value\n(In millions)\nIntangible assets\n$\n570\n \nGoodwill\n14\n \nOther assets\n16\nTotal assets acquired\n$\n600\n \n67\nTable of Contents\nIntangible Assets\nFair Value\nWeighted-Average Amortization Periods\n(In millions)\n(In years)\nCustomer contracts and related relationships\n$\n410\n \n11\nDeveloped technology\n90\n \n11\nTotal identified finite-lived intangible assets\n500\n \nIPR&D\n70\n \nN/A\nTotal identified intangible assets\n$\n570\n \nCustomer contracts and related relationships represent the fair value of future projected revenue that will be derived from sales of \nSoC controller products for hard disk drive applications\n. Customer contracts and related relationships were valued using the multi-period excess earnings method under the income approach. This method reflects the present value of the projected cash flows that are expected to be generated by the customer contracts and related relationships less charges representing the contribution of other assets to those cash flows. The economic useful life was determined based on the \nuseful lives of other intangible assets and the length of time remaining on the acquired contracts\n.\nDeveloped technology relates to SoC controller products for hard disk drive applications. We valued the developed technology using the relief-from-royalty method under the income approach. This method is based on the application of a royalty rate to forecasted revenue under the developed technology. The economic useful life was determined based on the technology cycle related to each developed technology, as well as the cash flows over the forecast period.\nThe fair value of IPR&D was determined using the relief-from-royalty method under the income approach. This method is based on the application of a royalty rate to forecasted revenue from the IPR&D.\n \n5. \nSupplemental Financial Information \nCash Equivalents\nCash equivalents included $\n1,716\n million and $\n1,470\n million of time deposits and $\n1,171\n million and $\n1,650\n million of money-market funds as of November 3, 2024 and October 29, 2023, respectively. For time deposits, carrying value approximates fair value due to the short-term nature of the instruments. The fair value of money-market funds, which was consistent with their carrying value, was determined using unadjusted prices in active, accessible markets for identical assets, and as such, they were classified as Level 1 assets in the fair value hierarchy.\nAccounts Receivable Factoring\nWe sell certain of our trade accounts receivable on a non-recourse basis to third-party financial institutions pursuant to factoring arrangements. \nWe account for these transactions as sales of receivables and present cash proceeds as cash provided by operating activities in the consolidated statements of cash flows\n. Total trade accounts receivable sold under the factoring arrangements were $\n5,900\n million, $\n3,975\n million and $\n3,700\n million during fiscal years 2024, 2023 and 2022, respectively. Factoring fees for the sales of receivables were recorded in other income (expense), net and were not material for any of the\nperiods presented.\nInventory\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nFinished goods\n$\n504\n \n$\n676\n \nWork-in-process\n970\n \n901\n \nRaw materials\n286\n \n321\n \nTotal inventory\n$\n1,760\n \n$\n1,898\n \n68\nTable of Contents\nProperty, Plant and Equipment, Net\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nLand\n$\n204\n \n$\n195\n \nConstruction in progress\n57\n \n63\n \nBuildings and leasehold improvements\n1,518\n \n1,181\n \nMachinery and equipment \n5,246\n \n4,739\n \nTotal property, plant and equipment\n7,025\n \n6,178\n \nAccumulated depreciation and amortization\n(\n4,504\n)\n(\n4,024\n)\nTotal property, plant and equipment, net\n$\n2,521\n \n$\n2,154\n \nDepreciation expense was $\n593\n million, $\n502\n million and $\n529\n million for fiscal years 2024, 2023 and 2022, respectively.\nOther Current Assets\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nCurrent portion of contract assets\n$\n1,916\n \n$\n499\n \nPrepaid expenses\n1,391\n \n743\n \nOther\n764\n \n364\n \nTotal other current assets\n$\n4,071\n \n$\n1,606\n \nOther Current Liabilities\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nContract liabilities\n$\n9,395\n \n$\n2,487\n \nTax liabilities\n720\n \n473\n \nInterest payable\n535\n \n380\n \nOther\n1,143\n \n312\n \nTotal other current liabilities\n$\n11,793\n \n$\n3,652\n \nOther Long-Term Liabilities\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nContract liabilities\n$\n5,100\n \n$\n299\n \nDeferred tax liabilities\n4,703\n \n99\n \nUnrecognized tax benefits, interest and penalties\n3,669\n \n2,792\n \nOther\n1,503\n \n657\n \nTotal other long-term liabilities\n$\n14,975\n \n$\n3,847\n \n69\nTable of Contents\nOther Income (Expense), Net\n \nFiscal Year\n2024\n2023\n2022\n(In millions)\nInterest income\n$\n461\n \n$\n535\n \n$\n100\n \nOther income\n21\n \n15\n \n30\n \nGain (loss) on investments\n(\n12\n)\n11\n \n(\n169\n)\nOther expense\n(\n64\n)\n(\n49\n)\n(\n15\n)\nOther income (expense), net\n$\n406\n \n$\n512\n \n$\n(\n54\n)\nOther income and other expense include foreign exchange gains and losses, factoring fees for the sales of receivables, and other miscellaneous items.\nDiscontinued Operations\nDuring fiscal year 2024, we sold the EUC business for \n$\n3.5\n billion, after working capital adjustments. In connection with the sale, we agreed to provide transitional services to the buyer on a short-term basis. We do not have any material continuing involvement with this business and have presented its results in discontinued operations.\nThe following table summarizes the selected financial information of discontinued operations:\nFiscal Year\n2024\n(In millions)\nNet revenue\n$\n858\n \nLoss from discontinued operations before income taxes\n$\n(\n12\n)\nProvision for income taxes\n(\n261\n)\nLoss from discontinued operations, net of income taxes\n$\n(\n273\n)\n6. \nLeases\nWe have operating and finance leases for our facilities, land, data centers and certain equipment. Operating lease expense was $\n187\n million, $\n91\n million and $\n98\n million for fiscal years 2024, 2023 and 2022, respectively. Finance lease expense was $\n27\n million, $\n16\n million and $\n18\n million for fiscal years 2024, 2023 and 2022, respectively. \nOther lease information, which included the impact of VMware leases acquired on November 22, 2023, was as follows. \nFiscal Year\n2024\n2023\n2022\n(In millions)\nCash paid for operating leases included in operating cash flows\n$\n223\n \n$\n90\n \n$\n103\n \nROU assets obtained in exchange for operating lease liabilities\n$\n1,165\n \n$\n28\n \n$\n16\n \nROU assets obtained in exchange for finance lease liabilities\n$\n49\n \n$\n—\n \n$\n1\n \nNovember 3,\n2024\nOctober 29,\n2023\nWeighted-average remaining lease term – operating leases (In years)\n11\n10\nWeighted-average remaining lease term – finance leases (In years)\n2\n2\nWeighted-average discount rate – operating leases\n5.31\n \n%\n3.90\n \n%\nWeighted-average discount rate – finance leases\n3.13\n \n%\n3.09\n \n%\n70\nTable of Contents\nSupplemental balance sheet information related to leases, which included the VMware leases acquired on November 22, 2023, was as follows:\nClassification on the Consolidated Balance Sheets\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nROU assets - operating leases\nOther long-term assets\n$\n1,325\n \n$\n463\n \nROU assets - finance leases\nProperty, plant and equipment, net\n$\n15\n \n$\n22\n \nShort-term lease liabilities - operating leases\nOther current liabilities\n$\n207\n \n$\n60\n \nLong-term lease liabilities - operating leases\nOther long-term liabilities\n$\n1,143\n \n$\n359\n \nShort-term lease liabilities - finance leases\nCurrent portion of long-term debt\n$\n26\n \n$\n45\n \nLong-term lease liabilities - finance leases\nLong-term debt\n$\n13\n \n$\n4\n \nFuture minimum lease payments under non-cancelable leases as of November 3, 2024 were as follows:\nNovember 3,\n2024\nOperating Leases\nFinance Leases\n(In millions)\n2025\n$\n268\n \n$\n26\n \n2026\n194\n \n8\n \n2027\n171\n \n3\n \n2028\n144\n \n2\n \n2029\n124\n \n2\n \nThereafter\n894\n \n—\n \nTotal undiscounted liabilities\n1,795\n \n41\n \nLess: interest\n(\n445\n)\n(\n2\n)\nPresent value of lease liabilities\n$\n1,350\n \n$\n39\n \n7. \nGoodwill and Intangible Assets \nGoodwill\nSemiconductor Solutions\nInfrastructure Software\nTotal\n(In millions)\nBalance as of October 30, 2022\n$\n25,967\n \n$\n17,647\n \n$\n43,614\n \nAcquisitions\n34\n \n5\n \n39\n \nBalance as of October 29, 2023\n26,001\n \n17,652\n \n43,653\n \nAcquisition of VMware\n—\n \n54,206\n \n54,206\n \nAcquisition of Seagate's SoC operations\n14\n \n—\n \n14\n \nBalance as of November 3, 2024\n$\n26,015\n \n$\n71,858\n \n$\n97,873\n \nWe completed \nthree\n acquisitions in fiscal year 2023, all of which qualified as business combinations. The consideration for these acquisitions was primarily allocated to goodwill and intangible assets.\nDuring the fourth quarter of fiscal years 2024, 2023 and 2022, we completed our annual impairment assessments and concluded that goodwill was not impaired in any of these years.\n71\nTable of Contents\nIntangible Assets\nGross Carrying\nAmount\nAccumulated\nAmortization\nNet Book \nValue\n(In millions)\nAs of November 3, 2024:\n \n \n \nPurchased technology\n$\n35,467\n \n$\n(\n12,551\n)\n$\n22,916\n \nCustomer contracts and related relationships\n16,186\n \n(\n2,271\n)\n13,915\n \nTrade names\n1,720\n \n(\n369\n)\n1,351\n \nOther\n166\n \n(\n105\n)\n61\n \nIntangible assets subject to amortization\n53,539\n \n(\n15,296\n)\n38,243\n \nIPR&D\n2,340\n \n— \n2,340\n \nTotal\n$\n55,879\n \n$\n(\n15,296\n)\n$\n40,583\n \nAs of October 29, 2023:\n \n \n \nPurchased technology\n$\n12,938\n \n$\n(\n10,723\n)\n$\n2,215\n \nCustomer contracts and related relationships\n7,059\n \n(\n5,753\n)\n1,306\n \nTrade names\n649\n \n(\n388\n)\n261\n \nOther\n177\n \n(\n102\n)\n75\n \nIntangible assets subject to amortization\n20,823\n \n(\n16,966\n)\n3,857\n \nIPR&D\n10\n \n— \n10\n \nTotal\n$\n20,833\n \n$\n(\n16,966\n)\n$\n3,867\n \nBased on the amount of intangible assets subject to amortization at November 3, 2024, the expected amortization expense for each of the next five fiscal years and thereafter was as follows:\nFiscal Year:\nExpected Amortization Expense\n(In millions)\n2025\n$\n8,055\n \n2026\n7,571\n \n2027\n6,533\n \n2028\n5,443\n \n2029\n4,356\n \nThereafter\n6,285\n \nTotal\n$\n38,243\n \nThe weighted-average remaining amortization periods by intangible asset category were as follows:\nAmortizable intangible assets:\nNovember 3,\n2024\n(In years)\nPurchased technology\n7\nCustomer contracts and related relationships\n7\nTrade names\n12\nOther\n7\n72\nTable of Contents\n8. \nNet Income Per Share\nFiscal Year\n2024\n2023\n2022\n(In millions, except per share data)\nNumerator:\nIncome from continuing operations \n$\n6,168\n \n$\n14,082\n \n$\n11,495\n \nDividends on preferred stock\n—\n \n—\n \n(\n272\n)\nIncome from continuing operations attributable to common stock\n6,168\n \n14,082\n \n11,223\n \nLoss from discontinued operations, net of income taxes, attributable to common stock\n(\n273\n)\n—\n \n—\n \nNet income attributable to common stock\n$\n5,895\n \n$\n14,082\n \n$\n11,223\n \nDenominator:\nWeighted-average shares outstanding - basic\n4,624\n \n4,149\n \n4,089\n \nDilutive effect of equity awards\n154\n \n123\n \n143\n \nWeighted-average shares outstanding - diluted\n4,778\n \n4,272\n \n4,232\n \nBasic income per share attributable to common stock:\nIncome per share from continuing operations\n$\n1.33\n \n$\n3.39\n \n$\n2.74\n \nLoss per share from discontinued operations\n(\n0.06\n)\n—\n \n—\n \nNet income per share\n$\n1.27\n \n$\n3.39\n \n$\n2.74\n \nDiluted income per share attributable to common stock:\nIncome per share from continuing operations\n$\n1.29\n \n$\n3.30\n \n$\n2.65\n \nLoss per share from discontinued operations\n(\n0.06\n)\n—\n \n—\n \nNet income per share\n$\n1.23\n \n$\n3.30\n \n$\n2.65\n \nFor fiscal year 2022, diluted net income per share excluded the potentially dilutive effect of \n104\n million shares of common stock issuable upon the conversion of \n8.00\n% Mandatory Convertible Preferred Stock, Series A, $\n0.001\n par value per share (“Mandatory Convertible Preferred Stock”) as their effect was antidilutive. All shares of our Mandatory Convertible Preferred Stock were converted into shares of our common stock before the end of fiscal year 2022.\n9. \nRetirement Plans \nDefined Benefit Pension Plans\nThe U.S. defined benefit pension plans primarily consist of a qualified pension plan. Benefits of the qualified pension plan are provided under an adjusted career-average-pay program, a cash-balance program or a dollar-per-month program. Benefit accruals under this plan were frozen in 2009. Participants in the adjusted career-average-pay program no longer earn service accruals. Participants in the cash-balance program no longer earn service accruals, but continue to earn \n4\n% interest per year on their cash-balance accounts. There are no active participants under the dollar-per-month program. We also have a frozen non-qualified supplemental pension plan in the United States that principally provides benefits based on compensation in excess of amounts that can be considered under the qualified pension plan. \nFor certain non-U.S. countries, we also have defined benefit pension plans for eligible employees. Eligibility is generally determined based on the terms of our plans and local statutory requirements.\n73\nTable of Contents\nNet Periodic Benefit Cost\nFiscal Year\n2024\n2023\n2022\n(In millions)\nService cost\n$\n17\n \n$\n8\n \n$\n8\n \nInterest cost\n63\n \n60\n \n39\n \nExpected return on plan assets\n(\n60\n)\n(\n59\n)\n(\n39\n)\nOther\n(\n2\n)\n—\n \n1\n \nNet periodic benefit cost \n$\n18\n \n$\n9\n \n$\n9\n \nNet actuarial (gain) loss\n$\n(\n3\n)\n$\n20\n \n$\n(\n17\n)\nThe components of net periodic benefit cost other than the service cost are included in other income (expense), net. Service cost is recognized in operating expenses.\nBenefit Obligations and Plan Assets \n \nPension Benefits\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nChange in plan assets:\n \n \nFair value of plan assets — beginning of period\n$\n1,105\n \n$\n1,160\n \nActual return on plan assets\n123\n \n19\n \nEmployer contributions\n21\n \n15\n \nPlan participants’ contributions\n1\n \n1\n \nBenefit payments\n(\n108\n)\n(\n94\n)\nPlan assets acquired in VMware acquisition\n18\n \n—\n \nForeign currency impact\n(\n2\n)\n4\n \nFair value of plan assets — end of period\n1,158\n \n1,105\n \nChange in benefit obligations:\n \n \nBenefit obligations — beginning of period\n1,101\n \n1,143\n \nService cost\n17\n \n8\n \nInterest cost\n63\n \n60\n \nActuarial (gain) loss \n65\n \n(\n22\n)\nPlan participants’ contributions\n1\n \n1\n \nBenefit payments\n(\n108\n)\n(\n94\n)\nCurtailments\n(\n13\n)\n—\n \nBenefit obligations assumed in VMware acquisition\n72\n \n—\n \nForeign currency impact\n(\n4\n)\n5\n \nBenefit obligations — end of period\n1,194\n \n1,101\n \nOverfunded (underfunded) status of benefit obligations \n(a)\n$\n(\n36\n)\n$\n4\n \nActuarial losses and prior service costs recognized in accumulated other comprehensive loss, net of taxes\n$\n(\n106\n)\n$\n(\n108\n)\n_______________________________\n(a)\nSubstantially all amounts recognized on the consolidated balance sheets were recorded in other long-term assets and other long-term liabilities for all periods presented.\n74\nTable of Contents\nPlans with benefit obligations less than plan assets:\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nProjected benefit obligations\n$\n1,064\n \n$\n1,022\n \nAccumulated benefit obligations\n$\n1,063\n \n$\n1,022\n \nFair value of plan assets\n$\n1,118\n \n$\n1,079\n \nPlans with benefit obligations in excess of plan assets:\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nProjected benefit obligations\n$\n130\n \n$\n79\n \nAccumulated benefit obligations\n$\n99\n \n$\n64\n \nFair value of plan assets\n$\n40\n \n$\n26\n \nThe fair value of pension plan assets as of November 3, 2024 and October 29, 2023 included $\n229\n million and $\n204\n million, respectively, of assets for our non-U.S. pension plans.\nThe projected benefit obligations as of November 3, 2024 and October 29, 2023 included $\n260\n million and $\n202\n million, respectively, of obligations related to our non-U.S. pension plans. The accumulated benefit obligations as of November 3, 2024 and October 29, 2023 included $\n229\n million and $\n188\n million, respectively, of obligations related to our non-U.S. pension plans.\nExpected Future Benefit Payments\nFiscal Years:\nExpected Benefit Payments\n(In millions)\n2025\n$\n99\n \n2026\n$\n98\n \n2027\n$\n97\n \n2028\n$\n95\n \n2029\n$\n95\n \n2030-2034\n$\n440\n \nInvestment Policy\n  \nPlan assets of the U.S. qualified pension plan, which represent substantially all of the plan assets, are generally invested in funds held by third-party fund managers. Our benefit plan investment committee has set the investment strategy to fully match the liability. We direct the overall portfolio allocation and use a third-party investment consultant that has the discretion to structure portfolios and select the investment managers within those allocation parameters. Multiple investment managers are utilized, including both active and passive management approaches. The plan assets are invested using the liability-driven investment strategy intended to minimize market and interest rate risks, and those assets are periodically rebalanced toward asset allocation targets.\nThe target asset allocation for the U.S. qualified pension plan reflects a risk/return profile that we believe is appropriate relative to the liability structure and return goals for the plan. We periodically review the allocation of plan assets relative to alternative allocation models to evaluate the need for adjustments based on forecasted liabilities and plan liquidity needs. For both fiscal years 2024 and 2023, \n100\n% of the U.S. qualified pension plan assets were allocated to fixed income, in line with the target allocation. The fixed income allocation is primarily directed toward long-term core bond investments, with smaller allocations to Treasury Inflation-Protected Securities and high-yield bonds.\n75\nTable of Contents\nFair Value Measurement of Plan Assets\nNovember 3, 2024\nFair Value Measurements at Reporting Date Using\nLevel 1\nLevel 2\nTotal\n(In millions)\nCash equivalents\n17\n \n(a)\n$\n—\n \n$\n17\n \nEquity securities:\nNon-U.S. equity securities\n83\n \n(b)\n—\n \n83\n \nFixed-income securities:\nU.S. treasuries\n—\n \n184\n \n(c)\n184\n \nCorporate bonds\n—\n \n715\n \n(c)\n715\n \nMunicipal bonds\n—\n \n22\n \n(c)\n22\n \nGovernment bonds\n—\n \n14\n \n(c)\n14\n \nAsset-backed securities\n—\n \n1\n \n(c)\n1\n \nPlan assets measured by fair value hierarchy\n$\n100\n \n$\n936\n \n1,036\n \nPlan assets measured at net asset value \n122\n \n(d)\n \nTotal plan assets\n$\n1,158\n \nOctober 29, 2023\nFair Value Measurements at Reporting Date Using\nLevel 1\nLevel 2\nTotal\n(In millions)\nCash equivalents\n$\n16\n \n(a)\n$\n—\n \n$\n16\n \nEquity securities:\nNon-U.S. equity securities\n62\n \n(b)\n—\n \n62\n \nFixed-income securities:\nU.S. treasuries\n—\n \n144\n \n(c)\n144\n \nCorporate bonds\n—\n \n837\n \n(c)\n837\n \nMunicipal bonds\n—\n \n23\n \n(c)\n23\n \nGovernment bonds\n—\n \n21\n \n(c)\n21\n \nAsset-backed securities\n—\n \n2\n \n(c)\n2\n \nTotal plan assets\n$\n78\n \n$\n1,027\n \n$\n1,105\n \n______________________________\n(a)\nCash equivalents primarily included short-term investment funds which consisted of short-term money market instruments that were valued based on quoted prices in active markets\n.\n(b)\nThese equity securities were valued based on quoted prices in active markets.\n(c)\nThese amounts consisted of investments that were traded less frequently than Level 1 securities and were valued using inputs that included quoted prices for similar assets in active markets and inputs other than quoted prices that were observable for the assets, such as interest rates, yield curves, prepayment speeds, collateral performance, broker/dealer quotes and indices that were observable at commonly quoted intervals.\n(d)\nPlan assets measured at fair value using net asset value as a practical expedient were excluded from the fair value hierarchy\n.\n76\nTable of Contents\nAssumptions\n  \nThe assumptions used to determine the benefit obligations and net periodic benefit cost for our defined benefit pension plans are presented in the table below. The expected long-term return on assets shown in the table below represents an estimate of long-term returns on investment portfolios primarily consisting of combinations of debt, equity and other investments, depending on the plan. The long-term rates of return are then weighted based on the asset classes in which the pension funds are invested. Discount rates reflect the current rate at which defined benefit pension obligations could be settled based on the measurement dates of the plans, which is October 31, the month end closest to our fiscal year end. The range of assumptions reflects the different economic environments within various countries.\nAssumptions for Benefit Obligations\nas of\nAssumptions for Net Periodic Benefit Cost\nFiscal Year\nNovember 3,\n2024\nOctober 29,\n2023\n2024\n2023\n2022\nDiscount rate\n1.75\n%-\n6.75\n%\n1.75\n%-\n7.00\n%\n1.75\n%-\n7.10\n%\n1.25\n%-\n7.25\n%\n0.75\n%-\n6.50\n%\nAverage increase in compensation levels\n2.00\n%-\n8.80\n%\n2.00\n%-\n10.00\n%\n2.00\n%-\n8.80\n%\n2.00\n%-\n10.00\n%\n2.00\n%-\n10.00\n%\nExpected long-term return on assets\nN/A\nN/A\n2.50\n%-\n7.25\n%\n2.50\n%-\n7.00\n%\n1.50\n%-\n7.25\n%\nDefined Contribution Plans\nOur eligible U.S. employees participate in a company-sponsored 401(k) plan. Under the plan, we match employee contributions dollar for dollar up to \n6\n% of their eligible earnings. All matching contributions vest immediately. During fiscal years 2024, 2023 and 2022, we made contributions of $\n210\n million, $\n100\n million and $\n96\n million, respectively, to the 401(k) plan. The increase in fiscal year 2024 was due to the VMware Merger. \nIn addition, other eligible employees outside of the U.S. receive retirement benefits under various defined contribution retirement plans.\n77\nTable of Contents\n10. \nBorrowings \nEffective Interest Rate\nNovember 3,\n2024\nOctober 29,\n2023\n(Dollars in millions)\nOctober 2024 Senior Notes - fixed rate\n4.150\n% notes due February 2028\n4.36\n \n%\n$\n875\n \n$\n—\n \n4.350\n% notes due February 2030\n4.51\n \n%\n1,500\n \n—\n \n4.550\n% notes due February 2032\n4.70\n \n%\n875\n \n—\n \n4.800\n% notes due October 2034\n4.38\n \n%\n1,750\n \n—\n \n5,000\n \n—\n \nJuly 2024 Senior Notes - fixed rate\n5.050\n% notes due July 2027\n5.27\n \n%\n1,250\n \n—\n \n5.050\n% notes due July 2029\n5.23\n \n%\n2,250\n \n—\n \n5.150\n% notes due November 2031\n5.30\n \n%\n1,500\n \n—\n \n5,000\n \n—\n \n2023 Term Loans - floating rate\nSOFR plus \n1.125\n% term loan due November 2026\n6.23\n \n%\n5,595\n \n—\n \nSOFR plus \n1.375\n% term loan due November 2028\n6.31\n \n%\n8,000\n \n—\n \n13,595\n \n—\n \nApril 2022 Senior Notes - fixed rate\n4.000\n% notes due April 2029\n4.17\n \n%\n750\n \n750\n \n4.150\n% notes due April 2032\n4.30\n \n%\n1,200\n \n1,200\n \n4.926\n% notes due May 2037\n5.33\n \n%\n2,500\n \n2,500\n \n4,450\n \n4,450\n \nSeptember 2021 Senior Notes - fixed rate\n3.137\n% notes due November 2035\n4.23\n \n%\n3,250\n \n3,250\n \n3.187\n% notes due November 2036\n4.79\n \n%\n2,750\n \n2,750\n \n6,000\n \n6,000\n \nMarch 2021 Senior Notes - fixed rate\n3.419\n% notes due April 2033\n4.66\n \n%\n2,250\n \n2,250\n \n3.469\n% notes due April 2034\n4.63\n \n%\n3,250\n \n3,250\n \n5,500\n \n5,500\n \nJanuary 2021 Senior Notes - fixed rate\n1.950\n% notes due February 2028\n2.10\n \n%\n750\n \n750\n \n2.450\n% notes due February 2031\n2.56\n \n%\n2,750\n \n2,750\n \n2.600\n% notes due February 2033\n2.70\n \n%\n1,750\n \n1,750\n \n3.500\n% notes due February 2041\n3.60\n \n%\n3,000\n \n3,000\n \n3.750\n% notes due February 2051\n3.84\n \n%\n1,750\n \n1,750\n \n10,000\n \n10,000\n \nJune 2020 Senior Notes - fixed rate\n3.459\n% notes due September 2026\n4.19\n \n%\n752\n \n752\n \n4.110\n% notes due September 2028\n5.02\n \n%\n1,118\n \n1,118\n \n1,870\n \n1,870\n \nMay 2020 Senior Notes - fixed rate\n2.250\n% notes due November 2023\n2.40\n \n%\n—\n \n105\n \n3.150\n% notes due November 2025\n3.29\n \n%\n900\n \n900\n \n78\nTable of Contents\nEffective Interest Rate\nNovember 3,\n2024\nOctober 29,\n2023\n(Dollars in millions)\n4.150\n% notes due November 2030\n4.27\n \n%\n1,856\n \n1,856\n \n4.300\n% notes due November 2032\n4.39\n \n%\n2,000\n \n2,000\n \n4,756\n \n4,861\n \nApril 2020 Senior Notes - fixed rate\n5.000\n% notes due April 2030\n5.18\n \n%\n606\n \n606\n \nApril 2019 Senior Notes - fixed rate\n3.625\n% notes due October 2024\n3.98\n \n%\n—\n \n622\n \n4.750\n% notes due April 2029\n4.95\n \n%\n1,655\n \n1,655\n \n1,655\n \n2,277\n \n2017 Senior Notes - fixed rate\n3.625\n% notes due January 2024\n3.74\n \n%\n—\n \n829\n \n3.125\n% notes due January 2025\n3.23\n \n%\n495\n \n495\n \n3.875\n% notes due January 2027\n4.02\n \n%\n2,922\n \n2,922\n \n3.500\n% notes due January 2028\n3.60\n \n%\n777\n \n777\n \n4,194\n \n5,023\n \nAssumed VMware Senior Notes - fixed rate\n   \n4.500\n% notes due May 2025\n5.81\n \n%\n750\n \n—\n \n   \n1.400\n% notes due August 2026\n5.60\n \n%\n1,500\n \n—\n \n   \n4.650\n% notes due May 2027\n5.60\n \n%\n500\n \n—\n \n   \n3.900\n% notes due August 2027\n5.50\n \n%\n1,250\n \n—\n \n   \n1.800\n% notes due August 2028\n5.44\n \n%\n750\n \n—\n \n   \n4.700\n% notes due May 2030\n5.75\n \n%\n750\n \n—\n \n   \n2.200\n% notes due August 2031\n5.74\n \n%\n1,500\n \n—\n \n7,000\n \n—\n \nAssumed CA Senior Notes - fixed rate\n4.700\n% notes due March 2027\n5.15\n \n%\n215\n \n215\n \nOther senior notes - fixed rate\n3.500\n% notes due August 2024\n3.55\n \n%\n—\n \n7\n \n4.500\n% notes due August 2034\n4.55\n \n%\n6\n \n6\n \n6\n \n13\n \nTotal principal amount outstanding\n$\n69,847\n \n$\n40,815\n \nCurrent portion of principal amount outstanding\n$\n1,245\n \n$\n1,563\n \nShort-term finance lease liabilities\n26\n \n45\n \nTotal current portion of long-term debt\n$\n1,271\n \n$\n1,608\n \nNon-current portion of principal amount outstanding\n$\n68,602\n \n$\n39,252\n \nLong-term finance lease liabilities\n13\n \n4\n \nUnamortized discount and issuance costs\n(\n2,320\n)\n(\n1,635\n)\nTotal long-term debt\n$\n66,295\n \n$\n37,621\n \n79\nTable of Contents\nThe senior notes and term loans are recorded net of discount and issuance costs, which are amortized to interest expense over the respective terms of such instruments. The effective interest rates are calculated based on contractual interest, discount and issuance costs and, if applicable, reclassification of the cumulative gain from derivatives. See Note 2. \"Summary of Significant Accounting Policies\" for additional information for derivative instruments. \nSenior Notes\nWe issued senior unsecured notes for an aggregate principal amount of $\n5,000\n million in October 2024 and $\n5,000\n million in July 2024.\nIn connection with the VMware Merger, we assumed $\n8,250\n million of VMware’s outstanding senior unsecured notes. We repaid $\n1,250\n million of \n1.000\n% notes upon maturity in August 2024.\nWe may redeem or purchase, in whole or in part, any of our senior notes prior to their respective maturities, subject to a specified make-whole premium determined in accordance with the indentures governing the respective notes, plus accrued and unpaid interest. In the event of a change in control, note holders will have the right to require us to repurchase their notes at a price equal to \n101\n% of the principal amount of such notes, plus accrued and unpaid interest.\n2023 Term Loans\nOn August 15, 2023, we entered into a credit agreement (the “2023 Credit Agreement”), which provided us with the ability to borrow term loans in connection with the VMware Merger. Upon completion of the VMware Merger, we entered an $\n11,195\n million unsecured term A-2 facility (the \"Term A-2 Loan”), an $\n11,195\n million unsecured term A-3 facility (the “Term A-3 Loan”), and an $\n8,000\n million unsecured term A-5 facility (the “Term A-5 Loan”, collectively, the “2023 Term Loans”). \nDuring fiscal year 2024, we repaid $\n11,195\n million of our Term A-2 Loan using the net proceeds from the senior notes issued in July 2024 and the sale of the EUC business, as well as cash on hand. We also repaid $\n5,600\n million of our Term A-3 Loan using the net proceeds from the senior notes issued in October 2024 and cash on hand. As a result of these repayments, we wrote off unamortized discount and issuance costs of $\n157\n million, which were included in interest expense in the consolidated statement of operations.\nThe 2023 Term Loans bear interest, payable monthly or every three months at our election, at floating interest rates tied to the Secured Overnight Financing Rate (“SOFR”). The Term A-3 Loan and Term A-5 Loan will mature and be payable on the third or fifth anniversary, respectively, of the date of the VMware Merger. Subject to the terms of the 2023 Credit Agreement, we are permitted to v\noluntarily make prepayments of the term loans without penalty. \nOur obligations under the 2023 Credit Agreement are unsecured and are not guaranteed by any of our subsidiaries. \n2021 Credit Agreement\nIn January 2021, we entered into a credit agreement (the “2021 Credit Agreement”), which provides for a five-year $\n7.5\n billion unsecured revolving credit facility, of which $\n500\n million is available for the issuance of multi-currency letters of credit. The issuance of letters of credit and certain other instruments would reduce the aggregate amount otherwise available under the revolving credit facility for revolving loans. Subject to the terms of the 2021 Credit Agreement, we are permitted to borrow, repay and reborrow revolving loans at any time prior to the earlier of (a) January 19, 2026 and (b) the date of termination in whole of the revolving lenders’ commitments under the 2021 Credit Agreement. We had \nno\n borrowings outstanding under the revolving credit facility at either November 3, 2024 or October 29, 2023.\nCommercial Paper\n    We have a commercial paper program pursuant to which we may issue unsecured commercial paper notes (“Commercial Paper”) in principal amount of up to $\n2\n billion outstanding at any time with maturities of up to 397 days from the date of issue. Commercial Paper is sold under customary terms in the commercial paper market and may be issued at a discount from par or, alternatively, may be sold at par and bear interest at rates dictated by market conditions at the time of their issuance. The discount associated with the Commercial Paper is amortized to interest expense over its term. Outstanding Commercial Paper reduces the amount that would otherwise be available to borrow for general corporate purposes under our revolving credit facility. We had \nno\n Commercial Paper outstanding at either November 3, 2024 or October 29, 2023.   \nFair Value of Debt\nAs of November 3, 2024, the estimated aggregate fair value of our debt was $\n65,022\n million. The fair value of our senior notes was determined using quoted prices from less active markets. The carrying value of the 2023 Term Loans approximates their fair value as the 2023 Term Loans are carried at a market observable interest rate that resets periodically. All of our debt obligations are categorized as Level 2 instruments.\n80\nTable of Contents\nFuture Principal Payments of Debt\nThe future scheduled principal payments of debt as of November 3, 2024 were as follows:\nFiscal Year:\nFuture Scheduled Principal Payments\n(In millions)\n2025\n$\n1,245\n \n2026\n3,152\n \n2027\n11,732\n \n2028\n4,270\n \n2029\n12,655\n \nThereafter\n36,793\n \nTotal\n$\n69,847\n \n    As of November 3, 2024 and October 29, 2023, we were in compliance with all debt covenants.\n11. \nStockholders’ Equity \nStock Split\nOn July 12, 2024, we completed a \nten\n-for-one forward stock split of our common stock, proportionately increasing the number of shares of our authorized common stock from \n2.9\n billion to \n29\n billion without changing the par value of $\n0.001\n per share. All share, equity award and per share amounts and related stockholders’ equity balances presented herein have been retroactively adjusted, where applicable, to reflect the stock split.\nCash Dividends Declared and Paid\nFiscal Year\n2024\n2023\n2022\n(In millions, except per share data)\nDividends per share to common stockholders\n$\n2.105\n \n$\n1.840\n \n$\n1.640\n \nDividends to common stockholders\n$\n9,814\n \n$\n7,645\n \n$\n6,733\n \nDividends per share to preferred stockholders\n$\n—\n \n$\n—\n \n$\n80.00\n \nDividends to preferred stockholders\n$\n—\n \n$\n—\n \n$\n299\n \nOn September 30, 2019, we completed an offering of approximately \n4\n million shares of Mandatory Convertible Preferred Stock, which generated net proceeds of approximately $\n3,679\n million and would automatically convert into shares of our common stock on September 30, 2022. \nThe holders of Mandatory Convertible Preferred Stock were entitled to receive, when, as and if declared by our Board of Directors, or an authorized committee thereof, out of funds legally available for payment, cumulative dividends at the annual rate of \n8.00\n% of the liquidation preference of $\n1,000\n per share (equivalent to $\n80\n annually per share), payable in cash or, subject to certain limitations, by delivery of shares of our common stock or any combination of cash and shares of our common stock, at our election.\n During fiscal year 2022, outstanding shares of our Mandatory Convertible Preferred Stock converted into an aggregate of approximately \n116\n million shares of our common stock at conversion rates ranging between \n30.894\n and \n31.149\n common shares per share of Mandatory Convertible Preferred Stock. We paid cash in lieu of fractional shares of common stock upon conversion.\nStock Repurchase Programs\nIn December 2021, our Board of Directors authorized a stock repurchase program to repurchase up to $\n10\n billion of our common stock from time to time through December 31, 2022, which was subsequently extended to December 31, 2023. In May 2022, our Board of Directors authorized another stock repurchase program to repurchase up to an additional $\n10\n billion of our common stock from time to time through December 31, 2023. During fiscal years 2024, 2023 and 2022, we repurchased and retired approximately \n67\n million, \n91\n million and \n117\n million shares of our common stock for $\n7,176\n million, $\n5,824\n million and $\n7,000\n million, respectively. All $\n20\n billion of the authorized amount under these stock repurchase programs was utilized prior to expiration on December 31, 2023.\n81\nTable of Contents\nEquity Incentive Award Plans\n2012 Plan\nIn connection with the acquisition of Broadcom Corporation, we assumed its 2012 stock incentive plan and outstanding unvested RSUs that were held by its employees. During the second quarter of fiscal year 2021, our stockholders approved the amendment and restatement of the Broadcom Corporation 2012 stock incentive plan, now called the Broadcom Inc. 2012 Stock Incentive Plan (the “2012 Plan”). Under the 2012 Plan, we may grant stock options and stock appreciation rights with an exercise price that is no less than the fair market value on the date of grant, restricted stock awards, and RSUs to employees. No participant may be granted such awards for more than an aggregate of \n40\n million shares in any fiscal year. Equity awards granted generally vest over \nfour years\n. The 2012 Plan reduced the number of shares available for new equity award grants to \n200\n million shares and removed the annual share replenishment provision provided under the Broadcom Corporation 2012 stock incentive plan. During the second quarter of fiscal year 2023, our stockholders approved the amendment and restatement of the 2012 Plan to increase the number of shares of common stock authorized for issuance by \n250\n million shares. Awards cancelled or forfeited and shares withheld to satisfy tax withholding obligations become available for future issuance. As of November 3, 2024, \n364\n million shares remained available for issuance under the 2012 Plan.\nWe may grant market-based RSUs with both a service condition and a market condition as part of our equity compensation programs. The market-based RSUs generally vest over \nfour years\n, subject to satisfaction of market conditions. During fiscal years 2024, 2023 and 2022, we granted market-based RSUs under which grantees may receive the number of shares ranging from \n0\n% to \n300\n% of the original grant on a stock split adjusted basis at vesting based upon the total stockholder return (“TSR”) on our common stock on an absolute basis and as compared to the TSR of an index group of companies. During fiscal year 2023, we also granted market-based RSUs vesting over \nfive years\n, subject to satisfaction of stock price performance milestones.\n2007 Plan\nIn connection with the VMware Merger, we assumed the VMware, Inc. Amended and Restated 2007 Equity and Incentive Plan (the “2007 Plan”) and outstanding unvested RSU awards and PSU awards originally granted by VMware under the 2007 Plan that were held by continuing employees. These assumed awards were converted into approximately \n46\n million Broadcom RSU awards and will vest in accordance with their original terms, generally over \nfour years\n. Under the 2007 Plan, we may grant stock options and stock appreciation rights with an exercise price that is no less than the fair market value on the date of grant, restricted stock, RSUs, and other stock-based or cash-based awards to employees. Equity awards granted under the 2007 Plan following the VMware Merger are expected to be on similar terms and consistent with similar grants made pursuant to the 2012 Plan. Awards cancelled or forfeited and shares withheld to satisfy tax withholding obligations become available for future issuance. As of November 3, 2024, \n62\n million shares remained available for issuance under the 2007 Plan.\nEmployee Stock Purchase Plan\nThe ESPP provides eligible employees with the opportunity to acquire an ownership interest in us through periodic payroll deductions, based on a \n6\n-month look-back period, at a price equal to the lesser of \n85\n% of the fair market value of our common stock at either the beginning or the end of the relevant offering period. The ESPP is structured as a qualified employee stock purchase plan under Section 423 of the Internal Revenue Code of 1986. However, the ESPP is not intended to be a qualified pension, profit sharing or stock bonus plan under Section 401(a) of the Internal Revenue Code of 1986 and is not subject to the provisions of the Employee Retirement Income Security Act of 1974.\n82\nTable of Contents\nStock-Based Compensation Expense\n \nFiscal Year\n2024\n2023\n2022\n(In millions)\nCost of products sold\n$\n119\n \n$\n88\n \n$\n65\n \nCost of subscriptions and services\n545\n \n122\n \n82\n \nResearch and development\n3,460\n \n1,513\n \n1,048\n \nSelling, general and administrative\n1,546\n \n448\n \n338\n \nTotal stock-based compensation expense\n(a)\n$\n5,670\n \n$\n2,171\n \n$\n1,533\n \nEstimated income tax benefits for stock-based compensation\n$\n991\n \n$\n367\n \n$\n255\n \nExcess income tax benefits for stock-based awards exercised or released\n$\n1,296\n \n$\n507\n \n$\n375\n \n_____________________________\n(a) \nDoes not include stock-based compensation expense related to discontinued operations recognized during fiscal year 2024, which was included in loss from discontinued operations, net of income taxes in our consolidated statement of operations.\nFiscal year 2024 stock-based compensation expense included $\n1,613\n million related to equity awards assumed in connection with the VMware Merger.\nDuring the first quarter of fiscal year 2019, the Compensation Committee of our Board of Directors approved a broad-based program of multi-year equity grants of time- and market-based RSUs (the “Multi-Year Equity Awards”) in lieu of our annual employee equity awards historically granted on March 15 of each year. Each Multi-Year Equity Award vests on the same basis as four annual grants made March 15 of each year, beginning in fiscal year 2019, with successive four-year vesting periods. Stock-based compensation expense related to the Multi-Year Equity Awards was $\n356\n million, $\n596\n million and $\n794\n million for fiscal years 2024, 2023 and 2022, respectively.\nAs of November 3, 2024, the total unrecognized compensation cost related to unvested stock-based awards was $\n11,259\n million, which is expected to be recognized over the remaining weighted-average service period of \n3.0\n years.\nThe following table summarizes the weighted-average assumptions utilized to calculate the fair value of market-based awards granted in the periods presented:\nFiscal Year\n2024\n2023\n2022\nRisk-free interest rate\n4.2\n \n%\n4.0\n \n%\n1.4\n \n%\nDividend yield\n1.7\n \n%\n3.3\n \n%\n2.7\n \n%\nVolatility\n32.0\n \n%\n32.8\n \n%\n37.1\n \n%\nExpected term (in years)\n3.6\n4.8\n3.4\nThe risk-free interest rate was derived from the average U.S. Treasury Strips rate, which approximated the rate in effect appropriate for the term at the time of grant.\nThe dividend yield was based on the historical and expected dividend payouts as of the respective award grant dates.\nThe volatility was based on our own historical stock price volatility over the period commensurate with the expected life of the awards and the implied volatility of a 180-day call option on our own common stock measured at a specific date. \nThe expected term was commensurate with the awards’ contractual terms.\n83\nTable of Contents\nRestricted Stock Unit Awards\nA summary of time- and market-based RSU activity was as follows:\nNumber of RSUs\nOutstanding\nWeighted-Average\nGrant Date\nFair Value\nPer Share\n(In millions, except per share data)\nBalance as of October 31, 2021\n234\n \n$\n20.04\n \nGranted\n27\n \n$\n52.77\n \nVested\n(\n74\n)\n$\n22.55\n \nForfeited\n(\n12\n)\n$\n24.28\n \nBalance as of October 30, 2022\n175\n \n$\n23.85\n \nGranted\n124\n \n$\n51.98\n \nVested\n(\n74\n)\n$\n26.25\n \nForfeited\n(\n7\n)\n$\n30.79\n \nBalance as of October 29, 2023\n218\n \n$\n38.92\n \nAssumed in VMware Merger\n46\n \n$\n96.85\n \nGranted\n81\n \n$\n115.58\n \nVested\n(\n107\n)\n$\n54.34\n \nForfeited\n(\n25\n)\n$\n88.62\n \nBalance as of November 3, 2024\n213\n \n$\n66.44\n \nThe aggregate fair value of time- and market-based RSUs that vested in fiscal years 2024, 2023 and 2022 was $\n14,914\n million, $\n5,423\n million and $\n4,207\n million, respectively, which represented the market value of our common stock on the date that the RSUs vested. The number of RSUs vested included shares of common stock that we withheld for settlement of employees’ tax obligations due upon the vesting of RSUs.\n12. \nIncome Taxes \nThe components of income before income taxes by U.S. and foreign jurisdictions were as follows:\n \nFiscal Year\n2024\n2023\n2022\n(In millions)\nDomestic loss\n$\n(\n4,851\n)\n$\n(\n63\n)\n$\n(\n2,020\n)\nForeign income\n14,767\n \n15,160\n \n14,454\n \nIncome from continuing operations before income taxes\n$\n9,916\n \n$\n15,097\n \n$\n12,434\n \n84\nTable of Contents\nThe components of the provision for income taxes were as follows:\n \nFiscal Year\n2024\n2023\n2022\n(In millions)\nCurrent tax provision:\n \n \n \nFederal\n$\n1,030\n \n$\n952\n \n$\n174\n \nState\n52\n \n23\n \n48\n \nForeign\n701\n \n541\n \n762\n \n Total\n1,783\n \n1,516\n \n984\n \nDeferred tax provision (benefit):\n \n \n \nFederal\n1,855\n \n(\n499\n)\n68\n \nState\n(\n70\n)\n(\n31\n)\n(\n15\n)\nForeign\n180\n \n29\n \n(\n98\n)\nTotal\n1,965\n \n(\n501\n)\n(\n45\n)\nTotal provision for income taxes\n$\n3,748\n \n$\n1,015\n \n$\n939\n \nThe following is a reconciliation of our effective tax rate to the statutory federal tax rate:\n \nFiscal Year\n2024\n2023\n2022\nStatutory tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState, net of federal benefit\n(\n0.1\n)\n—\n \n0.2\n \nForeign income taxed at different rates\n(\n22.4\n)\n(\n17.3\n)\n(\n19.1\n)\nDeemed inclusion of foreign earnings\n16.3\n \n9.9\n \n8.0\n \nImpact of non-recurring intra-group transfer of certain IP rights\n39.6\n \n—\n \n—\n \nUncertain tax benefits\n1.8\n \n(\n1.9\n)\n1.6\n \nExcess tax benefits from stock-based compensation\n(\n13.1\n)\n(\n3.4\n)\n(\n3.0\n)\nResearch and development credit\n(\n6.0\n)\n(\n1.8\n)\n(\n1.4\n)\nOther, net\n0.7\n \n0.2\n \n0.2\n \nEffective tax rate on income before income taxes\n37.8\n \n%\n6.7\n \n%\n7.5\n \n%\nThe increase in provision for income taxes in fiscal year 2024 compared to fiscal year 2023 was primarily due to the impact of a non-recurring intra-group transfer of certain IP rights to the United States as a result of supply chain realignment and the resulting shift in jurisdictional mix of income, partially offset by an increase in excess tax benefits from stock-based awards. The increase in provision for income taxes in fiscal year 2023 compared to fiscal year 2022 was primarily due to higher income before income taxes, partially offset by an increase in the recognition of uncertain tax benefits as a result of lapses of statutes of limitations.\nWe derive the effective tax rate benefit attributed to foreign income taxed at different rates primarily from our operations in Singapore and Malaysia. Our tax incentives from the Singapore Economic Development Board provide that any qualifying income earned in Singapore is subject to tax incentives or reduced rates of Singapore income tax, subject to our compliance with the conditions specified in these incentives and legislative developments. These Singapore tax incentives are scheduled to expire in November 2030. We have also obtained a tax holiday on our qualifying income in Malaysia, which is scheduled to expire in fiscal year 2028. The tax holiday that we negotiated in Malaysia is also subject to our compliance with various operating and other conditions. Before taking into consideration the effects of the U.S. Tax Cuts and Jobs Act and other indirect tax impacts, the effect of these tax incentives and tax holiday was to decrease the provision for income taxes by approximately $\n2,261\n million, $\n2,104\n million and $\n1,821\n million for fiscal years 2024, 2023 and 2022, respectively.\n85\nTable of Contents\nSignificant components of our deferred tax assets and liabilities consisted of the following:\nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nDeferred income tax assets:\n \n \nNet operating loss, credit and other carryforwards\n$\n2,905\n \n$\n1,809\n \nCapitalized research and development\n2,459\n \n275\n \nDeferred revenue\n776\n \n208\n \nEmployee stock awards\n291\n \n190\n \nDepreciation and amortization\n81\n \n223\n \nOther deferred income tax assets\n672\n \n329\n \nGross deferred income tax assets\n7,184\n \n3,034\n \nLess: valuation allowance\n(\n2,218\n)\n(\n1,789\n)\nDeferred income tax assets\n4,966\n \n1,245\n \nDeferred income tax liabilities:\nDepreciation and amortization\n8,772\n \n97\n \nUnamortized debt discount and issuance costs\n420\n \n302\n \nForeign earnings not indefinitely reinvested\n105\n \n86\n \nOther deferred income tax liabilities\n210\n \n62\n \nDeferred income tax liabilities\n9,507\n \n547\n \nNet deferred income tax assets (liabilities)\n$\n(\n4,541\n)\n$\n698\n \nAs a result of the acquisition of VMware, we established $\n3,642\n million of net deferred tax liabilities on the excess of book basis over the tax basis of acquired assets. Our net deferred tax liabilities also increased during the year due to the non-recurring intra-group transfer of certain IP rights to the United States. The valuation allowance disclosed in the table above relates to substantially all U.S. state and foreign net operating loss carryforwards and research and development tax credits that may not be realized.\nWe continue to indefinitely reinvest $\n1,785\n million of certain accumulated foreign earnings. The unrecognized deferred income tax liability related to these earnings is estimated to be $\n187\n million. All other current and future earnings of all our foreign subsidiaries are not considered permanently reinvested. \nAs of November 3, 2024, we had tax effected U.S. state net operating loss carryforwards of $\n126\n million and foreign net operating loss carryforwards of $\n92\n million, all of which expire in various years beginning in fiscal year 2025. We had $\n2,176\n million of state research and development tax credits which begin to expire in fiscal year 2025.\n86\nTable of Contents\nUncertain Tax Positions\nThe following table reconciles the beginning and ending balance of gross unrecognized tax benefits:\nFiscal Year\n2024\n2023\n2022\n(In millions)\nBeginning balance\n$\n4,655\n \n$\n5,117\n \n$\n5,030\n \nLapses of statutes of limitations\n(\n39\n)\n(\n634\n)\n(\n50\n)\nIncreases in balances related to tax positions taken during prior periods (including those related to acquisitions made during the year) \n844\n \n26\n \n—\n \nDecreases in balances related to tax positions taken during prior periods\n(\n9\n)\n(\n13\n)\n(\n113\n)\nIncreases in balances related to tax positions taken during current period\n447\n \n170\n \n288\n \nDecreases in balances related to settlements with taxing authorities\n(\n55\n)\n(\n11\n)\n(\n38\n)\nEnding balance\n$\n5,843\n \n$\n4,655\n \n$\n5,117\n \nWe recognize interest and penalties related to unrecognized tax benefits within the provision for income taxes. Accrued interest and penalties were included within other long-term liabilities. During fiscal years 2024, 2023 and 2022, we recognized interest and penalties of $\n144\n million, $\n22\n million and $\n25\n million respectively, within the provision for income taxes. As of November 3, 2024 and October 29, 2023, the total accrued interest and penalties was approximately $\n701\n million and $\n389\n million, respectively. The increase in total accrued interest and penalties was primarily the result of the VMware acquisition in addition to the current year accrual. \nAs of November 3, 2024 and October 29, 2023, approximately $\n6,544\n million and $\n5,044\n million, respectively, of the unrecognized tax benefits and accrued interest and penalties would, if recognized, benefit our effective income tax rate. We are subject to U.S. income tax examination for fiscal years 2018 and later. Certain of our acquired companies are subject to tax examinations in major jurisdictions outside of the U.S. for fiscal years 2005 and later. It is possible that our existing unrecognized tax benefits may change up to $\n3,580\n million as a result of lapses of the statute of limitations for certain audit periods and/or audit examinations expected to be completed within the next 12 months.\n13. Segment Information \nReportable Segments\nWe have \ntwo\n reportable segments: semiconductor solutions and infrastructure software. \nEach segment has separate financial information that is utilized on a regular basis by the CODM in determining how to allocate resources and evaluate performance. The reportable segments are determined based on several factors including, but not limited to, customer base, homogeneity of products, technology, delivery channels and similar economic characteristics.\nSemiconductor solutions\n. We provide semiconductor solutions for managing the movement of data in data center, service provider, and enterprise networking applications, including AI networking and connectivity. We provide a broad variety of radio frequency semiconductor devices, wireless connectivity solutions, custom touch controllers, and inductive charging solutions for mobile applications. We also provide semiconductor solutions for enabling the set-top box and broadband access markets and for enabling secure movement of digital data to and from host machines, such as servers, personal computers and storage systems, to the underlying storage devices, such as hard disk drives and solid state drives. We also provide a broad variety of products for the general industrial and automotive markets. Our semiconductor solutions segment also includes our IP licensing.\nInfrastructure software. \nWe provide a portfolio of software solutions that help enterprises simplify their IT environments so they can increase business velocity and flexibility, and enable customers to plan, develop, deliver, automate, manage and secure applications across mainframe, distributed, edge, mobile, and private and hybrid cloud platforms. Our portfolio of infrastructure and security software is designed to modernize, optimize, and secure the most complex private and hybrid cloud environments, enabling scalability, agility, automation, insights, resiliency and security making it easy for customers to run their mission-critical workloads. We also offer mission-critical FC SAN products and related software.\nOur CODM assesses the performance of each segment and allocates resources to each segment based on net revenue and operating results and does not evaluate each segment using discrete asset information. Operating results by segment include items that are directly attributable to each segment and also include shared expenses such as marketing, general and administrative activities, facilities and IT expenses. Shared expenses are primarily allocated based on revenue and headcount. \n87\nTable of Contents\nUnallocated Expenses\nUnallocated expenses include amortization of acquisition-related intangible assets, stock-based compensation expense, restructuring and other charges, acquisition-related costs, and other costs, which are not used in evaluating the results of, or in allocating resources to, our segments. Acquisition-related costs include transaction costs and any costs directly related to the acquisition and integration of acquired businesses.\nDepreciation expense directly attributable to each reportable segment is included in the operating results of each segment. However, the CODM does not evaluate depreciation expense by operating segment and, therefore, it is not separately presented. There was no inter-segment revenue for any of the periods presented. The accounting policies of the segments are the same as those described in the summary of significant accounting policies.\nFiscal Year\n2024\n2023\n2022\n(In millions)\nNet revenue:\nSemiconductor solutions\n$\n30,096\n \n$\n28,182\n \n$\n25,818\n \nInfrastructure software\n21,478\n \n7,637\n \n7,385\n \nTotal net revenue\n$\n51,574\n \n$\n35,819\n \n$\n33,203\n \nOperating income:\nSemiconductor solutions\n$\n16,759\n \n$\n16,486\n \n$\n15,075\n \nInfrastructure software\n13,977\n \n5,639\n \n5,219\n \nUnallocated expenses\n(\n17,273\n)\n(\n5,918\n)\n(\n6,069\n)\nTotal operating income\n$\n13,463\n \n$\n16,207\n \n$\n14,225\n \nGeographic Information\nNet revenue by country is based primarily on the geographic shipment or delivery location as specified by the distributors, OEMs, contract manufacturers, channel partners, or software customers who purchased our products or services. For the majority of our products, title and control transfer to our customers in Penang, Malaysia. The products are then transported to the customer specific locations. Net revenue from the United States for fiscal years 2024, 2023 and 2022 was $\n12,887\n million, $\n6,975\n million and $\n5,915\n million, respectively. Net revenue from China (including Hong Kong) for fiscal years 2024, 2023 and 2022 was $\n10,483\n million, $\n11,533\n million and $\n11,637\n million, respectively. Net revenue from Singapore for fiscal years 2024, 2023 and 2022 was $\n9,559\n million, $\n4,479\n million and $\n4,003\n million, respectively. Net revenue from other foreign countries for fiscal years 2024, 2023 and 2022 was $\n18,645\n million, $\n12,832\n million and $\n11,648\n million, respectively. These geographic delivery locations are not necessarily indicative of the geographic location of our end customers or the country in which our end customers sell devices containing our products. For example, we believe a substantial portion of our products shipped or delivered to China (including Hong Kong) is included in devices sold by our end customers in the United States and Europe.\n88\nTable of Contents\nLong-lived assets include property, plant and equipment and are based on the physical location of the assets. \nNovember 3,\n2024\nOctober 29,\n2023\n(In millions)\nLong-lived assets:\nUnited States\n$\n1,685\n \n$\n1,371\n \nTaiwan\n365\n \n341\n \nOther\n471\n \n442\n \nTotal long-lived assets\n$\n2,521\n \n$\n2,154\n \nSignificant Customer Information\nWe sell our products through our direct sales force and a select network of distributors and channel partners globally. \nOne\n customer accounted for \n18\n% and \n21\n% of our net accounts receivable balance as of November 3, 2024 and October 29, 2023, respectively. During fiscal years 2024, 2023 and 2022, \none\n customer accounted for \n28\n%, \n21\n% and \n20\n% of our net revenue, respectively. Revenue from this customer was included in our semiconductor solutions segment.\n \n14. Commitments and Contingencies\nCommitments    \nThe following table summarizes contractual obligations and commitments as of November 3, 2024:\nFiscal Year:\nPurchase Commitments\nOther Contractual Commitments\n(In millions)\n2025\n$\n272\n \n$\n486\n \n2026\n283\n \n404\n \n2027\n7\n \n352\n \n2028\n7\n \n293\n \n2029\n—\n \n240\n \nThereafter\n—\n \n997\n \nTotal\n$\n569\n \n$\n2,772\n \nPurchase Commitments.\n Represent unconditional purchase obligations to purchase goods or services, primarily inventory, that are enforceable and legally binding on us and specify all significant terms, including fixed or minimum quantities to be purchased, price provisions, and the approximate timing of the transaction. Purchase obligations exclude agreements that are cancelable without penalty and unconditional purchase obligations with a remaining term of one year or less.\nOther Contractual Commitments. \nRepresent amounts payable pursuant to agreements related to IT and other service agreements.\nDue to the inherent uncertainty with respect to the timing of future cash outflows associated with our unrecognized tax benefits at November 3, 2024, we are unable to reliably estimate the timing of cash settlement with the respective taxing authorities. Therefore, $\n3,669\n million of unrecognized tax benefits and accrued interest and penalties as of November 3, 2024 have been excluded from the table above.\nContingencies\nFrom time to time, we are involved in litigation that we believe is of the type common to companies engaged in our lines of business, including commercial disputes, employment issues, tax disputes and disputes involving claims by third parties that our activities infringe their patent, copyright, trademark or other IP rights, as well as regulatory investigations or inquiries. Legal proceedings and regulatory investigations or inquiries are often complex, may require the expenditure of significant funds and other resources, and the outcomes of such proceedings are inherently uncertain, with material adverse outcomes possible. IP property claims generally involve the demand by a third-party that we cease the manufacture, use or sale of the allegedly infringing products, processes or technologies and/or pay substantial damages or royalties for past, present and future use of the allegedly infringing IP. Claims that our products or processes infringe or misappropriate any third-party IP rights (including claims arising through our contractual indemnification of our customers) often involve highly \n89\nTable of Contents\ncomplex, technical issues, the outcome of which is inherently uncertain. Moreover, from time to time, we pursue litigation to assert our IP rights. Regardless of the merit or resolution of any such litigation, complex IP litigation is generally costly and diverts the efforts and attention of our management and technical personnel.\nLawsuits Relating to VMware Backlog\nOn March 31, 2020, a securities class action lawsuit was filed against VMware and certain former officers of VMware in the United States District Court for the Northern District of California (the “California Court”). On September 18, 2020, the plaintiffs filed a consolidated amended complaint alleging that VMware’s statements about backlog and the related internal controls during the period from August 2018 through February 2020 were materially misleading. The defendants filed a motion to dismiss, which was granted with leave to amend on September 10, 2021. On October 8, 2021, the plaintiffs filed their Second Amended Consolidated Complaint based on the same alleged disclosure deficiencies. The defendants’ motion to dismiss the Second Amended Consolidated Complaint was filed on November 5, 2021. On April 2, 2023, the California Court denied the defendants’ motion to dismiss finding that the plaintiffs had adequately stated claims under Sections 10 and 20A of the Securities Exchange Act of 1934. The parties have agreed to settlement terms pending approval by the California Court.\nOther Matters\nWe are currently engaged in a number of legal actions in the ordinary course of our business.\nContingency Assessment\nWe do not believe, based on currently available facts and circumstances, that the final outcome of any pending legal proceedings, ongoing regulatory investigations or tax disputes, taken individually or as a whole, will have a material adverse effect on our consolidated financial statements. However, lawsuits may involve complex questions of fact and law and may require the expenditure of significant funds and other resources to defend. The results of litigation, regulatory investigations or tax disputes are inherently uncertain, and material adverse outcomes are possible. From time to time, we may enter into confidential discussions regarding the potential settlement of such lawsuits. Any settlement of pending litigation could require us to incur substantial costs and other ongoing expenses, such as future royalty payments in the case of an IP dispute. \nDuring the periods presented, no material amounts have been accrued or disclosed in the accompanying consolidated financial statements with respect to loss contingencies associated with any other legal proceedings, regulatory investigations or tax disputes as potential losses for such matters are not considered probable and ranges of losses are not reasonably estimable. These matters are subject to many uncertainties and the ultimate outcomes are not predictable. There can be no assurances that the actual amounts required to satisfy any liabilities arising from the matters described above will not have a material adverse effect on our consolidated financial statements.\nOther Indemnifications\nAs is customary in our industry and as provided for in local law in the U.S. and other jurisdictions, many of our standard contracts provide remedies to our customers and others with whom we enter into contracts, such as defense, settlement, or payment of judgment for IP claims related to the use of our products. From time to time, we indemnify customers, as well as our suppliers, contractors, lessors, lessees, companies that purchase our businesses or assets and others with whom we enter into contracts, against combinations of loss, expense, or liability arising from various triggering events related to the sale and the use of our products, the use of their goods and services, the use of facilities and state of our owned facilities, the state of the assets and businesses that we sell and other matters covered by such contracts, usually up to a specified maximum amount. In addition, from time to time we also provide protection to these parties against claims related to undiscovered liabilities, additional product liabilities or environmental obligations. In our experience, claims made under such indemnifications are rare and the associated estimated fair value of the liability is not material.\n90\nTable of Contents\n 15. \nRestructuring and Other Charges \nRestructuring Charges\nThe following table summarizes the significant activities within, and components of, the restructuring liabilities:\nEmployee Termination Costs\nLease and Impairment Costs\nTotal\n(In millions)\nBalance as of October 31, 2021\n$\n4\n \n$\n—\n \n$\n4\n \nRestructuring charges\n24\n \n38\n \n62\n \nUtilization\n(\n24\n)\n(\n38\n)\n(\n62\n)\nBalance as of October 30, 2022\n4\n \n—\n \n4\n \nRestructuring charges\n20\n \n24\n \n44\n \nUtilization\n(\n22\n)\n(\n24\n)\n(\n46\n)\nBalance as of October 29, 2023\n2\n \n—\n \n2\n \nRestructuring charges\n1,510\n \n277\n \n1,787\n \nUtilization\n(\n1,393\n)\n(\n277\n)\n(\n1,670\n)\nBalance as of November 3, 2024\n$\n119\n \n$\n—\n \n$\n119\n \nIn connection with the VMware Merger, we initiated restructuring activities to integrate the acquired business, align our workforce and improve efficiencies in our operations. Restructuring charges in fiscal year 2024 primarily related to employee termination costs. We also incurred $\n277\n million of impairment charges primarily related to lease assets and property, plant and equipment. We expect these restructuring activities to be substantially completed by the end of fiscal year 2025. These charges were recognized primarily in operating expenses. \nDuring fiscal year 2023, we incurred $\n24\n million of impairment charges primarily related to lease assets and property, plant and equipment. During fiscal year 2022, we incurred $\n38\n million of impairment charges related to lease assets. \nAs of November 3, 2024 and October 29, 2023, short-term and long-term lease liabilities included $\n192\n million and $\n44\n million of obligations related to restructured leases, respectively. \nOther Charges\nRestructuring and other charges in our consolidated statement of operations for fiscal year 2023 included $\n204\n million of non-recurring charges related to IP litigation\n.\n16. \nSubsequent Events \nCash Dividends Declared\nOn \nDecember 10, 2024\n, our Board of Directors declared a quarterly cash dividend of $\n0.59\n per share on our common stock, payable on \nDecember 31, 2024\n to stockholders of record on \nDecember 23, 2024\n.\n91\nTable of Contents\nSchedule II — Valuation and Qualifying Accounts\nBalance at\nBeginning\nof Period\nAdditions to \nAllowances\nCharges\nUtilized/\nWrite-offs\nBalance at\nEnd of\nPeriod\n \n(In millions)\nAccounts receivable allowances:\nDistributor credit allowances \n(a)\nFiscal year ended November 3, 2024\n$\n133\n \n$\n351\n \n$\n(\n390\n)\n$\n94\n \nFiscal year ended October 29, 2023\n$\n125\n \n$\n502\n \n$\n(\n494\n)\n$\n133\n \nFiscal year ended October 30, 2022\n$\n128\n \n$\n484\n \n$\n(\n487\n)\n$\n125\n \nOther accounts receivable allowances\n (b)\n \n \n \n \nFiscal year ended November 3, 2024\n$\n4\n \n$\n17\n \n$\n(\n10\n)\n$\n11\n \nFiscal year ended October 29, 2023\n$\n1\n \n$\n5\n \n$\n(\n2\n)\n$\n4\n \nFiscal year ended October 30, 2022\n$\n2\n \n$\n10\n \n$\n(\n11\n)\n$\n1\n \nIncome tax valuation allowances:\n \n \n \n \nFiscal year ended November 3, 2024\n$\n1,789\n \n$\n3,151\n \n$\n(\n2,722\n)\n$\n2,218\n \nFiscal year ended October 29, 2023\n$\n1,777\n \n$\n117\n \n$\n(\n105\n)\n$\n1,789\n \nFiscal year ended October 30, 2022\n$\n1,782\n \n$\n118\n \n$\n(\n123\n)\n$\n1,777\n \n________________________________\n(a)\nDistributor credit allowances relate to price adjustments and other allowances.\n(b)\nOther accounts receivable allowances primarily include sales returns and allowance for doubtful accounts.\nITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable.\nITEM 9A.\nCONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer (“CEO”) and Chief Financial Officer (“CFO”), evaluated the effectiveness of our disclosure controls and procedures as of November 3, 2024. The term “disclosure controls and procedures,” as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, means controls and other procedures of a company that are designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to our management, including its principal executive and principal financial officers, as appropriate to allow timely decisions regarding required disclosure. Management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving their objectives and management necessarily applies its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Based on the evaluation of our disclosure controls and procedures as of November 3, 2024, our CEO and CFO concluded that, as of such date, our disclosure controls and procedures were effective at the reasonable assurance level.\n92\nTable of Contents\nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rules 13a-15(f) and 15d-15(f) promulgated under the Exchange Act as a process designed by, or under the supervision of, our principal executive and principal financial officers and effected by the Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP and includes those policies and procedures that:\n•\npertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets;\n•\nprovide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of us are being made only in accordance with authorizations of management and directors; and\n•\nprovide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of November 3, 2024. In making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in \nInternal Control-Integrated Framework \n(2013)\n.\n Based on this assessment, our management concluded that, as of November 3, 2024, our internal control over financial reporting is effective based on those criteria.\nThe effectiveness of our internal control over financial reporting as of November 3, 2024 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which is included in Part II, Item 8. of this Annual Report on Form 10-K.\nChanges in Internal Control over Financial Reporting\nNo change in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) occurred during the fourth quarter ended November 3, 2024 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. \nITEM 9B.\nOTHER INFORMATION\nInsider Trading Arrangements\nOn \nSeptember 23, 2024\n, \nDiane M. Bryant\n, \na member of our Board of Directors\n, \nadopted\n a trading plan intended to satisfy Rule 10b5-1(c) under the Exchange Act (the “Trading Plan”). The Trading Plan provides for the potential sale of up to \n15,000\n shares of Broadcom common stock so long as the market price of Broadcom common stock satisfies certain threshold prices specified in the Trading Plan. The Trading Plan will expire on \nSeptember 12, 2025\n, subject to early termination for certain specified events set forth in the Trading Plan.\nITEM 9C.\nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n93\nTable of Contents\nPART III\nITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nBroadcom has \nadopted\n an insider trading compliance policy that governs the purchase, sale, and/or other transactions of our securities by our directors, officers and employees and Broadcom itself. A copy of our insider trading compliance policy is filed as Exhibit 19.1 to this Annual Report on Form 10-K.\nThe remaining information required by Item 10 is incorporated herein by reference from sections entitled “Board of Directors,” “Corporate Governance” and “Proposal 1 — Election of Directors” in our definitive Proxy Statement for our 2025 Annual Meeting of Stockholders. Our executive officers are listed at the end of Item 1 of this Annual Report on Form 10-K.\nITEM 11.\nEXECUTIVE COMPENSATION\nThe information required by Item 11 is incorporated herein by reference from sections entitled “Board of Directors — Director Compensation,” “Board of Directors — Board Committees — Compensation Committee — Compensation Committee Interlocks and Insider Participation,” “Compensation Discussion and Analysis,” “Compensation Committee Report,” “Executive Compensation,” and “CEO Pay Ratio” in our definitive Proxy Statement for our 2025 Annual Meeting of Stockholders.\nITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by Item 12 is incorporated herein by reference from sections entitled “Stockholder Information — Security Ownership of Certain Beneficial Owners, Directors and Executive Officers” and “Equity Compensation Plan Information” in our definitive Proxy Statement for our 2025 Annual Meeting of Stockholders.\nITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by Item 13 is incorporated herein by reference from sections entitled “Board of Directors” and “Certain Relationships and Related Party Transactions” in our definitive Proxy Statement for our 2025 Annual Meeting of Stockholders.\nITEM 14.\nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by Item 14 is incorporated herein by reference from the section entitled “Proposal 2 — Ratification of Appointment of Independent Registered Public Accounting Firm” in our definitive Proxy Statement for our 2025 Annual Meeting of Stockholders.\n94\nTable of Contents\nPART IV\nITEM 15.\nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) The following are filed as part of this Annual Report on Form 10-K:\n1. Financial Statements\nThe following consolidated financial statements are included in Item 8 of this Annual Report on Form 10-K:\n \nPage\nReports of Independent Registered Public Accounting Firm\n50\nConsolidated Balance Sheets\n51\nConsolidated Statements of Operations\n52\nConsolidated Statements of Comprehensive Income\n53\nConsolidated Statements of Cash Flows\n54\nConsolidated Statements of Stockholders’ Equity\n55\nNotes to Consolidated Financial Statements\n56\n \n2. Financial Statement Schedules\nThe financial statement schedule of the Registrant and its subsidiaries for fiscal years 2024, 2023 and 2022 required by Item 15(a) (Schedule II, Valuation and Qualifying Accounts) is included in Item 8 of this Annual Report on Form 10-K:\n \nPage\nSchedule II - Valuation and Qualifying Accounts\n92\nSchedules not filed have been omitted because they are not applicable, are not required or the information required to be set forth therein is included in the financial statements or notes thereto.\n3. Exhibits\nThe documents set forth below are filed herewith or incorporated by reference to the location indicated.\nIncorporated by Reference\nExhibit Number\nDescription\nForm\nFile No.\nExhibit\nFiling Date\nFiled Herewith\n2.1 \nAgreement and Plan of Merger, dated as of May 26, 2022, by and among Broadcom Inc., VMware, Inc., Verona Holdco, Inc., Verona Merger Sub, Inc., Barcelona Merger Sub 2, Inc. and Barcelona Merger Sub 3, LLC.\n8-K\n001-38449\n2.1\n05-26-2022\n3.1 \nAmended and Restated Certificate of Incorporation\n (including all amendments thereto)\n.\n10-Q\n001-38449\n3.1\n09-11-2024\n3.2 \nAmended and Restated Bylaws.\n8-K12B\n001-38449\n3.2\n04-04-2018\n4.1 \nForm of Common Stock Certificate.\n10-Q\n001-38449\n4.1\n06-14-2018\n4.2 \nDescription of Common Stock.\nX\n4.3 \nIndenture, dated as of January 19, 2017, by and among the Broadcom Corporation and Broadcom Cayman Finance Limited (the “Co-Issuers”), the guarantors and Wilmington Trust, National Association, as trustee.\n8-K\n001-37690\n4.1\n01-20-2017\n4.4 \nFirst S\nupplement\nal\n Indenture to the January 2017 Indenture, dated as of April 9, 2018.\n8-K\n001-38449\n4.1\n04-09-2018\n4.5 \nSecond Supplement\nal\n Indenture to the January 2017 Indenture, dated as of January 25, 2019.\n8-K\n001-38449\n4.1\n01-25-2019\n95\nTable of Contents\nIncorporated by Reference\nExhibit Number\nDescription\nForm\nFile No.\nExhibit\nFiling Date\nFiled Herewith\n4.6 \nForm of 3.625% Senior Notes due 2024 (included in Exhibit 4.3).\n8-K \n001-37690\n4.1\n01-20-2017\n4.7 \nForm of 3.875% Senior Notes due 2027 (included in Exhibit 4.3).\n8-K \n001-37690\n4.1\n01-20-2017\n4.8 \nIndenture, dated as of October 17, 2017, by and among the Co-Issuers, the guarantors and Wilmington Trust, National Association, as trustee.\n8-K \n001-37690\n4.1\n10-17-2017\n4.9 \nSupplemental Indenture to\n the\n October 2017 Indenture, dated as of April 9, 2018.\n8-K\n001-38449\n4.2\n04-09-2018\n4.10 \nSecond Supplemental Indenture to\n the\n October 2017 Indenture, date\nd\n as of January 25, 2019.\n8-K\n001-38449\n4.2\n01-25-2019\n4.11 \nForm of 2.650% Senior Notes due 2023 (included in Exhibit 4.8).\n8-K \n001-37690\n4.1\n10-17-2017\n4.12 \nForm of 3.125% Senior Notes due 2025 (included in Exhibit 4.8).\n8-K \n001-37690\n4.1\n10-17-2017\n4.13 \nForm of 3.500% Senior Notes due 2028 (included in Exhibit 4.8).\n8-K \n001-37690\n4.1\n10-17-2017\n4.14 \nIndenture, dated as of April 5, 2019, by and among the Company\n as Issuer, Broadcom Technologies Inc., Broadcom Corporation and Broadcom Cayman Finance Limited\n, and Wilmington Trust, National Association, as trustee.\n8-K\n001-38449\n4.1\n04-05-2019\n4.15 \nForm of 3.625% Senior Notes due 2024 (included in Exhibit 4.14).\n8-K\n001-38449\n4.1\n04-05-2019\n4.16 \nForm of 4.750% Senior Notes due 2029 (included in Exhibit 4.14).\n8-K\n001-38449\n4.1\n04-05-2019\n4.17 \nIndenture, dated as of April 9, 2020, by and among the Company, as Issuer, Broadcom Technologies Inc. and Broadcom Corporation (the “2020 Guarantors”), and Wilmington Trust, National Association, as trustee.\n8-K\n001-38449\n4.1\n04-09-2020\n4.18 \nForm of 5.000% Senior Notes due 2030 (included in Exhibit 4.17).\n8-K \n001-38449\n4.1\n04-09-2020\n4.19 \nIndenture, dated as of May 8, 2020, by and among the Company\n as Issuer, the 2020 Guarantors, and Wilmington Trust, National Association, as trustee.\n8-K\n001-38449\n4.1\n05-08-2020\n4.20 \nForm of 2.250% Senior Notes due 2023 (included in Exhibit 4.19).\n8-K \n001-38449\n4.1\n05-08-2020\n4.21 \nForm of 3.150% Senior Notes due 2025 (included in Exhibit 4.19).\n8-K \n001-38449\n4.1\n05-08-2020\n4.22 \nForm of 4.150% Senior Notes due 2030 (included in Exhibit 4.19).\n8-K \n001-38449\n4.1\n05-08-2020\n4.23 \nForm of 4.300% Senior Notes due 2032 (included in Exhibit 4.19).\n8-K \n001-38449\n4.1\n05-08-2020\n4.24 \nIndenture, dated as of May 21, 2020, by and among the Company, the 2020 Guarantors and Wilmington Trust, National Association, as trustee.\n8-K \n001-38449\n4.1\n05-21-2020\n4.25 \nForm of 3.459% Senior Notes due 2026 (included in Exhibit 4.24).\n8-K \n001-38449\n4.1\n05-21-2020\n96\nTable of Contents\nIncorporated by Reference\nExhibit Number\nDescription\nForm\nFile No.\nExhibit\nFiling Date\nFiled Herewith\n4.26 \nForm of 4.110% Senior Notes due 2028 (included in Exhibit 4.24).\n8-K \n001-38449\n4.1\n05-21-2020\n4.27 \nIndenture, dated as of January 19, 2021, by and among the Company, the 2020 Guarantors and Wilmington Trust, National Association, as Trustee.\n8-K \n001-38449\n4.1\n01-19-2021\n4.28 \nForm of 1.950% Senior Notes due 2028 (included in Exhibit 4.27).\n8-K \n001-38449\n4.1\n01-19-2021\n4.29 \nForm of 2.450% Senior Notes due 2031 (included in Exhibit 4.27).\n8-K \n001-38449\n4.1\n01-19-2021\n4.30 \nForm of 2.600% Senior Notes due 2033 (included in Exhibit 4.27).\n8-K \n001-38449\n4.1\n01-19-2021\n4.31 \nForm of 3.500% Senior Notes due 2041 (included in Exhibit 4.27).\n8-K \n001-38449\n4.1\n01-19-2021\n4.32 \nForm of 3.750% Senior Notes due 2051 (included in Exhibit 4.27).\n8-K \n001-38449\n4.1\n01-19-2021\n4.33 \nRegistration Rights Agreement, dated as of January 19, 2021, by and among the Company, the 2020 Guarantors and Morgan Stanley & Co. LLC, BNP Paribas Securities Corp., RBC Capital Markets, LLC, SMBC Nikko Securities America, Inc., and Truist Securities, Inc., as representatives of the several initial purchasers of the January 2021 Senior Notes.\n8-K \n001-38449\n4.7\n01-19-2021\n4.34 \nIndenture, dated as of March 31, 2021, by and between the Company and Wilmington Trust, National Association, as Trustee.\n8-K \n001-38449\n4.1\n03-31-2021\n4.35 \nForm of 3.419% Senior Notes due 2033 (included in Exhibit 4.34).\n8-K \n001-38449\n4.1\n03-31-2021\n4.36 \nForm of 3.469% Senior Notes due 2034 (included in Exhibit 4.34).\n8-K \n001-38449\n4.1\n03-31-2021\n4.37 \nRegistration Rights Agreement, dated as of March 31, 2021, by and among the Company and BofA Securities, Inc. and HSBC Securities (USA) Inc., as dealer-managers in connection with the March 2021 Exchange Offer.\n8-K \n001-38449\n4.4\n03-31-2021\n4.38 \nIndenture, dated as of September 30, 2021, by and between the Company and Wilmington Trust, National Association, as Trustee.\n8-K \n001-38449\n4.1\n09-30-2021\n4.39 \nForm of 3.137% Senior Notes due 2035 (included in Exhibit 4.38).\n8-K \n001-38449\n4.1\n09-30-2021\n4.40 \nForm of 3.187% Senior Notes due 2036 (included in Exhibit 4.38).\n8-K \n001-38449\n4.1\n09-30-2021\n4.41 \nRegistration Rights Agreement, dated as of September 30, 2021, by and among the Company and BNP Paribas Securities Corp., J.P. Morgan Securities LLC and TD Securities (USA) LLC, as dealer-mangers in connection with the September 2021 exchange offer.\n8-K \n001-38449\n4.4\n09-30-2021\n4.42 \nIndenture, dated April 14, 2022, between the Company and Wilmington Trust, National Association, as trustee.\n8-K \n001-38449\n4.1\n04-15-2022\n4.43 \nForm of 4.00% Senior Notes due 2029 (included in Exhibit 4.42).\n8-K \n001-38449\n4.1\n04-15-2022\n97\nTable of Contents\nIncorporated by Reference\nExhibit Number\nDescription\nForm\nFile No.\nExhibit\nFiling Date\nFiled Herewith\n4.44 \nForm of 4.15% Senior Notes due 2032 (included in Exhibit 4.42).\n8-K \n001-38449\n4.1\n04-15-2022\n4.45 \nRegistration Rights Agreement, dated as of April 14, 2022, between the Company and BofA Securities, Inc., HSBC Securities (USA) Inc., and RBC Capital Markets, LLC, as representatives of the several initial purchasers of the April 2022 Senior Notes.\n8-K \n001-38449\n4.4\n04-15-2022\n4.46 \nIndenture, dated April 18, 2022, between the Company and Wilmington Trust, National Association, as trustee.\n8-K \n001-38449\n4.1\n04-18-2022\n4.47 \nForm of 4.926% Senior Notes due 2037 (included in Exhibit 4.46).\n8-K \n001-38449\n4.1\n04-18-2022\n4.48 \nRegistration Rights Agreement, dated April 18, 2022, between the Company and Barclays Capital Inc., BBVA Securities Inc., BNP Paribas Securities Corp. and J.P. Morgan Securities LLC, as dealer-managers in connection with the April 2022 Exchange Offer.\n8-K \n001-38449\n4.3\n04-18-2022\n4.49 \nIndenture, dated July 12, 2024, between the Company and Wilmington Trust, National Association, as trustee.\n8-K\n001-38449\n4.1\n07-12-2024\n4.50 \nSupplemental Indenture No. 1, dated July 12, 2024, between the Company and Wilmington Trust, National Association, as trustee.\n8-K\n001-38449\n4.2\n07-12-2024\n4.51 \nForm of 5.050% Senior Notes due 2027 (included in Exhibit 4.50).\n8-K\n001-38449\n4.2\n07-12-2024\n4.52 \nForm of 5.050% Senior Notes due 2029 (included in Exhibit 4.50).\n8-K\n001-38449\n4.2\n07-12-2024\n4.53 \nForm of 5.150% Senior Notes due 2031 (included in Exhibit 4.50).\n8-K\n001-38449\n4.2\n07-12-2024\n4.54 \nSupplemental Indenture No. 2, dated October 2, 2024, between \nthe Company\n and Wilmington Trust, National Association, as trustee.\n8-K\n001-38449\n4.2\n10-02-2024\n4.55 \nForm of 4.150% \nSenior \nNote\ns\n due 2028 (included in Exhibit 4.54).\n8-K\n001-38449\n4.2\n10-02-2024\n4.56 \nForm of 4.350% \nSenior \nNote\ns\n due 2030 (included in Exhibit 4.54).\n8-K\n001-38449\n4.2\n10-02-2024\n4.57 \nForm of 4.550% \nSenior \nNote\ns\n due 2032 (included in Exhibit 4.54).\n8-K\n001-38449\n4.2\n10-02-2024\n4.58 \nForm of 4.800% \nSenior \nNote\ns\n due 2034 (included in Exhibit 4.54).\n8-K\n001-38449\n4.2\n10-02-2024\n10.1 \nForm of Indemnification and Advancement Agreement (effective April 4, 2018).\n8-K12B\n001-38449\n10.1\n04-04-2018\n10.2 \nCredit Agreement, dated as of January 19, 2021, among the Company, the lenders and other parties party thereto, and Bank of America, N.A., as Administrative Agent.\n8-K\n001-38449\n10.1\n01-19-2021\n10.3 \nAmendment No. 1, dated April 18, 2023, among Broadcom Inc., the lenders and other parties thereto, and Bank of America, N.A., as Administrative Agent, to the Credit Agreement, dated as of January 19, 2021\n.\n10-Q \n001-38449\n10.1\n06-07-2023\n98\nTable of Contents\nIncorporated by Reference\nExhibit Number\nDescription\nForm\nFile No.\nExhibit\nFiling Date\nFiled Herewith\n10.4 \nCredit Agreement, dated as of August 15, 2023, among Broadcom, the lenders and other parties party thereto, and Bank of America, N.A., as Administrative Agent.\n8-K\n001-38449\n10.1\n08-16-2023\n10.5 \nFirst Amendment to Credit Agreement, dated as of December 1, 2023, amending the Credit Agreement, dated as of August 15, 2023, among Broadcom, the lenders and other parties thereto, and Bank of America, N.A., as Administrative Agent.\n10-Q\n001-38449\n10.5\n03-14-2024\n10.6 \nLease Agreement dated August 10, 2017 between Five Point Office Venture I, LLC and Broadcom Corporation.\n10-K \n001-37690\n10.29\n12-21-2017\n10.7 \nFirst Amendment to Lease Agreement by and between Five Point Office Venture 1, LLC and Broadcom Corporation.\n10-K \n001-38449\n10.18\n12-18-2020\n10.8 \n*\nSettlement and Patent License and Non-Assert Agreement by and between Qualcomm Incorporated and Broadcom Corporation.\n8-K/A \n000-23993\n10.1\n07-23-2009\n10.9 \n+\nAvago Technologies Limited 2009 Equity Incentive Award Plan.\nS-1/A\n333-153127\n10.18\n07-27-2009\n10.10 \n+\nBroadcom Inc. Employee Stock Purchase Plan (as amended and restated on April 1, 2019).\nSchedule 14A \n001-38449\nAppendix B-1\n02-19-2019\n10.11 \n+\nLSI Corporation 2003 Equity Incentive Plan, as amended.\nS-8 \n333-195741\n4.1\n05-06-2014\n10.12 \n+\nAmendment to the LSI Corporation 2003 Equity Incentive Plan (effective February 1, 2016).\n10-K \n001-37690\n10.45\n12-23-2016\n10.13 \n+\nAmendment to the LSI Corporation 2003 Equity Incentive Plan (effective April 4, 2018).\n8-K12B \n001-38449\n10.10\n04-04-2018\n10.14 \n+\nBroadcom Inc. 2012 Stock Incentive Plan (as amended and restated on April 5, 2021).\n10-Q \n001-38449\n10.1\n06-11-2021\n10.15 \n+\nVMware, Inc. Amended and Restated 2007 Equity and Incentive Plan.\nS-8\n333-275702\n99.1\n11-22-2023\n10.16 \n+\nForm of Annual Bonus Plan for Executive Employees.\n10-K \n001-37690\n10.53\n12-23-2016\n10.17 \n+\nForm of Agreement for Multi-Year Equity Award of Restricted Stock Unit Award under the Avago Technologies Limited 2009 Equity Incentive Award Plan\n \n(effective December 5, 2017\n).\n8-K \n001-38449\n10.1\n12-06-2018\n10.18 \n+\nForm of Agreement for Multi-Year Equity Award of Performance Stock Units under the Avago Technologies Limited 2009 Equity Incentive Award Plan\n \n(effective March 13, 2018\n).\n8-K \n001-38449\n10.2\n12-06-2018\n10.19 \n+\nForm of Restricted Stock Unit Award Agreement under LSI Corporation 2003 Equity Incentive Plan, as amended (effective December 8, 2020).\n10-K \n001-38449\n10.51\n12-18-2020\n10.20 \n+\nForm of Performance Stock Unit Agreement (Relative TSR) under LSI Corporation 2003 Equity Incentive Plan, as amended (effective December 8, 2020).\n10-K \n001-38449\n10.52\n12-18-2020\n10.21 \n+\nForm of Restricted Stock Unit Award Agreement under Broadcom Corporation 2012 Stock Incentive Plan (effective December 5, 2017).\n10-K\n001-37690\n10.61\n12-21-2017\n99\nTable of Contents\nIncorporated by Reference\nExhibit Number\nDescription\nForm\nFile No.\nExhibit\nFiling Date\nFiled Herewith\n10.22 \n+\nForm of Restricted Stock Unit Award Agreement under Broadcom Inc. 2012 Stock Incentive Plan (effective April 5, 2021).\n10-Q \n001-38449\n10.3\n06-11-2021\n10.23 \n+\nForm of Performance Share Unit Agreement (Relative TSR) under Broadcom Corporation 2012 Stock Incentive Plan (effective March 15, 2018).\n10-Q \n001-37690\n10.5\n03-15-2018\n10.24 \n+\nForm of Performance Stock Unit Award Agreement under the Broadcom Inc. 2012 Stock Incentive Plan (effective April 5, 2021).\n10-Q\n001-38449\n10.4\n06-11-2021\n10.25 \n+\nForm of Performance Stock Unit Award Agreement (Price Contingency) under Broadcom Inc. 2012 Stock Incentive Plan.\n8-K \n001-38449\n10.1\n11-02-2022\n10.26 \n+\nPerformance Stock Unit Award Agreement, dated April 5, 2021, between Broadcom Inc. and Hock E. Tan.\n10-Q \n001-38449\n10.2\n06-11-2021\n10.27 \n+\nBroadcom Inc. 2023 Inducement Plan.\nS-8\n333-276053\n99.1\n12-14-2023\n10.28 \n+\nForm of Restricted Stock Unit Agreement under Broadcom Inc. 2023 Inducement Plan.\nS-8\n333-276053\n99.2\n12-14-2023\n10.29 \n+\nForm of Performance Stock Unit Agreement under Broadcom Inc. 2023 Inducement Plan.\nS-8\n333-276053\n99.3\n12-14-2023\n10.30 \n+\nPolicy on Acceleration of Executive Staff Equity Awards in the Event of Permanent Disability (as amended June\n 2, 2021).\n8-K \n001-38449\n10.1\n06-03-2021\n10.31 \n+\nPolicy on Acceleration of Equity Awards in the Event of Death (as amended January 1, 2023).\n10-Q\n001-38449\n10.2\n09-06-2023\n10.32 \n+\nAmended and Restated Severance Benefits Agreement, dated December 10, 2020, between Broadcom Inc. and Hock E. Tan.\n8-K\n001-38449\n10.1\n12-10-2020\n10.33 \n+\nAmended and Restated Severance Benefits Agreement, dated December 10, 2020, between Broadcom Inc. and Charlie B. Kawwas.\n8-K\n001-38449\n10.2\n12-10-2020\n10.34 \n+\nSeverance Benefits Agreement, dated September 26, 2017, between Broadcom Limited and Mark Brazeal.\n10-Q\n001-38449\n10.18\n06-16-2018\n10.35 \n+\nSeverance Benefits Agreement, dated December 10, 2020, between Broadcom Inc. and Kirsten M. Spears.\n8-K\n001-38449\n10.5\n12-10-2020\n19.1 \nB\nroadcom Inc. Insider Trading \nCompliance \nPolicy\nX\n21.1 \nList of Subsidiaries.\nX\n23.1 \nConsent of PricewaterhouseCoopers LLP, independent registered public accounting firm.\nX\n24.1 \nPower of Attorney (see signature page to this Form 10-K).\nX\n31.1 \nCertification of Principal Executive Officer of Broadcom Inc. Pursuant to Rule 13a-14 of the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n \n \nX\n31.2 \nCertification of Principal Financial Officer of Broadcom Inc. Pursuant to Rule 13a-14 of the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n100\nTable of Contents\nIncorporated by Reference\nExhibit Number\nDescription\nForm\nFile No.\nExhibit\nFiling Date\nFiled Herewith\n32.1 \nCertification of Principal Executive Officer of Broadcom Inc. Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n32.2 \nCertification of Principal Financial Officer of Broadcom Inc. Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n97.1 \nClawback Policy.\n10-K\n001-38449\n97.1\n12-14-2023\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\nX\n101.SCH\nInline XBRL Schema Document.\nX\n101.CAL\nInline XBRL Calculation Linkbase Document.\nX\n101.DEF\nInline XBRL Definition Linkbase Document.\nX\n101.LAB\nInline XBRL Labels Linkbase Document.\nX\n101.PRE\nInline XBRL Presentation Linkbase Document.\nX\n104\nCover Page Interactive Data File - the cover page interactive data file does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\nX\nNotes:\n+\nIndicates a management contract or compensatory plan or arrangement.\n*\nCertain information omitted pursuant to a request for confidential treatment filed with the SEC.\nITEM 16.\nFORM 10-K SUMMARY\nNone.\n101\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nBROADCOM INC.\n \nBy: \n/s/  Hock E. Tan\nName:\nHock E. Tan\nTitle:\nPresident and Chief Executive Officer\n \nDate: December 20, 2024\nPOWER OF ATTORNEY\nEach person whose individual signature appears below hereby authorizes and appoints Hock E. Tan, Kirsten M. Spears and Mark D. Brazeal, and each of them, with full power of substitution and resubstitution and full power to act without the other, as his or her true and lawful attorney-in-fact and agent to act in his or her name, place and stead and to execute in the name and on behalf of each person, individually and in each capacity stated below, and to file any and all amendments to this Annual Report on Form 10-K, and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing, ratifying and confirming all that said attorneys-in-fact and agents or any of them or their or his substitute or substitutes may lawfully do or cause to be done by virtue thereof.\n102\nTable of Contents\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed by the following persons on behalf of the Registrant in the capacities indicated and on the dates indicated.\nSignature\n \nTitle\n \nDate\n/s/  Hock E. Tan\nPresident, Chief Executive\nOfficer and Director\n(Principal Executive Officer)\nDecember 20, 2024\nHock E. Tan\n \n/s/  Kirsten M. Spears\nChief Financial Officer\n(Principal Financial Officer and Principal Accounting Officer)\nDecember 20, 2024\nKirsten M. Spears\n/s/  Henry Samueli\nChairman of the Board of Directors\nDecember 20, 2024\nHenry Samueli\n/s/  Eddy W. Hartenstein\nLead Independent Director\nDecember 20, 2024\nEddy W. Hartenstein\n/s/  Diane M. Bryant\nDirector\nDecember 20, 2024\nDiane M. Bryant\n/s/  Gayla J. Delly\nDirector\nDecember 20, 2024\nGayla J. Delly\n/s/  Kenneth Y. Hao\nDirector\nDecember 20, 2024\nKenneth Y. Hao\n/s/  Check Kian Low\nDirector\nDecember 20, 2024\nCheck Kian Low\n/s/  Justine F. Page\nDirector\nDecember 20, 2024\nJustine F. Page\n/s/  Harry L. You\nDirector\nDecember 20, 2024\nHarry L. You\n103"
}