{
  "ticker": "BA",
  "cik": "0000012927",
  "company_name": "BOEING CO",
  "filing_date": "2025-02-03",
  "accession": "0000012927-25-000015",
  "primary_doc": "ba-20241231.htm",
  "item1_text": "Item  16.\nForm 10-K Summary\n136\nSignatures\n137\nTable of Contents\nPART I\nItem 1. Business\nThe Boeing Company, together with its subsidiaries (herein referred to as “Boeing,” the “Company,” “we,” “us,” “our”), is one of the world’s major aerospace firms.\nWe are organized based on the products and services we offer. We operate in three reportable segments:\n•\nCommercial Airplanes (BCA);\n•\nDefense, Space & Security (BDS);\n•\nGlobal Services (BGS).\nCommercial Airplanes Segment\nThis segment develops, produces and markets commercial jet aircraft principally to the commercial airline industry worldwide. We are a leading producer of commercial aircraft and offer a family of commercial jetliners designed to meet a broad spectrum of global passenger and cargo requirements of airlines. This family of commercial jet aircraft in production includes the 737 narrow-body model and the 767, 777 and 787 wide-body models. Development continues on the 777X program and the 737-7 and 737-10 derivatives.\nDefense, Space & Security Segment\nThis segment engages in the research, development, production and modification of manned and unmanned military aircraft and weapons systems for strike, surveillance and mobility, including fighter and trainer aircraft; vertical lift, including rotorcraft and tilt-rotor aircraft; and commercial derivative aircraft, including anti-submarine and tanker aircraft. In addition, this segment engages in the research, development, production and modification of the following products and related services: strategic defense and intelligence systems, including strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR), cyber and information solutions, and intelligence systems, satellite systems, including government and commercial satellites and space exploration.\nGlobal Services Segment\nThis segment provides services to our commercial and defense customers worldwide. Global Services sustains aerospace platforms and systems with a full spectrum of products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services.\nIntellectual Property\nWe own numerous patents and have licenses for the use of patents owned by others, which relate to our products and their manufacture. In addition to owning a large portfolio of intellectual property, we also license intellectual property to and from third parties. For example, the U.S. government has licenses in our patents that are developed in performance of government contracts, and it may use or authorize others to use the inventions covered by such patents for government purposes. Unpatented research, development and engineering skills, as well as certain trademarks, trade secrets and other intellectual property rights, also make an important contribution to our business. While our intellectual \n1\nTable of Contents\nproperty rights in the aggregate are important to the operation of each of our businesses, we do not believe that our business would be materially affected by the expiration of any particular intellectual property right or termination of any particular intellectual property patent license agreement.\nHuman Capital\nAs of December 31, 2024, Boeing’s total workforce was approximately 172,000 with 15% located outside of the U.S. As of December 31, 2024, our global workforce was comprised of approximately 24% women, and our U.S. workforce was comprised of 39% racial and ethnic minorities and 14% U.S. veterans.\nAs of December 31, 2024, our workforce included approximately 58,000 union members. Our principal collective bargaining agreements and their current status are summarized in the following table:\nUnion\nPercent of our Total Workforce Represented\nStatus of Major Agreements with Union\nThe International Association of Machinists and Aerospace Workers (IAM)\n21%\nWe have two major agreements; one with IAM District 837 (Missouri) expiring in July 2025 and one with IAM District 751 (Washington) expiring in September 2028.\nThe Society of Professional Engineering Employees in Aerospace (SPEEA)\n10%\nWe have two major agreements; one with SPEEA Professional and one with SPEEA Technical, both expiring in October 2026.\nThe United Automobile, Aerospace and Agricultural Implement Workers of America (UAW)\n1%\nWe have one major agreement with UAW District 1069 (Pennsylvania) expiring in April 2027.\nOur prior contract with the International Association of Machinists and Aerospace Workers District 751 (IAM 751) expired on September 12, 2024, and 96% of IAM 751 members voted to initiate a strike. The strike lasted until November 4, 2024, when IAM 751 members voted to ratify a new contract. As a result of the strike, we paused production of our commercial aircraft (other than the 787 production in Charleston) and certain of our BDS products, adversely impacting our business and financial position. During the strike, we implemented hiring freezes and announced plans to reduce our overall workforce. For information on risks related to our human capital, see “Risks Related to Our Business and Operations” in"
}