{
  "ticker": "BALL",
  "cik": "0000009389",
  "company_name": "BALL Corp",
  "filing_date": "2025-02-20",
  "accession": "0001558370-25-001190",
  "primary_doc": "ball-20241231x10k.htm",
  "item1_text": "Item 1A.  Risk Factors\n​\nAny of the following risks could materially and adversely affect our business, results of operations, cash flows and financial condition.\n​\nGeneral Risks\n​\nIf we do not effectively manage change and growth, our business could be adversely affected.\n​\nOur future revenue and operating results will depend on our ability to effectively manage the anticipated growth of our business. We have experienced fluctuations in the growth in demand for our products and services in recent years and are rebalancing our operations, managing our headcount, and developing new and innovative product offerings to balance our supply positions with our customers’ requirements in each region. These circumstances have placed significant demands on our management as well as our financial and operational resources, and present several challenges, including:\n​\n●\nrebalancing manufacturing capacity, maintaining quality and optimizing production;\n●\nidentifying, attracting and retaining qualified personnel;\n●\ndeveloping and retaining our global sales, marketing and administrative infrastructure and capabilities;\n●\nincreasing our regulatory compliance capabilities, particularly in new lines of business;\n●\noptimizing our expertise in a number of disciplines, including marketing, licensing, and merchandising; and\n●\nimplementing appropriate operational, financial and IT systems and internal controls.\n​\nOur business, operating results and financial condition are subject to particular risks in certain regions of the world.\n​\nWe may experience an operating loss in one or more regions of the world for one or more periods, which could have a material adverse effect on our business, operating results or financial condition. Moreover, overcapacity, which often leads to lower prices, may develop over time in certain regions in which we operate even if demand continues to grow. More generally, supply and demand fluctuations could make it difficult for us to forecast and meet certain customers’ needs. Our ability to manage such operational fluctuations and to maintain adequate long-term strategies in the face of such developments will be critical to our continued growth and profitability. \n​\nThe loss of a key customer, or a reduction in its requirements, could have a significant negative impact on our sales.\n​\nWe sell a majority of our packaging products to a relatively limited number of major beverage, personal care and household product companies, some of which operate in multiple geographical markets we serve.\n​\nAlthough the majority of our customer contracts are long-term, these contracts, unless they are renewed, expire in accordance with their respective terms and are terminable under certain circumstances, such as our failure to meet quality, volume or market pricing requirements. Because we depend on a relatively limited number of major customers, our business, financial condition or results of operations could be adversely affected by the loss of any of these \n11\n\n\nTable of Contents\ncustomers, a reduction in the purchasing levels of these customers, a strike or work stoppage by a significant number of these customers’ employees or an adverse change in the terms of the supply agreements with these customers.\n​\nWe have a significant level of debt that could have important consequences for our business and any investment in our securities.\n​\nThe company had $5.69 billion of interest-bearing debt at December 31, 2024. Such indebtedness could have significant consequences for our business and any investment in our securities, including:\n​\n●\nincreasing our vulnerability to adverse economic, industry or competitive developments;\n●\nrequiring more of our cash flows from operations to be dedicated to the payment of principal and interest on our indebtedness, thus limiting our cash flow available to fund our operations, capital expenditures and future business opportunities or the return of cash to our shareholders;\n●\nrestricting us from making additional acquisitions;\n●\nlimiting our ability to obtain additional financing for working capital, capital expenditures, product development, debt service requirements, acquisitions and general corporate or other purposes; and\n●\nlimiting our flexibility in planning for, or reacting to, changes in our business or market conditions and placing us at a competitive disadvantage compared to our competitors who may be less leveraged and who, therefore, may be able to take advantage of opportunities that our leverage prevents us from exploiting.\n​\nWe face competitive risks from many sources that may negatively impact our profitability.\n​\nCompetition within the packaging industry is intense. Increases in productivity, combined with potential surplus capacity, have maintained competitive pricing pressures. The principal methods of competition in the general packaging industry are price, innovation, sustainability, service and quality. Some of our competitors may have greater financial, technical and marketing resources, and some may currently have excess capacity. Our current or potential competitors may offer products at a lower price or products that are deemed superior to ours. The global economic environment has resulted in reductions in demand for our products in some instances, which, in turn, could increase these competitive pressures.\n​\nWe are subject to competition from alternative products, which could result in lower profits and reduced cash flows.\n​\nOur aluminum packaging products are subject to significant competition from substitute products, particularly plastic carbonated soft drink bottles made from PET, single serve and returnable beer bottles and other beverage containers made of glass, cardboard or other materials. Competition from plastic carbonated soft drink bottles is particularly intense in the U.S. and Europe, and there is competition from glass beer bottles in Brazil. There can be no assurance that our products will successfully compete against alternative products, which could result in a reduction in our profits or cash flows.\n​\nOur packaging businesses have a narrow product range, and our business would suffer if usage of our products decreased or if decreases occur in the demand for the beverages and other goods filled in our products.\n​\nThe majority of our consolidated net sales were from the sale of beverage containers, and we expect to derive a significant portion of our future revenues and cash flows from the sale of beverage containers. Our business would suffer if the use of beverage containers decreased. Accordingly, broad acceptance by consumers of aluminum containers for a wide variety of beverages is critical to our future success. If demand for glass and PET bottles increases relative to aluminum containers, or the demand for aluminum containers does not develop as expected, our business, results of operations, cash flows and financial condition could be materially adversely affected.\n​\n12\n\n\nTable of Contents\nOur business, financial condition, cash flows and results of operations are subject to risks resulting from broader geographic operations.\n​\nWe derived approximately 54 percent of our consolidated net sales from outside of the U.S. for the year ended December 31, 2024. The sizeable scope of operations inside and outside of the U.S. may lead to more volatile financial results and make it more difficult for us to manage our business. Reasons for this include, but are not limited to, the following:\n​\n●\npolitical and economic instability;\n●\ngovernments’ restrictive trade policies;\n●\nthe imposition or rescission of duties, tariffs, taxes or government royalties;\n●\nexchange rate risks;\n●\ninflation of direct input costs;\n●\nvirus and disease outbreaks and responses thereto; and\n●\ndifficulties in enforcement of contractual obligations and intellectual property rights.\n​\nWe are exposed to exchange rate fluctuations.\n​\nThe company’s financial results are exposed to currency exchange rate fluctuations and a significant proportion of assets, liabilities and earnings are denominated in non-U.S. dollar currencies. The company presents its financial statements in U.S. dollars and has a significant proportion of its net assets, debt and income in non-U.S. dollar currencies, primarily the euro, as well as the currencies of Argentina, Egypt, Turkey and other emerging markets. The company’s financial results and capital ratios are therefore sensitive to movements in currency exchange rates. \n​\nWe manage our exposure to currency fluctuations, particularly our exposure to fluctuations in the euro to U.S. dollar exchange rate to attempt to mitigate the effect of cash flow and earnings volatility associated with exchange rate changes. We primarily use derivative instruments to manage our currency exposures and, as a result, we experience gains and losses on these derivative positions, which are offset by the impact of currency fluctuations on existing assets and liabilities. \n​\nWe are vulnerable to fluctuations and disruptions in the supply and price of raw materials.\n​\nWe purchase aluminum and other raw materials and packaging supplies, including dunnage, from several sources. While all such materials and supplies are available from independent suppliers, they are subject to fluctuations in price and availability attributable to a number of factors, including general economic conditions, commodity price fluctuations (particularly aluminum on the London Metal Exchange), the demand by other industries for the same raw materials and the availability of complementary and substitute materials. Although we enter into commodities purchase agreements from time to time and sometimes use derivative instruments to seek to manage our risk, we cannot ensure that our current suppliers of raw materials will be able to supply us with sufficient quantities at reasonable prices. Economic, financial, and operational factors, including strikes or labor shortages, as well as governmental action, could impact our suppliers, thereby causing supply shortages. Increases in raw material costs, including potential increases due to tariffs, sanctions, or other trade actions, could have a material adverse effect on our business, financial condition or results of operations. Global supply chain disruptions can negatively impact our results. In the Americas, Europe and Asia, some contracts do not allow us to pass along increased raw material costs and we generally use derivative agreements to seek to manage this risk. Our hedging procedures may be insufficient and our results could be materially impacted if costs of materials increase. Due to the fixed-price contracts, increased prices could decrease our sales volume over time. The delayed timing in recovering the pass-through of increasing raw material costs may also impact our short-term profitability and certain costs due to price increases or supply chain inefficiencies may be unrecoverable, which would also impact our profitability. \n​\n13\n\n\nTable of Contents\nNet earnings and net assets could be materially affected by an impairment of goodwill.\n​\nWe have a significant amount of goodwill recorded on our consolidated balance sheet as of December 31, 2024. We are required at least annually to test the recoverability of goodwill. The recoverability test of goodwill is based on the current fair value of our identified reporting units. Fair value measurement requires assumptions and estimates of many critical factors, including revenue and market growth, operating cash flows and discount rates. If general market conditions deteriorate in portions of our business, we could experience a significant decline in the fair value of our reporting units. This decline could lead to an impairment of all or a significant portion of the goodwill balance, which could materially affect our U.S. GAAP net earnings and net assets. \n​\nIf the investments in Ball’s pension plans, or in the multi-employer pension plans in which Ball participates, do not perform as expected, we may have to contribute additional amounts to the plans, which would otherwise be available for other general corporate purposes.\n​\nBall maintains defined benefit pension plans covering a significant portion of its current and former employees in the United States, which are funded based on certain actuarial assumptions. The plans’ assets consist primarily of common stocks, fixed-income securities and alternative investments. Market declines, longevity increases or legislative changes, such as the Pension Protection Act in the U.S., could result in a prospective decrease in our available cash flow and net earnings over time, and the recognition of an increase in our pension obligations could result in a reduction to our shareholders’ equity. Additional risks exist related to the company’s participation in multi-employer pension plans. Assets contributed to a multi-employer pension plan by one employer may be used to provide benefits to employees of other participating employers. If a participating employer in a multi-employer pension plan stops contributing to the plan, the unfunded obligations of the plan may be borne by the remaining participants. This could result in increases to our contributions to the plans as well as pension expense.\n​\nRestricted access to capital markets could adversely affect our short-term liquidity and prevent us from fulfilling our obligations under the notes issued pursuant to our bond indentures.\n​\nA reduction in global market liquidity could:\n​\n●\nrestrict our ability to fund working capital, capital expenditures and other business activities;\n●\nincrease our vulnerability to general adverse economic and industry conditions, including the credit risks stemming from the economic environment;\n●\nlimit our flexibility in planning for, or reacting to, changes in our businesses and the industries in which we operate;\n●\nrestrict us from making strategic acquisitions or exploiting business opportunities; and\n●\nlimit, along with the financial and other restrictive covenants in our debt, among other things, our ability to borrow additional funds, dispose of assets, pay cash dividends or refinance debt maturities. \n​\nIf market interest rates increase, our variable-rate debt and any need to refinance debt will create higher debt service requirements, which adversely affects our cash flows. While we sometimes enter into agreements limiting our exposure, any such agreements may not offer complete protection from this risk.\n​\n14\n\n\nTable of Contents\nThe global credit, financial and economic environment could have a negative impact on our results of operations, financial position or cash flows.\n​\nThe overall credit, financial and economic environment could have significant negative effects on our operations, including:\n​\n●\nthe creditworthiness of customers, suppliers and counterparties could deteriorate resulting in a financial loss or a disruption in our supply of raw materials;\n●\nvolatile market performance could affect the fair value of our pension assets, potentially requiring us to make significant additional contributions to our defined benefit pension plans to maintain prescribed funding levels;\n●\na significant weakening of our financial position or operating results could result in noncompliance with our debt covenants; and\n●\nreduced cash flows from our operations could adversely affect our ability to execute our long-term strategy to repurchase our stock and invest in our businesses.\n​\nChanges in U.S. generally accepted accounting principles (U.S. GAAP) and SEC rules and regulations could materially impact our reported results.\n​\nU.S. GAAP and SEC accounting and reporting changes are common. These changes could have significant effects on our reported results when compared to prior periods and other companies and may even require us to retrospectively adjust prior periods. Additionally, material changes to the presentation of transactions in the consolidated financial statements could impact key ratios that investors, analysts and credit rating agencies use to assess or rate Ball’s performance and could ultimately impact our ability to access the credit markets in an efficient manner.\n​\nA material weakness in our internal control over financial reporting could, if not remediated, result in material misstatements in our financial statements.\n​\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rule 13a-15(f) under the Securities Exchange Act. A material weakness is defined as a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of annual or interim financial statements will not be prevented or detected on a timely basis. If a material weakness is identified, management could conclude that internal control over financial reporting is not effective based on criteria set forth by the Committee of Sponsoring Organization of the Treadway Commission in “\nInternal Control—An Integrated Framework \n(2013).” If a material weakness is identified, a remediation plan would be designed to address the material weakness. If remedial measures are insufficient to address the material weakness, or if additional material weaknesses in internal control are discovered or occur in the future, our consolidated financial statements may contain material misstatements and we could be required to restate our financial results. As of December 31, 2024, the company had no material weaknesses.\n​\nWe face risks related to health epidemics, pandemics and other outbreaks, which could adversely affect our business.\n​\nHealth epidemics, pandemics and other outbreaks could give rise to circumstances that cause one or more of the following risk factors to occur:\n​\n●\nWe could lose key customers, customers could become insolvent or have a reduction in demand for our products and services;\n●\nWe could be subject to changes in laws and governmental regulations that adversely affect our business and operations;\n●\nWe could be subject to adverse fluctuations in currency exchange rates;\n●\nWe might lose key management and operating personnel;\n●\nWe may be subject to disruptions in the supply or price of our raw materials;\n●\nWe may face prolonged work stoppages at our facilities;\n●\nWe may be impacted by government budget constraints or government shutdowns;\n●\nOur pension plan investments may not perform as expected, and we may be required to make additional contributions to our pension plans which would otherwise be available for other general corporate purposes;\n●\nOur access to capital markets may be restricted, which could adversely affect our short-term liquidity and prevent us from fulfilling our obligations under the notes issued pursuant to our bond indentures;\n15\n\n\nTable of Contents\n●\nWe may be subject to increased information technology (IT) security threats and reduced network access availability;\n●\nOur operations and those of our principal customers and suppliers could be designated as non-essential in key markets; and\n●\nA material weakness in our internal control over financial reporting or a material misstatement in our financial statements could occur.\n​\nGovernmental and regulatory risks\n​\nChanges in laws and governmental regulations may adversely affect our business and operations.\n​\nWe and our customers and suppliers are subject to various federal, state, provincial and local laws and regulations, which have been increasing in number and complexity. Each of our, and their, facilities is subject to federal, state, provincial and local licensing and regulation by health, environmental, workplace safety and other agencies in multiple jurisdictions. Requirements of worldwide governmental authorities with respect to manufacturing, manufacturing facility locations within the jurisdiction, product content and safety, climate change, workplace safety and health, environmental, expropriation of assets and other standards could adversely affect our ability to manufacture or sell our products, and the ability of our customers and suppliers to manufacture and sell their products. In addition, we face risks arising from compliance with and enforcement of numerous and complex federal, state, provincial and local laws and regulations.\n​\nEnacted regulatory developments regarding the reporting and use of “conflict minerals” mined from the Democratic Republic of the Congo and adjoining countries could affect the sourcing, availability and price of minerals used in the manufacture of certain of our products. As a result, there may only be a limited pool of suppliers who provide conflict-free materials, and we cannot give assurance that we will be able to obtain such products in sufficient quantities or at competitive prices. Also, because our supply chains are complex, we may face reputational challenges with our customers and other stakeholders if we are unable to sufficiently verify the origins of all materials used in the products that we sell. The compliance and reporting aspects of these regulations may result in incremental costs to the company. \n​\nWhile deposit systems and other container-related legislation have been adopted in some jurisdictions, similar legislation has been defeated in public referenda and legislative bodies in many others. We anticipate that continuing efforts will be made to consider and adopt such legislation in the future. The packages we produce are widely used and perform well in U.S. states, Canadian provinces and European countries that have deposit systems, as well as in other countries worldwide.\n​\nEnvironmental, social and governance reporting requirements and other legislation and regulatory requirements exist and are also evolving. The compliance costs associated with current and proposed laws and potential regulations could be substantial, and any failure or alleged failure to comply with these laws or regulations could lead to litigation or governmental action, all of which could adversely affect our financial condition or results of operations.\n​\nOur business faces the potential of increased regulation on some of the raw materials utilized in our packaging operations.\n​\nOur operations are subject to federal, state, provincial and local laws and regulations in multiple jurisdictions relating to some of the raw materials, including epoxy-based coatings utilized in our container making process. Epoxy-based coatings may contain Bisphenol-A (BPA). Scientific evidence evaluated by regulatory agencies in the U.S., Canada, Europe, Japan, Australia and New Zealand has consistently shown these coatings to be safe for food contact at current levels, and these regulatory agencies have stated that human exposure to BPA from epoxy-based container coatings is well below safe exposure limits set by government bodies worldwide. A significant change in these regulatory agency statements, adverse information concerning BPA or other chemicals present in our coatings, or rulings made within certain federal, state, provincial and local jurisdictions could have a material adverse effect on our business, financial condition or results of operations. Ball recognizes that significant interest exists in non-epoxy based coatings, and we have been proactively working with coatings suppliers and our customers to transition to alternative coatings. In addition, various U.S. states have passed or are contemplating legislation restricting, and the EU is reviewing a proposal to restrict, the use of materials that contain intentionally added per- and polyfluoroalkyl substances (PFAS), which may require the company to continue to incur costs to convert existing coatings to accommodate PFAS-free coatings. To mitigate these risks, the Company is working with its suppliers to require them to remove PFAS-containing coatings from our products. \n16\n\n\nTable of Contents\n​\nEarnings and cash flows can be impacted by changes in tax laws. \n​\nAs a U.S.-based multinational business, the company is subject to income tax in the U.S. and numerous jurisdictions outside the U.S., as well as recent OECD, European Commission and other trans-national initiatives that seek to impose minimum tax thresholds on most multi-national companies. The relevant tax rules and regulations are complex, often changing and, in some cases, are interdependent. If these or other tax rules and regulations should change, the company’s earnings and cash flows could be impacted.\n​\nThe company’s worldwide provision for income taxes is determined, in part, through the use of significant estimates and judgments. Numerous transactions arise in the ordinary course of business where the ultimate tax determination is uncertain. The company undergoes tax examinations by various worldwide tax authorities on a regular basis. While the company believes its estimates of its tax obligations are reasonable, the final outcome after the conclusion of any tax examinations and any litigation could be materially different from what has been reflected in the company’s historical financial statements.\n​\nTechnological risks \n​\nDecreases in our ability to develop or apply new technology and know-how may affect our competitiveness.\n​\nOur success depends partially on our ability to improve production processes and services. We must also introduce new products and services to meet changing customer needs. If we are unable to implement better production processes or to develop new products through research and development or licensing of new technology, we may not be able to remain competitive with other manufacturers. As a result, our business, financial condition, cash flows or results of operations could be adversely affected.\n​\nIncreased information technology (IT) security threats and more sophisticated and targeted computer crime could pose a risk to our systems, networks, products, solutions and services, as well as those of our suppliers and customers.\n​\nThe company’s IT systems, or any third party’s system on which the company relies, as well as those of our suppliers and customers, could fail on their own accord or may be vulnerable to a variety of interruptions or shutdowns, including interruptions or shutdowns due to natural disasters, power outages or telecommunications failures, terrorist attacks or failures during the process of upgrading or replacing software or hardware. Increased global IT security threats and more sophisticated and targeted computer crime also pose a risk to the security of our systems and networks and the confidentiality, availability and integrity of our data, as well as to the security and data of our suppliers and customers. The company has a number of shared service centers where many of the company’s IT systems are concentrated and any disruption at such a location could impact the company’s business within the operating zones served by the impacted service center. \n​\nWhile we attempt to mitigate all of these risks to our networks, systems and data by employing a number of measures, including employee training, comprehensive monitoring of our networks and systems, and maintenance of backup and protective systems, our systems, networks, products, solutions and services remain potentially vulnerable to advanced persistent threats or other IT disruptions. Depending on their nature and scope, such threats could potentially lead to the compromise of confidential information, improper use of our systems and networks, manipulation and destruction of data, defective products, harm to individuals or property, contractual or regulatory actions and fines, penalties and potential liabilities, production downtimes and operational disruptions, which in turn could adversely affect our reputation, competitiveness and results of operations. Data privacy and protection laws are evolving and present increasing compliance challenges, which may increase our costs, affect our competitiveness and could expose us to substantial fines or other penalties.\n​\nHuman capital risks \n​\nIf we fail to retain key management and personnel, we may be unable to implement our key objectives.\n​\nWe believe our future success depends, in part, on our experienced management team. Unforeseen losses of key members of our management team without appropriate succession and/or compensation planning could make it difficult for us to manage our business and meet our objectives. \n17\n\n\nTable of Contents\n​\nProlonged work stoppages at facilities with union employees could jeopardize our financial position.\n​\nAs of December 31, 2024, 13 percent of our North American employees and 27 percent of our European employees were covered by collective bargaining agreements. These collective bargaining agreements have staggered expirations during the next several years. Although we consider our employee relations to be generally good, a prolonged work stoppage or strike at any facility with union employees could have a material adverse effect on our business, financial condition, cash flows or results of operations. In addition, we cannot ensure that upon the expiration of existing collective bargaining agreements, new agreements will be reached without union action or that any such new agreements will be on terms satisfactory to us.\n​\nEnvironmental risks\n​\nAdverse weather and climate changes may result in lower sales.\n​\nWe manufacture packaging products primarily for beverages. Unseasonable weather can reduce demand for certain beverages packaged in our containers. Climate changes and the increasing frequency of severe weather events could have various effects on the demand for our products, our supply chain and the costs of inputs to our production and delivery of products in different regions around the world. Our plants’ production may be prevented or curtailed due to severe or unanticipated weather and climate events.\n​\nOur business is subject to substantial environmental remediation and compliance costs.\n​\nOur operations are subject to federal, state, provincial and local laws and regulations in multiple jurisdictions relating to environmental hazards, such as emissions to air, discharges to water, the handling and disposal of hazardous and solid wastes and the clean-up of hazardous substances. We have been designated, along with numerous other companies, as a potentially responsible party for the clean-up of several hazardous waste sites. Additionally, there is increased focus on the regulation of greenhouse gas emissions and other environmental issues worldwide. We strive to mitigate such risks related to environmental issues, including through the purchase of renewable energy, the adoption of sustainable practices, and by positioning ourselves as a sustainability leader in our industry.\n​\nItem 1B. Unresolved Staff Comments\n​\nThere were no matters required to be reported under this item.\n​\nItem 1C. Cybersecurit\ny\n​\nRisk management and strategy\n​\nBall Corporation is committed to maintaining a strong cybersecurity posture. \nWe have a dedicated, globally distributed information security team that is responsible for leading information security strategy, standards and processes, which\n are integrated \ninto our comprehensive enterprise risk management process, including processes related to cybersecurity risks.\n​\nThe company employs a standards-based cybersecurity program aligned to the National Institute of Standards and Technology (NIST) Cybersecurity Framework (CSF), including ongoing assessment and continuous improvement to address the rapidly evolving threat landscape. Ball partners closely with a strong network of external partners, including conducting annual assessments of the cyber risk management program against the NIST CSF.\n​\nOur information security team has established and implemented formal processes and policies to assess, identify, and manage risks arising from cybersecurity threats, including those associated with our internal operations and the use of third-party service providers.\n We continually refine our approach to address evolving cybersecurity regulations, identify potential and emerging security risks, and implement strategies to manage these risks. Ball has developed an incident response plan that includes a cyber incident materiality assessment with appropriate leadership governance. In addition, we have aligned our incident response plan with our enterprise risk and global crisis management processes. \n​\nIn response to the ever-evolving cyber threat landscape, Ball utilizes external experts to support continuous improvement across our cyber program, processes and operations. Our collaboration with these third-parties includes regular audits, \n18\n\n\nTable of Contents\nthreat assessments, and consultation on cyber enhancements. In addition, we also augment and extend our cyber team using a select \nfew trusted third-party\n partners that are integrated as members of our global operations. This provides us with expanded global threat intel and enhances our ability to deliver continuous global cyber operations 24/7.\n​\nWe are aware that there are potential cybersecurity risks associated with third-party service providers. Prior to engaging with third-party providers, Ball conducts thorough security assessments. We monitor for third-party cyber incidents and manage any third-party cyber incidents under our incident response plan and processes. Our oversight of third-party cyber risk aids our ability to lessen and mitigate impacts related to data breaches and other security incidents originating from third-parties.\n​\nBall faces risks from cybersecurity threats that could have a material adverse effect on the company, including its business strategy, results of operations, financial condition and reputation. Refer to"
}