{
  "ticker": "BAX",
  "cik": "0000010456",
  "company_name": "BAXTER INTERNATIONAL INC",
  "filing_date": "2025-02-21",
  "accession": "0001628280-25-007201",
  "primary_doc": "bax-20241231.htm",
  "item1_text": "Item 1A. Risk Factors of this Annual Report on Form 10-K.\n37\nRECENT BUSINESS COMBINATIONS AND ASSET ACQUISITIONS\nZosyn\nOn March 22, 2022, we entered into an agreement with a subsidiary of Pfizer Inc. to acquire the rights to Zosyn, a premixed frozen piperacillin-tazobactam product, in the U.S. and Canada. Zosyn is used for the treatment of intra-abdominal infections, nosocomial pneumonia, skin and skin structure infections, female pelvic infections and community-acquired pneumonia. Under the terms of the acquisition, we paid the acquisition price of $122 million and received specified intellectual property, including patent rights, in the first quarter of 2022 and received additional intellectual property, including the product rights to Zosyn, in the first quarter of 2023. Under the arrangement, we received profit sharing payments from sales of Zosyn until the product rights transferred to us in March 2023. Refer to Note 3 in Item 8 of this Annual Report on Form 10-K for additional information regarding our acquisition of the rights to Zosyn.\nHillrom\nIn 2021, we acquired Hillrom. In 2024, 2023 and 2022 our Healthcare Systems & Technologies segment (formerly referred to as our Hillrom segment) generated net sales of $2.95 billion, $3.01 billion, and $2.94 billion, respectively. During 2024, we recorded a $425 million goodwill impairment related to our Front Line Care reporting unit within our Healthcare Systems & Technologies segment. During 2022, we also recognized $2.81 billion of goodwill impairments and $332 million of indefinite-lived intangible asset impairments related to goodwill and trade name intangible assets that arose from the Hillrom acquisition. See Notes 3, 5 and 18 in Item 8 of this Annual Report on Form 10-K for additional information about the Hillrom acquisition, goodwill and intangible asset impairments, and our Healthcare Systems & Technologies segment results, respectively.\nNON-GAAP FINANCIAL MEASURES\nOur presentation of percentage changes in net sales at constant currency rates, which is computed using current period local currency sales at the prior period’s foreign exchange rates, is a non-GAAP financial measure. This measure provides information about growth (or declines) in our net sales as if foreign currency exchange rates had not changed between the prior period and the current period. We believe that the non-GAAP measure of percent change in net sales at constant currency rates, when used in conjunction with the U.S. GAAP measure of percent change in net sales at actual currency rates, may provide a more complete understanding and facilitate a fuller analysis of our results of operations, particularly in evaluating performance from one period to another.\nRESULTS OF OPERATIONS\nCONSOLIDATED NET SALES\nPercent change\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n3\nyears ended December 31 (in millions)\n2024\n2023\n2022\n2024\n2023\n2024\n2023\nUnited States\n$\n5,850 \n$\n5,802 \n$\n5,769 \n1 \n%\n1 \n%\n1 \n%\n1 \n%\nEmerging markets \n1\n1,350 \n1,343 \n1,253 \n1 \n%\n7 \n%\n3 \n%\n8 \n%\nRest of world \n2\n3,436 \n3,215 \n3,035 \n7 \n%\n6 \n%\n7 \n%\n6 \n%\nTotal net sales\n$\n10,636 \n$\n10,360 \n$\n10,057 \n3 \n%\n3 \n%\n3 \n%\n3 \n%\n1\n \nEmerging markets include sales from our operations in Eastern Europe, the Middle East, Africa, Latin America and Asia (except for Japan).\n2\n Rest of world includes sales from our operations in Western Europe, Canada, Japan, Australia and New Zealand.\n3\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\n38\nAs set forth above, foreign currency had no material impact on net sales during the year ended December 31, 2024, as compared to the prior year period, primarily due to the strengthening of the U.S. Dollar relative to the Turkish Lira, Japanese Yen, Brazilian Real, Mexican Peso, and the Canadian Dollar, offset by the weakening of the U.S. Dollar relative to the British Pound and Colombian Peso. Foreign currency had no material impact on net sales during the year ended December 31, 2023, as compared to the prior year period, primarily due to the strengthening of the U.S. Dollar relative to the Euro, Turkish Lira, Australian Dollar, Japanese Yen and Chinese Renminbi offset by the weakening of the U.S. Dollar relative to the Mexican Peso and Brazilian Real.\nNET SALES BY SEGMENT\nMedical Products & Therapies\nOur Medical Products & Therapies segment includes sales of our sterile IV solutions, infusion systems, administration sets, parenteral nutrition therapies and surgical hemostat, sealant and adhesion prevention products. \nPercent change\nyears ended December 31 (in millions)\n2024\n2023\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nInfusion Therapies & Technologies\n$\n4,103 \n$\n3,960 \n4 \n%\n4 \n%\nAdvanced Surgery\n1,104 \n1,051 \n5 \n%\n6 \n%\nTotal Medical Product & Therapies net sales\n$\n5,207 \n$\n5,011 \n4 \n%\n5 \n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nMedical Product & Therapies segment net sales increased 4% for the year ended December 31, 2024, as compared to the prior year period. \nInfusion Therapies & Technologies net sales increased 4% for the year ended December 31, 2024, as compared to the prior year period. Sales performance in 2024 primarily reflected growth in Infusion Systems as a result of sales of our Novum IQ large volume infusion and syringe pump in the U.S., and sales of Nutrition product offerings, which was attributable to both pricing initiatives and increased sales volume. In September 2024, Hurricane Helene, which brought significant rain and extensive flooding to Western North Carolina, caused damage to certain of our assets at our North Cove facility in Marion, N.C. and disrupted operations at that facility. This facility, which manufactures IV Solutions primarily for the U.S. market, was not fully operational for most of the fourth quarter. As a consequence, Hurricane Helene had an estimated $110 million adverse impact on sales, which offset price and underlying volume gains during the year.\nAdvanced Surgery net sales increased 5% for the year ended December 31, 2024, as compared to the prior year period, driven by growth in hemostats and sealants and was primarily attributable to increased sales volume. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2024, as compared to the prior year period.\nPercent change\nyears ended December 31 (in millions)\n2023\n2022\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nInfusion Therapies & Technologies\n$\n3,960 \n$\n3,817 \n4 \n%\n4 \n%\nAdvanced Surgery\n1,051 \n998 \n5 \n%\n6 \n%\nTotal Medical Product & Therapies net sales\n$\n5,011 \n$\n4,815 \n4 \n%\n4 \n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nMedical Product & Therapies segment net sales increased 4% for the year ended December 31, 2023, as compared to the prior year period. \nInfusion Therapies & Technologies net sales increased 4% for the year ended December 31, 2023, as compared to the prior year period. Sales performance in 2023 reflected strong demand for our infusion systems and \n39\nadministration sets, as well as growth in IV solutions and international nutrition compounding, partially offset by lower sales of parenteral nutrition products in the U.S. as compared to the prior year. \nAdvanced Surgery net sales increased 5% for the year ended December 31, 2023, as compared to the prior year period, driven by continued recovery in surgical procedures, partially offset by temporary supply constraints, the exit of a product distribution arrangement and a comparison against prior year periods that benefited from competitor supply constraints. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2023, as compared to the prior year period.\nHealthcare Systems & Technologies\nOur Healthcare Systems & Technologies segment includes sales of our connected care solutions and collaboration tools, including smart bed systems, patient monitoring systems and diagnostic technologies, respiratory health devices and advanced equipment for the surgical space, including surgical video technologies, precision positioning devices and other accessories.\nPercent change\nyears ended December 31 (in millions)\n2024\n2023\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nCare and Connectivity Solutions\n$\n1,814 \n$\n1,800 \n1 \n%\n1 \n%\nFront Line Care\n1,137 \n1,213 \n(6)\n%\n(6)\n%\nTotal Healthcare Systems & Technologies net sales\n$\n2,951 \n$\n3,013 \n(2)\n%\n(2)\n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nHealthcare Systems & Technologies segment net sales decreased 2% for the year ended December 31, 2024, as compared to the prior year period. \nCare and Connectivity Solutions net sales increased 1% for the year ended December 31, 2024, driven by increased order volume associated with capital spending in the U.S. as compared to the prior year, partially offset by declines in care communication products driven by the shifting of installations to future periods and lower sales outside of the U.S.\nFront Line Care net sales decreased 6% for the year ended December 31, 2024, as compared to the prior year period, primarily driven by a backlog reduction in the prior year period which increased sales in the prior year, reduced demand in the primary care market, lower government orders, certain product exits and select supply constraints impacting product availability. These declines were partially offset by growth in our cardiology products.\nPercent change\nyears ended December 31 (in millions)\n2023\n2022\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nCare and Connectivity Solutions\n$\n1,800 \n$\n1,791 \n1 \n%\n1 \n%\nFront Line Care\n1,213 \n1,148 \n6 \n%\n6 \n%\nTotal Healthcare Systems & Technologies net sales\n$\n3,013 \n$\n2,939 \n3 \n%\n3 \n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nHealthcare Systems & Technologies segment net sales increased 3% for the year ended December 31, 2023, as compared to the prior year period.  \nCare and Connectivity Solutions net sales increased 1% for the year ended December 31, 2023, as compared to the prior year period, driven by international demand and sales generated from recent product launches in the U.S., partially offset by lower rental revenues and lower capital spending in the U.S. reflecting the macroeconomic environment in 2023.\nFront Line Care net sales increased 6% for the year ended December 31, 2023, as compared to the prior year period, primarily driven by increased demand for our cardiology products, patient monitoring systems and physical assessment tools. Performance in the current year benefited from backlog reductions due to improved availability of component parts used in certain of our products. \n40\nPharmaceuticals\nOur Pharmaceuticals segment includes sales of specialty injectable pharmaceuticals, inhaled anesthetics and drug compounding services.\nPercent change\nyears ended December 31 (in millions)\n2024\n2023\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nInjectables and Anesthesia\n$\n1,373 \n$\n1,347 \n2 \n%\n3 \n%\nDrug Compounding\n1,038 \n902 \n15 \n%\n15 \n%\nTotal Pharmaceuticals net sales\n$\n2,411 \n$\n2,249 \n7 \n%\n7 \n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nPharmaceuticals segment net sales increased 7% for the year ended December 31, 2024, as compared to the prior year period. \nInjectables and Anesthesia net sales increased 2% for the year ended December 31, 2024, as compared to the prior year period, primarily due to growth in our U.S. specialty injectable products, driven by strong sales volume in our core portfolio and recent product launches, partially offset by declines for inhaled anesthetics. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2024, as compared to the prior year period.\nDrug Compounding net sales increased 15% for the year ended December 31, 2024, as compared to the prior year period, driven by increased demand for our international pharmacy compounding offerings, due in part, to customer capacity constraints that resulted in increased outsourcing of compounding activities. \nPercent change\nyears ended December 31 (in millions)\n2023\n2022\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nInjectables and Anesthesia\n$\n1,347 \n$\n1,305 \n3 \n%\n4 \n%\nDrug Compounding\n902 \n821 \n10 \n%\n12 \n%\nTotal Pharmaceuticals net sales\n$\n2,249 \n$\n2,126 \n6 \n%\n7 \n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nPharmaceuticals segment net sales increased 6% for the year ended December 31, 2023, as compared to the prior year period. \nInjectables and Anesthesia net sales increased 3% for the year ended December 31, 2023, as compared to the prior year period, primarily due to growth in our U.S. injectable products, driven by our launches of Zosyn, following the transfer of the related product rights to us in April 2023, Bendamustine and Norepinephrine, partially offset by lower sales of inhaled anesthesia products. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2023, as compared to the prior year period.\nDrug Compounding net sales increased 10% for the year ended December 31, 2023, as compared to the prior year period, driven by increased demand for our international pharmacy compounding services. Foreign currency exchange rates adversely impacted net sales by 2% for the year ended December 31, 2023, as compared to the prior year period. \nOther \nDuring the years ended December 31, 2024, 2023 and 2022, we earned $67 million, $87 million and $177 million, respectively, of revenues that were not attributable to our reportable segments. In the current and prior year periods, Other sales primarily represent revenues earned by certain of our manufacturing facilities from contract manufacturing activities. The years ended December 31, 2023 and 2022 also included royalty income under a business development arrangement. The decrease in Other sales for the year ended December 31, 2024 as compared to the prior year period reflects lower contract manufacturing volume. The decrease for the year ended December 31, 2023 as compared to the prior year period was primarily driven by lower contract manufacturing \n41\nvolume and, to a lessor extent, termination of the royalty arrangement following our acquisition of the rights to the underlying product. \nSpecial Items\nManagement believes that providing the separate impact of the following items on our results in accordance with U.S. GAAP may provide a more complete understanding of our operations and can facilitate a fuller analysis of our results of operations, particularly in evaluating performance from one period to another. Intangible asset amortization expense is identified as a special item to facilitate an evaluation of current and past operating performance and is consistent with how management and our Board of Directors assess performance. Additional special items are identified because they are highly variable, difficult to predict and of a size that may substantially impact our reported results of operations for the period. \n42\nThe following table provides a summary of our special items and the related impact by line item on our consolidated results of operations for 2024, 2023 and 2022.\nyears ended December 31 (in millions)\n2024\n2023\n2022\nGross Margin\nIntangible asset amortization expense\n$\n(419)\n$\n(383)\n$\n(392)\nLong-lived asset impairments\n1\n— \n— \n(344)\nBusiness optimization items\n2\n(67)\n(27)\n(16)\nProduct related items\n3\n(15)\n— \n(44)\nAcquisition and integration items\n4\n(1)\n(1)\n(170)\nEuropean medical devices regulation\n5\n(33)\n(41)\n(42)\nHurricane Helene costs\n6\n(110)\n— \n— \nTotal Special Items\n$\n(645)\n$\n(452)\n$\n(1,008)\nImpact on Gross Margin Ratio\n(6.0 pts)\n(4.3 pts)\n(10.0 pts)\nSelling, General and Administrative (SG&A) Expenses\nIntangible asset amortization expense\n$\n206 \n$\n207 \n$\n287 \nBusiness optimization items\n2\n65 \n137 \n174 \nAcquisition and integration items\n4\n22 \n18 \n82 \nLegal matters\n7\n17 \n15 \n— \nTotal Special Items\n$\n310 \n$\n377 \n$\n543 \nImpact on SG&A Expense Ratio\n2.9 pts\n3.6 pts\n5.4 pts\nR&D Expenses\nBusiness optimization items\n2\n$\n30 \n$\n10 \n$\n3 \nLong-lived asset impairments\n1\n50 \n— \n— \nTotal Special Items\n$\n80 \n$\n10 \n$\n3 \nImpact on R&D Expense Ratio\n0.7 pts\n0.1 pts\n0.1 pts\nGoodwill Impairments\nGoodwill impairments\n8\n$\n425 \n$\n— \n$\n2,812 \nTotal Special Items\n$\n425 \n$\n— \n$\n2,812 \nOther Operating Expense (Income), Net\nAcquisition and integration items\n4\n$\n— \n$\n(19)\n$\n(39)\nLegal matters\n7\n— \n(8)\n— \nLoss on product divestiture arrangement\n9\n— \n— \n54 \nLoss on subsidiary liquidation\n10\n— \n— \n21 \nTotal Special Items\n$\n— \n$\n(27)\n$\n36 \nOther (Income) Expense, Net\nPension curtailment\n11\n$\n— \n$\n— \n$\n(11)\nReclassification of cumulative translation loss to earnings\n12\n— \n— \n65 \nInvestment impairments\n13\n— \n31 \n— \nTotal Special Items\n$\n— \n$\n31 \n$\n54 \nIncome Tax Expense (Benefit)\nTax matters\n14\n$\n80 \n$\n65 \n$\n25 \nTax effects of special items\n15\n(248)\n(226)\n(375)\nTotal Special Items\n$\n(168)\n$\n(161)\n$\n(350)\nImpact on Effective Tax Rate\n(30.3) pts\n4.7 pts\n(13.6) pts\n1\nOur results in 2024 included a long-lived asset impairment charge of $50 million to reduce the carrying amount of an IPR&D asset to its fair value. Our results in 2022 included long-lived asset impairment charges related to assets acquired in our December 2021 acquisition of Hillrom, comprised of (i) $332 million of indefinite-lived intangible assets and (ii) $12 million of developed technology intangible asset impairments. Refer to Notes 3 and 5 in Item 8 of this Annual Report on Form 10-K for further information regarding the impairments. Long-lived asset impairments presented within this special item do not include impairments of long-lived assets related to restructuring actions, which are presented within the business optimization special item described in footnote 2 below.\n43\n2\nOur results in 2024, 2023 and 2022 were impacted by costs associated with our execution of programs to optimize our organization and cost structure. In 2024, these restructuring and other business optimization costs included costs primarily related to initiatives to reduce our cost structure following the sale of our Kidney Care segment, initiatives within our Healthcare Systems & Technologies segment including the discontinuance of a product line and rationalization of certain other manufacturing and distribution facilities. In 2023 and 2022, these restructuring and other business optimization costs included actions related to our implementation of a new operating model intended to simplify and streamline our operations and better align our manufacturing and supply chain to our commercial activities, and our ongoing integration of Hillrom. Our results in 2024 and 2023 and 2021 included business optimization charges of $162 million, $174 million, $193 million, respectively. Refer to Note 12 in Item 8 of this Annual Report on Form 10-K for further information regarding these charges and related liabilities. \n3\nOur results in 2024 included charges of $15 million, comprised of (i) $12 million related to warranty and remediation activities arising from field corrective actions on Healthcare Systems & Technologies products and (ii) $3 million related to a revised estimate of warranty and remediation activities arising from a field corrective action on certain of our infusion pumps initially recorded in 2022. Our results in 2022 included charges of $44 million related to warranty and remediation activities arising from two field corrective actions on certain of our infusion pumps. \n4\nOur results in 2024 included $23 million of integration costs which primarily reflected third-party consulting costs related to our integration of Hillrom. Our results in 2023 included $19 million of integration-related costs, primarily related to our integration of Hillrom, offset by a $19 million benefit from changes in the estimated fair values of contingent consideration liabilities. Our results in 2022 included $213 million of acquisition and integration-related items, which reflected $93 million of integration-related costs and $159 million of incremental cost of sales from the fair value step-ups on acquired Hillrom inventory that was sold in 2022, partially offset by a $39 million benefit from changes in the estimated fair value of contingent consideration liabilities. Refer to Note 3 in Item 8 of this Annual Report on Form 10-K for further information regarding business and asset acquisitions. \n5\nOur results in 2024, 2023 and 2022 included $33 million, $41 million and $42 million, respectively, of incremental costs to comply with the European Union's medical device regulations for previously registered products, which primarily consist of contractor costs and other direct third-party costs. We consider the adoption of these regulations to be a significant one-time regulatory charge and believe that the costs of initial compliance for previously registered products over the implementation period are not indicative of our core operating results. \n6\nOur results in 2024 included pre-tax net charges of $110 million related damages caused by Hurricane Helene. This amount consisted of $44 million related to the write-off of damaged inventory and fixed assets, as well as $317 million of remediation, idle facility, air freight and other costs, partially offset by $251 million of insurance recoveries. Refer to Note 1 in Item 8 of this Annual Report on Form 10-K for further information. \n7\nOur results in 2024 included charges of $17 million related to environmental reserves for remediation actions associated with historic operations at certain of our facilities. Our results in 2023 included $7 million of net costs from certain legal matters. These costs included $13 million, including related legal fees, related to matters involving alleged violations of the False Claims Act related to a now-discontinued legacy Hillrom sales line and alleged injury from environmental exposure, partially offset by $6 million of proceeds received, net of related legal fees, from a settlement related to an intellectual property dispute.\n8\nOur results in 2024 included a goodwill impairment charge of $425 million related to the Front Line Care reporting unit within our Health Care Systems & Technologies segment. Our results in 2022 included goodwill impairment charges of $2.81 billion related to reporting units within our Health Care Systems & Technologies segment. Refer to Notes 3 and 5 in Item 8 of this Annual Report on Form 10-K for further information regarding these goodwill impairments.\n9\nOur results in 2022 included a loss of $54 million under an arrangement to divest certain product rights for an amount that is less than our cost of those product rights, which was triggered by U.S. and European Union regulatory approvals of the related products. Refer to Note 3 in Item 8 of this Annual Report on Form 10-K for further information about the related transactions.\n10\nOur results in 2022 included a loss of $21 million related to our deconsolidation of a foreign subsidiary, including the derecognition of a related noncontrolling interest, upon its liquidation in December 2022 that was completed in connection with our legal entity rationalization activities. \n11\nOur results in 2022 included a curtailment gain of $11 million related to an announced change for active non-bargaining participants in our U.S. Hillrom pension plan. Refer to Note 13 in Item 8 of this Annual Report on Form 10-K for further information regarding this curtailment gain.\n12\nOur results in 2022 included a charge of $65 million for cumulative translation adjustments (CTA) reclassified from accumulated other comprehensive income (loss) as a result of the substantial liquidation of our operations in Argentina.\n13\nOur results in 2023 included $31 million of net pre-tax losses from non-marketable investments in several early-stage companies, consisting of $34 million of noncash impairment write-downs, partially offset by a $3 million gain from the sale of an investment.  \n14\nOur results in 2024 included a $80 million net income tax expense consisting of a $28 million valuation allowance recorded to reduce the carrying amount of tax attribute carryforwards in the U.S., $22 million of net income tax costs on internal reorganization transactions related to the sale of our Kidney Care segment, a $17 million income tax expense related to legislative changes under Internal Revenue Code of 1986 (IRC) Section 987 (which is the exchange gain or loss on foreign branch remittances in the U.S., effective in 2024), and a $13 million net revaluation of the Swiss basis step-up deferred tax asset and related valuation allowance that arose from Swiss tax reform legislation in 2019 that was partially offset by a decrease in such valuation allowance to reflect our current estimate of recoverability of the basis step-up deferred tax asset. Our results in 2023 included a $14 million income tax expense from separation related income tax costs associated with the sale of our BPS business, and a $9 million valuation allowance to reduce the carrying amount of a deferred tax asset for a tax basis step-up related to previously enacted Swiss tax reform legislation to reflect our current estimate of its recoverability with the remaining tax expense related to the tax effects of other special items. Our results in 2022 included a $25 million valuation allowance to reduce the carrying amount of a deferred tax asset for a tax basis step-up related to previously enacted Swiss tax reform legislation to reflect our current estimate of its recoverability.\n15\nThis item reflects the income tax impact of the special items identified in this table. The tax effect of each special item is based on the jurisdiction in which the item was incurred and the tax laws in effect for each such jurisdiction.\nCOSTS AND EXPENSES\n44\nGross Margin and Expense Ratios\n2024\n2023\nyears ended December 31\n2024\n% of net sales\n2023\n% of net sales\n2022\n% of net sales\n$ change\n% change\n$ change\n% change\nGross margin\n$\n3,984 \n37.5 \n%\n$\n4,150 \n40.1 \n%\n$\n3,549 \n35.3 \n%\n$\n(166)\n(4.0)\n%\n$\n601 \n16.9 \n%\nSG&A\n$\n2,967 \n27.9 \n%\n$\n2,953 \n28.5 \n%\n$\n3,097 \n30.8 \n%\n$\n14 \n0.5 \n%\n$\n(144)\n(4.6)\n%\nR&D\n$\n590 \n5.5 \n%\n$\n518 \n5.0 \n%\n$\n450 \n4.5 \n%\n$\n72 \n13.9 \n%\n$\n68 \n15.1 \n%\nGross Margin\nThe gross margin ratio was 37.5%, 40.1% and 35.3% for the years ended 2024, 2023 and 2022, respectively. The special items identified earlier in this section had an unfavorable impact on gross margin ratio of 6.0, 4.3, and 10.0\n \npercentage points in 2024. 2023, and 2022, respectively. Refer to the Special Items caption earlier in this section for additional detail.\nExcluding the impact of special items, the gross margin ratio decreased 0.9 percentage points in 2024 compared to 2023 and decreased 0.9 percentage points in 2023 compared to 2022. The decrease in 2024 was driven by an unfavorable product mix, partially offset by initiatives to reduce our manufacturing and supply chain costs. The decrease in 2023 was primarily due to the adverse cost impacts of raw materials inflation driving higher manufacturing costs and higher bonus accruals under our annual employee incentive compensation plans, partially offset by manufacturing initiatives.\nSG&A\nThe SG&A expense ratio was 27.9%, 28.5% and\n \n30.8% for the years ended 2024, 2023 and 2022, respectively. The special items identified earlier in this section had an unfavorable impact on the SG&A expense ratio of 2.9, 3.6 and 5.4 percentage points in 2024, 2023 and 2022, respectively. Refer to the Special Items caption earlier in this section for additional detail.\nExcluding the impact of special items, the SG&A expense ratio increased 0.1 percentage points in 2024 compared to 2023 and decreased 0.5 percentage points in 2023 compared to 2022. The increase in 2024 was primarily due to higher corporate function costs and annual compensation increases, partially offset by lower accruals under our annual employee incentive compensation plans. The decrease in 2023 was primarily due to savings from restructuring actions implemented in recent periods, partially offset by higher bonus accruals under our annual employee incentive compensation plans.\nR&D\nThe R&D expense ratio was 5.5%, 5.0% and 4.5% for the years ended 2024, 2023 and 2022, respectively. The special items identified earlier in this section had an unfavorable impact on the R&D expense ratio of 0.7 percentage points in 2024\n, \nand 0.1 percentage points both in 2023 and 2022. Refer to the Special Items caption earlier in this section for additional detail.\nExcluding the impact of special items, the R&D expense ratio decreased 0.1 percentage points in 2024 compared to 2023 and increased 0.5 basis points in 2023 compared to 2022. The decrease in 2024 was driven by lower bonus accruals under our annual employee incentive compensation plans. The increase in 2023 reflected higher outbound freight costs.\nBusiness Optimization Items\nIn recent years, we have undertaken actions to transform our cost structure and enhance operational efficiency. These efforts include restructuring the organization, optimizing the manufacturing footprint, R&D operations and supply chain network, employing disciplined cost management and centralizing and streamlining certain support functions. The costs of restructuring actions consisted primarily of employee termination costs, contract termination costs and asset impairments. \nWe incurred restructuring charges of $162 million, $174 million and $193 million in 2024, 2023 and 2022, respectively. In 2024, $45 million of the restructuring charges, consisting of employee termination costs, were related to initiatives to reduce our cost structure following the sale of our Kidney Care segment. In addition, $46 \n45\nmillion of the restructuring charges were related to business optimization initiatives within our Healthcare Systems & Technologies segment. These charges included $21 million of long-lived asset impairment charges, $9 million of other asset write-downs related to inventory and $2 million of employee termination costs related to our decision to discontinue a product line. Additionally, these charges included $14 million of employee termination costs related to other business optimization initiatives within this segment. In 2023, $81 million of the restructuring charges, consisting of employee termination costs, were related to the implementation of our new operating model intended to streamline our operations. In 2022, $85 million restructuring charges were related to integration activities for the Hillrom acquisition, consisting of $55 million of employee termination costs, $22 million of contract terminations and other costs and $8 million of asset impairments. \nWe currently expect to incur additional pre-tax cash costs, primarily related to the implementation of business optimization programs, of approximately $4 million through the completion of initiatives that are currently underway. We continue to pursue cost savings initiatives, including those intended to mitigate a portion of the dis-synergies expected to arise as a result of the sale of our Kidney Care business, and to the extent further cost savings opportunities are identified, we would incur additional restructuring charges and costs to implement business optimization programs in future periods. Refer to Note 12 in Item 8 of this Annual Report on Form 10-K for additional information regarding our business optimization programs.\nGoodwill Impairments\nWe assess goodwill and indefinite-lived intangible assets for impairment annually during the fourth quarter or whenever events or changes in circumstances indicate that the carrying amount of such assets may not be recoverable. We recognize a goodwill impairment charge for the amount by which a reporting unit's carrying amount exceeds its fair value.\nIn connection with our annual goodwill impairment assessment in the fourth quarter of 2024, we recorded a $425 million goodwill impairment related to our Front Line Care reporting unit within our Healthcare Systems & Technologies segment. The reduction in value was primarily due to lower forecasted operating results and a lower terminal growth rate utilized in valuing this reporting unit which contributed to reduced expected future cash flows, as well as lower earnings multiples. The fair value of the Front Line Care reporting unit was determined based on a discounted cash flow model (an income approach) and earnings multiples (a market approach) based on the guideline public company method. Significant assumptions used in the determination of the fair values of our reporting units generally include revenue growth rates, forecasted earnings before income, taxes, depreciation and amortization (EBITDA) margins, discount rates, terminal growth rates and earnings multiples. The discounted cash flow model used to determine the fair value of our Front Line Care reporting unit reflected our most recent cash flow projections, a discount rate of 9.5% and a terminal growth rate of 3.25%. Our reporting unit fair value measurements are classified as Level 3 in the fair value hierarchy because they involve significant unobservable inputs. As of December 31, 2024, the carrying amount of goodwill for our Front Line Care reporting unit was $1.99 billion. No goodwill impairments were recorded for our remaining reporting units in connection with our annual goodwill impairment tests because the fair values of those reporting units exceeded their carrying amounts. Refer to Note 5 in Item 8 of this Annual Report on Form 10-K for additional information regarding this goodwill impairment charge.\nWe acquired Hillrom on December 13, 2021 and recognized $6.83 billion of goodwill and $6.03 billion of other intangible assets, including $1.91 billion of indefinite-lived intangible assets, in connection with that acquisition. During the third quarter of 2022, we performed trigger-based impairment tests for each of the reporting units within our Hillrom segment (currently referred to as our Healthcare Systems & Technologies segment), as well as the indefinite-lived intangible assets, consisting primarily of trade names, that we acquired in connection with the Hillrom acquisition. We performed those tests as of September 30, 2022 due to (a) current macroeconomic conditions, including the rising interest rate environment and broad declines in equity valuations, and (b) reduced earnings forecasts for our three Hillrom reporting units, driven primarily by shortages of certain component parts used in our products, raw materials inflation and increased supply chain costs. Those goodwill impairment tests resulted in total pre-tax goodwill impairment charges of $2.79 billion in the third quarter of 2022. In connection with our annual goodwill impairment assessment in the fourth quarter of 2022, we performed quantitative impairment tests for all our reporting units and recorded an additional $27 million goodwill impairment related to our Global Surgical Solutions reporting unit (now combined with our previous Patient Support Systems reporting unit in our Care and Connectivity \n46\nSolutions reporting unit). Refer to Note 3 in Item 8 of this Annual Report on Form 10-K for additional information regarding these goodwill impairment charges.\nFurther adverse changes to macroeconomic conditions or our earnings forecasts could lead to additional goodwill impairment charges in future periods and such charges could be material to our results of operations. For further discussion, refer to"
}