{
  "ticker": "BBY",
  "cik": "0000764478",
  "company_name": "BEST BUY CO INC",
  "filing_date": "2025-03-19",
  "accession": "0000764478-25-000007",
  "primary_doc": "bby-20250201x10k.htm",
  "item1_text": "Item 1A. Risk Factors.\n \nDescribed below are certain risks we believe apply to our business and the industry in which we operate. The risks are categorized using the following headings: external, strategic, operational, regulatory and legal, and financial and market. Each of the following risk factors should be carefully considered in conjunction with other information provided in this Annual Report on Form 10-K and in our other public disclosures. The risks described below highlight potential events, trends or other circumstances that could adversely affect our business, financial condition, results of operations, cash flows, liquidity or access to sources of financing and, consequently, the market value of our common stock and debt instruments. These risks could cause our future results to differ materially from historical results and from guidance we may provide regarding our expectations of future financial performance. The risks described below are not an exhaustive list of all the risks we face. There may be others that we have not identified or that we have deemed to be immaterial. All forward-looking statements made by us or on our behalf are qualified by the risks described below.\n \nExternal Risks \n \nMacroeconomic pressures may adversely affect consumer spending and our financial results.\n \nTo varying degrees, our products and services are sensitive to changes in macroeconomic conditions. Consumer demand for the products and services that we offer could be affected by a number of factors, including: real GDP growth, inflation, recession, consumer confidence, employment levels, cost of living, tax rates, availability of consumer financing, interest rates, housing market conditions, foreign currency exchange rates, the price of oil, gas and other commodities, and other macroeconomic trends. Additionally, the impact of these factors could be compounded with respect to discretionary purchases of consumer electronics. \n \nThese macroeconomic conditions impact consumer behavior and spending in various ways, including:\n \n\nwhether or not they make a purchase;\n\nhow frequently they upgrade or replace their devices;\n\ntheir choice of brand, model or price-point; and\n\ntheir appetite for complementary services (for example, My Best Buy Plus™ or My Best Buy Total™ membership).\n \nAny decrease in consumer demand due to macroeconomic conditions may negatively impact our financial results. \n \n‎\n \n\n\n8\n\n\n \nWe are subject to specific pressures that may increase our product prices, including high consumer demand, inflation, tariffs and supply chain disruptions. Additionally, price increases in the products we purchase for resale may require us to adjust our sales prices. Our ability to increase prices to offset these pressures might be limited, requiring us to absorb these increases within our margins. Increases in the cost of living may also put pressure on our ability to offer competitive compensation and other employer-provided benefits and may adversely affect our financial results. Any economic factors or circumstances resulting in higher transportation, labor, insurance costs, healthcare costs or commodity prices can increase our cost of sales and operating, selling, general and administrative expenses and otherwise materially adversely affect our financial results. \n \nGeopolitical pressures may adversely impact our supply chain, the cost of our products or revenues and financial results.\n \nGeopolitical tensions, both domestic and international, including issues related to trade routes, political instability and divisiveness, the potential implementation of more restrictive trade policies, higher tariffs or the renegotiation of existing trade agreements could have a material adverse impact on our business.\n \nWhile we directly import approximately 2% to 3% of our overall assortment, our complex supply chain is heavily reliant on vendor imports from China and Mexico, which we currently estimate make up approximately 55% and 20%, respectively, of the products we purchase. Moreover, the consumer electronics we sell and our underlying technological infrastructure are dependent on rare earth elements, predominantly processed in China. Recently passed or proposed tariffs involving these countries could have an adverse impact on our operations. Any further changes in, or uncertainty surrounding, trade policies with these countries, including tariffs on products and parts imported by us or our vendors, as well as any international retaliatory actions, could increase costs, disrupt our supply chain and/or impact the availability of underlying technology critical to our operations. Additionally, changes in, or uncertainty surrounding, policies or efforts that may affect the flow of trade, especially those impacting critical international trade routes, such as the Panama Canal and the Suez Canal, could potentially cause disruption to the global supply chain and may adversely affect our operations and financial results. \n \nOngoing or emerging conflicts, including those in Ukraine, the Middle East and the South China Sea, may continue to impact fuel prices, inflation, the global supply chain, cybersecurity and other macroeconomic conditions, which may further adversely affect global economic growth, consumer confidence and demand for our products and services. For example, attacks on cargo ships in the Red Sea, catalyzed by tensions in the Middle East, continue to disrupt global trade flows and shipping capacity. Additionally, any further deterioration of relations between Taiwan and China, the resulting actions taken, the response of the international community and other factors affecting trade with China or political or economic conditions in Taiwan could disrupt the manufacturing and distribution of products or hardware components in the region, such as semiconductors and television panels sourced from Taiwan or the broader array of products sourced from China. \n \nThese trade restrictions and any associated political uncertainty surrounding international trade measures and international relations may affect market stability and consumer confidence. One or more of these factors could have a material adverse effect on our supply chain, the cost of our products or our revenues and financial results.\n \nCatastrophic events, including the effects of climate change, could adversely affect our operating results.\n \nThe risk and actual occurrence of various catastrophic events could have a material adverse effect on our financial performance. Events that affect our properties, supply chain, partners, workforce or customers may consist of, or be caused by, for example:\n \n\nnatural disasters or extreme weather events (such as storms, blizzards, extreme temperatures, earthquakes, hurricanes, floods, fires and droughts), including those related to, or exacerbated by, climate change;\n\ndiseases or pandemics;\n\npower loss, telecommunications failures, or software and hardware malfunctions; and\n\nterrorism (including related cyber threats), civil unrest, violent acts or other conflicts.\n \nThe number and severity of certain catastrophic events is increasing in many of our markets. Such events can adversely affect our workforce and prevent employees and customers from reaching our stores and properties. Catastrophic events can also disrupt portions of our supply chain, distribution network and third-party services, and may impact our ability to procure goods or services required for operating our business. Such events can also affect our information technology systems, resulting in disruption to various aspects of our operations, including our ability to transact with customers and fulfill orders. The adverse effects of any such catastrophic event would be exacerbated if experienced at the same time as another unexpected and adverse event, such as a pandemic. \n \nThree of our largest states by total sales (California, Texas and Florida) are particularly vulnerable to natural disasters and extreme weather conditions. Natural disasters and climate-related events in these states, and other areas where our sales and operations are concentrated, could result in significant physical damage to, or closure of, our facilities and may require upgrades to our facilities and infrastructure. \n \nAdditionally, heightened violence and crime in or around our stores, customer homes or businesses where we are performing services may further jeopardize the safety and security of our workforce and customers as well as the general operation of our stores. Further, social unrest/tension, and any related potential for violence, may impact our workforce, customers, properties and the communities where we operate. If our customers, employees and shareholders do not perceive our response to be appropriate or adequate, we could suffer damage to our reputation and brand, which could adversely affect our business. \n \nAs a consequence of these catastrophic events, we may experience interruptions to our operations or losses of property, equipment and/or inventory, which could adversely affect our revenue and profitability. \n\n\n9\n\n\n \n \nMany of the products we sell are highly susceptible to technological advancement, product life-cycle fluctuations and changes in consumer preferences.\n \nWe operate in a highly and increasingly dynamic industry sector fueled by constant technological innovation and disruption, including most recently by the proliferation of artificial intelligence (“AI”) technologies. These factors manifest in a variety of ways: the emergence of new products and categories, the rapid maturation of categories, cannibalization of categories, changing price points, and product replacement and upgrade cycles.\n \nThis rapid pace of change can be hard to predict and manage. If we fail to interpret, predict and react to these changes in a timely and effective manner, the consequences may include, but are not limited to: \n \n\nfailure to offer, or inability to secure an adequate supply of, the products and services that our customers want; \n\nexcess inventory, which may require heavy discounting or liquidation; \n\ndelays in adapting our merchandising, marketing or supply chain capabilities to accommodate changes in product trends; and\n\ndamage to our brand and reputation. \n \nVendors may also fail to adequately invest in new technology, design, production or distribution facilities and may reduce their customer incentives, advertising and promotional activities or change their pricing policies. \n \nThese and other similar factors could have a material adverse impact on our revenue and profitability. \n \nStrategic Risks \n \nWe face strong competition from multi-channel retailers, e-commerce businesses, technology service providers, traditional store-based retailers, vendors and mobile network carriers, which directly affects our revenue and profitability.\n \nWhile we constantly strive to offer consumers the best value, the retail sector is highly competitive. Price is of great importance to most customers, and price transparency and comparability continues to increase. Digital technology enables consumers to compare prices on a real-time basis, putting additional pressure on us to maintain competitive prices. We compete against many local, regional, national and international retailers (both online and brick and mortar), as well as against some of our vendors and mobile network carriers that market their products directly to consumers. Competition is becoming increasingly diverse, including in the advertising revenue space and with the proliferation of marketplace platforms offering products at increasingly lower prices. Diverse competition may also arise from new entrants into the markets we serve, including unexpected players who could more aggressively leverage technologies such as AI and platform integrations. \n \nThe retail sector continues to experience increased sales initiated online and using mobile applications, as well as online sales for both in-store or curbside pick-up. Online and multi-channel retailers continue to focus on delivery services, with customers increasingly seeking faster, guaranteed delivery times and low-cost or free shipping. Our ability to offer competitive delivery times and delivery costs depends on many factors and our failure to successfully manage these factors and offer competitive delivery options could negatively impact the demand for our products and our profit margins. Because our business strategy is based on offering superior levels of customer service and a full range of services to complement the products we offer, our cost structure might be higher than some of our competitors, and this, in conjunction with price transparency, could put pressure on our margins. \n \nFurther, as our competitors develop and expand their strategic use of AI, our operations and profitability could be adversely impacted if we fail to execute or maintain our own focused AI strategy enabling technology advancement and innovation. As these and related competitive factors evolve, we may experience material adverse pressure on our revenue and profitability.\n \nIf we fail to attract, retain and engage qualified employees, our operations and profitability may be negatively impacted. In addition, changes in market compensation rates could adversely affect our profitability.\n \nOur performance is highly dependent on attracting, retaining and engaging appropriately qualified employees in our stores, service centers, distribution centers, field and corporate offices. Our strategy of offering high-quality services and assistance for our customers requires a highly trained and engaged workforce, which is reliant on the creation and maintenance of a positive culture that is attractive to all qualified employees and beneficial relationships between employees and the enterprise. The turnover rate in the retail sector is relatively high, and there is an ongoing need to recruit and train new employees. Factors that affect our ability to maintain sufficient numbers of qualified employees include, for example, employee engagement, our reputation, our ability to train and develop our employees, our ability to connect with and promote available talent pools, our development and maintenance of employer-desired policies and practices, unemployment rates, competition from other employers, availability of qualified personnel and our ability to offer appropriate compensation and benefit packages. Our policies and practices may be affected by, or require changes in response to, legal and regulatory restrictions on policies related to inclusion and belonging, employee engagement and climate change, which may further impact our ability to retain and engage qualified employees. Failure to recruit or retain qualified employees may impair our efficiency and effectiveness and our ability to pursue growth opportunities. In addition, significant turnover of our executive team or other employees in key positions with specific knowledge relating to our operations and industry may negatively impact our operations and financial results. \n \n‎\n \n\n\n10\n\n\n \nWe operate in a competitive labor market and there is a risk that market increases in compensation and employer-provided benefits could have a material adverse effect on our profitability. We may also be subject to continued market pressure to increase employee hourly wage rates and increased cost pressure on employer-provided benefits. Our need to implement corresponding adjustments within our labor model and compensation and benefit packages could have a material adverse impact on the profitability of our business. Additionally, increasingly prevalent legal and regulatory restrictions on the terms or enforceability of non-competition, employee non-solicitation, confidentiality and similar restrictive covenant clauses could make it more difficult to retain qualified personnel.\n \nThe execution of our strategy relating to certain products and services (including health technology, services and logistics) brings business, financial and regulatory risks.\n \nIn the health sector, we offer a range of products and services, including, for example, Personal Emergency Response (PERS) and Remote Patient Monitoring (RPM) technology and services. As we refine existing offerings and introduce new offerings, we must navigate a complex, dynamic regulatory and technological environment, which may subject us to additional operational, financial and reputational risks. Our customers may not like our new value propositions, and we may be subject to claims if customers of these offerings experience service disruptions, failures or other issues. \n \nOur health sector offerings and the customers we serve bring us into scope for many significant regulatory requirements, including those enforced by the U.S. Food and Drug Administration (FDA), the Centers for Medicaid and Medicaid Services (CMS), State Medicaid Agencies and the Federal Communications Commission (FCC). Additionally, the collection, storage, use and disclosure of personal information subjects us to privacy and security requirements, such as the Health Insurance Portability and Accountability Act (HIPAA), the United Kingdom’s General Data Protection Regulation (GDPR, as retained in United Kingdom law) and numerous state data privacy laws.\n \nThe risk accompanied with operating in the health sector may lead to a range of consequences, including, but not limited to, customer complaints, individual consumer claims or class actions, product recalls, temporary bans on products, stoppages at production facilities, orders to stop providing services, remediation costs, corrective action plans, fines, penalties, regulatory enforcement actions, potential loss of business and impairment of our ability to continue participation in government healthcare programs. These and other related issues could have a material adverse impact on our financial results and reputation.\n \nOur focus on services exposes us to certain risks that could have a material adverse impact on our revenue, profitability and reputation.\n \nWe offer a full range of services that complement our product offerings, including consultation, delivery, design, installation, memberships, protection plans, repair, set-up, technical support and health, safety and caregiving monitoring and support. The strategy and execution of our service offerings are subject to incremental risks. These risks could include, for example:\n \n\nsustained increase in consumer desire to purchase product offerings online and through mobile applications, impacting our ability to sell ancillary services;\n\ninability to sustain and operate a technology infrastructure sufficient to support our services growth;\n\nongoing pressure on margins from our Best Buy membership offerings, and the risk that increased volumes will not fully compensate for lower margins;\n\nincreased labor expenses and inability to accurately forecast staffing levels to meet customer needs and demands;\n\npressure on traditional labor models to meet the evolving landscape of offerings and customer needs;\n\nresponsibility for third parties that fail to meet our standards or fail to comply with applicable labor and independent contractor regulations;\n\nincreased reputational risk of bad actors posing as Geek Squad and/or customer care;\n\nincreased risk of errors or omissions in the fulfillment of services;\n\nunpredictable extended warranty failure rates and related expenses;\n\nemployees in transit using company vehicles to visit customer locations and employees being present in customer homes, which may increase our scope of liability;\n\nthe potential for increased scope of liability relating to services offerings provided by third parties on our behalf; \n\nemployees having access to customer devices, including the information held on those devices, which increases our risk given the responsibility for the security of those devices and the privacy of the data they hold while in our possession;\n\nthe risk that in-home services could be more adversely impacted by inclement weather, health and safety concerns and catastrophic events; and\n\nincreased risk of non-compliance with new laws and regulations applicable to these services.\n \n‎\n \n\n\n11\n\n\n \nOur reliance on key vendors and mobile network carriers subjects us to various risks and uncertainties which could affect our revenue and profitability.\n \nWe source the products we sell from a wide variety of domestic and international vendors. In fiscal 2025, our 20 largest suppliers accounted for approximately 80% of the merchandise we purchased, with five suppliers – Apple, Samsung, HP, Sony and LG - representing approximately 55% of total merchandise purchased. We generally do not have long-term written contracts with our vendors that would require them to continue supplying us with merchandise. Our profitability depends on securing acceptable terms with our vendors for, among other things, the price of merchandise we purchase from them, funding for various forms of promotional programs, payment terms, allocations of merchandise, development of compelling assortments of products, operation of vendor-focused shopping experiences within our stores and terms covering returns and factory warranties. While we believe we offer capabilities that these vendors value and depend upon to varying degrees, our vendors may be able to leverage their competitive advantages — for example, their own stores or online channels, their financial strength, the strength of their brands with customers or their relationships with other retailers — to our detriment. In addition, vendors may decide to limit or cease allowing us to offer certain categories, focus their marketing efforts on alternative channels or make unfavorable changes to our financial or other terms. Further, our flexibility to modify selling prices is limited due to digital technology that enables consumers to compare prices on a real-time basis.\n \nWe are also dependent on a small number of mobile carriers to allow us to offer mobile devices with carrier connections. The competitive strategies utilized by mobile network carriers can have a material impact on our business, especially with ongoing consolidation in the mobile industry. For example, if carriers change the structure of contracts, upgrade terms, qualification requirements, monthly fee plans, cancellation fees or service levels, the volume of upgrades and new contracts we sign with customers may be reduced, adversely affecting our revenue and profitability. In addition, our carriers may also serve customers through their own stores, websites, mobile applications and call centers or through other competing retail channels.\n \nDemand for the products and services we sell could decline if we fail to maintain positive brand perception and recognition.\n \nWe operate a portfolio of brands with a commitment to customer service and innovation. We believe that recognition and the reputation of our company and our brands are key to our success. Operational factors, such as failure to deliver high quality services, noncompetitive pricing, failure to meet delivery promises or business interruptions, could damage our reputation. External factors, such as negative public remarks or accusations, or our failure to meet enhanced, and sometimes conflicting, expectations on corporate response to sensitive topics, could also be damaging, including those related to inclusion and belonging, employee engagement and climate change. Third parties may commit fraud (including AI-driven fraud) while using our brand without our permission, possibly harming brand perception or reputation. The ubiquity of social media means that customer feedback and other information, which may include fictitious information, about our company are shared with a broad audience in a manner that is easily accessible and rapidly disseminated. Damage to the perception or reputation of our brands could result in, among other things, declines in revenues and customer loyalty, decreases in gift card and service plan sales, lower employee retention and productivity and vendor relationship issues, all of which could materially adversely affect our revenue and profitability.\n \nFailure to effectively manage and execute strategic ventures or partnerships could have a negative impact on our business.\n \nWe may pursue new strategic ventures, including business relationships, acquisitions, and expanding or adding revenue streams, including our retail media network, known as Best Buy Ads, and our marketplace platforms, where third-party sellers can sell their own products on Best Buy’s platform (“Marketplace”) (collectively “Strategic Ventures”). Assessing the viability of Strategic Ventures is typically subject to uncertainty, and the success of such Strategic Ventures can be adversely affected by many factors, including, for example:\n \n\nfailure to identify or appropriately evaluate the risks of Strategic Ventures in our diligence assessments;\n\nstate or local regulations that may limit our ability to execute certain aspects of our Strategic Ventures;\n\nfailure to integrate aspects of Strategic Ventures into our existing business, such as new product or service offerings or information technology systems;\n\nfailure to accurately predict customer demand, or generate forecasted revenue or profitability;\n\nfailure to maintain appropriate internal controls over financial reporting;\n\nuncertainty of accurately forecasting financial performance, including the impact of unforeseen changes in the business environment of Strategic Ventures, including, for example, the continuity of government funding for certain in-home care programs;\n\nfailure to generate expected synergies, such as cost reductions and other benefits; and\n\nadverse impacts on relationships with employees, vendors and other key partners of our existing business or Strategic Ventures.\n \nIf our new or emerging Strategic Ventures are unsuccessful, our liquidity and profitability could be materially adversely affected, and we may be required to recognize material impairments to goodwill and other assets acquired. For example, we recorded a pre-tax, non-cash goodwill impairment charge of $475 million related to our Best Buy Health reporting unit, as described further in the Notes to Consolidated Financial Statements \nincluded in Item 8, \nFinancial Statements and Supplementary Data\n and \nItem 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations,\n in fiscal 2025. Strategic Ventures may also divert our financial resources and management’s attention from other important areas of our business.\n \n‎\n \n\n\n12\n\n\n \nFailure to effectively manage our real estate portfolio and market segmentation strategy may negatively impact our operating results.\n \nEffective management of our real estate portfolio is critical to our omnichannel strategy. Failure to identify and secure suitable locations for our stores and other facilities, failure to negotiate appropriate terms related to our real estate portfolio, or failure to react appropriately should any unforeseen changes arise, could impair our ability to compete successfully and our profitability. Any of the following factors could impact our long-term real estate strategy:\n \n\nour ability to adjust store operating models to adapt to these changing patterns;\n\nthe location and appropriate number of stores, supply chain and other facilities in our portfolio;\n\nthe products and services we offer at each store;\n\nthe local competitive positioning, trade area demographics and economic factors for each of our stores; and\n\nthe primary term lease commitment and long-term lease option coverage for each store. \n \nOperational Risks\n \nInterruptions and other factors affecting our supply chain may adversely affect our business.\n \nOur supply chain assets are a critical part of our operations, particularly considering industry trends and initiatives, such as ship-from-store and the emphasis on fast delivery when purchasing online. We depend on our vendors’ abilities to deliver products to us at the right location, at the right time and in the right quantities. We also depend on third parties for the operation of certain aspects of our supply chain network. These risks are compounded for small parcel home deliveries, as we are dependent on a relatively small number of carriers with the scope and capacity required by our business. The continuing growth of online purchases for delivery increases our exposure to these risks. The factors that can adversely affect our operations or cause interruptions to our delivery capabilities include, but are not limited to:\n \n\noperational failures from growing demand on existing technological infrastructure; \n\nrisk to our employees, customers and inventory arising from burglaries or robberies in transit, at our stores or other facilities;\n\nfailure of third parties to meet our standards or commitments; and\n\nconsolidation or business failures in the transportation and distribution sectors.\n \nAdditionally, global supply chain impacts, similar to previous disruptions in the Red Sea and Panama Canal, could lead to increases in transportation costs or hinder third parties’ abilities to meet our demand for product volumes and timing, including: \n \n\nunionization, labor strikes, slow-downs, competitive job markets and labor shortages impacting ports or any other aspect of our supply chain;\n\ngeopolitical affairs, including tariffs; \n\nnatural disasters and climate events; and\n\ndiseases, pandemics, outbreaks and other health-related concerns.\n \nIt is important that we maintain optimal levels of inventory in each store and distribution center and respond rapidly to shifting demands. Any disruption to our supply chain network, including for any of the reasons above, could damage our revenue and profitability. If we fail to manage these risks effectively, we could experience a material adverse impact on our reputation, revenue and profitability.\n \nWe utilize third-party vendors for certain aspects of our operations, and any material disruption in our relationships or their services may have an adverse impact on our business.\n \nWe engage key third-party business partners to support various functions of our business, including delivery and installation, customer warranty, information technology, web hosting and cloud-based services, customer loyalty programs, promotional financing and customer loyalty credit cards, gift cards, technical support, transportation, insurance programs and human resource operations. Any material disruption in our relationships with key third-party business partners or any disruption in the services or systems provided or managed by third parties could impact our revenues and cost structure and hinder our operations, particularly if a disruption occurs during peak revenue periods.\n \nWe are subject to risks related to the products we sell, including those products sold on our Marketplace platforms and products under our exclusive brand labels (Best Buy Essentials, Dynex, Insignia, Modal, Platinum, Rocketfish, Yardbird and Lively brands) that could affect our operating results.\n \nIf the products we sell fail to meet, or are alleged to fail to meet, applicable safety standards or our customers’ expectations regarding safety and quality, we could be exposed to increased legal risk and damage to our reputation. Failure to take appropriate actions in relation to product-related issues (for example, product recalls) could lead to violations of laws and regulations and leave us susceptible to government enforcement actions or private litigation. Recalls of products, particularly when combined with lack of available alternatives or difficulty in sourcing sufficient volumes of replacement products, could also have a material adverse impact on our revenue and profitability.\n \n‎\n \n\n\n13\n\n\n \nOur ability to find qualified vendors who can supply products that meet our internal standards of quality and safety in a timely and efficient manner can be difficult, especially with respect to goods sourced from outside the U.S. Risks such as political or economic instability, cross-border trade restrictions or tariffs, merchandise quality issues, product safety concerns, work stoppages, human rights violations, port delays, foreign currency exchange rate fluctuations, transportation capacity and costs, inflation, civil unrest, natural disasters, outbreaks of pandemics and other factors relating to foreign trade are beyond our control. These and other related issues could have a material adverse impact on our financial results.\n \nWe have greater exposure to product-related risks in our exclusive brand category, including: \n \n\nexposure and responsibility to consumers for warranty replacements and repairs as well as product liability claims (including bodily injury or death), some of which may require us to take significant actions, such as product recalls;\n\ninventory obsolescence as we do not generally have return-to-vendor rights;\n\ndisruptions in manufacturing or logistics due to inconsistent and unanticipated order patterns;\n\nour inability to develop long-term relationships with key manufacturers;\n\nclaims by technology or other intellectual property owners if we inadvertently infringe upon their patents or other intellectual property rights or if we fail to pay royalties owed on our exclusive brand products; \n\ninability to obtain or adequately protect patents and other intellectual property rights on our exclusive brand products or manufacturing processes; and\n\nfailure to maintain consistent quality, availability and competitive pricing, which could have a material adverse impact on the demand for exclusive brand products and the profits we are able to generate from them.\n \nMost of our exclusive brand products are manufactured by contract manufacturers in China, Mexico and Southeast Asia. This arrangement exposes us to the following additional potential risks:\n \n\ninability to seek recourse from manufacturers may be limited in foreign jurisdictions;\n\ninability to conform in a timely manner to new rules or interpretations of developing and often-changing labor and environmental laws for the manufacturing of products in foreign countries; and\n\ninability to source alternatives quickly enough to avoid interruptions in product supply due to disruptions, such as trade disputes or excessive tariffs.\n \nOur expanding third-party Marketplace, including our existing Canadian platform and our soon-to-launch U.S. platform, could present additional risks. Should the products sold on our Marketplace fail to meet quality, safety or regulatory standards, it could erode customer trust and damage our reputation. Moreover, unsettled laws regarding retailer responsibility for product liability and intellectual property claims related to third-party products sold on marketplace platforms compound our marketplace risk.\n \nWe rely heavily on our information technology systems for key business processes. Any failure or interruption in these systems could have a material adverse impact on our business.\n \nThe effective and efficient operation of our business is dependent on our information technology systems and those of our information technology vendors. We rely heavily on these information technology systems to manage all key aspects of our business, including demand forecasting, purchasing, supply chain management, point-of-sale processing, services fulfillment (including, for example, our Urgent Response service provided by Best Buy Health), staff planning and deployment, financial management, reporting and forecasting and safeguarding critical and sensitive information.\n \nOur information technology systems and those of our partners are subject to damage or interruption from power outages, computer and telecommunications failures, computer viruses, worms, other malicious computer programs, denial-of-service attacks, security breaches (through cyber-attacks and other malicious actions, including ransomware and phishing attacks), catastrophic events (such as fires, tornadoes, earthquakes and hurricanes) and configuration or usage errors by our employees. While we have adopted, and continue to enhance, business continuity and disaster recovery plans and strategies, there is no guarantee that such plans and strategies will be effective, which could interrupt the functionality of our information technology systems or those of third parties. The failure or interruption of these information systems, data centers, cloud platforms or their backup systems could significantly disrupt our business and cause higher costs and lost revenues and could threaten our ability to remain in operation.\n \nAs we continue to expand our use of software as a service (SaaS) providers, we may face additional risks that may compromise our security or disrupt our business capabilities, including ensuring the proper configuration and dependencies on our service providers’ cybersecurity practices.\n \nFurther, as our online interactions and sales have increased and have become critical to our growth, and as many employees now use hybrid or full-time remote-working arrangements, the risk of any interruption of our information technology system capabilities is heightened, as well as the risk that customer demand exceeds the capacity of our online operations. Any such interruption or capacity constraint could result in a deterioration of our ability to process online sales, provide customer service or perform other necessary business functions.\n \n‎\n \n\n\n14\n\n\n \nWe face a heightened risk of cybersecurity attacks or data security incidents, which could have a material adverse impact on our business.\n \nWe utilize complex information technology platforms to operate our websites and mobile applications. If we fail to secure these systems against attacks, or fail to effectively configure, upgrade and maintain our hardware, software, network, and system infrastructure and improve the efficiency and resiliency of our systems, it could cause system interruptions and delays. Disruptions to these services, such as those caused by unforeseen traffic levels, malicious attacks by foreign governments, criminals or other non-state actors, other technical difficulties or events outside of our control, such as natural disasters, power or telecommunications failures or loss of critical data, could prevent us from accepting and fulfilling customer orders for products or services, which could have an adverse impact on our revenue, incur material costs and could adversely affect our reputation. If a cybersecurity event is related to data that is regulated, such as under HIPAA, GDPR or California Consumer Privacy Act, in addition to the direct business risks noted, we could be subject to additional regulatory investigations, penalties and fines.\n \nThe integration of AI into our operations increases cybersecurity and privacy risks (including unauthorized or misuse of AI tools) and could lead to potential unauthorized access, misuse, acquisition, release, disclosure, alteration or destruction of company and customer data or other confidential or proprietary information and challenge the stability of our platforms. Further, threat actors may leverage AI to engage in automated, targeted and coordinated attacks of our systems.\n \nFailure to prevent or effectively respond to a breach of the privacy or security of our customer, employee, vendor or company information could expose us to substantial costs and reputational damage, as well as litigation and enforcement actions.\n \nOur business involves the collection, use and storage of personal information, including payment card information and protected health information, as well as confidential information regarding our employees, customers, vendors and other company information. We also share personal and confidential information with suppliers and other third parties and we use third-party technology and systems that process and transmit information for a variety of activities. We have been the target of attempted cyber-attacks and other security threats, and we may be subject to breaches of our information technology systems. While we engage in significant data-protection efforts, criminal activity, such as cyberattacks, lapses in our controls, impersonation of individuals with proper access controls, or the intentional or negligent actions of employees, business associates or third parties, may undermine our privacy and security measures. As a result, unauthorized parties may obtain access to our data systems and misappropriate company, employee, third-party or customer information, or authorized parties may use or share personal information in an inappropriate manner or otherwise seek to extract financial gain based on access to, or possession of, company, employee, customer or vendor information. Furthermore, because the methods used to obtain unauthorized access change frequently and may not be immediately detected, and, given the potentially disruptive nature of emerging technologies (including AI), we may be unable to anticipate such attacks or promptly and effectively respond to them. Any compromise of our customer information or other confidential information could have a material adverse impact on our reputation and/or our relationships with our customers and partners, which may in turn, have a negative impact on our revenue and may expose us to material costs, penalties and claims.\n \nSensitive customer data may also be present on customer-owned devices entrusted to us for service and repair. Vulnerable code on products sold or serviced, including our exclusive brands, may also result in a compromise of customer privacy or security. If our efforts to protect against such compromises and ensure appropriate handling of customer data on devices we manufacture, sell and service are not effective, this may result in potential liability and damage to our customer relationships.\n \nIncreasing costs associated with information security and privacy, such as increased investment in technology and qualified staff, costs of compliance, costs resulting from fraud or criminal activity and costs of cyber and privacy insurance, could cause our business and results of operations to suffer materially. Additionally, newly applicable and potential new or significantly revised state, provincial and federal laws and regulations in the jurisdictions in which we do business are expanding our obligations to protect and honor the privacy and security of customer data, requiring additional resources and creating incremental risk arising from a potential breach or compliance failure. In addition, any compromise of our data security may materially increase the costs we incur to protect against such breaches and could subject us to additional legal risk.\n \nRegulatory, Compliance and Legal Risks\n \nWe are subject to statutory, regulatory and legal developments that could have a material adverse impact on our business.\n \nThe laws and regulations with which we must comply expose us to complex compliance and litigation risks that could have a material adverse effect on our operations. Some of the most significant compliance and litigation risks we face include, but are not limited to:\n \n\nthe difficulty of complying with sometimes conflicting statutes and regulations in local, national and international jurisdictions;\n\nthe potential for incremental costs related to compliance with new or existing environmental legislation or international agreements affecting energy transition, greenhouse gas emissions, electronics recycling and water or product materials;\n\nthe challenges of ensuring compliance with applicable product laws and regulations, including laws and regulations related to product safety, product transport and product disposal, as well as laws and regulations related to the products sold by us or by our third-party Marketplace sellers and the products we contract to manufacture;\n\nthe impact of evolving regulations governing data privacy and security, including limitations on the collection, use or sharing of information, consumer rights to access, delete or limit/opt-out of the use of information, and litigation arising from new private rights of action;\n‎\n \n\n\n15\n\n\n \n\nthe impact of other new or changing statutes and regulations related to, but not limited to, finance, healthcare, corporate governance matters, escheatment, pricing, anti-money laundering, content, distribution, copyright, mobile communications, AI deployment or usage, electronic device certification or payment services, or other future legislation that could affect how we operate and execute our strategies or alter our expense structure;\n\nthe challenges of ensuring compliance with applicable labor and employment laws, including: laws governing the organization of unions and related rules that affect the nature of labor relations, which are frequently modified by the National Labor Relations Board; laws that impact the relationship between the company and independent contractors and the classification of employees and independent contractors; laws regarding diversity, equity and inclusion, inclusion and belonging, discrimination and related issues; and laws that impact minimum wage, sick time, paid leave, non-compete covenants and scheduling requirements;\n\nthe impact of litigation, including class-action lawsuits involving consumers, shareholders and labor and employment matters;\n\nthe possibility of a federal ban on arbitration clauses in consumer or employee contracts, which could increase costs of dispute resolution;\n\nthe impact of potential changes in U.S., state or other countries’ tax laws and regulations or evolving interpretations of existing laws; and\n\nthe impact of changes in the federal government on laws, regulations and policies; and the potential for an increasing patchwork of state regulations.\n \nRegulatory activity affecting the retail sector has increased in recent years, raising the risk of fines and additional operating costs associated with compliance. Additionally, defending against lawsuits and other proceedings may involve significant expense and divert management’s attention and resources from other matters.\n \nOur business is subject to evolving corporate governance and public disclosure regulations and expectations, including with respect to cybersecurity and corporate responsibility and sustainability matters.\n \nWe are subject to changing rules and regulations promulgated by several governmental and self-regulatory organizations, including the SEC, the New York Stock Exchange, the Financial Accounting Standards Board and various states. These rules and regulations continue to evolve, demanding increased attention and vigilance for compliance. In addition, regulators, customers, investors, employees and other stakeholders are increasingly focusing on cybersecurity and CR&S matters and related disclosures. At the same time, regulators have increasingly expressed or pursued opposing views with respect to environmental, social and governance initiatives. These opposing views may also be adopted by our customers, investors, employees and other stakeholders. As a result of these changing rules, regulations and stakeholder expectations, there has been, and will likely continue to be, an increase in general and administrative expenses and an increase in management time and attention spent complying with or meeting such regulations and expectations. We may also communicate certain initiatives and goals regarding environmental matters, diversity, responsible sourcing, social investments and other related matters in our SEC filings or in other public disclosures. These initiatives and goals within the scope of CR&S could be difficult and expensive to implement, the technologies needed to implement them may not be cost-effective and may not advance at a sufficient pace and we could be criticized for the accuracy, adequacy or completeness of the disclosures. Further, statements about our initiatives and goals and progress toward those goals, may be based on measurement standards that are still developing, internal controls and processes that continue to evolve and assumptions that are subject to change in the future. In addition, we could be criticized or face legal action, including suits brought by shareholders, for the scope or nature of such initiatives or goals, or for any revisions to these goals. Any issues with our CR&S-related reporting, processes or goals, such as incomplete or inaccurate information, failure to achieve timely progress with respect to our goals, or misalignment with our stakeholders’ expectations, could negatively impact our reputation, business, financial performance or growth. \n \nOur international activities are subject to many of the same risks as described above, as well as to risks associated with the legislative, judicial, regulatory, political, economic and cultural factors specific to the countries or regions in which we operate.\n \nWe have, or expect to have during fiscal 2026, wholly-owned legal entities registered in various foreign countries, including Bermuda, Canada, China, Hong Kong, India, Luxembourg, the Republic of Mauritius, the United Kingdom and Vietnam. Additionally, most of our exclusive brand products are manufactured by contract manufacturers based in China, Mexico and Southeast Asia. During fiscal 2025, our International segment generated approximately 8% of our consolidated revenue. In general, the risk factors identified above also have relevance to our international operations. Our international operations expose us to additional risks, such as risks related to:\n \n\npolitical conditions and geopolitical events, including war and terrorism;\n\neconomic conditions, including monetary and fiscal policies and tax rules, as well as foreign exchange rate risk;\n\nrules governing international trade and potential changes to trade policies or trade agreements and ownership of foreign entities;\n\ngovernment-imposed travel restrictions or warnings and differing responses of governmental authorities to pandemics and other global events;\n\ncultural differences that we may be unable to anticipate or respond to appropriately;\n\ndifferent rules or practices regarding employee relations, including the existence of works councils or unions;\n\ndifficulties in enforcing intellectual property rights; and\n\ndifficulties encountered in exerting appropriate management oversight to operations in remote locations.\n \nThese factors could significantly disrupt our international operations and have a material adverse effect on our revenue and profitability and could lead us to incur material impairments and other exit costs.\n \n\n\n16\n\n\n \nFinancial and Market Risks\n \nFailure to meet any financial performance guidance or other forward-looking statements we may provide to the public could result in a decline in our stock price.\n \nWe may provide public guidance on our expected financial results or other forward-looking information for future periods. When we provide guidance, we believe that this guidance provides investors and analysts with a better understanding of management’s expectations for the future and is useful to our existing and potential shareholders, but such guidance is comprised of forward-looking statements subject to the risks and uncertainties described in this report and in our other public filings and public statements. Our actual results may not be in line with guidance we have provided. We may not be able to accurately forecast our growth rate and profitability. We base our expense levels and investment plans on sales estimates. A significant portion of our expenses and investments are fixed, and we may not be able to adjust our spending quickly enough if our sales are less than expected. Our revenue growth may not be predictable or sustainable, and our percentage growth rates may decrease. Our revenue and profitability depend on the continued growth of demand for the products and services offered by us, and our business is affected by general economic and business conditions worldwide. If our financial results for a particular period do not meet any guidance we provide or the expectations of market participants, or if we reduce any guidance for future periods, the market price of our common stock may decline.\n \nFailure to effectively manage our costs could have a material adverse effect on our profitability.\n \nAs discussed above, our revenues are susceptible to volatility from various sources, which can lead to periods of flat or declining revenues. However, some of our operating costs are fixed and/or are subject to multi-year contracts. Some elements of our costs may be higher than our competitors’ because of, for example, our extended retail footprint and structure, our hourly pay structure, our differentiated service offerings or our levels of customer service. Accordingly, our ongoing drive to reduce costs and increase efficiency represents a strategic imperative. Failure to successfully manage our costs could have a material adverse impact on our profitability and curtail our ability to fund our growth or other critical initiatives.\n \nWe are highly dependent on the cash flows and net earnings we generate during our fiscal fourth quarter, which includes the majority of the holiday shopping season.\n \nA large proportion of our revenue and earnings is generated in the fiscal fourth quarter, which includes the majority of the holiday shopping season. In addition, the holiday shopping season also incorporates many other unpredictable factors, such as the level of competitive promotional activity, new product release activity and customer buying patterns, which makes it difficult to forecast and react to these factors quickly. Unexpected events or developments, such as pandemics, natural or man-made disasters, changes in consumer demand, economic factors, product sourcing issues, cyber-attacks, failure or interruption of management information systems, or disruptions in services or systems provided or managed by third-party vendors could significantly disrupt our operations, especially during the fiscal fourth quarter. As a result of these factors, our fiscal fourth quarter and annual results could be adversely affected.\n \nEconomic, regulatory and other developments could adversely affect our ability to offer attractive promotional financing to our customers and adversely affect the profits we generate from these programs.\n \nIn partnership with third parties, we offer promotional financing as well as credit cards issued by third-party banks that manage and directly extend credit to our customers. Customers choosing promotional financing can receive extended payment terms and low- or no-interest financing on qualifying purchases. We believe our financing programs generate incremental revenue from customers who prefer the financing terms to other available forms of payment or otherwise need access to financing in order to make purchases. Approximately 25% of our fiscal 2025 Domestic segment revenue was transacted using one of the company’s branded cards. In addition, we earn profit-share income and share in any losses from some of our banking partners based on the performance of the programs. Profit-sharing revenue from our credit card arrangement approximated 1.1% of Domestic segment revenue in fiscal 2025. The income or loss we earn in this regard is subject to numerous factors, including the volume and value of transactions, the terms of promotional financing offers, bad debt rates, credit card delinquency rates, interest rates, the regulatory and competitive environment and expenses of operating the program. Adverse changes to any of these factors could impair our ability to offer these programs to customers and reduce customer purchases and our ability to earn income from sharing in the profits of the programs.\n \nConstraints in the capital markets or our vendor credit terms may have a material adverse impact on our liquidity.\n \nWe need sufficient sources of liquidity to fund our working capital requirements, service our outstanding indebtedness and finance business opportunities. Without sufficient liquidity, we could be forced to curtail our operations, or we may not be able to pursue business opportunities. The principal sources of our liquidity are funds generated from operating activities, available cash and cash equivalents, short-term investments, credit facilities, other debt arrangements and trade payables. Our liquidity could be materially adversely impacted if our vendors reduce payment terms and/or impose tighter credit limits. If our sources of liquidity do not satisfy our requirements, we may need to seek additional financing. We typically hold material balances of cash, cash equivalents and/or short-term investments and are therefore reliant on banks and other financial institutions to safeguard and allow ready access to these assets. Our future liquidity will depend on a variety of factors, such as economic and market conditions, the regulatory environment and financial stability of banks and other financial institutions, the availability of credit, our credit ratings and our reputation with potential lenders. These factors could have a material adverse effect on our costs of borrowing and our ability to pursue business opportunities and threaten our ability to meet our obligations as they become due.\n \n‎\n \n\n\n17\n\n\n \nChanges in our credit ratings may limit our access to capital and materially increase our borrowing costs.\n \nAny future downgrades to our credit ratings and outlook could negatively impact the perception of our credit risk and thus our access to capital markets, borrowing costs, vendor terms and lease terms. Our credit ratings are based upon information furnished by us or obtained by a rating agency from its own sources and are subject to revision, suspension or withdrawal by one or more rating agencies at any time. Rating agencies may change the ratings assigned to us due to developments that are beyond our control, including the introduction of new rating practices and methodologies.\n \n \nItem 1B. Unresolved Staff Comments.\n \nNot applicable.\n \nItem 1C. Cybersecurity.\n \nWe rely heavily on information technology systems to operate and manage all key aspects of our business. We also process substantial volumes of confidential business information and sensitive consumer and employee personal information, which if impacted by cyber threats, could result in financial and reputational harms and regulatory sanction. We have \ndeveloped\n and implemented, and update on an ongoing basis, a risk-based information security program designed to identify, assess and manage material risks from cybersecurity threats.\n \nCybersecurity Risk Management and Strategy\n \nOur information security program comprises administrative, technical and physical safeguards designed, under a risk-based approach, to reasonably mitigate cybersecurity risks to the confidentiality, integrity or availability of our information systems and information. These include safeguards designed to oversee service-provider relationships in a manner consistent with the risks presented by the engagement and use of the service provider.\n \nThe program deploys multiple layers of controls designed to identify, protect against, detect, respond to and recover from information security and cybersecurity incidents and our Cyber Security Incident Response Team, which is part of our Enterprise Information Protection (“EIP”) organization, plays a core role in detecting, mitigating and remediating cybersecurity incidents. Based on the nature and severity of the incident, our response is to be guided by documented incident response plans. These plans outline steps to be followed, functional areas to be engaged, internal escalations to be pursued (which may include, as appropriate, senior management, executive management and the Board) and stakeholders to be notified.\n \nThird parties\n also play a role in our cybersecurity. We engage third parties for advice and support in the design and implementation of certain program elements and leverage third-party tools to help identify and mitigate cybersecurity risks. Certain specific, defined components of our technology environment are assessed by \nthird-party auditors\n with a view to align with industry standards such as, for example, the Payment Card Industry Data Security Standards.\n \nWe also periodically retain outside expertise to conduct a maturity assessment of our program against industry standards and participants. Our program is informed by industry standards such as, for example, the National Institute of Standards and Technology’s Cybersecurity Framework (“NIST CSF”), but this does not imply that we meet all technical standards, specifications or requirements under the NIST CSF, NIST CSF 2.0 or other sources.\n \nWe have combatted cybersecurity threats in the normal course of business, but prior cybersecurity incidents have not materially affected, and do not appear likely to materially affect, our operations, business strategy, results of operations or financial condition. However, our Enterprise Risk Management program has recognized that we face ongoing risks from cybersecurity threats that, if not successfully prevented or mitigated, could materially \naffect\n us, including our operations, business strategy, results of operations or financial condition.\n For additional information on such risks, see"
}