{
  "ticker": "BMY",
  "cik": "0000014272",
  "company_name": "BRISTOL MYERS SQUIBB CO",
  "filing_date": "2025-02-12",
  "accession": "0000014272-25-000039",
  "primary_doc": "bmy-20241231.htm",
  "item1_text": "Item 1. Business—Pricing, Price Constraints and Market Access.”\nWe may experience difficulties or delays in the development and commercialization of new products. Our ability to replace revenue from products that lose patent protection is directly dependent on our ability to successfully develop and commercialize new products in a timely manner.\nAs is common in the pharmaceutical industry, BMS expects that sales of its branded products like Orencia, Eliquis and Opdivo will decline after the loss of market exclusivity for such products. Consequently, our future success is highly dependent on our pipeline of new products. There is a high rate of failure inherent in the research and development process for new drugs. As a result, there is a high risk that our investments in research programs will not generate financial returns. Compounds or products may appear promising in development but fail to reach market within the expected or optimal timeframe, or at all. We have experienced setbacks and may continue to do so.\nIn addition, product extensions or additional indications may not be approved. Furthermore, products or indications approved under the U.S. FDA’s Accelerated Approval Program may be contingent upon verification and description of clinical benefit in confirmatory studies and such studies may not be successful.\nDeveloping and commercializing new compounds and products involves inherent risks and uncertainties, including (i) efficacy and safety concerns or findings of superior safety or efficacy of competing products; (ii) delayed or denied regulatory approvals, including as a result of difficulties in enrolling patients and completing clinical trials in a timely manner; (iii) delays or challenges with producing products on a commercial scale or excessive costs to manufacture products; (iv) failure to enter into or implement optimal alliances for the development and/or commercialization of new products; (v) changes in regulatory approval processes and policies which may cause delays or denials of new product approvals; (vi) preclusion from commercialization due to intellectual property issues or disputes with third parties; (vii) failure in certain markets to obtain reimbursement commensurate with the level of innovation and clinical benefit presented by the product; and (viii) changing clinical preferences, changing industry standards, laws and regulations, or competitors’ innovations, each of which may render new products or enhancements to existing products obsolete. \nWe are also unable to predict if and when any changes to laws or regulatory policies will occur and how they will affect our business and particularly our pipeline of new products.\nCommercialization launch delays are especially common when a product is expected to have a REMS program, as required by the FDA to address significant risk/benefit issues. Certain of our future key products may be required to be distributed in the U.S. through \n25\na REMS program. The inability to bring a product to market or a significant delay in the expected regulatory approval and related launch date of a new product could negatively impact our revenues and earnings. In addition, if certain acquired pipeline programs are canceled or we believe their commercial prospects have been reduced, we may recognize material non-cash impairment charges for those programs. Finally, losing key molecules and intermediaries or our compound library through a natural or man-made disaster or act of sabotage could negatively impact the product development cycle.\nWe can provide no assurance when or whether any of our products under development will be approved or launched or whether any products, once launched, will be commercially successful. The public announcement of data from our clinical studies, or those of our competitors, or news of any developments related to our, or our competitors’, products or late-stage compounds may cause significant volatility in our stock price and depending on the data, may result in an adverse impact on our business, financial condition or results of operations. If the development of any of our key late-stage product candidates is delayed or discontinued or a clinical study does not meet one or more of its primary endpoints, our stock price could decline significantly and there may be an adverse impact on our business, financial condition or results of operations. \nWe must maintain a continuous flow of successful new products and successful new indications for existing products sufficient both to cover our substantial research and development costs and to replace sales that are lost as profitable products lose market exclusivity or are displaced by competing products or therapies. Failure to do so in the short-term or long-term can have a material adverse effect on our business, results of operations, cash flow, financial condition and prospects. We may also choose to no longer pursue certain programs from time to time as we periodically review our research and development programs and seek to prioritize our pipeline investments. This may result in further uncertainty as to when potential new products will be approved and commercialized. There can be no assurance that our key product candidates would prove to be safe and effective or as safe and effective as other competing products, or that, even if approved, any such products will become commercially successful for all approved indications.\nWe could lose market exclusivity of a product earlier than expected.\nIn the pharmaceutical and biotechnology industries, the majority of an innovative product’s commercial value is realized during its market exclusivity period. In the U.S. and in some other countries, when market exclusivity expires and generic versions are approved and marketed or when biosimilars are introduced (even if only for a competing product), there are usually very substantial and rapid declines in a product’s revenues.\nMarket exclusivity for our products is based upon patent rights and certain regulatory forms of exclusivity. The scope of our patent rights, if any, varies from country to country and may also be dependent on the availability of meaningful legal remedies in a country. The failure to obtain or maintain patent and other intellectual property rights, or limitations on the use or loss of such rights, could result in a rapid loss of sales for any affected products which could be material to us. In some countries, including certain EU member states, basic patent protections for our products may not exist because certain countries did not historically offer the right to obtain specific types of patents, and/or we (or our licensors) did not file in those countries. In addition, the patent environment can be unpredictable, and the validity and enforceability of patents cannot be predicted with certainty. For example, for Eliquis, generics have challenged the composition of matter patents and related SPCs in various jurisdictions, and trials have taken place, or are scheduled to take place, in certain European countries. While these legal proceedings are pending, generic manufacturers have begun marketing generic versions of Eliquis in certain EU countries and may seek to market generic versions of Eliquis in other EU countries prior to the expiration date of applicable patents and related SPCs. Furthermore, manufacturers of innovative drugs as well as generic drug manufacturers may be able to design their products around our owned or licensed patents and compete with us using the resulting alternative technology. Absent relevant patent protection for a product, once the data exclusivity period expires, generic or alternative versions can be approved and marketed. \nGeneric and biosimilar product manufacturers as well as other groups seeking financial gain are also increasingly seeking to challenge patents before they expire, and we have faced and may continue to face earlier-than-expected competition for any products at any time. Patents covering our key products have been, and are likely to continue to be, subject to validity, enforceability and infringement challenges in patent litigations and post-grant review patent office proceedings. Although we are confident in the strength of our intellectual property rights, it may be possible for generic drug companies to successfully challenge our rights and launch their generic versions of our drugs prior to the expiration of our intellectual property rights. For example, following certain adverse judicial decisions in the UK, Finland and Slovakia, generic manufacturers have begun marketing generic versions of Eliquis in these countries, and may seek to market generic versions of Eliquis in additional countries in Europe, prior to the expiration of our patents, which may lead to additional infringement and invalidity actions involving Eliquis patents being filed in various countries in Europe. In addition, in order to avoid the uncertainty and expense of litigation, among other reasons, we may decide to enter into settlements with generic manufacturers that permit generic market entry prior to the expiration of our intellectual property rights. For example, as a result of patent settlements, generic entry for Revlimid in the UK began on January 18, 2022, and in various other European countries on February 18, 2022. Similarly, in the U.S., following patent settlements, certain companies have begun marketing generic lenalidomide pursuant to volume-limited licenses. The licenses will no longer be volume-limited beginning on January 31, 2026.\n26\nIn some cases, manufacturers may seek regulatory approval by submitting their own clinical study data to obtain marketing approval or choose to launch a generic product “at risk” before the expiration of the applicable patent(s) and/or before the final resolution of related patent litigation. In addition, some countries are allowing manufacturers to manufacture and sell generic products, which negatively impacts the protections afforded the Company. Lower-priced generics or biosimilars for BMS biologic products or competing biologics could negatively impact our volumes and prices.\nIn addition, both the U.S. Congress and the FDA have taken steps to promote the development and approval of generic drugs and biosimilar biologics, including by providing generic and biosimilar developers a private right of action to obtain sufficient quantities of drug samples from the reference product’s manufacturer in order to conduct testing necessary to obtain approval for generic or biosimilar products.\nIn addition, in December 2023, the Biden administration released a proposed framework that for the first time proposed that a drug’s price can be a factor in determining that the drug is not accessible to the public and, therefore, that the government could exercise “march-in rights” and license it to a third party to manufacture. We cannot predict whether the Trump administration will finalize the draft framework or if the government will propose other drug pricing policy changes. If pursued and finalized, these policies could reduce prices and reimbursement for certain of our products and could significantly impact our business and consolidated results of operations\n.\nThere is no assurance that a particular product will enjoy market exclusivity for the full time period that appears in the estimates disclosed in this 2024 Form 10-K or that we assume when we provide our financial guidance.\nWe face intense competition from other biopharmaceutical companies and manufacturers and expect to see increasing market penetration of lower-priced generic products.\nThe future growth of BMS is dependent on the market access, uptake and expansion for marketed brands, new product introductions, new indications, product extensions and co-promotional activities with alliance partners. Competition is keen, and as we lose exclusivity for some of our marketed brands, lower-priced generic products will increasingly penetrate our markets. Generic or biosimilar challenges to our products can also arise at any time, and our patents may not prevent the emergence of generic or biosimilar competition for our products. In some countries, patent protection is significantly weaker than in the U.S. or in the EU; political and social pressure has also pushed legislation and other measures that promote the use of generic and biosimilar products. For additional information, see “—We could lose market exclusivity of a product earlier than expected.”\nIn addition, we face competition from new products entering the market. New products may have (i) lower prices, (ii) superior efficacy (benefit) or safety (risk) profiles (whether actual or perceived), (iii) technological advantages that may make such products more convenient to use, (iv) better insurance coverage or reimbursement levels, (v) more effective marketing programs and/or other differentiating factors that make it harder for our products to compete. We cannot predict with accuracy the timing or impact of the introduction of competitive products that treat diseases and conditions like those treated by our products and product candidates. Business combinations among our competitors and major third-party payers may also increase competition for our products. If we are unable to compete successfully against our competitors’ products in the marketplace, this could have a material negative impact on our revenues and earnings.\nWe could experience difficulties, delays and disruptions in our supply chain as well as in the manufacturing, distribution and sale of our products.\nOur product supply and related patient access has been, and could in the future be, negatively impacted by difficulties, delays and disruptions in the manufacturing, distribution and sale of our products. Some of the difficulties, delays and disruptions include: (i) product seizures or recalls or forced closings of manufacturing plants; (ii) our failure, or the failure of any of our vendors or suppliers, to comply with cGMP and other applicable regulations or quality assurance guidelines that could lead to manufacturing shutdowns, product shortages or delays in product manufacturing; (iii) manufacturing, quality assurance/quality control, supply problems or governmental approval delays; (iv) the failure of a supplier, including sole source or single source suppliers, to provide us with the necessary raw materials, supplies or finished goods within a reasonable timeframe and with required quality; (v) the failure of a third-party manufacturer to supply us with bulk active or finished product on time; (vi) construction or regulatory approval delays for new facilities or the expansion of existing facilities, including those intended to support future demand for our biologics products; (vii) the failure to meet new and emerging regulations requiring products to be tracked throughout the distribution channels using unique identifiers to verify their authenticity in the supply chain; (viii) other manufacturing or distribution issues, including limits to manufacturing capacity and changes in the types of products produced, such as biologics, physical limitations, labor disputes or shortages, or other business interruptions; (ix) geopolitical factors in a specific country or region, including any new, or changes in or interpretations of existing, trade regulations, including for example, any new tariffs imposed in the jurisdictions in which we operate, or compliance requirements of other legislation; and (x) disruptions in supply chain continuity, including from market forces, natural disasters, global disease outbreaks or pandemics (including COVID-19), acts of war or terrorism or other unforeseeable or unavoidable events that materially impact one or more of our facilities or a critical supplier. \n27\nIn addition, manufacturing processes for novel cell-based therapies, such as CAR-T cell therapies, are still evolving, and our processes may be more complicated or more expensive than the approaches taken by our current and future competitors. Our ability to source raw materials and supplies used to manufacture our CAR-T cell therapies and to develop consistent and reliable manufacturing processes and distribution networks with an attractive cost of goods could impact future anticipated revenue and gross profit for our CAR-T cell therapies. Furthermore, we may face challenges with sourcing raw materials and supplies for clinical and, if approved, commercial manufacturing. Logistical and shipment delays and other factors not in our control could prevent or delay the delivery of our product candidates and marketed products to patients. Additionally, we are required to maintain a complex chain of identity and custody with respect to patient material as such material enters into and moves through the manufacturing process. As a result, even slight deviations at any point in the production process for our CAR-T cell therapies or in material used in our CAR-T cell therapies could result in loss of product or regulatory remedial action, which could adversely affect our future anticipated revenues and/or profitability related to our CAR-T cell therapies.\nRegulatory, Intellectual Property, Litigation, Tax and Legal Compliance Risks\nLitigation claiming infringement of intellectual property may adversely affect our future revenues and operating earnings.\nWe and certain of our subsidiaries are, and in the future may be, involved in various legal proceedings, including patent litigation, such as claims that our patents are invalid, unenforceable and/or do not cover the product of the generic drug manufacturer or where third parties seek damages and/or injunctive relief to compensate for alleged infringement of their patents by our commercial or other activities. Resolving an intellectual property infringement or other claim can be costly and time consuming and may require us to enter into license agreements, which may not be available on commercially reasonable terms. A successful claim of patent or other intellectual property infringement could subject us to significant damages and/or an injunction preventing the manufacture, sale, or use of the affected product or products. Any of these events could have a material adverse effect on our profitability and financial condition.\nLegal matters could negatively affect our business.\nCurrent or future lawsuits, claims, proceedings and government investigations could preclude or delay the commercialization of our products or could adversely affect our operations, profitability, liquidity or financial condition, after any possible insurance recoveries where available. Such legal matters include (i) intellectual property disputes; (ii) adverse decisions in litigation, including product safety and liability, consumer protection and commercial cases; (iii) matters related to anti-corruption or anti-bribery regulations, such as the U.S. Foreign Corrupt Practices Act or the UK Bribery Act, including compliance with ongoing reporting obligations to the government resulting from any settlements; (iv) recalls or withdrawals of pharmaceutical products or forced closings of manufacturing plants; (v) the alleged failure to fulfill obligations under supply contracts with the government and other customers or under other agreements relating to our business; (vi) product pricing and promotional matters; (vii) lawsuits and claims asserting, or investigations into, violations of securities, antitrust, Federal and state pricing, consumer protection, data privacy and other laws and regulations; (viii) environmental, health, safety and sustainability matters, including regulatory actions in response to climate change; and (ix) tax liabilities resulting from assessments from tax authorities.\nWe are subject to a variety of U.S. and international laws and regulations.\nWe are currently subject to a number of government laws and regulations and, in the future, could become subject to new government laws and regulations. The costs of compliance with such laws and regulations, or the negative results of non-compliance, could adversely affect our business, our operating results and our financial condition. These laws and regulations control and regulate key aspects of our business, including, but not limited to: (i) market access, pricing controls and discounting; (ii) tax liabilities, returns and payments; (iii) imports and other trade restrictions; (iv) intellectual property protection and enforcement; (v) good practice guidelines and regulations; (vi) accounting standards; (vii) cybersecurity and data protection, storage and privacy, particularly in the EU and the U.S.; (viii) requirements for reporting payments and other value transfers to healthcare professionals (such as those provided under the Federal Anti-Kickback Statute); and (ix) compliance with anti-bribery and anti-corruption practices of the U.S. and other countries.\nIn addition, the U.S. healthcare industry is highly regulated and subject to frequent and substantial changes, including as a result of new judicial or governmental decisions. For example, Congress passed the Food and Drug Omnibus Reform Act in December 2022, which gave the FDA additional authority to require confirmatory trials to be underway at the time of approval and offered an additional enforcement mechanism if sponsors do not complete such studies with due diligence. Additionally, pharmacy benefit manager practices have come under increased scrutiny from U.S. policymakers at the federal and state level, who have proposed legislation intended to address concerns regarding the impact that these intermediaries have on drug pricing and patients’ out of pocket costs. If promulgated, such legislation could have resultant implications, costs or consequences for our business and how we\ninteract with these entities. We cannot predict how other future federal or state legislative or administrative changes relating to healthcare reform will affect our business. For additional information, refer to “Item 1. Business—Government Regulation,” “Item 1. Business—Pricing, Price Constraints and Market Access” and “—Legal matters could negatively affect our business.” Similarly, the legislative and regulatory environment regarding cybersecurity, data protection, storage and privacy is continuously evolving and the subject of significant attention by regulators and private parties globally. Regulators are imposing new cybersecurity and data \n28\nprotection, storage and privacy requirements, including new and greater monetary fines or penalties for privacy violations, and jurisdictions where we operate have passed, or continue to propose, data privacy legislation and or regulations. Failure to comply with these laws could result in significant penalties, including potential exclusion from federal healthcare programs, and reputational harm and could have a material adverse effect on our business and results of operations.\nExpectations relating to environmental, social and governance considerations and related reporting obligations expose the Company to potential liabilities, increased costs, reputational harm, and other adverse effects on the Company’s business.\nThere is an increased focus by foreign, federal, state, and local regulatory and legislative bodies investors and other stakeholders regarding environmental policies relating to climate change, regulating greenhouse gas emissions, carbon taxes, emissions trading schemes, sustainability, human rights, inclusion and diversity matters, and disclosure regarding the foregoing, many of which may be ambiguous, inconsistent, dynamic or conflicting. We expect to experience or be subject to increased restrictions, compliance and assurance costs, recurring investments in data gathering and reporting systems, and legal expenses related to such new or changing legal or regulatory requirements, which could increase our operating costs. In addition, we may still be subject to penalties or potential litigation if such laws and regulations are interpreted or applied in a manner inconsistent with our practices. \nMoreover, from time to time we establish and publicly announce environmental, social and governance aspirational goals and commitments. Implementation of our environmental, social and governance aspirational goals and initiatives involves risks and uncertainties, requires investments, and depends in part on third-party performance or data that is outside of our control. In addition, some stakeholders may disagree with the Company’s environmental, social and governance aspirational goals, targets or objectives. If we do not meet, are perceived not to meet, or if stakeholders disagree with, our environmental, social and governance aspirational goals, targets or objectives, we risk negative stakeholder reaction, including from proxy advisory services, as well as damage to our brand and reputation, reduced demand for our products, inability to attract and retain employee talent or other negative impacts on our business and operations. \nChanges to tax regulations could negatively impact our earnings. \nWe are subject to income taxes in the U.S. and various other countries globally. Changes in tax laws and regulations can and do occur. Significant judgment is required for determining the Company’s tax liabilities, and the Company’s tax returns are periodically examined by various tax authorities. We have faced, and may continue to face, audit challenges on how we apply a tax law or regulation. The ultimate resolution of any tax matter may result in payments greater or less than amounts accrued, which could have a negative impact on our provision for income taxes. In addition, our future earnings could be negatively impacted if our tax strategies are ineffective or by further changes in tax legislation, including changes in tax rates and tax base such as limiting, phasing-out or eliminating deductions or tax credits, increase taxing of certain excess income from intellectual property, revising tax law interpretations in domestic or foreign jurisdictions, changes in rules for earnings repatriations and changes in other tax laws in the U.S. or other countries. This includes Pillar Two legislation that has been enacted pursuant to the OECD/G20 Inclusive Framework in various jurisdictions in which we operate. These rules and associated legislative changes may significantly impact our tax provision and results of operations.\nThe failure of third parties to meet their contractual, regulatory and other obligations could adversely affect our business.\nWe rely on suppliers, vendors, outsourcing partners, alliance partners and other third parties to research, develop, manufacture, commercialize, co-promote and sell our products, manage certain marketing, human resource, finance, IT, data and other business unit and functional services and meet their contractual, regulatory and other obligations. Using these third parties poses a number of risks, such as: (i) they may not perform to our standards or legal requirements, for example, in relation to the outsourcing of significant clinical development activities for innovative medicines to some contract research organizations; (ii) they may not produce reliable results; (iii) they may not perform in a timely manner; (iv) they may not maintain confidentiality of our proprietary information; (v) they may experience a cyber attack or business disruption; (vi) they may be subject to government orders or mandates that require them to give priority to the government and set aside pre-existing commercial orders; (vii) disputes may arise with respect to ownership of rights to technology developed with our partners; and (viii) disagreements could cause delays in, or termination of, the research, development or commercialization of the product or result in litigation or arbitration. Moreover, some third parties are located in markets subject to political and social risks, corruption, infrastructure problems and natural disasters, in addition to country specific privacy and data security risks given current legal and regulatory environments. The failure of any critical third party to satisfactorily meet its obligations, including for future royalty and milestone payments; to adequately deploy business continuity plans in the event of a crisis; and/or to satisfactorily resolve significant disagreements with us or address other factors, could have a material adverse impact on our business and results of operations. In addition, if these third parties violate, or are alleged to have violated, any laws or regulations, including the local pharmaceutical code, anti-corruption or anti-bribery regulations, the EU’s General Data Protection Regulation, securities laws, or other laws and regulations, during the performance of their obligations for us, we could suffer financial and reputational harm or other negative outcomes, including possible legal consequences.\nProduct labeling changes for our marketed products could result in a negative impact on revenues and profit margins.\nPharmaceutical products receive regulatory approval based on data obtained in controlled clinical trials of limited duration. Additional clinical trials, head-to-head studies, real-world data analyses, adverse events reports following the use of our products \n29\nover longer periods of time and studies that identify biomarkers (objective characteristics that can indicate a particular response to a product or therapy) that are conducted after obtaining marketing approval for our products, and regulatory changes to standards regarding safety, efficacy or labeling, may result in product label changes or other measures that could reduce the product's market acceptance and result in declining revenues. Sometimes additional information from new studies identifies a portion of the patient population that may be non-responsive to a medicine or would be at higher risk of adverse reactions and labeling changes based on such studies may limit the patient population. The studies providing such additional information may be sponsored by us, but they could also be sponsored by competitors, insurance companies, government institutions, MCOs, scientists, investigators or other interested parties. While additional safety and efficacy information from such studies assist us and healthcare providers in identifying the best patient population for each product, it can also negatively impact our operating results. New information added to a product’s label can affect its risk-benefit profile, leading to potential voluntary or mandatory recalls, withdrawals or declining revenue, as well as legal claims, including product liability, consumer fraud or other claims. For example, in November 2023, the FDA announced that it was investigating the risk of T-cell malignancies in patients who received treatment with CAR-T cell therapy, noting that the overall benefits of CAR-T cell therapy products continue to outweigh their potential risks for their approved uses. In January 2024, the FDA determined that safety labeling changes were needed for approved CAR-T cell therapies, including a “boxed warning” about the possible risk of T-cell malignancies in patients treated with CAR-T cell therapy. Additionally, certain study results, especially from head-to-head studies, could affect a product’s formulary listing, which could also adversely affect revenues.\nIn addition, if safety or efficacy concerns are raised about a third party's product in the same class as one of our products, those concerns could implicate the entire class and this, in turn, could have an adverse impact on the availability or commercial viability of our product(s) as well as other products in the class.\nThe illegal distribution and sale by third parties of counterfeit or unregistered versions of our products or stolen products could have a negative impact on our revenues, earnings, reputation and business. \nThird parties may illegally distribute and sell counterfeit versions of our products, which do not meet our rigorous manufacturing and testing standards. A patient who receives a counterfeit drug or a product diverted from its authorized market may be at risk for a number of dangerous health consequences. Our reputation and business could suffer harm as a result of counterfeit drugs sold under our brand name or diverted products. The prevalence of counterfeit medicines is an industry-wide issue due to a variety of factors, including the adoption of e-commerce, greatly enhancing consumers’ ability to obtain prescriptions and other medical treatments via the internet in lieu of traditional brick and mortar pharmacies. The internet exposes patients to greater risk as it is a preferred vehicle for dangerous counterfeit offers and scams because of the anonymity it affords counterfeiters.\nThefts of inventory at warehouses, plants or while in-transit, which are then not properly stored and are later sold through unauthorized channels, could adversely impact patient safety, our reputation and our business. In addition, diversion of products from their authorized market into other channels may result in reduced revenues and negatively affect our profitability.\nUse of social media platforms can present risks and challenges.\nWe use social media to communicate Company news and events. The inappropriate and/or unauthorized use of social media could cause brand damage or information leakage and may give rise to liability, including from the improper collection and/or dissemination of personally identifiable information from employees, patients, healthcare professionals or other stakeholders. In addition, negative or inaccurate posts or comments about us on any social networking website could damage our reputation, brand image and goodwill and may cause significant volatility in our stock price. Further, the disclosure of non-public Company-sensitive information by our workforce or others, whether intentional or unintentional, through social media channels could lead to loss of trade secrets or other intellectual property, as well as the Company’s commercially sensitive information.\nInformation Technology and Cybersecurity Risks\nWe are dependent on information technology systems, including artificial intelligence programs, and face risk of cybersecurity incidents that could disrupt our business and result in theft of proprietary, confidential and personal information.\nWe rely extensively on information technology systems, networks and services, including internet sites, data hosting and processing facilities and tools, physical security systems and other hardware, software and technical applications and platforms, some of which are managed, hosted, provided by and/or used for third parties or their vendors, to assist in conducting our business. We have faced, and will continue to face, risks of incidents, whether through cyber attacks or cyber intrusions through the Cloud, the Internet, phishing attempts, ransomware and other forms of malware, computer viruses, email attachments, extortion, exfiltration and other scams. Although we make efforts to maintain the security and integrity of our information technology systems and data, these systems and the proprietary, confidential and personal information that resides on or is transmitted through them, are subject to the risk of a cybersecurity incident or disruption, and there can be no assurance that our security efforts and measures, and those of our third-party vendors, will prevent breakdowns or incidents to our or our third-party vendors’ systems, which could adversely affect our business strategy, results of operations, or financial condition. Cybersecurity risks continue to develop, including as a result of threat actors increasingly targeting employees and supply chains and geopolitical tensions leading to an increase in sabotage, espionage and cyber attacks\n.\n As the cyber-threat landscape evolves, these attacks are growing in frequency, sophistication and intensity, and due \n30\nto the nature of some of these attacks, there is also a risk that they may remain undetected for a period of time. A significant breakdown, invasion, corruption, destruction or interruption of critical information technology systems or leak or theft of proprietary, confidential or personal information could negatively impact operations. There can be no assurance that our continuing efforts will prevent breakdowns or incidents to our or our third-party providers’ systems or databases that could adversely affect our business. Under certain circumstances, such incidents when detected could require disclosure to government authorities and/or regulators and could require notification to impacted individuals, and any such incident could result in material financial, legal, business and reputational harm to us. Further, although we maintain insurance coverage designed to transfer certain cybersecurity incident costs, there is a risk this insurance would be insufficient to cover the costs of the incident, including due to coverage limits or insurance exclusions.\nIn addition, we face certain risks as we seek to leverage artificial intelligence programs and machine learning (“AI”) to optimize productivity and efficiency in various aspects of the organization. For example, flawed algorithms and/or biased, incomplete or inaccurate data used in AI programs may result in deficient AI-generated content. The regulatory landscape related to AI remains uncertain, and we may be required to devote significant resources to comply with developing laws and address ethical concerns. Our competitors may also develop or adopt more effective AI technologies, resulting in more efficient operations and putting us at a competitive disadvantage. These risks may result in an adverse impact on our business, financial condition or results of operations.\nStrategic, Business Development and Employee Attraction and Retention Risks\nWe depend on several key products for most of our revenues, cash flows and earnings.\nWe derive a majority of our revenue and earnings from several key products. We expect that Eliquis, Opdivo, Orencia and Yervoy will represent a significant percentage of our revenue, earnings and cash flows during the next few years. A reduction in revenue from any of these products due to loss of market exclusivity or other factors could adversely impact our earnings and cash flows. For additional information, see “—We could lose market exclusivity of a product earlier than expected.”\nAlso, if one of our major products were to become subject to issues, such as loss of patent protection, significant changes in demand, formulary access changes, material product liability, unexpected side effects, regulatory proceedings, negative publicity, supply disruption from our manufacturing operations or third-party supplier or a significant advancement of competing products, we may incur an adverse impact on our business, financial condition, results of operations or the trading price of our stock.\nIn addition, in the U.S., most of our products are distributed through wholesalers, and if one of these wholesalers should encounter financial or other difficulties, we might be unable to timely collect the amounts that the wholesaler owes us, which could negatively impact our results of operations. We expect that consolidation and integration of pharmacy chains, wholesalers and pharmacy benefit managers will increase competitive and pricing pressures on pharmaceutical manufacturers, including us.\nThird-party royalties represent a significant percentage of our pretax income and operating cash flow.\nWe have entered into several arrangements which entitle us to potential royalties from third parties for out-licensed intellectual property, commercialization rights and sales-based contingent proceeds related to the divestiture of businesses. In many of these arrangements we have minimal, if any, continuing involvement that contributes to the financial success of those activities. Royalties have continued to represent a significant percentage of our pretax income, including royalties related to the divestiture of our diabetes business (including the transfer of certain future royalty rights pertaining to Amylin, Onglyza* and Farxiga* product sales), out-licensed intellectual property and the Merck patent infringement settlement. Pretax income generated from royalties was approximately $2.4 billion in 2024. Our pretax income could be adversely affected as the royalty streams decline in future periods. For example, royalties related to Keytruda* decreased from 6.5% to 2.5% on January 1, 2024 and are expected to terminate on December 31, 2026, and royalties related to Tecentriq* are expected to terminate on December 31, 2026. In addition, our royalties from our divested diabetes business, specifically Amylin, Farxiga and Onglyza, terminate on December 31, 2025.\nFailure to execute our business strategy or to identify and effectively manage acquisitions, divestitures, alliances, joint ventures and other portfolio actions could adversely impact our growth and profitability and our future results. In addition, any businesses or assets that we acquire in the future may underperform, we may not be able to successfully integrate them into our existing business and the occurrence of a number of unexpected factors could prevent or substantially delay the consummation of an anticipated acquisition, divestiture or merger.\nOur strategy is focused on delivering innovative, transformational medicines to patients in a focused set of disease areas. To support future revenue growth and maintain an adequate pipeline, we have acquired, or in-licensed, a number of assets, and we expect to continue to support our pipeline with compounds or products obtained through licensing and acquisitions. Competition among pharmaceutical companies for acquisition and product licensing opportunities is intense, and we may not be able to locate suitable acquisition targets or licensing partners at reasonable prices, or successfully execute such transactions. If we are unable to consistently maintain an adequate pipeline, whether through internal R&D programs or transactions with third parties or if we are unable to support and grow our marketed products, successfully execute the launches of newly approved products, advance our late-\n31\nstage pipeline, manage change from our operating model evolution or manage our costs effectively, our operating results and financial condition could be negatively impacted.\nAdditionally, future revenues, profits and cash flows of an acquired company’s products, technologies and pipeline candidates may not materialize due to low product uptake, delayed or missed pipeline opportunities, the inability to capture expected synergies resulting from cost savings and avoidance, increased competition, safety concerns, regulatory issues, supply chain problems or other factors beyond our control. Substantial difficulties, costs and delays could result from integrating our acquisitions, including for: (i) R&D, manufacturing, distribution, sales, marketing, promotion and information technology activities; (ii) policies, procedures, processes, controls and compliance; and (iii) tax considerations.\nWhere we acquire debt or equity securities as all or part of the consideration for business development activities, such as in connection with a joint venture or acquisition, the value of those securities will fluctuate and may depreciate in value. We may not control the company in which we acquire securities, such as in connection with a collaborative arrangement, and as a result, we will have limited ability to determine its management, operational decisions, internal controls and compliance and other policies, which can result in additional financial and reputational risks.\nWe may not be successful in separating underperforming or non-strategic assets, and gains or losses on the divestiture of, or lost operating income from, such assets may affect our earnings. Our divestitures also may result in continued financial exposure to the divested businesses, such as through guarantees or other financial arrangements, continued supply and services arrangements, or potential litigation, following the transaction. Under these arrangements, nonperformance by us could result in obligations being imposed on us that could have a material adverse effect on our competitive position, cash flows, results of operations, financial condition or reputation.\nWe might also incur asset impairment charges related to acquisitions or divestitures that reduce our earnings. \nThe value allocated to certain of our assets could be substantially impaired due to a number of factors beyond our control. New or revised accounting standards, rules and interpretations could result in changes to the recognition of income and expense that may materially and adversely affect our financial results.\nIf the execution or implementation of acquisitions, divestitures, alliances, joint ventures and other portfolio actions is not successful, it could adversely impact our financial condition, cash flows and results of operations. Moreover, due to the substantial amount of debt that we incurred to finance the cash portion of the Celgene, MyoKardia, Mirati, Karuna and RayzeBio acquisitions, there can be no assurance of when we will be able to expand our business development capacity. Although we are committed to reducing our debt, pursuing strategic transaction opportunities in the future may require us to obtain additional equity or debt financing, and could result in increased leverage and/or a downgrade of our credit ratings.\nFailure to attract and retain a highly qualified workforce could affect our ability to successfully develop and commercialize products.\nOur success is largely dependent on our continued ability to (i) attract and retain highly qualified scientific, technical and management workforce, including people with expertise in clinical R&D, governmental regulation and commercialization, and (ii) in connection with our acquisitions, integrate corporate cultures and maintain employee morale. We are facing increasing competition for a limited pool of qualified individuals from numerous pharmaceutical and biotechnology companies, universities, government entities, research institutions, companies seeking to enter the healthcare space, and companies in other industries. Additionally, we periodically adjust our personnel needs in response to changing macroeconomic conditions, market opportunities, management changes, acquisitions, cost levels and other internal and external considerations, which may adversely impact our workplace culture and ability to retain and incentivize employees. We cannot be sure that we will be able to attract and retain quality talent or that the costs of doing so will not materially increase.\nMarket, Liquidity and Credit Risks\nWe have significant indebtedness that could have negative consequences\n.\nOur acquisitions of Celgene, MyoKardia, Mirati, Karuna and RayzeBio increased the amount of our debt resulting in additional interest expense, and we may incur more debt to finance future acquisitions. This could reduce our financial flexibility to continue capital investments, develop new products and declare future dividends. For example, following the December 2023 announcements of previous acquisitions, Standard & Poor’s downgraded BMS’s long term-credit rating from A+ to A (with a stable long-term credit outlook).\n \nAdverse changes in U.S. and global economic and political conditions could adversely affect our operations and profitability.\nGlobal economic and political risks pose significant challenges to a company’s growth and profitability and are difficult to mitigate. We generated approximately 29% of our revenues outside of the U.S. in 2024. As such, a global economic downturn could create or amplify a variety of risks to our business and could negatively affect our growth. In addition, uncertainty in the credit and capital \n32\nmarkets could impact our growth strategy. Our revenues, earnings and cash flow are also exposed to risk from a strengthening U.S. dollar and global inflation, including in the U.S. If our operating costs were to significantly increase, whether as a result of rising inflation rates, wage increases or other factors, it could adversely affect our revenues and profitability. We also have exposure to customer credit risks in Europe, South America and other markets including from government-guaranteed hospital receivables in markets where payments are not received on time. We have significant operations in Europe, including for manufacturing and distribution. The results of our operations could be negatively impacted by any member country exiting the eurozone monetary union or EU.\nAdditionally, our business and operations may be adversely affected by political volatility, conflicts or crises in individual countries or regions, including terrorist activities or war and pandemics or epidemics. The COVID-19 pandemic affected demand for some of our products driven by lower patient starts and visits, and we would expect any future pandemics to have a similar effect. In addition, while we did not experience any significant manufacturing or supply issues due to COVID-19, it is possible that we could experience these issues in response to future pandemics. For instance, we may experience scarcity of certain raw materials and components as a result of the influx of pandemic related vaccine orders receiving priority treatment from vendors. Furthermore, a future epidemic or pandemic could create material staffing shortages at our manufacturing sites which could disrupt the supply of our products. It is also possible that we may experience supply chain interruptions as a result of quarantines, shelter-in-place and other governmental orders and policies, travel restrictions, airline and cargo capacity and route reductions. We may also experience delays in the initiation and enrollment of patients in our clinical trials as a consequence of any future pandemic. We may not be able to fully mitigate these delays, which could negatively impact the timing of our pipeline development programs and expected future revenues and/or cash flows. A prolonged clinical trial delay could potentially have a significant negative effect on our business, particularly if new competitive products enter the market or clinical trial results for our competitors’ products affect the value proposition for our product. Any such delays or difficulties in clinical development could also potentially lead to a material impairment of our intangible assets, including the $23.3 billion of other intangible assets as of December 31, 2024.\nWe cannot predict or reasonably estimate the impact of any potential long-term changes to the healthcare industry from global economic and political events, including any future pandemics. It is possible that changes in the healthcare system could impose additional burdens on clinical trials, which could increase the costs of sponsoring clinical trials or lead to additional delays or difficulties with completing clinical trials. We may also experience additional pricing pressures, shifts in the U.S. payer channel mix and/or increased governmental regulation. \nGlobal economic conditions or events such as wars or pandemics also create additional risks from their impact on our suppliers, vendors, outsourcing partners, alliance partners and other third parties that we rely on to research, develop, manufacture, commercialize, co-promote and sell our products, manage certain marketing, selling, human resource, finance, IT and other business unit and functional services. For example, if any of our third-party providers suffer from limited solvency because of global economic conditions, it could negatively impact our operating model and our business. Similarly, global events such as the Ukraine-Russia conflict, tensions between the U.S. and China and other geopolitical events and conflicts can increase the volatility of the financial markets, foreign currency exchanges and interest rates. We could also face other potential negative consequences stemming from future pandemics or global events, including but not limited to increased cyber threats to us and our partners such as cyber attacks and outages, and challenges related to the safety of our employees and safe occupancy. It is possible that global economic and political events, including changes to the geopolitical relationship between the U.S. and China, other geopolitical events and conflicts, and any future pandemic, could exacerbate any of the other risks described in this 2024 Form 10-K as well.\nThere can be no guarantee that we will pay dividends or repurchase stock.\nThe declaration, amount and timing of any dividends fall within the discretion of our Board. The Board’s decision will depend on many factors, including our financial condition, earnings, capital requirements, debt service obligations, industry practice, legal requirements, regulatory constraints and other factors that our Board may deem relevant. A reduction or elimination of our dividend payments or dividend program could adversely affect our stock price. In addition, we could, at any time, decide not to buy back any more shares in the market, or reduce the number of shares repurchased under our share repurchase program, which could also adversely affect our stock price. The IRA imposes a non-deductible 1% excise tax on our net repurchases of shares after December 31, 2022. The imposition of the excise tax on repurchases of our shares may increase the cost to us of making repurchases and may cause our Board to reduce the number of shares repurchased pursuant to our share repurchase program.\nOur amended bylaws designate the Court of Chancery of the State of Delaware as the sole and exclusive forum for certain lawsuits between us and our stockholders, which could limit our stockholders’ ability to obtain a judicial forum that it finds favorable for such lawsuits and make it more costly for our stockholders to bring such lawsuits, which may have the effect of discouraging such lawsuits.\nOur amended bylaws provide that, unless we consent in writing to the selection of an alternative forum, the Court of Chancery of the State of Delaware will be, to the fullest extent permitted by law, the sole and exclusive forum for any (i) derivative action or proceeding brought on our behalf, (ii) action asserting a claim of breach of a fiduciary duty owed by any of our directors, officers or other employees to us or our stockholders, creditors or other constituents, (iii) action asserting a claim arising pursuant to any \n33\nprovision of the General Corporation Law of the State of Delaware, our amended and restated certificate of incorporation or our amended bylaws or (iv) action asserting a claim against us or any of our directors, officers or other employees governed by the internal affairs doctrine; provided, however, that, in the event that the Court of Chancery of the State of Delaware lacks jurisdiction over any such action or proceeding, the sole and exclusive forum for such action or proceeding will be another state or federal court of the State of Delaware. Our bylaws also provide that any person or entity purchasing or otherwise acquiring or holding any interest in shares of our capital stock will be deemed to have notice of and consented to this forum selection provision.\nThe Court of Chancery of the State of Delaware (or if the Court of Chancery does not have jurisdiction, another state or federal court of the State of Delaware) will have the fullest authority allowed by law to issue an anti-suit injunction to enforce this forum selection clause and to preclude suit in any other forum. However, this forum selection provision is not intended to apply to any actions brought under the Securities Act of 1933 (the \"Securities Act\"), as amended, or the Exchange Act. Section 27 of the Exchange Act creates exclusive federal jurisdiction over all suits brought to enforce any duty or liability created by the Exchange Act or the rules and regulations thereunder and Section 22 of the Securities Act creates concurrent jurisdiction for federal and state courts over all suits brought to enforce any duty or liability created by the Securities Act or the rules and regulations thereunder. Accordingly, the forum selection provision in our amended bylaws will not relieve us of our duties to comply with the federal securities laws and the rules and regulations thereunder, and our stockholders will not be deemed to have waived our compliance with these laws, rules and regulations.\nNevertheless, this forum selection provision in our bylaws may limit a stockholder’s ability to bring a claim in a judicial forum that it finds favorable for disputes with us or any of our directors, officers and other employees, which may discourage lawsuits with respect to such claims, although our stockholders will not be deemed to have waived our compliance with federal securities laws and the rules and regulations thereunder. In addition, stockholders who do bring a claim in the Court of Chancery in the State of Delaware could face additional litigation costs in pursuing any such claim, particularly if they do not reside in or near Delaware. While we believe the risk of a court declining to enforce the forum selection provision contained in our amended bylaws is low, if a court were to find the provision inapplicable to, or unenforceable in respect of, one or more of the specified types of actions or proceedings, we may incur additional costs associated with resolving such action in other jurisdictions, which could harm our business, operating results and financial condition.\n34\nItem 1B.\nUNRESOLVED STAFF COMMENTS.\nNone.\nItem 1C.\nCYBERSECURITY\nRisk Management and Strategy\nThe Company manages cybersecurity risk as part of our overall enterprise risk management strategy, which is overseen by the Audit Committee and the Board.\n The Company employs robust cybersecurity and data privacy programs that are designed to assess, identify and manage material risks from cybersecurity threats. These programs are independently assessed every three years against the U.S. National Institute of Standards and Technology Cybersecurity Framework (\"NIST\").\nWe are constantly evolving our cyber defenses to minimize impacts from cyber threats by using a multi-pronged approach that helps safeguard our assets and data. We are particularly focused on addressing emerging cybersecurity risks, including human risk, as phishing attacks remain one of the most common causes of data breaches; third-party supply chain risks, as threat actors continue to target supply chains to compromise a greater number of victims; and geopolitical risk, as tensions and conflicts around the world are often accompanied by an increase in sabotage, espionage and cyber attacks. As threat actors frequently target employees to gain access to information and systems, we have a comprehensive global human risk management program that educates our workforce on threats they face as a first line of defense, and includes elements addressing phishing, malware, data handling, device security, cybersecurity education, password security, internet browsing and defenses to physical threats. Our employees are exposed to data-driven cybersecurity awareness campaigns and annual training in order to keep pace with industry standards, evolving challenges and innovative solutions with respect to information security, data privacy, and cybersecurity risks to the organization. In many regions, our employees receive a monthly snapshot of their cyber behaviors and are given a rating for their cyber vigilance. Additionally, we employ a multi-layered approach in our application of cybersecurity technologies to help safeguard our systems, networks, and data from potential cybersecurity threats. For companies that we acquire, our integration plans include, where appropriate, workable timelines for alignment on information security, data privacy, cybersecurity and employee education.\nTo support our preparedness, we have a cybersecurity incident response plan (“CIRP”) that we regularly update as business needs and the security landscapes change. In the event of a cybersecurity incident, our incident response team refers to our CIRP and existing management internal controls and disclosure processes. Pursuant to this process, designated personnel are responsible for assessing the severity of the incident and any associated threats, containing and resolving the incident as quickly as possible, managing any damage to the Company’s systems and networks, minimizing the impact on the Company’s stakeholders, analyzing and executing upon internal reporting obligations, escalating information about the incident to senior management, as appropriate, and performing post-incident analysis and program enhancements, as needed. We perform multiple tabletop exercises across various levels of the Company each year to test our incident response procedures, enhance our resiliency by seeking to ensure business continuity during potential extended digital outages, identify improvement opportunities and increase employee awareness and preparedness. These tabletop exercises focus on various aspects of cybersecurity events, including patient and employee impact, operational resilience and effectiveness and communication coordination.\nWe engage with third parties to separately conduct cyber assessments on a recurring basis and assist with containment and remediation efforts.\n In addition, third-party technology and analytics are utilized to identify potential vulnerabilities. We recognize that third parties that provide services to the Company can be subject to cybersecurity incidents that could impact the Company. To manage third-party risk, we \nmaintain a third-party risk management program\n, which is designed to assess the security controls of our third parties. The assessment methodology is based on risk and relies on the data, access, connectivity, and criticality of the services that the third-party offers.\n As noted, we also conduct tabletop exercises to identify improvement opportunities in our supply chain resilience.\nWe maintain relationships with law enforcement, government agencies, forensic investigators, and legal counsel to inform our cybersecurity and data privacy programs.\n35\nWhile we and our third-party vendors are regularly subject to cybersecurity attacks and incidents, a\ns of December 31, 2024 and through the date of this filing, we are not aware of any material cybersecurity incidents that have impacted the Company in the last three years.\n However, we have been the target of cyber attacks and expect them to continue as cybersecurity threats have been rapidly evolving in sophistication and becoming more prevalent in the industry. We face risks of incidents, whether through cyber attacks or cyber intrusions through the Cloud, the Internet, phishing attempts, ransomware and other forms of malware, computer viruses, email attachments, extortion, and other scams. Although we make efforts to maintain the security and integrity of our information technology systems, these systems and the proprietary, confidential and personal information that resides on or is transmitted through them, are subject to the risk of a cybersecurity incident or disruption, and there can be no assurance that our security efforts and measures, and those of our third-party vendors, will prevent breakdowns or incidents to our or our third-party vendors’ systems that could adversely affect our business. For a discussion of these risks, see “"
}