{
  "ticker": "BSX",
  "cik": "0000885725",
  "company_name": "BOSTON SCIENTIFIC CORP",
  "filing_date": "2025-02-18",
  "accession": "0000885725-25-000011",
  "primary_doc": "bsx-20241231.htm",
  "item1_text": "Item 1. Business of this Annual Report on Form 10-K. The considerations and risks that follow are organized within relevant headings but may be relevant to other headings as well. Additional risks not presently known to us or that we currently deem immaterial may also adversely affect our business, financial condition, cash flows or results of operations.\nEconomic, Industry and Geopolitical Risks\nWe face intense competition and may not be able to keep pace with the rapid technological changes in the medical devices industry, which could have an adverse effect on our business, financial condition or results of operations.\nThe medical device markets in which we participate are highly competitive. We encounter significant competition across our product lines and in each market in which our products are sold from various medical device companies. Some of our competitors may have greater financial and marketing resources than we do, including as a result of consolidation among companies in our industry. Our primary competitors include large manufacturers with multiple lines of business and competing products, as well as a wide range of medical device companies that sell a single or limited number of competitive products or which participate in only a specific market segment or segments. We also face competition from non-medical device companies, including pharmaceutical companies, biotech companies and providers of various diagnostic tests, which may offer alternative therapies or diagnostics for disease states also amenable to treatment or diagnosis using our products. New competitors may emerge in the future, potentially including companies introducing new sales or distribution models to our industry or leveraging genomic robotic, navigation, and/or other automation technologies. Digital technologies, including artificial intelligence (AI) and machine learning capabilities, have and may continue to increase in their applicability and importance to various aspects of our business, operating and competitive environments, research and development (R&D) pipeline and product portfolio. We believe we will need to develop new and enhanced digital capabilities and competences in order to remain competitive.\nIn addition, the medical device markets in which we participate are characterized by extensive research and development and rapid technological change. Developments by other companies of products and/or services, processes or technologies may make our products or proposed products obsolete or less competitive and may negatively impact our net sales. It is necessary for us to devote continued efforts and financial resources to the development or acquisition of scientifically advanced technologies and products. In addition, we will need to apply our technologies cost-effectively across product lines and markets, obtain patent and other protection for our technologies and products, obtain required regulatory and reimbursement approvals and successfully manufacture and market our products consistent with our quality standards. If we fail to develop or acquire new products or enhance existing products, such failure could have a material adverse effect on our business, financial condition or results of operations. In addition, a delay in the timing of the launch of next-generation products and the overall performance of, and continued physician confidence in, those products may result in declines in our market share and have an adverse impact on our business, financial condition or results of operations.\nWe may experience declines in market size, average selling prices for our products, medical procedure volumes and our share of the markets in which we compete, which may materially adversely affect our results of operations and financial condition. \nWe continue to experience pressures across many of our businesses due to competitive activity, increased market power of our customers as the health care industry consolidates, national and regional government tenders, economic pressures experienced by our customers, staffing shortages within health care facilities that have and may continue to negatively impact demand for our products, public perception of our products, and the impact of managed care organizations and other third-party payers. These and other factors may adversely impact market sizes, as well as our share of the markets in which we compete, the average selling prices for our products or medical procedure volumes. There can be no assurance that the size of the markets in which we compete will increase, that we will be able to hold or gain market share or compete effectively on the basis of price or that the number of procedures in which our products are used will increase. Decreases in market sizes or our market share and declines in average selling prices or procedural volumes could materially adversely affect our results of operations or financial condition.\nContinued consolidation in the health care industry or additional governmental controls exerted over pricing and access in key markets could lead to increased demands for price concessions or limit or eliminate our ability to sell to certain of our \n18\nsignificant market segments, which could have an adverse effect on our business, financial condition or results of operations.\nNumerous initiatives and reforms by legislators, regulators and third-party payers to curb the rising cost of health care, and to increase access to care, have catalyzed a consolidation of aggregate purchasing power within the markets in which we sell our products. Additionally, a growing number of countries have instituted or are contemplating introducing regional or national tender processes driven primarily by price. In some cases, such processes may favor local companies to multinational companies like us. In other instances, multinational companies may be subject to a separate tender bidding process in which they compete only with each other and not with domestic companies. Further, in certain markets, the regulatory process through which new medical devices are approved may be faster and/or less burdensome for domestic companies compared to multinational companies. As the health care industry consolidates, competition to provide products and services is expected to continue to intensify, resulting in pricing pressures, decreased average selling prices and the exclusion of certain suppliers from important market segments. We expect that market demand, government regulation, third-party coverage and reimbursement policies, government contracting requirements and societal pressures will continue to change the worldwide health care industry, resulting in further business consolidations and alliances among our customers, which may increase competition, exert further downward pressure on the prices of our products and services and may adversely impact our business, financial condition or results of operations.\nHealth care cost containment pressures, government payment and delivery system reforms, changes in private payer policies, and marketplace consolidations could decrease the demand for our products, the prices which customers are willing to pay for those products and/or the number of procedures performed using our devices, which could have an adverse effect on our business, financial condition or results of operations. \nOur products are purchased principally by hospitals, physicians and other health care providers around the world that typically bill various third-party payers, including government programs, authorities or agencies (e.g., Medicare and Medicaid in the U.S.) and private health plans, for the health care supplies and services provided to their patients. Governments and payers may institute changes in health care delivery or payment systems that may reduce funding for services or encourage greater scrutiny of health care costs. The ability of customers to obtain appropriate reimbursement for their products and services is critical to the success of medical technology companies because it affects which products customers purchase and the prices they are willing to pay. Reimbursement and funding vary by country and can significantly impact the acceptance of new products and technologies and the use of established products and technologies. We may find limited demand for otherwise promising new products unless reimbursement approval is obtained from private and governmental third-party payers. Further legislative or administrative reforms to the reimbursement systems in the U.S., Japan, China, or other countries in a manner that significantly reduce or eliminate reimbursement for procedures using our medical devices, including price regulation, site of service requirements, competitive bidding and tendering, coverage and payment policies, comparative effectiveness of therapies, heightened clinical data requirements, technology assessments and managed-care arrangements, could have a material adverse effect on our business, financial condition or results of operations.\nChallenging domestic and international economic conditions could adversely affect our business, financial condition, cash flows and results of operations.\nThe global macroeconomic environment has continued to experience challenging conditions and uncertainty, including around inflation, interest rates, monetary policy, exchange rates and geopolitical developments, which could adversely impact our business, financial condition, cash flows and results of operations. If there were a general economic slowdown or recession, we may experience decreased customer spending or demand for our products and services, and our customers’ ability to pay for our products on a timely basis, or at all, may be impacted. The same economic conditions could also adversely affect our third-party vendors, including those that we utilize in our supply-chain and manufacturing operations, which may lead to a reduction or interruption in the supply of materials and components used in manufacturing our products or increase the price of such materials or components, as well as the distributors and dealers who offer our products in certain countries and markets. Continued inflationary pressure may also increase certain operational costs, including due to wage increases, or increases in the cost of materials or components. In addition, global pandemics or other public health crises could cause disruptions in global economic activity, global supply chains and labor markets, operational challenges such as site shutdowns, workplace disruptions or limited provider capacity to perform procedures using our products, and significant volatility in price and availability of goods and services. These adverse economic conditions or events could adversely affect our business, results of operations or financial condition. \nFurther, uncertainty about global economic conditions, including those resulting from a heightened global interest rate environment, has caused and may continue to cause disruption in the financial markets, including diminished liquidity and credit availability. These conditions could affect our ability to access credit markets, including to obtain financing for mergers \n19\nand acquisitions (M&A) or for other general purposes. These conditions may adversely affect our suppliers, leading them to experience financial difficulties or be unable to borrow money to fund their operations, which could cause disruptions in our ability to produce our products. Our customers may experience financial difficulties or be unable to borrow money to fund their operations, which may adversely impact their ability or decision to purchase our products, particularly capital equipment, or to pay for our products that they purchase on a timely basis, if at all. In addition, we have accounts receivable factoring programs in certain European and Asian countries. A slowdown in the global economy or sovereign debt issues may impact our ability to transfer receivables to third parties in certain of those countries. Third parties, such as banks, offering factoring programs in these countries are looking to reduce their exposure levels to government owned or supported debt. This could result in terminations of, or changes to the costs or credit limits of our existing factoring programs. Such terminations or changes could have a negative impact on our cash flow and days sales outstanding. Uncertain or challenging global economic conditions could also lead to greater fluctuations in foreign currency exchange rates, which could adversely impact our results of operations and financial performance.\nWe are subject to a number of market, business, financial, legal and regulatory risks and uncertainties with respect to our international operations that could have a material impact on our business, financial condition or results of operations.\n \nInternational net sales accounted for 39 percent of our global net sales in 2024. An important part of our strategy is to continue pursuing growth opportunities in net sales and market share outside of the U.S. by expanding global presence, including in Emerging Markets. Our international operations are subject to a number of market, business and financial risks and uncertainties, including those related to our use of channel partners, go-to-market strategies, geopolitical and economic instability, foreign currency exchange and interest rate fluctuations, competitive product offerings, local changes in health care financing and payment systems and health care delivery systems, local product preferences and requirements, including preferences for local manufacturers, trade protection measures, including tariffs or other barriers to market participation, workforce instability, weaker intellectual property protection in certain countries than exists in the U.S. and longer accounts receivable cycles. Such risks and uncertainties may adversely impact our ability to implement our growth strategy in these markets and, as a result, our sales growth, market share and operating profits from our international operations may be adversely affected.\nOur international operations are subject to established and developing legal and regulatory requirements for medical devices in each country in which our products are marketed and sold. Most foreign countries have medical device regulations. Further, most countries outside of the U.S. require product approvals be renewed or re-certified on a regular basis in order to continue to be marketed and sold there. In addition, several countries that previously did not have regulatory requirements for medical devices have established such requirements in recent years and other countries have expanded, or plan to expand, existing regulations, including requiring local clinical data in addition to global clinical data. These factors have caused or may cause us to experience more uncertainty, risk, expense and delay in obtaining approvals and commercializing products in certain jurisdictions, which could adversely impact our net sales, market share and operating profits from our international operations.\n \nFurther, international markets are affected by economic pressure to contain health care costs, which can lead to more rigorous evidence requirements and lower reimbursement rates for either our products directly or procedures in which our products are used. Governments and payers may also institute changes in health care delivery systems that may reduce funding for services, seek payback from market participants, or encourage greater scrutiny of health care costs. In addition, certain international markets may also be affected by foreign government efforts to reference reimbursement rates in other countries. All of these types of changes may ultimately reduce selling prices of our products and/or reduce the number of procedures in which our products are used, which may adversely impact our net sales, market share and operating profits from our international operations.\nIn addition, our international operations are subject to other established and developing U.S. and foreign legal and regulatory requirements, including FCPA and/or similar laws in other countries and U.S. and foreign import and export controls and licensing requirements, trade protection and embargo measures and customs laws. Global businesses, including those in the medical device industry, are facing increasing scrutiny of, and heightened enforcement efforts with respect to, their international operations. Any alleged or actual failure to comply with legal and regulatory requirements may subject us to government scrutiny, civil and/or criminal proceedings, sanctions and other liabilities, which may have a material adverse effect on our international operations, financial condition, results of operations and/or liquidity. \nThere may be greater uncertainty and market volatility following U.S. and global elections, including resulting from potential shifts in trade policies, tariffs or other trade protection measures, and the reaction of other countries thereto, or changes to international trade agreements, which could have a material adverse effect on our operations, including our ability to source and manufacture products in a timely and cost effective manner, financial condition, results of operations and/or liquidity. In particular, the U.S.-China relationship may continue to shape the geopolitical stage. Legislation aimed at boosting \n20\ncompetitiveness of U.S. businesses may have unintended negative effects on our business. We may also face greater competition in China, among other countries, from domestic medical device companies that may benefit from their status as local manufacturers and suppliers.\nLastly, geopolitical developments related to various global conflicts are sources of uncertainty and may cause disruptions to global or regional markets, supply chains or operations in the regions. Sanctions and export restrictions may continue to proliferate, leading to greater uncertainty in emerging and growth markets. Notably the Russia/Ukraine war has continued to create barriers to doing business in Russia and in parts of Eastern Europe, tension between China/Taiwan has created geopolitical shifts in Asia, and conflicts in the Middle East have disrupted operations of companies doing business in the region, including in Israel. Any significant changes in the political, economic, financial, competitive, legal and regulatory or reimbursement conditions where we conduct, or plan to expand, our international operations may have a material impact on our business, financial condition or results of operations. \nCredit and Financial Risks\nIf we are unable to manage our debt levels, maintain investment grade credit ratings at the three ratings agencies, or if we experience a disruption in our cash flows, it could have an adverse effect on our cost of borrowing, financial condition or results of operations.\nAs part of our strategy to maximize stockholder value, we use financial leverage to manage our cost of capital. Our outstanding debt balance was $10.746 billion as of December 31, 2024. Although we currently have investment grade ratings at Moody's Investor Service, Standard & Poor's Rating Service and Fitch Ratings, our inability to maintain investment grade credit ratings could increase our cost of borrowing funds in the future and reduce our access to liquidity. Uncertain or negative economic conditions could also increase our cost of borrowing in the future or reduce our access to liquidity. Delays in our product development and new product launches could result in disruption in our cash flow or our ability to continue to effectively manage our debt levels, which could have an adverse effect on our cost of borrowing, financial condition or results of operations. In addition, our credit agreements contain a financial covenant that requires us to maintain a maximum specified leverage ratio and place other limits on our business. If we are unable to satisfy this covenant, we may be required to obtain waivers from our lenders and no assurance can be made that our lenders would grant such waivers on favorable terms or at all and we could be required to repay any borrowings on demand. \nWe may record future goodwill impairment charges related to one or more of our global reporting units or other intangible asset impairment charges, which could materially adversely impact our results of operations.\nWe test our goodwill balances in the second quarter of each year as of April 1 for impairment, or more frequently if impairment indicators are present or changes in circumstances suggest an impairment may exist. We assess goodwill for impairment at the reporting unit level. We also test our indefinite-lived intangible assets at least annually, or more frequently if impairment indicators are present, and we review intangible assets subject to amortization quarterly for impairment. In evaluating the potential for impairment, we make assumptions regarding estimated revenue projections, growth rates, cash flows and discount rates. \nOn a quarterly basis, we monitor the key drivers of fair value to detect events or other changes that would warrant an interim impairment test of our goodwill and other intangible assets. Relatively small declines in the future performance and cash flows of a reporting unit or asset group, changes in our reporting units or in the structure of our business as a result of future reorganizations, acquisitions or divestitures of assets or businesses, or small changes in other key assumptions, may result in the recognition of significant asset impairment charges, which could have a material adverse impact on our results of operations.\nBusiness and Operational Risks\nFailure to integrate acquired businesses into our operations successfully could adversely affect our business, financial condition and operating results.\nAs part of our strategy to realign our business portfolio, we have completed multiple acquisitions in recent years and may pursue additional acquisitions in the future. Our integration of acquired businesses requires significant efforts, including corporate restructuring and the coordination of information technologies, research and development, sales and marketing, operations, regulatory, supply chain, manufacturing, quality systems and finance. These efforts result in additional expenses and involve significant management time. Some of the factors that could affect the success of our acquisitions include, among others, the effectiveness of our due diligence process, our ability to execute our business plan for the acquired companies, the strength of the acquired technology, results of clinical trials, regulatory approvals and reimbursement levels of the acquired \n21\nproducts and related procedures, the continued performance of critical transition services, our ability to adequately fund acquired in-process research and development projects and retain key employees and our ability to achieve synergies with our acquired companies, such as increasing sales of our products, achieving cost savings and effectively combining technologies to develop new products. Foreign acquisitions involve unique risks, including those related to integration of operations across different geographies, cultures and languages, currency risks and risks associated with the economic, political, legal and regulatory environment in specific countries. In addition, we have and may in the future acquire less than full ownership interests in other businesses, which involve unique challenges for effective collaboration. Further, other parties that hold remaining ownership interests in such businesses may at any time have economic or business goals that are inconsistent with our goals or the goals of such businesses. Our failure to manage these challenges successfully and coordinate the growth of such businesses or other investments could have an adverse impact on our business and our future growth. In addition, we cannot be certain that the businesses we acquire or invest in will become profitable or remain so, and if our acquisitions or investments are not successful, we may record related asset impairment charges in the future or experience other negative consequences on our operating results.\nWe may not be successful in our strategy relating to future strategic acquisitions of, investments in, or alliances with, other companies and businesses.\nOur strategic acquisitions, investments and alliances are intended to further expand our ability to offer customers effective, high quality medical devices. We face competition for acquisitions from other health care and non-health care acquirers, financial sponsors, and from the market for initial public offerings (IPOs). Some of our competitors in the medical device sector may have access to substantially greater amounts of cash than we do that could be deployed into M&A or strategic investments if they so choose. The market for IPOs may also reduce the opportunities available to us for M&A and/or cause us to need to pay higher prices. If we are unsuccessful in our acquisitions, investments and alliances, it may adversely impact our ability to grow our business. Any potential future acquisitions we consummate may be dilutive to our earnings and may require additional debt or equity financing, depending on their size or nature. The success of our strategy relating to future acquisitions, investments or alliances will depend on a number of factors, including our ability to:\n•\nidentify suitable opportunities for acquisition, investment or alliance, if at all,\n•\nmanage acquisition, investment or alliance opportunities within our capital capacity and prioritize those investments to execute on our strategy, \n•\nmanage our due diligence process to uncover potential issues with targets,\n•\nfinance any future acquisition, investment or alliance on terms acceptable to us, if at all,\n•\ncomplete acquisitions, investments or alliances in a timely manner on terms that are satisfactory to us, if at all, \n•\nsuccessfully integrate and operate acquired businesses and collaborate with non-wholly owned businesses,\n•\nsuccessfully identify and retain key target employees,\n•\ncomply with applicable laws and regulations, including foreign laws and regulations, and\n•\nprotect intellectual property and prevail in litigation related to newly acquired technologies. \nWe may not realize the expected benefits from our restructuring and optimization initiatives, our long-term cost savings programs may result in an increase in short-term expenses and our efforts may lead to unintended consequences. \nWe monitor the dynamics of the economy, the health care industry and the markets in which we compete, and assess opportunities for improved operational effectiveness and efficiency and to better align expenses with revenues, while preserving our ability to make investments in research and development projects, capital and our people, which we believe is important to our long-term success. As a result of these assessments, we have undertaken prior restructuring and optimization initiatives to enhance our growth potential and position us for long-term success. On February 22, 2023, our Board of Directors approved, and we committed to, a new global restructuring program (the 2023 Restructuring Plan) intended to support our efforts to expand operating performance and meet evolving global market demands and conditions by ensuring that we are structured and resourced to support our strategic imperatives and deliver sustainable value. \nThe 2023 Restructuring Plan \nfurther builds on our Global Supply Chain Optimization strategy, which is intended to simplify our manufacturing and distribution network by transferring certain production lines among facilities and expanding operational efficiencies and resiliency across production, sterilization, and distribution. Key activities under the 2023 Restructuring Plan also include optimizing certain functional capabilities to better support business growth and achieve cost synergies. These activities were initiated during the first quarter of 2023, and are expected to be substantially completed by the end of 2025. The 2023 Restructuring Plan is expected to result in total pre-tax charges of approximately $450 million to $550 million and reduce gross annual pre-tax expenses by approximately $225 million to $275 million as program benefits are realized. We expect a substantial portion of the savings to be reinvested in strategic growth initiatives. While we expect limited role reductions as a result of these restructuring activities, we anticipate that our overall employee base will remain relatively unchanged upon completion of the 2023 Restructuring Plan as new jobs are created in areas of growth and resources are deployed to support an expanding portfolio and growing global market needs. \n22\nThese measures could yield unintended consequences, such as distraction of our management and employees, reduced employee productivity, business disruption, and inability to attract or retain key personnel, which could negatively affect our business, sales, financial condition and results of operations. Moreover, our restructuring and optimization initiatives result in charges and expenses which impact our operating results. We cannot guarantee that the activities under our restructuring plans or other optimization initiatives will result in the desired efficiencies and estimated cost savings.\nOur future growth is dependent upon the development of new products and enhancement of existing products, which requires significant research and development, clinical trials and regulatory approvals, all of which may be very expensive and time-consuming and may not result in commercially viable products.\nIn order to develop new products and enhance existing products, we focus our research and development programs largely on the development of next-generation and novel technology offerings across multiple programs and businesses. The development of new products and enhancement of existing products requires significant investment in research and development, clinical trials and regulatory approvals. The results of our product development efforts may be affected by a number of factors, including our ability to anticipate customer needs, innovate and develop new products, complete clinical trials, obtain regulatory approvals and reimbursement in the U.S. and abroad, manufacture products in a cost-effective manner, obtain appropriate intellectual property protection for our products and gain and maintain market approval of our products. There can be no assurance that any products now in development or that we may seek to develop in the future will achieve technological feasibility, obtain regulatory approval or gain market acceptance. If we are unable to develop and launch new products and enhanced products, our ability to maintain or expand our market position in the markets in which we participate may be materially adversely impacted. Further, we are continuing to investigate and have completed multiple acquisitions that involve opportunities to further expand our presence in and diversify into, priority growth areas by accessing new products and technologies. There can be no assurance that our investments will be successful or that we will be able to access new products and technologies on terms favorable to us, or that these products and technologies will achieve commercial feasibility, obtain regulatory approval or gain market acceptance. A delay in the development or approval of new products and technologies or our decision to reduce or terminate our investments may adversely impact the contribution of these technologies to our future growth.\nAdditionally, certain products or groups of products, in particular new products or enhancements of existing products, may have a disproportionate impact on our business, financial condition and results of operations. Failure to meet growth projections, poor clinical outcomes, increasing regulatory requirements, launch delays and inability to effectively scale manufacturing and achieve targeted margins with respect to any of these products or groups of products in particular may materially adversely impact on our business, financial condition and results of operations.\nInterruption of our supply chain or manufacturing operations, including resulting from natural disasters, public health crises, geopolitical developments or other events outside of our control, could adversely affect our results of operations and financial condition. \nOur products are designed and manufactured in technology centers around the world, either by us or third parties. In most cases, the manufacturing of any specific product is concentrated in one or a few locations. Factors such as a failure to follow specific internal protocols and procedures, equipment malfunction, environmental factors or damage to one or more of our facilities could adversely affect our ability to manufacture our products. In the event of an interruption in manufacturing, we may be unable to quickly move to alternate means of producing affected products or to meet customer demand. In the event of a significant interruption, for example, as a result of a failure to follow regulatory protocols and procedures, we may experience lengthy delays in resuming production of affected products due primarily to needs for regulatory approvals. We have also faced and may continue to face disruptions in the transportation of materials, components and our products within our global supply chains, including as a result of labor disputes or shortages, strikes, port closures, public health crises or geopolitical developments, which may cause delays in the shipment of our products or other disruptions to our business. As a result, we may experience loss of market share, which we may be unable to recapture and harm to our reputation, which could adversely affect our results of operations and financial condition.\n23\nDisruptions in the supply of the materials and components used in manufacturing our products by third-party vendors or the sterilization of our products could adversely affect our results of operations and financial condition. \nWe purchase the majority of the materials and components used in manufacturing our products from third-party vendors. Certain of these materials and components are purchased from single sources due to quality considerations, expertise, costs or constraints resulting from regulatory requirements. In certain cases, we may not be able to establish additional or replacement vendors for such materials or components in a timely or cost effective manner, largely as a result of FDA regulations that require validation of materials and components prior to their use in our products and the complex nature of our and many of our vendors' manufacturing processes. Further, uncertain or negative economic conditions, including as a result of inflationary pressures, interest rates or geopolitical developments, could negatively affect our third-party vendors, which could lead to a reduction or interruption in the supply of materials and components used in manufacturing our products or increase the price of such materials or components. A reduction or interruption in the supply of materials and components used in manufacturing our products, an inability to timely develop and validate alternative sources if required or a significant increase in the price of such materials or components could adversely affect our results of operations and financial condition. \nIn addition, many of our products require sterilization prior to sale and we utilize a mix of internal resources and contract sterilizers to perform this service. To the extent we or our contract sterilizers are unable to sterilize our products, whether due to capacity, availability of materials for sterilization, regulatory or other constraints, including evolving federal and state regulations on the use of ethylene oxide, we may be unable to transition to alternative internal or external resources or methods in a timely or cost effective manner or at all, which could have a material impact on our results of operations and financial condition. Additionally, U.S. and international governments have or are considering adopting regulations on the use of per- and polyfluoroalkyl substances (PFAS), and primary manufacturers of PFAS materials have announced that they are discontinuing the supply of such materials. These changes could have an adverse impact on our ability to manufacture or supply certain products in a timely or cost effective manner or at all. These and other environmental laws and regulations may have additional impacts on us or our suppliers, or result in liability to us.\nWe rely on the proper function, availability and security of information technology systems to operate our business and a cyber-attack or other breach of these systems could have a material adverse effect on our business, financial condition or results of operations. \nWe rely on information technology (IT) and operational technology (OT) systems, including technology from third party vendors, to manufacture and ship our products, as well as to process, transmit and store electronic information in our day-to-day operations. Similar to other large multi-national companies, the size and complexity of our IT systems makes them vulnerable to a cyber-attack, malicious intrusion, breakdown, destruction, loss of data privacy, or other significant disruption. Various other factors may also cause system failures or security breaches, including power outages, natural disasters, inadequate or ineffective backups, issues with upgrading or creating new systems or platforms, vulnerabilities in third-party software or services, errors by our staff or third-party service providers, or breaches in the security of these technologies. We may also face operational interruptions as we continue to implement our new global enterprise resource planning (ERP), which began in 2022. Malicious actors may attempt to trick staff to disclose information to gain access to our systems and/or data. International conflicts, including but not limited to the Russia/Ukraine war, conflicts in the Middle East, and tension between China/Taiwan, have also heightened cybersecurity risks on a global basis. If our incident response, disaster recovery, and business continuity plans fail, such failure could result in adverse impacts to our business operations and our financial results.\nOur information systems require an ongoing commitment of significant resources to maintain, protect and enhance existing systems and develop new systems to keep pace with continuing changes in information processing technology, evolving systems and regulatory standards, the increasing need to protect patient and customer information and changing customer patterns. This includes opportunities as well as risks associated with the integration of AI into our or our suppliers' or customers' operations. While AI presents significant opportunities for innovation and efficiency, it could introduce new risks in managing information systems and in the cybersecurity threat landscape. In addition, third parties have and may continue to attempt to hack into our products to obtain data relating to patients, or alter the intended functionality of our medical devices, or disrupt performance of our products, or access our proprietary information and the technology from third party vendors that we rely upon may have defects or vulnerabilities which, in turn, create vulnerabilities or disruptions in our system. Cyber-attacks continue to evolve in complexity and scope, and inherently may be difficult to detect. This includes emerging technologies which increase our threat landscape, such as generative AI and quantum computing, which are evolving rapidly in their practicality and use for cyber-attacks including through enhanced social engineering, and for cyber-attacks on industry standard data protections through increased computing capabilities. We have seen, and could continue to see, software and supply-chain vulnerabilities and malware, which could affect our systems and the systems of our third-party vendors and business partners\n. Some of our IT and OT systems contain legacy third-party software components for which we depend on a layered security approach to protect against exploitation, and such layered security approach may not be effective. \nAny failure by us to maintain \n24\nor protect our IT or OT systems, products and data integrity, including from cyber-attacks, intrusions or other breaches, could result in outages or unauthorized access to patient data and personally identifiable information, theft of intellectual property or other misappropriation of assets, or otherwise compromise our confidential or proprietary information and disrupt our operations, or, in the worst case, could result in harm to patients. In addition, such attackers may make demands for ransom, which could result in financial loss, or, if we determine not to pay such ransom, other harm, loss, or misappropriation of our data and assets. Such failure, or demonstration of vulnerability to such failure, may also result in additional regulatory scrutiny. We also grow our company through acquisitions and may face risks associated with defects and vulnerabilities in acquired systems as we work to integrate the acquisitions into our IT system. \nIn the U.S., federal and state privacy and security laws require certain parts of our operations to protect the confidentiality of personal information, including patient medical records and other health information, and to comply with other requirements with respect to personal data. In Europe, the Data Protection Directive requires us to manage individually identifiable information in the EU, and the General Data Protection Regulation (GDPR) may impose fines of up to four percent of our global revenue. Internationally, some countries have also passed laws that require individually identifiable data on their citizens to be maintained on local servers and that may restrict transfer or processing of that data. Our product systems also require adherence to evolving regulatory standards and customer patterns and requirements worldwide. We strive to meet the expectations of applicable regulations, however, there is no guarantee that we will avoid enforcement actions by governmental bodies or civil actions based on this growing body of regulations. Enforcement actions could be costly and interrupt regular operations of our business, including related to market approvals of products and technologies. Any of these events, in turn, may cause us to lose existing customers, have difficulty preventing, detecting and controlling fraud, have disputes with customers, physicians and other health care professionals, be subject to legal claims and liability, have regulatory sanctions or penalties imposed, have increases in operating expenses, incur expenses or lose revenues as a result of a data privacy breach or theft of intellectual property, or suffer other adverse consequences, any of which could have a material adverse effect on our business, financial condition or results of operations. \nOur business and operations are subject to risks related to climate change.\nThe effects of global climate change present risks to our business. Natural disasters, extreme weather and other conditions caused by or related to climate change could adversely impact our supply chain, including manufacturing and distribution networks, the availability and cost of raw materials and components, energy supply, transportation, or other inputs necessary for the operation of our business. Climate change and natural disasters could also result in physical damage to our facilities as well as those of our suppliers, customers, and other business partners, which could cause disruption in our business and operations or increase costs to operate our business. Increased environmental regulation, including to address climate change, as well as new disclosure and reporting requirements in the U.S. and other jurisdictions, including with respect to climate change and carbon emissions, may result in increases in our or our suppliers' compliance burdens and costs to operate our business, or restrict certain aspects of our activities. The extent and severity of climate change impacts are unknown, and therefore, the scope of potential impact on our business may be difficult to predict and it may be difficult to adequately prepare.\nOur business could be negatively impacted by corporate social responsibility and sustainability matters.\nIn recent years, there continues to be an increased focus from certain investors, customers, employees, regulators and other stakeholders globally concerning corporate social responsibility and sustainability matters. From time to time, we announce certain initiatives, including goals, regarding our focus areas, which include environmental matters, including carbon emissions and renewable energy goals, responsible sourcing, social investments and diversity and inclusion. We may fail, or be perceived to fail, in our achievement of such initiatives or goals, or we could fail in accurately reporting our progress on such initiatives and goals. Such failures could be due to changes in our business. Moreover, the standards by which corporate social responsibility and sustainability efforts and related matters are measured are developing and evolving, and certain areas are subject to assumptions that could change over time. In addition, we could be criticized for the scope of such initiatives or goals or perceived as not acting responsibly in connection with these matters. Any such matters, or related corporate social responsibility and sustainability matters, could have a material adverse impact on our future results of operations, financial condition and cash flows.\nIf we are unable to attract or retain key talent, it could have an adverse effect on our business, financial condition and results of operations.\nIn our industry, there is substantial competition for key personnel in the regions in which we operate and we may face increased competition for such employees. Our business depends to a significant extent on the continued service of senior management and other key personnel, the development of additional management personnel and the hiring of new qualified employees. \n25\nThere can be no assurance that we will be successful in retaining and developing existing personnel or recruiting new personnel. The loss of one or more key employees, our ability to attract or develop additional qualified employees or any delay in hiring key personnel could have material adverse effects on our business, financial condition or results of operations. A shortage of skilled labor could also require higher wages that would increase labor costs. Our ability to attract and retain key talent at all levels of our organization has been and could continue to be challenged by these conditions, and inability to attract and retain talent could result in material adverse impacts to our business and results of operations.\nLegal and Regulatory Risk Factors\nHealth care policy changes may have a material adverse effect on our business, financial condition, results of operations and cash flows.\nPolitical, economic and policy influences are leading the health care industry to make substantial structural and financial changes that will continue affecting our results of operations. Government and private sector initiatives aimed at limiting the growth of health care costs (including price regulation), coverage and payment policies, comparative effectiveness of therapies, technology assessments, increasing price transparency and reforming health care delivery and payment structures, are continuing in many countries where we do business. We believe that these changes are causing the marketplace to place increased emphasis on the delivery of treatments that can reduce costs, improve efficiencies and/or increase patient access. Although we believe our products and technologies generate favorable clinical outcomes, value and cost efficiency, while also being less invasive than alternatives, the resources and evidence necessary to demonstrate value to our customers, patients, payers and other stakeholders may be significant, and it may take a significant period of time to gain widespread adoption. Moreover, there can be no assurance that our strategies will succeed for every product.\nWe cannot predict the specific health care programs and regulations that will be ultimately implemented by various regional and national governments. However, any changes that lower reimbursements for either our products and/or procedures using our products reduce medical procedure volumes and/or increase cost containment pressures on us or others in the health care sector could adversely affect our business and results of operations.\nWe are subject to extensive and dynamic medical device regulation, which may impede or hinder the approval or sale of our products and, in some cases, may ultimately result in an inability to obtain approval of certain products or may result in the recall or seizure of previously approved products.\nOur products, marketing, sales and development activities and manufacturing processes are subject to extensive and rigorous regulation by the FDA pursuant to the Federal Food, Drug and Cosmetic Act (FDC Act), by comparable agencies in foreign countries and by other regulatory agencies and governing bodies. Under the FDC Act, medical devices must receive FDA clearance or approval or an exemption from such clearance or approval before they can be commercially marketed in the U.S. In the EU, we are required to comply with the Medical Device Regulation (MDR) effective May 2021, which superseded the Medical Device Directives. Medical devices that have a valid CE Certificate to the Directives issued before May 2021 could be sold until the earlier of May 2024 or when the CE Certificate expired, provided there were no significant changes to the design or intended use. In 2023, updates to the legislative text of the EU MDR were adopted by the European Parliament and the Council of the European Union, including an extension of the transitional period to 2027 for certain high risk class devices and 2028 for lower risk class medical devices that have a valid CE Certificate to the Directives issued before May 2021. The CE Mark is applied following approval from an independent notified body or declaration of conformity. The process of obtaining marketing approval or clearance from the FDA or by comparable agencies in foreign countries for new products, or with respect to enhancements or modifications to existing products, could:\n•\ntake a significant period of time,\n•\nrequire the expenditure of substantial resources,\n•\ninvolve rigorous pre-clinical and clinical testing, as well as increased post-market surveillance,\n•\nrequire changes to products, and\n•\nresult in limitations on the indicated uses of products.\n \nIn addition, exported devices are subject to the regulatory requirements of each country to which the device is exported. Some countries do not have medical device regulations, but in most countries, medical devices are regulated. Frequently, regulatory approval may first be obtained in a foreign country prior to application in the U.S. due to differing regulatory requirements; however, other countries, such as China for example, require approval in the country of origin or legal manufacturer first. Most countries outside of the U.S. require that product approvals be renewed or recertified on a regular basis, generally every four to five years. The renewal or recertification process requires that we evaluate any device changes and any new regulations or standards relevant to the device and conduct appropriate testing to document continued compliance. Where renewal or \n26\nrecertification applications are required, they may need to be renewed and/or approved in order to continue selling our products in those countries. There can be no assurance that we will receive the required approvals for new products or modifications to existing products on a timely basis or that any approval will not be subsequently withdrawn or conditioned upon extensive post-market study requirements.\nOur global regulatory environment is becoming increasingly stringent and unpredictable, which could increase the time, cost and complexity of obtaining regulatory approvals, as well as the clinical and regulatory costs of supporting those approvals. Several countries that did not previously have regulatory requirements for medical devices have established such requirements in recent years and other countries have expanded on existing regulations. Certain regulators are exhibiting less flexibility and are requiring local preclinical and clinical data in addition to global data. While harmonization of global regulations has been pursued, requirements continue to differ significantly among countries. We expect this global regulatory environment will continue to evolve, which could impact our ability, or increase the time and cost, to obtain future approvals for our products.\nThe FDA and other worldwide regulatory agencies actively monitor compliance with local laws and regulations through review and inspection of design and manufacturing practices, recordkeeping, reporting of adverse events, labeling and promotional practices. The FDA can ban certain medical devices, detain or seize adulterated or misbranded medical devices, order repair, replacement or refund of these devices and require notification of health professionals and others with regard to medical devices that present unreasonable risks of substantial harm to the public health. The FDA can take action against a company that promotes \"off-label\" uses. The FDA may also enjoin and restrain a company for certain violations of the FDC Act and other amending laws pertaining to medical devices, or initiate action for criminal prosecution of such violations. Any adverse regulatory action, depending on its magnitude, may restrict a company from effectively marketing and selling its products, may limit a company's ability to obtain future premarket clearances or approvals and could result in a substantial modification to our business practices and operations. International sales of medical devices manufactured in the U.S. that are not approved by the FDA for use in the U.S., or that are banned or deviate from lawful performance standards, are subject to FDA export requirements. \nRegulations regarding the development, manufacture and sale of medical devices are evolving and subject to future change. We cannot predict what impact, if any, those changes might have on our business. Failure to comply with regulatory requirements could have a material adverse effect on our business, financial condition and results of operations. Later discovery of previously unknown problems with a product or manufacturer could result in fines, delays or suspensions of regulatory clearances or approvals, seizures or recalls of products, physician advisories or other field actions, operating restrictions and/or criminal prosecution. We may also initiate field actions as a result of a failure to strictly comply with our internal quality policies. The failure to receive product approval clearance on a timely basis, suspensions of regulatory clearances, seizures or recalls of products, physician advisories or other field actions, or the withdrawal of product approval by the FDA or by comparable agencies in foreign countries could have a material adverse effect on our business, financial condition or results of operations.\nOur products are continually subject to clinical trials and other analyses conducted by us, our competitors or other third parties, the results of which may be unexpected, or perceived as unfavorable by the market, and could have a material adverse effect on our business, financial condition or results of operations.\nAs a part of the regulatory process of obtaining marketing clearance for new products and new indications for existing products, we conduct and participate in numerous clinical trials with a variety of study designs, patient populations and trial endpoints. Unexpected or inconsistent clinical data from existing or future clinical trials or other analyses conducted by us, by our competitors or by third parties, including acquired businesses prior to acquisition by us, or the FDA's or the market's perception of this clinical data, may adversely impact our ability to obtain product approvals, our position in, and share of, the markets in which we participate and our business, financial condition, results of operations or future prospects.\nThe medical device industry and its customers continue to face scrutiny and regulation by governmental authorities and are often the subject of numerous investigations, often involving marketing and other business practices or product quality issues including device recalls or advisories. These investigations could result in the commencement of civil and criminal proceedings; imposition of substantial fines, penalties and administrative remedies, including corporate integrity agreements, stipulated judgments or exclusion; diversion of our employees' and management's attention; imposition of administrative costs and have an adverse effect on our financial condition, results of operations and liquidity; and may lead to greater governmental regulation in the future.\nThe medical devices we design, develop, manufacture and market are subject to rigorous regulation by the FDA and numerous other federal, state and foreign governmental authorities. These authorities continue to closely scrutinize our industry. We have received and in the future may receive, subpoenas and other requests for information from Congress and state and federal governmental agencies, including, among others, the U.S. Department of Justice (DOJ), the Office of Inspector General of the \n27\nDepartment of Health and Human Services (HHS) and the Department of Defense, as well as from foreign governments and agencies. The requests and/or subpoenas we have received relate primarily to financial arrangements with health care providers, regulatory compliance and sale and/or product promotional practices. We have cooperated with these subpoenas and other requests for information and expect to continue to do so in the future. We cannot predict when a matter will be resolved, the outcome of the matter or its impact on us and cooperation may involve significant costs, including document production costs. An adverse outcome in any matter could include the commencement of an investigation, civil and criminal proceedings, substantial fines, penalties and administrative remedies, including exclusion from government reimbursement programs, entry into Corporate Integrity Agreements (CIAs) with governmental agencies and amendments to any existing CIAs. In addition, resolution of any matter could involve the imposition of additional and costly compliance obligations. Cooperation with requests and investigations from external agencies result in employee resource costs and diversion of employee focus. If any requests or investigations continue over a long period of time, they could divert the attention of management from the day-to-day operations of our business and impose significant additional administrative burdens on us. These potential consequences, as well as any adverse outcome from these requests or investigations, could have a material adverse effect on our financial condition, results of operations and liquidity.\nIn addition, certain foreign governments, state governments (including that of Massachusetts, where we are headquartered) and the U.S. federal government have enacted legislation aimed at increasing transparency of our interactions with health care providers. As an example, compliance with the U.S. Physician Payment Sunshine Act requires us by law to disclose payments and other transfers of value to all U.S. physicians and U.S. teaching hospitals at the U.S. federal level made after August 1, 2013. Failure to comply with these legal and regulatory requirements could impact our business. In addition, we have and may continue to devote substantial additional time and financial resources to further develop and implement enhanced structure, policies, systems and processes to comply with enhanced legal and regulatory requirements, which may also impact our business.\nWe anticipate that governmental authorities will continue to scrutinize our industry closely and that additional regulation may increase compliance and legal cost and exposure to litigation and have additional adverse effects on our operations.\nChanges in tax laws, unfavorable resolution of tax contingencies, or exposure to additional income tax liabilities could have a material impact on our financial condition, results of operations and/or liquidity.\nWe are subject to income taxes as well as non-income based taxes, tariffs, and duties in the U.S. and numerous foreign jurisdictions. Tax laws and regulations could change on a prospective or retroactive basis and any such changes could have a material adverse effect on our financial condition and results of operations. Following the issuance of any new law or regulation, interpretations are made by the Company, using any regulatory guidance and judicial interpretations issued after the law change. The Company's application of such tax laws, before and after any guidance or interpretations are issued, or in the absence of such guidance or interpretations, may have a material impact on our financial condition and results of operations. \nWe are subject to ongoing tax audits in various jurisdictions. Tax authorities may disagree with certain positions we have taken and assess additional taxes. We regularly assess the likely outcomes of these audits to determine the appropriateness of our tax provision, and we have established contingency reserves for material, known tax exposures. However, the calculation of such tax exposures involves the application of complex tax laws and regulations in many jurisdictions, as well as interpretations as to the legality under European Union state aid rules of tax advantages granted in certain jurisdictions. Therefore, there can be no assurance that we will accurately predict the outcomes of these disputes or other tax audits or that issues raised by tax authorities will be resolved at a financial cost that does not exceed our related reserves. The actual outcomes of these disputes and other tax audits could have a material impact on our financial condition and results of operations.\nOur operations in Puerto Rico, Costa Rica, China and Malaysia presently benefit from various tax rate incentives and grants. Unless these incentives and grants are extended, they will expire between 2026 and 2034. If we are unable to renew, extend, or obtain new incentives and grants, the expiration of the existing incentives and grants could have a material impact on our financial condition and results of operations in future periods.\nMany provisions of the Tax Cuts and Jobs Act (TCJA) enacted in the U.S. in 2017 expire at the end of 2025. Other provisions of the TCJA are modified beginning in 2026. The U.S. Congress and the current administration have indicated that they intend to pursue legislation in 2025 to make permanent the 2017 TCJA provisions but there is no guarantee that this initiative will be successful. Any new U.S. corporate tax legislation that is enacted in 2025 could have a material adverse effect on our financial condition and results of operations.\nThe Group of Twenty (G20), the Organization for Economic Co-operation and Development (OECD), the European Commission (EC) and individual taxing jurisdictions where we and our affiliates do business have recently focused on issues \n28\nrelated to the taxation of multinational corporations. The OECD/G20 Inclusive Framework (IF) on base erosion and profit shifting (BEPS) includes actions intended to equip governments with domestic and international rules and instruments to address tax avoidance, ensuring that profits are taxed where economic activities generating the profits are performed and where value is created. The actions include a two-pillar solution to address the tax challenges of the digitalized economy. Pillar One focuses on how profits are allocated between taxing jurisdictions and Pillar Two creates a 15% global minimum tax. Many countries where we do business have already implemented the Pillar Two global minimum tax into their national laws. Other countries are considering enacting laws consistent with the Pillar Two rules, while still others have yet to announce their intention to adopt. The United States has not enacted the Pillar Two global minimum tax and the current administration recently announced its intention to effectively withdraw from the OECD Inclusive Framework as well as its intention to enact retaliatory measures against countries who assert extraterritorial taxes against U.S. taxpayers. The OECD continues to issue guidance on the Pillar Two framework, with new rules released as recently as January, 2025. While we continue to monitor legislative adoption of Pillar Two by country, as well as for additional guidance from the OECD, there is significant uncertainty that exists regarding the interpretation of the detailed Pillar Two rules, whether such rules will be implemented consistently across taxing jurisdictions, how such rules interact with existing national tax laws and whether such rules are consistent with existing tax treaty obligations. Accordingly, the final adoption, implementation, and interpretation of Pillar Two across all jurisdictions where we do business could have a material adverse impact on our financial condition, results of operations and cash flows. \nPresident Trump has indicated his willingness to increase the use of tariffs by the U.S. to accomplish certain U.S. policy goals. On February 1, 2025, President Trump signed three executive orders announcing his intent to impose 25% tariffs on imports from Canada and Mexico and a 10% additional tariff on imports from China. While the implementation of tariffs on imports from Mexico and Canada were paused, the Chinese tariffs took effect as scheduled and China responded by implementing 15% tariffs on certain U.S. imports. The implementation of new tariffs on imports from Canada, Mexico, China or other countries for an extended period and without specific exemptions for our products, and any reciprocal tariffs or other reactions by other countries thereto, could have a material adverse impact on our financial condition, results of operations and cash flows.\nWe may not effectively be able to protect our intellectual property, systems, software-based products or other sensitive data, which could have a material adverse effect on our business, financial condition or results of operations.\nThe medical device market in which we participate is largely technology driven. Physician customers have historically moved quickly to new products and new technologies. As a result, intellectual property rights, particularly patents and trade secrets, play a significant role in product development and differentiation. However, intellectual property litigation is inherently complex and unpredictable and appellate courts can overturn lower court decisions. Furthermore, as our business increasingly relies on technology systems and infrastructure, our intellectual property, other proprietary technology and other sensitive data are potentially vulnerable to loss, damage or misappropriation. Finally, our ability to protect novel business models is uncertain. \nCompeting parties in our industry frequently file multiple suits to leverage patent portfolios across product lines, technologies and geographies and to balance risk and exposure between the parties. In some cases, several competitors are parties in the same proceeding, or in a series of related proceedings, or litigate multiple features of a single class of devices. These forces frequently drive settlement not only of individual cases, but also of a series of pending and potentially related and unrelated cases. In addition, although monetary and injunctive relief is typically sought, remedies and restitution are generally not determined until the conclusion of the trial court proceedings and can be modified on appeal. Accordingly, the outcomes of individual cases are difficult to time, predict or quantify and are often dependent upon the outcomes of other cases in other geographies.\nA number of third parties have asserted that our current and former product offerings infringe patents owned or licensed by them. We have similarly asserted that products sold by our competitors infringe patents owned or licensed by us. Adverse outcomes in one or more of the proceedings against us could limit our ability to sell certain products in certain jurisdictions, or reduce our operating margin on the sale of these products and could have a material adverse effect on our financial condition, results of operations or liquidity.\nPatents and other proprietary rights are and will continue to be essential to our business, and our ability to compete effectively with other companies will be dependent upon the proprietary nature of our technologies. We rely upon trade secrets, know-how, continuing technological innovations, strategic alliances, and licensing opportunities to develop, maintain and strengthen our competitive position. We pursue a policy of generally obtaining patent protection in both the U.S. and abroad for patentable subject matter in our proprietary devices and attempt to review third-party patents and patent applications to the extent publicly available in order to develop an effective patent strategy, avoid infringement of third-party patents, identify licensing opportunities and monitor the patent claims of others. We own numerous U.S. and foreign patents and have numerous patent applications pending. We also are party to license agreements pursuant to which patent rights have been obtained or granted in consideration for cash, cross-licensing rights or royalty payments. No assurance can be made that any pending or future patent \n29\napplications will result in the issuance of patents, that any current or future patents issued to, or licensed by, us will not be challenged or circumvented by our competitors, or that our patents will not be found invalid. In addition, we may have to take legal action in the future to protect our patents, trade secrets or know-how or to assert them against claimed infringement by others. Any legal action of that type could be costly and time consuming and no assurances can be made that any lawsuit will be successful. We are generally involved as both a plaintiff and a defendant in a number of patent infringement and other intellectual property-related actions. The invalidation of key patents or proprietary rights that we own, or an unsuccessful outcome in lawsuits to protect our intellectual property, could have a material adverse effect on our business, financial condition or results of operations.\nIn addition, the laws of certain countries in which we market and plan on manufacturing some of our products in the near future, do not protect our intellectual property rights to the same extent as the laws of the U.S. If we are unable to protect our intellectual property in these countries, it could have a material adverse effect on our business, financial condition or results of operations.\nFurthermore, our intellectual property, other proprietary technology and other sensitive data are potentially vulnerable to loss, damage or misappropriation from system malfunction, computer viruses and unauthorized access to our data or misappropriation or misuse thereof by those with permitted access and other events. While we have invested to protect our intellectual property, products and other data and continue to work diligently in this area, there can be no assurance that our precautionary measures will prevent breakdowns, breaches, cyber-attacks or other events. Such events could have a material adverse effect on our reputation, business, financial condition or results of operations.\nPending and future intellectual property litigation could be costly and disruptive to us.\nWe operate in an industry that is susceptible to significant intellectual property litigation and, in recent years, it has been common for companies in the medical device field to aggressively challenge the patent rights of other companies. We are currently the subject of various patent litigation proceedings and other proceedings described in more detail under \nNote I – Commitments and Contingencies\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K\n.\n Intellectual property litigation is expensive, complex and lengthy and its outcome is difficult to predict. Adverse outcomes in one or more of these matters could have a material adverse effect on our ability to sell certain products and on our operating margins, financial condition, results of operation or liquidity. Pending or future patent litigation may result in significant royalty or other payments or injunctions that can prevent the sale of products and may significantly divert the attention of our technical and management personnel. In the event that our right to market any of our products is successfully challenged, we may be required to obtain a license on terms which may not be favorable to us, if at all. If we fail to obtain a required license or are unable to design around a patent, our business, financial condition or results of operations could be materially adversely affected.\nPending and future product liability claims and other litigation, including private securities litigation, stockholder derivative suits and contract litigation, may adversely affect our financial condition and results of operations or liquidity.\nThe design, manufacturing and marketing of medical devices of the types that we produce entail an inherent risk of product liability claims. Many of the medical devices that we manufacture and market are designed to be implanted in the human body for long periods of time or indefinitely. A number of factors could result in an unsafe condition or injury to, or death of, a patient with respect to these or other products that we manufacture or sell, including physician technique and experience in performing the surgical procedure, component failures, manufacturing flaws, design defects, off-label use or inadequate disclosure of product-related risks or product-related information. These factors could result in product liability claims, a recall of one or more of our products or a safety alert relating to one or more of our products. Product liability claims may be brought by individuals or by groups seeking to represent a class.\nWe are currently the subject of product liability litigation proceedings and other proceedings described in more detail under \nNote I – Commitments and Contingencies\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K\n.\n The outcome of litigation, particularly class action lawsuits, is difficult to assess or quantify. Plaintiffs in these types of lawsuits often seek recovery of very large or indeterminate amounts, including not only actual damages, but also punitive damages. The magnitude of the potential losses relating to these lawsuits may remain unknown for substantial periods of time. In addition, the cost to defend against any future litigation may be significant. Product liability claims, securities and commercial litigation and other litigation in the future, regardless of the outcome, could have a material adverse effect on our financial condition, results of operations or liquidity. Additionally, we maintain an insurance policy providing limited coverage against securities claims and we are substantially self-insured with respect to product liability claims and fully self-insured with respect to intellectual property infringement claims. The fact that we do not maintain third-party insurance coverage for all categories of losses increases our exposure to unanticipated claims \n30\nand adverse decisions and these losses could have a material adverse effect on our financial condition, results of operations or liquidity.\nAny failure to meet regulatory quality standards applicable to our manufacturing and quality processes could have an adverse effect on our business, financial condition and results of operations.\nAs a medical device manufacturer, we are required to register our establishments and list our devices with the FDA and are subject to periodic inspection by the FDA for compliance with its Quality System Regulation requirements, which require manufacturers of medical devices to adhere to certain regulations, including testing, quality control and documentation procedures. In addition, the Federal Medical Device Reporting regulations require us to provide information to the FDA whenever there is evidence that reasonably suggests that a device may have caused or contributed to a death or serious injury or, if a malfunction were to occur, could cause or contribute to a death or serious injury. Compliance with applicable regulatory requirements is subject to continual review and is monitored rigorously through periodic inspections by the FDA which may result in observations on Form 483 and in some cases warning letters that require corrective action. In the European Community, we are required to maintain certain International Standards Organization (ISO) certifications in order to sell our products and must undergo periodic inspections by notified bodies to obtain and maintain these certifications. Many other countries in which we do business have similar requirements and other foreign governments or agencies may subject us to periodic inspections.\n \nIf we, or our manufacturers, fail to adhere to quality system regulations or ISO requirements, this could delay production of our products and lead to fines, difficulties in obtaining regulatory clearances, recalls, enforcement actions, including injunctive relief or consent decrees, or other consequences, which could, in turn, have a material adverse effect on our financial condition or results of operations.\n31\nITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.\nITEM 1C. CYBERSECURITY\nRisk Management and Strategy\nWe rely on information technology (IT) and operational technology (OT) systems, including technology from \nthird party\n vendors, to manufacture and ship our products, as well as to process, transmit and store electronic information in our day-to-day operations. \nWe have established an enterprise cybersecurity program\n, which is administered by a cross-functional team of cybersecurity professionals that includes employees and third party contractors and vendors, that utilizes various tools, methodologies and processes to assess, identify and manage cybersecurity risks related to our IT and OT systems, as well as our products. Our cybersecurity program is designed to monitor and continually enhance our enterprise security posture, with the goal of preventing cybersecurity incidents to the extent feasible, including assessments to better understand our readiness for cybersecurity threats and the resilience of our critical business functions, with the goal of avoiding or reducing the impact if such an event were to occur. We have implemented cybersecurity policies mapped to industry and government standards and frameworks, such as U.S. National Institute of Standards and Technology (NIST) and International Standard of Organization, and our strategy is aligned to the NIST CyberSecurity Framework that provides us a structured approach to managing our cybersecurity risk through its five core functions. We regularly review our cybersecurity policies and require annual cybersecurity training for our employees. We also periodically conduct simulation exercises involving employees at various levels of the organization, as well as our Board of Directors, to prepare for cybersecurity incidents and response planning.\n \nOur product cybersecurity focus begins with our design protocols and is supported by quality testing, provider education, and packaging and distribution standards. We use penetration testing to simulate cyberattacks and better understand our exploitable weaknesses, and we monitor threat intelligence feeds, including avenues for product users to report vulnerabilities directly to us, and use scanning tools to detect and assess vulnerabilities that could affect our products. In addition, we conduct product, enterprise and vendor/third party risk assessments, vulnerability assessments and analyses to gain insights into potential vulnerabilities and their impact on critical functions, and leverage their outcomes to prioritize our security investments and balance our resource allocation. \nWe use third party security providers for specialized areas such as incident response, penetration testing, and on-demand cybersecurity services, including staff augmentation and consulting. We also leverage a managed security service provider to augment our cybersecurity organization and to provide additional monitoring and response capabilities. \nWe engage and rely upon third parties to provide services and/or goods, represent and/or otherwise act on our behalf. Prior to engaging or conducting any business with or on our behalf, such parties undergo a due diligence review, and a third party security risk assessment is conducted to validate they are legally permitted and qualified to maintain appropriate safeguards to protect our information assets in connection with the services they intend to provide. We perform supplemental reviews as necessary commensurate with the risk associated with each third party, for example, if or when a third party is affected by an incident, that directly or indirectly impacts our company we undertake a full assessment and implement additional controls commensurate to the risk. Furthermore, to minimize risks and vulnerabilities to our systems, our cybersecurity team continuously monitors and addresses cybersecurity threats and incidents at third-party service providers.\nAssessing, identifying, and managing cybersecurity related risks are also integrated into our enterprise risk management (ERM) program. Cybersecurity related risks are included in the risk universe that the ERM function evaluates to assess top risks to the Company on an annual basis. Risks are discussed with appropriate members of management, who manage risk coverage, monitoring and reporting in the relevant risk function, including our cybersecurity program, and incorporate those activities as part of developing our strategic plan. The ERM program’s annual risk assessment is presented annually to our Board of Directors.\nBased on the information available as of the date of this Annual Report on Form 10-K, we are not aware of any risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, that have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition. Despite our security measures, however, there can be no assurance that we, or the third parties with which we interact, will not experience a cybersecurity incident in the future that may materially affect us.\n For additional information, see"
}