{
  "ticker": "BX",
  "cik": "0001393818",
  "company_name": "Blackstone Inc.",
  "filing_date": "2025-02-28",
  "accession": "0001193125-25-042469",
  "primary_doc": "d912273d10k.htm",
  "item1_text": "Item 1A.\n\n\nRisk Factors \nRisks Related to Our Business \nDifficult market, economic and geopolitical conditions can adversely affect our business in many ways, each of which could materially reduce our revenue, earnings and cash flow and adversely affect our financial prospects and condition. \nOur business is materially affected by financial market and economic conditions and events throughout the world that are outside our control. We may not be able to or may choose not to manage our exposure to these conditions and/or events. Such conditions and/or events can adversely affect our business in many ways, including \n \n22 \nTable of Contents\nreducing the ability of our funds to raise or deploy capital, reducing the value or performance of our funds’ investments and making it more difficult for our funds to exit and realize value from existing investments. This could in turn materially reduce our revenue, earnings and cash flow and adversely affect our financial prospects and condition. In addition, in the face of a difficult market or economic environment, we may need to reduce our fixed costs and other expenses in order to maintain profitability. This may include cutting back or eliminating the use of certain services or service providers, or terminating the employment of a significant number of our personnel that, in each case, could be important to our business and without which our operating results could be adversely affected. A failure to manage or reduce our costs and other expenses within a time frame sufficient to match any decrease in profitability would adversely affect our operating performance. \nTurmoil in the global financial markets can provoke significant volatility of equity and debt securities prices. This can have a material and rapid impact on our \nmark-to-market\n valuations, particularly with respect to our public holdings and credit investments. As publicly traded equity securities have in recent years represented a meaningful proportion of the assets of many of our funds, stock market volatility, including a sharp decline in the stock market, may adversely affect our results, including our revenues and net income. Moreover, our public equity holdings have at times been concentrated in a few large positions, thereby making our unrealized \nmark-to-market\n valuations particularly sensitive to sharp changes in the price of any of these positions. Further, although the equity markets are not the only means by which we exit investments, should we experience a period of challenging equity markets, our funds may experience continued difficulty in realizing value from investments. \nAlthough decelerating, inflation remains above the U.S. Federal Reserve’s target levels. Despite multiple federal fund rate decreases over the course of 2024, interest rates have remained elevated, with the U.S. Federal Reserve indicating in early 2025 an expectation of slower rate decreases moving forward. Periods of elevated inflation and high interest rates, such as that experienced in recent years, can contribute to significant volatility in debt and equity markets and economic deceleration or contraction in the rate of growth in certain industries, sectors or geographies. Economic slowdown may contribute to poor financial results for our funds’ portfolio companies or assets, which may result in lower investment returns for our funds. The valuations of our funds’ real estate assets, and fundraising in certain of our real estate strategies targeting \nhigh-net-worth\n investors, have been adversely impacted by elevated interest rates and a high cost of capital. A \nslower-than-expected\n decrease, or a further increase, in interest rates would continue to present a challenge to real estate valuations. Such factors are even more challenging in the life science office and traditional office market, as well as other properties with \nlong-term\n leases that do not provide for \nshort-term\n rent increases. \nGeopolitical concerns and other global events outside of our control have also contributed and may continue to contribute to volatile global equity and debt markets, particularly as geopolitical instability has in recent years become more prevalent. These concerns and events include, without limitation, trade conflict, civil unrest, threats to national security, and national and international security events (including war, terrorist acts or other hostilities). For example, in the U.S., the current Presidential administration has stated its intention to make governmental policy and regulatory changes in a variety of areas, including the imposition of tariffs or other trade barriers. In that connection, certain countries subject to those changes have expressed an intent to impose similar measures in return. Outside the U.S., ongoing wars in the Middle East and Ukraine, as well as concern as to whether China’s stimulus measures will effectively stabilize slowing economic growth in the country, have further contributed to global economic uncertainty and volatility in the global financial markets. This may adversely impact our performance and the performance of our funds and their respective portfolio companies. \nIn addition, severe public health events, such as those caused by the \nCOVID-19\n pandemic, may occur from time to time, and could directly and indirectly impact us in material respects that we are unable to predict or control, including by threatening our employees’ \nwell-being\n and morale and interrupting business activities. In addition, related factors may materially and adversely affect us, including the effectiveness of governmental responses, the extension, amendment or withdrawal of any government programs or initiatives and the timing and speed of economic recovery. Actions taken in response may contribute to significant volatility in the financial markets, resulting in increased volatility in equity prices, material interest rate changes, supply chain disruptions, such as simultaneous supply and demand shock to global, regional and national economies, and an increase in inflationary pressures. \n \n23 \nTable of Contents\nIn addition to the factors described above, other market, economic and geopolitical factors described herein that may adversely affect our business include, without limitation: \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nhigher prices for commodities or other goods, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\neconomic slowdown or recession in the U.S. and internationally, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nchanges in interest rates and/or a lack of availability of credit in the U.S. and internationally and \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nchanges in law and/or regulation, and uncertainty regarding government and regulatory policy. \nA period of economic slowdown, which may occur across one or more industries, sectors or geographies, creates operating performance challenges for certain of our funds’ investments, which could adversely affect our operating results and cash flows. \nDespite overall resilience in some geographies, many global economies have in recent years experienced periods of deceleration. Further economic deceleration or contraction in the rate of growth in certain industries, sectors or geographies may contribute to poor financial results for our funds’ portfolio companies or assets, which may result in lower investment returns for our funds. For example, periods of economic weakness have contributed and may in the future contribute to a decline in commodity prices and decreased consumer demand for certain goods and services (including energy), and/or volatility in the oil and natural gas markets, each of which would have an adverse effect on our energy and consumer investments. In addition, slowing growth in certain markets and real estate sectors with excess \nnear-term\n supply, such as life sciences office and U.S. multifamily, has negatively impacted and may continue to negatively impact the valuations of assets in such sectors in the \nnear-term.\n A sustained high interest rate environment could increase the likelihood of an economic slowdown. \nIn addition, in recent years elevated inflation globally contributed to heightened costs of labor, energy and materials, which put profit margin pressure on certain of our funds’ portfolio companies and negatively impacted the performance of certain of such companies. While inflation decelerated over 2024, profit margins may be pressured if inflation \nre-accelerates,\n particularly for companies that lack pricing power. In addition, as the governing agreements of our funds contain only limited requirements, if any, regarding diversification of fund investments (by, for example, sector or geographic region), during periods of economic slowdown in certain sectors or regions, the impact on our funds may be exacerbated by concentration of investments in such sectors or regions. Such concentration may increase the risk that events affecting specific sectors, geographic regions or asset types could have an adverse or disparate impact on such funds, as compared to funds that invest more broadly. As a result, our ability to raise new funds, as well as our operating results and cash flows, could be adversely affected. \nMoreover, during periods of weakness, our funds’ portfolio companies may also have difficulty expanding their businesses and operations or meeting their debt service obligations or other expenses as they become due, including expenses payable to us. Furthermore, negative market conditions could potentially result in a portfolio company entering bankruptcy proceedings. This could result in a complete loss of the fund’s investment in such portfolio company and a significant negative impact to the fund’s performance and consequently to our operating results and cash flow, as well as to our reputation. In addition, negative market conditions would also increase the risk of default with respect to investments held by our funds that have significant debt investments, such as our \ncredit-focused\n funds. \n \n24 \nTable of Contents\nHigh interest rates and challenging debt market conditions have negatively impacted and could continue to negatively impact the values of certain assets or investments and the ability of our funds and their portfolio companies to access capital markets, which could adversely affect investment and realization opportunities, lead to lower-yielding investments and potentially decrease our net income. \nAlthough the U.S. Federal Reserve lowered interest rates three times over the course of 2024, it has expressed an expectation that any such decreases would be slower going forward. Accordingly, significant uncertainty remains regarding the timing and extent of future interest rate decreases. Elevated interest rates create downward pressure on the value of certain assets owned by our funds, including, among others, real estate and \nfixed-rate\n debt. A \nslower-than-expected\n decrease, or a further increase in, interest rates would continue to present a challenge for the valuations of such assets, as well as for fundraising in certain of our strategies targeting \nhigh-net-worth\n investors. An increase in interest rates could also contribute to a period of economic slowdown, which would create operating performance challenges for certain of our funds’ investments. Relatedly, opportunities to realize value from certain of our funds’ investments are likely to continue to be more limited if interest rates remain at high levels for an extended period. For example, certain real estate sectors and operating companies could be affected given the potential adverse impact on equity prices and caution on the part of potential acquirers. Further, our funds have faced, and could continue to face, difficulty in realizing value from investments due to sustained declines in equity market values as a result of concerns regarding interest rates. \nIn recent years, high interest rates have increased the cost of debt financing for the transactions our funds pursue. A significant contraction or weakening in the market for debt financing or other adverse change relating to the terms of debt financing (such as, for example, higher equity requirements and/or more restrictive covenants), particularly in the area of acquisition financings for private equity and real estate transactions, could have a material adverse effect on our business. For example, a portion of the indebtedness used to finance certain fund investments often includes \nhigh-yield\n debt securities issued in the capital markets. Availability of capital from the \nhigh-yield\n debt markets is subject to significant volatility, and there may be times when we might not be able to access those markets at attractive rates, or at all, when completing an investment. Further, the financing of acquisitions or the operations of our funds’ portfolio companies with debt may become less attractive due to limitations on the deductibility of corporate interest expense. See “— Changes in U.S. and foreign taxation of businesses and other tax laws, regulations or treaties or an adverse interpretation of these items by tax authorities could adversely affect us, including by adversely impacting our effective tax rate and tax liability.” \nIf our funds were unable to obtain committed debt financing for potential acquisitions, or could only obtain debt financing at an increased interest rate or on unfavorable terms or the ability to deduct corporate interest expense is substantially limited, our funds may face increased competition from strategic buyers of assets who may have an overall lower cost of capital or the ability to benefit from a higher amount of cost savings following an acquisition. In addition, high interest rates, coupled with periods of significant equity and credit market volatility, may potentially make it more difficult for us to find attractive opportunities for our funds to exit and realize value from their existing investments. \nOur funds’ portfolio companies also regularly utilize the corporate debt markets to obtain financing for their operations. To the extent monetary policy, tax or other regulatory changes or difficult credit markets render such financing difficult to obtain, more expensive or otherwise less attractive, this may also negatively impact the financial results of those portfolio companies and, therefore, the investment returns on our funds and our revenues. In addition, to the extent that (a) market conditions, and/or tax or other regulatory changes make it difficult or not possible to refinance debt that is maturing in the near term, or (b) such refinancing would result in a rating agency viewing a portfolio company as having incurred an excessive amount of debt, some of our funds’ portfolio companies may be unable to repay such debt at maturity and may be forced to sell assets, undergo a recapitalization or seek bankruptcy protection. \n \n25 \nTable of Contents\nA decline in the pace or size of investments made by our funds may adversely affect our revenues. \nThe revenues that we earn are driven in part by the pace at which our funds make investments and the size of those investments, and a decline in the pace or the size of such investments may reduce our revenues. In particular, in recent years we have meaningfully increased the number of perpetual capital vehicles we offer and the assets under management in such vehicles. The fees we earn from our perpetual capital vehicles, including our Core+ real estate strategy, represent a significant and growing portion of our overall revenues. If our funds, including our perpetual capital vehicles, are unable to deploy capital at a sufficient pace, our revenues would be adversely impacted. Many factors could cause a decline in the pace of investment, including a market environment characterized by high prices, the inability of our investment professionals to identify attractive investment opportunities, competition for such opportunities among other potential acquirers, decreased availability of financing on attractive terms or at all or decreased availability of investor capital, including as a result of a challenging fundraising environment or heightened investor requests for repurchases in certain vehicles. A number of our funds have invested and intend to continue to invest in large transactions or transactions that otherwise have substantial business, regulatory or legal complexity and may be more difficult to execute successfully than smaller or less complex investments. In addition, realizing value from such investments may be more difficult as a result of, among other things, a limited universe of potential acquirers. \nWe may also fail to consummate identified investment opportunities because of regulatory or legal complexities or uncertainty and adverse developments in the U.S. or global economy, financial markets or geopolitical conditions. Additionally, our ability to deploy capital in certain countries may be adversely impacted by U.S. and foreign government policy changes and regulations. For example, an FTC rule that significantly increases the amount of information required to be provided in a \nHart-Scott-Rodino\n filing became effective in February 2025. The process of obtaining \npre-approval\n for certain transactions undertaken by our investment funds is expected to become more administratively burdensome and time consuming. Any potential time delay associated with obtaining approval may make it more difficult for our funds to deploy capital and exit and realize value from investments. \nFurther, state regulatory agencies may impose restrictions on private funds’ investments in certain types of assets or industries, which could affect our funds’ ability to find attractive and diversified investments and to complete such investments in a timely manner. For example, certain states have, and others may in the future, increase state regulatory review measures of investments by private equity into the \npatient-facing\n healthcare industry, and certain states have considered, and others may seek to enact, legislation to restrict institutional investment in \nsingle-family\n homes. Such laws may impact the ability of our funds to invest in certain assets or sectors. In addition, the ability to deploy capital in China has been adversely impacted by policies and regulations in the U.S., which may be exacerbated prospectively. See “—Laws and regulations on foreign direct investment applicable to us and our funds’ portfolio companies, both within and outside the U.S., may make it more difficult for us to deploy capital in certain jurisdictions or to sell assets to certain buyers.” \nOur revenue, earnings, net income and cash flow can all vary materially due to our reliance on Performance Revenues, which may make it difficult for us to achieve steady earnings growth on a quarterly basis and may cause the price of our common stock to decline. \nOur revenue, earnings, net income and cash flow can all vary materially due to our reliance on Performance Revenues. We may experience fluctuations in our results, including our revenue and net income, from quarter to quarter due to a number of other factors. These include timing of realizations, changes in the valuations of our funds’ investments, changes in the amount of distributions, dividends or interest paid in respect of investments, changes in our operating expenses and the degree to which we encounter competition. Each of these factors may be impacted by economic and market conditions. Achieving steady growth in net income and cash flow on a quarterly basis may be difficult, which could in turn lead to large adverse movements or general increased volatility in the price of our common stock. We do not provide guidance regarding our expected quarterly and annual operating results. The lack of guidance may affect the expectations of public market analysts and could cause increased volatility in our common stock price. \n \n26 \nTable of Contents\n \nFor certain of our perpetual capital vehicles, including certain Core+ real estate funds, infrastructure focused funds, BCRED and other of our perpetual capital vehicles, that have in recent years become increasingly large contributors to our earnings, incentive income is paid to us in varying frequencies, ranging from quarterly to every five years. This contributes to the volatility of our cash flow. Furthermore, we earn this incentive income only if the net asset value of a vehicle has increased or, in the case of certain vehicles, increased beyond a particular return threshold, or if the vehicle has earned a net profit. Certain of these vehicles also have “high water marks” whereby we do not earn incentive income during a particular period even though the vehicle had positive returns in such period as a result of losses in prior periods. If one of these vehicles experiences losses, we will not earn incentive income from it until it surpasses the previous \nhigh-water\n mark. The incentive income we earn is therefore dependent on the net asset value or the net profit of the vehicle, which could lead to significant volatility in our results. \nFor our carry funds, we receive Performance Allocations only when investments are realized and achieve a certain preferred return. This also contributes to the volatility of our cash flow. Performance Allocations depend on our carry funds’ performance and opportunities for realizing gains, which may be limited. It takes a substantial period of time to realize the cash value (or other proceeds) of an investment. Even if an investment proves to be profitable, it may be a number of years before any profits can be realized, particularly if market conditions are unaccommodating. We cannot predict when, or if, any realization of investments will occur. In addition, the valuations of, and realization opportunities for, investments made by our funds, could also be subject to high volatility as a result of uncertainty or potential changes to governmental policy with respect to, among other things, tax, trade, immigration, healthcare, labor, infrastructure and energy. \nPrior to our receiving any Performance Allocations in respect of realization of a profitable investment, 100% of the proceeds of that investment must generally be paid to the investors in that carry fund until they have recovered certain fees and expenses and achieved a certain return on all realized investments by that carry fund as well as a recovery of any unrealized losses. A particular realization event may have a significant impact on our results for that particular quarter that may not be replicated in subsequent quarters. We recognize revenue on investments in our investment funds based on our allocable share of realized and unrealized gains (or losses) reported by such investment funds. A decline in realized or unrealized gains, or an increase in realized or unrealized losses, would adversely affect our revenue and possibly cash flow. This could further increase the volatility of our quarterly results. Because our carry funds have preferred return thresholds to investors that need to be met prior to our receiving any Performance Allocations, substantial declines in the carrying value of the investment portfolios of a carry fund can significantly delay or eliminate any Performance Allocations paid to us in respect of that fund because the value of the assets in the fund would need to recover to their aggregate cost basis plus the preferred return over time before we would be entitled to receive any Performance Allocations from that fund. \nThe timing and receipt of Performance Allocations also varies with the life cycle of our carry funds. During periods in which a relatively large portion of our assets under management is attributable to carry funds and investments in their “harvesting” period, our carry funds would make larger distributions than in the fundraising or investment periods that precede harvesting. During periods in which a significant portion of our assets under management is attributable to carry funds that are not in their harvesting periods, we may receive substantially lower Performance Allocations. \n \n27 \nTable of Contents\nAdverse economic and market conditions may adversely affect the amount of cash generated by our businesses, the value of our principal investments, and in turn, our ability to pay dividends to our stockholders. \nWe primarily use cash to, without limitation (a) provide capital to facilitate the growth of our existing businesses, including funding our general partner and \nco-investment\n commitments to our funds and warehousing investments for our funds, (b) provide capital for business expansion, (c) pay operating expenses, including cash compensation to our employees, and other obligations as they arise, including servicing our debt and (d) pay dividends to our stockholders, make distributions to the holders of Blackstone Holdings Partnership Units and make repurchases under our share repurchase program. Our principal sources of cash are: (a) cash we received in connection with our prior bond offerings and other borrowings, (b) management fees, (c) realized incentive fees and (d) realized performance allocations, which is the sum of Realized Principal Investment Income and Realized Performance Revenues less Realized Performance Compensation. We have also entered into a $4.325 billion revolving credit facility with a final maturity date of December 15, 2028 the (“Revolving Credit Facility”). Our long-term debt totaled $11.3 billion in borrowings from our prior bond issuances. As of December 31, 2024, we had no borrowings outstanding under the Revolving Credit Facility. In February 2025, we drew $900.0 million under the Revolving Credit Facility. As of December 31, 2024, we had $2.0 billion in Cash and Cash Equivalents, $1.1 billion invested in Corporate Treasury Investments and $5.8 billion in Other Investments. \nIf growth of the global economy decelerates, or conditions in the financing markets were challenged, the investment performance of our funds could suffer, resulting in, for example, the payment of decreased or no Performance Allocations to us. This could materially and adversely affect the amount of cash we have on hand, which could in turn require us to rely on other sources of cash, such as the capital markets, which may not be available to us on acceptable terms or at all for the above purposes. A decrease in the amount of cash we have on hand could also materially and adversely affect our ability to pay dividends to our stockholders and make repurchases under our share repurchase program. Furthermore, during adverse economic and market conditions, we might not be able to renew all or part of our existing revolving credit facility or find alternate financing on commercially reasonable terms or at all. As a result, our uses of cash may exceed our sources of cash, thereby potentially affecting our liquidity position. In addition, we have made and expect to continue to make significant principal investments in our current and future investment funds. Contributing capital to these investment funds is risky, and we may lose some or the entire principal amount of our investments, including, without limitation, as a result of poor investment performance in a challenging economic and market environment. \nOur business depends in large part on our ability to raise capital from third-party investors. A failure to raise capital from third-party investors on attractive fee terms or at all, would impact our ability to collect management fees or deploy such capital into investments and potentially collect Performance Revenues, which would materially reduce our revenue and cash flow and adversely affect our financial condition. \nOur ability to raise capital from \nthird-party\n investors depends on a number of factors, such as economic and market conditions (including the level of interest rates and stock market performance) and the asset allocation rules or investment policies to which such \nthird-party\n investors are subject. These factors could inhibit or restrict the ability of \nthird-party\n investors to make investments in our funds or the asset classes in which our funds invest. For example, lawmakers across a number of states, including Pennsylvania and Florida, have put forth proposals or expressed intent to take steps to reduce or minimize the ability of their state pension funds to invest in alternative asset classes, including by proposing to increase the reporting or other obligations applicable to their state pension funds that invest in such asset classes. Such proposals or actions would potentially discourage investment by such state pension funds in alternative asset classes by imposing meaningful compliance burdens and costs on them, which could adversely affect our ability to raise capital from such state pension funds. Other states could potentially take similar actions, which may further impair our access to capital from an investor base that has historically represented a significant portion of our fundraising. \n \n28 \nTable of Contents\nIn addition, volatility in the valuations of investments, has in the past and may in the future affect our ability to raise capital from \nthird-party\n investors. To the extent periods of volatility are coupled with a lack of realizations from investors’ existing portfolios, such investors may be left with disproportionately outsized remaining commitments to a number of investment funds. This significantly limits such investors’ ability to make new commitments to \nthird-party\n managed investment funds such as those managed by us. Further, during periods of market volatility, investor subscription requests may be reduced and investor redemption or repurchase requests may be elevated in products that permit redemption or repurchase of investor interests. See “—Investors in a number of our vehicles may withdraw their investments, and investors in certain of our vehicles may have a right to terminate our management of, or cause the dissolution of, such vehicles, which would lead to a decrease in our revenues.” In addition, certain of our investment vehicles that are available to individual investors are subject to state registration requirements that impose limits on the proportion of such investors’ net worth that can be invested in our products. These restrictions may limit such investors’ ability or willingness to allocate capital to such products and adversely affect our fundraising in the retail channel. \nOur ability to raise new funds could similarly be hampered if the general appeal of alternative investments were to decline. An investment in a limited partner interest in an alternative investment fund is generally more illiquid and the returns on such investment may be more volatile than an investment in securities for which there is a more active and transparent market. In periods of positive markets and low volatility, for example, investors may favor passive investment strategies such as index funds over our actively managed investment vehicles. Similarly, during periods of high interest rates, investors may favor investments that are generally viewed as producing a \nrisk-free\n return, such as treasury bonds, over investments in our products, particularly if the spread between the products declines. Alternative investments could also fall into disfavor as a result of concerns about liquidity and \nshort-term\n performance. Such concerns could be exhibited, in particular, by public pension funds, which have historically been among the largest investors in alternative assets. Many public pension funds are significantly underfunded and their funding problems have been, and may in the future be, exacerbated by economic downturn. Concerns with liquidity could cause such public pension funds to reevaluate the appropriateness of alternative investments. In addition, our ability to raise capital from third parties outside of the United States could be limited to the extent the other countries impose restrictions or limitations on outbound foreign investment. \nMoreover, certain institutional investors are demonstrating a preference to \nin-source\n their own investment professionals and to make direct investments in alternative assets without the assistance of alternative asset advisers like us. Such institutional investors may become our competitors and could cease to be our clients. As some existing investors cease or significantly curtail making commitments to alternative investment funds, we may need to identify and attract new investors in order to maintain or increase the size of our investment funds. We may be unable to find or secure commitments from those new investors or that the fee terms of the commitments from such new investors will be consistent with the fees historically paid to us by our investors. If economic conditions were to deteriorate or if we are unable to find new investors, we might raise less than our desired amount for a given fund. Further, as we seek to expand into other asset classes, we may be unable to raise a sufficient amount of capital to adequately support such businesses. A failure to successfully raise capital could materially reduce our revenue and cash flow and adversely affect our financial condition. \nIn connection with raising new funds or making further investments in existing funds, we negotiate terms for such funds and investments with existing and potential investors. The outcome of such negotiations could result in our agreement to terms that are materially less favorable to us than for prior funds we have managed or funds managed by our competitors, including with respect to management fees, incentive fees and/or carried interest, which could have an adverse impact on our revenues. Such terms could also restrict our ability to raise investment funds with investment objectives or strategies that compete with existing funds, add additional expenses and obligations for us in managing the fund or increase our potential liabilities, all of which could ultimately reduce our revenues. In addition, certain institutional investors, including sovereign wealth funds and public pension funds, have demonstrated an increased preference for alternatives to the traditional investment fund structure, such as managed accounts, smaller funds and \nco-investment\n vehicles. There can be no assurance that such alternatives will be as profitable for us as the traditional investment fund structure, or as to the impact such a trend could have on the cost of our operations or profitability if we were to implement these alternative investment structures. \n \n29 \nTable of Contents\nAlthough we have no obligation to modify any of our fees with respect to our existing funds, we may experience pressure to do so in our funds, including in response to regulatory focus by the SEC on the quantum and types of fees and expenses charged by private funds. We have confronted and expect to continue to confront requests from a variety of investors and groups representing investors to decrease fees, which could result in a reduction in the fees and Performance Revenues we earn. \nThe asset management business is intensely competitive. \nThe asset management business is intensely competitive. Competition is based on a variety of factors, including investment performance, the quality of client service, investor availability of capital and willingness to invest, fund terms (including fees and liquidity terms), brand recognition and business reputation. Our asset management business competes with a number of private funds, specialized investment funds, funds structured for individual investors, hedge funds, funds of hedge funds and other sponsors managing pools of capital, as well as corporate buyers, traditional asset managers, commercial banks, investment banks and other financial institutions (including sovereign wealth funds). We expect that competition will continue to increase. For example, certain traditional asset managers have developed their own private equity and private wealth platforms and are marketing other asset allocation strategies as alternatives to hedge fund investments. A number of factors serve to increase our competitive risks: \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\na number of our competitors have greater financial, technical, research, marketing and other resources and more personnel than we do, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nsome of our funds may not perform as well as competitors’ funds or other available investment products, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nseveral of our competitors have significant amounts of capital, and many of them have similar investment objectives to ours, which may create additional competition for investment opportunities and may reduce the size and duration of pricing inefficiencies that many alternative investment strategies seek to exploit, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nsome of our competitors, particularly strategic competitors, may have a lower cost of capital, which may be exacerbated by limits on the deductibility of interest expense, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nsome of our competitors may have access to funding sources that are not available to us, which may create competitive disadvantages for us with respect to investment opportunities, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nsome of our competitors may be subject to less regulation and accordingly may have more flexibility to undertake and execute certain businesses or investments than we can and/or bear less compliance cost than we do, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nsome of our competitors may have more flexibility than us in raising certain types of investment funds under the investment management contracts they have negotiated with their investors, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nsome of our competitors may have higher risk tolerances, different risk assessments or lower return thresholds, which could allow them to consider a wider variety of investments and to bid more aggressively than us for investments that we want to make or to seek exit opportunities through different channels, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nsome of our competitors may be more successful than we are in the development of new or customized products to address investor demand for new or different investment strategies and/or regulatory changes, including with respect to private credit products and products that are developed for individual investors or that target insurance capital, \n \n30 \nTable of Contents\n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nin order to broaden distribution of their private wealth products, some of our competitors may be willing to pay higher placement, servicing or other forms of distributor fees, which may adversely impact the amount of capital we are able to raise in the private wealth channel, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nthere are relatively few barriers to entry impeding new alternative asset managers, and the successful efforts of new entrants, including former “star” portfolio managers at large diversified financial institutions as well as such institutions themselves, is expected to continue to result in increased competition, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nsome of our competitors may have better expertise or be regarded by investors as having better expertise in a specific asset class or geographic region than we do, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\ncorporate buyers may be able to achieve synergistic cost savings in respect of an investment, which may provide them with a competitive advantage relative to us when bidding for an investment, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nsome investors may prefer to invest with an investment manager that is not publicly traded or is smaller, with a more limited number of investment products and \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nother industry participants will from time to time seek to recruit our investment professionals and other employees away from us. \nAdditionally, technological innovation, including the use of artificial intelligence, has the potential to disrupt the financial industry and change the way financial institutions, including asset managers, do business. Some of our competitors may be more successful than we are in the development and implementation of new technologies, including services and platforms based on artificial intelligence, to address investor demand or improve operations. If we are unable to adequately advance our capabilities in these areas, or do so at a slower pace than others in our industry, we may be at a competitive disadvantage. \nWe may lose investment opportunities if we do not match investment prices, structures and terms offered by competitors. Alternatively, we may experience decreased rates of return and increased risks of loss if we match investment prices, structures and terms offered by competitors. Moreover, if we are forced to compete with other alternative asset managers on the basis of price, we may not be able to maintain our current fund fee and carried interest terms. We have historically competed primarily on the performance of our funds, and not on the level of our fees or carried interest relative to those of our competitors. However, there is a risk that fees and carried interest in the alternative investment management industry will decline, without regard to the historical performance of a manager. Further, as part of a shift in the distribution arrangements in the private wealth industry, certain \nthird-party\n intermediaries have sought to revise existing or implement new fee arrangements that align their fees with the initial amount or ongoing net asset value of capital invested through the intermediary in the applicable vehicle. While the extent of this shift going forward is uncertain, the costs associated with the distribution of certain of our private wealth perpetual products have increased and there may be further increases in distribution costs for these and future products. The reduction of net management fees or performance allocations we receive, including as a result of new fee arrangements, or the incurrence of higher costs in connection with product distribution, without corresponding decreases in our cost structure, would adversely affect the profitability of impacted products. Certain of the \nthird-party\n intermediaries on whom we rely to distribute our investment products also sell their own competing proprietary investment products, which could limit the distribution of our products. \nIn addition, the attractiveness of our investment funds relative to investments in other investment products could decrease depending on economic conditions. Furthermore, any new or incremental regulatory measures for the U.S. financial services industry may increase costs and create regulatory uncertainty and additional competition for many of our funds. Conversely, regulatory measures aimed at reducing burden on U.S. banks, such as less onerous bank regulatory capital requirements, may create additional competition for certain of our credit strategies. See “—Financial regulatory changes in the United States could adversely affect our business.” \n \n31 \nTable of Contents\n \nThese competitive pressures could adversely affect our ability to make successful investments and limit our ability to raise future investment funds, either of which would adversely impact our business, revenue, results of operations and cash flow. \nWe have increasingly undertaken business initiatives to increase the number and type of investment products we offer to individual investors, which could expose us to new and greater levels of risk. \nAlthough individual investors have been part of our historic distribution efforts, we have increasingly undertaken business initiatives to increase the number and type of investment products we offer to \nhigh-net-worth\n individuals, family offices and mass affluent investors in the U.S. and other jurisdictions around the world. Specifically, we create investment products designed for investment by individual investors in the U.S., some of whom are not accredited investors, or similar investors in \nnon-U.S.\n jurisdictions, including in some markets in Europe and Asia Pacific. In some cases, our funds are distributed to such investors indirectly through \nthird-party\n managed vehicles sponsored by brokerage firms, private banks or \nthird-party\n feeder providers, and in other cases directly to the clients of private banks, independent investment advisors and brokers. \nAccessing individual investors and offering products directed at such investors exposes us to greater levels of risk, including heightened litigation and regulatory enforcement, an increased compliance burden, and more complex administration and accounting operations. We may be subject to claims related to matters such as the adequacy of disclosures, appropriateness of fees, suitability and board of directors’ oversight, each of which could result in civil lawsuits, regulatory penalties and enforcement actions. Our registered investment advisers could also be subject to direct or derivative claims from a fund’s investors or board of directors for alleged mismanagement of the fund. In addition, regulatory requirements imposing limitations on the ability of affiliates of certain of our vehicles to engage in certain transactions may limit our funds’ ability to engage in otherwise attractive investment opportunities. \nTo the extent distribution of such products is through new channels and markets, including through an increasing number of distributors with whom we engage, we may not be able to effectively monitor or control the manner of their distribution. This could result in litigation or regulatory action against us, including with respect to, among other things, claims that products distributed through such channels are distributed to investors for whom they are unsuitable, claims related to conflicts of interest or the adequacy of disclosure to investors or claims that the products are distributed in a manner inconsistent with our regulatory requirements or otherwise inappropriate manner. In addition, regulation applicable to our arrangements with such distributors and channels increases the compliance burden associated with onboarding new distributors or pursuing new distribution channels, resulting in increased cost and complexity. Although we engage in due diligence and onboarding procedures that seek to uncover issues relating to the \nthird-party\n channels through which individual investors access our investment products, we do not control and have limited information regarding many of these third-party channels. Therefore, we are exposed to the risks of reputational damage, regulatory scrutiny and legal liability to the extent such third parties improperly sell our products to investors. This risk is heightened by the continuing increase in the number of third parties through whom we distribute our investment products around the world and who we do not control. For example, in certain cases, we may be viewed by a regulator as responsible for the content of materials prepared by third parties. \nSimilarly, there is a risk that Blackstone employees involved in the direct distribution of our products, or employees who engage with independent advisors, brokerage firms and other third parties around the world involved in distributing our products, do not follow our compliance and supervisory procedures. In addition, the distribution of such products, including through new channels whether directly or through market intermediaries, could expose us to allegations of improper conduct and/or actions by state and federal regulators in the U.S. and regulators in jurisdictions outside of the United States. Such allegations or actions may be with respect to, among other things, product suitability, distributor eligibility, investor classification, compliance with securities laws, conflicts of interest and the adequacy of disclosure to investors to whom our products are distributed through those channels. \n \n32 \nTable of Contents\nAs we expand the distribution of products to individual investors outside of the United States, we are increasingly exposed to risks in \nnon-U.S.\n jurisdictions. In addition to risks similar to those that we face in the U.S., securities laws and other applicable regulatory regimes can be extensive, complex and vary by jurisdiction. In addition, the distribution of products to individual investors outside of the U.S. may involve complex structures (such as \ndistributor-sponsored\n feeder funds or nominee/omnibus investors) and market practices that vary by local jurisdiction. As a result, this expansion subjects us to additional complexity, litigation and regulatory risk. \nOur efforts to continue to grow the assets we manage on behalf of individual investors may not be successful. Furthermore, our initiatives to expand our individual investor base, including outside of the United States, requires the investment of significant time, effort and resources, including the potential hiring of additional personnel, the implementation of new operational, compliance and other systems and processes and the development or implementation of new technology. In addition, as the distribution of products to individual investors continues to grow across the alternative asset management industry, regulators may seek to impose new regulatory oversight, disclosure and other requirements that make such distribution more difficult or resource intensive. \nWe depend on our \nco-founder\n and other key senior managing directors and personnel, and the loss of their services would have a material adverse effect on our business, results and financial condition. \nWe depend on the efforts, skill, reputations and business contacts of our \nco-founder,\n Stephen A. Schwarzman, our President, Jonathan D. Gray, and other key senior managing directors and personnel, the information and deal flow they generate during the normal course of their activities and the synergies among the diverse fields of expertise and knowledge held by our professionals. Accordingly, our success will depend on the continued service of these individuals, who are not obligated to remain employed with us. Several key personnel have left the firm in the past and others may do so in the future, and we cannot predict the impact that the departure of any key personnel will have on our ability to achieve our investment objectives. For example, the governing agreements of many of our funds generally provide investors with the ability to terminate the investment period in the event that certain “key persons” in the fund do not meet the specified time commitment to the fund or our firm ceases to control the general partner. The loss of the services of any key personnel could have a material adverse effect on our revenues, net income and cash flows and could harm our ability to maintain or grow assets under management in existing funds or raise additional funds in the future. Our senior managing directors and other key personnel possess substantial experience and expertise and have strong business relationships with our investors and other members of the business community. As a result, the loss of these personnel could jeopardize our relationships with such parties and result in the reduction of assets under management or fewer investment opportunities. \nWe have historically relied in part on the interests of these professionals in the investment funds’ carried interest and incentive fees to discourage them from leaving the firm. However, to the extent our investment funds perform poorly, thereby reducing the potential for carried interest and incentive fees, their interests in carried interest and incentive fees become less valuable to them and become less effective as incentives for them to continue to be employed at Blackstone. We might not be able to provide future key personnel with interests in our business to the same extent or with the same tax consequences from which our existing personnel previously benefited. For example, U.S. federal income tax law currently imposes a \nthree-year\n holding period requirement for carried interest to be treated as \nlong-term\n capital gains. The holding period requirement may result in some of the carried interest received by such individuals being treated as ordinary income, which would materially increase the amount of taxes that such key personnel would be required to pay. The tax treatment of carried interest continues to be an area of focus for policymakers and government officials. The current U.S. Presidential administration’s stated tax priorities include changes to the tax treatment of carried interest that, if implemented, would materially increase the amount of taxes many of our key personnel would be required to pay. The levying of additional taxes on carried interest, or possible increase in state law tax rates, along with changing opinions regarding living in some geographies where we have offices, may adversely affect our ability to recruit, retain and motivate our current and future professionals. \n \n33 \nTable of Contents\nThere is no guarantee that the \nnon-competition\n and \nnon-solicitation\n agreements to which our senior managing directors and other key personnel are subject, together with our other arrangements with them, will prevent them from leaving, joining our competitors or otherwise competing with us. Such agreements also expire after a certain period of time, at which point such personnel would be free to compete against us and solicit our clients and employees. In addition, such agreements may not be enforceable in all cases, particularly as U.S. states and/or federal agencies enact legislation or adopt rules aimed at effectively prohibiting \nnon-competition\n agreements. For example, the U.S. Federal Trade Commission (the “FTC”) approved a rule in 2024 that generally prohibits \npost-employment\n \nnon-competition\n provisions in agreements between employers and their employees. While this rule is currently unenforceable due to ongoing litigation, we cannot predict with certainty whether such rules will ultimately be overturned or if a court will enforce any particular \nnon-competition\n agreement to which our senior managing directors or other key personal are subject if challenged. Further, legislation that would prohibit \npost-employment\n \nnon-competition\n agreements except in limited circumstances has been introduced in New York. \nWe strive to maintain a work environment that reinforces our culture of collaboration, motivation and alignment of interests with investors. If we do not continue to develop and implement the right processes and tools to maintain this culture, particularly in light of rapid and significant growth in our scale, global presence and employee population, our ability to compete successfully and achieve our business objectives could be impaired, which could negatively impact our business, financial condition and results of operations. \nChanges in U.S. and foreign taxation of businesses and other tax laws, regulations or treaties or an adverse interpretation of these items by tax authorities could adversely affect us, including by adversely impacting our effective tax rate and tax liability. \nOur effective tax rate and tax liability is based on the application of current income tax laws, regulations and treaties. These laws, regulations and treaties are complex, and the manner which they apply to us and our funds is sometimes open to interpretation. Significant management judgment is required in determining our provision for income taxes, our deferred tax assets and liabilities and any valuation allowance recorded against our net deferred tax assets. Although management believes its application of current laws, regulations and treaties to be correct and sustainable upon examination by tax authorities, tax authorities have challenged and could challenge in the future our interpretation of such laws, regulations and treaties or our taking of certain tax positions on the basis of such interpretation. This could result in penalties, interest payments and/or additional tax liability or adjustment to our income tax provision that could increase our effective tax rate. \nPast and future changes to tax laws and regulations may have an adverse impact on us. Such changes could materially change the amount and/or timing of tax we and our portfolio companies may be required to pay and may increase \ntax-related\n regulatory and compliance costs. Both the current U.S. Presidential administration and certain members of the U.S. Congress have stated that one of their top legislative priorities is significant reform of the Internal Revenue Code and other federal tax laws. Among other things, they may pursue tax policies seeking to alter the income tax rates and brackets applicable to corporations and individuals (including changing the tax treatment of carried interest), exempt certain types of income from taxation, eliminate clean energy subsidies enacted by the Inflation Reduction Act of 2022 and provide tax incentives for domestic production. The timing and details of any such tax reform, and the impact on us, our personnel, and our funds’ portfolio companies is uncertain. \nIn addition, the U.S. Congress, the Organization for Economic \nCo-operation\n and Development (“OECD”) and other government agencies in jurisdictions in which we and our affiliates invest or do business have maintained a focus on issues related to the taxation of multinational companies. The OECD, which represents a coalition of member countries, has sought to make changes to numerous \nlong-standing\n tax principles through its base erosion and profit shifting (“BEPS”) project, which is focused on a number of issues, including the shifting of profits between affiliated entities in different tax jurisdictions, interest deductibility and eligibility for the benefits of double tax treaties. Several of the measures are potentially relevant to some of our structures and could have an \n \n34 \nTable of Contents\nadverse tax impact on our funds, investors and/or our funds’ portfolio companies. Some member countries have been moving forward on the BEPS agenda but, because timing of implementation and the specific measures adopted will vary among participating member countries, uncertainty remains regarding the impact of BEPS. Such measures could result in a loss of tax treaty benefits and increased taxes on returns from our investments. \nThe OECD is also working on a \ntwo-pillar\n initiative, which is aimed at (a) shifting taxing rights to the jurisdiction of the consumer (“Pillar One”) and (b) ensuring all companies pay a global minimum tax (“Pillar Two”). Under Pillar Two, certain entities within a multinational group will be subject to \ntop-up\n taxes where the overall tax paid on the group’s profit in any jurisdiction falls below the minimum 15% effective tax rate. The EU, among other regions implementing or intending to implement these rules, adopted Pillar Two and required that all EU member states adopt local legislation to implement such rules beginning December 31, 2023. However, the United States is not expected to adopt Pillar Two, creating additional uncertainty as to the application of these rules to multinational enterprises with a U.S. parent entity. Pillar One and Pillar Two could result in increased effective tax rates, possible denial of deductions, withholding taxes and/or profits being allocated differently and increased complexity, burden and cost of tax compliance for us and our funds’ portfolio companies. Given the ongoing design, implementation, administration and interpretation of Pillar One and Pillar Two, the timing, scope and impact of any relevant domestic legislation or multilateral conventions remain uncertain. \nCybersecurity and data protection risks could result in the loss of data, interruptions in our business, and damage to our reputation, and subject us to regulatory actions, increased costs and financial losses, each of which could have a material adverse effect on our business and results of operations. \nOur operations are highly dependent on our technology platforms and we rely heavily on our analytical, financial, accounting, communications and other data processing systems. Our systems face ongoing cybersecurity threats and attacks, which could result in the loss of confidentiality, integrity or availability of such systems and the data held by such systems. Attacks on our systems could involve, and in some instances have in the past involved, attempts intended to obtain unauthorized access to our proprietary information, destroy data or disable, degrade or sabotage our systems, or divert or otherwise steal funds, including through the introduction of computer viruses, “phishing” attempts and other forms of social engineering. Attacks on our systems could also involve ransomware or other forms of cyber extortion. Cyberattacks and other data security threats could originate from a wide variety of external sources, including cyber criminals, nation state hackers, hacktivists and other outside parties. Cyberattacks and other security threats could also originate from the malicious or accidental acts of insiders, such as employees, consultants, independent contractors or other service providers. \nThere has been an increase in the frequency and sophistication of the cyber and data security threats we face, with attacks ranging from those common to businesses generally to those that are more advanced and persistent. Such attacks may target us because, as an alternative asset management firm, we hold a significant amount of confidential and sensitive information about our investors, our funds’ portfolio companies and potential investments. As a result, we may face a heightened risk of a security breach or disruption with respect to this information. Measures we take to ensure the integrity of our systems may not provide adequate protection, especially because cyberattack techniques are continually evolving, may persist undetected over extended periods of time, and may not be mitigated in a timely manner to prevent or minimize the impact of an attack on Blackstone, our investors, our portfolio companies or potential investments. If our systems or those of \nthird-party\n service providers are compromised either as a result of malicious activity or through inadvertent transmittal or other loss of data, do not operate properly or are disabled, or we fail to provide the appropriate regulatory or other notifications in a timely manner, we could suffer financial loss, increased costs, a disruption of our businesses, liability to our counterparties, investment funds or fund investors, regulatory intervention or reputational damage. The costs related to cyber or other data security threats or disruptions may not be fully insured or indemnified by other means. \n \n35 \nTable of Contents\nIn addition, we could also suffer losses in connection with updates to, or the failure to timely update, the technology platforms on which we rely. We are reliant on \nthird-party\n service providers for certain aspects of our business, including for the administration of certain funds, as well as for certain technology platforms, including \ncloud-based\n services. These \nthird-party\n service providers also face ongoing cybersecurity threats and compromises of their systems. These cybersecurity threats and compromises could occur as a result of threat actors impersonating Blackstone or its employees, including through the use of artificial intelligence technologies. Such technologies could make such impersonation more likely to occur or appear more credible. As a result, unauthorized individuals could gain, and in some past instances have gained, access to certain confidential data. \nCybersecurity, privacy and data protection have become top priorities for regulators around the world. Many jurisdictions in which we operate have laws and regulations relating to privacy, data protection and cybersecurity, including, as examples, the General Data Protection Regulation (“GDPR”) in the European Union, the U.K. Data Protection Act, and the California Privacy Rights Act (“CPRA”). Some jurisdictions have also enacted or proposed laws requiring companies to notify individuals and government agencies of data security breaches involving certain types of personal data. For example, in February 2022, the SEC proposed rules regarding registered investment advisers’ and funds’ cybersecurity risk management requiring the adoption and implementation of cybersecurity policies and procedures, enhanced disclosure in regulatory filings and prompt reporting of incidents to the SEC. if adopted, such rules could increase our compliance costs and potential regulatory liability related to cybersecurity. In light of the focus of federal regulators on cybersecurity, SEC enforcement activity, including by the SEC’s Office of Compliance Inspections and Examinations in its examination programs, has increased in recent years and may increase further. Although we maintain cybersecurity controls designed to prevent cyber incidents from occurring, no security is impenetrable to cyberattacks. It is possible that current and future cyber enforcement activity will target practices that we believe are compliant, but the SEC deems otherwise. See “—Rapidly developing and changing privacy, data protection and cybersecurity laws and regulations could further increase compliance costs and subject us to enforcement risks and reputational damage”. \nBreaches in our security or in the security of \nthird-party\n service providers, whether malicious in nature or through inadvertent transmittal or other loss of data, could potentially jeopardize our, our employees’ or our fund investors’ or counterparties’ confidential, proprietary and other information processed and stored in, and transmitted through, our computer systems and networks. Breaches could also potentially cause interruptions or malfunctions in our, our employees’, our fund investors’, our counterparties’ or third parties’ business and operations, which could result in significant financial losses, increased costs, liability to our fund investors and other counterparties, regulatory intervention and reputational damage. Furthermore, if we fail to comply with the relevant laws and regulations or fail to provide the appropriate regulatory or other notifications of breach in a timely matter, it could result in regulatory investigations and penalties, which could lead to negative publicity and reputational harm and may cause our fund investors and clients to lose confidence in the effectiveness of our security measures and Blackstone more generally. \nOur funds’ portfolio companies also rely on data processing systems and the secure processing, storage and transmission of information, including payment and health information, which in some instances are provided by third parties. A disruption or compromise of these systems could have a material adverse effect on the value of these businesses. Our funds may invest in strategic assets having a national or regional profile or in infrastructure, the nature of which could expose them to a greater risk of being subject to a terrorist attack or a security breach than other assets or businesses. Such an event may have material adverse consequences on our investment or assets of the same type or may require portfolio companies to increase preventative security measures or expand insurance coverage. \nOur and our funds’ portfolio companies’ technology platforms, data and intellectual property are also subject to a heightened risk of theft or compromise to the extent we or our funds’ portfolio companies engage in operations outside the United States, in particular in those jurisdictions that do not have comparable levels of protection of proprietary information and assets such as intellectual property, trademarks, trade secrets, \nknow-\n \n36 \nTable of Contents\n \nhow and customer information and records. In addition, we and our funds’ portfolio companies may be required to compromise protections or forego rights to technology, data and intellectual property in order to operate in or access markets in a foreign jurisdiction. Any such direct or indirect compromise of these assets could have a material adverse impact on us and our funds’ portfolio companies. \nRapidly developing and changing global data security and privacy laws and regulations could increase compliance costs and subject us to enforcement risks and reputational damage. \nWe and our funds’ portfolio companies are subject to various risks and costs associated with the collection, storage, transmission and other processing of personal data. This personal data is wide ranging and relates to our investors, employees, contractors and other counterparties and third parties. Any inability, or perceived inability, by us to adequately address privacy concerns, or comply with applicable privacy laws, regulations, policies, industry standards, or related contractual obligations, even if unfounded, could result in regulatory and \nthird-party\n liability, increased costs, disruptions to business and operations, and reputational damage. Furthermore, any such inability or perceived inability of our funds’ portfolio companies, even if unfounded, could result in reputational damage to us. \nData security and privacy compliance obligations to which we are subject impose compliance costs on us, which could increase significantly as laws and regulations evolve globally. Our compliance obligations include those relating to U.S. laws and regulations, including, without limitation, state regulations such as the CPRA, which provides for enhanced consumer protections for California residents, a private right of action for data breaches and statutory fines and damages for data breaches or other California Consumer Privacy Act (“CCPA”) violations, as well as a requirement of “reasonable” cybersecurity. At the U.S. federal level, the SEC has adopted amendments to Regulation \nS-P\n that will take effect in 2025. These amendments impose operationally challenging notification requirements and deadlines and obligations to implement written policies and procedures to govern oversight of service providers that will likely increase associated compliance costs. \nOur compliance obligations also include those relating to foreign data collection and privacy laws, including, for example, the GDPR and U.K. Data Protection Act, as well as laws in many other jurisdictions globally, including Switzerland, Japan, Hong Kong, Singapore, India, China, Australia, Canada and Brazil. Global laws in this area are rapidly increasing in the scale and depth of their requirements, and are also often \nextra-territorial\n in nature. In addition, a wide range of regulators and private actors are seeking to enforce these laws across regions and borders. Furthermore, we frequently have privacy compliance requirements as a result of our contractual obligations with counterparties. These legal, regulatory and contractual obligations heighten our data protection and privacy obligations in the ordinary course of conducting our business in the U.S. and internationally. \nAny inability, or perceived inability, by us or our funds’ portfolio companies to adequately address data protection or privacy concerns, or comply with applicable laws, regulations, policies, industry standards and guidance, contractual obligations, or other legal obligations, even if unfounded, could result in significant legal, regulatory and \nthird-party\n liability, increased costs, disruption of our and our funds’ portfolio companies’ business and operations, and a loss of client (including investor) confidence and other reputational damage. Many regulators have indicated an intention to take more aggressive enforcement actions regarding data privacy matters, and private litigation resulting from such matters is increasing and resulting in progressively larger judgments and settlements. Specifically, the SEC’s stated examination priorities include an intended focus on adviser’s policies and procedures, internal controls, oversight of \nthird-party\n vendors and governance practices as it pertains to the safeguarding of customer records. Furthermore, as new data protection and \nprivacy-related\n laws and regulations are implemented, the time and resources needed for us and our funds’ portfolio companies to comply with such laws and regulations continues to increase and become a significant compliance workstream. \n \n37 \nTable of Contents\nTechnological developments in artificial intelligence could disrupt the markets in which we operate and subject us to increased competition, legal and regulatory risks and compliance costs. \nTechnological developments in artificial intelligence, including machine learning technology and generative artificial intelligence (collectively, “AI Technologies”) and their current and potential future applications, including in the private investment and financial sectors, as well as the legal and regulatory frameworks within which they operate, are rapidly evolving. The full extent of current or future risks related thereto is not possible to predict and we may not be able to anticipate, prevent, mitigate or remediate all of the potential risks, challenges or impacts of such changes. AI Technologies could significantly disrupt the business models, investment strategies, operational processes, and markets in which we operate and subject us to increased competition, legal and regulatory risks and compliance costs, which could have a material adverse effect on our business, financial condition and results of operations. Advancements in computing and AI Technologies, including efficiency improvements, without related increases in the adoption and development of such technologies, could also negatively impact demand for, and the valuation of, digital infrastructure assets, a sector to which certain of our investment strategies have significant exposure. \nThrough our use of AI technologies, we avail ourselves of the potential benefits, insights and efficiencies resulting from these technologies. For example, our employees can utilize internal generative \nAI-powered\n applications to help summarize, search or translate documents or gather information on a wide variety of topics. However, these technologies also present a number of potential risks that cannot be fully mitigated. If the data we, or third parties whose services we rely on, use in connection with the possible development or deployment of AI Technologies is incomplete, inadequate or biased in some way, the performance of our products, services, and businesses could suffer. Data in models that AI Technologies utilize are likely to contain a degree of inaccuracy and error, which could result in flawed algorithms. This could reduce the effectiveness of AI Technologies and adversely impact us and our operations to the extent we rely on the work product of such AI Technologies in such operations. The volume and reliance on data and algorithms also make AI Technologies, and in turn us and our portfolio companies and investments, more susceptible to cybersecurity threats, including the compromise of underlying models, training data, or other intellectual property. We, our funds, our portfolio companies and our funds’ investments could be exposed to risks to the extent \nthird-party\n service providers, or any counterparties use AI Technologies in their business activities. There is also a risk that AI Technologies may be misused or misappropriated by our employees and/or third parties engaged by us. For example, a user may input confidential information, including material \nnon-public\n information or personal identifiable information, into AI Technology applications, resulting in such information becoming part of a dataset that is accessible by \nthird-party\n AI Technology applications and users, including our competitors. Such actions could subject us to legal and regulatory investigations and/or actions. In addition, we may not be able to control how \nthird-party\n AI Technologies that we choose to use are developed or maintained, or how data we input is used or disclosed, even where we have sought contractual protections with respect to these matters. We may be subject to legal and regulatory investigations and/or actions related to our use of AI Technologies, including as related to alleged misuse or misappropriation of our data. This could also have an adverse impact on our reputation. We may also communicate externally regarding AI \nTechnology-related\n initiatives, including our development and use of AI Technologies, which subjects us to the risk of being accused of making inaccurate or misleading statements regarding our ability to avail ourselves of the potential benefits of AI Technology. \nRegulations related to AI Technologies may also impose on us certain obligations and costs related to monitoring and compliance. For example, in April 2023, the Federal Trade Commission, U.S. Department of Justice, Consumer Financial Protection Bureau, and U.S. Equal Employment Opportunity Commission released a joint statement on artificial intelligence demonstrating interest in monitoring the development and use of automated systems and enforcement of their respective laws and regulations. In October 2023, an executive order established new standards for AI safety and security. In addition to the U.S. regulatory framework, in 2024, the EU adopted the Artificial Intelligence Act in 2024, which applies to certain AI Technologies and the data used to train, test and deploy them, which may create additional compliance burdens, higher administrative costs and significant penalties should we fail to comply. \n \n38 \nTable of Contents\nExtensive regulation of our businesses affects our activities and creates the potential for significant liabilities and penalties. The possibility of increased regulatory focus could result in additional burdens on our business. \nOur business is subject to extensive regulation, including periodic examinations, inquiries and investigations, by governmental agencies and \nself-regulatory\n organizations in the jurisdictions in which we operate around the world. These authorities have regulatory powers dealing with many aspects of financial services, including the authority to grant, and in specific circumstances to cancel, permissions to carry on particular activities. Many of these regulators, including U.S. and foreign government agencies and \nself-regulatory\n organizations, as well as state securities commissions in the United States, are also empowered to conduct examinations, inquiries, investigations and administrative proceedings that can result in fines, suspensions of personnel, changes in policies, procedures or disclosure or other sanctions, including censure, the issuance of \ncease-and-desist\n orders, the suspension or expulsion of a \nbroker-dealer\n or investment adviser from registration or memberships or the commencement of a civil or criminal lawsuit against us or our personnel. \nThe financial services industry in recent years has been the subject of heightened scrutiny, and the SEC has specifically focused on private equity and the private funds industry. In that connection, in recent years the SEC’s stated examination priorities and published observations from examinations have included, among other things, private equity firms’ collection of fees and allocation of expenses, their marketing and valuation practices, allocation of investment opportunities, investor side letter terms, consistency of firms’ practices with disclosures, handling of material \nnon-public\n information and insider trading, disclosures of investment risk, conflicts of interest, adherence to notice, consent and other contractual requirements regarding limited partnership advisory committees, fiduciary standards of conduct, financial technologies, and compliance with the SEC’s recently adopted rules, including those referenced herein. \nIn recent years, the SEC has proposed, and in some instances, adopted, a number of rules related to private funds and private fund advisors that impact our business and operations. For example, the SEC (in May 2023) and the SEC and CFTC jointly (in February 2024) adopted changes to Form PF, a confidential form relating to reporting by private fund advisers and intended to be used by the Financial Stability Oversight Counsel (“FSOC”) for systemic risk oversight purposes, that expand existing reporting obligations. Such increased obligations may increase our costs, including if we are required to spend more time, hire additional personnel, or buy new technology to comply effectively. \nThe SEC has also proposed several other rules that may impact our operations. For example, an October 2022 SEC proposal would, if adopted, impose substantial obligations on registered investment advisers to conduct initial due diligence and ongoing monitoring of a broad universe of service providers that we may use in our investment advisory business. If adopted, these new rules could significantly increase compliance burdens and associated regulatory costs and complexity for us and enhance the risk of regulatory action, which could adversely impact our reputation and our fundraising efforts, including as a result of regulatory sanctions. Moreover, in February 2023, the SEC proposed extensive amendments to the custody rule for \nSEC-registered\n investment advisers which would apply to all assets of an advisory client, including real estate and other assets that generally are not considered securities under the federal securities laws. If adopted, the amendments would require, among other things, that qualified custodians maintain possession of and control of assets of advisory clients and participate in or effectuate any changes of such assets’ beneficial ownership. There is a lack of clarity as to whether all assets held by Blackstone’s advisory clients can be custodied in a manner that satisfies the proposed rule or whether existing qualified custodians will provide custodial services for such assets at a reasonable cost or at all. If adopted, these amendments could expose our registered investment advisers to additional regulatory liability, increase compliance costs and impose limitations on our investing activities. Whether such proposed rules will ultimately be adopted, or, if adopted, what the full extent of their impact would be is unclear. The general anticipation is that, if adopted, these proposed rules will increase regulatory and compliance costs, place burdens on our resources, including the time and attention of our personnel, and heighten the risk of regulatory action. \n \n39 \nTable of Contents\nWe regularly are subject to requests for information, inquiries and informal or formal investigations by the SEC and other regulatory authorities, with which we routinely cooperate, and which have included review of historical practices that were previously examined. Such investigations have previously and may in the future result in penalties and other sanctions. SEC actions and initiatives can have an adverse effect on our financial results, including as a result of the imposition of a sanction, a limitation on our or our personnel’s activities, or changing our historic practices. Even if an investigation or proceeding did not result in a sanction, or the sanction imposed against us or our personnel by a regulator were small in monetary amount, the adverse publicity relating to the investigation, proceeding or imposition of these sanctions could harm our reputation and cause us to lose existing clients or fail to gain new clients. In addition, certain states and other regulatory authorities have required investment managers to register as lobbyists, and we have registered as such in a number of jurisdictions. Other states or municipalities may consider similar legislation or adopt regulations or procedures with similar effect. These registration requirements impose significant compliance obligations on registered lobbyists and their employers, which may include annual registration fees, periodic disclosure reports and internal recordkeeping. \nWe are subject to increasing scrutiny from regulators, elected officials, stockholders, investors and other stakeholders with respect to sustainability matters, which may adversely impact our ability to raise capital from certain investors, constrain capital deployment opportunities for our funds and harm our brand and reputation. \nWe, our funds and their portfolio companies are subject to increasing scrutiny from regulators, elected officials, stockholders, investors and other stakeholders with respect to sustainability matters. In recent years, alternative asset managers have become subject to competing demands from different investors and other stakeholder groups with divergent views on sustainability matters, including the role of such matters in the investment process. Certain investors, including public pension funds, have placed increasing importance on the impacts of investments made by the private funds to which they commit capital, including with respect to climate change, among other aspects of sustainability. At times, investors, including public pension funds, have limited participation in certain investment opportunities, such as hydrocarbons, and/or conditioned future capital commitments to certain funds on the implementation of screens or other \nsector-specific\n investment guidelines. Conversely, certain investors have raised concerns as to whether the incorporation of sustainability factors in the investment and portfolio management process may be inconsistent with the fiduciary duty to maximize return for investors, or may result in the subordination of the interests of investors based solely or in part on sustainability considerations. Investors, including public pension funds, which represent a significant portion of our funds’ investor bases, may decide to withdraw previously committed capital (where such withdrawal is permitted) or not commit capital to future fundraises based on their assessment of how we approach and consider the sustainability cost of investments and whether the \nreturn-driven\n objectives of our funds align with their sustainability priorities. This divergence increases the risk that any action or lack thereof with respect to sustainability matters will be perceived negatively by at least some stakeholders and adversely impact our reputation and business. If we do not successfully manage \nsustainability-related\n expectations across the varied interests of our stakeholders, including existing or potential investors, our ability to access and deploy capital may be adversely impacted. In addition, a failure to successfully manage \nsustainability-related\n expectations may negatively impact our reputation and erode stakeholder trust. \nCertain investors also have begun to request or require data from their asset managers and/or use \nthird-party\n benchmarks and ratings to allow them to monitor the sustainability impact of their investments. Regulatory initiatives to require investors to make disclosures to their stakeholders regarding sustainability matters have become increasingly common in certain jurisdictions, which may further increase the number and type of investors who place importance on these issues and who demand certain types of reporting from us or our funds. In addition, government authorities of certain U.S. states have requested information from and scrutinized certain asset managers with respect to whether such managers have adopted sustainability policies that would restrict \n \n40 \nTable of Contents\nsuch asset managers from investing in certain industries or sectors, such as conventional energy. These authorities have indicated that such asset managers may lose opportunities to manage money belonging to these states and their pension funds to the extent the asset managers boycott certain industries. This may impair our ability to access capital from certain investors, and we may in turn not be able to maintain or increase the size of our funds or raise sufficient capital for new funds, which may adversely impact our revenues. \nThere has been increased regulatory focus on \nsustainability-related\n practices by investment managers and the accuracy of statements made regarding such practices, including whether such statements are inaccurate or misleading, either because they overstate (often referred to as “greenwashing”) or understate the extent to which such investment managers are engaging in \nsustainability-related\n practices. The SEC has commenced enforcement actions against several investment advisers relating to sustainability disclosures and policies and procedures failures. Any perception or accusation that we are overstating, or, conversely, understating our engagement in \nsustainability-related\n practices could damage our reputation, result in litigation or regulatory actions, and adversely impact our ability to raise capital and attract new investors. Outside of the United States, the European regulatory environment for alternative investment fund managers and financial services firms continues to evolve and increase in complexity, making compliance more costly and \ntime-consuming.\n See “—Climate change, climate and \nsustainability-related\n regulation and sustainability concerns could adversely affect our business and the operations of our funds’ portfolio companies, and any actions we take or fail to take in response to such matters could damage our reputation.” \nWe may also communicate certain initiatives regarding environmental, human capital management, and other \nsustainability-related\n matters in our SEC filings or in other disclosures by us or our funds. These initiatives could be difficult and expensive to implement, the personnel, processes and technologies needed to implement them may not be cost effective and may not advance at a sufficient pace, and we may not be able to accomplish them within the timelines we announce or at all. We could, for example, determine that it is not feasible or practical to implement or complete certain of such initiatives based on cost, timing or other considerations. \nFurthermore, we could be criticized for the accuracy, adequacy or completeness of the disclosure related to our or our funds’ \nsustainability-related\n policies, practices and initiatives (and progress on those initiatives), which disclosure may be based on frameworks and standards for measuring progress that are still developing, internal controls and processes that continue to evolve, and assumptions that are subject to change in the future. In addition, we could be criticized for the scope or nature of such initiatives, or for any revisions to these initiatives. Further, as part of our sustainability practices, we rely from time to time on \nthird-party\n data, services and methodologies and such services, data and methodologies could prove to be incomplete or inaccurate. If our or such third parties’ \nsustainability-related\n data, processes or reporting are incomplete or inaccurate, or if we fail to achieve progress on a timely basis, or at all, we may be subject to enforcement action and our reputation could be adversely affected, particularly if in connection with such matters we were to be accused of greenwashing. \nClimate change, climate and \nsustainability-related\n regulation and sustainability concerns could adversely affect our businesses and the operations of our funds’ portfolio companies, and any actions we take or fail to take in response to such matters could damage our reputation. \nWe, our funds and our funds’ portfolio companies face risks associated with climate change including risks related to the impact of \nclimate-\n and \nsustainability-related\n legislation and regulation (both domestically and internationally), risks related to business trends related to climate change and technology (such as the process of transitioning to a \nlower-carbon\n economy), and risks stemming from the physical impacts of climate change. \nClimate and \nsustainability-related\n regulations or interpretations of existing laws may result in enhanced disclosure obligations, which could negatively affect us, our funds and our funds’ portfolio companies and materially increase the regulatory burden and cost of compliance. For example, in recent years the EU has adopted the Corporate Sustainability Reporting Directive (“CSRD”), the Sustainable Finance Disclosure Regulation (“SFDR”) \n \n41 \nTable of Contents\n \nand its corresponding Taxonomy Regulation, and the Corporate Sustainability Due Diligence Directive (“CSDDD”), while the U.K. has published final rules for its Sustainability Disclosure Requirements and investment labels regime (“SDR”). In June 2024, BELL began reporting certain \nU.K.-law\n required \nclimate-related\n financial information in line with the Task Force on \nClimate-Related\n Financial Disclosure’s recommendations. Several U.S. states are also at various stages of seeking to regulate climate-related disclosures. For example, California has enacted, and legislators in New York have introduced, climate disclosure laws that could require us to report on, among other matters, greenhouse gas emissions and climate-related risks. These frameworks have detailed disclosure requirements that would impact us and/or certain of our funds and may conflict with certain of our other regulatory obligations, such as limitations on general solicitation for private funds. As a consequence, we may be unable to fully comply with some requirements of these new regimes, which could result in regulatory actions against us. In addition, the current U.S. Presidential administration or the U.S. Congress may seek to modify policies or regulations of the prior administration, including limitations on coal and gas electric generation, mining and/or exploration, as well as various tax incentives under the Inflation Reduction Act intended to spur clean energy investment. While certain of our funds’ portfolio companies and investments may benefit from such policies, certain other portfolio companies and investments focused on renewables or other forms of “green energy” may be adversely impacted. \nMoreover, collecting, measuring and reporting the information and metrics required under various existing regulations has imposed administrative burden and increased cost on us. Such burden and cost are likely to increase if new or proposed regulations are enacted, particularly if the requirements imposed on us by various regulations lack harmonization on a global basis. We may also communicate certain \nclimate-related\n initiatives, commitments and goals in our SEC filings or in other disclosures, which subjects us to additional risks, including the risk of being accused of greenwashing. \nCertain of our funds’ portfolio companies operate in sectors that could face transition risk. For certain of our funds’ portfolio companies, business trends related to climate change may require capital expenditures, product or service redesigns, and changes to operations and supply chains to meet changing customer expectations. While this can create opportunities, not addressing these changed expectations could create business risks for portfolio companies, which could negatively impact the value of such companies and the returns in our funds. For example, significant chronic or acute physical effects of climate change, including extreme weather events such as hurricanes, floods, or wildfires, can have an adverse impact on certain of our funds’ portfolio companies and investments, especially our real asset investments and portfolio companies that rely on physical factories, plants, stores or other assets located in the affected areas, or that focus on tourism or recreational travel. As the effects of climate change increase, we expect the frequency and impact of \nweather-\n and \nclimate-related\n events and conditions to increase as well. \nIn addition, our reputation and fundraising may be harmed if certain stakeholders, such as our limited partners or stockholders, believe that we are not adequately or appropriately responding to climate change or, conversely, are focusing on climate change in a way that is inconsistent with our fiduciary duty obligations, including through the way in which we operate our business, the composition of our funds’ existing portfolios, the new investments made by our funds, or the decisions we make to continue to conduct or change our activities in response to climate change considerations. Moreover, we face business trends related to climate change risks, such as, for example, the increased attention to sustainability considerations by our fund investors, including in connection with their determination of whether to invest in our funds. See “—We are subject to increasing scrutiny from regulators, elected officials, stockholders, investors and other stakeholders with respect to sustainability matters, which may adversely impact our ability to raise capital from certain investors, constrain capital deployment opportunities for our funds and harm our brand and reputation.” \n \n42 \nTable of Contents\nFinancial regulatory changes in the United States could adversely affect our business. \nThe financial services industry continues to be the subject of heightened regulatory scrutiny in the United States. There has been active debate over the appropriate extent of regulation and oversight of private investment funds and their managers. Our business may be adversely affected by new or revised regulations imposed by the SEC or other U.S. governmental regulatory authorities or \nself-regulatory\n organizations that supervise the financial markets. Our business also may be adversely affected by changes in the interpretation or enforcement of existing laws and regulations by these governmental authorities and \nself-regulatory\n organizations. Further, new regulations or interpretations of existing laws may result in enhanced disclosure obligations, including with respect to climate matters, which could materially increase the regulatory burden imposed on us, our funds or our funds’ portfolio companies. \nThe \nDodd-Frank\n Wall Street Reform and Consumer Protection Act (the \n“Dodd-Frank\n Act”), enacted in July 2010, imposed significant changes on almost every aspect of the U.S. financial services industry, including aspects of our business. The \nDodd-Frank\n Act created the FSOC, an interagency body charged with identifying and monitoring systemic risk to financial markets. The FSOC can designate certain financial companies as nonbank financial companies subject to supervision by the Board of Governors of the Federal Reserve System (the “Federal Reserve Board”). If we were to be designated as such by the FSOC, or if any of our business activities were to be identified by the FSOC as warranting enhanced regulation or supervision by certain regulators, we could be subject to a materially greater regulatory burden. This could adversely impact our compliance and other costs, the implementation of certain of our investment strategies and our profitability. Under the \nDodd-Frank\n Act, whistleblowers who voluntarily provide original information to the SEC can receive compensation and protection, including payment equal to between 10% and 30% of certain monetary sanctions imposed in a successful government action resulting from the information provided by the whistleblower. \nWhistleblower claims have increased significantly since the enactment of these provisions and in the 2023 fiscal year the SEC awarded approximately $600 million to 68 individuals. Addressing such claims could generate significant expenses and take up significant management time for us and our funds’ portfolio companies, even if such claims are frivolous or without merit. \nRule \n206(4)-5\n under the Advisers Act regulates “pay to play” practices by investment advisers involving campaign contributions and other payments to elected state and local officials who have the ability to, directly or indirectly, influence the hiring of an investment adviser by a government entity. The rule prohibits investment advisers from providing advisory services for compensation to a government plan investor for two years, subject to limited exceptions, after the investment adviser, its senior executives or certain other “covered associates” make a disqualifying political contribution or payment to any such government official. There have also been similar rules on at the state level. Any failure on our part to comply with such rules could result in enforcement action, expose us to significant penalties and reputational damage and disqualify us from relying on private offering securities exemptions pursuant to which we raise a material portion of our investor capital. \nThe SEC has adopted “Regulation Best Interest,” which imposes a “best interest” standard of care for \nbroker-dealers\n when recommending certain securities transactions to a customer. Regulation Best Interest requires such \nbroker-dealers\n to evaluate available alternatives, including those that may have lower expenses and/or lower investment risk than our investment funds. The continued regulatory focus on Regulation Best Interest may negatively impact whether certain \nbroker-dealers\n and their associated persons are willing to recommend investment products, including certain of our funds, to retail customers, which may adversely impact our ability to distribute our products to certain investors. Furthermore, the U.S. Department of Labor as well as several states have proposed regulations or taken other actions pertaining to conduct standards for investment advisers and \nbroker-dealers\n that may result in additional requirements related to our business. Additionally, the SEC has instituted and settled multiple actions against investment advisers for violating its 2022 amended marketing rule, which imposed more prescriptive requirements on fund marketing. \n \n43 \nTable of Contents\nThe potential for governmental policy and/or legislative changes and regulatory reform may create regulatory uncertainty for our investment strategies, may make it more difficult to operate our business, and may adversely affect the profitability of our funds’ portfolio companies. \nGovernmental policy and/or legislative changes and regulatory reform could make it more difficult for us to operate our business, including by impeding fundraising or making certain investments or investment strategies unattractive or less profitable. In addition, our ability to identify business and other risks associated with new investments depends in part on our ability to anticipate and accurately assess regulatory, legislative and other changes that may have a material impact on our funds’ investments. Anticipating policy changes and reforms may be particularly difficult during periods of heightened partisanship at the federal, state and local levels, including due to the divisiveness surrounding populist movements, political disputes and socioeconomic issues. The failure to accurately anticipate the possible outcome of such changes and/or reforms could have a material adverse effect on the returns generated from our funds’ investments and our revenues. \nIn recent years, there has been increased regulatory enforcement activity and rulemaking impacting the financial services industry. Under the prior U.S. administration and at the SEC and certain other regulatory bodies, policy changes could impose additional costs on us or our funds’ investments, require significant attention of senior management or result in limitations on the manner in which we or the companies in which we invest conduct business. We cannot predict at this time whether and the extent to which the current U.S. Presidential administration and \nnewly-appointed\n senior officials at the SEC and other federal agencies will pursue these or other policy changes. Such changes or reforms may include, without limitation: \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nThere has been recurring consideration amongst regulators and intergovernmental institutions regarding the role of nonbank institutions in providing credit and, particularly, \nso-called\n “shadow banking,” a term generally taken to refer to financial intermediation involving entities and activities outside the regulated banking system. Federal regulatory bodies, such as the FSOC, and international organizations, such as the Financial Stability Board, regularly assess financial stability-related risks associated with, among other things, nonbank lending and certain types of \nopen-end\n funds. At this time, whether any rules or regulations related thereto will be proposed is unclear. If nonbank financial intermediation became subject to regulations or oversight standards similar to those applicable to traditional banks, certain of our business activities, including nonbank lending, would be adversely affected and the regulatory burden on us would materially increase, which could adversely impact the implementation of our investment strategy and our returns. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nIn the United States, FSOC has the authority to designate nonbank financial companies as systemically important financial institutions (“SIFIs”) subject to supervision by the Federal Reserve Board. Currently, there are no nonbank financial companies with a nonbank SIFI designation. The FSOC has, however, designated certain nonbank financial companies as SIFIs in the past, and additional nonbank financial companies, which may include large asset management companies such as us, may be designated as SIFIs in the future. In November 2023, FSOC adopted amendments to its guidance regarding procedures for designating nonbank financial companies as SIFIs which eliminated the prior guidance’s prioritization of an “activities-based” approach for identifying, assessing and addressing potential risks to financial stability. Under the previous guidance’s “activities-based” approach, FSOC indicated that it would primarily focus on regulating activities that pose systemic risk rather than focusing on individual firm-specific determinations. The elimination of an “activities-based” approach over designation of an individual firm as a nonbank SIFI may increase the likelihood of FSOC designating one or more firms as a nonbank SIFI. If we were designated as a nonbank SIFI, including as a result of our asset management or nonbank lending activities, we could become subject to direct supervision by the Federal Reserve Board, and could become subject to enhanced prudential, capital, supervisory and other requirements, such as risk-based capital requirements, leverage limits, liquidity requirements, resolution plan and credit exposure report requirements, concentration limits, a contingent capital requirement, enhanced public \n \n44 \nTable of Contents\n\n\n\n\n\n\n \n\n\ndisclosures, short-term debt limits and overall risk management requirements. Requirements such as these, which were designed to regulate banking institutions, would likely need to be modified to be applicable to an asset manager, although no proposals have been made indicating how such measures would be adapted for asset managers. \nIn addition, future reviews by the FSOC of nonbank financial companies for designation as SIFIs may focus on other types of products and activities, such as nonbank lending activities conducted by certain of our businesses. If any of our activities were identified by the FSOC as posing potential risks to U.S. financial stability, such activities could be subject to modified or enhanced regulation or supervision by U.S. regulators with jurisdiction over such activities, although no proposals have been made indicating how such measures would be applied to any such identified activities. \nTrade negotiations and related government actions may create regulatory uncertainty for our funds’ portfolio companies and our investment strategies and adversely affect the profitability of our funds’ portfolio companies. \nIn recent years, the U.S. government has indicated its intent to alter its approach to international trade policy and in some cases to renegotiate, or potentially terminate, certain existing bilateral or \nmulti-lateral\n trade agreements and treaties with foreign countries, and has made proposals and taken actions related thereto. For example, the U.S. government has imposed, and may in the future further increase, tariffs on certain foreign goods, including from China, such as steel and aluminum. Some foreign governments, including China, have instituted retaliatory tariffs on certain U.S. goods. Most recently, the current U.S. Presidential administration has imposed or sought to impose significant increases to tariffs on goods imported into the U.S., including from China, Canada and Mexico. While the U.S. has reached an agreement with each of Canada and Mexico to delay the imposition of such tariffs until early March 2025, the administration has indicated intent to reinstate them. Tariffs on goods imported from China took effect in February 2025, and the administration has stated plans to increase such tariffs further. Tariffs on goods imported from China, and to the extent reinstated, from Canada and Mexico could further increase costs, decrease margins, reduce the competitiveness of products and services offered by current and future portfolio companies. This could materially adversely affect the revenues and profitability of select companies whose businesses rely on goods imported from countries that are subject to significant tariffs. Further governmental actions related to the imposition of tariffs or other trade barriers or changes to international trade agreements or policies in respect of other jurisdictions could also have a similar adverse impact. \nThe U.S. has also implemented a number of economic sanctions programs and export controls that specifically target Chinese entities and nationals on national security grounds, including, for example, with respect to China’s response to political demonstrations in Hong Kong and China’s conduct concerning the treatment of Uyghurs and other ethnic minorities in its Xinjiang province. Moreover, the U.S. has implemented additional sanctions against entities participating in China’s military industrial complex and providing support to the country’s military, intelligence, and surveillance apparatuses. These sanctions impose certain restrictions on U.S. persons and entities buying or selling publicly traded securities of these designated entities. Further escalation of the “trade war” between the U.S. and China, the countries’ inability to reach further trade agreements, or the continued use of reciprocal sanctions by each country, may negatively impact opportunities for investment as well as the rate of global growth, particularly in China, which has and continues to exhibit signs of slowing growth. Such slowing growth could adversely affect the revenues and profitability of our funds’ portfolio companies. \nThere is uncertainty as to further actions that may be taken under the current U.S. Presidential administration with respect to U.S. trade policy, including with respect to the proposed tariffs on goods from Canada and Mexico. See “—Laws and regulations on foreign direct investment applicable to us and our funds’ portfolio companies, both within and outside the U.S, may make it more difficult for us to deploy capital in certain jurisdictions or to sell assets to certain buyers.” \n \n45 \nTable of Contents\nOur provision of products and services to insurance companies subjects us to a variety of risks and uncertainties. \nWe have increasingly undertaken initiatives to deliver to insurance companies customizable and diversified portfolios of Blackstone products and strategies across asset classes, including investment grade and \nnon-investment\n grade credit, with a focus on corporate, asset based and private credit. Our insurance initiatives include partial or full management of insurance companies’ general account or reinsurance assets. This strategy has in recent years contributed to meaningful growth in our Assets Under Management, including in Perpetual Capital Assets Under Management. BXCI’s insurance platform currently manages assets for a number of insurance companies and certain of their respective affiliates pursuant to several investment management agreements. Our insurance platform also manages or \nsub-manages\n assets for certain \ninsurance-dedicated\n funds and special purpose vehicles, and has developed, and may continue to develop, other \ncapital-efficient\n products for insurance companies. \nThe continued success of our insurance platform will depend in large part on further developing investment partnerships with insurance company clients and maintaining existing asset management arrangements, including those described above. If we fail to deliver or originate \nhigh-quality,\n \nhigh-performing\n products, strategies or assets that help our insurance company clients meet \nlong-term\n policyholder obligations, we may not be successful in retaining existing investment partnerships, developing new investment partnerships or originating or selling \ncapital-efficient\n assets or products. Such failure may have a material adverse effect on our business, results and financial condition. \nThe U.S. and \nnon-U.S.\n insurance industries are subject to significant regulatory oversight. Regulatory authorities in many relevant jurisdictions have broad regulatory (including through certain regulatory support organizations), administrative, and in some cases discretionary, authority with respect to insurance companies and/or their investment advisors, which may include, among other things, the investments insurance companies may acquire and hold, marketing practices, affiliate transactions, reserve requirements and capital adequacy. These requirements are primarily concerned with the protection of policyholders, and regulatory authorities often have wide discretion in applying the relevant restrictions and regulations to insurance companies, which may indirectly affect us. We may be the target or subject of, or may have indemnification obligations related to, litigation (including class action litigation by policyholders), enforcement investigations or regulatory scrutiny. Regulators and other authorities generally have the power to bring administrative or judicial proceedings against insurance companies, which could result in, among other things, suspension or revocation of licenses, \ncease-and-desist\n orders, fines, civil penalties, criminal penalties or other disciplinary action. To the extent we are involved in such regulatory actions, our reputation could be harmed, we may become liable for indemnification obligations and we could potentially be subject to enforcement actions, fines and penalties. \nRecently, insurance regulatory authorities and regulatory support organizations have increased scrutiny of private equity’s involvement in the insurance industry, including with respect to the ownership by such managers or their affiliated funds of, and the management of assets on behalf of, insurance companies. For example, insurance regulators, including the National Association of Insurance Commissioners (“NAIC”), the U.S. \nstandard-setting\n and regulatory support organization for the insurance industry, have increasingly focused on the terms and structure of investment management agreements. This has included focus on whether such agreements are at arms’ length, establish a control relationship with the insurance company, grant the asset manager excessive authority or oversight over the investment strategy of the insurance company or provide for management fees that are not fair and reasonable or termination provisions that make it difficult or costly for the insurer to terminate the agreement. \nNon-U.S.\n regulators (including in Europe, Asia-Pacific, Bermuda and the Cayman Islands, among others) and the International Association of Insurance Supervisors, an international insurance standard-setting organization comprised of over 200 jurisdictions, have similarly focused on each of these topics. \n \n46 \nTable of Contents\n \nRegulators have also increasingly focused on the risk profile of certain investments held by insurance companies (including, without limitation, all or certain tranches of collateralized loan obligations and other structured securities), appropriateness of investment ratings and potential conflicts of interest, including affiliated investments, and potential misalignment of incentives and any potential risks from these and other aspects of an insurance company’s relationship with alternative asset managers that may impact the insurance company’s risk profile. This enhanced scrutiny may increase the risk of regulatory actions against us and could result in new or amended regulations that limit our ability, or make it more burdensome or costly, to enter into new investment management agreements with insurance companies and thereby grow our insurance strategy. Some of the arrangements we have or will develop with insurance companies involve complex U.S. and \nnon-U.S.\n tax structures for which no clear precedent or authority may be available. Such structures may be subject to potential regulatory, legislative, judicial or administrative change or scrutiny and differing interpretations and any adverse regulatory, legislative, judicial or administrative changes, scrutiny or interpretations may result in substantial costs to insurance companies or us. \nInsurance company investment portfolios are often subject to internal and regulatory requirements governing the categories and ratings of investment products and assets they may acquire and hold. Many of the investment products and strategies we originate or develop for, or other assets or investments we include in, insurance company portfolios will be rated and a ratings downgrade or any other negative action by a rating agency or the NAIC’s Securities Valuation Office (“SVO”), as applicable, with respect to such products, assets or investments could make them less attractive and limit our ability to offer such products to, or invest or deploy capital on behalf of, insurers. Furthermore, insurance companies are subject to certain minimum capital and surplus requirements that vary by the jurisdiction where the insurance company is domiciled and are generally subject to change over time (as discussed in more detail below). In the United States, our insurance company clients are subject to \nrisk-based\n capital (“RBC”) standards and other minimum capital and surplus requirements imposed by state laws. The RBC standards are based upon the \nRisk-Based\n Capital for Insurers Model Act promulgated by the NAIC, as adopted by applicable clients’ insurance regulators. Our Bermuda insurance company clients are subject to Bermuda Solvency Capital Requirements standards and other minimum capital and surplus requirements imposed by the Bermuda Monetary Authority. \nNew statutory accounting guidance or changes or clarifications in interpretations of existing guidance may adversely impact our ability to originate, or invest in, appropriate assets on behalf of our insurance company clients or cause our clients to increase their required capital in respect of such assets, thus making such assets less attractive to insurers, which may adversely affect our business. Certain proposals or exposure drafts released by insurance regulatory authorities, including the NAIC or the SVO, may result in changes to the \nrisk-based\n capital treatment and/or ratings or \nre-ratings\n processes of certain assets or investments that are, or may be, held by our insurance company clients. For example, in 2024, the NAIC increased the applicable capital charge of residual tranches or equity securities of \nasset-based\n securitizations from 30% to 45% in respect of life insurers. This increase in the applicable RBC charge of such assets could potentially make such assets or investments less attractive to insurers and limit our ability to originate, or invest in, such assets on behalf of insurers. \nWe rely on complex exemptions from statutes in conducting our asset management activities. \nWe regularly rely on exemptions from various requirements of the U.S. Securities Act of 1933, as amended (the “Securities Act”), the Exchange Act, the 1940 Act, the Commodity Exchange Act and the U.S. Employee Retirement Income Security Act of 1974, as amended, in conducting our asset management activities. These exemptions are sometimes highly complex and may in certain circumstances depend on compliance by third parties whom we do not control. These exemptions may become unavailable to us for a variety of reasons, including, for example, if we or certain “covered persons” were to become the subject of a criminal, regulatory or court order or other “disqualifying event” under Rule 506 of Regulation D under the Securities Act that were not otherwise waived. If for any reason these exemptions were to become unavailable to us, we could become subject to regulatory action or \nthird-party\n claims and our business could be materially and adversely affected. \n \n47 \nTable of Contents\nComplex regulatory regimes and potential regulatory changes in jurisdictions outside the United States could adversely affect our business. \nSimilar to the United States, our business and operations in the jurisdictions outside the United States, in particular Europe, are subject to extensive laws and regulation. Governmental regulators and other authorities in Europe have proposed or implemented a number of initiatives, rules and regulations that could adversely affect our business, including by imposing additional compliance and administrative burdens and increasing the costs of doing business in such jurisdictions. Increasingly, the rules and regulations in the financial sector in Europe are becoming more prescriptive. Rules and regulations in other jurisdictions are often informed by key features of U.S. and European rules and regulations and, as a result, our businesses in all jurisdictions, including across Asia, may become subject to increased regulation in the future. \nIn Europe, the EU Alternative Investment Fund Managers Directive (“AIFMD”) establishes a regulatory regime for alternative investment fund managers (“AIFMs”), including our AIFMs in Luxembourg and Ireland. The U.K. has \n“on-shored”\n AIFMD and therefore similar requirements continue to apply to funds marketed to U.K. investors. Changes to AIFMD, most of which will come into effect in 2026, have been adopted in the EU. These changes increase the compliance burdens on certain of our funds and require them to make changes to their operations, including, among other things, in respect of their use of leverage, which could impact the returns of such funds. In addition, the changes may restrict certain of our AIFs from marketing in EEA jurisdictions via national private placement regimes, which may impact our ability to raise capital from EEA investors. \nThe EU regulation on \nover-the-counter\n (“OTC”) derivative transactions, central counterparties and trade repositories (“EMIR”) requires mandatory clearing of certain OTC derivatives through central counterparties, creates additional risk mitigation requirements (including, in particular, margining requirements) in respect of certain OTC derivative transactions that are not cleared by a central counterparty, and imposes reporting and recordkeeping requirements in respect of most derivative transactions. In addition, the EU regulation on transparency of securities financing transactions (“SFTR”) requires certain mandatory reporting and disclosure in connection with certain securities financing transactions and total return swaps. Furthermore, the EU Central Securities Depositories Regulation (“CSDR”) provides for an \nEU-wide\n framework with respect to securities settlement and central securities depository and settlement services. Each of the aforementioned regulations is likely to increase the operational burden and costs associated with certain of our and our funds’ operations. \nFurther, in the EU, the Markets in Financial Instruments Directive 2014 (2014/65/EU) (“MiFID II”), which has also been \non-shored\n in the U.K., requires us to comply with disclosure, transparency, reporting and record keeping obligations and enhanced obligations in relation to the receipt of investment research, best execution, product governance and marketing communications. Compliance with MiFID II has resulted in greater overall complexity, higher compliance and administration and operational costs and less overall flexibility for us. This includes increased regulatory capital and liquidity adequacy requirements for certain of our entities licensed under MiFID, as well as remuneration requirements of certain senior staff. Additional regulation around remuneration may make it harder for us to attract and retain talent, compared to competitors not subject to the same rules. Enhanced internal governance, disclosure and reporting requirements increase the costs of compliance. \nCertain regulatory requirements in the EU and U.K. intended to enhance protection for retail investors and impose additional obligations on the distribution of certain products to retail investors may lead to increased costs and limit our ability to access capital from retail investors in certain jurisdictions. These include EU and U.K. rules requiring that retail investors in packaged retail investment and insurance products receive key information documents and U.K. rules enhancing duties related to distribution of financial products to retail investors. Furthermore, in May 2023, the European Commission announced its Retail Investment Strategy, which could result in new regulation that could impact our ability to offer our funds to retail investors in the EU. Data protection authorities have significant audit and investigatory powers to probe how personal data is being used and processed and breaches of these regulations can lead to significant fines, regulatory action and reputational risk. See “— \n \n48 \nTable of Contents\nRapidly developing and changing global data security and privacy laws and regulations could increase compliance costs and subject us to enforcement risks and reputational damage.” European regulators, including the U.K. FCA and CSSF in Luxembourg are increasing their attention on greenwashing and rapidly developing and implementing regimes focused on sustainability within the financial services sector, which could adversely affect our business and the operations of our funds’ portfolio companies in various ways. See “— Climate change, climate and \nsustainability-related\n regulation and sustainability concerns could adversely affect our business and the operations of our funds’ portfolio companies, and any actions we take or fail to take in response to such matters could damage our reputation.” \nLaws and regulations on foreign direct investment applicable to us and our funds’ portfolio companies, both within and outside the U.S., may make it more difficult for us to deploy capital in certain jurisdictions or to sell assets to certain buyers. \nA number of jurisdictions, including the U.S., have restrictions on foreign direct investment pursuant to which their respective heads of state and/or regulatory bodies have the authority to block or impose conditions with respect to certain transactions, such as investments, acquisitions and divestitures, if such transaction threatens to impair national security. In addition, many jurisdictions restrict foreign investment in assets important to national security by taking steps including, but not limited to, placing limitations on foreign equity investment, implementing investment screening or approval mechanisms, and restricting the employment of foreigners as key personnel. These U.S. and foreign laws could limit our funds’ ability to invest in certain businesses or entities or impose burdensome notification requirements, operational restrictions or delays in pursuing and consummating transactions. For example, the Committee on Foreign Investment in the United States (“CFIUS”) has the authority to review transactions that could result in potential control of, or certain types of \nnon-controlling\n investments in, a U.S. business or U.S. real estate by a foreign person. In recent years, legislation has expanded the scope of CFIUS’ jurisdiction to cover more types of transactions and empower CFIUS to scrutinize more closely investments in certain transactions. CFIUS may recommend that the President block, unwind or impose conditions or terms on such transactions, certain of which may adversely affect the ability of the fund to execute on its investment strategy with respect to such transaction as well as limit our flexibility in structuring or financing certain transactions. Additionally, CFIUS or any \nnon-U.S.\n equivalents thereof may seek to impose limitations on one or more such investments that may prevent us from maintaining or pursuing investment opportunities that we otherwise would have maintained or pursued, which could make it more difficult for us to deploy capital in certain of our funds. \nIn August 2023, an executive order established an outbound investment screening regime (the “Outbound Order”), which was intended to regulate or prohibit certain investments by U.S. persons in advanced technology sectors in jurisdictions that may be designated as a “country of concern.” In January 2025, the current U.S. Presidential administration signed an Annex to the Outbound Order that identified China, along with the Special Administrative Regions of Hong Kong and Macau, as a “country of concern.” Similarly, in February 2025, the U.S. Presidential administration issued a memorandum to various regulatory agencies regarding enhanced restrictions on outbound investments into China, as well as on Chinese investments into the U.S. These actions could negatively impact our ability to raise capital from and deploy capital in such jurisdictions, including if the administration seeks to expand such limitations to apply to a broader range of activities. Further, a number of U.S. states are passing and implementing state laws prohibiting or otherwise restricting the acquisition of interests in real property located in the state by foreign persons. These laws may also impact the ability of certain \nnon-U.S.\n limited partners to participate in certain of our investment strategies. \nOur funds’ investments outside of the United States may face delays, limitations, or restrictions as a result of notifications made under and/or compliance with these legal regimes and rapidly changing agency practices. Other countries continue to establish and/or strengthen their own national security investment clearance regimes, which could have a corresponding effect of limiting our ability to make investments in such countries. Heightened scrutiny of foreign direct investment worldwide may also make it more difficult for us to identify suitable buyers for investments upon exit and may constrain the universe of exit opportunities for an investment in a portfolio company. As a result of such regimes, we may incur significant delays and costs, be altogether prohibited from \n \n49 \nTable of Contents\nmaking a particular investment or impede or restrict syndication or sale of certain assets to certain buyers, all of which could adversely affect the performance of our funds and in turn, materially reduce our revenues and cash flow. Complying with these laws imposes potentially significant costs and complex additional burdens, and any failure by us or our funds’ portfolio companies to comply with them could expose us to significant penalties, sanctions, loss of future investment opportunities, additional regulatory scrutiny, and reputational harm. \nWe are subject to substantial risk of litigation and regulatory proceedings and may face significant liabilities and damage to our reputation as a result of allegations of improper conduct and negative publicity. \nFrom time to time we, our funds and our funds’ portfolio companies have been and may be subject to litigation, including securities class action lawsuits by stockholders, as well as class action lawsuits that challenge our acquisition transactions and/or attempt to enjoin them. For a discussion of certain legal proceedings to which we are a party, see “Part II. Item 8. Financial Statements and Supplementary Data — Notes to Consolidated Financial Statements — 18. Commitments and Contingencies \n-\n Contingencies \n-\n Litigation.” Any private lawsuits or regulatory actions brought against us and resulting in a finding of substantial legal liability could materially adversely affect our business, financial condition or results of operations. In addition, such actions, even if resulting in a favorable outcome to us, could result in significant reputational harm, which could seriously harm our business. \nIn recent years, the volume of claims and amount of damages claimed in litigation and regulatory proceedings against the financial services industry in general have been increasing. The investment decisions we make in our asset management business and the activities of our investment professionals (including in connection with portfolio companies and investment advisory activities) may subject us, our funds and our funds’ portfolio companies to the risk of \nthird-party\n litigation or regulatory proceedings arising from investor dissatisfaction with the performance of those investment funds, alleged conflicts of interest, the suitability or manner of distribution of our products, including to retail investors, the activities of our funds’ portfolio companies and a variety of other claims. \nIn addition, to the extent investors in our investment funds suffer losses resulting from fraud, gross negligence, willful misconduct or other similar misconduct, investors may have remedies against us, our investment funds, our senior managing directors or our affiliates under the federal securities law and/or state law. While the general partners and investment advisers to our investment funds, including their directors, officers, other employees and affiliates, are generally indemnified to the fullest extent permitted by law with respect to their conduct in connection with the management of the business and affairs of our investment funds, such indemnity does not extend to actions determined to have involved fraud, gross negligence, willful misconduct or other similar misconduct. The activities of our capital markets services business may also subject us to the risk of liabilities to our clients and third parties, including our clients’ stockholders, under securities or other laws in connection with transactions in which we participate. See “—Underwriting activities by our capital markets services business expose us to risks.” We depend to a large extent on our business relationships and our reputation for integrity and \nhigh-caliber\n professional services to attract and retain investors and to pursue investment opportunities for our funds. As a result, allegations by private actors, regulators, or employees of improper conduct by us, even if unfounded, as well as negative publicity and press speculation about us, may harm our reputation. This could adversely impact our relationships with clients and our fundraising. In recent years, there has been increased activity on the part of certain activist and other organized groups, with respect to investments made by private funds. Such groups have at times contacted and otherwise sought to engage with government and regulatory bodies and fund investors, including public pension funds, on our funds’ investments, which has led to negative publicity that could harm our reputation. The pervasiveness of social media and public focus on the externalities of business activities could lead to wider dissemination of adverse or inaccurate information about us, making remediation more difficult and magnifying reputational risk. \n \n50 \nTable of Contents\nEmployee misconduct could harm us by impairing our ability to attract and retain clients and subjecting us to significant legal liability and reputational harm. Fraud, deceptive practices or other misconduct at portfolio companies or service providers could similarly subject us to liability and reputational damage and also harm performance. \nOur employees could engage in misconduct that adversely affects our business. We are subject to a number of obligations and standards arising from our asset management business and our authority over the assets managed by our asset management business. The violation of these obligations and standards by any of our employees would adversely affect our clients and us. Our business often requires that we deal with confidential matters of great significance to companies in which we may invest. If our employees were to improperly use or disclose confidential information, we could suffer serious harm to our reputation, financial position and current and future business relationships. Detecting or deterring employee misconduct is not always possible, and the extensive precautions we take to detect and prevent this activity may not be effective in all cases. \nWe are subject to U.S. and foreign \nanti-corruption\n and \nanti-bribery\n laws, including the U.S. Foreign Corrupt Practices Act, as amended (“FCPA”), as well as \nanti-money\n laundering laws. Any determination that we have violated the FCPA, the EU and U.K. \nanti-money\n laundering regimes, the U.K. \nanti-bribery\n laws or other applicable \nanti-corruption,\n \nanti-bribery,\n or \nanti-money\n laundering laws could subject us to, among other things, civil and criminal penalties or material fines, profit disgorgement, injunctions on future conduct, securities litigation and a general loss of investor confidence. Any one of these could adversely affect our business prospects, financial position or the price of our common stock. Although the current U.S. President administration has signed an executive order to pause, subject to certain exceptions, the initiation of new investigations and enforcement actions under the FCPA, such laws have attracted significant regulatory focus in recent years, including outside of the U.S. For example, the SEC will be responsible for examining investment advisers’ compliance with a U.S. Department of Treasury’s Financial Crimes Enforcement Network (“FinCEN”) rule currently scheduled to go into effect January 2026, that requires registered investment adviser and exempt reporting advisers to, among other measures, adopt an \nanti-money\n laundering and countering the financing of terrorism (“AML/CFT”) program, file certain reports with FinCEN and to maintain records related to such activities. The application of these rules would impose significant compliance costs on us. The EU and the U.K. are similarly revising their respective \nanti-money\n laundering regimes. The EU’s revised \nanti-money\n laundering regime is expected to come into effect as early as June 2026 and the U.K. has also significantly expanded the reach of its \nanti-bribery\n laws. While we have policies and procedures designed to ensure strict compliance by us and our personnel with the FCPA and \nanti-money\n laundering and other applicable laws, such policies and procedures may not be effective in all instances to prevent violations. In addition, in light of the executive order to pause initiation of new FCPA investigations and enforcement actions in the U.S., other asset managers, particularly those who, unlike us, are not subject to the anti-corruption laws of a jurisdiction outside of the United States, may implement changes to their FCPA or anti-money laundering policies that would provide such managers access to investment opportunities that may not be available to us because of our current policies and procedures. \nFurthermore, we may also be adversely affected if there is misconduct by personnel of our funds’ portfolio companies or by such companies’ service providers. For example, financial fraud or other deceptive practices at our funds’ portfolio companies, or failures by personnel at our funds’ portfolio companies to comply with \nanti-corruption,\n \nanti-bribery,\n \nanti-money\n laundering, trade and economic sanctions, export controls, \nanti-harassment,\n \nanti-discrimination\n or other legal and regulatory requirements, could subject us to, among other things, civil and criminal penalties or material fines, profit disgorgement, injunctions on future conduct and securities litigation, and could also cause significant reputational and business harm to us. Such misconduct may undermine our due diligence efforts with respect to such portfolio companies and could negatively affect the valuations of the investments by our funds in such portfolio companies. Losses to our funds and us could also result from misconduct or other actions by service providers, such as administrators, consultants or other advisors, if such service providers improperly use or disclose confidential information, misappropriate funds, or violate legal or regulatory obligations. Moreover, we may face an increased risk of such misconduct to the extent our funds’ investment in \nnon-U.S.\n markets, particularly emerging markets, increases. \n \n51 \nTable of Contents\n \nPoor performance of our investment funds would cause a decline in our revenue, income and cash flow, may obligate us to repay Performance Allocations previously paid to us, and could adversely affect our ability to raise capital for future investment funds. \nIn the event that any of our investment funds were to perform poorly, our revenue, income and cash flow would decline because the value of our assets under management would decrease, which would result in a reduction in management fees, and our investment returns would decrease, resulting in a reduction in the Performance Revenues we earn. Moreover, we could experience losses on our investments of our own principal as a result of poor investment performance by our investment funds. Furthermore, if a carry fund does not achieve certain investment returns over its life as a result of poor performance of later investments, we will be obligated to repay the excess Performance Allocations that were previously distributed to us above the amount to which the relevant general partner is ultimately entitled. Similarly, certain of our vehicles’ terms require an offset of Performance Revenues related to past performance, often referred to as a “recoupment of loss carryforward.” If a recoupment of loss carryforward is triggered, including as a result of a meaningful decline in the vehicle’s revenues following a period of strong performance, such offset would serve to reduce the amount of future Performance Revenues to which we would be entitled in such vehicle. In the event that the offset is insufficient for the vehicle to fully recoup such loss carryforward, we may be required to make a cash payment after a certain period. \nPoor performance of our investment funds could make it more difficult for us to raise new capital. Investors in funds might decline to invest in future investment funds we raise and investors in hedge funds or other investment funds might withdraw their investments as a result of poor performance of the investment funds in which they are invested. Investors and potential investors in our funds continually assess our investment funds’ performance, and our ability to raise capital for existing and future investment funds and avoid excessive redemption levels will depend on our investment funds’ continued satisfactory performance. Accordingly, poor fund performance may deter future investment in our funds and thereby decrease the capital invested in our funds and ultimately, our management fee revenue. Alternatively, in the face of poor fund performance, investors could demand lower fees or fee concessions for existing or future funds which would likewise decrease our revenue. \nFurthermore, our organizational documents do not limit our ability to enter into new lines or business, and, from time to time, we may pursue new or different investment strategies and expand into geographic markets and businesses that may not perform as expected and result in poor performance by us and our investment funds. In addition to the risk of poor performance, such activity may subject us to a number of risks and uncertainties, including risks associated with (a) the possibility that we have insufficient expertise to engage in such activities profitably or without incurring inappropriate amounts of risk, (b) the diversion of management’s attention from our core businesses, (c) known or unknown contingent liabilities, which could result in unforeseen losses for us and our funds, (d) the disruption of ongoing businesses, (e) the ability to properly manage conflicts of interest and (f) compliance with additional regulatory requirements. \nOur equity investments and some of our debt investments rank junior to investments made by others, exposing us to a greater risk of losing our fund’s investment. \nIn many cases, the companies in which our funds invest will have indebtedness or equity securities, or may be permitted to incur indebtedness or to issue equity securities, that rank senior to our fund’s investment. By their terms, such instruments may provide that their holders are entitled to receive payments of distributions, interest or principal on or before the dates on which payments are to be made in respect of our fund’s investment. Also, in the event of insolvency, liquidation, dissolution, reorganization or bankruptcy of a company in which an investment is made, holders of securities ranking senior to our fund’s investment would typically be entitled to receive payment in full before distributions could be made in respect of our fund’s investment. In addition, debt investments made \n \n52 \nTable of Contents\nby our funds in our portfolio companies may be equitably subordinated to the debt investments made by third parties in our portfolio companies. After repaying senior security holders, the company may not have any remaining assets to use for repaying amounts owed in respect of our fund’s investment. To the extent any assets remain, holders of claims that rank equally with our fund’s investment would be entitled to share on an equal and ratable basis in distributions that are made out of those assets. Under such circumstances, the ability of our funds to influence a company’s affairs and to take actions to protect their investments during periods of financial distress or following an insolvency may be limited, exposing them to a greater risk of losing their investment. \nThe historical returns attributable to our funds should not be considered as indicative of the future results of our funds or of our future results or of any returns expected on an investment in common stock. \nThe historical and potential future returns of the investment funds that we manage are not directly linked to returns on our common stock. Therefore, any continued positive performance of the investment funds that we manage will not necessarily result in positive returns on an investment in our common stock. However, poor performance of the investment funds that we manage would cause a decline in our revenue from such investment funds, and would therefore have a negative effect on our performance and in all likelihood the returns on an investment in our common stock. Moreover, with respect to the historical returns of our investment funds: \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nwe may create new funds in the future that reflect a different asset mix and different investment strategies (including funds whose management fees represent a more significant proportion of the fees than has historically been the case), as well as a varied geographic and industry exposure as compared to our present funds, and any such new funds could have different returns from our existing or previous funds, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nthe rates of returns of our carry funds reflect unrealized gains as of the applicable measurement date that may never be realized, which may adversely affect the ultimate value realized from those funds’ investments, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\ncompetition for investment opportunities continues to increase as a result of, among other things, the increased amount of capital invested in alternative investment funds, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nour investment funds’ returns in some years benefited from investment opportunities and general market conditions that may not repeat themselves, our current or future investment funds might not be able to avail themselves of comparable investment opportunities or market conditions, and the circumstances under which our current or future funds may make future investments may differ significantly from those conditions prevailing in the past, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nnewly established funds may generate lower returns during the period in which they initially deploy their capital, which may result in little or no carried interest due to performance hurdles and \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nthe rates of return reflect our historical cost structure, which may vary in the future due to various factors enumerated elsewhere in this report and other factors beyond our control, including changes in laws. \nThe future internal rate of return for any current or future fund may vary considerably from the historical internal rate of return generated by any particular fund, or for our funds as a whole. In addition, future returns will be affected by the applicable risks described elsewhere in this Annual Report on Form \n10-K,\n including risks of the industries and businesses in which a particular fund invests. \nCertain policies and procedures implemented to mitigate potential conflicts of interest and address certain regulatory requirements may reduce the synergies across our various businesses. \nBecause of our various asset management businesses and our capital markets services business, we will be subject to a number of actual and potential conflicts of interest and subject to greater regulatory oversight and more legal and contractual restrictions than that to which we would otherwise be subject if we had just one line of \n \n53 \nTable of Contents\nbusiness. To mitigate these conflicts and address regulatory, legal and contractual requirements across our various businesses, we have implemented certain policies and procedures (for example, information walls) that may reduce the positive synergies that we cultivate across these businesses for purposes of identifying and managing attractive investments. For example, we may come into possession of confidential or material \nnon-public\n information with respect to issuers in which we may be considering making an investment or issuers in which our affiliates may hold an interest; however, certain regulatory requirements and our policies and procedures require us to restrict access by certain personnel in our funds to such information. As a consequence of such policies and procedures, we may be precluded from providing such information or other ideas to our other businesses even where it might be of benefit to them. \nOur failure to deal appropriately with conflicts of interest in our investment business could damage our reputation and adversely affect our businesses. \nAs we have expanded, and continue to expand, the number and scope of our businesses, we increasingly confront potential conflicts of interest relating to our funds’ investment activities. Investment manager conflicts of interest continue to be a significant area of focus for regulators and the media. Because of our size and the variety of businesses and investment strategies that we pursue, we may face a higher degree of scrutiny compared with investment managers that are smaller or focus on fewer asset classes. Certain of our funds may have overlapping investment objectives, including funds that have different fee structures and/or investment strategies that are more narrowly focused. Potential conflicts may arise with respect to allocation of investment opportunities among us, our funds and our affiliates, including to the extent that the fund documents do not mandate a specific investment allocation. For example, we may allocate an investment opportunity that is appropriate for two or more investment funds in a manner that excludes one or more funds or results in a disproportionate allocation based on factors or criteria that we determine, such as sourcing of the transaction, specific nature of the investment or size and type of the investment, and ability to execute quickly among other factors. We may also decide to provide a \nco-investment\n opportunity to certain investors in lieu of allocating more of that investment to our funds or \nvice-versa.\n Moreover, the challenge of allocating investment opportunities to certain funds may be exacerbated as we expand our business to include more lines of business, including more public vehicles. Allocating investment opportunities appropriately frequently involves significant and subjective judgments. The risk that fund investors or regulators could challenge allocation decisions as inconsistent with our obligations under applicable law, governing fund agreements or our own policies cannot be eliminated. In addition, the perception of \nnon-compliance\n with such requirements or policies could harm our reputation with fund investors. \nWe may also cause different funds to invest in a single portfolio company, for example where the fund that made an initial investment no longer has capital available to invest. We may also cause different funds that we manage to purchase different classes of securities in the same portfolio company. For example, one of our CLO funds could acquire a debt security issued by the same company in which one of our private equity funds owns common equity securities. A direct conflict of interest could arise between the debt holders and the equity holders if such a company were to develop insolvency concerns, and we would have to carefully manage that conflict. A decision to acquire material \nnon-public\n information about a company while pursuing an investment opportunity for a particular fund gives rise to a potential conflict of interest when it results in our having to restrict the ability of other funds to take any action with respect to that company. Our affiliates or portfolio companies may be service providers or counterparties to our funds or portfolio companies and receive fees or other compensation for services that are not shared with our fund investors. In such instances, we may be incentivized to cause our funds or portfolio companies to purchase such services from our affiliates or portfolio companies rather than an unaffiliated service provider despite the fact that a \nthird-party\n service provider could potentially provide higher quality services or offer them at a lower cost. In addition, conflicts of interest may exist in the valuation of our funds’ investments, as well as the personal trading of employees and the allocation of fees and expenses among us, our funds and their portfolio companies, and our affiliates. Lastly, in certain, infrequent instances we may purchase an investment alongside one of our investment funds or sell an investment to one of our investment funds and \n \n54 \nTable of Contents\nconflicts may arise in respect of the allocation, pricing and timing of such investments and the ultimate disposition of such investments. A failure to appropriately deal with these, among other, conflicts, could negatively impact our reputation and ability to raise additional funds or result in potential litigation or regulatory action against us. Further, rules proposed or adopted by the SEC and other measures it takes to preclude or limit certain conflicts of interest may make it more difficult for our funds to pursue transactions that may otherwise be attractive to the fund and its investors, which may adversely impact fund performance. \nConflicts of interest may arise in our allocation of \nco-investment\n opportunities. \nPotential conflicts will arise with respect to our decisions regarding how to allocate \nco-investment\n opportunities among investors and the terms of any such \nco-investments.\n As a general matter, our allocation of \nco-investment\n opportunities is within our discretion and there can be no assurance that \nco-investment\n opportunities of any particular type or amount will become available to any of our investors. We may take into account a variety of factors and considerations we deem relevant in allocating \nco-investment\n opportunities, including, without limitation, whether a potential \nco-investor\n has expressed an interest in evaluating \nco-investment\n opportunities, our assessment of a potential \nco-investor’s\n ability to invest an amount of capital that fits the needs of the investment and our assessment of a potential \nco-investor’s\n ability to commit to a \nco-investment\n opportunity within the required timeframe of the particular transaction. \nOur fund documents typically do not mandate specific allocations with respect to \nco-investments.\n The investment advisers of our funds may have an incentive to provide potential \nco-investment\n opportunities to certain investors in lieu of others and/or in lieu of an allocation to our funds, including, for example, as part of an investor’s overall strategic relationship with us, or if such allocations are expected to generate relatively greater fees or Performance Allocations to us than would arise if such \nco-investment\n opportunities were allocated otherwise. At the same time, we may have an incentive to offer \nco-investment\n opportunities to our funds in lieu of (or to an extent that reduces the amount available to) coinvestors, particularly as we expand the number and type of private wealth products we offer. \nAs a general matter, \nco-investors\n may bear different fees and expenses than our funds. In certain instances, \nco-investment\n arrangements may be structured through one or more of our investment vehicles, and in such circumstances \nco-investors\n will generally bear the costs and expenses thereof. As a result, there may be conflicts of interest regarding the allocation of costs and expenses between \nco-investors\n and investors in our funds. The terms of any such existing and future \nco-investment\n vehicles may differ materially, and in some instances may be more favorable to us, than the terms of certain of our funds or prior \nco-investment\n vehicles. Such different terms may create an incentive for us to allocate a greater or lesser percentage of an investment opportunity to such \nco-investment\n vehicles. There can be no assurance that any conflicts of interest will be resolved in favor of any particular investment funds or investors (including any applicable \nco-investors).\n As with our investment allocation decisions generally, there is a risk that regulators and/or investors could challenge our allocations of \nco-investment\n opportunities or fees and expenses. \nValuation methodologies for certain assets in our funds can be subject to a significant degree of subjectivity and judgment, and the fair value of assets established pursuant to such methodologies may never be realized, which could result in significant losses for our funds and the reduction of Management Fees and/or Performance Revenues. \nOur investment funds make investments in illiquid investments or financial instruments for which there is little, if any, market activity. We determine the value of such investments and financial instruments on at least a quarterly basis based on the fair value of such investments as determined in accordance with GAAP. The fair value of such investments and financial instruments is generally determined using a primary methodology and corroborated by a secondary methodology. Methodologies are used on a consistent basis and described in Blackstone’s and the investment funds’ valuation policies and governing agreements. \n \n55 \nTable of Contents\nThe determination of fair value using these methodologies takes into consideration a range of factors including, but not limited to, the price at which the investment was acquired, the nature of the investment, local market conditions, trading values on public exchanges for comparable securities, comparable market transactions, current and projected operating performance and financing transactions subsequent to the acquisition of the investment. These valuation methodologies involve a significant degree of subjective management judgment. For example, as to investments that we share with another sponsor, we may apply a different valuation methodology or factors or derive a different value than such other sponsor on the same investment. In addition, the valuations of our private investments may at times differ significantly from the valuations of publicly traded companies in similar sectors or with similar business models. \nFor example, valuations of our private investments do not have an observable market price and may take into account certain \nlong-term\n financial projections or estimates, including those prepared by the management of a portfolio company or other investment. Such projections or estimates may not materialize and are based on significant judgments and assumptions at the time they are developed and may not be available to the public. Valuations of publicly traded companies, on the other hand, are based on the observable price in the reference market which are generally subject to a higher degree of market volatility. These differences, and the potential exercise of our subjective judgment, might cause some investors and/or regulators to question our valuations or methodologies. There can be no assurance that our policies will address all necessary valuation factors or completely eliminate potential conflicts of interest in such determinations. The SEC continues to focus on issues related to valuation of private funds, including consistent application of the methodology, disclosure, and conflicts of interest, in its enforcement, examination, and rulemaking activities. Further, variation in the underlying assumptions, estimates, methodologies and/or judgments we use in the determination of the value of certain investments and financial instruments could potentially produce materially different results. Valuation methodologies may also change from time to time. See “Part II. Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operation — Critical Accounting Policies” for an overview of our fair value policy and the significant judgment required in the application thereof. \nBecause there is significant uncertainty in the valuation of, or in the stability of the value of illiquid investments, the fair values of such investments as reflected in an investment fund’s net asset value do not necessarily reflect the prices that would actually be obtained by us on behalf of the investment fund when such investments are realized. Realizations at values lower than the values at which investments have been reflected in prior fund net asset values would result in reduced gains or losses for the applicable fund, a decline in certain asset management fees and the reduction in potential Performance Revenues. Changes in values of investments from quarter to quarter may result in volatility in our investment funds’ net asset value, our funds’ investment in, or fees from, those funds and the results of operations and cash flow that we report from period to period. Further, a situation where asset values turn out to be materially different than values reflected in prior fund net asset values could cause investors to lose confidence in us, which would in turn result in difficulty in raising additional funds or redemptions from funds where investors hold redemption rights. \nOur use of borrowings to finance our business exposes us to risks. \nWe use borrowings to finance our business operations as a public company. We have numerous outstanding notes with various maturity dates as well as other borrowings, including under the Revolving Credit Facility. As borrowings under the credit facility and our outstanding notes mature, we will be required to refinance or repay such borrowings. In order to do so, we may enter into a new facility, use asset based financing arrangements or issue new notes, each of which could result in higher borrowing costs. We may also issue equity, which would dilute existing stockholders. Further, we may choose to repay such borrowings using cash on hand, cash provided by our continuing operations or cash from the sale of our assets, each of which could reduce the amount of cash available to facilitate the growth and expansion of our businesses, make repurchases under our share repurchase program and pay dividends to our stockholders, operating expenses and other obligations as they arise. In order to obtain new borrowings, or to extend or refinance existing borrowings, we are dependent on the willingness and \n \n56 \nTable of Contents\n \nability of financial institutions such as global banks to extend credit to us on favorable terms or at all, and on our ability to access the debt and equity capital markets, which can be volatile. There is no guarantee that such financial institutions will continue to extend credit to us or that we will be able to access the capital markets to obtain new borrowings or refinance existing borrowings when they mature. In addition, the use of leverage to finance our business exposes us to the types of risk described in “— Dependence on significant leverage in investments by our funds could adversely affect our ability to achieve attractive rates of return on those investments.” \nWe or our funds have and may in the future also enter into “margin loans” whereby we or our funds borrow money from a bank and pledge the equity of the underlying portfolio company or real estate asset as collateral for the loan. The use of margin borrowings results in certain additional risks to the borrower. For example, should the securities pledged to brokers to secure our margin borrowings decline in value, we or our funds could be subject to a “margin call,” pursuant to which we or our funds must either deposit additional funds or securities with the broker, or suffer mandatory liquidation of the pledged securities to compensate for the decline in value. In the event of a sudden drop in the value of our assets, we or our funds might not be able to liquidate assets quickly enough to satisfy margin requirements. See “Part II. Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations — Liquidity and Capital Resources — Sources and Uses of Liquidity” for further information regarding our outstanding borrowings. \nDependence on significant leverage in investments by our funds could adversely affect our ability to achieve attractive rates of return on those investments. \nMany of our funds’ investments rely heavily on the use of leverage, and our ability to achieve attractive rates of return on investments will depend on our ability to access sufficient sources of indebtedness at attractive rates. For example, in many private equity and real estate investments, indebtedness may constitute as much as 70% or more of a portfolio company’s or real estate asset’s total debt and equity capitalization, including debt that may be incurred in connection with the investment. The absence of available sources of sufficient senior debt financing for extended periods of time could therefore materially and adversely affect our private equity and real estate businesses. Furthermore, limits on the deductibility of corporate interest expense could make it more costly to use debt financing for our acquisitions or otherwise have an adverse impact on the cost structure of our transactions, and could therefore adversely affect the returns on our funds’ investments. See “— Changes in U.S. and foreign taxation of businesses and other tax laws, regulations or treaties or an adverse interpretation of these items by tax authorities could adversely affect us, including by adversely impacting our effective tax rate and tax liability.” \nIn addition, an increase in either the general levels of interest rates or in the risk spread demanded by sources of indebtedness would make it more expensive to finance those businesses’ investments. See “— High interest rates and challenging debt market conditions have negatively impacted and could continue to negatively impact the values of certain assets or investments and the ability of our funds and their portfolio companies to access the capital markets, which could adversely affect investment and realization opportunities, lead to \nlower-yielding\n investments and potentially decrease our net income.” \nInvestments in highly leveraged entities are inherently more sensitive to declines in revenues, increases in expenses and interest rates and adverse economic, market and industry developments. The incurrence of a significant amount of indebtedness by an entity could, among other things: \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\ngive rise to an obligation to make mandatory \npre-payments\n of debt using excess cash flow, which might limit the entity’s ability to respond to changing industry conditions to the extent additional cash is needed for the response, to make unplanned but necessary capital expenditures or to take advantage of growth opportunities, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nlimit the entity’s ability to adjust to changing market conditions, thereby placing it at a competitive disadvantage compared to its competitors who have relatively less debt, \n \n57 \nTable of Contents\n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nallow even moderate reductions in operating cash flow to render it unable to service its indebtedness, leading to a bankruptcy or other reorganization of the entity and a loss of part or all of the equity investment in it, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nlimit the entity’s ability to engage in strategic acquisitions that might be necessary to generate attractive returns or further growth and \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nlimit the entity’s ability to obtain additional financing or increase the cost of obtaining such financing, including for capital expenditures, working capital or general corporate purposes. \nAs a result, the risk of loss associated with a leveraged entity is generally greater than for companies with comparatively less debt. \nWhen our funds’ existing portfolio investments reach the point when debt incurred to finance those investments matures in significant amounts and must be either repaid or refinanced, those investments may materially suffer if they have generated insufficient cash flow to repay maturing debt and there is insufficient capacity and availability in the financing markets to permit them to refinance maturing debt on satisfactory terms, or at all. If a limited availability of financing for such purposes were to persist for an extended period of time, when significant amounts of the debt incurred to finance our private equity and real estate funds’ existing portfolio investments came due, these funds could be materially and adversely affected. \nMany of the hedge funds in which our funds of hedge funds invest, our \ncredit-focused\n funds and or CLOs, may choose to use leverage as part of their respective investment programs and regularly borrow a substantial amount of their capital. The use of leverage poses a significant degree of risk and enhances the possibility of a significant loss in the value of the investment portfolio. A fund may borrow money from time to time to purchase or carry securities or may enter into derivative transactions (such as total return swaps) with counterparties that have embedded leverage. The interest expense and other costs incurred in connection with such borrowing may not be recovered by appreciation in the securities purchased or carried and will be lost \n-\n and the timing and magnitude of such losses may be accelerated or exacerbated \n-\n in the event of a decline in the market value of such securities. Gains realized with borrowed funds may cause the fund’s net asset value to increase at a faster rate than would be the case without borrowings. However, if investment results fail to cover the cost of borrowings, the fund’s net asset value could also decrease faster than if there had been no borrowings. \nAny of the foregoing circumstances could have a material adverse effect on our financial condition, results of operations and cash flow. \nThe due diligence process that we undertake in connection with investments by our funds may not reveal all facts and issues that may be relevant in connection with an investment. \nWhen evaluating a potential business or asset for investment, we conduct due diligence that we deem reasonable and appropriate based on the facts and circumstances applicable to such investment. When conducting due diligence, we may be required to evaluate important and complex issues, including but not limited to those related to business, financial, credit risk, tax, accounting, sustainability, legal and regulatory and macroeconomic trends. With respect to sustainability, the nature and scope of our diligence will vary based on the investment, but may include a review of, among other things: energy management, air and water pollution, land contamination, human capital management, human rights, employee health and safety, accounting standards and bribery and corruption. Selecting and evaluating such factors is subjective by nature, and there is no guarantee that the criteria utilized or judgment exercised by Blackstone or a \nthird-party\n specialist (if any) will reflect the policies or preferred practices of any particular investor or align with the practices of other asset managers or with market trends. The materiality of various risks and impact of such risks on an individual potential investment or portfolio as a whole depend on many factors, including the relevant industry, geography and asset class and the nature of the investment. Outside consultants, legal advisers, accountants and investment banks may be involved in the due \n \n58 \nTable of Contents\ndiligence process in varying degrees depending on the type of investment. The due diligence investigation that we will carry out with respect to any investment opportunity may not reveal or highlight all relevant facts (including fraud) or risks that may be necessary or helpful in evaluating such investment opportunity and we may not identify or foresee future developments that could have a material adverse effect on an investment, including, for example, potential factors, such as technological disruption of a specific company or asset, or an entire industry. \nFurther, some matters covered by our diligence, such as sustainability, are continuously evolving and we may not accurately or fully anticipate such evolution. The framework we may use to evaluate certain diligence considerations may not represent a universally recognized standard for assessing such considerations. For example, AIFMD requires us to identify, measure, manage and monitor sustainability risks relevant to the funds managed by our EU AIFMs and take into account sustainability risks when performing investment due diligence. Such requirements may make our funds less attractive to investors, and any \nnon-compliance\n with such requirements may subject us to regulatory action. In addition, when conducting due diligence on investments, including with respect to investments made by our funds of hedge funds in \nthird-party\n hedge funds, we rely on the resources available to us and information supplied by third parties, including information provided by the target of the investment (or, in the case of investments in a \nthird-party\n hedge fund, information provided by such hedge fund or its service providers). The information we receive from third parties may not be accurate or complete and therefore we may not have all the relevant facts and information necessary to properly assess and monitor our funds’ investment. \nWe may be unable to consummate or successfully integrate development opportunities, acquisitions or joint ventures that we pursue. \nWe may from time to time seek to engage in selective development or acquisition of asset management businesses or other businesses complementary to our business where we think we can add substantial value or generate substantial returns. We may not be able to identify or consummate such opportunities, including due to competition for such opportunities, our ability to accurately value such opportunities and the need to negotiate acceptable terms, and obtain requisite approvals and licenses from the relevant governmental authorities, for such opportunities. Moreover, even if we are able to identify and successfully complete an acquisition, we may encounter unexpected difficulties or incur unexpected costs associated with integrating and overseeing the operations of the new businesses. \nWe and our affiliates from time to time are required to report specified dealings or transactions involving Iran or other sanctioned individuals or entities. \nThe Iran Threat Reduction and Syria Human Rights Act of 2012 (“ITRA”) requires companies subject to SEC reporting obligations under Section 13 of the Exchange Act to disclose in their periodic reports specified dealings or transactions involving Iran or other individuals and entities targeted by certain OFAC sanctions, including, by way of example, the Russian Federal Security Service, engaged in by the reporting company or any of its affiliates during the period covered by the relevant periodic report. In some cases, ITRA requires companies to disclose these types of transactions even if they were permissible under U.S. law. Companies that currently may be or may have been at the time considered our affiliates have from time to time publicly filed and/or provided to us the disclosures reproduced on Exhibit 99.1 of our Quarterly Reports as well as Exhibit 99.1 of this annual report, which disclosure is hereby incorporated by reference herein. We do not independently verify or participate in the preparation of these disclosures. We are required to separately file with the SEC a notice when such activities have been disclosed in this report, and the SEC is required to post such notice of disclosure on its website and send the report to the President and certain U.S. Congressional committees. The President thereafter is required to initiate an investigation and, within 180 days of initiating such an investigation, determine whether sanctions should be imposed. Disclosure of such activity, even if such activity is not subject to sanctions under applicable law, and any sanctions actually imposed on us or our affiliates as a result of these activities, could harm our reputation and have a negative impact on our business, and any failure to disclose any such activities as required could additionally result in fines or penalties. \n \n59 \nTable of Contents\nOur asset management activities involve investments in relatively illiquid assets, and we may fail to realize any profits from these activities for a considerable period of time. \nMany of our investment funds invest in securities that are not publicly traded. In many cases, our investment funds may be prohibited by contract or by applicable securities laws from selling such securities for a period of time. Our investment funds will generally not be able to sell these securities publicly unless their sale is registered under applicable securities laws, or unless an exemption from such registration is available. The ability of many of our investment funds, particularly our private equity funds, to dispose of investments is heavily dependent on the public equity markets. For example, the ability to realize any value from an investment may depend upon the ability to complete an initial public offering of the portfolio company in which such investment is held. Even if the securities are publicly traded, large holdings of securities can often be disposed of only over a substantial length of time, exposing the investment returns to risks of downward movement in market prices during the intended disposition period. Moreover, because the investment strategy of many of our funds, particularly our private equity and real estate funds, often entails our having representation on our funds’ public portfolio company boards, our funds may be restricted in their ability to effect such sales during certain time periods. Accordingly, under certain conditions, our investment funds may be forced to either sell securities at lower prices than they had expected to realize or defer \n-\n potentially for a considerable period of time \n-\n sales that they had planned to make. \nWe make investments in companies that are based outside of the United States, which may expose us to additional risks not typically associated with investing in companies that are based in the United States. \nMany of our investment funds invest a significant portion of their assets in the equity, debt, loans or other securities of issuers located outside the United States. International investments have increased and we expect will continue to increase as a proportion of certain of our funds’ portfolios in the future. Investments in \nnon-U.S.\n securities involve certain factors not typically associated with investing in U.S. securities, including risks relating to: \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\ncurrency exchange matters, including fluctuations in currency exchange rates and costs associated with conversion of investment principal and income from one currency into another, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nless developed or efficient financial markets than in the United States, which may lead to potential price volatility and relative illiquidity, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nthe absence of uniform accounting, auditing and financial reporting standards, practices and disclosure requirements and less government supervision and regulation, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nchanges in laws or clarifications to existing laws that could impact our tax treaty positions, which could adversely impact the returns on our funds’ investments, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\na less developed legal or regulatory environment, differences in the legal and regulatory environment or enhanced legal and regulatory compliance, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nheightened exposure to corruption risk in certain \nnon-U.S.\n markets, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\npolitical hostility to investments by foreign or private equity investors, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nreliance on a more limited number of commodity inputs, service providers and/or distribution mechanisms, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nmore volatile or challenging market or economic conditions, including higher rates of inflation, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nhigher transaction costs, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\ndifficulty in enforcing contractual obligations, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nfewer investor protections and less publicly available information about companies, \n \n60 \nTable of Contents\n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\ncertain economic and political risks, including potential exchange control regulations and restrictions on our \nnon-U.S.\n investments and repatriation of profits on investments or of capital invested, the risks of war, terrorist attacks, political, economic or social instability, the possibility of expropriation or confiscatory taxation and adverse economic and political developments and \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nthe possible imposition of \nnon-U.S.\n taxes or withholding on income and gains recognized with respect to such securities. \nIn addition, investments in companies that are based outside of the United States may be negatively impacted by restrictions on international trade or the imposition of tariffs, which have been an area of focus for the current U.S. Presidential administration. See “— Trade negotiations and related government actions may create regulatory uncertainty for our funds’ portfolio companies and our investment strategies and adversely affect the profitability of our funds’ portfolio companies.” \nWe may not have sufficient cash to pay back “clawback” obligations if and when they are triggered under the governing agreements with our investors. \nIn certain circumstances, at the end of the life of a carry fund (and earlier with respect to certain of our funds), we may be obligated to repay the amount by which Performance Allocations that were previously distributed to us exceed the amounts to which the relevant general partner is ultimately entitled on an \nafter-tax\n basis. This includes situations in which the general partner receives in excess of the relevant Performance Allocations applicable to the fund as applied to the fund’s cumulative net profits over the life of the fund or, in some cases, the fund has not achieved investment returns that exceed the preferred return threshold. This obligation is known as a “clawback” obligation and is an obligation of any person who received such Performance Allocations, including us and other participants in our Performance Allocations plans. Although a portion of any dividends by us to our stockholders may include any Performance Allocations received by us, we do not intend to seek fulfillment of any clawback obligation by seeking to have our stockholders return any portion of such dividends attributable to Performance Allocations associated with any clawback obligation. To the extent we are required to fulfill a clawback obligation, however, our board of directors may determine to decrease the amount of our dividends to our stockholders. The clawback obligation operates with respect to a given carry fund’s own net investment performance only and performance of other funds are not netted for determining this contingent obligation. \nAdverse economic conditions may increase the likelihood that one or more of our carry funds may be subject to clawback obligations. To the extent one or more clawback obligations were to occur for any one or more carry funds, we might not have available cash at the time such clawback obligation is triggered to repay the Performance Allocations and satisfy such obligation. If we were unable to repay such Performance Allocations, we would be in breach of the governing agreements with our investors and could be subject to liability. Moreover, although a clawback obligation is several, the governing agreements of most of our funds provide that to the extent another recipient of Performance Allocations (such as a current or former employee) does not fund his or her respective share, then we and our employees who participate in such Performance Allocations plans may have to fund additional amounts (generally an additional \n50-70%\n beyond our \npro-rata\n share of such obligations) beyond what we actually received in Performance Allocations. Although we retain the right to pursue any remedies that we have under such governing agreements against those Performance Allocations recipients who fail to fund their obligations, we may not be successful in recovering such amounts. \nInvestors in a number of our vehicles may withdraw their investments, and investors in certain of our vehicles may have a right to terminate our management of, or cause the dissolution of, such vehicles, which would lead to a decrease in our revenues. \nWe have a number of vehicles that permit investors in such vehicles to withdraw their investments and/or terminate our management of such capital, as applicable and in certain cases, subject to certain limitations. Investors in our hedge funds may generally redeem their investments on a periodic basis following, in certain cases, \n \n61 \nTable of Contents\n \nthe expiration of a specified period of time when capital may not be withdrawn, subject to the applicable fund’s specific redemption provisions. In addition, in certain other \nopen-ended\n and/or perpetual capital vehicles, including certain of our investment vehicles that are available to individual investors, such as BREIT, BCRED and BXPE, investors may request redemptions or repurchases of their interests on a periodic basis, subject to certain limitations. During periods of market volatility, investor subscriptions to such vehicles are likely to be reduced, and investor redemption or repurchase requests are likely to be elevated, which may negatively impact the fees we earn from such vehicles. In a declining market, our liquid or \nsemi-liquid\n vehicles have and may continue to experience declines in value, which may be provoked and/or exacerbated by margin calls and forced selling of assets. Investors may also seek to redeem their interests due to changes in interest rates that make other investments more attractive, rebalancing of their asset allocations, changes in investor perception of us and our reputation, unhappiness with a fund’s performance or investment strategy, departures or changes in responsibilities of key investment professionals, and liquidity needs. \nTo the extent appropriate and permissible under a vehicle’s constituent documents, we have previously and may in the future limit or prorate redemptions or repurchases in such vehicle for a period of time. This may subject us to reputational harm, make such vehicles less attractive to investors in the future and negatively impact future subscriptions to such vehicles. This could have a material adverse effect on the revenues we derive from such vehicles. For example, market volatility drove a material increase in BREIT repurchase requests beginning in late 2022, and pursuant to the terms of the vehicle, BREIT began to prorate such requests beginning in November 2022. BREIT inflows also materially declined after proration was announced, which led to net outflows in BREIT. The inclusion of redemption features in investment vehicles creates heightened risk of operational error, including with respect to the calculation of net asset values, which could expose us to increased risk of litigation, regulatory action and reputational damage. \nIn addition, we currently manage a significant portion of investor assets through separately managed accounts whereby we earn management and/or incentive fees, and we intend to continue to seek additional separately managed account mandates. The investment management agreements we enter into in connection with managing separately managed accounts on behalf of certain clients may be terminated by such clients on as little as 30 days’ prior written notice. In addition, the boards of directors of the investment management companies we manage could terminate our advisory engagement of those companies, on as little as 30 days’ prior written notice. In the case of any such terminations, the management and incentive fees we earn in connection with managing such account or company would immediately cease, which could result in a significant adverse impact on our revenues. \nThe governing agreements of many of our investment funds provide that, subject to certain conditions, \nthird-party\n investors in those funds have the right to remove the general partner of the fund or to accelerate the termination date of the investment fund without cause by a majority or supermajority vote, resulting in a reduction in management fees we would earn from such investment funds and a significant reduction in the amounts of Performance Revenues from those funds. Performance Revenues could be significantly reduced as a result of our inability to maximize the value of investments by an investment fund during the liquidation process or in the event of the triggering of a “clawback” obligation or a recoupment of loss carry forward amounts. In addition, the governing agreements of our investment funds provide that in the event certain “key persons” in our investment funds do not meet specified time commitments with regard to managing the fund, then investors in certain funds have the right to vote to terminate the investment period by a specified percentage (including, in certain cases, a simple majority) vote in accordance with specified procedures, accelerate the withdrawal of their capital on an \ninvestor-by-investor\n basis, or the fund’s investment period will automatically terminate and a specified percentage (including, in certain cases, a simple majority) vote of investors is required to restart it. In addition, the governing agreements of some of our investment funds provide that investors have the right to terminate, for any reason, the investment period by a vote of 75% of the investors in such fund. In addition to having a significant negative impact on our revenue, net income and cash flow, the occurrence of such an event with respect to any of our investment funds would likely result in significant reputational damage to us. \n \n62 \nTable of Contents\nIn addition, because our investment funds have advisers that are registered under the Advisers Act, an “assignment” of the management agreements of our investment funds (which may be deemed to occur in the event these advisers were to experience a change of control) would generally be prohibited without consent of the investment fund, which may require investor consent. We cannot be certain that consents required for assignments of our investment management agreements will be obtained if a change of control occurs, which could result in the termination of such agreements and the corresponding loss of revenue. In addition, with respect to our 1940 Act registered funds, the continuance of each investment fund’s investment management agreement generally must be approved annually by the fund’s board of directors, including independent members of such fund’s board of directors and, in certain cases, by its stockholders, as required by law. Termination of these agreements would cause us to lose the fees we earn from such investment funds. \nThird-party investors in our investment funds with commitment-based structures may not satisfy their contractual obligation to fund capital calls when requested by us, which could adversely affect a fund’s operations and performance. \nInvestors in all of our carry funds (and certain of our hedge funds) make capital commitments to those funds that we are entitled to call from those investors at any time during prescribed periods. We depend on investors fulfilling their commitments when we call capital from them in order for those funds to consummate investments and otherwise pay their obligations (for example, management fees) when due. A default by an investor may also limit a fund’s availability to incur borrowings and avail itself of what would otherwise have been available credit. We have not had investors default on capital calls to any meaningful extent. Any investor that did not fund a capital call would generally be subject to several possible penalties, including having a significant amount of its existing investment forfeited in that fund. However, the impact of the forfeiture penalty is directly correlated to the amount of capital previously invested by the investor in the fund and if an investor has invested little or no capital, for instance early in the life of the fund, then the forfeiture penalty may not be as meaningful. \nThird-party\n investors in carry funds typically use distributions from prior investments to meet future capital calls. In cases where valuations of investors’ existing investments fall and the pace of distributions slows, investors may be unable to make new commitments to \nthird-party\n managed investment funds such as those advised by us. If investors were to fail to satisfy a significant amount of capital calls for any particular fund or funds, the operation and performance of those funds could be materially and adversely affected. \nRisk management activities may adversely affect the return on our funds’ investments. \nWhen managing our exposure to market risks, we may (on our own behalf or on behalf of our funds) from time to time use forward contracts, options, swaps, caps, collars and floors or pursue other strategies or use other forms of derivative instruments to limit our exposure to changes in the relative values of investments that may result from market developments, including changes in prevailing interest rates, currency exchange rates and commodity prices. The use of derivative financial instruments and other risk management strategies may not be properly designed to hedge, manage or otherwise reduce the risks we have identified. In addition, we may not be able to identify, or may not have fully identified, all applicable material market risks to which we are exposed. We may also choose not to hedge, in whole or in part, any of the risks that have been identified. The success of any hedging or other derivatives transactions generally will depend on our ability to correctly predict market changes, the degree of correlation between price movements of a derivative instrument, the position being hedged, the creditworthiness of the counterparty and other factors, some of which may be beyond our ability to hedge. As a result, while we may enter into a transaction in order to reduce our exposure to market risks, the unintended market changes may result in poorer overall investment performance than if it had not been executed. Such transactions may also limit the opportunity for gain if the value of a hedged position increases. \nWhile such hedging arrangements may reduce certain risks, such arrangements themselves may entail certain other risks. These arrangements may require the posting of cash collateral at a time when a fund has insufficient cash or illiquid assets such that the posting of the cash is either impossible or requires the sale of assets at prices \n \n63 \nTable of Contents\nthat do not reflect their underlying value. In addition, if our derivative counterparties or clearinghouses fail to meet their obligations with respect to the posting of cash collateral, our efforts to mitigate certain risks may be ineffective. Moreover, these hedging arrangements may generate significant transaction costs, including potential tax costs, that reduce the returns generated by a fund. \nFinally, the regulation of derivatives and commodity interest transactions in the United States and other countries is a rapidly changing area of law and is subject to ongoing modification by governmental and judicial action. Newly instituted and amended regulations could significantly increase the cost of entering into derivative contracts (including through requirements to post collateral, which could negatively impact available liquidity), materially alter the terms of derivative contracts, reduce the availability of derivatives to protect against risks, reduce our ability to restructure our existing derivative contracts and increase our exposure to less creditworthy counterparties. Furthermore, the CFTC may in the future require certain foreign exchange products to be subject to mandatory clearing, which could increase the cost of entering into currency hedges. \nOur real estate funds are subject to the risks inherent in the ownership and operation of real estate and the construction and development of real estate. \nInvestments by our real estate funds will be subject to the risks inherent in the ownership and operation of real estate and real \nestate-related\n businesses and assets. Such investments are subject to the potential for deterioration of real estate fundamentals and the risk of adverse changes in local market and economic conditions, which may include changes in supply of and demand for competing properties in an area, increases in interest rates and borrowing costs, fluctuations in the average occupancy and room rates for hotel properties, changes in demand for commercial office properties (including as a result of an increased prevalence of remote work), changes in the financial resources of tenants, defaults by borrowers or tenants, depressed travel activity, and the lack of availability of mortgage funds, which may render the sale or refinancing of properties difficult or impracticable. In addition, investments in real estate and real \nestate-related\n businesses and assets may be subject to the risk of environmental liabilities, contingent liabilities upon disposition of assets, casualty or condemnations losses, energy and supply shortages, natural disasters, climate change related risks (including \nclimate-related\n transition risks and acute and chronic physical risks), acts of god, terrorist attacks, war, pandemics or other severe public health events, such as \nCOVID-19,\n and other events that are beyond our control, and various uninsured or uninsurable risks. Further, investments in real estate and real \nestate-related\n businesses and assets are subject to changes in law and regulation, including in respect of building, environmental and zoning laws, rent control and other regulations impacting our residential real estate investments and changes to tax laws and regulations, including real property and income tax rates and the taxation of business entities and the deductibility of corporate interest expense. For example, we have seen an increasing focus toward rent regulation as a means to address residential affordability caused by undersupply of housing in certain markets in the U.S. and Europe, which may contribute to adverse operating performance in certain parts of our residential real estate portfolio, including by moderating rent growth in certain geographies and markets. In addition, to the extent our real estate funds acquire direct or indirect interests in undeveloped land or underdeveloped real property, which may often be \nnon-income\n producing, they will be subject to the risks normally associated with such assets and development activities, including risks relating to the availability and timely receipt of zoning and other regulatory or environmental approvals, the cost and timely completion of construction (including risks beyond the control of our funds, such as weather or labor conditions or material shortages) and the availability of both construction and permanent financing on favorable terms. \n \n64 \nTable of Contents\nCertain of our investment funds may invest in securities of companies that are experiencing significant financial or business difficulties, including companies involved in bankruptcy or other reorganization and liquidation proceedings. Such investments are subject to a greater risk of poor performance or loss. \nCertain of our investment funds, especially our \ncredit-focused\n funds, may invest in business enterprises involved in \nwork-outs,\n liquidations, \nspin-offs,\n reorganizations, bankruptcies and similar transactions and may purchase \nhigh-risk\n receivables. An investment in such business enterprises entails the risk that the transaction in which such business enterprise is involved either will be unsuccessful, will take considerable time or will result in a distribution of cash or a new security the value of which will be less than the purchase price to the fund of the security or other financial instrument in respect of which such distribution is received. In addition, if an anticipated transaction does not in fact occur, the fund may be required to sell its investment at a loss. Investments in troubled companies may also be adversely affected by U.S. federal and state laws relating to, among other things, fraudulent conveyances, voidable preferences, lender liability and a bankruptcy court’s discretionary power to disallow, subordinate or disenfranchise particular claims. Investments in securities and private claims of troubled companies made in connection with an attempt to influence a restructuring proposal or plan of reorganization in a bankruptcy case may also involve substantial litigation. Because there is substantial uncertainty concerning the outcome of transactions involving financially troubled companies, there is a potential risk of loss by a fund of its entire investment in such company. Adverse publicity and investor perceptions, whether or not based on fundamental analysis, may also decrease the value and liquidity of securities rated below investment grade or otherwise adversely affect our reputation. \nIn addition, at least one federal Circuit Court has determined that an investment fund could be liable for ERISA Title IV pension obligations (including withdrawal liability incurred with respect to union multiemployer plans) of its portfolio companies, if such fund is a “trade or business” and the fund’s ownership interest in the portfolio company is significant enough to bring the investment fund within the portfolio company’s “controlled group.” While a number of cases have held that managing investments is not a “trade or business” for tax purposes, the Circuit Court in this case concluded the investment fund could be a “trade or business” for ERISA purposes based on certain factors, including the fund’s level of involvement in the management of its portfolio companies and the nature of its management fee arrangements. Litigation related to the Circuit Court’s decision suggests that additional factors may be relevant for purposes of determining whether an investment fund could face “controlled group” liability under ERISA, including the structure of the investment and the nature of the fund’s relationship with other affiliated investors and \nco-investors\n in the portfolio company. Moreover, regardless of whether an investment fund is determined to be a “trade or business” for purposes of ERISA, a court might hold that one of the fund’s portfolio companies could become jointly and severally liable for another portfolio company’s unfunded pension liabilities pursuant to the ERISA “controlled group” rules, depending upon the relevant investment structures and ownership interests as noted above. \nInvestments in energy, manufacturing, infrastructure, real estate and certain other assets may expose us to increased environmental liabilities that are inherent in the ownership of real assets. \nOwnership of real assets in our funds or vehicles may increase our risk of direct and/or indirect liability under environmental laws that impose, regardless of fault, joint and several liability for the cost of remediating contamination and compensation for damages. In addition, changes in environmental laws or regulations (including climate change initiatives) or the environmental condition of an investment may create liabilities that did not exist at the time of acquisition. Even in cases where we are indemnified by a seller against liabilities arising out of violations of environmental laws and regulations, there can be no assurance as to the financial viability of the seller to satisfy such indemnities or our ability to achieve enforcement of such indemnities. See “—Climate change, climate and \nsustainability-related\n regulation and sustainability concerns could adversely affect our businesses and the operations of our funds’ portfolio companies, and any actions we take or fail to take in response to such matters could damage our reputation.” \nInvestments by our funds in the power and energy industries involve various operational, construction, regulatory and market risks. \nThe development, operation and maintenance of power and energy generation facilities involves many risks, including, as applicable, labor issues, \nstart-up\n risks, breakdown or failure of facilities, lack of sufficient capital to maintain the facilities and the dependence on a specific fuel source. Power and energy generation facilities in \n \n65 \nTable of Contents\nwhich our funds invest are also subject to risks associated with volatility in the price of fuel sources and the impact of unusual or adverse weather conditions or other natural events, such as droughts, wildfires or hurricanes, as well as the risk of performance below expected levels of output, efficiency or reliability. The occurrence of any such items could result in lost revenues and/or increased expenses. In turn, such developments could impair a portfolio company’s ability to repay its debt or conduct its operations. We may also choose or be required to decommission a power generation facility or other asset. The decommissioning process could be protracted and result in the incurrence of significant financial and/or regulatory obligations or other uncertainties. \nOur power and energy sector portfolio companies may also face construction risks typical for power generation and related infrastructure businesses. Such developments could result in substantial unanticipated delays or expenses and, under certain circumstances, could prevent completion of construction activities once undertaken. Delays in the completion of any power project may result in lost revenues or increased expenses, including higher operation and maintenance costs related to such portfolio company. \nThe power and energy sectors are the subject of substantial and complex laws, rules and regulation by various federal and state regulatory agencies. Failure to comply with applicable laws, rules and regulations could result in the prevention of operation of certain facilities or the prevention of the sale of such a facility to a third party, as well as the loss of certain rate authority, refund liability, penalties and other remedies. Each of these could result in additional costs to a portfolio company and adversely affect investment results. In addition, the increased scrutiny placed by regulators, elected officials and certain investors with respect to the incorporation of sustainability factors in the investment process and the impact of certain investments made by our energy funds has negatively impacted and is likely to continue to negatively impact our ability to exit certain of our conventional energy investments on favorable terms. The current U.S. Presidential administration and certain members of the U.S. Congress have expressed support for the repeal of subsidies provided to the clean energy sector by the Inflation Reduction Act of 2022. Conversely, legislative efforts by either party to overturn or modify policies or regulations enacted by the prior administration could adversely affect our certain investments, including our alternative energy investments. Additionally, certain investors have raised concerns as to whether the incorporation of sustainability factors in the investment and portfolio management process may be inconsistent with the fiduciary duty to maximize returns for investors, which may result in such investors calling into question certain \nnon-conventional\n energy investments made by our energy funds. \nIn addition, the performance of the investments made by our credit and equity funds in the energy and natural resources markets are also subject to a high degree of market risk, as such investments are likely to be directly or indirectly substantially dependent upon prevailing prices of oil, natural gas and other commodities. Oil and natural gas prices are subject to wide fluctuation in response to factors beyond the control of us or our funds’ portfolio companies, including relatively minor changes in the supply and demand for oil and natural gas, market uncertainty, the level of consumer product demand, weather conditions, climate change initiatives, governmental regulation (including with respect to trade and economic sanctions), the price and availability of alternative fuels, political and economic conditions in oil producing countries, foreign supply of such commodities and overall domestic and foreign economic conditions. These factors make it difficult to predict future commodity price movements with any certainty. \nOur funds’ investments in infrastructure assets may expose us to increased risks that are inherent in the ownership of real assets. \nInvestments in infrastructure assets may expose us to increased risks that are inherent in the ownership of real assets. For example, \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nOwnership of infrastructure assets may present risk of liability for personal and property injury or impose significant operating challenges and costs with respect to, for example, compliance with zoning, environmental or other applicable laws. \n \n66 \nTable of Contents\n \n\n\n\n\n\n\n\n\n•\n\n\n \n\n\nInfrastructure asset investments may face construction risks including, without limitation: (a) labor disputes, shortages of material and skilled labor, or work stoppages, (b) slower than projected construction progress and the unavailability or late delivery of necessary equipment, (c) less than optimal coordination with public utilities in the relocation of their facilities, (d) adverse weather conditions and unexpected construction conditions, (e) accidents or the breakdown or failure of construction equipment or processes, and (f) catastrophic events such as explosions, fires, terrorist attacks and other similar events. These risks could result in substantial unanticipated delays or expenses (which may exceed expected or forecasted budgets) and, under certain circumstances, could prevent completion of construction activities once undertaken. Certain infrastructure asset investments may remain in construction phases for a prolonged period and, accordingly, may not be cash generative for a prolonged period. Recourse against the contractor may be subject to liability caps or may be subject to default or insolvency on the part of the contractor. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nThe operation of infrastructure assets is exposed to potential unplanned interruptions caused by significant catastrophic or force majeure events. These risks could, among other effects, adversely impact the cash flows available from investments in infrastructure assets, cause personal injury or loss of life, damage property, or instigate disruptions of service. In addition, the cost of repairing or replacing damaged assets could be considerable. Repeated or prolonged service interruptions may result in permanent loss of customers, litigation, or penalties for regulatory or contractual \nnon-compliance.\n Force majeure events that are incapable of, or too costly to, cure may also have a permanent adverse effect on an investment. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nThe management of the business or operations of an infrastructure asset may be contracted to a \nthird-party\n management company unaffiliated with us. Although it would be possible to replace any such operator, the failure of such an operator to adequately perform its duties or to act in ways that are in our best interest, or the breach by an operator of applicable agreements or laws, rules and regulations, could have an adverse effect on the investment’s financial condition or results of operations. Infrastructure investments may involve the subcontracting of design and construction activities in respect of projects, and as a result our funds’ investments are subject to the risks that contractual provisions passing liabilities to a subcontractor could be ineffective, the subcontractor fails to perform services which it has agreed to perform and the subcontractor becomes insolvent. \nInfrastructure investments often involve an ongoing commitment to a municipal, state, federal or foreign government or regulatory agencies. The nature of these obligations exposes us to a higher level of regulatory control than typically imposed on other businesses and may require us to rely on complex government licenses, concessions, leases or contracts, which may be difficult to obtain or maintain. Such licenses, concessions, leases or contracts may also be terminated for convenience without adequate compensation. Further, many of our funds’ investments are in critical infrastructure sectors, such as transportation systems, energy and digital infrastructure, which are generally subject to heightened regulatory scrutiny at the time of investment and ongoing compliance requirements. Such requirements are likely to expand our compliance burdens, costs and enforcement risks. \nInfrastructure investments may require operators to manage such investments and such operators’ failure to comply with laws, including prohibitions against bribing of government officials, may adversely affect the value of such investments and cause us serious reputational and legal harm. Revenues for such investments may rely on contractual agreements for the provision of services with a limited number of counterparties, and are consequently subject to counterparty default risk. The operations and cash flow of infrastructure investments are also more sensitive to inflation and, in certain cases, commodity price risk. Furthermore, services provided by infrastructure investments may be subject to rate regulations by government entities that determine or limit prices that may be charged. Similarly, users of applicable services or government entities in response to such users may react negatively to any adjustments in rates and thus reduce the profitability of such infrastructure investments. \n \n67 \nTable of Contents\nOur funds’ investments in the life sciences industry may expose us to increased risks. \nInvestments by BXLS may expose us to increased risks. For example, \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nBXLS’s strategies include, among others, investments that are referred to as “corporate partnership” transactions. Corporate partnership transactions are \nrisk-sharing\n collaborations with biopharmaceutical and medical device partners on drug and medical device development programs and investments in royalty streams of \npre-commercial\n biopharmaceutical products. BXLS’s ability to source corporate partnership transactions has been, and will continue to be, in part dependent on the ability of special purpose development companies to identify, diligence, negotiate and in many cases, take the lead in executing the agreed development plans. Moreover, as such special purpose development companies are jointly owned by us or our affiliates and unaffiliated life sciences investors, we (and our funds) are not the sole beneficiaries of such sourcing strategies and capabilities of such special purpose development companies. In addition, payments to BXLS under such corporate partnerships (which can include future royalty or other \nmilestone-based\n payments) are often contingent upon the achievement of certain milestones, including approvals of the applicable product candidate and/or product sales thresholds, over which BXLS may not have the ability to exercise meaningful control. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nLife sciences and healthcare companies are subject to extensive regulation by the U.S. Food and Drug Administration, similar foreign regulatory authorities and, to a lesser extent, other federal and state agencies. These companies are subject to the expense, delay and uncertainty of the product approval process, and there can be no guarantee that a particular product candidate will obtain regulatory approval. In addition, the current regulatory framework may change or additional regulations may arise at any stage during the product development phase of an investment, which may delay or prevent regulatory approval or impact applicable exclusivity periods. If a company in which our funds are invested is unable to obtain regulatory approval for a product candidate, or a product candidate in which our funds are invested does not obtain regulatory approval, in a timely fashion or at all, the value of our fund’s investment would be adversely impacted. In addition, in connection with certain corporate partnership transactions, our special purpose development companies will be contractually obligated to run clinical trials. Further, a clinical trial (including enrollment therein) or regulatory approval process for pharmaceuticals has and may in the future be delayed, otherwise hindered or abandoned as a result of epidemics (including \nCOVID-19),\n which could have a negative impact on the ability of the investment to engage in trials or receive approvals, and thereby could adversely affect the performance of the investment. In the event such clinical trials do not comply with the complicated regulatory requirements applicable thereto, such special purpose development companies may be subject to regulatory actions. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nIntellectual property often constitutes an important part of a life sciences company’s assets and competitive strengths, particularly for royalty monetization and corporate partnership transactions. To the extent such companies’ intellectual property positions with respect to products in which BXLS invests, whether through a royalty monetization or otherwise, are challenged, invalidated or circumvented, the value of BXLS’s investment or BXLS’ rights in a termination event may be impaired. The success of a life sciences investment depends in part on the ability of the biopharmaceutical or medical device companies in whose products BXLS invests to obtain and defend patent rights and other intellectual property rights that are important to the commercialization of such products. The patent positions of such companies can be highly uncertain and often involve complex legal, scientific and factual questions. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nThe commercial success of products could be compromised if governmental or \nthird-party\n payers do not provide coverage and reimbursement, breach, rescind or modify their contracts or reimbursement policies or delay payments for such products. In both the U.S. and foreign markets, the successful sale of a life sciences company’s product depends on the ability to obtain and maintain adequate coverage and reimbursement from \nthird-party\n payers, including government healthcare programs and private insurance plans. Governments and \nthird-party\n payers continue to pursue aggressive initiatives to contain costs and \n \n68 \nTable of Contents\n\n\n\n\n\n\n \n\n\n manage drug utilization and are increasingly focused on the effectiveness, benefits and costs of similar treatments, which could result in lower reimbursement rates and narrower populations for whom the products in which BXLS invests will be reimbursed by \nthird-party\n payers. For example, in the U.S., federal legislation has passed that modifies coverage, reimbursement and pricing policies for certain products. Regulatory agencies have provided guidance on how they intend to implement certain components of the legislation. In addition, the Secretary of the Department of Health and Human Services has indicated the potential for substantial policy and personnel changes. In general, as regulatory agencies and others develop policies and continue to define and implement legislation, such policies and legislation may result in lower product prices, altered market dynamics, lower consumer demand for certain products, or the unavailability of adequate \nthird-party\n payer reimbursement to enable BXLS to realize an appropriate return on its investment. \nOur funds may be forced to dispose of investments at a disadvantageous time. \nOur funds may make investments of which they do not advantageously dispose of prior to the date the applicable fund is dissolved, either by expiration of such fund’s term or otherwise. Although we generally expect that our funds will dispose of investments prior to dissolution or that investments will be suitable for \nin-kind\n distribution at dissolution, we may not be able to do so. The general partners of our funds have only a limited ability to extend the term of the fund with the consent of fund investors or the advisory board of the fund, as applicable, and therefore, we may be required to sell, distribute or otherwise dispose of investments at a disadvantageous time prior to dissolution. This would result in a lower than expected return on the investments and, perhaps, on the fund itself. \nHedge fund investments are subject to numerous additional risks. \nInvestments by our funds of hedge funds in other hedge funds, as well as investments by our \ncredit-focused,\n real estate debt and other hedge funds and similar products, are subject to numerous additional risks, including the following: \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nCertain of the funds in which we invest are newly established funds without any operating history or are managed by management companies or general partners who may not have as significant track records as a more established manager. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nGenerally, the execution of \nthird-party\n hedge funds’ investment strategies is subject to the sole discretion of the management company or the general partner of such funds. As a result, we do not have the ability to control the investment activities of such funds, including with respect to the selection of investment opportunities, any deviation from stated or expected investment strategy, the liquidation of positions and the use of leverage to finance the purchase of investments, each of which may impact our ability to generate a successful return on our fund’s investment in such underlying fund. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nHedge funds may engage in speculative trading strategies, including short selling, which is subject to the theoretically \nunlimited \nrisk of loss because there is no limit on how much the price of a security may appreciate before the short position is closed out. A fund may be subject to losses if a security lender demands return of the lent securities and an alternative lending source cannot be found or if the fund is otherwise unable to borrow securities that are necessary to hedge or cover its positions. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nHedge funds are exposed to the risk that a counterparty will not settle a transaction in accordance with its terms and conditions because of a dispute over the terms of the contract (whether or not bona fide) or because of a credit or liquidity problem or otherwise, thus causing the fund to suffer a loss. Counterparty risk is accentuated for contracts with longer maturities where events may intervene to prevent settlement, or where the fund has concentrated its transactions with a single or small group of counterparties. Generally, hedge funds are not restricted from dealing with any particular counterparty or from concentrating any or all of their transactions with one counterparty. Moreover, the funds’ internal consideration of the creditworthiness of their counterparties may prove insufficient. The absence of a regulated market to facilitate settlement may increase the potential for losses. \n \n69 \nTable of Contents\n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nCredit risk may arise through a default by one of several large institutions that are dependent on one another to meet their liquidity or operational needs, so that a default by one institution causes a series of defaults by the other institutions. This “systemic risk” may adversely affect the financial intermediaries (such as clearing agencies, clearing houses, banks, securities firms and exchanges) with which the hedge funds interact on a daily basis. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nThe efficacy of investment and trading strategies depends largely on the ability to establish and maintain an overall market position in a combination of financial instruments. A hedge fund’s trading orders may not be executed in a timely and efficient manner due to various circumstances, including systems failures or human error. In such event, the funds might only be able to acquire some but not all of the components of the position, or if the overall position were to need adjustment, the funds might not be able to make such adjustment. As a result, the funds would not be able to achieve the market position selected by the management company or general partner of such funds, and might incur a loss in liquidating their position. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nHedge funds are subject to risks due to potential illiquidity of assets. Hedge funds may make investments or hold trading positions in markets that are volatile and which may become illiquid. Timely divestiture or sale of trading positions can be impaired by decreased trading volume, increased price volatility, concentrated trading positions, limitations on the ability to transfer positions in highly specialized or structured transactions to which they may be a party, and changes in industry and government regulations. It may be impossible or costly for hedge funds to liquidate positions rapidly in order to meet margin calls, withdrawal requests or otherwise, particularly if there are other market participants seeking to dispose of similar assets at the same time or the relevant market is otherwise moving against a position or in the event of trading halts or daily price movement limits on the market or otherwise. Any “gate” or similar limitation on withdrawals with respect to hedge funds may not be effective in mitigating such risk. Moreover, these risks may be exacerbated for our funds of hedge funds. For example, if one of our funds of hedge funds were to invest a significant portion of its assets in two or more hedge funds that each had illiquid positions in the same issuer, the illiquidity risk for our funds of hedge funds would be compounded. For example, in 2008 many hedge funds, including some of our hedge funds, experienced significant declines in value. In many cases, these declines in value were both provoked and exacerbated by margin calls and forced selling of assets. Moreover, certain of our funds of hedge funds were invested in \nthird-party\n hedge funds that halted redemptions in the face of illiquidity and other issues, which precluded those funds of hedge funds from receiving their capital back on request. \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nHedge fund investments are subject to risks relating to investments in commodities, futures, options and other derivatives, the prices of which are highly volatile and may be subject to the theoretically unlimited risk of loss in certain circumstances, including if the fund writes a call option. Price movements of commodities, futures and options contracts and payments pursuant to swap agreements are influenced by, among other things, interest rates, changing supply and demand relationships, trade, fiscal, monetary and exchange control programs and policies of governments and national and international political and economic events and policies. The value of futures, options and swap agreements also depends upon the price of the commodities underlying them and prevailing exchange rates. In addition, hedge funds’ assets are subject to the risk of the failure of any of the exchanges on which their positions trade or of their clearinghouses or counterparties. Most U.S. commodities exchanges limit fluctuations in certain commodity interest prices during a single day by imposing “daily price fluctuation limits” or “daily limits,” the existence of which may reduce liquidity or effectively curtail trading in particular markets. As a result of their affiliation with us, our hedge funds may from time to time be restricted from trading in certain securities (e.g., publicly traded securities issued by our current or potential portfolio companies). This may limit their ability to acquire and/or subsequently dispose of investments in connection with transactions that would otherwise generally be permitted in the absence of such affiliation. In addition, the use of leverage by the hedge funds in which our funds of hedge funds invest poses additional risks, including those described in “— Dependence on significant leverage in investments by our funds could adversely affect our ability to achieve attractive rates of return on those investments.” \n \n70 \nTable of Contents\nWe are reliant on third-party service providers for certain aspects of our business, and are subject to risks in using prime brokers, custodians, counterparties, administrators and other agents. \nWe are reliant on other \nthird-party\n service providers for certain technology platforms that facilitate the continued operation of our business, including \ncloud-based\n services. We generally have less control over the delivery of such \nthird-party\n services, and as a result, may face disruptions to our ability to operate our business as a result of interruptions of such services. A prolonged global failure of cloud services provided to us could result in cascading systems failures. In addition, we may not be able to adapt our information systems and technology to accommodate our growth, or the cost of maintaining such systems may increase materially from its current level, which could have a material adverse effect on us. \nMany of our funds depend on the services of prime brokers, custodians, counterparties, administrators and other agents, including to carry out certain securities and derivatives transactions. The terms of these contracts are often customized and complex, and many of these arrangements occur in markets or relate to products that are subject to limited or no regulatory oversight. Some of our funds utilize prime brokerage arrangements with a relatively limited number of counterparties, which has the effect of concentrating the transaction volume (and related counterparty default risk) of these funds with these counterparties. Our funds are subject to the risk that the counterparty to one or more of these contracts defaults, either voluntarily or involuntarily, on its performance under the contract. Any such default may occur suddenly and without notice to us. Moreover, if a counterparty defaults, we may be unable to take action to cover our exposure, either because we lack contractual recourse or because market conditions make it difficult to take effective action. This inability could occur in times of market stress, which is when defaults are most likely to occur. \nIn addition, our risk management process may not accurately anticipate the impact of market stress or counterparty financial condition, and as a result, we may not have taken sufficient action to reduce our risks effectively. Default risk may arise from events or circumstances that are difficult to detect, foresee or evaluate. In addition, concerns about, or a default by, one large participant could lead to significant liquidity problems for other participants, which may in turn expose us to significant losses. Although we have risk management processes to ensure that we are not exposed to a single counterparty for significant periods of time, given the large number and size of our funds, we often have large positions with a single counterparty. For example, most of our funds have credit lines. If the lender under one or more of those credit lines were to become insolvent, we may have difficulty replacing the credit line and one or more of our funds may face liquidity problems. \nIn the event of a counterparty default, particularly a default by a major investment bank or a default by a counterparty to a significant number of our contracts, one or more of our funds may have outstanding trades that they cannot settle or are delayed in settling. As a result, these funds could incur material losses and the resulting market impact of a major counterparty default could harm our businesses, results of operation and financial condition. In addition, under certain local clearing and settlement regimes in Europe, we or our funds could be subject to settlement discipline fines. See “— Complex regulatory regimes and potential regulatory changes in jurisdictions outside the United States could adversely affect our business.” \nIn the event of the insolvency of a prime broker, custodian, counterparty or any other party that is holding assets of our funds as collateral, our funds might not be able to recover equivalent assets in full as they will rank among the prime broker’s, custodian’s or counterparty’s unsecured creditors in relation to the assets held as collateral. In addition, our funds’ cash held with a prime broker, custodian or counterparty generally will not be segregated from the prime broker’s, custodian’s or counterparty’s own cash, and our funds may therefore rank as unsecured creditors in relation thereto. If our derivatives transactions are cleared through a derivatives clearing organization, the CFTC has issued final rules regulating the segregation and protection of collateral posted by customers of cleared and uncleared swaps. The CFTC is also working to provide new guidance regarding prime broker arrangements and intermediation generally with regard to trading on swap execution facilities. \n \n71 \nTable of Contents\n \nThe counterparty risks that we face have increased in complexity and magnitude over time. For example, in certain areas the number of counterparties we face has increased and may continue to increase, which may result in increased complexity and monitoring costs. Conversely, in certain other areas, the consolidation and elimination of counterparties has increased our concentration of counterparty risk and decreased the universe of potential counterparties, and our funds are generally not restricted from dealing with any particular counterparty or from concentrating any or all of their transactions with one counterparty. In addition, counterparties have in the past and may in the future react to market volatility by tightening underwriting standards and increasing margin requirements for all categories of financing, which may decrease the overall amount of leverage available and increase the costs of borrowing. \nUnderwriting activities by our capital markets services business expose us to risks. \nBlackstone Securities Partners L.P. may act as an underwriter, syndicator or placement agent in securities offerings and, through affiliated entities, loan syndications. We may incur losses and be subject to reputational harm to the extent that, for any reason, we are unable to sell securities or indebtedness we purchased or placed as an underwriter, syndicator or placement agent at the anticipated price levels or at all. As an underwriter, syndicator or placement agent, we also may be subject to liability for material misstatements or omissions in prospectuses and other offering documents relating to offerings we underwrite, syndicate or place. \nRisks Related to Our Organizational Structure \nWe are not required to comply with certain provisions of U.S. securities laws relating to proxy statements and certain related matters. This, coupled with the significant voting power of holders of our Series I preferred stock and Series II preferred stock, may limit the ability of holders of our common stock to influence our business. \nHolders of our common stock are entitled to vote pursuant to Delaware law with respect to: \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nA conversion of the legal entity form of Blackstone, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nA transfer, domestication or continuance of Blackstone to a foreign jurisdiction, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nAny amendment of our certificate of incorporation to change the par value of our common stock or the powers, preferences or special rights of our common stock in a way that would affect our common stock adversely, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nAny amendment of our certificate of incorporation that requires for action the vote of a greater number or portion of the holders of common stock than is required by any section of Delaware law, and \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nAny amendment of our certificate of incorporation to elect to become a close corporation under Delaware law. \nIn addition, our certificate of incorporation provides voting rights to holders of our common stock on the following additional matters: \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nA sale, exchange or disposition of all or substantially all of our assets, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nA merger, consolidation or other business combination, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nAny amendment of our certificate of incorporation or bylaws enlarging the obligations of the common stockholders, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nAny amendment of our certificate of incorporation requiring the vote of the holders of a percentage of the voting power of the outstanding common stock and Series I preferred stock, voting together as a single class, to take any action in a manner that would have the effect of reducing such voting percentage and \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nAny amendments of our certificate of incorporation that are not included in the specified set of amendments that the Series II Preferred Stockholder has the sole right to vote on. \n \n72 \nTable of Contents\nFurthermore, our certificate of incorporation provides that the holders of at least 66 2/3% of the voting power of the outstanding shares of common stock and Series I preferred stock may vote to require the Series II Preferred Stockholder to transfer its shares of Series II preferred stock to a successor Series II Preferred Stockholder designated by the holders of at least a majority of the voting power of the outstanding shares of common stock and Series I preferred stock. \nOther matters that are required to be submitted to a vote of the holders of our common stock generally require the approval of a majority of the voting power of our outstanding shares of common stock and Series I preferred stock, voting together as a single class, including certain sales, exchanges or other dispositions of all or substantially all of our assets, a merger, consolidation or other business combination, certain amendments to our certificate of incorporation and the designation of a successor Series II Preferred Stockholder. Holders of our Series I preferred stock, as such, will collectively be entitled to a number of votes equal to the aggregate number of Blackstone Holdings Partnership Units held by the limited partners of the Blackstone Holdings Partnerships on the relevant record date and will vote together with holders of our common stock as a single class. As of February 21, 2025, Blackstone Partners L.L.C., an entity owned by the senior managing directors of Blackstone and controlled by Mr. Schwarzman, owned the only share of Series I preferred stock outstanding, representing approximately 38.5% of the total combined voting power of the common stock and Series I preferred stock, taken together. \nOur certificate of incorporation and bylaws contain additional provisions affecting the holders of our common stock, including certain limits on the ability of the holders of our common stock to call meetings, to acquire information about our operations and to influence the manner or direction of our management. In addition, any person that beneficially owns 20% or more of the common stock then outstanding (other than the Series II Preferred Stockholder or its affiliates, a direct or subsequently approved transferee of the Series II Preferred Stockholder or its affiliates or a person or group that has acquired such stock with the prior approval of our board of directors) is unable to vote such stock on any matter submitted to such stockholders. \nMoreover, we are not required to file proxy statements or information statements under Section 14 of the Exchange Act except in circumstances where a vote of holders of our common stock is required under our certificate of incorporation or Delaware law, such as a merger, business combination or sale of all or substantially all of our assets. In addition, we will generally not be subject to the \n“say-on-pay”\n and \n“say-on-frequency”\n provisions of the \nDodd-Frank\n Act. As a result, our common stockholders do not have an opportunity to provide a \nnon-binding\n vote on the compensation of our named executive officers. Moreover, holders of our common stock are not able to bring matters before our annual meeting of stockholders or nominate directors at such meeting, nor are they generally able to submit stockholder proposals under Rule \n14a-8\n of the Exchange Act. \nAs a result, the holders of our common stock may be limited in their ability to influence our business. See “—Potential conflicts of interest may arise among the Series II Preferred Stockholder and the holders of our common stock.” \nWe are a controlled company and as a result qualify for some exceptions from certain corporate governance and other requirements of the New York Stock Exchange. \nBecause the Series II Preferred Stockholder holds more than 50% of the voting power for the election of directors, we are a “controlled company” and fall within exceptions from certain corporate governance and other requirements of the rules of the New York Stock Exchange. Pursuant to these exceptions, controlled companies \n \n73 \nTable of Contents\nmay elect not to comply with certain corporate governance requirements of the New York Stock Exchange, including the requirements (a) that a majority of our board of directors consist of independent directors, (b) that we have a nominating and corporate governance committee that is composed entirely of independent directors, (c) that we have a compensation committee that is composed entirely of independent directors and (d) that the compensation committee be required to consider certain independence factors when engaging compensation consultants, legal counsel and other committee advisers. While we currently have a majority independent board of directors, we have elected to avail ourselves of the other exceptions. Accordingly, our common stockholders generally do not have the same protections afforded to stockholders of companies that are subject to all of the corporate governance requirements of the NYSE. \nPotential conflicts of interest may arise among the Series II Preferred Stockholder and the holders of our common stock. \nBlackstone Group Management L.L.C., an entity owned by senior managing directors of Blackstone and controlled by Mr. Schwarzman, is the sole holder of the Series II Preferred stock. As a result, conflicts of interest may arise among the Series II Preferred Stockholder, on the one hand, and us and our holders of our common stock, on the other hand. The Series II Preferred Stockholder has the ability to influence our business and affairs through its ownership of Series II Preferred stock, the Series II Preferred Stockholder’s general ability to appoint our board of directors, and provisions under our certificate of incorporation requiring Series II Preferred Stockholder approval for certain corporate actions (in addition to approval by our board of directors). If the holders of our common stock are dissatisfied with the performance of our board of directors, they have no ability to remove any of our directors, with or without cause. In addition, our certificate of incorporation contains provisions stating that the Series II Preferred Stockholder is under no obligation to consider the separate interests of the other stockholders (including, without limitation, the tax consequences to such stockholders) in its decisions and shall not be liable to the other stockholders for damages for any losses, liabilities or benefits not derived by such stockholders in connection with such decisions. \nFurther, through its ability to elect our board of directors, the Series II Preferred Stockholder has the ability to indirectly influence the determination of the amount and timing of our funds’ investments and dispositions, cash expenditures, indebtedness, issuances of additional partnership interests, tax liabilities and amounts of reserves, each of which can affect the amount of cash that is available for distribution to holders of Blackstone Holdings Partnership Units. \nIn addition, conflicts may arise relating to the selection, structuring and disposition of investments and other transactions, declaring dividends and other distributions and other matters due to the fact that our senior managing directors hold their Blackstone Holdings Partnership Units directly or through \npass-through\n entities that are not subject to corporate income taxation. See “Part III. Item 13. Certain Relationships and Related Transactions, and Director Independence” and “Part III. Item 10. Directors, Executive Officers and Corporate Governance.” \nThe Series II Preferred Stockholder will not be liable to Blackstone or holders of our common stock for any acts or omissions unless there has been a final and \nnon-appealable\n judgment determining that the Series II Preferred Stockholder acted in bad faith or engaged in fraud or willful misconduct and we have also agreed to indemnify the Series II Preferred Stockholder to a similar extent. \nEven if there is deemed to be a breach of the obligations set forth in our certificate of incorporation, our certificate of incorporation provides that the Series II Preferred Stockholder will not be liable to us or the holders of our common stock for any acts or omissions unless there has been a final and \nnon-appealable\n judgment by a court of competent jurisdiction determining that the Series II Preferred Stockholder or its officers and directors acted in bad faith or engaged in fraud or willful misconduct. These provisions are detrimental to the holders of our common stock because they restrict the remedies available to stockholders for actions of the Series II Preferred Stockholder. \n \n74 \nTable of Contents\nIn addition, we have agreed to indemnify the Series II Preferred Stockholder and our former general partner and its controlling affiliates and any current or former officer or director of any of Blackstone or its subsidiaries, the Series II Preferred Stockholder or former general partner and certain other specified persons (collectively, the “Indemnitees”), to the fullest extent permitted by law, against any and all losses, claims, damages, liabilities, joint or several, expenses (including legal fees and expenses), judgments, fines, penalties, interest, settlements or other amounts incurred by any Indemnitee. We have agreed to provide this indemnification if the Indemnitee acted in good faith and in a manner the Indemnitee reasonably believed to be in or not opposed to the best interests of Blackstone, and with respect to any alleged conduct resulting in a criminal proceeding against the Indemnitee, such person had no reasonable cause to believe that such person’s conduct was unlawful. We have also agreed to provide this indemnification for criminal proceedings. \nThe Series II Preferred Stockholder may transfer its interest in the sole share of Series II preferred stock which could materially alter our operations. \nWithout the approval of any other stockholder, the Series II Preferred Stockholder may transfer the sole outstanding share of our Series II preferred stock held by it to a third party upon receipt of approval to do so by our board of directors and satisfaction of certain other requirements. Further, the members or other interest holders of the Series II Preferred Stockholder may sell or transfer all or part of their outstanding equity or other interests in the Series II Preferred Stockholder at any time without our approval. A new holder of our Series II preferred stock or new controlling members of the Series II Preferred Stockholder may appoint directors to our board of directors who have a different philosophy and/or investment objectives from those of our current directors. A new holder of our Series II Preferred stock, new controlling members of the Series II Preferred Stockholder and/or the directors they appoint to our board of directors could also have a different philosophy for the management of our business, including the hiring and compensation of our investment professionals. If any of the foregoing were to occur, we could experience difficulty in forming new funds and other investment vehicles and in making new investments, and the value of our existing investments, our business, our results of operations and our financial condition could materially suffer. \nWe intend to pay regular dividends to holders of our common stock, but our ability to do so may be limited by cash flow from operations and available liquidity, our holding company structure, applicable provisions of Delaware law and contractual restrictions. \nOur intention to pay to holders of common stock a quarterly dividend representing approximately 85% of Blackstone Inc.’s share of Distributable Earnings, subject to adjustment by amounts determined by Blackstone’s board of directors to be necessary or appropriate to provide for the conduct of its business, to make appropriate investments in its business and our funds, to comply with applicable law, any of its debt instruments or other agreements, or to provide for future cash requirements such as \ntax-related\n payments, clawback obligations and dividends to stockholders for any ensuing quarter. All of the foregoing is subject to the qualification that the declaration and payment of any dividends are at the sole discretion of our board of directors, and may change at any time, including, without limitation, to reduce such quarterly dividends or to eliminate such dividends entirely. \nBlackstone Inc. is a holding company and has no material assets other than the ownership of the partnership units in Blackstone Holdings held through wholly owned subsidiaries. Blackstone Inc. has no independent means of generating revenue. Accordingly, we intend to cause Blackstone Holdings to make distributions to its partners, including Blackstone Inc.’s wholly owned subsidiaries, to fund any dividends Blackstone Inc. may declare on our common stock. \nOur ability to make dividends to our stockholders will depend on a number of factors, including among others general economic and business conditions, our strategic plans and prospects, our business and investment opportunities, our financial condition and operating results, including the timing and extent of our realizations, working capital requirements and anticipated cash needs, contractual restrictions and obligations including fulfilling \n \n75 \nTable of Contents\nour current and future capital commitments, legal, tax and regulatory restrictions, restrictions and other implications on the payment of dividends by us to holders of our common stock or payment of distributions by our subsidiaries to us and such other factors as our board of directors may deem relevant. Our ability to pay dividends is also subject to the availability of lawful funds therefor as determined in accordance with the Delaware General Corporation Law. \nThe amortization of \nfinite-lived\n intangible assets and \nnon-cash\n \nequity-based\n compensation results in expenses that may increase the net loss we record in certain periods or cause us to record a net loss in periods during which we would otherwise have recorded net income. \nAs of December 31, 2024, we have $165.2 million of finite-lived intangible assets (in addition to $1.9 billion of goodwill), net of accumulated amortization. These \nfinite-lived\n intangible assets are from our initial public offering (“IPO”) and subsequent business acquisitions. We are amortizing these \nfinite-lived\n intangibles over their estimated useful lives, which range from three to twenty years, using the \nstraight-line\n method, with a \nweighted-average\n remaining amortization period of 5.3 years as of December 31, 2024. We also record \nnon-cash\n \nequity-based\n compensation from grants made in the ordinary course of business and in connection with other business acquisitions. The amortization of these \nfinite-lived\n intangible assets and of this \nnon-cash\n \nequity-based\n compensation will increase our expenses during the relevant periods. These expenses may increase the net loss we record in certain periods or cause us to record a net loss in periods during which we would otherwise have recorded net income. A substantial and sustained decline in our share price could result in an impairment of intangible assets or goodwill leading to a further reduction in net income or increase to net loss in the relevant period. \nWe are required to pay our senior managing directors for most of the benefits relating to any additional tax depreciation or amortization deductions we may claim as a result of the tax basis \nstep-up\n we received as part of the reorganization we implemented in connection with our IPO or receive in connection with future exchanges of our common stock and related transactions. \nAs part of the reorganization we implemented in connection with our IPO, we purchased interests in our business from our \npre-IPO\n owners. In addition, holders of partnership units in Blackstone Holdings (other than Blackstone Inc.’s wholly owned subsidiaries), subject to the vesting and minimum retained ownership requirements and transfer restrictions set forth in the partnership agreements of the Blackstone Holdings Partnerships, may up to four times each year (subject to the terms of the exchange agreement) exchange their Blackstone Holdings Partnership Units for shares of Blackstone Inc.’s common stock on a \none-for-one\n basis. A Blackstone Holdings limited partner must exchange one partnership unit in each of the Blackstone Holdings Partnerships to effect an exchange for a share of common stock. The purchase and subsequent exchanges are expected to result in increases in the tax basis of the tangible and intangible assets of Blackstone Holdings that otherwise would not have been available. These increases in tax basis may increase (for tax purposes) depreciation and amortization and therefore reduce the amount of tax that we would otherwise be required to pay in the future, although the IRS may challenge all or part of that tax basis increase, and a court could sustain such a challenge. \nWe have entered into a tax receivable agreements with our senior managing directors and other \npre-IPO\n owners that provides for the payment by us to the counterparties of 85% of the amount of cash savings, if any, in U.S. federal, state and local income tax or franchise tax that we actually realize as a result of these increases in tax basis and of certain other tax benefits related to entering into the tax receivable agreement, including tax benefits attributable to payments under the tax receivable agreement. This payment obligation is an obligation of Blackstone Inc. and/or its wholly owned subsidiaries and not of Blackstone Holdings. As such, the cash distributions to public stockholders may vary from holders of Blackstone Holdings Partnership Units (held by Blackstone personnel and others) to the extent payments are made under the tax receivable agreements to selling holders of Blackstone Holdings Partnership Units. As the payments reflect actual tax savings received by Blackstone entities, there may be a timing difference between the tax savings received by Blackstone entities and the cash payments to \n \n76 \nTable of Contents\n \nselling holders of Blackstone Holdings Partnership Units. While the actual increase in tax basis, as well as the amount and timing of any payments under this agreement, will vary depending upon a number of factors, including the timing of exchanges, the price of our common stock at the time of the exchange, the extent to which such exchanges are taxable and the amount and timing of our income, we expect that as a result of the size of the increases in the tax basis of the tangible and intangible assets of Blackstone Holdings, the payments that we may make under the tax receivable agreements will be substantial. The payments under a tax receivable agreement are not conditioned upon a tax receivable agreement counterparty’s continued ownership of us. We may need to incur debt to finance payments under the tax receivable agreement to the extent our cash resources are insufficient to meet our obligations under the tax receivable agreements as a result of timing discrepancies or otherwise. \nAlthough we are not aware of any issue that would cause the IRS to challenge a tax basis increase, the tax receivable agreement counterparties will not reimburse us for any payments previously made under the tax receivable agreement. As a result, in certain circumstances payments to the counterparties under the tax receivable agreement could be in excess of our actual cash tax savings. Our ability to achieve benefits from any tax basis increase, and the payments to be made under the tax receivable agreements, will depend upon a number of factors, as discussed above, including the timing and amount of our future income. \nIf Blackstone Inc. were deemed an “investment company” under the 1940 Act, applicable restrictions could make it impractical for us to continue our business as contemplated and could have a material adverse effect on our business. \nAn entity will generally be deemed to be an “investment company” for purposes of the 1940 Act if: (a) it is or holds itself out as being engaged primarily, or proposes to engage primarily, in the business of investing, reinvesting or trading in securities, or (b) absent an applicable exemption, it owns or proposes to acquire investment securities having a value exceeding 40% of the value of its total assets (exclusive of U.S. government securities and cash items) on an unconsolidated basis. We believe that we are engaged primarily in the business of providing asset management and capital markets services and not in the business of investing, reinvesting or trading in securities. We also believe that the primary source of income from each of our businesses is properly characterized as income earned in exchange for the provision of services. We hold ourselves out as an asset management and capital markets firm and do not propose to engage primarily in the business of investing, reinvesting or trading in securities. Accordingly, we do not believe that Blackstone Inc. is an “orthodox” investment company as defined in section 3(a)(1)(A) of the 1940 Act and described in clause (a) in the first sentence of this paragraph. Furthermore, Blackstone Inc. does not have any material assets other than its equity interests in certain wholly owned subsidiaries, which in turn will have no material assets (other than intercompany debt) other than general partner interests in the Blackstone Holdings Partnerships. These wholly owned subsidiaries are the sole general partners of the Blackstone Holdings Partnerships and are vested with all management and control over the Blackstone Holdings Partnerships. We do not believe the equity interests of Blackstone Inc. in its wholly owned subsidiaries or the general partner interests of these wholly owned subsidiaries in the Blackstone Holdings Partnerships are investment securities. Moreover, because we believe that the capital interests of the general partners of our funds in their respective funds are neither securities nor investment securities, we believe that less than 40% of Blackstone Inc.’s total assets (exclusive of U.S. government securities and cash items) on an unconsolidated basis are comprised of assets that could be considered investment securities. Accordingly, we do not believe Blackstone Inc. is an inadvertent investment company by virtue of the 40% test in section 3(a)(1)(C) of the 1940 Act as described in clause (b) in the first sentence of this paragraph. In addition, we believe Blackstone Inc. is not an investment company under section 3(b)(1) of the 1940 Act because it is primarily engaged in a \nnon-investment\n company business. \nThe 1940 Act and the rules thereunder contain detailed parameters for the organization and operation of investment companies. Among other things, the 1940 Act and the rules thereunder limit or prohibit transactions with affiliates, impose limitations on the issuance of debt and equity securities, generally prohibit the issuance of options and impose certain governance requirements. We intend to conduct our operations so that Blackstone Inc. \n \n77 \nTable of Contents\nwill not be deemed to be an investment company under the 1940 Act. If anything were to happen which would cause Blackstone Inc. to be deemed to be an investment company under the 1940 Act, requirements imposed by the 1940 Act, including limitations on our capital structure, ability to transact business with affiliates (including us) and ability to compensate key employees, could make it impractical for us to continue our business as currently conducted, impair the agreements and arrangements between and among Blackstone Inc., Blackstone Holdings and our senior managing directors, or any combination thereof, and materially adversely affect our business, financial condition and results of operations. In addition, we may be required to limit the amount of investments that we make as a principal or otherwise conduct our business in a manner that does not subject us to the registration and other requirements of the 1940 Act. \nOther anti-takeover provisions in our charter documents could delay or prevent a change in control. \nIn addition to the provisions described elsewhere relating to the Series II Preferred Stockholder’s control, other provisions in our certificate of incorporation and bylaws may discourage, delay or prevent a merger or acquisition that a stockholder may consider favorable by, for example: \n \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\npermitting our board of directors to issue one or more series of preferred stock, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nproviding for the loss of voting rights for the common stock, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nrequiring advance notice for stockholder proposals and nominations if they are ever permitted by applicable law, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nplacing limitations on convening stockholder meetings, \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nprohibiting stockholder action by written consent unless such action is consent to by the Series II Preferred Stockholder and \n\n\n\n\n\n\n \n\n\n•\n\n\n \n\n\nimposing \nsuper-majority\n voting requirements for certain amendments to our certificate of incorporation. \nThese provisions may also discourage acquisition proposals or delay or prevent a change in control. \nRisks Related to Our Common Stock \nThe price of our common stock may decline due to the large number of shares of common stock eligible for future sale and for exchange. \nThe market price of our common stock could decline as a result of sales of a large number of shares of common stock in the market in the future or the perception that such sales could occur. These sales, or the possibility that these sales may occur, also might make it more difficult for us to sell shares of common stock in the future at a time and at a price that we deem appropriate. We had a total of 729,415,925 shares of common stock outstanding as of February 21, 2025. Subject to the \nlock-up\n restrictions described below, we may issue and sell in the future additional shares of common stock. Limited partners of Blackstone Holdings owned an aggregate of 439,589,683 Blackstone Holdings Partnership Units outstanding as of February 21, 2025. In connection with our initial public offering, we entered into an exchange agreement with holders of Blackstone Holdings Partnership Units (other than Blackstone Inc.’s wholly owned subsidiaries) so that these holders, subject to the vesting and minimum retained ownership requirements and transfer restrictions set forth in the partnership agreements of the Blackstone Holdings Partnerships, may up to four times each year (subject to the terms of the exchange agreement) exchange their Blackstone Holdings Partnership Units for shares of Blackstone Inc. common stock on a \none-for-one\n basis, subject to customary conversion rate adjustments for splits, unit distributions and reclassifications. A Blackstone Holdings limited partner must exchange one partnership unit in each of the Blackstone Holdings Partnerships to effect an exchange for a share of common stock. The common stock we issue upon such exchanges would be “restricted securities,” as defined in Rule 144 under the Securities Act, unless we register such issuances. However, we have entered into a registration rights agreement with the limited partners of the Blackstone Holdings Partnerships that requires us to register these shares of common stock under the \n \n78 \nTable of Contents\nSecurities Act and we have filed registration statements that cover the delivery of common stock issued upon exchange of Blackstone Holdings Partnership Units. See “Part III. Item 13. Certain Relationships and Related Transactions, and Director Independence — Transactions with Related Persons — Registration Rights Agreement.” While the partnership agreements of the Blackstone Holdings Partnerships and related agreements contractually restrict the ability of Blackstone personnel to transfer the Blackstone Holdings Partnership Units or Blackstone Inc. common stock they hold and require that they maintain a minimum amount of equity ownership during their employ by us, these contractual provisions may lapse over time or be waived, modified or amended at any time. \nAs of February 21, 2025, we had granted 52,898,279 outstanding deferred restricted shares of common stock and 8,879,032 outstanding deferred restricted Blackstone Holdings Partnership Units to our \nnon-senior\n managing director professionals and senior managing directors under the Blackstone Inc. Amended and Restated 2007 Equity Incentive Plan (“2007 Equity Incentive Plan”). The aggregate number of shares of common stock and Blackstone Holdings Partnership Units (together, “Shares”) covered by our 2007 Equity Incentive Plan is increased on the first day of each fiscal year during its term by a number of Shares equal to the positive difference, if any, of (a) 15% of the aggregate number of Shares outstanding on the last day of the immediately preceding fiscal year (excluding Blackstone Holdings Partnership Units held by Blackstone Inc. or its wholly owned subsidiaries) minus (b) the aggregate number of Shares covered by our 2007 Equity Incentive Plan as of such date (unless the administrator of the 2007 Equity Incentive Plan should decide to increase the number of Shares covered by the plan by a lesser amount). An aggregate of 173,433,328 additional Shares were available for grant under our 2007 Equity Incentive Plan as of February 21, 2025. We have filed a registration statement and intend to file additional registration statements on Form \nS-8\n under the Securities Act to register common stock covered by the 2007 Equity Incentive Plan (including pursuant to automatic annual increases). Any such Form \nS-8\n registration statement will automatically become effective upon filing. Moreover, we have filed a registration statement on Form \nS-3\n under the Securities Act to register common stock, among other securities, for future offerings. Accordingly, common stock registered under such registration statement will be available for sale in the open market. \nIn addition, the Blackstone Holdings partnership agreements authorize the wholly owned subsidiaries of Blackstone Inc. which are the general partners of those partnerships to issue an unlimited number of additional partnership securities of the Blackstone Holdings Partnerships with such designations, preferences, rights, powers and duties that are different from, and may be senior to, those applicable to the Blackstone Holdings Partnership Units, and which may be exchangeable for our shares of common stock. \nOur certificate of incorporation also provides us with a right to acquire all of the then outstanding shares of common stock under specified circumstances, which may adversely affect the price of our shares of common stock and the ability of holders of shares of common stock to participate in further growth in our stock price. \nOur certificate of incorporation provides that, if at any time, less than 10% of the total shares of any class of our stock then outstanding (other than Series I preferred stock and Series II preferred stock) is held by persons other than the Series II Preferred Stockholder and its affiliates, we may exercise our right to call and purchase all of the then outstanding shares of common stock held by persons other than the Series II Preferred Stockholder or its affiliates or assign this right to the Series II Preferred Stockholder or any of its affiliates. As a result, a stockholder may have his or her shares of common stock purchased from him or her at an undesirable time or price and in a manner which adversely affects the ability of a stockholder to participate in further growth in our stock price. \n \n79 \nTable of Contents\nOur amended and restated bylaws designate the Court of Chancery of the State of Delaware or the federal district courts of the United States of America, as applicable, as the sole and exclusive forum for certain types of actions and proceedings that may be initiated by our stockholders, which could limit our stockholders’ ability to obtain a favorable judicial forum for disputes with Blackstone or our directors, officers or other employees. \nOur amended and restated bylaws provide that, unless we consent in writing to the selection of an alternative forum, the Court of Chancery of the State of Delaware will, to the fullest extent permitted by law, be the sole and exclusive forum for: (a) any derivative action or proceeding brought on our behalf, (b) any action asserting a breach of fiduciary duty owed by any of our current or former directors, officers, stockholders or employees to us or our stockholders, (c) any action asserting a claim against us arising under the Delaware General Corporation Law (the “DGCL”), our certificate of incorporation or our amended and restated bylaws or as to which the DGCL confers jurisdiction on the Court of Chancery of the State of Delaware, or (d) any action asserting a claim against us that is governed by the internal affairs doctrine. \nOur amended and restated bylaws further provide that, unless we consent in writing to the selection of an alternative forum, to the fullest extent permitted by law, the federal district courts of the United States of America will be the exclusive forum for the resolution of any complaint asserting a cause of action arising under the federal securities laws of the United States, including, in each case, the applicable rules and regulations promulgated thereunder. \nAny person or entity purchasing or otherwise acquiring any interest in any shares of our capital stock shall be deemed to have notice of and to have consented to the forum provision in our amended and restated bylaws. This \nchoice-of-forum\n provision may limit a stockholder’s ability to bring a claim in a different judicial forum, including one that it may find favorable or convenient for a specified class of disputes with Blackstone or our directors, officers, other stockholders or employees, which may discourage such lawsuits. Alternatively, if a court were to find this provision of our amended and restated bylaws inapplicable or unenforceable with respect to one or more of the specified types of actions or proceedings, we may incur additional costs associated with resolving such matters in other jurisdictions, which could materially adversely affect our business, financial condition and results of operations and result in a diversion of the time and resources of our management and board of directors. \n \n\n\n\n\n\n\nItem 1B.\n\n\nUnresolved Staff Comments \nNone. \n \n \n80 \nTable of Contents\n \n \n \n\n\n\n\n\n\nItem 1C.\n\n\n \nCybersecurity \n \n \n \n \n \n \n \nCybersecurity Risk Management and Strategy \n \nBlackstone maintains a comprehensive cybersecurity program, including policies and procedures designed to protect our systems, operations and the data entrusted to us by our investors, employees, portfolio companies and business partners from anticipated threats or hazards. Blackstone utilizes a variety of protective measures as a part of its cybersecurity program. These measures include, where appropriate, physical and digital access controls, patch management, identity verification and mobile device management software, new hire and annual employee cybersecurity awareness and best practices training programs, security baselines and tools to report anomalous activity, and monitoring of data usage, hardware and software. \n \nWe test our cybersecurity defenses regularly through automated and manual vulnerability scanning, to identify and remediate critical vulnerabilities. In addition, we conduct annual “white hat” penetration tests to validate our security posture. We examine our cybersecurity program every two to three years with third parties, evaluating its effectiveness in part by considering industry standards and established frameworks, such as the National Institute of Standards and Technology and Center for Internet Security, as guidelines. Further, we engage in cybersecurity incident tabletop exercises and scenario planning exercises involving hypothetical cybersecurity incidents to test our cybersecurity incident response processes. Our Chief Security Officer (the “CSO”) and members of senior management, Legal and Compliance, Technology and Innovations (“BXTI”) and Global Corporate Affairs participate in these exercises. Learnings from these tabletop exercises and any cybersecurity events we experience are reviewed, discussed and incorporated into our cybersecurity incident response processes, as appropriate. \n \nIn addition to our internal exercises to test aspects of our cybersecurity program, we periodically \nengage\n independent third parties to analyze data on the interactions of users of our information technology resources, including employees, and conduct penetration tests and scanning exercises to assess the performance of our cybersecurity systems and processes. \n \nWe have a comprehensive Security Incident Response Plan (the “IRP”) designed to inform the proper escalation of \nnon-routine\n suspected or confirmed information security or cybersecurity events based on the expected risk an event presents. As appropriate, a Security Incident Response Team composed of individuals from several internal technical and managerial functions may be formed to investigate and remediate the event and determine the extent of external advisor support required, including from external counsel, forensic investigators, and/or law enforcement. The IRP sets out ongoing monitoring or remediating actions to be taken after resolution of an incident. The IRP is reviewed at least annually by members of BXTI and Legal and Compliance. \n \nBlackstone maintains a formal cybersecurity risk management process and cybersecurity risk register, designed to identify, track and treat cybersecurity risks at the firm, and \nintegrates\n these processes into the firm’s overall risk management practices described above. Our CSO periodically discusses and reviews cybersecurity risks and related mitigants with our enterprise risk committee and incorporates relevant cybersecurity risk updates and metrics in the semi-annual enterprise-wide risk management report.\n \n \nBlackstone has a process designed to assess the cybersecurity risks associated with the engagement of \nthird-party\n vendors. This \nassessment\n is conducted on the basis of, among other factors, the types of services provided and the extent and type of Blackstone data accessed or processed by a third-party vendor. On the basis of its preliminary risk assessment of a third-party vendor, Blackstone may conduct further cybersecurity reviews or request remediation of, or contractual protections related to, any actual or potential identified cybersecurity risks. \n \n \n \n81\n \n \n \nTable of Contents\n \n \nIn addition, where appropriate, Blackstone seeks to include in its contractual arrangements with certain of its third-party vendors provisions addressing its requirements and industry best practices with respect to data and cybersecurity, as well as the right to assess, monitor, audit and test such vendors’ cybersecurity programs and practices. Blackstone also utilizes a number of digital controls, which are reviewed at least annually, to monitor and manage third-party access to its internal systems and data. \n \nFor a discussion of how risks from cybersecurity threats \naffect\n our business, see “—"
}