{
  "ticker": "CAG",
  "cik": "0000023217",
  "company_name": "CONAGRA BRANDS INC.",
  "filing_date": "2025-07-10",
  "accession": "0001558370-25-009180",
  "primary_doc": "tmb-20250525x10k.htm",
  "item1_text": "ITEM 1A. RISK FACTORS\nOur business is subject to various risks and uncertainties. Any of the risks and uncertainties described below could materially adversely affect our business, financial condition, and results of operations and should be considered in evaluating us. Although the risks are organized by headings and each risk is described separately, many of the risks are interrelated. While we believe we have identified and discussed below the key risk factors affecting our business, there may be additional risks and uncertainties that are not presently known or that are not currently believed to be significant that may adversely affect our business, performance, or financial condition in the future. You should not interpret the disclosure of any risk factor to imply that the risk has not already materialized.\nMarket Risks \nDeterioration of general economic conditions, an economic recession, periods of inflation, or economic uncertainty may affect consumers resulting in reductions in consumer spending and have in the past harmed and could continue to harm our business and results of operations.\n \nOur business and results of operations have in the past been and may continue to be adversely affected by changes in national or global stability and economic conditions, including inflation, rising interest rates; changing international trade, tariff, immigration, \n7\n\n\nTable of Contents\nand tax policies; decreased availability of capital, volatility in financial markets, declining consumer spending rates, declining benefits or increased limitations under government food assistance programs for consumers; rising unemployment; recessions; decreased energy availability and increased energy costs (including fuel surcharges); supply chain challenges; labor shortages; the effects of governmental initiatives to manage economic conditions; geopolitical conflicts (including as discussed in the risk factor below); and the negative impacts caused by pandemics, epidemics, and disease, in humans and animals, such as the avian flu. \nThese economic factors could continue to impact our business and operations in a variety of ways, including as follows: \n●\nconsumers shifting purchases to more generic, lower-priced, or other value offerings, or foregoing certain purchases altogether during economic downturns, which could result in a reduction in sales of higher margin products, or a shift in our product mix to lower margin offerings adversely affecting the results of our operations; \n●\nvolatility in commodity and other input costs could substantially impact our result of operations; \n●\nrising interest rates may adversely impact our results of operations;  \n●\ndecreased demand in the restaurant business, particularly casual and fine dining, may adversely affect our Foodservice operations; \n●\nvolatility in the equity markets or interest rates could substantially impact our pension costs and required pension contributions; and \n●\nit may become more costly or difficult to obtain debt or equity financing to fund operations or investment opportunities, or to refinance our debt in the future, in each case on terms and within a time period acceptable to us\n. \nInflation, increased interest rates, and other economic conditions including potential recession and credit market disruptions, could negatively impact our business.\n \nCustomer and consumer demand for our products may be impacted by heightened inflation, increased or fluctuating tariffs, increased interest rates and other weak economic conditions including recessionary conditions and credit market disruptions and volatility. Continued weak economic conditions may adversely impact consumers causing a decrease in demand for our products from our customers and consumers. Additionally, these economic conditions may adversely impact some of our customers, suppliers and other vendors who are highly leveraged increasing the risk of uncollectible accounts or trade receivables, extended payment terms, and bankruptcy. We have experienced and may continue to experience negative impacts to our business ranging from an inability to collect accounts receivable to supply chain disruptions caused by failures of our counterparties to continue as a going concern due to financial and liquidity issues. \nOur business, financial condition, and results of operations have in the past been and could continue to be adversely affected by disruptions in the global economy caused by geopolitical conflicts.\n \nOur business, financial condition and results of operations have been impacted in the past and may be impacted in the future by disruptions in the global economy. The global economy has been negatively impacted by geopolitical conflicts, and related export controls and economic sanctions, including the continuing military conflict between Russia and Ukraine, conflicts in the Middle East, and rising tensions elsewhere including between China and Taiwan. Although we have no direct operations in Russia, Ukraine, the Middle East, China, or Taiwan, we have experienced, or may experience, shortages in materials from these regions, increased tariffs, sanctions or restrictions relating to these regions, and resulting increased costs or volatility relating to transportation, energy, and raw materials as a result of impacts from conflicts in these regions, and reduced consumer confidence and consumption due in part to the negative impact of these conflicts and tensions on the global economy. Further escalations of geopolitical tensions related to military conflicts, including increased or fluctuating trade barriers or restrictions on global trade, could also result in cyberattacks, supply or distribution disruptions, lower consumer demand, and changes to foreign exchange rates and financial markets, any of which may adversely affect our business and supply chain. In addition, the effects of the ongoing conflicts could heighten many of our known risks described in this"
}