{
  "ticker": "CBOE",
  "cik": "0001374310",
  "company_name": "Cboe Global Markets, Inc.",
  "filing_date": "2025-02-21",
  "accession": "0001628280-25-006984",
  "primary_doc": "cboe-20241231.htm",
  "item1_text": "Item 1.    Business \nThe following description of the business should be read in conjunction with the information included elsewhere in this Annual Report on Form 10-K for the year ended December 31, 2024. This description contains forward-looking statements that involve risks and uncertainties. Actual results could differ significantly from the results discussed in the forward-looking statements due to the factors set forth in “Risk Factors” and elsewhere in this Annual Report on Form 10-K.\nOverview\nCboe Global Markets, Inc., the world's leading derivatives and securities exchange network, delivers cutting-edge trading, clearing and investment solutions to people around the world. Cboe provides trading solutions and products in multiple asset classes, including equities, derivatives, and FX, across North America, Europe, and Asia Pacific. Above all, the Company is committed to building a trusted, inclusive global marketplace that enables people to pursue a sustainable financial future. \nCboe’s subsidiaries include the largest options exchange and the third largest equities exchange operator in the U.S. In addition, the Company operates Cboe Europe, one of the largest equities exchanges by value traded in Europe, and owns Cboe Clear Europe, a leading pan-European equities and derivatives clearinghouse, BIDS Holdings, which owns a leading block-trading ATS by volume in the U.S., and provides block-trading services with Cboe market operators in Europe, Canada, Australia, and Japan, Cboe Australia, an operator of trading venues in Australia, Cboe Japan, an operator of trading venues in Japan, Cboe Clear U.S., an operator of a regulated clearinghouse, and Cboe Canada Inc., a recognized Canadian securities exchange. Cboe subsidiaries also serve collectively as a leading market globally for exchange-traded products (“ETPs”) listings and trading. \nThe graphic below provides a brief overview of Cboe’s history:\n7\nTable \no\nf Contents\nOur Business \nCboe reports on the following six business segments:\n•\nOptions.\n The Options segment includes options on market indices (“index options”), as well as on the stocks of individual corporations (“equity options”) and on ETPs such as exchange-traded funds (“ETFs”) and exchange-traded notes (“ETNs”), which are “multi-listed” options and listed on a non-exclusive basis. These options are eligible to trade, as applicable, on Cboe Options, C2, BZX, EDGX, and/or other U.S. national security exchanges. Cboe Options is the Company’s primary options market and offers trading in listed options through a single system that integrates electronic trading and traditional open outcry trading on the Cboe Options trading floor in Chicago. C2 Options, BZX Options, and EDGX Options are all-electronic options exchanges, and typically operate with different market models and fee structures than Cboe Options. The Options segment also includes applicable market data fees revenues generated from the consolidated tape plans, the licensing of proprietary options market data, index licensing, routing services, and access and capacity services.\n•\nNorth American Equities. \nThe North American Equities segment includes U.S. equities and ETP transaction services that occur on fully electronic exchanges owned and operated by BZX, BYX, EDGX, and EDGA, equities transactions that occur on the BIDS Trading platform in the U.S. and Canada, and Canadian equities and other transaction services that occur on or through Cboe Canada Inc.’s order books. The North American Equities segment also includes corporate listing services on Cboe Canada Inc., ETP listings on BZX, the Cboe Global Markets, Inc. common stock listing, and applicable market data fees revenues generated from the consolidated tape plans, the licensing of proprietary equities market data, routing services, and access and capacity services.\n•\nEurope and Asia Pacific.\n The Europe and Asia Pacific segment includes the pan-European listed equities and derivatives transaction services, ETPs, including exchange traded funds, exchange traded notes, and exchange traded commodities, and international depository receipts that are hosted on MTFs operated by Cboe Europe Equities (Cboe Europe and Cboe NL equities exchanges) and Cboe Europe Derivatives (“CEDX”). It also includes the ETP listings business on RMs and clearing activities of Cboe Clear Europe, as well as the equities transaction services of Cboe Australia and Cboe Japan, operators of trading venues in Australia and Japan, respectively, along with equities transactions that occur on the BIDS Trading platform in Australia and Japan. Cboe Europe operates lit and dark books, a periodic auctions book, a closing cross book, and two BIDS orderbooks; a Large-in-Scale (“LIS”) trading negotiation facility and - predominantly for UK and Swiss symbols - a volume-weighted average price (“VWAP”) trajectory crossing facility. Cboe NL, based in Amsterdam, operates similar business functionality to that offered by Cboe Europe (with exception of Trajectory Crossing), and provides for trading only in European Economic Area (“EEA”) symbols. Cboe Europe Derivatives, a pan-European derivatives platform, offers futures and options based on Cboe Europe equity indices, and single stock options. Cboe Clear Europe offers the clearing of equity and equity-like instruments for Cboe-operated and other regulated trading venues, the clearing of derivative transactions executed on CEDX, and has recently introduced a service to clear Securities Financing Transactions. This segment also includes Cboe Europe, Cboe NL, CEDX, Cboe Australia and Cboe Japan revenue generated from the licensing of proprietary market data and from access and capacity services.\n•\nFutures.\n The Futures segment includes transaction services provided by CFE, a fully electronic futures exchange, which includes offerings for trading of VIX futures and other futures products, the licensing of proprietary market data, as well as access and capacity services. On April 25, 2024, the Company announced plans to transition the cash-settled margin Bitcoin and Ether futures contracts, currently available for trading on the Cboe Digital Exchange, to CFE in the first half of 2025, pending regulatory review.\n•\nGlobal FX.\n The Global FX segment includes institutional FX trading services that occur on the Cboe FX fully electronic trading platform, non-deliverable forward FX transactions (“NDFs”) offered for execution on Cboe SEF, as well as revenue generated from the licensing of proprietary market data and from access and capacity services. The segment includes transaction services for U.S. government securities executed on the Cboe Fixed Income fully electronic trading platform.\n•\nDigital.\n The Digital segment includes a regulated futures exchange (Cboe Digital Exchange) and a regulated clearinghouse (Cboe Clear U.S.), as well as revenue generated from the licensing of proprietary market data and from access and capacity services. Prior to May 31, 2024, the Digital segment also included a U.S.-based spot digital asset trading market (“Cboe Digital spot market”). As of May 31, 2024, the Cboe Digital spot market is closed for all participant and trading purposes. In addition, the Company plans to transition the cash-settled margin Bitcoin and Ether futures contracts, currently available for trading on the Cboe Digital Exchange, to CFE in the first half of 2025, pending regulatory review. The Company expects that Digital will cease to be a distinct reportable business segment in the first quarter of 2025.\n8\nTable \no\nf Contents\nCboe also presents three financial statement revenue captions that reflect the Company’s diversified products,  expansive geographical reach, and overall business strategy. Below is a summary of Cboe’s financial statement revenue  caption businesses:\n•\nCash and spot markets. \nThis includes associated transaction and clearing fees on our equities and FX markets and clearing business, the portion of market data fees relating to associated U.S. tape plan market data fees, associated regulatory fees, and associated other revenue from Cboe’s North American Equities, Europe and Asia Pacific, Global FX, and Digital segments. The key sources of these revenues are our equities and FX markets, the U.S. tape plans, and our clearing and listings businesses, which are described in more detail below.\n•\nCboe Data Vantage (f/k/a Data and Access Solutions, subsequently referred to as Data Vantage).\n The Cboe Data Vantage business includes access and capacity fees to our markets, proprietary market data fees from various licensing agreements and proprietary indices, and associated other revenue across Cboe’s six segments. The key sources of these revenues are our markets, the proprietary products underlying the market data, the licensing agreements, proprietary indices, and other data and access products and services, which are described in more detail below.\n•\nDerivatives markets. \nThis includes associated transaction and clearing fees, the portion of market data fees relating to associated U.S. tape plan market data fees, associated regulatory fees, and associated other revenue from Cboe’s Options, Futures, Europe and Asia Pacific, and Digital segments. The key sources of these revenues are proprietary products, including our flagship products SPX options and VIX options and futures, our derivatives markets, and U.S. tape plans, which are described in more detail below.\nSee “Management’s Discussion and Analysis of Financial Condition and Results of Operations”, Note 4 (\"Revenue Recognition\"), and Note 16 (\"Segment Reporting\") in the notes to our consolidated financial statements for discussion of revenues and certain operational and financial metrics, and operating income (or loss) by business segment. Certain activities within our segments operate globally. For information regarding risks related to our international operations see “Risk Factors.” \n9\nTable \no\nf Contents\nCompetitive Strengths\nCboe is a leading provider of market infrastructure and tradable products across cash and spot markets, derivatives markets, and Cboe Data Vantage products and services. Cboe delivers cutting-edge trading, clearing and investment solutions across the globe through a comprehensive ecosystem that helps drive innovation and growth.\nStrategic Focus\nOur strategy is to build one of the world’s largest global derivatives and securities networks to create value and drive growth by:\n•\nInvesting in the continued growth of our core business in Global Derivatives;\n•\nEnhancing recurring revenue opportunities through Cboe Data Vantage (f/k/a Data and Access Solutions);\n•\nHarnessing our global network to expand product reach & access;\n•\nCapitalizing on the demand for access to the U.S. capital markets;\n•\nLeveraging our superior technology to drive innovations; and\n•\nAllocating capital and resources to areas where we expect to see the strongest long-term returns for shareholders.\nKey Business Highlights\nThe following is a brief summary of our key 2024 business highlights:\n•\nLaunched new products and indices such as cash-settled margin Bitcoin and Ether Futures, Options on VIX Futures, Cboe S&P 500 Variance Futures, Cboe Bitcoin U.S. ETF Index and options thereon, and U.S. Treasury Market Volatility Index.\n•\nEnhanced existing collaborations with S&P Dow Jones Indices with plans to launch the Cboe S&P 500 Constituent Volatility Index.\n•\nDrove FTSE Russell innovation in digital asset derivatives and with MSCI to offer new index options and volatility indices.\n•\nWorked to expand retail access to index options.\n•\nIntroduced dedicated cores in our equities markets.\n•\nBuilt out our technology offerings in each of the U.S. and our international markets.\n•\nIntroduced a central counterparty clearing service for European SFT.\n10\nTable \no\nf Contents\n•\nContinued to expand our geographic footprint with a minority stake in Japannext Co., Ltd.\n•\nReallocated technology resources from integration efforts to organic revenue opportunities.\n•\nRealigned the digital asset business to leverage our core strengths in derivatives, technology and product innovation. \nDerivatives Markets\nWe are one of the largest U.S. derivatives market operators, operating four options markets, Cboe Options, BZX Options, EDGX Options and C2 Options, operating a futures market, CFE, as well as operating a pan-European derivatives market, Cboe Europe Derivatives (“CEDX”). The key products traded on our derivatives markets are proprietary products, including our flagship products SPX options and VIX options and futures, and multi-listed products. \nOur U.S. derivatives options market, Cboe Options, is a hybrid market combining open outcry floor trading with electronic trading. For multi-listed products, depending on the product, we utilize public customer priority, market turner, participation rights and pro-rata allocation market models, as well as the “classic” pricing model (known as payment for order flow). For proprietary products, we use price-time or pro-rata allocation, alongside public customer priority in certain instances, and market turner, combined with a pricing model where all market participants generally pay fees. Our other three options markets, BZX, EDGX and C2, are fully electronic and utilize a mix of price-time, customer priority, participation rights, pro-rata allocation, maker-taker and classic pricing market models.\nCFE’s U.S. derivatives futures market, which is fully electronic, utilizes a price-time market model, combined with a pricing model where all market participants generally pay fees, subject to specified exceptions.\nCEDX, which is fully electronic, utilizes a pro-rata allocation market model.\nProprietary Products\nWe are a leader in the volatility space with the volatility-based proprietary products we offer for trading. These volatility-based proprietary products are built through Cboe Labs, a dedicated team centered on the creation, development, and implementation of new ideas and our strategic relationships and license agreements with index providers, which are both described below in further detail. We offer proprietary products on our proprietary indices and indices owned by other index providers. Our most frequently traded proprietary products include SPX options and VIX options and futures.\nSPX Options\nThe S&P 500 Index is an index comprised of 500 large-cap U.S. listed companies. It is one of the most commonly followed indices and is considered a bellwether for the U.S. economy. The SPX options we offer on the S&P 500 Index are exclusive to Cboe and contribute substantially to our volumes and transaction fee revenues. Because of the S&P 500 Index’s status as a bellwether, SPX options are used in many different trading strategies by customers with different goals, including pension funds hedging their equity exposure by buying put options, asset managers seeking enhanced returns by selling covered call options and hedge funds using risk-managed strategies to capture so-called “risk premia” embedded in option prices. We also offer zero days to expiry (0-DTE) products, Long Term Equity AnticiPation Securities (LEAPs), Mini- and Nano-SPX options, FLEX- and FLEX micro-SPX options, and SPX Weeklys options, which have settlements on Mondays, Tuesdays, Wednesdays, Thursdays, Fridays and on the last trading day of each month and 24x5 trading in SPX options. We believe these additional expirations provide customers with more precision when hedging overall portfolio risk. \nVolatility Trading\nCboe pioneered the trading of exchange-traded volatility products with its introduction of VIX futures in 2004 and VIX options in 2006. The VIX Index (as defined below), although not directly tradable, is based on the mid-point of real-time quotes of SPX options and is designed to reflect investors’ consensus view of future 30-day expected stock market volatility. The VIX Index methodology provides the basis for the creation of VIX options and futures. The final settlement value of VIX options and futures is determined on their expiration date through a Special Opening Quotation (“SOQ”) of the VIX Index. The SOQ calculation uses opening trade prices of selected options; unless there is no opening price, in which case the opening price used in the SOQ calculation is the midpoint of the highest bid and lowest offer at the time of the opening. Since we started offering these products, we have seen trading from a number of different customer segments utilizing a number of different trading strategies, including hedging extreme stock market declines, also known as “tail risk” hedging, and risk-managed strategies that seek to capture the relative price changes of expected volatility at different times in the future.\nTo help investors better manage market volatility, we also offer the 1-Day Volatility Index (VIX1D), the U.S. Treasury Market Volatility Index (VIXTLT), VIX Weeklys options and futures, mini VIX futures, nearly 24x5 trading in VIX options and futures, Cboe S&P 500 Variance Futures, and Options on VIX futures.\n11\nTable \no\nf Contents\nProprietary Indices\nWe also calculate and disseminate proprietary indices that are licensed for use by third parties or are used as the basis for Cboe proprietary products. These proprietary indices are built through our in-house Cboe Labs research and development and Cboe Data Vantage business teams, often in connection with our strategic relationships and license agreements with index providers, which are both described below in further detail. Our proprietary indices include:\n•\nvolatility indices based on broad-based market indices, such as the S&P 500 and the Russell 2000, \n•\nvolatility indices based on ETFs,\n•\nindices based on Bitcoin ETFs, and\n•\noptions strategy benchmark indices, such as the Cboe BuyWrite, PutWrite, and Collar indices based on the S&P 500 and Russell 2000, BuyWrite and PutWrite indices based on MSCI EAFE and MSCI Emerging Markets indices, and BuyWrite indices based on other broad-based market indices.\nIn addition to any transaction fee revenue generated from trading of products based on these indices on Cboe exchanges, we distribute these indices through the Cboe Global Index Feed index data subscription service and, together with index providers with whom we have strategic relationships, we license proprietary indices for third parties to use to create third-party indices and products. Accordingly, we generate revenue from proprietary indices by distributing them for reference purposes, using them as the basis for proprietary products and licensing them for use for third-party indices and products. \nIndex Provider Relationships\nThe Company has long-term business relationships with several providers of market indices. We license their indices, including on an exclusive basis, as the foundation for indices, index options and other products. The Company also has agreements in place to work jointly with key providers to develop new indices and products and services that are expected to capitalize on our core competencies and diversify our sources of revenue. Of particular note are the following: \n•\nS&P Dow Jones Indices (“S&P”). \nWe have the following licensing arrangements with S&P:\n◦\nS&P Indices. \nWe have the exclusive right to offer exchange-listed options contracts in the United States on the S&P 500 Index, the S&P 100 Index, the S&P 500 ESG Index, and the S&P Select Sector Indices as a result of a licensing arrangement with S&P. Our license from S&P is through December 31, 2033, with an exclusive license to trade options on the S&P 500 Index through December 31, 2032. We use the market data from the trading of options on the S&P 500 Index and S&P 100 Index for the creation of Cboe volatility indices, such as the Cboe Volatility Index (“VIX Index”), and to create tradable products on those volatility indices\n.\n◦\nMarkit Indices.\n We have a worldwide license through August 22, 2025 to offer futures, options, and options on futures on indices designed to reflect values of investment grade and high-yield U.S. corporate bonds. Unless either party elects otherwise, this agreement auto-renews for successive two-year periods. Pursuant to our license, we offer futures and options on futures on high yield and investment grade corporate bond indices.\n◦\nDow Jones Indices. \nWe have the exclusive right during standard U.S. trading hours to offer listed options contracts in the United States on the Dow Jones Industrial Average and Dow 10 Index, and non-exclusive rights to offer listed options on several other Dow Jones indices including the Dow Jones Utilities Average and Dow Jones Transportation Average. This licensing arrangement extends through December 31, 2033. We use market data from the trading of options on these indices to create Cboe volatility indices, variance indicators and BuyWrite indices, and we trade options and other products on these indices.\n•\nFTSE Russell. \nUnder our license agreement with the London Stock Exchange Group’s (“LSEG”) leading global index franchises, Frank Russell Company and FTSE International Limited (together “FTSE Russell”), we have the exclusive or first right in the United States to offer listed options on more than two dozen FTSE Russell indices, which represent a diverse group of domestic and global equities with international appeal. Our exclusive license from FTSE Russell is through April 1, 2030. We offer options on the Russell 2000, Russell 1000, Russell 1000 Value and Russell 1000 Growth indices and mini-options on the Russell 2000 Index.\n•\nMSCI\n. \nWe have an agreement with MSCI Inc. (“MSCI”) in which we have the right to offer U.S.-listed options on several of MSCI’s indices including the MSCI EAFE, MSCI Emerging Markets, MSCI World, MSCI ACWI, and MSCI USA indices. The agreement term extends until December 31, 2031, but our license to list options on the MSCI indices contained in the agreement could expire on September 30, 2026 if either party elects not to extend. We use \n12\nTable \no\nf Contents\nmarket data from the trading of the MSCI EAFE and MSCI Emerging Markets index options (among other inputs) to calculate volatility indices and several versions of BuyWrite and PutWrite strategy indices.\nCboe Data Vantage\nThe Cboe Data Vantage business provides an offering of market data and information solutions products across multiple asset classes and geographic regions that are designed to suit our customers’ diverse needs. The Cboe Data Vantage business consists of three product groups:\n•\nMarket Data and Access Services.\n Data products include real-time depth of book quotation information, auction and complex option information, top of book quotes and trades, last sale information, and consolidated equity feeds. Our market data offerings include proprietary data derived from our derivatives and cash and spot markets as well as data relating to Cboe’s proprietary products, such as VIX futures. In addition to market data, access services include all access and capacity products including connectivity, terminal and other equipment rights, maintenance services, trading floor space, permits for the opportunity to trade, and telecommunications services. \n•\nCboe Global Indices.\n Services include index creation, calculation, licensing, and data dissemination. In addition to index data dissemination through the Cboe Global Indices Feed (\"CGIF\") platform, we distribute real-time cryptocurrency prices and indicative net asset values. See above for additional information regarding our proprietary indices.\n•\nRisk and Market Analytics. \nServices include analytics and historical data with three areas of focus:\n◦\nData and Market Analytics. \nServices include aggregated equity and derivative market statistics, theoretical values, trading indicators, portfolio and margin risk, scenarios, and historical data from Cboe’s markets as well as third-party consolidated data.\n \n◦\nFront-End Platforms. \nCboe provides multiple trading solutions and services including Cboe Silexx, LiveVol Pro, FT Options, and Trade Alert.\n◦\nConnectivity. \nServices include FIX Order Routing, Trade Drop Copy Network, Consolidated Audit Trail (“CAT”) reporting, and broker connectivity.\nWe provide data services to market participants globally through a number of distribution channels including direct, via our vendor partners and Cboe Global Cloud, which is our global cloud data distribution service.\nU.S. Tape Plans\nWe also derive a portion of our revenue from market data fees from U.S. tape plans, including Unlisted Trading Privileges (“UTPs”), the Consolidated Tape Association (“CTA”) and OPRA. Fees, net of plan costs, from UTP, CTA, and OPRA are allocated and distributed to plan participants like us according to their share of tape fees based on a formula, required by Regulation NMS, which may take into account both trading and quoting activity. \nCash and Spot Markets\nWe are one of the largest equities market operators, operating four U.S. equities exchanges, international exchanges in Europe, Canada, Japan and Australia, as well as a number of alternative trading systems and an FX platform.\nOur four U.S. equities exchanges, BZX, EDGX, BYX and EDGA, which are fully electronic, operate various market and pricing models including price-time, and price-time with retail priority, as well as various pricing models, including maker-taker and taker-maker fee structures. In addition to these market models, each of the U.S. equity exchanges provides numerous specific order types that are designed to enhance their respective market models.\nBIDS Trading, the U.S. equities ATS market, which is fully electronic and is an independently managed and operated trading venue, separate from and not integrated with the Exchanges, utilizes a sponsored access model to provide anonymous executions in NMS stocks. Cboe and BIDS Trading collaborate in operating similar venues with our cash and spot markets in Australia, Canada, Europe, and Japan.\nOur fully electronic Canadian securities exchange, Cboe Canada Inc., offers four order books, NEO-L, NEO-N, NEO-D and MATCHNow, which operate various market models including maker-taker, taker-maker, large order priority, and frequent call matches with continuous execution opportunities, among others.\nIn Europe, we operate a number of market models, including continuous Lit orderbooks, periodic auction orderbooks, dark midpoint orderbooks, a post-closing cross, as well as two BIDS Europe orderbooks.\n13\nTable \no\nf Contents\nCboe Australia is a regulated stock exchange that is fully electronic. Cboe Australia utilizes a model that charges a different ad valorem fee rate depending on whether a participant is making or taking liquidity.\nCboe Japan offers two fully electronic displayed markets, Cboe-Alpha and Cboe-Select. Cboe Japan also offers two fully electronic non-displayed markets, Cboe-Match, which matches VWAP orders during pre-market hours and Cboe BIDS Japan, which utilizes a price-time market model aiming for primary market mid-point trades.\nThe Cboe FX platform provides institutional FX trading services and utilizes a price-firmness-time priority market model. For our FX NDF markets, Cboe SEF utilizes a price-firmness-time priority market model.\nListing\nCboe operates five listing venues across the globe that are structured and designed, in the U.S. and Canada, for all types of equity instruments, such as ETPs, corporate securities, warrants and depositary receipts, while in the UK and European Union (\"EU\") they support ETPs only. In Australia, both ETPs and warrants are supported. Over the course of 2024, Cboe added approximately 730 listings across the globe and had approximately 2,460 listings as of December 31, 2024. Cboe also offers intralisting on its different equities markets through Cboe Global Listings, the first-of-its-kind, global listing network facilitating worldwide access to capital and secondary liquidity for companies and ETFs.\nClearing\nOur subsidiary Cboe Clear Europe, a European central counterparty (“CCP”), provides post-trade clearing services, to stock exchanges, multilateral trading facilities and for over-the-counter equities trades and exchange-traded derivatives trades. Cboe Clear Europe acts as a central counterparty that, for its clearing participants, becomes the buyer to every seller and the seller to every buyer. As a result, it guarantees the timely performance of the settlement obligations of buyers and sellers and takes on the risk of the performance of the transactions that it clears. Additionally, as a Financial Market Infrastructure, Cboe Clear Europe is subject to strict business continuity requirements and regulatory oversight. Cboe Clear Europe clears equities and equity like instruments traded on 47 European trading segments. Cboe Clear Europe also clears equity derivative instruments traded on Cboe NL. In 2024, Cboe Clear Europe provided CCP protection for an average of €49 billion of cleared value on a daily basis. Through the process of netting, in 2024, Cboe Clear Europe eliminated 70%, or €34 billion of the average daily cleared value, leaving an average daily settlement value of €15 billion. In 2023, Cboe Clear Europe provided CCP protection for an average of €44 billion of cleared value on a daily basis. Through the process of netting, in 2023, Cboe Clear Europe eliminated 71%, or €31 billion of the average daily cleared value, leaving an average daily settlement value of €13 billion. As of November 25, 2024, Cboe Clear Europe also launched a first-of-its-kind service for SFT in cash equities and ETFs, which includes central clearing, settlement and post-trade lifecycle management.\nCboe Clear U.S. is a CFTC-registered derivatives clearing organization (“DCO”) that provides clearing and settlement of cash-settled margin Bitcoin and Ether futures contracts for its affiliate, Cboe Digital Exchange.\nCustomers\nOur customers generally include financial institutions, trading platforms, institutional and individual investors, and professional traders. Our equities and options customers in the United States include trading permit holders and members (as applicable) of Cboe Options, C2, BZX, BYX, EDGX, and EDGA, which are SEC-registered broker-dealers, and the customers of those broker-dealers. Our Canadian equities customers include members of Cboe Canada Inc., which are Canadian registered investment dealers. Our Australian customers include trading participants of Cboe Australia, which are Australian registered investment dealers, and certain clients of those dealers. Our Japanese customers include participants of Cboe-Alpha, Cboe-Select, Cboe-Match and Cboe BIDS Japan, which are Japanese registered broker-dealers, and certain clients of those dealers. Our ATS equities participants in the United States include subscribers of BIDS Trading, which are SEC-registered broker-dealers, and certain customers of those broker-dealers. Our futures customers include banks, futures commission merchants and their customers, hedge funds, asset managers, proprietary trading firms, and Commodity Trading Advisors. Similarly, our equities customers in Europe are EU regulated brokerage and proprietary trading firms, as well as sponsored access clients of these brokerage firms and certain non-EU regulated and unregulated direct access participants. Cboe Clear Europe clearing participants include EEA regulated banks and brokerage trading firms. Our institutional global FX customers include banks, broker-dealers, hedge funds, asset managers, proprietary trading firms, Commodity Trading Advisors, and corporates. Access to our markets and trading rights and privileges depend upon the nature of the customer, such as whether the individual or firm is (or is eligible to become) a trading permit holder, trading privilege holder, member, participant, or subscriber of one of our markets. For information regarding risks related to our customers see “Risk Factors.”\nCompetition\nThe industry in which we operate is intensely competitive. We believe we face competition on a number of factors, including: \n•\nprice, quality and speed of our trade and clearing execution; \n14\nTable \no\nf Contents\n•\nfunctionality and ease of use of our trading and clearing platforms; \n•\nreliability, integrity, depth of book, liquidity, range and functionality of our products and services;\n•\nintegrity of our marketplaces; \n•\ntechnological innovation and adoption;\n•\nour brand awareness; and \n•\nour reputation. \nWe believe that we compete favorably with respect to these factors through a variety of methods, including:\n•\noffering access to a broad array of products and services, including proprietary products and market data;\n•\noffering fee schedules and pricing models that both attract order flow and provide incentives to liquidity providers; \n•\nproviding advanced technology that offers broad functionality, low latency, fast execution, ease of use, scalability, reliability, and security; \n•\noffering efficient, transparent and liquid marketplaces; \n•\noffering deep and liquid markets with opportunities for price improvement;\n•\noffering broad trading platform access in the EU;\n•\noffering efficient and transparent clearing services designed to help maximize netting opportunities;\n•\nmaintaining close relationships with customers; and \n•\nproviding customers with a comprehensive source of information on options and ETPs as well as extensive options education. \nIn our proprietary products, we compete against other futures exchanges and swap execution facilities that offer similar products, as well as against financial market participants that offer similar over-the-counter derivatives. We also compete against certain multi-listed options products, such as SPY options and cash settled index options, which may offer similar market exposure of our proprietary products, such as SPX options.\nThe listed options industry is extremely competitive. As of December 31, 2024, our four options exchanges compete with 14 other U.S. options exchanges, in large part due to existing exchange holding companies opening new exchanges that offer different markets and pricing models on existing technology. Most of the equity and ETP options listed and traded on our exchanges are also listed and traded on the other exchanges. In addition, the options exchanges that we compete with set fees and rebates to attract multi-listed options business to their exchanges, which has historically reduced the net revenue per contract that we generate from multi-listed options, and the options exchanges that we compete with structure their options businesses in partnership with established market participants, such as consolidators, and other order flow providers, to increase their volume traded.\nOur U.S. equities and the BIDS Trading ATS compete against 12 other equities exchanges as of December 31, 2024, and over 25 other ATSs and single dealer platforms. Market participants have multiple venues for the execution of orders, including national securities exchanges and numerous off-exchange venues, including other ATSs and broker-dealers that internalize orders off-exchange. Additionally, corporate and ETP issuers have multiple venues they can choose from in the listing of their products. In Canada, our recognized Canadian securities exchange, Cboe Canada Inc., competes with several Canadian exchanges and ATSs. In Australia, our exchange, Cboe Australia, competes with other Australian exchanges and crossing systems. In Japan, our equities exchanges and PTSs, compete with several Japanese exchanges and other PTSs.\nThe market for execution and clearing services in Europe became more competitive following the introduction of MiFID II and the Regulation on Markets in Financial Instruments (Regulation (EU) No 600/2014) (“MiFIR”). Our major competitors in Europe include national stock exchanges, other pan-European MTFs, systematic internalizers, and other European clearinghouses.\nThe global FX market remains severely fragmented, with transparent automated marketplaces such as Cboe FX challenging a small number of similarly situated competitors. While the global FX market has experienced a shift from competing interbank platforms to ECNs, the electronification of the spot and NDF FX market may encounter resistance from customers that still prefer to utilize the phone, instant chats, terminals and key banking relationships for price discovery and trading. Furthermore, levels of electronification of the FX market have remained relatively static. The electronic spot FX market is also intensely competitive, with over 10 other venues competing for market share as of December 31, 2024. Cboe measures and reports on market share against a narrower set of competitors, included in those venues. \nIn addition, Cboe Data Vantage faces competition from other securities exchanges, technology companies, third-party market data providers, and information and software vendors, which have their own substantial market data distribution capabilities that serve as alternative means for receiving open market data feeds instead of connecting directly to our exchanges or trading venues. The sale of our proprietary data products is also under competitive threat from ATSs and trading venues that offer similar products. Distributors and consumers of our market data may also use our market data as an input into a product that competes against one of our traded or cleared products.\n15\nTable \no\nf Contents\nTechnology\nCboe's Trading Technology\nThe trading platform for our equities, options, and futures markets is built upon our Cboe Titanium technology platform. It is developed, owned, and operated in-house and is designed to optimize reliability, speed, scalability, and versatility. Using common protocols and features, Cboe’s unified Cboe Titanium technology platform is designed to offer customers an efficient, consistent experience regardless of where they are in the world. Our exchanges provide different market models, appealing to different user bases, and the trading technologies support all of them. Further, the technologies are designed to support many specialized features for each of the markets, such as: dark pools, trade reporting facility, systematic internalizer, Large-in-Scale, smart order routing, FLEX options, 24x5 trading, and hybrid trading (combining electronic and open outcry). In addition, Cboe and its applicable subsidiaries operate separate trading and/or clearing platforms, as applicable, for BIDS Trading, certain Cboe Canada Inc. order books, Cboe Digital Exchange, Cboe Clear U.S., Cboe Clear Europe, and Cboe FX.\nOur trading platforms have generally experienced very low operational downtime and low latency. We have undertaken significant efforts to upgrade our Cboe Titanium technology platform to help meet increased performance and capacity requirements and help ensure competitiveness, support growth and advance a consistent world class platform globally. The trading platforms use readily available hardware, thereby minimizing capital outlays required for each new market entry. Also, in order to continue to implement new enhancements to our trading platforms, new releases of software are generally deployed routinely in all of the applicable markets.\nDisaster Recovery\nWe operate and maintain geographically diverse disaster recovery facilities for all of our markets. We expect that, in certain instances, the disaster recovery facilities can be up and running in a short period of time and in certain instances we may also work with our market participants to try to quickly reopen marketplaces. We regularly test our data center recovery plans and periodically carry out weekend tests using our back-up data centers, as well as an annual test with our U.S. trading participants. Cboe Canada Inc., as required by local regulations, conducts internal testing of its disaster recovery data processing capabilities at least annually, and participates in the bi-annual testing coordinated by CIRO. Cboe Australia and Cboe Japan conduct internal testing of their disaster recovery data processing capabilities at least annually. In Europe, we also regularly test our data center recovery plans and periodically carry out weekend tests which use our back-up data center, as well as an annual test with our European trading participants. We continue to work to improve both the availability of our technology and our disaster recovery facilities.\nEmerging Technologies\nWe are exploring the potential use of new technologies, such as artificial intelligence (“AI”), machine learning, blockchain, distributed ledger technology, quantum computing, the cloud, and other emerging technologies to potentially help drive new products, increase productivity, improve our self-regulatory oversight responsibilities, and increase automation of tasks.\nRouting and Clearing\nOCC is the sole provider of clearing on all of our U.S. options exchanges and CFE. National Securities Clearing Corporation (“NSCC”), a subsidiary of the Depository Trust and Clearing Corporation (“DTC”), is the sole provider of clearing on our U.S. listed equity exchanges. The Canadian Depository for Securities (“CDS”) is the sole provider of clearing on all equities transactions occurring on Cboe Canada Inc. With respect to Australian equities and derivatives, Cboe Australia delivers matched trades of its customers to ASX Clear Pty Ltd and ASX Settlement Pty Ltd. ASX Clear Pty Ltd acts as a central counterparty on all transactions occurring on Cboe Australia. The Japan Securities Clearing Corporation (“JSCC”) is the sole provider of clearing on all equities transactions occurring on Cboe Japan’s Cboe-Alpha, Cboe-Select, Cboe-Match and Cboe BIDS Japan. BofA Securities, Inc. (“BOA”) is the sole provider of clearing on all equities transactions occurring on BIDS Trading. Cboe Europe Equities relies on LCH Limited and LCH SA (“LCH”), Cboe Clear Europe, and SIX x-clear Ltd (“SIX x-clear”) to clear trades in European listed equity securities and exchange traded products as part of an interoperable clearing model. For derivatives, Cboe NL relies on Cboe Clear Europe to clear both index and single stock derivative contracts. With respect to U.S. government securities transactions executed on Cboe Fixed Income, we use Mirae Asset Securities (USA) Inc. to deliver matched trades to the Fixed Income Clearing Corporation (FICC) Government Securities Division (GSD), which acts as a central counterparty on all transactions occurring on Cboe Fixed Income and, as such, guarantees clearance and settlement of all of those matched trades. For SFT in cash equities and ETFs, Cboe Clear Europe provides central clearing, settlement and post-trade lifecycle management. Cboe Clear U.S. is the sole provider of clearing and settlement of all digital asset transactions occurring on Cboe Digital Exchange in cash-settled margin futures on Bitcoin and Ether.\nCboe Trading is a routing broker-dealer used by our four U.S. equities exchanges and our four U.S. options exchanges, including the electronic platform portion of Cboe Options. Cboe Trading’s clearing firms are Wedbush Securities, Inc. (“Wedbush”) and Morgan Stanley & Co. LLC (“Morgan Stanley”).\n16\nTable \no\nf Contents\nDigital Assets and Recent Developments\nCboe Digital is an operator of a CFTC-regulated futures exchange (Cboe Digital Exchange) and a CFTC-regulated clearinghouse (Cboe Clear U.S.). Prior to May 31, 2024, Cboe Digital Exchange and Cboe Clear U.S. also operated a U.S.-based spot digital asset trading market (“Cboe Digital spot market”), but as of May 31, 2024, the Cboe Digital spot market is closed for all participant and trading purposes. Cboe Digital does not engage in proprietary trading activities and does not maintain a trading entity. Cboe Digital does not maintain any digital assets, does not itself trade digital assets, does not trade on its own exchange, and does not maintain an affiliate trading entity for purposes of trading, market making, or liquidity provision on its exchange. Cboe Clear U.S. maintains its own operating funds in separate bank accounts from its customer funds.\nRegulatory Environment and Compliance\nVarious aspects of our business are subject to regulation by the SEC, CFTC, FINRA, various state regulators, CIRO, the Canadian Securities Administrators (and, in particular, the Ontario Securities Commission or “OSC”), the Australian Securities & Investments Commission (“ASIC”), JFSA, JSDA, ESMA, FCA, the Central Bank of the Netherlands (“DNB”), AFM, Bank of England, and other international regulatory authorities where our exchanges or Cboe Clear Europe may be authorized to act as foreign exchanges or provide clearing services, and market participants may be subject to regulation by the SEC, CFTC, FINRA, National Futures Association (“NFA”), FCA, Board of Governors of the Federal Reserve, U.S. Department of the Treasury and/or foreign regulators.\nRecent Developments\nLaws and regulations regarding our business are frequently modified or changed to address perceived problems, new products, or competition or at the request of market participants. In particular, both the SEC and CFTC will be under new leadership as part of the transition to President Trump's administration which adds additional uncertainty to the regulatory environment. The following is a brief discussion of recent regulatory developments that may significantly impact our business.\nUnited States\nEquity Market Structure \nIn December 2022, the SEC released four proposals that could impact equity market structure: (1) Disclosure of Order Execution Information (\"Rule 605\"); (2) Regulation NMS Amendments: Tick Size, Access Fees, and Transparency (“Tick Size/Access Fee Cap”); (3) Regulation Best Execution; and (4) Proposed Rule to Enhance Order Competition. Each of these proposals have been noticed for public comment, and in 2024, Rule 605 and the Tick Size/Access Fee Cap proposals were approved by the SEC and await implementation. Rule 605 may result in increased technology and compliance costs to Cboe. The Tick Size/Access Fee Cap rule is also likely to result in increased technology and compliance costs to Cboe, as well as potential adverse impact to Cboe’s trading volume and transaction fee revenue. The SEC has yet to take any additional action on Regulation Best Execution and Order Competition, but if adopted as-is, these proposals could result in market technology changes and additional compliance costs to Cboe. Further, it is possible that additional proposals or changes to the existing equity market structure could have a negative impact on our operations. In addition, bills are sometimes introduced in the U.S. Congress that also could potentially impact equity market structure and adversely impact our volumes and operations. See “Risk Factors” for more information. \nVolume Based Pricing Proposal\nOn October 18, 2023, the SEC released a proposed rule that would impact the way in which volume based discounts are applied (“Volume Based Proposal”). If adopted as-is, this Volume Based Proposal would prohibit national securities exchanges, including Cboe’s equities exchanges, BZX, BYX, EDGX, and EDGA, from offering volume-based transaction pricing in connection with the execution of agency or riskless principal orders in NMS stocks, and likely inhibit Cboe’s ability to attract liquidity and offer competitive pricing to differentiate Cboe from our competitor exchanges. Although the proposed new rules do not appear likely to have a potential near term material impact, the new rules, if adopted as-is, may have a long term material impact on our business, financial condition, and operating results if, for example, there is a reduction of overall volumes, liquidity, or market share on Cboe’s equities exchanges, BZX, BYX, EDGX, and EDGA. See “Risk Factors” for more information. \nEurope\nOTC Derivatives, Central Counterparties and Trade Repositories\nRegulation (EU) No 648/2012 of the European Parliament and of the Council of July 4, 2012 on OTC derivatives, central counterparties and trade repositories (the “European Market Infrastructure Regulation” or “EMIR”) sets out rules relating to over-the-counter (“OTC”) derivatives markets, central counterparties and trade repositories. EMIR was enhanced \n17\nTable \no\nf Contents\nand amended by EMIR REFIT and EMIR 2.2. The final text on EMIR 3.0 entered into force on December 24, 2024. Further supporting regulatory technical standards are expected to be published over the course of 2025.\nEU Transparency Rules \nOn November 11, 2021, the European Council (“E.C.”) published its proposal for a review of EU market structure legislation, including proposed amendments to MiFIR and Directive 2014/65/EU on markets in financial instruments (“MiFID II”). The legislative phase of the review is now complete and revised MiFIR rules came into effect on March 28, 2024. The deadline for transposing MiFID II amendments is September 29, 2025. The final text includes, among other provisions, provision for a consolidated tape for the EU, a ban on payment for order flow, replacement of the double volume cap with a single volume cap for trades executed under certain trade waivers and changes to the transparency regime for equities. These provisions are expected to be implemented in the second half of 2025 through a number of level 2 measures. The legislation, as drafted, does not appear likely to have a material adverse effect on our business, financial condition, and operating results. However, there are review clauses contained in the legislation which provide a further opportunity to review the effectiveness of the transparency regime, at which point, potential changes may have a material adverse effect on our business, financial condition, and operating results. See “Risk Factors” for more information.\nCompliance\nU.S. Securities Industry\nFederal securities laws have established a two-tiered system for the regulation of securities exchanges and market participants. The first tier consists of the SEC, which has primary responsibility for enforcing federal securities laws. The second tier consists of self-regulatory organizations (“SROs”), which are non-governmental entities that must register with and are regulated by the SEC. The Exchanges are SROs, each registered under Section 6 of the Exchange Act of 1934, as amended (“Exchange Act”) as a “national securities exchange,” and are subject to oversight by the SEC.\nSROs are an essential component of the regulatory scheme of the Exchange Act for providing fair and orderly markets and protecting investors. To be registered as a national securities exchange, an exchange must successfully undergo an application and review process with the SEC prior to beginning operations. Among other things, the SEC must determine that the SRO has the ability to comply with the Exchange Act and to enforce compliance by its members and persons associated with its members with the provisions of the Exchange Act, the rules and regulations thereunder and the rules of the exchange.\nIn general, an exchange SRO is responsible for operating its trading platforms consistent with its rules, and regulating its members through the adoption and enforcement of rules governing the business conduct of its members. The rules of the exchange must also assure fair representation of its members in the selection of its directors and administration of its affairs and, among other things, provide that one or more directors be representative of issuers or investors and not be associated with a member of the exchange or with a broker or dealer. Additionally, the rules of the exchange must be adequate to ensure fair dealing and to protect investors and may not impose any burden on competition not necessary or appropriate in furtherance of the purposes of the Exchange Act.\nAs registered national securities exchanges, virtually all facets of our Exchange operations are subject to the SEC’s oversight, as prescribed by the Exchange Act. The Exchange Act and the rules thereunder impose on us many regulatory and operational responsibilities, including record keeping and the day-to-day responsibilities for market operations and broker-dealer oversight. Furthermore, as SROs, the Exchanges are potentially subject to regulatory or legal action by the SEC or other interested parties. The SEC also has broad enforcement powers to censure, fine, issue cease-and-desist orders, prohibit us from engaging in some of our businesses, suspend or revoke our designation as a registered securities exchange, or remove or censure any of our officers or directors who violate applicable laws or regulations. For example, in the past we have entered into consent orders with the SEC, under which our subsidiaries were censured, ordered to cease and desist from violating certain sections of the Exchange Act, paid fines, and completed certain undertakings. \nAs part of its regulatory oversight, the SEC conducts periodic reviews and inspections of exchanges, and the Exchanges have been subject to such routine reviews and inspections. To the extent such reviews and inspections result in regulatory or other changes, we may be required to modify the manner in which we conduct our business, which may adversely affect our business. We collect certain fees to cover Section 31 fees charged to the Exchanges by the SEC and certain fees derived from our regulatory function and fines in connection with our disciplinary proceedings. The Exchanges are responsible for the ultimate payment of Section 31 fees to the SEC. Additionally, under the rules of each of our exchanges, as required by the SEC, any revenue derived from the regulatory fees and fines cannot be used for non-regulatory purposes.\nSection 19 of the Exchange Act also provides that we must submit to the SEC proposed changes to any of the Exchanges’ rules, including revisions of their certificates of incorporation, bylaws, or other governing documents of the SROs or their parent companies. The SEC will typically publish the proposal for public comment, following which the SEC may approve or disapprove the proposal, as it deems appropriate. Certain categories of rule changes, like fee changes, can be effective on filing, but the SEC retains the ability to suspend or reject such filings within a prescribed period of time.\n18\nTable \no\nf Contents\nCanadian Securities Industry\nCboe Canada Inc. is subject to comprehensive regulation and oversight by its primary provincial securities regulatory authority, the OSC. In addition, Cboe Canada Inc. is a Marketplace Member of, and subject to a regulation services agreement with, CIRO. The regulations applicable to Cboe Canada Inc. cover a wide array of areas, including, but not limited to, marketplace operations (which include corporate governance, fair access, systems compliance and integrity, and conflict management requirements), trading rules, electronic trading risk management, and financial viability.\nAustralian Securities Industry\nCboe Australia is subject to comprehensive regulation and oversight by ASIC. The regulations applicable to Cboe Australia cover a wide array of areas, including, but not limited to, marketplace operations (which include corporate governance, fair access, systems compliance and integrity, and conflict management requirements), trading rules, electronic trading risk management, and financial viability.\nJapanese Securities Industry\nCboe Japan is subject to comprehensive regulation and oversight by the JFSA and the JSDA. The regulations applicable to Cboe Japan cover a wide array of areas, including, but not limited to, marketplace operations (which include corporate governance, fair access, systems compliance and integrity, and conflict management requirements), trading rules, electronic trading risk management, and financial viability.\nFutures and Swaps Industry-CFE and Cboe SEF\nThe operations of each of CFE and Cboe SEF are subject to regulation by the CFTC under the Commodity Exchange Act (“CEA”). The CEA generally requires that futures trading in the United States be conducted on a designated contract market and, in some cases, requires swaps trading to be conducted on a swap execution facility (“SEF”) or designated contract market (“DCM”). The CEA and CFTC regulations establish criteria for an exchange to be designated as a contract market on which futures and futures options contracts may be traded, and for a trading platform to be designated as a swap execution facility on which certain swaps may be traded. Designation as a contract market or swap execution facility for the trading of specified futures or swaps contracts is non-exclusive. This means that the CFTC may permit additional exchanges or trading platforms to be contract markets or swap execution facilities for trading the same or similar contracts. \nCFE is a designated contract market, and Cboe SEF is a swap execution facility, each of which is subject to the oversight of the CFTC and to a variety of ongoing regulatory and reporting responsibilities under the CEA. As a designated contract market, CFE is required to comply with the applicable core principles and regulations under the CEA, as is Cboe SEF as a swap execution facility. Each of CFE and Cboe SEF has surveillance and regulatory operations and procedures to monitor and enforce compliance by trading privilege holders with CFE rules, and by participants with Cboe SEF rules, as applicable. If CFE or Cboe SEF fails to comply with applicable laws, rules or regulations, it may be subject to: censure, fines, cease-and-desist orders, suspension of its business, and removal of personnel or other sanctions, including revocation of CFE’s designation as a contract market or Cboe SEF’s designation as a swap execution facility.\nDigital Assets\nCboe Digital Exchange is a CFTC-registered designated contract market, and Cboe Clear U.S. is a CFTC-registered derivatives clearing organization, each of which is subject to the oversight of the CFTC and to a variety of ongoing regulatory and reporting responsibilities under the CEA. As a designated contract market, Cboe Digital Exchange is required to comply with the applicable core principles and regulations under the CEA, as is Cboe Clear U.S. as a derivatives clearing organization. Each of Cboe Digital Exchange and Cboe Clear U.S. has surveillance and regulatory operations and procedures to monitor and enforce compliance by trading privilege holders with Cboe Digital Exchange rules, and by clearing members with Cboe Clear U.S. rules. If Cboe Digital Exchange or Cboe Clear U.S. fails to comply with applicable laws, rules or regulations, it may be subject to censure, fines, cease-and-desist orders, suspension of its business, removal of personnel or other sanctions, including revocation of Cboe Digital Exchange’s designation as a contract market or Cboe Clear U.S.’s designation as a derivatives clearing organization.\nCboe Clear U.S. has surrendered or is in the process of surrendering its money transmitter licenses in the states where such licenses or equivalent were required to conduct business in connection with the Cboe Digital spot market, which closed on May 31, 2024. In addition, Cboe Clear U.S. has surrendered its BitLicense from the New York Department of Financial Services (“NYDFS”).\nEurope\nCboe Europe is located in London and is subject to regulation in the UK and to certain European regulations. The current UK regulatory system was established by the Financial Services Act 2012 (“FSA12”), which amended the Financial Services and Markets Act 2000. The legislation replaced the previous financial services regulator, the Financial Services \n19\nTable \no\nf Contents\nAuthority, with three new bodies: The Financial Policy Committee (“FPC”), The Prudential Regulation Authority, and the FCA. Financial conduct of markets, including activity on, and the operation of, markets is regulated by the FCA, which is an independent non-governmental body, given statutory powers by the FSA12. The FCA has three statutory objectives: to secure an appropriate degree of protection for consumers; to protect and enhance the integrity of the UK financial system; and to promote effective competition in the interests of consumers in the markets for financial services. The FCA is accountable to His Majesty’s Treasury Ministers and, through them, to Parliament. \nCboe Clear Europe and Cboe NL are located in Amsterdam and subject to Dutch law and regulation. The current Dutch regulatory system was established by the Act on Financial Supervision. Financial conduct of markets, including activity on, and the operation of, markets is regulated by the AFM. Financial conduct of CCPs, including clearing activity is regulated by the AFM and DNB. The AFM is an independent non-governmental body, given statutory powers by the Act on Financial Supervision. The AFM has three strategic objectives: to promote the fair and conscientious provision of financial services, to promote the fair and efficient operation of the capital markets, and to contribute to the stability of the financial system. The AFM is accountable to the Minister of Finance. The DNB is the Dutch central bank, financial sector supervisor and resolution authority. The DNB is committed to a stable financial system: stable prices, solid financial institutions, and properly functioning payment transfers. Cboe Clear Europe is recognized as a non-UK CCP in the United Kingdom, which allows it to provide services to UK Clearing Participants and UK trading venues. Cboe Clear Europe is also recognized as a foreign central counterparty in Switzerland, which allows it to provide services to Swiss Clearing Participants and SIX Swiss Exchange AG. Cboe NL is also subject to regulation by ESMA.\nMuch of the UK and Dutch financial services regulation originates from the EU. Such regulation includes organizational requirements, capital resources requirements and the specific requirements for RMs and MTFs and are applicable to both Cboe Europe and Cboe NL. MiFID II and MiFIR set out requirements for RMs and MTFs with respect to the establishment of transparent and non-discretionary rules and procedures governing access and for fair and orderly trading and the efficient execution of orders, as well as to facilitate the efficient settlement of transactions conducted on RMs and MTFs and monitoring compliance with the rules. EMIR governs the CCPs operating in the EU and requires them to meet common risk management, governance and capital adequacy standards. The regulatory functions required of Cboe Europe Equities and Derivatives, including Cboe Clear Europe and Cboe NL, by MiFID II, MiFIR, EMIR, and other relevant legislation and regulations are performed by in-house staff. Cboe Europe Equities and Derivatives utilize the same state-of-the-art, real-time surveillance system that is used in the U.S. to monitor trading and market activities on BZX, BYX, EDGA, and EDGX. Cboe Clear Europe utilizes proprietary risk management software to monitor settlement and funding flows.\nGlobal FX\nWhile the global institutional spot FX market remains largely unregulated, the enactment of the Dodd Frank Act and its related regulations in the United States and the ongoing implementation of MiFID II and MiFIR in Europe have impacted the regulatory landscape for currency derivative products. For example, certain standardized currency derivative products are required to trade on an organized trading venue such as a SEF or DCM in the United States or on an MTF or organized trading facility in Europe. Moreover, even in the largely unregulated spot FX market, this movement towards additional trading standards and norms is highlighted by the publication of the FX Global Code in 2017 by the Global Foreign Exchange Committee, and re-affirmed in 2021, reflecting principles of good conduct for the wholesale FX market, and whose publication may lead to additional oversight in the global FX market. Cboe FX issued a Statement of Commitment declaring its commitment to conduct its FX market activities in a manner consistent with the principles of the FX Global Code. Following the publication of the FX Global Code regulators continue to take a closer look at the spot FX market, and any decision to impose new regulations may affect our spot FX business line.\nBroker\n-\nDealers\nCboe Trading, BIDS Trading, and Cboe Fixed Income are registered broker-dealers regulated by the SEC, FINRA, other SROs of which they are members and various state securities regulators. Cboe Trading currently operates as a routing broker-dealer for sending orders from the Exchanges to other venues for execution, including routing orders among the Exchanges. Cboe Trading is considered a facility of each of the Exchanges and is subject to the rules of the Exchanges. The Exchanges are responsible for enforcing Cboe Trading’s compliance with their rules, including to ensure Cboe Trading is not given preferential treatment. BIDS Trading currently operates an ATS, which is designed to bring counterparties together to anonymously trade large blocks of U.S. equities. BIDS Trading is not a member of any of the U.S. national securities exchanges and is not subject to exchange rules. Cboe Fixed Income, a registered broker-dealer and member of FINRA, operates an electronic trading system for U.S. government securities targeted at the institutional inter-dealer market for trading on-the-run U.S. Treasury bonds and notes in the secondary OTC markets. Cboe Fixed Income’s participants are SEC registered broker-dealers that are members of The Depository Trust and Clearing Corporation’s Fixed Income Clearing Corporation.\nCboe Trading, BIDS Trading, and Cboe Fixed Income are subject to SEC and SRO rules, as applicable, and, as registered broker-dealers, regulations concerning all aspects of their businesses, including: trading practices, order handling, best execution, anti-money laundering, handling of material non-public information, safeguarding data, reporting, capital adequacy, record retention, market access and the conduct of their officers, employees, and other associated persons. The SEC, SROs and state securities commissions may conduct proceedings which can result in injunctions or other sanctions, \n20\nTable \no\nf Contents\ncensures, fines, the issuance of cease and desist orders, or the suspension or expulsion of a broker-dealer, its officers, or employees. The SEC and FINRA impose certain minimum capital requirement rules that require notification when a broker-dealer’s net capital falls below certain predefined criteria, dictate the ratio of debt to equity in the regulatory capital composition of a broker-dealer, constrain the ability of a broker-dealer to expand its business under certain circumstances and impose certain requirements that may have the effect of prohibiting a broker-dealer from distributing or withdrawing capital.\nIn addition, the ATS operated by BIDS Trading is not a registered national securities exchange or a facility thereof, as such, Cboe intends to maintain the BIDS ATS as an independently managed and operated trading venue, separate from and not integrated with the Exchanges. The Chief Executive Officer of BIDS Trading is expected to lead BIDS Trading as an independent business within Cboe, reporting into an independent committee of the board of Cboe Global Markets. Further, Cboe Trading will not route orders to BIDS Trading on behalf of the Exchanges.\nCboe Global Markets\nCertain aspects of Cboe Global Markets are also subject to SEC, FCA, and AFM oversight, including certain ownership and voting restrictions on its stockholders. The focus of the SEC’s regulation of Cboe Global Markets is to assure fair representation of members in the selection of the directors of the Exchanges, public participation in the governance of the Exchanges, and that the Exchanges can satisfy their regulatory responsibilities under the Exchange Act. Furthermore, the SEC requires that Cboe Global Markets give due regard to the preservation of the independence of the self-regulatory function of the Exchanges and to Cboe Global Markets’ obligations to investors and the general public. The SEC also requires that Cboe Global Markets not take any actions that would interfere with the effectuation of any decisions by the Board of Directors of any of the Exchanges relating to its regulatory functions or the structure of the market that it regulates or that would interfere with the ability of such Exchange to carry out its responsibilities under the Exchange Act. To the extent that Cboe Global Markets’ business activities involve or relate to the Exchanges, the officers and directors of Cboe Global Markets may be deemed to be officers and directors of the exchanges for purposes of and subject to oversight under the federal securities laws. Accordingly, the SEC may exercise direct supervision and disciplinary authority over certain Cboe Global Markets’ activities and those activities may be subject to SEC approval and, in some cases, public notice and comment. \nIn addition, Cboe Global Markets indirectly holds all of the issued share capital and voting rights in Cboe Europe and its wholly-owned subsidiaries, Cboe Chi-X Europe and Cboe NL. As a result, we and any person who holds, or has voting power with respect to, 10% or more of the outstanding shares of Cboe Global Markets common stock may be subject to certain regulatory requirements under UK and Dutch law. \nU.S. Regulatory Responsibilities\nOur U.S.-based exchanges are responsible for assessing the compliance of their TPHs or members, including Cboe Trading, with the respective exchange’s rules and the applicable rules of the SEC and/or CFTC. The main activities that the exchanges, as applicable, are required to monitor for the purpose of compliance with these rules include: \n•\nsurveillance designed to detect violations of exchange trading rules; \n•\nsurveillance designed to detect violations of SEC and/or CFTC rules; \n•\ninvestigation of matters involving potential rule violations; \n•\nthe investigation of complaints about possible rule violations brought by customers, TPHs, members, or other SROs; and \n•\nthe examination of TPHs or members for compliance with rules such as those related to net capital, books and records, market access, and other matters related to the TPHs’ or members’ exchange business functions. \nIn order to ensure market integrity, we regulate and monitor our TPHs’ and members’ trading activities by using both our employees and/or third parties under regulatory services agreements. See “U.S. Regulatory Agreements” below. Providing effective regulation is important for attracting and retaining the confidence and participation of market-makers, broker-dealers and institutional and retail investors.\nWe expend considerable time, financial resources, and effort to ensure that the exchanges’ rules and regulations conform to regulatory best practices within the securities and futures exchange industries and within the regulatory regime overseen by the SEC and CFTC, our primary U.S. regulators. In order to support our efforts and those of our market participants to comply with applicable law and our exchange rules, we developed a regulatory program to monitor market activity on our exchanges.\nAll of our Exchanges, CFE, and Cboe Digital Exchange are participants in various cooperative and regulatory information sharing agreements, including in the Intermarket Surveillance Group (“ISG”). ISG is an international information-sharing cooperative governed by a written agreement that provides for a comprehensive surveillance sharing arrangement. In addition to the agreement for confidential information sharing, the ISG provides a framework for the coordination of \n21\nTable \no\nf Contents\nregulatory efforts among exchanges trading securities, commodity futures, and related products to address potential intermarket manipulations and trading abuses. \nCFE, Cboe SEF, and Cboe Digital Exchange are also members of the Joint Audit Committee (“JAC”), which is a representative committee of the U.S. futures exchanges and regulatory organizations which participate in a joint audit and financial surveillance program that has been approved and is overseen by the CFTC. The JAC’s primary responsibility is to oversee the implementation and functioning of all terms and conditions of the Joint Audit Agreement and to determine the practices and procedures to be followed by each designated self-regulatory organization in the conduct of regulatory examinations and financial reviews of FCMs.\nAs part of the regulatory program, each of our Exchanges and CFE have rules pertaining to their respective disciplinary processes.\nU.S. Regulatory Agreements\nThe Exchanges and CFE have entered into agreements under which third parties have agreed to perform regulatory functions on behalf of our markets (e.g., regulatory services agreements). As discussed below, in addition, in certain other instances for our Exchanges, a third party has been allocated the regulatory responsibility under Rule 17d-1 or Rule 17d-2 under the Exchange Act, while in others, we retain the regulatory responsibility for the activities. \nRegulatory Services Agreement with FINRA\nThe Exchanges have entered into agreements with FINRA under which FINRA has agreed to provide regulatory services to the Exchanges. Under these agreements, FINRA performs certain regulatory functions on behalf of the Exchanges and, to avoid any potential conflicts of interest concerning the regulation and oversight of Cboe Trading, certain regulatory services specific to Cboe Trading. The Exchanges remain responsible for the regulation of their TPHs, members and marketplaces, and retain the authority for bringing disciplinary actions against their TPHs and members, although FINRA performs certain functions on behalf of the Exchanges. The Exchanges also perform certain regulatory and disciplinary-related functions in-house.\nRegulatory Services Agreement with OCC\nWhile CFE also performs most regulatory and disciplinary-related functions in-house, the OCC has performed and continues to perform certain regulatory functions on behalf of CFE pursuant to an RSA with CFE. Whether performed under an RSA or in-house, CFE retains overall responsibility for the regulation of its marketplace and for bringing disciplinary actions.\nRule 17d-1 Designations and Rule 17d-2 Agreements\nSection 17(d) of the Exchange Act and the related Exchange Act rules permit SROs to allocate certain regulatory responsibilities to avoid duplicative oversight and regulation. Under Exchange Act Rule 17d-1, the SEC designates one SRO to be the designated examining authority (“DEA”) for each broker-dealer that is a member of more than one SRO. The DEA is responsible for the regulatory oversight of applicable financial responsibility rules pertaining to that broker-dealer. Cboe Options is the DEA for several of its TPHs. Cboe Trading’s assigned DEA is FINRA. \nExchange Act Rule 17d-2 permits SROs to enter into agreements, commonly called Rule 17d-2 agreements, which are approved by the SEC and concern the allocation of regulatory responsibility for rules applicable to TPHs and members that those SROs have in common. The Exchanges have entered into certain bi-lateral Rule 17d-2 agreements under which FINRA is allocated responsibility for enforcing certain federal securities laws and certain exchange rules that are common with FINRA rules. The Exchanges have entered into certain other multi-party Rule 17d-2 agreements that allocate responsibility among the participating SROs, which may include the Exchanges, for oversight of their allocated common members compliance with certain rules governing, among other items, options related sales practices, options related market surveillance, insider trading, NMS and Consolidated Audit Trail (“CAT”) NMS plan compliance. \nNational Market System Plans\nWe are member participants of several NMS plans including, but not limited to, the following: Cboe Options, C2, BZX, and EDGX are member exchanges in OPRA, which is the designated securities information processor for market information that is generated through the trading of exchange-listed securities options in the United States, and it disseminates certain core trading information, such as last sale reports and quotations. BZX, BYX, EDGA, and EDGX also participate in the CTA/CQ and the UTP Plans, which perform analogous services for the U.S. equities market. In November of 2024, the SEC approved a new Consolidated Tape Plan that, when fully operational, will replace the existing CTA/CQ and UTP Plans. The Securities Information Automation Corporation acts as the “processor” for OPRA and the CTA/CQ Plans. Nasdaq Stock Market, LLC acts as the processor for the Nasdaq Unlisted Trading Privileges Plan. See “Risk Factors” for more information regarding the consolidated data plan order.\n22\nTable \no\nf Contents\nCboe Options, C2, BZX, and EDGX are also parties to the Options Order Protection and Locked/Crossed Market Plan, which is designed to prohibit trade-throughs and avoid locked/crossed markets. Cboe Options, C2, BZX, and EDGX are also parties to the Options Listing Procedures Plan, which sets forth the procedures that the options exchanges must follow to list new options. Cboe Options, BZX, EDGA, and EDGX are also parties to the NMS plan for the selection and reservation of securities symbols. \nUnder the Options Regulatory Surveillance Authority Plan (“ORSA Plan”), U.S. securities options exchanges are permitted to act jointly in the administration, operation and maintenance of a regulatory system for the surveillance, investigation and detection of the unlawful use of undisclosed, material information in trading in one or more of their markets. The ORSA Plan is intended to enhance the effectiveness and efficiency with which the exchanges regulate their respective markets and to avoid duplication of certain regulatory efforts. FINRA operates the ORSA Plan facility for options insider trading.\nThe Consolidated Audit Trail Plan (“CAT Plan”) functions as the limited liability company agreement of Consolidated Audit Trail, LLC (“CATLLC”), the limited liability company formed under Delaware state law through which the SROs (the “Plan Participants”) conduct the activities of the Consolidated Audit Trail (“CAT”). The CAT Plan also serves as the national market system plan pertaining to the creation, implementation, and maintenance of a CAT that tracks orders throughout their lifecycle, which strives to enhance regulators’ ability to efficiently monitor trading activity in Eligible Securities in the U.S. securities markets. Eligible Securities currently include NMS Stocks, Listed Options and OTC Equities. Order and trade data is required to be reported to the CAT central repository the following day by each SRO/Plan Participant and broker-dealer (an “Industry Member”), along with certain customer and account information by each Industry Member. On November 15, 2016, the SEC approved the CAT Plan and a phased implementation was originally required to begin in November 2017; however, there were some delays. The first phase of CAT (“Phase 1”) ultimately went live in November 2018, at which time we and other SROs/Plan Participants began initial reporting of order and trade file submissions to the CAT. The second phase of CAT (“Phase 2”) for Industry Members began with order and trade file submissions in June 2020. The final Phase 2 implementation sub-phase (\"Phase 2e\"), related to Industry Member submissions to the customer and account information submissions system (“CAIS”), was completed on May 31, 2024.\nOn May 15, 2020, the SEC adopted amendments to the CAT Plan to establish financial accountability provisions to achieve full CAT implementation, including a financial accountability milestone requiring full implementation of the CAT requirements by December 30, 2022. If the SEC were to determine any financial accountability milestone was not met, it may limit the SROs’/Plan Participants’ recovery of certain loans previously advanced to CATLLC to fund CAT costs. Due to the delayed completion of CAIS, the SROs/Plan Participants have submitted to the SEC requests to extend the timeline for the completion of Phase 2e and the deadline for the final financial accountability milestone and additional requests may be submitted. If the SEC does not grant extensions and finds that the SROs/Plan Participants did not satisfy the related last financial accountability milestone, it could result in the SROs/Plan Participants not being able to recover certain amounts loaned to CATLLC to fund CAT costs associated with this final sub-phase, which the amount of unrecoverable costs may increase for additional delays.\nOn September 6, 2023, the SEC issued an order approving an amendment to the CAT Plan to implement a revised funding model (“CAT Funding Model”) for CATLLC to fund the CAT. The approved CAT Funding Model contemplates two categories of CAT fees calculated based on the “executed equivalent shares” of transactions in eligible securities: (i) CAT fees assessed by CATLLC to Industry Members who are CAT Executing Brokers (the brokers responsible for executing each side of the transaction) to recover a portion of historical CAT costs previously funded by monies loaned to CATLLC by the Plan Participants; and (ii) CAT fees assessed by CATLLC to CAT Executing Brokers and Plan Participants to fund prospective CAT costs. \nPrior to the effectiveness of the CAT Funding Model, the funding of the CAT was solely provided by the SROs/Plan Participants in exchange for promissory notes. Pursuant to the CAT Funding Model, the Plan Participants submitted fee filings during the third week of August 2024 to assess fees as of October 1, 2024 by CATLLC to CAT Executing Brokers for Buyers and Sellers that will be collected by CATLLC and remitted to the Plan Participants as repayment of or a portion of the promissory notes issued by the Plan Participants to fund the CAT prior to January 1, 2022 (the \"CAT Historical Assessment #1 Fee\"). Additional CAT fees that will be collected by CATLLC to recover a portion of other historical CAT costs incurred between January 1, 2022 and July 15, 2024 are planned to be introduced at a later time through separate fee filings submitted by the Plan Participants. CATLLC started remitting funds collected through the CAT Historical Assessment #1 to Plan Participants in December 2024 (for transactions occurring in October 2024) and will continue to do so until the balance due to be collected is paid in full, which is estimated to occur over approximately 24 months from the fee's implementation. \nAdditionally, pursuant to the CAT Funding Model, the Plan Participants submitted fee filings during the second week of August 2024 to implement the applicable initial transaction-based fee rates that are to be assessed by CATLLC to CAT Executing Brokers to cover a portion of prospective CAT costs, effective as of September 3, 2024. Pursuant to fee filings submitted by Plan Participants on behalf of CATLLC, as of September 3, 2024, CATLLC began assessing transaction-based fees to CAT Executing Brokers for Buyers and Sellers to cover a portion of prospective CAT costs. At the same time, CATLLC also began assessing a transaction-based fee to the respective Plan Participants for the same amount. To continue to fund CATLLC as it transitioned to collecting fees from Industry Members and Plan Participants to cover ongoing CAT costs in accordance with the CAT Funding Model, Plan Participants temporarily issued short-term notes to CATLLC to cover CAT costs that were payable to CATLLC until CATLLC collected sufficient proceeds from the fees to cover those costs. As of \n23\nTable \no\nf Contents\nJanuary 2025, CATLLC has fully repaid these short-term notes through funds collected from the fees assessed to CAT Executing Brokers and Plan Participants. CATLLC has also used the funds collected to pay CATLLC expenses and has retained excess funds as a reserve as per the CAT Funding Model and budget. Moving forward, CATLLC plans for the Plan Participants to submit prospective fee filings on CATLLC’s behalf every six months to update the transaction fee rates as necessary to cover prospective CAT costs. The last such filings were submitted in December 2024 and effected a rate change beginning January 2, 2025. The Company expects Plan Participants will no longer issue additional short-term notes to CATLLC to fund CAT given that CATLLC has begun imposing and collecting fees to cover CAT costs.\nOn October 17, 2023, the American Securities Association (“ASA”) and Citadel Securities, LLC (“Citadel”) filed a Petition for Review of the CAT Funding Model Order in the U.S. Court of Appeals for the 11th Circuit (“11th Circuit”). On November 16, 2023, the Cboe U.S. national securities exchanges, the NYSE U.S. national securities exchanges, the Nasdaq U.S. national securities exchanges and CATLLC (\"Intervenors\") filed motions to intervene on behalf of the SEC. On January 17, 2024, the 11th Circuit granted each of the motions to intervene on behalf of the SEC and established a briefing schedule and merits briefing concluded in the second quarter of 2024. \nOn September 13, 2024, Citadel filed a motion to stay the CAT Funding Model Order and to enjoin the collection of certain CAT fees during the pendency of this litigation, which the 11th Circuit denied on November 27, 2024. Oral argument on the merits was held on February 3, 2025. This challenge or any other challenge to the CAT Funding Model Order and/or Plan Participant(s) fee filings on behalf of CATLLC may significantly delay efforts by CATLLC to continue collecting the CAT fees. As a result, the Plan Participants may continue to incur additional significant costs, and/or it may result in them not being able to collect on the promissory notes related to the funding of the implementation and operation of the CAT. The Company believes the challenge is without merit and intends to vigorously litigate the matter.\nPortions of promissory notes related to the funding of the implementation and operation of the CAT may not be collectible, including if the SEC finds that the SROs/Plan Participants did not satisfy any of the financial accountability milestones. The allowance for notes receivable credit losses associated with the CAT is calculated using a methodology that is primarily based on the structure of the notes and various potential outcomes under the CAT Funding Model. See Note 23 (\"Commitments, Contingencies, and Guarantees\") for more information.\nIntellectual Property\nWe own or have rights to a number of intellectual property assets, including trademarks, service marks, domain names, trade names, copyrights, trade secrets and patents. While the majority of our intellectual property is protected under U.S. law, we have many intellectual property assets protected by laws in Europe, Asia and other parts of the world. We license some intellectual property assets to other entities. We attempt to protect our intellectual property rights, while respecting the legitimate intellectual property rights of others. \nHuman Capital Management\nCboe has a robust human capital management program in place focused on equal opportunities including performance and career development, talent management, health and well-being, inclusivity, culture, comprehensive benefits, training, talent acquisition, and succession planning. \nEqual Opportunity and Inclusion\nCboe believes in an inclusive culture that promotes creativity, collaboration and innovation, which is critical to the success of our business and defining the markets of tomorrow. Cboe is an equal opportunity employer and provides equal employment opportunities to all qualified persons without regard to sex, gender, race, color, ethnicity, creed, religion, national origin, ancestry, citizenship status, age, veteran or military status, disability, marital status, domestic partnership or civil union status, pregnancy, sexual orientation, genetic status, gender identity or expression, and any other characteristic protected by applicable law (a “Protected Characteristic”). Cboe is committed to applying our Equal Employment Opportunity Policy to all employment practices that impact the terms and conditions of employment including, but not limited to, hiring, evaluation, discipline, promotion, training, compensation, transfer, and termination. Actively nurturing and maintaining an inclusive culture at Cboe is a core imperative. We believe that our collective and unique perspectives fuel our capabilities, enhance our team spirit and enable us to attract and retain top talent as we define the markets of the future. Our commitment and responsibility in this regard starts at the top, with leadership and support from the full Cboe Board of Directors and executive team.\nTo maintain and strengthen our pledge to inclusion and to keep a level playing field, we regularly review key touchpoints across the employee journey with Cboe, from the talent selection, promotion, compensation, leadership development, and succession planning processes and make adjustments, as necessary, to help ensure opportunity parity across the Company. Our goal is to ensure that fair pay and equal opportunity for all that results in a collaborative, high performing organization bringing new innovations to market and providing superior service to our customers.\nAt Cboe, we also have associate resource groups that are open to all employees, regardless of identity. We believe that community can be built based on shared identity and by learning about our differences.\n24\nTable \no\nf Contents\nWe also have a community engagement program, Cboe Empowers, that provides mentorship, scholarship and guidance to under-resourced students throughout their educational journey through access to Cboe’s associates, resources, work environment and other learning and experience opportunities.\nPerformance and Career Development\nCboe expects employees to perform their duties to the best of their ability and to develop their competencies for career growth. We recognize the need to provide ongoing, timely, and constructive performance feedback. Cboe has designed a Performance Management Program that drives the professional development of our employees while also providing fair and equitable rewards and recognition. \nThe principles of performance management include:\n•\nalign performance expectations with strategy and goals of the business,\n•\nongoing open dialogue regarding performance and development,\n•\nfoster accountability for behaviors and actions which contribute to a positive culture, and\n•\ncommitment to deliver results which drive our business.\nEmployee Health and Well-Being and Comprehensive Benefits Program\nCboe’s vision is to support the overall wellness of employees and their families through education and activities that encourage a healthy lifestyle, resulting in improved health and productivity. Our programs and benefit plans provide a corporate atmosphere of collective well-being and incorporate strategies for physical, emotional, mental and financial wellness. Our programs include enhanced employee assistance programs, wellness programs and challenges (which address both mental and physical well-being), and webinars and classes through our retirement vendor to support the financial health of our employees. \nEmployee Engagement and Pulse Surveys, Town Halls and an Open-Door Policy\nIn 2024, Cboe conducted our seventh annual employee engagement survey and has implemented career, leadership, and culture focused programs in response to the survey findings. Our participation rate exceeds standard benchmarks and a significant majority of our employees would recommend Cboe as a great place to work.\n Our senior management team continues to hold the commitment to an open-door policy and encourages the free flow of information and communication in furtherance of active transparency. With the recent strategic framework review, our ability to tap into the voice of our employees was critically important and we conducted a pulse survey to gauge sentiment. Our CEO also issues weekly letters to help connect with our employees. Human Resources also provided ongoing regular resources and tips to help support the variety of challenges, from hybrid work to childcare and elder care, that our employees faced throughout 2024. \nCboe also continues to create an open and frank atmosphere in which any grievance, complaint, suggestion or question receives a timely response. Cboe offers a whistleblower hotline for complaints, which can be made anonymously. Additionally, employees can raise questions and suggestions to the Cboe Human Resources team either in-person or via a group email address and are either responded to individually or addressed at our Global Town Hall meetings. The objective of these town halls is to provide employees an update on Company news, share updates from major business lines, as well as provide a forum to ask questions and offer feedback. Employees are encouraged to participate in the free flow of information and communication and to offer positive and constructive feedback in furtherance of active transparency. \nTraining and Succession Planning\nWe believe that the development of all Cboe employees helps drive our collective success. Through skill and competency development we signal our investment in our employees while also enabling enhanced productivity. Through our tuition reimbursement program, our employees receive financial support in their pursuit of specialized university courses and degrees. In addition to our ongoing offering of online courses on diverse topics through our corporate university, CboeU, employees can participate in our \"Strive for Growth\" programs focused on virtual classroom instruction combined with work application and CboeLive, which is focused on business topics to foster organizational-wide knowledge sharing and education.\nLeadership is another critical element of our success at Cboe. Leaders can participate in Lead the Way, Cboe’s leadership development hybrid program focused on virtual classroom instruction combined with in-person facilitated workshops and exercises, and individual development plans leveraging insights for a 360-feedback process. This leadership training program has helped to expand on the development of our high potential leaders, further strengthening the leadership bench and accelerating readiness of this key talent pool.\n25\nTable \no\nf Contents\nCboe has held multiple succession planning discussions with the Compensation Committee and Board of Directors to plan for the fulfillment of essential roles, such as the CEO and other senior officers. This process includes investments in advanced development planning for targeted successors to accelerate their readiness through key internal projects and assignments as well as tailored training. One of our CEO’s top areas of focus is to develop talent and spend time on succession planning, particularly in light of the executive transitions we experienced in 2023.\nEmployees\nAs of December 31, 2024, we employed 1,685 individuals in the following locations:\nLocation\nNumber of Employees\nUnited States\n1,113\nUnited Kingdom\n197\nNetherlands\n137\nAustralia\n86\nCanada\n79\nPhilippines\n29\nJapan\n28\nSingapore\n9\nHong Kong\n6\nSwitzerland\n1\nOf these employees, 605 were involved in technology operations and 195 were involved in direct support of trading operations. The remaining 885 employees provide business development, financial, regulatory, human resources, compliance, legal, planning and research, administrative, and managerial support. \nInformation about our Executive Officers\nSet forth below is information regarding our executive officers:\nName\nAge\nPosition\nFredric J. Tomczyk\n69\nChief Executive Officer\nCatherine R. Clay\n57\nExecutive Vice President, Global Head of Derivatives\nStephanie Foley\n \n \n43\nExecutive Vice President, Chief Human Resources Officer\nJill M. Griebenow\n45\nExecutive Vice President, Chief Financial Officer\nDavid Howson\n48\nExecutive Vice President, Global President\nAdam Inzirillo\n48\nExecutive Vice President, Global Head of Cboe Data Vantage\nChristopher A. Isaacson\n46\nExecutive Vice President, Chief Operating Officer\nPatrick Sexton\n60\nExecutive Vice President, General Counsel and Corporate Secretary\nAllen Wilkinson\n37\nSenior Vice President, Chief Accounting Officer\nFredric J. Tomczyk. \nMr. Tomczyk is our current Chief Executive Officer and director. He has served as our CEO since September 2023. Mr. Tomczyk served on our Board as an independent director from July 2019 to September 2023. He is the retired President and Chief Executive Officer of TD Ameritrade Holding Corporation, a position he held from October 2008 to October 2016. Prior to this position, he held positions of increasing responsibility and leadership with the TD organization from 1999. Mr. Tomczyk was also a member of the TD Ameritrade board of directors from 2006 to 2007 and 2008 to 2016. Prior to joining the TD organization in 1999, Mr. Tomczyk was President and Chief Executive Officer of London Life. He currently serves on the board of Willis Towers Watson PLC, a publicly traded company, and is a member of the Cornell University Athletic Alumni Advisory Council. Mr. Tomczyk also previously served as the lead independent director of Sagen MI Canada Inc., a publicly traded company, and of its operating subsidiary Sagen Mortgage Insurance Company Canada, as a director of Knight Capital Group, Inc. and a trustee of Liberty Property Trust, both formerly publicly traded companies, and as a director of the Securities Industry and Financial Markets Association. Mr. Tomczyk holds a B.S. degree in Applied Economics & Business Management from Cornell University and is a Fellow of the Institute of Chartered Accountants of Ontario.\n26\nTable \no\nf Contents\nCatherine R. Clay\n. Ms. Clay is our Executive Vice President, Global Head of Derivatives, a position she has held since October 2023. Previously, she was Executive Vice President, Global Head of Cboe Data Vantage (f/k/a Data and Access Solutions), from March 2021 to October 2023, Senior Vice President, Global Head of Information Solutions of the Company’s subsidiary Cboe Exchange, Inc. from February 2019 to March 2021, and she has held other various senior leadership positions since 2015, including Vice President Business Development, a position she was appointed to upon the Company’s acquisition of Livevol, Inc. Prior to that, she served as Chief Executive Officer of Livevol, Inc. from 2013 to 2015 and as its Chief Strategy Officer from 2010 to 2013. Prior to that, she served as Founder of Thales LLC from 2006 through 2010. Ms. Clay holds a B.S. degree from the University of Colorado-Boulder.\nStephanie Foley\n. Ms. Foley is our Executive Vice President, Chief Human Resources Officer, a position she has held since October 2023. Previously, she served as Senior Vice President, Chief Human Resources Officer of the Company’s subsidiary Cboe Exchange, Inc. from June 2022 to October 2023. Prior to joining Cboe in 2022, Ms. Foley was Chief Human Resources Officer, Americas, of Kearney Holdings Limited from August 2016 to May 2022. Ms. Foley holds a bachelor’s degree in psychology and sociology from the University at Albany, SUNY, and a master’s degree in industrial organizational psychology from New York University.\nJill M. Griebenow\n. Ms. Griebenow is our Executive Vice President, Chief Financial Officer, a position she has held since July 2023. Previously, she served as Executive Vice President, Chief Accounting Officer from July 2023 to February 2024, Treasurer from July 2023 to October 2023 and as Senior Vice President, Chief Accounting Officer from August 2018 to July 2023. She also previously served as Chief Financial Officer of Cboe Europe from 2014 to 2018 and was employed by Bats in the financial area since 2011. Prior to that, she held various positions at Ernst & Young LLP from 2001 to 2011. Ms. Griebenow is a certified public accountant and holds a bachelor’s degree in accounting from the University of Northern Iowa.\nDavid Howson. \nMr. Howson is our Executive Vice President, Global President, a position he has held since May 2022. Previously, he was our Executive Vice President, President Europe and Asia Pacific, from July 2021 to May 2022, Executive Vice President, President Europe from January 2020 to July 2021 and Chief Operating Officer of Cboe Europe from 2013 to 2019. Prior to that, he served as Founder, Chief Technology Officer of Equiduct from April 2006 through June 2013. Prior to that he held various international financial services consulting roles between 1998 and 2006 for TIBCO Finance Technology and Thomson Reuters. Mr. Howson serves as the Chairman of the Boards of Directors of the Exchanges, and of CFE, Cboe SEF, and Cboe Canada Inc. and previously served as the Chairman of the Boards of Directors of Cboe Japan, Cboe Australia, and Cboe Clear Europe. Mr. Howson holds a First Class Honours bachelor's degree from the University of Newcastle-upon-Tyne. \n \nAdam Inzirillo\n. Mr. Inzirillo is our Executive Vice President, Global Head of Cboe Data Vantage (f/k/a Data and Access Solutions), a position he has held since October 2023. Previously, he served as Senior Vice President, Head of North American Equities since 2020, and Senior Vice President, Head of U.S. Equities since September 2019. Prior to joining Cboe, Mr. Inzirillo was Managing Director, Head of Order Routing and Execution Products at Bank of America Merrill Lynch, where he worked for nearly a decade. Previously, he was Executive Director, Head of Broker Dealer Business Development at UBS Securities LLC from 2005 through 2010. Mr. Inzirillo also serves on the Board of Directors of Cboe Canada Inc. Mr. Inzirillo holds a bachelor’s degree in economics from Bucknell University and a M.B.A. degree from Dowling College. \nChristopher A. Isaacson. \nMr. Isaacson is our Executive Vice President, Chief Operating Officer, a position he has held since January 2019. Previously he was our Executive Vice President, Chief Information Officer, a position he was appointed to upon the Company’s acquisition of Bats. Prior to that, he served as Bats' Executive Vice President and Global Chief Information Officer since February 2014, he served as Bats' Senior Vice President, Chief Operation Officer from 2007 to 2014 and he has held other various senior leadership positions since 2005. Prior to being one of the founders of Bats, Mr. Isaacson was a software developer at Tradebot Systems, Inc. from 2003 to 2005. Mr. Isaacson serves as the Chairman of the Board of Directors of Cboe Digital Exchange and Cboe Clear U.S. and previously served as the Chairman of the Boards of Directors of CFE and Cboe SEF and on the Boards of Directors of Cboe Japan, Cboe Australia, and OCC. Mr. Isaacson holds a bachelor’s degree in information systems with a minor in math from Nebraska Wesleyan University and an M.B.A. degree from the University of Nebraska-Lincoln.\nPatrick Sexton. \nMr. Sexton is our Executive Vice President, General Counsel and Corporate Secretary, a position he has held since March 2018. Previously, he was Deputy General Counsel of the Company’s subsidiary Cboe Exchange, Inc. He served in that capacity from July 2013 to March 2018 and has acted as legal, regulatory and compliance counsel with increasing responsibility and oversight since joining the Company in 1997. Mr. Sexton holds a bachelor’s degree from the University of Notre Dame and a J.D. degree with honors from Notre Dame Law School.\nAllen Wilkinson\n. Mr. Wilkinson is our Senior Vice President, Chief Accounting Officer, a position he has held since February 2024. Previously, he served as Vice President, Controller of the Company, from June 2021 to February 2024 and has been employed in the financial area in various roles since April 2018. Prior to that, he also held various positions at PricewaterhouseCoopers LLP from January 2011 to April 2018. Mr. Wilkinson is a certified public accountant and holds master’s and bachelor's degrees in accounting from the University of Missouri – Columbia.\n27\nTable \no\nf Contents\nAvailable Information\nOur website is www.cboe.com. The Company files annual, quarterly and current reports, proxy statements and other information with the SEC under the Exchange Act. The Company makes available, free of charge, on its website its annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, as soon as reasonably practicable after such reports are electronically filed with, or furnished to, the SEC. The Company's reports filed with, or furnished to, the SEC are also available on the SEC's website at www.sec.gov.\nIn addition, we have posted on our website the charters for our (i) Audit Committee, (ii) Compensation Committee, and (iii) Nominating and Governance Committee, as well as our Code of Business Conduct and Ethics and Corporate Governance Guidelines. We will provide a copy of these documents without charge to stockholders upon written request to Investor Relations, Cboe Global Markets, Inc., 433 West Van Buren Street, Chicago, Illinois 60607. Our website and information included in or linked to our website are not part of this Form 10-K.\n28\nTable \no\nf Contents"
}