{
  "ticker": "CCI",
  "cik": "0001051470",
  "company_name": "CROWN CASTLE INC.",
  "filing_date": "2025-03-14",
  "accession": "0001051470-25-000089",
  "primary_doc": "cci-20241231.htm",
  "item1_text": "Item 1. Business—The Company\"\n and note 14 to our consolidated financial statements for further information regarding our largest tenants. \nThe expansion or development of our business, including through acquisitions, increased product offerings or other strategic opportunities, may cause disruptions in our business, which may have an adverse effect on our business, operations or financial results. \nWe seek to expand and develop our business, including through acquisitions, increased product offerings, or other strategic opportunities. In the ordinary course of our business, we review, analyze and evaluate various potential transactions or other activities in which we may engage. Such transactions or activities could be complex, costly and time-consuming, or cause disruptions in, increase risk to or otherwise negatively impact our business. Among other things, such transactions and activities may: \n•\ndisrupt our business relationships with our tenants and landlords, depending on the nature of or counterparty to such transactions and activities;\n•\ndivert capital and the time or attention of management away from other business operations, including as a result of post-transaction integration activities;\n•\nfail to achieve revenue or margin targets, operational synergies or other benefits contemplated; \n•\nincrease operational risk or volatility in our business; \n•\ntemporarily decrease the volume of our business;\n•\nnot result in the benefits management had expected to realize from such expansion and development activities, or those benefits may take longer to realize than expected;\n•\nimpact our cost structure and result in the need to hire additional employees; \n•\nincrease demands on current employees or result in current or prospective employees experiencing uncertainty about their future roles with us, which might adversely affect our ability to retain or attract key employees; or\n•\nresult in the need for additional TRSs or contributions of certain assets to TRSs, which are subject to federal and state corporate income taxes.\n15\nOur Fiber business model contains certain differences from our Towers business model, resulting in different operational risks. If we do not successfully operate our Fiber business model or identify or manage the related operational risks, such operations may produce results that are lower than anticipated.\nOver the last decade, we have allocated a significant amount of capital to our Fiber business, which is a much less mature business for us than our Towers business. Our Fiber segment represented 33% and 34% of our site rental revenues for the years ended December 31, 2024 and 2023, respectively. The business model for our Fiber operations contains certain differences from our business model for our Towers operations, including those relating to tenant base, competition, contract terms (including requirements for service level agreements regarding network performance and maintenance), upfront capital requirements, labor costs, landlord demographics, deployment and ownership of certain network assets, operational oversight requirements, government regulations, growth rates and applicable laws.\nWhile our Fiber operations have certain risks that are similar to our Towers operations, they also have certain operational risks (including the scalability of processes) that are different from our Towers business, including:\n•\nthe use of public rights-of-way and franchise agreements; \n•\nthe use of poles and conduits owned solely by, or jointly with, third parties; \n•\nrisks relating to overbuilding competitive fiber assets; \n•\nrisks relating to the specific markets in which we choose or plan to operate;\n•\nrisks relating to construction hazards, including boring, trenching, utility and maintenance of traffic hazards;\n•\nconstruction management and construction-related billings to tenants;\n•\nrisks relating to efficiently and rapidly adjusting the size of the personnel needed to operate our Fiber business;\n•\nrisks relating to wireless carriers building their own small cell networks, or tenants utilizing their own or alternative fiber assets;\n•\nthe risk of failing to optimize the use of our finite supply of fiber strands;\n•\ndamage to our assets and the need to maintain, repair, upgrade and periodically replace our assets;\n•\nthe risk of failing to properly maintain or operate highly specialized hardware and software;\n•\nnetwork data security risks; \n•\nthe risk of new technologies that could enable tenants to realize the same benefits with less utilization of our fiber; \n•\npotential damage to our overall reputation as a communications infrastructure provider; and\n•\nthe use of CLEC status.\nIn addition, the rate at which tenants adopt or prioritize small cells and fiber solutions has been lower or slower than we anticipated, and may continue to be lower or slower, or may cease to exist altogether. For example, our tenants have initially focused on utilizing towers in the first phase of deploying their 5G networks, which has led to delays in some of our small cell deployments. We anticipate that these delays will be temporary, as our tenants plan for the next phase of their 5G network deployment which we believe will require small cells at scale. Our Fiber operations also expose us to different safety or liability risks or hazards than our Towers business as a result of numerous factors, including those stemming from the deployment, location or nature of the assets involved. There may be risks and challenges associated with small cells and fiber solutions being comparatively new and emerging technologies that are continuing to evolve, and there may be other risks related to small cells and fiber solutions of which we are not yet aware.  See \"\n—The pendency of the sale of our Fiber Business to Zayo and EQT may have an adverse effect on our business, results of operations, cash flows and financial position.\n\", \"\n—Completion of the Strategic Fiber Transaction is subject to the conditions contained in the Strategic Fiber Agreement, including regulatory approvals, which may not be received, and separation of the Fiber Business from our current operations, and if these conditions are not satisfied or waived, the transaction will not be completed.\n\", \"\n—The failure to complete the planned sale of the Fiber Business to Zayo and EQT could have a material and adverse effect on our business, results of operations, financial condition, cash flows, and stock price.\n\" and \n\"—Our business depends on the demand for our communications infrastructure (including towers, small cells and fiber), driven primarily by demand for data, and we may be adversely affected by any slowdown in such demand. Additionally, a reduction in the amount or change in the mix of network investment by our tenants may materially and adversely affect our business (including reducing demand for our communications infrastructure or services.)\n\", for discussions of the Strategic Fiber Transaction and the potential impact to the growth of our Fiber segment as well as the previously announced small cell node cancellations.\nFailure to timely, efficiently and safely execute on our construction projects could adversely affect our business.\nOur construction projects and related contracts can be long-term, complex in nature, dangerous, costly and challenging to execute. The quality of our performance on such construction projects depends in large part upon our ability to manage (1) the associated tenant relationship and (2) the project itself by timely deploying and properly managing appropriate internal and external project resources. In connection with our construction projects, we generally bear the risk of cost over-runs, labor availability and productivity, and contractor pricing and performance.\n16\nIn addition, the construction projects (including modifications of existing communications infrastructure) can pose certain safety risks, including:\n•\nrisks resulting from elevated work, including falling hazards;\n•\nrisks of third-party non-compliance with safety regulations, industry best practices or other applicable standards;\n•\nrisks associated with utility hazards, including gas line, electrical or sewage strikes, which may result in explosions, electrocution and other potentially catastrophic events; and\n•\nrisk of potential wildfires, including due to welding, grinding, cutting, or other construction activity.\nSuch safety risks may cause personal injury or loss of life, severe damage to or destruction of property, suspension of operations or services, or significant damage to the environment, creating financial, regulatory or reputational damage that could adversely affect our business. See \n\"—Our business may be adversely impacted by climate-related events, natural disasters, including wildfires, and other unforeseen events\"\n below for additional information regarding potential adverse impacts to our business which may result from wildfires and other climate-related events.\nFurther, investments in newly constructed communications infrastructure may result in lower initial returns compared to returns on our existing communications infrastructure or us not being able to realize future tenant additions at anticipated levels. \nAdditionally, contracts with our tenants for these projects typically specify delivery dates, performance criteria and penalties for our failure to perform. Our failure to perform timely and in accordance with the performance criteria exposes us to penalties specified in the contract or possible litigation. We often experience unforeseen delays from municipalities and utility companies that result in longer construction timelines than expected, which impact our ability to timely deliver on our projects. We may also experience unforeseen delays and increased project costs as a result of labor shortages, which may impact the availability of  contractors to work on our construction projects. Our failure to manage such tenant relationships, project resources, and project milestones in a timely and efficient manner and appropriately manage safety risks could have a material adverse effect on our business.\nNew technologies may reduce demand for our communications infrastructure or negatively impact our revenues.\nImprovements in the efficiency, architecture, and design of communication networks may reduce the demand for our communications infrastructure. For example, new technologies and spectrum that may promote network sharing, joint development, backhaul and fronthaul efficiency or resale agreements by our tenants, such as signal combining technologies or network virtualization, may reduce the need for our communications infrastructure. In addition, other technologies, such as WiFi, blimps, satellite (such as low earth orbiting) and mesh transmission systems may, in the future, serve as substitutes for, or alternatives to, leasing on communications infrastructure that might otherwise be anticipated or expected had such technologies not existed. In addition, new technologies that enhance the range, efficiency and capacity of communication equipment could reduce demand for our communications infrastructure. Any significant reduction in demand for our communications infrastructure resulting from the new technologies may negatively impact our revenues or otherwise have a material adverse effect on us.\nIf we fail to retain rights to our communications infrastructure, including the rights to land under our towers and the right-of-way and other agreements related to our small cells and fiber, our business may be adversely affected.\nThe property interests and other rights to our communications infrastructure, including the land under our towers, are derived from leasehold and sub-leasehold interests, fee interests, easements, licenses, rights-of-way, and franchise and other agreements. A loss of these interests and other rights may interfere with our ability to conduct our business or generate revenues. For various reasons, we may not always have the ability to access, analyze, or verify all information regarding titles or other issues prior to acquiring communications infrastructure. Further, we may not be able to renew ground leases or other agreements on commercially viable terms.\nOur ability to retain rights to the land on which our towers are located depends on our ability to purchase such land, by acquiring fee interests and perpetual easements, or renegotiate or extend the terms of the agreements relating to such land. Approximately 10% of our towers site rental gross margin for the year ended December 31, 2024 was derived from towers where the leases for the land under such towers had final expiration dates of less than 10 years. If we are unable to retain rights to the property on which our communications infrastructure is located, our business may be adversely affected.\nAs of December 31, 2024, approximately 54% of our towers were leased or subleased or operated and managed under master leases, subleases, or other agreements with AT&T and T-Mobile (including those which T-Mobile assumed in its merger with Sprint). We have the option to purchase these towers at the end of their respective lease terms. We have no obligation to exercise such purchase options. We may not have the required available capital to exercise our right to purchase some or all of these towers at the time these options are exercisable. Even if we do have available capital, we may choose not to exercise our \n17\nright to purchase these towers or some or all of the T-Mobile or AT&T towers for business or other reasons. In the event that we do not exercise these purchase rights, or are otherwise unable to acquire an interest that would allow us to continue to operate these towers after the applicable period, we will lose the cash flows derived from such towers, which may have a material adverse effect on our business. In the event that we decide to exercise these purchase rights, the benefits of the acquisition of these towers may not exceed the costs, which could adversely affect our business. Additional information concerning these towers and the applicable purchase options as of December 31, 2024 is as follows:\n•\n22% of our towers are leased or subleased or operated and managed under a master lease or other related agreements with AT&T for a weighted-average initial term of approximately 28 years, weighted based on towers site rental gross margin. We have the option to purchase the leased and subleased towers from AT&T at the end of the respective lease or sublease terms for aggregate option payments of approximately $4.2 billion, which payments, if such option is exercised, would be due between 2032 and 2048.\n•\n32% of our towers are leased or subleased or operated and managed under master leases, subleases or other agreements with T-Mobile (including those which T-Mobile assumed in its merger with Sprint). Approximately half of such towers have an initial term of 32 years (through May 2037), and we have the option to purchase in 2037 all (but not less than all) of such leased and subleased towers from T-Mobile for approximately $2.3 billion. The remainder of such towers have a weighted-average initial term of approximately 28 years, weighted based on towers site rental gross margin. We have the option to purchase such towers from T-Mobile at the end of the respective terms for aggregate option payments of approximately $2.0 billion, which payments, if such option is exercised, would be due between 2035 and 2049. In addition, another 1% of our towers under master leases, subleases, and other agreements with T-Mobile are subject to a lease and sublease or other related arrangements with AT&T. We have the option to purchase these towers from AT&T at the end of their respective lease terms for aggregate option payments of up to approximately $385 million, which payments, if such option is exercised, would be due prior to 2032 (less than $12 million would be due before 2029).\nUnder master lease or master prepaid lease arrangements we have with AT&T and T-Mobile (including those which T-Mobile assumed in its merger with Sprint), certain of our subsidiaries lease or sublease, or are otherwise granted the right to operate and manage, towers from bankruptcy remote subsidiaries of such carriers. If one of these bankruptcy remote subsidiaries should become a debtor in a bankruptcy proceeding and is permitted to reject the underlying ground lease, our subsidiaries could lose their interest in the applicable sites. If our subsidiaries were to lose their interest in the applicable sites or if the applicable ground leases were to be terminated, we would lose the cash flow derived from the towers on those sites, which may have a material adverse effect on our business. We have similar bankruptcy risks with respect to sites that we operate under management agreements.\nFor our small cells and fiber, we must maintain rights-of-way, franchise, pole attachment, conduit use, fiber use and other agreements to operate our assets. For various reasons, we may not always have the ability to maintain these agreements or obtain future agreements to construct, maintain and operate our fiber assets. Access to rights-of-way may depend on our CLEC status, and we cannot be certain that jurisdictions will (1) recognize such CLEC status or (2) not change their laws concerning CLEC access to rights-of-way. If a material portion of these agreements are terminated or are not renewed, we might be forced to abandon our assets, which may adversely impact our business. In order to operate our assets, we must also maintain fiber agreements that we have with public and private entities. There is no assurance that we will be able to renew these agreements on favorable terms, or at all. If we are unable to renew these agreements on favorable terms, we may face increased costs or reduced revenues.\nAdditionally, in order to expand our communications infrastructure footprint to new locations, we often need to obtain new or additional rights-of-way and other agreements. Our failure to obtain these agreements in a prompt and cost-effective manner may prevent us from expanding our footprint, which may be necessary to meet our contractual obligations to our tenants and could adversely impact our business.\nOur services business has historically experienced significant volatility in demand, which reduces the predictability of our results.\nThe operating results of our services business for any particular period may experience significant fluctuations given its non-recurring nature and should not necessarily be considered indicative of longer-term results for this activity. Our services business is generally driven by demand for our communications infrastructure and may be adversely impacted by various factors, including:\n•\ncompetition;\n•\nthe timing, mix and amount of tenant network investments;\n•\nthe rate and volume of tenant deployment plans;\n18\n•\nunforeseen delays or challenges relating to work performed;\n•\neconomic weakness or uncertainty;\n•\nlabor availability and productivity;\n•\navailability of key components;\n•\nour market share; and\n•\nchanges in the size, scope, or volume of work performed.\nDuring both 2023 and 2024, due primarily to our discontinuation of installation services as a Towers product offering previously announced in July 2023, services and other revenues decreased by 36% and 53%, respectively, when compared to years ended December 31, 2022 and 2023, respectively.  We  continue to offer site development services on our towers. See note 16 to our consolidated financial statements and \n\"Item 7. MD&A—General Overview—Highlights of Business Fundamentals and Results\" \nfor further discussion of our 2023 Restructuring Plan, which included discontinuing installation services as a Towers product offering.\nAs a result of competition in our industry, we may find it more difficult to negotiate favorable rates on our new or renewing tenant contracts.\nOur growth is dependent on our entering into new tenant contracts (including amendments to tenant contracts upon modification of existing towers, small cells or fiber), as well as renewing or renegotiating tenant contracts when existing tenant contracts terminate. Competition in our industry may make it more difficult for us to attract new tenants, maintain or increase our gross margins, or maintain or increase our market share. In addition, competition (primarily in our fiber solutions business) may, in certain circumstances, cause us to renegotiate certain existing tenant contracts to avoid early contract terminations. We face competition for site rental tenants and associated contractual rates from various sources, including (1) other independent communications infrastructure owners or operators, including those that own, operate, or manage towers, rooftops, broadcast or transmission towers, utility poles, fiber (including non-traditional competitors such as cable providers) or small cells, (2)  tenants who elect to self-perform  and (3) new alternative deployment methods for communications infrastructure.\nOur Fiber business generally has different competitors than those in our Towers business, including other owners of fiber, as well as new entrants into small cells and fiber solutions, some of which may have larger networks, greater financial resources or more experience in managing such assets than we have. The level of non-renewals associated with fiber solutions is generally higher than that of Towers and small cells.\nNew wireless technologies may not deploy or be adopted by tenants as rapidly or in the manner projected.\nThere can be no assurances that new wireless services or technologies, which may drive demand for our communications infrastructure, will be introduced or deployed as rapidly or in the manner projected by the wireless carriers. In addition, demand or tenant adoption rates for such new technologies may be lower or slower than anticipated for numerous reasons. As a result, growth opportunities or demand for our communications infrastructure arising from such technologies may not be realized at the times or to the extent anticipated.\nIf radio frequency emissions from wireless handsets or equipment on our communications infrastructure are demonstrated to cause negative health effects, potential future claims could adversely affect our operations, costs or revenues.\nThe potential connection between radio frequency emissions and certain negative health effects, including some forms of cancer, has been the subject of substantial study by the scientific community in recent years. We cannot guarantee that claims relating to radio frequency emissions will not arise in the future or that the results of such studies will not be adverse to us.\nPublic perception of possible health risks associated with cellular or other wireless connectivity services and wireless technologies (such as 5G) may slow or diminish the growth of wireless companies and deployment of new wireless technologies, which may in turn slow or diminish our growth. In particular, negative public perception of, and regulations regarding, these perceived health risks may slow or diminish the market acceptance of wireless services and technologies. If a connection between radio frequency emissions and possible negative health effects were established, our operations, costs, or revenues may be materially and adversely affected. We currently do not maintain any significant insurance with respect to these matters.\nCybersecurity breaches or other information technology disruptions could adversely affect our operations, business, and reputation.\nDespite existing security measures, certain of our information technology and communications infrastructure may be subject to damage, disruptions, or shutdowns due to unauthorized access, computer viruses, ransomware or other malicious software, cyber-attacks and other security breaches. In addition, our reliance on cloud- or internet-based services and on remote \n19\naccess to information systems increases our exposure to potential cybersecurity incidents. An attack attempt or security breach, such as a distributed denial of service attack, could potentially result in (1) interruption or cessation of certain of our services to our tenants or access by our tenants to certain of our information technology systems, (2) our inability to meet expected levels of service to our tenants, (3) data transmitted over our tenants' networks being compromised or misappropriated, or (4) business or other sensitive data being compromised, misappropriated or lost. Although we believe we have a comprehensive incident response plan and other cybersecurity measures and policies in place, we cannot guarantee that our security measures will not be circumvented, resulting in tenant network failures or interruptions that could impact our tenants' network availability and have a material adverse effect on our business, financial condition, or operational results. \nAdditionally, security incidents impacting our tenants, vendors and business partners could result in a material adverse effect on our business. We may be required to expend significant resources to protect against or recover from such threats. If an actual or perceived breach of our cybersecurity or information technology, or that of our cloud- or internet-based service providers, occurs, the market perception of the effectiveness of our security measures could be harmed, and we could lose tenants. Further, the perpetrators of cyber-attacks are not restricted to particular groups or persons. These threats can arise from external parties, such as cyber terrorists or nation-state actors, as well as insiders, such as our employees or contractors, who knowingly or unknowingly engage in or enable malicious cyber activities. In addition, our acquisitions, both past and future, may alter our potential exposure to the risks described above. While we maintain insurance that includes coverage in the event of cybersecurity or other information technology breaches, there can be no assurances that such coverage will be adequate to cover exposure from such incidents.\nOur business may be adversely impacted by climate-related events, natural disasters, including wildfires, and other unforeseen events.\nWe could be negatively impacted by other unforeseen events, such as extreme weather events or natural disasters (including as a result of any potential effects of climate change), or acts of vandalism. There is increasing concern that global climate change is occurring and could result in increased frequency of certain types of natural disasters and extreme weather events. Although we have implemented a wildfire risk mitigation program, the effects of climate change have increased the risk and extent of wildfires that could potentially result from certain of our construction and maintenance projects and other operating activities. We cannot predict with certainty the rate at which climate change is occurring or the potential direct or indirect impacts of climate change to our business. Any such unforeseen events could, among other things, damage or delay deployment of our communications infrastructure, interrupt or delay service to our tenants or could result in legal claims or penalties, disruption in operations, damage to our reputation, negative market perception, or costly response measures, which could adversely affect our business.\nWhile we currently maintain insurance policies that include coverage in the event of natural disasters and other unforeseen events, including possible incidents in which our actions (or the actions of those acting on our behalf) contribute to such events, there can be no assurances that such coverage will be adequate to cover exposure from such events. Further, we do not maintain, and do not expect to maintain, insurance policies that provide adequate coverage in the event that our actions (or those actions of those acting on our behalf) contribute to a wildfire event, as a result of the fact that such insurance policies are generally not economically available.\nOur focus on and disclosure of our ESG position, metrics, strategy, goals and initiatives expose us to potential litigation or regulatory action and other adverse effects to our business.\nIn recent years, certain of our investors, tenants, employees and other stakeholders have increased their focus on ESG matters and disclosure. In response, we have published ESG reports and related materials and made other public announcements regarding our ESG position, initiatives and goals. Our ESG metrics, initiatives and goals, and progress against those goals, may be based on standards that are still developing and that may not be uniformly adopted or applied by other companies, processes and internal controls that continue to evolve, potentially missing or deficient third-party data, wide range of acceptable estimation techniques, and estimates and assumptions that are subject to a greater degree of uncertainty and may change more frequently than those underlying our financial metrics. Our ESG initiatives and goals may be difficult to implement, may lead to increased scrutiny by policymakers and stakeholders, may be contrary to interests of other stakeholders and may increase operating costs and result in changes to certain of our operations, assets and processes. \nIn addition, we are subject to, and may become subject to additional, climate change-based and other ESG-related laws, regulations and policies, with varying scopes and complexity, such as the SEC's climate-related disclosure rules and the State of California's carbon and climate disclosure laws, that have increased, and could further increase, compliance burdens and associated costs. Applicable laws, regulations and policies in some jurisdictions may conflict with those in other jurisdictions. In addition, regulators may interpret and apply laws, regulations and policies in a manner inconsistent with previous interpretation and application.  Failure to comply with any legislation, regulation or policy, including as a result of good faith \n20\ninterpretations that may differ from those taken by the relevant enforcement authorities, could potentially result in substantial fines, criminal sanctions, reputational harm or operational changes.\nOur focus and disclosure of our ESG goals and initiatives – including achievement of or failure to achieve such goals and initiatives, accurately reporting our metrics or adherence to prior public statements – exposes us to potential litigation or regulatory action, which may materially adversely affect our business, results of operations, financial condition and stock price.\nFailure to attract, recruit and retain qualified and experienced employees could adversely affect our business, operations and costs. \nOur ability to sustain and grow our business and execute on our strategy requires us, in part, to attract, recruit and retain qualified and experienced employees, including key management personnel and other talent. We have encountered a competitive labor market for experienced talent in our industry due, in part, to macroeconomic conditions. Our stock price performance has caused, and may continue to cause, a failure to achieve certain metrics on which vesting of our performance-based equity awards is based. If our total compensation package is not viewed as competitive, our ability to successfully attract, recruit and retain key employees could adversely impact our business, operations, and costs, which could result in the loss of institutional knowledge and expertise of departing employees.\nWe have recently experienced, and may continue to experience, the departure of key management personnel, as well as the elimination and consolidation of roles and responsibilities. See \"\n—Changes to management, including turnover of our top executives, could have an adverse effect on our business.\",\n \n\"—Actions that we are taking, or have completed, to restructure our business in alignment with our strategic priorities may not be as effective as anticipated.\" \nand\n \n\"\n— The pendency of the sale of our Fiber Business to Zayo and EQT may have an adverse effect on our business, results of operations, cash flows and financial position.\n\" for a discussion of the Strategic Fiber Transaction, recent management changes and the reductions in our workforce in 2023 and 2024, and the potential adverse impact on our workforce therefrom. \nChanges to management, including turnover of our top executives, could have an adverse effect on our business.\nOur business has experienced, and may continue to experience, significant executive management changes, including the consolidation of roles and responsibilities. In December 2023, we announced the retirement of Jay A. Brown, our President and Chief Executive Officer (\"CEO\") and the appointment of Anthony J. Melone, a member of our board of directors, to serve as interim President and CEO. In April 2024, Steven J. Moskowitz was appointed as President and CEO. Additionally, in January 2025, we announced that Daniel K. Schlanger would cease serving as our Executive Vice President and Chief Financial Officer, effective March 2025. We also have experienced and may continue to experience the departure and transition of other members of our executive management team.\nThese leadership changes may be inherently difficult to manage and may hamper our ability to meet our financial and operational goals as new management becomes familiar with their roles and the business. Such changes may also result in added costs, uncertainty concerning our future direction, decreased employee morale, and the loss of personnel with deep institutional knowledge and industry relationships. Any of the foregoing could result in significant disruptions to our operations and impact our ability to execute on our strategy and pursue strategic initiatives. \nFurther, we have increased our dependency on the remaining members of our executive management team to facilitate a smooth transition in leadership roles. Our executive officers are at-will employees; as such, their employment with us could terminate at any time, and any such departure could be particularly disruptive in light of the recent leadership changes. If we are unable to mitigate these or other similar risks, our business, results of operations and financial condition may be adversely affected.\nActions that we are taking, or have completed, to restructure our business in alignment with our strategic priorities may not be as effective as anticipated.\nIn July 2023, we initiated the 2023 Restructuring Plan as part of our efforts to reduce costs to better align our operational needs with lower tower activity. The 2023 Restructuring Plan included reducing our total employee headcount by approximately 15%, discontinuing installation services as a Towers product offering, and consolidating office space. As a result of the foregoing actions, we incurred $85 million and $9 million of restructuring charges in 2023 and 2024, respectively.  The actions associated with the 2023 Restructuring Plan were substantially completed and related charges were recorded by June 30, 2024, while the payments for the employee headcount reduction were substantially completed by December 31, 2024. The remaining payments for the office space consolidation will be completed in 2032.\nIn June 2024, we initiated the 2024 Restructuring Plan as part of our efforts to drive operational efficiencies and reduce operating costs and capital expenditures, with a primary focus on our Fiber segment. As a result, we announced a reduction of \n21\nour total employee headcount by more than 10% and the closing of certain offices. Related to the actions undertaken for the 2024 Restructuring Plan, we incurred $100 million of restructuring charges in 2024. The actions associated with the 2024 Restructuring Plan and related charges were substantially completed and recorded by December 31, 2024, while the payments are expected to be completed for the employee headcount reduction in 2025 and office closures in 2033.\nIn addition, we may incur other charges or cash expenditures not currently contemplated due to unanticipated events that may occur, including in connection with the execution of these actions. We have made certain assumptions in estimating the anticipated savings we expect to achieve under the Restructuring Plans, which include the estimated savings from the elimination of certain headcount and the consolidation and closure of office space. These assumptions may turn out to be incorrect due to a variety of factors. In addition, our ability to realize the expected benefits from the Restructuring Plans is subject to significant business, economic and competitive uncertainties and contingencies, many of which are beyond our control. As such, we may not realize, in full or in part, or sustain, the anticipated benefits from the Restructuring Plans or do so within the expected time frame, and anticipated benefits may not be adequate to meet our long-term profitability and operational expectations.\nFurthermore, the Restructuring Plans may result in unintended consequences, including:\n•\nemployee attrition beyond the intended reduction in force; \n•\ndamage to our corporate culture and decreased employee morale and productivity among our remaining employees;\n•\ndiversion of management attention;\n•\nadverse effects to our reputation as an employer (which could make it more difficult for us to hire new employees in the future);\n•\nloss of institutional knowledge and expertise of departing employees; \n•\ninability to timely and efficiently scale our workforce in response to shifting demand in our business; and \n•\npotential failure or delays to meet operational and growth targets due to the loss of qualified employees.\nIf we experience any of these adverse consequences, the Restructuring Plans and other strategic initiatives may not achieve or sustain their intended benefits, or the benefits, even if achieved, may not be adequate to meet our long-term profitability and operational expectations, which could adversely affect our business, results of operations and financial condition.\nActions of activist stockholders could impact the pursuit of our business strategies and adversely affect our results of operations, financial condition, or stock price.\nWe have been, and may in the future be, subject to activities initiated by activist stockholders. In December 2023, we entered into a Cooperation Agreement (\"Cooperation Agreement\") with Elliott Investment Management L.P., Elliott Associates, L.P. and Elliott International, L.P. (collectively, \"Elliott\"). Pursuant to the Cooperation Agreement, we agreed, among other things, (1) to promptly appoint Jason Genrich and Sunit Patel as members of the board of directors, with an initial term that expired at our 2024 Annual Meeting of Stockholders (\"2024 Annual Meeting\"), (2) to establish a Fiber Review Committee to conduct a strategic and operational review of our Fiber business and (3) to establish a CEO Search Committee to conduct a search for the next CEO of our company.  \nOn March 3, 2024, we entered into an amendment to the Cooperation Agreement with Elliott, which, among other things, (1) eliminated limitations on the size of our board of directors, the Fiber Review Committee and the CEO Search Committee, (2) provided that Elliott and certain of its affiliates would vote \npro rata\n in accordance with the vote of other stockholders at the 2024 Annual Meeting, subject to certain exceptions, and (3) provided our board of directors could change its recommendation and cease soliciting proxies in favor of Messrs. Genrich or Patel if it first made a determination that its fiduciary duties required it to do so.  Messrs. Genrich and Patel were subsequently reelected to serve until our 2025 Annual Meeting of Stockholders. The operational review of our Fiber business and the search for the next CEO of our company concluded during 2024, and the strategic review of our Fiber business concluded in 2025 with our entry into the Strategic Fiber Agreement. See \"\n—The pendency of the sale of our Fiber Business to Zayo and EQT may have an adverse effect on our business, results of operations, cash flows and financial position.\n\", \"\n—Completion of the Strategic Fiber Transaction is subject to the conditions contained in the Strategic Fiber Agreement, including regulatory approvals, which may not be received, and separation of the Fiber Business from our current operations, and if these conditions are not satisfied or waived, the transaction will not be completed.\n\" and \"\n—The failure to complete the planned sale of the Fiber Business to Zayo and EQT could have a material and adverse effect on our business, results of operations, financial condition, cash flows, and stock price.\n\" for a discussion of the Strategic Fiber Transaction. The Cooperation Agreement, as amended, remains in effect.\nWe strive to maintain constructive, ongoing communications with all stockholders, and we welcome constructive input from all stockholders toward the shared goal of enhancing long-term stockholder value. Nonetheless, we may not be successful in engaging constructively with one or more stockholders, and any resulting activist campaign that contests, or seeks to change, \n22\nour strategic direction or business mix (for example, our proxy contest in 2024 with Boots Capital) could have an adverse effect on us because: (1) responding to actions by activist stockholders could disrupt our business and operations, be costly or time-consuming, or divert the attention of our board of directors or management from the pursuit of business strategies, which could adversely affect our results of operations or financial condition; (2) perceived uncertainties as to our future direction may lead to the perception of a change in the direction of the business, instability, or lack of continuity, any of which may be exploited by our competitors, cause concern to our current or potential customers and vendors, cause concern in the minds of our employees and make it more difficult to attract and retain qualified personnel; and (3) these types of actions could cause significant fluctuations in our share price based on temporary or speculative market perceptions or other factors that do not necessarily reflect the underlying fundamentals and prospects of our business.  \nRisks Relating to Our Pending Sale of the Fiber Business\nThe pendency of the sale of our Fiber Business to Zayo and EQT may have an adverse effect on our business, results of operations, cash flows and financial position.\nOn March 13, 2025, we signed the Strategic Fiber Agreement to sell all of our Fiber Business, with Zayo acquiring the fiber solutions business and EQT acquiring the small cell business. The pending sale of the Fiber Business may have an adverse effect on our operating results if our customers delay, defer, or cancel work with us pending completion of the Strategic Fiber Transaction. \nWe are subject to additional risks in connection with the pendency of the proposed Strategic Fiber Transaction, including:\n•\nParties with which we do business may be uncertain as to the effects the transaction may have on them, including with respect to current or future business relationships with us, and these relationships may be subject to disruption as customers, suppliers and other persons with whom we have a business relationship may delay or defer certain business decisions or might decide to terminate, change or renegotiate their relationships with us, as applicable, or consider entering into business relationships with parties other than us. The risk, and adverse effect, of any disruption could be exacerbated by a delay in the consummation of the transaction or termination of the Strategic Fiber Agreement;\n•\nThe restrictions and requirements imposed on our business and operations pursuant to certain covenants set forth in the Strategic Fiber Agreement and ancillary transaction agreements obligate us to generally conduct our business in a commercially reasonable manner and in all material respects in the ordinary course of business consistent with past practice and may prevent us from pursuing certain opportunities, entering into certain contracts with customers and suppliers, or taking certain other actions without Zayo’s and/or EQT's approval;\n•\nWe may be unable to attract, recruit, retain and motivate current and prospective employees who may be uncertain about their future roles following completion of the proposed transaction, and our operations could suffer due to employee attrition or a reduction in employee productivity as a result of this uncertainty; and\n•\nThe pursuit and planning for the transaction have placed and will continue to place a significant burden on management and other internal resources and may divert management’s attention away from day-to-day business concerns and other opportunities that may have been beneficial to us could adversely affect our business, financial condition and operating results.\nSee \"\n—The failure to complete the planned sale of the Fiber Business to Zayo and EQT could have a material and adverse effect on our business, results of operations, financial condition, cash flows, and stock price.\n\" below for a discussion of risks associated with the potential failure to complete the planned sale of the Fiber Business.\nCompletion of the Strategic Fiber Transaction is subject to the conditions contained in the Strategic Fiber Agreement, including regulatory approvals, which may not be received, and separation of the Fiber Business from our current operations, and if these conditions are not satisfied or waived, the transaction will not be completed.\nThe Strategic Fiber Agreement contains closing conditions and requirements with which we must comply pending the closing of the Strategic Fiber Transaction, including (1) obtaining regulatory approvals from certain U.S. regulatory and governmental authorities, including various consents, clearances under antitrust statutes, authorizations and declarations of non-objection, or expiration of waiting periods (or extensions thereof), and (2) separating each of the fiber solutions and small cell businesses from our current operations, in accordance with the terms of the Strategic Fiber Agreement.\nIn deciding whether to grant the required regulatory approval, consent or clearance, the relevant governmental entities will consider the effect of the transaction on competition within their relevant jurisdiction. Regulatory and governmental entities may impose conditions on their respective approvals, in which case lengthy negotiations may ensue among such regulatory or \n23\ngovernmental entities, Zayo, EQT and us. Such conditions, any such negotiations and the process of obtaining regulatory approvals could have the effect of delaying or preventing consummation of the transaction.\nThe separation and conveyance of each of the fiber solutions and small cells businesses from our current operations to the respective purchaser in connection with the Strategic Fiber Transaction poses significant challenges, including division and allocation of assets, information technology, contracts and employees relating to each of the applicable businesses. \nIf any of these conditions, certain of which may not be within our control, are not satisfied or waived, the Strategic Fiber Agreement may be terminated, or the Strategic Fiber Transaction may not close.\nThe failure to complete the planned sale of the Fiber Business to Zayo and EQT could have a material and adverse effect on our business, results of operations, financial condition, cash flows, and stock price.\nThe Strategic Fiber Transaction, which is expected to close in the first half of 2026, is subject to the satisfaction or waiver of certain closing conditions, and there is no assurance that all of the various conditions will be satisfied, or that the transaction will be completed on the proposed terms, within the expected timeframe or at all. The closing of the transaction may be delayed, and the transaction may ultimately not be completed, due to a number of factors, including as a result of the failure to satisfy any requisite closing condition in the Strategic Fiber Agreement, potential future stockholder litigation and other legal and regulatory proceedings.\nIf the Strategic Fiber Transaction does not close, we may suffer consequences that could adversely affect our ongoing and future business, financial condition, operating results, cash flows and stock price, and our stockholders would be exposed to additional risks, including for example:\n•\nTo the extent that the current market price of our stock reflects an assumption that the transaction will be completed, the price of our common stock could decrease;\n•\nInvestor confidence in us could decline and stockholder litigation could be brought against us;\n•\nWe have incurred significant costs, including professional services fees and other transaction costs, in connection with the proposed transaction that we would be unable to recover, and devoted substantial commitments of time and resources by our management and employees, which could have otherwise been devoted to day-to-day operations and other opportunities that could have been beneficial to us as an independent company; and\n•\nThere can be no assurance that our business, relationships with other parties, liquidity or financial condition will not be adversely affected, as compared to the condition prior to the announcement of the transaction, if the transaction is delayed or not consummated.\nRisks Relating to Our Debt and Equity\nOur substantial level of indebtedness could adversely affect our ability to react to changes in our business, and the terms of our debt instruments limit our ability to take a number of actions that our management might otherwise believe to be in our best interests. In addition, if we fail to comply with our covenants, our debt could be accelerated.\nWe have a substantial amount of indebtedness (approximately $23.8 billion as of March 12, 2025). See \n\"Item 7. MD&A—Liquidity and Capital Resources\"\n for a tabular presentation of our contractual debt maturities. As a result of our substantial indebtedness:\n•\nwe may be more vulnerable to general adverse economic or industry conditions;\n•\nwe may find it more difficult to obtain additional financing to fund discretionary investments or other general corporate requirements or to refinance our existing indebtedness;\n•\nwe are or will be required to dedicate a substantial portion of our cash flows from operations to the payment of principal or interest on our debt, thereby reducing the available cash flows to fund other projects, including the discretionary investments discussed in\n \"Item 1. Business\" \nand \n\"Item 7. MD&A—Liquidity and Capital Resources\"\n;\n•\nwe may have limited flexibility in planning for, or reacting to, changes in our business or in the industry;\n•\nwe may have a competitive disadvantage relative to other companies in our industry with less debt;\n•\nwe may be adversely impacted by changes in interest rates (see below);\n•\nwe may be adversely impacted by changes to credit ratings related to our debt instruments;\n•\nwe may be required to issue equity securities or securities convertible into equity securities or sell some of our assets, possibly on unfavorable terms, in order to meet our debt payment obligations;\n•\nwe may be limited in our ability to take advantage of strategic business opportunities, including communications infrastructure development or mergers and acquisitions; and\n•\nwe could fail to remain qualified for taxation as a REIT due to limitations on our ability to declare and pay dividends to stockholders as a result of restrictive covenants in our debt instruments.\n24\nFrom March 2022 until recently, the Federal Reserve repeatedly raised the federal funds rate, which adversely impacted the interest rates on our variable rate debt and refinancings of fixed rate debt.  As of March 12, 2025, approximately 9% of our outstanding indebtedness consisted of variable interest rates.  Such variable interest debt had a weighted average rate of 5.2% as of March 12, 2025, compared to 6.5%, 5.4% and 1.1% as of December 31, 2023, 2022 and 2021, respectively. Recently, the Federal Reserve has started to loosen its monetary policy by lowering the federal funds rate; however, any prolonged period of elevated interest rates or further increases to interest rates on such debt could continue to adversely impact our financial results and our ability to meet our dividend growth targets, strategically deploy our capital or execute our business plan. See \"\nItem 7A. Quantitative and Qualitative Disclosures about Market Risk\"\n for a further discussion of our interest rate risk.\nCurrently, we have debt instruments in place that limit, in certain circumstances, our ability to incur additional indebtedness, pay dividends, create liens, sell assets, or engage in certain mergers and acquisitions, among other things. In addition, the credit agreement governing our senior unsecured credit facility (\"2016 Credit Agreement\"), which consists of our senior unsecured term loan A facility and senior unsecured revolving credit facility (collectively, \"2016 Credit Facility\"), contains financial maintenance covenants. Our ability to comply with these covenants or to satisfy our debt obligations will depend on our future operating performance. If we violate the restrictions in our debt instruments or fail to comply with our financial maintenance covenants, we will be in default under those instruments, which in some cases would cause the maturity of a substantial portion of our long-term indebtedness to be accelerated. Furthermore, if the limits on our ability to pay dividends prevent us from satisfying our REIT distribution requirements, we could fail to remain qualified for taxation as a REIT. If these limits do not jeopardize our qualification for taxation as a REIT but nevertheless prevent us from distributing 100% of our REIT taxable income, we will be subject to federal and state corporate income taxes, and potentially a nondeductible excise tax, on our undistributed taxable income. If our operating subsidiaries were to default on their debt, the trustee could seek to foreclose the collateral securing such debt, in which case we could lose the communications infrastructure and the associated revenues. See \n\"Item 7. MD&A—Liquidity and Capital Resources—Debt Covenants\"\n for a further discussion of our debt covenants.\nCCI is a holding company that conducts all of its operations through its subsidiaries. Accordingly, CCI's sources of cash to pay interest or principal on its outstanding indebtedness are distributions relating to its respective ownership interests in its subsidiaries from the net earnings and cash flows generated by such subsidiaries or from proceeds of debt or equity offerings. Earnings and cash flows generated by CCI's subsidiaries are first applied by such subsidiaries to conduct their operations, including servicing their respective debt obligations, after which any excess cash flows generally may be paid to CCI, in the absence of any special conditions, such as a continuing event of default. However, CCI's subsidiaries are legally distinct from the holding company and, unless they guarantee such debt, have no obligation to pay amounts due on their debt or to make funds available to us for such payment.\nWe have a substantial amount of indebtedness. In the event we do not repay or refinance such indebtedness, we could face substantial liquidity issues and might be required to issue equity securities or securities convertible into equity securities, or sell some of our assets, possibly on unfavorable terms, to meet our debt payment obligations.\nWe have a substantial amount of indebtedness, which, upon final maturity, we will need to refinance or repay. See \n\"Item 7. MD&A—Liquidity and Capital Resources\"\n for a tabular presentation of our contractual debt maturities. There can be no assurances we will be able to refinance our indebtedness (1) on commercially reasonable terms, (2) on terms, including with respect to interest rates, as favorable as our current debt, or (3) at all. As of March 12, 2025, approximately 55% of our fixed rate debt, with a weighted average interest rate of 3.8%, is scheduled to mature over the next five years. If interest rates remain elevated or continue to increase, we may have to (1) refinance our maturing fixed rate debt at interest rates that exceed the current interest rates on such debt or (2) use our variable interest rate debt to repay such fixed rate debt, thereby increasing our exposure to interest rate fluctuations.\nEconomic conditions and the credit markets have historically experienced, and may continue to experience, periods of volatility, uncertainty, or weakness that could impact (1) the availability or cost of debt financing, including any refinancing of the obligations described above, (2) our ability to draw the full amount of our $7.0 billion senior unsecured revolving credit facility under our 2016 Credit Facility (\"2016 Revolver\"), that, as of March 12, 2025, had $7.0 billion of undrawn availability, or (3) our ability to issue the full amount of the $2.0 billion commercial paper notes (\"Commercial Paper Notes\") under our unsecured commercial paper program (\"CP Program\"), that, as of March 12, 2025, had $1.1 billion outstanding.\nIf we are unable to repay or refinance our debt, we cannot guarantee that we will be able to generate enough cash flows from operations or that we will be able to obtain enough capital to service our debt, fund our planned capital expenditures or pay future dividends. In such an event, we could face substantial liquidity issues and might be required to issue equity securities or securities convertible into equity securities, or sell some of our assets, possibly on unfavorable terms, to meet our debt payment obligations. Failure to repay or refinance indebtedness when required could result in a default under such indebtedness. If we incur additional indebtedness, any such indebtedness could exacerbate the risks described above.\n25\nSales or issuances of a substantial number of shares of our common stock or securities convertible into shares of our common stock may adversely affect the market price of our common stock.\nFuture sales or issuances of common stock or other equity related securities may adversely affect the market price of our common stock, including any shares of our common stock issued to finance capital expenditures, finance strategic initiatives or repay debt. Our business strategy contemplates access to external financing to fund certain discretionary investments, which may include issuances of common stock or other equity related securities. We maintain an \"at-the-market\" stock offering program (\"2024 ATM Program\") through which we may, from time to time, issue and sell shares of our common stock having an aggregate gross sales price of up to $750 million to or through sales agents. As of March 12, 2025, we had $750 million of gross sales of common stock remaining under our 2024 ATM Program. From time to time, we may refresh or implement a new \"at-the-market\" stock offering program. See note 10 to our consolidated financial statements. As of March 12, 2025, we had approximately 435 million shares of common stock outstanding.\nWe have reserved an aggregate of approximately 15 million shares of common stock for issuance in connection with awards granted under our stock compensation plans.\nFurther, a small number of common stockholders own a significant percentage of our outstanding common stock. If any one of these common stockholders, or any group of our common stockholders, sells a large quantity of shares of our common stock, or the public market perceives that existing common stockholders might sell a large quantity of shares of our common stock, the market price of our common stock may significantly decline.\nCertain provisions of our Charter and  By-laws and operative agreements, and domestic and international competition laws may make it more difficult for a third party to acquire control of us or for us to acquire control of a third party, even if such a change in control would be beneficial to our stockholders.\nWe have a number of anti-takeover devices in place that will hinder takeover attempts or may reduce the market value of our common stock. Our anti-takeover provisions include:\n•\nthe authority of the board of directors to issue preferred stock without approval of the holders of our common stock; \n•\nadvance notice and other procedural requirements relating to director nominations or proposals submitted by stockholders for actions to be taken at annual meetings of stockholders; and\n•\nprovisions that the state courts or, in certain circumstances, the federal courts, in Delaware shall be the sole and exclusive forum for certain actions involving us, our directors, officers, employees and stockholders, and, unless the Company otherwise consents, that the federal courts shall be the sole and exclusive forum for resolution of claims arising under the Securities Act of 1933, as amended (“Securities Act”). Since the Securities Act provides that federal and state courts have concurrent jurisdiction over lawsuits brought pursuant to the Securities Act, there may be uncertainty as to whether a court would enforce such a provision. Stockholders will not be deemed to have waived compliance with the federal securities laws, and this provision does not apply to claims for which the federal courts have exclusive jurisdiction (such as under the Exchange Act).\nSuch provisions, as well as the provisions of Section 203 of the Delaware General Corporation Law, may impede a merger, consolidation, takeover, or other business combination or discourage a potential acquirer from making a tender offer or otherwise attempting to obtain control of us.\nIn addition, domestic or international competition laws may prevent or discourage us from acquiring communications infrastructure in certain geographical areas or impede a merger, consolidation, takeover, or other business combination or discourage a potential acquirer from making a tender offer or otherwise attempting to obtain control of us.\nRisks Relating to Corporate Compliance\nIf we fail to comply with laws or regulations which regulate our business and which may change at any time, we may be fined or even lose our right to conduct some of our business.\nA variety of federal, state, local, and foreign laws and regulations apply to our business, including those discussed in \n\"Item 1. Business.\"\n Failure to comply with applicable requirements may lead to civil or criminal penalties, require us to assume indemnification obligations or breach contractual provisions. We cannot guarantee that existing or future laws or regulations, including federal, state, local, or foreign tax laws, will not adversely affect our business (including our REIT status), increase delays or result in additional costs. We also may incur additional costs as a result of liabilities under applicable laws and regulations, such as those governing environmental and safety matters. These factors may have a material adverse effect on us.\n26\nRisks Relating to Our REIT Status\nFuture dividend payments to our stockholders will reduce the availability of our cash on hand available to fund future discretionary investments, and may result in a need to incur indebtedness or issue equity securities to fund growth opportunities. In such event, the then current economic, credit market or equity market conditions will impact the availability or cost of such financing, which may hinder our ability to grow our per share results of operations.\nDuring each of the quarters in the year ended 2024, we paid a common stock dividend of $1.565 per share, totaling approximately $2.7 billion.  We are updating our capital allocation framework to focus more on free cash flow generation and financial flexibility, which we currently expect to result in a reduction to our dividend, beginning with our expected second quarter 2025 dividend. As we grow cash flows thereafter, we expect to increase our dividend per share. Whether dividends are to be declared and the amount and timing thereof remain subject to the discretion of our board of directors. See notes 10 and 17 to our consolidated financial statements.\nWe operate as a REIT for U.S. federal income tax purposes. To remain qualified and be taxed as a REIT, we are generally required to annually distribute at least 90% of our REIT taxable income (determined without regard to the dividends paid deduction, excluding net capital gain and after the utilization of any available NOLs) to our stockholders. Our quarterly cash common stock dividend will delay the utilization of our NOLs and may cause certain of the NOLs to expire without utilization. See also \n\"Item 1. Business—REIT Status\" \nand \n\"Item 7. MD&A—General Overview—Common Stock Dividend.\"\n \nAs discussed in \n\"Item 1. Business—Strategy,\"\n we seek to invest our available capital, including the net cash generated by our operating activities and external financing sources, in a manner that we believe will increase long-term stockholder value on a risk-adjusted basis. Our historical discretionary investments have included the following (in no particular order): construction of communications infrastructure; acquisitions of communications infrastructure; acquisitions of land interests (which primarily relate to land assets under towers); improvements and structural enhancements to our existing communications infrastructure; purchases of shares of our common stock from time to time; and purchases, repayments or redemptions of our debt. External financing, including debt, equity, and equity-related issuances to fund future discretionary investments either (1) may not be available to us or (2) may not be accessible by us at terms that would result in the investment of the net proceeds raised yielding incremental growth in our per share operating results. As a result, future dividend payments may hinder our ability to grow our per share results of operations or otherwise adversely affect our ability to execute our business plan.\nRemaining qualified to be taxed as a REIT involves highly technical and complex provisions of the Code. Failure to remain qualified as a REIT would result in our inability to deduct dividends to stockholders when computing our taxable income, thereby increasing our tax obligations and reducing our available cash.\nAs a REIT, we are generally entitled to a deduction for dividends that we pay and therefore are not subject to U.S. federal corporate income tax on our net taxable income that is currently distributed to our common stockholders.\nWhile we intend to operate so that we remain qualified as a REIT, given the highly complex nature of the rules governing REITs, the importance of ongoing factual determinations, the possibility of future changes in our circumstances, and the potential impact of future changes to laws and regulations impacting REITs, no assurance can be given that we will qualify as a REIT for any particular year. \nIn addition, the present U.S. federal tax treatment of REITs is subject to change, possibly with retroactive effect, by legislative, judicial or administrative action at any time, and any such change might adversely affect our REIT status or benefits. We cannot predict the impact, if any, that such changes, if enacted, might have on our business. However, it is possible that such changes could adversely affect our business, including our REIT status. \nIf, in any taxable year, we fail to qualify for taxation as a REIT and are not entitled to relief under certain provisions of the Code, then:\n•\nwe will not be allowed a deduction for dividends paid to stockholders in computing our taxable income;\n•\nwe will be subject to federal and state income tax on our taxable income at regular corporate tax rates and, for years beginning before January 1, 2018, any applicable alternative minimum tax; and\n•\nwe would be disqualified from re-electing REIT status for the four taxable years following the year during which we were so disqualified.\nAlthough we may have federal NOLs available to reduce any taxable income, to the extent our federal NOLs have been utilized or are otherwise unavailable, any such corporate tax liability could be substantial, would reduce the amount of cash available for other purposes and might necessitate the borrowing of additional funds or the liquidation of some investments to pay any additional tax liability. Accordingly, funds available for investment would be reduced.\n27\nUnder the Code, for taxable years beginning in or after 2018, no more than 20% of the value of the assets of a REIT may be represented by securities of one or more TRSs. These limitations may affect our ability to make additional investments in non-REIT qualifying operations or assets, or in any operations held through TRSs. The net income of our TRSs is not required to be distributed to us, and income that is not distributed to us generally will not be subject to the REIT income distribution requirement. However, there may be limitations on our ability to accumulate earnings in our TRSs and the accumulation or reinvestment of significant earnings in our TRSs could result in adverse tax treatment. In particular, if the accumulation of cash in our TRSs causes the fair market value of our securities in our TRSs to exceed current or future limitations of the fair market value of our assets at the end of any quarter, then we may fail to remain qualified as a REIT.\nComplying with REIT requirements, including the 90% distribution requirement, may limit our flexibility or cause us to forgo otherwise attractive opportunities, including certain discretionary investments and potential financing alternatives.\nTo remain qualified and be taxed as a REIT, we are required to satisfy the 90% distribution requirement as described above. We commenced declaring regular quarterly dividends to our common stockholders beginning with the first quarter of 2014. See notes 10 and 17 to our consolidated financial statements. Whether dividends are to be declared and the amount and timing thereof remain subject to the discretion of our board of directors based on then-current and anticipated future conditions, including our earnings, net cash generated by operating activities, capital requirements, financial condition, our relative market capitalization, our existing federal NOLs of approximately $1.5 billion or other factors deemed relevant by our board of directors.\nTo the extent that we satisfy the 90% distribution requirement but distribute less than 100% of our REIT taxable income (determined without regard to the dividends paid deduction, excluding net capital gain and after the utilization of any available NOLs), we will be subject to federal corporate income tax on our undistributed taxable income. In addition, we will be subject to a 4% nondeductible excise tax if the actual amount that we pay to our stockholders for a calendar year is less than a minimum amount specified under the Code.\nFrom time to time, we may generate REIT taxable income greater than our cash flow as a result of differences in timing between the recognition of taxable income and the actual receipt of cash or the effect of nondeductible capital expenditures, the creation of reserves or required debt or amortization payments. If we do not have other funds available in these situations, we could be required to borrow funds on unfavorable terms, sell assets at disadvantageous prices, or distribute amounts that would otherwise be invested in future acquisitions to make distributions sufficient to enable us to pay out enough of our taxable income to satisfy the REIT dividend requirement and to avoid corporate income tax and the 4% excise tax in a particular year. These alternatives could increase our costs or reduce our equity. Thus, compliance with the REIT requirements may hinder our ability to grow, which could adversely affect the value of our common stock. Furthermore, the REIT dividend requirements may increase the financing we need to fund capital expenditures, future growth, or expansion initiatives, which would increase our total leverage.\nIn addition to satisfying the 90% distribution requirement, to remain qualified as a REIT for tax purposes, we are required to continually satisfy tests concerning, among other things, the sources of our income, the nature and diversification of our assets and the ownership of our capital stock. Compliance with these tests will require us to refrain from certain activities and may hinder our ability to make certain attractive investments, including the purchase of non-qualifying assets, the expansion of non-real estate activities, or investments in the businesses to be conducted by our TRSs, and to that extent, limit our opportunities and our flexibility to change our business strategy. Furthermore, acquisition opportunities in domestic or international markets may be adversely affected if we need or require the target company to comply with some REIT requirements prior to completing any such acquisition. In addition, our status as a REIT may result in investor pressures not to pursue growth opportunities that are not immediately accretive.\nMoreover, if we fail to comply with certain asset ownership tests, at the end of any calendar quarter, we must correct the failure within 30 days after the end of the calendar quarter or qualify for certain statutory relief provisions to avoid losing our REIT qualification. As a result, we may be required to liquidate assets in adverse market conditions or forgo otherwise attractive investments. These actions may reduce our income and amounts available for distribution to our stockholders.\n28\nREIT related ownership limitations and transfer restrictions may prevent or restrict certain transfers of our capital stock. \nIn order for us to continue to satisfy the requirements for REIT qualification, our capital stock must be beneficially owned by 100 or more persons during at least 335 days of a taxable year of 12 months or during a proportionate part of a shorter taxable year. Also, not more than 50% of the value of the outstanding shares of our capital stock may be owned, directly or indirectly, by five or fewer \"individuals\" (as defined in the Code to include certain entities such as private foundations) during the last half of a taxable year. In order to facilitate compliance with the REIT rules, our Charter includes provisions regarding REIT-related ownership limitations and transfer restrictions that generally prohibit any \"person\" (as defined in our Charter) from beneficially or constructively owning, or being deemed to beneficially or constructively own by virtue of the attribution provisions of the Code, more than (1) 9.8%, by value or number of shares, whichever is more restrictive, of the outstanding shares of our common stock, or (2) 9.8% in aggregate value of the outstanding shares of all classes and series of our capital stock. In addition, our Charter provides for certain other ownership limitations and transfer restrictions. Under applicable constructive ownership rules, any shares of capital stock owned by certain affiliated owners generally would be added together for purposes of the ownership limitations. These ownership limitations and transfer restrictions could have the effect of delaying, deferring or preventing a transaction or a change in control of our company that might involve a premium price for our capital stock or otherwise might be in the best interest of our stockholders. \nCertifications\nWe submitted the CEO certification required by Section 303A.12(a) of the New York Stock Exchange (\"NYSE\") Listed Company Manual, relating to compliance with the NYSE's corporate governance listing standards, to the NYSE on June 7, 2024 with no qualifications. We have included the certifications of our CEO and Chief Financial Officer required by Section 302 of the Sarbanes-Oxley Act of 2002 and related rules as Exhibits 31.1 and 31.2 to this 2024 Form 10-K.\n29\nItem 1B.    \nUnresolved Staff Comments\nNone.\nItem 1C.    \nCybersecurity\nOur company maintains a \ncomprehensive Information Security Program (\"IS Program\")\n focused on detection, assessment and mitigation of cybersecurity risks. Our dedicated enterprise security team, led by our Chief Information Security Officer (\"CISO\"), administers the IS Program and is responsible for identification, investigation and response to cyber threats and vulnerabilities. The enterprise security team also implements, manages, and assesses our company's cyber policies, standards and procedures, which leverage our team's expertise and the National Institute of Standards and Technology Cybersecurity Framework. We have developed an incident response plan to handle suspected loss of, or unauthorized access to, information. We regularly conduct tabletop exercises, red team exercises, simulations, and other exercises to evaluate the effectiveness of our IS Program and to position our company for a coordinated, strategic response in the event of an actual security incident. All employees are required to complete cybersecurity trainings and employees in higher-risk roles are required to complete additional customized training tailored to address their specific risk exposure. Our Security Operations Center (\"SOC\"), which operates 24 hours a day, 365 days a year, is designed to provide visibility of security events across our Company and a mechanism for swiftly addressing cyber threats before they compromise data security. Through a combination of a threat management platform and our team of cybersecurity specialists, our SOC continuously monitors and proactively isolates and analyzes cybersecurity alerts to help us address cybersecurity risks.\n \nThe identification, assessment and management of cybersecurity risks are integrated into our existing enterprise risk management (\"ERM\") framework. Cybersecurity related risks are included in the risk universe that the ERM function evaluates to assess top risks to the enterprise on an annual basis, which are presented to and reviewed by the Audit Committee. \nWe engage third-party providers to conduct evaluations of our security controls, including through vulnerability assessments and penetration testing, independent audits or consulting on best practices.\n These evaluations include testing both the design and operational effectiveness of security controls. Additionally, our internal audit team regularly evaluates the effectiveness of the IS Program, with results reported to the board of directors.\nWe also have policies and procedures in place to manage cybersecurity risks associated with third-party service providers. We impose security requirements on our suppliers, which include maintaining a security management program, complying with information handling requirements, and notifying us in the event of any known or suspected cyber incident. Where appropriate, we assess third-party cybersecurity controls and include security and privacy addenda to our vendor contracts.\n \nOur CISO reports directly to our Executive Vice President and Chief Information Officer (\"CIO\"), who reports to our CEO.  Our \nCISO\n is informed about and monitors prevention, detection, mitigation, and remediation efforts through regular communication with and reporting from the enterprise security team, many of whom hold cybersecurity certifications, and through the use of technological tools and software and results from third-party assessments. Our CISO and CIO have extensive experience assessing and managing cybersecurity programs and cybersecurity risk. Our CISO has over 25 years of cybersecurity experience, including having served as Chief Technology Officer/CISO and co-founder of two cybersecurity companies, during which time he provided cybersecurity consulting services to Fortune 500 companies and taught a digital and network forensics course at the National Computer Forensics Institute. Prior to joining our company, our CISO served as the Director of Security Services for a large network infrastructure company, and our CIO was responsible for network security policies, technology, and operations, including intrusion detection systems and conduct penetration testing, at another large public company.\n \nThe CIO periodically reports to the Audit Committee regarding cybersecurity risk exposure and risk mitigation strategies. The board of directors also may review and assess cybersecurity risks in connection with its review of our company's mission critical risks.\nWhile we have not, as of the date of this 2024 10-K, experienced a cybersecurity threat or incident that resulted in a material adverse impact to our business or operations, there can be no guarantee that we will not experience such an incident in the future. See \"Risk Factors\" for more information on our cybersecurity risks.\n30"
}