{
  "ticker": "CDNS",
  "cik": "0000813672",
  "company_name": "CADENCE DESIGN SYSTEMS INC",
  "filing_date": "2025-02-21",
  "accession": "0000813672-25-000024",
  "primary_doc": "cdns-20241231.htm",
  "item1_text": "Item 16.\nForm 10-K Summary\n98\nSignatures\n99\nTable of Contents\nPART I.\nItem 1. Business\nThis Annual Report and the documents incorporated by reference in this Annual Report contain statements that are not historical in nature, are predictive, or that depend upon or refer to future events or conditions or contain other forward-looking statements. Statements including, but not limited to, statements regarding the horizons of artificial intelligence (“AI\"), other technological and market advancements and their impacts on our business; the extent, timing and mix of future revenues and customer demand; the deployment of our products and services; the impact of the macroeconomic and geopolitical environment, including but not limited to, expanded trade controls, tariffs, conflicts around the world, volatility in foreign currency exchange rates, inflation and changes in interest rates; the impact of government actions; future costs, expenses, tax rates and uses of cash; pending legal, administrative and tax proceedings; restructuring actions and associated charges and benefits; pending acquisitions, accounting for acquisitions and integration of acquired businesses; and other statements using words such as “anticipates,” “believes,” “could,” “estimates,” “expects,” “forecasts,” “intends,” “may,” “plans,” “projects,” “should,” “targets,” “will” and “would,” and words of similar import and the negatives thereof, constitute forward-looking statements. These statements are predictions based upon our current expectations about future events. Actual results could vary materially as a result of certain factors, including but not limited to those expressed in these statements. Important risks and uncertainties that could cause actual results to differ materially from those contained in the forward-looking statements include, but are not limited to, those identified in the “Proprietary Technology,” “Governmental Regulations,” “Competition,” “Risk Factors,” “Critical Accounting Estimates,” “Results of Operations,” “Quantitative and Qualitative Disclosures About Market Risk” and “Liquidity and Capital Resources” sections contained in this Annual Report and the risks discussed in our other Securities and Exchange Commission (“SEC”) filings.\nWe urge you to consider these factors carefully in evaluating the forward-looking statements contained in this Annual Report. All subsequent written or oral forward-looking statements attributable to our company or persons acting on our behalf are expressly qualified in their entirety by these cautionary statements. The forward-looking statements included in this Annual Report are made only as of the date of this Annual Report. We do not intend, and undertake no obligation, to update these forward-looking statements.\nOverview \nCadence\n®\n is a global market leader that develops computational, AI-driven software, accelerated hardware, and intellectual property (“IP”) solutions for engineers and scientists to bring new and innovative products to life. The world’s most innovative technology companies use our solutions and services to deliver transformational products to multiple industries that drive the global economy. The products these companies develop are some of the most complex systems in the world. Since our inception, we have been at the forefront of technology innovation. We work closely with our customers, helping them solve their most complex challenges in the semiconductor and electronic systems industries to unlock limitless opportunities.\nOur customers include semiconductor companies that design and manufacture semiconductor devices and systems companies that design and manufacture products containing many different types of semiconductors, which they either make themselves or buy from a semiconductor company. Semiconductors, also referred to as integrated circuits (“ICs”), or chips, are the heart of almost every industry. Semiconductors are the catalyst for innovation in many industries including automotive, aerospace, biotech, hyperscale and cloud computing, data centers, telecommunications, medical technology, industrial internet of things (“IIoT”), and AI. They are found in a wide variety of consumer products such as cell phones, automobiles, computers, home appliances, home security, drones, and home entertainment systems.\n \nBusiness Strategy\nOur Intelligent System Design™ (“ISD”) strategy allows us to deliver solutions to our customers to solve their most complex product development challenges. Our industry-leading computational software, accelerated hardware, and IP enable us to adapt to our customer's dynamic design requirements, allowing them to meet their critical business and environmental concerns including time-to-market and sustainability. The creation of even the most seemingly simple electronic systems and products typically includes a complex design process and requires highly trained engineers with various areas of specialized knowledge and skill sets. Our ability to deliver innovative products that keep up with increasing complexity allows our customers to be successful in meeting their business goals and objectives.\nHistorically, the industry that provided the software tools IC engineers used was called Electronic Design Automation (“EDA”). The pace of technical innovation in EDA has been driven by a concept known as Moore’s Law, which more than 50 years ago predicted that the complexity of ICs would double approximately every 18-24 months. Our strategy, illustrated in the graphic below, is focused on three primary areas: Design Excellence, System Innovation, and Pervasive Intelligence.\nDesign Excellence\n focuses on our core technology and deep understanding of computational software, accelerated computing, machine learning, and AI to develop best-in-class electronic design and analysis semiconductor solutions. In this area, customers are primarily developing large chips including those used in computers, laptops, cellphones, medical devices, games and entertainment systems, and many other types of consumer electronics. Design Excellence applies to all types of semiconductor electronics including CPUs, GPUs, MCUs, memory, radio frequency (“RF”), analog, and mixed-signal, in both mainstream and advanced semiconductor process nodes.\n1\nTable of Contents\nSystem Innovation\n builds on our foundation of Design Excellence and deep expertise in computational algorithms and expands that expertise to include multiphysics-based analysis of systems that contain electronic devices, including printed circuit boards (“PCBs”), devices with advanced packaging technology, and 3-dimensional IC (“3D-IC”). This gives customers designing full systems containing multiple electronic devices, the ability to verify that their products will work as intended under various physical conditions. Some examples of electronic systems are a computer motherboard, the electronics in a cellphone, or the electronic transmission or infotainment system in an automobile.\nPervasive Intelligence\n incorporates AI training and inference algorithms in our solutions to help customers optimize performance and productivity with improved quality of results for their products. The amount of data produced in the design phase of their products has grown exponentially over the last 20 years. We implement generative AI agents to analyze large data sets and break through the limitations of the conventional human-intensive optimization process to achieve optimal design solutions expeditiously and without compromising accuracy. \nOur software and hardware products also support cloud access to address our customers' growing computational needs. Customers can access our solutions via our Cadence OnCloud Platform.\nBusiness Drivers\nOur products and services enable our customers to design complex and innovative semiconductor and electronic systems that are driven by key trends, including foundries creating new advanced transistor devices and processes, semiconductor companies designing electrical systems, systems companies designing semiconductors, the hyper-convergence between electrical and mechanical systems, hyperscale computing, autonomous driving, and 5G. These trends are accelerated by the AI super cycle. Demand for our technology and expertise is driven by increasing complexity and our customers’ need to invest in new designs and products that are highly differentiated. \nGenerative AI is reshaping the entire semiconductor and systems industry development process. From our perspective, the AI super cycle we are experiencing will influence our key business opportunities along three horizons, which are Infrastructure AI, Physical AI and Life Sciences AI. The first horizon, Infrastructure AI, is being driven by data centers and hyperscale computing to provide the necessary power to run AI workloads. The second horizon, Physical AI, is the integration of AI with autonomous systems. It will drive many applications such as automobiles, industrial robots, and many other autonomous systems. The third horizon, Life Sciences AI, is the application of AI and computer science to biology to drive advancements in the medical and life sciences industries.\nUnderlying the requirements within any particular vertical sector is the availability of rapidly improving IC manufacturing technology. In order for our customers to take advantage of such advancements, some of our products need to first incorporate new capabilities such that they can exploit new manufacturing capabilities. This dependency means that we must invest significantly in product research and development (“R&D”) to keep pace with the latest manufacturing technology. The demand for new IC manufacturing technology directly impacts the demand for our newest products.\n2\nTable of Contents\nAnother driver for our business is the differentiation, capabilities and benefits provided to our customers by our products. With the rapid pace of innovation comes the opportunity for our products to address growing key challenges associated with the design of electronic products, such as power consumption, performance, chip area and cost. Our products and services have differentiated attributes that our customers value. In general, these attributes can be grouped into broader categories such as quality of results (in terms of power consumption, performance and chip area), engineering productivity, tool performance, manufacturability, reliability and faster time to market. Many of these attributes contribute to sustainability initiatives by enabling our customers to create innovative products that optimize power, space and energy.\nProduct Categories\nEngineers use our solutions to complete critical steps in the design process, which includes creating, implementing, and verifying the design for functionality, manufacturability and other required industry-related compliance standards. Much of an engineer's time spent with our solutions during the design process involves running simulations to verify that their design will work as expected. Our technology, enhanced by AI, allows our customers to build a virtual model or digital twin that accurately predicts how their design will work. The ability to perform these simulations leads to significant time and cost savings for our customers as they can find and fix critical design problems before building their products. Our customers rely on our solutions to ensure their products perform safely and reliably.\nIn alignment with our Intelligent System Design strategy, we define our solutions in three product categories: Core EDA, Semiconductor IP, and System Design and Analysis (“SD&A”). Core EDA includes our software, hardware, and services used to design and verify a wide variety of semiconductors. Our Semiconductor IP portfolio includes silicon subsystems, software, and services that are used in semiconductor design. The SD&A category includes our software and services used to design and verify a wide variety of physical electronic systems. Leveraging our AI and computational software expertise, we have integrated the multiphysics domain (also known as “computational fluid dynamics,” or “CFD”) with our EDA solutions to provide customers with complete system-level design and analysis solutions. These categories are tightly integrated to provide complete design solutions for our customers. \nCore EDA\nOur Core EDA product category addresses the design and verification for a wide variety of semiconductor chips and manufacturing process technologies. Examples of the types of chips include analog, custom, digital, mixed-signal, memory, microwave, silicon photonics, and RF. The types of devices addressed by Core EDA covers a wide range of industries including automotive, aero and defense, hyperscale computing and data center, mobile communication, medical devices, and consumer electronics. As the complexity of chip design, semiconductor process technology, and electronic system design has increased, we have been incorporating the latest advances in machine learning and generative AI to drive significant improvements for our customers’ design quality of results and engineering productivity. \nCustom IC Design and Simulation\nVirtuoso Studio is the foundation of our solution platform for custom, analog, mixed-signal, photonics, and RF semiconductors. It is a complete AI-enabled solution that integrates the key Cadence technology required for silicon design, layout, and verification. Engineers use this solution to define the chip functionality (schematic) and physical layout descriptions for the complete design of chips, advanced packaged devices, and PCBs. Designs are functionally verified in simulation with the Spectre simulation solution. We believe Spectre is the gold standard for circuit design including analog, custom, memory, silicon photonics, and RF. Pegasus Physical Verification, our physical verification solution, is fully integrated with Virtuoso.\nDigital IC Design and Signoff\nThe Innovus Implementation System is the foundation of our full-flow digital IC design and signoff solution. A typical digital full-flow solution has four primary areas, which include creating the functional description (design synthesis), performing functional verification, running the physical implementation (place and route), and performing sign-off checks for manufacturing. The Innovus Implementation System is integrated with the key full-flow solution areas. For functional design, customers use the Genus Synthesis solution. For sign-off checks, customers use the Quantus Extraction, Timing Signoff, Voltus C Power Integrity, and Pegasus Physical Verification solutions. While these are the main areas in the digital flow, there are other important technology solutions for a comprehensive flow that includes the need for test synthesis, logic equivalence checking, high level power analysis, and optimization. The solutions are Joules™ RTL Power, which is designed to deliver fast power analysis while preserving near-signoff accuracy, and Cadence Modus DFT software, which reduces system-on-chip (“SoC”) design-for-test time. Cadence Cerebrus™ is our generative AI solution that combines all elements of the full-flow IC through signoff, enabling additional productivity, automation, and improved quality of results throughout the entire design flow.\nFunctional Verification\nAs mentioned above, functional verification is an important aspect of the design process. Design engineers rely heavily on the capability to verify that the chip's functional description is equivalent to the physical description used to manufacture the silicon. Functional verification is done multiple times throughout the design process as changes are incorporated, with the objective of identifying as many potential functional issues as possible before manufacturing the circuitry, thereby significantly reducing the risk of discovering a costly error in the completed product. We offer two functional verification software solutions, the Jasper Formal Verification Platform, and the Xcelium™ Parallel Logic Simulation Platform. These software solutions help engineers compare the functional view of the design with its physical view to make sure they match and help ensure that the design will successfully pass all functional tests.\n3\nTable of Contents\nOur hardware acceleration and software prototyping solutions address another important aspect of functional verification in design flows. This capability is essential for chips that are used in high-performance computers like microprocessors, graphics processors, and AI processor chips. Some of the functional tests for these designs are so large that they may take weeks or even months to complete. Hardware acceleration, also known as emulation, and software prototyping can reduce these large simulations to hours or a few days. Our Palladium\n®\n Enterprise Emulation Platform and Protium™ field programmable gate arrays (“FPGA”)-Based Prototyping Platforms are for more comprehensive chip verification, often running low-level embedded software on top of a model of the chip, to ensure proper functionality before silicon manufacturing. These engines are used for early bug detection, verification of block-level functionality, verification acceleration and emulation of system-level functionality, system-level power exploration, analysis and optimization, and system-level prototyping for hardware/software co-verification. Our Palladium platform provides high throughput, capacity, data center reliability, and workgroup productivity to enable global design teams to develop advanced hardware-software systems. The Protium platform leverages a common front end with the Palladium environment to move designs rapidly from emulation to the prototyping stage, enabling software development to begin weeks to months earlier than otherwise possible. Verisium™ is our generative AI solution for multi-run verification that enables additional productivity, automation, and quality of results throughout the entire verification flow. \nSemiconductor IP\nOur semiconductor IP product category includes strategic and mission-critical design architectures that our customers use to integrate into their highly differentiated design blocks, SoC subsystems, and chiplets. These are typically designed into silicon chips that are found in high volume in multiple markets such as automotive, hyperscale, mobile computing, and many consumer products including mobile phones, and AI chips. Our IP offerings include controllers and physical interfaces, which are commonly used in computing, networking, and embedded systems. We have a broad portfolio of PCI Express, Universal Accelerator Link, Compute Express Link, multiple memory interfaces including High Bandwidth Memory and Graphics Double Data Rate, and many other standards. In addition, our portfolio includes a wide variety of digital signal processor IPs. Our Tensilica\n®\n configurable digital signal processors are vertically targeted subsystems for AI, audio/voice, baseband and vision/imaging applications, controllers and physical interfaces for standard protocols and analog IP. Our design IP portfolio includes solutions for high speed serializer/deserializer (“SerDes”), peripheral component interconnect (“PCI”), USB, and many other standards. In addition to the IP portfolio listed above, customers rely on our Verification IP (“VIP”) portfolio to perform system-level validation. The VIP models are designed to work seamlessly with our Xcelium™ simulator and Palladium\n®\n Enterprise Emulation solutions. \nWe also offer design services to provide customers with end-to-end solutions from design specifications to final working silicon. In the first quarter of fiscal 2024, we acquired Invecas, a leading provider of design engineering, embedded software, and system-level solutions. With this acquisition, we have added a highly skilled system design engineering team with expertise in providing IP design services for a wide variety of advanced node and mixed-signal chip designs, verification, product engineering, advanced packaging, and embedded software.\nSystem Design and Analysis\nOur SD&A product category is a comprehensive multiphysics platform that helps our customers design and simulate electronics and entire systems. It encompasses key areas of analysis including electromagnetic, thermal, structure, computational fluid dynamics, molecular, PCB and packaging, mechanical and structural analysis. \nThe capabilities in the Allegro\n®\n System Design Platform include PCB design and implementation, IC package and system-in-package design, signal and power integrity analysis, and PCB library design management and collaboration. The need for compact, high-performance mobile, consumer, and automotive design with advanced serial interconnect is driving the technological evolution of our PCB offerings. For mainstream PCB customers, where individual or small team productivity is a focus, we provide the OrCAD\n®\n family of offerings, which are primarily marketed worldwide through a network of resellers. Allegro X AI™ is our generative AI solution designed to provide significant cycle-time compression for PCB design, enhancing an engineer’s productivity.\nThe speed and proximity of signals on silicon, through packages to boards, and through connectors and cables, exposes these communications to various kinds of interference, generates heat, and emits electromagnetic radiation. Careful analysis is required for these systems to work as designed under a wide range of operating conditions, standards, and regulatory laws. The complexity of these devices and signal transmissions requires analysis and simulation throughout the product lifecycle to meet these objectives. Our Clarity\n™\n 3D Solver for electromagnetic and power electronics analysis and simulation, as well as our Celsius\n™\n Thermal Solver, provide the foundation for multiphysics analysis technology, with complete electrical-thermal co-simulation for electronic systems from ICs to physical enclosures. \nOur Fidelity™ CFD Software expands our ability to meet the growing design challenges of electronic and systems companies. Fidelity CFD is a physics-based analysis solution for mechanical design and complements the electronic system analysis portfolio. Our comprehensive suite of computational fluid dynamics (“CFD”) solutions enables our customers to extend their multiphysics analysis workflows to address simulation and analysis challenges for applications such as aerodynamics, hydrodynamics, propulsion, turbomachinery, heat transfer, and combustion. Optimality™ Intelligent System Explorer is the industry’s first generative AI-driven multiphysics optimization solution. It delivers additional productivity, automation, and improved system-level power, performance and area and quality of results throughout the entire analysis flow. \n4\nTable of Contents\nOur Cadence Reality Digital Twin platform brings physics-based design and analysis to the data center sector for performance-aware design and operational planning. Data center professionals can future-proof designs and assess operational decisions with this digital twin and empower designers, owners, and operators to address the need for reliability, capacity, and energy efficiency.\nWith our acquisition of BETA CAE Systems International AG (“BETA CAE”) in fiscal 2024, we expanded our multiphysics simulation capabilities to include mechanical and structural analysis. BETA CAE’s industry-leading solutions include ANSA for pre-processing and full-flow model development, META for post-processing and analysis, EPILYSIS for structural analysis, and FATIQ for fatigue and failure analysis. These solutions along with the rest of BETA CAE’s portfolio address mechanical and structural design challenges in several markets including aerospace, automotive, biomechanics, construction, energy, crash and safety, industrial equipment, marine, and robotics.\nOur Millennium™ Multiphysics Enterprise Platform is an industry-first turnkey AI-enabled digital twin. Millennium M1 is the first release and is designed to overcome traditional CFD speed/accuracy and compute resource limitations with a combination of GPU resident CFD solvers such as Fidelity LES for large eddy simulations (“LES”) and scalable high-performance hardware.\nFor 3D-IC and multi-chiplet designs, our customers use the Cadence\n®\n Integrity™ 3D-IC Platform. Built on the Innovus solution, Integrity allows system-level designers to plan, implement, and analyze stacked die systems for a variety of packaging styles (2.5D or 3D). Integrity 3D-IC is the industry’s first integrated system and SoC-level solution that enables system analysis, including co-design, with Virtuoso and Allegro implementation environments. \nWe also offer molecular modeling and simulation solutions and services. These solutions and services are used by a wide range of organizations in the pharmaceutical and biotechnology sectors to accelerate the drug discovery process and make more informed decisions in developing new therapeutics.\nProduct Arrangements\nWe primarily license our software using time-based licenses. Our time-based license arrangements offer customers the right to access and use all of the products delivered at the outset of an arrangement and updates throughout the entire term of the arrangement, which is generally two to three years, with no rights to return. In addition, certain time-based license arrangements include the right for the customer to remix among the products delivered at the outset of the arrangement and use unspecified additional products that become commercially available during the term of the arrangement.\nA small portion of our software is licensed under perpetual licenses, which does not include the right to use new technology. Payment terms for time-based licenses generally provide for payments to be made over the license period, and payment terms for perpetual licenses generally are net 30 days.\nOur hardware products are either sold or leased to our customers. Our emulation hardware can also be accessed remotely via a Cadence-managed cloud arrangement.\nWe generally license our design IP under nonexclusive license agreements that provide usage rights for specific designs. Some customers enter into non-cancelable commitments, whereby the customer commits to a fixed dollar amount over a specified period of time that can be used to purchase from a list of products or services. In addition, for certain IP license agreements, we collect royalties as our customers ship their product that includes our IP to their customers.\nFor a further description of our license agreements, our hardware sale or lease agreements, revenue recognition policies and results of operations, please refer to the discussion under “Critical Accounting Estimates” under Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nTechnical Support and Maintenance\nCustomer service and support is critical to the adoption and successful use of our products. We provide our customers with technical support and maintenance to facilitate their use of our software, hardware and IP solutions.\nOur education services offerings can be customized and include training programs that are delivered online, through an app, or in a classroom setting. The content of these offerings ranges from the latest design techniques to methodologies for using the most recent features of our products. The primary focus of education services is to accelerate our customers’ path to productivity in the use of our products.\nServices\nWe offer a number of services, including design services, services related to methodology, education and hosted design solutions. These services may be sold separately or sold and performed in conjunction with the license, sale or lease of our products. As necessary, specialized design services engineers are assigned to internal R&D projects associated with our design IP business. \nAs part of our services offerings, we design advanced ICs, develop custom IP and help customers address design challenges. This enables us to target and accelerate the development of new software technology and products to satisfy current and future design requirements. \n5\nTable of Contents\nWe offer engineering services to collaborate with our customers in the design of complex ICs and the implementation of key design capabilities, including low power design, IC packaging and board design, functional verification, digital implementation, analog/mixed-signal design and system-level design. The customers for these services primarily consist of semiconductor and systems companies developing products for the consumer, hyperscale computing, 5G communications, mobile, automotive, aerospace and defense, industrial and life science vertical sectors. These ICs range from digital SoCs and analog and RF designs to complex mixed-signal ICs. \nThe Cadence Cloud portfolio, which consists of Cadence-managed and customer-managed cloud environments, continues to expand, with additional cloud-based and software as a service (“SaaS”) products, including cloud-based solutions for SD&A and functional verification. Contractual arrangements with customers for both environments are generally time-based, similar to the on-premises software license arrangements described above, and may include usage-based terms. \nIn delivering methodology services, we leverage our experience and knowledge of design techniques, our products, leading practices and different design environments to enable improved productivity of our customers’ engineering teams. Depending on the customers’ projects and needs, we work with customers using outsourced, consultative and collaborative offerings.\nThird-Party Programs and Initiatives\nIn addition to our products, many customers use design tools that are provided by other companies, as well as design IP available from alternative suppliers. We support the use of third-party design products and design IP through our Cadence Connections\n®\n program and through our participation in industry groups such as the Silicon Integration Initiative and Accellera System Initiative. We actively contribute to the development and deployment of industry standards.\nProduct and Maintenance and Services Revenue\nRevenue, and revenue as a percentage of total revenue, from our product and maintenance and services offerings for the last three fiscal years were as follows:\n2024\n2023\n2022\n(In millions, except percentages)\nProduct and maintenance\n$\n4,213 \n91 \n%\n$\n3,834 \n94 \n%\n$\n3,340 \n94 \n%\nServices\n428 \n9 \n%\n256 \n6 \n%\n222 \n6 \n%\nTotal revenue\n$\n4,641 \n$\n4,090 \n$\n3,562 \nRecurring revenue includes revenue recognized over time from our software arrangements, services, royalties, maintenance on IP licenses and hardware, and operating leases of hardware. Recurring revenue also includes revenue recognized at varying points in time over the term of other arrangements with non-cancelable commitments, whereby the customer commits to a fixed dollar amount over a specified period of time that can be used to purchase from a list of products or services. These arrangements do not meet the definition of a revenue contract until the customer executes a separate selection form to identify the products and services that they are purchasing. Each separate selection form under the arrangement is treated as an individual contract and accounted for based on the respective performance obligations.\nThe remainder of our revenue is recognized at a point in time and is characterized as up-front revenue. Up-front revenue is primarily generated by sales of hardware and individual IP licenses and certain software licenses. The percentage of our recurring and up-front revenue is impacted by delivery of hardware and IP products to our customers in any single fiscal period.\nFor additional information and analysis on our revenue, including revenue by geography, see the discussion under “Results of Operations” under Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.” For our fiscal 2024 results of operations and our financial position as of December 31, 2024, see Part IV, Item 15, “Exhibits and Financial Statement Schedules.”\nRemaining Performance Obligations\nRevenue allocated to remaining performance obligations represents the transaction price allocated to the performance obligations that are unsatisfied, or partially unsatisfied, which includes unearned revenue and amounts that will be invoiced and recognized as revenue in future periods. We have elected to exclude the potential future royalty receipts from the remaining performance obligations. Contracted but unsatisfied performance obligations were approximately $6.8 billion as of December 31, 2024, which included $0.5 billion of non-cancelable commitments from customers where actual product selection and quantities of specific products or services are to be determined by customers at a later date. \nWe estimate our remaining performance obligations at a point in time. Actual amounts and timing of revenue recognition may differ from these estimates largely due to changes in actual installation and delivery dates, as well as contract renewals, modifications and terminations. As of December 31, 2024, we expected to recognize 54% of the contracted but unsatisfied performance obligations, excluding non-cancelable commitments, as revenue over the next 12 months, 42% over the next 13 to 36 months and the remainder thereafter.\n6\nTable of Contents\nMarketing and Sales\nWe generally market our products and provide services to existing and prospective customers through a direct sales force consisting of salespeople and applications engineers. Applications engineers provide technical pre-sales and post-sales support for our products. Due to the complexity of many of our products and the system design process, the sales cycle is generally long, requiring up to six months or longer. During the sales cycle, our direct sales force generally provides technical presentations, product demonstrations and support for on-site customer evaluation of our solutions. We also promote our products and services through advertising, marketing automation, trade shows, public relations and the internet. We selectively utilize value-added resellers to broaden our reach and reduce cost of sales. Our OrCAD products and certain Allegro products are primarily marketed through these channels. With respect to international sales, we generally market and support our products and services through our subsidiaries. We also use a third-party distributor to license our products and services to certain customers in Japan.\nResearch and Development    \nOur future performance depends on our ability to innovate, commercialize newly developed solutions and enhance and maintain our current products. The primary areas of our R&D align with our product categories discussed above. We must continuously adapt our products to solve new or increased physics challenges that arise with each successive process node and address the increase in complexity that is introduced by the resulting much larger designs. We must also keep pace with our customers’ technical developments, satisfy industry standards and meet our customers’ increasingly demanding performance, productivity, quality and predictability requirements. Therefore, we expect to continue to make significant investments in R&D.\nHardware Manufacturing and Software Distribution\nOur hardware, including all individual PCBs, custom ICs and FPGA-based prototyping components, is manufactured, assembled and tested by subcontractors before delivery to our customers. Software and documentation are primarily distributed to customers by secure electronic delivery. \nProprietary Technology\nOur success depends, in part, upon our proprietary technology. We generally rely on patents, copyrights, trademarks and trade secret laws, licenses and restrictive agreements to establish and protect our proprietary rights in technology and products. Many of our products include software or other IP licensed from third parties. We may have to seek new licenses or renew existing licenses for third-party software and other IP in the future. As part of performing engineering services for customers, our engineering services business uses certain software and other IP licensed from third parties, including that of our competitors.\nGovernmental Regulations\nWe are subject to a variety of federal, state, local and foreign laws and regulations relating to our business and operations. These include, but are not limited to, laws and regulations related to trade controls, anti-corruption and anti-bribery, and data privacy and data protection and AI, as well as antitrust, competition, employment, income taxes and the environment. \nTrade\nWe are subject to laws and regulations in the United States and other jurisdictions concerning the sale, shipment and transmission of our products and technology outside the United States and to foreign nationals, including tariffs, trade protection measures, import or export licensing requirements, sanctions and other trade regulations. The Bureau of Industry and Security (“BIS”) of the U.S. Department of Commerce maintains and frequently adds entities to the “Entity List,” which limits our ability to deliver products and services to these entities, some of which are our customers. BIS has issued restrictions concerning advanced node IC production in China and other countries and extended controls to additional technologies, including electronic computer-aided design software specially designed for the development of advanced node ICs, and issued export controls related to the Chinese semiconductor manufacturing, advanced computing, and supercomputer industries. These restrictions and any subsequent restrictions may have an adverse effect on our business, results of operations or financial condition, either directly or by impacting our customers’ products, and restrict our ability to license or support our products to certain companies in China. Furthermore, increased restrictions on China exports may lead to regulatory retaliation by the Chinese government and possibly further escalate geopolitical tensions, and any such scenarios may adversely impact our business. The prospect of future export controls that are implemented in a similar manner may continue to have an ongoing impact on our business, results of operation, or financial conditions.\nTrade regulations limiting or banning sales into certain countries or to certain companies, including economic and financial sanctions and trade embargoes administered and enforced by the U.S. Department of the Treasury’s Office of Foreign Assets Control (“OFAC”), have impacted our ability to transact business in certain countries and with certain customers. Future trade regulations may also impact our ability to transact business with certain customers and in certain countries and may restrict certain non-U.S. person employees from performing their duties at Cadence without first obtaining appropriate authorization if their duties involve an export, reexport, or transfer of export-controlled technology. \n7\nTable of Contents\nAnti-corruption and anti-bribery\nWe are subject to laws and regulations in the United States and other jurisdictions concerning anti-corruption and anti-bribery, including the U.S. Foreign Corrupt Practices Act and the U.K. Bribery Act, which prohibit corrupt payments to governmental officials and bribes to other persons. \nData privacy and data protection \nWe are subject to laws and regulations in the United States and other jurisdictions governing data privacy and data protection, including the EU/UK General Data Protection Regulation, which regulate our collection, handling and use of personal information.\nThe laws and regulations to which we are subject are complex and may change or develop over time, sometimes with limited or no advance notice. Developments or other changes in laws or regulations or how they are interpreted or enforced have had, and may continue to have, a negative impact on our business and increase our compliance-related expenditures. \n Artificial intelligence\nThe regulatory framework governing the use of AI, machine learning and automated decision-making technologies (“AI Technologies”) is rapidly evolving. Many federal, state and foreign government bodies and agencies have introduced or are currently considering additional laws and regulations. \nAlready, certain existing legal regimes (e.g., relating to data privacy) regulate certain aspects of AI Technologies, and new laws regulating AI Technologies have been enacted in China, the United States and the European Union. In the United States, the Trump administration has rescinded an executive order relating to AI Technologies that was previously implemented by the Biden administration and may continue to rescind other existing federal orders and/or administrative policies relating to AI Technologies, or may implement new executive orders and/or other rule-making relating to AI Technologies in the future. U.S. legislation is also advancing at the state level. For example, the California Privacy Protection Agency is currently in the process of finalizing regulations under the California Consumer Privacy Act regarding the use of automated decision-making. The EU Artificial Intelligence Act (the “EU AI Act”) applies to companies that develop, use and/or provide AI in the EU and – depending on the AI use case - includes requirements around transparency, conformity assessments and monitoring, risk assessments, human oversight, security, accuracy, general purpose AI and foundation models, and fines for breach of up to 7% of worldwide annual turnover. Such additional regulations may impact our ability to develop, use and commercialize AI Technologies in the future.\nFor additional information regarding risks related to laws and regulations, including existing restrictions imposed by BIS, as well as international relations, see"
}