{
  "ticker": "CEG",
  "cik": "0001868275",
  "company_name": "Constellation Energy Corp",
  "filing_date": "2025-02-18",
  "accession": "0001868275-25-000023",
  "primary_doc": "ceg-20241231.htm",
  "item1_text": "ITEM 1. BUSINESS – Price and Supply Risk Management and ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK for additional information on the nuclear fuel cycle and procurement.\nDemand and Supply.\n  The market price for electricity is also affected by changes in the demand for electricity and the available supply of electricity. Unfavorable economic conditions, milder than normal weather, and the growth of energy efficiency and demand response programs can depress demand. In addition, in some markets, the supply of electricity can exceed demand during some hours of the day, resulting in loss of revenue for baseload generating plants such as our nuclear plants. \nRetail Competition.\n  Our retail operations compete for customers in a competitive environment, which affects the margins we can earn and the volumes we are able to serve. In periods of sustained low natural gas and power prices and low market volatility, retail competitors can aggressively pursue market share because the barriers to entry can be low and wholesale generators (including us) use their retail operations to hedge generation output.\nMarket Designs.  \nThe wholesale markets vary from region to region with distinct rules, practices and procedures. Changes in these market rules, problems with rule implementation, or failure of any of these markets could adversely affect our business. In addition, a significant decrease in market participation could affect market liquidity and have a detrimental effect on market stability. \nWe may be adversely affected by the effects of sustained inflation.\nThe existence of inflation in the economy has resulted in, or may result in, higher interest rates and capital costs, increased costs of labor, and other similar effects. If inflation rates rise or become elevated for a sustained period, they could have a material adverse effect on our business, financial condition, results of operations and liquidity. Although we may take measures to mitigate the impact of inflation, those measures may not be effective.\nWe are potentially affected by emerging technologies that could, over time, affect or transform the energy industry.\nAdvancements in both distributed and utility-scale power generation technology could impact market prices and demand size and behaviors. For instance, commercial and residential solar generation installations, energy storage improvements that include batteries and fuel cells, and other emerging technologies are improving the cost-effectiveness of customer self-supply of electricity. Improvements in energy efficiency of lighting, appliances, equipment and building materials will also affect energy consumption by customers. Advancements in nuclear technology, carbon capture sequestration, storage and advanced geothermal may contribute to a substantial increase in the supply of clean, reliable baseload power, impacting market prices. Carbon sequestration technology may also allow for gas generation to continue to be a viable source of clean electricity and provide for future growth of clean gas-powered generation.\nThese developments could affect the price of energy, levels of customer-owned generation, customer expectations and current business models and make portions of our generation facilities uneconomic prior to the end of their useful lives. These technologies could also result in further declines in commodity prices or demand for delivered energy. Each of these factors could affect our consolidated financial statements through, among other things, reduced operating revenues, increased operating and maintenance expenses, increased capital expenditures, and potential asset impairment charges or accelerated depreciation and decommissioning expenses over shortened remaining asset useful lives.\n28\nTable of Contents\nMarket performance and other factors could decrease the value of our NDT funds and employee benefit plan assets, which then could require significant additional funding.\nDisruptions in the capital markets and their actual or perceived effects on particular businesses and the broader economy could adversely affect the value of the investments held within our NDTs and employee benefit plan trusts. We have significant obligations in these areas and hold substantial assets in these trusts to meet those obligations. The asset values are subject to market fluctuations and will yield uncertain returns, which could fall below our projected return rates. A decline in the market value of the NDT fund investments could increase our funding requirements to decommission our nuclear plants. A decline in the market value of the pension and OPEB plan assets would increase the funding requirements associated with our pension and OPEB plan obligations. Additionally, our pension and OPEB plan liabilities are sensitive to changes in interest rates. As interest rates decrease, the liabilities increase, potentially increasing benefit costs and funding requirements. See Note 10 — Asset Retirement Obligations and Note 14 — Retirement Benefits of the Combined Notes to Consolidated Financial Statements for additional information.\nWe could be negatively affected by unstable capital and credit markets and increased volatility in commodity markets.\nWe rely on the capital markets, particularly for publicly offered debt, as well as the banking and commercial paper markets, to meet our financial commitments and short-term liquidity needs. Disruptions in the capital and credit markets in the United States or abroad could negatively affect our ability to access the capital markets or draw on our bank revolving credit facilities. The banks may not be able to meet their funding commitments to us if they experience shortages of capital and liquidity or if they experience excessive volumes of borrowing requests within a short period of time. The inability to access capital markets or credit facilities, and longer-term disruptions in the capital and credit markets as a result of uncertainty, changing or increased regulation, reduced alternatives or failures of significant financial institutions could result in the deferral of discretionary capital expenditures, affect our ability to effectively hedge our generation portfolio, require changes to our hedging strategy in order to reduce collateral posting requirements, or require a reduction in discretionary uses of cash. In addition, we have exposure to worldwide financial markets, including Europe, Canada, and Asia. Disruptions in these markets could reduce or restrict our ability to secure sufficient liquidity or secure liquidity at reasonable terms. As of December 31, 2024, approximately 35%, 11%, and 20% of our available credit facilities were with European, Canadian, and Asian banks, respectively.\nThe strength and depth of competition in energy markets depend heavily on active participation by multiple trading parties, which could be negatively affected by disruptions in the capital and credit markets and legislative and regulatory initiatives that could affect participants in commodities transactions. Reduced capital and liquidity and failures of significant institutions that participate in the energy markets could diminish the liquidity and competitiveness of energy markets that are important to our business. Perceived weaknesses in the competitive strength of the energy markets could lead to pressures for greater regulation of those markets or attempts to replace market structures with other mechanisms for the sale of power, including the requirement of long-term contracts.\nIf we were to experience a downgrade in our credit ratings to below investment grade or otherwise fail to satisfy the credit standards in our agreements with our counterparties or regulatory financial requirements, we would be required to provide significant amounts of collateral that could affect our liquidity and we could experience higher borrowing costs.\nOur business is subject to credit quality standards that could require market participants to post collateral for their obligations upon a decline in ratings. We are also subject to certain financial requirements under NRC regulations as a result of our operation of nuclear power plants that could require us to provide cash collateral or surety bonds if those requirements are not met. One or both events could adversely affect available liquidity and, in the case of a rating downgrade, borrowing and credit support costs.\nSee ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS – Liquidity and Capital Resources – Credit Matters and Cash Requirements – Security Ratings and Note 15 — Derivative Financial Instruments of the Combined Notes to Consolidated Financial Statements for additional information regarding the potential impacts of credit downgrades on our cash flows.\n29\nTable of Contents\nIf we fail to meet project-specific financing agreement requirements, we could experience an impairment or loss of the financed project.\nWe have project-specific financing arrangements and must meet the requirements of various agreements relating to those financings. Failure to meet those arrangements could give rise to a project-specific financing default which, if not cured or waived, could result in the specific project being required to repay the associated debt or other borrowings earlier than otherwise anticipated, and if such repayment were not made, the lenders or security holders would generally have broad remedies, including rights to foreclose against the project assets and related collateral or to force our subsidiaries in the project-specific financings to enter bankruptcy proceedings. The impact of bankruptcy could result in the impairment of certain project assets. See Note 16 — Debt and Credit Agreements of the Combined Notes to Consolidated Financial Statements for additional information.\nOur risk management policies cannot fully eliminate the risk associated with our commodity trading activities.\nOur asset-based power position as well as our power marketing, fuel procurement and other commodity trading activities expose us to risks of commodity price movements. We buy and sell energy and other products and enter financial contracts to manage risk and hedge various positions in our portfolio. We are exposed to volatility in financial results for unhedged positions as well as the risk of ineffective hedges. We attempt to manage this exposure through enforcement of established risk limits and risk management procedures. These risk limits and risk management procedures may not work as planned and cannot eliminate all risks associated with these activities. Even when our policies and procedures are followed, and decisions are made based on projections and estimates of future performance, results of operations could be diminished if the judgments and assumptions underlying those decisions prove to be incorrect. Factors, such as future prices and demand for power, natural gas and other energy-related commodities, become more difficult to predict and the calculations become less reliable the further into the future estimates are made. As a result, we cannot predict the impact that our commodity trading activities and risk management decisions could have on our consolidated financial statements.\nFinancial performance and load requirements could be negatively affected if we are unable to effectively manage our power portfolio.\nA significant portion of our power portfolio is used to provide power under procurement contracts with load serving entities and other customers. To the extent portions of the power portfolio are not needed for that purpose, our output is sold in the wholesale power markets. To the extent our power portfolio is not sufficient to meet the requirements of our customers under the related agreements, we must purchase power in the wholesale power markets. Our financial results could be negatively affected if we are unable to cost-effectively meet the load requirements of our customers, manage our power portfolio or effectively address the changes in the wholesale power markets. \nThe impacts of significant economic downturns (i.e., recession) could lead to decreased volumes delivered and increased expense for uncollectible customer balances.\nThe impacts of significant economic downturns on our retail customers, such as less demand for the products and services provided by our C&I customers, could result in an increase in the number of uncollectible customer balances and related expense.\nSee ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK and Note 15 — Derivative Financial Instruments of the Combined Notes to Consolidated Financial Statements for additional information on our credit risk.\nWe could be negatively affected by the impacts of weather.\nOur operations are affected by weather, which impacts demand for electricity and natural gas, the price of energy commodities, as well as operating conditions. To the extent that weather is warmer in the summer or colder in the winter than assumed, we could require greater resources to meet our contractual commitments. Extreme weather conditions or storms could affect the availability of generation and the transmission of electricity, limiting our ability to source electricity or transmit it to our customers. It could also impair our ability to transport natural \n30\nTable of Contents\ngas to our generating assets and our ability to supply natural gas to our customers. In addition, drought-like conditions limiting water usage could impact our ability to run certain generating assets at full capacity. These conditions, which cannot be accurately predicted, could cause us to seek additional replacement supply at a time when supply is constrained.\nWeather projections suggest increases to summer temperature and humidity trends, as well as more erratic precipitation and storm patterns over the long term in the areas where we have generation assets. The frequency in which weather conditions emerge outside the current expected climate norms could contribute to the weather-related impacts discussed above.\nLong-lived assets, goodwill, and other assets could become impaired.\nLong-lived assets – principally, generation assets – represent the single largest asset class on our Consolidated Balance Sheets. In addition, we have a material goodwill balance as of December 31, 2024. \nWe evaluate the recoverability of the carrying value of long-lived assets to be held and used whenever events or circumstances indicating a potential impairment may exist. Factors such as, but not limited to, the business climate, including current and future energy and market conditions, environmental regulation, and the condition of assets are considered. We assess goodwill for impairment at least annually or more frequently if an event occurs or circumstances change that would more likely than not reduce the fair value of the reporting units below their carrying amount. Changes in significant assumptions, including discount rates, energy prices, projected operating costs, and cash flows could potentially result in future impairments of goodwill.\nAn impairment would require us to reduce the carrying value of the long-lived asset and goodwill to fair value through a non-cash charge to expense by the amount of the impairment. See ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS – Critical Accounting Policies and Estimates, Note 1 — Basis of Presentation, Note 8 — Property, Plant, and Equipment, and Note 12 — Intangible Assets of the Combined Notes to Consolidated Financial Statements for additional information on long-lived asset impairments.\nWe could incur substantial costs in the event of non-performance by third parties under indemnification agreements. We are exposed to other credit risks in the power markets that are beyond our control.\nWe have entered into various agreements with counterparties that require those counterparties to reimburse us and hold us harmless against specified obligations and claims. To the extent that any of these counterparties are affected by deterioration in their creditworthiness or the agreements are otherwise determined to be unenforceable, we could be held responsible for the obligations.\nWe have issued indemnities to third parties regarding environmental or other matters in connection with purchases and sales of assets, including several of the Exelon utilities in connection with our absorption of their former generating assets. We could incur substantial costs to fulfill our obligations under these indemnities.\nIn the bilateral markets, we are exposed to the risk that counterparties that owe us money or are obligated to purchase energy or fuel from us will not perform under their obligations for operational or financial reasons. In the event the counterparties to these arrangements fail to perform, we could be forced to purchase or sell energy or fuel in the wholesale markets at less favorable prices and incur additional losses, to the extent amounts, if any, were already paid to the counterparties. In the spot markets, we are exposed to risk as a result of default sharing mechanisms that exist within certain markets, primarily RTOs and ISOs. We are also a party to agreements with entities in the energy sector that have experienced rating downgrades or other financial difficulties. In addition, our retail sales subject us to credit risk through competitive electricity and natural gas supply activities to serve C&I companies, governmental entities, and residential customers. Retail credit risk results when customers default on their contractual obligations. This risk represents the loss that could be incurred due to the nonpayment of a customer’s account balance, as well as the loss from the resale of energy previously committed to serve the customer. \n31\nTable of Contents\nRisks Related to Legislative, Regulatory, and Legal Factors\nFederal or state legislative or regulatory actions could negatively affect the scope and functioning of the wholesale markets.\nApproximately 70% of our generating resources, which include directly owned assets and capacity obtained through long-term contracts, are in the area encompassed by PJM. Our future results of operations are impacted by (1) FERC’s and PJM's level of support for policies that favor the preservation of competitive wholesale power markets, recognize the value of emissions-free electricity and resiliency, complement states' energy objectives and policies and (2) the absence of material changes to market structures that would limit or otherwise negatively affect us. Market rules in other regions could affect us in a similar fashion. We could also be affected by state laws, regulations or initiatives to subsidize existing or new generation.\nFERC’s requirements for market-based rate authority could pose a risk that we may no longer satisfy FERC’s tests for market-based rates. A loss of market-based rate authority would mean that we would sell power at cost-based rates.\nOur business is highly regulated and could be negatively affected by legislative and/or regulatory actions.\nSubstantial aspects of our business are subject to comprehensive federal or state legislation and/or regulation.\nOur consolidated financial statements are significantly affected by our sales and purchases of commodities at market-based rates, as opposed to cost-based or other similarly regulated rates, and federal and state regulatory and legislative developments related to emissions, climate change, capacity market mitigation, energy price information, resilience, fuel diversity, and RPS. Federal or state legislative and regulatory efforts to preserve the environmental attributes and reliability benefits of zero-emission nuclear-powered generating facilities could be subject to legal and regulatory challenges and, if overturned, could result in the early retirement of certain of our nuclear plants. The PTC benefiting existing nuclear plants included in the IRA (starting January 1, 2024) continues to be the subject of additional guidance issued from the U.S. Treasury and IRS, which may negatively impact the amount of benefits we ultimately receive. In addition, the duration of the PTC program, the value of the PTC, and/or the existence of the PTC could be affected by legislative action and may have significant adverse effects on our financial performance depending on the future gross receipts received by our nuclear units.\nFundamental changes in regulations or other adverse legislative actions affecting our business would require changes in our business planning models and operations. We cannot predict when or whether legislative and regulatory proposals could become law or what their effect would be. See Note 3 — Regulatory Matters of the Combined Notes to Consolidated Financial Statements for additional information on the nuclear PTC.\nNRC actions could negatively affect the operations and profitability of our nuclear generating fleet.\nRegulatory Risk.\n A change in the Atomic Energy Act or the applicable regulations or licenses could require a substantial increase in capital expenditures or could result in increased operating or decommissioning costs. Events at nuclear plants owned by others, as well as those owned by us, could cause the NRC to initiate such actions.\nSpent Nuclear Fuel Storage. \nOur nuclear operations produce various types of nuclear waste materials, including SNF.\n \nThe approval of a national repository for the storage of SNF and the timing of that facility opening will significantly affect the costs associated with storage of SNF and the ultimate amounts received from the DOE to reimburse us for these costs.\nAny regulatory action relating to the timing and availability of a repository for SNF could adversely affect our ability to decommission fully our nuclear units. We cannot predict whether a fee may be established or to what extent, in the future for SNF disposal. See Note 18 — Commitments and Contingencies of the Combined Notes to Consolidated Financial Statements for additional information.\n32\nTable of Contents\nWe could be subject to higher costs and/or penalties related to mandatory reliability standards.\nWe, as a user of the bulk power transmission system, are subject to mandatory reliability standards promulgated by NERC and enforced by FERC. The standards are based on the functions that need to be performed to ensure the bulk power system operates reliably and are guided by reliability and market interface principles. Compliance with or changes in the reliability standards could subject us to higher operating costs and/or increased capital expenditures. If we were found in non-compliance with the federal and state mandatory reliability standards, we could be subject to remediation costs as well as sanctions, which could include substantial monetary penalties.\nWe could incur substantial costs to fulfill our obligations related to environmental and other matters.\nWe are subject to extensive environmental regulation and legislation by local, state and federal authorities. These laws and regulations affect the way we conduct our operations and make capital expenditures, including how we handle air and water emissions, hazardous and solid waste, and activities affecting surface waters, groundwater, and aquatic and other species. Violations of these requirements could subject us to enforcement actions, capital expenditures to bring existing facilities into compliance, additional operating costs for remediation and clean-up costs, civil penalties and exposure to third parties’ claims for alleged health or property damages or operating restrictions to achieve compliance. In addition, we are subject to liability under these laws for the remediation costs for environmental contamination of property now or formerly owned by us and of property contaminated by hazardous substances we generated or released. Also, we are currently involved in several proceedings relating to sites where hazardous substances have been deposited and could be subject to additional proceedings in the future. See ITEM 1. BUSINESS – Environmental Matters and Regulation and Note 18 — Commitments and Contingencies of the Combined Notes to Consolidated Financial Statements for additional information.\nWe could be negatively affected by federal and state RPS and/or energy conservation legislation, along with energy conservation by customers.\nChanges to current state legislation or the development of federal legislation that requires the use of clean, renewable and alternate fuel sources could significantly impact us. The impact could include reduced use of some of our generating facilities with effects on our operating revenues and costs.\nFederal and state legislation mandating the implementation of energy conservation programs and new energy consumption technologies could cause declines in customer energy consumption and lead to a decline in our operating revenues. See ITEM 1. BUSINESS – Environmental Matters and Regulation – Renewable and Clean Energy Standards and “We are potentially affected by emerging technologies that could over time affect or transform the energy industry” above for additional information.\nOur financial performance could be negatively affected by risks arising from our ownership and operation of hydroelectric facilities.\nFERC has the exclusive authority to license most non-federal hydropower projects located on navigable waterways, federal lands, or connected to the interstate electric grid. If FERC does not issue new operating licenses for our hydroelectric facilities in the future or a station cannot be operated through the end of its current operating license, our results of operations could be adversely affected by increased depreciation rates and accelerated future decommissioning costs, since depreciation rates and decommissioning cost estimates are currently based on the available license term for each facility. We could also lose operating revenues and incur increased purchased power and fuel expense to meet our supply commitments. In addition, conditions could be imposed as part of the license renewal process that could adversely affect operations, require a substantial increase in capital expenditures, result in increased operating costs or render the project uneconomic. Similar effects could result from a change in the Federal Power Act or the applicable regulations due to events at hydroelectric facilities owned by others, as well as those owned by us. See Note 3 — Regulatory Matters of the Combined Notes to Consolidated Financial Statements for additional information regarding the license renewal for the Conowingo hydroelectric project.\n33\nTable of Contents\nWe could be negatively affected by challenges to tax positions taken, tax law changes and the inherent difficulty in quantifying potential tax effects of business decisions.\nWe are required to make judgments in order to estimate our obligations to taxing authorities. These tax obligations include income, real estate, sales and use, and employment-related taxes and ongoing appeal issues related to these tax matters. These judgments include reserves established for potential adverse outcomes regarding tax positions that have been taken that could be subject to challenge by the tax authorities. See Note 1 — Basis of Presentation and Note 13 — Income Taxes of the Combined Notes to Consolidated Financial Statements for additional information.\nLegal proceedings could result in a negative outcome, which we cannot predict.\nWe are involved in legal proceedings, claims, and litigation arising from our business operations. Our material legal proceedings, claims, and litigation are summarized in Note 3 — Regulatory Matters and Note 18 — Commitments and Contingencies of the Combined Notes to Consolidated Financial Statements. Adverse outcomes in these proceedings could require significant expenditures, result in loss of revenue, or restrict existing business activities.\nWe could be subject to adverse publicity and reputational risks, which make us vulnerable to negative customer perception and could lead to increased regulatory oversight or other consequences.\nWe could be the subject of public criticism. Adverse publicity of this nature could render public service commissions and other regulatory and legislative authorities less likely to view energy companies in a favorable light, and could cause those companies, including us, to be susceptible to less favorable legislative and regulatory outcomes, as well as increased regulatory oversight and more stringent legislative or regulatory requirements.\nRisks Related to Operational Factors\nWe are subject to risks associated with climate change.\nClimate adaptation risk refers to risks to our facilities or operations that may result from changes in the physical climate, such as changes to temperatures, weather patterns and sea level rise. \nWe periodically perform analyses to better understand how climate change could affect our facilities and operations. We primarily operate in the Midwest, Mid-Atlantic, Northeast, and Texas areas that have historically been prone to various types of severe weather events. As such, we have well-developed response and recovery programs based on historical weather events and patterns. However, our physical facilities could be placed at greater risk of damage should changes in the global climate impact temperature and weather patterns, and result in more intense, frequent and extreme weather events, unprecedented levels of precipitation, sea level rise, increased surface water temperatures, and/or other effects. Over time, we may need to make additional investments to protect our facilities from physical climate-related risks.\nIn addition, changes to the climate may impact levels and patterns of demand for energy and related services, which could affect our operations. Over time, we may need to make additional investments to adapt to changes in operational requirements as a result of climate change.\nClimate mitigation and transition risks include changes to the energy systems as a result of new technologies, changing customer expectations and/or voluntary GHG goals, as well as local, state or federal regulatory requirements intended to reduce GHG emissions. \nWe also periodically perform analyses of potential pathways to reduce power sector and economy-wide GHG emissions to mitigate climate change. To the extent additional GHG reduction regulation or legislation becomes effective at the federal and/or state levels, we could incur costs to further limit the GHG emissions from our operations or otherwise comply with applicable requirements. To the extent such additional regulation or legislation does not become effective, the potential competitive advantage offered by our low-carbon emission profile may be reduced. \n34\nTable of Contents\nSee ITEM 1. BUSINESS – Environmental Matters and Regulation – Climate for additional information.\nOur financial performance could be negatively affected by matters arising from our ownership and operation of nuclear facilities.\nNuclear capacity factors.\n  Capacity factors for nuclear generating units significantly affect our results of operations. Lower capacity factors could decrease our revenues and increase operating costs by requiring us to produce additional energy from our natural gas and oil-fueled facilities or purchase additional energy in the spot or forward markets in order to satisfy our supply obligations to committed third-party sales. These sources generally have higher costs than we incur to produce energy from our nuclear stations.\nNuclear refueling outages.\n  In general, refueling outages are planned to occur once every 18 to 24 months. The total number of refueling outages, along with their duration, could have a significant impact on our results of operations. When refueling outages last longer than anticipated or we experience unplanned outages, capacity factors decrease, and we face lower margins due to higher energy replacement costs and/or lower energy sales and higher operating and maintenance costs.\nNuclear fuel quality.  \nThe quality of nuclear fuel utilized by us could affect the efficiency and costs of our operations. Remediation actions could result in increased costs due to accelerated fuel amortization, increased outage costs and/or increased costs due to decreased generation capabilities.\nOperational risk.  \nOperations at any of our nuclear generation plants could degrade to the point where we must shut down the plant or operate at less than full capacity. If this were to happen, identifying and correcting the causes could require significant time and expense. We could choose to close a plant rather than incur the expense of restarting it or returning the plant to full capacity. In either event, we could lose revenue and incur increased purchased power costs and fuel expense to meet supply commitments.\nIf we are required to arrange for the safe and permanent disposal of SNF beyond current expectations, this could lead to substantial expense or capital expenditures. See \"NRC actions could negatively affect the operations and profitability of our nuclear generating fleet\" above for additional information on the storage of SNF. \nFor plants operated but not wholly owned by us, we could also incur liability to our co-owners. For nuclear plants not operated and not wholly owned by us, from which we receive a portion of the plants’ output, our results of operations are dependent on the operational performance of the operators and could be adversely affected by a significant event at those plants. We do not procure the fuel for the sites we do not operate. The operator's nuclear fuel procurement plan could impact our results of operations. Additionally, poor operating performance at nuclear plants not owned by us could result in increased regulation and reduced public support for nuclear-fueled energy. Closure of generating plants owned by others, or extended interruptions of generating plants or failure of transmission lines, could adversely affect transmission systems and the sale and delivery of electricity in markets served by us.\nNuclear major incident risk and insurance.  \nThe consequences of a major incident could be severe and include loss of life and property damage. Any resulting liability from a nuclear plant major incident within the United States, owned or operated by us or owned by others, could exceed our resources, including insurance coverage. We are a member of an industry mutual insurance company, NEIL, which provides property and accidental outage insurance for our nuclear operations. Uninsured losses and other expenses, to the extent not recovered from insurers or the nuclear industry, could be borne by us. Additionally, an accident or other significant event at a nuclear plant within the United States or abroad, whether owned by us or others, could result in increased regulation and reduced public support for nuclear-fueled energy.\nAs required by the Price-Anderson Act, we carry the maximum available amount of nuclear liability insurance, $500 million for each operating site. Claims exceeding that amount are covered through mandatory participation in a financial protection pool. In addition, the U.S. Congress could impose revenue-raising measures on the nuclear industry to pay claims exceeding the $16.3 billion limit for a single incident.\nSee Note 18 — Commitments and Contingencies of the Combined Notes to Consolidated Financial Statements for additional information of nuclear insurance.\n35\nTable of Contents\nDecommissioning obligation and funding.  \nNRC regulations require that licensees of nuclear generating facilities demonstrate reasonable assurance that funds will be available in certain minimum amounts at the end of the life of the facility to decommission the facility.\nActual costs to decommission our nuclear facilities may substantially exceed our estimates as a result of changes in the approach and timing of decommissioning activities, changes in decommissioning costs, changes in federal or state regulatory requirements, other changes in our estimates or our ability to effectively execute on planned decommissioning activities.\nWe have recourse to collect additional amounts from utility customers through PECO (subject to certain limitations and thresholds) for former PECO units and through CenterPoint and AEP Texas for STP units. If circumstances changed such that there was an inability to continue to make contributions to the trust funds of the former PECO or STP units based on amounts collected from utility customers, or if we no longer had recourse to collect additional amounts from the respective utility customers if there was a shortfall of funds for decommissioning, the adequacy of the trust funds related to these units could be negatively affected. Any changes to the utilities' regulatory agreements could impact our ability to offset decommissioning-related activities for these units within the Consolidated Statements of Operations and Comprehensive Income, and the impact to our consolidated financial statements could be material.\nShould the expected value of the NDT fund for any former ComEd unit fall below the amount of the expected decommissioning obligation for that unit, the accounting to offset decommissioning-related activities for that unit may be temporarily suspended or discontinued, and the decommissioning-related activities would be recognized in the Consolidated Statements of Operations and Comprehensive Income, the impact of which could be material. \nForecasting trust fund investment earnings and costs to decommission nuclear generating stations requires significant judgment, and actual results could differ significantly from current estimates. If the investments held by our NDT funds are not sufficient to fund the decommissioning of our nuclear units, we could be required to take steps, such as providing financial guarantees through letters of credit or parent company guarantees or making additional contributions to the trusts, which could be significant, to ensure that the trusts are adequately funded and that current and future NRC minimum funding requirements are met.\nSee Note 10 — Asset Retirement Obligations of the Combined Notes to Consolidated Financial Statements for additional information.\nWe are subject to evolving physical security, cybersecurity, and third-party reliability risks.\nThreat actors continue to seek to exploit potential vulnerabilities in the energy sector associated with protection of sensitive and confidential information, grid infrastructure, and other energy infrastructures. These attacks and disruptions, both physical and cyber, are becoming increasingly sophisticated and dynamic. Security incidents such as ransomware attacks are becoming increasingly prevalent and severe, as well as increasingly difficult to detect. In addition, geopolitical issues, to include conflicts in the Ukraine and the Middle East, as well as tensions between the U.S. and China, may motivate cyber-attacks which could impact the U.S. energy sector and our Company via supply chain disruptions or direct targeting.\nA security breach, including, but not limited to, physical or electronic intrusions, computer viruses, malware, attacks by cyber criminals or nation state threat actors, ransomware attacks, phishing attacks, supply chain attacks, third-party breaches, and other similar breaches of our physical assets or information systems, or those of our competitors, vendors, business partners and interconnected entities in RTOs, ISOs, and other energy markets, or regulators have the potential to disrupt our business and result in harm to the Company. Security   breaches can also occur as a result of non-technical issues, including intentional or inadvertent actions by our employees, third-party service providers or their personnel or other parties. Our customers depend on the continuous availability of our commercial and generation operations. A failure, interruption, or breach of our operational or information security systems, or those of our third-party service providers, as a result of cyber-attacks or information security breaches could disrupt our business, result in the disclosure or misuse of confidential or proprietary information, damage our reputation, cause loss of customers or revenue, increase our costs, result in litigation and/or regulatory action, and/or cause other losses, any of which might have a materially adverse impact on our business operations and our financial position or results of operations. Operational harm could be in the form of impact to the generation fleet, our commercial operations, and/or reliability of the bulk \n36\nTable of Contents\nelectric system. Impacts to confidential or proprietary information could include inappropriate release of certain types of information, including critical infrastructure, sensitive customer, vendor and employee, trading, export control or other confidential information. If a significant security breach were to occur, our reputation could be negatively affected, customer confidence in us or others in the industry could be diminished, or we could be subject to legal claims, loss of revenues, increased costs, regulatory penalties, or operational shutdown.\nWe currently utilize a mix of third-party managed service providers to host and support our information technology, customer support, and generation operations. As an example, our data centers are hosted in vendor-managed co-location facilities. Consequently, we may be subject to short- and long-term interruptions, delays and outages in service and availability due to third-party cybersecurity or reliability incidents that are outside of our direct control. We expect that in the future we may experience interruptions, delays and outages in service and availability from time to time due to a variety of factors, including infrastructure changes, human or software errors, website hosting disruptions and capacity constraints. Coordinated physical and or cyber-attacks that disrupt multiple key electric assets of unaffiliated parties responsible for real-time planning and management of the bulk electric system could impact our ability to provide generation, potentially resulting in localized and regional blackouts affecting third parties and the public, many of which will have no direct commercial relationship with the Company.\nWe cannot anticipate, detect, repel, or implement fully effective preventative measures against all cyber threats, particularly because the techniques used are constantly evolving. Similarly, we cannot guarantee uninterrupted availability of third-party managed systems that may be affected by factors unrelated to cybersecurity incidents. Continued implementation of advanced digital technologies increases the potentially unfavorable impacts of such attacks and reliability, and may introduce new vulnerabilities and threat tactics. For example, threat actors could use Artificial Intelligence (AI) to develop malicious code and sophisticated phishing attempts. As threats continue to evolve, we may be required to expend additional resources to continue to enhance our information security measures and/or to investigate and remediate information security vulnerabilities. While we have not experienced a material breach or disruption to our network or information systems or our operations to date, future attacks or reliability may negatively impact our business, reputation, or financial results.\nAlthough we maintain insurance coverage for cyber events, the amount and scope of insurance maintained against losses resulting from a significant event or security breach may not be sufficient to cover losses or otherwise adequately compensate for any business disruptions that could result. There can be no assurance that such insurance will be available on commercially reasonable terms in the future. In addition, new or updated security regulations or new vulnerabilities identified by security researchers, third-party suppliers, or threat actors could require changes in current measures taken by security or our business operations and could adversely affect our consolidated financial statements.\nWe are continuously evolving our cybersecurity strategy and technical controls to prepare for, identify, protect, detect, respond, and recover our technology systems, information and operations from such attacks. See ITEM 1C. CYBERSECURITY for more information.\nOur employees, contractors, customers and the general public could be exposed to a risk of injury due to the nature of the energy industry.\nEmployees and contractors throughout the organization work in, and the general public could be exposed to, potentially dangerous environments near our operations. As a result, employees, contractors and the general public are at some risk for serious injury, including loss of life. These risks include, but are not limited to, nuclear accidents, dam failure, gas explosions, and electric contact cases.\nNatural disasters, war, acts and threats of terrorism, pandemic and other significant events could negatively impact our results of operations, ability to raise capital, and future growth.\nOur fleet of power plants and the transmission infrastructure to which they are connected could be affected by natural disasters and extreme weather events, which could result in increased costs, including supply chain costs. Natural disasters and other significant events increase our risk that the NRC or other regulatory or legislative bodies could change the laws or regulations governing, among other things, operations, maintenance, operating licenses, decommissioning, SNF storage, insurance, emergency planning, security and environmental and radiological matters. In addition, natural disasters could affect the availability of a secure and economical supply of water in some locations, which is essential for our continued operation, particularly the cooling of \n37\nTable of Contents\ngenerating units. Also, the ability of energy transmission and distribution companies to maintain the reliability, resiliency and safety of their energy delivery systems could affect our ability to deliver energy to our customers and affect our operating costs.\nThe impact that potential terrorist attacks could have on the industry and on us is uncertain. We face a risk that our operations would be direct targets or indirect casualties of an act of terror. Any retaliatory military strikes or sustained military campaign could affect our operations in unpredictable ways, such as changes in insurance markets and disruptions of fuel supplies and markets, particularly uranium and oil. Furthermore, these catastrophic events could compromise the physical or cybersecurity of our facilities, which could adversely affect our ability to manage our business effectively. Instability in the financial markets as a result of terrorism, war, natural disasters, pandemic, credit crises, recession or other factors also could result in a decline in energy consumption or interruption of fuel or the supply chain. In addition, the implementation of security guidelines and measures has resulted in and is expected to continue to result in increased costs.\nWe could be significantly affected by the outbreak of a pandemic. We have plans in place to respond to a pandemic. However, depending on the severity of a pandemic and the resulting impacts to workforce and other resource availability, the ability to operate our generating assets could be adversely affected.\nIn addition, we maintain a level of insurance coverage consistent with industry practices against property, casualty, and cybersecurity losses subject to unforeseen occurrences or catastrophic events that could damage or destroy assets or interrupt operations. However, there can be no assurance that the amount of insurance will be adequate to address such property and casualty losses.\nOur business is capital intensive, and our assets could require significant expenditures to maintain and are subject to operational failure, which could result in potential liability.\nOur business is capital intensive and requires significant investments in electric generating facilities. Equipment, even if maintained in accordance with good industry practices, is subject to operational failure, including events that are beyond our control, and could require significant expenditures to remedy. Our consolidated financial statements could be negatively affected if we were unable to effectively manage our capital projects or raise the necessary capital. See ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS – Liquidity and Capital Resources for additional information regarding our potential future capital expenditures.\nOur performance could be negatively affected if we fail to attract and retain an appropriately qualified workforce.\nCertain events, such as an employee strike, loss of employees, loss of contract resources due to a major event, and an aging workforce without appropriate replacements, could lead to operating challenges and increased costs for us. The challenges include lack of resources, loss of knowledge, and a lengthy time period associated with skill development. In this case, costs, including costs for contractors to replace employees, productivity costs and safety costs, could arise. We are particularly affected due to the specialized knowledge required of the technical and support employees for generation operations. In 2024 we announced the planned restart of our Crane nuclear generation facility which will require hiring skilled employees to restart and operate the plant. Our ability to source qualified employees will impact the timing and cost of the restart. If we are unable to source the necessary workforce it could result in unfavorable financial results and/or a delay to Crane's restart.\nWe could make acquisitions or investments in new business initiatives and new markets, which may not be successful or achieve the intended financial results.\nWe could continue to pursue growth in our existing businesses and markets and further diversification across the competitive energy value chain. This could include opportunistic carbon-free energy acquisitions, creating new value from our existing fleet through nuclear uprates, renewable repowerings, co-location of customer load, growing sustainability solutions for our customers, and investment opportunities in other emerging technologies and innovation. Such initiatives could involve significant risks and uncertainties, including distraction of management from current operations, inadequate return on capital, and unidentified issues not discovered during diligence performed prior to launching an initiative or entering a market. Additionally, it is possible that FERC, state public utility commissions, or others could impose certain other restrictions on such transactions. All these \n38\nTable of Contents\nfactors could result in higher costs or lower revenues than expected, resulting in lower than planned returns on investment.\nWe are actively pursuing the restart of our Crane nuclear generation facility. The restart is estimated to cost $1.6 billion and is subject to certain regulatory approvals, including the NRC comprehensive safety and environmental review, as well as permits from relevant state and local agencies. Additionally, through separate requests, we will pursue obtaining a renewed license to operate the plant and a FERC interconnection agreement. Failure to obtain the necessary approvals could result in the impairment of amounts capitalized. The restart is a complex undertaking including procuring or restoring specialized components on a critical timeline. Failure to meet contractual timelines could result in significant penalties. Overages in costs or unforeseen issues could result in lower than planned returns on the investment. \nRisks Related to the Proposed Acquisition of Calpine \n \nWe may encounter difficulties in satisfying the conditions for the completion of the Merger Agreement, including obtaining the necessary regulatory approvals, within the expected time frame or at all. Such challenges could delay the completion of the merger or impose conditions that could cause abandonment of the Merger Agreement.\nConsummation of the merger is subject to the satisfaction or waiver of specified closing conditions, including: (1) the receipt of regulatory approvals required to consummate the Merger Agreement; (2) the expiration or termination of the applicable waiting period under the HSR Act; and (3) other customary closing conditions. \nCompletion of the merger is conditioned upon the receipt of consents, orders, approvals or clearances, to the extent required, from various regulatory authorities, including DOJ, FERC, and public utility commissions or similar entities in certain states in which the companies operate. We cannot provide assurance that all required regulatory approvals will be obtained or that these approvals will not contain terms, conditions or restrictions that would be unacceptable and, accordingly, the merger may be delayed or may not be consummated. In connection with the required regulatory approvals and to prevent market power concerns, we are expecting to sell certain of the combined company’s PJM natural-gas-fired generating assets following the closing of the merger. The Merger Agreement generally permits us to terminate the Merger Agreement if the final terms of any of the required regulatory consents or approvals include any Burdensome Condition (as defined in the Merger Agreement).\nIn addition, the Merger Agreement provides that either we or Calpine could terminate the Merger Agreement if the merger is not completed by December 31, 2025 (which date may be automatically extended to June 1, 2026, as further provided in the Merger Agreement). If the Merger Agreement is terminated under certain circumstances due to the failure to obtain regulatory approvals, the failure to obtain regulatory approvals without Burdensome Conditions, or the breach by us of our obligations in respect of obtaining regulatory approvals, we would be required to pay Calpine a termination fee of $500 million as liquidated damages. \nFurther, the share price of our common stock may decline to the extent that the current market price reflects an assumption by the market that the merger will be completed. See Note 2 — Mergers, Acquisitions, and Dispositions of the Combined Notes to Consolidated Financial Statements for additional information regarding the status of the transaction.\nWe cannot assure that we will continue paying dividends at the current rate.\nWe currently expect to pay dividends in an amount consistent with the dividend policy in effect prior to the completion of the merger. However, there is no assurance that our shareholders will receive the same dividends following the merger for reasons that may include capital spending plans, financing agreements, cash flow or financial position. Decisions on whether, when, and in which amounts to make any future distributions will remain at all times entirely at the discretion of our Board of Directors, which reserves the right to change our dividend practices at any time and for any reason.\nOur current shareholders will have a reduced ownership and voting power after the merger.\nWe will issue or reserve for issuance 50 million newly issued shares of common stock to Calpine stockholders as noted in the Merger Agreement (including shares of our common stock issuable pursuant to Calpine restricted \n39\nTable of Contents\nstock units and other equity-based awards). Based on the number of shares of our common stock as of the transaction announcement date, our current shareholders and former Calpine stockholders would own approximately 85% and 15% of the outstanding shares of Constellation common stock, respectively, immediately following the consummation of the merger. Each current shareholder will remain a shareholder of Constellation with a percentage ownership of the combined company that will be smaller than the shareholder’s percentage of Constellation prior to the merger. As a result of this reduced ownership percentage, our current shareholders will have less influence on the policies of the combined company than they did prior to the transaction.\nThe merger may not be accretive to earnings and may cause dilution to our earnings per share, which may negatively affect the market price of our common stock.\nWe currently anticipate that the merger will be accretive to earnings per share in 2026, which is expected to be the first full year following completion of the merger. This expectation is based on preliminary estimates that are subject to change. We may also encounter additional transaction and integration-related costs, may fail to realize all the benefits anticipated in the merger, or be subject to other factors that affect preliminary estimates. Any of these factors could negatively impact our operating results or decrease or delay the expected accretive effect of the merger and contribute to a decrease in the price of our common stock.\nWe have incurred and will incur significant transaction and merger-related costs, and these costs may be more than anticipated, negatively impacting our operating results.\nWe have incurred and expect to incur non-recurring costs associated with consummation of the transaction. Most of these costs will be transaction costs, including fees paid to financial and legal advisors related to the merger and related financing arrangements, and employment-related costs, including change-in-control related payments made to certain Calpine executives. We will also incur transition costs related to formulating integration plans. We may incur additional unanticipated costs in the integration of the businesses, which could negatively impact our operating results. We expect that the elimination of costs, as well as the realization of other efficiencies related to the integration of the businesses, will exceed incremental transaction and merger-related costs over time.\nWe may not realize all the expected benefits of the merger because of integration challenges.  \nThe success of the merger will depend, in part, on our ability to realize all or some of the anticipated benefits from integrating Calpine’s business with our existing businesses. The integration process will be complex, costly and time-consuming. The challenges associated with integrating the operations of Calpine’s business include, among others:\n•\ncustomer retention risk as well as the inability to finalize certain transactions currently in progress between Calpine and its customers;\n•\ndelay in implementation of our business plan for the combined business;\n•\nunanticipated issues or costs in integrating financial, information technology, communications and other systems;\n•\ncomplexities associated with managing the larger, more complex, combined business;\n•\npotential unknown liabilities and unforeseen expenses, delays or regulatory conditions associated with the merger;\n•\nintegrating relationships with industry contacts and business partners;\n•\npossible inconsistencies in standards, controls, procedures and policies, and compensation structures between Calpine and us; and\n•\nperformance of Calpine’s generating assets and the costs to operate and maintain them, relative to expectations. \nIn addition, the companies have operated and, until the completion of the merger, will continue to operate, independently. It is possible that the integration process could result in the disruption of, or the loss of momentum \n40\nTable of Contents\nin, our ongoing businesses or inconsistencies in standards, controls, procedures and policies, which could negatively impact the combined company.\nUncertainties associated with the merger may cause a loss of management personnel and other key employees, which could adversely affect the future business and operations of the combined company.\nWe are dependent on the experience and industry knowledge of our officers and other key employees to execute our business plans. Our success until the merger and the combined company’s success after the merger will depend in part upon our ability to retain key management personnel and other key employees of both companies. Current and prospective employees may experience uncertainty about their future roles within the combined company following completion of the merger, which may have an adverse effect on our ability to attract or retain key management and other key personnel. Accordingly, no assurance can be given that the combined company will be able to attract or retain key management personnel and other key employees to the same extent that we have previously been able to attract or retain our employees.\nThe merger may divert significant attention of our management team, which could detract from efforts to meet business goals.\nThe pursuit of the merger and the preparation for the integration could place a burden on management and internal resources. Any significant diversion of management attention away from ongoing business concerns and any difficulties encountered in the transition and integration process may negatively impact our financial results.\nWe are obligated to complete the transaction whether or not we have obtained the required funding for closing.  \nWe are funding the transaction using $4.5 billion in cash and by issuing 50 million shares of common stock.  While we expect to have cash on hand needed for closing, we would be required to complete the transaction even if we experience a cash shortfall. This could require us to obtain additional financing which may cause us to incur additional costs. \nThe combined company’s assets, liabilities or results of operations could be negatively impacted by unknown or unexpected events, conditions or actions that might occur at Calpine prior to the closing of the merger.\nThe Calpine assets, liabilities, business, financial condition, cash flows, operating results and prospects to be acquired or assumed by us in the merger could be negatively impacted before or after the merger closing as a result of previously unknown events or conditions occurring or existing before the merger closes. Adverse changes in Calpine’s business or operations could occur or arise as a result of actions by Calpine, legal or regulatory developments including the emergence or unfavorable resolution of pre-merger loss contingencies, deteriorating general business, market, industry or economic conditions, and other factors both within and beyond the control of Calpine. A significant decline in the value of Calpine assets to be acquired or a significant increase in Calpine liabilities to be assumed could negatively impact the combined company’s future business, operating results, cash flows, financial conditions or prospects. In addition, there could be potential unknown liabilities and unforeseen expenses as a result of the merger, some of which we may not discover during our due diligence or adequately adjust for in our merger arrangements.\nWe may record goodwill that could become impaired and adversely affect our operating results.\nIn accordance with GAAP, the merger will be accounted for as a business combination. The assets and liabilities of Calpine will be consolidated in our balance sheet. Any excess of consideration transferred over the fair values of Calpine’s assets and liabilities, if any, will be recorded as goodwill.\nThe amount of goodwill, which could be material, will be allocated to the appropriate reporting units of the combined company. Pursuant to the Merger Agreement, the stock consideration at the closing will consist of 50 million newly issued shares of Constellation common stock, with no par value.  However, the total value of consideration transferred will be determined, in part, based on the market price of the 50 million shares at the closing date. The number of shares we expect to issue in connection with the stock consideration will not be \n41\nTable of Contents\nadjusted for changes in the price of our common stock, which may vary significantly. Any increase in the value of our common stock may be reflected as additional goodwill. \nWe are required to assess goodwill for impairment at least annually by comparing the fair value of reporting units to the carrying value of those reporting units. A potential impairment could result in a material non-cash charge that would have a material negative impact on our future operating results or financial position.\nThe merger may be completed on terms different from those contained in the Merger Agreement.\nPrior to the completion of the merger, we and Calpine could, by mutual agreement, amend or alter the terms of the Merger Agreement, including with respect to, among other things, the consideration to be received by Calpine stockholders or any covenants or agreements with respect to the parties’ respective operations pending completion of the merger. In addition, we could choose to waive requirements of the Merger Agreement, including some conditions to closing of the merger.  \nLawsuits may be filed against us or our Board in connection with the merger. An adverse ruling in any such lawsuit could result in an injunction preventing the completion of the merger and/or substantial costs to us.\nSecurities class action lawsuits and derivative lawsuits are often brought against public companies that have entered acquisition, merger or other business combination agreements like the Merger Agreement. Even if such a lawsuit is without merit, defending against these claims can result in substantial costs and divert management time and resources. An adverse judgment could result in monetary damages, which could have a negative impact on our liquidity and financial condition.\nAlthough we are not aware of any pending or threatened lawsuits relating to the transactions contemplated by the Merger Agreement, lawsuits arising out of the transactions contemplated by the Merger Agreement could be filed in the future.\nOne of the conditions to the closing of the merger is that no applicable law of any governmental entity having competent jurisdiction is in effect at the time of closing, which makes the consummation of the merger illegal or otherwise prohibits, restrains or enjoins the consummation of the merger. Consequently, if a plaintiff is successful in obtaining an injunction prohibiting completion of the merger, that injunction may delay or prevent the merger from being completed within the expected timeframe or at all, which may adversely affect our business, financial position and results of operations. Even if such injunction is eventually lifted and the merger is later completed, the resulting delays and costs incurred may continue to affect the combined company following the completion of the merger.\nAdditionally, there can be no assurance that any of the defendants will be successful in the outcome of any potential lawsuits. The defense or settlement of any lawsuit or claim that remains unresolved at the time the merger is completed may adversely affect the combined company’s business, financial condition, results of operations and cash flows.\nITEM 1B.\nUNRESOLVED STAFF COMMENTS\nNone.\nITEM 1C.\nCYBERSECURITY\nRisk Management and Strategy\nConstellation has established programs and processes to manage material risks from cybersecurity threats including assessing and identifying existing cybersecurity risks, as well as continuously monitoring for developing risks. \nOur cybersecurity risk management strategy is established at the executive level and is implemented through our cybersecurity program which deploys risk-based security controls and services to protect our customers, personnel, information and cyber assets.\n The program aligns enterprise cyber and physical security controls with the National Institute of Standards & Technology (NIST) Cybersecurity Framework (CSF) and other industry standards such as the NERC and NRC cybersecurity standards. Our cybersecurity program is aligned to \n42\nTable of Contents\nthe five functions of the NIST Cybersecurity Framework – identify, detect, protect, respond, and recover. Cybersecurity risk is assessed and reported in our enterprise risk management program, which utilizes the Three Lines Model adapted from the Institute of Internal Auditors, for risk management to assign clear risk responsibilities across the enterprise. Through coordination with operational teams, we align on cybersecurity risk classification, categorization, likelihood, and potential impact to the company. At the highest level, our program includes multi-layered oversight by the Board of Directors and Board Committees. \nOur cybersecurity and physical security controls are implemented through policies and procedures we utilize for planning, performing, managing, assessing, innovating, and improving our security controls. \nTo protect our information and cyber assets, we implement practices for training and screening of personnel, access management, network defense, asset configuration management, vulnerability assessment (including penetration testing), third-party security, and privacy and information protection.\n Our defense-in-depth strategy to protect our cyber assets and sensitive information reduces the potential severity and duration of a cybersecurity incident by leveraging security measures across various layers of the enterprise. Cross-functional executive steering committees and peer groups, with business unit and technical stakeholder participation, are maintained to support oversight, security controls development, change management, implementation, evaluation, continuous improvement, and sustainment. \nTo assist in detecting cybersecurity events, we deploy security logging and monitoring, malicious code detection, and data loss protection tools. If the company is the target of a cybersecurity attack, we have established processes for incident response and crisis management to triage potential incidents, determine severity, contain, and eradicate a threat. These processes require notifications to regulatory and other governmental authorities of cybersecurity events as required by law, including providing notice to investors for material cybersecurity events. To recover our systems and information, we utilize established system recovery plans and business continuity plans. \nAs part of our process to continuously improve, we utilize our internal audit, risk, and legal functions to evaluate security controls and risk management practices. \nWe also engage third-party subject matter experts to independently assess our programs, processes and technical controls, as needed.\n  For our regulated cyber assets associated with critical infrastructure, such as those within the scope of NERC and the NRC, regulatory auditors and inspectors monitor our adherence to mandatory cybersecurity requirements on a regular frequency using a variety of compliance monitoring and enforcement mechanisms.\nBoard Governance and Management\nOur Board is actively engaged in monitoring the performance of the Company's cybersecurity program and maintains oversight of the Company’s enterprise risk program, including with respect to commodity markets, market design, enterprise security (physical and cyber), operating risks, and financial performance. \nWhile the full Board retains ultimate responsibility and oversight of the Company's cybersecurity risk management practices, the \nNuclear Oversight Committee and the Audit and Risk Committee\n also have cybersecurity risk management as part of their charters.\n The Nuclear Oversight Committee is tasked with overseeing compliance with policies and procedures to manage and mitigate cybersecurity risks associated with our nuclear assets. The Audit and Risk Committee oversees policies and processes established by management to identify, assess, monitor, manage and control technology and cyber risks, among other risks. \nOur Chief Information Officer (CIO) and Chief Information Security Officer (CISO) provide regular reports to the Board, or one or both of its designated Committees, regarding the security of our operational and information technology programs, systems, and risks.\n We also report on the state of our cybersecurity program and provide key risk indicators to track performance. Emergent matters or events are reported to the Board between scheduled meetings on an ad hoc basis through our incident response and crisis management protocols. \nAt the executive and management level, the Chief Administration Officer, via delegations to the Cyber Security organization, is authorized to govern and functionally oversee our security controls and services on behalf of the enterprise.  Our cybersecurity organization, under the direction of the CISO who reports to the CIO, implements and provides governance and functional oversight for cybersecurity controls and services, including coordination with our Corporate Security function. Our CIO has over 20 years of experience with information systems, including management roles in operational security, technical design and engineering, and platform architecture cybersecurity, governance and compliance, and business continuity. \nOur CISO has over 20 years of experience in cybersecurity, governance and compliance, physical security and business continuity.\n In addition, cybersecurity risk is assessed and tracked through the Company's enterprise risk management program.\n43\nTable of Contents\nAlthough the risks from cyber threats have not materially affected our business strategy, results of operations, or financial condition to date, we continue to closely monitor cyber risk.\n Overall, our company has implemented tactical processes for assessing, identifying, and managing material risks from cybersecurity threats to the company including governance at the Board level and accountability in our executive management for the execution of our cyber risk management strategy and the controls designed to protect our operations. See"
}