{
  "ticker": "CI",
  "cik": "0001739940",
  "company_name": "Cigna Group",
  "filing_date": "2025-02-27",
  "accession": "0001739940-25-000009",
  "primary_doc": "ci-20241231.htm",
  "item1_text": "Item 1. BUSINESS\nOVERVIEW\nThe Cigna Group\nSM\n, together with its subsidiaries (either individually or collectively referred to as the \"Company,\" \"we,\" \"us\" or \"our\"), is a global health company. \nOur Purpose and Mission\n \nThe Cigna Group is a global health company committed to creating a better future for every individual and every community. We relentlessly challenge ourselves to partner and innovate solutions for better health. Powered by our people and our brands, we advance our mission to improve the health and vitality of those we serve.\n \nOur Pathways to Growth\nTo deliver differentiated value to our customers, patients, clients, communities and investors, we will continue to cultivate our portfolio of businesses to provide sustained foundational and accelerated growth through cross-enterprise leverage - today and in the future.\nOur Differentiated Approach\n•\nClinical expertise and longitudinal data provide enhanced care and value.\n•\nRelentless focus on value and affordability improves the cost of care for our clients and customers.\n•\nCulture of innovation and partnership brings new services and capabilities to market.\nAt The Cigna Group, we relentlessly challenge ourselves to partner and innovate solutions for better health. Our global workforce of approximately 73,500 colleagues strives to fulfill our mission to improve the health and vitality of approximately 182 million customer and patient relationships in more than 30 countries and jurisdictions (as of December 31, 2024).\nWe have two growth platforms: Evernorth Health Services\n® \nand Cigna Healthcare\n®\n. Evernorth Health Services, through our Pharmacy Benefit Services and Specialty and Care Services operating segments, provides independent and coordinated health solutions and capabilities to enable the health care system to work better and help people live richer, healthier lives. In addition to serving a wide variety of clients, Evernorth Health Services also enables us to deepen existing relationships across our entire book of business. Cigna Healthcare is the health benefits segment of The Cigna Group and serves customers and clients for our U.S. Healthcare and International Health operating segments. \nTogether, Evernorth Health Services and Cigna Healthcare provide a strong and diverse foundation that allows us to capitalize on growth opportunities by leading with our strengths – pharmacy and medical solutions – and then expanding those relationships by addressing additional client needs and innovating and delivering new services and solutions. When considering our broad portfolio of businesses, we have strong foundational businesses that we expect to continue to grow. These businesses often serve as the key entry point for clients with either a pharmacy relationship, a medical relationship or both. We also have accelerated growth businesses, both scaled and emerging, which build upon our foundational relationships or provide exposure to adjacent high-growth areas. \nEvernorth Health Services and Cigna Healthcare work together to enable cross-enterprise leverage by uniquely using the depth and breadth of our wide-ranging capabilities across the enterprise to efficiently move from ideation to solution creation to meet clients' evolving needs while creating more value, expanding our reach and driving growth. \nInformation about Segments\nWe present the financial results of our businesses in the following segments (see \"Executive Overview\" section of Management's Discussion and Analysis of Financial Condition and Results of Operations\n \n(\"MD&A\") located in Part II, Item 7 of this Form 10-K for a financial summary):\nEvernorth Health Services \nincludes our Pharmacy Benefit Services and Specialty and Care Services operating segments, which provide independent and coordinated health solutions and capabilities to enable the health care system to work better and help people live richer, healthier lives.\n1\nCigna Healthcare\n includes the U.S. Healthcare and International Health operating segments, which provide comprehensive medical plan services and coordinated solutions to clients and customers.\nOther Operations\n comprises the remainder of our business operations, which includes certain continuing, run-off and other non-strategic businesses.\nCorporate \nreflects amounts not allocated to operating segments, including net interest expense (defined as interest on corporate financing less net investment income on investments not supporting segment and other operations), certain litigation matters, expense associated with our frozen pension plans, charitable contributions, operating severance, certain overhead and enterprise-wide project costs, and eliminations for products and services sold between segments.\nSee the \"Executive Overview - Key Transactions and Business Developments\" section of our MD&A located in Part II, Item 7 of this Form 10-K for discussion of key developments impacting the segments.\nOther Information\nThe Cigna Group, through its predecessor companies, was incorporated in Delaware in 1981. \nThe financial information included in this Form 10-K for the fiscal year ended December 31, 2024 is presented in conformity with accounting principles generally accepted in the United States of America (\"GAAP\") unless otherwise indicated. Industry rankings and percentages set forth herein are for the year ended December 31, 2024, unless otherwise indicated. In addition, statements set forth in this document concerning our rank or position in an industry or particular line of business have been developed internally based on publicly available information unless otherwise noted.\nYou can access our website at http://www.thecignagroup.com to learn more about our company. We make annual, quarterly and current reports and proxy statements and amendments to those reports available, free of charge, through our website as soon as reasonably practicable after we electronically file these materials with, or furnish them to, the Securities and Exchange Commission (\"SEC\"). We also use our website as a means of disclosing material information and for complying with our disclosure obligations under the SEC's Regulation FD (Fair Disclosure). Important information, including news releases, analyst presentations and financial information regarding The Cigna Group is routinely posted on our website. Accordingly, investors should monitor the Investor Relations portion of our website, in addition to following our press releases, SEC filings, and public conference calls and webcasts. The information contained on, or that may be accessed through, our website is neither incorporated by reference into nor a part of this report. See also \"Code of Ethics and Other Corporate Governance Disclosures\" in Part III, Item 10 of this Form 10-K for additional information regarding the availability of our Codes of Ethics on our website.\nEVERNORTH HEALTH SERVICES\nEvernorth Health Services\n \nincludes our Pharmacy Benefit Services and Specialty and Care Services operating segments, which provide independent and coordinated health solutions and capabilities to enable the health care system to work better and help people live richer, healthier lives. Within Evernorth Health Services, Pharmacy Benefit Services is a foundational growth business, and Specialty and Care Services is an accelerated growth business. \nEvernorth Health Services offers a full suite of products and services that both (a) enables our customers to combine our products and services to create a comprehensive benefit offering designed to manage prescription drugs and provide independent and coordinated health solutions and capabilities and (b) addresses the needs of a shared customer base across both operating segments of Evernorth Health Services. Our ability to deliver this broad array of health care services on both a standalone or combined basis between its two operating segments enables us to drive incremental growth. Additionally, many Evernorth Health Services offerings are available within Cigna Healthcare solutions to drive cross-enterprise leverage.\n2\nHow We Deliver\n•\nDeep clinical expertise \nin evaluating medicines, digital therapeutics and other health solutions for efficacy and value to assist clients in selecting a cost-effective formulary as well as in leveraging evidence-based guidelines to ensure patients receive the most medically appropriate treatments.\n•\nAffordable solutions \nthat provide more value and align incentives between the patient, health care professional and plan sponsor.\n•\nModular portfolio \ntailored to client needs, using the combined strengths and capabilities of Evernorth Health Services, as well as strategic partnerships, to deliver better, more efficient care for patients; better experiences for clients, providers and customers; and enhanced choices for clients and customers through our open architecture model.\n•\nTalented, experienced and caring people who operate in a culture of innovation and partnership \nto solve complex problems across a fragmented health care ecosystem, fueled by data and expertise that drives purposeful innovation.\nPrincipal Products and Services\nPharmacy Benefit Services\n•\nPharmacy Benefits.\n \nWe drive high-quality, cost-effective pharmacy care through a range of services. We adjudicate drug claims from retail network participants and provide retail pharmacy network administration, benefit design consultation, drug utilization review, drug formulary management and other services.\n◦\nRetail Pharmacy Network Administration.\n We contract with retail pharmacies to provide prescription drugs to customers of the pharmacy benefit plans our clients offer. We negotiate with pharmacies throughout the United States to discount drug prices and offer national and regional network options responsive to client preferences related to cost containment, convenience of access for customers and network performance.\n◦\nBenefits Design Consultation.\n We consult with our clients on how best to structure and leverage the pharmacy benefit to meet plan objectives for affordable and sustainable access to the prescription medications customers need to stay healthy and to ensure the safe and effective use of those medications.\n◦\nDrug Utilization Review.\n When pharmacies submit claims for prescription drugs to us, we review them in real time for health and safety. If issues are detected, we then alert the dispensing pharmacy. Clients may also choose to enroll in programs that result in communications about potential therapy concerns being sent to prescribers after the initial claim submission.\n◦\nDrug Formulary Management.\n▪\nFormularies are lists of drugs with designations that may be used to determine drug coverage and customer out-of-pocket costs as well as communicate plan preferences in competitive drug categories. Our formulary management\n \nservices support clients in establishing formularies that assist customers and physicians in choosing clinically appropriate, cost-effective drugs and prioritize access, safety and affordability. \n▪\nWe administer specific formularies for our clients, including standard formularies developed by Express Scripts by Evernorth\n®\n (\"Express Scripts\") and custom formularies in which we play a more limited role. Many of our clients select standard formularies, governed by both internal and independent committees that make recommendations for formularies that first consider clinical results separate from price considerations.\n▪\nOne of the ways we manage our drug formulary is through negotiating to secure additional affordability for the benefit of our clients based on the utilization of certain prescription drugs and supplies which can be paid to us in the form of a rebate. With respect to our clients' rebate arrangements, most choose to receive the greater of a minimum rebate guarantee or a contractually agreed-upon percentage of rebates. In some rebate arrangements, Express Scripts takes on the risk of securing the rebate value necessary to meet the value guaranteed to its client. The actual amount of value secured by Express Scripts is dependent upon the result of its negotiations for rebates. In 2024, for clients covered under our pharmacy benefit contracts, Express Scripts shared over 95% of the drug formulary management rebates it received with its integrated clients, and more than two-thirds of clients received 100% of rebates. \n◦\nMedical Drug Management.\n We offer a comprehensive range of services with guaranteed savings for managing medically billed specialty drugs. Our solutions apply utilization management, site of care management and claims prepayment review to help ensure patient safety and healthier outcomes and reduce wasteful spend.\n◦\nAdministration of Group Purchasing Organizations.\n We participate in various group purchasing organizations that negotiate pricing for the purchase of pharmaceuticals or formulary rebates with pharmaceutical manufacturers on behalf of their participants.\n◦\nValue-Based Programs.\n We offer a variety of solutions aimed at helping clients reduce costs and enhance clinical outcomes. These programs include SafeGuardRx\n®\n, Express Scripts Copay Assurance\nSM\n, Express Scripts Patient Assurance\n®\n and Evernorth EncircleRx\nSM\n.\n3\n◦\nEvernorth Wholesale Marketplace.\n Evernorth Wholesale Marketplace\n®\n offers a suite of flexible, private label pharmacy benefit manager solutions including but not limited to a pharmacy rebate program, a retail network program, value-based solutions, a medical rebate program and utilization management policies. These offerings are captured under either our drug formulary administrative service arrangements or our formulary processing arrangements.\n•\nHome Delivery Pharmacy.\n \nOur Express Scripts Pharmacy by Evernorth\n®\n (\"Express Scripts Pharmacy\") offers free standard shipping of medications nationwide, usually in a 90-day supply, directly to the customer's home and allows for automatic refills on eligible medications and unrestricted telephone access to customer care advocates and specially trained pharmacists. The Home Delivery Pharmacy operations consist of 13 licensed pharmacies, including 4 fulfillment pharmacies. Our fulfillment pharmacies are located in Arizona, Indiana, Missouri and New Jersey.\nSpecialty and Care Services\n•\nSpecialty Pharmacy.\n Specialty medications are primarily characterized as high-cost medications for the treatment of complex and rare diseases. These medications broadly include those with frequent dosing adjustments, intensive clinical monitoring, the need for customer training, specialized product administration requirements or medications limited to certain specialty pharmacy networks by manufacturers. The front-end of our pharmacy, anchored by Accredo by Evernorth\n®\n (\"Accredo\"), is organized into Therapeutic Resource Centers, where pharmacists focus their practice of pharmacy by condition. Accredo provides support for customers through our specially trained clinicians, network of in-home nursing services, nationwide footprint, drug reimbursement services and highly tailored clinical care programs. Our Specialty Pharmacy operations consist of 35 licensed pharmacies.\n•\nSpecialty Distribution.\n \nCuraScript SD by Evernorth\n®\n is a specialty distributor of pharmaceuticals and medical supplies (including injectable and infusible pharmaceuticals and medications to treat specialty and rare or orphan diseases) directly to health care providers, clinics and hospitals in the United States for office or clinic administration. We provide distribution services primarily to health care providers who treat customers with chronic diseases and regularly order costly specialty pharmaceuticals. This business operates three distribution centers and ships most products overnight within the United States. It is a contracted supplier with most major group purchasing organizations and leverages its distribution platform to operate as a third-party logistics provider for several pharmaceutical companies.\n•\nCare Services.\n \nWe offer clinical programs to help our clients, including third-party administrators, drive better whole-person health outcomes through our Care Delivery (MD Live by Evernorth\n®\n (\"MD Live\") virtual care, in-home care and physical primary care) and Care Management (EviCore by Evernorth\n®\n (\"EviCore\"), benefits management, behavioral health services, network services and health coaching capabilities) offerings. \nClients and Customers\nWe provide products and services in the Evernorth Health Services segment to clients and customers, as described below. \n•\nClients.\n We provide services to managed care organizations, health insurers, third-party administrators, employers, union-sponsored benefit plans, workers' compensation plans, government health programs, providers, clinics, hospitals and others. We provide services to a majority of clients in our Cigna Healthcare segment.\n•\nCustomers.\n Prescription drugs are dispensed to patients connected to the service offerings we provide to clients. Prescription drugs are dispensed primarily through networks of retail pharmacies under nonexclusive contracts with us and via home delivery pharmacies, including Express Scripts Pharmacy, and specialty pharmacies, including Accredo.\nEvernorth Health Services has three clients that each drive significant revenues for the segment:\n•\nExpress Scripts and Centene Corporation (\"Centene\") have a multi-year agreement, which began January 1, 2024, to manage pharmacy benefit services for Centene's customers, providing them with access to the extensive Express Scripts national network of retail pharmacies.\n•\nExpress Scripts and Prime Therapeutics LLC (\"Prime\") have an agreement to deliver improved choice and affordability for Prime's clients and customers by enhancing retail pharmacy networks, providing access to Accredo and Express Scripts Pharmacy, and providing pharmaceutical manufacturer value.\n•\nThe Department of Defense (\"DoD\") TRICARE\n®\n is the military health care program available to active-duty service members, active-duty family members, National Guard and Reserve members and their family members, retirees and retiree family members, survivors and certain former spouses. \nCompetition\nThe primary competitive factors in the industry include the ability to negotiate with retail pharmacies to ensure retail pharmacy networks meet the needs of clients and customers; provide home delivery and specialty pharmacy services; negotiate pricing of \n4\nprescription drugs with drug manufacturers; manage cost and quality of specialty drugs; specialize in claim adjudication and benefit administration; improve access, outcomes, and efficiencies within the health care ecosystem; deliver quality primary and behavioral care in virtual-led hybrid settings, in the workplace and in home-based settings; navigate the complexities of government-reimbursed business including Medicare, Medicaid and the public exchanges; and use the information obtained about drug, behavioral and medical utilization patterns and consumer behavior to reduce costs for clients and customers and assess the level of service provided. \nOur focus on improving the health and vitality of those we serve will allow us to further differentiate ourselves from our primary competitors. Our primary competitors include independent and managed care pharmacy benefit managers; retail, home delivery and specialty pharmacies; specialty drug distributors; health plans; third-party benefit administrators; group purchasing organizations; clinical solutions companies, health care data analytics companies; and care services providers.\nSuppliers\nWe maintain an inventory of brand-name and generic pharmaceuticals in our home delivery pharmacies, specialty pharmacies and specialty distributor. Our specialty pharmacies and specialty distributor also carry biopharmaceutical products to meet the needs of our customers, including pharmaceuticals for the treatment of rare or chronic diseases; if a drug is not in our inventory, we can generally obtain it from a supplier within a reasonable amount of time.\nWe purchase pharmaceuticals either directly from manufacturers or through authorized wholesalers. Evernorth Health Services uses one wholesaler for approximately half of our pharmaceutical purchases, but holds contracts with other wholesalers if needs for an alternate source arise. Generic pharmaceuticals are generally purchased directly from manufacturers.\nCIGNA HEALTHCARE\nCigna Healthcare includes the U.S. Healthcare and International Health operating segments, which provide comprehensive medical plan services and coordinated solutions to clients and customers. Excluding the businesses pending divestiture to Health Care Service Corporation (\"HCSC\"), Cigna Healthcare is predominately comprised of foundational growth businesses.\nHow We Deliver\n•\nMultifaceted approach to affordability\n with a focus on high-quality care to lower costs and drive better outcomes through deep collaborative partnerships with high-performing providers and superior clinical expertise and analytics to guide customers to the highest quality, most affordable sites of care.\n•\nTalented and experienced people\n who bring a highly consultative orientation to market and partner with clients to understand their business and goals to address the unique health needs of their population.\n•\nModular portfolio of products, services and funding options\n that provides choice and enables us to build and tailor a unique combination to meet the specific needs of each client.\n•\nPartnering with Evernorth to drive cross-enterprise leverage\n to deliver a spectrum of integrated solutions that create value and savings for our customers, clients and partners.\nWe offer administrative services only (\"ASO\") and insurance funding solutions to employers, groups and individuals along with other \nhealth care benefits and solutions to improve the quality of care, lower costs and help customers achieve better health outcomes. Funding solutions, referring to the entity assuming financial risk, are described in the Premiums and Fees section below.\nPrincipal Products and Services\nU.S. Healthcare Medical Plans\n•\nEmployer Medical Plans\n include health maintenance organizations (\"HMOs\"), LocalPlus\n®\n, Network and Open Access Plus offered through our insurance companies, and third-party administrators (\"TPAs\"). These plans use cost-sharing incentives to encourage the use of \"in-network\" rather than \"out-of-network\" health care providers. Preferred Provider Organization (\"PPO\") plan offerings feature broader provider access than the other plans, do not require referrals and typically have a higher cost-share for out-of-network services. Plans are offered nationwide, and our funding solutions include ASO\n (self-funded),\n insured guaranteed cost (\"GC\") and insured experience rated (\"ER\").\n◦\nConsumer-Driven Products\n are paired with employer medical plans and offer customers a tax-advantaged way to pay for eligible health care expenses. Health savings accounts, health reimbursement accounts and flexible spending accounts encourage customers to play an active role in managing their health and health care costs.\n5\n•\nIndividual and Family Plans (\"IFPs\")\n are Patient Protection and Affordable Care Act (\"ACA\") compliant exclusive provider organizations (\"EPOs\") or HMO plans marketed to individuals under age 65 without access to health care coverage through an employer or government program such as Medicare or Medicaid. Customers receive comprehensive health care benefits and have access to a local network of health care providers who have been selected with cost and quality in mind. Plans are currently offered in 11 states with a GC funding solution.\nHeld for Sale\nIn January 2024, the Company entered into a definitive agreement to sell the Medicare Advantage, Medicare Individual Stand-Alone Prescription Drug Plans, Medicare and Other Supplemental Benefits, and CareAllies businesses within the U.S. Healthcare operating segment to HCSC subject to applicable regulatory approvals and other customary closing conditions, including adjustments to align with the final balance sheet of the divested businesses (the \"HCSC transaction\"). See Note 5 to the Consolidated Financial Statements for further information.\n•\nMedicare Advantage Plans\n allow Medicare-eligible customers to receive health care benefits, including prescription drugs, through a managed care health plan. Our plans include HMO and PPO plans with a GC funding solution marketed to individuals and qualified employer groups in 29 states and the District of Columbia.\n•\nMedicare Individual Stand-Alone Prescription Drug (\"Part D\") Plans\n provide a number of prescription drug plan options, as well as service and information support to Medicare-eligible individuals. Our stand-alone plans offer the coverage of Medicare combined with the flexibility to select a product that provides enhanced benefits and a formulary that aligns with the individual's needs. Plans are offered nationwide with a GC funding\n solution\n.\n•\nMedicare Supplement Plans\n provide Medicare-eligible customers with federally standardized Medigap plans. Customers may select among the various Center for Medicare and Medicaid Services (\"CMS\") standardized plan designs to meet their unique needs and may visit any health care provider or facility that accepts Medicare throughout the United States without the need for a referral. Plans are offered in 48 states and the District of Columbia with a GC funding solution.\nU.S. Healthcare Benefits and Solutions\nThe following benefits and solutions are offered nationwide with various funding solutions to enhance the benefits from our health care medical plans.\n•\nBehavioral Health\n solutions consist of a broad national network of providers, including one of the largest virtual networks in the United States, specialty case and utilization management, a 24/7-accessible crisis intervention phone line, employee assistance programs, and work/life programs.\n•\nConsumer Health Engagement\n solutions include an array of health management, disease management and wellness programs to improve customers' health and well-being.\n•\nCost Containment Programs\n are designed to reduce the cost of covered health care services and supplies by reducing out-of-network costs, protecting customers from balance billing and educating customers regarding the availability of lower cost in-network services. We negotiate discounts with out-of-network providers, review provider bills and recover overpayments.\n•\nDental\n solutions include HMO plans, PPO plans, EPO plans, traditional indemnity plans and a discount program. Employers and other groups may purchase our products as standalone products or in conjunction with medical products. IFP standalone dental PPO plans are available in 49 states and sold to individuals under age 65 and retirees without access to dental coverage through an employer or a government program.\n•\nPharmacy Management\n solutions and benefits may be combined with our medical and behavioral health offerings by leveraging the capabilities of Evernorth Health Services.\n•\nStop-Loss\n insurance coverage is offered to self-funded clients whose group health plans are administered by Cigna Healthcare. Stop-loss insurance provides reimbursement for claims in excess of a predetermined amount for individuals, the entire group or both.\nInternational Health\n•\nGlobal Health Care\n offerings include medical, dental, pharmacy, vision, life, accidental death and dismemberment, and disability risks. We provide products and services that meet the needs of multinational employers, intergovernmental and nongovernmental organizations, and globally mobile individuals with a focus on keeping employees healthy and productive. Products and services are offered worldwide except as limited by applicable law and include ASO, GC and ER funding solutions.\n•\nLocal Health Care\n offerings include medical, dental, pharmacy and vision as well as life coverage. Customers include employers and individuals located in specific geographies (China, Singapore, Hong Kong, Spain and India, along with various countries in the Middle East) where the products and services are purchased. Offerings include ASO, GC and ER funding solutions.\n6\nPremiums and Fees\n•\nASO. \nPlan sponsors (i.e., employers, unions and other groups) create self-funded group health plans to fund all claims and may purchase stop-loss insurance to limit exposure. We earn fees for providing access to our participating provider networks, claims administration services, and other benefits and solutions. ASO arrangements represent approximately 26% of segment revenues and 74% of Cigna Healthcare medical customers.\n•\nInsured.\nGC and ER.\n Individual and group insurance premium rates generally must be approved by the applicable state regulatory agency, and state or federal laws may restrict or limit the use of rating methods. Premium rates are established at the beginning of a policy period and may be based in whole or in part on prior experience and include estimates of future claims costs over the fixed contract period. With the exception of ER policies, we generally cannot adjust premium rates to reflect actual claims experience until the next policy period, and the policyholder does not share in actual claim experience. We retain any margin if costs are less than the premium charged (subject to minimum medical loss ratio (\"MLR\") rebate requirements) and bear the risk for costs in excess of the premium charged. \nMedicare Advantage\n (held for sale). We receiv\ne fixed monthly payments from CMS for each plan customer based on customer demographic data and actual customer health risk factors and may earn additional revenue from CMS related to quality performance measures (\"Star Ratings\"). Premiums may be charged to customers when the plan premium exceeds the revenue determined by CMS. \nThe ACA subjects individual and small group policy rate increases above an identified threshold to review by the United States Department of Health and Human Services (\"HHS\"), and our U.S. Healthcare medical plans are subject to minimum MLR requirements. The MLR represents the percentage of premiums used to pay claims and expenses for activities that improve the quality of care. If we do not satisfy the prescribed MLR, statutes require premium refunds to policyholders or to CMS.\nGC and ER insured arrangements, including Medicare Advantage, represent approximately 74% of segment revenues and 26% of Cigna Healthcare medical customers.\nSee the \"Business – Regulation\" section of this Form 10-K for additional information about MLR requirements, Star Ratings and risk adjustment programs.\nMarket Segments\nCigna Healthcare\n medical customers are comprised of the following market segments:\n•\nNational Accounts.\n Employers with 3,000 or more eligible employees.\n•\nMiddle Market.\n Employers with 500 to 2,999 eligible employees, solutions for third-party payors, Taft-Hartley plans and other groups.\n•\nSelect.\n Employers with 51 to 499 eligible employees.\n•\nSmall.\n Employers with 2 to 50 eligible employees\n.\n•\nIFPs.\n \nIndividual health insurance coverage both on and off the public exchanges and individual dental plans for customers across various distribution channels.\n•\nMedicare Advantage\n (held for sale)\n.\n Includes individuals who are Medicare-eligible, as well as employer group-sponsored post-65 retirees. Revenues from CMS are significant to the market segment.\n•\nInternational Health.\n \nIncludes multinational employers and globally mobile individuals, and employers and individuals in specific countries outside of the United States.\nClients and Customers\nWe provide clients and customers with access to a mix of medical and other health care benefits and solutions.\n•\nClients.\n Employers, TPAs, union-sponsored benefit plans, government health programs and other groups.\n•\nCustomers.\n Individuals who access our offerings through an employer-sponsored plan, government-sponsored plan, individual plan or other insured group.\nPrimary Distribution Channels\n•\nBrokers and Consultants.\n Sales representatives distribute our products and solutions to a broad group of brokerage and consulting firms as well as individuals.\n7\n•\nDirect.\n Cigna Healthcare sales representatives distribute our products and solutions directly to employers, unions, and other groups or individuals. Various products may also be sold directly to insurance companies, HMOs and TPAs. \n•\nPrivate Exchanges.\n We partner with select private exchanges that provide employees of participating clients access to health insurance, targeting participation to those models that best align with our mission and value proposition.\n•\nPublic Exchanges.\n Cigna Healthcare offers individual ACA-compliant policies through public health insurance exchanges in select geographies.\nCompetition\nThe primary competitive factors affecting our business are quality of care and cost-effectiveness of service and provider networks, effectiveness of medical care management, products that meet the needs of our clients and customers, total cost management, technology, and effectiveness of marketing and sales. Financial strength, as indicated by ratings issued by nationally recognized rating agencies, is also a competitive factor. Our health advocacy capabilities, holistic approach to consumer engagement, breadth of product offerings, and clinical care and health management capabilities along with an array of product funding solutions are competitive advantages. Our primary competitors include national insurers, local health plans, TPAs, dental insurers, independent and managed care pharmacy benefit managers, global insurers, and local non-U.S. insurers.\nProvider Networks and Partnerships\n•\nParticipating Provider Networks.\n We provide our customers with a national network of participating health care providers, hospitals, and other facilities, pharmacies and providers of health care services and supplies. Our U.S. network has approximately 1.8 million physicians, including specialists, and over 6,000 hospitals. We have strategic alliances with several regional managed care organizations to gain access to their provider networks and discounts.\n•\nNetwork Strength and Stability.\n We successfully maintain a broad provider network with high levels of provider retention to ensure our customers have access to high-quality care at affordable, competitive rates.\n•\nProvider Partnerships.\n We partner with a variety of provider groups in value-based payment arrangements to continuously improve the quality of care for those we serve. With more than 200 arrangements with primary care groups, our flagship program is the Cigna Collaborative Accountable Care program, which rewards providers for improving quality outcomes and medical cost performance. We have approximately 100 arrangements with specialist groups across six different disciplines that include incentives for enhanced care coordination or reimbursements for meeting cost and quality goals. We also have contracts with more than 200 hospital systems, involving more than 800 hospitals, with reimbursements tied to quality metrics.\n•\nSite of Care Optimization.\n We encourage the use of clinically appropriate settings to reduce the cost of care while ensuring high-quality care and service through our clinical programs and partnership with EviCore. We expand access, reduce the cost of care and offer flexibility while supporting the patient/provider relationship by providing access to virtual care services, including MD Live.\nOTHER OPERATIONS\nOther Operations comprises the remainder of our business operations, which includes certain continuing, run-off and other non-strategic businesses. Other Operations also included the international life, accident and supplemental benefits businesses and our interest in a joint venture in Türkiye prior to the divestiture of these businesses in 2022. \nContinuing Business\nCorporate-Owned Life Insurance. \nThe principal products of the corporate-owned life insurance (\"COLI\") business are permanent insurance contracts sold to corporations to provide coverage on the lives of certain employees for financing employer-paid future benefit obligations. Permanent life insurance provides coverage that, when adequately funded, does not expire after a term of years. The contracts are primarily nonparticipating universal life policies. Fees for universal life insurance products consist primarily of mortality and administrative charges assessed against the policyholder's fund balance. Interest credited and mortality charges for \n8\nuniversal life and mortality charges on variable universal life may be adjusted prospectively to reflect expected interest and mortality experience. To reduce our exposure to large individual losses, we purchase reinsurance from unaffiliated reinsurers.\nRun-off Businesses\nSettlement Annuity Business. \nOur settlement annuity business is a closed, run-off block of single premium annuity contracts. These contracts are primarily liability settlements, with approximately 12% of the liabilities associated with guaranteed payments not contingent on survivorship. Non-guaranteed payments are contingent on the survival of one or more parties involved in the settlement.\nReinsurance. \nOur reinsurance operations are an inactive business in run-off. In February 2013, we effectively exited the variable annuity reinsurance business by reinsuring 100% of our future exposures, net of retrocessional arrangements in place at that time, up to a specified limit. For additional information regarding this reinsurance transaction and the arrangements that secure our reinsurance recoverables, see Note 10 to the Consolidated Financial Statements.\nIndividual Life Insurance and Annuity and Retirement Benefits Businesses. \nThe individual life insurance and annuity business and the retirement benefits business were sold through reinsurance agreements in 1998 and 2004, respectively. For more information regarding the arrangements that secure our reinsurance recoverables for the retirement benefits business, see Note 10 to the Consolidated Financial Statements.\nMISCELLANEOUS\n•\nRevenues from a single pharmacy benefit client were approximately 16% of consolidated revenues for the year ended December 31, 2024. These amounts were reported in the Evernorth Health Services segment.\n•\nRevenues from U.S. Federal Government agencies, under a number of contracts, were approximately 11%, 15% and 14% of consolidated revenues for the years ended December 31, 2024, 2023 and 2022, respectively. These amounts were reported in the Evernorth Health Services and Cigna Healthcare segments. \n•\nThe Company does not rely on business from one or a few brokers or agents. \nINVESTMENT MANAGEMENT\nOur investment operations provide investment management and related services for our various businesses, including the insurance-related invested assets. For additional information about invested assets, see the \"Investment Assets\" section of the MD&A and Notes 11 and 12 to the Consolidated Financial Statements.\nWe manage our investment portfolios to reflect the underlying characteristics of related insurance and contractholder liabilities and capital requirements, as well as regulatory and tax considerations pertaining to those liabilities and state investment laws. Insurance and contractholder liabilities range from short-duration health care products to longer-term obligations associated with COLI products and the run-off settlement annuity business. Assets supporting these liabilities are managed in segregated investment portfolios to facilitate matching of asset durations and cash flows to those of corresponding liabilities. Investment results are affected by the amount and timing of cash available for investment, economic and market conditions and asset allocation decisions. We routinely monitor and evaluate the status of our investments, obtaining and analyzing relevant investment-specific information and assessing current economic conditions, trends in capital markets and other factors, such as industry-sector, geographic and property-specific information.\nThe Cigna Group Ventures. \nIn addition to the core insurance and operating investment portfolios described above, The Cigna Group has committed $700 million in aggregate since the formation of The Cigna Group Ventures, our strategic corporate venture fund that invests in promising startups and growth-stage companies making groundbreaking progress in three strategic areas: data and technology, digital health, and care delivery. Through these partnerships, we collaborate, innovate and develop new solutions to improve the health and vitality of those we serve. \nDIGITAL, DATA AND TECHNOLOGY\nThe Cigna Group investments in digital, data and technology are focused on cultivating robust digital-first capabilities to better engage with customers and stakeholders. \n9\nInnovation. \nCustomer-centric, digital-first, virtual-led vision for health care remains at the forefront of our priorities. The advancement of our internal innovative capabilities and strategic partnerships continues to produce new and more effective ways to engage with our customers to help close gaps in care, optimize treatment and improve outcomes. \nAt The Cigna Group, we use artificial intelligence (\"AI\") to support health care transformation by helping to enable the next generation of accessible, effective, affordable and enhanced health care solutions. AI models can facilitate personalized solutions for individuals, inform earlier interventions and simplify health care experiences. We do not view AI as a replacement for expert decisions made by physicians or employees at The Cigna Group. Given this, we consider most of the AI models we use as augmented intelligence, providing information to human experts for further consideration, in combination with many other factors evaluated in care and benefit administration decisions.\nTo ensure our practices and solutions are consistent with our commitment to health equity and to facilitate compliance with applicable laws and regulations, we have a dedicated team and governance structure in place, known as Enterprise Model Governance (\"EMG\"). Our EMG team oversees the development, deployment and monitoring of AI models - driven by our Responsible AI Principles: validity and reliability; safety; privacy; fairness; transparency; and accountability. EMG is governed by the EMG Board, comprised of senior leaders from across the company, with representation from business, clinical, privacy, legal, internal audit, information protection and other departments. The EMG Board oversees an enterprise-wide model approval and governance process for review of AI models in use or in development across the enterprise. \nWe also have established comprehensive governance processes for new capabilities, such as generative AI (\"Gen AI\"). Our AI Center of Enablement (\"AI COE\") expands on EMG and brings together individuals from across our technology, privacy, data governance, security, legal, compliance, marketing and other teams to evaluate and approve Gen AI use cases. The AI COE ensures these use cases align with our Responsible AI Principles and adhere to health care privacy and security requirements.\nData and Analytics. \nWe conduct timely, rigorous and objective research and analysis that informs evidence-based medical and pharmacy benefit management decisions and evaluates the clinical, economic and individual impact of enhanced benefit designs and programs, ultimately resulting in rich, integrated data that helps to provide differentiated outcomes. The combination of our predictive analytics, and our machine learning (\"ML\") and deep learning capabilities create actionable intelligence that informs decision-making of our health care professionals, improves operational efficiency and enables greater innovation. Our data-driven approach to behavioral health provides personalized and customized care across the entire continuum for the populations we serve. These solutions predict emerging health needs, close gaps in care and drive cost savings, all while empowering whole-person and whole-family health.\nDigital. \nOur digital health focus has shown value across the enterprise by imagining the future of health care and creating engaging experiences that give customers the right information at the right time. We deliver resource-efficient products and features at scale and on time with a commitment to security, resiliency and compliance. At its core, digital is a connected ecosystem that serves customers, clients and providers, and it paves the way to direct-to-consumer relationships and new growth opportunities. Our digital strategy focuses on the drive from analog to digital, which complements the growth strategy of The Cigna Group, creates efficiency and amplifies the value of existing offerings, as well as creates option value with industry-leading personalization and precision to drive better health and business outcomes. Cybersecurity protections continue to be a top priority across The Cigna Group digital offerings to further strengthen our security posture and grow the trust of those we serve. See Part I. Item 1C - \"Cybersecurity\" of this Form 10-K for additional information regarding our cybersecurity practices and governance.\nTechnology Operations. \nOur technology team supports the various information systems essential to our operations, including the health benefit claims processing systems and specialty and home delivery pharmacy systems. Uninterrupted point-of-sale electronic retail pharmacy claims processing is a significant operational requirement for our business. We believe we have substantial capacity for growth in our U.S. pharmacy claims processing facilities. Our pharmacy technology platform allows us to safely, rapidly and accurately adjudicate over two billion adjusted prescriptions annually. Our technology helps retail pharmacies focus on patient care, and our real-time safety checks help avoid medication errors. The Cigna Group companies hold over 480 U.S. patents. We use these patents to protect our proprietary technological advances and to differentiate ourselves in the market. We are not substantially dependent on any single patent or group of related patents. We are not aware of any facts that could materially impact the continuing use of our intellectual property.\n10\nHUMAN CAPITAL MANAGEMENT\nThe mission of The Cigna Group is to improve the health and vitality of those we serve. A healthy and diverse global workforce is essential to achieving our mission and our business growth strategies. We continually invest in our global workforce to support our employees' health and vitality, provide fair and market-competitive pay, and foster growth and development for every employee. As of the end of 2024, we had approximately 73,500 employees, with approximately 90% of our employees based in the United States. Approximately 97% of our employees are full-time.\n \nThe Cigna Group has a long-standing and deep commitment to fair opportunity for all, regardless of gender, race or ethnicity. As of the end of 2024, our global workforce was approximately 70% women and 30% men. Approximately 41% of our employees in the United States were ethnic minorities. \nHealth, Vitality and Other Benefits. \nTending to our employees' health and vitality is a critical business imperative for our company and one of the most important investments in our enterprise that we make each year. We believe that when we support our employees' health and well-being, they are more productive and engaged in driving our mission and business strategy forward, thereby creating shareholder value. In 2024, The Cigna Group invested approximately 19% of total payroll in health, well-being and other benefits, including life and disability programs, 401(k) contributions, and retirement-related benefits for our employees in the United States.\nIn addition to traditional medical and pharmacy benefits, we provide multidimensional wellness programming to support the physical, mental, financial, and social health as well as overall vitality of employees. Additionally, we encourage employees to self-report additional demographic information, including whether they are a military veteran or living with a disability, so that we can better support the health and vitality of every employee in light of their unique background, experiences and perspectives.\nTalent Acquisition, Development and Retention. \nOur talent acquisition and rewards strategies are designed to attract and retain skilled employees who are engaged in our mission. We are committed to attracting and recruiting key talent from all backgrounds into positions at all levels of the enterprise, including underrepresented groups in various leadership roles across the business. Our compensation program, rooted in our pay-for-performance philosophy, aims to provide market-competitive base salaries and incentives that reward contributions that advance the Company's strategy and mission. In 2024, the voluntary turnover rate was approximately 9% for all employees.\nOur compensation practices, rooted in our pay-for-performance philosophy, promote fair and competitive pay through measures such as benchmarking compensation by role, eliminating inquiries regarding applicants' compensation history from the hiring process and monitoring for potential disparities. Our most recent pay equity analysis among our U.S. employees, conducted in 2025, illustrated that female employees of The Cigna Group earn more than 99 cents for every dollar earned by similarly situated male employees, and ethnic minority employees (which includes Black/African American, Hispanic or Latino/a, Pacific Islander. and American Indian/Alaskan employees) earn more than 99 cents for every dollar earned by similarly situated white employees. We also analyzed gender pay on a global basis and found that across the entire Company, female employees at The Cigna Group earn more than 99 cents for every dollar earned by similarly situated male employees.\nOur online learning platform and career development tools, including a career portal and career planning tool, offer a broad range of training, education and development resources to all employees. In 2024, based on internal data, employees on average engaged in 37 hours of learning through these resources. Our agile leadership development strategy, anchored by The Cigna Group Leader Profile and aligned with our mission and enterprise goals, serves to cultivate leadership capabilities for people leaders and critical segments across our organization through innovative programs and resources. The Cigna Group also offers an education reimbursement program for both full- and part-time employees who meet the continuing education criteria. We believe these strategies and programs contribute to employee engagement and retention and prepare our employees to meet our needs now and in the future. \nENVIRONMENTAL, SOCIAL AND GOVERNANCE\nThe Cigna Group environmental, social and governance framework is structured around four connected pillars that underscore our enterprise mission to improve the health and vitality of those we serve. We drive action through this framework to deliver on our purpose and performance vision: to transform the ecosystem of health into one that is well-functioning, sustainable, accessible and equitable - advancing better health for all. Our commitment to this vision guides us in our multidimensional value-creation strategy as we strive to meet the needs of our many stakeholders. The four pillars of this framework are as follows:\n11\nHealthy Society. \nWe are committed to understanding and addressing social determinants of health and improving medical quality and access while lowering health risks, promoting preventive health interventions and coordinating all aspects of care. We drive progress by aligning our products and services with value-based care models, leveraging integrated benefits, managing drug costs through innovation, expanding digital offerings and reviewing coverage policies for health equity. \nHealthy Workforce. \nWe believe that employers play a vital role in the health care system, and we strive to be a model for others by prioritizing and investing in the health and vitality of employees within our own company. We aim to cultivate a purpose- and performance-driven workforce that is equipped and empowered to drive growth and innovation across our diverse businesses. See further discussion of this pillar within Part I, Item 1 \"Human Capital Management\" section above. \nHealthy Environment. \nWe believe that responsible environmental stewardship can improve health and vitality and also makes sound business sense. We strive to identify new efficiencies and make strategic investments that reduce our environmental impacts and our operating costs. \nHealthy Company. \nWe have a deep and long-held commitment to strong governance as well as ethical and resilient business practices. This includes protecting the sensitive data of our clients and customers by ensuring cybersecurity incident response preparedness, supporting a responsible supply chain and committing to increasing our annual diverse supplier spend.\nREGULATION\nWe are regulated by federal, state and international legislative and executive bodies and agencies, which generally have discretion to issue regulations and interpret and enforce laws and rules. These regulations can vary significantly from jurisdiction to jurisdiction, and the regulations and interpretations thereof may also change periodically. We expect continued legislative and regulatory debate of issues related to our businesses, and executive, judicial or legislative intervention could further impact the regulatory landscape for the health services industry. Our international subsidiaries face an increasingly complex regulatory dynamic, including as a result of rigorous regulations and the impact of geopolitical developments or tensions.\nMany aspects of our business are directly regulated by federal and state laws and administrative agencies, such as HHS, CMS, the Internal Revenue Service (\"IRS\"), the U.S. Departments of Labor (\"DOL\") and Treasury, the Office of Personnel Management (\"OPM\"), the Federal Trade Commission (\"FTC\"), the SEC, the Office of the National Coordinator for Health Information Technology, state departments of insurance and state boards of pharmacy. Our business practices may also be shaped by enforcement actions of federal agencies, such as the Department of Justice (\"DOJ\"), state agencies and judicial decisions.\nIn addition, aspects of our business are subject to indirect regulation. The self-funded benefit plans sponsored by our U.S. employer clients are regulated under federal law. These self-funded clients expect us to administer their plans in compliance with the regulatory requirements applicable to them.\nOur business operations and the books and records of our regulated businesses are routinely subject to regulatory examination and audit at regular intervals by state insurance and HMO regulatory agencies, state boards of pharmacy, CMS, DOL and OPM to assess compliance with applicable laws and regulations. Our operations are also subject to nonroutine examinations, audits and investigations by various state and federal regulatory agencies, generally as the result of a complaint. In addition, we may be implicated in investigations of our clients whose group benefit plans we administer on their behalf. As a result, we routinely receive subpoenas and other demands or requests for information from various state insurance and HMO regulatory agencies, state attorneys general, the HHS Office of Inspector General (\"HHS-OIG\"), the DOJ, the FTC, the DOL, and other state, federal and international authorities. We may also be called upon by members of the U.S. Congress to provide information regarding certain of our business practices. If The Cigna Group is determined to have failed to comply with applicable laws or regulations, these examinations, audits, investigations, reviews, subpoenas and demands may (a) result in fines, penalties, injunctions, consent orders or other settlement agreements (such as corporate integrity agreements or loss of licensure); (b) suspend or exclude us from participation in government programs or limit our ability to sell or market our products; (c) require changes in business practices; (d) damage relationships with the agencies that regulate us and affect our ability to secure regulatory approvals necessary for the operation of our business; or (e) damage our brand and reputation.\nEven where we believe that we are in compliance with the various laws and regulations, any enforcement actions by federal, state or international government officials alleging noncompliance with these rules and regulations could subject us to penalties or restructuring or reorganization of our business. For a discussion of the risks related to our compliance with these laws and regulations, please see the \"Risk Factors\" section located in Part I,"
}