{
  "ticker": "CINF",
  "cik": "0000020286",
  "company_name": "CINCINNATI FINANCIAL CORP",
  "filing_date": "2025-02-24",
  "accession": "0000020286-25-000009",
  "primary_doc": "cinf-20241231.htm",
  "item1_text": "Item 1A, Risk Factors, many potential risks to our business and our ability to achieve our qualitative and quantitative objectives.\nCincinnati Financial Corporation - 2024 10-K - Page 48\nTable of Contents\nCorporate Financial Highlights\nIn addition to the value creation ratio discussion and analysis in the Executive Summary, we further analyze our financial results in the sections below.\n \nBalance Sheet Data\n(Dollars in millions, except share data)\nAt December 31,\nAt December 31,\n \n2024\n2023\nTotal investments\n$\n28,378\n \n$\n25,357 \nTotal assets\n36,501\n \n32,769 \nShort-term debt\n25\n \n25 \nLong-term debt\n790\n \n790 \nShareholders' equity\n13,935\n \n12,098 \nBook value per share\n89.11\n \n77.06 \nDebt-to-total-capital ratio\n5.5\n \n%\n6.3 \n%\n \nTotal investments increased by 12% during 2024 on a fair value basis. Entering 2025, we believe the portfolio continues to be well diversified and is well positioned to withstand short-term fluctuations. We discuss our investment strategy in Item 1, Investments Segment, and results for the segment in Investments Results. Total assets increased by 11%, compared with year-end 2023. Shareholders’ equity increased by 15% and book value per share increased by 16%, for reasons discussed in the preceding Executive Summary.\n \nThe amount of our debt obligations at year-end 2024 matched year-end 2023. Our 5.5% ratio of debt to total capital (debt plus shareholders’ equity) at year-end 2024 decreased by 0.8 percentage points compared with the prior-year ratio.\n \nIncome Statement and Per Share Data\n(In millions, except per share data)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nEarned premiums\n$\n8,889\n \n$\n7,958 \n$\n7,225 \n12\n \n10 \nInvestment income, net of expenses (pretax)\n1,025\n \n894 \n781 \n15\n \n14 \nInvestment gains and losses, net (pretax)\n1,391\n \n1,127 \n(1,467)\n23\n \nnm\nTotal revenues\n11,337\n \n10,013 \n6,563 \n13\n \n53 \nNet income (loss)\n2,292\n \n1,843 \n(487)\n24\n \nnm\nComprehensive income (loss)\n2,418\n \n2,022 \n(1,398)\n20\n \nnm\nNet income (loss) per share - diluted\n14.53\n \n11.66 \n(3.06)\n25\n \nnm\nCash dividends declared per share\n3.24\n \n3.00 \n2.76 \n8\n \n9 \nDiluted weighted average shares outstanding\n157.8\n \n158.1 \n158.8 \n0\n \n0 \n \nNet income rose by $449 million in 2024, compared with 2023, including a $204 million increase in net investment gains on an after-tax basis. The improved 2024 net income also included an increase in property casualty underwriting income of $141 million after taxes, as discussed below, and a $104 million increase in investment income after taxes. Our investment operation’s performance is discussed further in Investments Results. Net income of $1.843 billion in 2023, representing a $2.330 billion increase compared with net income for 2022, included a $2.050 billion increase in net investment gains after taxes. The improved 2023 net income also included an increase in property casualty underwriting income of $206 million after taxes and a $91 million increase in investment income after taxes.\nDuring 2024, 2023 and 2022, there were no material changes to our estimates for incurred losses and expenses related to the pandemic related to SARS-CoV-2, also known as COVID-19. Factors used in estimating reserves for business interruption losses or legal expenses related to the pandemic included estimates for attorney fees associated with the defense of such lawsuits filed against the company; litigation trends of such cases, including responding to amended and replead cases and cases on appeal; and trends in judicial decisions in cases filed \nCincinnati Financial Corporation - 2024 10-K - Page 49\nTable of Contents\nagainst the company and other insurers. Loss experience for our insurance operations is influenced by many factors, as discussed in Critical Accounting Estimates, Property Casualty Insurance Loss and Loss Expense Reserves. Also, there could be losses or legal expenses that increase due to inflation, pandemic effects or other factors. \nContribution from Insurance Operations\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n2024\n2023\n2022\nChange %\nChange %\nConsolidated property casualty data:\nNet written premiums\n$\n9,243\n \n$\n8,046 \n$\n7,307 \n15\n \n10 \nEarned premiums\n8,568\n \n7,645 \n6,924 \n12\n \n10 \nUnderwriting profit \n580\n \n401 \n140 \n45\n \n186 \n \n     \n     \n     \nPt. Change\nPt. Change\nGAAP combined ratio\n93.4\n \n%\n94.9 \n%\n98.1 \n%\n(1.5)\n(3.2)\nStatutory combined ratio\n92.9\n \n94.6 \n97.7 \n(1.7)\n(3.1)\nWritten premium to statutory surplus\n1.0\n \n1.1 \n1.1 \n(0.1)\n0.0 \n \nProperty casualty net written premiums grew 15% and earned premiums grew 12% in 2024. The growth reflected average renewal price increases, premium growth initiatives and a higher level of insured exposures, including a contribution to net written premium growth of 1 percentage point from Cincinnati Re and Cincinnati Global in total. Growth in 2023 net written premiums and earned premiums was driven by factors similar to 2024. Trends and related factors are discussed in Commercial Lines, Personal Lines and Excess and Surplus Lines Insurance Results.\n \nOur property casualty insurance operations generated an underwriting profit for each of the three years ending in 2024. Underwriting results improved in both 2024 and 2023, compared with the respective prior-year period. For both years, the underwriting profit increase included improved overall insured loss experience before catastrophe effects, as price increases helped to offset elevated losses reflecting economic or other forms of inflation that increased our uncertainty regarding ultimate losses. Loss experience is discussed further in Financial Results for our property casualty business and related segments. The $179 million increase in 2024 underwriting profit, compared with 2023, included a $66 million increase in losses from natural catastrophe events and $27 million less benefit from net favorable reserve development on prior accident years before catastrophe losses. The $261 million increase in 2023, compared with 2022, included a $31 million increase in losses from catastrophe events and $81 million more benefit from net favorable reserve development on prior accident years before catastrophe losses. \n \nWe measure property casualty underwriting profitability primarily by the combined ratio. Our combined ratio measures the percentage of each earned premium dollar spent on claims plus all expenses related to our property casualty operations, all on a pretax basis. A lower ratio indicates more favorable results and better underlying performance. A ratio below 100% represents an underwriting profit.\nInitiatives to improve our combined ratio are discussed in Item 1, Our Business and Our Strategy, Strategic Initiatives. In 2024, 2023 and 2022, favorable development on reserves for claims that occurred in prior accident years helped offset other incurred losses and loss expenses. Reserve development is discussed further in Property Casualty Loss and Loss Expense Obligations and Reserves. Losses from weather-related catastrophes are another important item influencing the combined ratio and are discussed along with other factors in Financial Results for our property casualty business and related segments.\n \nOur life insurance segment reported a profit of $57 million in 2024, $41 million in 2023 and $27 million in 2022. We discuss results for the segment in Life Insurance Results. Most of this segment’s investment income is included in our investments segment results. In addition to investment income, investment gains and losses from the life insurance investment portfolio are also included in our investments segment results.\nCincinnati Financial Corporation - 2024 10-K - Page 50\nTable of Contents\nCritical Accounting Estimates\nCincinnati Financial Corporation’s financial statements are prepared using U.S. GAAP. These principles require management to make estimates and assumptions that affect the amounts reported in the Consolidated Financial Statements and accompanying Notes. Actual results could differ materially from those estimates.\n \nThe significant accounting policies used in the preparation of the financial statements are discussed in Item 8, Note 1 of the Consolidated Financial Statements. In conjunction with that discussion, material implications of uncertainties associated with the methods, assumptions and estimates underlying the company’s critical accounting policies are discussed below. The audit committee of the board of directors reviews the annual financial statements with management and the independent registered public accounting firm. These discussions cover: the quality of earnings; review of reserves and accruals; reconsideration of the suitability of accounting principles; review of highly judgmental areas including critical accounting estimates; audit adjustments; and such other inquiries as may be appropriate.\n \nProperty Casualty Insurance Loss and Loss Expense Reserves\nWe establish loss and loss expense reserves for our property casualty insurance business as balance sheet liabilities. Unpaid loss and loss expenses are the estimated amounts necessary to pay for and settle all outstanding insured claims, including incurred but not reported (IBNR) claims. These reserves account for unpaid loss and loss expenses as of a financial statement date.\n \nFor some lines of business that we write, a considerable and uncertain amount of time can elapse between the occurrence, reporting and payment of insured claims. The amount we will actually have to pay for such claims also can be highly uncertain. This uncertainty, together with the size of our reserves, makes the loss and loss expense reserves our most significant estimate. Gross loss and loss expense reserves were $9.937 billion at year-end 2024 compared with $8.975 billion at year-end 2023.\n \nHow Reserves Are Established\nOur field claims representatives establish case reserves when claims are reported to the company to provide for our unpaid loss and loss expense obligation associated with known claims. Field claims managers supervise and review all claims with case reserves less than $100,000. Additionally, a headquarters supervisor and regional claims manager review claims under $100,000 if litigation or a certain specialty claim is involved. All claims with case reserves of $100,000 or greater are reviewed and approved by experienced headquarters supervisors and regional claims managers. Upper-level headquarters claims managers also review case reserves of $175,000 or more.\n \nOur claims representatives base their case reserve estimates primarily upon case-by-case evaluations that consider:\n•\ntype of claim involved\n•\ncircumstances surrounding each claim\n•\npolicy provisions pertaining to each claim\n•\npotential for subrogation or salvage recoverable\n•\ngeneral insurance reserving practices\nCase reserves of all sizes are generally reviewed on a 90-day cycle, or more frequently if new information about a loss becomes available. As part of the review process, we monitor industry trends, cost trends, relevant court cases, legislative activity and other current events in an effort to ascertain new or additional loss exposures.\n \nCincinnati Financial Corporation - 2024 10-K - Page 51\nTable of Contents\nWe also establish IBNR reserves to provide for all unpaid loss and loss expenses not accounted for by case reserves:\n•\nFor events designated as natural catastrophes resulting in losses incurred related to premiums written on a direct basis by The Cincinnati Insurance Companies, we calculate IBNR reserves directly as a result of an estimated IBNR claim count and an estimated average claim amount for each event. Once case reserves are established for a catastrophe event, we reduce the IBNR reserves. Our claims department management coordinates the assessment of these events and prepares the related IBNR reserve estimates. Such an assessment involves a comprehensive analysis of the nature of the event, of policyholder exposures within the affected geographic area and of available claims intelligence. Depending on the nature of the event, available claims intelligence could include surveys of field claims representatives within the affected geographic area, feedback from a catastrophe claims team sent into the area, as well as data on claims reported as of the financial statement date. \nTo determine whether an event is designated as a catastrophe, related to premiums written on a direct basis by The Cincinnati Insurance Companies, we generally use the catastrophe definition provided by Property Claims Service (PCS), a division of Insurance Services Office. PCS defines a catastrophe as an event that causes U.S., Puerto Rico and U.S. Virgin Islands damage of $25 million or more in insured property losses and affects a significant number of policyholders and insureds. \n•\nFor events designated as natural catastrophes resulting in losses for Cincinnati Re and Cincinnati Global, we begin with a review of in-force policies, treaties and related limits likely to be affected by each event. For both Cincinnati Re and Cincinnati Global, use of information from third-party catastrophe models, industry estimates, and our own proprietary adjustments are used for the estimate of ultimate losses for each catastrophe event. Incurred losses from catastrophe events for both Cincinnati Re and Cincinnati Global can be designated catastrophes by PCS, or deemed as a catastrophe by the international insurance industry or, for Cincinnati Re, as reported by ceding companies. IBNR reserves are calculated as the difference between the estimate of the ultimate loss and loss expenses and the sum of total loss and loss expense payments and total case reserves.\n•\nFor asbestos and environmental claims, we calculate IBNR reserves by deriving an actuarially-based estimate of total unpaid loss and loss expenses. We then reduce the estimate by total case reserves. We discuss the reserve analysis that applies to asbestos and environmental reserves in Liquidity and Capital Resources, Asbestos and Environmental Loss and Loss Expense Reserves.\n•\nFor loss expenses that pertain primarily to salaries and other costs related to our claims associates, also referred to as adjusting and other expense or AOE, we calculate reserves based on an analysis of the relationship between paid losses and paid AOE. Reserves for AOE are allocated to company, line of business and accident year based on a claim count algorithm. Claim counts reported and used in the reserving process are primarily measured by insurance coverages that are triggered when a loss occurs and a reserve is established. Coverages are defined as unique combinations of certain attributes such as line of business and cause of loss. Claims that are opened and closed without payment are included in the reported claim counts. Claim counts are presented on a direct basis only and do not reflect any assumed or ceded reinsurance. \n•\nFor all other claims and events, including reinsurance assumed or ceded, IBNR reserves are calculated as the difference between an actuarial estimate of the ultimate cost of total loss and loss expenses incurred reduced by the sum of total loss and loss expense payments and total case reserves estimated for individual claims. Reserve amounts for those other claims and events are significant, and represent the majority of amounts shown as IBNR reserves and loss expense reserves in the table included in Liquidity and Capital Resources, Property Casualty Loss and Loss Expense Obligations and Reserves. We discuss below the development of actuarially based estimates of the ultimate cost of total loss and loss expenses incurred. \nOur actuarial staff applies significant judgment in selecting models and estimating model parameters when preparing reserve analyses. Unpaid loss and loss expenses are inherently uncertain as to timing and amount. Uncertainties relating to model appropriateness, parameter estimates and actual loss and loss expense amounts are referred to as model, parameter and process uncertainty, respectively. Our management and actuarial staff address these uncertainties in the reserving process in a variety of ways.\n \nCincinnati Financial Corporation - 2024 10-K - Page 52\nTable of Contents\nOur actuarial staff bases its IBNR reserve estimates for these losses primarily on the indications of methods and models that analyze accident year data. Accident year is the year in which an insured claim, loss or loss expense occurred. The specific methods and models that our actuaries have used for the past several years are:\n•\npaid and reported loss development methods\n•\npaid and reported loss Bornhuetter-Ferguson methods\n•\nindividual and multiple probabilistic trend family models\nOur actuarial staff uses diagnostics to evaluate the appropriateness of the models and methods listed above. The appropriateness of these models and methods for estimating IBNR reserves tends to depend on the tail for a line of business. Tail refers to the time interval between a typical claim’s occurrence and its settlement. The loss development and Bornhuetter-Ferguson methods, particularly the reported loss variations, tend to produce more appropriate IBNR reserve estimates for our short-tail lines such as homeowner and commercial property. For our mid-tail and long-tail lines, all models and methods provide useful insights.\n \nOur actuarial staff also devotes significant time and effort to the estimation of model and method parameters. The loss development and Bornhuetter-Ferguson methods require the estimation of numerous loss development factors. The Bornhuetter-Ferguson methods also involve the estimation of numerous expected loss ratios by accident year. Models from the probabilistic trend family require the estimation of development trends, calendar year inflation trends and exposure levels. Consequently, our actuarial staff monitors a number of trends and measures to gain key business insights necessary for exercising appropriate judgment when estimating the parameters mentioned, such as: \n•\ncompany and industry pricing\n•\ncompany and industry exposure\n•\ncompany and industry loss frequency and severity\n•\npast large loss events\n•\ncompany and industry premium\n•\ncompany in-force policy count\nThese trends and measures also support the estimation of expected accident year loss ratios needed for applying the Bornhuetter-Ferguson methods and for assessing the reasonability of all IBNR reserve estimates computed. Our actuarial staff reviews these trends and measures quarterly, updating parameters derived from them as necessary.\n \nQuarterly, our actuarial staff summarizes their reserve analysis by preparing an actuarial best estimate and a range of reasonable IBNR reserves intended to reflect the uncertainty of the estimate. An inter-departmental committee that includes our actuarial management team reviews the results of each quarterly reserve analysis. The committee establishes management’s best estimate of IBNR reserves, which is the amount that is included in each period’s financial statements. In addition to the information provided by actuarial staff, the committee also considers factors such as:\n•\nlarge loss activity and trends in large losses\n•\nnew business activity\n•\njudicial decisions\n•\ngeneral economic trends such as inflation\n•\ntrends in litigiousness and legal expenses\n•\nproduct and underwriting changes\n•\nchanges in claims practices\nCincinnati Financial Corporation - 2024 10-K - Page 53\nTable of Contents\nThe determination of management’s best estimate, like the preparation of the reserve analysis that supports it, involves considerable judgment. Changes in reserving data or the trends and factors that influence reserving data may signal fundamental shifts or may simply reflect single-period anomalies. Even if a change reflects a fundamental shift, the full extent of the change may not become evident until years later. Moreover, since our methods and models do not explicitly relate many of the factors we consider directly to reserve levels, we typically cannot quantify the precise impact of such factors on the adequacy of reserves prospectively or retrospectively.\n \nDue to the uncertainties described above, our ultimate loss experience could prove better or worse than our carried reserves reflect. To the extent that reserves are inadequate and increased, the amount of the increase is a charge in the period that the deficiency is recognized, raising our loss and loss expense ratio and reducing earnings. To the extent that reserves are redundant and released, the amount of the release is a credit in the period that the redundancy is recognized, reducing our loss and loss expense ratio and increasing earnings.\n \nKey Assumptions – Loss Reserving\nOur actuarial staff makes a number of key assumptions when using their methods and models to derive IBNR reserve estimates. Appropriate reliance on these key assumptions essentially entails determinations of the likelihood that statistically significant patterns in historical data may extend into the future. The four most significant of the key assumptions used by our actuarial staff and approved by management are:\n•\nEmergence of loss and defense and cost containment expenses, also referred to as DCCE, on an accident year basis. Historical paid loss, reported loss and paid DCCE data for the business lines we analyze contain patterns that reflect how unpaid losses, unreported losses and unpaid DCCE as of a financial statement date will emerge in the future. Unless our actuarial staff or management identifies reasons or factors that invalidate the extension of historical patterns into the future, these patterns can be used to make projections necessary for estimating IBNR reserves. Our actuaries significantly rely on this assumption in the application of all methods and models mentioned above.\n•\nCalendar year inflation. For long-tail and mid-tail business lines, calendar year inflation trends for future paid losses and paid DCCE do not vary significantly from a stable, long-term average. Our actuaries base reserve estimates derived from probabilistic trend family models on this assumption.\n•\nExposure levels. Historical earned premiums, when adjusted to reflect common levels of product pricing and loss cost inflation, can serve as a proxy for historical exposures. Our actuaries require this assumption to estimate expected loss ratios and expected DCCE ratios used by the Bornhuetter-Ferguson reserving methods. They may also use this assumption to establish exposure levels for recent accident years, characterized by “green” or immature data, when working with probabilistic trend family models.\n•\nClaims having atypical emergence patterns. Characteristics of certain subsets of claims, such as high frequency, high severity, or mass tort claims, have the potential to distort patterns contained in historical paid loss, reported loss and paid DCCE data. When testing indicates this to be the case for a particular subset of claims, our actuaries segregate these claims from the data and analyze them separately. Subsets of claims that could fall into this category include hurricane claims or claims for other weather events where total losses we incurred were very large, individual large claims and asbestos and environmental claims.\nThese key assumptions have not changed since 2005, when our actuarial staff began using probabilistic trend family models to estimate IBNR reserves.\n \nPaid losses, reported losses and paid DCCE are subject to random as well as systematic influences. As a result, actual paid losses, reported losses and paid DCCE are virtually certain to differ from projections. Such differences are consistent with what specific models for our business lines predict and with the related patterns in the historical data used to develop these models. As a result, management does not closely monitor statistically insignificant differences between actual and projected data.\n \nCincinnati Financial Corporation - 2024 10-K - Page 54\nTable of Contents\nReserve Estimate Variability\nManagement believes that the standard error of a reserve estimate, a measure of the estimate’s variability, provides the most appropriate measure of the estimate’s sensitivity. The reserves we establish depend on the models we use and the related parameters we estimate in the course of conducting reserve analyses. However, the actual amount required to settle all outstanding insured claims, including IBNR claims, as of a financial statement date depends on stochastic, or random, elements as well as the systematic elements captured by our models and estimated model parameters. For the lines of business we write, process uncertainty – the inherent variability of loss and loss expense payments – typically contributes more to the imprecision of a reserve estimate than parameter uncertainty.\n \nConsequently, a sensitivity measure that ignores process uncertainty would provide an incomplete picture of the reserve estimate’s sensitivity. Since a reserve estimate’s standard error accounts for both process and parameter uncertainty, it reflects the estimate’s full sensitivity to a range of reasonably likely scenarios.\n \nThe table below provides standard errors and reserve ranges by major property casualty lines of business and in total for net loss and loss expense reserves as well as the potential effects on our net income, assuming a 21% federal tax rate. Standard errors and reserve ranges for assorted groupings of these lines of business cannot be computed by simply adding the standard errors and reserve ranges of the component lines of business, since such an approach would ignore the effects of product diversification. See Liquidity and Capital Resources, Property Casualty Loss and Loss Expense Obligations and Reserves, Range of Reasonable Reserves, for more details on our total reserve range. While the table reflects our assessment of the most likely range within which each line’s actual unpaid loss and loss expenses may fall, one or more lines’ actual unpaid loss and loss expenses could nonetheless fall outside of the indicated ranges.\n(Dollars in millions)\nNet loss and loss expense range of reserves\n \n \nCarried reserves\nLow point\nHigh point\nStandard error\nNet income\neffect\n \nAt December 31, 2024\n \n \n \n \n \nTotal\n$\n9,668\n \n$\n8,948\n \n$\n9,816\n \n$\n434\n \n$\n343\n \nCommercial casualty\n$\n3,423\n \n$\n3,116\n \n$\n3,583\n \n$\n234\n \n$\n184\n \nCommercial property\n516\n \n390\n \n532\n \n71\n \n56\n \nCommercial auto\n935\n \n859\n \n971\n \n56\n \n44\n \nWorkers' compensation\n989\n \n842\n \n1,042\n \n100\n \n79\n \nPersonal auto\n445\n \n403\n \n477\n \n37\n \n29\n \nHomeowners\n458\n \n399\n \n484\n \n42\n \n33\n \nExcess and surplus \n1,079\n \n901\n \n1,185\n \n142\n \n112\n \n .\nCincinnati Financial Corporation - 2024 10-K - Page 55\nTable of Contents\nLife Policy and\n Investment Contract Reserves\nWe establish the reserves for traditional life policies, including term, whole life and other products based on certain cash flow assumptions including mortality and lapse rates. These assumptions are established based on our current expectations and are reviewed annually to determine any necessary updates. They are also updated on an interim basis if evidence suggests that they should be revised. We use both our own experience and industry experience, adjusted for historical trends, in arriving at our cash flow assumptions. These reserves also include a discount rate assumption that is based on upper-medium grade fixed-income instrument yields (market value discount rates) and is updated quarterly. \nThe gross reserve balance for term and whole life policy reserves was $1.456 billion, or 49.2%, of total life policy and investment contract reserves at December 31, 2024. The following table summarizes the sensitivity, on a net basis, of our term and whole life policy reserves and reinsurance recoverable amounts to hypothetical changes in key assumptions and the resulting increase/(decrease) to pretax net income and pretax other comprehensive income:\n(Dollars in millions)\nAt December 31, 2024\nPretax Net Income\nPretax Other Comprehensive Income\nAssumptions set by actuaries and approved by management:\nMortality\nEffect of a 1% increase\n$\n(6)\n$\n—\n \nEffect of a 1% decrease\n6\n \n—\n \nLapse rates\nEffect of a 10% increase\n$\n19\n \n$\n(3)\nEffect of a 10% decrease\n(18)\n3\n \nAssumptions set by market values:\nMarket value discount rate\nEffect of a 100 basis point increase\n$\n—\n \n$\n146\n \nEffect of a 100 basis point decrease\n—\n \n(183)\nWe establish reserves for our universal life, deferred annuity and other investment contracts, equal to the cumulative account balances, which include premium deposits plus credited interest less charges and withdrawals. Charges include surrender and contract administration charges as well as asset-based fees. The reserve balance for these contracts was $1.276 billion, or 43.1%, of total life policy and investment contract reserves, at December 31, 2024.\nSome of our universal life insurance policies contain no-lapse guarantee provisions. For these policies, we establish a reserve, or other additional liability, in addition to the account balance based on expected no-lapse guarantee benefits and expected policy assessments. Key assumptions used to establish this other additional liability reserve are expected investment returns and projected lapse rates. These assumptions, and other relevant inputs, are reviewed annually and on an interim basis in line with the process described above for traditional life policies. The reserve balance was $130 million, or 4.4%, of total life policy and investment contract reserves at December 31, 2024, and is included as a component of universal life reserves in Item 8, Note 5 of the Consolidated Financial Statements.\nAsset Impairment\nOur investment portfolio is our largest asset. We monitor the fixed-maturity portfolio and all other assets for signs of credit-related or other impairment. We monitor decreases in the fair value of invested assets and the need for an allowance for credit losses for our fixed-maturity portfolio; allowances for expected credit losses on receivable and recoverable assets considering past events, current conditions and reasonable and supportable forecasts; an accumulation of company costs in excess of the amount originally expected to acquire or construct an asset; or other factors such as bankruptcy, deterioration of creditworthiness or failure to pay interest; and changes in legal factors or in the business climate.\n \nCincinnati Financial Corporation - 2024 10-K - Page 56\nTable of Contents\nThe application of our invested assets impairment policy resulted in write-downs of impaired securities intended to be sold that reduced our income before income taxes by less than $1 million in 2024, $4 million in 2023 and $5 million in 2022. Write-downs represent noncash charges to income and are reported as investment losses. The application of our noninvested assets impairment policy did not have a material effect on our financial condition in 2024 or 2023.\nOur internal investment portfolio managers monitor their assigned portfolios. If a fixed-maturity security is valued below amortized cost, the portfolio managers undertake additional reviews. Such declines often occur in conjunction with events taking place in the overall economy and market, combined with events specific to the industry or operations of the issuing organization. Managers review quantitative measurements such as a declining trend in fair value and the extent of the fair value decline, as well as qualitative measures such as pending events, credit ratings and issuer liquidity. We are even more proactive when these declines in valuation are greater than might be anticipated when viewed in the context of overall economic and market conditions. We provide detailed information about fixed-maturity securities fair valued in a continuous loss position at year-end 2024 in Item 7A, Quantitative and Qualitative Disclosures About Market Risk.\nAn available for sale fixed maturity is impaired if the fair value of the security is below amortized cost. The impaired loss is charged to net income when we have the intent to sell the security or it is more likely than not we will be required to sell the security before recovery of the amortized cost.  For impaired securities we intend to hold, an allowance for credit related losses is recorded in investment losses when the company determines a credit loss has been incurred based on certain factors such as adverse conditions, credit rating downgrades or failure of the issuer to make scheduled principal or interest payments.  A credit loss is determined using a discounted cash flow analysis by comparing the present value of expected cash flows with the amortized cost basis, limited to the difference between fair value and amortized cost. Noncredit losses are recognized in other comprehensive income as a change in unrealized gains and losses on investments. We provide information about valuations of our invested assets in Item 8, Note 2 of the Consolidated Financial Statements. \nCincinnati Financial Corporation - 2024 10-K - Page 57\nTable of Contents\nFair Value Measurements\n \nValuation of Financial Instruments\nFair value is defined as the exit price or the amount that would be (1) received to sell an asset or (2) paid to transfer a liability in an orderly transaction between marketplace participants at the measurement date. When determining an exit price, we must, whenever possible, rely upon observable market data.\n \nWe have categorized our financial instruments, based on the priority of the inputs to the valuation technique, into a three-level fair value hierarchy. The fair value hierarchy gives the highest priority to quoted prices in active markets for identical assets or liabilities (Level 1) and the lowest priority to unobservable inputs (Level 3). If the inputs used to measure the financial instruments fall within different levels of the hierarchy, the categorization is based on the lowest level that is significant to the fair value measurement of the instrument. While we consider pricing data from outside services, we ultimately determine whether the data or inputs used by these outside services are observable or unobservable.\n \nFinancial assets and liabilities recorded in the Consolidated Balance Sheets are categorized based on the inputs to the valuation techniques as described in Item 8, Note 3 of the Consolidated Financial Statements.\n \nLevel 1 and Level 2 Valuation Techniques\nSubstantially all of the $27.665 billion of securities in our investment portfolio at year-end 2024, measured at fair value, are classified as Level 1 or Level 2. Financial assets that fall within Level 1 and Level 2 are priced according to observable data from identical or similar securities that have traded in the marketplace. Also within Level 2 are securities that are valued by outside services or brokers where we have evaluated and verified the pricing methodology and determined that the inputs are observable.\n   \nRecent Accounting Pronouncements\nInformation about recent accounting pronouncements is provided in Item 8, Note 1 of the Consolidated Financial Statements. \n \nCincinnati Financial Corporation - 2024 10-K - Page 58\nTable of Contents\nFinancial Results\nConsolidated financial results primarily reflect the results of our five reporting segments. These segments are defined based on financial information we use to evaluate performance and to determine the allocation of assets.\n•\nCommercial lines insurance\n•\nPersonal lines insurance\n•\nExcess and surplus lines insurance\n•\nLife insurance\n•\nInvestments\nWe report as Other the noninvestment operations of the parent company and its noninsurer subsidiary, CFC Investment Company. In addition, Other includes the financial results of our reinsurance assumed operations, known as Cincinnati Re\n®\n, and our London-based global specialty underwriter, known as Cincinnati Global Underwriting Ltd.\nSM\n (Cincinnati Global).\n \nWe measure profit or loss for our commercial lines, personal lines, excess and surplus lines and life insurance segments based upon underwriting results (profit or loss), which represent net earned premium less loss and loss expenses, or contract holders’ benefits incurred, and underwriting expenses on a pretax basis. We also evaluate results for our consolidated property casualty insurance operations. That is the total of our standard market segments (commercial lines and personal lines), our excess and surplus lines insurance segment, Cincinnati Re and Cincinnati Global. For analysis of our consolidated property casualty insurance results, it is important to include the earned premiums, loss and loss expenses and also underwriting expenses reported as Other. Underwriting results and segment pretax operating income are not substitutes for net income determined in accordance with GAAP.\n \nFor our consolidated property casualty insurance operations as well as the insurance segments, statutory accounting data and ratios are key performance indicators that we use to assess business trends and to make comparisons to industry results, since GAAP-based industry data generally is not as readily available.\n \nInvestments held by the parent company and the investment portfolios for the insurance subsidiaries are managed and reported as the investments segment, separate from our underwriting business. Net investment income and net investment gains and losses for our investment portfolios are discussed in the Investments Results.\n \nThe calculations of segment data are described in more detail in Item 8, Note 18, of the Consolidated Financial Statements. The following sections provide analysis and discussion of results of operations for each of the five segments. \n \nCincinnati Financial Corporation - 2024 10-K - Page 59\nTable of Contents\nConsolidated Property Casualty Insurance Results\nEarned and net written premiums for our consolidated property casualty operations grew in 2024, reflecting average renewal price increases, a higher level of insured exposures and strategic initiatives for targeted growth. A key measure of property casualty profitability is underwriting profit or loss. Profit increased in 2024, reflecting improved overall insured loss experience before catastrophe effects, as price increases helped to offset elevated losses reflecting economic or other forms of inflation that increased our uncertainty regarding ultimate losses. Our 2024 underwriting profit of $580 million was $179 million more than in 2023, including a $66 million unfavorable effect from a higher amount of catastrophe losses, mostly caused by severe weather. Prior accident year loss experience before catastrophes during 2024 was $27 million less favorable than in 2023. We continue working to improve underwriting profitability, such as through higher pricing and our ongoing initiatives to improve pricing precision and loss experience related to claims and loss control practices. Underwriting profit trends are discussed further below. \n \nThe table below highlights property casualty results, with analysis and discussion in the sections that follow. That analysis and discussion includes sections by segment.\n \nOverview – Three-Year Highlights\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nEarned premiums\n$\n8,568\n \n$\n7,645 \n$\n6,924 \n12\n \n10 \nFee revenues\n12\n \n11 \n10 \n9\n \n10 \nTotal revenues\n8,580\n \n7,656 \n6,934 \n12\n \n10 \nLoss and loss expenses from:\n \n \n \n \n \nCurrent accident year before catastrophe losses\n4,848\n \n4,463 \n4,171 \n9\n \n7 \nCurrent accident year catastrophe losses\n824\n \n710 \n704 \n16\n \n1 \nPrior accident years before catastrophe losses\n(141)\n(168)\n(87)\n16\n \n(93)\nPrior accident years catastrophe losses\n(95)\n(47)\n(72)\n(102)\n35 \nLoss and loss expenses\n5,436\n \n4,958 \n4,716 \n10\n \n5 \nUnderwriting expenses\n2,564\n \n2,297 \n2,078 \n12\n \n11 \nUnderwriting profit \n$\n580\n \n$\n401 \n$\n140 \n45\n \n186 \nRatios as a percent of earned premiums:\nPt. Change\nPt. Change\nCurrent accident year before catastrophe losses\n56.6\n \n%\n58.4 \n%\n60.2 \n%\n(1.8)\n(1.8)\nCurrent accident year catastrophe losses\n9.6\n \n9.3 \n10.2 \n0.3\n \n(0.9)\nPrior accident years before catastrophe losses\n(1.6)\n(2.2)\n(1.3)\n0.6\n \n(0.9)\nPrior accident years catastrophe losses\n(1.1)\n(0.6)\n(1.0)\n(0.5)\n0.4 \nLoss and loss expenses\n63.5\n \n64.9 \n68.1 \n(1.4)\n(3.2)\nUnderwriting expenses\n29.9\n \n30.0 \n30.0 \n(0.1)\n0.0 \nCombined ratio\n93.4\n \n%\n94.9 \n%\n98.1 \n%\n(1.5)\n(3.2)\nCombined ratio:\n93.4\n \n%\n94.9 \n%\n98.1 \n%\n(1.5)\n(3.2)\nContribution from catastrophe losses and prior years\n    reserve development\n6.9\n \n6.5 \n7.9 \n0.4\n \n(1.4)\nCombined ratio before catastrophe losses and prior years\n    reserve development\n86.5\n \n%\n88.4 \n%\n90.2 \n%\n(1.9)\n(1.8)\n \nPerformance highlights for consolidated property casualty operations include:\n•\nPremiums – Agency renewal written premiums increased $819 million or 13% in 2024, compared with 2023, and continued to contribute to growth in earned premiums and net written premiums that rose in each of our property casualty insurance segments. The renewal premium increase was largely due to average renewal price increases and a higher level of insured exposures. Price increases with enhanced precision continue to benefit operating results.\nCincinnati Financial Corporation - 2024 10-K - Page 60\nTable of Contents\nNew business written premiums produced through agencies increased $364 million in 2024, compared with 2023. Agents appointed during 2024 or 2023 produced a 2024 increase in standard lines new business of $116 million. Growth initiatives also favorably affect growth in subsequent years, particularly as newer agency relationships mature over time. \nCincinnati Re produced $597 million of 2024 net written premiums and contributed $39 million to growth in other written premiums, compared with 2023. Cincinnati Re assumes risks through reinsurance treaties and in some cases cedes part of the risk and related premiums to one or more unaffiliated reinsurance companies through transactions known as retrocessions. In 2024, earned premiums for Cincinnati Re totaled $573 million.\nCincinnati Global also contributed to the increase in other written premiums. Net written premiums were $303 million in 2024, and contributed $23 million of the growth in other written premiums, compared with 2023. In 2024, earned premiums for Cincinnati Global totaled $271 million.\nOther written premiums also include premiums ceded to reinsurers as part of our ceded reinsurance program. An increase in ceded premiums, other than Cincinnati Re and Cincinnati Global premiums, reduced net written premium growth by $49 million in 2024.\nThe table below analyzes premium revenue components and trends. \n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nAgency renewal written premiums\n$\n7,080\n \n$\n6,261 \n$\n5,665 \n13\n \n11 \nAgency new business written premiums\n1,541\n \n1,177 \n1,032 \n31\n \n14 \nOther written premiums\n622\n \n608 \n610 \n2\n \n0 \nNet written premiums\n9,243\n \n8,046 \n7,307 \n15\n \n10 \nUnearned premium change\n(675)\n(401)\n(383)\n(68)\n(5)\nEarned premiums\n$\n8,568\n \n$\n7,645 \n$\n6,924 \n12\n \n10 \n \n•\nCombined ratio – The combined ratio improved by 1.5 percentage points in 2024, compared with 2023, including a 0.2 percentage-point decrease in the ratio for catastrophe losses. The 2024 ratio for current accident year losses and loss expenses before catastrophes decreased by 1.8 percentage points. That ratio improvement included an increase of 1.4 points for the IBNR portion and a decrease of 3.2 points for the case incurred portion. Price increases and other underwriting efforts have helped to offset losses that have elevated significantly since 2021 due to inflation effects discussed below, as earned premiums in 2024 grew faster than those losses and loss expenses. The remainder of the 2024 combined ratio improvement included a decrease of 0.1 percentage points in the ratio for underwriting expenses, offset by 0.6 percentage points less benefit in the ratio for prior accident year losses and loss expenses before catastrophes. We further discuss ratios related to reserve development in the sections that follow the Catastrophe Losses Incurred table below.\nElevated inflation since 2021 has resulted in higher losses and loss expenses as costs have increased significantly to repair damaged autos or other property that we insure. We also experienced higher losses for liability coverages for some of our lines of business. Higher losses and loss expenses for various lines of business reflect increased uncertainty of estimated ultimate losses. Until longer-term paid loss cost trends become more clear, we intend to remain prudent in reserving for estimated ultimate losses. We believe future property casualty underwriting results will continue to benefit from price increases and our ongoing initiatives to improve pricing precision and loss experience related to claims and loss control practices.\nOur statutory combined ratio was 92.9% in 2024 compared with 94.6% in 2023 and 97.7% in 2022. The estimated statutory combined ratio for the property casualty industry, with the industry’s ratio excluding its mortgage and financial guaranty lines of business and based on industry data reported through the first nine months of 2024, was 97.9% in 2024, 103.7% in 2023 and 103.1% in 2022. The contribution of catastrophe losses to our statutory combined ratio was 8.4 percentage points in 2024, 8.8 percentage points in 2023 and 8.9 percentage points in 2022, compared with industry estimates of 8.8, 7.8 and 6.7 percentage points, respectively, with 2024 representing industry data reported through the first nine months of 2023. Components of the combined ratio are discussed below.\nCatastrophe loss trends are an important factor in assessing trends for overall underwriting results. Our 10-year historical annual average contribution of catastrophe losses to the combined ratio was 8.0 percentage points at December 31, 2024. Our five-year average was 9.2 percentage points. \nCincinnati Financial Corporation - 2024 10-K - Page 61\nTable of Contents\nEffective June 1, 2024, we restructured our reinsurance program for Cincinnati Re only, providing retrocession coverages with various triggers, exclusions and unique features. The program included property catastrophe excess of loss coverage with a total available aggregate limit of $60 million in excess of $80 million per occurrence. During 2024, there was no recovery from reinsurers for losses pertaining to this program. See Item 7, Liquidity and Capital Resources, 2025 Reinsurance Ceded Programs, for a discussion of other reinsurance coverage.\nThe following table shows catastrophe losses incurred for the past two calendar years, net of reinsurance, as well as the effect of loss development on prior period catastrophe reserves. We individually list declared catastrophe events for which our incurred losses reached or exceeded $25 million.\nCatastrophe Losses Incurred\n(Dollars in millions, net of reinsurance)\n \n \n \nExcess and surplus lines\n \n \n \n \nCommercial lines\nPersonal lines\n \nDates\nEvents\nRegions\nOther\nTotal\n2024\n \n \n \n \n \n \nMar. 12-17\nFlood, Lightning, Wind\nMidwest, South\n$\n30\n \n$\n31\n \n$\n—\n \n$\n—\n \n$\n61\n \nMar. 31 - Apr. 4\nFlood, Lightning, Wind\nMidwest, Northeast, South\n9\n \n23\n \n—\n \n—\n \n32\n \nMay 6-10\nFlood, Lightning, Wind\nMidwest, South\n25\n \n30\n \n1\n \n—\n \n56\n \nMay 25-26\nFlood, Lightning, Wind\nMidwest, South\n38\n \n29\n \n1\n \n—\n \n68\n \nJul. 13-18\nFlood, Lightning, Wind\nMidwest, Northeast\n18\n \n11\n \n—\n \n—\n \n29\n \nSep. 25-28\nFlood, Lightning, Wind\nMidwest, South (Helene)\n55\n \n133\n \n2\n \n43\n \n233\n \nOct. 9-10\nFlood, Lightning, Wind\nSouth (Milton)\n6\n \n3\n \n—\n \n61\n \n70\n \nAll other 2024 catastrophes\n \n92\n \n149\n \n4\n \n30\n \n275\n \nDevelopment on 2023 and prior catastrophes\n(31)\n(43)\n—\n \n(21)\n(95)\nCalendar year incurred total\n \n$\n242\n \n$\n366\n \n$\n8\n \n$\n113\n \n$\n729\n \n2023\n \n \n \n \n \n \nMar. 1-4\nFlood, Lightning, Wind\nMidwest, Northeast, South\n$\n25 \n$\n26 \n$\n1 \n$\n2 \n$\n54 \nMar. 23-28\nFlood, Lightning, Wind\nMidwest, Northeast, South\n21 \n23 \n— \n— \n44 \nMar. 30 - Apr. 1\nFlood, Lightning, Wind\nMidwest, Northeast, South\n58 \n31 \n— \n— \n89 \nApr. 3-7\nFlood, Lightning, Wind\nMidwest, Northeast, South\n12 \n33 \n— \n— \n45 \nMay 2-9\nFlood, Lightning, Wind\nMidwest, South\n22 \n7 \n— \n— \n29 \nJun. 21-27\nFlood, Lightning, Wind\nMidwest, Northeast, South, West\n21 \n18 \n— \n— \n39 \nJun. 28 - Jul. 4\nFlood, Lightning, Wind\nMidwest, Northeast, South, West\n9 \n16 \n— \n— \n25 \nDec. 9-11\nFlood, Lightning, Wind\nNortheast, South\n23 \n14 \n— \n— \n37 \nAll other 2023 catastrophes\n \n125 \n184 \n3 \n36 \n348 \nDevelopment on 2022 and prior catastrophes\n(11)\n(44)\n— \n8 \n(47)\nCalendar year incurred total\n \n$\n305 \n$\n308 \n$\n4 \n$\n46 \n$\n663 \nCincinnati Financial Corporation - 2024 10-K - Page 62\nTable of Contents\nConsolidated Property Casualty Insurance Loss and Loss Expenses\nLoss and loss expenses include both net paid losses and reserve changes for unpaid losses as well as the associated loss expenses. For all property casualty lines of business in aggregate, net loss and loss expense reserves at December 31, 2024, were $1.055 billion higher than at year-end 2023, including $998 million for incurred but not reported (IBNR) reserves. The $1.055 billion reserve increase raised year-end 2023 net loss and loss expense reserves by 12%, matching a 12% increase in 2024 earned premiums. \nMost of the incurred losses and loss expenses shown in the consolidated property casualty insurance results three-year highlights table are for the respective current accident years, with reserve development on prior accident years shown separately. Since less than half of our consolidated property casualty current accident year incurred losses and loss expenses represents net paid amounts, the majority represents reserves for our estimate of ultimate losses and loss expenses. These reserves develop over time, and we re-estimate previously reported reserves as we learn more about the development of the related claims. The table below illustrates that development. For example, the 67.7% accident year 2023 loss and loss expense ratio reported as of December 31, 2023, developed favorably by 4.9 percentage points to 62.8% due to claims settling for less than previously estimated, or due to updated reserve estimates for unpaid claims, as of December 31, 2024. Accident years 2023 and 2022 have both developed favorably, as indicated by the progression over time for the ratios in the table.\n(Dollars in millions)\n \n \n \n \n \n \nAccident year loss and loss expenses incurred and ratios to earned premiums:\n \n \n \nAccident year:\n2024\n2023\n2022\n2024\n2023\n2022\nas of December 31, 2024\n$\n5,672\n \n$\n4,804\n \n$\n4,674\n \n66.2\n \n%\n62.8\n \n%\n67.5\n \n%\nas of December 31, 2023\n \n5,173 \n4,737 \n \n67.7 \n68.4 \nas of December 31, 2022\n \n \n4,875 \n \n \n70.4 \n \nCatastrophe loss trends, discussed above, accounted for some of the movement in the current accident year loss and loss expense ratio for 2024, compared with 2023. Catastrophe losses added 9.6 percentage points in 2024, 9.3 points in 2023 and 10.2 points in 2022 to the respective consolidated property casualty current accident year loss and loss expense ratios in the table above.\n \nThe 56.6% ratio for current accident year loss and loss expenses before catastrophe losses for 2024 decreased 1.8 percentage points compared with the 58.4% accident year 2023 ratio measured as of December 31, 2023. The decrease included a 1.4 percentage-point decrease in the ratio for current accident year losses of $2 million or more per claim, shown in the table below.\n \nReserve development on prior accident years continued to net to a favorable amount in 2024, and was primarily due to less-than-anticipated loss emergence on known claims. We recognized $236\n \nmillion of favorable development in 2024, compared with $215 million in 2023 and $159 million in 2022. Of the $21 million increase in 2024, compared with 2023, $19 million was attributable to our commercial property line of business. Approximately 89% of our net favorable reserve development on prior accident years recognized during 2024 occurred in our workers' compensation, commercial property and homeowner lines of business. In 2023, our workers' compensation, commercial property and homeowner lines of business were responsible for approximately 80% of the favorable reserve development. As discussed in Liquidity and Capital Resources, Property Casualty Loss and Loss Expense Obligations and Reserves, Property Casualty Insurance Development of Estimated Reserves by Accident Year, commercial casualty and workers' compensation are considered long-tail lines with the potential for revisions inherent in estimating reserves. Favorable development recognized during 2022 was primarily from our workers’ compensation and homeowner lines of business. Development by accident year is further discussed in Liquidity and Capital Resources, Property Casualty Insurance Development of Estimated Reserves by Accident Year.\n \nCincinnati Financial Corporation - 2024 10-K - Page 63\nTable of Contents\nConsolidated Property Casualty Insurance Losses by Size\n(Dollars in millions, net of reinsurance)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nCurrent accident year losses greater than $5,000,000\n$\n68\n \n$\n141 \n$\n143 \n(52)\n(1)\nCurrent accident year losses $2,000,000-$5,000,000\n138\n \n144 \n135 \n(4)\n7 \nLarge loss prior accident year reserve development\n75\n \n94 \n30 \n(20)\n213 \nTotal large losses incurred\n281\n \n379 \n308 \n(26)\n23 \nLosses incurred but not reported\n783\n \n596 \n377 \n31\n \n58 \nOther losses excluding catastrophe losses\n2,782\n \n2,571 \n2,737 \n8\n \n(6)\nCatastrophe losses\n704\n \n634 \n612 \n11\n \n4 \nTotal losses incurred\n$\n4,550\n \n$\n4,180 \n$\n4,034 \n9\n \n4 \nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCurrent accident year losses greater than $5,000,000\n0.8\n \n%\n1.9 \n%\n2.1 \n%\n(1.1)\n(0.2)\nCurrent accident year losses $2,000,000-$5,000,000\n1.6\n \n1.9 \n2.0 \n(0.3)\n(0.1)\nLarge loss prior accident year reserve development\n0.9\n \n1.2 \n0.4 \n(0.3)\n0.8 \nTotal large loss ratio\n3.3\n \n5.0 \n4.5 \n(1.7)\n0.5 \nLosses incurred but not reported\n9.1\n \n7.8 \n5.5 \n1.3\n \n2.3 \nOther losses excluding catastrophe losses\n32.5\n \n33.6 \n39.5 \n(1.1)\n(5.9)\nCatastrophe losses\n8.2\n \n8.3 \n8.8 \n(0.1)\n(0.5)\nTotal loss ratio\n53.1\n \n%\n54.7 \n%\n58.3 \n%\n(1.6)\n(3.6)\n \nIn 2024, total large losses incurred decreased by $98 million, or 26%, net of reinsurance, primarily due to a decrease for our commercial lines insurance segment. The corresponding 2024 ratio decreased 1.7 percentage points, compared with 2023. The large loss data included in the table above does not include Cincinnati Re and Cincinnati Global. Our analysis of large losses incurred indicated no unexpected concentration of these losses and reserve increases by geographic region, policy inception, agency or field marketing territory. We believe the inherent volatility of aggregate loss experience for our portfolio of larger policies is greater than that of our portfolio of smaller policies, and we continue to monitor the volatility in addition to general inflationary trends in loss costs.\n \nCincinnati Financial Corporation - 2024 10-K - Page 64\nTable of Contents\nConsolidated Property Casualty Insurance Underwriting Expenses\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nCommission expenses\n$\n1,605\n \n$\n1,438 \n$\n1,319 \n12\n \n9 \nOther underwriting expenses\n953\n \n854 \n753 \n12\n \n13 \nPolicyholder dividends\n6\n \n5 \n6 \n20\n \n(17)\nTotal underwriting expenses\n$\n2,564\n \n$\n2,297 \n$\n2,078 \n12\n \n11 \nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCommission expenses\n18.7\n \n%\n18.8 \n%\n19.1 \n%\n(0.1)\n(0.3)\nOther underwriting expenses\n11.1\n \n11.1 \n10.8 \n0.0\n \n0.3 \nPolicyholder dividends\n0.1\n \n0.1 \n0.1 \n0.0\n \n0.0 \nTotal underwriting expense ratio\n29.9\n \n%\n30.0 \n%\n30.0 \n%\n(0.1)\n0.0 \n \nConsolidated property casualty commission expenses rose $167 million, or 12%, in 2024, with profit-sharing commissions for agencies increasing by $18 million. The 2024 ratio of commission expenses as a percent of earned premiums decreased by 0.1 percentage points, compared with 2023. The ratio for 2023 decreased compared with 2022. In 2024, other underwriting expenses as a percent of earned premiums matched 2023, as earned premiums kept pace with other underwriting expenses. In 2023, other underwriting expenses as a percent of earned premiums increased, compared with 2022, as earned premiums rose at a slower pace than other underwriting expenses. The three-year period ending in 2024 also included ongoing expense management efforts. \n \nCommission expenses include our profit-sharing commissions, which are primarily based on one-year and three-year profitability of an agency’s business. The aggregate profit trend for agencies that earn these profit-based commissions can differ from the aggregate profit trend for all agencies reflected in our consolidated property casualty results. \n \nSalaries, benefits and payroll taxes for our associates account for approximately half of our property casualty other underwriting expenses. Most of our associates either provide direct service to the property casualty portion of our agencies’ businesses or provide support to those associates. \n \nDiscussions below of our property casualty insurance segments provide additional details about our results.\nCincinnati Financial Corporation - 2024 10-K - Page 65\nTable of Contents\nCommercial Lines Insurance Results\n \nOverview – Three-Year Highlights\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nEarned premiums\n$\n4,486\n \n$\n4,264 \n$\n4,024 \n5\n \n6 \nFee revenues\n4\n \n4 \n4 \n0\n \n0 \nTotal revenues\n4,490\n \n4,268 \n4,028 \n5\n \n6 \nLoss and loss expenses from:\n \n \n \n \nCurrent accident year before catastrophe losses\n2,660\n \n2,594 \n2,530 \n3\n \n3 \nCurrent accident year catastrophe losses\n273\n \n316 \n307 \n(14)\n3 \nPrior accident years before catastrophe losses\n(107)\n(112)\n(53)\n4\n \n(111)\nPrior accident years catastrophe losses\n(31)\n(11)\n(23)\n(182)\n52 \nLoss and loss expenses\n2,795\n \n2,787 \n2,761 \n0\n \n1 \nUnderwriting expenses\n1,384\n \n1,313 \n1,229 \n5\n \n7 \nUnderwriting profit\n$\n311\n \n$\n168 \n$\n38 \n85\n \n342 \nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCurrent accident year before catastrophe losses\n59.3\n \n%\n60.8 \n%\n62.9 \n%\n(1.5)\n(2.1)\nCurrent accident year catastrophe losses\n6.1\n \n7.4 \n7.6 \n(1.3)\n(0.2)\nPrior accident years before catastrophe losses\n(2.4)\n(2.6)\n(1.3)\n0.2\n \n(1.3)\nPrior accident years catastrophe losses\n(0.7)\n(0.2)\n(0.6)\n(0.5)\n0.4 \nLoss and loss expenses\n62.3\n \n65.4 \n68.6 \n(3.1)\n(3.2)\nUnderwriting expenses\n30.9\n \n30.8 \n30.6 \n0.1\n \n0.2 \nCombined ratio\n93.2\n \n%\n96.2 \n%\n99.2 \n%\n(3.0)\n(3.0)\nCombined ratio:\n93.2\n \n%\n96.2 \n%\n99.2 \n%\n(3.0)\n(3.0)\nContribution from catastrophe losses and prior years\n    reserve development\n3.0\n \n4.6 \n5.7 \n(1.6)\n(1.1)\nCombined ratio before catastrophe losses and prior years\n    reserve development\n90.2\n \n%\n91.6 \n%\n93.5 \n%\n(1.4)\n(1.9)\n \nPerformance highlights for the commercial lines insurance segment include:\n•\nPremiums – Earned premiums and net written premiums rose in 2024, including a $211 million, or 5%, increase in renewal written premiums that continued to include higher average pricing and a higher level of insured exposures. New business written premiums in 2024 increased $157 million, or 27%, compared with 2023, as we continued to carefully underwrite each policy in a highly competitive market. \n•\nCombined ratio – The 2024 combined ratio improved by 3.0 percentage points compared with 2023, including a 1.8 percentage-point decrease in the ratio component for catastrophe losses. The 2024 combined ratio also improved by 1.5 points due to a lower ratio for current accident year loss and loss expenses before catastrophe losses, compared with 2023. That ratio improvement included an increase of 2.9 points for the IBNR portion and a decrease of 4.4 points for the case incurred portion. Price increases and other underwriting actions have helped offset losses that have elevated significantly since 2021 due to inflation effects, as earned premiums in 2024 grew faster than those losses and loss expenses. Development on prior accident years loss and loss expense reserves before catastrophes during 2024 was 0.2 percentage points less favorable than in 2023, as discussed below.\nWhen estimating the ultimate cost of total loss and loss expenses, we consider many factors, including trends for inflation, historical paid and reported losses, large loss activity and other data or information for the industry or our company. Elevated inflation since 2021 has resulted in higher losses and loss expenses as costs have increased significantly to repair damaged business property or autos that we insure, in addition to higher losses for liability coverages for some of our lines of business. Due to increased uncertainty regarding ultimate losses, we intend to remain prudent in reserving for estimated ultimate losses until longer-term loss cost trends become more clear.\n \nCincinnati Financial Corporation - 2024 10-K - Page 66\nTable of Contents\nPricing precision and other initiatives to improve commercial lines underwriting profitability complement our business practices that continue to leverage the local presence of our field associates. Field marketing representatives meet with local agencies to assess each risk, determine limits of insurance and establish appropriate terms and conditions. They underwrite new business, with collaboration and expertise from headquarters associates as needed, while field loss control, machinery and equipment and claims representatives conduct on-site inspections. Field claims representatives also assist underwriters by preparing full reports on their first-hand observations of risk quality.\nOur commercial lines statutory combined ratio was 92.2% in 2024, compared with 95.6% in 2023 and 98.5% in 2022. The contribution of catastrophe losses to our commercial lines statutory combined ratio was 5.4 percentage points in 2024, 7.2 percentage points in 2023 and 7.0 percentage points in 2022.\nCommercial Lines Insurance Premiums\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nAgency renewal written premiums\n$\n4,087\n \n$\n3,876 \n$\n3,672 \n5\n \n6 \nAgency new business written premiums\n741\n \n584 \n600 \n27\n \n(3)\nOther written premiums\n(138)\n(124)\n(113)\n(11)\n(10)\nNet written premiums\n4,690\n \n4,336 \n4,159 \n8\n \n4 \nUnearned premium change\n(204)\n(72)\n(135)\n(183)\n47 \nEarned premiums\n$\n4,486\n \n$\n4,264 \n$\n4,024 \n5\n \n6 \n \nWe continue to refine our use of predictive analytics tools to improve pricing precision as we further segment commercial lines policies, emphasizing identification and retention of policies we believe have relatively stronger price adequacy. These tools better align individual insurance policy pricing to risk attributes, providing our underwriters with enhanced abilities to target profitability and to discuss pricing impacts with our agencies. We also continue to leverage our local relationships with agents through the efforts of our teams that work closely with them. We believe our field focus is unique and has several advantages, including providing us with quality intelligence on local market conditions. We seek to maintain appropriate pricing discipline for both new and renewal business as management continues to emphasize the importance of our agencies and underwriters assessing account quality to make careful decisions on a case-by-case basis whether to write new business or renew a policy. Premium rate credits may be used to retain renewals of quality business and to earn new business, but we do so selectively in order to avoid commercial accounts that we believe have insufficient profit margins.\n \nOur 5% increase in 2024 agency renewal written premiums included higher average pricing. We measure average changes in commercial lines renewal pricing as the rate of change in renewal premium for the new policy period compared with the premium for the expiring policy period, assuming no change in the level of insured exposures or policy coverage between those periods for respective policies. In 2024, our standard commercial lines policies averaged an estimated pricing change at a percentage near the low end of the high-single-digit range. Our average commercial lines pricing change includes the flat pricing effect of certain coverages within package policies written for a three-year term that were in force but did not expire during the period being measured. Therefore, the average commercial lines pricing change we report reflects a blend of policies that did not expire and other policies that did expire during the measurement period. \nCincinnati Financial Corporation - 2024 10-K - Page 67\nTable of Contents\nFor only those commercial lines policies that did expire and were then renewed during 2024, we estimate that the average price increase was at a percentage in the high-single-digit range. During 2024, we continued to further segment our commercial lines policies, emphasizing identification and retention of policies we believed had relatively stronger price adequacy. Conversely, we continued to seek more aggressive renewal terms and conditions on policies we believed had relatively weaker pricing, in turn retaining fewer of those policies.  \nOur 2024 increase of 5% for the commercial lines segment's agency renewal written premiums also included a higher level of insured exposures, in addition to other factors such as changes in policy retention rates or changes in mix of business that can cause variations in average premiums per policy. Part of the insured exposure increase reflects our response to inflation effects that increase the cost of building materials to repair damaged commercial structures. We use building valuation software to automate much of that underwriting process and may also manually adjust premiums to reflect property costs.\nChanges in the economy can affect insured exposures that directly relate to premium amounts charged for some policies. For commercial accounts, we usually calculate initial estimates for general liability premiums based on estimated sales or payroll volume, while we calculate workers’ compensation premiums based on estimated payroll volume. A change in sales or payroll volume generally indicates a change in demand for a business’s goods or services, as well as a change in its exposure to risk. Policyholders who experience sales or payroll volume changes due to economic factors may also have other exposures requiring insurance, such as commercial auto or commercial property. Premium levels for these other types of coverages generally are not linked directly to sales or payroll volumes.\nPremiums resulting from audits of actual sales or payrolls that confirmed or adjusted initial premium estimates are part of net written premiums and earned premiums. They also contribute to increases or decreases in our agency renewal written premiums. The contribution to our commercial lines earned premiums was $107 million, $157 million and $127 million in 2024, 2023 and 2022, respectively. The contribution on a net written premium basis was $108 million, $136 million and $101 million in 2024, 2023 and 2022, respectively. These net written premium amounts are included with agency renewal written premiums in the Commercial Lines Insurance Premiums table above.\n \nIn 2024, our commercial lines new business premiums written by our agencies increased $157 million, or 27%, compared with 2023, as we continued to carefully underwrite each policy in a highly competitive market. New business premium volume in recent years has been significantly influenced by new agency appointments. Agencies appointed since the beginning of 2023 produced commercial lines new business written premiums of $72 million, in aggregate, during 2024, up $56 million from what they produced during 2023. All other agencies contributed the remaining $669 million, up $101 million from the $568 million they produced in 2023.\nFor new business, our field associates are frequently meeting with our agents to: help judge the quality of each account; emphasize the Cincinnati value proposition; call on sales prospects with those agents; and provide appropriate quotes after carefully evaluating risk exposures. Some of our new business comes from accounts that are not new to the agent. We believe these seasoned accounts tend to be priced more accurately than business that is new to us and the agency. As we appoint new agencies who choose to move accounts to us, we report these accounts as new business to us.\nOther written premiums primarily consist of premiums that are ceded to reinsurers and lower our net written premiums. An increase in ceded premiums reduced net written premium growth by $20 million in 2024. \nCincinnati Financial Corporation - 2024 10-K - Page 68\nTable of Contents\nCommercial Lines Insurance Loss and Loss Expenses\nLoss and loss expenses include both net paid losses and reserve changes for unpaid losses as well as the associated loss expenses. Most of the incurred losses and loss expenses shown in the commercial lines insurance segment three-year highlights table are for the respective current accident years, with reserve development on prior accident years shown separately. Since less than half of our commercial lines insurance segment current accident year incurred losses and loss expenses represents net paid amounts, the majority represents reserves for our estimate of ultimate losses and loss expenses. These reserves develop over time, and we re-estimate previously reported reserves as we learn more about development on the related claims. The table below illustrates that development. For example, the 68.2% accident year 2023 loss and loss expense ratio reported as of December 31, 2023, developed favorably by 5.0 percentage points to 63.2% due to claims settling for less than previously estimated, or due to updates to reserve estimates for unpaid claims, as of December 31, 2024. Accident years 2023 and 2022 for the commercial lines insurance segment have both developed favorably, as indicated by the progression over time of the ratios in the table.\n(Dollars in millions)\n \n \n \n \n \n \nAccident year loss and loss expenses incurred and ratios to earned premiums:\n \n \n \nAccident year:\n2024\n2023\n2022\n2024\n2023\n2022\nas of December 31, 2024\n$\n2,933\n \n$\n2,693\n \n$\n2,680\n \n65.4\n \n%\n63.2\n \n%\n66.6\n \n%\nas of December 31, 2023\n \n2,910 \n2,769 \n \n68.2 \n68.8 \nas of December 31, 2022\n \n \n2,837 \n \n \n70.5 \n \nCatastrophe losses, as discussed in Consolidated Property Casualty Insurance Results, explain some of the movement in the current accident year loss and loss expense ratio for accident year 2024, compared with 2023. Catastrophe losses added 6.1 percentage points in 2024, 7.4 points in 2023 and 7.6 points in 2022 to the respective commercial lines current accident year loss and loss expense ratios in the table above.\nThe 59.3% ratio for current accident year loss and loss expenses before catastrophe losses for 2024 decreased 1.5 percentage points compared with the 60.8% accident year 2023 ratio measured as of December 31, 2023. The change included a decrease in large losses incurred, described below including a table with corresponding ratios for new losses above $2 million, with a 2.2 percentage-point decrease in the 2024 ratio. Contributions to the ratio decrease included inflation effects that were offset by the favorable impact from various initiatives, such as those to improve pricing precision, risk selection and loss experience related to claims and loss control practices.\n \nCommercial lines reserve development on prior accident years of $138 million in 2024 continued to net to a favorable amount and provided a larger benefit than the $123 million recognized in 2023. The $15 million net increase in 2024, compared with 2023, included $19 million from our commercial property line of business and $17 million from our workers' compensation line of business, partially offset by an $11 million decrease from our commercial casualty line of business. Most of our commercial lines net favorable reserve development on prior accident years recognized during 2024 occurred in our workers’ compensation and commercial property lines of business. Favorable development recognized during 2023 and 2022 was also mostly from our workers’ compensation and commercial property lines of business. As discussed in Critical Accounting Estimates, Property Casualty Insurance Loss and Loss Expense Reserves, stable paid and reported loss patterns are a key assumption used to make projections necessary for estimating IBNR reserves. Development by accident year and other trends for commercial lines loss and loss expenses and the related ratios are further discussed in Liquidity and Capital Resources, Property Casualty Insurance Development of Estimated Reserves by Accident Year.\n \nCincinnati Financial Corporation - 2024 10-K - Page 69\nTable of Contents\nCommercial Lines Insurance Losses by Size\n(Dollars in millions, net of reinsurance)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nCurrent accident year losses greater than $5,000,000\n$\n51\n \n$\n109 \n$\n95 \n(53)\n15 \nCurrent accident year losses $2,000,000-$5,000,000\n70\n \n99 \n103 \n(29)\n(4)\nLarge loss prior accident year reserve development\n73\n \n89 \n26 \n(18)\n242 \nTotal large losses incurred\n194\n \n297 \n224 \n(35)\n33 \nLosses incurred but not reported\n470\n \n328 \n304 \n43\n \n8 \nOther losses excluding catastrophe losses\n1,417\n \n1,393 \n1,535 \n2\n \n(9)\nCatastrophe losses\n231\n \n291 \n275 \n(21)\n6 \nTotal losses incurred\n$\n2,312\n \n$\n2,309 \n$\n2,338 \n0\n \n(1)\nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCurrent accident year losses greater than $5,000,000\n1.1\n \n%\n2.5 \n%\n2.4 \n%\n(1.4)\n0.1 \nCurrent accident year losses $2,000,000-$5,000,000\n1.5\n \n2.3 \n2.6 \n(0.8)\n(0.3)\nLarge loss prior accident year reserve development\n1.7\n \n2.1 \n0.6 \n(0.4)\n1.5 \nTotal large loss ratio\n4.3\n \n6.9 \n5.6 \n(2.6)\n1.3 \nLosses incurred but not reported\n10.5\n \n7.7 \n7.6 \n2.8\n \n0.1 \nOther losses excluding catastrophe losses\n31.5\n \n32.7 \n38.1 \n(1.2)\n(5.4)\nCatastrophe losses\n5.2\n \n6.8 \n6.8 \n(1.6)\n0.0 \nTotal loss ratio\n51.5\n \n%\n54.1 \n%\n58.1 \n%\n(2.6)\n(4.0)\n \nIn 2024, total large losses incurred decreased by $103 million, or 35%, net of reinsurance. The corresponding 2024 ratio decreased 2.6 percentage points, compared with 2023. The 2024 decrease on a dollar basis was primarily due to a decrease of $116 million for our commercial property line of business. In 2023, total large losses incurred and the corresponding ratio were higher than in 2022, largely due to higher amounts of large losses for our commercial property line of business. Our analysis indicated no unexpected concentration of these losses and reserve increases by geographic region, policy inception, agency or field marketing territory. We believe the inherent volatility of aggregate loss experience for our portfolio of larger policies is greater than that of our portfolio of smaller policies, and we continue to monitor the volatility in addition to general inflationary trends in loss costs.\n \nCommercial Lines Insurance Underwriting Expenses\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nCommission expenses\n$\n818\n \n$\n780 \n$\n741 \n5\n \n5 \nOther underwriting expenses\n560\n \n528 \n482 \n6\n \n10 \nPolicyholder dividends\n6\n \n5 \n6 \n20\n \n(17)\nTotal underwriting expenses\n$\n1,384\n \n$\n1,313 \n$\n1,229 \n5\n \n7 \nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCommission expenses\n18.2\n \n%\n18.3 \n%\n18.4 \n%\n(0.1)\n(0.1)\nOther underwriting expenses\n12.6\n \n12.4 \n12.0 \n0.2\n \n0.4 \nPolicyholder dividends\n0.1\n \n0.1 \n0.2 \n0.0\n \n(0.1)\nTotal underwriting expense ratio\n30.9\n \n%\n30.8 \n%\n30.6 \n%\n0.1\n \n0.2 \n \nCommercial lines commission expenses as a percent of earned premiums decreased slightly in 2024, compared with 2023, reflecting a decrease in the ratio for profit-sharing commissions for agencies. The ratio for 2023 decreased slightly compared with 2022. In 2024, other underwriting expenses as a percent of earned premiums increased, compared with 2023, as earned premiums rose at a slower pace than other underwriting expenses, primarily employee-related expenses. In 2023, other underwriting expenses as a percent of earned premiums increased, compared with 2022, as earned premiums rose at a slower pace than other underwriting expenses. The three-year period ending in 2024 also included ongoing expense management efforts. \nCincinnati Financial Corporation - 2024 10-K - Page 70\nTable of Contents\n \nCommercial Lines Insurance Outlook\nRenewal and new business pricing for commercial risks continues to experience significant inflationary and competitive pressure, and we continue to respond with enhanced pricing analytics and careful risk selection. We are committed to our agencies and focus on a long-term strategy when considering how to successfully navigate changing, and often challenging, market pressures and conditions while profitably growing our commercial lines insurance segment. \nWe intend to grow through additional agency appointments, expansion of our local field presence, enhanced expertise and product expansion that meets the needs of an even larger percentage of our agencies' total commercial portfolio. Our goal is to provide flexibility in our process so that we can deliver an industry-leading agency experience to all of our agents as we work to be the first and last solution when they are considering business placement.\nWe intend to keep marketing our products to a broad range of business classes with a total account approach, while also continuing to diversify our book of business. Work continues to improve our pricing precision and further segment commercial risks as underwriters emphasize underwriting discipline and careful management of rate levels. They seek to accurately match exposures with appropriate premiums, evaluating each risk on a policy-by-policy basis for decisions about rates, terms and conditions based on each account’s individual characteristics. We believe that our initiatives to improve pricing precision and lower loss costs will continue to benefit commercial lines profitability during 2025.\nCincinnati Financial Corporation - 2024 10-K - Page 71\nTable of Contents\nPersonal Lines Insurance Results\n \nOverview – Three-Year Highlights\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nEarned premiums\n$\n2,623\n \n$\n2,044 \n$\n1,689 \n28\n \n21 \nFee revenues\n5\n \n4 \n4 \n25\n \n0 \nTotal revenues\n2,628\n \n2,048 \n1,693 \n28\n \n21 \nLoss and loss expenses from:\n \n \n \n \nCurrent accident year before catastrophe losses\n1,412\n \n1,154 \n991 \n22\n \n16 \nCurrent accident year catastrophe losses\n409\n \n352 \n236 \n16\n \n49 \nPrior accident years before catastrophe losses\n17\n \n(20)\n(17)\nnm\n(18)\nPrior accident years catastrophe losses\n(43)\n(44)\n(44)\n2\n \n0 \nLoss and loss expenses\n1,795\n \n1,442 \n1,166 \n24\n \n24 \nUnderwriting expenses\n762\n \n610 \n509 \n25\n \n20 \nUnderwriting profit (loss)\n$\n71\n \n$\n(4)\n$\n18 \nnm\nnm\nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCurrent accident year before catastrophe losses\n53.9\n \n%\n56.4 \n%\n58.7 \n%\n(2.5)\n(2.3)\nCurrent accident year catastrophe losses\n15.6\n \n17.3 \n14.0 \n(1.7)\n3.3 \nPrior accident years before catastrophe losses\n0.7\n \n(1.0)\n(1.0)\n1.7\n \n0.0 \nPrior accident years catastrophe losses\n(1.7)\n(2.2)\n(2.6)\n0.5\n \n0.4 \nLoss and loss expenses\n68.5\n \n70.5 \n69.1 \n(2.0)\n1.4 \nUnderwriting expenses\n29.0\n \n29.9 \n30.1 \n(0.9)\n(0.2)\nCombined ratio\n97.5\n \n%\n100.4 \n%\n99.2 \n%\n(2.9)\n1.2 \nCombined ratio:\n97.5\n \n%\n100.4 \n%\n99.2 \n%\n(2.9)\n1.2 \nContribution from catastrophe losses and prior years\n    reserve development\n14.6\n \n14.1 \n10.4 \n0.5\n \n3.7 \nCombined ratio before catastrophe losses and prior years\n    reserve development\n82.9\n \n%\n86.3 \n%\n88.8 \n%\n(3.4)\n(2.5)\n \nPerformance highlights for the personal lines insurance segment include:\n•\nPremiums – Earned premiums and net written premiums continued to grow in 2024, due to increases in new business written premiums and renewal written premiums that included higher average pricing and a higher level of insured exposures. Renewal written premiums rose $538 million, or 27%, in 2024, compared with 2023, while new business written premiums rose $188 million, or 45%. Cincinnati Private Client\nSM \nnet written premiums, included in the personal lines insurance segment, rose $462 million, or 37%, to approximately $1.719 billion in 2024, representing 57.3% of the segment's 2024 net written premiums. Cincinnati Private Client net written premiums included excess and surplus lines homeowner policies with premiums totaling $166 million in 2024 and $109 million in 2023.  \n•\nCombined ratio – The 2024 combined ratio improved by 2.9 percentage points, compared with 2023, including a decrease of 1.2 points in the ratio for catastrophe losses. The improvement also included 2.5 points from a lower ratio for current accident year loss and loss expenses before catastrophe losses. That ratio decrease included an increase of 2.0 points for the IBNR portion and a decrease of 4.5 points for the case incurred portion. Price increases and other underwriting efforts have helped to offset losses that have elevated significantly since 2021 due to inflation effects, as earned premiums in 2024 grew faster than those losses and loss expenses. The ratio decreases for catastrophe losses and current accident year results were partially offset by an increase of 1.7 points from reserve development on prior accident year loss and loss expenses before catastrophes during 2024 that was unfavorable by 0.7 points compared with favorable development of 1.0 points in 2023.\nWhen estimating the ultimate cost of total loss and loss expenses, we consider many factors, including trends for inflation, historical paid and reported losses, large loss activity and other data or information for the industry or our \nCincinnati Financial Corporation - 2024 10-K - Page 72\nTable of Contents\ncompany. Elevated inflation since 2021 has resulted in higher losses and loss expenses as costs have increased significantly to repair damaged autos or homes that we insure, in addition to higher losses for liability coverages for some of our lines of business. Due to increased uncertainty regarding ultimate losses, we intend to remain prudent in reserving for estimated ultimate losses until longer-term loss cost trends become more clear.\nWe have increased our pricing precision and implemented numerous rate increases in recent years to improve our personal lines insurance segment results. In addition, we have made greater use of higher minimum loss deductibles and enhanced our property inspection processes to verify condition and insurance to value. We have worked to improve our geographic diversification by expanding our personal lines operation to additional states as the type of catastrophe risk can vary by state. \nOur personal lines statutory combined ratio was 95.5% in 2024, compared with 98.3% in 2023 and 97.7% in 2022. The contribution of catastrophe losses to our personal lines statutory combined ratio was 13.9 percentage points in 2024, 15.1 percentage points in 2023 and 11.4 percentage points in 2022.\n \nPersonal Lines Insurance Premiums\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nAgency renewal written premiums\n$\n2,495\n \n$\n1,957 \n$\n1,601 \n27\n \n22 \nAgency new business written premiums\n604\n \n416 \n296 \n45\n \n41 \nOther written premiums\n(100)\n(71)\n(66)\n(41)\n(8)\nNet written premiums\n2,999\n \n2,302 \n1,831 \n30\n \n26 \nUnearned premium change\n(376)\n(258)\n(142)\n(46)\n(82)\nEarned premiums\n$\n2,623\n \n$\n2,044 \n$\n1,689 \n28\n \n21 \n \nPersonal lines insurance is a strategic component of our overall relationship with most of our agencies and is an important component of our agencies’ relationships with their clients. We believe agents recommend our personal insurance products to their clients who seek to balance quality and price and who are attracted by our superior claims service and the benefits of our package approach. We also believe our continuing efforts to improve pricing precision are helping us attract and retain more of our agencies’ preferred business, while also obtaining higher rates for more thinly priced business. \n \nThe 27% increase in agency renewal written premiums in 2024 included the effect of various rate changes. We estimate that premium rates for our personal auto line of business increased at an average percentage in the low-double-digit range during 2024, with some individual policies experiencing lower or higher rate changes based on enhanced pricing precision enabled by predictive models that consider characteristics of specific risks. For our homeowner line of business, we estimate that price increases during 2024 averaged a percentage in the high-single-digit range. Similar to our personal auto line of business, that average varied widely by state, and some individual policies experienced lower or higher rate changes based on pricing precision and current rate level indications that helped determine appropriate premium rates.\n \nThe increase in agency renewal written premiums in 2024 also included a higher level of insured exposures and other factors such as changes in policy deductibles or mix of business. Part of the insured exposure increase reflects our response to inflation effects that increase the cost of building materials to repair damaged homes.\nPersonal lines new business written premiums grew by $188 million, or 45%, during 2024, compared with 2023, including approximately $89 million from Cincinnati Private Client policies and $99 million from middle-market policies. We believe we maintained underwriting and pricing discipline across all personal lines markets as we expanded use of enhanced pricing precision tools. Some of what we report as new business came from accounts that were not new to our agents. We believe our agents’ seasoned accounts tend to be priced more accurately than business that may be less familiar to them.\nOther written premiums primarily consist of premiums that are ceded to reinsurers and lower our net written premiums. An increase in ceded premiums reduced net written premium growth by $28 million in 2024. \n \nCincinnati Financial Corporation - 2024 10-K - Page 73\nTable of Contents\nPersonal Lines Insurance Loss and Loss Expenses\nLoss and loss expenses include both net paid losses and reserve changes for unpaid losses as well as the associated loss expenses. Most of the incurred losses and loss expenses shown in the personal lines insurance segment three-year highlights table are for the respective current accident years, with reserve development on prior accident years shown separately. Since approximately two-thirds of our personal lines current accident year incurred losses and loss expenses represent net paid amounts, the remaining one-third represents reserves for our estimate of ultimate losses and loss expenses. These reserves develop over time, and we re-estimate previously reported reserves as we learn more about the development on the related claims. The table below illustrates that development. For example, the 73.7% accident year 2023 loss and loss expense ratio reported as of December 31, 2023, developed favorably by 2.6 percentage points to 71.1% due to claims settling for less than previously estimated, or due to updated reserve estimates for unpaid claims, as of December 31, 2024. Accident year 2022 for the personal lines segment developed favorably for the two-year period ending December 31, 2024, as indicated by the progression over time for the ratios in the table. It experienced a small amount of unfavorable development during 2024, driven by the personal auto line of business as described below, and favorable development during 2023. \n(Dollars in millions)\n \n \n \nAccident year loss and loss expenses incurred and ratios to earned premiums:\nAccident year:\n2024\n2023\n2022\n2024\n2023\n2022\nas of December 31, 2024\n$\n1,821\n \n$\n1,454\n \n$\n1,188\n \n69.5\n \n%\n71.1\n \n%\n70.4\n \n%\nas of December 31, 2023\n \n1,506 \n1,182 \n \n73.7 \n70.0 \nas of December 31, 2022\n \n \n1,227 \n \n \n72.7 \n \nCatastrophe losses, as discussed in Consolidated Property Casualty Insurance Results, explain some of the movement in the current accident year loss and loss expense ratio for accident year 2024, compared with accident year 2023. Catastrophe losses added 15.6 percentage points in 2024, 17.3 points in 2023 and 14.0 points in 2022 to the respective personal lines current accident year loss and loss expense ratios in the table above. Personal lines catastrophe losses for 2024 resulted in a ratio higher than our 11.4% 10-year annual average for personal lines. Personal lines catastrophe losses are inherently volatile, as discussed above and in Consolidated Property Casualty Insurance Results.\n \nThe 53.9% ratio for current accident year loss and loss expenses before catastrophe losses for 2024 improved 2.5 percentage points compared with the 56.4% accident year 2023 ratio measured as of December 31, 2023. The decrease included an improvement in the ratios for new losses above $2 million, with a 0.7 percentage-point decrease in the 2024 ratio. Other contributions included inflation effects that were offset by the favorable impact from various initiatives, such as those to improve pricing precision, risk selection and loss experience related to claims and loss control practices.\n \nPersonal lines loss and loss expense reserve development on prior accident years recognized in 2024 was favorable by $26 million, in aggregate, compared with $64 million in 2023. The 2024 net favorable reserve development included $54 million for our homeowner line of business offset by $20 million of unfavorable development for our personal auto line of business. The 2023 net favorable reserve development included $53 million for our homeowner line of business and $15 million for our personal auto line of business. As discussed in Critical Accounting Estimates, Property Casualty Insurance Loss and Loss Expense Reserves, stable paid and reported loss patterns are a key assumption used to make projections necessary for estimating IBNR reserves. Development by accident year and other trends for personal lines loss and loss expenses and the related ratios are further discussed in Liquidity and Capital Resources, Property Casualty Insurance Development of Estimated Reserves by Accident Year.\n \nCincinnati Financial Corporation - 2024 10-K - Page 74\nTable of Contents\nPersonal Lines Insurance Losses by Size\n(Dollars in millions, net of reinsurance)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nCurrent accident year losses greater than $5,000,000\n$\n17\n \n$\n32 \n$\n48 \n(47)\n(33)\nCurrent accident year losses $2,000,000-$5,000,000\n64\n \n45 \n30 \n42\n \n50 \nLarge loss prior accident year reserve development\n2\n \n7 \n4 \n(71)\n75 \nTotal large losses incurred\n83\n \n84 \n82 \n(1)\n2 \nLosses incurred but not reported\n108\n \n65 \n5 \n66\n \nnm\nOther losses excluding catastrophe losses\n988\n \n809 \n738 \n22\n \n10 \nCatastrophe losses\n353\n \n298 \n186 \n18\n \n60 \nTotal losses incurred\n$\n1,532\n \n$\n1,256 \n$\n1,011 \n22\n \n24 \nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCurrent accident year losses greater than $5,000,000\n0.7\n \n%\n1.6 \n%\n2.8 \n%\n(0.9)\n(1.2)\nCurrent accident year losses $2,000,000-$5,000,000\n2.4\n \n2.2 \n1.8 \n0.2\n \n0.4 \nLarge loss prior accident year reserve development\n0.1\n \n0.3 \n0.3 \n(0.2)\n0.0 \nTotal large loss ratio\n3.2\n \n4.1 \n4.9 \n(0.9)\n(0.8)\nLosses incurred but not reported\n4.1\n \n3.2 \n0.3 \n0.9\n \n2.9 \nOther losses excluding catastrophe losses\n37.6\n \n39.5 \n43.7 \n(1.9)\n(4.2)\nCatastrophe losses\n13.5\n \n14.6 \n11.0 \n(1.1)\n3.6 \nTotal loss ratio\n58.4\n \n%\n61.4 \n%\n59.9 \n%\n(3.0)\n1.5 \n \nIn 2024, personal lines total large losses incurred decreased by $1 million, or 1%, net of reinsurance. The corresponding 2024 ratio decreased 0.9 percentage points, compared with 2023. The 2024 decrease was primarily due to a lower amount for our homeowner line of business. In 2023, total large losses increased, compared with 2022, primarily due to higher amounts for our homeowner line of business. Our analysis indicated no unexpected concentration of these losses and reserve increases by risk category, geographic region, policy inception, agency or field marketing territory. We believe the inherent volatility of aggregate loss experience for our portfolio of larger policies is greater than that of our portfolio of smaller policies, and we continue to monitor the volatility in addition to general inflationary trends in loss costs.\n \nPersonal Lines Insurance Underwriting Expenses\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nCommission expenses\n$\n501\n \n$\n391 \n$\n327 \n28\n \n20 \nOther underwriting expenses\n261\n \n219 \n182 \n19\n \n20 \nTotal underwriting expenses\n$\n762\n \n$\n610 \n$\n509 \n25\n \n20 \nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCommission expenses\n19.1\n \n%\n19.2 \n%\n19.4 \n%\n(0.1)\n(0.2)\nOther underwriting expenses\n9.9\n \n10.7 \n10.7 \n(0.8)\n0.0 \nTotal underwriting expense ratio\n29.0\n \n%\n29.9 \n%\n30.1 \n%\n(0.9)\n(0.2)\n \nPersonal lines commission expense as a percent of earned premiums decreased slightly in 2024 compared with 2023, as earned premiums rose at a faster pace than commission expenses. The ratio for 2023 decreased slightly compared with 2022, as earned premiums rose at a faster pace than commission expenses. Other underwriting expenses as a percent of earned premiums in 2024 decreased, compared with 2023, reflecting ongoing expense management efforts, as premium growth outpaced growth in other underwriting expenses. In 2023, other underwriting expenses as a percent of earned premiums matched the 2022 percentage, reflecting ongoing expense management efforts, as the pace of premium growth was in line with growth in other expenses.\nCincinnati Financial Corporation - 2024 10-K - Page 75\nTable of Contents\nPersonal Lines Insurance Outlook\nThe personal lines market of the U.S. property casualty industry continued to experience challenges in 2024, including elevated inflation, increasing loss costs and pricing pressures as insurers pursued rate adequacy. Our response continues to include rate increases, pricing precision for individual risks and use of inflation factors that respond to higher costs to repair property. We believe we can continue to profitably grow premiums in our personal lines insurance segment through new agency appointments and an ongoing focus on diversification of product and geography. We serve middle market, mass affluent and high net worth clients, helping us grow across the U.S. and spreading our catastrophe risk. Drivers of profitable growth for our Cincinnati Private Client business also include selectively using non-admitted insurance property forms and rates in certain catastrophe-prone states and geographies. \nOur high net worth initiative, along with various other actions to improve performance in our personal lines insurance segment, is discussed in greater detail in Personal Lines Insurance Results and also in Item 1, Our Business and Our Strategy, Strategic Initiatives and Our Segments, Personal Lines Insurance Segment.  \nCincinnati Financial Corporation - 2024 10-K - Page 76\nTable of Contents\nExcess and Surplus Lines Insurance Results\n \nOverview – Three-Year Highlights\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nEarned premiums\n$\n615\n \n$\n542 \n$\n485 \n13\n \n12 \nFee revenues\n3\n \n3 \n2 \n0\n \n50 \nTotal revenues\n618\n \n545 \n487 \n13\n \n12 \nLoss and loss expenses from:\n \n \n \n \n \nCurrent accident year before catastrophe losses\n395\n \n357 \n319 \n11\n \n12 \nCurrent accident year catastrophe losses\n8\n \n4 \n5 \n100\n \n(20)\nPrior accident years before catastrophe losses\n8\n \n(11)\n(8)\nnm\n(38)\nPrior accident years catastrophe losses\n—\n \n— \n(1)\n0\n \nnm\nLoss and loss expenses\n411\n \n350 \n315 \n17\n \n11 \nUnderwriting expenses\n167\n \n141 \n124 \n18\n \n14 \nUnderwriting profit\n$\n40\n \n$\n54 \n$\n48 \n(26)\n13 \nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCurrent accident year before catastrophe losses\n64.2\n \n%\n65.9 \n%\n65.7 \n%\n(1.7)\n0.2 \nCurrent accident year catastrophe losses\n1.3\n \n0.7 \n1.0 \n0.6\n \n(0.3)\nPrior accident years before catastrophe losses\n1.4\n \n(2.0)\n(1.7)\n3.4\n \n(0.3)\nPrior accident years catastrophe losses\n(0.0)\n(0.1)\n(0.2)\n0.1\n \n0.1 \nLoss and loss expenses\n66.9\n \n64.5 \n64.8 \n2.4\n \n(0.3)\nUnderwriting expenses\n27.1\n \n26.1 \n25.6 \n1.0\n \n0.5 \nCombined ratio\n94.0\n \n%\n90.6 \n%\n90.4 \n%\n3.4\n \n0.2 \nCombined ratio:\n94.0\n \n%\n90.6 \n%\n90.4 \n%\n3.4\n \n0.2 \nContribution from catastrophe losses and prior years\n    reserve development\n2.7\n \n(1.4)\n(0.9)\n4.1\n \n(0.5)\nCombined ratio before catastrophe losses and prior years\n    reserve development\n91.3\n \n%\n92.0 \n%\n91.3 \n%\n(0.7)\n0.7 \n \nOur excess and surplus lines insurance segment includes results of The Cincinnati Specialty Underwriters Insurance Company and CSU Producer Resources Inc. Performance highlights for this segment include:\n•\nPremiums – Earned premiums and net written premiums continued to grow during 2024, primarily due to higher renewal written premiums that included average renewal estimated price increases in the high-single-digit range. New business written premiums rose 11% in 2024, compared with 2023, and also contributed to premium growth. \n•\nCombined ratio – The combined ratio increased by 3.4 percentage points in 2024, compared with 2023, primarily due to unfavorable reserve development on prior accident year loss and loss expenses that offset a lower ratio for current accident year loss and loss expenses before catastrophe losses. Approximately 89% of our 2024 earned premiums for the excess and surplus lines insurance segment provided commercial casualty coverages for various insured liability claims that have experienced higher losses reflecting elevated inflation. Due to uncertainty regarding ultimate losses, we intend to remain prudent in reserving for estimated ultimate losses until longer-term loss cost trends become more clear. The higher 2024 combined ratio also included increases in ratios for underwriting expenses and catastrophe losses.\nCincinnati Financial Corporation - 2024 10-K - Page 77\nTable of Contents\nExcess and Surplus Lines Insurance Premiums\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nAgency renewal written premiums\n$\n498\n \n$\n428 \n$\n392 \n16\n \n9 \nAgency new business written premiums\n196\n \n177 \n136 \n11\n \n30 \nOther written premiums\n(40)\n(35)\n(26)\n(14)\n(35)\nNet written premiums\n654\n \n570 \n502 \n15\n \n14 \nUnearned premium change\n(39)\n(28)\n(17)\n(39)\n(65)\nEarned premiums\n$\n615\n \n$\n542 \n$\n485 \n13\n \n12 \n \nThe $70 million increase in 2024 renewal premiums largely reflected higher renewal pricing. Average renewal estimated price increases were in the high-single-digit range during 2024. We measure average changes in excess and surplus lines renewal pricing as the rate of change in renewal premium for the new policy period compared with the premium for the expiring policy period, assuming no change in the level of insured exposures or policy coverage between those periods for respective policies.\n \nNew business written premiums in 2024 grew by $19 million, or 11%, compared with 2023, as we continued to carefully underwrite each policy in a highly competitive market. Other written premiums in 2024 reduced net written premium growth by $5 million more than in 2023 and are primarily premiums that are ceded to reinsurers and therefore reduce our net written premiums. \n \nExcess and Surplus Lines Loss and Loss Expenses\nLoss and loss expenses include both net paid losses and reserve changes for unpaid losses, as well as the associated loss expenses. The majority of the total incurred losses and loss expenses shown above in the three-year highlights table are for the respective current accident years, with reserve development on prior accident years shown separately. Since less than 20% of our excess and surplus lines current accident year incurred losses and loss expenses represents net paid amounts, a large majority represents reserves for our estimate of unpaid losses and loss expenses. These reserves develop over time, and we update our estimates of previously reported reserves as we learn more about the development on the related claims. The table below illustrates that development. For example, the 66.6% accident year 2023 loss and loss expense ratio reported as of December 31, 2023, developed favorably by 10.5 percentage points to 56.1% due to claims settling for less than previously estimated, or due to updated reserve estimates for unpaid claims, as of December 31, 2024. Accident year 2022 for the segment developed favorably for the two-year period ending December 31, 2024, as indicated by the progression over time for the ratios in the table. It experienced unfavorable development during 2024 and favorable development during 2023.\n(Dollars in millions)\n \n \n \nAccident year loss and loss expenses incurred and ratios to earned premiums:\nAccident year:\n2024\n2023\n2022\n2024\n2023\n2022\nas of December 31, 2024\n$\n403\n \n$\n304\n \n$\n312\n \n65.5\n \n%\n56.1\n \n%\n64.3\n \n%\nas of December 31, 2023\n \n361 \n307 \n \n66.6 \n63.3 \nas of December 31, 2022\n \n \n324 \n \n \n66.7 \n \nCatastrophe losses, as discussed in Consolidated Property Casualty Insurance Results, explain some of the movement among components of the current accident year loss and loss expense ratio for accident year 2024, compared with 2023. Catastrophe losses added 1.3 percentage points in 2024, 0.7 points in 2023 and 1.0 points in 2022 to the respective excess and surplus lines current accident year loss and loss expense ratios in the table above.\n \nThe 64.2% ratio for current accident year loss and loss expenses before catastrophe losses for 2024 improved by 1.7 percentage points compared with the 65.9% accident year 2023 ratio measured as of December 31, 2023. The improvement was partially offset by a 0.7 percentage-point increase in the ratio for current accident year losses of $2 million or more per claim, shown in the table below. \nCincinnati Financial Corporation - 2024 10-K - Page 78\nTable of Contents\nExcess and surplus lines reserve development on prior accident years was a net unfavorable $8 million for 2024 and a net favorable $11 million for 2023. The net unfavorable amount for 2024 was primarily for accident years 2021 and prior and was due primarily to higher-than-anticipated loss emergence on known claims.\n \nWe believe the loss and loss expense reserves for our excess and surplus lines business are adequate. The amount of outstanding reserves for our excess and surplus lines operation can be seen in a table in Liquidity and Capital Resources, Property Casualty Loss and Loss Expense Obligations and Reserves. One indication of how long it takes for most of the outstanding reserves to be settled is to measure outstanding reserves by accident year at different points in time, using Item 8, Note 4 of the Consolidated Financial Statements. For example, for accident years 2017, 2016 and 2015, in aggregate, after subtracting cumulative paid amounts from incurred amounts at December 31, 2017, reserves for estimated unpaid losses, plus the portion of loss expenses known as ALAE, equaled $203 million. For those same accident years, at December 31, 2024, the reserve estimate for the remaining unpaid amount equaled $18 million. As discussed in Critical Accounting Estimates, Property Casualty Insurance Loss and Loss Expense Reserves, stable paid and reported loss patterns are a key assumption used to make projections necessary for estimating IBNR reserves. The inherent uncertainty in estimating reserves is discussed in Liquidity and Capital Resources, Property Casualty Insurance Loss and Loss Expense Obligations and Reserves. Development trends by accident year are further discussed in Property Casualty Insurance Development of Estimated Reserves by Accident Year.\n \nExcess and Surplus Lines Insurance Losses by Size\n(Dollars in millions, net of reinsurance)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nCurrent accident year losses greater than $5,000,000\n$\n—\n \n$\n— \n$\n— \nnm\nnm\nCurrent accident year losses $2,000,000-$5,000,000\n4\n \n— \n2 \nnm\n(100)\nLarge loss prior accident year reserve development\n—\n \n(2)\n— \n100\n \nnm\nTotal large losses incurred\n4\n \n(2)\n2 \nnm\nnm\nLosses incurred but not reported\n87\n \n79 \n68 \n10\n \n16 \nOther losses excluding catastrophe losses\n189\n \n170 \n153 \n11\n \n11 \nCatastrophe losses\n8\n \n3 \n4 \n167\n \n(25)\nTotal losses incurred\n$\n288\n \n$\n250 \n$\n227 \n15\n \n10 \nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCurrent accident year losses greater than $5,000,000\n0.0\n \n%\n0.0 \n%\n0.0 \n%\n0.0\n \n0.0 \nCurrent accident year losses $2,000,000-$5,000,000\n0.7\n \n0.0 \n0.4 \n0.7\n \n(0.4)\nLarge loss prior accident year reserve development\n0.0\n \n(0.3)\n0.0 \n0.3\n \n(0.3)\nTotal large loss ratio\n0.7\n \n(0.3)\n0.4 \n1.0\n \n(0.7)\nLosses incurred but not reported\n14.2\n \n14.6 \n14.0 \n(0.4)\n0.6 \nOther losses excluding catastrophe losses\n30.8\n \n31.3 \n31.6 \n(0.5)\n(0.3)\nCatastrophe losses\n1.2\n \n0.5 \n0.8 \n0.7\n \n(0.3)\nTotal loss ratio\n46.9\n \n%\n46.1 \n%\n46.8 \n%\n0.8\n \n(0.7)\n \nIn 2024, total large losses increased by $6 million, net of reinsurance. The ratio for 2024 large losses as a percent of earned premiums increased by 1.0 percentage points, compared with 2023. That ratio for 2023 decreased by 0.7 points, compared with 2022. Our analysis indicated no unexpected concentration of these losses and reserve increases by risk category, geographic region, policy inception, agency or field marketing territory. We believe the inherent volatility of aggregate loss experience for our portfolio of larger policies is greater than that of our portfolio of smaller policies, and we continue to monitor the volatility in addition to general inflationary trends in loss costs.\n \nCincinnati Financial Corporation - 2024 10-K - Page 79\nTable of Contents\nExcess and Surplus Lines Insurance Underwriting Expenses\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nCommission expenses\n$\n107\n \n$\n93 \n$\n81 \n15\n \n15 \nOther underwriting expenses\n60\n \n48 \n43 \n25\n \n12 \nTotal underwriting expenses\n$\n167\n \n$\n141 \n$\n124 \n18\n \n14 \nRatios as a percent of earned premiums:\n \n \n \nPt. Change\nPt. Change\nCommission expenses\n17.4\n \n%\n17.1 \n%\n16.7 \n%\n0.3\n \n0.4 \nOther underwriting expenses\n9.7\n \n9.0 \n8.9 \n0.7\n \n0.1 \nTotal underwriting expenses ratio\n27.1\n \n%\n26.1 \n%\n25.6 \n%\n1.0\n \n0.5 \n \nExcess and surplus lines commission expense as a percent of earned premiums for 2024 increased compared with 2023, primarily from an increase in the ratio for profit-sharing commissions for agencies. The ratio for 2023 increased compared with 2022, including increases in the ratios for reinsurance commissions and profit-sharing commissions for agencies. The ratio for other underwriting expenses increased in 2024 largely due to increases in employee-related expenses. The ratio for other underwriting expenses increased slightly in 2023. The three-year period ending in 2024 also reflected ongoing expense management efforts and changes in the pace of premium growth.\n \nExcess and Surplus Lines Insurance Outlook \nThe excess and surplus lines market is expected to see the magnitude of rate increases moderate for property-driven risks, except for catastrophe exposures, according to industry publications. For casualty-driven risks, premium rates in the foreseeable future are expected to be firm, primarily driven by social inflation and litigation funding impacts. New business opportunities are expected to increase as standard market insurance companies continue to re-underwrite business they previously took from the excess and surplus lines market and as larger excess and surplus lines companies re-underwrite their business with an emphasis on underwriting profitability. \nIndustry reports continue to suggest that there are opportunities for profitability and growth through greater use\n \nof\n \ntechnology. Technology and data are also being used by excess and surplus lines insurance companies\n \nto identify new exposures in emerging businesses that need insurance protection or other value-added services. We have implemented artificial intelligence technology that has reduced data entry time and improved the quality of our data analytics and expect ongoing benefits in the future.\nAs we continue to execute our strategy of providing superior service, we expect another year of profitable growth for our excess and surplus lines insurance segment despite challenging market conditions. Our experienced excess and surplus lines underwriters in the field intend to carefully select and price risks, providing prompt delivery of insurance quotes and policies, as they work with other local field associates who provide outstanding claims and loss control service while also handling standard lines business for their assigned agencies. These local representatives are supported by headquarters underwriters and claims managers who specialize in excess and surplus lines.\nCincinnati Financial Corporation - 2024 10-K - Page 80\nTable of Contents\nLife Insurance Results\n \nOverview – Three-Year Highlights\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nEarned premiums\n$\n321\n \n$\n313 \n$\n301 \n3\n \n4 \nFee revenues\n5\n \n10 \n4 \n(50)\n150 \nTotal revenues\n326\n \n323 \n305 \n1\n \n6 \nContract holders' benefits incurred\n301\n \n316 \n303 \n(5)\n4 \nInvestment interest credited to contract holders\n(125)\n(121)\n(109)\n(3)\n(11)\nUnderwriting expenses incurred\n93\n \n87 \n84 \n7\n \n4 \nTotal benefits and expenses\n269\n \n282 \n278 \n(5)\n1 \nLife insurance segment profit \n$\n57\n \n$\n41 \n$\n27 \n39\n \n52 \nPerformance highlights for the life insurance segment include:\n•\nRevenues – Earned premiums increased 3% for the year 2024, as shown in the table below that includes details by major line of business. Our largest life insurance product line, term life insurance, rose 3%. Net in-force policy face amounts rose 2% to $84.245 billion at year-end 2024 from $82.361 billion at year-end 2023 and $80.482 billion at year-end 2022.\n•\nProfitability – Our life insurance segment typically reports a smaller profit compared with the life insurance subsidiary because profits from investment income spreads are included in our investments segment results. We include only investment income credited to contract holders (including interest assumed in life insurance policy reserve calculations) in life insurance segment results. A profit of $57 million for our life insurance segment in 2024, compared with $41 million in 2023, was primarily due to more favorable unlocking of interest rate and other actuarial adjustments and more favorable mortality experience. A profit of $41 million in 2023 compared with $27 million in 2022 was primarily due to increased earned premiums and fee revenues along with favorable mortality experience.\nEarned premiums increased $8 million in 2024, primarily due to a $6 million increase in term life insurance earned premiums, as shown in the table below. \n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nTerm life insurance\n$\n233\n \n$\n227 \n$\n220 \n3\n \n3 \nWhole life insurance\n52\n \n50 \n46 \n4\n \n9 \nUniversal life and other\n36\n \n36 \n35 \n0\n \n3 \nNet earned premiums\n$\n321\n \n$\n313 \n$\n301 \n3\n \n4 \n \nProducts we market include term, whole and universal life insurance and also fixed annuities. In addition, we offer term and whole life insurance to employees at their worksite. These products provide our property casualty agency force with excellent cross-serving opportunities for both commercial and personal accounts. \n \nOver the past several years, we have worked to maintain a portfolio of simple, yet competitive, products. Our product development efforts emphasize death benefit protection and guarantees. Distribution expansion within our property casualty insurance agencies remains a high priority. Our 37 life field marketing representatives work in partnership with our property casualty field marketing representatives. Approximately 60% of our term and other life insurance product premiums were generated through our property casualty insurance agency relationships.\n \nLife insurance segment expenses consist principally of:\n•\nContract holders’ benefits incurred, related to traditional life and interest-sensitive products, accounted for 76.4% of 2024 total benefits and expenses (inclusive of investment interest credited to contract holders) compared with 78.4% in 2023 and 78.3% in 2022. Total contract holders’ benefits decreased in 2024, compared with 2023, largely due to more favorable impacts from the unlocking of interest rate and other actuarial assumptions. Total \nCincinnati Financial Corporation - 2024 10-K - Page 81\nTable of Contents\ncontract holder benefits increased slightly in 2023, compared with 2022, largely due to less favorable impacts from the unlocking of interest rate and other actuarial assumptions. Mortality experience was more favorable in 2024, compared with 2023, and net death claims were below our mortality projections.\n•\nUnderwriting expenses incurred, net of deferred acquisition costs, accounted for 23.6% of 2024 total benefits and expenses (inclusive of investment interest credited to contract holders) compared with 21.6% in 2023 and 21.7% in 2022. Expenses in 2024 increased 7%, compared with 3% growth in earned premiums. Expenses in 2023 increased 4%, compared with 4% growth in earned premiums. The 2024 increase in underwriting expenses, compared with the same period a year ago, was largely due to higher general insurance expense levels and increased amortization of deferred policy acquisition costs. The 2023 increase in underwriting expenses was largely due to the same factors that impacted the 2024 increase.\nLife insurance segment profitability depends largely on premium levels, the adequacy of product pricing, underwriting skill and operating efficiencies. This segment’s results include only investment interest credited to contract holders (interest assumed in life insurance policy reserve calculations). The remaining investment income is reported in the investments segment results. The life investment portfolio is managed to earn target spreads between earned investment rates on general account assets and rates credited to policyholders. We consider the value of assets under management and investment income for the life investment portfolio as key performance indicators for the life insurance segment. We seek to maintain a competitive advantage with respect to benefits paid and reserve increases by consistently achieving better than average claims experience due to skilled underwriting.\nWe recognize that assets under management, capital appreciation and investment income are integral to evaluation of the success of the life insurance segment because of the long duration of life products. On a basis that includes investment income and investment gains or losses from life insurance-related invested assets, our life insurance subsidiary reported net income of $91 million in 2024, compared with $75 million in 2023 and $65 million in 2022. The life insurance subsidiary portfolio had after-tax net investment losses of $6 million in 2024 compared with $7 million in 2023 and $2 million in 2022. Investment gains and losses are discussed under Investments Results. We exclude most of our life insurance company investment income from investments segment results.\nLife Insurance Outlook \nWe believe the life insurance market remains attractive. Life insurance ownership remains low compared to historical levels. While people like to research life insurance online, we believe they prefer to speak to a professional agent before making a purchase. Our strong agency relationships and expanding base of agencies gives us a competitive edge in satisfying the life insurance needs that exist for so many Americans.\nArtificial intelligence and improved computing power will continue to allow us to improve our efficiency in writing new business and servicing it. Underwriting in particular will continue to evolve as we work to prudently adopt new, and refine existing models, to evaluate mortality risk without requiring invasive and time intensive traditional medical exams. We believe this improved buying experience will encourage more of our agencies to offer a life insurance product to their property casualty customers.\nWithin the life insurance market, we view the voluntary life space as particularly attractive. With our large commercial lines presence, our agencies have tremendous opportunities to serve the employees of these businesses with a simple, voluntary life product. We are enhancing our ability to enroll this business and service it more efficiently, including hiring dedicated associates to augment our agencies’ ability to conduct the enrollments.  These accounts often lead to business life insurance opportunities that are designed to ensure the viability of the businesses in the event of a death of a key employee or business owner.\nCincinnati Financial Corporation - 2024 10-K - Page 82\nTable of Contents\nInvestments Results\n \nOverview – Three-Year Highlights\n \nInvestments Results\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nTotal investment income, net of expenses\n$\n1,025\n \n$\n894 \n$\n781 \n15\n \n14 \nInvestment interest credited to contract holders\n(125)\n(121)\n(109)\n(3)\n(11)\nInvestment gains and losses, net\n1,391\n \n1,127 \n(1,467)\n23\n \nnm\nInvestments profit (loss), pretax\n$\n2,291\n \n$\n1,900 \n$\n(795)\n21\n \nnm\n \nThe investments segment contributes investment income and investments gains and losses to results of operations. Investment income is generally our primary source of pretax and after-tax profits.\n•\nInvestment income – Pretax investment income grew $131 million, or 15%, in 2024, due to increases from both interest income and dividends. Interest income grew 22% in 2024, compared with 2023, as net purchases of fixed-maturity securities in recent years and higher average yields for bonds are working to generally offset effects of the low interest rate environment for several years prior to 2022. Dividend income grew less than 1% in 2024, compared with 2023. Dividend rates generally have increased, although more slowly than in prior years. Minor asset allocation adjustments in our equity portfolio, including larger than usual net sales of equity securities during the second half of 2024, unfavorably affected dividend income. Pretax investment income rose 14% in 2023, including increases in interest and dividend income. Average yields in the investment income table below are based on the average invested asset and cash amounts indicated in the table using fixed-maturity securities valued at amortized cost and all other securities at fair value.\n•\nInvestment gains and losses – We reported an investment gain in 2024 and 2023, primarily due to favorable changes in fair values of equity securities even though we continue to hold the securities or as otherwise required by GAAP. We reported an investment loss in 2022, due to unfavorable changes in fair values of equity securities.\nWe believe it is useful to analyze our overall investment performance by using total investment return over several years. Total investment return considers changes in unrealized gains and losses that are not included in net income, in addition to net investment income and investment gains and losses that are included in net income. Changes in unrealized gains and losses shown in the table below include other invested assets. Considering total investment gains and losses over several years helps evaluate performance since gains and losses may experience typical variability during shorter periods of time.\n \nCincinnati Financial Corporation - 2024 10-K - Page 83\nTable of Contents\nThe table below shows total return based on assumptions that simplify cash flow timing that is commonly used in total return measures. This simplified calculation uses data shown in our consolidated financial statements or notes to those statements. Added to invested asset amounts from our consolidated balance sheets are 50% of annual amounts pertaining to invested asset categories included in net cash used in investing activities from our consolidated statements of cash flows. The cash flow amounts are reduced by net gains from investment portfolio securities sales or called bonds, with the net result reduced by 50% to represent estimated new cash invested during each respective year. All new cash is assumed to be invested at the midpoint of the year.\n \nTotal investment return of 9.3% in 2024 was lower than the 9.9% return in 2023. The 2024 contribution from the investment income component was enhanced by the net favorable effect of the investment gains and losses components. Comparing contributions for 2024 with 2023, investment income rose $131 million, investment gains increased by $264 million and the invested assets net change in unrealized gains and losses decreased by $260 million. The base component of the return calculation, annual average invested assets, was up 13% in 2024. For 2023 compared with 2022, total investment return of 9.9% in 2023 was significantly more than the negative 9.2% return in 2022, as the 2023 contribution from the investment income component was enhanced by the net favorable effect of the investment gains and losses components. The base component of the return calculation, annual average invested assets, decreased 8% in 2023.\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nInvested assets beginning balance:\n \n \n \n \n \nFixed maturities\n$\n13,791\n \n$\n12,132 \n$\n13,022 \n14\n \n(7)\nEquity securities\n10,989\n \n9,841 \n11,315 \n12\n \n(13)\nOther invested assets\n577\n \n452 \n329 \n28\n \n37 \nInvested assets beginning balance\n25,357\n \n22,425 \n24,666 \n13\n \n(9)\nAverage acquisitions (dispositions), net\n875\n \n779 \n472 \n12\n \n65 \nAnnual average invested assets\n$\n26,232\n \n$\n23,204 \n$\n25,138 \n13\n \n(8)\nTotal investment return:\n \n \n \n \n \nInvestment income, net of expenses\n$\n1,025\n \n$\n894 \n$\n781 \n15\n \n14 \nInvestment gains and losses, net\n1,391\n \n1,127 \n(1,467)\n23\n \nnm\nTotal invested assets change in unrealized gains and losses\n17\n \n277 \n(1,639)\n(94)\nnm\nTotal\n$\n2,433\n \n$\n2,298 \n$\n(2,325)\n6\n \nnm\nTotal return on invested assets, pretax\n9.3\n \n%\n9.9 \n%\n(9.2)\n%\n \n \n \nCincinnati Financial Corporation - 2024 10-K - Page 84\nTable of Contents\nInvestment Income\nThe primary drivers of investment income are highlighted below, followed by additional details of our investment results.\n•\nInterest income increased by $133 million, or 22%, in 2024, compared with 2023. The average fixed-maturity pretax yield increased by 28 basis points in addition to a larger fixed-maturity portfolio that rose 15% on an average amortized cost basis. Interest income in 2023 increased by $90 million, compared with 2022, when that yield increased by 34 basis points while the portfolio rose 8% on an amortized cost basis.\n•\nDividend income rose $1 million, or less than 1%, in 2024. The increase includes dividend rates that generally have increased, although more slowly than in prior years. Minor asset allocation adjustments in our equity portfolio, including larger than usual net sales of equity securities during the second half of 2024, unfavorably affected dividend income. Dividend income rose $7 million, or 3%, in 2023 reflecting dividend rates that generally increased, minor asset allocations and an increase in funds invested in that portfolio.\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nInvestment income:\n \n \n \n \n \nInterest\n$\n733\n \n$\n600 \n$\n510 \n22\n \n18 \nDividends\n283\n \n282 \n275 \n0\n \n3 \nOther\n25\n \n25 \n11 \n0\n \n127 \nLess investment expenses\n16\n \n13 \n15 \n23\n \n(13)\nInvestment income, pretax\n1,025\n \n894 \n781 \n15\n \n14 \nLess income taxes\n172\n \n145 \n123 \n19\n \n18 \nTotal investment income, after-tax\n$\n853\n \n$\n749 \n$\n658 \n14\n \n14 \nInvestment returns:\nAverage invested assets plus cash and cash equivalents\n$\n28,374\n \n$\n25,685 \n$\n24,775 \n \n \nAverage yield pretax\n3.61\n \n%\n3.48 \n%\n3.15 \n%\n \n \nAverage yield after-tax\n3.01\n \n2.92 \n2.66 \n \n \nEffective tax rate\n16.8\n \n16.2 \n15.8 \nFixed-maturity returns:\nAverage amortized cost\n$\n15,697\n \n$\n13,670 \n$\n12,605 \n \n \nAverage yield pretax\n4.67\n \n%\n4.39 \n%\n4.05 \n%\n \n \nAverage yield after-tax\n3.83\n \n3.62 \n3.35 \n \n \nEffective tax rate\n18.0\n \n17.5 \n17.1 \n \nIn 2024, we continued to invest available cash flow in both fixed income and equity securities in a manner that we believe balances current income needs with longer-term invested asset growth goals. As bonds in our generally laddered portfolio mature or are called over the near term, we reinvest with a balanced approach, keeping in mind our long-term strategy and pursuing attractive risk-adjusted after-tax yields. While our bond portfolio more than covers our insurance reserve liabilities, we believe our diversified common stock portfolio of mainly blue chip, dividend-paying companies represents one of our best investment opportunities for the long term. We continually perform fundamental analysis of both industry and company-specific opportunities as well as the potential impact from changes in the interest rate environment and the potential for elevated inflation. \nCincinnati Financial Corporation - 2024 10-K - Page 85\nTable of Contents\nThe table below summarizes pretax yield to amortized costs excluding any book value adjustments due to impairment for bonds in our fixed-maturity portfolio by various maturity periods. \nAt December 31, 2024\n% Yield\nPrincipal redemptions\nFixed-maturity yield profile:\nExpected to mature during 2025\n4.53 \n%\n$\n1,238 \nExpected to mature during 2026\n5.02 \n1,233 \nExpected to mature during 2027\n5.23 \n953 \nAverage yield and total expected redemptions from 2025 through 2027\n4.90 \n$\n3,424 \nThe average pretax yield of 5.66% for fixed-maturity securities acquired during 2024, shown in the table below, was higher than the 5.06% average yield-to-amortized cost of the fixed-maturity securities portfolio at the end of 2024.\nYears ended December 31,\n2024\n2023\nAverage pretax yield-to-amortized cost on new fixed maturities:\nAcquired taxable fixed maturities\n5.78\n \n%\n6.36 \n%\nAcquired tax-exempt fixed maturities\n4.15\n \n4.29 \nAverage total fixed maturities acquired\n5.66\n \n6.13 \nWe discussed our portfolio strategies in Item 1, Investments Segment. We discuss risks related to our investment income and our fixed-maturity and equity investment portfolios in Item 7A, Quantitative and Qualitative Disclosures About Market Risk.\n \nCincinnati Financial Corporation - 2024 10-K - Page 86\nTable of Contents\nTotal Investment Gains and Losses\nInvestment gains and losses are recognized on the sales of investments, for certain changes in fair values of securities even though we continue to hold the securities or as otherwise required by GAAP. The change in fair value for equity securities still held is reported in net income, as disclosed in Note 1, Summary of Significant Accounting Policies. Total investment gains and losses in 2024 included $1.275 billion of net gains from the recognition of fair value changes of equity securities still held that prior to 2018 would have been reported in other comprehensive income (OCI) instead of net income. Change in unrealized gains or losses for fixed-maturity securities are included as a component of OCI. Accounting requirements for the allowance for credit losses and impairment charges for write-downs of impaired securities in the fixed-maturity portfolio are disclosed in Item 8, Note 1, Summary of Significant Accounting Policies. The factors we consider when evaluating impairments are also discussed in Critical Accounting Estimates, Asset Impairment. \n \nThe timing of gains or losses from sales can have a material effect on results in any given period. However, such gains or losses usually have little, if any, effect on total shareholders’ equity because most equity and fixed-maturity investments are carried at fair value.\n \nAs appropriate, we buy, hold or sell both fixed-maturity and equity securities on an ongoing basis to help achieve our portfolio objectives. We generally purchase fixed-maturity securities with the intention to hold until maturity. If they no longer meet our investment criteria, they are divested. Sales of fixed-maturity securities are usually due to a change in credit fundamentals. Pretax total investment gains in 2024 and 2023 were largely due to favorable changes in fair values of equity securities, even though we continue to hold the securities, as shown in the table below. In 2022, the pretax total investment loss was due to unfavorable changes in fair values of equity securities and a net unfavorable change in unrealized gains or losses for fixed-maturity securities. Additional information about investment gains or losses is included in Item 8, Note 2 of the Consolidated Financial Statements.\nThe table below summarizes total investment gains and losses, before taxes.\n(Dollars in millions)\nYears ended December 31,\n \n2024\n2023\n2022\nInvestment gains and losses\nEquity securities:\nInvestment gains and losses on securities sold, net\n$\n181\n \n$\n(17)\n$\n16 \nUnrealized gains and losses on securities still held, net\n1,275\n \n1,168 \n(1,526)\nSubtotal\n1,456\n \n1,151 \n(1,510)\nFixed-maturity securities:\n  Gross realized gains\n5\n \n4 \n6 \n  Gross realized losses\n(95)\n(5)\n(4)\nChange in allowance for credit losses, net\n(26)\n(17)\n— \nWrite-down of impaired securities\n—\n \n(4)\n(5)\nSubtotal\n(116)\n(22)\n(3)\nOther\n51\n \n(2)\n46 \nTotal investment gains and losses reported in net income\n$\n1,391\n \n$\n1,127 \n$\n(1,467)\nChange in unrealized investment gains and losses reported in OCI\nFixed-maturity securities\n17\n \n277 \n(1,639)\n Total\n$\n1,408\n \n$\n1,404 \n$\n(3,106)\n \nCincinnati Financial Corporation - 2024 10-K - Page 87\nTable of Contents\nWrite-downs of impaired securities from the investment portfolio by the asset classes we described in Item 1, Our Segments, Investments Segment, are summarized below:\n(Dollars in millions)\nYears ended December 31,\n \n2024\n2023\n2022\nTaxable fixed maturities:\n \n \n \nImpairment amount\n$\n—\n \n$\n4 \n$\n5 \nNew amortized cost\n$\n—\n \n$\n— \n$\n8 \nPercent to total amortized cost owned\n—\n \n%\n— \n%\n— \n%\nNumber of impaired securities written down\n1 \n2 \nPercent to number of securities owned\n—\n \n%\n— \n%\n— \n%\nTax-exempt fixed maturities:\n \n \n \nImpairment amount\n$\n—\n \n$\n— \n$\n— \nNew amortized cost\n$\n—\n \n$\n— \n$\n1 \nPercent to total amortized cost owned\n—\n \n%\n— \n%\n— \n%\nNumber of impaired securities written down\n—\n \n— \n1 \nPercent to number of securities owned\n—\n \n%\n— \n%\n— \n%\nTotals:\n \n \n \nImpairment amount\n$\n—\n \n$\n4 \n$\n5 \nNew amortized cost\n$\n—\n \n$\n— \n$\n9 \nPercent to total amortized cost owned\n—\n \n%\n— \n%\n— \n%\nNumber of impaired securities written down\n—\n \n1 \n3 \nPercent to number of securities owned\n—\n \n%\n— \n%\n— \n%\n \nAdditional details regarding write-downs of impaired securiti\nes from the investment portfolio are summarized below:\n(Dollars in millions)\nYears ended December 31,\n \n2024\n2023\n2022\nFixed maturities:\n \n \n \nReal estate\n$\n—\n \n$\n4 \n$\n5 \nTotal fixed maturities\n$\n—\n \n$\n4 \n$\n5 \nCincinnati Financial Corporation - 2024 10-K - Page 88\nTable of Contents\nInvestments Outlook     \nFederal Reserve inaction due to inconsistent inflation data points led to volatile interest rate levels over the course of 2024. With data seeming to indicate inflation was under control, the Federal Reserve pivoted and began its rate cutting program in late September.\nWith yields at highs not seen in years, we focused our purchase activity on fixed-maturity securities and diverted new money away from equity securities as the S&P 500 Index return in 2024 exceeded 20% for the second consecutive year. We benefited from our ongoing equity exposure but repositioned the portfolio to take advantage of the strength in stocks and the yields in the bond market.\nOur investment portfolio is well-positioned to pursue market opportunities that present themselves in 2025. If yields remain high, we are ready to continue emphasizing bond purchases. If the stock market retrenches, we are prepared to take advantage of value opportunities, maintaining our longer-term approach of seeking both growth of investment income and portfolio appreciation. We discuss our portfolio strategies in Item 1, Our Segments, Investments Segment.\nCincinnati Financial Corporation - 2024 10-K - Page 89\nTable of Contents\nOther\nTotal revenues in 2024 and 2023 for our Other operations increased, compared with the respective prior-year periods, primarily due to higher earned premiums from Cincinnati Re and Cincinnati Global in total. Other also includes noninvestment operations of the parent company and its commercial leasing and financial services subsidiary, CFC Investment Company. Total expenses for Other increased in 2024 but decreased in 2023, with the change for both years primarily due to losses and loss expenses and underwriting expenses from Cincinnati Re and Cincinnati Global.\nOther income or loss in the table below represents profit or losses before income taxes. For 2024 and 2023, Other income was driven by underwriting profit for Cincinnati Re and Cincinnati Global. For 2022, Other loss was largely driven by interest expense from debt of the parent company. Net results for the combination of Cincinnati Re and Cincinnati Global were an underwriting profit of $158 million in 2024, $183 million in 2023 and $36 million in 2022. \nCincinnati Re represented 68% of Other earned premiums in 2024 and 54% of underwriting profit. Earned premiums in 2024, compared with 2023, grew 8%. The mix of 2024 earned premiums for Cincinnati Re by primary type of insured exposures included 43% for casualty, 40% for property and 17% for specialty. Cincinnati Re in total generated an underwriting profit of $86 million in 2024, $118 million in 2023 and $13 million in 2022.    \nCincinnati Global represented 32% of Other earned premiums in 2024 and 46% of underwriting profit. In 2024, earned premiums rose 2%, compared with 2023. Underwriting profit for Cincinnati Global was $72 million in 2024, $65 million in 2023 and $23 million in 2022.\n(Dollars in millions)\nYears ended December 31,\n2024-2023\n2023-2022\n \n2024\n2023\n2022\nChange %\nChange %\nInterest and fees on loans and leases\n$\n9\n \n$\n8 \n$\n7 \n13\n \n14 \nEarned premiums\n844\n \n795 \n726 \n6\n \n10 \nOther revenues\n6\n \n5 \n3 \n20\n \n67 \nTotal revenues\n859\n \n808 \n736 \n6\n \n10 \nInterest expense\n53\n \n54 \n53 \n(2)\n2 \nLoss and loss expenses\n435\n \n379 \n474 \n15\n \n(20)\nUnderwriting expenses\n251\n \n233 \n216 \n8\n \n8 \nOperating expenses\n32\n \n25 \n23 \n28\n \n9 \nTotal expenses\n771\n \n691 \n766 \n12\n \n(10)\nOther income (loss)\n$\n88\n \n$\n117 \n$\n(30)\n(25)\nnm\n \nCincinnati Financial Corporation - 2024 10-K - Page 90\nTable of Contents\nTaxes\nWe had a $566 million income tax expense in 2024, compared with $433 million in 2023 and an income tax benefit of $207 million in 2022. The corporate effective tax rate for 2024 was 19.8% compared with 19.0% in 2023 and 29.8% in 2022.\n \nThe changes in our effective tax rate between periods were primarily due to large changes in our net investment gains and losses included in income for the periods, and changes in underwriting income and investment income.\nOur effective tax rate includes impacts from Cincinnati Global’s operations in the United Kingdom. The United Kingdom is one of several global jurisdictions that have enacted laws consistent with The Organisation for Economic Co-operation and Development (OECD) “Pillar Two” model rules aimed at imposing a global minimum tax rate of 15 percent. The UK’s Pillar Two laws, generally effective as of January 1, 2024, did not have a material impact on our effective tax rate in 2024.\nHistorically, we have pursued a strategy of investing some portion of cash flow in tax-advantaged, fixed-maturity securities and some in equity securities to minimize our overall tax liability and maximize after-tax earnings. See Item 1, Our Segments, Fixed-Maturity Securities Investments, for further discussion on municipal bond purchases in our fixed-maturity investment portfolio. \nFor tax years after 2017, for our property casualty insurance subsidiaries, approximately 75% of interest from tax-advantaged, fixed-maturity investments and approximately 40% of dividends from qualified equities are exempt from federal tax after applying proration. For our noninsurance companies, the dividend received deduction exempts 50% of dividends from qualified equities. Our life insurance company does not own tax-advantaged, fixed-maturity investments or equities subject to the dividend received deduction.\nOur effective tax rate reconciliation is found in Item 8, Note 11 of the Consolidated Financial Statements.\nCincinnati Financial Corporation - 2024 10-K - Page 91\nTable of Contents\nLiquidity and Capital Resources\nWe seek to maintain prudent levels of liquidity and financial strength for the protection of our policyholders, creditors and shareholders. We manage liquidity at two levels to meet the short- and long-term cash requirements of business obligations and growth needs. The first is the liquidity of the parent company. The second is the liquidity of our lead insurance subsidiary. Management of liquidity at both levels is essential because each has different funding needs and sources, and each is subject to certain regulatory guidelines and requirements.\nIn addition to our historically positive operating cash flow to meet the needs of operations, we have the ability to slow investing activities if such need arises or to sell a portion of our high-quality, liquid investment portfolio. We also have additional capacity to borrow on our revolving short-term line of credit, as described further below. \n \nParent Company Liquidity\nAt December 31, 2024, the parent company had $5.203 billion in cash and marketable securities, providing strong liquidity to fund cash outflows, as needed. The parent company’s primary sources of cash inflows are dividends from our lead insurance subsidiary, investment income and sale proceeds from investments. The parent company’s cash outflows are primarily interest and principal payments on long- and short-term debt, dividends to shareholders, common stock repurchases, and general operating expenses. To support our shareholders' dividend payment, we could use subsidiary dividends, our line of credit or sell a portion of our marketable securities.\nThe table below shows a summary, by the direct cash flow method, of the major sources and uses of cash flow of the parent company.\n(Dollars in millions)\nYears ended December 31,\n \n2024\n2023\n2022\nSources of liquidity:\n \n \n \nSubsidiary dividends received\n$\n300\n \n$\n526 \n$\n729 \nInvestment income received\n121\n \n107 \n99 \nProceeds from stock options exercised\n10\n \n9 \n10 \nUses of liquidity:\n \n \n \nShareholders' dividend payments\n$\n490\n \n$\n454 \n$\n423 \nShare repurchases\n126\n \n67 \n410 \nDebt interest payments\n52\n \n52 \n53 \n \nUse of liquidity for share repurchases are discretionary depending on cash availability and capital management decisions. In addition, the subsidiaries have the discretion to pay dividends to the parent company. Cincinnati Global is required to maintain certain capital funding requirements with Lloyd’s, which the parent company may deposit on its behalf. These funding requirements may fluctuate based on the profitability of Cincinnati Global and syndicate solvency capital requirements as set by Lloyd's, which may result in additional contributions to or return of funds on deposit. Other than share repurchases and funding at Lloyd's, the majority of expenditures for the parent company have been consistent during the last three years, and we expect future expenditures to remain stable.\nCincinnati Financial Corporation - 2024 10-K - Page 92\nTable of Contents\nInsurance Subsidiary Liquidity\nThe parent company’s lead insurance subsidiary largely represents the operations of the property casualty segments. The primary sources of cash inflows are collection of premiums, investment income, maturity of fixed-income securities and sale proceeds from investments. Property casualty insurance premiums generally are received before losses are paid under the policies purchased with those premiums. Cash outflows are primarily loss and loss expenses, commissions, salaries, taxes, operating expenses and investment purchases. Over the three-year period ended December 31, 2024, premium receipts and investment income have been more than sufficient to pay claims and operating expenses. Excess cash flows were partially used to pay dividends to the parent company. We are not aware of any known trends that would materially change historical cash flow results, other than fluctuations in catastrophe claims and other large losses, either individually or in aggregate.\nThe table below shows a summary of operating cash flow for property casualty insurance (direct method). Historically, annual variation in operating cash flow has been largely related to changes in amounts of catastrophe losses.\n(Dollars in millions)\nYears ended December 31,\n \n2024\n2023\n2022\nPremiums collected\n$\n8,895\n \n$\n7,785 \n$\n7,054 \nLoss and loss expenses paid\n(4,381)\n(4,276)\n(3,687)\nCommissions and other underwriting expenses paid\n(2,607)\n(2,287)\n(2,132)\nCash flow from underwriting \n1,907\n \n1,222 \n1,235 \nInvestment income received\n714\n \n609 \n529 \nCash flow from operations\n$\n2,621\n \n$\n1,831 \n$\n1,764 \n \nOther Sources of Liquidity\nCash in excess of operating requirements is invested in fixed-maturity and equity securities. Cash generated from investment income provides an important investment contribution to cash flow and liquidity. The sale of investments could provide an additional source of liquidity at either the parent company or insurance subsidiary level, if required. In addition to possible sales of investments, proceeds of calls or maturities of fixed-maturity securities also can provide liquidity. During the five-year period beginning in 2025, fair value of $5.244 billion, or 31.8%, of our fixed-maturity and short-term portfolio is scheduled to mature. At December 31, 2024, we had $10.836 billion of common stock securities, with $\n4.563\n billion, \nor \n42%\n, h\neld by the parent company. \n \nFinancial resources of the parent company also could be made available to our insurance subsidiaries, if circumstances required it. This flexibility would include our ability to access the capital markets and short-term bank borrowings. We generally have minimized our reliance on debt financing, although we may use the line of credit to fund short-term cash needs.\n \nCincinnati Financial Corporation - 2024 10-K - Page 93\nTable of Contents\nLong-Term Debt\nWe provide details of our three long-term notes in Item 8, Note 8 of the Consolidated Financial Statements. None of the notes are encumbered by rating triggers. The total principal amount of our long-term debt at December 31, 2024, was $793 million and included:\n•\n$28 million aggregate principal amount of 6.900% senior debentures due 2028.\n•\n$391 million aggregate principal amount of 6.920% senior debentures due 2028.\n•\n$374 million aggregate principal amount of 6.125% senior debentures due 2034.\nThe company’s senior debt is rated investment grade by four independent rating agencies. None of the rating agencies made changes to our debt ratings in 2024. At February 21, 2025, our debt ratings from the rating agencies were: a from A.M. Best, A- from Fitch, A3 from Moody’s and BBB+ from S&P.\n \nNote Payable\nAt December 31, 2024\n, we had a $300 million line of credit with commercial banks, with $25 million borrowed at both December 31, 2024 and 2023. \nThat unsecured revolving line of credit has an accordion feature giving us the option to double the $300 million amount, under the same terms and conditions. Terms and conditions of the agreement include a debt-to-total capital maximum of 35% and the agreement has no net worth covenan\nt. It was due to expire on February 4, 2024\n,\n with the option of two one-year extensions. We exercised both one-year options to extend the term of the line of credit by two additional years to February 4, 2026. \nAt year-end 2024, we were in compliance with all covenants under the credit agreement and believe we will remain in compliance. The credit agreement provides alternative interest charges based on the type of borrowing and our debt rating. On March 23, 2023, we amended our line of credit agreement to replace LIBOR with the Secured Overnight Financing Rate (SOFR) plus a credit spread adjustment. \nCapital Resources\nCapital resources, consisting of shareholders’ equity and total debt, represent our overall financial strength to support current obligations and growth in our insurance businesses. At December 31, 2024, we had total capital of $14.750 billion. Shareholders’ equity was $13.935 billion, an increase of $1.837 billion, or 15%, from the prior year. Our total debt was $815 million, unchanged from a year ago. We seek to maintain a solid financial position and provide capital flexibility by keeping our ratio of debt to total capital moderate. At year-end 2024, the ratio was 5.5%, compared with 6.3% at year-end 2023.\nAt times we enter into letter of credit agreements to support our Cincinnati Re and Cincinnati Global operations. On December 23, 2024, we entered into a reimbursement agreement to allow for issuances of letters of credit necessary for the operations of Cincinnati Re, not to exceed $25 million. No amounts were drawn at December 31, 2024. We had an unsecured letter of credit agreement of $94 million to provide a portion of the capital needed to support Cincinnati Global's obligations at Lloyd's, with no amounts drawn at December 31, 2023. On September 12, 2024, we terminated our unsecured letter of credit agreement and replaced the letter of credit agreement with common equities, bringing total common equities held in Lloyd's trust accounts to $216 million, at December 31, 2024.\n \nAt the discretion of the board of directors, the company can return capital directly to shareholders as \ndiscussed below.\n•\nDividends to shareholders – The ability of our company to continue paying cash dividends is subject to factors the board of directors deems relevant. While the board and management believe there is merit to sustaining the company’s long record of dividend increases, our first priority is the company’s financial strength. Over the past 10 years, the company has paid an average of 29% of net income as dividends. Through 2024, the board had increased our cash dividend for 64 consecutive years. The board's decision in January 2025 to increase the dividend demonstrated confidence in the company’s strong capital, liquidity, financial flexibility and initiatives to grow earnings.\n•\nCommon stock repurchase – Generally, our board believes that share repurchases can help fulfill our commitment to enhancing shareholder value. Consequently, the board has authorized the repurchase of outstanding shares, giving management discretion to purchase shares at reasonable prices in light of circumstances at the time of purchase. Our approach has been to hold capital adequate to support future growth of our insurance operations and repurchase shares at management's discretion. Repurchases are intended to offset the issuance of shares \nCincinnati Financial Corporation - 2024 10-K - Page 94\nTable of Contents\nthrough equity compensation plans, primarily due to vesting of service-based restricted stock units of equity awards granted in the past. The amount of future repurchases may be more, or less, than the past, depending on circumstances and discretion exercised by management. Our corporate Code of Conduct restricts repurchases during certain time periods. The details of the repurchase authorizations and activity are described in Item 5, Market for the Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\n \nObligations\nWe pay obligations to customers, suppliers and associates in the normal course of our business operations. Some are contractual obligations that define the amount, circumstances and/or timing of payments. We have other commitments for business expenditures; such as $188 million we expect to fund for our private equity and real estate investments, however, the amount, circumstances and/or timing of our other commitments are not dictated by contractual arrangements.\n \nContractual Obligations\nAt December 31, 2024, we estimated our significant future contractual obligations as follows:\n(Dollars in millions)\nYear\nYears\nThere-\n \nPayment due by period\n2025\n2026-2029\nafter\nTotal\nGross property casualty loss and loss expense payments\n$\n3,287 \n$\n5,171 \n$\n1,479 \n$\n9,937 \nGross life policyholder obligations\n133 \n466 \n5,371 \n5,970 \nLong-term debt\n— \n419 \n374 \n793 \nInterest on long-term debt\n52 \n164 \n103 \n319 \nProfit-sharing commissions\n221 \n— \n— \n221 \nOther liabilities\n132 \n50 \n2 \n184 \nTotal\n$\n3,825 \n$\n6,270 \n$\n7,329 \n$\n17,424 \n \nLiquidity and Capital Resources Outlook  \nAt December 31, 2024, we had $983 millio\nn\n in cash and cash equivalents. During 2025, our lead insurance subsidiary may pay a maximum of $1.245 billion in dividends to our parent company without regulatory approval. That strong liquidity and our consistent cash flows give us the flexibility to meet current obligations and commitments while building value by prudently investing where we see potential for both current income and long-term return. Our cash and cash equivalents provide adequate financial cushion when short-term operating results do not meet our objectives.\nA long-term perspective governs our liquidity and capital resources decisions, with the goal of benefiting our policyholders, agents, shareholders and associates over time. Our underwriting philosophy and initiatives can drive performance to achieve underwriting profit. Our GAAP combined ratio averaged 94.6% over the five-year period 2020 through 2024, resulting in strong underwriting profits.\nIn any year, we consider the most likely source of pressure on liquidity would be an unusually high level of catastrophe loss payments within a short period of time. There could be additional obligations for our insurance operations due to increasing severity or frequency of noncatastrophe claims. To address the risk of unusually large insurance loss obligations, including catastrophe events, we maintain property casualty reinsurance contracts with highly rated reinsurers, as discussed under 2025 Reinsurance Ceded Programs. We also monitor the financial condition of our reinsurers because their insolvency could jeopardize a portion of our $523 million reinsurance recoverable asset at December 31, 2024. Parent-company liquidity could also be constrained by Ohio regulatory requirements that restrict the dividends insurance subsidiaries can pay. \n \nEconomic weakness also has the potential to affect our liquidity and capital resources in a number of different ways, including delinquent payments from agencies, defaults on interest payments by fixed-maturity holdings in our portfolio, dividend reductions by holdings in our equity portfolio or declines in the market value of holdings in our portfolio. \nCincinnati Financial Corporation - 2024 10-K - Page 95\nTable of Contents\nOff-Balance-Sheet Arrangements\nWe do not use any special-purpose financing vehicles or have any undisclosed off-balance-sheet arrangements (as that term is defined in applicable SEC rules) that are reasonably likely to have a current or future material effect on the company’s financial condition, results of operation, liquidity, capital expenditures or capital resources.\n \nProperty Casualty Loss and Loss Expense Obligations and Reserves\nOur estimate of future gross property casualty loss and loss expense payments of $9.937 billion is lower than loss and loss expense reserves of $10.003 billion reported on our balance sheet at December 31, 2024. The $66 million difference is due to certain life and health loss reserves. Reserving practices are discussed in Critical Accounting Estimates, Property Casualty Insurance Loss and Loss Expense Reserves.\n \nFor the business lines in the commercial and personal lines insurance segments, and in total for the excess and surplus lines insurance segment and for other parts of our property casualty insurance operations, the following table details gross reserves among case, IBNR and loss expense reserves, net of salvage and subrogation. The $962 million increase in total gross reserves included an $8 million decrease in case loss reserves, a $788 million increase in IBNR loss reserves and a $182 million increase in loss expense reserves. The increase in total gross reserves included $335 million for our commercial casualty line of business, $177 million for excess and surplus lines and $168 million for Cincinnati Re.\n \nCincinnati Financial Corporation - 2024 10-K - Page 96\nTable of Contents\nProperty Casualty Gross Loss and Loss Expense Reserves\n(Dollars in millions)\nLoss reserves\nLoss expense reserves\nTotal gross reserves\n \n \nCase reserves\nIBNR reserves\nPercent of total\nAt December 31, 2024\nCommercial lines insurance:\n \n \n \n \n \nCommercial casualty\n$\n1,121\n \n$\n1,498\n \n$\n824\n \n$\n3,443\n \n34.7\n \n%\nCommercial property\n251\n \n199\n \n90\n \n540\n \n5.4\n \nCommercial auto\n423\n \n355\n \n159\n \n937\n \n9.4\n \nWorkers' compensation\n389\n \n564\n \n89\n \n1,042\n \n10.5\n \nOther commercial\n159\n \n45\n \n137\n \n341\n \n3.4\n \nSubtotal\n2,343\n \n2,661\n \n1,299\n \n6,303\n \n63.4\n \nPersonal lines insurance:\n \n \n \n \n \nPersonal auto\n260\n \n106\n \n100\n \n466\n \n4.7\n \nHomeowner\n244\n \n134\n \n88\n \n466\n \n4.7\n \nOther personal\n102\n \n166\n \n9\n \n277\n \n2.8\n \nSubtotal\n606\n \n406\n \n197\n \n1,209\n \n12.2\n \nExcess and surplus lines\n395\n \n425\n \n289\n \n1,109\n \n11.2\n \nCincinnati Re\n191\n \n880\n \n8\n \n1,079\n \n10.8\n \nCincinnati Global\n119\n \n115\n \n3\n \n237\n \n2.4\n \nTotal\n$\n3,654\n \n$\n4,487\n \n$\n1,796\n \n$\n9,937\n \n100.0\n \n%\nAt December 31, 2023\n \n \n \n \n \nCommercial lines insurance:\n \n \n \n \n \nCommercial casualty\n$\n1,111 \n$\n1,205 \n$\n792 \n$\n3,108 \n34.6 \n%\nCommercial property\n362 \n116 \n81 \n559 \n6.3 \nCommercial auto\n418 \n303 \n142 \n863 \n9.6 \nWorkers' compensation\n431 \n540 \n89 \n1,060 \n11.8 \nOther commercial\n143 \n26 \n128 \n297 \n3.3 \nSubtotal\n2,465 \n2,190 \n1,232 \n5,887 \n65.6 \nPersonal lines insurance:\n \n \n \n \n \nPersonal auto\n222 \n74 \n73 \n369 \n4.1 \nHomeowner\n215 \n122 \n58 \n395 \n4.4 \nOther personal\n101 \n119 \n6 \n226 \n2.5 \nSubtotal\n538 \n315 \n137 \n990 \n11.0 \nExcess and surplus lines\n360 \n336 \n236 \n932 \n10.4 \nCincinnati Re\n158 \n747 \n6 \n911 \n10.2 \nCincinnati Global\n141 \n111 \n3 \n255 \n2.8 \nTotal\n$\n3,662 \n$\n3,699 \n$\n1,614 \n$\n8,975 \n100.0 \n%\n \nCincinnati Financial Corporation - 2024 10-K - Page 97\nTable of Contents\nAsbestos and Environmental Loss and Loss Expense Reserves\nWe carried $119 million of net loss and loss expense reserves for asbestos and environmental claims at year-end 2024, compared with $98 million at year-end 2023. The asbestos and environmental claims amounts for each respective year constituted less than 2.0% of total net loss and loss expense reserves at these year-end dates.\n \nWe believe our exposure to asbestos and environmental claims is limited, largely because our reinsurance retention was $500,000 or below prior to 1987. We also were predominantly a personal lines company in the 1960s and 1970s, when asbestos and pollution exclusions were not widely used by commercial lines insurers. During the 1980s and early 1990s, commercial lines grew as a percentage of our overall business and our exposure to asbestos and environmental claims grew accordingly. Over that period, we endorsed to or included in most policies an asbestos and environmental exclusion.\n \nAdditionally, since 2002, we have revised policy terms where permitted by state regulation to limit our exposure to mold claims prospectively and further reduce our exposure to environmental claims generally. Finally, we have not engaged in any mergers or acquisitions through which such a liability could have been assumed. We continue to monitor our claims for evidence of material exposure to other mass tort classes, but we have found no such credible evidence to date.\n \nReserving data for asbestos and environmental claims has characteristics that limit the usefulness of the methods and models used to analyze loss and loss expense reserves for other claims. Specifically, asbestos and environmental loss and loss expenses for different accident years do not emerge independently of one another as loss development and Bornhuetter-Ferguson methods assume. In addition, asbestos and environmental loss and loss expense data available to date did not reflect a well-defined tail, greatly complicating the identification of an appropriate probabilistic trend family model. At year-end 2024, we used a weighted average of a paid survival ratio method and report year method to estimate reserves for IBNR asbestos and environmental claims. Our exposure to such claims is limited; we believe a weighted average of both methods produces a sufficient level of reserves.\n \nGross Property Casualty Loss and Loss Expense Payments\nWhile we believe that historical performance of property casualty and life loss payment patterns is a reasonable source for projecting future claim payments, there is inherent uncertainty in this estimate of contractual obligations. We believe that we could meet our obligations under a significant and unexpected change in the timing of these payments because of the liquidity of our invested assets, strong financial position and access to lines of credit.\n \nOur estimates of gross property casualty loss and loss expense payments do not include reinsurance receivables or ceded losses. As discussed in 2025 Reinsurance Ceded Programs, we purchase reinsurance to mitigate our property casualty risk exposure. Ceded property casualty reinsurance unpaid receivables of $269 million at year-end 2024 are an offset to our gross property casualty loss and loss expense obligations. Our reinsurance program mitigates the liquidity risk of a single large loss or an unexpected rise in claim severity or frequency due to a catastrophic event. Reinsurance does not relieve us of our obligation to pay covered claims. The financial strength of our reinsurers is important because our ability to recover losses under our reinsurance agreements depends on the financial viability of the reinsurers.\n \nWe direct our associates to settle claims and pay losses as quickly as is practical, and we made $4.381 billion of net claim payments during 2024. At year-end 2024, total net property casualty reserves of $9.668 billion reflected $3.499 billion in unpaid amounts on reported claims (case reserves), $1.785 billion in loss expense reserves and $4.384 billion in estimates of claims that were incurred but had not yet been reported (IBNR). The specific amounts and timing of obligations related to case reserves and associated loss expenses are not set contractually. The amounts and timing of obligations for IBNR claims and related loss expenses are unknown. We discuss our methods of establishing loss and loss expense reserves and our belief that reserves are adequate in Critical Accounting Estimates, Property Casualty Insurance Loss and Loss Expense Reserves.\n \nCincinnati Financial Corporation - 2024 10-K - Page 98\nTable of Contents\nThe historical pattern of using premium receipts for the payment of loss and loss expenses has enabled us to extend slightly the maturities of our investment portfolio beyond the estimated settlement date of the loss reserves. The effective duration of our consolidated property casualty fixed-maturity portfolio was 5.2 years at year-end 2024. By contrast, the duration of our loss and loss expense reserves was approximately 3.3 years. We believe this difference in duration does not affect our ability to meet current obligations because cash flow from operations is sufficient to meet these obligations. In addition, investment holdings could be sold, if necessary, to meet higher than anticipated loss and loss expenses.\n \nRange of Reasonable Reserves\nThe company established a reasonably likely range for net loss and loss expense reserves of $8.948 billion to $9.816 billion at year-end 2024, with the company carrying net reserves of $9.668 billion. The range was $7.926 billion to $8.704 billion at year-end 2023, with the company carrying net reserves of $8.613 billion. Our loss and loss expense reserves are not discounted for the time-value of money, but we have reduced the reserves by an estimate of the amount of salvage and subrogation payments we expect to recover.\n \nThe low point of each year’s range corresponds to approximately one standard error below each year’s mean reserve estimate, while the high point corresponds to approximately one standard error above each year’s mean reserve estimate. We discussed management’s reasons for basing reasonably likely reserve ranges on standard errors in Critical Accounting Estimates, Reserve Estimate Variability.\n \nThe ranges reflect our assessment of the most likely unpaid loss and loss expenses at year-end 2024 and 2023. However, actual unpaid loss and loss expenses could nonetheless fall outside of the indicated ranges.\n \nManagement’s best estimate of total loss and loss expense reserves as of year-end 2024 and 2023 was consistent with the corresponding actuarial best estimate. \n \nCincinnati Financial Corporation - 2024 10-K - Page 99\nTable of Contents\nProperty Casualty Insurance Development of Estimated Reserves by Accident Year\nThe following table shows net reserve changes at year-end 2024, 2023 and 2022 by property casualty segment and accident year: \n(Dollars in millions)\nCommercial\nPersonal\nE&S\n \n \nlines\nlines\nlines\nOther\nTotals\nAs of December 31, 2024\n2023 accident year\n$\n(217)\n$\n(52)\n$\n(57)\n$\n(43)\n$\n(369)\n2022 accident year\n(89)\n6\n \n5\n \n15\n \n(63)\n2021 accident year\n(5)\n17\n \n21\n \n(38)\n(5)\n2020 accident year\n24\n \n1\n \n14\n \n(7)\n32\n \n2019 accident year\n43\n \n3\n \n8\n \n(2)\n52\n \n2018 accident year\n25\n \n1\n \n6\n \n2\n \n34\n \n2017 and prior accident years\n81\n \n(2)\n11\n \n(7)\n83\n \n(Favorable)/unfavorable\n$\n(138)\n$\n(26)\n$\n8\n \n$\n(80)\n$\n(236)\nAs of December 31, 2023\n2022 accident year\n$\n(67)\n$\n(45)\n$\n(16)\n$\n(9)\n$\n(137)\n2021 accident year\n(29)\n(5)\n— \n13 \n(21)\n2020 accident year\n(42)\n(1)\n(7)\n(18)\n(68)\n2019 accident year\n5 \n(3)\n4 \n— \n6 \n2018 accident year\n(3)\n(3)\n(1)\n(1)\n(8)\n2017 accident year\n(6)\n(5)\n4 \n— \n(7)\n2016 and prior accident years\n19 \n(2)\n5 \n(2)\n20 \n(Favorable)/unfavorable\n$\n(123)\n$\n(64)\n$\n(11)\n$\n(17)\n$\n(215)\nAs of December 31, 2022\n2021 accident year\n$\n(59)\n$\n(52)\n$\n14 \n$\n1 \n$\n(96)\n2020 accident year\n(85)\n(15)\n(14)\n(10)\n(124)\n2019 accident year\n64 \n4 \n(2)\n6 \n72 \n2018 accident year\n26 \n2 \n(1)\n(5)\n22 \n2017 accident year\n(5)\n— \n(2)\n(3)\n(10)\n2016 accident year\n(10)\n(2)\n(2)\n(1)\n(15)\n2015 and prior accident years\n(7)\n2 \n(2)\n(1)\n(8)\n(Favorable)/unfavorable\n$\n(76)\n$\n(61)\n$\n(9)\n$\n(13)\n$\n(159)\n \nOverall favorable development for consolidated property casualty reserves of $236 million in 2024 illustrated the potential for revisions inherent in estimating reserves, especially for long-tail lines such as commercial casualty and workers’ compensation. As noted in Critical Accounting Estimates, Key Assumptions Loss Reserving, our models predict that actual loss and loss expense emergence will differ from projections, and we do not attempt to monitor or identify such normal variations. The table in Property Casualty Loss and Loss Expense Obligations and Reserves shows reserves by segment and lines of business and the components of gross reserves among case, IBNR and loss expense reserves.\n \nCincinnati Financial Corporation - 2024 10-K - Page 100\nTable of Contents\nFavorable reserve development was $83 million for our workers' compensation line of business, $74 million for our commercial property line of business and $54 million for our homeowner line of business, together accounting for approximately 89% of the overall total. Unfavorable, or adverse, reserve development included $26 million for our commercial casualty line of business. Drivers of significant reserve development typically reflect loss emergence on known claims that was more favorable or less favorable than previously anticipated for various lines of business and are discussed below. \n•\nCommercial casualty – During 2024 and 2023, we experienced unfavorable development on prior accident years in aggregate, driven by general liability coverages. Loss emergence for general liability claims rose more than anticipated and reflected economic or other forms of inflation. Due to increased uncertainty regarding ultimate losses, we intend to remain prudent in reserving for estimated ultimate losses until longer-term loss cost trends become more clear. We continue to monitor activity for various commercial casualty coverages so we can detect changes in trends on a timely basis. \n•\nWorkers’ compensation – We experienced favorable reserve development again during 2024, for all prior accident years in aggregate, as claim frequencies continued to decline more than we expected. However, we continue to monitor this line of business closely, as a sudden increase in trend for future payments has a highly leveraged effect. \n•\nCommercial auto – Ultimate losses developed favorably by small amounts during calendar years 2024 and 2023, for all prior accident years in aggregate. We believe inflation in recent years and reduced driving during the pandemic caused deviations from historical loss patterns. Due to increased uncertainty regarding ultimate losses, we intend to remain prudent in reserving for estimated ultimate losses until longer-term loss cost trends become more clear. \n•\nCommercial property and homeowner – Loss emergence was less than anticipated for both 2024 and 2023. The majority of homeowner favorable reserve development for both years related to natural catastrophe events with inherently variable loss patterns. For commercial property, catastrophe events accounted for a significant portion, but less than half, of the favorable reserve development for both years. \nFor the excess and surplus lines insurance segment, the table showing reserves by segment and lines of business in Property Casualty Loss and Loss Expense Obligations and Reserves, shows the components of gross reserves among case, IBNR and loss expense reserves. Total gross reserves increased $177 million from year-end 2023, largely due to the increase in premiums and exposures for this segment, as we discussed in Excess and Surplus Lines Insurance Results. Net reserve development was an unfavorable $8 million during 2024, following favorable development of $11 million during 2023 and $9 million during 2022. Approximately 90% of our excess and surplus lines insurance premiums are for commercial casualty coverages. In 2024, loss emergence for claims rose more than anticipated and reflected economic or other forms of inflation, similar to our commercial casualty line of business. Unfavorable reserve development following a period of favorable development, or vice-versa, shown in the table above, illustrates the potential for revisions inherent in estimating reserves. \n \nCincinnati Financial Corporation - 2024 10-K - Page 101\nTable of Contents\nLife Insurance Policyholder Obligations and Reserves \n \nGross Life Insurance Policyholder Obligations\nOur estimates of life, annuity and disability policyholder obligations reflect future estimated cash payments to be made to policyholders for future policy benefits, policyholders’ account balances and separate account liabilities. These estimates include death and disability income claims, policy surrenders, policy maturities, annuity payments, minimum guarantees on separate account products, commissions and premium taxes offset by expected future deposits and premiums on in-force contracts. Further, these estimates are based on mortality, morbidity and lapse assumptions reflective of our recent experience and expectations of future payment obligations.\n \nOur estimates of gross life, annuity and disability obligations do not reflect net recoveries from reinsurance agreements. Ceded life reinsurance receivables were $207 million at year-end 2024. As discussed in 2025 Reinsurance Ceded Programs, we purchase reinsurance to mitigate our life insurance risk exposure. At year-end 2024, ceded death benefits represented approximately 32% of our total gross policy face amounts in force.\n \nThese estimated cash outflows are undiscounted with respect to interest. As a result, the sum of the cash outflows for all years of $5.971 billion (total of life insurance obligations) exceeds the liabilities recorded in life policy and investment contract reserves and separate accounts for future policy benefits and claims of $3.909 billion (total of life insurance policy reserves and separate account policy reserves). A significant portion of the difference can be attributed to the time value of money. \n \nWe have made significant assumptions to determine the estimated undiscounted cash flows of these policies and contracts that include mortality, morbidity, future lapse rates and interest crediting rates. Due to the significance of the assumptions used, the amounts presented could materially differ from actual results.\n \nLife Insurance Reserves\nGross life policy and investment contract reserves were $2.960 billion at year-end 2024, compared with $3.068 billion at year-end 2023. The decrease was primarily due to an increase in market value discount rates partially offset by continued growth in net in-force life insurance policy face amounts. We establish reserves for traditional life insurance policies based on certain cash flow assumptions including mortality, morbidity and lapse rates as well as a discount rate assumption. The cash flow assumptions are based on our current expectations and are reviewed annually to determine any necessary updates. These assumptions are also updated on an interim basis if evidence suggests that they should be revised. The discount rate assumption is based on upper-medium grade fixed-income instrument yields (market value discount rates) and is updated quarterly. We use both our own experience and industry experience adjusted for historical trends in arriving at our cash flow assumptions. \n \nWe establish reserves for our universal life, deferred annuity and other investment contracts equal to the cumulative account balances, which include premium deposits plus credited interest less charges and withdrawals. Some of our universal life insurance policies contain no-lapse guarantee provisions. For these policies, we establish a reserve in addition to the account balance based on expected no-lapse guarantee benefits and expected policy assessments.\n \nCincinnati Financial Corporation - 2024 10-K - Page 102\nTable of Contents\nModeled Catastrophe Loss Exposure\nA single large loss or an unexpected rise in claims severity or frequency due to a catastrophic event is a risk to the company's liquidity and financial strength. To control such losses, we limit marketing property casualty insurance in specific geographic areas and monitor our exposure in certain coastal regions. Examples of this include limiting our earthquake writings in the New Madrid region or leveraging more restrictive terms and conditions through the use of our excess and surplus company in higher risk areas for wildfire or hurricane. Loss exposures in these areas have been identified as a major contributor to our catastrophe probable maximum loss estimates. We also continually review aggregate exposures to large disasters and purchase reinsurance protection to cover these exposures. For business other than Cincinnati Re and Cincinnati Global, we use the Risk Management Solutions (RMS) and Verisk models to evaluate exposures to a once-in-a-100-year and a once-in-a-250-year event to help determine appropriate reinsurance coverage programs. In conjunction with these activities, we also continue to evaluate information provided by our reinsurance broker. Examples include deterministic modeling of probable maximum loss contribution from growth in new geographic territories. \n \nTo help determine appropriate reinsurance coverage for hurricane, earthquake and severe convective storm exposures, for business other than Cincinnati Re and Cincinnati Global we use the RMS and Verisk models to estimate the probable maximum loss from a single event or multiple events occurring in a one-year period. The models are proprietary in nature, and the vendors that provide them periodically update the models, sometimes resulting in significant changes to their estimate of probable maximum loss. As of the end of 2024, both models indicated that a hurricane event represents our largest amount of exposure to losses. The table below summarizes estimated probabilities and the corresponding probable maximum loss from a single hurricane event occurring in a one-year period and indicates the effect of such losses on consolidated shareholders’ equity at December 31, 2024. Net losses are net of reinsurance, estimated reinstatement premiums and income taxes, assuming a 21% federal tax rate, and assume our 2025 reinsurance programs apply.\nAccording to these models, probable maximum loss estimates from a single hurricane event that combine the effects of property casualty insurance written on a direct basis by The Cincinnati Insurance Companies, the Cincinnati Re reinsurance portfolio and risks insured by Cincinnati Global include the following amounts, net of amounts recoverable through reinsurance ceded and also income taxes, and including the effects of estimated reinstatement premiums: $625 million for a once-in-a-100-year event and $949 million for a once-in-a-250-year event.\nFor business other than Cincinnati Re and Cincinnati Global:\n(Dollars in millions)\nRMS Model\nVerisk Model\n \n \n \nPercent\n \n \nPercent\n \nGross\nNet\nof total\nGross\nNet\nof total\nProbability at December 31, 2024\nlosses\nlosses\nequity\nlosses\nlosses\nequity\n2.0% (1 in 50 year event)\n$\n691 \n$\n285 \n2.0 \n%\n$\n709 \n$\n284 \n2.0 \n%\n1.0% (1 in 100 year event)\n1,092 \n342 \n2.5 \n1,143 \n340 \n2.4 \n0.4% (1 in 250 year event)\n1,797 \n609 \n4.4 \n1,774 \n580 \n4.2 \n0.2% (1 in 500 year event)\n2,525 \n1,170 \n8.4 \n2,484 \n1,152 \n8.3 \n \nThe modeled losses according to RMS in the table are based on its RiskLink version 24 catastrophe model and use a long-term storm catalog methodology. The modeled losses according to Verisk in the table are based on its Touchstone\n® \nversion 10.0 catastrophe model and use a long-term methodology. The Verisk and RMS storm catalogs include decades of documented weather events used in simulations for probable maximum loss projections.\nBased on treaties in effect at January 1, 2025, the largest loss exposure to us for Cincinnati Re is from natural catastrophe events. That exposure includes probable maximum loss estimates of the following amounts: $242 million for a once-in-a-100-year event and $321 million for a once-in-a-250-year event. Those effects are on a standalone basis and represent a single hurricane event and include the effects of income taxes, estimated reinstatement premiums and applicable reinsurance ceded, including any retrocessions for reinsurance assumed, and estimated reinstatement premiums. They are based on probable maximum loss estimates from the Verisk Touchstone version 10.0 catastrophe model.\nCincinnati Financial Corporation - 2024 10-K - Page 103\nTable of Contents\nFor Cincinnati Re:\n(Dollars in millions)\nStandalone Basis\nPercent\nNet\nof total\nProbability at December 31, 2024\nlosses\nequity\n1.0% (1 in 100 year event)\n$\n242 \n1.7 \n%\n0.4% (1 in 250 year event)\n321 \n2.3 \n%\n \nAt January 1, 2025, the largest loss exposure to us for Cincinnati Global is from natural catastrophe events. Cincinnati Global's exposure from such events includes probable maximum loss estimates of the following amounts: $65 million for a once-in-a-100-year event and $79 million for a once-in-a-250-year event. Those effects are on a standalone basis and represent a single hurricane event and include the effects of income taxes, applicable reinsurance ceded and estimated reinstatement premiums. They are based on probable maximum loss estimates from the Verisk Touchstone version 10.0 catastrophe model.\nFor Cincinnati Global:\n(Dollars in millions)\nStandalone Basis\nPercent\nNet\nof total\nProbability at December 31, 2024\nlosses\nequity\n1.0% (1 in 100 year event)\n$\n65 \n0.5 \n%\n0.4% (1 in 250 year event)\n79 \n0.6 \n%\nCincinnati Financial Corporation - 2024 10-K - Page 104\nTable of Contents\n2025 Reinsurance Ceded Programs\nReinsurance mitigates the risk of highly uncertain exposures and limits the maximum net loss that can arise from large risks or risks concentrated in areas of exposure. Management’s decisions about the appropriate structure of reinsurance protection and level of risk retention are affected by various factors, including changes in our underwriting practices, capacity to retain risks and reinsurance market conditions.\nReinsurance does not relieve us of our obligation to pay covered claims. The financial strength of our reinsurers is important because our ability to recover for losses covered under any reinsurance agreement depends on the financial viability of the reinsurer.\nFor 2025, the primary participants on our standard market property and casualty per-risk and per-occurrence reinsurance ceded programs include Hannover Ruck SE, Munich Reinsurance America, Partner Reinsurance Company of the U.S., Transatlantic Reinsurance Company and Swiss Reinsurance America Corporation, all of which had A.M. Best insurer financial strength ratings of A (Excellent) or better as of December 31, 2024. Our property catastrophe program is subscribed through a broker by reinsurers from the U.S., Bermuda, London and the European markets. The largest participant in our property catastrophe program, representing approximately 16% of total participation, is the Lloyd's of London placement that features numerous syndicates. Some of the other reinsurers with large participation in the program include Partner Reinsurance Company Ltd., Mapfre Re, Lancashire Insurance Company Limited, Chubb Tempest Reinsurance Ltd. and Hamilton Re, Ltd. \n \nThe following table shows our five largest property casualty reinsurance receivable amounts by reinsurer at year-end 2024 and 2023. Michigan Catastrophic Claims Association is a mandatory nonprofit association which runs a reinsurance program funded by an annual premium assessment per vehicle. This assessment covers Michigan’s automobile no-fault policies, which provide unlimited lifetime coverage for medical expenses resulting from auto accidents. The A.M. Best insurer financial strength ratings as of the end of the two most recent years are also shown for each of those reinsurers that have an applicable rating.\n(Dollars in millions)\n2024\n2023\nName of reinsurer\nTotal\nreceivable\nA.M. Best\nRating\nTotal\nreceivable\nA.M. Best\nRating\nMunich Reinsurance America\n$\n43\n \nA+\n$\n50 \nA+\nHartford Steam Boiler Inspection & Insurance Company\n35\n \nA++\n35 \nA++\nHannover Ruck SE\n35\n \nA+\n47 \nA+\nMichigan Catastrophic Claims Association\n30\n \nNA\n33 \nNA\nSwiss Reinsurance America Corporation\n29\n \nA+\n42 \nA+\nPrimary components of the 2025 property and casualty reinsurance program are summarized below. The premium estimates below occurred near the beginning of each respective year, when direct written premiums that were subject to applicable reinsurance treaties were also estimated.\n•\nProperty per risk treaty – The primary purpose of the property treaty is to provide capacity up to $50 million, adequate for the majority of the risks we write. It also includes protection for extra-contractual liability coverage losses. We retain the first $15 million of each loss. Losses between $15 million and $50 million are reinsured at 100%. The 2025 ceded premium estimate was $52 million, compared with $71 million for the 2024 estimate when we retained the first $10 million of each loss. \n•\nProperty excess treaty – We purchased a property reinsurance treaty that provides an additional $75 million in protection for certain property losses. This treaty, along with the property per risk treaty, provides a total of $125 million of protection. The 2025 ceded premium estimate was approximately $14 million, compared with $9 million for the 2024 estimate when the coverage amount was $50 million. \n•\nCasualty per occurrence treaty – The casualty treaty provides capacity up to $25 million. Similar to the property treaty, it provides sufficient capacity to cover the vast majority of casualty accounts we insure and also includes protection for extra-contractual liability coverage losses. We retain the first $10 million of each loss. Losses between $10 million and $25 million are reinsured at 100%. The 2025 ceded premium estimate was $21 million, compared with $20 million for the 2024 estimate. \n•\nCasualty excess treaty – We purchase a casualty reinsurance treaty that provides an additional $55 million in protection for certain casualty losses. This treaty, along with the casualty per occurrence treaty, provides a total of \nCincinnati Financial Corporation - 2024 10-K - Page 105\nTable of Contents\n$80 million of protection for workers’ compensation, extra-contractual liability coverage and clash coverage losses, which would apply when a single occurrence involves multiple policyholders of The Cincinnati Insurance Companies or multiple coverages for one insured. The 2025 ceded premium estimate was approximately $5 million, compared with $4 million for the 2024 estimate when the coverage was $70 million. \n•\nProperty catastrophe treaty – To protect against catastrophic events such as wind and hail, wildfires, winter storms, hurricanes or earthquakes, we purchased property catastrophe reinsurance with a limit up to $1.500 billion. This treaty and our property and casualty treaties contain exclusions for communicable disease and cyber losses. Aggregation of losses into one event, sometimes referred to as an hours clause, varies by peril. For example, the general provision in this treaty is 168 hours, but it is 120 hours for a wind event and 96 hours for a riot or civil commotion event. Losses from the same occurrence can be aggregated into one limit over the hour period applicable to the peril causing the loss and applied to the treaty towards recovery. The treaty contains one reinstatement provision. The 2025 ceded premium estimate was $98 million, compared with $76 million for the 2024 estimate when the limit of coverage was $1.200 billion and we retained more risk for some of the layers described below. We retain the first $200 million of any loss, and a share of losses up to $1.500 billion. The percentage share we retain for each layer of coverage is indicated below:\n◦\n56.3% of losses between $200 million and $300 million\n◦\n25.0% of losses between $300 million and $400 million\n◦\n12.5% of losses between $400 million and $600 million\n◦\n12.5% of losses between $600 million and $800 million\n◦\n12.5% of losses between $800 million and $1.000 billion\n◦\n15.0% of losses between $1.000 billion and $1.300 billion\n◦\n15.0% of losses between $1.300 billion and $1.450 billion\n◦\n15.0% of losses between $1.450 billion and $1.500 billion\nAfter reinsurance our maximum exposure to a catastrophic event that causes $1.500 billion in covered losses in 2025 would be $431 million, compared with retention of $748 million in 2024 for an event causing $1.500 billion in covered losses. The largest catastrophe loss event in our history prior to 2025 occurred during 2022 from a December 21-31 winter storm system that affected many states in the U.S. Our losses from that storm were estimated to be $247 million, before reinsurance, as of December 31, 2024. The second largest catastrophe loss event in our history occurred during 2011 from a May 20-27 storm system that included a tornado in Joplin, Missouri, and that also included significant losses from hail in the Dayton, Ohio, area. Our losses from that storm were estimated to be $226 million, before reinsurance, based on updated estimates as of December 31, 2017.\nIndividual risks with insured values in excess of $125 million, as identified in the policy, are handled through a different reinsurance mechanism. We typically reinsure commercial property coverage for individual risks with insured values between $125 million and $360 million under an automatic facultative agreement. For commercial property risks with property values exceeding $360 million, we negotiate the purchase of facultative coverage on an individual certificate basis. For casualty coverage on individual risks with limits exceeding $25 million, facultative reinsurance coverage is placed on an individual certificate basis. For risks with casualty limits that are between $25 million and $27 million, we sometimes forego facultative reinsurance and retain an additional $2 million of loss exposure.\n \nTerrorism coverage at various levels has been secured in most of our reinsurance agreements. The broadest coverage for this peril is found in the property and casualty working treaties, the property per risk treaty and the casualty per occurrence treaty, which provide coverage for commercial and personal risks. Our property catastrophe treaty provides terrorism coverage for personal risks and commercial risks. For insured values between $15 million and $125 million, there also may be coverage in the property working treaty.\n \nA form of reinsurance is also provided through The Terrorism Risk Insurance Act of 2002 (TRIA). TRIA was originally signed into law on November 26, 2002, and extended on several occasions. The most recent extension was signed into law on December 20, 2019, and is scheduled to expire on December 31, 2027. TRIA provides a temporary federal backstop for losses related to the writing of the terrorism peril in property casualty insurance policies. Under regulations promulgated under this statute, insurers are required to offer terrorism coverage for certain lines of property casualty insurance, including property, commercial multi-peril, fire, ocean marine, inland marine, liability, aircraft and workers’ compensation. In the event of a terrorism event defined by TRIA, the federal government would reimburse terrorism claim payments subject to the insurer’s deductible. The deductible is calculated as \nCincinnati Financial Corporation - 2024 10-K - Page 106\nTable of Contents\na percentage of subject written premiums for the preceding calendar year. Our deductible in 2024 was $763 million (20% of 2023 subject premiums), and we estimate it is $815 million (20% of 2024 subject premiums) for 2025.\n \nReinsurance protection for the company’s surety business is covered under a separate treaty with many of the same reinsurers that write the property casualty working treaties. \nReinsurance protection for cyber coverage is also through a separate treaty. We offer cyber insurance as an affirmative coverage option on various insurance policies written on a direct basis and subsequently cede all of the related cyber insurance premiums to a reinsurer, therefore transferring substantially all of that risk. \nEffective in March 2024, we added a quota share reinsurance arrangement for personal lines earthquake risks in California that we insure through excess and surplus lines policies. We cede all of the related premiums to a reinsurer, therefore transferring substantially all of that risk. Ceded premiums for this treaty in 2024 totaled $1 million.\nEffective June 1, 2024, we restructured our reinsurance program for Cincinnati Re only, providing retrocession coverages with various triggers, exclusions and unique features. That program included property catastrophe excess of loss coverage with a total available aggregate limit of $60 million in excess of $80 million per occurrence. Coverage for Cincinnati Re only with a total available aggregate limit of $20 million in excess of $80 million per occurrence expired during the second quarter of 2024. That expiration also included the shared coverage for Cincinnati Re and the direct business applying to catastrophe losses in excess of $600 million. \nReinsurance protection for Cincinnati Global's business is also provided through separate treaties. \n \nThe Cincinnati Specialty Underwriters Insurance Company has separate property and casualty reinsurance treaties for 2025 through its parent, The Cincinnati Insurance Company. Primary components of the treaties include:\n•\nProperty per risk treaty – The property treaty provides limits up to $6 million, which is adequate capacity for the risk profile we insure. It also includes protection for extra-contractual liability coverage losses. Cincinnati Specialty Underwriters retains the first $2 million of any policy loss. Losses between $2 million and $6 million are reinsured at 100% by The Cincinnati Insurance Company.\n•\nCasualty treaties – The casualty treaty is written on an excess of loss basis and provides limits up to $6 million, which is adequate capacity for the risk profile we insure. A second treaty layer of $5 million excess of $6 million is written to provide coverage for extra contractual obligations or clash exposures. The maximum retention for any one casualty loss is $2 million by Cincinnati Specialty Underwriters. Losses on a per occurrence basis between $2 million and $6 million and extra contractual and clash losses between $6 million and $11 million are reinsured at 100% by The Cincinnati Insurance Company.\n•\nBasket retention – Cincinnati Specialty Underwriters has purchased this coverage to limit their retention to $2 million in the event that the same occurrence results in both a property and a casualty loss.\n•\nProperty catastrophe treaty – As a subsidiary of The Cincinnati Insurance Company, Cincinnati Specialty Underwriters is a named insured under our corporate property catastrophe treaty. All terms and conditions of this reinsurance coverage apply to policies underwritten by Cincinnati Specialty Underwriters.\nFor property risks with limits exceeding $6 million or casualty risks with limits exceeding $6 million, underwriters place facultative reinsurance coverage on an individual certificate basis.\nCincinnati Life, our life insurance subsidiary, purchases reinsurance under separate treaties with many of the same reinsurers that write the property casualty working treaties. Our corporate retention is $1 million on a single life. For our core term life insurance line of business, effective November 1, 2015, we increased our retention to $1 million for issue ages up to 61 years on new term life insurance sales, ceding the balance using excess over retention mortality coverage, and retaining the policy reserve. For issue ages 61 years or older, our retention is $500,000. Prior to November 1, 2015, and after 2004, we retain $500,000 per life. For term life insurance business written prior to 2005, we retain 10% to 25% of each term policy, not to exceed $500,000, ceding the balance of mortality risk and policy reserve.\nWe did not renew the catastrophe reinsurance coverage on our life insurance operations that reimbursed us for covered net losses in excess of $14 million. No similar treaty replaced this expiring coverage.\n \nCincinnati Financial Corporation - 2024 10-K - Page 107\nTable of Contents\nThe following table shows our five largest life reinsurance receivable amounts by reinsurer at year-end 2024 and 2023. Insurer financial strength ratings are also shown.\n(Dollars in millions)\n2024\n2023\nName of reinsurer\nTotal\nreceivable\nRating agency\nRating\nTotal\nreceivable\nRating Agency\nRating\nSwiss Re Life & Health America, Inc.\n$\n58\n \nA.M. Best\nA+\n$\n61 \nA.M. Best\nA+\nGeneral Re Life Corporation\n49\n \nA.M. Best\nA++\n50 \nA.M. Best\nA++\nLincoln National Life Insurance Company\n25\n \nA.M. Best\nA\n28 \nA.M. Best\nA\nEmployers Reassurance Corporation\n13\n \nS&P\nBBB+\n15 \nS&P\nBBB+\nHannover Life Reassurance Co. of America\n12\n \nA.M. Best\nA\n11 \nA.M. Best\nA+\nCincinnati Financial Corporation - 2024 10-K - Page 108\nTable of Contents\nSafe Harbor Statement\nThis is our “Safe Harbor” statement under the Private Securities Litigation Reform Act of 1995. Our business is subject to certain risks and uncertainties that may cause actual results to differ materially from those suggested by the forward-looking statements in this report. Some of those risks and uncertainties are discussed in"
}