{
  "ticker": "CL",
  "cik": "0000021665",
  "company_name": "COLGATE PALMOLIVE CO",
  "filing_date": "2025-02-13",
  "accession": "0000021665-25-000008",
  "primary_doc": "cl-20241231.htm",
  "item1_text": "Item 1 “Business.”\nWe also have been and may continue to be negatively affected by changes in the policies or practices of our retail trade customers, such as inventory destocking, fulfillment requirements, technology-aided category pricing pressures, limitations on access to shelf space, delisting of our products, or sustainability, supply chain or packaging standards or initiatives. For example, a determination by a key retailer that any of our ingredients should not be used in certain consumer products or that our packaging does not comply with certain requirements and standards could adversely impact our business, results of operations, cash flows and financial condition. In addition, “private label” products sold by our retail customers, which are typically sold at lower prices than branded products, are a source of competition for certain of our products. \nFurther, the retail landscape in many of our markets continues to evolve as a result of the substantial growth of eCommerce, changing consumer behaviors and preferences (as consumers increasingly shop online, including to compare prices and product availability) and the increased presence of alternative retail channels, such as subscription services and direct-to-customer businesses. The substantial growth in eCommerce and the emergence of alternative retail channels have created and may continue to create pricing pressures and/or adversely affect our relationships with our key retailers. \nIn addition, consumer preferences continue to evolve due to a number of factors, including evolving consumer concerns or perceptions (whether or not valid) regarding sustainability and social impact practices, including the sourcing and sustainability of raw and packaging materials, a demand for natural or organic products and ingredients and ingredient transparency, consumer concerns or perceptions regarding the effects of ingredients, consumer sentiment toward non-local products or sources and perceptions of and increased focus on labor and human rights and environmental impacts (including responsible sourcing, deforestation, packaging, plastic, energy and water use and waste management).\nIf we are not successful in continuing to adapt or to effectively react to changes in consumer behaviors, preferences or purchasing patterns and/or changing market dynamics, including customer policies or the proliferation of eCommerce and alternative retail channels, our business, results of operations, cash flows and financial condition could be adversely affected. \nThe growth of our business depends on the successful identification, development and launch of innovative new products.\nOur growth depends on the continued success of existing products, the successful identification, development and launch of innovative new and differentiated products and the expansion into adjacent categories, channels of distribution or geographies. Our ability to launch new products, to sustain existing products and to expand into adjacent categories, channels of distribution or geographies is affected by whether we can successfully:\n•\nidentify, develop and fund technological innovations;\n9\n•\nobtain and maintain necessary intellectual property protection and avoid infringing intellectual property rights of others;\n•\nobtain approvals and registrations of regulated products, including from the FDA and other regulatory bodies in the U.S. and abroad; and\n•\nanticipate and quickly respond to the needs and preferences of consumers and customers.\nThe identification, development and introduction of innovative new products that drive incremental sales involves considerable costs and effort, and any new product may not generate sufficient customer and consumer interest and sales to become a profitable product or to cover the costs of its development and promotion. Our ability to achieve a successful launch of a new product could also be adversely affected by preemptive actions taken by competitors in response to the launch, such as increased promotional activities and advertising. In addition, new products may not be accepted quickly or significantly in the marketplace.\nOur ability to quickly innovate to adapt and market our products and to adapt our packaging or the sustainability profile of our products to meet evolving consumer preferences and/or regulatory requirements is an essential part of our business strategy. The failure to develop and launch successful new products or to adapt our packaging, the sustainability profile of our products or supply chain to meet such preferences could hinder the growth of our business and any delay in the development or launch of a new product could result in us not being the first to market, which could compromise our competitive position and adversely affect our business, results of operations, cash flows and financial condition. In addition, our success in launching new products is also dependent on our ability to deliver effective and efficient marketing in an evolving media landscape (including digital), which is subject to dynamic and increasingly restrictive privacy requirements and emerging regulations. Our ability to launch new products, including our ability to deliver effective and efficient marketing campaigns, is also impacted by our ability to successfully adopt new technologies, such as artificial intelligence, including machine learning and generative artificial intelligence.\nIf, in the course of identifying or developing new products, we are found to have infringed the trademark, trade secret, copyright, patent or other intellectual property rights of others, directly or indirectly, through the use of third-party ideas or technologies, such a finding could adversely affect our ability to develop innovative new products and adversely affect our business, results of operations, cash flows and financial condition. Even if we are not found to infringe a third party’s intellectual property rights, claims of infringement could adversely affect us, including by increasing costs and by delaying the launch of new products.\nDamage to our reputation could have an adverse effect on our business.\nMaintaining our strong reputation with consumers and our trade partners globally is critical to selling our branded products. Accordingly, we devote significant time and resources to programs designed to protect and preserve our reputation, such as our ethics and compliance, sustainability and social impact, brand protection and product safety, regulatory and quality initiatives and our enterprise risk management program. Negative publicity about us, our brands, our products, our supply chain, our ingredients, our packaging, our sustainability and social impact practices, or our employees, whether or not deserved, could jeopardize our reputation. Such negative publicity could relate to, among other things, health or quality concerns, threatened or pending litigation or regulatory proceedings, animal welfare, labor and human rights and environmental impact (including responsible sourcing, deforestation, packaging, plastic, energy and water use and waste management) or our sustainability and social impact practices. In addition, the proliferation of digital and social media has greatly increased the accessibility of information, the speed of its dissemination and the potential for negative publicity and misinformation. Negative publicity, posts or comments on digital and social media, whether true or untrue, could damage our brands and our reputation. The success of our brands could also suffer if our marketing initiatives do not have the desired impact on a brand’s image or its ability to attract consumers.\nIn addition, the legal, regulatory and ethics landscape around the use of artificial intelligence, including machine learning and generative artificial intelligence, is rapidly evolving. Our ability to adapt and use this emerging technology in an effective and ethical manner may impact our reputation and our ability to compete, as outputs from generative artificial intelligence models could be, among other things, false, biased or inconsistent with our values or strategies. Further, the use of generative artificial intelligence tools may compromise our confidential or sensitive information or put our intellectual property at risk or subject us to claims of intellectual property infringement, which could in turn damage our reputation.\n10\nAdditionally, due to the scale and scope of our business, we must rely on relationships with third parties, including our suppliers, distributors, contractors, joint venture partners and other external business partners, for certain functions. While we have policies and procedures for managing these relationships, they inherently involve a lesser degree of control over business operations, compliance and sustainability and social impact practices, thereby potentially increasing our reputational and legal risk.\nWe have taken and in the future may take certain actions to safeguard our reputation and uphold our ethical values, such as changes to how and where we sell, advertise and invest behind our products and operations, which could adversely affect our business, results of operations, cash flows and financial condition.\nIn addition, third parties sell counterfeit versions of our products, which are inferior or may pose safety risks. As a result, consumers of our brands could confuse our products with these counterfeit products, which could cause them to refrain from purchasing our brands in the future and in turn could impair our brand equity and adversely affect our business, results of operations, cash flows and financial condition.\nDamage to our reputation or loss of consumer confidence in our products for these or any other reasons could adversely affect our business, results of operations, cash flows and financial condition, as well as require resources to rebuild our reputation.\nWe face various risks related to pandemics, epidemics or other widespread public health concerns, which may have a material adverse effect on our business, results of operations, cash flows and financial condition.\nWe face various risks related to pandemics, epidemics or other widespread public health concerns. A pandemic, epidemic or other widespread health concern could have, and COVID-19 has had a variety of impacts on our business, results of operations, cash flows and financial condition, including:\n•\nour ability to continue to maintain and support the health, safety and well-being of our employees, including key employees;\n•\ndisruptions to our global supply chain, including transportation and logistics challenges;\n•\na decrease in our workforce or in the efficiency of such workforce;\n•\nvolatility in the demand for and availability of our products;\n•\nchanges in purchasing patterns of our consumers;\n•\nsignificant volatility in demand for certain of our products, which may require us to increase our production capacity or acquire additional capacity at an additional cost and expense;\n•\nfailure of third parties on which we rely to meet their obligations to us, or significant disruptions in their ability to do so, which may be caused by their own financial or operational difficulties;\n•\nsignificant changes in the economic and political conditions of the markets in which we operate;\n•\ndisruptions and volatility in the global capital markets, including rising interest rates, which may increase the cost of capital and adversely impact our access to capital; and/or\n•\nvolatility in foreign exchange rates and increases in the cost and availability of raw and packaging materials and transportation and logistics costs.\n11\nOur success depends upon our ability to recruit, attract and retain key employees and the succession of senior management.\nOur success largely depends on the performance of our management team and other key employees. If we are unable to recruit, attract and retain talented, highly qualified senior management and other key people, our business, results of operations, cash flows and financial condition could be adversely affected. Successfully executing organizational change, including management transitions at leadership levels of the Company and succession plans for senior management, is critical to our business success. While we follow a disciplined, ongoing succession planning process and have succession plans in place for senior management and other key executives, these do not guarantee that the services of qualified senior executives will continue to be available to us at particular moments in time. Further, changes in immigration laws and government policies have made, in certain circumstances, and may continue to make it more difficult for us to recruit or relocate highly skilled technical, professional and management personnel to meet our business needs. Our ability to attract and retain talent has been and may continue to be impacted by a number of factors, including challenges in the labor market. We continue to embed new ways of working to, among other things, instill a growth mindset to drive innovation. If we do not (or are perceived not to) successfully implement these initiatives, our ability to recruit, attract and retain talent may be adversely impacted.\nWe have pursued and may continue to pursue acquisitions and divestitures, which could adversely impact our business.\nWe have pursued and may continue to pursue acquisitions of brands, businesses, assets or technologies from third parties. Acquisitions and their pursuit have involved, and can involve, numerous potential risks, including, among other things:\n•\nrealizing the full extent of the expected benefits or synergies as a result of a transaction, within the anticipated time frame, or at all;\n•\nsuccessfully integrating the operations, technologies, services, products and systems of the acquired brands, assets or businesses in an effective, timely and cost-efficient manner;\n•\nreceiving necessary consents, clearances and approvals in connection with a transaction;\n•\ndiverting management’s attention from other business priorities;\n•\nsuccessfully operating in new lines of business, channels of distribution or markets;\n•\nachieving distribution expansion related to products, categories and markets;\n•\nretaining key employees, partners, suppliers and customers of the acquired business;\n•\nconforming standards, controls, procedures and policies of the acquired business with our own;\n•\ndeveloping or launching products with acquired technologies; and\n•\nother unanticipated problems or liabilities.\nMoreover, acquisitions have resulted in and could in the future result in substantial additional debt, the assumption of\n \ncontingent liabilities, such as litigation or earn-out obligations, or transaction costs. In addition, to the extent that the economic benefits associated with an acquisition or investment diminish in the future or the performance of an acquired company or business is less robust than expected, we may be required to record additional impairments of intangible assets, including trademarks and goodwill. Any of these risks could adversely impact our reputation and our business, results of operations, cash flows and financial condition.\nWe have divested and may in the future periodically divest brands or businesses. These divestitures may adversely impact our business, results of operations, cash flows and financial condition if we are unable to offset the dilutive impacts from the loss of revenue associated with the divested brands or businesses, or otherwise achieve the anticipated benefits or \n12\ncost savings from the divestitures. In addition, businesses under consideration for, or otherwise subject to, divestiture may be adversely impacted prior to the divestiture, which could negatively impact our business, results of operations, cash flows and financial condition. If any planned divestiture is not able to be completed, we may also incur negative business and financial results.\nOperational Risks\nOur business results are impacted by our ability to manage disruptions in our global supply chain and/or key office facilities.\nWe are engaged in the manufacture and sourcing of products and materials on a global scale. Our operations and those of our suppliers, contract manufacturers or logistics providers have been and may continue to be disrupted by a number of factors, including, but not limited to:\n•\ngeopolitical events, wars and military conflicts, such as the war in Ukraine and the conflict in Middle East;\n•\nwidespread health emergencies, such as pandemics or epidemics;\n•\nstrikes and other labor disputes;\n•\ndisruptions in logistics;\n•\nloss or impairment of key manufacturing or distribution sites;\n•\nloss of key suppliers or contract manufacturers;\n•\ncapacity constraints;\n•\nraw material and product availability and/or quality or safety issues;\n•\nindustrial accidents or other occupational health and safety issues;\n•\nthe impact on our suppliers of tighter credit or capital markets;\n•\nthe lack of availability of qualified personnel, such as truck drivers and production labor;\n•\ngovernmental incentives, regulations and controls (including import and export restrictions, such as new or increased tariffs, sanctions, quotas or trade barriers); and\n•\nnatural disasters, including climatic events (including any potential effects of climate change) and earthquakes, tornadoes, acts of war or terrorism, political unrest or uncertainty, fires or explosions, cybersecurity incidents and other external factors over which we have no control.\nIn addition, we purchase certain key raw and packaging materials from single-source suppliers or a limited number of suppliers and new suppliers may have to be qualified under industry, governmental and/or Colgate standards, which can require additional investment and take a significant period of time. If our existing or new suppliers fail to meet such standards or if we are unable to contract with suppliers on favorable terms, our business, results of operations, cash flows and financial condition could be adversely affected.\nWe believe that the supplies of raw and packaging materials needed to manufacture our products are adequate. In addition, we have business continuity and contingency plans in place for key manufacturing sites and contract manufacturers and the supply of raw and packaging materials. Nonetheless, a significant disruption to the manufacturing or sourcing of products or materials for any reason, including those mentioned above, have at times interrupted and could in the future interrupt product supply and, if not remedied, could have an adverse impact on our business, results of operations, cash flows and financial condition.\n13\nIn addition, as a result of our global shared service organizational model, certain of our functions, such as finance and accounting, customer service and logistics, human resources, global information technology and data analytics are concentrated in key office facilities. A significant disruption to any of our key office facilities for any reason, including those mentioned above, could adversely affect our business, results of operations, cash flows and financial condition.\nVolatility in material and other costs has in the past and may continue to adversely impact our profitability.\nRaw and packaging material commodities, such as resins, essential oils, tropical oils, pulp, tallow, corn, poultry and soybeans, are subject to market price variations. Increases in the costs of and/or a reduction in the availability of commodities, energy (including fuel prices), logistics (including trucks and containers) or other necessary services, including as a result of geopolitical conflicts, such as the war in Ukraine and the conflict in the Middle East, and/or the impact of climatic events have affected and are likely to continue to adversely affect our profit margins. While the prices of many commodities and services have retreated from their historical peaks, prices may increase again, which could create year-over-year inflationary pressure. We have taken and may continue to take actions to mitigate these cost increases in the form of price increases and efforts to achieve cost efficiencies in areas such as manufacturing and distribution, or otherwise manage the exposure through sourcing strategies, ongoing productivity initiatives and the limited use of commodity hedging contracts. These actions may not, however, fully offset these higher costs and our business, results of operations, cash flows and financial condition have been and may continue to be adversely impacted. In addition, even if we are able to increase the prices of our products in response to commodity and other cost increases, we may not be able to sustain the price increases. If such price increases are sustained, they may negatively impact our sales volume, which can in turn negatively impact our margins and profitability. If competitors do not adjust their prices or if consumers decide not to pay higher prices and forego purchasing certain of our products or switch to “private label” or lower-priced product offerings, sales declines, a deterioration in our profitability and loss of market share may occur which could adversely affect our business, results of operations, cash flows and financial condition. See “Our business results are impacted by our ability to manage disruptions in our global supply chain and/or key office facilities” above for additional information.\nThere is no guarantee that our ongoing efforts to reduce costs will be successful.\nOne way that we generate funds needed to support the growth of our business is through our continuous, Company-wide initiatives to lower costs and increase effective asset utilization, which we refer to as our funding-the-growth initiatives. These initiatives are designed to reduce costs associated with direct materials, indirect expenses, distribution and logistics, and advertising and promotional materials, among other things. The achievement of our funding-the-growth goals depends on our ability to successfully identify and realize additional savings opportunities. Events and circumstances, such as financial or strategic difficulties, delays and unexpected costs may occur that could result in our not realizing any or all of the anticipated benefits or our not realizing the anticipated benefits on our expected timetable. If we are unable to realize the anticipated savings of our funding-the-growth initiatives, our ability to fund other initiatives and achieve our profitability goals may be adversely affected. Any failure to implement our funding-the-growth initiatives in accordance with our expectations could adversely affect our business, results of operations, cash flows and financial condition. For additional information regarding our funding-the-growth initiatives, refer to Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Executive Overview.”\nA cybersecurity incident, data breach or a failure of key technology systems could adversely impact our business.\nWe rely extensively on information and operational technology systems (“IT/OT Systems”), some of which are managed, hosted, provided and/or used by third parties, including cloud-based service providers, and their vendors, in order to conduct our business. Our uses of these systems include, but are not limited to:\n•\ncommunicating within our company and with other parties, including our customers, suppliers and consumers;\n•\nordering and managing materials from suppliers;\n•\nconverting materials to finished products;\n•\nreceiving and processing orders from, shipping products to and invoicing our customers, suppliers and consumers;\n•\nmarketing products to consumers;\n14\n•\ncollecting, storing, transferring and/or processing customer, consumer, employee, vendor, investor and other stakeholder information and personal data, including, but not limited to, such data from residents of states, countries and regions with comprehensive data protection laws and regulations;\n•\nprocessing transactions, including but not limited to employee payroll, employee and retiree benefits and payments to customers, suppliers and vendors;\n•\nhosting, processing and sharing confidential and proprietary research, intellectual property, business plans and financial information;\n•\nsummarizing and reporting results of operations, including financial reporting;\n•\nmanaging our banking and other cash liquidity systems and platforms;\n•\ncomplying with legal, regulatory and tax requirements;\n•\nproviding data security; and\n•\nhandling other processes involved in managing our business.\nAlthough we have a broad array of information and operational security measures in place, our IT/OT Systems, including those of third-party service providers with whom we have contracted, have been, and will likely continue to be, subject to computer viruses or other malicious codes, unauthorized access attempts, phishing and other cyberattacks. Cyberattacks and other cyber incidents are occurring more frequently, are constantly evolving in nature, are becoming more sophisticated and are being made by different threat actors including groups, individuals and nation states with a wide range of expertise and motives. Such cyberattacks and cyber incidents can take many forms, including cyber extortion, social engineering, password theft or introduction of viruses or malware, such as ransomware. In addition, the techniques used in cyberattacks and cyber incidents continue to evolve and develop, including through the use of existing and emerging technologies, such as artificial intelligence.\nWe cannot guarantee that our security efforts will prevent breaches or breakdowns of our or our third-party service providers’ IT/OT Systems because the techniques used in these attacks change frequently and may be difficult to detect for periods of time. In addition, although we have policies and procedures in place to ensure that all personal information collected by us or our third-party service providers is securely maintained, data leakages due to human error or intentional or unintentional conduct have occurred and likely will occur again. Furthermore, we periodically upgrade our IT/OT Systems or adopt new technologies. If such an upgrade or new technology does not function as designed or does not go as planned or if an attacker identifies a vulnerability in our IT/OT Systems, then our exposure to a cyberattack or cyber incident may increase significantly.\nA cyberattack or cyber incident may adversely impact our business, including our ability to ship products to customers, issue invoices and process payments or order raw and packaging materials. Although we have seen no material impact on our business operations from the cybersecurity incidents we have experienced to date, if we suffer a significant loss or disclosure of confidential business or stakeholder information as a result of a breach of our IT/OT Systems, including those of third-party service providers with whom we have contracted, or otherwise, we may suffer reputational, competitive and/or business harm, incur significant costs and be subject to government investigations, litigation, fines and/or damages, which may adversely impact our business, results of operations, cash flows and financial condition. In addition, the rapid evolution and increased adoption of existing and emerging technologies, such as artificial intelligence, may intensify our cybersecurity risks. Further, while we currently maintain insurance coverage that, subject to its terms and conditions, is intended to address costs associated with certain aspects of cybersecurity incidents and IT/OT System failures, this insurance coverage may not, depending on the specific facts and circumstances surrounding an incident, cover all losses or all types of claims that arise from an incident, or the damage to our business, reputation or brands that may result from an incident. As the frequency and magnitude of cybersecurity incidents increase globally, we may be unable to obtain the insurance coverage that we think is appropriate or necessary to offset the risk.\nWhile we have disaster recovery and business continuity plans in place, if our IT/OT Systems are damaged, breached or cease to function properly for any reason, including the poor performance of, failure of or cyberattack on third-party \n15\nservice providers, catastrophic events, power outages, cybersecurity breaches, network outages, failed upgrades or other similar events and, if the disaster recovery and business continuity plans do not effectively resolve such issues on a timely basis, we may suffer interruptions in our ability to manage or conduct business as well as reputational harm, and may be subject to governmental investigations and litigation, any of which may adversely impact our business, results of operations, cash flows and financial condition.\nClimate change and other sustainability matters could have an adverse impact on our business and results of operations.\nClimate change resulting in the increased frequency and severity of natural disasters and other extreme weather conditions may adversely impact our business, results of operations, cash flows and financial condition. Specifically, the predicted physical effects of climate change may exacerbate challenges regarding the availability and quality of water and the cost, quality and availability of raw and packaging materials, pose physical risks to our facilities and those of our key suppliers, disrupt our global supply chain or impact demand for our products. In addition, the increased concern over climate change has resulted and is likely to continue to result in transition risks, including additional legal and regulatory requirements intended to, among other things, reduce or mitigate the effects of climate change and have related and may relate to, among other things, greenhouse gas emissions (e.g., carbon pricing), alternative energy policy and additional disclosure obligations, such as the Corporate Sustainability Reporting Directive, and extended producer responsibility obligations that relate to our product packaging. Such additional regulations may adversely affect our business, results of operations, cash flows and financial condition by increasing our compliance and manufacturing costs and/or negatively impacting our reputation if we are unable to, or are perceived (whether or not valid) not to, satisfy such requirements or expectations. Achieving our sustainability and social impact targets will require significant efforts from us and our stakeholders, such as our suppliers and other third parties. It will also require capital investment, additional expense (e.g., renewable energy costs) and the development of technology that may not currently exist. Failure to achieve our sustainability and social impact targets or the perception (whether or not valid) that we have failed to act responsibly with respect to such matters or to effectively respond to new or additional legal or regulatory requirements regarding climate change or other sustainability matters, could result in adverse publicity and increased litigation risk and adversely affect our business and reputation. There is also increased focus, including by governmental and non-governmental organizations, investors, customers, consumers, regulators, our employees and other stakeholders on these and other sustainability and social impact matters, including responsible sourcing, deforestation, animal welfare, labor, employment and human rights, the use of plastic, energy and water, the recyclability or recoverability of packaging, including single-use and other plastic packaging.  From many of these stakeholders, there is also a growing demand for natural or organic products and ingredient transparency, such as sources of palm oil and palm kernel oil, and an increased focus on reducing our impact on nature. Our reputation could be damaged if we do not (or are perceived not to) act responsibly with respect to sustainability matters, which could adversely affect our business, results of operations, cash flows and financial condition.\nOur reliance on third parties in many aspects of our business could have an adverse effect on our business and results of operations.\nWe use third parties including, but not limited to, suppliers, contract manufacturers, distributors, commercial banks and other external business partners, to support many aspects of our business including those that provide support across much of the lifespan of our products from the purchasing of ingredients up to and including the sale of our products to consumers. While we maintain robust policies and procedures to govern and manage our interactions with and requirements of these third parties, including building in redundancies and alternatives wherever possible, we inherently have a lesser degree of control over the business operations, governance and compliance of these unrelated entities. As a result, disruptions in these relationships or the failure of these third parties to meet their obligations to us could have an adverse effect on our reputation and our business, results of operations, cash flows and financial condition. \nLegal and Regulatory Risks\nOur business is subject to legal and regulatory risks in the U.S. and abroad.\nOur business is subject to extensive legal and regulatory requirements in the U.S. and abroad. Such legal and regulatory requirements apply to most aspects of our products, including their development, ingredients, formulation, manufacture, packaging, labeling, storage, transportation, distribution, export, import, advertising, sale and environmental impact. U.S. federal authorities, including the U.S. Food and Drug Administration (the “FDA”), the Federal Trade \n16\nCommission, the Consumer Product Safety Commission, the Occupational Safety and Health Administration and the\n \nEnvironmental Protection Agency, regulate different aspects of our business, along with parallel authorities at the state and local levels and comparable authorities overseas. In addition, our selling practices are regulated by competition law authorities in the U.S. and abroad.\nNew or more stringent legal or regulatory requirements, or more restrictive interpretations of existing requirements, could adversely impact our business, results of operations, cash flows and financial condition. For example, from time to time, various regulatory authorities around the world review the use of various ingredients and packaging content in consumer products. While we monitor and seek to mitigate the impact of any emerging information, a decision by a regulatory or governmental authority that any ingredient or packaging content in our products should be restricted or should otherwise be newly regulated could adversely impact our business and reputation, as could negative reactions by our consumers, trade customers or non-governmental organizations to our current or prior use of such ingredients or packaging. Additionally, an inability to develop new or reformulated products containing alternative ingredients, to obtain regulatory approval of such products or ingredients on a timely basis or to effectively market and sell such products could likewise adversely affect our business.\nBecause of our extensive international operations, we could be adversely affected by violations of worldwide anti-bribery laws, including those that prohibit companies and their intermediaries from making improper payments to government officials or other third parties for the purpose of obtaining or retaining business, such as the U.S. Foreign Corrupt Practices Act, and laws that prohibit commercial bribery. We are also subject to laws and sanctions imposed by the U.S. (including, without limitation, those imposed by OFAC) and/or by other jurisdictions that may prohibit us or certain of our affiliates from doing business in certain countries, or restrict the kind of business that may be conducted. While our policies mandate compliance with these laws, we cannot provide assurance that our internal control policies and procedures will always protect us from reckless or criminal acts committed by our employees, joint venture partners or agents. Violations of these laws, or allegations of such violations, could disrupt our business and adversely affect our reputation and our business, results of operations, cash flows and financial condition.\nWhile it is our policy and practice to comply with all legal and regulatory requirements applicable to our business, findings that we are in violation of, or out of compliance with, applicable laws or regulations have subjected us to, and could subject us to, civil remedies, including fines, damages, injunctions or product recalls, or criminal sanctions, any of which could adversely affect our business, results of operations, cash flows and financial condition. Even if a claim is unsuccessful, is without merit or is not fully pursued, the cost of responding to such a claim, including management time and out-of-pocket expenses, and the negative publicity surrounding such assertions regarding our products, processes or business practices could adversely affect our reputation, brand image and our business, results of operations, cash flows and financial condition. For information regarding our legal and regulatory matters, see Item 3 “Legal Proceedings” and Note 12, Commitments and Contingencies to the Consolidated Financial Statements.\nLegal claims and proceedings could adversely impact our business.\nAs a global company serving consumers in more than 200 countries and territories, we are and may continue to be subject to a wide variety of legal claims and proceedings, including disputes relating to intellectual property, contracts, product liability, marketing, advertising, foreign exchange controls, antitrust and trade regulation, as well as labor and employment, pension, data privacy and security, environmental and tax matters and consumer class actions. Regardless of their merit, these claims can require significant time and expense to investigate and defend. Since litigation is inherently uncertain, there is no guarantee that we will be successful in defending ourselves against such claims or proceedings, or that our assessment of the materiality of these matters, including any reserves taken in connection therewith, will be consistent with the ultimate outcome of such matters. In addition, if one of our products, or an ingredient contained in our products, is perceived or found to be defective, or unsafe or have a quality issue, we have had to and may in the future need to withdraw, recall or reformulate some of our products. Whether or not a legal claim or proceeding is successful, or a withdrawal, recall or reformulation is required or advisable, such assertions could have an adverse effect on our business, results of operations, cash flows and financial condition, and the negative publicity surrounding them could harm our reputation and brand image. The resolution of, or increase in the reserves taken in connection with, one or more of these matters in any reporting period could have a material adverse effect on our business, results of operations, cash flows and financial condition for that period. See Item 3 “Legal Proceedings” and Note 12, Commitments and Contingencies to the Consolidated Financial Statements for additional information on certain of our legal claims and proceedings.\n17\nFinancial and Economic Risks\nUncertain or unfavorable global economic conditions may adversely affect our business.\nUncertain or unfavorable global economic conditions could adversely affect our business. Unfavorable global economic conditions, such as a recession, an economic slowdown, inflation, higher interest rates and/or reduced category growth rates, including as a result of the war in Ukraine and the conflict in the Middle East, have negatively impacted and/or could negatively impact our business and result in declining revenues, profitability and/or cash flows. Although we continue to devote significant resources to support our brands and market our products at multiple price points, during periods of economic uncertainty or unfavorable economic conditions, consumers may have less consumer confidence, reduce consumption or discretionary spending and/or change their purchasing patterns by foregoing purchasing certain of our products or by switching to “private label,” or lower-priced product offerings. These changes could reduce demand for our products or result in a shift in our product mix, as consumers may choose products that sell at lower prices. Additionally, our retailers may be impacted and they may increase pressure on our selling prices or increase promotional activity for lower-priced or value offerings as they seek to maintain sales volumes and margins. Furthermore, economic conditions can cause our customers, suppliers, distributors, contract manufacturers, logistics providers or other third-party partners to suffer financial or operational difficulties, which may impact their ability to buy our products or provide us with or distribute finished product, raw and packaging materials and/or services in a timely manner or at all. In addition, we could face difficulty collecting or recovering accounts receivables from third parties facing financial or operational difficulties, including bankruptcies.\nDisruptions in the credit markets or changes to our credit ratings may adversely affect our business.\nWhile we currently generate significant cash flows from ongoing operations and have access to global credit markets through our various financing activities, a disruption or volatility in the credit markets, interest rate increases or changes to our credit rating could negatively impact the availability or further increase the cost of funding. Reduced access to credit or increased costs could adversely affect our liquidity and capital resources or significantly increase our cost of capital. In addition, if any financial institutions that hold our cash or other investments or that are parties to our undrawn revolving credit facility supporting our commercial paper programs or other financing arrangements, such as interest rate, foreign exchange or commodity hedging instruments, were to declare bankruptcy or become insolvent, they may be unable to perform under their agreements with us. This could leave us with reduced borrowing capacity or unhedged against certain interest rate, foreign currency or commodity price exposures. In addition, tighter or more volatile credit markets may lead to business disruptions for certain of our suppliers, contract manufacturers or trade customers which could, in turn, adversely impact our business, results of operations, cash flows and financial condition.\nTax matters, including changes in tax rates, disagreements with taxing authorities and imposition of new taxes could negatively impact our business.\nWe are subject to taxes in the U.S. and in the foreign jurisdictions where we do business. Due to economic and political conditions, tax rates in the U.S. and various foreign jurisdictions have been and may be subject to significant change. Changes in the mix of our earnings between countries with differing statutory tax rates, changes in the valuation of deferred tax assets and liabilities related to changes in tax rates, changes in tax laws, including how existing tax laws are interpreted or enforced, or contemplated changes in long-standing tax principles, if finalized and adopted, could adversely impact our future effective tax rate and business, results of operations, cash flows and financial condition. For example, long-standing international tax norms that determine each country’s jurisdiction to tax cross-border international trade are evolving as a result of a multilateral project, the Base Erosion and Profit Shifting Project (the “BEPS Project”), that has established new principles and reporting requirements recommended by the member countries of the Organization for Economic Cooperation and Development (the “OECD”). In connection with the BEPS Project, companies are required to disclose more information to tax authorities and the public on operations around the world, which may lead to greater audit scrutiny of profits earned in countries outside of the U.S. Many jurisdictions have already enacted legislation and adopted policies resulting from the BEPS Project. The OECD is also addressing the challenges of the digitization of the global economy with plans to redefine jurisdictional taxation rights in market countries and establish a global minimum tax. The European Union has established the Minimum Tax Directive (“Pillar II”) that provides for a minimum level of taxation for certain large corporations in every jurisdiction in which they operate. In addition, many other jurisdictions outside of the European Union have also implemented a similar minimum tax regime consistent with the policy of Pillar II. Detailed \n18\nregulations of these minimum tax regimes are still being considered in certain countries. Other than significant additional time and resources to comply, based on our preliminary evaluation, Pillar II did not have a material impact as of December 31, 2024 and we do not believe it will have a material impact on our business, results of operations, cash flows and financial condition.  However, as these and other tax laws and related regulations change, our business, results of operations, cash flows and financial condition could be materially impacted. For more information regarding recent legislation, refer to Part II, Item 7 “Management's Discussion and Analysis of Financial Condition and Results of Operations - Results of Operations - Income Taxes.”\nFurthermore, we are seeing an increase in regular reviews, examinations and audits by the Internal Revenue Service and increasingly aggressive enforcement actions by other taxing authorities with respect to taxes outside of the U.S. Although we believe our tax positions are sustainable, when a taxing authority disagrees with the positions we have taken, we have faced and in the future may face additional tax liabilities, including interest and penalties, in excess of reserves. The payment of such additional amounts upon final adjudication of any disputes could adversely impact our business, results of operations, cash flows and financial condition.\n19\nITEM 1B.    UNRESOLVED STAFF COMMENTS\nNone.\n20\nITEM 1C.    CYBERSECURITY\nManagement’s Role in Assessing and Managing Cybersecurity Risk; Processes for assessing, identifying and managing material risks from cybersecurity threats\nWe have a systematic and thorough risk management process, which is designed to identify, assess, prioritize and mitigate the risks that could negatively impact achievement of our strategic and operating objectives. A key component of this process is our Enterprise Risk Management (“ERM”) Committee, which is led by our Chairman, President and Chief Executive Officer, and includes our Chief Financial Officer, Chief Legal Officer, Chief Information Officer and other members of senior management.\n The ERM Committee monitors both current and emerging risks facing the Company and meets at least quarterly to review the prioritization of identified risks. The ERM Committee has identified cybersecurity as a critical risk facing the Company. Each of the most critical risks identified is assigned to a member of senior management who oversees the management, mitigation and presentation of the risk to the senior leadership team and throughout the year to our Board of Directors. The risks relating to information technology, including cybersecurity, are overseen by our Chief Information Officer. Our Chief Information Officer then assigns the risks within the Information Technology risk category to others on his team. The cybersecurity risk is managed and overseen by our Chief Information Security Officer (“CISO”), who reports to our Chief Information Officer. Cybersecurity as a risk is presented to the full ERM Committee annually or more frequently as needed. \nWe have a dedicated information security organization, led by our \nCISO\n and overseen by our Chief Information Officer, which is responsible for assessing and managing material risks from cybersecurity threats.\n Our Chief Information Officer reports to our Group President, Growth and Strategy, a member of our senior leadership team who reports to our Chairman of the Board, President and Chief Executive Officer.\nOur CISO has over 25 years of information technology experience, including leading data analytics, customer relationship management, architecture and application development teams. He has been leading our global information security program for almost seven years. He is a Certified Information Systems Professional, a member of Google Cloud CISO Customer Advisory Board and New Jersey Infragard and completed the FBI CISO Academy. He joined the Company over 25 years ago and has extensive knowledge regarding our business processes and the associated information technology platforms utilized worldwide, enabling him to guide his organization to protect the Company’s systems and information.  \nOur Chief Information Officer joined the Company over 25 years ago and has expertise across a wide array of information technology and systems, with experience leading a large array of different functions within the global information technology organization. He has led our information technology Operational Performance and Reliability Committee for the last nine years, which reviews and provides continuous improvement processes and technology across infrastructure, information security, architecture, application and end user performance. He has application development leadership experience across all functions, including the policies and controls that govern both application development and implementation of packaged software. He has a certification from Stanford University for Cybersecurity and Executive Strategy.\nThe Company’s information security organization seeks to employ cybersecurity best practices, including implementing new technologies to proactively identify and monitor new vulnerabilities and reduce risk, conducting due diligence of third-party vendors’ information security programs, maintaining security policies and standards and regularly updating and testing our response planning and protocols. The information security organization also works in partnership with our Internal Audit function to identify cybersecurity risks and review cybersecurity-related internal controls with third parties as part of the overall internal controls process. The information security organization also gains valuable information to improve our threat and risk awareness capabilities as a member of an industry information sharing and analysis organization, which provides strategic and tactical information sharing channels. Additionally, employees are provided mandatory cybersecurity awareness training on an annual basis, which includes information about how to identify and report cybersecurity concerns and incidents. The information security organization also conducts phishing simulations and testing scenarios through tabletop exercises and assessment activities, to help ensure compliance with our cyber policies and procedures. We maintain a cybersecurity insurance policy and have retained relevant incident response services. \nAdditionally, we maintain an offensive security team that \n21\nworks both independently and with third party cybersecurity professionals to conduct security assessments of our enterprise-wide cybersecurity practices, including penetration testing, and identify areas for continuous improvement within the information security program. The Company is a member of the Retail and Hospitality Information Sharing and Analysis Center, which provides additional intelligence associated with threats pertaining to our industry.\nWe maintain a Data Security Incident Response Plan (the “Plan”), which outlines the processes and procedures that we should follow to respond to, remediate and resolve a security incident involving a potential or actual compromise of our proprietary information and/or personal information. It also describes the structure, roles and responsibilities of personnel involved in responding to such incidents and provides a process for alerting senior management of such incidents. The Plan is reviewed on an annual basis and revised as necessary.\n \nOur dedicated information security organization leverages various frameworks for managing cybersecurity risks, including the National Institute of Standards and Technology (“NIST”) framework. The key pillars of the NIST framework are to (i) develop an organizational understanding to manage cybersecurity risk to systems, people, assets, data and capabilities; (ii) develop and implement appropriate safeguards to ensure delivery of critical services; (iii) develop and implement appropriate activities to identify the occurrence of a cybersecurity event; (iv) develop and implement appropriate activities to maintain plans for resilience and to restore any capabilities or services that were impaired due to a cybersecurity incident; and (v) develop appropriate activities to action an incident.\nWe have a comprehensive third party cybersecurity risk review process, which prioritizes, monitors and assesses the risks associated with our third party service provider interactions. The third party service provider assessment framework follows industry standard practices and allows us to properly understand the risk associated with the services provided which are key to our company’s daily operations.\n \nFor additional information regarding risks faced by the Company from cybersecurity threats, see"
}