{
  "ticker": "CMCSA",
  "cik": "0001166691",
  "company_name": "COMCAST CORP",
  "filing_date": "2025-01-31",
  "accession": "0001166691-25-000011",
  "primary_doc": "cmcsa-20241231.htm",
  "item1_text": "Item 1: Business\nWe are a global media and technology company that reaches customers, viewers and guests worldwide through the connectivity and platforms services we provide and the content and experiences we create. We deliver broadband, wireless, video and voice services primarily under the Xfinity, Comcast Business, Sky and NOW brands; produce, distribute and stream leading entertainment, sports and news through brands including NBC, Telemundo, Universal, Peacock and Sky; and own and operate Universal theme parks.\nWe operate two primary businesses: \n•\nConnectivity & Platforms:\n Contains our broadband, wireless, video and wireline voice businesses in the United States, United Kingdom and Italy (collectively, the “Connectivity & Platforms markets”). Also includes the operations of our Sky-branded entertainment television networks in the United Kingdom and Italy. Our Connectivity & Platforms business is reported in two segments, Residential Connectivity & Platforms and Business Services Connectivity.\n•\nContent & Experiences:\n Contains our media and entertainment businesses that produce and distribute entertainment, sports, news and other content for global audiences and that own and operate theme parks and attractions in the United States and Asia. Our Content & Experiences business is reported in three segments, Media, Studios and Theme Parks.\nIn November 2024, we announced our intention to create a new independent publicly traded company (“SpinCo”) comprised primarily of a strong portfolio of domestic cable television networks currently within our Media segment, including USA Network, E!, Syfy, MSNBC, CNBC, Oxygen and the Golf Channel along with complementary digital assets including Fandango, Rotten Tomatoes, GolfNow and SportsEngine, through a tax-free spin-off (the “Spin-off”). We are targeting to complete the Spin-off by the end of 2025, subject to the satisfaction of customary conditions, including obtaining final approval from our Board of Directors, satisfactory completion of SpinCo financings, receipt of tax opinions and receipt of any regulatory approvals. There can be no assurance that a separation transaction will occur, or, if one does occur, of its terms or timing.\nFor additional information on our businesses and segments, refer to Item 7: Management’s Discussion and Analysis of Financial Condition and Results of Operations and Note 2 to the consolidated financial statements included in this Annual Report on Form 10-K.\nDescription of Our Businesses\nConnectivity & Platforms Business\nResidential Connectivity & Platforms Segment\nOur Residential Connectivity & Platforms segment primarily includes:\n•\nResidential broadband and wireless services (collectively, “Residential Connectivity”)\n•\nResidential and business video services, Sky-branded entertainment television networks and advertising\nWe offer services to customers individually and as bundled services at a discounted rate.\nResidential Connectivity \nBroadband\nWe offer broadband services in the United States over our hybrid fiber-optic and coaxial (“HFC”) network, as well as through direct fiber-to-the-premises connections for certain customers, and internationally in the United Kingdom and Italy by leveraging networks owned by third-party telecommunications providers. \nOur domestic broadband offerings have a range of service levels, including up to gigabit-plus downstream speeds that we offer across nearly our entire footprint. As part of our low-income broadband adoption program, we offer qualifying domestic customers broadband services at discounted rates through our Internet Essentials and Internet Essentials Plus services, with downstream speeds of up to 75 and 100 megabits per second, respectively. In 2024, we began offering prepaid domestic broadband services with downstream speeds of up to 200 megabits per second marketed under the NOW brand. We also offer monthly access to our network of Wi-Fi hotspots. \n1\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nWe continue to evolve and enhance our domestic network capabilities, including deploying technology in select markets that will enable us to deliver multigigabit symmetrical broadband speeds (i.e., comparable upstream and downstream speeds), as described in the Network and Technology discussion below.\nWe offer Xumo Stream Box (formerly Flex) devices to our domestic customers. The Xumo Stream Box provides access to and integration of streaming content and music from certain internet-based apps, including direct-to-consumer streaming services (“DTC streaming services”) such as Peacock, Disney+ and Netflix, and certain pay-per-view and video on demand programming that is available over the internet. We also offer certain bundled DTC streaming services to our broadband customers. We earn commission revenue from the sale of DTC streaming services when sold with our broadband services or through our video platforms, including X1 and Sky Q.\nThe map below highlights our domestic network footprint and the markets where we had 250,000 or more domestic residential broadband customers as of December 31, 2024.\nOur international broadband services primarily include fiber-to-the-cabinet offerings, and increasingly fiber-to-the-premises offerings. \nAs part of our domestic and international broadband services, we offer to customers our advanced, proprietary wireless gateways that combine an internet modem with a Wi-Fi router to deliver reliable internet speeds and enhanced coverage through an in-and-out-of-home Wi-Fi network. In addition, customers may personalize and manage their Wi-Fi network and connected devices with our mobile apps and online portal. Broadband customers have access to our expanding network of secure Wi-Fi hotspots.\nWireless\nWe offer wireless services for wireless handsets, tablets and smart watches (“wireless devices”) to residential customers in the United States and the United Kingdom using mobile virtual network operator (“MVNO”) rights. Our domestic wireless services are offered over Verizon’s wireless network and our existing network of secure residential, outdoor and business Wi-Fi hotspots, and are offered initially only as part of our bundled service offerings to customers that subscribe to our qualifying broadband services.\nWireless customers may activate multiple lines per account. We offer domestic customers services on an unlimited data plan, on shared data plans or per gigabyte of data used. In 2024, we began offering prepaid unlimited data plans marketed under the NOW brand. We offer international customers services on various gigabyte plans or an unlimited data plan. Customers may either bring their own device or purchase devices from us with the option to pay upfront or finance the purchase interest-free over 24 months for domestic customers and over 24 to 48 months for international customers. \nComcast 2024 Annual Report on Form 10-K\n2\nTable of Contents\nVideo\nWe offer video services to residential and business customers primarily through our X1 platform in the United States over our network, and through our Sky Q platform internationally in the United Kingdom and Italy using a combination of satellite transmission and broadband connections. X1 and Sky Q are cloud-based platforms that provide integrated search functionality leveraging set-top boxes and voice-activated remote controls. The integrated features operate across content in customers’ video service packages and content from internet-based streaming services that customers may access in a manner similar to our Xumo Stream Box. We offer a range of video packages from basic linear service to full linear service, which typically include free-to-air networks and a range of other linear television networks including premium, sports and news networks. Our international video packages also include Sky-branded entertainment television networks that offer entertainment, premium movie and free-to-air programming, as well as Sky Sports networks that are part of our Media segment. Customers may also subscribe to digital video recorder (“DVR”) services or access our video on demand services with programming that is available for no additional cost or to rent or buy digitally. These viewing options are also available through our mobile apps and online portals. \nWe also offer DTC streaming services marketed under the NOW brand, with an offering in the United States that launched in 2023. NOW services provide video content over the internet and do not require a set-top box. Our international NOW service offerings include packages for monthly access to entertainment, sports and movie programming, as well as daily pass options for sports programming. Our domestic NOW TV service is only offered to qualifying residential broadband customers and includes monthly access to a variety of linear television networks; entertainment and movie programming; integrated access to free streaming channels from Xumo Play, NBC and Sky; and access to the ad-supported tier of Peacock.\nWe also offer video services in the United Kingdom and Italy over a broadband connection without the need for a satellite dish. These services have an operating system similar to Sky Q and are offered to customers through Sky Stream, which leverages a streaming device and Wi-Fi, or to customers that purchase our Sky Glass smart televisions.\nAdvertising\nAs part of our distribution agreements with domestic cable networks, we generally receive an allocation of scheduled advertising time that our advertising business sells, and we also sell advertising on our Sky-branded entertainment television networks and on our digital platforms. We also enter into representation agreements under which we sell advertising on behalf of third parties both domestically and internationally. Additionally, we offer technology, tools, data-driven services and marketplace solutions to customers in the media industry to facilitate effective engagement of advertisers with their target audiences. \nOther\n \nWe offer residential wireline voice services primarily using interconnected Voice over Internet Protocol (“VoIP”) technology, and we offer residential security and automation services. We also license our technology platforms to other multichannel video providers and distribute certain of our Sky-branded entertainment television networks to third-party video service providers.\nBusiness Services Connectivity Segment\nOur Business Services Connectivity segment consists of our domestic service offerings for small businesses, which include broadband, wireline voice and wireless services, as well as our enterprise solutions offerings for medium-sized customers and larger enterprises. Certain business customers subscribe to our video services, and the associated revenue is included in our Residential Connectivity & Platforms segment. We also have certain business connectivity service offerings in the United Kingdom.\nOur domestic broadband offerings have a range of service levels, including fiber-based services that deliver symmetrical speeds ranging up to 100 gigabits per second. \nOur small business broadband, wireline voice and wireless service offerings are similar to those provided to our residential customers and also include cloud-based cybersecurity services, wireless backup connectivity, advanced Wi-Fi solutions, video monitoring services and other cl\noud-based services.\nOur enterprise solutions offerings also include ethernet network services, which connect multiple locations and provide higher downstream and upstream speed options, advanced voice services, and a software-defined networking product. Larger enterprises may also receive support services related to Wi-Fi networks, router management, network security, business continuity risks and other services. These services are primarily provided to Fortune 1000 companies and other large enterprises with multiple locations both within and outside of our distribution footprint, where we provide coverage outside of our service areas through agreements with other companies to use their networks. \n3\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nNetwork and Technology\nThe segments within our Connectivity & Platforms business use our HFC network in the United States, which we believe is sufficiently flexible and scalable to support our future technology requirements and enables us to continue to grow capacity and capabilities over time. \nThis network provides the two-way transmissions required to provide connectivity services and interactive video and entertainment services through our platforms, and consists primarily of headends, fiber-optic and coaxial cables owned or leased by us, and equipment such as lasers, routers, switches and content distribution servers. Across nearly our entire domestic footprint, we leverage DOCSIS 3.1 to offer up to gigabit-plus downstream broadband speeds to residential and business customers. We also deploy fiber-to-the-premises with symmetrical speed offerings ranging up to 10 gigabits per second to residential customers who request that service, subject to local construction constraints, and up to 100 gigabits per second to business customers. We offer domestic wireless services using an MVNO agreement that allows us to offer services using Verizon’s wireless network along with our existing network of Wi-Fi hotspots across our network.\nWe continue to evolve and enhance our domestic network capabilities. In connection with a multiyear network transformation plan, in 2022 we began rolling out downstream speeds of up to 2 gigabits per second to our residential customers, which are now available to approximately 50% of our HFC network footprint. In 2023, we began deploying in select markets DOCSIS 4.0, which enables us to deliver multigigabit symmetrical broadband speeds over our existing HFC network. Additionally, as part of our network evolution, our engineering teams have been virtualizing and automating many core network functions using various technologies to expand capacity, increase operating efficiency, and identify and fix network issues proactively before they affect our customers. Our investment in virtualizing the network helps maintain network reliability and operational efficiency regardless of whether we connect a residence using either fiber or our HFC network. We continue to extend our network’s reach to new homes and businesses within our existing service areas, as well as edging-out to new service areas to expand the number of homes and businesses passed, and a significant portion of new homes and businesses passed are connected with fiber. We also partner with local, state and federal agencies when possible to provide services to unserved and underserved communities leveraging governmental subsidies where available. \nThe components of our domestic network require periodic maintenance and replacement and are primarily located on owned and leased properties, and in locations under agreements with local public utilities and municipalities. We operate national and regional data centers with equipment that is used to provide our services, and we maintain network operations centers with equipment necessary to monitor and manage the status of our services and network.\nOur international services are offered leveraging third-party networks, as well as our own core fiber network for broadband and wireline voice services in the United Kingdom. The related operating plant and equipment used to provide our video and connectivity services include leased satellite system signal receiving, encoding and decoding devices, and owned and leased headends and distribution networks, including coaxial, fiber-optic cables and other related equipment. For a majority of international customers, our video platform is delivered via one-way digital satellite transmission that uses satellites leased from third parties for the distribution of television networks, augmented by a set-top box and two-way broadband connectivity. We offer broadband and wireline voice services in the United Kingdom and Italy using third-party networks. In many cases, the fee for us to access these networks is on regulated terms. The ranges of service levels and speeds we offer are dependent upon the capabilities and reach of these third-party networks. We offer wireless services in the United Kingdom using a combination of a third-party’s network and our own mobile core network.\nOur Connectivity & Platforms business engineering teams continue to focus on technology initiatives to develop and deploy next-generation media, content delivery, content aggregation and streaming platforms that support X1, Sky Q, NOW, Sky Stream, Sky Glass, Xumo and our cloud DVR technology. These platforms are based on our global technology platform and integrate linear television networks, owned and third-party DTC streaming services and other internet-based apps, and on demand programming into a unified experience with voice-activated remote control search and interactive features. We also continue to focus on leveraging our own cloud network services to deliver video and advanced search capabilities. Our Connectivity & Platforms business also pursues technology initiatives related to broadband and wireless services that leverage our global technology platform. We provide our customers with in-and-out-of-home Wi-Fi, the ability to manage their Wi-Fi network and connected home with our mobile apps and online portal, advanced security technology, and other features. \nProgramming\nTo offer video services, Residential Connectivity & Platforms licenses substantial amounts of linear television programming from third parties and from our Media segment. The fees associated with these distribution agreements are generally based on the number of subscribers receiving the television network programming and a per subscriber fee, although programming expenses for certain television networks are based on a fixed fee. Additionally, certain of our agreements include the rights to offer such programming through multiple delivery platforms, such as through our on demand services, online portal, mobile apps, the Xumo Stream Box, and our NOW and NOW TV streaming services.\nComcast 2024 Annual Report on Form 10-K\n4\nTable of Contents\nThe programming on our Sky-branded entertainment television networks includes content licensed from third parties and from our Studios segment, including certain original content. Our most significant agreements for the licensing of film and television entertainment content include exclusive rights with Paramount, Warner Bros. and our Studios segment.\nOther Sources of Supply and Operations\nWe purchase from a limited number of suppliers a significant amount of customer premise equipment, including wireless gateways and set-top boxes, network equipment, and services to provide our broadband and video services to residential and business customers. We also purchase from a limited number of suppliers a significant number of wireless devices. We use a limited number of vendors to provide customer billing for our residential and business customers.\nOur technical services groups perform various tasks, including installations, plant maintenance and upgrades to our domestic network, and servicing and upgrades of customer premise equipment. The service vehicles used by our technical services groups are primarily owned. Our customer service teams provide primarily 24/7 call-answering capability and other services, and also offer our services to residential and business customers.\nCompetition\nResidential Connectivity & Platforms\nBroadband\nWe compete with a number of companies, many with significant financial resources, that offer internet services, including:\n•\nwireline telecommunications companies \n•\nwireless telecommunications companies\n•\nmunicipal broadband networks and power companies\n•\nsatellite broadband providers\nCertain wireline telecommunications companies, such as AT&T, Frontier, Lumen and Verizon in the United States and BT and Virgin Media O2 in the United Kingdom, have built and are continuing to build fiber-based wireline network infrastructure further into their networks, which enables them to provide data transmission speeds that exceed those that can be provided with traditional copper digital subscriber line (“DSL”) technology, and are offering services with these higher speeds in many of our service areas. Certain companies that offer DSL service have increased data transmission speeds, lowered prices or created bundled services to compete with our broadband services. \nVarious wireless companies are offering internet services using a variety of technologies, including 5G fixed wireless networks and 4G and 5G wireless broadband services. These networks work with devices such as smartphones, laptops, tablets, and mobile and fixed wireless routers, as well as wireless data cards. \nOther companies and municipalities have launched fiber-based or newer satellite-based broadband technologies that provide services in certain areas in which we operate.\nDomestic broadband-deployment funding initiatives at the federal and state levels may result in other service providers deploying subsidized internet access within our footprint. The availability of these and other offerings could negatively impact the demand for our domestic broadband services.\nWireless\nWe compete with national and regional wireless service providers in the United States, including AT&T, T-Mobile and Verizon, and wireless service providers in the United Kingdom that offer wireless service on both a stand-alone basis and with other services as bundled offerings.\nVideo\nWe compete with a number of companies offering video services in the Connectivity & Platforms markets, including:\n•\nDTC streaming service providers and aggregators, including:\n◦\nsubscription-based services, such as Disney+ and Netflix, that offer online services that enable internet streaming and downloading of movies, television shows and other video programming\n◦\nvirtual multichannel video providers, such as Hulu + Live TV and YouTube TV, that offer streamed linear television networks\n◦\nfree ad-supported television services\n5\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\n◦\ncompanies that offer streaming devices that access and integrate streaming content\n•\ndirect broadcast satellite (“DBS”) providers that transmit satellite signals to substantially all households in the Connectivity & Platforms markets to provide video programming and other information similar to our video services \n•\ncompanies that have built and continue to build fiber-based networks that provide video services similar to ours and provide bundled offerings that include wireless and/or broadband services\n•\nother providers that build and operate communications systems and services in the same areas that we serve, including traditional providers of linear television programming\n•\na broad array of other online content providers, such as social networking platforms and user-generated content providers\n•\nother companies, such as broadcast television stations, that provide multiple free-to-air networks\nSimilar to the competitive environment in our Media segment, our Sky-branded entertainment television networks compete for the distribution of our television network programming to third-party video service providers and for viewers’ attention and audience share.\nAdvertising\nWe compete for the sale of advertising with digital properties\n, including an increasing number of ad-supported DTC streaming service providers and other online content providers, such as social networking platforms and user-generated content providers, as well as with t\nelevision networks and stations, \nand all other advertising platforms. Similar to the competitive environment in our Media segment, the willingness of advertisers to purchase advertising from us may be adversely affected by declines in audience ratings and television viewership, difficulty in measuring fragmented audiences and the increasing number of entertainment\n choices available. Our advertising is sold to local, regional and national advertisers, and competition is affected by the market conditions in the specific geographic locations in which we operate. We also compete with companies offering technology, tools and other services to customers in the media industry.\nBusiness Services Connectivity\nBusiness Services Connectivity primarily competes with wireline telecommunications companies and wide area network managed service providers. Competition for our connectivity services for small business customers is generally similar to the Residential Connectivity & Platforms segment. We compete for the sale of enterprise solutions offerings primarily with wide area network managed service providers, cloud-based application service providers and other telecommunication carriers.\nSeasonality and Cyclicality\nResults in our Residential Connectivity & Platforms segment are impacted by the seasonal nature of residential customers receiving our services, including in college and vacation markets in the United States, and by the timing of the European football seasons in our international markets, which generally result in negative impacts to net customer relationship additions/(losses) in the second quarter of each year.\nSimilar to seasonal and cyclical variations in our Media segment, advertising revenue is subject to cyclical patterns and changes in viewership levels, driven by timing of the winter holiday season, political campaigns, sports seasons and when programming is aired.\nContent & Experiences Business\nMedia Segment\nWe operate our Media segment as a combined television and streaming business, which primarily includes:\n•\nNBCUniversal’s national and regional cable networks\n•\nNBC and Telemundo broadcast networks and owned local broadcast television stations\n•\nPeacock DTC streaming service\n•\nInternational television networks, including Sky Sports networks in the United Kingdom and Italy\nWe distribute a wide variety of programming on our linear television networks and streaming services to appeal to consumers with varying preferences across demographics and geographic areas.\nComcast 2024 Annual Report on Form 10-K\n6\nTable of Contents\nR\nevenue is primarily generated from the sale of advertising and from the distribution of our television and streaming programming.\nWe sell advertising on our linear television networks, Peacock and other digital properties. Our advertising sales are affected by the prices we charge for each advertising unit, which are generally based on the size and demographics of our viewing audiences, audience ratings on our television networks, the number of advertising units we can place in our programming and on our digital properties, and our ability to sell advertising across our television and streaming business.\nWe receive fees from the d\nistribution of our television networks to traditional multichannel video providers, such as our Residential Connectivity & Platforms segment, and virtual multichannel video providers that offer streamed linear television networks. Our distribution agreements are generally multiyear, with revenue based on the number of subscribers receiving the programming on our television networks and a per subscriber fee, although revenue for certain of our television networks is based on a fixed fee. These fees include amounts for our owned television networks, including under NBC and Telemundo retransmission consent agreements, as well as associated fees from NBC-affiliated and Telemundo-affiliated local broadcast television stations. We also receive monthly retail or wholesale subscription fees for Peacock.\nWe also generate revenue from the licensing of our owned content and technology and from various digital properties. \nDomestic Cable Networks\nWe operate a diversified portfolio of cable networks operating predominantly in the United States. The table below presents a summary of NBCUniversal’s national cable networks and their advertising reach to U.S. households.\nCable Network\nApproximate U.S.\nHouseholds as of\nDecember 31, 2024\n(in millions)\n(a)\nDescription of Programming\nUSA Network\n66\n \nGeneral entertainment and sports\nE!\n65\n \nEntertainment and pop culture\nSyfy\n65\n \nGenre-based entertainment\nMSNBC\n65\n \nNews, political commentary and information\nBravo\n65\n \nLifestyle entertainment\nCNBC\n64\n \nBusiness and financial news\nOxygen\n62\n \nTrue crime\nGolf Channel\n54\n \nGolf competition and golf entertainment\nUniversal Kids\n43\n \nChildren’s entertainment\nUniverso\n16\n \nSpanish-language entertainment\nCNBC World \n16\n \nGlobal financial news\n(a)\nHousehold data is based on information from The Nielsen Company as of December 31, 2024 using its Cable Coverage Universe Estimates report and dynamic ad insertion est\nimates. The Nielsen estimates include subscribers to both traditional and certain virtual multichannel video providers. The Nielsen estimates are not based on information provided by us and are included solely to enable comparisons between our cable networks and those operated by our peers. \nOur regional sports networks serve approximately 11 million households across the United States, including in markets such as Boston, Philadelphia, Sacramento and San Francisco.\nDomestic Broadcast Networks\nNBC\n \nThe NBC network features original entertainment, news and sports programming that reaches viewers in virtually all U.S. television households through more than 200 affiliated stations across the United States, including our 11 owned NBC local broadcast television stations. The NBC owned local broadcast television stations include stations in 8 of the top 10 general markets and collectively reached approximately 35 million U.S. television households as of December 31, 2024, representing approximately 28% of U.S. television households. In addition to broadcasting the NBC network’s national programming, local broadcast television stations deliver local news, weather, and investigative and consumer reporting. \n7\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nTelemundo\nThe Telemundo network, a Spanish-language broadcast network, features original entertainment, news, live specials and sports programming that reaches viewers in over 96% of all U.S. Hispanic television households through 122 affiliated stations, including our 30 owned Telemundo local broadcast television stations, and our national feed. The Telemundo owned local broadcast television stations include stations in all of the top 20 U.S. Hispanic markets and collectively reached approximately 71% of U.S. Hispanic television households as of December 31, 2024. In addition to broadcasting the Telemundo network’s national programming, local broadcast television stations deliver local news, weather, and investigative and consumer reporting. We also own an independent Telemundo station serving the Puerto Rico television market.\nPeacock\nPeacock is our DTC streaming service, featuring NBCUniversal and third-party content. Programming choices include exclusive Peacock originals, current NBC, Bravo and Telemundo shows, news, late-night comedy, live sports and a library of television shows and movies, as well as several live channels. The service is available on internet-connected devices and offered through two subscription-based tiers: an ad-supported tier and a tier featuring the same content ad-free, with certain limited exceptions. The ad-free tier also allows customers to download and watch select programming offline and provides customers with a live stream of their local NBC affiliate stations. We offer Peacock in the United States directly to customers or through arrangements with third parties and our Residential Connectivity & Platforms segment, which offer Peacock to customers on our behalf.\nInternational Networks\nWe operate a diversified portfolio of international television networks, including premium sports networks under the Sky Sports brand in the United Kingdom and Italy, with a majority of networks dedicated to a specific sport, such as European football. We also operate several NBCUniversal international television networks globally, including CNBC International, Studio Universal, Telemundo International and Universal TV.\nProgramming\nOur television networks and Peacock include content licensed from our Studios segment and from third parties, as well as content produced by Media segment businesses, such as live news and sports programming and certain original content, including late-night comedy for NBC and original telenovelas for Telemundo. \nWe have various multiyear agreements for the licensing of content, including contracts related to television and/or streaming rights \nfor sporting events. We generally seek to include in our sports rights agreements the rights to distribute content on one or more of our television networks and on digital properties, including Peacock. \nOur most significant sports rights agreements relate to the NBA, NFL, Olympics and English Premier League. The table below presents a summary of these and certain other sports rights:\nTelevision and/or Streaming Rights\nMarket\nRights Expiration\nNBA and WNBA\n(a)\nUnited States, United Kingdom and Italy\n2035-36 NBA season and 2036 WNBA season\nNFL\n(b)\nUnited States\n2033-34 season\nSummer and Winter Olympic Games\nUnited States\n2032\nEnglish Premier League\nUnited Kingdom, Italy and United States\n2028-29, 2027-28 and 2027-28 seasons, respectively\nPGA Tour and other golf events\nUnited States\nBetween 2026 and 2031\nNASCAR\n(c)\nUnited States\n2031\nBig Ten football and basketball\nUnited States\n2029-30 season\nWorld Wrestling Entertainment (“WWE”)\nUnited States\n2029 on television and 2026 on Peacock\nFormula One\nUnited Kingdom and Italy\n2029 and 2027, respectively\nEngland and Wales Cricket Board\nUnited Kingdom\n2028\nEnglish Football League\nUnited Kingdom\n2028-29 season\nSerie A\nItaly\n2028-29 season\nFIFA World Cup (Spanish-language)\nUnited States\n2026\nCertain professional sports teams through our Regional Sports Networks\nCertain regions in the United States\nBetween 2027 and 2040\nComcast 2024 Annual Report on Form 10-K\n8\nTable of Contents\n(a) Beginning with the 2025-26 NBA season and 2026 WNBA season, includes the rights to produce and distribute across our networks and on Peacock a specified number of NBA and WNBA regular season and playoff games, the NBA All-Star game and NBA All-Star Saturday Night each season, as well as six NBA Conference Finals series and three WNBA Finals series over the term of the agreements. A certain number of NBA games will also be distributed in the Spanish language on Telemundo.\n(b) Includes the rights to produce and distribute on NBC and on Peacock a specified number of regular season games that includes Sunday Night Football games, Thursday Kickoff games and Thanksgiving night games, playoff games, and three remaining Super Bowl games, the next of which is in February 2026. The agreement expires after the 2033-34 season, with a termination right available to the NFL after the 2029-30 season. The agreement also includes rights to additional exclusive games on Peacock. All of the NFL games are also distributed in the Spanish language on Universo or Telemundo.\n(c) Includes the unilateral right by the other party (i.e., the licensor) to the agreement, under certain circumstances, to shorten the term of the agreement by one year.\nOur television and streaming business competes for the acquisition of content, including sports rights, and for on-air and creative talent primarily with other television networks, DTC streaming providers, and local broadcast television stations. In Europe, major sports rights, which are significant to our international networks, are usually tendered through a competitive auction process, with the winning bidder or bidders acquiring rights over a 3 to 5 year period.\nStudios Segment\nOur Studios segment primarily includes our NBCUniversal and Sky film and television studio production and distribution operations. Our studio production facilities primarily include our owned Universal City location in Los Angeles, California and our leased studios in Atlanta, Georgia and in Elstree, United Kingdom. Revenue is generated primarily from the worldwide licensing of our owned film and television content and from the worldwide distribution of our produced and acquired films for exhibition in movie theaters. We also generate revenue from the sale of physical and digital home entertainment products, as well as the production and licensing of live stage plays and the distribution of content produced by third parties.\nFilm Studios\nOur film studios develop, produce, acquire, market and distribute filmed entertainment worldwide. Our films are produced primarily under the following names:\n•\nUniversal Pictures\n•\nIllumination\n•\nDreamWorks Animation\n•\nFocus Features\n•\nWorking Title\nWe distribute the majority of our films initially for exhibition in movie theaters, while other films are initially distributed through licensing agreements. After their initial release, we distribute films globally to different customers over multiple licensing windows. We license films, including recent films and selections from our film library, which is comprised of more than 6,500 movies in a variety of genre\ns, to linear television networks and DTC streaming service providers, and to video on demand services provided by multichannel video providers. This includes licenses to our Media and Residential Connectivity & Platforms segments. Certain films are also licensed to our Media segment and made available for viewing on Peacock on the same date as the theatrical release.\n We also distribute films globally through the sale of physical and digital home entertainment products. Additionally, w\ne\n acquire distribution rights to films produced by third parties, which may be limited to particular geographic regions, specific forms of media or certain periods of time. Theatrical revenue is significantly affected by the timing of each release and the number of films we distribute, their acceptance by audiences, the number of exhibition screens, ticket prices, the percentage of ticket sales retention by the exhibitors and the popularity of competing films at the time our films are released. The success of a film in movie theaters is generally a significant factor in determining the revenue a film is likely to generate in succeeding licensing windows and through physical and digital home entertainment product sales.\nWe develop and produce films both alone and jointly with other studios or production companies. In certain cases, we have also entered into film co-financing arrangements with third party studios and non-studio entities to jointly finance or distribute certain of our film productions. These arrangements can take various forms, but in most cases involve the grant of an economic inter\nest in a film to an investor. Investors generally assume the full risks and rewards of ownership proportionate to their ownership in the film.\nIn connection with film studio productions, we typically owe “residuals” payments to individuals hired under collective bargaining agreements, which are generally calculated based on post-theatrical or content licensing revenue. We also typically owe “participations” payments to creative talent, to third parties under co-financing agreements and to other parties involved in content production, which are generally based on the financial performance of the content.\n9\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nTelevision Studios\nOur television studios develop, produce and distribute original content, including scripted and unscripted television series. We also produce television content jointly as co-producers with third-party studios and production companies. Our television studios produce content primarily under the following names:\n•\nUniversal Television \n•\nUniversal Content Productions\n•\nUniversal Television Alternative Studio\n•\nUniversal International Studios\n•\nSky Studios\nOur original content is primarily initially licensed to linear television networks and DTC streaming service providers, including those in our Media and Residential Connectivity & Platforms segments. We also license content after its initial airing, license older television content from our television library, and distribute owned and acquired content globally through the sale of physical and digital home entertainment products. The production and distribution costs related to original broadcast television content generally exceed the revenue generated from the initial license, which means that obtaining additional licenses following the initial network license is critical to the content’s financial success. Similar to our film studio\ns, we typically owe residuals and participations payments in connection with television studio productions. \nTheme Parks Segment\nOur Theme Parks segment primarily includes the operations of the following Universal theme parks:\n•\nUniversal Orlando Resort\n: Includes two theme parks, Universal Studios Florida and Islands of Adventure, and our water park, Volcano Bay, all of which are located in Orlando, Florida. Universal Orlando Resort also includes Universal CityWalk Orlando, a dining, retail and entertainment complex, and features on-site themed hotels in which we own a noncontrolling interest, and will include an additional theme park, Epic Universe, that is expected to open in May 2025.\n•\nUniversal Studios Hollywood\n: Includes the Universal Studios Hollywood theme park located in Hollywood, California and Universal CityWalk Hollywood, a dining, retail and entertainment complex. \n•\nUniversal Studios Japan\n: Includes the Universal Studios Japan theme park located in Osaka, Japan. \n•\nUniversal Beijing Resort\n: Includes the Universal Studios Beijing theme park, as well as Universal CityWalk Beijing, a dining, retail and entertainment complex, and on-site themed hotels, all of which are located in Beijing, China. Universal Beijing Resort is owned by us and a consortium of Chinese state-owned companies (see Note 7 to the consolidated financial statements included in this Annual Report on Form 10-K).\nOur Theme Parks segment properties are primarily owned by us, although certain properties are leased, including land in Beijing, China and Osaka, Japan. We have invested and will continue to invest significantly in existing and new theme park attractions, hotels and infrastructure, as well as in new destinations and experiences, such as Epic Universe; Universal Kids Resort, a smaller-scale theme park in Frisco, Texas expected to open in 2026; and Universal Horror Unleashed, a year-round horror entertainment experience in Las Vegas, Nevada expected to open in 2025. \nRevenue is generated primarily from guest spending at our theme parks, including ticket sales and in-park spending on food, beverages and merchandise, and from our consumer products business. Revenue for our theme parks generally depends on the overall environment for travel and tourism, including consumer spending on leisure and other recreational activities. \nWe also license the right to use the Universal Studios brand name and other intellectual property and provide other services to third parties, including the party that owns and operates the Universal Studios Singapore theme park on Sentosa Island, Singapore. The themed elements in our rides, attractions, and merchandising are based on intellectual property in our Studios and Media segments and intellectual property licensed from third parties under long-term agreements. \nCompetition\nMedia\nOur Media segment competes for viewers’ attention and audience share with all forms of programming provided to viewers, including DTC streaming service providers; television networks; local broadcast television stations; physical and digital home en\ntertainment products; video on demand and pay-per-view services; online activities, such as social networking and viewing user-generated content; gaming products; and other forms of entertainment, news and information. \nComcast 2024 Annual Report on Form 10-K\n10\nTable of Contents\nMedia competes for the sale of advertising with digital properties, including an increasing number of ad-supported DTC streaming service providers and other online content, such as social networking platforms and user-generated content, as well as with other television networks and stations, and all other advertising platforms. The willingness of advertisers to purchase advertising from us may be adversely affected by lower audience ratings and viewership at the related networks, stations or digital properties. Declines in audience ratings can be caused by increased competition for the leisure time of viewers and by audience fragmentation resulting from the increasing number and forms of entertainment choices available. Additionally, it is increasingly challenging to accurately measure fragmented audiences.\nOur domestic cable networks and international networks compete primarily with other cable networks and programming providers for carriage by multichannel video providers and DTC streaming service providers. Our domestic broadcast networks compete with the other broadcast networks in markets across the United States to secure affiliations with independently owned local broadcast television stations, which are necessary to ensure the effective distribution of broadcast network programming to a nationwide audience. Peacock competes for subscribers primarily with other DTC streaming service providers, as well as with traditional providers of linear television programming.\nStudios\nOur film and television studios compete for audiences with other major film and television studios, independent film producers and creators of content, as well as with alternative forms of entertainment. The competitive position of our studios primarily depends on the number of films and television series and episodes produced, their distribution and marketing success, and consumer response. Our studios also compete to obtain creative, performing and technical talent, including writers, actors, directors, and producers, as well as scripts for films and television shows, and for the distribution of, and consumer interest in, their content. We also compete with other major film and television studios and other producers of entertainment content for the exhibition of content in theaters, on demand, on television networks, and on DTC streaming services.\nTheme Parks\nOur theme parks compete with other multi-park entertainment companies as well as other providers of entertainment, tourism, recreational activities and lodging. The competitive position of our theme parks primarily depends on the quality and popularity of rides and attractions, including effective use of intellectual property in themed attractions. There is increased competition in areas with high concentrations of theme parks and other attractions operated by several companies. Macroeconomic conditions and other factors may also result in shifting consumer preferences toward other types of destinations, experiences and products.\nSeasonality and Cyclicality\nRevenue and costs and expenses in our Media segment are cyclical as a result of our periodic broadcasts of major sporting events, such as the Olympic Games and the Super Bowl. In particular, advertising revenue increases due to increased demand for advertising time for these events and distribution revenue increases in the period of broadcasts of the Olympic Games. Costs and expenses also increase as a result of our production costs for these broadcasts and the recognition of the related rights fees.\nRevenue in Media is also subject to cyclical advertising patterns and changes in viewership levels. Domestic advertising revenue is generally higher in the second and fourth quarters of each year and in even-numbered years due to increases in advertising in the spring and in the period leading up to and including the winter holiday season, and advertising related to candidates running for political office and issue-oriented advertising, respectively. International advertising revenue typically has seasonally higher audience levels in winter months, with lower levels in summer months due to the timing of European football seasons, winter holidays and summer vacations. Revenue also fluctuates depending on the timing of when our programming is aired, which typically results in additional advertising revenue in the second and fourth quarters of each year.\nRevenue in Studios fluctuates due to the timing, nature and number of films released in movie theaters, through DTC streaming services and viewing on demand, and on physical and digital home entertainment products. Release dates are determined by several factors, including competition and the timing of vacation and holiday periods. As a result, revenue tends to be seasonal, with increases experienced each year during the summer months and around the winter holiday season. We incur significant marketing expenses before and throughout the release of a film in movie theaters and as a result, we typically incur losses on a film prior to and during the film’s exhibition in movie theaters. Content licensing revenue also fluctuates due to the timing of when our film and television content is made available to licensees. Revenue from our television studios fluctuates in part due to a correlation with the broadcast network season beginning annually in September.\nRevenue in Theme Parks fluctuates with changes in theme park attendance that typically result from the seasonal nature of vacation travel and weather variations, local entertainment offerings and the opening of new attractions, as well as with changes in currency exchange rates. Our theme parks generally experience peak attendance during the spring holiday period, the summer months when schools are closed and the winter holiday season.\n11\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nCorporate and Other\nOur other business interests reported in Corporate and Other consist primarily of our Sky-branded video services and television networks in Germany, Comcast Spectacor, which owns the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania, and Xumo, our consolidated streaming platform joint venture with Charter Communications formed in June 2022. Xumo is focused on developing and offering a streaming platform on a variety of devices, including Xumo TV smart televisions, which have an operating system that leverages our global technology platform, and also operates the Xumo Play streaming service.\nLegislation and Regulation\nOur businesses are subject to various federal, state, local, and international laws and regulations. In the United States in particular, the Communications Act of 1934, as amended (the “Communications Act”), and Federal Communications Commission (“FCC”) rules and regulations affect significant aspects of our communications businesses.\nBeyond the more significant regulations summarized below, legislators and regulators at all levels of government frequently consider changing, and sometimes do change, existing statutes, rules or regulations, or interpretations of existing statutes, rules or regulations, or prescribe new ones, any of which may significantly affect our businesses and ability to effectively compete. Applying existing laws in novel ways to new technologies, including streaming services and artificial intelligence (“AI”), may also affect our business. These legislators and regulators, along with some state attorneys general and foreign governmental authorities, have been active in conducting inquiries and reviews regarding our services. State legislative and regulatory initiatives can create a patchwork of different and/or conflicting state requirements, such as with respect to privacy and Open Internet/net neutrality regulations, that can affect our businesses and ability to effectively compete. \nLegislative and regulatory activity has increased in recent years, particularly with respect to broadband networks. For example, Congress has approved tens of billions of dollars in new funding for broadband deployment and adoption initiatives, and may consider other proposals that address communications issues, including whether it should rewrite the Communications Act to account for changes in the communications marketplace. Federal agencies have considered adopting new regulations for communications services, including broadband, although it is uncertain whether those initiatives will continue under the new Administration. States and localities are increasingly proposing new regulations impacting communications services, including broader regulation of broadband networks. Regulators in various international jurisdictions are similarly considering changes to telecommunications and media requirements. Any of these regulations could significantly affect our business and our legal and compliance costs. In addition, United States and foreign regulators and courts could adopt new interpretations of existing competition or antitrust laws or enact new competition or antitrust laws or regulatory tools that could negatively impact our businesses. Any future legislative, judicial, regulatory or administrative actions may increase our costs or impose additional restrictions on our businesses, some of which may be significant. We are unable to predict the outcome or effects of any of these potential actions or any other legislative or regulatory proposals on our businesses. \nThe following paragraphs summarize the more significant legal and regulatory requirements and risks affecting our businesses. \nCommunications-Related Regulations in the United States\nBroadband\nOur broadband services are subject to a number of regulations and commitments.\nIn 2023, the FCC adopted broad rules that prohibit digital discrimination of access to broadband service based on income level, race, ethnicity, color, religion and national origin; this order currently is subject to legal challenge in federal court. In 2024, the\n FCC reclassified broadband internet access services as a “telecommunications service” subject to traditional common carriage regulation under Title II of the Communications Act. However, a federal appellate court in January 2025 overturned that reclassification, ruling that broadband internet access service is an “information service” under Title I of the Communications Act and that the FCC does not have authority to subject broadband services to utility-style regulations such as rate regulation and market entry and exit requirements under Title II. As a Title I “information service,” broadband is only subject to light-touch regulation such as broadband disclosure requirements, and deployment, subscription, and pricing reporting requirements. States and localities have in the past enacted and may in the future periodically consider new broadband-related regulations, including those regarding government-owned broadband networks, net neutrality and broadband affordability, which could create a patchwork of, and potentially inconsistent, federal, state and local regulatory regimes. New broadband regulations, if adopted, may have adverse effects on our businesses, and we cannot predict the outcome of any pending or future litigation or how any rules will ultimately be interpreted and enforced and how they might affect our business.\nComcast 2024 Annual Report on Form 10-K\n12\nTable of Contents\nWe, from time to time, participate in broadband-deployment funding initiatives at the federal and state levels and may also become subject to additional broadband-related commitments as a condition of receiving federal or state broadband funding. We cannot predict how and to whom any such funds will be awarded, when the initiatives will be terminated or the impact of these initiatives on our businesses.\nA number of municipalities operate municipally owned broadband networks, and there may be further efforts by local governments to expand or create government-owned networks, particularly in light of federal funding for broadband deployment. Certain states have enacted laws that restrict or prohibit local municipalities from operating municipally owned broadband networks, and there may be efforts in other state legislatures to restrict the development of government-owned networks. Other states, however, have amended or may amend such laws to facilitate such networks. Much of the federal funding authorized for broadband deployment is conditioned on states agreeing to make it available for potential use by government-owned networks, although the funding prioritizes deployment to unserved and underserved areas and locations. We cannot predict how successful any of those efforts will be and how they might affect our businesses.\nVideo and Media\nWe are subject to laws and regulations that apply to the cable services we provide through our Residential Connectivity & Platforms business and to our cable networks and local broadcast television stations in our Media business. These laws and regulations can constrain our ability to compete, particularly against DTC streaming service providers, which are not subject to these same requirements.\nFederal, state and local franchising rules and regulations may require us to provide adequate channel capacity, facilities and financial support for public, educational and governmental access programming; comply with certain renewal procedures for our franchise agreements; pay franchise fees; and comply with customer service, accessibility, and certain other requirements. In addition, the FCC and other federal agencies can impact the programming networks that we carry, as well as how we price, package, bill and market our video services. FCC regulations also require cable operators to carry programming transmitted by certain local broadcast television stations (“must-carry” requirement) or to negotiate a “retransmission consent” agreement with certain other stations that will frequently involve payments from cable operators to the station; govern program access by preventing cable networks affiliated with cable operators from favoring affiliated cable operators over competing multichannel video providers; grant licenses to broadcast television stations for 8-year cycles, which may not be renewed on favorable terms, or at all; limit local and national television ownership, as well as foreign ownership in a broadcast television station; and regulate children’s programming. \nThe FCC enforces these rules on a case-by-case basis based on complaints filed by consumers, state and local governments, and other entities. We have been involved in disputes at the FCC in some of these areas and may be involved in new disputes in the future, including potential disputes related to content moderation and free speech. We cannot predict the outcome of any such disputes or associated litigation. The FCC and Congress have previously considered proposals that would require companies that own multiple cable networks to make each of their networks available individually when negotiating distribution agreements with MVPDs and potentially with DTC streaming and other OTT service providers. We currently offer our cable networks on a packaged basis (in “tiers”) and, in various cases, individually. We have been involved in program access disputes at the FCC and may be subject to new complaints in the future.\nFurthermore, certain states and localities have adopted laws to impose franchise or other fees on DTC streaming services. To date, courts have invalidated those laws, but we cannot predict the outcome of any future litigation.\nWireless\nWe offer a wireless voice and data service primarily using our MVNO rights to provide the service over Verizon’s wireless network. MVNOs are subject to many of the same FCC regulations as facilities-based wireless carriers, such as E911 services and local number portability, as well as certain state or local regulations. The FCC or other regulatory authorities may adopt new or different regulations for MVNOs and/or mobile broadband providers in the future, which could adversely affect our wireless phone service offering or our business generally.\nVoice\nWe provide voice services using VoIP technology. The FCC has adopted a number of regulations for providers of nontraditional voice services such as ours, including regulations relating to privacy of customer proprietary network information, local number portability duties and benefits, disability access, E911, law enforcement assistance, outage reporting, Universal Service Fund contribution obligations, rural call completion, customer equipment back-up power, robocall mitigation, service discontinuance and certain regulatory filing requirements. State regulatory commissions and legislatures in other jurisdictions may continue to consider imposing regulatory requirements on our voice services as long as the regulatory classification of VoIP remains unsettled at the federal level.\n13\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nSpectrum Allocations\nThe FCC, the Department of Commerce’s National Telecommunications and Information Administration, and other federal agencies have taken, and in some cases are preparing to take, steps to evaluate and potentially modify certain spectrum allocations and rules to make available additional spectrum that likely will be used for licensed and/or unlicensed commercial services, including 5G and Wi-Fi services, which could impact our businesses. We cannot predict the timing or outcome of these spectrum allocation actions. Additional commercial spectrum could impact current marketplace dynamics, including the ability of wireless providers to compete with our services. Further, if the FCC reallocates spectrum that our businesses currently use to provide services, we could be required to transition our operations to different frequencies in order to accommodate the reallocation of spectrum for 5G, which could disrupt our services and impose additional costs.\nInternational Communications-Related and Other Regulations\nCertain of our international businesses are subject to telecommunications and media-specific regulation, including those related to broadband and voice services and television networks, in Europe, Latin America, and other international jurisdictions, and all of our international businesses are subject to regulation under generally applicable laws, such as competition, consumer protection, data protection, and taxation in the jurisdictions where they operate. Our international businesses are currently, and may be in the future, subject to proceedings or investigations from regulatory and antitrust authorities in the jurisdictions in which those businesses operate.\nOther Areas of Regulation\nIntellectual Property\nCopyright, trademark, unfair competition, patent, trade secret and other proprietary-rights laws of the United States and other countries help protect our intellectual property rights. In particular, unauthorized copying, distribution and piracy of programming and films over the internet, through devices, software and websites, counterfeit DVDs/Blu-rays and through other platforms interfere with the market for copyrighted works and present challenges for our content businesses. We have actively engaged in the enforcement of our intellectual property rights and likely will continue to expend substantial resources to protect our content. Although many legal protections exist to combat such practices, the extent of copyright protection is sometimes ambiguous and the use of technological protections can be controversial. Modifications to existing laws, a weakening of these protections or their enforcement or a failure of existing laws, in the United States or internationally, to adapt to new technologies could have an adverse effect on our ability to license and sell our programming.\nU.S. copyright laws establish a cable compulsory copyright license that requires our video distribution business to contribute a specified percentage of revenue to a federal copyright royalty pool in exchange for retransmitting copyrighted material included in broadcast signals. We also pay standard industry licensing fees for the public performance of music in the programs we create or distribute. The cable compulsory copyright license and the royalties we pay are subject to audits and possible regulatory and legislative changes that could impact the royalty fees we pay and our ability to retransmit broadcast signals over cable systems. In addition, the landscape for music licensing is constantly changing, and music fees we pay are subject to new fee demands and negotiations. We cannot predict how changes to the compulsory copyright license and music licensing will impact the fees that we pay.\nPrivacy and Data Protection Regulation\nOur businesses are subject to laws and regulations that impose various restrictions and obligations related to privacy and the processing of individuals’ personal information. In the United States, federal privacy laws and regulations, such as those found within the Communications Act or the Video Privacy Protection Act, restrict companies’ collection, use, disclosure and retention of personal information. The proliferation of laws at the state level has expanded consumers’ rights to include individual rights of access, deletion, portability, correction, the right to appeal, and the individual’s right to “opt in” to collection and use of certain types of “sensitive” personal information. Internationally, many of the laws that apply to our businesses are similar to the European Union’s General Data Protection Regulation and the United Kingdom’s Data Protection Act of 2018, which broadly regulate the processing of personal data collected from individuals in the European Union and United Kingdom, respectively.\nComcast 2024 Annual Report on Form 10-K\n14\nTable of Contents\nSome of our businesses are also subject to the FTC’s general oversight of consumer privacy protections through its enforcement authority over unfair and deceptive acts or practices, as well as through its enforcement authority over the Children’s Online Privacy Protection Act. The FTC has sought to expand its authority in this area through various rulemakings related to general privacy, targeted advertising and children’s privacy. There has been an increased focus on children’s privacy at both the state and federal levels within the United States, as well as internationally. These new laws may require changes to our products and services and could adversely affect our advertising businesses.\nIn addition, many international data protection laws, some federal laws, and all 50 U.S. states have security breach notification requirements that obligate businesses to provide notice to consumers and government agencies if certain information has been accessed or exfiltrated by an unauthorized party; some of these laws also require documented information security programs. \nState and Local Taxes\nSome U.S. states and localities have imposed or are considering imposing, through both legislative and administrative channels, new or additional taxes or fees on, or limiting or eliminating incentives or credits earned or monetized by, our businesses, or imposing adverse methodologies by which taxes, fees, incentives or credits are computed, earned or monetized. These include combined reporting or other changes to general business taxes, central assessments for property tax, and taxes and fees on the businesses operated or services provided by our businesses, most notably new taxes or fees on digital advertising or other digital commerce. In some situations, DBS providers and other competitors (such as DTC streaming service providers) that deliver their services over a broadband connection do not face the same state and local tax and fee burdens. Congress has also considered, and may consider again, proposals to bar or limit states from imposing taxes on these DBS providers or other competitors (such as DTC streaming service providers) that are equivalent to the taxes or fees that we pay. The Internet Tax Freedom Act (“ITFA”) prohibits most states and localities from imposing sales and other taxes on our internet access charges and discriminating against electronic commerce; however, some jurisdictions may challenge the ITFA or the application of the ITFA to our business, or may assert that certain taxes akin to right-of-way fees are not preempted by the ITFA or other federal laws. \nOther Regulations\nU.S. states and localities, and various regulatory authorities, actively regulate other aspects of our businesses, including our Studios and Theme Parks businesses, accessibility to our video and voice services and broadcast television programming for people with disabilities, customer service standards, inside wiring, cable equipment, pole attachments, universal service fees, regulatory fees, public safety, telemarketing, leased access, indecency, loudness of commercial advertisements, advertising, political broadcasting, sponsorship identification, Emergency Alert System, equal employment opportunity and other employment-related practices, environmental-related matters, our equipment supply chain, and technical standards relating to the operation of cable systems and television stations. In addition, our international businesses are subject to various similar regulations, including those that cover television broadcasting, programming, and advertising. We are occasionally subject to enforcement actions and investigations at the FCC and other federal, state, and local agencies, as well as foreign governments and regulatory authorities, which can result in fines, sanctions and/or ongoing compliance plans and government oversight. \nHuman Capital Resources\nAs of December 31, 2024, we had approximately 182,000 full-time and part-time employees calculated on a full-time equivalent basis. Approximately 30% of our employees were located in over 30 countries outside the United States, with larger workforce concentrations in the United Kingdom, Western Europe, East Asia and South Asia. We also use freelance and temporary employees in the normal course of our business. A small overall portion of our full-time U.S. employees are unionized, although many of Content & Experiences’ freelance and temporary writers, directors, actors, technical and production per\nsonnel, as well as some on-air and creative talent employees, are covered by industry-wide collective bargaining agreements or work councils.\n Outside the United States, employees in certain countries, particularly in Europe, are represented by an employee representative organization, such as a union, works council or employee association.\nOur company has been built on a foundation of respect, integrity and trust, and we are committed to creating and fostering a work environment that promotes those values. As a global media and technology company, we have a wide range of employees, including management professionals, technicians, engineers, call center employees, theme park employees, and media talent and production employees. Some of our key workforce-related programs and initiatives include the following.\nEmployee Engagement\n•\nWe seek to create an engaged workforce through proactive listening and constructive dialogue, including through employee engagement surveys, as well as through employee resource groups.\n15\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\n•\nWe are committed to creating an environment that encourages employees to ask questions, raise concerns and speak up about a workplace issue or suspected illegal or unethical conduct. We\n \nprovide several channels for speaking up without fear of retaliation, including a helpline and a web portal that are administered by an independent third-party company and allow for anonymous reporting when permitted by applicable laws.\nTalent Development\n•\nWe provide a wide variety of opportunities for professional growth for all employees with in-classroom and online trainings and on-the-job experience.\n•\nWe offer education tuition assistance to full-time employees in the United States.\n•\nOur Board of Directors discusses succession planning for our CEO and the remainder of our senior executive management team at least once a year. Throughout the year, our senior executive management team, as well as a broader array of executives throughout our businesses, make presentations to the Board and its committees and interact with our directors informally outside of regularly scheduled Board meetings, which provides directors with meaningful insight into our current pool of talent, what attracts and retains our executives, and our company culture.\n•\nWe promote a culture that embraces equal opportunity for all.\n•\nComcast has nine voluntary employee resource groups with more than 36,000 members in 240 chapters across the U.S. These employee-led organizations are open to all and contribute to business priorities, career development, and foster an inclusive and collaborative workplace.\nHealth and Welfare Benefits\n•\nWe offer a robust portfolio of health and welfare programs and solutions designed to meet the unique needs of our employees and their families, delivered through a consistent and seamless member experience.\n•\nOur offerings include comprehensive and affordable health care coverage options along with a variety of additional tools and resources, including access to dedicated health care navigators, expert medical opinion services, virtual primary care services and a diabetes management program. In addition, we offer comprehensive family planning options, including for adoption and surrogacy, and provide specialized support teams to help employees manage all stages in the family planning journey including parenthood.\n•\nWe continue to invest in the emotional wellbeing of our employees and offer a broad array of tools and resources such as our Employee Assistance Program, which provides personal counseling sessions to support employees and their families and provide problem-solving support for a broad range of issues, including stress, anxiety, depression, substance use and more. We also offer various digital emotional wellbeing tools, including child learning and behavior support, meditation, stress management, sleep issues, depression, chronic pain and substance use.\nFinancial Benefits\n•\nWe focus on attracting and retaining employees by providing compensation and benefits packages that are competitive within the applicable market, taking into account the job position’s location and responsibilities. \n•\nWe provide competitive financial benefits such as a 401(k) retirement plan in the United States with a company match and other retirement arrangements internationally.\n•\nWe have employee stock purchase plans in the United States, United Kingdom, India and several other European countries where most of our full-time and part-time employees can purchase our stock at a discount. \n•\nWe generally grant stock-based awards on an annual basis to a meaningful portion of our employees, with over 24,000 employees receiving such awards in \n2024\n. \n•\nWe offer financial literacy training and counseling to support employees in making their own financial decisions.\nAvailable Information and Websites\nOur phone number is (215) 286-1700, and our principal executive offices are located at One Comcast Center, Philadelphia, PA 19103-2838. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and any amendments to such reports filed with or furnished to the SEC under Sections 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), are available free of charge on the SEC’s website at www.sec.gov and on our website at www.comcastcorporation.com as soon as reasonably practicable after such reports are electronically filed with the SEC. The information posted on our websites is not incorporated into our SEC filings. \nComcast 2024 Annual Report on Form 10-K\n16\nTable of Contents\nCaution Concerning Forward-Looking Statements\nThis Annual Report on Form 10-K includes statements that may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are not historical facts or statements of current conditions, but instead represent only our beliefs regarding future events, many of which, by their nature, are inherently uncertain and outside of our control. These may include estimates, projections and statements relating to our business plans, objectives and expected operating results, which are based on current expectations and assumptions that are subject to risks and uncertainties that may cause actual results to differ materially. These forward-looking statements are generally identified by words such as “believe,” “project,” “expect,” “anticipate,” “estimate,” “intend,” “potential,” “strategy,” “future,” “opportunity,” “commit,” “plan,” “goal,” “may,” “should,” “could,” “will,” “would,” “will be,” “will continue,” “will likely result” and similar expressions. In evaluating these statements, you should consider various factors, including the risks and uncertainties we describe in “Risk Factors” and in other reports we file with the SEC.\nAny of these factors could cause our actual results to differ materially from those expressed or implied by our forward-looking statements, which could adversely affect our businesses, results of operations or financial condition. Readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date they are made. We undertake no obligation to update or revise publicly any forward-looking statements, whether because of new information, future events or otherwise.\n17\nComcast 2024 Annual Report on Form 10-K\nTable of Contents"
}