{
  "ticker": "CMI",
  "cik": "0000026172",
  "company_name": "CUMMINS INC",
  "filing_date": "2025-02-11",
  "accession": "0000026172-25-000007",
  "primary_doc": "cmi-20241231.htm",
  "item1_text": "ITEM 1.    Business\nOVERVIEW \nWe were founded in 1919 as Cummins Engine Company, a corporation in Columbus, Indiana, and one of the first diesel engine manufacturers. In 2001, we changed our name to Cummins Inc. We are a global power solutions leader comprised of five business segments - Engine, Components, Distribution, Power Systems and Accelera - supported by our global manufacturing and extensive service and support network, skilled workforce and vast technical expertise. Our products range from advanced diesel, natural gas, electric and hybrid powertrains and powertrain-related components including aftertreatment, turbochargers, fuel systems, valvetrain technologies, controls systems, air handling systems, automated transmissions, axles, drivelines, brakes, suspension systems, electric power generation systems, electrified power systems with innovative components and subsystems, including battery, fuel cell and electric power technologies and hydrogen production technologies. We sell our products to original equipment manufacturers (OEMs), distributors, dealers and other customers worldwide. We serve our customers through a service network of approximately 650 wholly-owned, joint venture and independent distributor locations and more than 19,000 Cummins certified dealer locations in approximately 190 countries and territories.\nDivestiture of Atmus\nOn March 18, 2024, we completed the divestiture of our remaining 80.5 percent ownership of Atmus Filtration Technologies Inc. (Atmus) common stock through a tax-free split-off. The exchange resulted in a reduction of shares of our common stock outstanding by 5.6 million shares and a gain of approximately $1.3 billion. See NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" to our \nConsolidated Financial Statements\n for additional information.\nSettlement Agreements\nIn December 2023, we announced that we reached an agreement in principle with the U.S. Environmental Protection Agency (EPA), the California Air Resources Board (CARB), the Environmental and Natural Resources Division of the U.S. Department of Justice (DOJ) and the California Attorney General’s Office to resolve certain regulatory civil claims regarding our emissions certification and compliance process for certain engines primarily used in pick-up truck applications in the U.S., which became final and effective in April 2024 (collectively, the Settlement Agreements). In the second quarter of 2024, we made $1.9 billion of payments required by the Settlement Agreements. See NOTE 14, “COMMITMENTS AND CONTINGENCIES,” to our \nConsolidated Financial Statements \nfor additional information.\nOPERATING SEGMENTS\nWe have five complementary operating segments: Engine, Components, Distribution, Power Systems and Accelera. These segments share technology, customers, strategic partners, brand recognition and our distribution network in order to compete more efficiently and effectively in their respective markets. In each of our operating segments, we compete worldwide with a number of other manufacturers and distributors that produce and sell similar products. Our products primarily compete on the basis of performance, price, total cost of ownership, fuel economy, emissions compliance, speed of delivery, quality and customer support. \nWe use segment earnings or losses before interest expense, income taxes, depreciation and amortization and noncontrolling interests (EBITDA) as the basis for the Chief Operating Decision Maker to evaluate the performance of each of our reportable operating segments. We believe EBITDA is a useful measure of our operating performance as it assists investors and debt holders in comparing our performance on a consistent basis without regard to financing methods, capital structure, income taxes or depreciation and amortization methods, which can vary significantly depending upon many factors. See NOTE 25, \"OPERATING SEGMENTS,\" to our \nConsolidated Financial Statements \nfor additional information and a reconciliation of our segment information to the corresponding amounts in our \nConsolidated Statements of Net Income\n.\n5\nTable of Contents\nEngine Segment\nEngine segment sales and EBITDA as a percentage of consolidated results were: \n \nYears ended December 31,\n \n2024\n2023\n2022\nPercent of consolidated net sales \n(1)\n28\n \n%\n28 \n%\n31 \n%\nPercent of consolidated EBITDA \n(1)\n33\n \n%\n32 \n%\n38 \n%\n(1)\n Measured before intersegment eliminations\nThe Engine segment manufactures and markets a broad range of diesel and natural gas-powered engines under the Cummins brand name, as well as certain customer brand names, for the heavy-duty truck, medium-duty truck and bus, light-duty automotive and off-highway markets. We manufacture a wide variety of engine products including:\n•\nEngines with a displacement range of 2.8 to 15 liters and horsepower ranging from 48 to 715; and\n•\nNew and remanufactured parts and engines, which are sold and serviced primarily through our extensive distribution network.\nThe Engine segment is organized by engine displacement size and serves these end-user markets:\n•\nHeavy-duty truck - \nWe manufacture diesel and natural gas engines that range from 310 to 615 horsepower serving global heavy-duty truck customers worldwide, primarily in North America, China and Australia.\n•\nMedium-duty truck and bus - \nWe manufacture diesel and natural gas engines ranging from 130 to 450 horsepower serving medium-duty truck and bus customers worldwide, with key markets including North America, Europe, Latin America, China, Australia and India. Applications include pick-up, delivery, emergency vehicles, regional haul and vocational trucks and school, transit and shuttle buses. We also provide diesel engines for Class A motor homes (RVs), primarily in North America. \n \n•\nLight-duty automotive (pick-up and light commercial vehicle (LCV)) - \nWe manufacture 105 to 430 horsepower diesel engines, including engines for the pick-up truck market for Stellantis N.V. (Stellantis) in North America and LCV markets in Latin America and China.\n•\nOff-highway (industrial engines) - \nWe manufacture diesel engines that range from 48 to 715 horsepower serving key global markets including construction, mining, marine, rail, oil and gas, defense and agriculture and also the power generation business for standby, mobile and distributed power generation solutions throughout the world.\n \nThe principal customers of our heavy-duty truck engines include truck manufacturers such as PACCAR Inc. (PACCAR), Traton Group (Traton) and Daimler Trucks AG (Daimler). The principal customers of our medium-duty truck and bus engines include truck manufacturers such as Daimler, Traton and PACCAR. The principal customers of our light-duty automotive engines are Stellantis, Anhui Jianghuai Automobile Group Co., Ltd., Volkswagen Caminhões e Ônibus and China National Heavy Duty Truck Group. We sell our industrial engines to manufacturers of construction and agricultural equipment including Hyundai Heavy Industries, Komatsu Ltd. (Komatsu), Zoomlion Heavy Industry Science & Technology Co., Ltd, Xuzhou Construction Machinery Group, Guangxi LiuGong Machinery Co., Ltd, JLG Industries, Inc. and Sany Group. \nIn the Engine segment, our competitors vary from country to country, with local manufacturers generally predominant in each geography. Other independent engine manufacturers include Weichai Power Co. Ltd. and Deutz AG. Truck OEMs may also elect to produce their own engines, and we must provide competitive products to win and keep their business. Truck OEMs that currently produce some or all of their own engines include Daimler, PACCAR, Traton, Volvo Powertrain, Ford Motor Company, China First Auto Works, Dongfeng Motor Corporation, CNH Industrial and Isuzu.\n6\nTable of Contents\nComponents Segment\nComponents segment sales and EBITDA as a percentage of consolidated results were:\n \nYears ended December 31,\n \n2024\n2023\n2022\nPercent of consolidated net sales \n(1)\n28\n \n%\n32 \n%\n28 \n%\nPercent of consolidated EBITDA \n(1)\n32\n \n%\n36 \n%\n33 \n%\n(1)\n Measured before intersegment eliminations\nThe Components segment designs, manufactures and supplies products which complement the Engine and Power Systems segments, including axles, drivelines, brakes and suspension systems for commercial diesel and natural gas applications, aftertreatment systems, turbochargers, fuel systems, valvetrain technologies, automated transmissions and electronics. We design and develop these products and systems to meet increasingly stringent emission and fuel economy standards. \nBeginning in the second quarter of 2024, we realigned certain businesses within our Components segment to be consistent with how our segment leader now monitors performance. We reorganized the businesses to combine the engine components and software and electronics businesses into the newly formed components and software business. In addition, we rebranded our axles and brakes business as drivetrain and braking systems. We began reporting results for these changes within our Components segment effective April 1, 2024, and reflected these changes in the historical periods presented. The change had no impact on our consolidated results.\nThe Components segment is organized around the following businesses:\n•\nDrivetrain and braking systems - \nWe design, manufacture and supply drivetrain systems, including axles, drivelines, brakes and suspension systems primarily for commercial vehicle and industrial applications. We also market and sell truck, trailer, on- and off-highway and other products principally for OEM dealers and other independent distributors and service garages within the aftermarket industry. We primarily serve markets in North America, Europe, South America, India, Asia Pacific and China.\n•\nEmission solutions - \nWe are a global leader in designing, manufacturing and integrating aftertreatment technology and solutions for the commercial on- and off-highway light-duty, medium-duty, heavy-duty and high-horsepower engine markets. Aftertreatment is the mechanism used to convert engine emissions of criteria pollutants, such as particulate matter, nitrogen oxides (NOx), carbon monoxide and unburned hydrocarbons into harmless emissions. Our products include custom engineering systems and integrated controls, oxidation catalysts, particulate filters, selective catalytic reduction systems and engineered components, including dosers. Our emission solutions business primarily serves markets in North America, Europe, China, India, Brazil and Asia Pacific. We serve both OEM first fit and retrofit customers.\n•\nComponents and software - \nWe design, manufacture and market turbocharger, fuel system and valvetrain technologies for light-duty, mid-range, heavy-duty and high-horsepower markets. We also design, develop and supply electronic control modules, sensors and supporting software for on-highway, off-highway and power generation applications. We primarily serve markets in North America, Europe, China and India. \n•\nAutomated transmissions - \nWe develop and supply automated transmissions for the heavy-duty commercial vehicle market. Automated transmissions include automated manual transmissions, dual-clutch transmissions and automatic transmissions for internal combustion engines. The Eaton Cummins Automated Transmission Technologies (ECJV) joint venture is a consolidated 50/50 joint venture between Cummins Inc. and Eaton Corporation Plc. and serves markets in North America and China. \n•\nAtmus - \nOn March 18, 2024, we completed the divestiture of our remaining 80.5 percent ownership of Atmus common stock through a tax-free split-off. See NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" to our \nConsolidated Financial Statements\n for additional information.\nCustomers of the Components segment generally include the Engine, Distribution, Power Systems and Accelera segments, joint ventures including Tata Cummins Ltd., Dongfeng Cummins Engine Co., Ltd. and Beijing Foton Cummins Engine Co., Ltd., truck manufacturers and other OEMs, many of which are also customers of the Engine segment, such as PACCAR, Daimler, Volvo, Traton, Tata Motors Ltd. (Tata Motors) and other manufacturers that use our components in their product platforms.\nThe Components segment competes with other manufacturers of aftertreatment systems, turbochargers, fuel systems, drivetrain systems and transmissions. Our primary competitors in these markets include Robert Bosch GmbH, Parker-Hannifin Corporation, Garrett Motion, Inc., Borg-Warner Inc., Tenneco Inc., Eberspacher Holding GmbH & Co. KG, Denso Corporation, Allison Transmission, Aisin Corporation, Knorr-Bremse AG, ZF Friedrichshafen AG and Dana Incorporated.\n7\nTable of Contents\nDistribution Segment\nDistribution segment sales and EBITDA as a percentage of consolidated results were:\n \nYears ended December 31,\n \n2024\n2023\n2022\nPercent of consolidated net sales \n(1)\n27\n \n%\n25 \n%\n26 \n%\nPercent of consolidated EBITDA \n(1)\n27\n \n%\n24 \n%\n22 \n%\n(1)\n Measured before intersegment eliminations\nThe Distribution segment is our primary sales, service and support channel. The segment serves our customers and certified dealers through a worldwide network of wholly-owned, joint venture and independent distribution locations. Wholly-owned locations operate and serve markets in the seven geographic regions noted below. Joint venture locations serve markets in South America, Southeast Asia and India while independent distribution locations serve markets in these and other geographies.\nDistribution’s mission encompasses the sale and support of a wide range of products and services, including power generation systems, high-horsepower engines, heavy-duty and medium-duty engines designed for on- and off-highway use, application engineering services, custom-designed assemblies, retail and wholesale aftermarket parts and in-shop and field-based repair services. We also provide selected sales and aftermarket support for the Accelera business. Our familiarity with a wide range of market applications allows us to tailor sales, service and support to meet customer-specific needs. \nThe Distribution segment is organized and managed as seven geographic regions, including North America, Asia Pacific, Europe, China, India, Africa and Middle East and Latin America. Across these regions, our locations compete with distributors or dealers that offer similar products. In many cases, these competing distributors or dealers are owned by, or affiliated with the companies that are listed as competitors of the Engine, Components or Power Systems segments. These competitors vary by geographical location and application market. \nPower Systems Segment \nPower Systems segment sales and EBITDA as a percentage of consolidated results were:\n \nYears ended December 31,\n \n2024\n2023\n2022\nPercent of consolidated net sales \n(1)\n16\n \n%\n14 \n%\n14 \n%\nPercent of consolidated EBITDA \n(1)\n23\n \n%\n16 \n%\n15 \n%\n(1)\n Measured before intersegment eliminations\nThe Power Systems segment is organized around the following product lines:\n•\nPower generation - \nWe are a global OEM offering standby and prime power generators ranging from 2 kilowatts to 3.5 megawatts, as well as controls, paralleling systems and transfer switches, for customers with consumer, data center, commercial, industrial, health care, prime rental fleet and defense applications. We also provide turnkey solutions for distributed generation and energy management applications using natural gas, diesel and newer alternative sustainable fuels such as hydrotreated vegetable oil and renewable natural gas.\n•\nIndustrial -\n We design, manufacture, sell and support diesel and natural gas high-speed, high-horsepower engines up to 4,400 horsepower for a wide variety of equipment in mining, oil and gas, marine, rail and defense applications throughout the world.\n•\nGenerator technologies - \nWe design, manufacture, sell and support A/C generator/alternator products for internal consumption and for external generator set assemblers. Our products are sold under the Stamford and AVK brands and range in output from 7.5 kilovolt-amperes (kVA) to 11,200 kVA.\nOur customer base for Power Systems offerings is highly diversified, with customer groups varying based on their power needs. China, India, Europe, Asia Pacific, Latin America, the Middle East and Africa are our largest geographic markets outside of North America.\n8\nTable of Contents\nIn the markets served by the Power Systems segment, we compete with a variety of independent engine manufacturers and generator set assemblers as well as OEMs who manufacture engines for their own products around the world. Our primary competitors are Caterpillar, Inc., MTU (Rolls Royce Power Systems Group) and Kohler/SDMO (Kohler Group), but we also compete with INNIO, Generac, Mitsubishi Heavy Industries and numerous regional generator set assemblers. Our alternator business competes globally with Leroy Somer, Marathon Electric and Meccalte, among others.\nAccelera Segment \nThe Accelera segment designs, manufactures, sells and supports electrified power systems with innovative components and subsystems, including battery, fuel cell and electric powertrain technologies as well as hydrogen production technologies. The Accelera segment is currently in the early stages of commercializing these technologies with efforts primarily focused on the development of electrified power systems and related components and subsystems and our electrolyzers for hydrogen production. \nWe anticipate our customer base for Accelera offerings will be highly diversified, representing multiple end markets with a broad range of application requirements. This includes new markets, like the growing green hydrogen market, which we serve with our leading hydrogen production technologies. We will continue to pursue relationships in markets as they adopt electric and hydrogen solutions. \nIn the markets served by the Accelera segment, we compete with battery and emerging fuel cell companies, powertrain component manufacturers, vertically integrated OEMs and entities providing hydrogen production solutions. Our primary competitors include Daimler, PACCAR, Traton, BYD Company Limited, Dana Incorporated, BorgWarner Inc., Nel ASA, Siemens Energy, Thyssenkrupp and Plug Power Inc.\nJOINT VENTURES, ALLIANCES AND NON-WHOLLY-OWNED SUBSIDIARIES\nWe entered into a number of joint venture agreements and alliances with business partners around the world. Our joint ventures are either distribution or manufacturing entities. We also own controlling interests in non-wholly-owned manufacturing and distribution subsidiaries.\nIn the event of a change of control of either party to certain of these joint ventures and other strategic alliances, certain consequences may result including automatic termination and liquidation of the venture, exercise of \"put\" or \"call\" rights of ownership by the non-acquired partner, termination or transfer of technology license rights to the non-acquired partner and increases in component transfer prices to the acquired partner. We will continue to evaluate joint venture and partnership opportunities in order to penetrate new markets, develop new products and generate manufacturing and operational efficiencies.\nFinancial information about our investments in joint ventures and alliances is incorporated by reference from NOTE 3, \"INVESTMENTS IN EQUITY INVESTEES,\" to our \nConsolidated Financial Statements. \n9\nTable of Contents\nOur equity income from these investees was as follows:\nYears ended December 31,\nIn millions\n2024\n2023\n2022\nManufacturing entities\n \n \n \n \n \n \nDongfeng Cummins Engine Company, Ltd.\n$\n66\n \n22\n \n%\n$\n65 \n19 \n%\n$\n45 \n20 \n%\nChongqing Cummins Engine Company, Ltd.\n60\n \n20\n \n%\n36 \n11 \n%\n32 \n14 \n%\nBeijing Foton Cummins Engine Co., Ltd.\n42\n \n14\n \n%\n47 \n14 \n%\n37 \n17 \n%\nTata Cummins, Ltd.\n31\n \n10\n \n%\n29 \n9 \n%\n27 \n12 \n%\nAll other manufacturers\n25\n \n(1)\n9\n \n%\n91 \n27 \n%\n28 \n(2)\n12 \n%\nDistribution entities\nKomatsu Cummins Chile, Ltda.\n55\n \n19\n \n%\n55 \n16 \n%\n44 \n20 \n%\nAll other distributors\n17\n \n6\n \n%\n16 \n4 \n%\n11 \n5 \n%\nCummins share of net income \n(3)\n$\n296\n \n100\n \n%\n$\n339 \n100 \n%\n$\n224 \n100 \n%\n(1)\n Included a $17 million impairment of our joint ventures in the fourth quarter of 2024 related to our Accelera strategic reorganization actions. See NOTE 22, \"ACCELERA STRATEGIC REORGANIZATION ACTIONS,\" to our \nConsolidated Financial Statements\n for additional information.\n(2) \nIncluded a $28 million impairment of our joint venture with KAMAZ and $3 million of royalty charges as part of our costs associated with the indefinite suspension of our Russian operations. See NOTE 24, \"RUSSIAN OPERATIONS,\" to our \nConsolidated Financial Statements\n for additional information.\n(3)\n This total represents our share of net income of our equity investees and is exclusive of royalties and interest income from our equity investees. To see how this amount reconciles to equity, royalty and interest income from investees in our \nConsolidated Statements of Net Income\n, see NOTE 3, \"INVESTMENTS IN EQUITY INVESTEES,\" to our \nConsolidated Financial Statements \nfor additional information\n.\nManufacturing Entities\nOur manufacturing joint ventures were generally formed with customers and are primarily intended to allow us to increase our market penetration in geographic regions, reduce capital spending, streamline our supply chain management and develop technologies. Our largest manufacturing joint ventures are based in China and are included in the list below. Our engine manufacturing joint ventures are supplied by our Components segment in the same manner as it supplies our wholly-owned Engine segment and Power Systems segment manufacturing facilities. Our Components segment joint ventures and wholly-owned entities provide axles, drivelines, brakes and suspension systems for commercial diesel and natural gas applications, aftertreatment systems, turbochargers, fuel systems, valvetrain technologies, automated transmissions and electronics that are used with our engines as well as some competitors' products. The results and investments in our joint ventures in which we have 50 percent or less ownership interest (except for ECJV, which is consolidated due to our majority voting interest) discussed below are included in equity, royalty and interest income from investees and investments and advances related to equity method investees in our \nConsolidated Statements of Net Income\n and \nConsolidated Balance Sheets\n, respectively.\n \n•\nDongfeng Cummins Engine Company, Ltd. - \nDongfeng Cummins Engine Company, Ltd. (DCEC) is a joint venture in China with Dongfeng Automotive Co. Ltd., a subsidiary of Dongfeng Motor Corporation and one of the largest medium-duty and heavy-duty truck manufacturers in China. DCEC produces 3.9 liter to 14.5 liter diesel engines with a power range from 80 to 760 horsepower, natural gas engines and automated transmissions. On-highway engines are used in multiple applications in light-duty and medium-duty trucks, special purpose vehicles, buses and heavy-duty trucks with a main market in China. Off-highway engines are used in a variety of construction, power generation, marine and agriculture markets in China. \n•\nChongqing Cummins Engine Company, Ltd. - \nChongqing Cummins Engine Company, Ltd. is a joint venture in China with Chongqing Machinery and Electric Co. Ltd. This joint venture manufactures several models of our heavy-duty and high-horsepower diesel engines primarily serving the industrial and stationary power markets in China.\n•\nBeijing Foton Cummins Engine Co., Ltd. - \nBeijing Foton Cummins Engine Co., Ltd. is a joint venture in China with Beiqi Foton Motor Co., Ltd., a commercial vehicle manufacturer, which has two distinct lines of business - a light-duty business and a heavy-duty business. The light-duty business produces our families of ISF 2.5 liter to 4.5 liter high performance light-duty diesel engines in Beijing. These engines are used in light-duty and medium-duty commercial trucks, pick-up trucks, buses, multipurpose and sport utility vehicles with main markets in China and Brazil. Certain types of small construction equipment and industrial applications are also served by these engine families. The heavy-duty business produces 7.0 liter to 14.5 liter high performance heavy-duty diesel and natural gas engines in Beijing. Certain types of construction equipment and industrial applications are also served by these engine families.\n10\nTable of Contents\n•\nTata Cummins, Ltd. - \nTata Cummins, Ltd. is a joint venture in India with Tata Motors Ltd., the largest automotive company in India and a member of the Tata group of companies. This joint venture manufactures Cummins' 3.8 to 8.9 liter diesel and natural gas engines in India with a power range from 75 to 400 horsepower for use in trucks and buses manufactured by Tata Motors, as well as for various on-highway, industrial and power generation applications for Cummins.\nIn September 2023, our Accelera business signed an agreement to form a joint venture, Amplify Cell Technologies LLC, with Daimler Truck, PACCAR and EVE Energy to accelerate and localize battery cell production and the battery supply chain in the U.S., including building a 21-gigawatt hour battery production facility in Marshall County, Mississippi. The joint venture will manufacture battery cells for electric commercial vehicles and industrial applications. The joint venture received all government approvals and began operations in May 2024, but is not expected to begin production until 2027. The joint venture meets the definition of a variable interest entity since the equity-at-risk is not currently sufficient to support the future operations of the joint venture. Accelera, Daimler Truck and PACCAR each own 30 percent of the joint venture and have two board positions, while EVE Energy owns 10 percent and has one board position. All significant decisions require majority or super-majority approval of the board. As a result, we are not the primary beneficiary of the joint venture, and the joint venture is not consolidated. We account for the joint venture using the equity method. As of December 31, 2024, we had contributed $211 million, and our maximum remaining required contribution to the joint venture was $619 million, which could be reduced by future government incentives received by the joint venture. In addition, we are required to purchase 33 percent of the joint venture's output in the future or be subject to certain penalties. \nDistribution Entity\nKomatsu Cummins Chile, Ltda. - \nKomatsu Cummins Chile, Ltda. is a joint venture with Komatsu America Corporation. The joint venture is a distributor that offers the full range of our products and services to customers and end-users in Chile and Peru. See further discussion of our distribution network under the Distribution segment section above.\nNon-Wholly-Owned Subsidiaries\n•\nEaton Cummins Automated Transmission Technologies\n - We have a majority voting interest in ECJV by virtue of a tie-breaking vote on the joint venture’s board of directors. ECJV develops and supplies automated transmissions for the heavy-duty commercial vehicle markets in North America and China.\n•\nCummins India Ltd. \n- We have a controlling interest in Cummins India Ltd. (CIL), which is a publicly listed company on various stock exchanges in India. CIL produces medium-duty, heavy-duty and high-horsepower diesel engines and generators for the Indian and export markets and natural gas spark-ignited engines for power generation, automotive and industrial applications. CIL also has distribution and power generation operations.\nSUPPLY\nThe performance of the end-to-end supply chain, extending through to our suppliers, is foundational to our ability to meet customers' expectations and support long-term growth. We are committed to having a robust strategy for how we select and manage our suppliers to enable a market focused supply chain. This requires us to continuously evaluate and upgrade our supply base, as necessary, as we strive to ensure we are meeting the needs of our customers.\nWe use a combination of proactive and reactive methodologies to enhance our understanding of supply base risks, which guide the development of risk monitoring and sourcing strategies. We use a process that groups products or services into categories based on similar characteristics, which helps us align our purchasing goals with overall business objectives (Category Strategy Framework). Our Category Strategy Framework process supports the review of our long-term needs and guides decisions on what we make internally and what we purchase externally. For externally purchased items, the strategies also identify the suppliers we should consider for long-term supply agreements to provide the best technology, the lowest total cost and highest supply chain performance. We design and/or manufacture our strategic components used in or with our engines, power generation units, drivetrain and braking systems and Accelera products. Key suppliers are managed through long-term supply agreements that seek to secure capacity, delivery and quality\n \nand to assure cost requirements are met over an extended period. \nOther important elements of our sourcing strategy include the following:\n•\nexpanding risk management scope to include sub-tier value chain suppliers for critical components; \n•\nbroadening dual and multi-sourcing where applicable;\n•\nselecting and managing suppliers to comply with our Supplier Code of Conduct; and\n•\nassuring our suppliers comply with our prohibited and restricted materials policy.\n11\nTable of Contents\nDisruption risk in certain categories of our supply chains exist and could negatively impact our ability to meet customer demand. We continue to monitor the supply chain disruptions utilizing early detection methods complemented by structured supplier risk and resiliency assessments. We increased frequency of formal and informal supplier engagement to address potentially impactful supply base constraints and enhanced collaboration to develop specific countermeasures to mitigate risks. \nPATENTS AND TRADEMARKS\nWe own or control a significant number of patents and trademarks relating to the products we manufacture. These patents and trademarks were granted and registered over a period of years. Although these patents and trademarks are generally considered beneficial to our operations, we do not believe any patent, group of patents or trademark (other than our leading brand house trademarks) is significant to our business.\nSEASONALITY\nWhile individual product lines may experience modest seasonal variation in production, there is no material effect on the demand for the majority of our products on a quarterly basis.\nLARGEST CUSTOMERS\nWe have thousands of customers around the world and have developed long-standing business relationships with many of them. PACCAR is our largest customer, accounting for 16 percent of our consolidated net sales in 2024, 16 percent in 2023 and 16 percent in 2022. We have long-term supply agreements with PACCAR for our heavy-duty and medium-duty engines and aftertreatment systems. While a significant number of our sales to PACCAR are under long-term supply agreements, these agreements provide for particular engine requirements for specific vehicle models and not a specific volume of engines or aftertreatment systems. PACCAR is our only customer accounting for more than 10 percent of our net sales in 2024. The loss of this customer or a significant decline in the production level of PACCAR vehicles that use our engines would have an adverse effect on our results of operations and financial condition. We have supplied engines to PACCAR for 80 years. A summary of principal customers for each operating segment is included in our segment discussion.\nIn addition to our agreement with PACCAR, we have long-term heavy-duty and medium-duty engine and aftertreatment system supply agreements with Traton and Daimler. We also have an agreement with Stellantis to supply engines and aftertreatment products for its pick-up truck applications. Collectively, our net sales to these four customers, including PACCAR, were 36 percent of our consolidated net sales in 2024, 37 percent in 2023 and 36 percent in 2022. Excluding PACCAR, net sales to any single customer were less than 9 percent of our consolidated net sales in 2024, less than 9 percent in 2023 and less than 8 percent in 2022. These agreements contain standard purchase and sale agreement terms covering engine, aftertreatment and engine parts pricing, quality and delivery commitments, as well as engineering product support obligations. The basic nature of our agreements with OEM customers is that they are long-term price and operations agreements that help provide for the availability of our products to each customer through the duration of the respective agreements. Agreements with most OEMs contain bilateral termination provisions giving either party the right to terminate in the event of a material breach, change of control or insolvency or bankruptcy of the other party. \nBACKLOG\nDisruption risk in certain categories of our supply chains exist and could negatively impact our ability to meet customer demand. We have supply agreements with some truck and off-highway equipment OEMs and firm orders from data center and electrolyzer customers, however a large portion of our business is transacted through open purchase orders. Many of these open orders are historically subject to month-to-month releases and are subject to cancellation on reasonable notice without cancellation charges and therefore are not considered firm. We continue to work closely with our suppliers and customers to meet the demand.\nRESEARCH AND DEVELOPMENT\nIn 2024, we continued to invest in future critical technologies and products. We will continue to make investments to develop new products and improve our current technologies to meet future emission standards around the world, improvements in fuel economy performance of diesel and natural gas-powered engines and related components, as well as development activities around electrified power systems with innovative components and systems including battery and electric power technologies and hydrogen production technologies.\nOur research and development programs are focused on product improvements, product extensions, innovations and cost reductions for our customers. Research and development expenditures include salaries, contractor fees, building costs, utilities, testing, technical IT expenses, administrative expenses and allocation of corporate costs and are expensed, net of contract reimbursements, when incurred. From time to time, we enter into agreements with customers and government agencies to fund a portion of the research and development costs of a particular project. When not associated with a sales contract, we generally account for these reimbursements as an offset to the related research and development expenditure. Research and development expenses, net of contract reimbursements, \n12\nTable of Contents\nwere $1.4 billion in 2024, $1.4 billion in 2023 and $1.2 billion in 2022. Contract reimbursements were $72 million, $81 million and $110 million in 2024, 2023 and 2022, respectively. \nENVIRONMENTAL SUSTAINABILITY \nWe are committed to making people's lives better by powering a more prosperous world. That prosperity includes strong communities, robust business and environmental sustainability. \nOur Board of Directors (the Board) and the senior management team oversee our top risks, while the Enterprise Risk Management program gives the Board and senior management a framework to help them understand, identify, assess, manage and monitor risks so we can meet our strategic objectives. The Board is ultimately responsible for assessing and managing climate-related risks and opportunities. Managing risk effectively is on the agenda at every regular board meeting, and the Board reviews the entire Enterprise Risk Management program and the results of our latest enterprise risk assessment each year. As climate-related risks affect all aspects of the business, the enterprise risks incorporate, where relevant, climate-related aspects, with a separate stand-alone enterprise risk on climate change.\nThe Safety, Environment and Technology (SET) committee provides overall guidance and insight on major environmental sustainability initiatives such as our environmental sustainability strategy, as well as environmental management at our facilities and operations. \nIn 2019, we introduced our current environmental sustainability strategy focused on three priority areas: addressing climate change and air emissions, using natural resources in the most sustainable way and improving communities. Additional commitments followed including Cummins Water Works, our program for strengthening communities through sustainable water and addressing the global water crisis, and Destination Zero, our long-term product decarbonization strategy. \nThe environmental sustainability strategy includes nine specific goals to achieve by 2030, including science-based greenhouse gas (GHG) reduction targets for newly sold products and facilities, as well as aspirational targets for 2050. We started reporting progress on these nine goals, most of which have a baseline year of 2018, in 2022. Key actions in 2024 included completing the planned capital spending to meet the 2030 facility reduction goals for GHG emissions, water and waste; improving GHG measurement and modeling for product emissions; and identifying technology portfolio opportunities toward progress of product GHG reduction. In 2024, we also initiated a planned midpoint review of our 2030 sustainability goals. This review reflected standard governance practices to ensure our metrics, scope and strategies remain aligned with evolving conditions and our long-term objectives. Our commitment to progress remains steadfast, and we anticipate sharing any updates or adjustments to these goals in 2025.\nThe nine goals for 2030 are as follows:\n•\nReduce absolute GHG emissions from facilities and operations by 50 percent.\n•\nReduce scope three absolute lifetime GHG emissions from newly sold products by 25 percent.\n•\nPartner with customers to reduce scope three GHG emissions from products in the field by 55 million metric tons.\n•\nReduce volatile organic compounds emissions from paint and coating operations by 50 percent.\n•\nCreate a circular lifecycle plan for every part to use less, use better, use again.\n•\nGenerate 25 percent less waste in facilities and operations as percent of revenue.\n•\nReuse or responsibly recycle 100 percent of packaging plastics and eliminate single-use plastics in dining facilities, employee amenities and events.\n•\nReduce absolute water consumption in facilities and operations by 30 percent.\n•\nProduce net water benefits that exceed our annual water use in all our regions.\nOur most recent Sustainability Progress Report and previous reports are available on our website at www.cummins.com/company/esg/sustainability-progress-reports. Our annual submission to the Carbon Disclosure Project (CDP) for climate and water is also available on our website. The CDP climate submission provides information on our scenario planning for climate and other risks, as well as detailed emissions data as requested by CDP. We also published a report in accordance with the Task Force on Climate-Related Financial Disclosures framework. These reports are not incorporated into this Form 10-K by reference. \nWe continue to articulate our positions on key public policy issues and on a wide range of environmental issues. We are actively engaged around the world to promote science-based climate policies by working with regulatory, industry and other stakeholders, including joining advocacy groups and testifying before legislators and regulators. We will continue to work in partnership with others to advocate for tough, clear and enforceable regulations around the globe to address air and GHG emissions. \n13\nTable of Contents\nENVIRONMENTAL COMPLIANCE \nSettlement Agreements \nIn December 2023, we announced that we reached an agreement in principle with the EPA, CARB, DOJ and the California Attorney General’s Office to resolve certain regulatory civil claims regarding our emissions certification and compliance process for certain engines primarily used in pick-up truck applications in the U.S., which became final and effective in April 2024, (collectively, the Settlement Agreements). As part of the Settlement Agreements, among other things, we agreed to pay civil penalties, complete recall requirements, undertake mitigation projects, provide extended warranties, undertake certain testing, take certain corporate compliance measures and make other payments. Failure to comply with the terms and conditions of the Settlement Agreements subjects us to stipulated penalties. We recorded a charge of $2.0 billion in the fourth quarter of 2023 to resolve the matters addressed by the Settlement Agreements involving approximately one million of our pick-up truck applications in the U.S. This charge was in addition to the previously announced charges of $59 million for the recalls of model years 2013 through 2018 RAM 2500 and 3500 trucks and model years 2016 through 2019 Titan trucks. We made\n \n$1.9 billion of payments required by the Settlement Agreements in the second quarter of 2024. Subsequent to the second quarter of 2024, we have recorded immaterial amounts related to stipulated penalties we determined to be probable and estimable. Any further non-compliance with the Settlement Agreements will likely subject us to further stipulated penalties and other adverse consequences.\nWe have also been in communication with other non-U.S. regulators regarding matters related to the emission systems in our engines and may also become subject to additional regulatory review in connection with these matters.\nIn connection with our announcement of our entry into the agreement in principle, we became subject to shareholder, consumer and third-party litigation regarding the matters covered by the Settlement Agreements, and we may become subject to additional litigation in connection with these matters. See NOTE 14, \"COMMITMENTS AND CONTINGENCIES,\" to our \nConsolidated Financial Statements. \nProduct Certification and Compliance \nOur products are subject to extensive statutory and regulatory requirements worldwide that directly or indirectly impose standards governing emissions and noise. Over the past several years, we have increased our global environmental compliance presence and expertise to understand and meet emerging product environmental regulations around the world. Our ability to comply with these and future emission standards is an essential element in maintaining our leadership position in regulated markets. \nWe strive to be a leader in developing and implementing technologies that provide customers with the highest performing products while minimizing the impact on the environment, and we have a long history of working with governments and regulators to achieve these goals. We remain committed to ensuring our products meet all current and future emission standards and delivering value to our customers.\nAnnounced in late 2019 and launched in early 2020, the Product Compliance and Regulatory Affairs team leads both engine emissions certification and compliance and regulatory affairs initiatives and provides updates to the SET Committee of the Board at least annually. This organization is led by the Vice President - Product Compliance and Regulatory Affairs and reports directly to the Chief Administrative Officer and the Chief Executive Officer (CEO) for product emissions matters. The focus of this organization is to strengthen our ability to design great products that help our customers win while complying with increasingly challenging global emission regulations. The organization also works to enhance our collaboration with the agencies setting the direction and regulations of emissions as we strive to meet every expectation today while planning for future changes.\nOther Environmental Statutes and Regulations \nExpenditures for environmental control activities and environmental remediation projects at our facilities in the U.S. were not a substantial portion of our annual expenses and are not expected to be material in 2025. We believe we are in compliance in all material respects with laws and regulations applicable to our plants and operations.\nIn the U.S., pursuant to notices received from federal and state agencies and/or defendant parties in site environmental contribution actions, we were identified as a potentially responsible party under the Comprehensive Environmental Response, Compensation and Liability Act of 1980, as amended or similar state laws, at fewer than 20 manufacturing and waste disposal sites. \nBased upon our experiences at similar sites we believe that our aggregate future remediation costs will not be material. We have established accruals that we believe are adequate for our expected future liability with respect to these sites. In addition, we have several other sites where we are working with governmental authorities on remediation projects. The costs for these remediation projects are not expected to be material.\n14\nTable of Contents\nHUMAN CAPITAL RESOURCES \nAt December 31, 2024, we employed approximately 69,600 persons worldwide. Approximately 22,000 of our employees worldwide were represented by various unions under collective bargaining agreements that expire between 2025 and 2029.\nThroughout our more than 100-year history, we have always recognized that people drive the strength of our business and our ability to effectively serve our customers and sustain our competitive position. We are focused on harmonizing our approach to talent to provide seamless opportunities and better experiences to our employees around the world. Our workforce strategy aims to cultivate an environment where all employees, regardless of employee type and location, know what is expected of them, are rewarded for their performance based on fair and equitable reviews, and have access to differentiated experiences, tools and leadership coaching to help them develop. This strategy is anchored on developing authentic and capable leaders, building effective organizations, driving employee engagement, furthering our company values of caring, integrity, excellence, teamwork and diversity and inclusion, delivering quality experiences and providing benefits that advance the well-being of our people and their families. \nLeadership and Talent Development\nDeveloping our human capital resources is a key focus for us. The Board remains resolute in overseeing this focus and providing guidance to our leadership team, through a committed Talent Management Compensation Committee. \nWe strive to create a leadership culture that begins with self-aware and capable leaders creating an environment in which all employees can thrive and reach their full potential. We encourage leaders to connect our people and their work to our mission, vision, values, brand promise and growth strategy, thus, motivating employees and hopefully helping them feel a higher sense of purpose in their contributions.\nWe have designed leadership and talent development programs for employees ranging from the manufacturing floor and technicians through to middle management and executives. We are promoting a learning culture by providing employees and their managers with tools and resources to have meaningful development conversations, envision and plan their careers, thrive in their work and navigate in a large global organization. Through our talent strategy, our goal is to provide all employees with equitable access to the development and career opportunities that a global company, like Cummins, enables. \nCompetitive Pay and Benefits\nTo attract and retain the best employees, we focus on providing progressive, competitive pay and benefits. Our programs target the market for competitiveness and sustainability while ensuring that we honor our core values. We provide benefit programs with the goal of improving the physical, mental, emotional, social and financial wellness of our employees throughout their lifetime. Some examples include base and variable pay, healthcare programs, paid time off, flexible work, retirement saving plans and employee stock purchase plans.\nWhen designing our base pay ranges, we conduct market analyses to ensure our ranges are competitive and our employees are advancing their earning potential. We also perform annual compensation studies to assess market movement, pay equity and living wages. We review wages globally as we continuously work to ensure we are fair, equitable, competitive and can attract and retain the best talent. \nWe also provide an array of benefits as part of our total rewards program that are aligned with our values and focused on supporting employees and their families based on their unique needs, some of which include the following: healthcare plans that are tiered by salary, to ensure affordability to all of our employees; paid parental leave for primary and secondary caregivers; travel benefits and advanced medical services to support complex health care needs; global employee assistance programs; and a global mental health program, all designed to support employees on the journey to well-being.\nEmployee Safety and Wellness \nCummins is committed to being world-class in health and safety. We are committed to removing conditions that cause personal injury or occupational illness, and we make decisions and promote behaviors that protect employees from risk of injury. We publicly disclose metrics on our rate of recordable injuries, our rate of lost workdays due to injury, rate of ergonomic injuries and rate of potentially serious injuries and fatalities. \nSince 2020, we have taken many steps in the employee safety and wellness area including the following:\n•\nExecuted robust safety protocols for essential on-site personnel.\n•\nImplemented remote and hybrid work environments, where possible, to give employees flexibility to work off-site. As part of this effort, we provide remote ergonomic evaluations and support to help employees create off-site workspaces that are safe.\n15\nTable of Contents\n•\nProvided high-quality clinical services at onsite and near-site medical clinics at several locations across the globe to support employee health and well-being.\n•\nLaunched a global mental health campaign to destigmatize and normalize conversations about mental health, promote mental well-being, encourage employees and their families to seek help when needed and promote company-provided resources. This campaign has been extended to include physical, emotional, financial and social pillars of well-being. \nDiversity and Inclusion\nAt Cummins, our commitment to inclusion dates back more than a half-century and continues to be core to our fabric and continued success. We leverage the strength of our broadly diverse, global workforce to drive innovation and business results and deliver superior solutions for our customers and communities. We do this through our commitment to fostering an accountable culture that champions our vision of a workforce mirroring the communities we serve. This commitment starts at the top with our Board and permeates throughout our organization as everyone plays a role in nurturing inclusive environments where all employees can reach their full potential and thrive.\nOur strong focus on cultivating an inclusive culture underscores our belief that a diverse and inclusive workforce is a core value and competitive advantage for Cummins. This focus dates back to the early 1970s as reflected in a public statement made by our former Chairman, J. Irwin Miller:\n\"Character, ability and intelligence are not concentrated in one sex over the other, nor in persons with certain accents or in certain races or in persons holding degrees from universities over others. When we indulge ourselves in such irrational prejudices, we damage ourselves most of all and ultimately assure ourselves of failure in competition with those more open and less biased.\"\nOur long-standing commitment to diversity and inclusion is consistent with our commitment to follow the law everywhere, including, without limitation, complying with U.S. and global laws and regulations related to civil rights and anti-discrimination.  We believe that we are in compliance with such laws and regulations in all material respects.  \nFor more information on the topics above and our management of our human capital resources, please go to sustainability.cummins.com. Information from our sustainability report and sustainability webpage is not incorporated by reference into this filing.\nAVAILABLE INFORMATION\nWe file annual, quarterly and current reports, proxy statements and other information electronically with the Securities and Exchange Commission (SEC). The SEC maintains an internet site that contains annual, quarterly and current reports, proxy and information statements and other information that Cummins files electronically with the SEC. The SEC's internet site is www.sec.gov.\nOur internet site is www.cummins.com. You can access our Investors and Media webpage through our internet site, by hovering on the heading \"Company\" and selecting \"Investor Relations\" link under the \"About Us\" section. We make available, free of charge, on or through our Investors and Media webpage, our proxy statements, annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to those reports filed or furnished pursuant to the Securities Exchange Act of 1934 or the Securities Act of 1933, each, as amended, as soon as reasonably practicable after such material is electronically filed with, or furnished to, the SEC.\nWe also have a Corporate Governance webpage. You can access our Governance Documents webpage through our internet site, www.cummins.com, by hovering on the heading \"Company\" and selecting \"Investor Relations\" link under the \"About Us\" section. Next, click on the heading \"Board & ESG\" and select \"Governance Documents\" from the drop-down menu. Code of Conduct, Committee Charters and other governance documents are included at this site. Our Code of Conduct applies to all employees, regardless of their position or the country in which they work. It also applies to the employees of any entity owned or controlled by us. We will post any amendments to the Code of Conduct and any waivers that are required to be disclosed by the rules of either the SEC or the NYSE, on our internet site. The information on our internet site is not incorporated by reference into this report.\n16\nTable of Contents\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS \nFollowing are the names and ages of our executive officers, their positions with us at January 31, 2025, and summaries of their backgrounds and business experience:\nName and Age\n \nPresent Cummins Inc. position and\nyear appointed to position\n \nPrincipal position during the past five years\nother than Cummins Inc. position currently held\nJennifer Rumsey (51)\nChair and Chief Executive Officer (2023)\nPresident and Chief Executive Officer (2022-2023)\nPresident and Chief Operating Officer (2021-2022)\nVice President and President—Components (2019-2020)\nSharon R. Barner (67)\n \nVice President—Chief Administrative Officer (2021)\nVice President—Chief Administrative Officer and Corporate Secretary (2021-2023)\nVice President—General Counsel and Corporate Secretary (2020-2021)\nVice President—General Counsel (2012-2020)\nMarvin Boakye (51)\nVice President—Chief Human Resources Officer (2022)\nChief People and Diversity Officer—Papa John's International (2019-2022)\nJenny M. Bush (50)\nVice President and President—Power Systems (2022)\nVice President—Cummins Sales & Service North America (2017-2022)\nAmy R. Davis (55)\nVice President and President—Accelera and Components (2023)\nVice President and President—Accelera (2020-2023)\nVice President—Cummins Filtration (2018-2020)\nBonnie Fetch (54)\nVice President and President—Distribution Business (2024)\nVice President—Global Supply Chain and Manufacturing (2022-2023)\nVice President—DBU Supply Chain Services (2020-2022)\nExecutive Director, Supply Chain—DBU (2018-2020)\nNicole Y. Lamb-Hale (58)\n \nVice President—Chief Legal Officer and Corporate Secretary (2023)\nVice President—Chief Legal Officer (2022-2023)\nVice President—General Counsel (2021-2022)\nManaging Director and Washington, DC City Leader—Kroll (2020-2021)\nManaging Director—Kroll (2016-2020)\nBrett Merritt (48)\nVice President and President—Engine Business (2024)\nVice President—On-Highway Engine Business and Vice President of Strategic Customer Relations (2023)\nVice President—On-Highway Engine Business (2017-2023)\nSrikanth Padmanabhan (60)\nExecutive Vice President and President—Operations (2024)\nVice President and President—Engine Business (2016-2023)\nMark A. Smith (57)\nVice President—Chief Financial Officer (2019)\nNathan R. Stoner (47)\n \nVice President—China ABO (2020)\n \nGeneral Manager—Partnerships and EBU China Joint Venture Business (2018-2020)\nJeffrey T. Wiltrout (44)\nVice President—Corporate Strategy (2022)\nExecutive Director—Corporate Development (2021-2022)\nStrategy Director—Power Systems Business Unit (2018-2021)\nJonathan Wood (54)\nVice President—Chief Technical Offer (2023)\nVice President—New Power Engineering (2021-2023)\nVice President—Components Engineering (2018-2021)\nOur Chair and CEO is elected annually by the Board and holds office until the meeting of the Board at which her election is next considered. Other officers are appointed by the Chair and CEO, are ratified by the Board and hold office for such period as the Chair and CEO or the Board may prescribe.\n17\nTable of Contents"
}