{
  "ticker": "CNC",
  "cik": "0001071739",
  "company_name": "CENTENE CORP",
  "filing_date": "2025-02-18",
  "accession": "0001071739-25-000027",
  "primary_doc": "cnc-20241231.htm",
  "item1_text": "Item 1. \nBusiness\nOVERVIEW\nOur mission is to transform the health of the communities we serve, one person at a time. Centene is a leading healthcare enterprise that is committed to helping people live healthier lives. The Company takes a local approach – with local brands and local teams – to provide fully integrated, high-quality and cost-effective services to government-sponsored and commercial healthcare programs, focusing on under-insured and uninsured individuals. Centene offers affordable and high-quality products to more than 1 in 15 individuals across the nation, including Medicaid and Medicare members (including Medicare Prescription Drug Plans) as well as individuals and families served by the Health Insurance Marketplace.\nCentene provides access to high-quality healthcare, innovative programs and a wide range of health solutions that help families and individuals get well, stay well and be well. Our uniquely local approach – with local brands and local teams who live in, care about and directly influence the communities they serve – is a key differentiator in our ability to provide access to quality care to our members. Centene treats the whole person, an approach that is delivered locally and backed by the scale of Centene's expertise, data and resources. Through this approach and our commitment to sustainable partnerships, we work with local community organizations to realize our mission of transforming the health of the communities we serve, one person at a time.\nWe are focused on making strategic decisions and investments to create additional value in the short-term and to seek opportunities that position the organization for long-term strength, profitability, growth and innovation. In addition to creating shareholder value, we are modernizing and improving how we work in order to propel our organization to new levels of success and elevate the member and provider experiences.\nDuring 2024, we operated in four segments: Medicaid, Medicare, Commercial and Other. \n•\nMedicaid - \nincludes the Temporary Assistance for Needy Families (TANF) program; Medicaid Expansion programs; the Aged, Blind or Disabled (ABD) program; the Children's Health Insurance Program (CHIP); Long-Term Services and Supports (LTSS); Foster Care; Medicare-Medicaid Plans (MMP), which cover beneficiaries who are dually eligible for Medicaid and Medicare; and other state-based programs.\n•\nMedicare - \nincludes Medicare Advantage, Medicare Supplement, Dual Eligible Special Needs Plans (D-SNPs) and Medicare Prescription Drug Plans (PDP), also known as Medicare Part D.\n•\nCommercial - \nincludes the Health Insurance Marketplace product along with individual, small group and large group commercial health insurance products.\n•\nOther - \nincludes our pharmacy operations, Envolve Benefit Options' vision and dental services, clinical healthcare, behavioral health, the TRICARE program, and corporate management companies, among others.\nFor the year ended December 31, 2024, our Medicaid, Medicare, Commercial and Other segments accounted for 62%, 14%, 21% and 3%, respectively, of our total external revenues. Our membership totaled 28.6 million as of December 31, 2024. For the year ended December 31, 2024, our total revenues and net earnings attributable to Centene were $163.1 billion and $3.3 billion, respectively, and our total cash flow from operations was $154 million.\nOur initial health plan commenced operations in Wisconsin in 1984. We were organized in Wisconsin in 1993 as a holding company for our initial health plan and reincorporated in Delaware in 2001. Our stock is publicly traded on the New York Stock Exchange under the ticker symbol \"CNC.\"\n1\nTable of Contents\nINDUSTRY AND OPERATIONS\nWe provide a full spectrum of managed healthcare products and services, primarily through Medicaid, Medicare and commercial products.\nMedicaid\nMedicaid is the largest publicly funded program in the United States and provides health insurance to low-income families and individuals with disabilities. Medicaid is funded jointly by federal and state governments, with the majority of funding provided by the federal government and administered by the states. Each state establishes its own eligibility standards, benefit packages, payment rates and program administration within federal standards. As a result, there are 56 Medicaid programs - one for each U.S. state, each U.S. territory and the District of Columbia. Eligibility is based on a combination of household income and assets, often determined by an income level relative to the federal poverty level. Many states have selected Medicaid managed care as a means of delivering quality healthcare and controlling costs.\nMedicaid helps meet the needs of various populations through the following products and programs:\n•\nThe TANF program covers low-income families with children.\n•\nMedicaid Expansion covers all individuals under age 65 with incomes up to 138% of the federal poverty level, subject to each state's election. The federal government pays 90% of the costs for Medicaid Expansion coverage for these beneficiaries.\n•\nThe ABD program covers low-income individuals with chronic physical disabilities or behavioral health impairments. ABD beneficiaries represent a growing portion of all Medicaid recipients and typically utilize more services as a result of their more complicated health status.\n•\nCHIP helps to expand coverage primarily to children whose families earn too much to qualify for Medicaid, yet not enough to afford private health insurance. Historically, children have represented the largest Medicaid eligible population. Costs are primarily composed of pediatrics and family care, which tend to be more predictable than those associated with other healthcare issues predominantly affecting the adult population. \n•\nLTSS is a Medicaid product that covers Institutional/Residential Care (Nursing and Intermediate Care Facilities) and Home and Community Based Services (HCBS) for beneficiaries requiring assistance with their activities of daily living. The largest groups receiving LTSS, by spending, are older individuals and individuals with physical disabilities, followed by individuals with intellectual and developmental disabilities, those with serious mental illness and/or serious emotional disturbance and other populations. States are increasingly turning to managed care as a solution to provide coordinated, holistic care to their LTSS beneficiaries.\n•\nThe majority of children in foster care qualify for Medicaid. The federal government has enacted legislation establishing requirements for state child welfare agencies related to the health and well-being of children in foster care, including the provision of grants and technical assistance to enable states to meet these needs and make explicit connections with Medicaid. In addition, under the ACA, former foster care children are eligible for Medicaid until the age of 26, provided that they turned 18 while in foster care and were enrolled in Medicaid at that time.\n•\nA portion of Medicaid beneficiaries are dual-eligible, low-income seniors and people with disabilities who are enrolled in both Medicaid and Medicare. According to CMS, there were more than 12 million dual-eligible enrollees in 2023. These members may receive assistance from Medicaid for benefits, such as nursing home care, HCBS and/or assistance with Medicare premiums and cost-sharing depending on their income level. Dual-eligibles use more services due to their tendency to have more chronic health issues. We serve dual-eligibles primarily through our ABD, LTSS, MMP and Medicare Advantage D-SNPs lines of business.\n2\nTable of Contents\nWhile Medicaid programs have directed funds to many individuals who cannot afford or otherwise maintain health insurance coverage, they did not initially address the inefficient and costly manner in which the Medicaid population tends to access healthcare. Medicaid recipients in non-managed care programs typically have not sought preventive care or routine treatment for chronic conditions, such as asthma and diabetes. When they do seek care, it is typically fragmented and not coordinated such as seeking healthcare in hospital emergency departments, which is typically more expensive. As a result, many states without managed care programs have found that the costs of providing Medicaid benefits have increased while the medical outcomes for the recipients remained unsatisfactory.\nAccordingly, in an effort to improve quality of care and the affordability of healthcare, the majority of states have mandated that their TANF recipients enroll in managed care plans and many are considering moving to a mandated managed care approach for additional populations and products. CMS estimates the total Medicaid program will grow from $877 billion in 2023 to $1.2 trillion by 2030. Medicaid spending is projected to increase at an average annual rate of 5% between 2023 and 2030. Additionally, approximately 40% of Medicaid spend in 2023 was in Medicaid fee-for-service. Based on these trends, we believe a significant market opportunity exists for managed care organizations (MCOs) with operations and programs focused on the distinct socio-economic, cultural and healthcare needs of the uninsured population and the Medicaid populations.\nWe are the largest Medicaid health insurer in the country, serving 13 million Medicaid recipients in 30 states as of December 31, 2024. Our Medicaid contracts with the states of Florida and New York accounted for approximately 10% or more of our consolidated Medicaid premium revenues individually in the year ended December 31, 2024.\nMedicare\nMedicare is the federal health insurance program for people ages 65 and over, which was expanded to cover people under 65 with certain disabilities and people with end-stage renal disease requiring dialysis or kidney transplant. Medicare consists of four parts, labeled A through D. Part A provides hospitalization benefits financed largely through Social Security taxes and requires beneficiaries to pay out-of-pocket deductibles and coinsurance. Part B provides benefits for medically necessary services and supplies including outpatient care, physician services and home health care. Parts A and B are referred to as Original Medicare.\nAs an alternative to Original Medicare, beneficiaries may elect to receive their Medicare benefits through Part C, also known as Medicare Advantage. Under Medicare Advantage, MCOs contract with CMS to provide services directly to Medicare beneficiaries as well as through employer and union groups. MCOs typically receive fixed monthly premium per member from CMS that varies based upon the county in which the member resides, demographic factors of the member such as age, gender and institutionalized status and the health status of the member. Any benefits that are not covered by Medicare may result in an additional monthly premium charged to the enrollee or through portions of payments received from CMS that may be allocated to these benefits, according to CMS regulations and guidance. Typically, as our Medicare Advantage members reach their deductibles and out-of-pocket maximums, our medical costs rise, creating seasonality in the business with a higher percentage of earnings in the first half of the year.\nThe Congressional Budget Office estimates the total Medicare market will grow from $1.0 trillion in 2023 to $1.6 trillion by 2030. Medicare spending is estimated to have increased 6% in fiscal 2024 and is projected to increase at an average annual rate of 7% between 2023 and 2030. Over 40% of Medicare spend in 2023 was in Medicare fee-for-service, representing a notable market opportunity to increase penetration of the Medicare Advantage products.\nAs of December 31, 2024, we served 1.1 million Medicare Advantage members across 37 states, primarily under the brand name Wellcare, with the highest concentration of lower-income, complex members compared to our peers. Revenues from CMS are significant to the segment. Consistent with our strategy, we have reduced our Medicare Advantage footprint to 32 states as of January 1, 2025.\n3\nTable of Contents\nDual-Eligible Alignment\nRecently finalized CMS regulations are promoting greater alignment and integration for dual-eligible members across both programs, whereby full dual beneficiaries would be enrolled under the same company's Medicaid and Medicare plan, improving the quality of care and overall member experience. With over 70% of the approximately 12 million fully-eligible duals population not in fully-integrated coverage arrangements, we see significant opportunity to advance care management, improve member engagement and improve the affordability of healthcare through this process. D-SNPs offer various levels of integration of benefits, care coordination (e.g., care management), and processes (e.g., appeals and grievances, claims, materials) depending on the plan type. Fully Integrated Dual Eligible (FIDE) plans provide Medicaid and Medicare benefits, including LTSS and/or behavior health through one plan under one legal entity. Highly Integrated Dual Eligible (HIDE) plans can offer Medicaid and Medicare benefits from different plans under different legal entities owned by the same parent organization. These HIDE plans have some differences in the Medicaid benefit offering requirements compared to FIDE plans. Lastly, Coordination-Only Dual Eligible plans can coordinate care with Medicaid fee-for-service or Medicaid MCOs from different parent organizations and in some states can also serve partial dual-eligibles who do not receive full Medicaid benefits. Accordingly, we have been refining our Medicare footprint to overlap more closely with our Medicaid presence to provide D-SNP offerings that support alignment.\nNewly finalized CMS regulations will require beneficiaries dually enrolled in Medicare and in a Medicaid managed care plan to receive integrated care through the Medicaid company's Medicare Advantage D-SNPs beginning in 2030, with certain restrictions beginning in 2027. We believe we are positioned well given our overlapping Medicaid and Medicare Advantage footprints and we will continue to place enterprise-level focus on the D-SNP opportunity to drive long-term growth.\nMedicare Prescription Drug Plan\nMedicare prescription drug coverage, or Medicare Part D, is a voluntary benefit for Medicare beneficiaries. The Medicare Part D prescription drug benefit is supported by risk sharing with the federal government through risk corridors designed to limit the losses and gains of the participating drug plans and by providing a portion of reinsurance for catastrophic drug costs. The government subsidy is based on the national weighted average monthly bid for this coverage, adjusted for risk factor payments. Additional subsidies are provided for dually eligible beneficiaries and specified low-income beneficiaries.\nMCOs contract with CMS to serve as plan sponsors offering stand-alone Medicare Part D PDPs to Medicare-eligible beneficiaries. PDPs offer national in-network prescription drug coverage, and may include a preferred pharmacy network, subject to limitations in certain circumstances. Unless CMS is notified of non-renewal and the non-renewal is effectuated by not filing a bid in June, Medicare Advantage and PDP contracts with CMS are renewed for successive one-year terms each September. Should CMS decide not to renew a contract, CMS must notify MCOs on or before August 1, and the plan would be terminated effective December 31 of that year. Our 2025 PDP bids resulted in 33 of the 34 CMS regions for which we were below the benchmarks and one region for which we were above the benchmark, compared to 30 of 34 CMS regions for which we were below the benchmark for the 2024 PDP bids.\nThe Inflation Reduction Act (IRA) significantly changes Medicare PDPs in 2025, most notably by eliminating the coverage gap and capping members' annual out-of-pocket cost at $2,000 in order to provide more predictable and affordable prescription drug coverage for Medicare beneficiaries. The IRA changes effective for 2025 result in a meaningful shift in cost-sharing responsibilities between members, drug companies, CMS, and PDPs and will result in a significant increase in our premiums in consideration for our PDPs responsibility for a larger portion of total Part D benefit costs. \nWe served 6.9 million members as of December 31, 2024, the country's largest PDP carrier. We began providing PDP coverage in 2006 and offer stand-alone PDPs in 50 states and the District of Columbia with a priority on plans that offer low premiums, deductibles, and cost sharing. \nCommercial\nWe offer commercial health insurance products to individuals through the ACA Health Insurance Marketplace, and through large and small employer groups. These plans offer differing benefit designs and varying levels of co-payments at different premium rates. These plans facilitate access to healthcare services for our members through network contracts with physicians, hospitals and other providers. Coverage typically is subject to copays and can also be subject to deductibles and coinsurance. As our commercial members reach their deductibles and out-of-pocket maximums, our medical costs rise, creating seasonality in the business with a higher percentage of earnings in the first half of the year.\n4\nTable of Contents\nThe ACA created the Health Insurance Marketplace, which is a key component of the ACA and provides an opportunity for individuals and families to obtain health insurance. States have the option of operating their own Marketplace or partnering with the federal government. States choosing neither option default to the federally-facilitated Marketplace. Insurers are required to offer a minimum level of benefits with coverage that varies based on premiums and out-of-pocket costs.\nPremium subsidies are provided to individuals and families without access to other coverage and with incomes above 100% of the federal poverty level to make coverage more affordable. Consumers who qualify for subsidies may choose how much of the tax credit to apply to their premiums each month, up to the maximum amount for which they are eligible. The amount of subsidy an enrollee may receive depends on household income and the cost of the second lowest cost silver plan available to enrollees in their local area. Temporary enhanced subsidies were made available by the American Rescue Plan Act (ARPA), which were further extended through 2025 pursuant to the Inflation Reduction Act.\nWe are the largest Marketplace carrier, serving 4.4 million members across 29 states as of December 31, 2024, under the brand name Ambetter Health. Revenues from CMS are significant to the segment.\nWe see an opportunity for market disruption of employer-sponsored insurance through Individual Coverage Health Reimbursement Arrangements (ICHRAs). An ICHRA allows employers of all sizes to directly reimburse employees for individual health insurance premiums and qualifying medical expenses tax free in lieu of traditional employer-sponsored health insurance. The ICHRA model relies heavily on off-exchange, individual health insurance coverage as the most efficient way to use the funds. These off-exchange plans often mimic employer-provided coverage in benefit design. They are designed to provide comprehensive, consistent coverage and benefits that meet members' needs.\nUsing an ICHRA allows employees to tap into a more competitive health plan marketplace and a larger risk pool, creating stronger potential for lower, more stable premiums. At the same time, this approach allows employees to find products that better fit their needs. Given the full commercial group market covers over 170 million, we see a significant addressable market over the long term. We have launched plans designed to attract ICHRA membership in off-exchange plans in 6 states in 2025. \nOther\nOur Other segment includes:\n•\nSpecialty Pharmacy. \nAcariaHealth offers comprehensive specialty pharmacy services customized for complex and chronic conditions through enhanced patient care offerings and collaborative partnerships with providers to optimize patient outcomes.\n•\nBehavioral Health. \nMagellan Health, Inc. (Magellan) supports innovative ways of accessing better health through technology, while remaining focused on the critical personal relationships that are necessary to achieve a healthy, vibrant life. Magellan's customers include health plans and other MCOs, employers, labor unions, various military and state and federal governmental agencies and third-party administrators.\n•\nVision and Dental Services. \nEnvolve Benefit Options coordinates benefits beyond traditional medical benefits to offer fully integrated vision and dental health services. Our vision benefit program administers routine and surgical eye care benefits through a contracted national network of eye care providers. Through the dental benefit, we are dedicated to improving oral health through a contracted network of dental healthcare providers.\n•\nClinical Healthcare. \nCommunity Medical Group (CMG) provides clinical healthcare, encompassing primary care, access to certain specialty services and a suite of social and other support services. CMG operates in Florida through an at-risk primary care provider model, focusing on clinical and social care for at-risk beneficiaries. Additionally, Denova Collaborative Health provides outpatient primary care and behavioral healthcare services.\n•\nFederal Services.\n Health Net Federal Services had a Managed Support Contract in the West Region for the Department of Defense (DoD) TRICARE program. We provided administrative services to Military Health System eligible beneficiaries, which included eligible active duty service members and their families, retired service members and their families, survivors of retired service members and qualified former spouses. Our contract for health care delivery services concluded at the end of 2024.\n5\nTable of Contents\n•\nCorporate Management Company. \nEach of our health plans contracts with our corporate management company to provide certain functions required to manage the health plan including, but not limited to, salaries and wages for personnel, rent, utilities, population health management, provider contracting, compliance, member services, claims processing, information technology, cash management, finance and accounting and other services.\nOUR COMPETITIVE STRENGTHS\nOur approach is based on the following key competitive strengths: \n•\nFocus and Experience\n. Centene was established as a Medicaid company, anchored around long-lasting, trusted relationships, with a continual focus on low-income populations. Since our founding more than 40 years ago, we have forged new paths developing innovative solutions and addressing the evolving needs of our members, earning Centene an important seat at the table and a powerful voice to shape the conversation at the state and federal level. We have deliberately increased our market density by expanding to serve other low-income and medically complex populations and, as a result, we are now the largest Medicaid health insurer and Marketplace carrier in the country with an established Medicare presence. As states increasingly move to integrate care for individuals who are dually eligible for both Medicaid and Medicare, our expertise uniquely positions us to serve this population of more than 12 million beneficiaries nationwide. We are positioned at the nexus of affordability and choice, ready to meet the needs of consumers who increasingly seek innovative products like ICHRAs.\n•\nLocal Approach\n. Our local approach to delivering healthcare enables us to meet members and providers in the communities where they are to facilitate member access to high-quality, culturally sensitive healthcare services. Our programs and services are tailored to the unique individuals we serve and include a broad range of initiatives to address social drivers of health such as food insecurity, housing instability, unemployment and access to transportation, which contribute to health disparities among underserved communities. With local leadership owning all three lines of business, we are able to translate local best practices from our Medicaid business into product development, distribution, network and pricing decisions we make for our Marketplace and Medicare businesses. We know what our customers will value because we live and work alongside them every day.\n•\nPartnerships\n. Centene's partnership mindset allows us to design solutions for our members that integrate the most relevant, most local and most innovative capabilities in an agile and capital-efficient way. Partnership has become both a strategy and discipline: finding, measuring and maintaining the best partners over time. Instead of owning providers, we identify the best providers for our members, investing in data and engagement models that will support them in delivering health outcomes. For example, we entered into a partnership with the National Association of Community Health Centers to enhance value-based care adoption, further strengthening Community Health Centers' ability to deliver high-quality, patient-centered care and improve maternal child health outcomes.\n•\nPeople. \nThrough an intentional focus on building a One CenTeam culture, we have elevated and unleashed the power of 60,500 team members who uniquely understand how to serve our members and are committed to our mission of transforming the health of the communities we serve, one person at a time.\n6\nTable of Contents\nBenefits to Customers\nWe feel that our ability to establish and maintain a leadership position in the markets we serve results primarily from our demonstrated success in providing quality care while improving the affordability of healthcare, and from our specialized programs with state governments.\nThe following are among the benefits we provide to our government partners, providers and members:\n•\nAccurate and timely claims payments. \nWe are committed to ensuring that our information systems and claims payment systems meet or exceed state requirements. We continuously improve our claims processing strategies, expertise, configuration and tools to achieve operational excellence, including timely payments to our providers.\n•\nCare management for complex populations. \nThrough our experience with Medicaid populations and long-time presence in states with experience in long-term care for children and adolescents in the foster care system, we have developed care management, service coordination and crisis prevention/response programs that improve healthcare outcomes through decreasing preventable emergency department utilization and improving access to primary care and behavioral health intervention.\n•\nCommitment to quality and improved health outcomes. \nWe demonstrate this through obtaining health plan accreditations, such as National Committee for Quality Assurance (NCQA), which assesses the effectiveness of our structure and operational processes, clinical quality and member satisfaction. We have developed care coordination, case management and clinical programs focused on key prevention and chronic conditions. Additionally, we have launched a multi-year plan to improve quality across the enterprise with a strong focus on enhanced patient experience and access to care, which lays the foundation for strong quality ratings in the future, including Medicare Star ratings and Marketplace Quality Rating System (QRS).\n•\nCommunity-specific healthcare programs and a focus on addressing healthcare gaps. \nOur expertise in government-sponsored programs has helped us establish and maintain strong relationships with community-based organizations, local providers, as well as our state and federal partners. Our health plans develop tailored, local programs and campaigns to support members through solutions that promote whole-person care and enhance healthcare for all.\n•\nData-driven approach to improve health outcomes. \nWe have employed an investment strategy designed to increase our capability to collect and analyze data and insights. We gather data from multiple sources including medical, vision and behavioral health claims and encounter data, pharmacy data, dental vendor claims and authorization data. We use this data to track utilization trends, identify health disparities, monitor quality of care and evaluate the effectiveness of our programs. Through these analyses, we identify and implement interventions that improve health outcomes, advance health equity and ensure members receive timely, appropriate services. The value and accuracy in the data we collect is important in demonstrating an auditable program for federal and state agencies.\n•\nMember programs and services\n. Our comprehensive set of programs and services help members achieve whole-person health while supporting the overall goals of the government program. Covered healthcare benefits vary from customer to customer but cover a wide range of services, including transportation assistance, provision of durable medical equipment, behavioral health and substance use disorder services, 24-hour nurse advice line, social work services and telehealth services.\n•\nValue-based arrangements. \nOur health plans offer a combination of value-based contracting models, including quality incentives and risk arrangements, that address the continuum of whole-person care. We believe value-based collaboration with providers leads to improved health outcomes, reduced costs and better member and provider experiences.\n7\nTable of Contents\nProviders\nFor each of our service areas, we establish a provider network consisting of primary and specialty care physicians, hospitals, behavioral health practitioners and ancillary providers. Our network of primary care physicians is a critical component of care delivery, healthcare affordability, and the attraction and retention of new members. Primary care physicians include family and general practitioners, pediatricians and internal medicine physicians. Specialty care physicians provide medical care to members generally upon referral by primary care physicians. Specialty care physicians include a wide array of provider types including, but not limited to, orthopedic surgeons, cardiologists and otolaryngologists. We also build robust networks of mental health providers, such as psychiatrists, social workers, substance abuse disorder facilities, and inpatient behavioral health facilities. We also contract with providers on a negotiated fee arrangement for physical therapy, home healthcare, diagnostic laboratory tests, x-ray examinations, ambulance services and durable medical equipment.\nOur health plans facilitate access to healthcare services for our members primarily through contracts with our providers. Our contracts with primary and specialty care physicians and hospitals are usually for a term of one to three years and usually renew automatically for successive one-year terms, but generally are subject to termination by either party upon prior written notice. In the absence of a contract, we typically pay providers at applicable state or federal reimbursement levels and guidelines, depending on the product (for example, Medicaid or Medicare). We pay providers under a variety of methods, including fee-for-service, capitation arrangements and value-based arrangements.\n•\nUnder our fee-for-service contracts with providers, we pay a negotiated fee for covered services, which may include a case rate or fee-for service. This model is characterized as having no financial risk for the provider. \n•\nUnder our capitated contracts, providers can be paid a set amount for their services as outlined in their respective provider agreements, usually on a per member per month basis and sometimes including different rates depending on the age of the population.\n•\nUnder value-based arrangements, providers can be paid under either a capitated or fee-for-service model. The arrangement, however, contains provisions for additional payments to the providers or reimbursement from the providers based on their performance against quality and other measures. We are committed to value-based contracting, upside and downside risk, assigning members to the highest quality providers and capitation. This is done in partnership with our providers to increase quality outcomes and overall member satisfaction. We anticipate our membership in upside and downside risk arrangements will continue to grow.\nThe continuum of value-based contracting includes the following models: pay-for-performance, shared savings, shared risk and full risk. We often start our provider relationships in a pay-for-performance model, in which providers are reimbursed for the fair market value of services provided. Providers benefit from this model as it gives complete transparency and clarity on actions that earn incentives. \nWe then transition to a risk-sharing model, in which providers are reimbursed based on the total cost of care. As we advance along this continuum, it strengthens our partnerships with our providers, enabling the delivery of high-quality care. We believe having the strongest provider partners who know how to operate well in a value-based model and who can help us drive positive outcomes for our members and good member experience is more important than owning providers, which occurs on an exception basis. Prioritizing partnership over ownership allows us to be agile and capital-efficient, focusing our resources on what we do best.\nWe work with physicians to help them operate efficiently by providing actionable financial and utilization information, physician and patient educational programs and disease and population health management programs. Our programs are also designed to help physicians coordinate care rendered by other providers.\nWe believe our local and collaborative approach with physicians and other providers gives us a competitive advantage in entering new markets. Our contracted physicians serve on local committees that assist us in implementing preventive care programs, optimizing costs and improving the overall quality of care delivered to our members, while also simplifying the administrative burdens on our providers. This approach has enabled us to strengthen our provider networks through improved physician recruitment and retention which, in turn, has helped to increase our membership base. \n8\nTable of Contents\nThe following are among the services we provide to support physicians:\n•\nProvider Engagement Performance Tools and Processes\n can lead to measurable improvements in quality and health outcomes, healthcare costs and member satisfaction. High-quality provider support and service levels are important as our key customers are increasingly using performance-based measures to select and pay health plans. We have a suite of network performance tools for use by physicians and other providers which monitor the outcomes and care gaps of their individual patient panels. Provider Engagement and Quality teams meet with the providers to review their performance issues and recommend strategies for improvements in their patient panel outcome, including disease management and quality initiatives. Our tools also allow the physician and others to see where they stand within their value-based contract.\n•\nOur Integrated Care Model \nis member-centric and managed by one care manager assigned to a member who looks at the care for the member in a holistic manner. This single care manager will coordinate all care for that member including behavioral health, medical health and home-based primary care in accordance with an individualized, integrated care plan. This care manager also coordinates meetings with the member's integrated care team to assess and alter the care plan as needed. This results in better clinical outcomes and improved member satisfaction.\n•\nThe Provider Portal\n delivers claims and eligibility information, prior authorization submissions and status, member panels, care gaps, patient analytics and provider analytics to contracted providers to drive provider engagement and improve patient outcomes. Data and reporting are delivered via a secure, user-friendly web-based provider portal.\nOur contracted physicians also benefit from several of the services offered to our members and population health management programs, which assist physicians in managing their patients with chronic diseases.\nQuality Improvement\nQuality improvement is foundational for our organization. Our commitment to achieving better health outcomes for our members has led to recent investments in key initiatives involving people, processes, technology and partner management.\nThrough these initiatives, we have:\n•\ncentralized the oversight of core quality processes and programs, including the implementation of real-time operational dashboards to track numerous quality performance metrics;\n•\ninvested in new technology to enhance our access to clinical data on gaps in care, committed to integrating our numerous quality platforms into a single unified workflow and developed advanced analytics to more efficiently and effectively target our member engagement efforts for maximum impact on access, quality and member satisfaction;\n•\nincreased focus on member engagement, including tripling the capacity of our member outreach services to encourage active participation with their primary care physicians and other members of their care team and overhauling our onboarding process to focus on quality from the very first member touchpoint for Medicare; and\n•\nprioritized strengthening relationships with providers to improve access and quality of care for our members; an essential strategy on this front is increasing our value-based provider engagements as those enhanced partnerships have proven to drive higher quality care. We also continue to promote local participation in physician quality improvement committees chaired by local physician leaders, which ensures clinical oversight and is critical to the success of clinical quality improvement programs.\nWe believe these initiatives will improve members' overall health and healthcare experience and help us achieve stronger quality scores overall, such as Medicare Star ratings and Marketplace QRS.\nCMS developed the Medicare Advantage Five-Star Quality Rating System to help consumers choose among competing plans, awarding between 1.0 and 5.0 Stars to Medicare Advantage plans based on performance on composite measures of quality. The parent organization Star rating is used for new Medicare Advantage contracts while existing contracts follow their individual Star ratings to determine bonus payments.\n9\nTable of Contents\nPlans receive additional Medicare revenue related to the achievement of higher Star ratings that can be used to offer more attractive benefit packages to members and/or achieve higher profit margins. In addition, plans with Star ratings of 5.0 are eligible for year-round open enrollment, whereas plans with lower Star ratings have more restrictions on enrollment criteria and timing. Part C or Part D Medicare plans with Star ratings of fewer than three stars for three consecutive years are denoted as \"low performing\" plans on the CMS website and in the CMS \"Medicare and You\" handbook. In addition, CMS has the authority to terminate the Medicare Advantage and PDP contracts for plans rated below three Stars for three consecutive years for any Part (C or D). As a result, plans that achieve higher Star ratings may have a competitive advantage over plans with lower Star ratings.\nAs further validation of our quality objectives, we pursue accreditation by independent organizations that have been established to promote healthcare quality. NCQA Health Plan programs provide unbiased, third-party reviews to verify and publicly report results on specific quality metrics including Healthcare Effectiveness Data and Information Set (HEDIS) and Consumer Assessment of Healthcare Providers and Systems (CAHPS). We pursue and achieve accreditation in the majority of states where we currently have health plan operations. We also verify the credentials and backgrounds of our partner providers using standards supported by NCQA to ensure the quality of our networks.\nAccreditation is only one measure of our ability to provide access to quality care for our members. The majority of state Medicaid programs also have specific quality measures that drive our clinical quality improvement efforts. Performance is monitored by health plan quality improvement committees and our corporate population health management and quality improvement teams.\nWe remain committed to our quality initiatives and continue to focus on investments that we expect to translate into value over the next few years.\nETHICS AND COMPLIANCE\nOur Ethics and Compliance program assists the organization in developing effective internal controls that promote the prevention, detection and correction of fraud, waste and abuse and instances of conduct that do not conform to federal and state law, private payor healthcare program requirements or our ethics and business policies. Responsibilities also include the ongoing maintenance of our privacy program and oversight of the Health Insurance Portability and Accountability Act of 1996 (HIPAA) as it pertains to us and our business units from a compliance, business and technical perspective.\nThree standards by which corporate compliance programs in the healthcare industry are measured are the Federal Organizational Sentencing Guidelines, the CMS Chapter Guidance, and the Compliance Program Guidance series issued by the Department of Health and Human Services' Office of the Inspector General. Our program contains each of the seven elements suggested by these authorities.\nThese key components are:\n•\nwritten standards of conduct; \n•\ndesignation of compliance officers and compliance committees;\n•\neffective training and education;\n•\neffective lines for reporting and communication;\n•\nenforcement of standards through well-publicized disciplinary guidelines and actions;\n•\ninternal monitoring and auditing; and\n•\nprompt response to detected offenses and development of corrective action plans. \nThe goal of our program is to build a culture of integrity, ethics and compliance, which is assessed periodically to measure engagement and effectiveness. Our Ethics and Compliance intranet site, accessible to all team members, links to our Code of Conduct and guidance for team members to assist them in reporting concerns or asking questions. Our Ethics and Compliance Helpline is a toll-free number and web-based reporting tool operated by a third-party independent of the Company and allows team members or other persons to anonymously report suspected incidents of misconduct, fraud, waste, abuse or other compliance violations, concerns or questions. Furthermore, our Board of Directors' Audit and Compliance Committee reviews ethics and compliance report data quarterly.\n10\nTable of Contents\nCORPORATE SUSTAINABILITY\nOur steadfast commitment to the health and social well-being of our communities, fostering a healthy environment and our culture of sound and ethical corporate governance, extends far beyond individual programs or initiatives. We provide access to high-quality healthcare, innovative programs and a wide range of health solutions that help people live healthier lives. Our mission is to transform the health of the communities we serve, one person at a time. Our Corporate Sustainability Framework (the Framework) is comprised of areas of focus core to our mission, our strategy and to delivering positive impact and long-term value to our stakeholders. The Framework highlights our commitment to healthy individuals and healthy communities and builds upon our long history of identifying and removing barriers to health. Implementation of the Framework is overseen by the Board of Directors' Governance Committee and corporate sustainability initiatives throughout the organization are driven by a cross-functional network of executives.\nAnnually, we issue a corporate sustainability report to communicate the value of our efforts, a Task Force on Climate-related Financial Disclosures (TCFD) Index report outlining our governance structure, strategy, risks, opportunities and metrics related to managing climate change, and a SASB Index report aligned with the SASB Managed Care standards maintained by the International Sustainability Standards Board providing corporate sustainability disclosures to our stakeholders. The Framework enables us to communicate impact and progress on corporate sustainability matters important to our stakeholders and aligned with our business strategy and long-term plans. Corporate sustainability financial reporting disclosures are overseen by the Board of Directors' Audit and Compliance Committee. Our corporate sustainability initiatives and commitments enable us to build healthier communities, empower health, foster a healthy environment and drive business accountability. Interested parties can find our corporate sustainability-related reports within the Investors section of our website, the URL of which is https://investors.centene.com/sustainability. \nPlease note: Nothing on our website, including our corporate sustainability reports or sections thereof, shall be deemed incorporated by reference into this Annual Report.\nCOMPETITION\nWe operate in a highly competitive environment in an industry subject to ongoing significant changes, including business consolidations, new strategic alliances, market pressures and regulatory and legislative reform both at the federal and state level. This includes, but is not limited to, the federal and state healthcare reform legislation described under the heading \"Regulation.\" In addition, changes to the political environment may drive additional changes to the competitive landscape. \nWe compete with other MCOs, specialty companies and other non-traditional competitors to acquire and retain state, county, federal and commercial contracts. Before granting a contract, state and federal government agencies consider many competitive factors, including but not limited to, quality of care, access to care through comprehensive provider networks, reducing administrative burden for providers and members, financial condition, stability and resources, previous experience and performance and local investments and offerings.\nWe also compete to enroll new members and retain existing members. People who wish to enroll in a managed healthcare plan or to change healthcare plans typically choose a plan based on the quality of care and services offered, ease of access to services, a specific provider being part of the network and the availability of supplemental benefits. We believe that the principal competitive features affecting our ability to retain and increase membership include the range and prices of benefit plans offered, size and quality of provider network, quality of service, quality ratings, responsiveness to customer demands, financial stability, comprehensiveness of coverage, diversity of product offerings, market presence and reputation.\nWe also compete with other MCOs in establishing provider networks. When contracting with various health plans, we believe that providers consider existing and potential member volume, reimbursement rates, provider experience, value-based payment programs, speed of reimbursement and administrative service capabilities. See \"Risk Factors - \nCompetition may limit our ability to increase penetration of the markets that we serve\n.\n\"\n \nThe relative importance of each of the aforementioned competitive factors and the identity of our key competitors varies by market, including by geography and by product. We believe that we compete effectively against other healthcare industry participants.\n11\nTable of Contents\nREGULATION\nOur operations are comprehensively regulated at the local, state and federal levels. Government regulation of the provision of healthcare products and services is a changing area of law that varies from jurisdiction to jurisdiction. States have implemented National Association of Insurance Commissioners (NAIC) model laws and regulations, requiring governance practices and risk and solvency assessment reporting. States have adopted these or similar measures to enhance oversight relating to corporate governance and internal controls of health maintenance organizations (HMOs) and insurance companies. We are required to maintain a risk management framework and file reports with state insurance regulators.\nRegulatory agencies have substantial discretion to issue regulations and to interpret and enforce laws and rules. Changes in the regulatory environment and applicable laws and rules also may occur periodically, including in connection with changes in political party or administration at the state and federal levels. The ultimate content, timing or effect of any potential future legislation enacted under new administrations remains uncertain.\nOur regulated subsidiaries are licensed to operate as HMOs, preferred provider organizations (PPOs), third-party administrators (TPAs), utilization review organizations, pharmacies, direct care providers and/or insurance companies in their respective states. In each of the jurisdictions in which we operate, we are regulated by the relevant health and/or human services departments, Medicaid agencies, boards of pharmacy and other healthcare providers, departments of insurance, and departments of health that oversee the activities of MCOs and health plans providing or arranging to provide services to enrollees.\nThe process for obtaining authorization to operate as an MCO, health insurance plan, PDP, pharmacy or provider organization is complex and requires us to demonstrate to the regulators the adequacy of the health plan's organizational structure, financial resources, utilization review, quality assurance programs, billing protocols, complaint procedures, provider network and procedures for covering emergency medical conditions. For example, under state MCO statutes and insurance laws, our health plan subsidiaries, as well as companies within our Other segment, must comply with minimum statutory capital and other financial solvency requirements, such as deposit and surplus requirements. Insurance regulations may also require prior state approval of acquisitions of other MCO businesses and the payment of dividends, as well as notice for loans or the transfer of funds. Our subsidiaries are also subject to periodic state and federal reporting requirements. In addition, each health plan and individual healthcare provider must meet criteria to secure the approval of state regulatory authorities before implementing certain operational changes, including, without limitation, changes to existing offerings, the development of new product offerings, certain organizational restructurings and, in some states, the expansion of service areas. \nStates have adopted a number of laws and regulations that may affect our business and results of operations. These laws and regulations, in certain states, include:\n•\npremium taxes or similar assessments imposed on us;\n•\nstringent prompt payment laws requiring us to pay claims within a specified period of time;\n•\nmandated coverage of specific drugs or services;\n•\nstate-specific medical loss ratios that may be more stringent than federal requirements;\n•\ndisclosure requirements regarding provider fee schedules and coding procedures; and\n•\nprograms to monitor and supervise the activities and financial solvency of provider groups.\nWe are regulated as an insurance holding company and are subject to the insurance holding company acts of the states in which our insurance company and HMO subsidiaries are domiciled. These acts contain certain reporting requirements as well as restrictions on transactions between an insurer or HMO and its affiliates. These holding company laws and regulations generally require insurance companies and HMOs within an insurance holding company system to register with the insurance department of each state where they are domiciled and to file with those states' insurance departments reports describing their capital structure, ownership, financial condition, intercompany transactions and general business operations. In addition, depending on the size and nature of the transaction, various notice and reporting requirements generally apply to transactions between insurance companies and HMOs and their affiliates within an insurance holding company structure. Some insurance holding company laws and regulations require prior regulatory approval or, in certain circumstances, prior notice of certain material intercompany transfers of assets as well as certain transactions between insurance companies, HMOs, their parent holding companies and affiliates. Among other provisions, state insurance and HMO laws may restrict the ability of our regulated subsidiaries to pay dividends.\n12\nTable of Contents\nAdditionally, the holding company regulations of the states in which our subsidiaries are domiciled restrict the ability of any person to obtain control of an insurance company or HMO without prior regulatory approval. Under those statutes, without such approval or an exemption, no person may acquire any voting security of an insurance holding company that controls an insurance company or HMO, or merge with such a holding company, if as a result of such transaction such person would \"control\" the insurance holding company. \"Control\" is generally defined in state insurance laws as the direct or indirect power to direct or cause the direction of the management and policies of a company and is presumed to exist if a person directly or indirectly owns or controls 10% or more of the voting securities of a company. \nPPO laws and regulations also vary by state and cover all or most of the subject areas referred to above.\nOur pharmacies must be licensed to do business as pharmacies in the states in which they are located. Our pharmacies must also register with the U.S. Drug Enforcement Administration and individual state-controlled substance authorities to dispense controlled substances.\nOur healthcare providers must be licensed to practice medicine and do business as care providers in the state in which they are located. In addition, they must be in good standing with the applicable medical board, board of nursing or other applicable entity. Furthermore, they must not be excluded from participation at either the state or federal levels. Our facilities are periodically reviewed by state departments of health and other regulatory agencies to ensure the environments are safe to provide care.\nFederal law has also implemented other health programs that are partially funded by the federal government, such as Medicaid and Medicare programs. Our Medicaid programs are regulated and administered by various state regulatory bodies. Federal funding remains critical to the viability of these programs. Federal law permits the federal government to oversee and, in some cases, to enact, regulations and other requirements that must be followed by states with respect to these programs. Medicare is administered at the federal level by CMS. Comprehensive legislation, specifically Title XVIII of the Social Security Act, governs our Medicare program. In addition, our Medicare contracts are subject to regulation by CMS. CMS has the right to audit Medicare contractors and the healthcare providers and administrative contractors who provide certain services on their behalf to determine the quality of care being rendered and the degree of compliance with CMS contracts and regulations. \nThe ACA transformed the U.S. healthcare system through a series of complex initiatives. Some of the ACA's most significant provisions include the imposition of fees, assessments and taxes; the establishment of federally-facilitated and state-based Health Insurance Marketplaces where individuals and small groups may purchase health coverage; the implementation of certain premium stabilization programs designed to apportion risk amongst insurers; and optional Medicaid Expansion. State and federal regulators have continued to provide additional guidance and specificity to the ACA, and we continue to monitor this new information and evaluate its potential impact on our business. For a further discussion of the ACA, see \"Risk Factors - \nSignificant changes or judicial challenges to the ACA and the other government-sponsored healthcare programs in which we participate could materially and adversely affect our results of operations, financial condition, and cash flows.\n\"\nWe must also comply with laws and regulations related to the award, administration and performance of U.S. Government contracts. Government contract laws and regulations affect how we do business with our customers and, in some instances, impose added costs on our business. For example, money laundering is a method of attempting to conceal the origins of money gained through illegal activity and is itself a crime that can result in substantial criminal and civil sanctions including fines and imprisonment. To ensure compliance with anti-money laundering laws and regulations, it is our policy to conduct business only with legitimate customers and counterparties whose funds are derived from legitimate commercial activity. A violation of specific laws and regulations by us and/or our agents could result in, among other things, the imposition of fines and penalties on us, changes to our business practices, the termination of our contracts or debarment from bidding on contracts. \n13\nTable of Contents\nState and Federal Businesses; Contracts\nIn addition to being a licensed insurance company or HMO, in order to be a Medicaid MCO in each of the states in which we operate, we generally must operate under a contract with the state's Medicaid agency. States generally either use a formal request for proposal process, reviewing a number of bidders, or award individual contracts to qualified applicants that apply for entry to the program. Under these state Medicaid program contracts, we receive monthly payments based on specified capitation rates determined on an actuarial basis. These rates differ by membership category and by state depending on the specific benefits and policies adopted by each state. In addition, several of our Medicaid contracts require us to maintain Medicare Advantage D-SNPs, which are regulated by CMS and the state Medicaid agency, for dual-eligible individuals within the state.\nWe provide Medicare Advantage, PDPs, D-SNPs and MMPs pursuant to contracts with CMS and subject to federal regulation regarding the award, administration and performance of such contracts. CMS also has the right to audit our performance to determine our compliance with these contracts, other CMS regulations, and the quality of care we provide to Medicare beneficiaries under these contracts.\nAs of December 31, 2024, we operated in 29 states under federally-facilitated Marketplace contracts with CMS and state-based exchanges. We also operate under a Memorandum of Understanding with the Arkansas Department of Human Services Division of Medical Services and the Arkansas Insurance Department to participate in the Medicaid expansion model that Arkansas has adopted (referred to as AR Health and Opportunity for Me program).\nOur government contracts have included government-sponsored managed care and administrative services contracts through the TRICARE program and certain other healthcare-related government contracts. Our contract for health care delivery services through the TRICARE program concluded at the end of 2024.\nOur state and federal contracts and the legal and regulatory provisions applicable to us generally set forth requirements for operating, including provisions relating to:\n•\neligibility, enrollment and dis-enrollment processes;\n•\ncovered services;\n•\neligible providers;\n•\nsubcontractors;\n•\nrecord-keeping and record retention;\n•\nperiodic financial and informational reporting;\n•\nquality assurance;\n•\naccreditation;\n•\nhealth education and wellness and prevention programs;\n•\ntimeliness of claims payment;\n•\nfinancial standards;\n•\nsafeguarding of member information;\n•\nfraud, waste and abuse detection and reporting;\n•\ngrievance procedures; \n•\nuse and compensation of brokers; and\n•\norganization and administrative systems.\nA health plan or individual health insurance provider's compliance with these requirements is subject to significant monitoring by state regulators and by CMS, including monthly, quarterly and annual reporting, all of which are generally state-specific. A health plan is also subject to periodic comprehensive quality assurance evaluations by a third-party reviewing organization and generally by the insurance department of the jurisdiction that licenses the health plan. A health plan or individual health insurance provider must also submit reports to various regulatory agencies, including quarterly and annual statutory financial statements and utilization reports.\nOur health plans operate through individual state contracts, generally with an initial term of one to five years. The contracts often have renewal or extension terms or are renewable through the state's reprocurement process. The contracts generally are subject to termination for cause, an event of default or lack of funding, among other things.\nOur federally-facilitated Marketplace contracts and state-based exchanges are renewable on an annual basis.\n14\nTable of Contents\nOther Fraud, Waste and Abuse Laws\nInvestigating and prosecuting healthcare fraud, waste and abuse continues to be a top priority for state and federal law enforcement agencies. These efforts span multiple products, including Medicare, Medicaid, Health Insurance Marketplace and commercial plans. Pertinent fraud, waste and abuse laws include the federal False Claims Act, which prohibits the known filing of a false claim or the known use of false statements to obtain payment from the federal government. Many states have their own statutes that closely resemble the federal False Claims Act. A plan or provider may engage in other activities that violate fraud, waste and abuse laws, such as paying or receiving kickbacks or other inducements for the referral of members or coverage of products (such as prescription drugs), billing for unnecessary medical services or making false or misleading sales-related representations.\nOur program integrity efforts aim to detect, prevent and correct fraud, waste and abuse. In addition to following up on leads from members, providers and our own team members, we use data analytics to identify suspicious activity and, as appropriate, will deny improperly billed claims, recover improperly made payments and make referrals to regulatory entities and law enforcement for further review. The laws and regulations relating to fraud, waste and abuse and the requirements applicable to health plans, PDPs and providers participating in these programs are complex and change regularly. Compliance with these laws may require substantial resources. We are constantly looking for ways to improve our fraud, waste and abuse detection methods. While we have both prospective and retrospective processes to identify abusive patterns and fraudulent billing, we continue to increase our capabilities to proactively detect inappropriate billing prior to payment.\nPrivacy Regulations\nWe are subject to various international, federal, state and local laws and rules regarding the use, security and disclosure of protected health information, personal information and other categories of confidential or legally protected data that our businesses handle. Such laws and rules include, without limitation, HIPAA, the Federal Trade Commission Act, the Gramm-Leach-Bliley Financial Modernization Act of 1999 (Gramm-Leach-Bliley Act) and state privacy and security laws such as the California Confidentiality of Medical Information Act and the California Online Privacy Protection Act. Privacy and security laws and regulations often change due to new or amended legislation, regulations or administrative interpretation. A variety of state and federal regulators enforce these laws, including but not limited to the U.S. Department of Health and Human Services (HHS), the Federal Trade Commission, state attorneys general and other state regulators.\nHIPAA is designed to improve the portability and continuity of health insurance coverage, simplify the administration of health insurance through standard transactions and ensure the privacy and security of individual health information. Among the requirements of HIPAA are the Administrative Simplification provisions which include: standards for processing health insurance claims and related transactions (Transactions Standards); requirements for protecting the privacy and limiting the use and disclosure of medical records and other personal health information (Privacy Rule); and standards and specifications for safeguarding personal health information which is maintained, stored or transmitted in electronic format (Security Rule). The Health Information Technology for Economic and Clinical Health (HITECH) Act amended certain provisions of HIPAA and enhanced data security obligations for covered entities and their business associates. HITECH also mandated individual notifications in instances of a data breach, provided enhanced penalties for HIPAA violations and granted enforcement authority to states' Attorneys General in addition to the HHS Office for Civil Rights. The HIPAA Omnibus Rule further enhanced the changes under the HITECH Acts and the Genetic Information Nondiscrimination Act of 2008 which clarified that genetic information is protected under HIPAA and prohibits most health plans from using or disclosing genetic information for underwriting purposes. These regulations also establish significant criminal penalties and civil sanctions for non-compliance. The preemption provisions of HIPAA provide that the federal standards will not preempt state laws that are more stringent than the related federal requirements. \nThe Privacy and Security Rules and HITECH/Omnibus enhancements established requirements to protect the privacy of medical records and safeguard personal health information maintained and used by healthcare providers, health plans, healthcare clearinghouses and their business associates. \nThe Security Rule requires healthcare providers, health plans, healthcare clearinghouses and their business associates to implement administrative, physical and technical safeguards to ensure the privacy and confidentiality of health information electronically stored, maintained or transmitted. The HITECH Act and Omnibus Rule enhanced a federal requirement for notification when the security of protected health information is breached. In addition, there are state laws that have been adopted to provide for, among other things, private rights of action for breaches of data security and mandatory notification to persons whose identifiable information is obtained without authorization.\n15\nTable of Contents\nThe requirements of the Transactions Standards apply to certain healthcare-related transactions conducted using \"electronic media.\" Since \"electronic media\" is defined broadly to include \"transmissions that are physically moved from one location to another using portable data, magnetic tape, disk or compact disk media,\" many communications are considered to be electronically transmitted. Under HIPAA, health plans and providers are required to have the capacity to accept and send all covered transactions in a standardized electronic format. Penalties can be imposed for failure to comply with these requirements. The Transactions Standards were modified in October 2015 with the implementation of the ICD-10 coding system.\nIn addition, we process and maintain personal card data, particularly in connection with our Marketplace business. As a result, we must maintain compliance with the Payment Card Industry Data Security Standard, which is a multifaceted security standard intended to optimize the security of credit, debit and cash card transactions and protect cardholders against misuse of their personal information.\nHUMAN CAPITAL RESOURCES\nAs of December 31, 2024, we had approximately 60,500 team members. Our team members are guided by our mission-driven culture. Our culture values of accountability, courage, curiosity, trust and service guide our workforce and foster high-performing teams that serve our customers and key stakeholders each day while delivering against our long-term strategic goals. We intentionally attract, develop and retain top talent who bring a broad range of voices and experiences, passion and vision to help us transform the health of the communities we serve.\nCompensation and Other Benefits\nOur overall compensation philosophy is to pay for performance by linking the achievement of both Company and individual goals to total compensation. We offer benefits to our team members to help them achieve optimum work-life balance and meet their needs as well as the needs of their families. In addition to traditional healthcare benefits, we also offer various wellness programs, an employee assistance program, tuition reimbursement/educational assistance, a 401(k) retirement plan, as well as programs for family support such as adoption assistance, parental leave and caregiver leave. Our parental leave offers six weeks of fully compensated time for caregivers with an additional eight weeks for mothers, providing up to 14 weeks of fully compensated maternity leave. In addition, we offer paid community volunteer time to encourage our team members to participate in volunteer programs and support local communities.\nTalent Acquisition and Development\nThrough our robust talent infrastructure, we continue working to deepen and prepare our talent bench and workforce, which is instrumental to executing our long-term business strategy. Our talent advisors and hiring leaders recruit from across the country to develop a workforce possessing outstanding capabilities and a wide range of perspectives and lived experiences. We are committed to developing a skill-rich workforce who can thrive in the evolving world of work, enabling our organization to further accelerate growth, inclusivity and innovation. Through Centene University, accessible to our team members, we have designed learning and development at scale, using new digital tools, real-time virtual learnings and customized leadership development programs in a modern learning environment. In addition to building new workforce skills, we utilize our ongoing enterprise talent reviews, succession planning, career development planning and comprehensive workforce analytics to provide insights to senior leaders to inform actions and drive intentional talent results.\nModernized and Connected Workforce\nWe have adopted a modern work environment with the majority of our team members leveraging remote and hybrid work arrangements, allowing them to do their best work in the way they work best. We are intentional in our efforts to foster a collaborative and engaging work environment, including forums for people leaders, robust weekly communications for all team members, and virtual all-employee meetings. Additionally, we have a wide range of Centene Professional Networks. Open to all employees, these voluntary, employee-led groups provide professional connections and leadership opportunities for all team members and drive impact by supporting the attraction, development and retention of the best talent at all levels.\n16\nTable of Contents\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nThe following table sets forth information regarding our executive officers, including their ages, at February 14, 2025:\nName\nAge\nPosition\nSarah M. London\n44\nChief Executive Officer\nAndrew L. Asher\n56\nExecutive Vice President, Chief Financial Officer\nKatie N. Casso\n43\nSenior Vice President, Finance, Corporate Controller and Chief Accounting Officer\nChristopher A. Koster\n60\nExecutive Vice President, Secretary and General Counsel\nTanya M. McNally\n51\nChief People Officer\nSusan R. Smith\n49\nChief Operating Officer\n \nSarah M. London\n.\n \nMs. London has served as our Chief Executive Officer since March 2022. From September 2021 to March 2022, she served as Vice Chairman. She served as President, Centene Health Care Enterprises and Executive Vice President, Advanced Technology from March 2021 to September 2021. From September 2020 to February 2021, she served as Senior Vice President, Technology Innovation and Modernization. Prior to joining Centene, she served as both Senior Principal and Partner for Optum Ventures from May 2018 to March 2020 and Chief Product Officer of Optum from March 2016 to May 2018.\nAndrew L. Asher\n. Mr. Asher has served as our Executive Vice President, Chief Financial Officer since May 2021. From January 2020 to May 2021, he served as Executive Vice President, Specialty. Prior to joining Centene, he served as the Chief Financial Officer of WellCare from November 2014 to January 2020.\nKatie N. Casso\n. Ms. Casso has served as our Senior Vice President, Finance, Corporate Controller and Chief Accounting Officer since September 2024. Prior to that, she served as our Senior Vice President, Corporate Controller and Chief Accounting Officer from April 2021 to September 2024. From January 2016 to March 2021, she served as Vice President, Assistant Controller.\nChristopher A. Koster. \nMr. Koster has served as our Executive Vice President, Secretary and General Counsel since December 2021. From February 2020 to December 2021, he served as Senior Vice President, Secretary and General Counsel. From February 2017 to February 2020, he served as Senior Vice President, Corporate Services. Prior to joining Centene, Mr. Koster served as Missouri Attorney General for eight years.\nTanya M. McNally.\n \nMs. McNally has served as our Chief People Officer since March 2023. Prior to that, she served as our Interim Chief People Officer from January 2023 to March 2023. Prior to that, she served as our Regional Vice President, Human Resources from May 2022 to December 2022. From January 2020 to May 2022, she served as Vice President, Global Human Resource Business Partner. From August 2018 to January 2020, she served as Vice President, Human Resources for WellCare Health Plans, Inc. \nSusan R. Smith. \nMs. Smith has served as our Chief Operating Officer since January 2024. Ms. Smith has been an employee of the Company since June 2023. From August 2022 through December 2022, she served as Senior Vice President of Clinical, Quality and Enterprise Solutions President at Humana Inc. From July 2021 through July 2022, she served as Senior Vice President of Clinical Solutions at Humana Inc. She also previously served as Senior Vice President of Medicare at Humana Inc. from August 2019 through June 2021. From October 2016 through July 2019, she served as Senior Vice President of Healthcare Quality Reporting and Improvement at Humana Inc.\nAvailable Information\nWe are subject to the reporting and information requirements of the Securities Exchange Act of 1934, as amended (Exchange Act) and, as a result, we file periodic reports and other information with the Securities and Exchange Commission (SEC). We make these filings available on our website free of charge, the URL of which is https://www.centene.com, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. The SEC maintains a website (https://www.sec.gov) that contains our annual, quarterly and current reports and other information we file electronically with the SEC. Stockholders may obtain a copy of this Annual Report on Form 10-K, without charge, by writing: Investor Relations, Centene Corporation, 7700 Forsyth Boulevard, St. Louis, MO 63105. \nPlease note: Information on our website does not constitute part of this Annual Report on Form 10-K.\n17\nTable of Contents"
}