{
  "ticker": "CNP",
  "cik": "0001130310",
  "company_name": "CENTERPOINT ENERGY INC",
  "filing_date": "2025-02-20",
  "accession": "0001130310-25-000040",
  "primary_doc": "cnp-20241231.htm",
  "item1_text": "Item 1. Business for more details.\nNatural Gas Combustion Turbines. \nIn 2022, Indiana Electric received approval from the IURC for a CPCN seeking approval to construct two natural gas combustion turbines to replace portions of its existing coal-fired generation fleet. The turbines are targeted to be operational by mid-year 2025.  For further information, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Liquidity and Capital Resources — Regulatory Matters” in Item 7 of Part II of this report, which discussion is incorporated herein by reference.\nSolar. \nIndiana Electric entered into an amended and restated BTA to build a 191 MW solar array in Posey County, Indiana, , and a BTA to acquire a 130 MW solar array in Pike County, Indiana through a special purpose entity for a capped purchase price; however on March 15, 2024, Indiana Electric provided notice to the IURC that it was exercising its right to terminate this BTA. For further information about Indiana Electric’s BTA’s, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Liquidity and Capital Resources — Regulatory Matters” in Item 7 of Part II of this report, which discussion is incorporated herein by reference.\nTemporary Generation. \nAs allowed by a law enacted by the Texas legislature after the February 2021 Winter Storm Event and amended in 2023, Houston Electric is leasing TEEEF that can aid in restoring power to customers during certain significant power outages that are impacting its distribution system. On December 19, 2024, Houston Electric announced a proposal to release certain of Houston Electric’s TEEEF to the San Antonio area prior to the summer of 2025 for a period of up to two years, during which Houston Electric would not receive revenue or profit from ERCOT and would not charge Houston-area customers for these TEEEF units. As of December 31, 2024, Houston Electric leased 505 MW of TEEEF. For more information, see Note 7 and Note 19 to the consolidated financial statements. \nSubstations.\n  A substation is a facility that transforms electricity from a higher voltage to a lower voltage or vice versa. Generally, this facility is the interface between the transmission system and the distribution grid. The following table presents certain information related to CenterPoint Energy’s substations as of December 31, 2024:\n \n \nNumber of Substations\nTransformer Capacity (in Mva)\nHouston Electric\n243 \n73,667 \nIndiana Electric\n109 \n6,992 \nTotal CenterPoint Energy\n352 \n80,659 \n46\nService Centers.\n  Service centers consist of office buildings, warehouses and repair facilities that are used in the business of transmitting and distributing electricity. The following table presents certain information related to CenterPoint Energy’s service centers as of December 31, 2024:\n \nNumber of \nService Centers\nAcres of Land\nHouston Electric\n13 \n362 \nIndiana Electric\n6 \n70 \nTotal CenterPoint Energy\n19 \n432 \nNatural Gas (CenterPoint Energy and CERC)\nCenterPoint Energy’s and CERC’s Natural Gas use various third-party storage services or owned natural gas storage facilities to meet peak-day requirements and to manage the daily changes in demand due to changes in weather. CenterPoint Energy’s and CERC’s Natural Gas may also supplement contracted supplies and storage from time to time with stored LNG and propane-air plant production.\nAs of December 31, 2024, CenterPoint Energy’s and CERC’s Natural Gas owned and operated the following natural gas facilities:\n \nNo. of Assets\nStorage Capacity (Bcf)\nWorking Capacity (Bcf)\n Maximum Daily Withdrawal Rate (MMcf)\nCenterPoint Energy\nUnderground Natural Gas Storage Facility\n8\n43 \n14 \n305 \nCERC\nUnderground Natural Gas Storage Facility\n5\n32 \n9 \n205 \nOn-site Storage Capacity\nNo. of Assets\nDaily Production Rate (Dth)\nMillions of Gallons\nDth\nCenterPoint Energy and CERC\nPropane Air-Gas Manufacturing Plant\n15\n247,000 \n14\n1,228,000 \nLNG Plant Facility\n1\n72,000 \n12\n1,010,000 \nThe table below reflects CenterPoint Energy’s and CERC’s Natural Gas contracted upstream storage services as of December 31, 2024:\nStorage Capacity (Bcf)\n Maximum Peak Daily Delivery (MMcf)\nUpstream Storage Service\n89 \n2,311 \n \nThe table below reflects the approximate total linear miles of CenterPoint Energy’s and CERC’s Natural Gas distribution and transmission mains owned as of December 31, 2024:\nCenterPoint Energy\nCERC\nAll Locations\n85,000 \n82,000 \nIndiana and Ohio\n22,000 \n19,000 \nCenterPoint Energy’s and CERC’s Natural Gas owned mains varying in size from one-half inch to 24 inches in diameter. CenterPoint Energy’s and CERC’s Natural Gas Indiana and Ohio mains are located in Indiana and Ohio except for, in the case of CenterPoint Energy, pipeline facilities extending from points in northern Kentucky to points in southern Indiana so that gas may be transported to Indiana and sold or transported to customers in Indiana. Generally, in each of the cities, towns and rural areas served by CenterPoint Energy’s and CERC’s Natural Gas, they own the underground gas mains and service lines, metering and regulating equipment located on customers’ premises and the district regulating equipment necessary for pressure \n47\nmaintenance. With a few exceptions, the measuring stations at which CenterPoint Energy’s and CERC’s Natural Gas receive gas are owned, operated and maintained by others, and their distribution facilities begin at the outlet of the measuring equipment. These facilities, including odorizing equipment, are usually located on land owned by suppliers.\nAs of December 31, 2024, CenterPoint Energy and CERC, through CEIP, owned and operated over 219 miles of intrastate pipeline in Louisiana and Texas. On February 19, 2024, CenterPoint Energy, through its subsidiary CERC Corp., entered into the LAMS Asset Purchase Agreement to sell its Louisiana and Mississippi natural gas LDC businesses, which include the intrastate pipelines owned by CEIP in Louisiana. The transaction is expected to close in the first quarter of 2025. For further information, see Note 4 to the consolidated financial statements.\nItem 3.\nLegal Proceedings\nFor a discussion of material legal and regulatory proceedings, including environmental legal proceedings that involve a governmental authority as a party and that the Registrants reasonably believe would result in $1,000,000 or more of monetary sanctions, exclusive of interest and costs, under federal, state and local laws that have been enacted or adopted regulating the discharge of materials into the environment or primarily for the purpose of protecting the environment, affecting the Registrants, read “Business — Regulation” and “Business — Environmental Matters” in Item 1 of this report, “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Liquidity and Capital Resources — Regulatory Matters” in Item 7 of Part II of this report and Note 14(d) to the consolidated financial statements, which information is incorporated herein by reference.\nItem 4.\nMine Safety Disclosures\nNot applicable.\nPART II\nThis combined Form 10-K is filed separately by three registrants: CenterPoint Energy, Inc., CenterPoint Energy Houston Electric, LLC and CenterPoint Energy Resources Corp.\nItem 5.\nMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nCenterPoint Energy\nAs of February 10, 2025, CenterPoint Energy’s common stock was held by approximately 21,495 shareholders of record. CenterPoint Energy’s common stock is listed on the NYSE and NYSE Chicago and is traded under the symbol “CNP.”\nThe amount of future cash dividends will be subject to determination based upon CenterPoint Energy’s financial condition and results of operations, future business prospects, any applicable contractual restrictions and other factors that CenterPoint Energy’s Board of Directors considers relevant and will be declared at the discretion of CenterPoint Energy’s Board of Directors. For further information on CenterPoint Energy’s dividends, see Note 11 to the consolidated financial statements.\nRepurchases of Equity Securities\nDuring the quarter ended December 31, 2024, none of CenterPoint Energy’s equity securities registered pursuant to Section 12 of the Securities Exchange Act of 1934, as amended, were purchased by or on behalf of CenterPoint Energy or any “affiliated purchasers,” as defined in Rule 10b-18(a)(3) under the Securities Exchange Act of 1934, as amended.\nHouston Electric\nAs of February 10, 2025, all of Houston Electric’s 1,000 outstanding common shares were held by Utility Holding, LLC, a wholly-owned subsidiary of CenterPoint Energy.\nCERC\nAs of February 10, 2025, all of CERC Corp.’s 1,000 outstanding shares of common stock were held by Utility Holding, LLC, a wholly-owned subsidiary of CenterPoint Energy.\n48\nItem 6.        \n[Reserved] \nItem 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following combined discussion and analysis should be read in combination with the consolidated financial statements included in Item 8 herein. The discussion of CenterPoint Energy’s consolidated financial information includes the results of CenterPoint Energy Houston Electric, LLC and CenterPoint Energy Resources Corp., which, along with CenterPoint Energy, Inc., are collectively referred to as the Registrants. Where appropriate, information relating to a specific registrant has been segregated and labeled as such. Unless the context indicates otherwise, specific references to Houston Electric and CERC also pertain to CenterPoint Energy. In this combined Form 10-K, the terms “our,” “we” and “us” are used as abbreviated references to CenterPoint Energy, Inc. together with its consolidated subsidiaries, including Houston Electric and CERC, unless stated otherwise. No registrant makes any representations as to the information related solely to CenterPoint Energy, Inc. or the subsidiaries of CenterPoint Energy, Inc. other than itself. \nOVERVIEW\nBackground\nCenterPoint Energy is a public utility holding company. CenterPoint Energy’s operating subsidiaries own and operate electric transmission, distribution and generation facilities and natural gas distribution systems. For a detailed description of CenterPoint Energy’s operating subsidiaries, see Note 1 to the consolidated financial statements.\nHouston Electric is an indirect, wholly-owned subsidiary of CenterPoint Energy, which provides electric transmission service to transmission service customers in the ERCOT region and distribution service to REPs serving the Texas Gulf Coast area that includes the city of Houston. \nCERC Corp. is an indirect, wholly-owned subsidiary of CenterPoint Energy, which (i) directly owns and operates natural gas distribution systems in Louisiana, Minnesota, Mississippi and Texas, (ii) indirectly, through Indiana Gas and CEOH, owns and operates natural gas distribution systems in Indiana and Ohio, respectively, and (iii) owns and operates permanent pipeline connections through interconnects with various interstate and intrastate pipeline companies through CEIP. \nOn February 19, 2024, CenterPoint Energy, through its subsidiary CERC Corp., entered into the LAMS Asset Purchase Agreement to sell its Louisiana and Mississippi natural gas LDC businesses. The transaction is expected to close in the first quarter of 2025. For further information, see Note 4 to the consolidated financial statements. \nReportable Segments\nWe discuss our operating results on a consolidated basis and individually for each of our reportable segments. We are first and foremost an energy delivery company and it is our intention to remain focused on these regulated segments. The results of our business operations are significantly impacted by weather, customer growth, economic conditions, cost management, competition, rate proceedings before regulatory agencies and other actions of the various regulatory agencies to whose jurisdiction we are subject, among other factors. \nBelow is a summary of CenterPoint Energy’s reportable segments as of December 31, 2024. For a detailed description of the assets included in each reporting segment, see Part I, Item 1. Business.\n•\nThe Electric reportable segment includes electric transmission and distribution services that are subject to rate regulation in Houston Electric’s and Indiana Electric’s service territories, as well as the impacts of generation-related stranded costs and other true-up balances recoverable by the regulated electric utility and energy delivery services to electric customers and electric generation assets to serve electric customers and optimize those assets in the wholesale power market in Indiana Electric’s service territory.\n•\nThe Natural Gas reportable segment includes (i) intrastate natural gas sales to, and natural gas transportation and distribution for residential, commercial and industrial customers in Indiana, Louisiana, Minnesota, Mississippi, Ohio and Texas; (ii) permanent pipeline connections through interconnects with various interstate and intrastate pipeline companies through CEIP; and (iii) home appliance maintenance and repair services to customers in Minnesota and home repair protection plans to natural gas customers in Indiana, Mississippi, Ohio and Texas through a third party.\n49\n•\nThe Corporate and Other reportable segment includes (i) energy performance contracting and sustainable infrastructure services by Energy Systems Group through June 30, 2023, the date of the sale of Energy Systems Group; (ii)  corporate operations that support the business operations of CenterPoint Energy; and (iii) office buildings and other real estate used for business operations.\nHouston Electric and CERC each consist of a single reportable segment.\nEXECUTIVE SUMMARY\nWe expect our businesses to continue to be affected by the key factors and trends discussed below. Our expectations are based on assumptions made by us and information currently available to us. To the extent our underlying assumptions about, or interpretations of, available information prove to be incorrect, our actual results may vary materially from our expected results. \nFactors Influencing Our Businesses and Industry Trends\nWe are an energy delivery company with electric transmission and distribution, power generation, and natural gas distribution operations that serve more than seven million metered customers across six jurisdictions. The majority of our revenues are generated from the transmission and delivery of electricity and the sale of natural gas by our subsidiaries.\nWe continue to execute on our strategic goals for our businesses which were set in 2021. These include our ten-year capital plan from 2021 through 2030, a focus on targeting controllable operations and maintenance savings for the benefit of our customers, prudent capital funding including divestitures of non-core assets, and net zero and GHG emissions reduction goals. Our focus continues to be on the growth of our regulated utility businesses including our electric and gas utility operations, which comprise over 95% of our earnings for the year ended December 31, 2024. See Note 16 to the consolidated financial statements for further details.\nPursuant to this business strategy and in light of the nature of our businesses, significant amounts of capital investment are reflected in our current 10-year capital plan, which has increased to nearly $47.5 billion through 2030. These investments include a focus on additional system resiliency, reliability, and grid modernization. These investments are not only intended to meet our customers’ current needs, but are also in anticipation for further organic growth and load growth from increased electrification in our service territories. To fund these capital investments, we rely on internally-generated cash, borrowings under our credit facilities, proceeds from commercial paper, cash proceeds from strategic transactions (such as the divestitures of our Arkansas and Oklahoma LDC businesses in 2022, our Energy Systems Group divestiture in 2023 and the proposed sale of our Louisiana and Mississippi natural gas LDC businesses, which is expected to close in the first quarter of 2025), and issuances of equity and debt in the capital markets, including the issuance of non-recourse securitization bonds at Houston Electric related to costs incurred during the year ended December 31, 2024 due to the May 2024 Storm Events and Hurricane Beryl. \nWe strive to maintain investment grade ratings for our securities to access the capital markets on terms we consider reasonable. A reduction in our ratings generally would increase our borrowing costs for new issuances of debt, as well as borrowing costs under our existing revolving credit facilities, and may prevent us from accessing the commercial paper markets. Disruptions in the financial markets along with high or rising interest rates can also affect the availability of new capital on terms we consider attractive. In those circumstances, we may not be able to obtain certain types of external financing or may be required to accept terms less favorable than we would otherwise accept which, among other things, would negatively impact our ability to finance our capital plan. For that reason, we seek to maintain adequate liquidity for our businesses through existing credit facilities and prudent refinancing of existing debt. \nThe regulation of electric transmission, distribution and generation facilities as well as natural gas pipelines and related facilities by federal and state regulatory agencies affects our businesses. In accordance with applicable regulations, we are making, and will continue to make, significant capital investments in our service territories under our capital plan to help operate and maintain safer, more reliable and growing electric and natural gas systems. The current economic environment (e.g., sustained higher interest rates and higher relative levels of inflation in the United States) discussed further below could result in heightened regulatory scrutiny as these regulatory agencies seek to reduce the financial impact of utility bills on customers. \nWhile greater than 80% of CenterPoint Energy’s projected consolidated investments are expected to be recovered through interim capital recovery trackers or rate cases based on a forward test year, the balance is expected to be recovered through base rate cases.\n \nIndiana Electric filed a rate case during 2023, and Houston Electric and CERC’s Ohio jurisdiction filed rate cases in 2024. The outcome of these base rate proceedings will determine, among other things, the ability to recover certain capital \n50\ninvestments within those jurisdictions. The outcome of these base rate proceedings is uncertain and may be impacted by the current economic environment. CERC’s Texas and Minnesota gas jurisdictions filed rate cases in 2023, which were settled in 2024. For additional detail, see  “—Liquidity and Capital Resources —Regulatory Matters” below.\nTo assess our financial performance, our management primarily monitors the recovery of costs and return on investments by the evaluation of net income and capital expenditures, among other things, from our regulated service territories within our reportable segments. Within these broader financial measures, we monitor margins, natural gas and fuel costs, interest expense, capital spend, working capital requirements, and operation and maintenance expense. In addition to these financial measures, we also monitor a number of variables that management considers important to gauge the performance of our reportable segments, including the number of customers, throughput, commodity prices, heating and cooling degree days, environmental impacts, safety factors, system reliability and customer satisfaction.\nCenterPoint Energy and CERC have weather normalization or other rate mechanisms that largely mitigate the impact of weather on Natural Gas in Indiana, Louisiana, Mississippi, Minnesota and Ohio, as applicable. CenterPoint Energy’s and CERC’s Natural Gas in Texas and CenterPoint Energy’s electric operations in Texas and Indiana do not have such mechanisms, although fixed customer charges are historically higher in Texas for Natural Gas compared to its other jurisdictions. As a result, fluctuations from normal weather may have a positive or negative effect on CenterPoint Energy’s and CERC’s Natural Gas’ results in Texas and on CenterPoint Energy’s electric operations’ results in its Texas and Indiana service territories. \nEach state has a unique economy and is driven by different industrial sectors. Our largest customers reflect the diversity in industries in the states across our footprint. For example, Houston Electric is largely concentrated in Houston, a diverse economy where a higher percentage of employment is tied to the energy sector relative to other regions of the country. Although the Houston area represents a large part of our customer base, we have a diverse customer base throughout the various states our utility businesses serve. In Minnesota, for instance, education and health services are the state’s largest sectors. Indiana and Ohio are impacted by changes in the Midwest economy in general and changes in particular industries concentrated in the Midwest such as automotive, feed and grain processing. Some industries are driven by population growth like education and health care, while others may be influenced by strength in the national or international economy. Adverse economic conditions, coupled with concerns for protecting the environment and increased availability of alternate energy sources, may cause consumers to use less energy or avoid expansions of their facilities, including natural gas facilities, resulting in less demand for our services. Long-term national trends indicate residential customers have reduced their energy consumption, which could adversely affect our results. To the extent population growth is affected by lower energy prices and there is financial pressure on some of our customers who operate within the energy industry, there may be an impact on the growth rate of our customer base and overall demand. Management expects residential meter growth for Houston Electric to remain in line with long term trends at approximately 2%. Management additionally anticipates significant increased electric load growth demand in our Houston Electric service territory, including in relation to the expected expansion of data centers, energy export facilities, including hydrogen facilities, electrification of industrial processes and transport and logistics. Typical customer growth in the jurisdictions served by the Natural Gas reportable segment is approximately 1%. Management expects residential meter growth for CERC to remain in line with long term trends at approximately 1%. \nInflation and high interest rates and a recessionary environment could potentially adversely impact CenterPoint Energy’s ability to execute on its 10-year capital plan. The inability to execute on our capital plan may result in lost future revenues for CenterPoint Energy. Additionally, these economic conditions may affect customers’ ability to pay their utility bills which may preclude our ability to collect balances due from such customers.\nFurther, the global supply chain has experienced significant disruptions due to a multitude of factors, such as geopolitical and economic uncertainty, regulatory and political instability, import tariffs and trade agreements, labor shortages, resource availability, long lead times, manufacturer production limitations, delivery delays, inflation and severe weather events. These disruptions have adversely impacted the utility industry. Like many of our peers, we have experienced disruptions to our supply chain, as well as increased prices, and may continue to experience such disruptions in the future. For example, President Trump has expressed a desire to impose substantial new or increased tariffs, and in February 2025, imposed tariffs on several countries and certain imports into the United States. These tariffs, as well as any new legislation, tariffs, bans, potential retaliatory trade measures taken against the United States or related governmental action, could increase or cause volatility in the cost of and negatively impact our ability to procure materials, supplies (such as natural gas) or services necessary for our business and capital plan, lead to scarcity of resources and labor necessary for our business and capital plan, further extend lead time or otherwise negatively impact the supply chain and our ability to timely execute our capital plan. To the extent adverse economic conditions, including supply chain disruptions, affect our suppliers and customers as well as our ability to meet our capital plan and generation transition plan, including with respect to developing and constructing new generation facilities at the cost and scale and on the timelines that we anticipate, results from our energy delivery businesses may suffer. For more information, see Note 14 to the consolidated financial statements. \n51\nFurther, in response to concerns for protecting the environment, we have strived to take a leading stance in the transition to safer and cleaner energy by being the first combined electric and natural gas utility with regulated generation assets to adopt net zero for its Scope 1 and certain Scope 2 emissions by 2035 goals. In addition, we set a Scope 3 emission reduction goal across our multi-state footprint by committing to help our residential and commercial customers reduce GHG emissions attributable to their end use of natural gas by 20% to 30% by 2035 from a 2021 baseline. Our capital plan supports these goals. For more information regarding CenterPoint Energy’s net zero and GHG emissions reduction goals and the risks associated with them, see Part I,"
}