{
  "ticker": "COF",
  "cik": "0000927628",
  "company_name": "CAPITAL ONE FINANCIAL CORP",
  "filing_date": "2025-02-20",
  "accession": "0000927628-25-000092",
  "primary_doc": "cof-20241231.htm",
  "item1_text": "Item 1.\n \nBusiness—Supervision and Regulation—Capital and Stress Testing Regulation—\nStress Capital Buffer Rule.” Our capital and leverage ratios are calculated based on the Basel III standardized approach framework.\nWe have elected to exclude certain elements of accumulated other comprehensive income (“AOCI”)  from our regulatory capital as permitted for a Category III institution. For information on the recognition of AOCI in regulatory capital under the proposed changes to the Basel III Capital Rules, see “Part I—Item 1. Business—Supervision and Regulation—Capital and Stress Testing Regulation—Basel III Finalization Proposal.”\nThe Federal Reserve, OCC, and the Federal Deposit Insurance Corporation (“FDIC”) (collectively, “Federal Banking Agencies”) adopted a final rule (“CECL Transition Rule”) that provides banking institutions an optional five-year transition period to phase in the impact of the  CECL standard on their regulatory capital (the “CECL Transition Election”). We adopted the CECL standard (for accounting purposes) as of January 1, 2020, and made the CECL Transition Election (for regulatory capital purposes) in the first quarter of 2020. Therefore, the applicable amounts presented in this Report reflect such election.\nPursuant to the CECL Transition Rule, a banking institution could elect to delay the estimated impact of adopting CECL on its regulatory capital through December 31, 2021 and then phase in the estimated cumulative impact from January 1, 2022 through December 31, 2024. For the “day 2” ongoing impact of CECL during the initial two years, the Federal Banking Agencies used a uniform “scaling factor” of 25% as an approximation of the increase in the allowance under the CECL standard compared to the prior incurred loss methodology. Accordingly, from January 1, 2020 through December 31, 2021, electing banking institutions were permitted to add back to their regulatory capital an amount equal to the sum of the after-tax “day 1” CECL adoption impact and 25% of the increase in the allowance since the adoption of the CECL standard. From January 1, 2022 through December 31, 2024, the after-tax “day 1” CECL adoption impact and the cumulative “day 2” ongoing impact were being phased in to regulatory capital at 25% per year. The following table summarizes the capital impact delay and phase in period on our regulatory capital from years 2020 to 2025.\nCapital Impact Delayed\nPhase In Period\n2020\n2021\n2022\n2023\n2024\n2025\n“Day 1” CECL adoption impact\nCapital impact delayed to 2022\n25% Phased In\n50% Phased In\n75% Phased In\nFully Phased In\nCumulative “day 2” ongoing impact\n25% scaling factor as an approximation of the increase in allowance under CECL\nAs of December 31, 2021, we added back an aggregate amount of $\n2.4\n billion to our regulatory capital pursuant to the CECL Transition Rule. Consistent with the rule, we have phased in \n75%\n of this amount as of \nJanuary 1, 2024\n. The remaining \n201\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n$\n600\n million\n has been phased in on \nJanuary 1, 2025.\n  As of December 31, 2024, the Company’s CET1 capital ratio, reflecting the CECL Transition Rule, was \n13.5\n%\n and would have been \n13.3\n%\n excluding the impact of the CECL Transition Rule (or “on a fully phased-in basis”).\nFor additional information about the regulatory capital rules to which we are subject, including recent proposed amendments to these rules, see “Part I—Item 1. Business—Supervision and Regulation.”\nThe following table\n \nprovides a comparison of our regulatory capital amounts and ratios under the Basel III standardized approach subject to the applicable transition provisions, the regulatory minimum capital adequacy ratios and the applicable well-capitalized standard for each ratio as of December 31, 2024 and 2023.\nTable 12.1: Capital Ratios Under Basel III\n(1)\n \nDecember 31, 2024\nDecember 31, 2023\n(Dollars in millions)\nCapital Amount\nCapital\nRatio\nMinimum\nCapital\nAdequacy\nWell-\nCapitalized\nCapital Amount\nCapital\nRatio\nMinimum\nCapital\nAdequacy\nWell-\nCapitalized\nCapital One Financial Corp:\nCommon equity Tier 1 capital\n(2)\n$\n50,807\n \n13.5\n \n%\n4.5\n \n%\nN/A\n$\n47,615\n \n12.9\n \n%\n4.5\n \n%\nN/A\nTier 1 capital\n(3)\n55,652\n \n14.8\n6.0\n6.0\n%\n52,460\n \n14.2\n6.0\n6.0\n%\nTotal capital\n(4)\n61,805\n \n16.4\n8.0\n10.0\n59,124\n \n16.0\n8.0\n10.0\nTier 1 leverage\n(5)\n55,652\n \n11.6\n4.0\nN/A\n52,460\n \n11.2\n4.0\nN/A\nSupplementary leverage\n(6)\n55,652\n \n9.9\n3.0\nN/A\n52,460\n \n9.6\n3.0\nN/A\nCONA:\nCommon equity Tier 1 capital\n(2)\n51,118\n \n13.6\n4.5\n6.5\n47,933\n \n13.1\n4.5\n6.5\nTier 1 capital\n(3)\n51,118\n \n13.6\n6.0\n8.0\n47,933\n \n13.1\n6.0\n8.0\nTotal capital\n(4)\n56,937\n \n15.2\n8.0\n10.0\n52,636\n \n14.3\n8.0\n10.0\nTier 1 leverage\n(5)\n51,118\n \n10.7\n4.0\n5.0\n47,933\n \n10.3\n4.0\n5.0\nSupplementary leverage\n(6)\n51,118\n \n9.2\n3.0\nN/A\n47,933\n \n8.8\n3.0\nN/A\n__________\n(1)\nCapital requirements that are not applicable are denoted by “N/A.”\n(2)\nCET1 capital ratio is a regulatory capital measure calculated based on CET1 capital divided by risk-weighted assets.\n(3)\nTier 1 capital ratio is a regulatory capital measure calculated based on Tier 1 capital divided by risk-weighted assets.\n(4)\nTotal capital ratio is a regulatory capital measure calculated based on total capital divided by risk-weighted assets.\n(5)\nTier 1 leverage ratio is a regulatory capital measure calculated based on Tier 1 capital divided by adjusted average assets.\n(6)\nSupplementary leverage ratio is a regulatory capital measure calculated based on Tier 1 capital divided by total leverage exposure.\nWe \nexceeded\n the minimum capital requirements and the Bank \nexceeded\n the minimum regulatory requirements and was \nwell-capitalized\n under PCA requirements as of both \nDecember 31, 2024\n and 2023.\nRegulatory restrictions exist that limit the ability of  CONA to transfer funds to our BHC. As of December 31, 2024, funds available for dividend payments \nfrom\n the Bank were $\n8.9\n billion. Applicable provisions that may be contained in our borrowing agreements or the borrowing agreements of our subsidiaries may limit our subsidiaries’ ability to pay dividends to us or our ability to pay dividends to our stockholders.While the Merger Agreement is in effect and until the Merger Agreement is terminated or the Transaction is completed, we are restricted from paying quarterly cash dividends on our common stock in excess of $\n0.60\n per share per quarter. There can be no assurance that we will declare and pay any dividends to stockholders.  For additional information on the prior approval requirement on our capital distributions associated with our capital plan resubmission, see “Part I—Item 1.\n \nBusiness—Supervision and Regulation—Capital and Stress Testing Regulation—Capital Planning and Stress Testing.”\n202\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 13—EARNINGS PER COMMON SHARE\nThe following table sets forth the computation of basic and diluted earnings per common share for the years ended December 31, 2024, 2023 and 2022\n. \nDividends and undistributed earnings allocated to participating securities represent the application of the “two-class” method as described in “Note 1—Summary of Significant Accounting Policies.”\nTable 13.1: Computation of Basic and Diluted Earnings per Common Share \nYear Ended December 31,\n(Dollars and shares in millions, except per share data)\n2024\n2023\n2022\nNet income\n$\n4,750\n \n$\n4,887\n \n$\n7,360\n \nDividends and undistributed earnings allocated to participating securities\n(\n77\n)\n(\n77\n)\n(\n88\n)\nPreferred stock dividends\n(\n228\n)\n(\n228\n)\n(\n228\n)\nNet income available to common stockholders\n$\n4,445\n \n$\n4,582\n \n$\n7,044\n \nTotal weighted-average basic common shares outstanding\n382.7\n \n382.4\n \n391.8\n \nEffect of dilutive securities:\n(1)\nStock options\n0.2\n \n0.1\n \n0.3\n \nOther contingently issuable shares\n0.7\n \n0.9\n \n1.1\n \nTotal effect of dilutive securities\n0.9\n \n1.0\n \n1.4\n \nTotal weighted-average diluted common shares outstanding\n383.6\n \n383.4\n \n393.2\n \nBasic earnings per common share:\nNet income from continuing operations\n$\n11.60\n \n$\n11.98\n \n$\n17.98\n \nIncome (loss) from discontinued operations\n0.01\n \n0.00\n \n0.00\n \nNet income per basic common share\n$\n11.61\n \n$\n11.98\n \n$\n17.98\n \nDiluted earnings per common share:\n(1)\nNet income from continuing operations\n$\n11.58\n \n$\n11.95\n \n$\n17.91\n \nIncome (loss) from discontinued operations\n0.01\n \n0.00\n \n0.00\n \nNet income per diluted common share\n$\n11.59\n \n$\n11.95\n \n$\n17.91\n \n__________\n \n(1)\nExcluded from the computation of diluted earnings per share were awards of \n32\n thousand shares, \n27\n thousand shares and \n24\n thousand shares for the years ended December 31, 2024, 2023 and 2022, respectively, because their inclusion would be anti-dilutive. There were \nno\n options excluded from the computation for the years ended December 31, 2024, 2023 and 2022.\n ,,\n203\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 14—STOCK-BASED COMPENSATION PLANS\nStock Plans\nWe have \none\n active stock-based compensation plan available for the issuance of shares to employees and directors. As of December 31, 2024, under the Amended and Restated 2004 Stock Incentive plan (“2004 Plan”), we are authorized to issue \n81\n million common shares in various forms, primarily share-settled RSUs, PSUs and non-qualified stock options. Of this amount, approximately \n19\n million shares remain available for future issuance as of December 31, 2024. The 2004 Plan permits the use of newly issued shares or treasury shares upon the settlement of options and stock-based incentive awards, and we generally settle by issuing new shares. \nWe also issue cash-settled restricted stock units. These cash-settled units are not counted against the common shares authorized for issuance or available for issuance under the 2004 Plan. Cash-settled units vesting during 2024, 2023 and 2022 resulted in cash payments to associates of $\n5\n million, $\n4\n million and $\n8\n million, respectively. There was no unrecognized compensation cost for unvested cash-settled units as of December 31, 2024. \nTotal stock-based compensation expense recognized during 2024, 2023 and 2022 was $\n569\n million, $\n513\n million and $\n314\n million, respectively. The total income tax benefit for stock-based compensation recognized during 2024, 2023 and 2022 was $\n109\n million, $\n99\n million and $\n75\n million, respectively.\nIn addition, we maintain an Associate Stock Purchase Plan (“Purchase Plan”), which is a compensatory plan under the accounting guidance for stock-based compensation. Related to the Purchase Plan, we recognized compensation expense of $\n42\n million, $\n39\n million and $\n36\n million for 2024, 2023 and 2022, respectively. We also maintain a Dividend Reinvestment and Stock Purchase Plan, which allows participating stockholders to purchase additional shares of our common stock through automatic reinvestment of dividends or optional cash investments.\nRestricted Stock Units and Performance Share Units\nRSUs represent share-settled awards that do not contain performance conditions and are granted to certain employees at no cost to the recipient. RSUs generally vest over \nthree years\n from the date of grant; however, some RSUs cliff vest on or shortly after the first or third anniversary of the grant date. RSUs are subject to forfeiture until certain restrictions have lapsed, including continued employment for a specified period of time.\nPSUs represent share-settled awards that contain performance conditions and are granted to certain employees at no cost to the recipient. PSUs generally vest over \nthree years\n from the date of grant; however, some PSUs cliff vest on or shortly after the third anniversary of the grant date. The number of PSUs that vest over \nthree years\n can be reduced by \n50\n% or \n100\n% depending on whether specific performance goals are met during the vesting period. The number of \nthree-year\n cliff vesting PSUs that will ultimately vest is contingent upon meeting specific performance goals over a \nthree-year\n period. These PSUs also include an opportunity to receive from \n0\n% to \n150\n% of the target number of common shares.\nA recipient of an RSU or PSU is entitled to receive a share of common stock after the applicable restrictions lapse and is generally entitled to receive cash payments or additional shares of common stock equivalent to any dividends paid on the underlying common stock during the period the RSU or PSU is outstanding, but is not entitled to voting rights. Generally, the value of RSUs and PSUs will equal the fair value of our common stock on the date of grant and the expense is recognized over the vesting period. Certain PSUs have discretionary vesting conditions and are remeasured at fair value each reporting period. \n204\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table presents a summary of 2024 activity for RSUs and PSUs.\nTable 14.1: Summary of Restricted Stock Units and Performance Share Units\nRestricted Stock Units\nPerformance Share Units\n(1)\n(Shares/units in thousands)\nUnits \nWeighted-Average\nGrant Date\nFair Value\nper Unit\nUnits\nWeighted-Average\nGrant Date\nFair Value\nper Unit\nUnvested as of January 1, 2024\n6,447\n \n$\n118.16\n \n1,955\n \n$\n125.49\n \nGranted\n(2)\n3,024\n \n136.69\n \n1,039\n \n132.71\n \nVested\n(\n2,682\n)\n124.62\n \n(\n865\n)\n118.89\n \nForfeited\n(\n206\n)\n130.05\n \n(\n3\n)\n126.63\n \nUnvested as of December 31, 2024\n6,583\n \n$\n109.56\n \n2,126\n \n$\n131.73\n \n_________\n(1)\nGranted and vested include adjustments for achievement of specific performance goals for PSUs granted in prior periods.\n(2)\nThe weighted-average grant date fair value of RSUs was $\n113.08\n and $\n141.71\n in 2023 and 2022, respectively. The weighted-average grant date fair value of PSUs was $\n115.09\n and $\n139.00\n in 2023 and 2022, respectively.\nThe total fair value of RSUs that vested during 2024, 2023 and 2022 was $\n376\n million, $\n233\n million and $\n248\n million, respectively. The total fair value of PSUs that vested was $\n119\n million,  $\n91\n million and $\n127\n million in 2024, 2023 and 2022, respectively. As of December 31, 2024, the unrecognized compensation expense related to unvested RSUs is $\n414\n million, which is expected to be amortized over a weighted-average period of approximately \n1.5\n years; and the unrecognized compensation related to unvested PSUs was $\n55\n million, which is expected to be amortized over a weighted-average period of approximately \n1\n year.\nStock Options\nStock options have a maximum contractual term of \n10\n years. Generally, the exercise price of stock options will equal the fair market value of our common stock on the date of grant. Option vesting is determined at the time of grant and may be subject to the achievement of any applicable performance conditions. Options generally become exercisable over \nthree years\n beginning on the first anniversary of the date of grant; however, some option grants cliff vest on or shortly after the first or third anniversary of the grant date.\nThe following table presents a summary of 2024 activity for stock options and the balance of stock options exercisable as of December 31, 2024.\nTable 14.2: Summary of Stock Options Activity\n(Shares in thousands, and intrinsic value in millions)\nShares\nSubject to\nOptions\nWeighted-\nAverage\nExercise\nPrice\nWeighted-\nAverage\nRemaining\nContractual\nTerm\nAggregate\nIntrinsic\nValue\nOutstanding as of January 1, 2024\n404\n \n$\n75.46\n \nGranted\n0\n \n0.00\n \nExercised\n(\n176\n)\n76.91\n \nForfeited\n0\n \n0.00\n \nExpired\n0\n \n0.00\n \nOutstanding and Exercisable as of December 31, 2024\n228\n \n$\n74.34\n \n1.56\n years\n$\n24\n \nThere were \nno\n stock options granted in 2024, 2023 and 2022. The total intrinsic value of stock options exercised during 2024, 2023 and 2022 was $\n11\n million, $\n5\n million and $\n18\n million, respectively.\n205\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 15—EMPLOYEE BENEFIT PLANS\nDefined Contribution Plan\nWe sponsor a contributory Associate Savings Plan (the “Plan”) in which all full-time and part-time associates over the age of \n18\n are eligible to participate. We make non-elective contributions to each eligible associate’s account and match a portion of associate contributions. We also sponsor a voluntary non-qualified deferred compensation plan in which select groups of employees are eligible to participate. We make contributions to this plan based on participants’ deferral of salary, bonuses and other eligible pay. In addition, we match participants’ excess compensation (compensation over the Internal Revenue Service (“IRS”) compensation limit) less deferrals. We contributed $\n492\n million during the years ended December 31, 2024 and 2023 and $\n444\n million during the year ended December 31, 2022 to these plans.\nDefined Benefit Pension and Other Postretirement Benefit Plans\nWe sponsor several frozen plans, including a qualified defined benefit pension plan, several non-qualified defined benefit pension plans, and a plan that provides other postretirement benefits, including medical and life insurance coverage. Our pension plans and the other postretirement benefit plan are valued using December 31 as the measurement date each year. Our policy is to amortize prior service amounts on a straight-line basis over the average remaining years of service to full eligibility for benefits of active plan participants.\nWe are currently in the process of terminating the qualified defined benefit pension plan noted above and certain other postretirement benefits coverage. A Notice of Intent to Terminate (“NOIT”) the plan was distributed to plan participants on January 21, 2025 and a request for qualified status determination was filed with the IRS on February 13, 2025. Termination activities are expected to continue through the first quarter of 2026.\nThe following table sets forth, on an aggregated basis, changes in the benefit obligation and plan assets, the funded status and how the funded status is recognized on our consolidated balance sheets.    \nTable 15.1: Changes in Benefit Obligation and Plan Assets\nDefined Pension \nBenefits\nOther Postretirement\nBenefits\n(Dollars in millions)\n2024\n2023\n2024\n2023\nChange in benefit obligation:\nAccumulated benefit obligation as of January 1, \n$\n127\n \n$\n128\n \n$\n10\n \n$\n12\n \nService cost\n1\n \n1\n \n0\n \n0\n \nInterest cost\n6\n \n7\n \n0\n \n0\n \nBenefits paid\n(\n11\n)\n(\n10\n)\n(\n1\n)\n(\n2\n)\nActuarial loss (gain)\n(\n5\n)\n1\n \n0\n \n0\n \nAccumulated benefit obligation as of December 31,\n$\n118\n \n$\n127\n \n$\n9\n \n$\n10\n \nChange in plan assets:\nFair value of plan assets as of January 1, \n$\n236\n \n$\n222\n \n$\n5\n \n$\n5\n \nActual return on plan assets\n15\n \n23\n \n1\n \n1\n \nEmployer contributions\n1\n \n1\n \n1\n \n1\n \nBenefits paid\n(\n11\n)\n(\n10\n)\n(\n1\n)\n(\n2\n)\nFair value of plan assets as of December 31, \n$\n241\n \n$\n236\n \n$\n6\n \n$\n5\n \nOver (under) funded status as of December 31, \n$\n123\n \n$\n109\n \n$\n(\n3\n)\n$\n(\n5\n)\n206\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDefined Pension \nBenefits\nOther Postretirement\nBenefits\n(Dollars in millions)\n2024\n2023\n2024\n2023\nBalance sheet presentation as of December 31, \nOther assets\n$\n131\n \n$\n117\n \n$\n0\n \n$\n0\n \nOther liabilities\n(\n8\n)\n(\n8\n)\n(\n3\n)\n(\n5\n)\nNet amount recognized as of December 31, \n$\n123\n \n$\n109\n \n$\n(\n3\n)\n$\n(\n5\n)\nNet periodic benefit gain for our defined benefit pension plans and other postretirement benefit plan was $\n6\n million in both 2024 and 2023 and $\n8\n million in 2022. We recognized pre-tax gains of $\n8\n million in 2024 and $\n9\n million in 2023 and pre-tax losses of $\n24\n million in 2022 in AOCI for our defined benefit pension plans and our other postretirement benefit plan.\nPre-tax amounts recognized in AOCI that have not yet been recognized as a component of net periodic benefit cost consist of net actuarial losses of $\n39\n million and $\n47\n million for our defined benefit pension plans as of December 31, 2024 and 2023, respectively, and net actuarial gains of $\n2\n million for our other postretirement benefit plan as of both December 31, 2024 and 2023. There was no meaningful prior service cost recognized in AOCI.\nPlan Assets and Fair Value Measurement\nPlan assets are invested using a total return investment approach whereby a mix of equity securities and debt securities are used to preserve asset values, diversify risk and enhance our ability to achieve our benchmark for long-term investment return. Investment strategies and asset allocations are based on careful consideration of plan liabilities, the plan’s funded status and our financial condition. Investment performance and asset allocation are measured and monitored on a daily basis.\nAs of December 31, 2024 and 2023, our plan assets totaled $\n247\n million and $\n241\n million, respectively. We invested substantially all our plan assets in common collective trusts, which primarily consist of domestic and international equity securities, government securities and corporate and municipal bonds. Our plan assets were classified as Level 2 in the fair value hierarchy as of December 31, 2024 and 2023. For information on fair value measurements, including descriptions of Level 1, 2 and 3 of the fair value hierarchy, see “Note 17—Fair Value Measurement.”\nExpected Future Benefit Payments\nAs of December 31, 2024, the benefits expected to be paid in the next ten years totaled \n$\n103\n million\n for our defined pension benefit plans and \n$\n9\n million\n for our other postretirement benefit plan, respectively.\n207\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 16—INCOME TAXES\nWe recognize the current and deferred tax consequences of all transactions that have been recognized in the financial statements using the provisions of the enacted tax laws. Current income tax expense represents our estimated taxes to be paid or refunded for the current period and includes income tax expense related to our uncertain tax positions, as well as tax-related interest and penalties. Deferred tax assets and liabilities are determined based on differences between the financial reporting and tax basis of assets and liabilities and are measured using the enacted tax rates and laws that will be in effect when the differences are expected to reverse. We record valuation allowances to reduce deferred tax assets to the amount that is more likely than not to be realized. We record the effect of remeasuring deferred tax assets and liabilities due to a change in tax rates or laws as a component of income tax expense related to continuing operations for the period in which the change is enacted. We release income tax effects stranded in AOCI when an entire portfolio of the type of item is sold, terminated or extinguished. Income tax benefits are recognized when, based on their technical merits, they are more likely than not to be sustained upon examination. The amount recognized is the largest amount of benefit that is more likely than not to be realized upon settlement.\nThe following table presents significant components of the provision for income taxes attributable to continuing operations for the years ended December 31, 2024, 2023 and 2022.\nTable 16.1: Significant Components of the Provision for Income Taxes Attributable to Continuing Operations\n \nYear Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nCurrent income tax provision:\nFederal taxes\n$\n1,598\n \n$\n1,423\n \n$\n2,125\n \nState taxes\n395\n \n382\n \n423\n \nInternational taxes\n23\n \n76\n \n104\n \nTotal current provision\n$\n2,016\n \n$\n1,881\n \n$\n2,652\n \nDeferred income tax provision (benefit):\nFederal taxes\n$\n(\n704\n)\n$\n(\n547\n)\n$\n(\n662\n)\nState taxes\n(\n178\n)\n(\n145\n)\n(\n112\n)\nInternational taxes\n29\n \n(\n31\n)\n2\n \nTotal deferred provision (benefit)\n(\n853\n)\n(\n723\n)\n(\n772\n)\nTotal income tax provision\n$\n1,163\n \n$\n1,158\n \n$\n1,880\n \nThe international income tax provision is related to pre-tax earnings from foreign operations of approximately $\n266\n million, $\n230\n million and $\n462\n million in 2024, 2023 and 2022, respectively.\nTotal income tax provision does not reflect the tax effects of items that are included in AOCI, which include a tax benefit of  $\n280\n million in 2024, tax provision of $\n455\n million in 2023, and a tax benefit of $\n3.2\n billion in 2022. See “Note 11—Stockholders’ Equity” for additional information.\n208\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table presents the reconciliation of the U.S. federal statutory income tax rate to the effective income tax rate applicable to income from continuing operations for the years ended December 31, 2024, 2023 and 2022.\nTable 16.2: Effective Income Tax Rate\n \nYear Ended December 31,\n2024\n2023\n2022\nIncome tax at U.S. federal statutory tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState taxes, net of federal benefit\n3.5\n \n3.4\n \n3.1\n \nNon-deductible expenses\n1.6\n \n1.4\n \n0.6\n \nAffordable housing, new markets and other tax credits\n(\n6.2\n)\n(\n6.8\n)\n(\n4.2\n)\nTax-exempt interest and other nontaxable income\n(\n0.9\n)\n(\n0.8\n)\n(\n0.4\n)\nChanges in valuation allowance\n0.6\n \n0.8\n \n1.0\n \nOther, net\n0.1\n \n0.2\n \n(\n0.8\n)\nEffective income tax rate\n19.7\n \n%\n19.2\n \n%\n20.3\n \n%\nThe following table presents significant components of our deferred tax assets and liabilities as of December 31, 2024 and 2023. The valuation allowance below represents the adjustment of our foreign tax credit carryforward, certain state deferred tax assets and net operating loss carryforwards to the amount we have determined is more likely than not to be realized.\nTable 16.3: Significant Components of Deferred Tax Assets and Liabilities\n(Dollars in millions)\nDecember 31, 2024\nDecember 31, 2023\nDeferred tax assets:\nAllowance for credit losses\n$\n3,730\n \n$\n3,538\n \nNet unrealized loss on securities\n2,527\n \n2,223\n \nRewards programs\n898\n \n801\n \nPremises, equipment and software\n607\n \n278\n \nNet operating loss and tax credit carryforwards\n519\n \n514\n \nNet unrealized loss on derivatives\n505\n \n470\n \nCompensation and employee benefits\n479\n \n444\n \nOther assets\n997\n \n974\n \nSubtotal\n10,262\n \n9,242\n \nValuation allowance\n(\n529\n)\n(\n496\n)\nTotal deferred tax assets\n9,733\n \n8,746\n \nDeferred tax liabilities:\nRight-of-use assets\n248\n \n253\n \nPartnership investments\n133\n \n148\n \nGoodwill and intangibles\n116\n57\nMortgage servicing rights\n76\n \n85\n \nLoan Fees & Expenses\n48\n48\nOriginal issue discount\n0\n \n121\nOther liabilities\n60\n \n95\n \nTotal deferred tax liabilities\n681\n \n807\n \nNet deferred tax assets\n$\n9,052\n \n$\n7,939\n \nOur gross federal net operating loss carryforwards were $\n3\n million and $\n7\n million as of December 31, 2024 and 2023, respectively. The net tax values of our state net operating loss and interest deduction carryforwards were $\n301\n million and $\n273\n million as of December 31, 2024 and 2023, respectively, and they will expire from 2025 to 2043. Our foreign tax credit carryforwards were $\n214\n million and $\n207\n million as of December 31, 2024 and 2023, respectively, and they will expire from 2029 to 2034. \n209\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nOur valuation allowance increased by $\n33\n million to $\n529\n million as of December 31, 2024 compared to $\n496\n million as of December 31, 2023. Of the total increase, $\n7\n million is related to the current year increase in our foreign tax credit carryforwards that will not be realized prior to expiration and $\n29\n million increase is related to increased state net operating losses and interest carryforwards to the amount we have determined is more likely than not to be realized.\nWe recognize accrued interest and penalties related to income taxes as a component of income tax expense. We recognized a $\n4\n million and $\n1\n million tax expense in 2024 and 2023, respectively, and $\n1\n million tax benefit in 2022.\nThe following table presents the accrued balance of tax, interest and penalties related to unrecognized tax benefits.\nTable 16.4: Reconciliation of the Change in Unrecognized Tax Benefits\n(Dollars in millions)\nGross\nUnrecognized\nTax Benefits\nAccrued\nInterest and\nPenalties\nGross Tax,\nInterest and\nPenalties\nBalance as of January 1, 2022\n$\n405\n \n$\n14\n \n$\n419\n \nAdditions for tax positions related to the current year\n3\n \n0\n \n3\n \nAdditions for tax positions related to prior years\n14\n \n6\n \n20\n \nReductions for tax positions related to prior years due to IRS and other settlements\n(\n381\n)\n(\n10\n)\n(\n391\n)\nBalance as of December 31, 2022\n41\n \n10\n \n51\n \nAdditions for tax positions related to the current year\n2\n \n0\n \n2\n \nAdditions for tax positions related to prior years\n10\n \n4\n \n14\n \nReductions for tax positions related to prior years due to IRS and other settlements\n(\n20\n)\n(\n7\n)\n(\n27\n)\nBalance as of December 31, 2023\n33\n \n7\n \n40\n \nAdditions for tax positions related to the current year\n12\n \n0\n \n12\n \nAdditions for tax positions related to prior years\n28\n \n5\n \n33\n \nReductions for tax positions related to prior years due to IRS and other settlements\n(\n8\n)\n(\n1\n)\n(\n9\n)\nBalance as of December 31, 2024\n$\n65\n \n$\n11\n \n$\n76\n \nPortion of balance at December 31, 2024 that, if recognized, would impact the effective income tax rate\n$\n60\n \n$\n9\n \n$\n69\n \nWe are subject to examination by the IRS and other tax authorities in certain countries and states in which we operate. The tax years subject to examination vary by jurisdiction. During 2024, we continued to participate in the IRS Compliance Assurance Process (“CAP”) for our open federal income tax return years and have been accepted into CAP f\nor 2025. During 2024, the IRS continued its post-filing examination of our 2021 and 2022 Federal income tax returns and pre-filings examination of our 2023 Federal income tax return.We expect our 2021, 2022 and 2023 exams to be concluded by December 31, 2025. We also expect that the IRS review of our 2024 Federal income tax return will be substantially completed in 2025 prior to its filing.\nIt is reasonably possible that further adjustments to the Company’s unrecognized tax benefits may be made within 12 months of the reporting date as a result of future judicial or regulatory interpretations of existing tax laws. At this time, an estimate of the potential changes to the amount of unrecognized tax benefits cannot be made.\nAs of December 31, 2024, the Company had approximately $\n1.6\n billion of unremitted earnings of subsidiaries operating outside the U.S. that upon repatriation would have no additional U.S. income taxes. In accordance with the guidance for accounting for income taxes in special areas, nearly all these earnings are considered by management to be invested indefinitely.\nAs of December 31, 2024, retained earnings included approximately $\n287\n million of pre-1987 bad debt reserves of acquired thrift institutions, for which no deferred federal income tax liability has been recognized. These amounts are subject to recapture and to federal income tax at the current corporate tax rate in the unlikely event that CONA, as the successor to the merged and acquired entities, makes distributions in excess of earnings and profits, redeems its stock or liquidates.\n210\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 17—FAIR VALUE MEASUREMENT\nFair value, also referred to as an exit price, is defined as the price that would be received for an asset or paid to transfer a liability in an orderly transaction between market participants on the measurement date. The fair value accounting guidance provides a three-level fair value hierarchy for classifying financial instruments. This hierarchy is based on the markets in which the assets or liabilities trade and whether the inputs to the valuation techniques used to measure fair value are observable or unobservable. The fair value measurement of a financial asset or liability is assigned a level based on the lowest level of any input that is significant to the fair value measurement in its entirety. The three levels of the fair value hierarchy are described below:\nLevel 1:\nValuation is based on quoted prices (unadjusted) in active markets for identical assets or liabilities.\nLevel 2:\nValuation is based on observable market-based inputs other than Level 1 prices, such as quoted prices for similar assets or liabilities, quoted prices in markets that are not active, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3:\nValuation is generated from techniques that use significant assumptions not observable in the market. Valuation techniques include pricing models, DCF methodologies or similar techniques.\nThe accounting guidance for fair value measurements requires that we maximize the use of observable inputs and minimize the use of unobservable inputs in determining fair value. We consider all available information, including observable market data, indications of market liquidity and orderliness, and our understanding of the valuation techniques and significant inputs. Based upon the specific facts and circumstances of each instrument or instrument category, judgments are made regarding the significance of the observable or unobservable inputs to the instruments’ fair value measurement in its entirety. If unobservable inputs are considered significant, the instrument is classified as Level 3. The process for determining fair value using unobservable inputs is generally more subjective and involves a high degree of management judgment and assumptions. The accounting guidance provides for the irrevocable option to elect, on a contract-by-contract basis, to measure certain financial assets and liabilities at fair value at inception of the contract and record any subsequent changes in fair value in earnings.\nAssets and Liabilities Measured at Fair Value on a Recurring Basis\nThe following describes the valuation techniques used in estimating the fair value of our financial assets and liabilities recorded at fair value on a recurring basis. The determination of the leveling of financial instruments in the fair value hierarchy is performed at the end of each reporting period. \nInvestment Securities\nWe measure the fair value of our U.S. Treasury securities using quoted prices in active markets. For the majority of securities in other investment categories, we utilize multiple vendor pricing services to obtain fair value measurements. We use a waterfall of pricing vendors determined using our annual assessment of pricing service performance. A pricing service may be considered as the preferred or primary pricing provider depending on how closely aligned its prices are to other vendor prices, and how consistent the prices are with other available market information. The price of each security is confirmed by comparing such price to other vendor prices before it is finalized.\nRMBS and CMBS are generally classified as Level 2 or 3. When significant assumptions are not consistently observable, fair values are derived using the best available data. Such data may include quotes provided by dealers, valuation from external pricing services, independent pricing models, or other model-based valuation techniques, for example, calculation of the present values of future cash flows incorporating assumptions such as benchmark yields, spreads, prepayment speeds, credit ratings and losses. Generally, the external pricing services utilize observable market data to the extent available. Pricing models may be used, which can vary by asset class, and may also incorporate available trade, bid and other market information. Across asset classes, information such as trader/dealer inputs, credit spreads, forward curves and prepayment speeds are used to help determine appropriate valuations. Because many fixed income securities do not trade on a daily basis, the pricing models may apply available information through processes such as benchmarking curves, grouping securities based on their characteristics and using matrix pricing to prepare valuations. In addition, model processes are used by the pricing services to develop prepayment assumptions.\n211\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nWe validate the pricing obtained from the primary pricing providers through comparison of pricing to additional sources, including other pricing services, dealer pricing indications in transaction results and other internal sources. Pricing variances among different pricing sources are analyzed. Additionally, on an on-going basis, we request more detailed information from the valuation vendors to understand the pricing methodology and assumptions used to value the securities.\nDerivative Assets and Liabilities\nWe use both exchange-traded and OTC derivatives to manage our interest rate, foreign currency and commodity risk exposures. When quoted market prices are available and used to value our exchange-traded derivatives, we classify them as Level 1. However, the majority of our derivatives do not have readily available quoted market prices. Therefore, we value most of our derivatives using vendor-based models. We primarily rely on market observable inputs for these models, including, for example, interest rate yield curves, credit curves, option volatility and currency rates. These inputs can vary depending on the type of derivatives and nature of the underlying rate, price or index upon which the value of the derivative is based. We typically classify derivatives as Level 2 when significant inputs can be observed in a liquid market and the model itself does not require significant judgment. When instruments are traded in less liquid markets and significant inputs are unobservable, such as interest rate swaps whose remaining terms do not correlate with market observable interest rate yield curves, such derivatives are classified as Level 3. We consider the impact of credit risk valuation adjustments when measuring the fair value of derivative contracts in order to reflect the credit quality of the counterparty and our own credit quality. Our internal pricing is compared against additional pricing sources such as external valuation agents and other internal sources. Pricing variances among different pricing sources are analyzed and validated. These derivatives are included in other assets or other liabilities on our consolidated balance sheets.\nLoans Held for Sale\nIn our commercial business, we originate multifamily commercial real estate loans with the intent to sell them to GSEs. We elect the fair value option for such loans as part of our management of interest rate risk in our multifamily agency business. These held for sale loans are valued based on market observable inputs and are therefore classified as Level 2. Unrealized gains and losses on these loans are recorded in other non-interest income in our consolidated statements of income.\nRetained Interests in Securitizations \nWe have retained interests in various mortgage securitizations from previous acquisitions. Our retained interests primarily include interest-only bonds and negative amortization bonds. We record these retained interests at fair value using market indications and valuation models to calculate the present value of future cash flows. Due to the use of significant unobservable inputs such as prepayment and discount rate assumptions, retained interests in securitizations are classified as Level 3 under the fair value hierarchy.\nDeferred Compensation Plan Assets\nWe offer a voluntary non-qualified deferred compensation plan to eligible associates. In addition to participant deferrals, we make contributions to the plan. Participants invest these contributions in a variety of publicly traded mutual funds. The plan assets, which consist of those publicly traded mutual funds, are classified as Level 1. \n212\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAssets and Liabilities Measured at Fair Value on a Recurring Basis\nThe following table displays our assets and liabilities measured on our consolidated balance sheets at fair value on a recurring basis as of December 31, 2024 and 2023.\nTable 17.1: Assets and Liabilities Measured at Fair Value on a Recurring Basis\nDecember 31, 2024\nFair Value Measurements Using\nNetting Adjustments\n(1)\n(Dollars in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\nSecurities available for sale:\nU.S. Treasury securities\n$\n6,110\n \n$\n0\n \n$\n0\n \n$\n0\n \n$\n6,110\n \nRMBS\n0\n \n65,212\n \n116\n \n0\n65,328\n \nCMBS\n0\n \n7,823\n \n2\n \n0\n7,825\n \nOther securities\n123\n \n3,627\n \n0\n \n0\n3,750\n \nTotal securities available for sale\n6,233\n \n76,662\n \n118\n \n0\n83,013\n \nLoans held for sale\n0\n \n87\n \n0\n \n0\n87\n \nOther assets:\nDerivative assets\n(2)\n510\n \n1,039\n \n683\n \n(\n1,056\n)\n1,176\n \nOther\n(3)\n689\n \n0\n \n34\n \n0\n723\n \nTotal assets\n$\n7,432\n \n$\n77,788\n \n$\n835\n \n$\n(\n1,056\n)\n$\n84,999\n \nLiabilities:\nOther liabilities:\nDerivative liabilities\n(2)\n$\n384\n \n$\n1,034\n \n$\n614\n \n$\n(\n304\n)\n$\n1,728\n \nTotal liabilities\n$\n384\n \n$\n1,034\n \n$\n614\n \n$\n(\n304\n)\n$\n1,728\n \nDecember 31, 2023\nFair Value Measurements Using\nNetting Adjustments\n(1)\n(Dollars in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\nSecurities available for sale:\nU.S. Treasury securities\n$\n5,282\n \n$\n0\n \n$\n0\n \n$\n0 \n$\n5,282\n \nRMBS\n0\n \n63,492\n \n146\n \n0\n63,638\n \nCMBS\n0\n \n8,191\n \n132\n \n0\n8,323\n \nOther securities\n126\n \n1,748\n \n0\n \n0\n1,874\n \nTotal securities available for sale\n5,408\n \n73,431\n \n278\n \n0\n79,117\n \nLoans held for sale\n0\n \n347\n \n0\n \n0\n347\n \nOther assets:\nDerivative assets\n(2)\n788\n \n1,001\n \n886\n \n(\n1,005\n)\n1,670\n \nOther\n(3)\n589\n \n3\n \n35\n \n0\n627\n \nTotal assets\n$\n6,785\n \n$\n74,782\n \n$\n1,199\n \n$\n(\n1,005\n)\n$\n81,761\n \nLiabilities:\nOther liabilities:\nDerivative liabilities\n(2)\n$\n449\n \n$\n1,655\n \n$\n828\n \n$\n(\n597\n)\n$\n2,335\n \nTotal liabilities\n$\n449\n \n$\n1,655\n \n$\n828\n \n$\n(\n597\n)\n$\n2,335\n \n__________\n(1)\nRepresents balance sheet netting of derivative assets and liabilities, and related payables and receivables for cash collateral held or placed with the same counterparty. See “Note 10—Derivative Instruments and Hedging Activities” for additional information.\n(2)\nDoes not reflec\nt approximate\nly\n $\n1\n million\n and $\n2\n million recognized as a net valuation allowance on derivative assets and liabilities for non-performance risk as of December 31, 2024 and \n2023\n, respectively. Non-performance risk is included in the measurement of derivative assets and liabilities on our consolidated balance sheets, and is recorded through non-interest income in the consolidated statements of income.\n213\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(3)\nAs of December 31, 2024 and \n2023\n, other includes retained interests in securitizations o\nf $\n34\n million\n and $\n35\n million, deferred compensation plan assets of \n$\n688\n million\n and $\n578\n million and equity securities of \n$\n1\n million\n and\n $\n14\n million (including unrealized gains of $\n5\n million), respectively.\nLevel 3 Recurring Fair Value Rollforward\nThe table below presents a reconciliation for all assets and liabilities measured and recognized at fair value on a recurring basis using significant unobservable inputs (Level 3) for the years ended December 31, 2024, 2023 and 2022. Generally, transfers into Level 3 were primarily driven by the usage of unobservable assumptions in the pricing of these financial instruments as evidenced by wider pricing variations among pricing vendors and transfers out of Level 3 were primarily driven by the usage of assumptions corroborated by market observable information as evidenced by tighter pricing among multiple pricing sources.\nTable 17.2: Level 3 Recurring Fair Value Rollforward\nFair Value Measurements Using Significant Unobservable Inputs (Level 3)\nYear Ended December 31, 2024\nTotal Gains (Losses)\n(Realized/Unrealized)\nNet Unrealized Gains (Losses) Included in Net Income Related to Assets and Liabilities Still Held as of December  31, 2024\n(1)\n(Dollars in millions)\nBalance, January 1, 2024\nIncluded\nin Net\nIncome\n(1)\nIncluded in OCI\nPurchases\nSales\nIssuances\nSettlements\nTransfers\nInto\nLevel 3\nTransfers\nOut of\nLevel 3\nBalance,\n December 31, \n2024\nSecurities available for sale:\n(2)\nRMBS\n$\n146\n \n$\n6\n \n$\n(\n2\n)\n$\n0\n \n$\n0\n \n$\n0\n \n$\n(\n11\n)\n$\n193\n \n$\n(\n216\n)\n$\n116\n \n$\n6\n \nCMBS\n132\n \n0\n \n(\n3\n)\n0\n \n0\n \n0\n \n(\n3\n)\n0\n \n(\n124\n)\n2\n \n0\n \nTotal securities available for sale\n278\n \n6\n \n(\n5\n)\n0\n \n0\n \n0\n \n(\n14\n)\n193\n \n(\n340\n)\n118\n \n6\n \nOther assets:\nRetained interests in securitizations\n35\n \n(\n1\n)\n0\n \n0\n \n0\n \n0\n \n0\n \n0\n \n0\n \n34\n \n(\n1\n)\nNet derivative assets (liabilities)\n(3)\n58\n \n(\n15\n)\n0\n \n0\n \n0\n \n12\n \n16\n \n(\n2\n)\n0\n \n69\n \n(\n25\n)\n214\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFair Value Measurements Using Significant Unobservable Inputs (Level 3)\nYear Ended December 31, 2023\nTotal Gains (Losses)\n(Realized/Unrealized)\nNet Unrealized Gains (Losses) Included in Net Income Related to Assets and Liabilities Still Held as of December  31, 2023\n(1)\n(Dollars in millions)\nBalance, January 1, 2023\nIncluded\nin Net\nIncome\n(1)\nIncluded in OCI\nPurchases\nSales\nIssuances\nSettlements\nTransfers\nInto\nLevel 3\nTransfers\nOut of\nLevel 3\nBalance, December 31, 2023\nSecurities available for sale:\n(2)\nRMBS\n$\n236\n \n$\n8\n \n$\n(\n2\n)\n$\n0\n \n$\n0\n \n$\n0\n \n$\n(\n20\n)\n$\n49\n \n$\n(\n125\n)\n$\n146\n \n$\n7\n \nCMBS\n142\n \n(\n1\n)\n(\n4\n)\n0\n \n0\n \n0\n \n(\n5\n)\n0\n \n0\n \n132\n \n(\n1\n)\nTotal securities available for sale\n378\n \n7\n \n(\n6\n)\n0\n \n0\n \n0\n \n(\n25\n)\n49\n \n(\n125\n)\n278\n \n6\n \nOther assets:\nRetained interests in securitizations\n36\n \n(\n1\n)\n0\n \n0\n \n0\n \n0\n \n0\n \n0\n \n0\n \n35\n \n(\n1\n)\nNet derivative assets (liabilities)\n(3)(4)\n5\n \n(\n14\n)\n0\n \n0\n \n0\n \n166\n \n69\n \n(\n167\n)\n(\n1\n)\n58\n \n63\n \nFair Value Measurements Using Significant Unobservable Inputs (Level 3)\nYear Ended December 31, 2022\nTotal Gains (Losses)\n(Realized/Unrealized)\nNet Unrealized Gains (Losses) Included in Net Income Related to Assets and Liabilities Still Held as of December  31, 2022\n(1)\n(Dollars in millions)\nBalance, January 1, 2022\nIncluded\nin Net\nIncome\n(1)\nIncluded in OCI\nPurchases\nSales\nIssuances\nSettlements\nTransfers\nInto\nLevel 3\nTransfers\nOut of\nLevel 3\nBalance, December 31, 2022\nSecurities available for sale:\n(2)\nRMBS\n$\n258\n \n$\n18\n \n$\n(\n32\n)\n$\n0\n \n$\n0\n \n$\n0\n \n$\n(\n60\n)\n$\n123\n \n$\n(\n71\n)\n$\n236\n \n$\n10\n \nCMBS\n9\n \n(\n1\n)\n(\n3\n)\n0\n \n0\n \n0\n \n(\n15\n)\n190\n \n(\n38\n)\n142\n \n(\n1\n)\nTotal securities available for sale\n267\n \n17\n \n(\n35\n)\n0\n \n0\n \n0\n \n(\n75\n)\n313\n \n(\n109\n)\n378\n \n9\n \nOther assets:\nRetained interests in securitizations\n41\n \n(\n5\n)\n0\n \n0\n \n0\n \n0\n \n0\n \n0\n \n0\n \n36\n \n(\n5\n)\nNet derivative assets (liabilities)\n(3)(4)\n19\n \n(\n65\n)\n0\n \n0\n \n0\n \n36\n \n3\n \n(\n28\n)\n40\n \n5\n \n(\n33\n)\n_________\n(1)\nRealized gains (losses) on securities available for sale are included in net securities gains (losses) and retained interests in securitizations are reported as a component of non-interest income in our consolidated statements of income. Gains (losses) on derivatives are included as a component of net interest income or non-interest income in our consolidated statements of income.\n(2)\nNet unrealized losses included in other comprehensive income related to Level 3 securities available for sale still held were $\n10\n million, $\n5\n million and $\n57\n million as of December 31, 2024, December 31, 2023 and  December 31, 2022, respectively.\n(3)\nIncludes derivative assets and liabilities of $\n683\n million and $\n614\n million, respectively, as of December 31, 2024 and $\n886\n million and $\n828\n million, respectively, as of December 31, 2023, and $\n79\n million and $\n74\n million, respectively, as of December 31, 2022.\n(4)\nTransfers into Level 3 primarily consist of term Secured Overnight Financing Rate (“SOFR”)-indexed interest rate derivatives.\nSignificant Level 3 Fair Value Asset and Liability Inputs\nGenerally, uncertainties in fair value measurements of financial instruments, such as changes in unobservable inputs, may have a significant impact on fair value. Certain of these unobservable inputs will, in isolation, have a directionally consistent impact on the fair value of the instrument for a given change in that input. Alternatively, the fair value of the instrument may move in an opposite direction for a given change in another input. In general, an increase in the discount rate, default rates, loss severity or credit spreads, in isolation, would result in a decrease in the fair value measurement. In addition, an increase in default rates would generally be accompanied by a decrease in recovery rates, slower prepayment rates and an increase in \nliquidity spreads, and would lead to a decrease in the fair value measurement.\n215\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nTechniques and Inputs for Level 3 Fair Value Measureme\nnts\nThe following table presents the significant unobservable inputs used to determine the fair values of our Level 3 financial instruments on a recurring basis. We utilize multiple vendor pricing services to obtain fair value for our securities. Several of our vendor pricing services are only able to provide unobservable input information for a limited number of securities due to software licensing restrictions. Other vendor pricing services are able to provide unobservable input information for all securities for which they provide a valuation. As a result, the unobservable input information for the securities available for sale presented below represents a composite summary of all information we are able to obtain. The unobservable input information for all other Level 3 financial instruments is based on the assumptions used in our internal valuation models.\nTable 17.3: Quantitative Information about Level 3 Fair Value Measurements\nQuantitative Information about Level 3 Fair Value Measurements\n(Dollars in millions)\nFair Value at \nDecember 31,\n2024\nSignificant\nValuation\nTechniques\nSignificant\nUnobservable\nInputs\nRange\nWeighted\nAverage\n(1)\nSecurities available for sale:\nRMBS\n$\n116\n \nDiscounted cash flows (vendor pricing)\nYield\nVoluntary prepayment rate\nDefault rate\nLoss severity\n6\n-\n10\n%\n0\n-\n12\n%\n0\n-\n6\n%\n25\n-\n80\n%\n6\n%\n7\n%\n1\n%\n61\n%\nCMBS\n2\n \nDiscounted cash flows (vendor pricing)\nYield\n5\n-\n7\n%\n7\n%\nOther assets:\nRetained interests in securitizations\n(2)\n34\n \nDiscounted cash flows\nLife of receivables (months)\nVoluntary prepayment rate\nDiscount rate\nDefault rate\nLoss severity\n31\n-\n81\n7\n-\n9\n%\n5\n-\n15\n%\n1\n%\n44\n-\n155\n%\nN/A\nNet derivative assets (liabilities)\n69\n \nDiscounted cash flows\nSwap rates\n4\n%\n4\n%\nQuantitative Information about Level 3 Fair Value Measurements\n(Dollars in millions)\nFair Value at \nDecember 31, \n2023\nSignificant\nValuation\nTechniques\nSignificant\nUnobservable\nInputs\nRange\nWeighted\nAverage\n(1)\nSecurities available for sale:\nRMBS\n$\n146\n \nDiscounted cash flows (vendor pricing)\nYield\nVoluntary prepayment rate\nDefault rate\nLoss severity\n2\n-\n19\n%\n0\n-\n12\n%\n0\n-\n10\n%\n30\n-\n80\n%\n7\n%\n7\n%\n1\n%\n61\n%\nCMBS\n132\n \nDiscounted cash flows (vendor pricing)\nYield\n5\n-\n7\n%\n5\n%\nOther assets:\nRetained interests in securitizations\n(2)\n35\n \nDiscounted cash flows\nLife of receivables (months)\nVoluntary prepayment rate\nDiscount rate\nDefault rate\nLoss severity\n33\n-\n69\n9\n%\n5\n-\n14\n%\n2\n%\n53\n-\n163\n%\nN/A\nNet derivative assets (liabilities)\n58\n \nDiscounted cash flows\nSwap rates\n3\n-\n5\n%\n4\n%\n__________\n(1)\nWeighted averages are calculated by using the product of the input multiplied by the relative fair value of the instruments.\n(2)\nDue to the nature of the various mortgage securitization structures in which we have retained interests, it is not meaningful to present a consolidated weighted average for the significant unobservable inputs.\n216\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAssets and Liabilities Measured at Fair Value on a Nonrecurring Basis\nWe are required to measure and recognize certain assets at fair value on a nonrecurring basis on the consolidated balance sheets. These assets are not measured at fair value on an ongoing basis but are subject to fair value adjustments in certain circumstances (for example, from the application of lower of cost or fair value accounting or when we evaluate for impairment).\nThe following describes the valuation techniques used in estimating the fair value of our financial assets and liabilities recorded at fair value on a nonrecurring basis. \nNet Loans Held for Investment\nLoans held for investment that are recorded at fair value on our consolidated balance sheets on a nonrecurring basis largely consist of impaired loans for which impairment is measured based upon the fair value of the underlying collateral. The fair value is determined using appraisal values that are obtained from independent appraisers, broker pricing opinions or other available market information, adjusted for the estimated cost to sell. Due to the use of significant unobservable inputs, these loans are classified as Level 3 under the fair value hierarchy. Fair value adjustments for individually impaired collateralized loans held for investment are recorded in provision for credit losses in the consolidated statements of income.\nLoans Held for Sale\nLoans held for sale for which we have not elected the fair value option are carried at the lower of aggregate cost, net of deferred fees and deferred origination costs, or fair value. These loans held for sale are valued based on market observable inputs and are therefore classified as Level 2. Fair value adjustments to these loans are recorded in other non-interest income in our consolidated statements of income. \nOther Assets\nOther assets subject to nonrecurring fair value measurements include equity investments accounted for under the measurement alternative, other repossessed assets and long-lived assets held for sale. The assets held for sale are carried at the lower of the carrying amount or fair value less costs to sell. The fair value is determined based on the appraisal value, listing price of the property or collateral provided by independent appraisers, and is adjusted for the estimated costs to sell. Due to the use of significant unobservable inputs, these assets are classified as Level 3 under the fair value hierarchy. Fair value adjustments for these assets are recorded in other non-interest expense in the consolidated statements of income.\nThe following table presents the carrying value of the assets measured at fair value on a nonrecurring basis and still held as of December 31, 2024 and \n2023\n, \nand for which a nonrecurring fair value measurement was recorded during the year then ended.\nTable 17.4: Nonrecurring Fair Value Measurements\nDecember 31, 2024\nEstimated Fair Value Hierarchy\nTotal\n(Dollars in millions)\nLevel 2\nLevel 3\nLoans held for investment\n$\n0\n \n$\n827\n \n$\n827\n \nLoans held for sale\n4\n \n0\n \n4\n \nOther assets\n(1)\n0\n \n133\n \n133\n \nTotal\n$\n4\n \n$\n960\n \n$\n964\n \nDecember 31, 2023\nEstimated Fair Value Hierarchy\nTotal\n(Dollars in millions)\nLevel 2\nLevel 3\nLoans held for investment\n$\n0\n \n$\n545\n \n$\n545\n \nLoans held for sale\n37\n \n0\n \n37\n \nOther assets\n(1)\n0\n \n214\n \n214\n \nTotal\n$\n37\n \n$\n759\n \n$\n796\n \n__________\n217\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(1)\nAs of December 31, 2024, other assets included investments accounted for under measurement alternative of $\n71\n million and repossessed assets of $\n62\n million. As of December 31, 2023, other assets included investments accounted for under measurement alternative of $\n46\n million, repossessed assets of $\n45\n million and long-lived assets held for sale and right-of-use assets totaling $\n123\n million.\nIn the above table, loans held for investment are generally valued based in part on the estimated fair value of the underlying collateral and the non-recoverable rate, which is considered to be a significant unobservable input. The non-recoverable rate ranged from \n0\n% to \n61\n%, with a weighted average of \n18\n%, and from \n0\n% to \n100\n%, wi\nth a weighted average of \n18\n%, as of December 31, 2024 and \n2023\n, respectively. \nThe weighted average non-recoverable rate is calculated based on the estimated market value of the underlying collateral. The significant unobservable inputs and related quantitative information related to fair value of the other assets are not meaningful to disclose as they vary significantly across properties and collateral.\nThe following table presents total nonrecurring fair value measurements for the period, included in earnings, attributable to the change in fair value relating to assets that are still held at December 31, 2024 and 2023.\nTable 17.5: Nonrecurring Fair Value Measurements Included in Earnings\nTotal Gains (Losses)\nYear Ended December 31,\n(Dollars in millions)\n2024\n2023\nLoans held for investment\n$\n(\n246\n)\n$\n(\n244\n)\nLoans held for sale\n(\n10\n)\n(\n1\n)\nOther assets\n(1)\n(\n83\n)\n(\n58\n)\nTotal\n$\n(\n339\n)\n$\n(\n303\n)\n__________\n(1)\nOther assets primarily include fair value adjustments related to repossessed assets, long-lived assets held for sale and right-of use assets, and equity investments accounted for under the \nmeasurement alternative.\nFair Value of Financial Instruments\nThe following table presents the carrying value and estimated fair value, including the level within the fair value hierarchy, of our financial instruments that are not measured at fair value on a recurring basis on our consolidated balance sheets as of December 31, 2024 and 2023.\nTable 17.6: Fair Value of Financial Instruments\n \nDecember 31, 2024\nCarrying\nValue\nEstimated\nFair Value\nEstimated Fair Value Hierarchy\n(Dollars in millions)\nLevel 1\nLevel 2\nLevel 3\nFinancial assets:\nCash and cash equivalents\n$\n43,230\n \n$\n43,230\n \n$\n3,028\n \n$\n40,202\n \n$\n0\n \nRestricted cash for securitization investors\n441\n \n441\n \n441\n \n0\n \n0\n \nNet loans held for investment\n311,517\n \n316,467\n \n0\n \n0\n \n316,467\n \nLoans held for sale\n115\n \n115\n \n0\n \n115\n \n0\n \nInterest receivable\n2,532\n \n2,532\n \n0\n \n2,532\n \n0\n \nOther investments\n(1)\n1,329\n \n1,329\n \n0\n \n1,329\n \n0\n \nFinancial liabilities:\nDeposits with defined maturities\n78,944\n \n79,091\n \n0\n \n79,091\n \n0\n \nSecuritized debt obligations\n14,264\n \n14,335\n \n0\n \n14,335\n \n0\n \nSenior and subordinated notes\n30,696\n \n31,636\n \n0\n \n31,636\n \n0\n \nFederal funds purchased and securities loaned or sold under agreements to repurchase\n562\n \n562\n \n0\n \n562\n \n0\n \nInterest payable\n666\n \n666\n \n0\n \n666\n \n0\n \n218\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n \nDecember 31, 2023\nCarrying\nValue\nEstimated\nFair Value\nEstimated Fair Value Hierarchy\n(Dollars in millions)\nLevel 1\nLevel 2\nLevel 3\nFinancial assets:\nCash and cash equivalents\n$\n43,297\n \n$\n43,297\n \n$\n4,903\n \n$\n38,394\n \n$\n0\n \nRestricted cash for securitization investors\n458\n \n458\n \n458\n \n0\n \n0\n \nNet loans held for investment\n305,176\n \n308,044\n \n0\n \n0\n \n308,044\n \nLoans held for sale\n507\n \n515\n \n0\n \n515\n \n0\n \nInterest receivable\n2,478\n \n2,478\n \n0\n \n2,478\n \n0\n \nOther investments\n(1)\n1,329\n \n1,329\n \n0\n \n1,329\n \n0\n \nFinancial liabilities:\nDeposits with defined maturities\n83,014\n \n82,990\n \n0\n \n82,990\n \n0\n \nSecuritized debt obligations\n18,043\n \n18,067\n \n0\n \n18,067\n \n0\n \nSenior and subordinated notes\n31,248\n \n31,524\n \n0\n \n31,524\n \n0\n \nFederal funds purchased and securities loaned or sold under agreements to repurchase\n538\n \n538\n \n0\n \n538\n \n0\n \nInterest payable\n649\n \n649\n \n0\n \n649\n \n0\n \n__________\n(1)\nOther investments include FHLB and Federal Reserve stock. These investments are included in other assets on our consolidated balance sheets.\n219\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 18—BUSINESS SEGMENTS AND REVENUE FROM CONTRACTS WITH CUSTOMERS\nOur principal operations are organized into \nthree\n major business segments, which are defined primarily based on the products and services provided or the types of customers served: Credit Card, Consumer Banking and Commercial Banking. The operations of acquired businesses have been integrated into or managed as a part of our existing business segments. Certain activities that are not part of a business segment are included in the Other category, such as the management of our corporate investment portfolio and asset/liability positions performed by our centralized Corporate Treasury group and any residual tax expense or benefit beyond what is assessed to our business segments in order to arrive at the consolidated effective tax rate.\n•\nCredit Card:\n Consists of our domestic consumer and small business card lending, and international card businesses in  the U.K. and Canada.\n•\nConsumer Banking:\n Consists of our deposit gathering and lending activities for consumers and small businesses, and national auto lending.\n•\nCommercial Banking:\n Consists of our lending, deposit gathering, capital markets and treasury management services to commercial real estate and commercial and industrial customers. Our customers typically include companies with annual revenues between $\n20\n million and $\n2\n billion.\n•\nOther category:\n Includes the residual impact of the allocation of our centralized Corporate Treasury group activities, such as management of our corporate investment portfolio, asset/liability management and oversight of our funds transfer pricing process, to our business segments. Accordingly, net gains and losses on our investment securities portfolio and certain trading activities are included in the Other category. The Other category also includes unallocated corporate expenses that do not directly support the operations of the business segments or for which the business segments are not considered financially accountable in evaluating their performance, such as certain restructuring charges and integration expenses related to the Transaction.\nBasis of Presentation\nWe report the results of each of our business segments on a continuing operations basis. The results of our individual businesses reflect the manner in which management evaluates performance and makes decisions about funding our operations and allocating resources. The Chief Operating Decision Maker (“CODM”) for each of our segments is the Chief Executive Officer. The CODM uses the segments’ income (loss) from continuing operations after tax to assess segment performance and decide how to allocate resources.\n \nBusiness Segment Reporting Methodology\n \nThe results of our business segments are intended to present each segment as if it were a stand-alone business. Our internal management and reporting process used to derive our segment results employs various allocation methodologies, including funds transfer pricing, to assign certain balance sheet assets, deposits and other liabilities and their related revenues and expenses directly or indirectly attributable to each business segment. Our funds transfer pricing process managed by our centralized Corporate Treasury group provides a funds credit for sources of funds, such as deposits generated by our Consumer Banking and Commercial Banking businesses, and a charge for the use of funds by each business segment. The allocation is unique to each business segment and acquired business and is based on the composition of assets and liabilities. The funds transfer pricing process considers the interest rate and liquidity risk characteristics of assets and liabilities and off-balance sheet products. Periodically the methodology and assumptions utilized in the funds transfer pricing process are adjusted to reflect economic conditions and other factors, which may impact the allocation of net interest income to the business segments. Due to the integrated nature of our business segments, estimates and judgments have been made in allocating certain revenue and expense items. Transactions between segments are based on specific criteria or approximate market rates. We regularly assess the assumptions, methodologies and reporting classifications used for segment reporting, which may result in the implementation of refinements or changes in future periods.\nThe following is additional information on the principles and methodologies used in preparing our business segment results.\n•\nNet interest income:\n Interest income from loans and interest expense from deposits and other interest-bearing liabilities are reflected within each applicable business segment. Because funding and asset/liability management are managed \n220\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\ncentrally by our Corporate Treasury group, net interest income for our business segments also includes the results of a funds transfer pricing process that is intended to allocate a cost of funds used or credit for funds provided to all business segment assets and liabilities, respectively, using a matched funding concept. The taxable-equivalent benefit of tax-exempt products is also allocated to each business unit with a corresponding increase in income tax expense.\n•\nNon-interest income:\n Non-interest fees and other revenue associated with loans or customers managed by each business segment and other direct revenues are accounted for within each business segment.\n•\nProvision for credit losses:\n The provision for credit losses is directly attributable to the business segment in accordance with the loans each business segment manages.\n•\nNon-interest expense:\n Non-interest expenses directly managed and incurred by a business segment are accounted for within each business segment. We allocate certain non-interest expenses indirectly incurred by business segments, such as corporate support functions, to each business segment based on various factors, including the actual cost of the services from the service providers, the utilization of the services, the number of employees or other relevant factors. Marketing expenses are included within non-interest expense and can be directly incurred by a business segment or indirectly incurred and allocated. Total marketing expense was $\n4.6\n billion for the year ended December 31, 2024 and $\n4.0\n billion for both the years ended December 31, 2023 and 2022. Credit Card marketing expense was $\n3.9\n billion for the year ended December 31, 2024 and $\n3.4\n billion for both the years ended December 31, 2023 and 2022.\n•\nGoodwill and other intangible assets:\n Goodwill and other intangible assets are assigned to one or more segments at acquisition. Intangible amortization is included in the results of the applicable segment.\n•\nIncome taxes:\n Income taxes are assessed for each business segment based on a standard tax rate with the residual tax expense or benefit to arrive at the consolidated effective tax rate included in the Other category.\n•\nLoans held for investment:\n Loans are reported within each business segment in accordance with the loans each business segment manages.\n•\nDeposits:\n Deposits are reported within each business segment based on product or customer type served by that business segment.\nSegment Results and Reconciliation\nWe may periodically change our business segments or reclassify business segment results based on modifications to our management reporting methodologies or changes in organizational alignment. \nThe following table presents our business segment results for the years ended December 31, 2024, 2023 and 2022, selected balance sheet data as of December 31, 2024 and 2023, and a reconciliation of our total business segment results to our reported consolidated income from continuing operations, loans held for investment and deposits.\n221\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nTable 18.1: Segment Results and Reconciliation\nYear Ended December 31, 2024\n(Dollars in millions)\nCredit Card\nConsumer Banking\nCommercial Banking\n(1)\nOther\n(1)\nConsolidated Total\nNet interest income (loss)\n$\n22,088\n \n$\n8,023\n \n$\n2,391\n \n$\n(\n1,294\n)\n$\n31,208\n \nNon-interest income (loss)\n6,076\n \n695\n \n1,210\n \n(\n77\n)\n7,904\n \nTotal net revenue (loss)\n(2)\n28,164\n \n8,718\n \n3,601\n \n(\n1,371\n)\n39,112\n \nProvision for credit losses\n10,272\n \n1,435\n \n8\n \n1\n \n11,716\n \nNon-interest expense\n13,576\n \n5,372\n \n2,011\n \n527\n \n21,486\n \nIncome (loss) from continuing operations before income taxes\n4,316\n \n1,911\n \n1,582\n \n(\n1,899\n)\n5,910\n \nIncome tax provision (benefit)\n1,024\n \n451\n \n373\n \n(\n685\n)\n1,163\n \nIncome (loss) from continuing operations, net of tax\n$\n3,292\n \n$\n1,460\n \n$\n1,209\n \n$\n(\n1,214\n)\n$\n4,747\n \nLoans held for investment\n$\n162,508\n \n$\n78,092\n \n$\n87,175\n \n$\n0\n \n$\n327,775\n \nDeposits\n0\n \n318,329\n \n31,691\n \n12,687\n \n362,707\n \n                                                                                                                                                                                                                                                                                                                                                                                                                                    \nYear Ended December 31, 2023\n(Dollars in millions)\nCredit Card\nConsumer Banking\nCommercial Banking\n(1)\nOther\n(1)\nConsolidated Total\nNet interest income (loss)\n$\n19,729\n \n$\n8,713\n \n$\n2,518\n \n$\n(\n1,719\n)\n$\n29,241\n \nNon-interest income\n5,940\n \n589\n \n1,002\n \n15\n \n7,546\n \nTotal net revenue (loss)\n(2)\n25,669\n \n9,302\n \n3,520\n \n(\n1,704\n)\n36,787\n \nProvision for credit losses\n8,651\n \n1,169\n \n605\n \n1\n \n10,426\n \nNon-interest expense\n12,490\n \n5,178\n \n2,011\n \n637\n \n20,316\n \nIncome (loss) from continuing operations before income taxes\n4,528\n \n2,955\n \n904\n \n(\n2,342\n)\n6,045\n \nIncome tax provision (benefit)\n1,071\n \n697\n \n213\n \n(\n823\n)\n1,158\n \nIncome (loss) from continuing operations, net of tax\n$\n3,457\n \n$\n2,258\n \n$\n691\n \n$\n(\n1,519\n)\n$\n4,887\n \nLoans held for investment\n$\n154,547\n \n$\n75,437\n \n$\n90,488\n \n$\n0\n \n$\n320,472\n \nDeposits\n0\n \n296,171\n \n32,712\n \n19,530\n \n348,413\n \nYear Ended December 31, 2022\n(Dollars in millions)\nCredit Card\nConsumer Banking\nCommercial Banking\n(1)\nOther\n(1)\nConsolidated Total\nNet interest income (loss)\n$\n16,584\n \n$\n8,965\n \n$\n2,461\n \n$\n(\n896\n)\n$\n27,114\n \nNon-interest income (loss)\n5,771\n \n469\n \n1,129\n \n(\n233\n)\n7,136\n \nTotal net revenue (loss)\n(2)\n22,355\n \n9,434\n \n3,590\n \n(\n1,129\n)\n34,250\n \nProvision (benefit) for credit losses\n4,265\n \n1,173\n \n415\n \n(\n6\n)\n5,847\n \nNon-interest expense\n11,627\n \n5,312\n \n2,070\n \n154\n \n19,163\n \nIncome (loss) from continuing operations before income taxes\n6,463\n \n2,949\n \n1,105\n \n(\n1,277\n)\n9,240\n \nIncome tax provision (benefit)\n1,536\n \n699\n \n262\n \n(\n617\n)\n1,880\n \nIncome (loss) from continuing operations, net of tax\n$\n4,927\n \n$\n2,250\n \n$\n843\n \n$\n(\n660\n)\n$\n7,360\n \nLoans held for investment\n$\n137,730\n \n$\n79,925\n \n$\n94,676\n \n$\n0\n \n$\n312,331\n \nDeposits\n0\n \n270,592\n \n40,808\n \n21,592\n \n332,992\n \n_________\n(1)\nSome of our commercial investments generate tax-exempt income, tax credits or other tax benefits. Accordingly, we present our Commercial Banking revenue and yields on a taxable-equivalent basis, calculated using the federal statutory tax rate of 21% and state taxes where applicable, with offsetting reductions to the Other category.\n(2)\nTotal net revenue was reduced by $\n2.6\n billion, $\n1.9\n billion and $\n946\n million for the years ended December 31, 2024, 2023 and 2022, respectively, for credit card finance charges and fees charged off as uncollectible.\n222\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nRevenue from Contracts with Customers\nThe majority of our revenue from contracts with customers consists of interchange fees, service charges and other customer-related fees, and other contract revenue. Interchange fees are primarily from our Credit Card business and are recognized upon settlement with the interchange networks, net of rewards earned by customers. Service charges and other customer-related fees within our Consumer Banking business are primarily related to fees earned on consumer deposit accounts for account maintenance and various transaction-based services such as automated teller machine (“ATM”) usage. Service charges and other customer-related fees within our Commercial Banking business are mostly related to fees earned on treasury management and capital markets services. Other contract revenue in our Credit Card business consists primarily of revenue from our partnership arrangements. Other contract revenue in our Consumer Banking business consists primarily of revenue earned from services provided to auto industry participants. Revenue from contracts with customers is included in non-interest income in our consolidated statements of income.\nThe following table presents revenue from contracts with customers and a reconciliation to non-interest income by business segment for the years ended December 31, 2024, 2023 and 2022.\nTable 18.2: Revenue from Contracts with Customers and Reconciliation to Segment Results\nYear Ended December 31, 2024\n(Dollars in millions)\nCredit Card\nConsumer Banking\nCommercial Banking\n(1)\nOther\n(1)\nConsolidated Total\nContract revenue:\nInterchange fees, net\n(2)\n$\n4,340\n \n$\n434\n \n$\n106\n \n$\n2\n \n$\n4,882\n \nService charges and other customer-related fees\n0\n \n88\n \n372\n \n0\n \n460\n \nOther\n413\n \n142\n \n18\n \n0\n \n573\n \nTotal contract revenue\n4,753\n \n664\n \n496\n \n2\n \n5,915\n \nRevenue (reduction) from other sources\n1,323\n \n31\n \n714\n \n(\n79\n)\n1,989\n \nTotal non-interest income (loss)\n$\n6,076\n \n$\n695\n \n$\n1,210\n \n$\n(\n77\n)\n$\n7,904\n \n223\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nYear Ended December 31, 2023\n(Dollars in millions)\nCredit Card\nConsumer Banking\nCommercial Banking\n(1)\nOther\n(1)\nConsolidated Total\nContract revenue:\nInterchange fees, net\n(2)\n$\n4,333\n \n$\n367\n \n$\n91\n \n$\n2\n \n$\n4,793\n \nService charges and other customer-related fees\n0\n \n86\n \n222\n \n(\n2\n)\n306\n \nOther\n413\n \n102\n \n31\n \n0\n \n546\n \nTotal contract revenue (loss)\n4,746\n \n555\n \n344\n \n0\n \n5,645\n \nRevenue from other sources\n1,194\n \n34\n \n658\n \n15\n \n1,901\n \nTotal non-interest income\n$\n5,940\n \n$\n589\n \n$\n1,002\n \n$\n15\n \n$\n7,546\n \nYear Ended December 31, 2022\n(Dollars in millions)\nCredit Card\nConsumer Banking\nCommercial Banking\n(1)\nOther\n(1)\nConsolidated Total\nContract revenue:\nInterchange fees, net\n(2)\n$\n4,178\n \n$\n320\n \n$\n109\n \n$\n(\n1\n)\n$\n4,606\n \nService charges and other customer-related fees\n0\n \n91\n \n236\n \n0\n \n327\n \nOther\n395\n \n74\n \n16\n \n(\n1\n)\n484\n \nTotal contract revenue (loss)\n4,573\n \n485\n \n361\n \n(\n2\n)\n5,417\n \nRevenue (reduction) from other sources\n1,198\n \n(\n16\n)\n768\n \n(\n231\n)\n1,719\n \nTotal non-interest income (loss)\n$\n5,771\n \n$\n469\n \n$\n1,129\n \n$\n(\n233\n)\n$\n7,136\n \n__________\n(1)\nSome of our commercial investments generate tax-exempt income, tax credits or other tax benefits. Accordingly, we present our Commercial Banking revenue and yields on a taxable-equivalent basis, calculated using the federal statutory tax rate of 21% and state taxes where applicable, with offsetting reductions to the Other category.\n(2)\nInterchange fees are presented net of customer reward expenses of $\n9.0\n billion, $\n8.2\n billion and $\n7.6\n billion for the years ended December 31, 2024, 2023 and 2022, respectively.\n224\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 19—COMMITMENTS, CONTINGENCIES, GUARANTEES AND OTHERS\nCommitments to Lend\nOur unfunded lending commitments primarily consist of credit card lines, loan commitments to customers of both our Commercial Banking and Consumer Banking businesses, as well as standby and commercial letters of credit. These commitments, other than credit card lines and certain other unconditionally cancellable lines of credit, are legally binding conditional agreements that have fixed expirations or termination dates and specified interest rates and purposes. The contractual amount of these commitments represents the maximum possible credit risk to us should the counterparty draw upon the commitment. We generally manage the potential risk of unfunded lending commitments by limiting the total amount of arrangements, monitoring the size and maturity structure of these portfolios and applying the same credit standards for all of our credit activities.\nFor unused credit card lines, we have not experienced and do not anticipate that all of our customers will access their entire available line at any given point in time. Commitments to extend credit other than credit card lines generally require customers to maintain certain credit standards. Collateral requirements and loan-to-value (“LTV”) ratios are the same as those for funded transactions and are established based on management’s credit assessment of the customer. These commitments may expire without being drawn upon; therefore, the total commitment amount does not necessarily represent future funding requirements.\nWe also issue letters of credit, such as financial standby, performance standby and commercial letters of credit, to meet the financing needs of our customers. Standby letters of credit are conditional commitments issued by us to guarantee the performance of a customer to a third party in a borrowing arrangement. Commercial letters of credit are short-term commitments issued primarily to facilitate trade finance activities for customers and are generally collateralized by the goods being shipped to the customer. These collateral requirements are similar to those for funded transactions and are established based on management’s credit assessment of the customer. Management conducts regular reviews of all outstanding letters of credit and the results of these reviews are considered in assessing the adequacy of reserves for unfunded lending commitments.\nThe following table presents the contractual amount and carrying value of our unfunded lending commitments as of December 31, 2024 and 2023. The carrying value represents our reserve and deferred revenue on legally binding commitments.\nTable 19.1: Unfunded Lending Commitments\nContractual Amount\nCarrying Value\n(Dollars in millions)\nDecember 31, 2024\nDecember 31, 2023\nDecember 31, 2024\nDecember 31, 2023\nCredit card lines\n$\n411,603\n \n$\n392,867\n \nN/A\nN/A\nOther loan commitments\n(1)\n45,145\n \n46,951\n \n$\n73\n \n$\n99\n \nStandby letters of credit and commercial letters of credit\n(2)\n1,306\n \n1,465\n \n30\n \n23\n \nTotal unfunded lending commitments\n$\n458,054\n \n$\n441,283\n \n$\n103\n \n$\n122\n \n__________\n(1)\nIncludes $\n6.0\n billion and $\n4.7\n billion of advised lines of credit as of December 31, 2024 and 2023, respectively.\n(2)\nThese financial guarantees have expiration dates that range from 2025 to 2027 as of December 31, 2024.\nLoss Sharing Agreements\nWithin our Commercial Banking business, we originate multifamily commercial real estate loans with the intent to sell them to the GSEs. We enter into loss sharing agreements with the GSEs upon the sale of these originated loans. Beginning January 1, 2020, we elected the fair value option on new loss sharing agreements entered into. Unrealized gains and losses are recorded in other non-interest income in our consolidated statements of income. For those loss sharing agreements entered into as of and prior to December 31, 2019, we amortize the liability recorded at inception into non-interest income as we are released from risk of having to make a payment and record our estimate of expected credit losses each period through the provision for credit losses in our consolidated statements of income. The liability recognized on our consolidated balance sheets for these loss sharing agreements was $\n143\n million and $\n137\n million as of December 31, 2024 and 2023, respectively. See “Note 5—Allowance for Credit Losses and Reserve for Unfunded Lending Commitments” for information related to our credit card partnership loss sharing arrangements.\n225\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nLitigation\nIn accordance with the current accounting standards for loss contingencies, we establish reserves for legal and regulatory related matters that arise from the ordinary course of our business activities when it is probable that a loss associated with a claim or proceeding has been incurred and the amount of the loss can be reasonably estimated. None of the amounts we currently have recorded individually or in the aggregate are considered to be material to our financial condition. Litigation claims and proceedings of all types are subject to many uncertain factors that generally cannot be predicted with assurance. Below we provide a description of potentially material legal proceedings and claims.\nFor some of the matters disclosed below, we are able to estimate reasonably possible losses above existing reserves, and for other disclosed matters, such an estimate is not possible at this time. For those matters below where an estimate is possible, management currently estimates the reasonably possible future losses beyond our reserves as of December 31, 2024 are approximately $\n600\n million. Our reserve and reasonably possible loss estimates involve considerable judgment and reflect that there is significant uncertainty regarding numerous factors that may impact the ultimate loss levels. Notwithstanding our attempt to estimate a reasonably possible range of loss beyond our current accrual levels for some legal and regulatory matters based on current information, it is possible that actual future losses will exceed both the current accrual level and reasonably possible losses disclosed here. Given the inherent uncertainties involved in these matters and the very large or indeterminate damages sought in some of these, there is significant uncertainty as to the ultimate liability we may incur from these legal and regulatory matters and an adverse outcome in one or more of these matters could be material to our results of operations or cash flows for any particular reporting period.\nInterchange Litigation\nIn 2005, a putative class of retail merchants filed antitrust lawsuits against MasterCard and Visa and several issuing banks, including Capital One, seeking both injunctive relief and monetary damages for an alleged conspiracy by defendants to fix the level of interchange fees. The Visa and MasterCard payment networks and issuing banks entered into settlement and judgment sharing agreements allocating the liabilities of any judgment or settlement arising from all interchange-related cases.\nThe lawsuits were consolidated before the U.S. District Court for the Eastern District of New York for certain purposes and were settled in 2012. The class settlement, however, was invalidated by the United States Court of Appeals for the Second Circuit in June 2016, and the suit was bifurcated into separate class actions seeking injunctive and monetary relief, respectively. In addition, numerous merchant groups opted out of the 2012 settlement. \nThe monetary relief class action settled for $5.5 billion and was approved by the District Court in December 2019. The Second Circuit affirmed the settlement in March 2023, and it is final. Some of the merchants that opted out of the monetary relief class have brought cases, and some of those cases have settled and some remain pending. Visa created a litigation escrow account following its initial public offering of stock in 2008 that funds the portion of these settlements attributable to Visa-allocated transactions. Any settlement amounts based on MasterCard-allocated transactions that have not already been paid are reflected in our reserves. Visa and MasterCard reached a settlement with the injunctive relief class and filed a motion for preliminary approval, which was denied by the District Court in June 2024. The parties will continue to litigate unless a settlement is reached and approved. \nCybersecurity Incident\nOn July 29, 2019, we announced that on March 22 and 23, 2019 an outside individual gained unauthorized access to our systems. This individual obtained certain types of personal information relating to people who had applied for our credit card products and to our credit card customers (the “2019 Cybersecurity Incident”). As a result of the 2019 Cybersecurity Incident, we have been subject to numerous legal proceedings and other inquiries and could be the subject of additional proceedings and inquiries in the future. \nConsumer class actions\n. We are currently named as a defendant in \n4\n putative consumer class action cases in Canadian courts alleging harm from the 2019 Cybersecurity Incident and seeking various remedies, including monetary and injunctive relief. The lawsuits allege breach of contract, negligence, violations of various privacy laws and a variety of other legal causes of action.  In the second quarter of 2022, a trial court in British Columbia preliminarily certified a class of all impacted Canadian consumers except those in Quebec. The preliminary certification decision in British Columbia was appealed, with both parties contesting portions of the ruling. On July 4, 2024, the British Columbia Court of Appeals denied both parties’ appeals. In the third quarter of 2023, a trial court in Quebec preliminarily authorized a class of all impacted consumers in Quebec. This \n226\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\ndecision also has been appealed. The final two putative class actions, both of which are pending in Alberta, are continuing in parallel, but currently remain at a preliminary stage. \nGovernmental inquiries.\n In August 2020, we entered into consent orders with the Board of Governors of the Federal Reserve System (“Federal Reserve”) and the OCC resulting from regulatory reviews of the 2019 Cybersecurity Incident and relating to ongoing enhancements of our cybersecurity and operational risk management processes. We paid an $\n80\n million penalty to the U.S. Treasury as part of the OCC agreement. The Federal Reserve agreement did not contain a monetary penalty. The OCC lifted its consent order on August 31, 2022 and the Federal Reserve lifted its consent order on July 5, 2023. On August 12, 2019, Canada’s Office of Privacy Commissioner (“OPC”) also initiated an investigation into the 2019 Cybersecurity Incident. That investigation concluded in April 2024 with no further action required. \nU.K. PPI Litigation\nIn the U.K., we previously sold payment protection insurance (“PPI”). For several years leading up to the claims submission deadline of August 29, 2019 (as set by the U.K. Financial Conduct Authority (“FCA”)), we received customer complaints and regulatory claims relating to PPI. COEP has materially resolved the PPI complaints and regulatory claims received prior to the deadline. Some of the claimants in the U.K. PPI regulatory claims process have subsequently initiated legal proceedings, seeking additional redress. We are responding to these proceedings as we receive them.\nSavings Account Litigation and Related CFPB Litigation\nOn July 10, 2023, we were sued in a putative class action in the Eastern District of Virginia by savings account holders alleging breach of contract and a variety of other causes of action relating to our introduction of a new savings account product with a higher interest rate than existing savings account products (“Savings Account Litigation”). Since the original suit, we have also been sued in six similar putative class actions in federal courts in California, Illinois, Ohio, Virginia, New Jersey and New York. On March 20, 2024, we filed with the Judicial Panel on Multidistrict Litigation a motion to consolidate and transfer related actions to the Eastern District of Virginia. In June 2024, the Judicial Panel granted the motion and transferred the related actions to the Eastern District of Virginia. Plaintiffs filed a consolidated complaint on July 1, 2024, and the court set a trial date in July 2025. In November 2024, the court denied our motion to dismiss. The parties are engaged in discovery. \nIn August 2024, we received a Civil Investigative Demand from the Consumer Financial Protection Bureau (“CFPB”) relating to the savings account products at issue in the litigation. In October 2024, the CFPB issued a Notice and Opportunity to Respond and Advise (“NORA”) letter indicating that the CFPB was considering an enforcement action against us on similar grounds as the claims in the Savings Account Litigation. On January 14, 2025, the CFPB filed a lawsuit against Capital One in the Eastern District of Virginia. Capital One's response to the complaint is due March 17, 2025.\nOther Pending and Threatened Litigation\nIn addition, we are commonly subject to various pending and threatened legal actions relating to the conduct of our normal business activities. In the opinion of management, the ultimate aggregate liability, if any, arising out of all such other pending or threatened legal actions is not expected to be material to our consolidated financial position or our results of operations.\nOther Contingencies\nDeposit Insurance Assessments\nOn November 16, 2023, the FDIC finalized a rule to implement a special assessment to recover the loss to the Deposit Insurance Fund (“DIF”) arising from the protection of uninsured depositors in connection with the systemic risk determination announced on March 12, 2023, following the closures of Silicon Valley Bank and Signature Bank. In December 2023, the FDIC provided notification that it would be collecting the special assessment at an annual rate of approximately 13.4 basis points (“bps”) over eight quarterly collection periods, beginning with the first quarter of 2024 with the first payment due on June 28, 2024. In June 2024, the FDIC provided notification that the collection period will be extended an additional two quarters beyond the initial eight quarterly collection periods at a lower annual rate. The special assessment base is equal to an insured depository institution’s estimated uninsured deposits reported on its Consolidated Reports of Condition and Income as of December 31, 2022 (“2022 Call Report”), adjusted to exclude the first $5 billion of uninsured deposits. We recognized $\n289\n million in operating expense in the fourth quarter of 2023 associated with the special assessment based on our 2022 Call \n227\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nReport, which was revised and refiled during 2023. As a result of updates from the FDIC related to our portion of the FDIC’s estimate of relevant DIF losses, we have recognized $\n325\n million of operating expenses related to the special assessment. \nIt is reasonably possible amendments will be needed to our 2022 Call Report due to future legal and regulatory developments, which could result in additional expenses associated with the special assessment. The ultimate amount of expenses associated with the special assessment will also be impacted by the finalization of the losses incurred by the FDIC in the resolutions of Silicon Valley Bank and Signature Bank. The amount of reasonably possible additional special assessment fees beyond our existing accrual due to these factors is approximately $\n200\n million.\n \n228\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 20—CAPITAL ONE FINANCIAL CORPORATION (PARENT COMPANY ONLY)\nFinancial Information\nThe following parent company only financial statements are prepared in accordance with Regulation S-X of the U.S. Securities and Exchange Commission (“SEC”).\nTable 20.1: Parent Company Statements of Income\n \nYear Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nInterest income\n$\n1,762\n \n$\n1,715\n \n$\n595\n \nInterest expense\n2,303\n \n2,160\n \n969\n \nProvision (benefit) for Credit Losses\n0\n \n(\n1\n)\n(\n1\n)\nDividends from subsidiaries\n1,500\n \n3,300\n \n4,352\n \nNon-interest income (loss)\n100\n \n91\n \n(\n15\n)\nNon-interest expense\n96\n \n70\n \n35\n \nIncome before income taxes and equity in undistributed earnings of subsidiaries\n963\n \n2,877\n \n3,929\n \nIncome tax benefit\n(\n81\n)\n(\n73\n)\n(\n181\n)\nEquity in undistributed earnings of subsidiaries\n3,706\n \n1,937\n \n3,250\n \nNet income\n4,750\n \n4,887\n \n7,360\n \nOther comprehensive income (loss), net of tax\n(\n1,018\n)\n1,648\n \n(\n10,290\n)\nComprehensive income (loss)\n$\n3,732\n \n$\n6,535\n \n$\n(\n2,930\n)\nTable 20.2: Parent Company Balance Sheets\n(Dollars in millions)\nDecember 31, 2024\nDecember 31, 2023\nAssets:\nCash and cash equivalents\n$\n22,630\n \n$\n25,647\n \nInvestments in subsidiaries\n56,991\n \n54,324\n \nLoans to subsidiaries\n8,935\n \n6,338\n \nSecurities available for sale\n346\n \n380\n \nOther assets\n2,537\n \n2,526\n \nTotal assets\n$\n91,439\n \n$\n89,215\n \nLiabilities:\nSenior and subordinated notes\n$\n30,247\n \n$\n30,817\n \nAccrued expenses and other liabilities\n408\n \n309\n \nTotal liabilities\n30,655\n \n31,126\n \nTotal stockholders’ equity\n60,784\n \n58,089\n \nTotal liabilities and stockholders’ equity\n$\n91,439\n \n$\n89,215\n \n229\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nTable 20.3: Parent Company Statements of Cash Flows\n \nYear Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nOperating activities:\nNet income\n$\n4,750\n \n$\n4,887\n \n$\n7,360\n \nAdjustments to reconcile net income to net cash from operating activities:\nEquity in undistributed earnings of subsidiaries\n(\n3,706\n)\n(\n1,936\n)\n(\n3,250\n)\nOther operating activities\n496\n \n623\n \n(\n2,429\n)\nNet cash from operating activities\n1,540\n \n3,574\n \n1,681\n \nInvesting activities:\nProceeds from paydowns and maturities of securities available for sale\n33\n \n103\n \n96\n \nPurchases of securities available for sale\n0\n \n(\n69\n)\n(\n10\n)\nChanges in loans to subsidiaries\n(\n2,597\n)\n371\n \n1,139\n \nNet cash from investing activities\n(\n2,564\n)\n405\n \n1,225\n \nFinancing activities:\nBorrowings:\nIssuance of senior and subordinated notes\n3,985\n \n8,219\n \n9,271\n \nMaturities and paydowns of senior and subordinated notes\n(\n4,411\n)\n(\n6,989\n)\n(\n1,250\n)\nCommon stock:\nNet proceeds from issuances\n323\n \n299\n \n276\n \nDividends paid\n(\n932\n)\n(\n931\n)\n(\n950\n)\nPreferred stock:\nDividends paid\n(\n228\n)\n(\n228\n)\n(\n228\n)\nPurchases of treasury stock\n(\n734\n)\n(\n718\n)\n(\n4,948\n)\nProceeds from share-based payment activities\n4\n \n10\n \n19\n \nNet cash from financing activities\n(\n1,993\n)\n(\n338\n)\n2,190\n \nChanges in cash and cash equivalents\n(\n3,017\n)\n3,641\n \n5,096\n \nCash and cash equivalents, beginning of the period\n25,647\n \n22,006\n \n16,910\n \nCash and cash equivalents, end of the period\n$\n22,630\n \n$\n25,647\n \n$\n22,006\n \n230\nCapital One Financial Corporation (COF)\nTable of Contents\nCAPITAL ONE FINANCIAL CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 21—RELATED PARTY TRANSACTIONS\nIn the ordinary course of business, we may have loans issued to our executive officers, directors and principal stockholders. Pursuant to our policy, such loans are issued on the same terms as those prevailing at the time for comparable loans to unrelated persons and do not involve more than the normal risk of collectability.\n231\nCapital One Financial Corporation (COF)\nTable of Contents\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure \nNone.\nItem 9A. Controls and Procedures\nOverview\nWe are required under applicable laws and regulations to maintain controls and procedures, which include disclosure controls and procedures as well as internal control over financial reporting, as further described below. \n(a) Disclosure Controls and Procedures\nDisclosure controls and procedures refer to controls and other procedures designed to provide reasonable assurance that information required to be disclosed in our financial reports is recorded, processed, summarized and reported within the time periods specified by SEC rules and forms and that such information is accumulated and communicated to management, including our Chief Executive Officer (“CEO”) and Chief Financial Officer (“CFO”), as appropriate, to allow timely decisions regarding our required disclosure. In designing and evaluating our disclosure controls and procedures, we recognize that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and we must apply judgment in evaluating and implementing possible controls and procedures. \nEvaluation of Disclosure Controls and Procedures\nAs required by Rule 13a-15 of the Securities Exchange Act of 1934 (“Exchange Act”), our management, including the CEO and CFO, conducted an evaluation of the effectiveness of our disclosure controls and procedures (as that term is defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act) as of December 31, 2024, the end of the period covered by this Report. Based upon that evaluation, the CEO and CFO concluded that our disclosure controls and procedures were effective as of December 31, 2024, at a reasonable level of assurance, in recording, processing, summarizing and reporting information required to be disclosed within the time periods specified by the SEC rules and forms.\n(b) Changes in Internal Control Over Financial Reporting\nWe regularly review our disclosure controls and procedures and make changes intended to ensure the quality of our financial reporting. There have been\n \nno changes in internal control over financial reporting that occurred in the fourth quarter of 2024 that materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\n(c) Management’s Report on Internal Control Over Financial Reporting\nManagement’s Report on Internal Control Over Financial Reporting is included in “Item 8. Financial Statements and Supplementary Data” and is incorporated herein by reference. The Report of Independent Registered Public Accounting Firm on Internal Control Over Financial Reporting also is included in “Item 8. Financial Statements and Supplementary Data” and incorporated herein by reference.\nItem 9B.\n \nOther Information\nRule 10b5-1 and Non-Rule 10b5-1 Trading Arrangements\nDuring the three months ended December 31, 2024, no director or officer of the Company \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement,” as each term is defined in Item 408(a) of Regulation S-K. \nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n232\nCapital One Financial Corporation (COF)\nTable of Contents\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance \nThe information required by Item 10 will be included in our Proxy Statement for the 2025 Annual Stockholder Meeting (“Proxy Statement”) under the headings “Election of Directors,” “Executive Officers,” “Process for Stockholder Recommendations of Director Candidates; Directors Nominations from Stockholders,” and “Board Committees,” and is incorporated herein by reference. The Proxy Statement will be filed with the Securities and Exchange Commission pursuant to Regulation 14A within 120 days of the end of our 2024 fiscal year. In addition, please see “Part I—Item 1. Business—Overview.”\nInsider Trading Policy\nWe maintain insider trading policies and procedures governing the purchase, sale, and/or other dispositions of our company’s securities by directors, officers, employees and other covered persons that we believe are reasonably designed to promote compliance with insider trading laws, rules, and regulations, as well as New York Stock Exchange (“NYSE”) listing standards. A copy of our insider trading policy is filed as Exhibit 19 to this Annual Report on Form 10-K.\nItem 11. Executive Compensation \nThe information required by Item 11 will be included in the Proxy Statement under the headings “Director Compensation,” “Compensation Discussion and Analysis,” “NEO Compensation” and “Compensation Committee Report,” and is incorporated herein by reference.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters \nThe information required by Item 12 will be included in the Proxy Statement under the headings “Security Ownership” and “Equity Compensation Plans,” and is incorporated herein by reference.\nItem 13. Certain Relationships and Related Transactions, and Director Independence \nThe information required by Item 13 will be included in the Proxy Statement under the headings “Related Person Transactions” and “Director Independence,” and is incorporated herein by reference.\nItem 14. Principal Accountant Fees and Services \nThe information required by Item 14 will be included in the Proxy Statement under the heading “Ratification of the Selection of Our Independent Registered Public Accounting Firm,” and is incorporated herein by reference.\n233\nCapital One Financial Corporation (COF)\nTable of Contents\nPART IV \nItem 15. Exhibits and Financial Statement Schedules \n(a) Financial Statement Schedules \nThe following documents are filed as part of this Annual Report in Part II, Item 8 and are incorporated herein by reference. \n(1) Management’s Report on Internal Control Over Financial Reporting\nReport of Independent Registered Public Accounting Firm on Internal Control Over Financial Reporting\nReport of Independent Registered Public Accounting Firm on the Consolidated Financial Statements\nConsolidated Financial Statements: \nConsolidated Statements of Income for the years ended December 31, 2024, 2023 and 2022\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2024, 2023 and 2022\nConsolidated Balance Sheets as of December 31, 2024 and 2023 \nConsolidated Statements of Changes in Stockholders’ Equity for the years ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 2022\nNotes to Consolidated Financial Statements \n(2) Schedules\nNone.\n(b) Exhibits \nAn index to exhibits has been filed as part of this Report and is incorporated herein by reference.\nItem 16. Form 10-K Summary \nNot applicable.\n234\nCapital One Financial Corporation (COF)\nTable of Contents\nANNUAL REPORT ON FORM 10-K\nDATED DECEMBER 31, 2024\nCommission File No. 001-13300\nThe following exhibits are incorporated by reference or filed herewith. References to (i) the “2002 Form 10-K” are to the Company’s Annual Report on Form 10-K for the year ended December 31, 2002, filed on March 17, 2003; (ii) the “2003 Form 10-K” are to the Company’s Annual Report on Form 10-K for the year ended December 31, 2003, filed on March 5, 2004; (iii) the “2011 Form 10-K” are to the Company’s Annual Report on Form 10-K for the year ended December 31, 2011, filed on February 28, 2012; (iv) the “2012 Form 10-K” are to the Company’s Annual Report on Form 10-K for the year ended December 31, 2012, filed on February 28, 2013; (v) the “2013 Form 10-K” are to the Company’s Annual Report on Form 10-K for the year ended December 31, 2013, filed on February 27, 2014;  (vi) the “2015 Form 10-K” are to the Company’s Annual Report on Form 10-K for the year ended December 31, 2015, filed on February 25, 2016; (vii) the “2016 Form 10-K” are to the Company’s Annual Report on Form 10-K for the year ended December 31, 2016, filed on February 23, 2017; (ix) t  the “2021 Form 10-K” are to the Company’s Annual Report on Form 10-K for the year ended December 31, 2021, filed on February 25, 2022;  (x) the “2022 Form 10-K” are to the Company’s Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 24, 2023, and (xi) the “2023 Form 10-K” are to the Company’s Annual Report on Form 10-K for the year ended December 31, 2023, filed on February 23, 2024.\nExhibit No.\nDescription\n2.1\nAgreement and Plan of Merger, dated as of February 19, 2024, by and among Discover Financial Services, Capital One Financial Corporation and Vega Merger Sub, Inc. (incorporated by reference to Exhibit 2.1 of the Current Report on Form 8-K, filed on February 22, 2024).\n3.1\nRestated Certificate of Incorporation of Capital One Financial Corporation (as restated July 26, 2023) (incorporated by reference to Exhibit 3.1 of the Quarterly Report on Form 10-Q, filed on July 27, 2023).\n3.2\nAmended and Restated Bylaws of Capital One Financial Corporation, dated September 23, 2021 (incorporated by reference to Exhibit 3.1 of the Current Report on Form 8-K, filed on September 29, 2021).\n3.3.1\nCertificate of Designations of Fixed Rate Non-Cumulative Perpetual Preferred Stock, Series I, dated September 10, 2019 (incorporated by reference to Exhibit 3.1 of the Current Report on Form 8-K, filed on September 11, 2019).\n3.3.2\nCertificate of Designations of Fixed Rate Non-Cumulative Perpetual Preferred Stock, Series J, dated January 30, 2020 (incorporated by reference to Exhibit 3.1 of the Current Report on Form 8-K, filed on January 31, 2020).\n3.3.3\nCertificate of Designations of Fixed Rate Non-Cumulative Perpetual Preferred Stock, Series K, dated September 16, 2020 (incorporated by reference to Exhibit 3.1 of the Current Report on Form 8-K, filed on September 17, 2020).\n3.3.4\nCertificate of Designations of Fixed Rate Non-Cumulative Perpetual Preferred Stock, Series L, dated May 3, 2021 (incorporated by reference to Exhibit 3.1 of the Current Report on Form 8-K, filed on May 4, 2021).\n3.3.5\nCertificate of Designations of Fixed Rate Reset Non-Cumulative Perpetual Preferred Stock, Series M, dated June 9, 2021 (incorporated by reference to Exhibit 3.1 of the Current Report on Form 8-K, filed on June 10, 2021).\n3.3.6\nCertificate of Designations of Fixed Rate Non-Cumulative Perpetual Preferred Stock, Series N, dated July 28, 2021 (incorporated by reference to Exhibit 3.1 of the Current Report on Form 8-K, filed on July 29, 2021).\n4.1.1\nSpecimen certificate representing the common stock of Capital One Financial Corporation (incorporated by reference to Exhibit 4.1 of the 2003 Form 10-K).\n4.1.2\nWarrant Agreement, dated December 3, 2009, between Capital One Financial Corporation and Computershare Trust Company, N.A. (incorporated by reference to the Exhibit 4.1 of the Form 8-A, filed on December 4, 2009).\n4.1.3\nDeposit Agreement, dated September 11, 2019, by and among Capital One Financial Corporation, Computershare Trust Company, N.A.,  Computershare Inc. and the holders from time to time (incorporated by reference to Exhibit 4.1 of the Current Report on Form 8-K, filed on September 11, 2019).\n4.1.4\nDeposit Agreement, dated January 31, 2020, by and among Capital One Financial Corporation, Computershare Trust Company, N.A.,  Computershare Inc. and the holders from time to time (incorporated by reference to Exhibit 4.1 of the Current Report on Form 8-K, filed on January 31, 2020).\n4.1.5\nDeposit Agreement, dated September 17, 2020, by and among Capital One Financial Corporation, Computershare Trust Company, N.A.,  Computershare Inc. and the holders from time to time (incorporated by reference to Exhibit 4.1 of the Current Report on Form 8-K, filed on September 17, 2020).\n4.1.6\nDeposit Agreement, dated May 4, 2021, by and among Capital One Financial Corporation, Computershare Trust Company, N.A.,  Computershare Inc. and the holders from time to time (incorporated by reference to Exhibit 4.1 of the Current Report on Form 8-K, filed on May 4, 2021).\n4.1.7\nDeposit Agreement, dated July 29, 2021, by and among Capital One Financial Corporation, Computershare Trust Company, N.A.,  Computershare Inc. and the holders from time to time (incorporated by reference to Exhibit 4.1 of the Current Report on Form 8-K, filed on July 29, 2021).\n4.2\nPursuant to Item 601(b)(4)(iii)(A) of Regulation S-K, copies of instruments defining the rights of holders of long-term debt are not filed. The Company agrees to furnish a copy thereof to the SEC upon request.\n235\nCapital One Financial Corporation (COF)\nTable of Contents\n4.3*\nDescription of Securities Registered Under Section 12 of the Exchange Act.\n10.1+\nSeventh Amended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K, filed on May 9, 2023).\n10.2.1+\nNonstatutory Stock Option Award Agreement, dated February 4, 2016, by and between Capital One Financial Corporation and Richard D. Fairbank under the  Amended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.2.17 of the 2015 Form 10-K).\n10.2.2+\nForm of Nonstatutory Stock Option Award Agreement granted to our executive officers under the  Amended and Restated 2004 Stock Incentive Plan on February 4, 2016 (incorporated by reference to Exhibit 10.2.17 of the 2015 Form 10-K).\n10.2.3+\nNonstatutory Stock Option Award Agreement, dated February 2, 2017, by and between Capital One Financial Corporation and Richard D. Fairbank under the  Amended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.2.19 of the 2016 Form 10-K)\n.\n10.2.4+\nForm of Nonstatutory Stock Option Award Agreement granted to our executive officers under the Third Amended and Restated 2004 Stock Incentive Plan on February 2, 2017 (incorporated by reference to Exhibit 10.2.19 of the 2016 Form 10-K).\n10.2.5+\nAmended and Restated  Performance Unit Award Agreement, dated November 2, 2023, granted to our Chief Executive Officer under the Amended and Restated 2004 Stock Incentive Plan on February 3, 2022\n \n(incorporated by reference to Exhibit 10.2.11 of the 2023 Form 10-K)\n.\n10.2.6+\nAmended and Restated Form of Performance Unit Award Agreements, dated November 2, 2023, granted to our executive officers under the Amended and Restated 2004 Stock Incentive Plan on February 3, 2022\n \n(incorporated by reference to Exhibit 10.2.12 of the 2023 Form 10-K)\n.\n10.2.7+\nForm of Restricted Stock Unit Award Agreement, dated February 3, 2022, by and between Capital One Financial Corporation and Richard D. Fairbank under the  Amended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.2.14 of the 2021 Form 10-K).\n10.2.8+\nForm of Restricted Stock Unit Award Agreements granted to our executive officers under the  Amended and Restated 2004 Stock Incentive Plan on February 3, 2022 (incorporated by reference to Exhibit 10.2.14 of the 2021 Form 10-K).\n10.2.9+\nAmended and Restated Total Shareholder Return Performance Unit Award Agreement, dated November 2, 2023, granted to our Chief Executive Officer under the  Amended and Restated 2004 Stock Incentive Plan on February 3, 2022\n \n(incorporated by reference to Exhibit 10.2.15 of the 2023 Form 10-K)\n.\n10.2.10+\nForm of Restricted Stock Unit Award Agreement, dated January 26, 2023, by and between Capital One Financial Corporation and Richard D. Fairbank under the  Amended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.2.21 of the 2022 Form 10-K). \n10.2.11+\nAmended and Restated Performance Unit Award Agreement, dated November 2, 2023, granted to our Chief Executive Officer under the Amended and Restated 2004 Stock Incentive Plan on January 26, 2023\n \n(incorporated by reference to Exhibit 10.2.17 of the 2023 Form 10-K)\n.\n10.2.12+\nAmended and Restated Total Shareholder Return Performance Unit Award Agreement, dated November 2, 2023, granted to our Chief Executive Officer under the  Amended and Restated 2004 Stock Incentive Plan on January 26, 2023\n \n(incorporated by reference to Exhibit 10.2.18 of the 2023 Form 10-K)\n.\n10.2.13+\nForm of Restricted Stock Unit Award Agreements granted to our executive officers under the  Amended and Restated 2004 Stock Incentive Plan on January 26, 2023\n \n(incorporated by reference to Exhibit 10.2.24 of the 2022 Form 10-K).\n10.2.14+\nAmended and Restated Form of Performance Unit Award Agreements, dated November 2, 2023, granted to our executive officers under the Amended and Restated 2004 Stock Incentive Plan on January 26, 2023\n \n(incorporated by reference to Exhibit 10.2.20 of the 2023 Form 10-K)\n.\n10.2.15+\nTotal Shareholder Return Performance Unit Award Agreement granted to our Chief Executive Officer under the Amended and Restated 2004 Stock Incentive Plan on February 1, 2024\n \n(incorporated by reference to Exhibit 10.2.24 of the 2023 Form 10-K)\n.\n10.2.16+\nPerformance Unit Award Agreement\n \n granted to our Chief Executive Officer under the Amended and Restated 2004 Stock Incentive Plan on February 1, 2024\n \n(incorporated by reference to Exhibit 10.2.25 of the 2023 Form 10-K)\n.\n10.2.17+\nForm of Restricted Stock Unit Award Agreement, dated February 1, 2024, by and between Capital One Financial Corporation and Richard D. Fairbank under the Amended and Restated 2004 Stock Incentive Plan\n \n(incorporated by reference to Exhibit 10.2.26 of the 2023 Form 10-K)\n.\n10.2.18+\nForm of Restricted Stock Unit Award Agreements granted to our executive officers under the Amended and Restated 2004 Stock Incentive Plan on February 1, 2024\n \n (incorporated by reference to Exhibit 10.2.27 of the 2023 Form 10-K)\n.\n10.2.19+\nForm of Performance Unit Award Agreements granted to our executive officers under the Amended and Restated 2004 Stock Incentive Plan on February 1, 2024\n \n(incorporated by reference to Exhibit 10.2.28 of the 2023 Form 10-K)\n.\n10.2.20*+\nTotal Shareholder Return Performance Unit Award Agreement granted to our Chief Executive Officer under the Amended and Restated 2004 Stock Incentive Plan on February 4, 2025.\n10.2.21*+\nPerformance Unit Award Agreement granted to our Chief Executive Officer under the Amended and Restated 2004 Stock Incentive Plan on February 4, 2025.\n10.2.22*+\nForm of Restricted Stock Unit Award Agreement, dated February 4, 2025, by and between Capital One Financial Corporation and Richard D. Fairbank under the Amended and Restated 2004 Stock Incentive Plan.\n236\nCapital One Financial Corporation (COF)\nTable of Contents\n10.2.23*+\nForm of Restricted Stock Unit Award Agreements granted to our executive officers under the Amended and Restated 2004 Stock Incentive Plan on February 4, 2025.\n10.2.24*+\nForm of Performance Unit Award Agreements granted to our executive officers under the Amended and Restated 2004 Stock Incentive Plan on February 4, 2025.\n10.3.1+\nCapital One Financial Corporation 1999 Non-Employee Directors Stock Incentive Plan, as amended (incorporated by reference to Exhibit 10.4 of the 2002 Form 10-K).\n10.3.2+\nForm of 1999 Non-Employee Directors Stock Incentive Plan Deferred Share Units Award Agreement between Capital One Financial Corporation and certain of its Directors (incorporated by reference to Exhibit 10.3 of the Quarterly Report on Form 10-Q for the period ended September 30, 2004).\n10.3.3+\nForm of Restricted Stock Unit Award Agreement granted to our directors under the\n Amended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.3.4 of the 2011 Form 10-K).\n10.3.4+\nForm of Restricted Stock Unit Award Agreement granted to our directors under the\n Amended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.1 of the Quarterly Report on Form 10-Q for the period ended June 30, 2018).\n10.3.5+\nForm of Restricted Stock Unit Award Agreement granted to our directors under the \nAmended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.2 of the Quarterly Report on Form 10-Q for the period ended June 30, 2019).\n10.3.6+\nForm of Restricted Stock Unit Award Agreement granted to our directors under the\n Amended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.1 of the Quarterly Report on Form 10-Q for the period ended June 30, 2022).\n10.3.7+\nForm of Restricted Stock Unit Award Agreement granted to our U.S. directors under the Amended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.1 of the Quarterly Report on Form 10-Q for the period ended June 30, 2024)\n.\n10.3.8+\nForm of Restricted Stock Unit Award Agreement granted to our Non-US directors under the Amended and Restated 2004 Stock Incentive Plan (incorporated by reference to Exhibit 10.2 of the Quarterly Report on Form 10-Q for the period ended June 30, 2024).\n10.4.1+\nAmended and Restated Capital One Financial Corporation Executive Severance Plan (incorporated by reference to Exhibit 10.4.2 of the 2022 Form 10-K).\n10.4.2+\nAmendment Number One to the Amended and Restated Capital One Financial Corporation Executive Severance Plan (incorporated by reference to Exhibit 10.4.3 of the 2022 Form 10-K).\n10.4.3*+\nAmendment Number Three to the Amended and Restated Capital One Financial Corporation Executive Severance Plan\n10.5+\nAmended and Restated Capital One Financial Corporation Non-Employee Directors Deferred Compensation Plan\n \n(incorporated by reference to Exhibit 10.5 of the 2023 Form 10-K)\n.\n10.6.1+\nAmended and Restated Capital One Financial Corporation Voluntary Non-Qualified Deferred Compensation Plan (incorporated by reference to Exhibit 10.6 of the 2011 Form 10-K).\n10.6.2+\nFirst Amendment to the Amended and Restated Capital One Financial Corporation Voluntary Non-Qualified Deferred Compensation Plan (incorporated by reference to Exhibit 10.6.2 of the 2012 Form 10-K).\n10.7.1+\nForm of 2011 Change of Control Employment Agreement between Capital One Financial Corporation and certain executive officers (incorporated by reference to Exhibit 10.8.3 of the 2012 Form 10-K).\n10.7.2+\nChange of Control Employment Agreement, dated December 10, 2013, between Capital One Financial Corporation and Richard D. Fairbank (incorporated by reference to Exhibit 10.7.3 of the 2013 Form 10-K).\n10.8.1+\nForm of Non-Competition Agreement between Capital One Financial Corporation and Andrew M. Young, Robert Alexander, and Sanjiv Yajnik (incorporated by reference to Exhibit 10.9 of the 2012 Form 10-K).\n10.9+\nForm of Retention Bonus Letter Agreement, by and between Capital One Financial Corporation and certain executive officers (incorporated by reference to Exhibit 10.6 of the Quarterly Report on Form 10-Q for the period ended March 31, 2024).\n19*\nSecurities Law Polic\ny.\n21*\nSubsidiaries of the Company.\n23*\nConsent of Ernst & Young LLP.\n24*\nPower of Attorney (included on signature page to this Form 10-K).\n31.1*\nCertification of Richard D. Fairbank.\n31.2*\nCertification of Andrew M. Young.\n32.1**\nCertification of Richard D. Fairbank.\n32.2**\nCertification of Andrew M. Young.\n97\nCapital One Financial Corporation Compensation Recoupment Policy\n \n(incorporated by reference to Exhibit 97 of the 2023 Form 10-K)\n.\n101.INS\nXBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL Document.\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document.\n237\nCapital One Financial Corporation (COF)\nTable of Contents\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\n104\nThe cover page of Capital One Financial Corporation’s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL (included within the Exhibit 101 attachments).\n__________\n+\nRepresents a management contract or compensatory plan or arrangement.\n*\nIndicates a document being filed with this Form 10-K.\n**\nIndicates a document being furnished with this Form 10-K. Information in this Form 10-K furnished herewith shall not be deemed to be “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that Section. Such exhibit shall not be deemed incorporated by reference into any filing under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934.\n238\nCapital One Financial Corporation (COF)\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 of 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nCAPITAL ONE FINANCIAL CORPORATION\nDate: February 20, 2025\n \nBy:\n/s/ RICHARD D. FAIRBANK\n \nRichard D. Fairbank\n \nChair and Chief Executive Officer\n239\nCapital One Financial Corporation (COF)\nTable of Contents\nPOWER OF ATTORNEY\nWe, the undersigned, hereby severally constitute Andrew M. Young, Timothy P. Golden and Matthew W. Cooper, and each of them singly, our true and lawful attorneys with full power to them and each of them to sign for us, and in our names in the capacities indicated below, any and all amendments to the annual report on Form 10-K filed with the Securities and Exchange Commission, hereby ratifying and confirming our signatures as they may be signed by our said attorneys to any and all amendments to said annual report on Form 10-K.\n240\nCapital One Financial Corporation (COF)\nTable of Contents\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ RICHARD D. FAIRBANK\nChair and Chief Executive Officer\nFebruary 20, 2025\nRichard D. Fairbank\n(Principal Executive Officer)\n/s/ ANDREW M. YOUNG\nChief Financial Officer\nFebruary 20, 2025\nAndrew M. Young\n(Principal Financial Officer)\n/s/ TIMOTHY P. GOLDEN\nController\nFebruary 20, 2025\nTimothy P. Golden\n(Principal Accounting Officer)\n/s/ IME ARCHIBONG\nDirector\nFebruary 20, 2025\nIme Archibong\n/s/ CHRISTINE DETRICK\nDirector\nFebruary 20, 2025\nChristine Detrick\n/s/ ANN FRITZ HACKETT\nDirector\nFebruary 20, 2025\nAnn Fritz Hackett\n/s/ SUNI P. HARFORD\nDirector\nFebruary 20, 2025\nSuni P. Harford\n/s/ PETER THOMAS KILLALEA\nDirector\nFebruary 20, 2025\nPeter Thomas Killalea\n/s/ C.P.A.J. (ELI) LEENAARS\nDirector\nFebruary 20, 2025\nC.P.A.J. (Eli) Leenaars\n/s/ FRANÇOIS LOCOH-DONOU\nDirector\nFebruary 20, 2025\nFrançois Locoh-Donou\n/s/ PETER E. RASKIND\nDirector\nFebruary 20, 2025\nPeter E. Raskind\n/s/ EILEEN SERRA\nDirector\nFebruary 20, 2025\nEileen Serra\n/s/ MAYO A. SHATTUCK III\nDirector\nFebruary 20, 2025\nMayo A. Shattuck III\n/s/ CRAIG WILLIAMS\nDirector\nFebruary 20, 2025\nCraig Williams\n241\nCapital One Financial Corporation (COF)"
}