{
  "ticker": "COIN",
  "cik": "0001679788",
  "company_name": "Coinbase Global, Inc.",
  "filing_date": "2025-02-13",
  "accession": "0001679788-25-000022",
  "primary_doc": "coin-20241231.htm",
  "item1_text": "Item 1. \nBusiness\n and \nNote 2. Summary of Significant Accounting Policies\n of the Notes to our Consolidated Financial Statements in Part II, Item 8. of this Annual Report on Form 10-K, and management’s discussion of the results of operations below. \n \nComparison of the years ended\n \nDecember 31, 2024 and 2023\nRevenue \nFor the years ended December 31, 2024 and 2023 we generated 83% and 88%, respectively, of total revenue in the U.S. No other country accounted for more than 10% of total revenue during the years presented. International revenue comprised mainly transaction revenue in both years presented.\n93\nTable \nof\n Contents\nTransaction revenue \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nConsumer, net\n(1)\n$\n3,430,322 \n$\n1,334,018 \n$\n2,096,304 \n157 \nInstitutional, net\n345,598 \n90,164 \n255,434 \n283 \nOther transaction revenue, net\n(1)\n210,193 \n95,472 \n114,721 \n120 \nTotal transaction revenue\n$\n3,986,113 \n$\n1,519,654 \n$\n2,466,459 \n162 \n__________________\n(1)\nPrior period amounts were reclassified to conform to current period presentation. See\n Note 3. Revenue\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details.\nTransaction revenue increased for the year ended December 31, 2024 as compared to 2023, due to:\n•\nan increase in consumer transaction revenue of $2.6 billion due to a 195% increase in consumer Trading Volume. This increase was offset in part by a decrease of $482.5 million attributed to a lower average blended fee rate, primarily due to changes in the mix of Trading Volume from Simple to Advanced trading;\n•\nan increase in institutional transaction revenue of $139.1 million primarily due to a 139% increase in institutional Trading Volume, as well as growth in revenue from derivatives trading on our international exchange, which was launched in the second quarter of 2023; and\n•\nan increase in other transaction revenue of $77.8 million from transactions on Base, which was launched in the third quarter of 2023, as well as higher revenue from instant transfer withdrawals. \nThe percentage of transaction revenue from trading on our platform broken down by crypto asset was as follows:\nYear Ended December 31,\nChange\n2024\n2023\n%\nBitcoin\n30 \n%\n35 \n%\n(14)\nEthereum\n13 \n17 \n(24)\nOther crypto assets\n(1)\n57 \n48 \n19 \nTotal\n100 \n%\n100 \n%\n____________________________________\n(1)\nNo other crypto asset individually represented more than 10% of the total. \nSubscription and services revenue \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nStablecoin revenue\n$\n910,464 \n$\n694,247 \n$\n216,217 \n31 \nBlockchain rewards\n705,757 \n330,885 \n374,872 \n113 \nInterest and finance fee income\n(1)\n265,799 \n186,685 \n79,114 \n42 \nCustodial fee revenue\n141,706 \n69,501 \n72,205 \n104 \nOther subscription and services revenue\n(1)\n283,407 \n125,568 \n157,839 \n126 \nTotal subscription and services revenue\n$\n2,307,133 \n$\n1,406,886 \n$\n900,247 \n64 \n__________________\n(1)\nPrior period amounts were reclassified to conform to current period presentation. See\n Note 3. Revenue\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details.\n94\nTable \nof\n Contents\nSubscription and services revenue increased for the year ended December 31, 2024 as compared to 2023, due to:\n•\nan increase in stablecoin revenue of $138.3 million primarily due to higher average customer USDC assets on platform and corporate balances, and $104.7 million attributable to an increase in overall USDC market capitalization, partially offset by increased expenses that are deducted prior to allocation of income from the arrangement with Circle;\n•\nan increase of $350.5 million in blockchain rewards primarily due to higher average prices for Solana and Ethereum, as well as higher native units staked driving growth in both U.S. and international revenue, partially offset by a $62.3 million decrease attributable to changes in reward rates, primarily for Ethereum and Solana;\n•\nan increase in interest and finance fee income primarily reflecting growth of $43.8 million in finance fees driven by higher average volumes of Prime Financing loan receivables, and growth of $25.0 million in interest income attributable to higher average customer custodial cash and cash equivalents balances;\n•\nan increase in custodial fee revenue reflecting growth in average crypto assets and USDC under custody of $81.5 billion primarily driven by higher crypto asset prices, mainly Bitcoin, Solana, and Ethereum; and\n•\nan increase in other subscription and services revenue primarily due to growth of $87.9 million in Coinbase One revenue, as the number of paid subscribers grew driven by positive market conditions and improvements to our product offerings, and an increase in revenue from expanding supported assets on our developer products. \nOther revenue\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nCorporate interest and other income\n$\n270,782 \n$\n181,843 \n$\n88,939 \n49 \nTotal other revenue\n$\n270,782 \n$\n181,843 \n$\n88,939 \n49 \nOther revenue increased for the year ended December 31, 2024 as compared to 2023, primarily due to higher average cash and cash equivalents balances. \nOperating expenses \nCertain prior period amounts have been reclassified to conform to current period presentation.\nTransaction expense\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nBlockchain rewards fees\n$\n455,946 \n$\n229,851 \n$\n226,095 \n98 \nPayment processing and account verification\n150,897 \n76,795 \n74,102 \n96 \nTransaction rebates and commissions\n122,372 \n6,876 \n115,496 \nnm\nTransaction reversal losses\n79,639 \n51,501 \n28,138 \n55 \nBlockchain transaction fees\n80,926 \n55,467 \n25,459 \n46 \nOther\n7,927 \n215 \n7,712 \nnm\nTotal transaction expense\n$\n897,707 \n$\n420,705 \n$\n477,002 \n113 \n__________________\nnm - not meaningful\n95\nTable \nof\n Contents\nTransaction expense increased for the year ended December 31, 2024 as compared to 2023, due to:\n•\nhigher blockchain rewards fees, which rose generally in line with blockchain rewards revenue;\n•\nan increase in payment processing fees of $56.4 million, reflecting Trading Volume growth of 148%, offset in part by savings from reduced fees at higher volumes; and\n•\nhigher transaction rebates and commissions, driven primarily by rebates earned by institutional customers providing liquidity on our international exchange, driven by growth in volume. \nThere were no material changes to note within transaction reversal losses, blockchain transaction fees, or other. \nTransaction expense as a percentage of total revenue will vary depending on the composition of the Company’s total revenue, as certain revenue streams incur little or no transaction costs while others have associated expenses. For example, if interest income and stablecoin revenue increase as a percentage of total revenue, transaction expenses as a percentage of total revenue will decrease as there are no transaction expenses directly attributed to these revenues. Conversely, if blockchain rewards increase as a percentage of total revenue, transaction expenses as a percentage of total revenue will increase since the majority of blockchain rewards revenue is distributed to the customer. There was no change in overall transaction expense as a percentage of total revenue when comparing the periods presented.\nTechnology and development\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nPersonnel-related\n$\n1,038,154 \n$\n936,881 \n$\n101,273 \n11 \nWebsite hosting and infrastructure\n228,392 \n192,009 \n36,383 \n19 \nAmortization, depreciation, and impairment\n122,595 \n131,611 \n(9,016)\n(7)\nOther\n79,111 \n64,040 \n15,071 \n24 \nTotal technology and development\n$\n1,468,252 \n$\n1,324,541 \n$\n143,711 \n11 \nTechnology and development expenses increased for the year ended December 31, 2024 as compared to 2023, due to:\n•\nan increase in personnel-related expenses primarily reflecting higher stock-based compensation expense of $104.1 million as a result of the 2023 annual employee equity awards being granted at a lower stock price as compared to the 2024 annual employee equity awards, offset in part by the roll-off of non-recurring multi-year stock-based compensation awards. Further, personnel-related expenses increased $42.6 million due to higher average headcount; and\n•\nhigher website hosting and infrastructure expenses driven by increased activity on our platform.\nThere were no material changes to note within amortization, depreciation, and impairment or other. \nSales and marketing\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nMarketing programs\n$\n247,087 \n$\n134,018 \n$\n113,069 \n84 \nUSDC rewards\n224,255 \n34,944 \n189,311 \n542 \nPersonnel-related\n151,054 \n143,762 \n7,292 \n5 \nOther\n32,048 \n19,588 \n12,460 \n64 \nTotal sales and marketing\n$\n654,444 \n$\n332,312 \n$\n322,132 \n97 \n96\nTable \nof\n Contents\nSales and marketing expenses increased for the year ended December 31, 2024 as compared to 2023, due to:\n•\nan increase in marketing programs expenses primarily due to $75.4 million higher digital advertising spend, and an increase in customer referral and other promotional initiatives; and\n•\nan increase in USDC rewards payouts of $112.4 million due to higher reward rates offered to customers in an effort to enhance customer acquisition, retention, and platform engagement, with the remainder primarily due to growth in average customer USDC assets on platform.\nThere were no material changes to note within personnel-related or other.\nGeneral and administrative\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nPersonnel-related\n$\n608,786 \n$\n571,083 \n$\n37,703 \n7 \nProfessional services\n202,956 \n182,908 \n20,048 \n11 \nCustomer support \n(1)\n124,940 \n48,804 \n76,136 \n156 \nOther\n363,575 \n271,513 \n92,062 \n34 \nTotal general and administrative\n$\n1,300,257 \n$\n1,074,308 \n$\n225,949 \n21 \n__________________\n(1)\nExcludes personnel-related and professional services expenses.\nGeneral and administrative expenses increased for the year ended December 31, 2024 as compared to 2023, due to: \n•\nan increase in personnel-related expenses largely driven by increased stock-based compensation expense as a result of the 2023 annual employee equity awards being granted at a lower stock price as compared to the 2024 annual employee equity rewards;\n•\nhigher professional services expenses driven by an increase of $30.0 million in legal advisory services, offset in part by lower business consulting expenses; \n•\nan increase in customer support costs as a result of increased capacity needs. Our capacity needs typically increase in periods following higher Trading Volumes; and\n•\nan increase in other, largely reflecting:\n▪\nan additional $33.3 million in policy spend as we increased our crypto advocacy efforts; \n▪\nan increase of $31.0 million in taxes, licenses, and fees primarily due to higher indirect taxes directly associated with the growth in revenue and the application of certain indirect tax rules; \n▪\nan increase in legal costs of $23.4 million due to higher spend; offset in part by\n▪\nlower lease costs, as we recognized a one-time lease termination fee of $25.0 million during the year ended December 31, 2023 related to the closure of our San Francisco office space.\n▪\nThe remaining variance in other was due to increases across various expenses, with no material changes to note.\n97\nTable \nof\n Contents\nGains on crypto assets held for operations, net \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nGains on crypto assets held for operations, net\n$\n(71,725)\n$\n— \n$\n(71,725)\nnm\n_____________\nnm - not meaningful\nGains on crypto assets held for operations, net during the year ended December 31, 2024 resulted primarily from flows of crypto assets held for operations during a period of rising crypto asset prices. Though gross inflows and outflows of these assets were each $1.5 billion in 2024, gains on changes in the fair value of the assets were limited as these assets are converted to cash or used for expenses nearly immediately after receipt. \nCrypto asset impairment, net \nDuring the year ended December 31, 2023, crypto asset impairment, net reflected a $34.7 million expense, driven by gross crypto asset impairments resulting from challenging crypto market conditions, followed by expense recoveries as we sold previously impaired assets at recovered prices. Beginning January 2024, we adopted ASU 2023-08, and as a result no longer record crypto asset impairments. \nRestructuring\nRestructuring expense was $142.6 million for the year ended December 31, 2023, comprising separation pay, stock-based compensation expense, and other personnel costs related to the workforce reduction in January 2023. There were no restructuring expenses for the year ended December 31, 2024.\nOther operating expense, net\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nPlatform-related incidents \n$\n28,070 \n$\n15,717 \n$\n12,353 \n79 \nOther \n(20,137)\n(5,457)\n(14,680)\n269 \n Total other operating expense, net\n$\n7,933 \n$\n10,260 \n$\n(2,327)\n(23)\nThere were no material changes to note within Other operating expense, net.\nInterest expense\n \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nInterest expense\n$\n80,645 \n$\n82,766 \n$\n(2,121)\n(3)\nThere were no material changes to note within Interest expense. \nGains on crypto assets held for investment, net \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nGains on crypto assets held for investment, net\n$\n(687,055)\n$\n— \n$\n(687,055)\nnm\n__________________\nnm - not meaningful\nGains on crypto assets held for investment, net during the year ended December 31, 2024 were primarily due to remeasurement of the fair value of crypto assets held, mainly reflecting increases in the prices of Bitcoin and Ethereum.\n98\nTable \nof\n Contents\nOther income, net \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nLosses (gains) on strategic investments, net\n$\n11,553 \n$\n(24,368)\n$\n35,921 \n(147)\nGain on extinguishment of long-term debt, net\n— \n(117,383)\n117,383 \nnm\nOther\n(40,627)\n(25,832)\n(14,795)\n57 \nTotal other income, net\n$\n(29,074)\n$\n(167,583)\n$\n138,509 \n(83)\n__________________\nnm - not meaningful\n \n \nOther income, net changed for the year ended December 31, 2024 as compared to 2023, due to:\n•\na decrease in gains on strategic investments, net driven by a gain of $49.9 million resulting from an equity investment transaction with Circle US Holding, Inc. during the third quarter of 2023; and\n•\na net gain on the repurchase of certain of our 2026 Convertible Notes and certain of our Senior Notes during 2023.\nThere were no material changes to note within other.\nProvision for (benefit from) income taxes \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nProvision for (benefit from) income taxes\n$\n363,578 \n$\n(171,716)\n$\n535,294 \n(312)\nFor the year ended December 31, 2024 as compared to 2023, the increase in provision for income taxes was primarily due to higher pretax income, partially offset by tax benefits from stock-based compensation. Additionally, the 2023 income tax provision reflected a benefit from the reduction of a valuation allowance recorded on impairment charges and strategic investments.\nIn December 2021, the Organization for Economic Cooperation and Development introduced Pillar Two model rules imposing a 15% global minimum tax on companies such as ours. We operate in several jurisdictions that have introduced Pillar Two legislation with effect from January 1, 2024. Pillar Two did not have a material impact on our tax provision for 2024. However, we may be impacted in future years as this framework is modified and adjusted in the jurisdictions where we operate.\nNon-GAAP Financial Measure\nIn addition to our results determined in accordance with GAAP, we believe Adjusted EBITDA, a non-GAAP financial performance measure, is useful information to help investors evaluate our operating performance because it: enables investors to compare this measure and component adjustments to similar information provided by peer companies and our past financial performance; provides additional company-specific adjustments for certain items that may be included in income from operations but that we do not consider to be normal, recurring, operating expenses (or income) necessary to operate our business given our operations, revenue generating activities, business strategy, industry, and regulatory environment; and provides investors with visibility to a measure management uses to evaluate our ongoing operations and for internal planning and forecasting purposes. For example:\n•\nWe believe it is useful to exclude certain non-cash expenses, such as depreciation and amortization and stock-based compensation, from Adjusted EBITDA because the amounts of such expenses can vary significantly from period to period and may not directly correlate to the underlying performance of our business operations.\n99\nTable \nof\n Contents\n•\nWe believe it is useful to exclude certain items that we do not consider to be normal, recurring, cash operating expenses and therefore, not reflective of our ongoing business operations. For example, we exclude: (i) other (income) expense, net, as the income and expenses recognized in this line item are not part of our core operating activities and are considered non-operating activities under GAAP, (ii) gains and losses on crypto assets held for investment (post-adoption of ASU 2023-08) because such investments are considered primarily long-term holdings, we do not plan on engaging in regular trading of crypto assets, and, as an operating company, our investing activities in crypto are not part of our revenue generating activities, which are based on transactions on our platform and the sales of subscriptions and services, and (iii) the impact of our restructuring in 2023, which was not related to our normal business operations.\n•\nWe believe Adjusted EBITDA is useful to measure a company’s operating performance without regard to items such as stock-based compensation expense, depreciation and amortization expense, interest expense, other (income) expense, net, restructurings, and benefit from or provision for income taxes that can vary substantially from company to company depending upon their financing, capital structures, and the method by which assets were acquired.\nLimitations of Adjusted EBITDA\nWe believe that Adjusted EBITDA may be helpful to investors for the reasons noted above. However, Adjusted EBITDA is presented for supplemental informational purposes only, has limitations as an analytical tool, and should not be considered in isolation or as a substitute for financial information presented in accordance with GAAP. There are a number of limitations related to Adjusted EBITDA rather than net income (loss), which is the nearest GAAP equivalent of Adjusted EBITDA. Some of these limitations are that Adjusted EBITDA excludes: \n•\nprovision for (benefit from) income taxes; \n•\ninterest expense, or the cash requirements necessary to service interest or principal payments on our debt, which reduces cash available to us;\n•\ndepreciation and amortization expense and, although these are non-cash expenses, the assets being depreciated and amortized may have to be replaced in the future;\n•\nstock-based compensation expense, which has been, and will continue to be for the foreseeable future, a significant recurring expense for our business and an important part of our compensation strategy;\n•\nnet gains or losses on our crypto assets held for investment, net, after the adoption of ASU 2023-08;\n•\nother (income) expense, net, which represents foreign exchange gains or losses, gains or losses on strategic investments, net, gains on the repurchase of certain of our long-term debt, and other non-operating income and expense activity;\n•\nnon-recurring lease charges, which represent a non-recurring fee and write-off related to an early lease termination; \n•\nnon-recurring accrued legal contingencies, settlements, and related costs, which reduces cash available to us;\n•\nimpairment on crypto assets still held, net, which represents impairment on crypto assets still held and is a non-cash expense, prior to the adoption of ASU 2023-08; and\n•\nthe impact of restructuring, which is not related to normal operations but impacted our results in 2023. \n100\nTable \nof\n Contents\nIn addition, other companies, including companies in our industry, may calculate Adjusted EBITDA differently or may use other measures to evaluate their performance, all of which could reduce the usefulness of our disclosure of Adjusted EBITDA as a tool for comparison. A reconciliation is provided below for Adjusted EBITDA to Net income (loss), the most directly comparable financial measure stated in accordance with GAAP. Investors are encouraged to review the related GAAP financial measure and the reconciliation of Adjusted EBITDA to Net income (loss), and not to rely on any single financial measure to evaluate our business.\nRevised definition of Adjusted EBITDA\nDuring the first quarter of 2024, we revised our definition of Adjusted EBITDA as follows and recast the prior period for comparability:\n•\nto adjust for other (income) expense, net in total, as the entire line item represents non-operating activity, and as a majority of the activity recorded in other (income) expense, net had been included in the calculation of Adjusted EBITDA previously in separate rows while this combined presentation is more streamlined and easily reconciled to our Consolidated Statements of Operations; \n•\nto revise our definition of Adjusted EBITDA to remove the adjustment for crypto asset borrowing costs on Prime Financing, as even though these costs are akin to interest expense on debt, we believe they represent normal, recurring, operating expenses necessary to expand and grow Prime Financing; and\n•\nto revise our definition of Adjusted EBITDA to change what is adjusted with respect to gains and losses on crypto assets in connection with the adoption of ASU 2023-08, adjusting post-adoption only for gains and losses on crypto assets held for investment, as they do not represent normal, recurring, operating expenses (or income) necessary to operate our business.\n101\nTable \nof\n Contents\nThe following table provides a reconciliation of Net income (loss) to Adjusted EBITDA. The prior period comparative reconciliation has been updated to conform to the current period presentation (in thousands):\nYear Ended December 31,\n2024\n2023\nNet income\n$\n2,579,066 \n$\n94,871 \nAdjusted to exclude the following:\nProvision for (benefit from) income taxes\n363,578 \n(171,716)\nInterest expense\n80,645 \n82,766 \nDepreciation and amortization\n127,518 \n139,642 \nStock-based compensation expense\n(1)\n912,838 \n780,668 \nGains on crypto assets held for investment, net (post-adoption of ASU 2023-08)\n(687,055)\n— \nOther income, net\n(2)\n(29,074)\n(167,583)\nNon-recurring lease charges\n— \n31,955 \nNon-recurring accrued legal contingencies, settlements, and related costs\n— \n15,000 \nImpairment on crypto assets still held, net (pre-adoption of ASU 2023-08)\n— \n29,481 \nRestructuring\n— \n142,594 \nAdjusted EBITDA\n$\n3,347,516 \n$\n977,678 \nRevised definition no longer adjusts for:\nCrypto asset borrowing costs\n$\n4,807 \nOther impairment expense\n18,793 \nRevised definition newly adjusts for:\nAdditional other income, net\n(3)\n(37,624)\nAdjusted EBITDA, previous definition\n$\n963,654 \n__________________\n(1)\nAmount in 2023 excludes stock-based compensation expense recognized in relation to restructuring, which is included below in the restructuring line in this table. See \nNote 20. Restructuring\n, of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details.\n(2)\nSee \nNote\n \n16. Other (Income) Expense, Net\n, of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details.\n(3)\nRepresents the portion of Other (income) expense, net that was not previously included as an adjustment to arrive at Adjusted EBITDA. \nLiquidity and Capital Resources\nWe continue to believe our existing cash and cash equivalents and USDC will be sufficient in both the short and long term to meet our requirements and plans for cash, including meeting our working capital and capital expenditure requirements. Our ability to meet our requirements and plans for cash, including meeting our working capital and capital expenditure requirements, will depend on many factors, including market acceptance \nof crypto assets and blockchain technology, our growth, our ability to attract and retain customers on our platform, the continuing market acceptance of our products and services, the introduction of new subscription products and services on our platform, expansion of sales and marketing activities, and overall economic conditions. We anticipate satisfying our short-term cash requirements with our existing cash and cash equivalents \nand \nUSDC\n and \nwith future cash flows from operations and may satisfy our long-term cash requirements additionally with proceeds from a future equity or debt financing. \nThe sale of additional equity would result in additional dilution to our stockholders. The incurrence of additional debt financing would result in debt service obligations, and the instruments governing such debt could provide for operating and financing covenants that would restrict our operation\ns. \n102\nTable \nof\n Contents\nPrimary resources and commitments\nCash and cash equivalents and USDC\nOur cash and cash equivalents and USDC balances consisted of the following (in thousands):\nDecember 31,\n2024\n2023\nCash and cash equivalents\nCash equivalents\n(1)\n$\n6,607,023 \n$\n3,682,917 \nCash held at banks\n1,848,700 \n1,367,643 \nCash held at venues\n88,180 \n88,791 \nTotal cash and cash equivalents\n$\n8,543,903 \n$\n5,139,351 \nUSDC\n(2)\nUSDC loaned\n(3)\n$\n168,795 \n$\n205,645 \nUSDC pledged as collateral\n(3)\n329,832 \n29,577 \nUSDC not loaned or pledged as collateral\n743,181 \n340,806 \nTotal USDC\n$\n1,241,808 \n$\n576,028 \n__________________\n(1)\nCash equivalents consists of money market funds.\n(2)\nUSDC is a stablecoin redeemable on a one-to-one basis for U.S. dollars. While not accounted for as cash or cash equivalents, we treat our USDC holdings as a liquidity resource.\n(3)\nUSDC loaned represents loaned assets that do not meet the criteria for derecognition in our Consolidated Balance Sheets. USDC pledged as collateral represents assets pledged as collateral that do not meet derecognition criteria against our crypto asset borrowings in our Consolidated Balance Sheets. See \nNote 2. Summary of Significant Accounting Policies—Collateralized arrangements and financing \nof the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details.\nLong-term debt\nOn March 18, 2024, we issued \n$1.3 billion\n in aggregate principal amount of convertible senior notes that mature on April 1, 2030, unless converted, redeemed or repurchased on an earlier date. As of December 31, 2024, we held $4.3 billion in aggregate principal amount of long-term debt. \nAs market conditions warrant, we may, from time to time, repurchase our outstanding long-term debt securities in the open market, in privately negotiated transactions, by exchange transaction, or otherwise. Such repurchases, if any, will depend on prevailing market conditions, our liquidity, and other factors, and may be commenced or suspended at any time. The amounts involved and total consideration paid may be material. In 2023, we repurchased \n$427.0 million\n in aggregate principal amount of our outstanding long-term debt securities for cash payments aggregating \n$303.5 million\n.\nSee \nNote\n \n10. Long-Term Debt \nof the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details on our long-term debt, including maturities and repurchases.\nAs of \nDecember 31, 2024\n and \n2023\n, our ratings with S&P Global Ratings were \nBB-\n for both issuer credit and senior unsecured debt. As of \nDecember 31, 2024\n and \n2023,\n our ratings with Moody’s Ratings were \nB2\n for corporate family and \nB1\n for guaranteed senior unsecured notes.\n \nOther resources and commitments\nCrypto assets\nThe Company holds crypto assets for investment and operating purposes, as well as borrowed crypto assets and crypto assets held as collateral. Effective January 1, 2024, we adopted ASU 2023-08 using a modified retrospective approach and recognized an associated fair value adjustment of\n $739.5 million\n on \n103\nTable \nof\n Contents\nthe crypto assets we held at that time. This adjustment caused the carrying values of the crypto assets we already held at the time to reflect their fair values and, as such, this adjustment does not represent additional capital resources generated during 2024.\nCrypto assets held for operations\nWe primarily receive crypto assets held for operations as payments for transaction revenue, blockchain rewards, custodial fee revenue, and other subscriptions and services revenue. Our intent is to convert crypto assets received as a form of payment to cash or to use them to fulfill expenses, primarily blockchain rewards, nearly immediately. During times of instability in the crypto assets market, we may not be able to sell our crypto assets at reasonable prices or at all. As a result, our crypto assets held for operations are considered less liquid than our cash and cash equivalents and may not be able to serve as a source of liquidity for us to the same extent as cash and cash equivalents. See \nNote 5. Crypto Assets Held for Operations\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details.\nCrypto assets held as collateral\nCrypto assets held as collateral represent institutional customers’ crypto assets pledged as collateral on certain Prime Financing loans. See \nNote 4. Collateralized Arrangements and Financing\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details related to collateral held and our obligation to return collateral. As Prime Financing grows, we will continue to evaluate how to best utilize these resources to help fund the growth of this business.\nCrypto assets borrowed and borrowings\nWe borrow crypto assets from eligible institutional customers. These borrowings generally have open-ended terms or have a term of less than one year. \nWe are required to maintain a collateral to loan ratio per our borrowing agreements. Any significant change in crypto asset prices could impact the value of the crypto assets borrowed or the value of crypto assets pledged as collateral\n. \nIf crypto asset prices rise, we will post additional collateral to maintain required collateral loan ratio\ns. We were in compliance with all collateral requirements as of December 31, 2024. See \nNote 4. Collateralized Arrangements and Financing\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details relating to crypto assets borrowed and borrowings.\nCrypto assets held for investment\nWe view our crypto asset investments as primarily long-term holdings and we do not and do not plan to engage in regular trading of these crypto assets. In case of a liquidity stress event, or for other episodic purposes, which may necessitate the use of these assets, we may change our policy and sell crypto assets held for investment to generate liquidity. See \nNote 7. Crypto Assets Held for Investment\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details.\nCustomer assets and liabilities\nRecognized c\nustomer assets and liabilities comprise customer custodial funds and corresponding customer custodial liabilities that represent our obligation to return these assets to the customers. We also hold additional customer Assets on Platform that we do not recognize in our Consolidated Balance Sheets. See \nKey Business Metrics\n—\nAssets on Platform\n above, and \nNote\n \n2. Summary of Significant Accounting Policies\n—\nCustomer custodial funds and Customer custodial fund liabilities \nof the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details. We do not use customer crypto assets as collateral for any loan, margin, rehypothecation, or other similar activities to which we or our affiliates are a party, without the customer’s consent. \n104\nTable \nof\n Contents\n Our business model does not expose us to liquidity risk if we have excessive redemptions or withdrawals from customers. \nAs of December 31, 2024, we have not experienced excessive redemptions or withdrawals, or prolonged suspended redemptions or withdrawals, of crypto assets to date. \nSee \nRisk Factors—Depositing and withdrawing crypto assets into and from our platform involves risks, which could result in loss of customer assets, customer disputes and other liabilities, which could adversely affect our business, operating results, and financial condition \nincluded in Part I,"
}