{
  "ticker": "COST",
  "cik": "0000909832",
  "company_name": "COSTCO WHOLESALE CORP /NEW",
  "filing_date": "2025-10-08",
  "accession": "0000909832-25-000101",
  "primary_doc": "cost-20250831.htm",
  "item1_text": "Item 1A—Risk Factors\nThe risks described below could materially and adversely affect our business, financial condition and results of operations. We could also be affected by additional risks that apply to all companies operating in the U.S. and globally, as well as other risks that are not presently known to us or that we currently consider to be immaterial. These Risk Factors should be carefully reviewed in conjunction with Management\n'\ns Discussion and Analysis of Financial Condition and Results of Operations in Item 7 and our consolidated financial statements and related notes in Item 8 of this Report.\nBusiness and Operating Risks\nWe are highly dependent on the financial performance of our U.S. and Canadian operations.\nOur financial and operational performance is highly dependent on our U.S. and Canadian operations, which comprised 86% and 84% of net sales and operating income in 2025. Within the U.S., we are highly dependent on our California operations, which comprised 26% of U.S. net sales in 2025. Our California market, in general, has a larger percentage of higher volume warehouses as compared to our other domestic markets. Any substantial slowing or sustained decline in these operations could materially adversely affect our business and financial results. Declines in financial performance of our U.S. operations, particularly in California, and our Canadian operations could arise from, among other things: slow growth or declines in comparable warehouse sales (comparable sales); negative trends in operating expenses, including increased labor, healthcare and energy costs; failing to meet targets for warehouse openings; cannibalizing existing locations with new warehouses; shifts in sales mix toward lower gross margin products; changes or uncertainties in economic conditions in our markets, including higher levels of unemployment and depressed home values; and failing to consistently provide high quality and innovative new products.\nWe may be unsuccessful implementing our growth strategy, including expanding our business in existing markets and new markets, and integrating acquisitions, which could have an adverse impact on our business, financial condition and results of operations.\nOur growth is dependent, in part, on our ability to acquire property and build or lease new warehouses and depots. We compete with other retailers and businesses for suitable locations. Local land use and other regulations restricting the construction and operation of our warehouses and depots, as well as local community actions opposed to the location of our warehouses or depots at specific sites and the adoption of local laws restricting our operations and environmental regulations, may impact our ability to find suitable locations and increase the cost of sites and of constructing, leasing and operating warehouses and depots. We also may have difficulty negotiating leases or purchase agreements on acceptable terms. With continued growth in global demand for electricity and water stress in certain regions, we may have difficulty securing long-term utility contracts for new buildings or incur additional costs due to onsite generation and storage requirements. In addition, certain jurisdictions have enacted or proposed laws and regulations that would prevent or restrict the operation or expansion plans of certain large retailers and warehouse clubs, including us. Failure to effectively manage these and other similar factors may affect our ability to timely build or lease and operate new warehouses and depots, which could have a material adverse effect on our future growth and profitability.\nWe seek to expand in existing markets to attain a greater overall market share. A new warehouse may draw members away from our existing warehouses and adversely affect their comparable sales performance, member traffic, and profitability.\nWe intend to continue to open warehouses in new markets. Associated risks include difficulties in attracting members due to a lack of familiarity with us, attracting members of other wholesale club operators, our lesser familiarity with local member preferences, and seasonal differences in the market. Entry into new markets may bring us into competition with new competitors or with existing competitors with a large, established market presence. We cannot ensure that new warehouses and new e-commerce sites will be profitable and future profitability could be delayed or otherwise materially adversely affected.\n9\nTable of Contents\nWe have made and may continue to make investments and acquisitions to improve the speed, accuracy and efficiency of our supply chains and delivery channels. The effectiveness of these investments can be less predictable than opening new locations and might not provide the anticipated benefits or desired rates of return.\nOur failure to maintain membership growth, loyalty and brand recognition could adversely affect our results of operations.\nMembership loyalty and growth are essential to our business. The extent to which we achieve growth in our membership base, increase the penetration of Executive membership, and sustain high renewal rates materially influences our profitability. Damage to our brands or reputation may negatively impact comparable sales, diminish member trust, and reduce renewal rates and, accordingly, net sales and membership fee revenue, negatively impacting our results of operations.\nWe sell many products under our Kirkland Signature brand. Maintaining consistent product quality, competitive pricing, and availability of these products is essential to developing and maintaining member loyalty. These products also generally carry higher margins than national brand products and represent a growing portion of our overall sales. If the Kirkland Signature brand experiences a loss of member acceptance or confidence, our sales and gross margin results could be adversely affected.\nDisruptions in merchandise distribution or processing, packaging, manufacturing, and other facilities could adversely affect sales and member satisfaction.\nWe depend on the orderly operation of the merchandise receiving and distribution process, primarily through our depots. We also rely upon processing, packaging, manufacturing and other facilities to support our business, which includes the production of certain private-label items. Although we believe that our operations are efficient, disruptions due to extreme weather, pandemics or other catastrophic events, labor issues, work stoppage, or other shipping problems may result in delays in the production and delivery of merchandise to and the operation of our warehouses, which could adversely affect sales and the satisfaction of our members. Our e-commerce operations depend heavily on logistics providers, both internal and external, and are negatively affected when services are unable to be provided in a timely fashion.\nWe may not timely identify or effectively respond to consumer tastes and preferences, which could negatively affect our relationship with our members, the demand for our products and services, and our market share.\nIt is difficult to consistently and successfully predict the products and services that our members will desire. Our success depends, in part, on our ability to identify and respond to trends in demographics and consumer preferences. Failure to identify timely or effectively respond to changing consumer tastes, preferences and spending patterns including those related to resource efficiency, environmental protection, human rights, and the transition to a low-carbon economy could negatively affect our relationship with our members, the demand for our products and services, and our market share. We sell a substantial amount of gasoline, the demand for which could be impacted by concerns and regulation about climate change.\nIf we are not successful at predicting our sales trends and adjusting our purchases accordingly, we may have excess inventory, which could result in additional markdowns, or we may experience out-of-stock positions and delivery delays, which could result in higher costs, both of which would reduce our operating performance. This could have an adverse effect on net sales, gross margin and operating income.\nAvailability and performance of our IT systems are vital to our business. Failure to successfully execute IT projects and have IT systems available to our business would adversely impact our operations.\n10\nTable of Contents\nIT systems play a crucial role in conducting our business. These systems are utilized to, among other things, process a very high volume of transactions, conduct payment transactions, track and value our inventory and produce reports critical for making business decisions. Failure or disruption of these systems could have an adverse impact on our ability to buy products and services from our suppliers, produce goods in our manufacturing plants, move products in an efficient manner to our warehouses, and sell products to our members. Given the high volume of transactions we process, it is important that we build strong resiliency to lessen disruption from events such as power outages, computer and telecommunications failures, viruses, internal or external security breaches and other cybersecurity incidents, errors by employees, extreme weather, and catastrophic events. Any debilitating failure of our critical IT systems, data centers and backup systems would require significant investments in resources to restore services and may cause serious impairment in our business operations, including loss of business services, increased cost of moving merchandise and failure to provide service to our members. We are currently making substantial investments in technology and IT projects, including maintaining and enhancing our digital resiliency, and failure or delay in these projects could be costly and harmful to our business. Failure to deliver IT projects efficiently and effectively could result in the loss of our competitive position and adversely impact our financial condition and results of operations. Insufficient IT capacity could also impact our capacity for timely, complete and accurate financial and non-financial reporting required by law.\nWe are required to maintain the privacy and security of personal and business information amidst multiplying threat landscapes and in compliance with increasing privacy and data protection regulations globally. Failure to do so could damage our business, including our reputation with members, suppliers and employees, cause us to incur substantial additional costs, and become subject to litigation and regulatory action.\nIncreased security threats and more sophisticated cyber misconduct pose a risk to our systems, networks, products and services. We rely upon IT systems and networks, some of which are managed by or belong to third parties, including suppliers, partners, vendors, and service providers. Additionally, we collect, store and process sensitive information relating to our business, members, employees, and other third parties. Operating these IT systems and networks and processing and maintaining this data in a secure manner, are critical to our business operations and strategy. Remote work has also expanded possible attack surfaces. Attempts to gain unauthorized access to systems, networks and data, both ours and third parties with whom we work, are increasing in frequency and sophistication, and in some cases, these attempts are successful. Cybersecurity attacks may range from random attempts to coordinated and targeted attacks, including sophisticated computer crimes and advanced persistent threats. Phishing attacks have emerged as particularly prominent, including as vectors for ransomware attacks, which have increased in breadth and frequency. While we train our employees as part of our security efforts, that training cannot be completely effective. These threats pose a risk to the security of our systems and networks and the confidentiality, integrity, and availability of our data. Our IT systems and networks, or those managed by third parties such as cloud providers or suppliers that otherwise host or have access to confidential information, periodically have vulnerabilities, which may go unnoticed for a period of time. Our logging capabilities, or the logging capabilities of third parties, are also not always complete or sufficiently detailed, affecting our ability to fully investigate and understand the scope of security events. While our cybersecurity and compliance efforts seek to mitigate such risks, there can be no guarantee that the actions and controls we and our third-party service providers have implemented and are implementing, will be sufficient to protect our systems, information or other property.\nThe potential impacts of a cybersecurity attack include reputational damage, litigation, government enforcement actions, penalties, disruption to systems and operations, unauthorized release of confidential or otherwise protected information, corruption of data, diminution in the value of our investment in IT systems and increased cybersecurity protection and remediation costs. This could adversely affect our competitiveness, results of operations and financial condition and, critically in light of our business model, loss of member confidence. Further, the insurance coverage we maintain and indemnification arrangements with third parties may be inadequate to cover claims, costs, and liabilities relating to \n11\nTable of Contents\ncybersecurity incidents. In addition, data we collect, store and process is subject to a variety of U.S. and international laws and regulations (such as the European Union General Data Protection Regulation, California Consumer Privacy Act, Health Insurance Portability and Accountability Act, and China's Personal Information Protection Act), evolving rules concerning artificial intelligence, and other privacy and cybersecurity laws and restrictions on use of member information that may also impair our ability to utilize data, consistent with member consents and preferences, which may carry significant potential penalties for noncompliance.\nWe are subject to payment-related risks.\nWe accept payments using a variety of methods, including select credit and debit cards, cash and checks, co-brand cardholder rebates, Executive member 2% reward certificates, and our shop card. As we offer new payment options to our members, we may be subject to additional rules, regulations, compliance requirements, and higher fraud losses. For certain payment methods, we pay interchange and other related acceptance fees, along with additional transaction processing fees. We rely on third parties to provide payment transaction processing services for credit and debit cards and our shop card. It could disrupt our business if these parties become unwilling or unable to provide these services to us. We are also subject to fee increases by these service providers.\nWe must comply with evolving payment card association and network operating rules, including data security rules, certification requirements and rules governing electronic funds transfers. For example, we are subject to Payment Card Industry Data Security Standards, which contain compliance guidelines and standards with regard to our security surrounding the physical and electronic storage, processing and transmission of individual cardholder data. If our internal systems are breached or compromised, we may be liable for card re-issuance costs, subject to fines and higher transaction fees and lose our ability to accept card payments from our members, and our business and operating results could be adversely affected. Our failure to offer payment methods desired by our members could create a competitive disadvantage.\nWe might sell products that cause illness or injury to our members, harm to our reputation, and expose us to litigation.\nIf our merchandise, including food and prepared food products for human consumption, drugs, children\n'\ns products, pet products and durable goods, do not meet or are perceived not to meet applicable safety or labeling standards or our members\n'\n expectations, we could experience lost sales, increased costs, litigation or reputational harm. The sale of these items involves the risk of illness or injury to our members. Such illnesses or injuries could result from tampering by unauthorized third parties, product contamination or spoilage, including the presence of foreign objects, substances, chemicals, other agents, or residues introduced during the growing, manufacturing, storage, handling and transportation phases, or faulty design. Our suppliers are generally contractually required to comply with product safety laws, and we are dependent on them to ensure that the products we buy comply with safety and other standards. While we are subject to governmental inspection and regulations and work to comply in all material respects with applicable laws and regulations, we cannot be sure that consumption or use of our products will not cause illness or injury or that we will not be subject to claims, lawsuits, or government investigations relating to such matters, resulting in costly product recalls and other liabilities that could adversely affect our business and results of operations. Even if a product liability claim is unsuccessful or is not fully pursued, negative publicity could adversely affect our reputation with existing and potential members and our corporate and brand image, and these effects could be long-term.\nIf we do not successfully develop and maintain a relevant and comprehensive digital experience for our members, our results of operations could be adversely impacted.\nWe must keep pace with changing member expectations and new developments by our competitors. Our members are increasingly using mobile phones, tablets, computers, and other devices to shop and otherwise interact with us. We are making investments in our websites and mobile applications. If we are \n12\nTable of Contents\nunable to make, improve, or develop relevant member-facing technology in a timely manner, our ability to compete and our results of operations could be adversely affected.\nInability to attract, train and retain qualified employees could adversely impact our business, financial condition and results of operations.\nOur success depends on the continued contributions of our employees, including members of our senior management and other key operations, IT, merchandising and administrative personnel. Failure to identify and implement a succession plan for senior management could negatively impact our business. We must attract, train and retain a large and growing number of qualified employees, while controlling related labor costs and maintaining our core values. Our ability to control labor and benefit costs is subject to numerous internal and external factors, including regulatory changes, prevailing wage rates, union relations and healthcare and other insurance costs. We compete with other retail and non-retail businesses for these employees and invest significant resources in training and motivating them. There is no assurance that we will be able to attract or retain highly qualified employees in the future, which could have a material adverse effect on our business, financial condition and results of operations.\nWe may incur property, casualty or other losses not covered by our insurance.\nClaims for employee health care benefits, workers’ compensation, general liability, property damage, directors’ and officers’ liability, vehicle liability, inventory loss, and other exposures are funded predominantly through self-insurance. Insurance coverage is maintained for certain risks to limit exposures arising from very large losses. The types and amounts of insurance may vary from time to time based on our decisions with respect to risk retention and regulatory requirements. Significant claims or events, regulatory changes, a substantial rise in costs of health care or costs to maintain our insurance or the failure to maintain adequate insurance coverage could have an adverse impact on our financial condition and results of operations.\nAlthough we maintain specific coverages for catastrophic property losses, we still bear a significant portion of the risk of losses incurred as a result of any physical damage to, or the destruction of, any warehouses, depots, manufacturing or home office facilities, loss or spoilage of inventory, and business interruption. Such losses could materially impact our cash flows and results of operations.\nMarket and Other External Risks\nWe face strong competition from other retailers and warehouse club operators, which could adversely affect our business, financial condition and results of operations.\nThe retail business is highly competitive. We compete for members, employees, sites, products and services and in other important respects with a wide range of local, regional and national wholesalers and retailers, both in the United States and in foreign countries, including other warehouse-club operators, supermarkets, supercenters, online retailers, gasoline stations, pharmacies, hard discounters, department and specialty stores and operators selling a single category or narrow range of merchandise or services. Such retailers and warehouse club operators compete vigorously and in a variety of ways, including pricing, selection and availability, services, location, convenience, store hours, and the attractiveness and ease of use of websites and mobile applications. The evolution of retailing in online and mobile channels has improved the ability of customers to comparison shop, which has enhanced competition. Some competitors have greater financial resources and technology capabilities, including the faster adoption of artificial intelligence, better access to merchandise, and greater market penetration than we do. Our inability to respond effectively to competitive pressures, changes in the retail markets or customer expectations could result in lost market share and negatively affect our financial results.\n13\nTable of Contents\nGeneral economic factors, domestically and internationally, may adversely affect our business, financial condition, and results of operations.\nHigher energy and gasoline costs, inflation, levels of unemployment, healthcare costs, consumer debt levels, foreign-currency exchange rates, unsettled financial markets, weaknesses in housing and real estate markets, reduced consumer confidence, changes and uncertainties related to government fiscal, monetary and tax policies including changes in interest rates, tax rates, duties, tariffs, or other restrictions, sovereign debt crises, pandemics and other health crises, and other economic factors could adversely affect demand for our products and services, require a change in product mix, or impact the cost of or ability to purchase inventory. Additionally, trade-related actions in various countries have affected the costs of some of our merchandise. The degree of our exposure is dependent on (among other things) the type of goods, rates imposed, and timing of the tariffs and policy changes. The impact to our net sales and gross margin is influenced in part by our merchandising and pricing strategies in response to potential cost increases. Higher tariffs could adversely impact our results.\nPrices of certain commodities, including gasoline and consumable goods used in manufacturing and our warehouse retail operations, are historically volatile and are subject to fluctuations arising from changes in domestic and international supply and demand, inflationary pressures, labor costs, competition, market speculation, government regulations, taxes and periodic delays in delivery. Rapid and significant changes in commodity prices and our ability and desire to pass them through to our members may affect our sales and profit margins. These factors could also increase our merchandise costs and selling, general and administrative expenses, and otherwise adversely affect our operations and financial results. General economic conditions can also be affected by events like the outbreak of hostilities or acts of terrorism.\nInflationary factors such as increases in merchandise costs may adversely affect our business, financial condition and results of operations. We may not be able to adjust prices to sufficiently offset the effect of cost increases without negatively impacting consumer demand.\nSuppliers may be unable to timely supply us with quality merchandise at competitive prices or may fail to adhere to our high standards, resulting in adverse effects on our business, merchandise inventories, sales, and profit margins.\nWe depend heavily on our ability to purchase quality merchandise in sufficient quantities at competitive prices. As the quantities we require continue to grow, we have no assurances of continued supply, appropriate pricing or access to new products, and any supplier has the ability to change the terms upon which they sell to us or discontinue selling to us. Member demands may lead to out-of-stock positions causing a loss of sales and profits.\nWe buy from numerous domestic and foreign suppliers and importers. Our inability to acquire suitable merchandise on acceptable terms or the loss of key suppliers could negatively affect us. We may not be able to develop relationships with new suppliers, and products from alternative sources, if any, may be of a lesser quality or more expensive. Because of our efforts to adhere to high-quality standards for which available supply may be limited, particularly for certain food items, the large volumes we demand may not be consistently available. Our efforts to secure supply could lead to commitments that prove to be unsuccessful in the short and long-term.\nOur suppliers (and those they depend upon for materials and services) are subject to risks, including labor disputes, union organizing activities, human and animal rights violations, financial liquidity, climate change, natural disasters, extreme weather conditions, environmental degradation, public health emergencies, supply constraints and general economic and political conditions and other risks similar to those we face that could limit their ability to timely provide us with acceptable merchandise. One or more of our suppliers might not adhere to our quality control, packaging, legal, regulatory, labor, human rights, environmental or animal welfare standards. These deficiencies may delay or preclude delivery of merchandise to us and might not be identified before we sell such merchandise to our members. This \n14\nTable of Contents\nfailure could lead to recalls and litigation and otherwise damage our reputation and our brands, increase costs, and otherwise adversely impact our business.\nFluctuations in foreign-exchange rates may adversely affect our results of operations.\nDuring 2025, our international operations, including Canada, generated 27% and 34% of our net sales and operating income. Our international operations have accounted for an increasing portion of our warehouses, and we plan to continue international growth. To prepare our consolidated financial statements, we translate the financial statements of our international operations from local currencies into U.S. dollars using current exchange rates. Future fluctuations in exchange rates that are unfavorable to us may adversely affect the financial performance of our Canadian and Other International operations and have a corresponding adverse period-over-period effect on our results of operations. As we continue to expand internationally, our exposure to fluctuations in foreign-exchange rates may increase.\nA portion of the products we purchase is paid for in a currency other than the local currency of the country in which the goods are sold. Currency fluctuations may increase our merchandise costs and may not be passed on to members and thus may adversely affect our results of operations.\nNatural disasters, extreme weather conditions, or other catastrophic events could negatively affect our business, financial condition, and results of operations.\nNatural disasters, extreme weather conditions, and other catastrophic events, including those impacted by climate change, such as extreme temperatures, hurricanes, typhoons, floods, earthquakes, wildfires, droughts; acts of terrorism or violence, including active shooter situations; and energy shortages; particularly in California or Washington state, where our centralized operating systems and administrative personnel are located, could negatively affect our operations and financial performance. Such events could result in physical damage to our properties or inventory, additional heating, cooling, and refrigeration costs, limitations on store operating hours, less frequent visits by members to physical locations, the temporary closure of warehouses, depots, manufacturing or home office facilities, the temporary lack of an adequate work force, disruptions to our IT systems, the temporary or long-term disruption in the supply of products from some local or overseas suppliers, the temporary disruption in the transport of goods to or from overseas, delays in the delivery of goods to our warehouses or depots, delays in online merchandise delivery, the temporary reduction in the availability of products in our warehouses, and long-term disruption or threats to the habitability of key markets in which we operate. These events could also reduce demand for our products or make it difficult or impossible to procure products. We may be required to suspend operations in some or all of our locations, which could have a material adverse effect on our business, financial condition and results of operations.\nPandemics and other health crises could affect our business, financial condition and results of operations in many respects.\nThe emergence, severity, magnitude and duration of global or regional health crises are uncertain and difficult to predict. A pandemic could affect certain business operations, demand for our products and services, in-stock positions, costs of doing business, availability of labor, access to inventory, supply chain operations, our ability to predict future performance, exposure to litigation, and our financial performance, among other things. Other factors and uncertainties include, but are not limited to:\n•\nThe severity and duration of pandemics;\n•\nEvolving macroeconomic factors, including general economic uncertainty, unemployment rates, and recessionary pressures;\n•\nChanges in labor markets affecting us and our suppliers;\n•\nUnknown consequences on our business performance and initiatives stemming from the substantial investment of time and other resources to the pandemic response;\n•\nThe pace of post-pandemic recovery;\n•\nThe long-term impact of the pandemic on our business, including consumer behaviors; and\n•\nDisruption and volatility within the financial and credit markets.\n15\nTable of Contents\nFailure to meet financial market expectations could adversely affect the market price and volatility of our stock.\nWe believe that the price of our stock currently reflects high market expectations for our future operating results. Any failure to meet or delay in meeting these expectations, including our comparable sales growth rates, membership fee revenue, including new member sign-ups and renewal rates, gross margin, earnings, earnings per share, new warehouse openings, or dividend or stock repurchase policies could cause the price of our stock to decline.\nLegal and Regulatory Risks\nChanges in or failure to comply with laws and regulations could adversely impact our business, financial condition and results of operations.\nWe are subject to a wide and growing array of federal, state, local and international laws and regulations relating to (among other things), product and food safety, marketing, information security and privacy, labor and employment, imports and customs, transportation, intellectual property, anti-corruption, and environmental or social matters. These laws and regulations may expand mandatory reporting, increase the scope and complexity of matters that we are required to regulate, assess, and disclose, potentially limit our sourcing flexibility or require extensive system or other changes that could increase the cost of doing business. Failure to comply could result in harm to our members, employees, workers in the value chain or others, significant costs to satisfy environmental compliance, remediation or compensatory requirements, or the imposition of severe penalties or restrictions on operations by governmental agencies or courts that could adversely affect our business, financial condition and results of operations.\nThe impact of changes to or the introduction of new laws, regulations and policies and enforcement practices, can be unpredictable. These may require extensive system and operational changes, be difficult to implement, increase the cost of doing business, require significant capital expenditures, adversely impact the products or services we offer, or result in adverse publicity and harm to our reputation. If we fail to comply or respond adequately to changes in laws and regulations, our business, operations and financial performance may be adversely affected.\nWe are subject to risks associated with the legislative, judicial, accounting, regulatory, political and economic factors specific to the countries or regions in which we operate, which could adversely affect our business, financial condition and results of operations.\nAt the end of 2025, we operated 285 warehouses outside of the U.S. (31% of all warehouse locations), and we plan to continue expanding our international operations. Future operating results internationally could be negatively affected by a variety of factors, many similar to those we face in the U.S., certain of which are beyond our control. These factors include political and economic conditions, regulatory constraints, currency regulations, policy changes, and other matters in any of the countries or regions in which we operate, now or in the future. Other factors that may impact international operations include foreign trade (including tariffs and trade sanctions), monetary and fiscal policies and the laws and regulations of the U.S. and foreign governments, agencies and similar organizations, and risks associated with having major facilities in locations which have been historically less stable than the U.S. Risks inherent in international operations also include, among others, the costs and difficulties of managing international operations, adverse tax consequences, and difficulty in enforcing intellectual property rights. New reporting obligations globally are increasing the cost and complexity of doing business.\nChanges in accounting standards and subjective assumptions, estimates and judgments by management related to complex accounting matters could significantly affect our financial condition and results of operations.\nAccounting principles and related pronouncements, implementation guidelines, and interpretations we apply to a wide range of matters that are relevant to our business, including self-insurance liabilities, are highly complex and involve subjective assumptions, estimates and judgments by our management. \n16\nTable of Contents\nChanges in rules or interpretation or changes in underlying assumptions, estimates or judgments by our management could significantly change our reported or expected financial performance and have a material impact on our consolidated financial statements.\nWe are exposed to risks relating to evaluations of controls required by Section 404 of the Sarbanes-Oxley Act and otherwise.\nSection 404 of the Sarbanes-Oxley Act of 2002 requires management assessments of the effectiveness of internal control over financial reporting and disclosure controls and procedures. If we are unable to maintain effective internal control over financial reporting or disclosure controls and procedures, our ability to record, process and report financial information accurately and to prepare financial statements within required time periods could be adversely affected, which could subject us to litigation or investigations requiring management resources and payment of legal and other expenses, negatively affect investor confidence in our financial statements and adversely impact our stock price. Uncertainties around our developing systems concerning controls for non-financial reporting also create risks.\nChanges in federal, state and foreign tax rates and legislation, could adversely affect our financial condition and results of operations.\nWe are subject to a variety of taxes and tax collection and remittance obligations related to federal, state and foreign jurisdictions. Additionally, at any point in time, we may be under examination for value added, sales-based, payroll, product, import or other non-income taxes. We may recognize additional tax expense, be subject to additional tax liabilities, or incur losses and penalties, due to changes in laws, regulations, administrative practices, principles, assessments by authorities and interpretations related to tax, including tax rules in various jurisdictions. We compute our income tax provision based on enacted tax rates in the countries in which we operate. As tax rates vary among countries, a change in earnings attributable to the various jurisdictions in which we operate could result in an unfavorable change in our overall tax provision. Additionally, changes in the enacted tax rates or adverse outcomes in tax audits, including transfer pricing disputes, could have a material adverse effect on our financial condition and results of operations.\nFailure or perceived failure to meet our environmental, social or governance (ESG) goals or expectations set by changing public interest and government regulation of ESG topics could result in reputational harm or adversely affect our business.\nWe are committed to doing what is right for the business, our members, employees and shareholders over the long-term. Costco has set public targets and disclosed intentions for future action regarding sustainability. There are dependencies outside of our control impacting our ability to meet our goals, including but not limited to: economic conditions, ability to access technology at an appropriate cost or scale, the ability to procure sufficient clean energy at competitive market rates to meet future operational and supplier needs, unforeseen operational and implementation challenges, termination or contraction of policies or systems which support our capital investments, and collaboration with third parties. For example, multiple states are implementing extended producer responsibility laws that will require us to enact policies and processes and will increase expenses in the form of fees paid to the state governments, else be subject to fines and penalties, among other effects. We may not make adequate and timely investments or successfully implement strategies that will effectively achieve our sustainability-related goals. Furthermore, federal, state and local regulatory authorities, private organizations and individuals may challenge our approach to ESG issues, including allegations that we failed in our efforts, should not have undertaken such efforts or that we improperly engaged other entities in our approach to ESG issues. A failure or perceived failure to meet our goals or otherwise meet evolving and diverse stakeholder expectations could lead to reputational harm.\nOur operations require the treatment and disposal of wastewater, stormwater and agricultural and food processing wastes, the use and maintenance of refrigeration systems, noise, odor and dust management, the operation of mechanized processing equipment, and other operations that potentially could affect the \n17\nTable of Contents\nenvironment and public health and safety. Failure to comply with current and future environmental, health and safety standards could result in the imposition of fines and penalties, illness or injury of our employees, and claims or lawsuits related to such illnesses or injuries, and temporary closures or limits on the operations of facilities.\nNatural gas, diesel fuel, gasoline, and electricity are used in our operations, distribution channels, and value chain. Government regulations limiting carbon dioxide and other greenhouse gas emissions and other environmental restrictions may increase compliance, operations, and merchandise costs, and other regulations affecting energy inputs could materially affect our profitability.\nMore stringent fuel economy standards, changing public policies aimed at increasing the adoption of zero-emission and alternative fuel vehicles, and other regulations related to climate change may affect our future operations, adversely impact certain elements of our profitability, and require significant capital expenditures.\nWe are involved in a number of legal proceedings and audits and some of these outcomes could adversely affect our business, financial condition and results of operations.\nOur business requires compliance with many laws and regulations. Failure to achieve compliance could subject us to lawsuits and other proceedings and lead to damage awards, fines, penalties, and remediation costs. We are or may become involved in a number of legal proceedings and audits, including grand jury investigations, government and agency investigations, and consumer, employment, tort, unclaimed property laws, and other litigation. We cannot predict with certainty the outcomes of these proceedings and other contingencies, including environmental remediation and other proceedings commenced by governmental authorities. The outcome of some of these proceedings, audits, unclaimed property laws, and other contingencies could require us to take, or refrain from taking, actions which could negatively affect our operations or could require us to pay substantial amounts of money, adversely affecting our financial condition and results of operations. Additionally, defending against these lawsuits and proceedings may involve significant expense and diversion of management\n'\ns attention and resources.\nItem 1B—Unresolved Staff Comments\nNone.\nItem 1C—Cybersecurity\nRisk Management and Global Strategy\nWe have implemented processes, technologies, and controls to seek to assess, identify, and manage risks associated with cybersecurity threats.\n Management considers cybersecurity risks within our overall approach to enterprise risk management. We evaluate these risks based on several frameworks, including the National Institute of Standards and Technology (NIST) Cybersecurity Framework (CSF), Center for Internet Security (CIS) 18 Critical Security Controls, and the Payment Card Industry Data Security Standard. Our governance policies, including our Information Security Policy, outline high-level objectives designed to meet compliance and regulatory requirements.\nWe undertake regular NIST CSF and CIS 18 Critical Security Controls assessments, conducted by a third-party, to measure program maturity.\n \nWe have implemented a variety of technologies, leveraging third-party security providers for some, and engage in multiple activities to seek to identify and mitigate vulnerabilities and risks in systems. These include, among other activities, scanning for common vulnerabilities and exposures, penetration tests on internal and external networks, code scans on applications, allowed application listing, configuration management tools, employee awareness and training, and internal and external audits. We also review with various frequencies and on a risk-based priority select third parties with whom we do business, in an effort to reduce the likelihood of security \n18\nTable of Contents\nincidents or business interruptions.\n We maintain cybersecurity insurance that would apply to certain losses arising from significant security incidents.\nWe maintain a security operations center, supported by external providers and our employees, which provides threat detection and incident response capabilities. We maintain cyber incident response plans and related playbooks in coordination with stakeholders (including legal counsel). Significant incidents will be escalated to a Cybersecurity Materiality Committee to assess materiality based on qualitative and quantitative factors. The Committee is composed of a cross-divisional group of executives representing the core business functions of Information Technology and Security, Operations, Administration, Finance and Accounting, and Legal. We conduct periodic tabletop exercises, including at the executive level, to review our response processes and incident management procedures.\nGovernance\nOur Board of Directors has delegated certain responsibilities to the Audit Committee of the Board.\n \nThe Audit Committee reviews and discusses with management the identification and mitigation of cybersecurity risks, including (among other things) the effectiveness of risk-management policies and practices designed to help safeguard our operations, financial systems, and data\n. \nOur Chief Information and Digital Officer (CIDO) and his executive team, including the Vice President of Information Security and Chief Information Security Officer (CISO), present cybersecurity-related topics, including program maturity progress, regularly to the Audit Committee.\n The Internal Audit team, in its periodic compliance and risk assessment updates to the Audit Committee, also reports on its reviews of certain of our cybersecurity risk exposures, controls, and management actions. The full Board also receives cybersecurity evaluations from time to time.\nOur information security organization is led by the \nCISO\n. The CISO is responsible for all aspects of our cybersecurity program, including cybersecurity engineering and architecture, cybersecurity operations, incident response, threat intelligence, identity and access management, cybersecurity risk and compliance, and vulnerability management.\n Our former CISO left the Company in June 2025, and we are actively sourcing a qualified replacement. In the interim, our Deputy CISO, who has over 20 years of cybersecurity and leadership experience, is managing the CISO responsibilities. The \nCISO position reports to our CIDO, who has more than 30 years experience in which he has led global digital responsibilities, including leading global cyber teams. Our CIDO reports to the Chief Executive Officer.\nRisks from Material Cybersecurity Threats\nWe and our third-party service and merchandise providers have experienced cybersecurity incidents and threats. \nBased on the information available as of the date of this Form 10-K, we are not aware of any risks from actual cybersecurity incidents that have materially affected us or are reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition.\n It is possible that there have been intrusions into our systems that have not been identified by our controls and procedures and that might manifest in significant events at a later time. There can be no guarantee that the actions and controls we and our third-party service providers have implemented and are implementing will be sufficient to protect our systems, information or other property. See “Risk Factors” in"
}