{
  "ticker": "CPAY",
  "cik": "0001175454",
  "company_name": "CORPAY, INC.",
  "filing_date": "2025-02-27",
  "accession": "0001628280-25-008746",
  "primary_doc": "flt-20241231.htm",
  "item1_text": "ITEM 1. BUSINESS\nIntroduction\nEffective March 25, 2024, FLEETCOR Technologies, Inc. changed its corporate \nname\n to Corpay, Inc. At that time, we ceased \ntrading under the ticker symbol \"FLT\" and began trading under our new ticker symbol, \"CPAY\", on the New York Stock \nExchange (NYSE) and have been a member of the S&P 500 since 2018. Corpay is a global corporate payments company that \nhelps businesses and consumers better manage and pay their expenses. Corpay's suite of modern payment solutions help \ncustomers better manage vehicle-related expenses (e.g., fueling, tolls, car registrations and parking), lodging expenses (e.g., \nhotel and extended stay bookings) and corporate payments (e.g., domestic and international accounts payable and point of sale \npurchases). This results in our customers saving time and ultimately spending less. Since its incorporation in 2000, Corpay has \ndelivered payment and spend solutions with customized controls and robust capabilities that offer our customers a better way to \npay.  \nBusinesses spend an estimat\ned \n$145 trillion\n each\n year in transactions with other businesses. In many instances, businesses lack \nthe proper tools to monitor what is being purchased and employ manual, paper-based, disparate processes and methods to both \napprove and make payments for their business-to-business purchases. This often results in wasted time and money due to \nunnecessary or unauthorized spending, fraud, receipt collection, data input and consolidation errors, inaccurate reimbursement \nprocessing, account reconciliation errors, employee misuse and more.\nDigital payments are faster and more secure than paper-based methods such as checks, provide timely and detailed data that can \nbe utilized to effectively reduce unauthorized purchases and fraud, automate data entry and reporting and eliminate \nreimbursement mistakes. Combining this payment data with analytical tools delivers powerful insights, which managers can use \nto better run their businesses.\n  \nCorpay’s vision is that every payment is digital, every purchase is controlled and every related decision is informed. Our wide \nrange of modern, digitized solutions provide control, reporting and automation benefits superior to many of the payment \nmethods businesses often use such as cash, paper checks, general purpose credit cards, as well as employee payment processes. \nIn addition to delivering meaningful value to our customers, our solutions also share several important and attractive business \nmodel characteristics including: \n•\nthe majority of revenue is derived primarily from business customers, which tend to have relatively predictable, \nconsistent volumes;\n•\nrecurring revenue models driven by recurring volume, resulting in predictable revenue;\n•\nunique selling systems with common sales approaches, management and reporting;\n•\nspecialized technology platforms and proprietary payment acceptance networks, which create competitive advantages \nand barriers to entry; and\n•\nhigh EBITDA margins and cash flow translation with limited infrastructure investment requirements.\nWe actively market and sell to current and prospective customers using a multi-channel, go-to-market strategy, which includes \ncomprehensive digital channels, direct sales forces and strategic partner relationships. We sell stand-alone products and services \nand are currently deploying platforms where a single customer can use multiple products from one user interface. It is important \nto note that we compete mostly with legacy payment companies and traditional ways of paying, such as cash and checks. We \nsupplement our organic growth strategy and sales efforts by pursuing attractive acquisition opportunities, which serve to \nstrengthen and extend our market positions and create value faster. With a long, proven operating history, Corpay facilitates \npayments to or on behalf of millions of businesses around the world using multiple modalities.\nCorpay has the following reportable segments: Vehicle Payments, Corporate Payments, Lodging Payments and Other. These \nsegments reflect how we organize and manage our global employee base, manage operating performance and execute on \nstrategic initiatives. Our Vehicle Payments solutions help control and monitor spending and include fuel card offerings, tolls \nand other complementary products. Our Corporate Payments solutions simplify and automate vendor payments and include \naccounts payable (AP) automation, virtual cards, cross-border payments and purchasing and travel and entertainment (\"T&E\") \ncard products. Our Lodging Payments solutions help businesses manage their lodging costs, while simplifying the management \nof hotels and housing, both short and longer-term, while also providing traveler and end customer support. \n5\nTable of Contents\nVehicle Payments\nOur Vehicle Payments solutions are purpose-built to enable our customers to pay for vehicle related expenses. For our business \ncustomers, we also provide greater control and visibility of spending when compared with less specialized payment methods, \nsuch as cash or general-purpose credit cards. Our digital enabled solutions provide customers with significant control \ncapabilities such as, customizable user-level controls, programmable alerts and detailed transaction reporting. Furthermore, our \nbusiness customers can use the data, controls and tools to combat employee misuse and fraud, streamline expense \nadministration and potentially lower their operating costs, accessible through sophisticated web portals and mobile applications. \nFor our consumer customers, our Vehicle Payment solutions provide seamless, mobile first digital experience when paying for \ncertain vehicle related expenses, removing the friction associated with alternative payment methods and having to use multiple \nservice providers.\nWe utilize both proprietary and third-party payment acceptance networks to deliver our Vehicle Payments solutions. In our \nproprietary networks, which tend to be geographically distinct and unique to the markets we serve, transactions are processed \non applications and operating systems owned and operated by us, and only at select participating merchants with whom we \nhave contracted directly for acceptance. These proprietary networks generally provide us with better economics, as we control \nmore of the transaction, and richer data because of how the networks and point of sale software are configured. Third-party \nnetworks are operated by independent parties, such as MasterCard and VISA, and tend to be more broadly accepted, which is \nthe primary benefit compared with our proprietary networks. \nFuel \n– \nOur fuel solutions are used by customers to pay and control spending for fuel for vehicles and fleets. Our fuel solutions \nare fuel type agnostic (fossil fuel, electricity, etc.). We offer fuel solutions to businesses and government entities who operate \nvehicle fleets, as well as to consumers primarily in Brazil, Mexico and Europe. At the most basic level, we provide the \nmeasurement of fuel used and facilitate the payment for that fuel to the merchant, whether that fuel be diesel, gasoline, \ncompressed natural gas or electricity, while also providing online control, reporting and tracking capabilities to fleet operators. \nIn many cases we can also deliver fuel price savings to our business customers when compared to the retail price of fuel. In the \nU.K. and Europe, we also enable fleets to significantly streamline the VAT reclaim process by digitizing and itemizing fuel \nreceipts in a way that is compliant with tax authority requirements.\nThe measurement, control and payment needs of our customers operating electric vehicles (EV) are similar to those operating \ntraditional, internal combustion vehicles, just centered around electricity usage instead of gas or diesel usage. As we help our \ncustomers manage through the transition to EVs, many will operate \"mixed\" fleets (i.e., fleets with a combination of internal \ncombustion vehicles and EVs) for a long period of time and will need access to all types of fueling, including networks of fuel \nstations, electric charging stations both on the road and at the office and at-home charging options. Considering the increased \ncomplexity of managing a mixed or an all EV fleet, our product sets are positioned to remain valuable and capture transaction \neconomics, regardless of the vehicle type or propulsion method. We have also enhanced our customer platforms and reporting \ncapabilities to ensure a fully integrated mixed fleet experience for our customers, so they can capture and review all the relevant \nfleet insights in one place, eliminating the need to select alternative providers for different fuel types or manage disparate \nsystems.\nMany of our solutions also have additional capabilities. For example, we can enable the fuel card to allow customers to \npurchase a limited set of non-fuel items, such as oil, tolls, parking and vehicle maintenance supplies. Our proprietary EV \nnetworks in the U.K. and western Europe, combined with our Mastercard network in the U.S., offer access to hundreds of \nthousands of charge points and the management of at-home charging, while also delivering additional value-added services \nthrough a mobile app, including the ability to locate and route to a charge-point, charge-point recharging speed, functionality \nand whether in use. Our EV home-charging software solution is aimed at fleets that need to accurately reimburse drivers for \ncharging that takes place at home for business purposes, capturing, measuring and accurately pricing relevant charging sessions \nand is directly integrated with energy companies to facilitate direct payment, thus bypassing the home energy account. We are \nactively expanding our EV footprint to accommodate charging in the U.S., U.K. and Europe.\nWe also provide program management services to major oil companies, leasing companies and fuel marketers, which allow \nthese partners to outsource the sales, marketing, credit, service and system operations of their branded fuel card portfolios. Our \nfuel partners include British Petroleum (BP), Arco, Speedway, Casey's and fuel marketers of all sizes.  On the EV side, we also \nprovide similar modular solutions to original equipment manufacturers (OEMs) who wish to distribute on-road EV charging \nsolutions to consumers buying an EV. We would typically either white-label our charging app or integrate directly via \napplication programming interface (API) with vehicle OEMs to deliver access to our products. Our vehicle OEM partners \ninclude Renault, NIO, Polestar and Jaguar-Land Rover.\nTolls \n– \nOperated primarily in Brazil, we are the leading electronic toll payments provider to businesses and consumers in the \nform of radio frequency identification (RFID) tags affixed to vehicle windshiel\nds. Our tolls solution primarily operates on our \nproprietary Sem Parar\nTM\n network, which processes transactions for more than 7.5 million tagholders on 100% of the toll roads \nthat accept RFID across Brazil. We provide convenience and faster travel for customers, while also reducing manual labor and \ncash handling at merchants’ toll booths. Our tolls solution also provides commercial customers with driver routing controls and \nfare auditing, mostly in the form of vehicle type and axle count configuration. \n6\nTable of Contents\nOur tags may also be used at approximately 7,300 participating merchant locations to purch\nase goods and services \nwhile in the \nvehicle, such as parking, fuel, car washes and meals at drive-through restaurants.\n At merchant locations, payment via electronic \ntags is faster, safer and more secure for customers, which in turn increases loyalty and throughput for merchants and eliminates \nthe handling of cash. \nParking \n– \nOur parking app for mobile devices allows millions of consumers and fleets to instantaneously pay for parking, \nreplacing the use of coins or cash for parking. Our solution also allows business fleets the ability to manage their vehicles from \nanywhere, add and remove authorized drivers and pay in a secured and approved modality. Given the high frequency nature of \nuse and the millions of monthly active users on the app, parking lends itself to further extension into the other services we offer, \nnamely EV charging, insurance, maintenance and fueling, amongst others. Our parking solutions are available in the U.S., \nCanada, Europe, the U.K. and Brazil.\nVehicle Compliance \n– \nOur apps for mobile devices in Brazil allow millions of drivers to pay for vehicle taxes, vehicle \nregistration and parking and fines instantly. These solutions help drivers manage and monitor their vehicle's and license's \ncompliance by leveraging technology and data in consolidated and efficient platforms. \nFleet Maintenance \n– \nWe provide a SaaS-based vehicle management solution that helps major leasing companies, as well as \nfleet operators of all sizes, to manage their vehicle maintenance, service and repair needs primarily in the U.K., and also in \nGermany, France, Denmark, Ireland, Australia and Portugal. This solution is provided through our proprietary maintenance and \nrepair network, which, in the U.K., processes transactions for fleet customers at approximately\n 9,000 service centers.\n The same \nplatform also provides leasing companies with the ability to manage the re-marketing of leased vehicles and any ad-hoc vehicle \nrental needs. In addition, we offer compliance services to the U.K.’s heavy goods (truck) operators, workshops and drivers. \nAlso, we are increasingly extending the platform for use in the small fleet and business-to-business-to-consumer (B2B2C) \nspace, enabling consumers to access our proprietary maintenance network at advantaged economics to them. Finally, we offer \ntire repair and management services to leasing companies and large fleets, servicing over one million vehicles across \napproximately 25,000 tire centers in Germany, Austria, Switzerland, Norway, Sweden, Finland, Czech Republic and Hungary.\nBenefits \n– \nIn Mexico and Brazil, we offer prepaid food vouchers or cards that may be used as a form of payment in restaurants \nand grocery stores. Additionally, in Brazil, we offer prepaid transportation cards and vouchers that may be used by commuting \nemployees as a form of payment on public transportation.\nCorporate Payments\nOur Corporate Payments solutions help businesses streamline the management, processing and payment of their domestic and \ninternational invoices and make point-of-sale purchases for their employees. Companies can save time, reduce costs and \nmanage business-to-business\n (B2B) \npayment processing more efficiently with our suite of Corporate Payment solutions, \nincluding accounts payable (AP) automation, virtual cards, cross-border payment products and purchasing and T&E cards. \nAP Automation\n \n– We offer AP Automation solutions with options that are purpose-built for the simplest small business to the \nmost complex large enterprise. We initiate, manage and guarantee payment of all company-approved bills to all domestic and \ninternational vendors through whichever payment modalities the vendors allow, such as virtual card, automated clearing house \n(ACH), wire or check. Our mid-market/enterprise solution meets the needs of the most complex global enterprises with \nmultiple organizational hierarchies, approval workflows, locations, bank accounts, robust on-demand reporting and seamless \nintegration with Enterprise Resource Planning (ERP) systems. We also provide rich data on the remittance to the vendor, \nregardless of payment modality, which facilitates invoice reconciliations and payment posting.  By automating the process of \npaying vendors, businesses of all sizes can reduce the time, costs and fraud risks associated with their payment processes and \nfocus on operating their businesses.  \nVirtual Card\n \n– Our Virtual Card solution provides a single-use card number for a specific amount, usable within a defined \ntimeframe. Virtual Cards provide enhanced security relative to checks while reducing total payment costs for our customers. \nFull remittance data accompanies each Virtual Card payment, providing significant reconciliation advantages to ACH and \ncheck payments. We have integrated our Virtual Card offering into most leading ERP systems, providing a seamless experience \nfor our customer's accounts payable personnel.\n  \nWe have built a proprietary merchant acceptance network that accepts our Virtual Card payments. Our merchant acceptance \nnetwork is unique due to the nature of commercial Virtual Card acceptance. Unlike standard point-of-sale purchases, each \nissuer negotiates directly with the merchant for acceptance, so other issuers’ virtual cards are not interchangeable. This network \nis managed with proprietary technology that allows us to continuously expand Virtual Card acceptance and optimize the \namount of spend we can capture. The scale of this network, coupled with an in-house vendor enrollment service, is a \ncompetitive advantage. Our ERP integrations, API capabilities, strategic vendor enrollment and transaction management tools \nenable us to optimize our customers’ electronic payables programs. \nOur Virtual Card solution operates on the Mastercard network. Our customers’ ERP systems are directly integrated with our \nissuing system, and merchants must be enrolled in our proprietary vendor network to accept our Virtual Card solution. This \ntwo-sided transaction, where both payor and receiver are in our network, provides substantial payment security relative to paper \nchecks or ACH. \n7\nTable of Contents\nCross-Border Payments\n \n– Our Cross-Border solution is used by our customers to pay international vendors, foreign office and \npersonnel expenses and for profit repatriation and dividends. We also offer hedging and risk management services to customers, \nwhich helps them manage foreign exchange rate exposures in the course of doing business internationally. This solution may be \nsold in conjunction with our AP Automation and Virtual Card solutions. \nTrade settlement and payment delivery is facilitated through a global network of correspondent banks, in-country payment \ngateways and technology providers, enabling us to send payments to recipients in over 200 countries and 145 currencies. Our \ncustomers rely on us to deliver personalized service and customer solutions. We offer a proprietary trading and payments \nplatform that we can \"white label\" for financial institutions looking to expand their cross-border payment capability, as well as \na suite of API products that enables us to embed our full capability directly within the technology of both customers and \npartners. By utilizing transaction monitoring and \"watch list\" screening systems, we ensure payments are safe, secure and meet \nall applicable regulatory requirements.\n  \nPurchasing and T&E Cards \n– We offer purchasing cards and T&E solutions to our customers. These solutions are generally \nsold in conjunction with our Virtual Card solution or AP Automation offerings. Additionally, we provide technology, which \ncombines and leverages transaction data captured from our virtual, purchasing and T&E card products, to help our customers \nanalyze and manage their corporate spending.\n \nLodging Payments\nOur Lodging Payments solutions help businesses manage and control their lodging costs, simplify the management offerings \nfrom hotels or longer term housing arrangements and provide traveler and end customer support. We serve lodging customers \nthrough three primary verticals: workforce, airlines and insurance. We offer lodging solutions to businesses primarily in North \nAmerica and the U.K. that have employees who travel overnight for work purposes, to airlines and cruise lines globally to \naccommodate both their traveling crews and stranded passengers and to policyholders displaced from their homes due to \ndamage or catastrophe on behalf of property insurance carriers. \nThe size, scale and nature of our lodging customer base enables us to negotiate lodging nightly rates lower than the rates most \ncompanies could negotiate directly and below the rates available to the general public. We utilize both proprietary and third-\nparty networks where we provide access to deeply discounted hotel rooms with streamlined travel management programs, \nproviding enhanced controls and reporting, audit and tax management services. We also can secure hotel rooms outside our \nproprietary networks in each of our solutions, or private homes in our insurance vertical. We use proprietary data management \nand payment processing systems to manage customer billings and reports, which, combined with our discounted hotel network, \nprovide customers with potential savings and increased visibility into their lodging costs.  \nWorkforce \n– \nOur workforce lodging solutions provide a comprehensive solution for business travel programs of any size and  \nbusiness profile, with the ability to scale to the needs of the customer. Our solution allows customers to find and book lodging \nonline, via app, directly with the hotel or by calling us. We provide full-service lodging management for project-based travelers \nand long-term stay programs. Our solution provides customers options, controls and insights they need to streamline their \ncorporate lodging program and optimize their investment in travel. \nAirlines \n–\nThe integration of our processing systems with airline logistics and crew management systems enables us to deliver \nincremental enhanced services to the airline travel industry. We offer end-to-end automation of the crew layover process, \nproviding cost-saving hotel and transport bookings. We also have a proactive disruption system managing flight rebookings, \nhotels, meals, compensation and transportation for distressed passengers, which delivers a notification directly to the affected \npassenger to self-service based on their individual requirements. With an all-in-one platform, airlines can access automated \nweb-based billing and continual transaction auditing that's tied to their operational data to increase billing accuracy. \n  \nInsurance \n– \nWe provide temporary housing solutions for displaced policyholders of insurance carriers and catastrophe teams, \nserving at the request and approval of the insurance adjuster, delivering a seamless housing experience. We partner with claims \nadjusters to determine the best housing solution for policyholders, including extended stay hotels and long-term housing, \nproviding policyholders a mobile app to manage their temporary housing and receipts. \nOther\nCorpay provides other payments solutions that are not considered within our Vehicle Payments, Corporate Payments or \nLodging Payments segments.\nGift \n– We provide fully integrated gift card program management and processing services to retailers in 66 countries, in both \nplastic and digital form. The gift cards are issued specifically for each customer under their specific brands and are generally \naccepted exclusively within their retail network, digitally or in-person. \nOur gift solutions include card design, production and packaging, delivery and fulfillment, card and account management, \ntransaction processing, promotion development and management, website design and hosting, program analytics and card \ndistribution channel management. Our turnkey solution benefits our customers in the form of brand promotion, cardholder \nloyalty, increased sales, interest on prepaid balances and breakage on abandoned card balances.\n8\nTable of Contents\nPayroll Card \n– We offer a payroll card solution in North America in the form of a reloadable stored value card, that can be used \ninstead of a paper payroll check. Our solution operates on the Mastercard payment network and the Allpoint ATM network. \nThe payroll cards are issued to our customers’ employees and funded by the employees’ wages. As cardholders, the employees \nmay present the payroll card as a form of payment for personal purchases, transfer funds to their bank account or withdraw \nfunds from participating ATMs. \nSales and Distribution\n \nWe actively market and sell our solutions to current and prospective customers using a multi-channel approach. This go-to-\nmarket strategy includes comprehensive digital channels, direct sales forces and strategic partner relationships. We continue to \nexpand online, end-to-end capability where the customers can buy, onboard and manage their accounts on their own. In \naddition, we leverage an omni-channel approach that enables our sales people to be more efficient by improving their \nprospecting efforts through digitally sourced leads. In our direct sales force channel, we acquire and manage the customer \nrelationship, which has historically been either in-person or via telesales. Our capabilities are also offered through indirect sales \nchannels (e.g., major oil companies and fuel marketers for fuel, retail establishments for tolls and vehicle OEMs for consumer \nEV solutions) and on a branded or “white label” basis, indirectly through a broad range of resellers and partners across most of \nour solutions. In doing so, we leverage their sales networks to expand our reach into new customer segments, new industry \nverticals and new geographies faster and at a significantly lower cost.  \nWith respect to our tolls solution, we also place proprietary manned kiosks and unmanned vending machines in areas with high \nconsumer foot traffic, such as shopping malls, to reach consumers. With respect to our gift solutions, third-party distribution is \ngenerally provided by other companies, who are reliant on access to our systems to meet their distribution obligations. With \nrespect to our parking solutions, we sign deals with municipalities, local authorities and other parking operators to offer a \ndigital parking app to drivers who need to pay for parking in their locations. Typically, signage is prominently displayed in the \nparking location to direct drivers to download our parking app to facilitate booking and payment. This same app is then used as \na tool to sell other products & services to these users.\nWe\n capitalize on our products’ specialization by deploying product-dedicated sales forces to target specific customer segments. \nAs our solution set has expanded, we are also facilitating cross-selling and bundled product offerings to fully leverage our \ndistribution capabilities, capture more spend and revenue from our existing customer base and deliver more value to customers \nwhich should improve customer loyalty and retention.\nCredit Underwriting and Collections\nWe perform a detailed application review of all new applications for credit, evaluating the applications for fraud as well as \ncredit risk. With both the fraud and credit review, we leverage third-party data sources, including device data, fraud scores and \ncredit bureau data to name a few. The credit review includes a combination of machine learning models, as well as judgmental \nunderwriting based on customer financials. We employ a variety of tools to manage risk in our portfolio, including billing \nfrequency, payment terms, spending limits, payment methods, delinquency suspension and security. Further, we use fraud \ndetection programs, including proprietary and third-party solutions, to monitor transactions and prevent misuse. We monitor the \ncredit quality of our portfolio periodically utilizing external credit scores and internal behavior data to identify high risk or \ndeteriorating credit quality accounts and control our risk through various strategies. We conduct targeted strategies to minimize \nexposure to high-risk accounts, including reducing spending limits and payment terms or requiring additional security deposits.\nCompetition\nOur primary competition is from financial institutions providing a full suite of financial products, including general purpose \ncards, AP payments (i.e. check and ACH) and cross-border solutions. We also compete with specialized competitive offerings \nfrom other companies that vary by product solution.\n•\nVehicle Payments: Our fuel solutions compete with similar offerings such as, WEX, U.S. Bank Voyager Fleet \nSystems, Edenred, Sodexo, Alelo, Radius Payment Solutions and DKV.  Our toll solutions compete with similar \nofferings such as, ConectCar, Veloe (Alelo) and Repom (Edenred). Our parking solutions compete with similar \nofferings such as ParkMobile, ParkHub, Parking BOXX and FLASH. \n•\nCorporate Payments: Our corporate payments solutions compete with similar offerings from financial institutions, \nincluding American Express, Coupa, AvidXchange, Bill.com and Convera. \n•\nLodging Payments: Our lodging solutions compete with similar offerings from traditional travel management \ncompanies such as, American Express Global Business Travel, as well as in-house travel solutions at large \ncorporations and airlines.\n•\nOther; Our gift and payroll card solutions compete with similar offerings from Fiserv, other special-purpose card \nissuers and payroll companies.\n9\nTable of Contents\nCompetitive Advantage   \nIn executing our strategy, we are advantaged by our competitive strengths:\n•\nGlobal Scale\n – We have strong market positions across four continents. This enables us to provide new offerings with \nbetter cost economics, sell complementary products, acquire attractive assets that can leverage existing infrastructure \nand cost synergies and introduce successful products and practices from other markets.\n•\nCompounding Growth Model\n – Our growth model historically benefits from strong revenue retention, organic growth \nfrom new customer acquisitions and selling more value-added products to current customers, via developed and \nacquired payment solutions.  \n•\nProprietary Networks\n – Our specialized proprietary networks allow for unique data capture at the point of sale, \nproviding an incremental value proposition to our customers. These proprietary networks also provide us with \nadvantageous economics by providing attractive, captive spend to the merchant base.\n•\nScalable Technology\n – Our easy-to-use platforms provide control and functionality for our customers, and we can on-\nboard incremental customer volume with very limited need for additional infrastructure. We own and control all the \ncritical components to our offering, creating improved speed to market and proprietary feature functionality in the \nmarketplace.\n•\nDiversification\n – Our solutions and geographic diversification are designed to provide stability through the “portfolio \neffect” when one geography or business is underperforming relative to the others. This allows Corpay to deliver more \nconsistent financial performance relative to competitors, continue to invest throughout business cycles and reallocate \nresources to higher performing businesses.   \nTechnology\nOur technology provides continuous authorization of transactions, processing of critical account and customer information and \nsettlement between merchants, issuing companies and individual commercial entities. We recognize the importance of state-of-\nthe-art, s\necure, efficient and reliable technology in our business and have made significant investments in our applications and \ninfrastructure. In \n2024\n, we spent approximately $380 million in capital and operating expenses to operate, protect and enhance \nour technology.  \nWe operate several proprietary processing systems that provide features and functionality to run our card programs and \nsolutions, including our card issuing, processing and information services. Our processing systems also integrate with our \nproprietary networks, which provide brand awareness and connectivity to our acceptance locations that enables the “end-to-\nend” card acceptance, da\nta capture and transaction authorization capabilities of our card programs. Our proprietary processing \nsystems and aggregation software are tailored to meet the unique needs of the individual markets they serve and enable us to \ncreate and deliver solutions that serve each of our industry verticals and geographies. Our technology platforms are comprised \nof four key components, which were primarily developed and are maintained in-house: (1) a core processing platform; (2) \nspecialized software; (3) integrated network capabilities; and (4) a cloud-based architecture with proprietary APIs.\nOur technology function is based in the U.S., Europe and Brazil and has expertise in the management of applications, \ntransaction networks and infrastructure. We operate application development centers in the U.S., U.K., Netherlands, Czech \nRepublic, Brazil and New Zealand. Our distributed application architecture allows us to maintain, administer and innovate our \nsolutions in a cost-effective and flexible manner. Our solutions contain significant intellectual property that differentiates us \nfrom our competition.\nW\ne continually seek to modernize and evolve our technology solutions through our core information technology (IT) \ntransformation initiatives. Our IT transformation initiatives are focused on three main pillars: (1) digital strategy; (2) core \nsystems modernization; and (3) data. Our digital strategy is focused on streamlining a digital customer experience across all of \nour solutions, providing a seamless experience. Additionally, we are investing in modernizing our core transactional systems to \nmake them more resilient, secure and scalable. Our technology infrastructure is supported by highly-secure data centers, with \nredundant locations. We operate our primary data centers, located in Atlanta, Georgia; Studley, United Kingdom; Prague, \nCzech Republic; Las Vegas, Nevada; Lexington and Louisville, Kentucky; São Paulo, Brazil; and Toronto, Canada. \nAdditionally, as we develop new solutions and modernize legacy assets, we increasingly use  cloud services. Through the use of \ncloud technology and microservices, we are able to modernize our platforms with no disruption to our customers. Finally, data \nis becoming an ever-increasing part of how we and our customers do business. We are focused on investing in our data assets to \ndeliver value for our customers through improved insights to help them to better control expenses and mitigate fraud. The use \nof cloud services provides us with increased flexibility and agility. We use only proven technology and expect no foreseeable \ncapacity limitations. \nWe maintain disaster recovery and business continuity plans. Our telecommunications and internet systems have multiple levels \nof redundancy to ensure the reliability of network\n service. In \n2024\n, we achieved over 99.9% up-time for authorizations globally.\n10\nTable of Contents\nSafeguarding Our Business \nTo provide our services, we may collect, use and store sensitive business information and personal information. Some of this \ninformation is also processed and stored by financial institutions, merchants and other entities, as well as third-party service \nproviders to whom we outsource certain functions and other agents, which we refer to collectively as, our associated third \nparties. We may have responsibility to the card networks, financial institutions and in some instances, our customers, and/or \nindividuals, for our failure or the failure of our associated third parties (as applicable) to protect this information. \nOur systems align with industry standards for security, with multiple industry certifications. Our network is configured with \nmultiple layers of security to isolate our core systems from unauthorized access. We use secure communication among \napplications, and our employees access critical components strictly on a \"need-to-know\" basis. We may not be able to \nadequately protect our systems or the data we collect from continually evolving cybersecurity risks or other technological risks, \nwhich could subject us to liability and damage our reputation. See also, \"Risks related to information technology and security\" \nunder"
}