{
  "ticker": "CPB",
  "cik": "0000016732",
  "company_name": "CAMPBELL'S Co",
  "filing_date": "2025-09-18",
  "accession": "0000016732-25-000112",
  "primary_doc": "cpb-20250803.htm",
  "item1_text": "Item 1A - Business and Operational Risks - Changes in global trade policies, including imposed and threatened tariffs by the U.S. and reciprocal tariffs by its trading partners, remain uncertain and could impact our financial condition or results of operations.\nWe also regularly move data across national and state borders to conduct our operations and, consequently, are subject to a variety of laws and regulations in the U.S. and other jurisdictions regarding privacy, data protection and data security, including those related to the collection, storage, handling, use, disclosure, transfer and security of personal data. There is significant uncertainty with respect to compliance with such privacy and data protection laws and regulations because they are continuously evolving and developing and may be interpreted and applied differently from country to country and state to state and may create inconsistent or conflicting requirements.\nChanges in legal or regulatory requirements (such as but not limited to new food safety requirements and revised regulatory requirements for the labeling of nutrition facts, serving sizes and genetically modified ingredients or new EPR regulations and laws), evolving interpretations of existing legal or regulatory requirements, or an increased focus regarding environmental policies relating to climate change, climate reporting, regulating greenhouse gas emissions, energy policies and sustainability, may result in increased compliance cost, capital expenditures and other financial obligations that could adversely affect our business and financial results. \nWe may suffer losses if changes to regulations require us to change the ingredients we use or how we process, package, transport, store, distribute, advertise, or label our products. Moreover, depending on the implementation of such regulatory changes, we could have increased risk for a product recall or have existing inventory become unsellable, which could materially and adversely impact our product sales, financial condition and operating res\nults.\nIf our food products become adulterated or are mislabeled, we might need to recall those items, and we may experience product liability claims and damage to our reputation.\nWe have in the past and we may, in the future, need to recall some of our products if they become adulterated or if they are mislabeled, and we may also be liable if the consumption of any of our products causes sickness or injury to consumers. A widespread product recall could result in significant losses due to the costs of a recall, the destruction of product inventory, and lost sales due to the unavailability of product for a period of time. We could also suffer losses from a significant adverse product liability judgment. A significant product recall or product liability claim could also result in adverse publicity, damage to our reputation, and a loss of consumer confidence in the safety and/or quality of our products, ingredients or packaging. In addition, if another company recalls or experiences negative publicity related to a product in a category in which we compete, consumers might reduce their overall consumption of products in that category.\nClimate change, or legal, regulatory or market measures to address climate change, may negatively affect our business and operations.\nThere is growing concern that carbon dioxide and other greenhouse gases in the atmosphere may have an adverse impact on global temperatures, weather patterns, and the frequency and severity of extreme weather and natural disasters. In the event that such climate change has a negative effect on agricultural productivity, we may be subject to decreased availability or less favorable pricing for certain commodities that are necessary for our products, such as wheat, tomatoes, potatoes, cocoa and olive oil. Adverse weather conditions and natural disasters can reduce crop size and crop quality, which in turn could reduce our supplies of raw materials, lower recoveries of usable raw materials, increase the prices of our raw materials, increase our cost of storing and transporting our raw materials, or disrupt production schedules. We may also be subjected to decreased availability or less favorable pricing for water as a result of such change, which could impact our manufacturing and distribution operations. In addition, natural disasters and extreme weather conditions may disrupt the productivity of our facilities or the operation of our supply chain. \n13 \nThere is an increased focus by regulatory and legislative bodies regarding environmental policies relating to climate change, climate reporting, regulating greenhouse gas emissions (including carbon pricing regulations, cap and trade systems or a carbon tax), energy policies and sustainability. Increased compliance costs and expenses due to the impacts of climate change and additional legal or regulatory requirements regarding climate change that are designed to reduce or mitigate the effects of carbon dioxide and other greenhouse gas emissions on the environment may cause disruptions in, or an increase in the costs associated with, the running of our manufacturing facilities and our business, as well as increase distribution and supply chain costs. Moreover, compliance with any such legal or regulatory requirements may require us to make significant changes in our business operations and strategy, which will likely require us to devote substantial time and attention to these matters and cause us to incur additional costs. Even if we make changes to align ourselves with such legal or regulatory requirements, we may still be subject to significant penalties or potential litigation if such laws and regulations are interpreted and applied in a manner inconsistent with our practices. The physical effects and transitional costs of climate change and legal, regulatory or market initiatives to address climate change could have a long-term adverse impact on our business, financial condition and results of operations. \nOur business is subject to an increasing focus on sustainability matters.\nFrom time to time we establish and publicly announce sustainability goals and commitments, including reducing our impact on the environment and relating to animal welfare. For example, we established science-based targets for Scope 1, 2 and 3 greenhouse gas emissions. Our ability to achieve any stated goal, target or objective is subject to numerous factors and conditions, many of which are outside of our control. Examples of such factors include evolving regulatory requirements affecting sustainability standards or disclosures or imposing different requirements, the pace of changes in technology and its market availability, the availability of requisite financing, the availability of suppliers and products that can meet our sustainability and other standards, and changing business dynamics including acquisitions. \nFurthermore, standards for tracking and reporting such matters continue to evolve. Our selection of voluntary disclosure frameworks and standards, and the interpretation or application of those frameworks and standards, may change from time to time or differ from those of others. Methodologies for reporting these data may be updated and previously reported data may be adjusted to reflect improvement in availability and quality of third-party data, changing assumptions, changes in the nature and scope of our operations (including from acquisitions and divestitures), and other changes in circumstances, which could result in significant revisions to our current goals, reported progress in achieving such goals, or ability to achieve such goals in the future.\n If we fail to achieve, or are perceived to have failed to achieve or have been delayed in achieving, or improperly report our progress toward achieving these goals and commitments, it could negatively affect consumer or customer preference for our products or investor confidence in our stock, as well as expose us to enforcement actions and litigation.\nAdditionally, we might fail to effectively address increased attention from the media, stockholders, activists and other stakeholders on climate change and other environmental sustainability matters or animal welfare goals, including attention from stakeholders with opposing views on such matters. Such failure, or the perception that we have failed to act responsibly regarding climate change or animal welfare, whether or not valid, could result in adverse publicity and negatively affect our business and reputation.\nOur business, financial condition and results of operations could be adversely affected by disruptions in the global economy caused by ongoing geopolitical conflicts.\nThe global economy has been negatively impacted by ongoing geopolitical conflicts, including the military conflicts between Russia and Ukraine, the conflicts in the Middle East, as well as tensions between China and Taiwan. For instance, governments in the U.S., United Kingdom and European Union have each imposed export controls on certain products and financial and economic sanctions on certain industry sectors and parties in Russia. Although we have no operations in Russia, Ukraine, the Middle East, China or Taiwan, we have experienced shortages in materials and increased costs for transportation, energy and raw material due in part to the negative impact of these ongoing geopolitical conflicts on the global economy. The scope and duration of such conflicts are uncertain, rapidly changing and hard to predict. Further escalation of these geopolitical conflicts, including increased trade barriers or restrictions on global trade, could result in, among other things, cyberattacks, supply disruptions, lower consumer demand, and changes to foreign exchange rates and financial markets, any of which may adversely affect our business and supply chain. In addition, the effects of the ongoing conflicts could also heighten many of the other risk factors discussed in this"
}