{
  "ticker": "CSCO",
  "cik": "0000858877",
  "company_name": "CISCO SYSTEMS, INC.",
  "filing_date": "2025-09-03",
  "accession": "0000858877-25-000111",
  "primary_doc": "csco-20250726.htm",
  "item1_text": "Item 1. Business” of this report.\nSome of our competitors compete across many of our product lines, while others are primarily focused in a specific product area. Barriers to entry are relatively low, and new ventures to create products that do or could compete with our products are regularly formed. In addition, some of our competitors may have greater resources, including technical and engineering resources, than we do. As we expand into new markets, we will face competition not only from our existing competitors but also from other competitors, including existing companies with strong technological, marketing, and sales positions in those markets. We also sometimes face competition from resellers and distributors of our products. Companies with which we have strategic alliances in some areas may be competitors in other areas, and this trend may increase. For example, the enterprise data center is undergoing a fundamental transformation arising from the convergence of technologies, including computing, networking, storage, and software, that previously were segregated. Due to several factors, including the availability of highly scalable and general purpose microprocessors, application specific integrated circuits offering advanced services, standards based protocols, cloud computing and virtualization, the convergence of technologies within the enterprise data center is spanning multiple, previously independent, technology segments. Also, some of our current and potential competitors for enterprise data center business have made acquisitions, or announced new strategic alliances, designed to position them to provide end-to-end technology solutions for the enterprise data center. As a result of all of these developments, we face greater \n15\nTable of Contents\ncompetition in the development and sale of enterprise data center technologies, including competition from entities that are among our long-term strategic alliance partners. Companies that are strategic alliance partners in some areas of our business may acquire or form alliances with our competitors, thereby reducing their business with us.\nWe also face competition from customers to which we license or supply technology and suppliers from which we transfer technology. The inherent nature of networking requires interoperability. As such, we must cooperate and at the same time compete with many companies. Any inability to effectively manage these complicated relationships with customers, suppliers, and strategic alliance partners could materially harm our business, operating results, and financial condition and accordingly affect our chances of success. \nInventory management relating to our sales to our two-tier distribution channel is complex, and excess inventory may harm our gross margins.\nWe must manage inventory relating to sales to our distributors effectively, because inventory held by them could affect our results of operations. Our distributors may increase orders during periods of product shortages, cancel orders if their inventory is too high, or delay orders in anticipation of new products. They also may adjust their orders in response to the supply of our products and the products of our competitors that are available to them, and in response to seasonal fluctuations in end-user demand. Our distributors are generally given business terms that allow them to return a portion of inventory, receive credits for changes in selling price, and participate in various cooperative marketing programs. Inventory management remains an area of focus as we balance the need to maintain strategic inventory levels to ensure competitive lead times against the risk of inventory obsolescence because of rapidly changing technology and customer requirements. When facing component supply-related challenges, we have in the past and may in the future increase our efforts in procuring components or enter additional purchase commitments with contract manufacturers and suppliers in order to meet customer expectations. If we ultimately determine that we have excess inventory, we may have to reduce our prices and write down inventory, which in turn could result in lower gross margins.\nIssues related to the development and use of artificial intelligence (AI) could give rise to legal and/or regulatory action, damage our reputation or otherwise materially harm our business.\nWe currently incorporate AI technology in certain of our commercial offerings and in our business operations. Our research and development of AI technology remains ongoing. AI presents risks and challenges and may result in unintended consequences, including inadvertent disclosure or misuse of intellectual property, confidential, personal, and/or competitive information, that could affect our reputation, our further AI development or our and our customers’ adoption and use of this technology. AI algorithms and training methodologies may be flawed. Additionally, AI technologies are complex and rapidly evolving, and we face significant competition in the market and from other companies regarding such technologies. Leveraging AI capabilities to potentially improve our internal functions and operations also presents risks, costs, and challenges. While we aim to develop and use AI responsibly and attempt to identify and mitigate ethical and legal issues and risks presented by its use, we may be unsuccessful in identifying or resolving issues and risks before they arise. The AI-related legal and regulatory landscape is constantly evolving and therefore remains uncertain and may be inconsistent from jurisdiction to jurisdiction. Our obligations to comply with the evolving legal and regulatory landscape could entail significant costs or limit our ability to incorporate certain AI capabilities into our offerings. AI-related issues, deficiencies and/or failures could also give rise to legal and/or regulatory action (including with respect to proposed legislation regulating AI in jurisdictions such as the European Union and others, and as a result of new and different applications of existing and new data protection, privacy, intellectual property, and other laws); damage our reputation; or otherwise materially harm our business.\nOur financial performance may be negatively impacted by demand for, and costs to deliver, our software subscription offerings; and interruptions or performance problems associated with these offerings, including interruptions or performance problems caused by third-party providers on which we rely, may negatively impact our business and financial results. \nIn recent years, we have shifted our business model to deliver more recurring software and subscription offerings. This shift in our business model was accelerated by recent acquisitions, including our acquisition of Splunk in the third quarter of fiscal 2024. Mark\net acceptance of our software subscription offerings, which includes our as-a-service solutions, can be affected by a variety of factors, including: security, reliability, performance, terms of service, support terms, customer preference, community engagement, concerns regarding data privacy or data protection, and the enactment of laws or regulations in jurisdictions in which we operate. To generate sales growth for our software subscription offerings, we need to convince potential customers to purchase new licenses or subscriptions and generate timely renewals and additional purchases from existing customers. Any failure to do so could result in decreased revenue, reduced sales, increased churn or otherwise negatively impact our results of operations and financial condition. Further, growth of our software subscription offerings depends, in part, on the ability of customers to use and access these solutions. We have experienced, and may in the future experience, interruptions in service, storage failures, and other performance-related problems due to a variety of factors, such as infrastructure and software \n16\nTable of Contents\nchanges, human or software errors, capacity constraints, unauthorized access, denial of service or other cyber attacks. In some instances, we may not be able to timely identify the cause or causes of these performance problems and, even if timely identified, we may be unable to timely remediate the underlying cause. It may become increasingly difficult to maintain and improve our performance for our software subscription offerings, especially during peak usage times and as our solutions become more complex and our user traffic increases. Performance-related issues of our software subscription offerings may result in increased operational costs, delays in new feature rollouts, customer loss, reputational damage, and legal or regulatory liability, including liability under customer contracts or for losses suffered by our customers.\nTo deliver our software subscription offerings, we have incurred and will continue to incur substantial costs to implement and maintain this business. We make significant investments to increase or maintain capacity and to develop and implement new technologies in our infrastructure and operations, including those provided by third-party providers on which we rely. We may not be successful in developing or implementing these technologies. To the extent that we do not effectively scale our operations to meet the needs of our customers and to maintain performance as our customers expand their use of our solutions, we may not be able to grow this business as quickly as we anticipate, our customers may reduce or cancel use of our solutions, and we may be unable to compete as effectively and our business and results of operations may be harmed. Additionally, if our costs associated with our software subscription offerings were to significantly increase, our business, results of operations and financial condition may be negatively impacted. We are also subject to the risk of performance-related problems or interruption of the services provided by third-party providers on which we rely, which could cause revenues for software subscription offerings to decline, damage to our reputation, legal liability exposure, and/or increased expenses, all of which could negatively impact our business, results of operations, and financial condition.\nWe depend upon the development of new products and services, and enhancements to existing products and services, and if we fail to predict and respond to emerging technological trends and customers’ changing needs, our operating results and market share may suffer.\nThe markets for our products and services are characterized by rapidly changing technology, evolving industry standards, new product and service introductions, and evolving methods of building and operating networks. Our operating results depend on our ability to develop and introduce new products and services into existing and emerging markets and to reduce the production costs of existing products. If customers do not purchase and/or renew our offerings our business could be harmed.\nThe process of developing new technology, including more programmable, flexible and virtual networks, and technology related to other market transitions— such as AI, security, observability, and cloud— is complex and uncertain, and if we fail to accurately predict customers’ changing needs and emerging technological trends our business could be harmed. We must commit significant resources, including the investments we have been making in our strategic priorities to developing new products and services before knowing whether our investments will result in products and services the market will accept. In particular, if our model of the evolution of networking, security, or observability does not emerge as we believe it will, or these industries do not evolve as we believe they will, or if our strategy for addressing this evolution is not successful, many of our strategic initiatives and investments may be of no or limited value. For example, if we do not timely introduce products related to these markets, or if such products or offerings that ultimately succeed in these markets are based on technology, or an approach to technology, that differs from ours, our business could be harmed. In addition, our business could be negatively impacted in periods surrounding our new product introductions if customers delay purchasing decisions to qualify or otherwise evaluate the new product offerings. We have also been seeking to meet the evolving needs of customers which include offering our products and solutions in the manner in which customers wish to consume them. As a part of these efforts, we continue to make changes to how we are organized and how we build and deliver our technology, including changes in our business models with customers. If our strategy for addressing our customer needs, or the architectures and solutions we develop do not meet those needs, or the changes we are making in how we are organized and how we build and deliver or technology is incorrect or ineffective, our business could be harmed.\nFurthermore, we may not execute successfully on our vision or strategy because of challenges with regard to product planning and timing, technical hurdles that we fail to overcome in a timely fashion, or a lack of appropriate resources. This could result in competitors, some of which may also be our strategic alliance partners, providing those solutions before we do and loss of market share, revenue, and earnings. In addition, the growth in demand for technology delivered as a service enables new competitors to enter the market. The success of new products and services depends on several factors, including proper new product and service definition, component costs, timely completion and introduction of these products and services, differentiation of new products and services from those of our competitors, and market acceptance of these products and services. There can be no assurance that we will successfully identify new product and services opportunities, develop and bring new products and services to market in a timely manner, or achieve market acceptance of our products and services or that products, services and technologies developed by others will not render our products, services or technologies obsolete or noncompetitive. The products and technologies in our other product categories and key priority areas may not prove to have the market success we anticipate, and we may not successfully identify and invest in other emerging or new products and services.\n17\nTable of Contents\nChanges in industry structure and market conditions could lead to charges related to discontinuances of certain of our products or businesses, asset impairments and workforce reductions or restructurings.\nIn response to changes in industry and market conditions, we may be required to strategically realign our resources and to consider restructuring, disposing of, or otherwise exiting businesses. Any resource realignment, or decision to limit investment in or dispose of or otherwise exit businesses, may result in the recording of special charges, such as inventory and technology-related write-offs, workforce reduction or restructuring costs, charges relating to consolidation of excess facilities, or claims from third parties who were resellers or users of discontinued products. Our estimates with respect to the useful life or ultimate recoverability of our carrying basis of assets, including purchased intangible assets, could change as a result of such assessments and decisions. Although in certain instances our supply agreements allow us the option to cancel, reschedule, and adjust our requirements based on our business needs prior to firm orders being placed, our loss contingencies may include liabilities for contracts that we cannot cancel with contract manufacturers and suppliers. Further, our estimates relating to the liabilities for excess facilities are affected by changes in real estate market conditions. Additionally, we are required to perform goodwill impairment tests on an annual basis and between annual tests in certain circumstances, and future goodwill impairment tests may result in a charge to earnings. From time to time we initiate restructuring plans. Our business may not be more efficient or effective than prior to implementation of such plans. Our restructuring activities, including any related charges and the impact of the related headcount restructurings, could materially harm our business, operating results, and financial condition.\nOver the long term we intend to invest in engineering, sales, service and marketing activities, and in key priority areas, and these investments may achieve delayed, or lower than expected, benefits which could harm our operating results.\nWhile we intend to focus on managing our costs and expenses, over the long term, we also intend to invest in personnel and other resources related to our engineering, sales, service and marketing functions as we realign and dedicate resources on key priority areas, such as AI, cloud, and cybersecurity. We also intend to focus on maintaining leadership in core networking and services. We are likely to recognize the costs associated with these investments earlier than some of the anticipated benefits, and the return on these investments may be lower, or may develop more slowly, than we expect. If we do not achieve the benefits anticipated from these investments (including if our selection of areas for investment does not play out as we expect), or if the achievement of these benefits is delayed, our operating results may be negatively impacted.\nWe have made and expect to continue to make acquisitions that could disrupt our operations and harm our operating results.\nOur growth depends upon market growth, our ability to enhance our existing products, and our ability to introduce new products on a timely basis. We intend to continue to address the need to develop new products and enhance existing products through acquisitions of other companies, product lines, technologies, and personnel. Acquisitions involve numerous risks, including the following:\n•\nDifficulties or delays in integrating the operations (including IT security), systems, technologies, products, and personnel of the acquired companies, particularly with companies that have large and widespread operations and/or complex products (such as Splunk)\n•\nDiversion of management’s attention from normal daily operations of the business and the challenges of managing larger and more widespread operations resulting from acquisitions\n•\nPotential difficulties in completing projects associated with in-process research and development intangibles\n•\nDifficulties in entering markets in which we have no or limited direct prior experience and where competitors in such markets have stronger market positions\n•\nInitial dependence on unfamiliar supply chains or relatively small supply partners\n•\nInsufficient revenue to offset increased expenses associated with acquisitions\n•\nThe potential loss of key employees, customers, distributors, vendors and other business partners of the companies we acquire following and continuing after announcement of acquisition plans\nAcquisitions have in the past and may in the future also cause us to:\n•\nIssue common stock that would dilute our current stockholders’ percentage ownership\n•\nUse a substantial portion of our cash resources, or incur debt\n•\nSignificantly increase our interest expense, leverage and debt service requirements if we incur additional debt to pay for an acquisition\n•\nAssume liabilities\n18\nTable of Contents\n•\nRecord goodwill and intangible assets that are subject to impairment testing on a regular basis and potential periodic impairment charges\n•\nIncur amortization expenses related to certain intangible assets\n•\nIncur tax expenses related to the effect of acquisitions on our legal structure\n•\nIncur large write-offs and restructuring and other related expenses\n•\nBecome subject to intellectual property or other litigation\nMergers and acquisitions of high-technology companies are inherently risky and subject to many factors outside of our control, and no assurance can be given that our previous or future acquisitions will be successful and will not materially harm our business, operating results, or financial condition. Failure to manage and successfully integrate acquisitions could materially harm our business and operating results. Prior acquisitions have resulted in a wide range of outcomes, from successful introduction of new products and technologies to a failure to do so. Even when an acquired company has already developed and marketed products, there can be no assurance that product enhancements will be made in a timely fashion or that pre-acquisition due diligence will have identified all possible issues that might arise with respect to such products. In addition, our effective tax rate for future periods is uncertain and could be impacted by mergers and acquisitions. Risks described with respect to new product development also apply to acquisitions.\nEntrance into new or developing markets exposes us to additional competition and will likely increase demands on our service and support operations.\nAs we focus on new market opportunities and key priority areas, such as AI, cloud, and cybersecurity, we compete with companies of all sizes. Several of our competitors may have greater resources, including technical and engineering resources, than we do. Additionally, as customers complete infrastructure deployments, they may require greater levels of service, support, and financing than we have provided in the past, especially in emerging countries. Demand for these types of service, support, or financing contracts may increase in the future. There can be no assurance that we can provide products, service, support, and financing to effectively compete for these market opportunities. Further, entry into other markets has subjected and will subject us to additional risks, particularly to those markets, including the effects of general market conditions and reduced consumer confidence. For example, as we add direct selling capabilities globally to meet changing customer demands, we will face increased legal and regulatory requirements.\nIf we do not successfully manage our strategic alliances, we may not realize the expected benefits from such alliances, and we may experience increased competition or delays in product development.\nWe have several strategic alliances with large and complex organizations and other companies with which we work to offer complementary products and services. These arrangements are generally limited to specific projects, the goal of which is generally to facilitate product compatibility and adoption of industry standards. There can be no assurance we will realize the expected benefits from these strategic alliances or from joint ventures. If successful, these relationships may be mutually beneficial and result in industry growth. However, alliances carry an element of risk because, in most cases, we must compete in some business areas with a company with which we have a strategic alliance and, at the same time, cooperate with that company in other business areas. Also, if these companies fail to perform or if these relationships fail to materialize as expected, we could suffer delays in product development or other operational difficulties. Joint ventures can be difficult to manage, given the potentially different interests of joint venture partners.\nProduct quality problems could lead to reduced revenue, gross margins, and net income.\nWe produce highly complex products that incorporate leading-edge technology, including both hardware and software. Software typically contains bugs or other quality or reliability problems that can unexpectedly interfere with its intended operations or the intended operation of the systems in which our software is installed. There can be no assurance that our pre-shipment or pre-release testing programs will be adequate to detect all defects, either ones in individual products or ones that could affect numerous shipments, which might interfere with customer satisfaction, reduce sales opportunities, or affect gross margins. From time to time, we have had to replace certain components and provide remediation in response to the discovery of defects or bugs in products that we had shipped. There can be no assurance that such remediation, depending on the product involved, would not have a material impact. An inability to cure a product defect or bug could result in the failure of a product line, temporary or permanent withdrawal from a product or market, damage to our reputation, inventory costs, product reengineering expenses or legal liability, any of which could materially harm our revenue, margins, and net income.\nDue to the global nature of our operations, political or economic changes or other factors in a specific country or region could harm our operating results and financial condition.\nWe conduct significant sales and customer support operations in countries around the world. As such, our growth depends in part on our increasing sales into emerging countries. We also depend on non-U.S. operations of our contract manufacturers, \n19\nTable of Contents\ncomponent suppliers and distribution partners. Our business in emerging countries in the aggregate experienced a decline in orders in certain prior periods. We continue to assess the sustainability of any improvements in our business in these countries and there can be no assurance that our investments in these countries will be successful. Our future results could be negatively impacted by a variety of political, economic or other factors relating to our operations inside and outside the United States, any or all of which could materially harm our operating results and financial condition, including the following: impacts from global central bank monetary policy; issues related to the political relationship between the United States and other countries that can affect regulatory matters, affect the willingness of customers in those countries to purchase products from companies headquartered in the United States or affect our ability to procure components if a government body were to deny us access to those components; government-related disruptions or shutdowns; the challenging and inconsistent global macroeconomic environment; foreign currency exchange rates; geopolitical tensions (including China-Taiwan relations); political or social unrest; economic instability or weakness or natural disasters in a specific country or region, including economic challenges in China and global economic ramifications of Chinese economic difficulties; environmental protection regulations (including new laws and regulations related to climate change); trade protection measures, such as tariffs; other legal and regulatory requirements, some of which may affect our ability to import our products to, export our products from, or sell our products in various countries or affect our ability to procure components; political considerations that affect service provider and government spending patterns; health or similar issues, including pandemics or epidemics; difficulties in staffing and managing international operations; and adverse tax consequences, including imposition of withholding or other taxes on our global operations.\nWe are exposed to the credit risk of some of our customers and to credit exposures in weakened markets, which could result in material losses.\nMost of our sales are on an open credit basis, with typical payment terms of 30 days in the United States, and, because of local customs or conditions, longer in some markets outside the United States. Beyond our open credit arrangements, we have also experienced demands for customer financing and facilitation of leasing arrangements. Our loan financing arrangements may include not only financing the acquisition of our products and services but also providing additional funds for other costs associated with network installation and integration of our products and services. Our exposure to the credit risks relating to our financing activities may increase if our customers are negatively impacted by a global economic downturn or periods of economic uncertainty. There can be no assurance that programs we have in place to monitor and mitigate credit risks will be effective. In the past, there have been significant bankruptcies among customers both on open credit and with loan or lease financing arrangements, particularly among Internet businesses and service providers, causing us to incur economic or financial losses. There can be no assurance that additional losses will not be incurred. Although these losses have not been material to date, future losses, if incurred, could materially harm our business, operating results, or financial condition. Additionally, to the degree that turmoil in the credit markets makes it more difficult for some customers to obtain financing, those customers’ ability to pay could be adversely impacted, which in turn could materially harm our business, operating results, and financial condition.\nWe are exposed to fluctuations in the market values of our portfolio investments and in interest rates; impairment of our investments could harm our earnings.\nWe maintain an investment portfolio of various holdings, types, and maturities. Our portfolio includes available-for-sale debt investments and equity investments, the values of which are subject to market price volatility. If such investments suffer market price declines, as we experienced with some of our investments in the past, we may recognize in earnings the decline in the fair value of our investments below their cost basis. Our privately held investments are subject to risk of loss of investment capital. These investments are inherently risky because the markets for the technologies or products they have under development are typically in the early stages and may never materialize. We could lose our entire investment in these companies. For information regarding the market risks associated with the fair value of portfolio investments and interest rates, refer to the section titled “Quantitative and Qualitative Disclosures About Market Risk.”\nWe are exposed to fluctuations in currency exchange rates that could negatively impact our financial results and cash flows.\nBecause a significant portion of our business is conducted outside the United States, we face exposure to adverse movements in foreign currency exchange rates, including emerging market currencies which can have extreme currency volatility. An increase in the value of the dollar could increase the real cost to our customers of our products in those markets outside the United States where we sell in dollars and a weakened dollar could increase the cost of local operating expenses and procurement of raw materials to the extent that we must purchase components in foreign currencies. These exposures may change over time as business practices evolve, and they could materially harm our financial results and cash flows.\nFailure to retain and recruit key personnel would harm our ability to meet key objectives.\nOur success has always depended in large part on our ability to attract and retain highly skilled technical, managerial, sales, and marketing personnel. Competition for such personnel is intense, especially in the Silicon Valley area of Northern California and \n20\nTable of Contents\nother major United States locations. Stock incentive plans are designed to reward employees for their long-term contributions and provide incentives for them to remain with us. Volatility or lack of positive performance in our stock price or equity incentive awards, or changes to our overall compensation program, including our stock incentive program, resulting from the management of share dilution and share-based compensation expense or otherwise, may also negatively impact our ability to retain key employees. As a result of one or more of these factors, we may increase our hiring in geographic areas outside the United States, which could subject us to additional geopolitical and exchange rate risk. The loss of services of any of our key personnel; the inability to retain and attract qualified personnel in the future; or delays in hiring required personnel, particularly in engineering and sales fields, could make it difficult to meet key objectives, such as timely and effective product introductions. In addition, companies in our industry whose employees accept positions with competitors frequently claim that competitors have engaged in improper hiring practices. We have received these claims in the past and may receive additional claims in the future.\nAdverse resolution of claims, litigation or governmental investigations may harm our operating results or financial condition.\nWe are a party to a variety of claims, litigation and governmental investigations in the normal course of our business. Claims, litigation and governmental investigations may arise from a wide variety of business practices and initiatives, including major new product releases, significant business transactions, warranty or product claims, employment practices, and regulation. Any claim, litigation or governmental investigation can be costly, lengthy, and disruptive to normal business operations. For example, on August 26, 2025, we settled a legal dispute with a supplier relating to purchase obligations arising under long-term supply arrangements, which resulted in a charge to product cost of sales, which is described in Note 21 to the Consolidated Financial Statements. Moreover, the results of complex legal proceedings are difficult to predict, and management's view of these matters may change in the future. An unfavorable resolution of claims, litigation or governmental investigations could materially harm our business, operating results, or financial condition. For additional information regarding certain of the matters in which we are involved, see Note 14 to the Consolidated Financial Statements, subsection (f) “Legal Proceedings.”\nOur operating results may be negatively impacted and damage to our reputation may occur due to the production and sale of counterfeit versions of our products.\nAs is the case with leading products around the world, our products are subject to efforts by third parties to produce counterfeit versions of our products. While we work diligently with law enforcement authorities in various countries to block the manufacture of counterfeit goods and to interdict their sale, and to detect counterfeit products in customer networks, and have succeeded in prosecuting counterfeiters and their distributors, resulting in fines, imprisonment and restitution to us, there can be no guarantee that such efforts will succeed. While counterfeiters often aim their sales at customers who might not have otherwise purchased our products due to lack of verifiability of origin and service, such counterfeit sales, to the extent they replace otherwise legitimate sales, could negatively impact our operating results.\nChanges in our provision for income taxes or adverse outcomes resulting from examination of our income tax returns could negatively impact our results.\nOur provision for income taxes is subject to volatility and could be negatively impacted by earnings being lower than anticipated in countries that have lower tax rates and higher than anticipated in countries that have higher tax rates; by changes in the valuation of our deferred tax assets and liabilities; by changes to foreign-derived intangible income, global intangible low-tax income and base erosion and anti-abuse tax, research and development capitalization and amortization, and corporate alternative minimum tax laws, regulations, or interpretations thereof; by expiration of or lapses in tax incentives; by transfer pricing adjustments, including the effect of acquisitions on our legal structure; by tax effects of nondeductible compensation; by tax costs related to intercompany realignments; by changes in accounting principles; or by changes in tax laws and regulations, treaties, or interpretations thereof, including changes to the taxation of earnings of our foreign subsidiaries, the deductibility of expenses attributable to foreign income, and the foreign tax credit rules. Significant judgment is required to determine the recognition and measurement attribute prescribed in the accounting guidance for uncertainty in income taxes. The Organisation for Economic Co-operation and Development (OECD), an international association comprised of 38 countries, including the United States, has made changes, including a Pillar Two framework that imposes a minimum tax rate of 15% in each taxing jurisdiction, and is contemplating additional changes to numerous long-standing tax principles. There can be no assurance that these changes and any contemplated changes if finalized, once adopted by countries, will not have an adverse impact on our provision for income taxes. Further, as a result of certain of our ongoing employment and capital investment actions and commitments, our income in certain countries was subject to reduced tax rates. Our failure to meet these commitments could adversely impact our provision for income taxes. In addition, we are subject to the continuous examination of our income tax returns by the Internal Revenue Service and other tax authorities. We regularly assess the likelihood of adverse outcomes resulting from these examinations to determine the adequacy of our provision for income taxes. There can be no assurance that the outcomes from these continuous examinations will not have an adverse effect on our operating results and financial condition.\n21\nTable of Contents\nOur business and operations are especially subject to the risks of earthquakes, floods, and other natural catastrophic events (including as a result of global climate change).\nOur corporate headquarters, including certain of our research and development operations are located in the Silicon Valley area of Northern California, a region known for seismic activity. Additionally, a certain number of our facilities are located near rivers that have experienced flooding in the past. Also certain of our customers, suppliers and logistics centers are located in regions that have been or may be affected by earthquake, tsunami and flooding or other weather-related activity which in the past has disrupted, and in the future could disrupt, the flow of supply chain components and delivery of products. In addition, global climate change may result in significant natural disasters occurring more frequently and/or with greater intensity, such as drought, wildfires, storms, sea-level rise, changing precipitation, and flooding. We have not to date experienced a material event as a result of these kinds of natural disasters; however, the occurrence of any such event in the future could materially harm our business, operating results, and financial condition.\nTerrorism, war, and other events may harm our business, operating results and financial condition.\nThe continued threat of terrorism and heightened security and military action in response thereto, or any other current or future acts of terrorism, war (such as the on-going Russia-Ukraine war and Middle East conflicts and wars), and other events (such as economic sanctions, trade restrictions and reactions of the governments, markets and the general public, including the sanctions and restrictions related to the on-going Russia-Ukraine war) may cause further disruptions to the economies of the United States and other countries and create further uncertainties or could otherwise negatively impact our business, operating results, and financial condition. Likewise, events such as loss of infrastructure and utilities services such as energy, transportation, or telecommunications could have similar negative impacts. To the extent that such disruptions or uncertainties result in delays or cancellations of customer orders or the manufacture or shipment of our products, our business, operating results, and financial condition could be materially harmed.\nThere can be no assurance that our operating results and financial condition will not be negatively impacted by our incurrence of debt.\n \nAs of the end of fiscal 2025, we have senior unsecured notes outstanding in an aggregate principal amount of $24.8 billion that mature at specific dates from calendar year 2026 through 2064. We have also established a commercial paper program under which we may issue short-term, unsecured commercial paper notes on a private placement basis up to a maximum aggregate amount outstanding at any time of $15.0 billion, and we had $3.5 billion in commercial paper notes outstanding under this program as of July 26, 2025. There can be no assurance that our incurrence of this debt or any future debt, including any additional debt to refinance maturing debt, will be a better means of providing liquidity to us than would our use of our existing cash resources. Further, we cannot be assured that our maintenance of this indebtedness or incurrence of future indebtedness will not negatively impact our operating results or financial condition. In addition, changes by any rating agency to our credit rating can negatively impact the value and liquidity of both our debt and equity securities, as well as the terms upon which we may borrow under our commercial paper program or future debt issuances.\nOur reputation and/or business could be negatively impacted by matters relating to environmental, social, and governance and/or our reporting of such matters.\nWe are subject to evolving and sometimes conflicting, laws, regulations, policies, and investor and other stakeholder expectations concerning environmental, social, and governance matters, such as environmental sustainability and climate change, both in the United States and internationally. Any initiatives, goals, or commitments we disclose in this regard involve risks and uncertainties and could be difficult to achieve and costly to implement. For example, in September 2021, we announced our goal to achieve net zero across all scopes of greenhouse gas emissions by 2040, the achievement of which relies, in large part, on the accuracy of our estimates and assumptions around the enhanced power efficiency of our products, the adoption of renewable energy at customer and supplier sites, and the adoption of certain of our products and services by our customers. We could fail to achieve, or be perceived to fail to achieve, our 2040 net zero goal or other initiatives, goals, or commitments. In addition, in a climate where there are changing and increasingly divergent views on where our focus should be on these matters, our initiatives, goals, or commitments, or any revisions to them, are often criticized and the accuracy, adequacy, or completeness of such disclosures challenged. Our actual or perceived failure to achieve our initiatives, goals, or commitments, or otherwise successfully manage investor or other stakeholder expectations on these matters, could negatively impact our reputation or otherwise harm our business.\nRisks Related to Intellectual Property\nOur proprietary rights may prove difficult to enforce.\nWe generally rely on patents, copyrights, trademarks, and trade secret laws to establish and maintain proprietary rights in our technology and products. Although we have been issued numerous patents and other patent applications are currently pending, there can be no assurance that any of these patents or other proprietary rights will not be challenged, invalidated, or \n22\nTable of Contents\ncircumvented or that our rights will, in fact, provide competitive advantages to us. Furthermore, many key aspects of our technology are governed by industry-wide standards, which are usable by all market entrants. In addition, there can be no assurance that patents will be issued from pending applications or that claims allowed on any patents will be sufficiently broad to protect our technology. Additionally, some U.S. governmental entities and courts have expressed a position that U.S. copyright and patent protection should be limited to protecting inventions and works of authorship created by humans. Therefore, U.S. copyright or patent protection for inventions or works developed in part or wholly by generative AI tools may be limited, or not available at all. In addition, the laws of some foreign countries may not protect our proprietary rights to the same extent as do the laws of the United States. The outcome of any actions taken in these foreign countries may be different than if such actions were determined under the laws of the United States. Although we are not dependent on any individual patents or group of patents for particular segments of the business in which we compete, if we are unable to protect our proprietary rights to the totality of the features (including aspects of products protected other than by patent rights) in a market, we may find ourselves at a competitive disadvantage to others who need not incur the substantial expense, time, and effort required to create innovative products that have enabled us to be successful.\nWe may be found to infringe on intellectual property rights of others.\nThird parties, including customers, have in the past and may in the future assert claims or initiate litigation related to exclusive patent, copyright, trademark, and other intellectual property rights to technologies and related standards that are relevant to us. These assertions have increased over time as a result of our growth and the general increase in the pace of patent claims assertions, particularly in the United States. Because of the existence of a large number of patents in the information technology field, the secrecy of some pending patents, and the rapid rate of issuance of new patents, it is not economically practical or even possible to determine in advance whether a product or any of its components infringes or will infringe on the patent rights of others. The asserted claims and/or initiated litigation can include claims against us or our manufacturers, suppliers, or customers, alleging infringement of their proprietary rights with respect to our existing or future products or components of those products. Regardless of the merit of these claims, they can be time-consuming, result in costly litigation and diversion of technical and management personnel, or require us to develop a non-infringing technology or enter into license agreements. Where claims are made by customers, resistance even to unmeritorious claims could damage customer relationships. There can be no assurance that licenses will be available on acceptable terms and conditions, if at all, or that our indemnification by our suppliers will be adequate to cover our costs if a claim were brought directly against us or our customers. Furthermore, because of the potential for high court awards, including injunctive relief, that are not necessarily predictable, it is not unusual to find even arguably unmeritorious claims settled for significant amounts. If any infringement or other intellectual property claim made against us by any third party is successful, if we are required to indemnify a customer with respect to a claim against the customer, or if we fail to develop non-infringing technology or license the proprietary rights on commercially reasonable terms and conditions, our business, operating results, and financial condition could be materially harmed. For additional information regarding our indemnification obligations, see Note 14(e) to the Consolidated Financial Statements contained in this report. Our exposure to risks associated with the use of intellectual property may be increased as a result of acquisitions, as we have a lower level of visibility into the development process with respect to such technology or the care taken to safeguard against infringement risks. Further, in the past, third parties have made infringement and similar claims after we have acquired technology that had not been asserted prior to our acquisition.\nWe rely on the availability of third-party licenses.\nMany of our commercial offerings are designed to include software or other intellectual property licensed from third parties. It may be necessary in the future to seek or renew licenses relating to various aspects of these products. There can be no assurance that the necessary licenses would be available on acceptable terms, if at all. The inability to obtain certain licenses or other rights or to obtain such licenses or rights on favorable terms, or the need to engage in litigation regarding these matters, could materially harm our business, operating results, and financial condition. Moreover, the inclusion in our commercial offerings of software or other intellectual property licensed from third parties on a nonexclusive basis could limit our ability to protect our proprietary rights in our products.\nRisks Related to Cybersecurity, Privacy, and Regulatory Requirements\nCyber attacks, data breaches or other incidents impacting our solutions and IT environment may disrupt our operations, harm our operating results and financial condition, and damage our reputation or otherwise materially harm our business; and cyber attacks, data breaches or other incidents on our customers’ or third-party providers’ networks, or in third-party products we use, could result in claims of liability against us, give rise to legal and/or regulatory action, damage our reputation or otherwise materially harm our business.\nWe experience cyber attacks and other attempts to gain unauthorized access on a regular basis to (i) our products and services (together, our “solutions”) and (ii) the servers, data centers, networks, systems, and cloud-based services operated or enabled by us, or by third parties upon which we rely, on or through which our and third-party data are stored, processed, or can be \n23\nTable of Contents\naccessed (collectively, our “IT environment”). We anticipate continuing to be increasingly subject to such attempts as cyber attacks become more sophisticated and difficult to predict and protect against. Furthermore, the emergence and maturation of AI capabilities has led to new and/or more effective methods of cyber attacks. Despite our active implementation of security and other measures, our solutions and IT environment have been, and continue to be, vulnerable to cyber attacks, incidents, data breaches, malware, inadvertent error, disruptions, failures, physical security breaches, tampering or other theft or misuse, including by employees, contingent workers, and malicious actors. Additionally, nation-state actors or their agents have in the past successfully attacked our IT environment and have also exploited vulnerabilities in our solutions to carry out attacks, and we anticipate that these attacks and the exploitation of vulnerabilities in our solutions will continue and may intensify during periods of diplomatic or armed conflict or other geopolitical tensions. Further, a cyber attack, vulnerability exploitation, or other incident could go undetected and persist in our environments, or those of our customers or third-party providers upon which we rely, for extended periods. Cyber-related events have caused, and in the future could result in, compromise to, or the disruption of access to, the operation of our solutions and IT environment or those of our customers or third-party providers upon which we rely, or result in confidential information stored on our systems or our customers’ or other third-party systems being improperly accessed, processed, disclosed now (or in the future), or being lost or stolen. Efforts to limit the ability of malicious actors to disrupt the operations of the Internet or undermine our security efforts are costly to implement and may not be successful. Breaches of security in our IT environment, our customers’ or third-party providers’ networks, or in third-party products we use, regardless of whether the breach is attributable to a vulnerability in our solutions, a failure by us to timely mitigate or apply a security fix for products we use that are found vulnerable, or a failure to maintain the digital security infrastructure or security tools that protect the integrity of our solutions and IT environment, could, in each case, result in claims of legal and/or regulatory action against us, damage our reputation or otherwise materially harm our business. The occurrence of a cyber attack, data breach or other incident could subject us to direct or indirect liability to our customers, data subjects, suppliers, business partners, employees, and others, give rise to legal and/or regulatory action, could damage our reputation or could otherwise negatively impact our business, any of which could materially harm our business, operating results, and financial condition.\nVulnerabilities and critical security defects, prioritization decisions regarding remedying vulnerabilities or security defects, failure of third-party providers to remedy vulnerabilities or security defects, or customers not deploying security updates in a timely manner or deciding not to upgrade our solutions to those with security updates or security enhancements applied could result in claims of liability against us, damage our reputation, or otherwise materially harm our business.\nThe products and services (together, our “solutions”) we sell to customers, and the cloud-based services operated or enabled by us, or by third parties upon which we rely, inevitably contain vulnerabilities or security defects (despite our efforts to prevent and detect them through secure development lifecycle practices, testing, or other means), which have not been remedied or cannot be disclosed without compromising security. We also make prioritization decisions in determining which vulnerabilities or security defects to fix and the timing of these fixes. Even when we prioritize a vulnerability or security defect, in certain instances it has taken, and in the future could take, time for us to develop and test a remedy and the remedy may ultimately be insufficient to fully fix the issue or may be found to create other issues. In addition, workarounds or other mitigation efforts in certain instances have not been, and in the future may not be, available or sufficient to protect customers prior to a security update being made available. Vulnerabilities can persist even after we have issued security updates if we have not identified and addressed the root cause of a particular vulnerability, if customers have not installed the most recent updates, if the attackers exploited the vulnerabilities before a security update is applied (such as to install additional malware to further compromise customers’ systems), or if a previously patched vulnerability is inadvertently reintroduced due to a security regression during future development or a changed deployment. Additionally, customers may also desire to test security updates before they can be deployed which can delay implementation. When customers do not deploy security updates in a timely manner, use solutions that are end of life and no longer receive security updates, decide not to upgrade to the latest versions of our solutions containing security updates or security enhancements, configure our solutions in insecure ways, or fail to sufficiently monitor activity on those solutions, they are left vulnerable. In addition, we rely on third-party providers of software (including open source) and cloud-based services on which our and third-party data is stored or processed, and we cannot control the timing at which third-party providers remedy vulnerabilities, which could leave us vulnerable. Failure to comply with internal security policies and standards, including secure development lifecycle practices, failure to prevent or promptly mitigate vulnerabilities and security defects, prioritization errors in remedying vulnerabilities or security defects, failure of third-party providers to remedy vulnerabilities or security defects, or customers not deploying security updates in a timely manner, deciding not to upgrade solutions, or configuring our solutions in insecure ways could, in each case, result in claims of legal and/or regulatory action against us, damage our reputation, or otherwise materially harm our business.\nOur actual or perceived failure to adequately protect and appropriately use data could result in claims of legal and/or regulatory action against us, damage our reputation, or otherwise materially harm our business.\nGlobal privacy and data protection-related laws and regulations, including cybersecurity laws, are evolving, extensive, and complex. Compliance with these laws and regulations is difficult and costly. In addition, evolving legal requirements restricting \n24\nTable of Contents\nor controlling the collection, processing, use or cross-border transmission of data, including regulation of cloud-based services, could materially affect our customers’ ability to use, and our ability to sell, our products and services. The interpretation and application of these laws in some instances is uncertain, and our legal and regulatory obligations are subject to frequent changes. For example, the European Union’s (“EU”) General Data Protection Regulation (“GDPR”) applies to our activities conducted from an establishment in the EU or related to products and services offered in the EU and imposes a range of compliance obligations regarding the handling of personal data for both ourselves and our customers. Additionally, we are subject to California’s Consumer Privacy Act, Singapore’s Personal Data Protection Act, and other laws, regulations, and obligations around the world that govern the handling of personal data. Our actual or perceived failure to comply with applicable laws and regulations or other obligations relating to the use of data and protecting data from unauthorized access, use, or other processing, could subject us to claims of liability, or give rise to legal and/or regulatory action, damage our reputation, and/ or otherwise negatively impact our business, any of which could materially harm our operating results and financial condition.\nOur business, operating results, and financial condition could be materially harmed by evolving regulatory uncertainty or obligations applicable to our products and services.\nChanges in regulatory requirements applicable to the industries and sectors in which we operate, in the United States and in other countries, could materially affect the sales and use of our products and services. In particular, economic sanctions and changes to export and import control requirements have impacted and may continue to impact our ability to sell and support our products and services in certain jurisdictions. In addition, changes in telecommunications regulations could impact our service provider customers’ purchase of our products and services, and they could also impact sales of our own regulated offerings. Government and other customers' procurement policies, priorities, regulations, technology initiatives and/or other obligations often give rise to evolving privacy, cybersecurity, operational resilience, data governance, or other requirements; the failure or delay in meeting and maintaining compliance with such requirements could negatively impact our business, including by limiting our ability to sell products and services, directly or indirectly, to public sector, critical infrastructure, and other customers. Additional areas of uncertainty that could impact sales of our products and services include laws, regulations, or customer procurement requirements related to encryption technology, data, AI, privacy, cybersecurity, operational resilience, environmental sustainability (including climate change), human rights, product certification, product and digital accessibility, country of origin, and national security and other security controls applicable to our offerings and supply chain. Changes in regulatory requirements or our actual or perceived failure to comply (or to enable our customers to comply when using our offerings) with applicable laws, regulations, or other obligations could materially harm our business, operating results, and financial condition.\nRisks Related to Ownership of Our Stock\nOur stock price may be volatile.\nHistorically, our common stock has experienced substantial price volatility, particularly as a result of variations between our actual financial results and the published expectations of analysts and as a result of announcements by our competitors and us. Furthermore, speculation in the press or investment community about our strategic position, financial condition, results of operations, business, security of our products, or significant transactions can cause changes in our stock price. In addition, the stock market has experienced extreme price and volume fluctuations that have affected the market price of many technology companies, in particular, and that have often been unrelated to the operating performance of these companies. These factors, as well as general economic and political conditions and the announcement of proposed and completed acquisitions or other significant transactions, or any difficulties associated with such transactions, by us or our current or potential competitors, may materially harm the market price of our common stock in the future. Additionally, volatility, lack of positive performance in our stock price or changes to our overall compensation program, including our stock incentive program, may negatively impact our ability to retain key employees, virtually all of whom are compensated, in part, based on the performance of our stock price.\nItem 1B.\nUnresolved Staff Comments\nNone.\n25\nTable of Contents\nItem 1C.\nCybersecurity\nWe recognize the critical importance of maintaining the trust and confidence of our customers, employees, and other stakeholders. To help mitigate the cybersecurity risks that we face, we maintain processes for identifying, assessing, and managing such risks. \nOur incident response functions, which include our Security and Trust Organization (“S&TO”) under the leadership of our Chief Security and Trust Officer, have established internal policies, processes, and procedures to monitor, detect, investigate, respond to, and escalate management of internal and external cybersecurity threats and incidents\n. We maintain policies and procedures for the escalation of cybersecurity incidents, assessed as potentially being or becoming material, to designated members of our senior management for further assessment. We also, as necessary, inform our independent registered public accounting firm of significant cybersecurity matters and any relevant developments.\nTo help identify, assess, and mitigate cybersecurity threats that we face to our business, S&TO, in addition to its own capabilities, partners with Cisco’s Talos Threat Intelligence Group and third parties, including governments and peer companies, to share and receive threat intelligence and other information. S&TO actively monitors for and evaluates cybersecurity vulnerabilities, threats, and incidents observable on the Internet and the dark web. In addition to monitoring risks from threats to our own business, we operate third-party risk management programs to help identify and manage risks from cybersecurity threats arising from third-party suppliers and service providers on which we rely. These programs leverage on-going security-focused risk assessments based on industry practices, audits, and contractual requirements.\nWe strive to embed security into our products and services through the Cisco Secure Development Lifecycle (CSDL). The CSDL introduces security and privacy considerations throughout the lifecycle of our products and services. In addition, S&TO advises business units and functional areas on addressing cybersecurity risks and monitors initiatives to mitigate and manage such risks over time. Our business units or functional areas are responsible for managing risks and ensuring that security policies and standards are implemented within the respective business unit or function. S&TO also conducts mandatory cybersecurity training for our employees and provides employees with tools to report suspected incidents.\nS&TO engages third parties in connection with our cybersecurity risk management processes, including cybersecurity consultants and auditors, to conduct evaluations of our IT security controls and provide certifications for industry-standard security frameworks.\n \nIn addition, we maintain a global privacy program to assess and manage privacy risks related to how we are collecting, using, sharing, and storing personal data, which is subject to assessment by an independent, third-party privacy assessor.\nOur \nChief Security and Trust Officer\n, who reports to our Executive Vice President, Operations, works collaboratively across our business to implement policies and procedures designed to protect our IT environment and our products and services from cybersecurity threats, and to promptly respond to cybersecurity incidents in accordance with our incident response policies and procedures.\n \nOur Chief Security and Trust Officer has extensive cybersecurity experience and has served in various roles in information technology and information security for over 25 years.\nThe Chief Security and Trust Officer provides regular reports on the status of cybersecurity risks, priorities, and focus areas to our executive leadership team. In addition, information on cybersecurity risks is further integrated into our broader enterprise risk management program through our internal audit function, which incorporates such information in regular audits of our cybersecurity and data protection controls and processes.\nOur \nBoard of Directors\n oversees risks related to cybersecurity threats to our business directly and through its Audit Committee. The Audit Committee receives regular reports on cybersecurity risks, priorities, and focus areas from our Chief Security and Trust Officer at least four times a year and receives a live presentation at least twice a year. Our Board of Directors also regularly receives updates from the Audit Committee on its oversight activities and, on occasion, receives updates directly from our Chief Security and Trust Officer. Additionally, the Chief Security and Trust Officer provides more frequent updates to the Board of Directors and Audit Committee if necessary due to a cybersecurity threat, incident, or other development.\nAs of the date of this Annual Report on Form 10-K, we do not believe our business, operating results, or financial condition have been materially affected by cybersecurity risks, including as a result of previously identified cybersecurity incidents\n. For more information on our cybersecurity related risks, see “"
}