{
  "ticker": "CSGP",
  "cik": "0001057352",
  "company_name": "COSTAR GROUP, INC.",
  "filing_date": "2025-02-20",
  "accession": "0001057352-25-000016",
  "primary_doc": "csgp-20241231.htm",
  "item1_text": "Item 1. Business\" in this Report.\nNon-GAAP Financial Measures\nWe prepare and publicly release quarterly unaudited financial statements prepared in accordance with GAAP. We also disclose and discuss certain non-GAAP financial measures in our public releases, investor conference calls, and filings with the SEC. The non-GAAP financial measures that we may disclose include EBITDA, adjusted EBITDA, and adjusted EBITDA margin. EBITDA is our net income before interest income or expense, net, other expense or income, net, loss on debt extinguishment, income taxes, depreciation and amortization. We typically disclose EBITDA on a consolidated and an operating segment basis in our earnings releases, investor conference calls, and filings with the SEC. Adjusted EBITDA is different from EBITDA because we further adjust EBITDA for stock-based compensation expense, acquisition- and integration-related costs, restructuring costs, and settlements and impairments incurred outside our ordinary course of business. Adjusted EBITDA margin represents adjusted EBITDA divided by revenues for the period.\nWe may disclose adjusted EBITDA and adjusted EBITDA margin on a consolidated basis in our earnings releases, investor conference calls, and filings with the SEC. The non-GAAP financial measures that we use may not be comparable to similarly titled measures reported by other companies. Also, in the future, we may disclose different non-GAAP financial measures in order to help our investors meaningfully evaluate and compare our results of operations to our previously reported results of operations or to those of other companies in our industry.\nWe view EBITDA, adjusted EBITDA, and adjusted EBITDA margin as operating performance measures. We believe that the most directly comparable GAAP financial measure to EBITDA and adjusted EBITDA is net income. We believe the most directly comparable GAAP financial measure to adjusted EBITDA margin is net income divided by revenue. In calculating EBITDA, adjusted EBITDA, and adjusted EBITDA margin we exclude from net income the financial items that we believe should be separately identified to provide additional analysis of the financial components of the day-to-day operation of our business. We have outlined below the type and scope of these exclusions and the material limitations on the use of these non-GAAP financial measures as a result of these exclusions. EBITDA, adjusted EBITDA, and adjusted EBITDA margin are not measurements of financial performance under GAAP and should not be considered as a measure of liquidity, as an alternative to net income, or as an indicator of any other measure of performance derived in accordance with GAAP. Investors and potential investors in our securities should not rely on EBITDA, adjusted EBITDA, and adjusted EBITDA margin as a substitute for any GAAP financial measure. In addition, we urge investors and potential investors in our securities to carefully review the GAAP financial information included as part of our Annual Reports on Form 10-K and Quarterly Reports on Form 10-Q that are filed with the SEC, as well as our quarterly earnings releases, and compare the GAAP financial information with our EBITDA, adjusted EBITDA, and adjusted EBITDA margin.\n38\nEBITDA, adjusted EBITDA, and adjusted EBITDA margin may be used by management to internally measure our operating and management performance and may be used by investors as supplemental financial measures to evaluate the performance of our business. We believe that these non-GAAP measures, when viewed with our GAAP results and accompanying reconciliations, provide additional information to investors that is useful to understand the factors and trends affecting our business without the impact of certain acquisition-related items. We have spent more than 30 years building our database of commercial real estate information and expanding our markets and services partially through acquisitions of complementary businesses. Due to these acquisitions, our net income has included significant charges for amortization of acquired intangible assets, depreciation and other amortization, acquisition- and integration-related costs, restructuring costs, and loss on debt extinguishment. Adjusted EBITDA and adjusted EBITDA margin exclude these charges and provide meaningful information about the operating performance of our business, apart from charges for amortization of acquired intangible assets, depreciation and other amortization, acquisition- and integration-related costs, restructuring costs; settlement and impairment costs incurred outside our ordinary course of business. We believe the disclosure of non-GAAP measures can help investors meaningfully evaluate and compare our performance from quarter-to-quarter and from year-to-year without the impact of these items. We also believe the non-GAAP measures we disclose are measures of our ongoing operating performance because the isolation of non-cash charges, such as amortization and depreciation, and other items, such as interest income or expense, net, other expense or income, net, income taxes, stock-based compensation expenses, acquisition- and integration-related costs, restructuring costs, loss on debt extinguishment, and settlement and impairment costs incurred outside our ordinary course of business, provides additional information about our cost structure, and, over time, helps track our operating progress. In addition, investors, securities analysts, and others have regularly relied on EBITDA and may rely on adjusted EBITDA and adjusted EBITDA margin to provide a financial measure by which to compare our operating performance against that of other companies in our industry.\nSet forth below are descriptions of financial items that have been excluded from net income to calculate EBITDA and the material limitations associated with using this non-GAAP financial measure as compared to net income:\n•\nAmortization of acquired intangible assets in cost of revenues may be useful for investors to consider because it represents the diminishing value of any acquired trade names and other intangible assets and the use of our acquired technology, which is one of the sources of information for our database of commercial real estate information. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•\nAmortization of acquired intangible assets in operating expenses may be useful for investors to consider because it represents the estimated attrition of our acquired customer base. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•\nDepreciation and other amortization may be useful for investors to consider because they generally represent the wear and tear on our property and equipment used in our operations. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•\nThe amount of interest income or expense, net and other expense or income, net we generate and incur may be useful for investors to consider and may result in current cash inflows and outflows. However, we do not consider the amount of interest income or expense, net and other expense or income, net to be a representative component of the day-to-day operating performance of our business.\n•\nIncome tax expense may be useful for investors to consider because it generally represents the taxes which may be payable for the period and the change in deferred income taxes during the period and may reduce the amount of funds otherwise available for use in our business. However, we do not consider the amount of income tax expense to be a representative component of the day-to-day operating performance of our business.\n•\nThe amount of loss on our debt extinguishment may be useful for investors to consider because it generally represents losses from the early extinguishment of debt. However, we do not consider the amount of the loss on debt extinguishment to be a representative component of the day-to-day operating performance of our business.\n39\nSet forth below are descriptions of additional financial items that have been excluded from EBITDA to calculate adjusted EBITDA and the material limitations associated with using this non-GAAP financial measure as compared to net income:\n•\nStock-based compensation expense may be useful for investors to consider because it represents a portion of the compensation of our employees and executives. Determining the fair value of the stock-based instruments involves a high degree of judgment and estimation and the expenses recorded may bear little resemblance to the actual value realized upon the future exercise or termination of the related stock-based awards. Therefore, we believe it is useful to exclude stock-based compensation in order to better understand the long-term performance of our core business.\n•\nThe amount of acquisition- and integration-related costs incurred may be useful for investors to consider because such costs generally represent professional service fees and direct expenses related to acquisitions. Because we do not acquire businesses on a predictable cycle, we do not consider the amount of acquisition- and integration-related costs to be a representative component of the day-to-day operating performance of our business.\n•\nThe amount of settlement and impairment costs incurred outside of our ordinary course of business may be useful for investors to consider because they generally represent gains or losses from the settlement of litigation matters, charges related to terminations of contracts or impairments of acquired intangible assets or other long lived assets. We do not believe these charges necessarily reflect the current and ongoing cash charges related to our operating cost structure.\n•\nThe amount of restructuring costs incurred may be useful for investors to consider because they generally represent costs incurred in connection with a change in a contract or a change in the makeup of our properties or personnel. Because we do not carry out restructuring activities on a predictable cycle, we do not consider the amount of restructuring related costs to be a representative component of the day-to-day operating performance of our business.\nManagement compensates for the above-described limitations of using non-GAAP measures by using a non-GAAP measure only to supplement our GAAP results and to provide additional information that is useful to investors to understand the factors and trends affecting our business.\n40\nConsolidated Results of Operations\nThe following table provides our selected consolidated results of operations for the indicated periods (in millions and as a percentage of total revenue):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nRevenues\n$\n2,736.2 \n100 \n%\n$\n2,455.0 \n100 \n%\n$\n2,182.4 \n100 \n%\nCost of revenues\n558.5 \n20 \n491.5 \n20 \n414.0 \n19 \nGross profit\n2,177.7 \n80 \n1,963.5 \n80 \n1,768.4 \n81 \nOperating expenses:\nSelling and marketing (excluding customer base amortization)\n1,364.3 \n50 \n989.9 \n40 \n684.2 \n31 \nSoftware development\n325.3 \n12 \n267.6 \n11 \n220.9 \n10 \nGeneral and administrative\n439.1 \n16 \n381.5 \n16 \n338.7 \n16 \nCustomer base amortization\n44.3 \n2 \n42.2 \n2 \n73.6 \n3 \nTotal operating expenses\n(1)\n2,173.0 \n79 \n1,681.2 \n68 \n1,317.4 \n60 \nIncome from operations\n(1)\n4.7 \n— \n282.3 \n11 \n451.0 \n21 \nInterest income, net\n212.5 \n8 \n213.6 \n9 \n32.1 \n1 \nOther (expense) income, net\n(7.1)\n— \n5.4 \n— \n3.4 \n— \nIncome before income taxes\n(1)\n210.1 \n8 \n501.3 \n20 \n486.5 \n22 \nIncome tax expense\n71.4 \n3 \n126.6 \n5 \n117.0 \n5 \nNet income\n(1)\n$\n138.7 \n5 \n%\n$\n374.7 \n15 \n%\n$\n369.5 \n17 \n%\n__________________________\n(1)\n \nAmounts may not foot due to rounding.\nThe following table provides our revenues by type of service (in millions and as a percentage of total revenue):\nYear Ended December 31,\n2024\n2023\n2022\nCoStar\n$\n1,020.5 \n37 \n%\n$\n925.2 \n38 \n%\n$\n837.0 \n38 \n%\nInformation services \n135.9 \n5 \n170.9 \n7 \n157.4 \n7 \nMultifamily \n1,067.3 \n39 \n914.2 \n37 \n745.4 \n34 \nLoopNet\n281.7 \n10 \n264.8 \n11 \n230.9 \n11 \nResidential\n100.6 \n4 \n46.1 \n2 \n73.7 \n3 \nOther marketplaces\n130.2 \n5 \n133.8 \n5 \n138.0 \n6 \nTotal revenues\n(1)(2)\n$\n2,736.2 \n100 \n%\n$\n2,455.0 \n100 \n%\n$\n2,182.4 \n100 \n%\n__________________________\n(1)\n \nFor further discussion of our Company, strategy, and products, see our business overview set forth in \"Item 1. Business\" in this Report.\n(2)\n Totals may not foot due to rounding.\n41\nComparison of Year Ended December 31, 2024 and Year Ended December 31, 2023 \nThe following table provides a comparison of our selected consolidated results of operations for the years ended December 31, 2024 and 2023 (in millions):\n \n2024\n2023\nIncrease (Decrease)\nIncrease (Decrease)\nRevenues:\nCoStar\n$\n1,020.5 \n$\n925.2 \n$\n95.3 \n10 \n%\nInformation services\n135.9 \n170.9 \n(35.0)\n(20)\nMultifamily\n1,067.3 \n914.2 \n153.1 \n17 \nLoopNet\n281.7 \n264.8 \n16.9 \n6 \nResidential\n100.6 \n46.1 \n54.5 \n118 \nOther marketplaces\n130.2 \n133.8 \n(3.6)\n(3)\nTotal revenues\n2,736.2 \n2,455.0 \n281.2 \n11 \nCost of revenues\n558.5 \n491.5 \n67.0 \n14 \nGross profit\n2,177.7 \n1,963.5 \n214.2 \n11 \nOperating expenses:\nSelling and marketing (excluding customer base amortization)\n1,364.3 \n989.9 \n374.4 \n38 \nSoftware development\n325.3 \n267.6 \n57.7 \n22 \nGeneral and administrative\n439.1 \n381.5 \n57.6 \n15 \nCustomer base amortization\n44.3 \n42.2 \n2.1 \n5 \nTotal operating expenses\n2,173.0 \n1,681.2 \n491.8 \n29 \nIncome from operations\n4.7 \n282.3 \n(277.6)\n(98)\nInterest income, net\n212.5 \n213.6 \n(1.1)\n(1)\nOther (expense) income, net\n(7.1)\n5.4 \n(12.5)\nNM\n(1)\nIncome before income taxes\n210.1 \n501.3 \n(291.2)\n(58)\nIncome tax expense\n71.4 \n126.6 \n(55.2)\n(44)\nNet income\n$\n138.7 \n$\n374.7 \n$\n(236.0)\n(63)\n%\n__________________________\n(1) \nNot meaningful\nRevenues.\n Revenues increased $281 million, or 11%, to $2.7 billion. The increase in our revenues included: \n•\nan increase in Multifamily revenues of $153 million, or 17%, due to an increase in the number of properties listed on our network and increases in pricing for existing customers,\n•\nan increase in CoStar revenues of $95 million, or 10%, due to an increase in subscribers and price increases, as well as converting legacy STR customers to our new CoStar-based benchmarking product,\n•\nan increase in Residential revenues of $55 million, or 118%, due to the launch of the new Homes.com membership subscriptions and the OnTheMarket Acquisition, partially offset by the discontinuation and reduced sales of certain products and services that were inconsistent with our long-term business strategy, \n•\nan increase in LoopNet revenues of $17 million, or 6%, due to an increase in the average price per listing and an increase in the number of paid listings,\n•\na decrease in Information services revenues of $35 million, or 20%, attributable to converting legacy STR customers to our new CoStar-based benchmarking product, partially offset by an increase in revenue from CoStar Real Estate Manager and the Visual Lease Acquisition, and\n•\na decrease in Other marketplaces revenues of $4 million, or 3%, due to lower property volumes auctioned on Ten-X partially offset by increases in revenues of the Land.com Network.\n42\nGross Profit and Cost of Revenues.\n Gross profit increased $214 million, or 11%, to $2.2 billion in 2024, and the gross profit percentage was consistent at 80%. The increase in gross profit was due to higher revenues partially offset by an increase in the cost of revenues. Cost of revenues increased $67 million, or 14% to $559 million and, as a percentage of revenues, was consistent at 20%. The increase in cost of revenues primarily included:\n•\nan increase in personnel costs of $43 million related to increases in salaries and benefits costs for our existing employees and rising headcount to support our residential research efforts,\n•\nan increase of $17 million for web hosting costs, and \n•\nan increase of $6 million of payment processing fees.\nSelling and Marketing Expenses\n. Selling and marketing expenses increased $374 million, or 38%, to $1,364 million and, as a percentage of revenues, increased from 40% to 50%. The increase primarily included:\n•\nan increase in marketing expenses of $304 million for advertising our brands and \n•\nan increase in personnel costs of $67 million related to rising headcount in our sales force, recruiting costs, and commissions expense.\nSoftware Development Expenses\n. Software development expenses increased $58 million, or 22% to $325 million and, as a percentage of revenues, increased from 11% to 12%. The increase primarily included:\n•\nan increase in personnel costs of $43 million related to rising headcount and increases in salaries, stock-based compensation, and benefits costs for our existing employees,\n•\nan increase of $9 million in software and equipment costs, and \n•\nan increase of $3 million in occupancy costs.\nGeneral and Administrative Expenses\n. General and administrative expenses increased $58 million, or 15%, to $439 million and, as a percentage of revenues, was consistent at 16%. The increase primarily included:\n•\nan increase in professional services of $29 million, primarily related to acquisition activities and costs to defend our intellectual property, \n•\nan increase in personnel costs of $14 million related to the OnTheMarket Acquisition and rising headcount,\n•\nan increase in depreciation expense of $7 million related to new communications and networking equipment across our offices and increased depreciation expense associated with the change in useful life of our previous headquarters building, and \n•\nan increase of $4 million in occupancy costs from the OnTheMarket Acquisition.\nCustomer Base Amortization Expense\n. Customer base amortization expense was consistent.\nInterest Income, Net\n. Interest income, net was consistent. \nOther (Expense) Income, Net\n. Other (expense) income, net was an expense of $7 million for the year ended December 31, 2024 and related to leasing operations acquired in February 2024.\nIncome Tax Expense\n. Income tax expense decreased $55 million, or 44%, to $71 million and the effective tax rate was 34% of income before income taxes compared to 25% of income before income taxes for the year ended December 31, 2023. The decrease in income tax expense was primarily attributable to lower U.S. income. The increase in the effective tax rate is primarily attributable to an increase in foreign losses with no tax benefit.\nFor a comparison of our results of operations for the fiscal year ended December 31, 2023 to the year ended December 31, 2022, see Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on the Form 10-K for the year ended December 31, 2023, which was filed with the SEC on February 21, 2024.\n43\nComparison of Business Segment Results for Year Ended December 31, 2024 and Year Ended December 31, 2023 \nWe manage our business geographically in two operating segments, with the primary areas of measurement and decision-making being North America, which includes the U.S. and Canada, and International, which primarily includes Europe, Asia-Pacific and Latin America. Management relies on an internal management reporting process that provides revenue and operating segment EBITDA, which is our net income before interest income or expense, net, other expense or income, net, loss on debt extinguishment, income taxes, depreciation and amortization. Management believes that operating segment EBITDA is an appropriate measure for evaluating the operational performance of our operating segments. EBITDA is used by management to internally measure operating and management performance and to evaluate the performance of our business. \nSegment Revenues\n. North America revenues increased $234 million, or 11%, to $2.6 billion and included: \n•\nan increase in Multifamily revenues of $153 million, or 17%, due to an increase in the number of properties listed on our network and increases in pricing for existing customers, \n•\nan increase in CoStar revenues of $71 million, or 8%, due to an increase in subscribers and price increases, as well as converting legacy STR customers to our new CoStar-based benchmarking product,\n•\nan increase in LoopNet revenues of $16 million, or 6%, due to an increase in the average price per listing and an increase in the number of paid listings, \n•\nan increase in Residential revenues of $15 million, or 34%, due to the launch of the new Homes.com membership subscriptions, partially offset by the discontinuation and reduced sales of certain products and services that were inconsistent with our long-term business strategy,\n•\na decrease in Information services revenues of $17 million, or 13%, attributable to converting legacy STR customers to our new CoStar-based benchmarking product, partially offset by an increase in revenue from CoStar Real Estate Manager and the Visual Lease Acquisition, and\n•\na decrease in Other marketplaces revenues of $4 million, or 3%, due to the lower property volumes auctioned on Ten-X, partially offset by an increase in revenue from the Land.com Network.\nInternational revenues increased $47 million, or 53%, to $136 million and primarily included:\n•\nan increase in Residential revenues of $39 million due to the OnTheMarket Acquisition,\n•\nan increase in CoStar revenues of $24 million, or 61%, due to converting legacy STR customers to our new CoStar-based benchmarking product, as well as an increase in subscribers and price increases, and\n•\na decrease in Information services revenues of $18 million, or 46%, attributable to converting legacy STR customers to our new CoStar-based benchmarking product.\nSegment EBITDA\n. North America EBITDA decreased to $181.5 million for the year ended December 31, 2024, from $403 million for the year ended December 31, 2023. The decrease in North America EBITDA was primarily due to increases in marketing costs, personnel costs, professional services fees, and web hosting costs, partially offset by increases in revenues described above. International EBITDA decreased to a loss of $58.5 million for the year ended December 31, 2024 from a loss of $13 million for the year ended December 31, 2023. The decrease was primarily due to the OnTheMarket Acquisition for which we have increased marketing expenses since acquisition and an increase in personnel costs associated with the expansion of our international research team.\nFor a comparison of our business segment results of operations for the fiscal year ended December 31, 2023 to the year ended December 31, 2022, see Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for the year ended December 31, 2023, which was filed with the SEC on February 21, 2024.\nLiquidity and Capital Resources\nWe believe the balance of cash and cash equivalents, which was $4.7 billion as of December 31, 2024, along with cash generated by ongoing operations and continued access to capital markets, will be sufficient to satisfy our cash requirements over the next 12 months and beyond. Our material cash requirements include the following contractual and other obligations.\n44\nDebt.\n As of December 31, 2024, we had outstanding an aggregate principal amount of $1.0 billion of Senior Notes due July 15, 2030. Future interest payments associated with the Senior Notes are $168.0 million, with $28.0 million payable within 12 months.\nLeases.\n We have lease arrangements for office facilities, data centers, and certain vehicles. As of December 31, 2024, we had fixed lease payment obligations of $139 million, with $32 million payable within 12 months.\nPurchase Obligations.\n Our purchase obligations are associated with agreements that are enforceable and legally binding and that specify all significant terms, including fixed or minimum services to be used, fixed, minimum or variable price provisions, and the approximate timing of the transaction and have an original term greater than one year. The services acquired under these agreements primarily relate to web hosting, sponsorship agreements, third-party data or listings, and software subscriptions. As of December 31, 2024, we had purchase obligations of $244 million, with $94 million payable within 12 months.\nConstruction Commitments.\n We are expanding our Richmond, Virginia campus, which is expected to result in a material cash requirement in 2025 and 2026. We broke ground on the expansion in November 2022 and expect construction to be substantially completed in the first half of 2026. We have engaged a project manager, architects, and a general contractor on terms that generally require payments as services are provided or construction is performed. As of December 31, 2024, we are obligated to spend an additional $395 million as further work is performed under these contracts. We expect $361 million of these costs to be paid 2025 and intend to fund these expenditures with cash on hand. \nIn conjunction with this expansion, we negotiated various tax incentives with the Commonwealth of Virginia and the City of Richmond, including the allowance to use market-based income apportionment for income taxes and partial reimbursements of property tax assessments related to the value of the campus expansion. These incentives are conditional upon achieving job creation and capital expenditure targets from 2022 to 2029. Failure to meet these targets could result in a reduction of the value of the tax incentives and repayment of previous tax reductions. The value of the allowance to use a market-based income apportionment for income taxes is dependent on our taxable income. We estimate the value of the allowance to use market-based income apportionment for income taxes for tax years 2023 to 2032 and partial reimbursements of property tax assessments related to the value of the campus expansion to be in the range of $275 million - $285 million.\nPending Acquisitions.\n On April 21, 2024, the Company entered into Matterport Merger Agreement, subject to the terms and conditions of which, each share of Matterport Common Stock issued and outstanding immediately prior to the effective time of the First Merger (the “First Effective Time”) (other than any cancelled shares or Dissenting Shares (as defined in the Matterport Merger Agreement)) will be converted into (i) a number of CoStar Group Shares equal to the Merger Exchange Ratio (such consideration, the “Per Share Stock Consideration”) and (ii) $2.75 in cash per share, without interest (the “Per Share Cash Consideration”). Holders of Matterport Common Stock will receive cash in lieu of fractional CoStar Group Shares.\nConsummation of the Mergers is subject to certain customary conditions, including, among others, expiration or termination of the applicable waiting periods under the HSR Act and the Antitrust Laws (each as defined in the Matterport Merger Agreement) of certain other jurisdictions, the absence of any law, injunction, order, or award restraining, enjoining, or otherwise prohibiting or making illegal the consummation of the Mergers. Each party’s obligation to consummate the Mergers is subject to certain other conditions, including the accuracy of the representations and warranties of the other party, compliance in all material respects by the other party with its obligations under the Matterport Merger Agreement, and the absence of a material adverse effect related to the other party. Consummation of the Mergers is not subject to approval by our stockholders or to any financing condition.\nOn July 3, 2024, Matterport and CoStar Group each received a request for additional information and documentary materials (the “Second Request”) from the FTC in connection with the FTC’s review of the Transaction. The effect of the Second Request is to extend the waiting period imposed by the HSR Act until 30 days after Matterport and CoStar Group have each substantially complied with their respective Second Requests, unless that period is extended or terminated sooner by the FTC. Matterport and CoStar Group certified they were in substantial compliance with the Second Request in November 2024 and January 2025, respectively. Each of Matterport and CoStar Group continue to work cooperatively with the FTC in its review of the Transaction and expect that the Transaction will be completed in the first quarter of 2025, subject to the expiration or termination of the waiting period under the HSR Act and the satisfaction or waiver of the other closing conditions specified in the Matterport Merger Agreement.\nThe Matterport Merger Agreement requires the Company to pay an $85 million fee to Matterport in the event the Matterport Merger Agreement is terminated under specified circumstances, including, among others: if certain antitrust approvals are not obtained or a governmental order related to antitrust or competition matters prohibits the consummation of the transaction. The Company intends to fund the cash consideration with cash on hand. The cash consideration is estimated to be \n45\n$940 million and the stock consideration would require the issuance of approximately 11.2 million CoStar Group Shares using the share price of the Company at April 19, 2024, not considering Fractional Share Consideration. In addition, awards of restricted stock units relating to Matterport grants that are outstanding at the time of the First Merger will be converted into a corresponding award of CoStar Group Shares based on the Matterport Merger Consideration.\nStock Repurchase Program\nIn February 2025, the Board of Directors approved the Stock Repurchase Program which authorizes, but does not obligate, the repurchase of up to $500 million of the Company’s common stock. Repurchases may be made from time to time at management's discretion, and the timing and amount of any such repurchases will be determined based on share price, market conditions, legal requirements, and other relevant factors. The program has no time limit and can be discontinued at any time at the Company’s discretion. There can be no assurance as to the timing or number of shares of any repurchases in the future.\nOur future capital requirements will depend on many factors, including, among others, our operating results, expansion and integration efforts, the Stock Repurchase Program and our level of acquisition activity or other strategic transactions. To date, we have grown in part by acquiring other companies, and we expect to continue to make acquisitions.\nCash and cash equivalents decreased to $4.7 billion as of December 31, 2024, compared to cash and cash equivalents of $5.2 billion as of December 31, 2023. The decrease in cash and cash equivalents for the year ended December 31, 2024 was primarily due to $912.9 million of cash used in investing activities and cash used in financing activities of $13.7 million, partially offset by cash provided by operating activities of $392.6 million.\nNet cash provided by operating activities for the year ended December 31, 2024 was $392.6 million compared to $489.5 million for the year ended December 31, 2023. The $96.9 million decrease in cash provided by operating activities was primarily driven by a decrease in net income, partially offset by an increase in non-cash expenses and working capital changes.\nNet cash used in investing activities for the year ended December 31, 2024 was $912.9 million compared to $238.6 million for the year ended December 31, 2023. The change was primarily driven by an increase in the purchase of property, equipment, and other assets for our new campuses of $461.5 million, including $343 million related to the purchase of an office building in Arlington, Virginia to relocate our Washington, D.C.-based employees, and an increase in cash paid for acquisitions, net of cash acquired of $177.1 million primarily related to the Visual Lease acquisition.\nNet cash used in financing activities for the year ended December 31, 2024 was $13.7 million compared to net cash used in financing activities of $3.7 million for the year ended December 31, 2023. The increase was primarily driven by repurchases of restricted stock to satisfy tax withholding obligations and payment of debt issuance costs related to the 2024 Credit Agreement.\nCritical Accounting Estimates\nOur consolidated financial statements are prepared in accordance with GAAP. The preparation of these consolidated financial statements requires us to make estimates, judgments, and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosures. While we have used our best estimates based on facts and circumstances available to us at the time, different acceptable assumptions would yield different results. Changes in the accounting estimates are reasonably likely to occur from period to period, which may have a material impact on the presentation of our financial condition and results of operations. We review these estimates and assumptions periodically and reflect the effects of revisions in the period that they are determined to be necessary. We consider the accounting for the following matters to contain critical accounting estimates:\n•\nIntangible assets and goodwill;\n•\nIncome taxes; and\n•\nBusiness combinations.\nWith respect to our accounting policy for intangible assets and goodwill, we further supplement in Note 2 of the Notes to the Consolidated Financial Statements included in Part IV of this Report with the following:\nWe assess the impairment of identifiable intangibles and goodwill whenever events or changes in circumstances indicate that the carrying value may not be recoverable. Judgments made by management relate to the expected useful lives of intangible assets and our ability to recover the carrying value of such assets. The accuracy of these judgments may be adversely affected by several factors, including the factors listed below:\n•\nSignificant underperformance relative to historical or projected future operating results;\n•\nSignificant changes in the manner of our use of the acquired assets or the strategy for our overall business;\n46\n•\nSignificant negative industry or economic trends; or\n•\nSignificant decline in our market capitalization relative to net book value for a sustained period.\nWhen we determine that the carrying value of intangible assets may not be recovered based upon the existence of one or more of the above indicators, we test for impairment.\nGoodwill and identifiable intangible assets that are not subject to amortization are tested annually for impairment by each reporting unit on October 1 of each year and are also tested for impairment more frequently based upon the existence of one or more of the above indicators.\nGoodwill represents the future economic benefits arising from a business combination and is calculated as the excess of purchase consideration paid in a business combination over the fair value of assets of the net identifiable assets acquired. Goodwill is not amortized, but instead tested for impairment at least annually by each reporting unit, or more frequently if an event or other circumstance indicates that the fair value of a reporting unit may be below its carrying amount. We may first assess qualitative factors to evaluate whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, or elect to bypass the qualitative assessment. If it is determined that it is more likely than not that the fair value of a reporting unit is less than its carrying value, or we elect to bypass the qualitative assessment, we then perform a quantitative assessment by determining the fair value of each reporting unit. We estimate the fair value of each reporting unit based on a projected discounted cash flow model that includes significant assumptions and estimates including our discount rate, growth rate, and future financial performance. Assumptions about the discount rate are based on a weighted average cost of capital for comparable companies and determined by management to be commensurate with the risk in our current business model. Assumptions about the growth rate and future financial performance of a reporting unit are based on our forecasts, business plans, economic projections, and anticipated future cash flows. These assumptions are subject to change from period-to-period and could be adversely impacted by the uncertainty surrounding global market conditions, commercial real estate conditions, and the competitive environment in which we operate. Changes in these or other factors could negatively affect our reporting units' fair value and potentially result in impairment charges. Such impairment charges could have an adverse effect on our results of operations. The fair value of each reporting unit is compared to the carrying amount of the reporting unit. If the carrying value of the reporting unit exceeds the fair value, then an impairment loss is recognized for the difference. \nAs of October 1, 2024, we assessed the relevant qualitative factors for our North America and International reporting units and concluded that it was not more likely than not that the fair value of reporting units were less than the respective carrying amounts. We elected to bypass performing the qualitative screen and performed the first step quantitative analysis of the goodwill impairment test for our International reporting unit in 2023, which indicated that the fair value of this unit exceeded its carrying value. There have been no events or changes in circumstances as a result of our qualitative impairment analysis on October 1, 2024, that would indicate that the carrying value of each reporting unit may not be recoverable.\nFor an in-depth discussion of each of our significant accounting policies, including further information regarding estimates and assumptions involved in their application, see Note 2 of the Notes to the Consolidated Financial Statements included in Part IV of this Report.\nRecent Accounting Pronouncements\nSee Note 2 of the Notes to the Consolidated Financial Statements included in Part IV of this Report for further discussion of recent accounting pronouncements, including the expected dates of adoption.\nItem 7A.    Quantitative and Qualitative Disclosures About Market Risk\nWe provide online marketplace services, information, and analytics to commercial real estate and related business communities within the regions where we operate which primarily include, North America, Europe, Asia-Pacific, and Latin America. The functional currency for a majority of our operations is the local currency, with the exception of certain international locations for which the functional currency is the British Pound.\nFluctuations in the British Pound, Canadian dollar and Euro may have an impact on our business, results of operations, and financial position. For the years ended December 31, 2024 and December 31, 2023, revenues denominated in foreign currencies were approximately 5% and 4% of total revenue, respectively. For the years ended December 31, 2024 and December 31, 2023, our revenues would have decreased by approximately $14 million and $10 million, respectively, if the U.S. dollar exchange rate used strengthened by 10%. For the years ended December 31, 2024 and December 31, 2023, our revenues would have increased by approximately $14 million and $10 million, respectively, if the U.S. dollar exchange rate used weakened by 10%. Fluctuations in the exchange rates of revenues denominated in any other foreign currencies would have had an immaterial impact on our consolidated results. In addition, we have assets and liabilities denominated in foreign currencies. We currently \n47\ndo not use financial instruments to hedge our exposure to exchange rate fluctuations with respect to our foreign subsidiaries. We may seek to enter into hedging transactions in the future to reduce our exposure to exchange rate fluctuations, but we may be unable to enter into hedging transactions successfully, on acceptable terms or at all. As of December 31, 2024, accumulated other comprehensive loss included a loss from foreign currency translation adjustments of approximately $25.5 million.\nWe do not believe we have material exposure to market risks associated with changes in interest rates related to cash equivalent securities held as of December 31, 2024. As of December 31, 2024, we had $4.7 billion of cash and cash equivalents. If there is an increase or decrease in interest rates, there will be a corresponding increase or decrease in the amount of interest earned on our cash and cash equivalents. We currently diversify our cash and cash equivalents holdings amongst multiple financial institutions and AAA-rated Government and Treasury Money Market Funds.\nWe are subject to interest rate market risk in connection with our revolving credit facility. On May 20, 2024, we entered into the 2024 Credit Agreement, which provides for variable rate borrowings of up to $1.1 billion. On July 1, 2020, we issued $1.0 billion aggregate principal amount of Senior Notes. Changes in interest rates would not have a material impact to our current interest and debt financing expense, as all of our borrowings except for our credit facility are fixed rate, and no amounts were outstanding under our credit facility as of December 31, 2024. See Note 11 of the Notes to the Consolidated Financial Statements included in Part IV of this Report for additional information regarding our 2024 Credit Agreement.\nWe had approximately $3.0 billion of goodwill and intangible assets as of December 31, 2024. As of December 31, 2024, we believe our intangible assets will be recoverable; however, changes in the economy, the business in which we operate and our own relative performance could change the assumptions used to evaluate intangible asset recoverability. In the event that we determine that an asset has been impaired, we would recognize an impairment charge equal to the amount by which the carrying amount of the assets exceeds the fair value of the asset. We continue to monitor these assumptions and their effect on the estimated recoverability of our intangible assets.\nItem 8.    Financial Statements and Supplementary Data\nFinancial Statements meeting the requirements of Regulation S-X, including reports of independent registered public accounting firm Ernst & Young LLP, are set forth beginning at page F-1. Supplementary data is set forth in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” under the caption “Consolidated Results of Operations.”\nItem 9.    Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A.    Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under the Exchange Act, as amended, is recorded, processed, summarized, and reported, within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow for timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nAs of December 31, 2024, we carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and our Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the fiscal year. Based on the foregoing, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of December 31, 2024 and were operating at a reasonable assurance level.\nWe continue to implement a financial system that is designed to improve the efficiency and effectiveness of our operational and financial accounting processes. This implementation is expected to be a multi-year project. Consistent with any process change that we implement, the design of the internal controls has and will continue to be evaluated for effectiveness as part of our overall assessment of the effectiveness of our disclosure controls and procedures. We expect that the implementation of this system will improve our internal control over financial reporting.\n48\nOther than the implementation of a new financial system noted above, there have been no changes in our internal control over financial reporting during our most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect our internal control over financial reporting.\nManagement’s Report on Internal Control over Financial Reporting\nManagement of CoStar Group is responsible for establishing and maintaining adequate internal control over financial reporting and for the assessment of the effectiveness of internal control over financial reporting. As defined by the SEC, internal control over financial reporting is a process designed by, or supervised by, the Company’s principal executive and principal financial officers, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with GAAP.\nThe Company’s internal control over financial reporting is supported by written policies and procedures, which (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Company’s assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the Company are being made only in accordance with authorizations of the Company’s management and directors; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nIn connection with the preparation of the Company's annual financial statements, management of the Company has undertaken an assessment of the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024 based on criteria established in Internal Control – Integrated Framework (2013 framework) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Management's assessment included an evaluation of the design of the Company's internal control over financial reporting and testing of the operational effectiveness of the Company's internal control over financial reporting.\nBased on this assessment, management has concluded that the Company's internal control over financial reporting was effective as of December 31, 2024.\nErnst & Young LLP, the independent registered public accounting firm that audited the Company's financial statements included in this report, has issued an attestation report on the effectiveness of internal control over financial reporting, a copy of which is included in this Report. \nIn November 2024, we completed the Visual Lease Acquisition. As permitted by the SEC, we have elected to exclude the internal controls of this acquisition, which has not been integrated into our existing processes and controls, from our assessment of the effectiveness of internal control over financial reporting as of December 31, 2024. The excluded financial position of Visual Lease represented less than 3% of our total assets as of December 31, 2024, and less than 1% of our revenues and total operating costs for the year then ended. We will include the internal controls of Visual Lease in our assessment of the effectiveness of our internal control over financial reporting as of December 31, 2025.\nItem 9B.    Other Information.\nInsider Trading Arrangements\nDuring the three months ended December 31, 2024, no director or officer of the Company \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement,” as each term is defined in Item 408 of Regulation S-K.\nItem 9C.    Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\n49\nPART III\nItem 10.    Directors, Executive Officers, and Corporate Governance\nCoStar Group has adopted a Code of Conduct for its directors. In addition, CoStar Group has adopted a separate Code of Business Conduct and Ethics for its officers and employees, including its principal executive, financial and accounting officers, or persons performing similar functions. Copies of each of these codes may be found in the “Investors” section of the Company’s website at https://investors.costargroup.com/leadership. We intend to disclose future amendments to certain provisions of our Codes, or waivers of such provisions granted to executive officers and directors, as required by the SEC rules on the Company's website within four business days following the date of such amendment or waiver.\nWe have adopted an Insider Trading Compliance Policy that governs the purchase, sale, and/or other dispositions of our securities by directors, officers and employees that is reasonably designed to promote compliance with insider trading laws, rules and regulations and NYSE listing standards. A copy of our Insider Trading Compliance Policy is filed as Exhibit 19.1 to this Report.\nThe remaining information required by this Item is incorporated by reference to our Proxy Statement for our 2025 annual meeting of stockholders under the captions “Director Nominees,” “Executive Officers,” Corporate Governance Highlights,” “Board Committees,” “\nInsider trading arrangements and policies\n,” and, if applicable, “Delinquent Section 16(a) Reports.”\nItem 11.    Executive Compensation\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2025 annual meeting of stockholders under the captions “Compensation Discussion and Analysis,” “Director Compensation,” “Compensation Committee Interlocks and Insider Participation,” and “Compensation Committee Report.”\nItem 12.    Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2025 annual meeting of stockholders under the captions “Equity Compensation Plan Information” and “Stock Ownership Information.”\nItem 13.    Certain Relationships and Related Transactions, and Director Independence\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2025 annual meeting of stockholders under the captions “Certain Relationships and Related Transactions” and “Corporate Governance Matters.”\nItem 14.    Principal Accountant Fees and Services\nThe information required by this Item is incorporated by reference to our Proxy Statement for our 2025 annual meeting of stockholders under the caption “Ratification of the Appointment of Independent Registered Public Accounting Firm.”\n50\nPART IV\nItem 15.    Exhibits and Financial Statement Schedules\n(a)(1) The following financial statements are filed as a part of this Report: CoStar Group, Inc. Consolidated Financial Statements.\n(a)(2) Financial statement schedules: Additional financial statement schedules are omitted because they are not applicable or not required or because the required information is incorporated herein by reference or included in the financial statements or related notes included elsewhere in this report.\n(a)(3) The documents required to be filed as exhibits to this Report under Item 601 of Regulation S-K are listed as follows:\nExhibits\nExhibit No.\nDescription\n \n \n#\n2.1 \nAgreement and Plan of Merger and Reorganization dated April 21, 2024, by and among CoStar Group, Inc., Matterport, Inc., Matrix Merger Sub, Inc. and Matrix Merger Sub II LLC (Incorporated by reference to Exhibit 2.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on April 22, 2024).\n3.1\nFourth Amended and Restated Certificate of Incorporation of CoStar Group, Inc. (Incorporated by reference to Exhibit 3.1 to the Registrant's Current Report on Form 8-K filed with the SEC on June 7, 2021).\n3.2\nFourth Amended and Restated By-Laws of CoStar Group, Inc. (Incorporated by reference to Exhibit 3.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on May 9, 2022).\n4.1\nSpecimen Common Stock Certificate (Incorporated by reference to Exhibit 4.1 to the Registration Statement on Form S-4 of the Registrant (Reg. No. 333-174214) filed with the SEC on June 3, 2011).\n4.2\nDescription of the Registrant's Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (Incorporated by reference to Exhibit 4.2 to the Registrant's Annual Report on Form 10-K filed with the SEC on February 23, 2022).\n4.3\nIndenture, dated as of July 1, 2020, by and among CoStar Group, Inc., as issuer, the guarantors named therein and Wilmington Trust, National Association, as trustee, relating to the 2.800% Senior Notes due 2030, including the form of 2.800% Senior Notes due 2030 (Incorporated by reference to Exhibit 4.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on July 1, 2020).\n*\n10.1\nCoStar Group, Inc. 2016 Stock Incentive Plan (Incorporated by reference to Exhibit 4.4 to the Registration Statement on Form S-8 of the Registrant (Reg. No. 333-212278) filed with the SEC on June 28, 2016).\n*\n10.2\nFirst Amendment to the CoStar Group, Inc. 2016 Stock Incentive Plan (Incorporated by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q filed April 25, 2018). \n*\n10.3\nCoStar Group, Inc. 2007 Stock Incentive Plan, as amended (Incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed June 8, 2012).\n*\n10.4\nCoStar Group, Inc. 2007 Stock Incentive Plan French Sub-Plan (Incorporated by reference to Exhibit 10.3 to the Registrant’s Report on Form 10-K filed February 29, 2008).\n*\n10.5\nForm of CoStar Group, Inc. 2016 Plan Restricted Stock Grant Agreement between the Registrant and certain of its officers, directors and employees (Incorporated by reference to Exhibit 10.3 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*\n10.6\nForm of CoStar Group, Inc. 2016 Plan Restricted Stock Grant Agreement for Service Awards between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.4 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*\n10.7\nForm of CoStar Group, Inc. 2016 Plan Restricted Stock Unit Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.5 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*\n10.8\nForm of CoStar Group, Inc. 2016 Plan Incentive Stock Option Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.6 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n51\nExhibit No.\nDescription\n*\n10.9\nForm of CoStar Group, Inc. 2016 Plan Incentive Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.7 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*\n10.10\nForm of CoStar Group, Inc. 2016 Plan Nonqualified Stock Option Grant Agreement between the Registrant and certain of its officers, directors and employees (Incorporated by reference to Exhibit 10.8 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*\n10.11\nForm of CoStar Group, Inc. 2016 Plan Nonqualified Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.9 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*\n10.12\nForm of 2007 Plan Restricted Stock Grant Agreement between the Registrant and certain of its officers, directors and employees (Incorporated by reference to Exhibit 99.1 to the Registrant’s Current Report on Form 8-K filed June 22, 2007).\n*\n10.13\nForm of 2007 Plan Restricted Stock Unit Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.8 to the Registrant's Annual Report on Form 10-K filed February 20, 2014).\n*\n10.14\nForm of 2007 Plan Incentive Stock Option Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.8 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n*\n10.15\nForm of 2007 Plan Incentive Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.9 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n*\n10.16\nForm of 2007 Plan Nonqualified Stock Option Grant Agreement between the Registrant and certain of its officers and employees (Incorporated by reference to Exhibit 10.10 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n*\n10.17\nForm of 2007 Plan Nonqualified Stock Option Grant Agreement between the Registrant and certain of its directors (Incorporated by reference to Exhibit 10.11 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n*\n10.18\nForm of 2007 Plan Nonqualified Stock Option Grant Agreement between the Registrant and Andrew C. Florance (Incorporated by reference to Exhibit 10.12 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n*\n10.19\nForm of 2007 Plan French Sub-Plan Restricted Stock Agreement between the Registrant and certain of its employees (Incorporated by reference to Exhibit 10.10 to the Registrant’s Annual Report on Form 10-K filed February 29, 2008).\n*\n10.20\nCoStar Group, Inc. 2016 Cash Incentive Plan (Incorporated by reference to Exhibit 10.2 to the Registrant’s Quarterly Report on Form 10-Q filed July 28, 2016).\n*\n10.21\nSecond Amended and Restated Employee Stock Purchase Plan (Incorporated by reference to Exhibit 4.4 to the Registrant’s Registration Statement on Form S-8 ( Reg. No. 333-258220) filed with the SEC on July 28, 2021).\n*\n10.22\nCanadian Addendum to CoStar Group ESPP (filed herewith).\n*\n10.23\nCoStar Group, Inc. Management Stock Purchase Plan (Incorporated by reference to Exhibit 10.21 to the Registrant’s Annual Report on Form 10-K filed February 23, 2018).\n*\n10.24\nSummary of Non-Employee Director Compensation (Incorporated by reference to Exhibit 10.1 to the Registrant's Quarterly Report on Form 10-Q filed on October 24, 2013).\n*\n10.25\nEmployment Agreement for Andrew C. Florance (Incorporated by reference to Exhibit 10.2 to Amendment No. 1 to the Registrant's Registration Statement on Form S-1 (Reg. No. 333-47953) filed with the SEC on April 27, 1998).\n*\n10.26\nFirst Amendment to Andrew C. Florance Employment Agreement, effective January 1, 2009 (Incorporated by reference to Exhibit 10.16 to the Registrant’s Annual Report on Form 10-K filed February 24, 2009).\n10.27\nForm of Indemnification Agreement between the Registrant and each of its officers and directors (Incorporated by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q filed on May 7, 2004).\n10.28\nDeed of Office Lease by and between GLL L-Street 1331, LLC and CoStar Realty Information, Inc., dated February 18, 2011, and made effective as of June 1, 2010 (Incorporated by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on form 10-Q filed on April 29, 2011).\n52\nExhibit No.\nDescription\n#\n10.29\nCredit Agreement, dated as of May 24, 2024, by and among CoStar Group, Inc., as borrower, the lenders party thereto and Bank of America, N.A., as administrative agent (Incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on May 31, 2024).\n19.1\nCoStar Group, Inc. Insider Trading Compliance Policy (filed herewith).\n21.1\nSubsidiaries of the Registrant (filed herewith).\n23.1\nConsent of Ernst & Young LLP, Independent Registered Public Accounting Firm (filed herewith).\n31.1\nCertification of Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith).\n31.2\nCertification of Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith).\n32.1\nCertification of Principal Executive Officer pursuant to 18 U.S.C. Sec. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (furnished herewith).\n32.2\nCertification of Principal Financial Officer pursuant to 18 U.S.C. Sec. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (furnished herewith).\n97.1\nCoStar Group, Inc. Policy for Recovery of Erroneously Awarded Compensation (Incorporated by reference to Exhibit 97 to the Registrant's Annual Report on Form 10-K filed February 22, 2024).\n101.INS\nThe following financial statements from the Company’s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL: (i) Consolidated Statements of Operations; (ii) Consolidated Statements of Comprehensive Income; (iii) Consolidated Balance Sheets; (iv) Consolidated Statements of Cash Flows; and (v) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\n104\nThe cover page from the Registrant's Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL (included as Exhibit 101).\n* Management Contract or Compensatory Plan or Arrangement.\n# Schedules and exhibits (or similar attachments) have been omitted from this exhibit pursuant to Item 601(a)(5) of Regulation S-K. The Company will furnish copies of the such schedules (or similar attachments) to the SEC upon request.\nItem 16.    Form 10-K Summary\nNone.\n53\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \n \nCOSTAR GROUP, INC.\n \n \n \nBy:\n/s/ Andrew C. Florance\nFebruary 19, 2025\n \nAndrew C. Florance\n \nPresident and Chief Executive Officer\nKNOW ALL PERSONS BY THESE PRESENTS, that each individual whose signature appears below constitutes and appoints Andrew C. Florance and Christian M. Lown, and each of them individually, as their true and lawful attorneys-in-fact and agents, with full power of substitution, for him and in his name, place and stead, in any and all capacities, to sign any and all amendments to this report, and to file the same, with all exhibits thereto and to all documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in connection therewith, as fully to all intents and purposes as he might or could do in person, herein by ratifying and confirming all that said attorneys-in-fact and agents or any of them, or his or their substitute or substitutes, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Act of 1934, as amended, this report has been signed by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n54\nSignature\nCapacity\nDate\n \n \n \n \n \n \n/s/ Michael R. Klein\nChairman of the Board\nFebruary 19, 2025\nMichael R. Klein\n \n \n \n \n \n/s/ Andrew C. Florance\nChief Executive Officer and\nFebruary 19, 2025\nAndrew C. Florance\nPresident and a Director\n \n \n(Principal Executive Officer)\n \n \n \n \n/s/ Christian M. Lown\nChief Financial Officer\nFebruary 19, 2025\nChristian M. Lown\n(Principal Financial Officer)\n \n \n \n \n/s/ Cynthia C. Cann\nChief Accounting Officer\nFebruary 19, 2025\nCynthia C. Cann\n(Principal Accounting Officer)\n/s/ Angelique G. Brunner\nDirector\nFebruary 19, 2025\nAngelique G. Brunner\n/s/ John W. Hill\nDirector\nFebruary 19, 2025\nJohn W. Hill\n \n \n/s/ Laura Cox Kaplan\nDirector\nFebruary 19, 2025\nLaura Cox Kaplan\n \n \n \n \n/s/ Robert W. Musslewhite\nDirector\nFebruary 19, 2025\nRobert W. Musslewhite\n \n/s/ Christopher J. Nassetta\nDirector\nFebruary 19, 2025\nChristopher J. Nassetta\n \n/s/ Louise S. Sams\nDirector\nFebruary 19, 2025\nLouise S. Sams\n \n55\nCOSTAR GROUP, INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReports of Independent Registered Public Accounting Firm (PCAOB ID Number \n42\n)\nF-\n2\nConsolidated Statements of Operations\nF-\n6\nConsolidated Statements of Comprehensive Income\nF-\n7\nConsolidated Balance Sheets \nF-\n8\nConsolidated Statements of Changes in Stockholders’ Equity\nF-\n9\nConsolidated Statements of Cash Flows \nF-\n10\nNotes to Consolidated Financial Statements\nF-\n12\nF-1\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors of CoStar Group, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of CoStar Group, Inc. (the Company) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income, changes in stockholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 19, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n Critical Audit Matter \nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nF-2\nHighly Automated Revenue Systems related to Subscription Revenue \nDescription of the Matter\nAs described in Note 2 to the consolidated financial statements, the Company derives revenues primarily by (i) providing access to its proprietary database of commercial real estate information and (ii) providing online marketplaces for professional property management companies, property owners, real estate agents and brokers and landlords, in each case, typically through a fixed fee for its subscription-based services. Revenues from subscription-based contracts are approximately 96% of total revenues for the current year and are recognized on a straight-line basis over the term of the agreement. The Company’s revenue recognition process involves several applications responsible for the initiation, processing, and recording of transactions. These applications interface with the Company’s enterprise resource planning system through automated and manual journal entries to accurately reflect revenue.\nThe process to calculate, aggregate, and record revenue relies on multiple internally developed and external software programs and systems and involves interfacing significant volumes of data across the systems. Auditing the Company's accounting for revenue from subscription-based contracts was challenging and complex due to the high volume of individually-low-monetary-value transactions, dependency on the effective design and operation of multiple applications, some of which are specifically designed for the Company's business, and the use of multiple data sources in the revenue recognition process. Given the complexity of the information technology (IT) environment, the required involvement of professionals with expertise in IT to identify, test, and evaluate the revenue data flows, systems, and automated controls, we considered the audit of the Company’s subscription revenue-generating transactions to be a critical audit matter.\nHow We Addressed the Matter in Our Audit\nWe performed procedures related to the Company’s internal controls that included, among others, obtaining an understanding, evaluating the design, and testing the operating effectiveness of internal controls over the Company’s accounting for subscription revenue. We tested the controls over the initiation and billing of new and recurring subscriptions, the provisioning of customers, and the Company’s cash to billings reconciliation process. We tested the controls related to the key application interfaces between the provisioning, billing, and accounting systems and tested IT general controls related to access to the relevant applications and data, and changes made to the relevant systems, configurations and interfaces.\nWe performed substantive audit procedures that included, among others, testing the Company’s accounting for revenue from contracts with customers, by testing, on a sample basis, the completeness and accuracy of the underlying data within the Company’s billing system. We performed data analytics by extracting data from the general ledger to evaluate the completeness and accuracy of recorded revenue and deferred revenue amounts, tracing a sample of sales transactions to source data, and testing a sample of cash to billings reconciliations.\n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 1994.\nTysons, Virginia\nFebruary 19, 2025\nF-3\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors of CoStar Group, Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited CoStar Group, Inc.’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, CoStar Group, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nAs indicated in the accompanying Management’s Report on Internal Control over Financial Reporting, management’s assessment of and conclusion on the effectiveness of internal control over financial reporting did not include the internal controls of Visual Lease LLC, which is included in the 2024 consolidated financial statements of the Company and constituted less than 3% and 3% of total and net assets, respectively, as of December 31, 2024, and less than 1% and less than 1% of revenues and net income, respectively, for the year then ended. Our audit of internal control over financial reporting of the Company also did not include an evaluation of the internal control over financial reporting of Visual Lease, LLC.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income, changes in stockholders' equity and cash flows for each of the three years in the period ended December 31, 2024 and the related notes and our report dated February 19, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nF-4\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ \nErnst & Young LLP\nTysons, Virginia\nFebruary 19, 2025\nF-5\nCOSTAR GROUP, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in millions, except per share data)\nYear Ended December 31,\n2024\n2023\n2022\nRevenues\n$\n2,736.2\n \n$\n2,455.0\n \n$\n2,182.4\n \nCost of revenues\n558.5\n \n491.5\n \n414.0\n \nGross profit\n2,177.7\n \n1,963.5\n \n1,768.4\n \nOperating expenses:\nSelling and marketing (excluding customer base amortization)\n1,364.3\n \n989.9\n \n684.2\n \nSoftware development\n325.3\n \n267.6\n \n220.9\n \nGeneral and administrative\n439.1\n \n381.5\n \n338.7\n \nCustomer base amortization\n44.3\n \n42.2\n \n73.6\n \n \n2,173.0\n \n1,681.2\n \n1,317.4\n \nIncome from operations\n4.7\n \n282.3\n \n451.0\n \nInterest income, net\n212.5\n \n213.6\n \n32.1\n \nOther (expense) income, net\n(\n7.1\n)\n5.4\n \n3.4\n \nIncome before income taxes\n210.1\n \n501.3\n \n486.5\n \nIncome tax expense\n71.4\n \n126.6\n \n117.0\n \nNet income\n$\n138.7\n \n$\n374.7\n \n$\n369.5\n \nNet income per share — basic\n$\n0.34\n \n$\n0.92\n \n$\n0.93\n \nNet income per share — diluted\n$\n0.34\n \n$\n0.92\n \n$\n0.93\n \nWeighted-average outstanding shares — basic\n406.3\n \n405.3\n \n396.3\n \nWeighted-average outstanding shares — diluted\n407.8\n \n406.9\n \n397.8\n \nSee accompanying notes.\nF-6\nCOSTAR GROUP, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions)\nYear Ended December 31,\n2024\n2023\n2022\nNet income\n$\n138.7\n \n$\n374.7\n \n$\n369.5\n \nOther comprehensive (loss) income, net of tax\nForeign currency translation adjustment\n(\n7.9\n)\n11.5\n \n(\n23.3\n)\nTotal other comprehensive (loss) income, net of tax\n(\n7.9\n)\n11.5\n \n(\n23.3\n)\nTotal comprehensive income\n$\n130.8\n \n$\n386.2\n \n$\n346.2\n \nSee accompanying notes.\nF-7\nCOSTAR GROUP, INC.\nCONSOLIDATED BALANCE SHEETS\n(in millions, except per share data)\n \nDecember 31,\n \n2024\n2023\nASSETS\n \n \nCurrent assets:\n \n \nCash and cash equivalents\n$\n4,681.0\n \n$\n5,215.9\n \nAccounts receivable\n210.7\n \n213.2\n \nLess: Allowance for credit losses\n(\n22.8\n)\n(\n23.2\n)\nAccounts receivable, net\n187.9\n \n190.0\n \nPrepaid expenses and other current assets\n81.3\n \n70.2\n \nTotal current assets\n4,950.2\n \n5,476.1\n \nDeferred income taxes, net\n30.6\n \n4.3\n \nProperty and equipment, net\n1,014.9\n \n472.2\n \nLease right-of-use assets\n103.0\n \n79.8\n \nGoodwill\n2,527.6\n \n2,386.2\n \nIntangible assets, net\n433.2\n \n313.7\n \nDeferred commission costs, net\n169.6\n \n167.7\n \nDeposits and other assets\n27.7\n \n19.7\n \nTotal assets\n$\n9,256.8\n \n$\n8,919.7\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\n \n \nCurrent liabilities:\n \n \nAccounts payable\n$\n47.0\n \n$\n23.1\n \nAccrued wages and commissions\n133.3\n \n117.8\n \nAccrued expenses and other current liabilities\n179.7\n \n163.0\n \nIncome taxes payable\n23.2\n \n7.7\n \nLease liabilities\n32.0\n \n40.0\n \nDeferred revenue\n137.1\n \n104.2\n \nTotal current liabilities\n552.3\n \n455.8\n \nLong-term debt, net\n991.9\n \n990.5\n \nDeferred income taxes, net\n7.6\n \n36.7\n \nIncome taxes payable\n25.0\n \n18.2\n \nLease and other long-term liabilities\n126.5\n \n79.9\n \nTotal liabilities\n1,703.3\n \n1,581.1\n \nStockholders’ equity:\n \n \nPreferred stock, $\n0.01\n par value; \n2\n million shares authorized; \nzero\n outstanding\n—\n \n—\n \nCommon stock, $\n0.01\n par value; \n1.2\n billion shares authorized; \n409.5\n million and \n408.1\n million issued and outstanding as of December 31, 2024 and 2023, respectively\n4.1\n \n4.1\n \nAdditional paid-in capital\n5,231.9\n \n5,147.8\n \nAccumulated other comprehensive loss\n(\n25.5\n)\n(\n17.6\n)\nRetained earnings\n2,343.0\n \n2,204.3\n \nTotal stockholders’ equity\n7,553.5\n \n7,338.6\n \nTotal liabilities and stockholders’ equity\n$\n9,256.8\n \n$\n8,919.7\n \n \nSee accompanying notes.\nF-8\nCOSTAR GROUP, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS’ EQUITY\n(in millions)\n \nCommon Stock\nAdditional\nPaid-In Capital\nAccumulated\nOther\nComprehensive Loss\nRetained\nEarnings\nTotal\nStockholders’\nEquity\n \nShares\nAmount\nBalance at January 1, 2022\n395.0\n \n$\n3.9\n \n$\n4,253.3\n \n$\n(\n5.8\n)\n$\n1,460.1\n \n$\n5,711.5\n \nNet income\n— \n— \n— \n— \n369.5\n \n369.5\n \nOther comprehensive loss\n— \n— \n— \n(\n23.3\n)\n— \n(\n23.3\n)\nRestricted stock issued\n1.5\n \n0.1\n \n— \n— \n— \n0.1\n \nRestricted stock grants surrendered\n(\n0.7\n)\n— \n(\n23.1\n)\n— \n— \n(\n23.1\n)\nStock-based compensation expense\n— \n— \n74.6\n \n— \n— \n74.6\n \nEmployee stock purchase plan\n0.2\n \n— \n15.0\n \n— \n— \n15.0\n \nStock issued for equity offerings, net of transaction costs\n10.7\n \n0.1\n \n745.6\n \n— \n— \n745.7\n \nBalance at December 31, 2022\n406.7\n \n4.1\n \n5,065.4\n \n(\n29.1\n)\n1,829.6\n \n6,870.0\n \nNet income\n— \n— \n— \n— \n374.7\n \n374.7\n \nOther comprehensive income\n— \n— \n— \n11.5\n \n— \n11.5\n \nExercise of stock options\n0.4\n \n— \n7.5\n \n— \n— \n7.5\n \nRestricted stock issued\n1.4\n \n— \n— \n— \n— \n— \nRestricted stock grants surrendered\n(\n0.7\n)\n— \n(\n23.2\n)\n— \n— \n(\n23.2\n)\nStock-based compensation expense\n— \n— \n83.6\n \n— \n— \n83.6\n \nManagement stock purchase plan\n0.1\n \n— \n(\n3.2\n)\n— \n— \n(\n3.2\n)\nEmployee stock purchase plan\n0.2\n \n— \n17.7\n \n— \n— \n17.7\n \nBalance at December 31, 2023\n408.1\n \n4.1\n \n5,147.8\n \n(\n17.6\n)\n2,204.3\n \n7,338.6\n \nNet income\n— \n— \n— \n— \n138.7\n \n138.7\n \nOther comprehensive loss\n— \n— \n— \n(\n7.9\n)\n— \n(\n7.9\n)\nExercise of stock options\n0.1\n \n— \n7.1\n \n— \n— \n7.1\n \nRestricted stock issued\n1.7\n \n— \n— \n— \n— \n— \nRestricted stock grants surrendered\n(\n0.7\n)\n— \n(\n27.8\n)\n— \n— \n(\n27.8\n)\nStock-based compensation expense\n— \n— \n87.1\n \n— \n— \n87.1\n \nManagement stock purchase plan\n0.1\n \n— \n(\n1.7\n)\n— \n— \n(\n1.7\n)\nEmployee stock purchase plan\n0.2\n \n— \n19.4\n \n— \n— \n19.4\n \nBalance at December 31, 2024\n409.5\n \n$\n4.1\n \n$\n5,231.9\n \n$\n(\n25.5\n)\n$\n2,343.0\n \n$\n7,553.5\n \nSee accompanying notes.\nF-9\nCOSTAR GROUP, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions)\nYear Ended December 31,\n \n2024\n2023\n2022\nOperating activities:\n \n \n \nNet income\n$\n138.7\n \n$\n374.7\n \n$\n369.5\n \nAdjustments to reconcile net income to net cash provided by operating activities:\n \nDepreciation and amortization\n146.9\n \n107.5\n \n137.9\n \nAmortization of deferred commissions costs\n116.7\n \n95.2\n \n76.1\n \nAmortization of Senior Notes discount and issuance costs\n2.8\n \n2.4\n \n2.4\n \nNon-cash lease expense\n32.7\n \n30.0\n \n38.5\n \nStock-based compensation expense\n89.0\n \n85.0\n \n75.2\n \nDeferred income taxes, net\n(\n50.1\n)\n(\n37.2\n)\n(\n31.2\n)\nCredit loss expense\n36.4\n \n35.0\n \n18.3\n \nOther operating activities, net\n(\n1.3\n)\n(\n3.2\n)\n(\n2.4\n)\nChanges in operating assets and liabilities, net of acquisitions:\n \nAccounts receivable\n(\n30.2\n)\n(\n66.6\n)\n(\n46.4\n)\nPrepaid expenses and other current assets\n(\n7.4\n)\n(\n16.2\n)\n(\n17.9\n)\nDeferred commissions\n(\n120.2\n)\n(\n120.2\n)\n(\n116.8\n)\nAccounts payable and other liabilities\n43.5\n \n33.9\n \n23.2\n \nLease liabilities\n(\n38.0\n)\n(\n39.2\n)\n(\n37.4\n)\nIncome taxes payable, net\n22.4\n \n10.7\n \n(\n19.3\n)\nDeferred revenue\n11.2\n \n(\n1.3\n)\n6.8\n \nOther assets\n(\n0.5\n)\n(\n1.0\n)\n2.2\n \nNet cash provided by operating activities\n392.6\n \n489.5\n \n478.7\n \nInvesting activities:\n \n \nProceeds from sale and settlement of investments\n—\n \n3.8\n \n0.9\n \nProceeds from sale of property and equipment and other assets\n1.7\n \n—\n \n30.1\n \nPurchases of property, equipment, and other assets for new campuses\n(\n579.0\n)\n(\n117.5\n)\n(\n35.2\n)\nPurchases of property, equipment, and other assets\n(\n58.9\n)\n(\n25.3\n)\n(\n58.6\n)\nCash paid for acquisitions, net of cash acquired\n(\n276.7\n)\n(\n99.6\n)\n(\n6.3\n)\nNet cash (used in) investing activities\n(\n912.9\n)\n(\n238.6\n)\n(\n69.1\n)\nFinancing activities:\n \n \nPayments of long-term debt assumed in acquisition\n—\n \n—\n \n(\n2.2\n)\nRepurchase of restricted stock to satisfy tax withholding obligations\n(\n29.5\n)\n(\n26.4\n)\n(\n23.0\n)\nProceeds from equity offering, net of transaction costs\n—\n \n—\n \n745.7\n \nProceeds from exercise of stock options and employee stock purchase plan\n24.5\n \n23.4\n \n13.5\n \nPayments of debt issuance costs\n(\n3.6\n)\n—\n \n—\n \nPrincipal repayments of finance lease obligations\n(\n5.1\n)\n(\n0.7\n)\n—\n \nNet cash (used in) provided by financing activities\n(\n13.7\n)\n(\n3.7\n)\n734.0\n \nEffect of foreign currency exchange rates on cash and cash equivalents\n(\n0.9\n)\n0.7\n \n(\n2.7\n)\nNet (decrease) increase in cash and cash equivalents\n(\n534.9\n)\n247.9\n \n1,140.9\n \nCash and cash equivalents at beginning of year\n5,215.9\n \n4,968.0\n \n3,827.1\n \nCash and cash equivalents at end of year\n$\n4,681.0\n \n$\n5,215.9\n \n$\n4,968.0\n \nF-10\nCOSTAR GROUP, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions)\nYear Ended December 31,\n \n2024\n2023\n2022\nSupplemental cash flow disclosures:\nInterest paid\n$\n31.0\n \n$\n30.7\n \n$\n29.9\n \nIncome taxes paid\n$\n99.8\n \n$\n163.2\n \n$\n169.2\n \nSupplemental non-cash investing and financing activities:\nConsideration owed for acquisitions\n$\n1.2\n \n$\n7.6\n \n$\n—\n \nAccrued capital expenditures and non-cash landlord incentives\n$\n63.7\n \n$\n28.9\n \n$\n14.7\n \nSee accompanying notes.\nF-11\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.\nORGANIZATION \nCoStar Group (the “Company”) is a leading global provider of commercial and residential real estate information, analytics, and online marketplaces. We have created and compiled a standardized platform of online marketplace services, information, and analytics where industry professionals, consumers of real estate, and the related business communities can continuously interact and facilitate transactions by efficiently accessing and exchanging accurate and standardized real estate-related information. Our service offerings span all property types, including office, residential, retail, industrial, multifamily, land, mixed-use, and hospitality. The Company's services are typically distributed to its customers under subscription-based agreements that typically renew automatically, and have a minimum term of \none year\n. The Company operates within \ntwo\n operating segments, North America, which includes the U.S. and Canada, and International, which primarily includes Europe, Asia-Pacific, and Latin America. \nThe Company acquired Business Immo, OnTheMarket, and Visual Lease in April 2022, December 2023, and November 2024, respectively. See Note 5 for further discussion of these acquisitions.\n2.\nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n \nBasis of Presentation\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries. All intercompany balances and transactions have been eliminated in consolidation. Accounting policies are consistent for each operating segment.\nReclassifications\nCertain prior year amounts in the property and equipment summary in Note 8 have been reclassified to conform to the current year presentation. The reclassifications did not affect the consolidated balances sheets, consolidated statements of operations, or other consolidated financial statements for the years ended December 31, 2023 and 2022.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. On an ongoing basis, the Company evaluates its estimates and assumptions, including those related to revenue recognition, allowance for credit losses, the useful lives and recoverability of long-lived and intangible assets, goodwill impairment assessment, income taxes, accounting for business combinations, stock-based compensation, estimating the Company's incremental borrowing rate for its leases, and contingencies, among others. The Company bases these estimates on historical and anticipated results, trends, and various other assumptions that it believes are reasonable, including assumptions as to future events. These estimates form the basis for making judgments about the carrying values of assets and liabilities and recorded revenues and expenses. Actual results could differ from these estimates.\n \nRevenue Recognition\nThe Company derives revenues primarily by (i) providing access to its proprietary database of commercial real estate information, including benchmarking and analytics for the hospitality industry, and analytics for lenders (ii) providing online marketplaces for professional property management companies, property owners, real estate agents and brokers, and landlords, in each case, typically through a fixed monthly fee for its subscription-based advertising services. Other subscription-based services include (i) real estate and lease management solutions to commercial customers and real estate investors and (ii) access to applications to manage workflow for residential real estate agents. \nSubscription contract rates are generally based on the number of sites, number of users, organization size, the customer’s business focus, geography, the number of properties reported on or analyzed, the number and types of services to which a customer subscribes, the number of properties a customer advertises, the number of transactions and average transaction size a broker or agent has closed, and the prominence and placement of a customer's advertised properties in the search results. The Company’s subscription-based license or membership agreements typically renew automatically, and a majority have a term of at least \none year\n. Revenue from our subscription-based contracts was approximately \n96\n%, \n95\n%, and \n93\n% of total revenue for the years ended December 31, 2024, 2023, and 2022, respectively.\nF-12\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe Company also derives revenues from transaction-based services including: (i) an online auction platform for commercial real estate through Ten-X, (ii) providing online tenant applications, including background and credit checks, and rental payment processing, and (iii) ancillary products and services that are sold on an ad hoc basis.\nThe Company analyzes contracts to determine the appropriate revenue recognition using the following steps: (i) identification of contracts with customers, (ii) identification of distinct performance obligations in the contract, (iii) determination of contract transaction price, (iv) allocation of contract transaction price to the performance obligations, and (v) determination of revenue recognition based on timing of satisfaction of the performance obligations.\nThe Company recognizes revenues upon the satisfaction of its performance obligation(s) (upon transfer of control of promised services to its customers) in an amount that reflects the consideration to which it expects to be entitled to in exchange for those services. Revenues from subscription-based services are recognized on a straight-line basis over the term of the agreement. Revenues from transaction-based services are recognized when the promised product or services are delivered, which, in the case of Ten-X auctions, is at the time of a successful closing for the sale of the property.\nIn limited circumstances, the Company's contracts with customers include promises to transfer multiple services, such as contracts for its subscription-based services and professional services. For these contracts, the Company accounts for individual performance obligations separately if they are distinct, which involves the determination of the standalone selling price for each distinct performance obligation.\nDeferred revenue results from amounts billed in advance to customers or cash received from customers in advance of the Company's fulfillment of its performance obligation(s) and is recognized as those obligations are satisfied.\nContract assets represent a conditional right to consideration for satisfied performance obligations that become a receivable when the conditions are satisfied. Contract assets are generated when contractual billing schedules differ from revenue recognition timing.\nCertain sales commissions are considered incremental and recoverable costs of obtaining a contract with a customer. Sales commissions incurred for obtaining new contracts are deferred and then amortized as selling and marketing expenses on a straight-line basis over a period of benefit that the Company has determined to be \nthree years\n. The \nthree-year\n amortization period was determined based on several factors, including the nature of the technology and proprietary data underlying the services being purchased, customer contract renewal rates, and industry competition. Sales commissions that do not represent incremental costs of obtaining a contract, or that would otherwise be amortized over a period of one year or less, are not subject to capitalization.\n \nSee Note 3 for further discussion of the Company's revenue recognition.\nCost of Revenues\nCost of revenues principally consists of salaries, benefits, bonuses, stock-based compensation expenses, and other indirect costs for the Company's researchers who collect and analyze the real estate data that is the basis for the Company's online marketplaces, information, and analytics, and for employees that support these products. Additionally, cost of revenues includes the cost of data from third-party data sources, product hosting costs, and costs related to advertising purchased on behalf of customers, credit card and other transaction fees relating to processing customer transactions, which are expensed as incurred, and the amortization of acquired trade names, technology, and certain other intangible assets.\nForeign Currency Translation\nThe Company’s reporting currency is the U.S. dollar. The functional currency for the majority of its operations is the local currency, with the exception of certain international locations for which the functional currency is the British Pound. Assets and liabilities denominated in a foreign currency are translated into U.S. dollars using the exchange rates in effect as of the balance sheet date. Gains and losses resulting from translation are included in accumulated other comprehensive loss. Currency gains and losses on the translation of intercompany loans made to foreign subsidiaries that are of a long-term investment nature are also included in accumulated other comprehensive loss. Gains and losses resulting from transactions denominated in a currency other than the functional currency of the entity are included in other (expense) income, net in the consolidated statements of operations using the average exchange rates in effect during the period.\n The Company recognized a net foreign currency loss of $\n0.7\n million, a net foreign currency gain of $\n3.0\n million, and a net foreign currency gain of $\n1.4\n million for the years ended December 31, 2024, 2023, and 2022, respectively, which are included in other (expense) income, net on the consolidated statements of operations.\nF-13\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAccumulated Other Comprehensive Loss\nThe components of accumulated other comprehensive loss, net of tax, were as follows (in millions):\n \nAs of December 31,\n \n2024\n2023\nForeign currency translation loss\n$\n(\n25.5\n)\n$\n(\n17.6\n)\nTotal accumulated other comprehensive loss\n$\n(\n25.5\n)\n$\n(\n17.6\n)\nThere were \nno\n amounts reclassified out of accumulated other comprehensive loss to the consolidated statements of operations for both the years ended December 31, 2024 and 2023.\nAdvertising Costs\nThe Company expenses advertising costs as incurred. Advertising costs include digital marketing, television, radio, print, and other media advertising.\n Advertising costs were $\n845.2\n million, $\n549.6\n million and $\n305.7\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nIncome Taxes\nDeferred income taxes result from temporary differences between the tax basis of assets and liabilities and the basis reported in the Company’s consolidated financial statements. Deferred tax liabilities and assets are determined based on the difference between the financial statement and the tax basis of assets and liabilities using enacted rates in effect during the year in which the Company expects differences to reverse. Valuation allowances are provided against assets, including net operating losses, if the Company determines it is more likely than not that some portion or all of an asset may not be realized. Interest and penalties related to income tax matters are recognized in income tax expense. \nThe Company has elected to record the GILTI under the current-period cost method.\nSee Note 12 for further discussion of the Company's income taxes.\nNet Income Per Share\nNet income per share is computed by dividing net income by the weighted-average number of common shares outstanding during the period on a basic and diluted basis. The Company's potentially dilutive securities include outstanding stock options, unvested stock-based awards, which include restricted stock awards that vest over a specific service period, restricted stock awards with a performance and market condition, restricted stock units, and Matching RSUs awarded under the MSPP. Shares underlying unvested restricted stock awards that vest based on a performance and market condition that have not been achieved as of the end of the period are not included in the computation of basic or diluted earnings per share. Diluted net income per share considers the impact of potentially dilutive securities except when the inclusion of the potentially dilutive securities would have an anti-dilutive effect.\n \nSee Note 16 for further discussion of the Company's calculation of net income per share.\nStock-Based Compensation\nEquity instruments issued in exchange for services performed by officers, employees, and directors of the Company are accounted for using a fair-value based method and the fair value of such equity instruments is recognized as expense in the consolidated statements of operations.\nF-14\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor stock-based awards that vest over a specific service period, compensation expense is measured based on the fair value of the awards at the grant date and is recognized on a straight-line basis over the service period of the awards, net of an estimated forfeiture rate. For equity instruments that vest based on achievement of both a performance and market condition, stock-based compensation expense is recognized over the service period of the awards based on the expected achievement of the related performance conditions at the end of each reporting period. If the Company's initial estimates of the achievement of the performance conditions change, the related stock-based compensation expense may fluctuate from period to period based on those estimates. If the performance conditions are not met, no stock-based compensation expense will be recognized and any previously recognized stock-based compensation expense will be reversed. For awards with both a performance and a market condition, the Company estimates the fair value of each equity instrument granted on the date of grant using a Monte-Carlo simulation model. This pricing model uses multiple simulations to evaluate the probability of achieving the market condition to calculate the fair value of the awards which includes the recent market price and volatility of the Company's shares. When determining the grant date fair value of all stock-based awards, the Company considers whether it is in possession of any material, non-public information that upon its release would have a material effect on its share price, and if so, whether the observable share price or expected volatility assumptions used in determining the fair value of the awards should be adjusted.\nStock-based compensation expense for stock options, restricted stock awards, and restricted stock units issued under equity incentive plans, stock purchases under the ESPP, DSUs, and Matching RSUs awarded under the MSPP included in the Company’s consolidated statements of operations were as follows (in millions):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nCost of revenues\n$\n14.5\n \n$\n14.3\n \n$\n12.6\n \nSelling and marketing (excluding customer base amortization) \n11.2\n \n9.1\n \n7.8\n \nSoftware development\n21.8\n \n17.5\n \n13.0\n \nGeneral and administrative\n41.5\n \n44.1\n \n41.8\n \nTotal stock-based compensation expense\n$\n89.0\n \n$\n85.0\n \n$\n75.2\n \nCash and Cash Equivalents\nThe Company considers all highly liquid investments purchased with an original maturity of three months or less to be cash equivalents.\n Cash and cash equivalents were $\n4.7\n billion and $\n5.2\n billion as of December 31, 2024 and 2023, respectively. The Company had \nno\n restricted cash as of December 31, 2024 and 2023.\nConcentration of Credit Risk and Financial Instruments\nThe Company’s customer base creates a lack of dependence on any individual customer that mitigates the risk of nonpayment of the Company’s accounts receivable. No single customer accounted for more than 5% of the Company’s revenues for each of the years ended December 31, 2024, 2023, and 2022. The carrying amount of the accounts receivable approximates the net realizable value. \nThe Company holds cash at major financial institutions that often exceed Federal Deposit Insurance Corporation-insured limits. The Company manages its credit risk associated with cash concentrations by diversifying cash holdings across AAA-rated Government and Treasury Money Market Funds and multiple high quality financial institutions, and by periodically evaluating the credit quality of the primary financial institutions holding such deposits. The carrying value of cash approximates fair value. Historically, the Company has not experienced any losses due to such cash concentrations.\n \nAllowance for Credit Losses\nThe Company maintains an allowance for credit losses to cover its current expected credit losses on its trade receivables and contract assets arising from the failure of customers to make contractual payments. The Company estimates credit losses expected over the life of its trade receivables and contract assets based on historical information combined with current conditions that may affect a customer’s ability to pay and reasonable and supportable forecasts. While the Company uses various credit quality metrics, it primarily monitors collectability by reviewing the duration of collection pursuits on its delinquent trade receivables and historical write-off trends. Based on the Company’s experience, the customer's delinquency status, which is analyzed periodically, is the strongest indicator of the credit quality of the underlying trade receivables. The Company’s policy is to write-off trade receivables when they are deemed uncollectible. A majority of the Company's trade receivables are less than 365 days outstanding.\nF-15\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nUnder the CECL impairment model, the Company develops and documents its allowance for credit losses on its trade receivables based on \nfive\n portfolio segments. The determination of portfolio segments is based primarily on the qualitative consideration of the nature of the Company’s business operations and the characteristics of the underlying trade receivables, as follows:\n•\nCoStar Portfolio Segment - The CoStar portfolio segment consists of \ntwo\n classes of trade receivables based on geographical location: North America and International.\n•\nInformation Services Portfolio Segment - The Information Services portfolio segment consists of \nfour\n classes of trade receivables: CoStar Real Estate Manager; Hospitality, North America; Hospitality, International, and other Information Services.\n•\nMultifamily Portfolio Segment - The Multifamily portfolio segment consists of \none\n class of trade receivables.\n•\nLoopNet Portfolio Segment - The LoopNet portfolio segment consists of \none\n class of trade receivables.\n•\nOther Marketplaces Portfolio Segment - The Other Marketplaces portfolio segment consists of \none\n class of trade receivables.\nThe majority of Residential revenue is e-commerce based and does not result in accounts receivable. Residential accounts receivable and the related allowance for credit losses are not material.\nSee Note 4 for further discussion of the Company’s accounting for allowance for credit losses.\nLeases\nThe determination of whether an arrangement contains a lease and the classification of a lease, if applicable, is made at the commencement of the arrangement, at which time the Company also measures and recognizes an ROU asset, representing the Company’s right to use the underlying asset, and a lease liability, representing the Company’s obligation to make lease payments under the terms of the arrangement. For the purposes of recognizing ROU assets and lease liabilities associated with the Company’s leases, the Company has elected the practical expedient to not recognize a ROU asset or lease liability for short-term leases, which are leases with a term of 12 months or less. The lease term is defined as the noncancellable portion of the lease term, plus any periods covered by an option to extend the lease if it is reasonably certain that the option will be exercised.\nIn determining the amount of lease payments used in measuring ROU assets and lease liabilities, the Company has elected the practical expedient not to separate non-lease components from lease components for all classes of underlying assets. Consideration deemed part of the lease payments used to measure ROU assets and lease liabilities generally includes fixed payments and variable payments based on either an index or a rate, offset by lease incentives. Upon commencement, the initial ROU asset also includes any lease prepayments. ROU assets and liabilities are recognized at the lease commencement date based on the present value of lease payments over the lease term. The rates implicit within the Company's leases are generally not determinable. Therefore, the Company's incremental borrowing rate is used to determine the present value of lease payments. The determination of the Company’s incremental borrowing rate requires judgment and is determined at lease commencement and is subsequently reassessed upon a modification to the lease arrangement.\nLease costs related to the Company's operating leases are generally recognized as a single ratable lease cost over the lease term.\nFinance lease costs primarily relate to vehicles used by the Company's research teams and the amortization of the ROU assets are recorded to cost of revenues in the consolidated statements of operations. The impact of lease costs related to short-term leases was not material for the year ended December 31, 2024 and 2023.\nSee Note 7 for further discussion of the Company’s accounting for leases.\nF-16\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nProperty and Equipment, Net\nProperty and equipment are stated at cost, net of accumulated depreciation and amortization. All repairs and maintenance costs are expensed as incurred. Construction in progress includes expenditures for construction and improvements to our campuses and are stated at cost. The Company capitalized interest costs during the construction phase. Capitalized costs are allocated to certain property and equipment categories upon substantial completion. Costs related to acquisition of additional aircraft components or the replacement of existing aircraft components are capitalized and depreciated over the estimated useful life of the aircraft or the added or replaced component, whichever is less. \nDepreciation and amortization are calculated on a straight-line basis over the following estimated useful lives of the assets:\nBuildings \nTwenty\n to \nthirty-nine\n years \nLand\nIndefinite\nAircraft\nTen\n to \ntwenty\n years\nFurniture and office equipment\nFive\n to \nten\n years\nVehicles\nFour\n to \nfive\n years\nComputer hardware and software\nThree\n to \nfive\n years\nLeasehold improvements\nShorter of lease terms or useful life\nQualifying internal-use software costs incurred during the application development stage, which consist primarily of internal product development costs, are capitalized and amortized over the estimated useful life of the asset. All other costs are expensed as incurred. The Company removes fully depreciated property and equipment from the cost and accumulated depreciation amounts disclosed in the period they become fully depreciated.\nLong-Lived Assets, Intangible Assets, and Goodwill\nLong-lived assets, such as property and equipment, and purchased intangibles subject to amortization, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. The Company capitalizes interest on borrowings during the active construction period of major capital projects. Capitalized interest is added to the cost of the underlying asset and amortized over the estimated useful life of the asset. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to the estimated undiscounted future cash flows expected to be generated by the asset or asset group. If the carrying amount of an asset exceeds its estimated undiscounted future cash flows, an impairment charge is recognized in the amount by which the carrying amount of the asset exceeds the fair value of the asset.\nDuring 2022, the Company ceased using leased properties in California and Maryland as part of efforts to centralize its workforce, which resulted in an impairment charge of $\n9\n million for lease ROU assets and property and equipment related to abandoned leases. The impairment was recorded in the general and administrative expense line of the consolidated statements of operations. The leases related to the North America segment.\nAcquired technology and data, customer base assets, trade names, and other intangible assets are related to the Company’s acquisitions. Acquired technology and data is amortized on a straight-line basis over periods ranging from \n2\n years to \n8\n years. Acquired intangible assets characterized as customer base assets consist of acquired customer contracts and the related customer relationships and are amortized over periods ranging from \n6\n years to \n15\n years. Acquired customer bases are amortized on an accelerated or straight-line basis depending on the expected economic benefit of the intangible asset. Acquired trade names and other intangible assets are amortized on a straight-line basis over periods ranging from \n2\n years to \n15\n years. The Company removes fully amortized intangible assets from the cost and accumulated amortization amounts disclosed.\nGoodwill represents the future economic benefits arising from a business combination and is calculated as the excess of the purchase consideration paid in a business combination over the fair value of the net identifiable assets acquired. Goodwill is not amortized, but instead is assigned to each of the Company's reporting units and tested for impairment at least annually, on October 1, or more frequently if an event or other circumstance indicates that the fair value of a reporting unit may be below its carrying amount. The Company may first assess qualitative factors to evaluate whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, or elect to bypass the qualitative assessment. If it is determined that it is more likely than not that the fair value of a reporting unit is less than its carrying value, or the Company elects to bypass the qualitative assessment, the Company then performs a quantitative assessment by determining the fair value of each reporting unit. The estimate of the fair value of each reporting unit is based on a projected discounted cash flow model that includes significant assumptions and estimates including the discount rate, growth rate and future financial performance. Assumptions \nF-17\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nabout the discount rate are based on a weighted average cost of capital for comparable companies. Assumptions about the growth rate and future financial performance of a reporting unit are based on the Company's forecasts, business plans, economic projections, and anticipated future cash flows. The fair value of each reporting unit is compared to the carrying amount of the reporting unit. If the carrying value of the reporting unit exceeds the fair value, then an impairment loss is recognized for the difference.\nSee Notes 5, 9, and 10 for further discussion of the Company's acquisitions, goodwill, and intangible assets, respectively.\nLeasing Operations and Other Expense/Income, Net\nIn February 2024, the Company closed on the purchase of an office tower and the land on which it rests in Arlington, Virginia. In January 2025, the Company relocated its headquarters from Washington, D.C. to Arlington, VA occupying approximately \n30\n% of the building. The Company intends to build out further space in this building to support anticipated growth and expansion of its operations in the coming years. Maintenance, physical facilities, leasing, property management, and other key responsibilities related to property ownership are outsourced to professional real-estate managers. The office tower measures approximately \n550,000\n rentable square feet.\nThe Company accounted for the purchase of this building as an asset acquisition at the cost to acquire, including transaction costs. The Company estimated the fair values of acquired tangible assets (consisting of land, buildings, improvements, and other assets), identified intangible assets and liabilities (consisting of in-place leases and above- and below-market leases), and other liabilities based on its evaluation of information and estimates available at the date of acquisition. Based on these estimates, the Company allocated the total cost to the identified assets acquired and liabilities assumed based on their relative fair value.\nThe fair value of the building and building improvements consists of the physical structure containing rentable area, as well as amenities such as parking structures, and was valued as if vacant, using the cost approach, which uses replacement cost data obtained from industry recognized guides less depreciation as an input to estimate the fair value, with consideration given to its age, functionality, use classification, construction quality, replacement cost new, and accumulated depreciation (effective age vs. economic life). The Company also considered the value of the building using an income approach. The income approach uses market leasing assumptions to estimate the fair value of the property as if vacant assuming lease-up at prevailing market rental rates over a market-based lease-up period, including deductions for lost-rent during lease-up and leasing costs. The cost and income approaches are reconciled to arrive at an estimated building fair value. The Company assessed the fair value of land based on market comparisons.\nThe fair values of identified intangible assets and liabilities were determined based on the following:\n•\nThe value allocable to the above- or below-market component of an acquired in-place lease is determined based upon the present value (using a discount rate that reflects the risks associated with the acquired lease) of the difference between: (i) the contractual amounts to be received pursuant to the lease over its remaining term and (ii) management's estimate of the amounts that would be received using market rates current at the time of the acquisition for the remaining term of the lease. Amounts allocated to above-market leases are recorded as above-market leases in intangible assets, net in the consolidated balance sheets. These intangible assets are amortized on a straight-line basis over periods ranging from \n2\n years to \n11\n years as a reduction to lease income which is recorded within other (expense) income, net in the consolidated statements of operations over the remaining terms of the respective leases.\n•\nFactors considered in determining the value allocable to in-place leases during hypothetical lease-up periods related to space that is leased at the time of acquisition include: (i) lost rent and operating cost recoveries during the hypothetical lease-up period and (ii) theoretical leasing commissions required to execute similar leases. These intangible assets are recorded as in-place leases in intangible assets, net in the consolidated balance sheets and are amortized over periods ranging from \n2\n years to \n11\n years to other (expense) income, net in the consolidated statements of operations over the remaining terms of the existing leases.\nF-18\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe total cost of the land and building was $\n343.0\n million and was allocated to the following components (in millions):\nComponent\nBalance Sheet Caption\nAmount\nLand\nProperty and equipment, net\n$\n17.2\n \nBuilding\nProperty and equipment, net\n224.5\n \nLand and building improvements\nProperty and equipment, net\n27.5\n \nAbove-market leases\nIntangible assets, net\n41.7\n \nIn-place leases\nIntangible assets, net\n32.1\n \n$\n343.0\n \nThe cash paid for this asset acquisition was included in the caption purchases of property, equipment, and other assets for new campuses in the consolidated statement of cash flows. The Company records the activity from this building's operations and leases, including building depreciation and operating expenses for space occupied by third parties, as other (expense) income, net in the consolidated statements of operations.\nIn October 2024, the Company and a building tenant modified a lease agreement to reduce the leased space and extend the lease term of a portion of the remaining space. Among other provisions, the modified lease agreement requires the tenant to make a $\n48\n million buyout payment, in \ntwo\n equal installments, which will be recognized prospectively over the modified lease term. The Company received the first installment of the buyout payment in fourth quarter of 2024. The second installment of the buyout payment is due in 2025. The tenant surrendered certain space concurrently with the execution of the modified lease agreement and the Company began to outfit this space to host its employees.\nDeferred lease income as of December 31, 2024 was as follows (in millions):\nBalance\nBalance Sheet Caption\nYear Ended December 31, 2024\nCurrent portion\nAccrued expenses and other current liabilities\n$\n4.5\n \nNon-current portion\nLease and other long-term liabilities\n18.5\n \nTotal deferred lease income\n$\n23.0\n \nLease income includes base rent each tenant pays in accordance with the terms of its respective lease and is reported on a straight-line basis over the non-cancellable term of the lease, which includes the effects of periodic step-ups in rent and rent abatements under the lease. When a renewal option is included within the lease, the Company assesses whether the option is reasonably certain of being exercised against relevant economic factors to determine whether the option period should be included as part of the lease term. Further, lease income includes tenant reimbursement amounts for the recovery of the operating expenses and real estate taxes. Tenant reimbursements, which vary each period, are non-lease components that are not the predominant activity within the contract. The Company has elected the practical expedient that allows it to combine certain lease and non-lease components of operating leases. Non-lease components are recognized together with fixed base rent in \"lease income,\" as variable lease income in the same period as the related expenses are incurred. Variable lease income was not material for the year ended December 31, 2024. \nComponents of other (expense) income, net related to leasing operations for the year ended December 31, 2024 were as follows (in millions):\nYear Ended December 31, 2024\nLease income\n(1)\n$\n22.0\n \nLess:\nProperty operating expenses\n9.3\n \nDepreciation and amortization expense\n19.1\n \nOther expense from leasing operations\n$\n(\n6.4\n)\n__________________________\n(1) \nIncludes $\n9.5\n million of amortization expense of above-market leases.\nF-19\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following is a maturity analysis of the annual undiscounted cash flows as of December 31, 2024 (in millions):\nOperating Lease Payments\n2025\n$\n41.4\n \n2026\n17.2\n \n2027\n16.8\n \n2028\n11.5\n \n2029\n9.7\n \nThereafter\n38.5\n \nTotal undiscounted cash flows\n$\n135.1\n \nBuilding depreciation and operating expenses for space occupied by the Company are allocated between cost of revenues, selling and marketing (excluding customer base amortization), software development, and general and administrative expenses on the consolidated statement of operations based on the headcount of the respective departments occupying the building. As of December 31, 2024, the Company occupied approximately \n30\n% of the property with the remainder leased or available to be leased to third parties.\n \nDebt Issuance Costs\nCosts incurred in connection with the issuance of long-term debt are deferred and amortized as interest expense over the term of the related debt using the effective interest method for term debt and on a straight-line basis for revolving debt. The Company made a policy election to classify deferred issuance costs on the revolving credit facility as a long-term asset on its consolidated balance sheets. Upon a refinancing or amendment, previously capitalized debt issuance costs are expensed and included in loss on extinguishment of debt if the Company determines that there has been a substantial modification of the related debt. If the Company determines that there has not been a substantial modification of the related debt, any previously capitalized debt issuance costs are amortized as interest expense over the term of the new debt instrument.\nSee Note 11 for further discussion of the Company's accounting for its outstanding debt, revolving credit facility, and related issuance costs.\nBusiness Combinations\nThe Company includes the results of operations of the businesses that it acquires from the date of acquisition. The Company generally allocates the purchase consideration to the tangible assets acquired and liabilities assumed and intangible assets acquired based on their estimated fair values on the date of the acquisition. The purchase price is generally determined based on the fair value of the assets transferred, liabilities assumed, and equity interests issued, after considering any transactions that are separate from the business combination. The excess of the fair value of purchase consideration over the fair values of these identifiable assets and liabilities is recorded as goodwill. The Company applies significant assumptions, estimates, and judgments in determining the fair value of assets acquired and liabilities assumed on the acquisition date, especially with respect to intangible assets and contingent liabilities. Significant estimates in valuing certain intangible assets include, but are not limited to, future expected cash flows from acquired customer bases, acquired technology and acquired trade names, useful lives, royalty rates, and discount rates. Estimates of fair value are based on assumptions believed to be reasonable, but which are inherently uncertain and unpredictable and, as a result, actual results may differ from estimates. Any adjustments to provisional amounts that are identified during the measurement period, not to exceed one year from the date of acquisition, are recorded in the reporting period in which the adjustment amounts are determined. Upon the conclusion of the measurement period, any subsequent adjustments are recorded to earnings.\nThe Company has elected the practical expedient provided under ASC 805, \nBusiness Combinations\n, which allows for contract assets and liabilities acquired or assumed in an acquisition to be measured in accordance with the accounting framework for revenue from contracts with customers as if the Company had originated the acquired contract. This is an exception to the general requirement to measure assets acquired and liabilities assumed at their fair value on the acquisition date.\nFor a given acquisition, the Company may identify certain pre-acquisition contingencies as of the acquisition date and may extend its review and evaluation of these pre-acquisition contingencies throughout the measurement period in order to obtain sufficient information to assess whether the Company includes these contingencies as a part of the fair value estimates of assets acquired and liabilities assumed and, if so, to determine their estimated amounts.\nF-20\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIf the Company cannot reasonably determine the fair value of a pre-acquisition contingency (non-income tax related) by the end of the measurement period, which is generally the case given the nature of such matters, the Company will recognize an asset or a liability for such pre-acquisition contingency if: (i) it is probable that an asset existed or a liability had been assumed at the acquisition date and (ii) the amount of the asset or liability can be reasonably estimated. Subsequent to the measurement period, changes in the Company's estimates of such contingencies will affect earnings and could have a material effect on its results of operations and financial position.\nIn addition, uncertain tax positions and tax-related valuation allowances assumed in connection with a business combination are initially estimated as of the acquisition date. The Company reevaluates these items based upon facts and circumstances that existed as of the acquisition date with any adjustments to its preliminary estimates being recorded to goodwill, provided that the Company is within the measurement period. Subsequent to the measurement period, changes to these uncertain tax positions and tax-related valuation allowances will affect the Company's provision for income taxes in its consolidated statements of operations and comprehensive income and could have a material impact on its results of operations and financial position.\nTransaction costs associated with business combinations are expensed as incurred, and are included in general and administrative expenses in the consolidated statements of operations.\nRecent Accounting Pronouncements\nRecently Adopted Accounting Pronouncements\nThe Company adopted ASU No. 2023-07 (Topic 280),\n Improvements to Reportable Segment Disclosures \neffective January 1, 2024. This guidance requires enhanced disclosures about significant segment expenses. Additionally, it requires disclosure of the title and position of the individual identified as the CODM and an explanation of how the CODM uses the reported measures of a segment’s profit or loss in assessing segment performance and deciding how to allocate resources. The adoption resulted in expanded segment reporting disclosures, with no impacts to our financial condition and results of operations. \nRecent Accounting Pronouncements Not Yet Adopted\nIn December 2023, the FASB issued ASU No. 2023-09 (Topic 740), \nImprovements to Income Tax Disclosures\n (Topic 740). The ASU requires disaggregated information about a reporting entity’s effective tax rate reconciliation as well as an expansion of other income tax disclosures. The ASU is effective on a prospective basis for annual reporting periods beginning after December 15, 2024. The Company is currently evaluating the impact this ASU will have on its consolidated financial statements and related disclosures.\nIn November 2024, the FASB issued ASU No. 2024-03, \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures \n(Subtopic 220-40). The ASU requires incremental disclosures about specific expense categories, including but not limited to, purchases of inventory, employee compensation, depreciation, amortization, and selling expenses. The amendments are effective for fiscal years beginning after December 15, 2026, and for interim periods within fiscal years beginning after December 15, 2027. Early adoption is permitted and the amendments may be applied either prospectively or retrospectively. Management is currently evaluating this ASU to determine its impact on the Company's disclosures.\nF-21\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n 3.    \nREVENUE FROM CONTRACTS WITH CUSTOMERS \nDisaggregated Revenue\nThe Company provides online marketplaces, information, and analytics to the commercial real estate industry, hospitality industry, residential industry, and related professionals. Revenues by operating segment and type of service consist of the following (in millions): \nYear Ended December 31,\n2024\n2023\n2022\nNorth America\nInternational\nTotal\nNorth America\nInternational\nTotal\nNorth America\nInternational\nTotal\nCoStar\n$\n957.3\n \n$\n63.2\n \n$\n1,020.5\n \n$\n886.0\n \n$\n39.2\n \n$\n925.2\n \n$\n800.2\n \n$\n36.8\n \n$\n837.0\n \nInformation services\n115.2\n \n20.7\n \n135.9\n \n132.4\n \n38.5\n \n170.9\n \n125.0\n \n32.4\n \n157.4\n \nMultifamily\n1,067.3\n \n—\n \n1,067.3\n \n914.2\n \n—\n \n914.2\n \n745.4\n \n—\n \n745.4\n \nLoopNet\n270.9\n \n10.8\n \n281.7\n255.4\n9.4\n264.8\n223.7\n \n7.2\n \n230.9\n \nResidential\n58.9\n \n41.7\n \n100.6\n43.9\n2.2\n46.1\n73.7\n \n—\n \n73.7\n \nOther Marketplaces\n130.2\n \n—\n \n130.2\n \n133.8\n \n—\n \n133.8\n \n138.0\n \n—\n \n138.0\n \nTotal revenues\n$\n2,599.8\n \n$\n136.4\n \n$\n2,736.2\n \n$\n2,365.7\n \n$\n89.3\n \n$\n2,455.0\n \n$\n2,106.0\n \n$\n76.4\n \n$\n2,182.4\n \nDeferred Revenue\nDeferred revenue as of December 31, 2024 and 2023 was as follows (in millions):\nDecember 31,\nBalance\nBalance Sheet Caption\n2024\n2023\nCurrent portion\nDeferred revenue\n$\n137.1\n \n$\n104.2\n \nNon-current portion\nLease and other long-term liabilities\n0.2\n \n0.1\n \nTotal deferred revenue\n$\n137.3\n \n$\n104.3\n \nChanges in deferred revenue for the period were as follows (in millions):\nBalance at December 31, 2023\n$\n104.3\n \nRevenues recognized in the current period from the amounts in the beginning balance\n(\n102.8\n)\nNew deferrals, net of amounts recognized in the current period\n(1)\n136.4\n \nEffects of foreign currency\n(\n0.6\n)\nBalance at December 31, 2024\n$\n137.3\n \n__________________________\n(1)\n This balance includes $\n22.4\n million of net new deferrals recognized in connection with business acquisitions made in 2024. See Note 5 for further discussion of acquisitions.\nContract Assets\nContract assets are generated when contractual billing schedules differ from revenue recognition timing and represent a conditional right to consideration for satisfied performance obligations that becomes a receivable when the conditions are satisfied. Contract assets as of December 31, 2024 and 2023 were as follows (in millions):\nDecember 31,\nBalance\nBalance Sheet Caption\n2024\n2023\nCurrent portion\nPrepaid expenses and other current assets\n$\n5.8\n \n$\n5.8\n \nNon-current portion\nDeposits and other assets\n6.0\n \n8.0\n \nTotal contract assets\n$\n11.8\n \n$\n13.8\n \nF-22\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nRevenues were reduced by $\n2.0\n million from contract assets for the year ended December 31, 2024 and revenues recognized from contract assets were $\n1.4\n million for the year ended December 31, 2023. \nCommissions\nCommissions expense is included in selling and marketing expense in the Company's consolidated statements of operations. The Company determined that \nno\n deferred commissions were impaired as of both December 31, 2024 and 2023. \nCommissions expense activity for the years ended December 31, 2024, 2023, and 2022, was as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nCommissions incurred\n$\n180.9\n \n$\n173.5\n \n$\n162.1\n \nCommissions capitalized in the current period\n(\n120.2\n)\n(\n120.2\n)\n(\n116.8\n)\nAmortization of deferred commissions costs\n116.7\n \n95.2\n \n76.1\n \nTotal commissions expense\n$\n177.4\n \n$\n148.5\n \n$\n121.4\n \nSee Note 2 for the Company's policy on accounting for commissions.\nUnsatisfied Performance Obligations\nRemaining contract consideration for which revenue had not been recognized due to unsatisfied performance obligations was $\n392.3\n million as of December 31, 2024, which the Company expects to recognize over the next \nfive years\n. This amount does not include contract consideration for contracts with a duration of one year or less.\n4.\nALLOWANCE FOR CREDIT LOSSES \nThe following tables detail the activity related to the allowance for credit losses for trade receivables by portfolio segment (in millions):\nYear Ended December 31, 2024\nCoStar\nInformation Services\nMultifamily\nLoopNet\nOther Marketplaces\nTotal\nBeginning balance at December 31, 2023\n$\n9.7\n \n$\n2.5\n \n$\n7.3\n \n$\n2.7\n \n$\n1.0\n \n$\n23.2\n \nCurrent-period provision (release) for expected credit losses\n15.5\n \n2.4\n \n12.4\n \n5.6\n \n0.5\n \n36.4\n \nWrite-offs charged against the allowance, net of recoveries and other\n(\n19.1\n)\n(\n1.0\n)\n(\n10.3\n)\n(\n5.3\n)\n(\n1.1\n)\n(\n36.8\n)\nEnding balance at December 31, 2024\n$\n6.1\n \n$\n3.9\n \n$\n9.4\n \n$\n3.0\n \n$\n0.4\n \n$\n22.8\n \nF-23\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nYear Ended December 31, 2023\nCoStar\nInformation Services\nMultifamily\nLoopNet\nOther Marketplaces\nTotal\nBeginning balance at December 31, 2022\n$\n4.5\n \n$\n1.1\n \n$\n4.3\n \n$\n1.4\n \n$\n0.9\n \n$\n12.2\n \nCurrent-period provision (release) for expected credit losses\n22.1\n \n1.4\n \n4.9\n \n6.0\n \n0.6\n \n35.0\n \nWrite-offs charged against the allowance, net of recoveries and other\n(\n16.9\n)\n—\n \n(\n1.9\n)\n(\n4.7\n)\n(\n0.5\n)\n(\n24.0\n)\nEnding balance at December 31, 2023\n$\n9.7\n \n$\n2.5\n \n$\n7.3\n \n$\n2.7\n \n$\n1.0\n \n$\n23.2\n \nYear Ended December 31, 2022\nCoStar\nInformation Services\nMultifamily\nLoopNet\nOther Marketplaces\nTotal\nBeginning balance at December 31, 2021\n$\n5.4\n \n$\n1.8\n \n$\n3.4\n \n$\n2.0\n \n$\n0.8\n \n$\n13.4\n \nCurrent-period provision for expected credit losses\n9.2\n \n(\n0.6\n)\n5.8\n \n3.8\n \n0.1\n \n18.3\n \nWrite-offs charged against the allowance, net of recoveries and other\n(\n10.1\n)\n(\n0.1\n)\n(\n4.9\n)\n(\n4.4\n)\n—\n \n(\n19.5\n)\nEnding balance at December 31, 2022\n$\n4.5\n \n$\n1.1\n \n$\n4.3\n \n$\n1.4\n \n$\n0.9\n \n$\n12.2\n \nCredit loss expense is included in general and administrative expenses on the consolidated statements of operations. Credit loss expense related to contract assets was not material for the years ended December 31, 2024, 2023, and 2022. The majority of the Residential portfolio segment revenue is e-commerce based and does not result in accounts receivable.\n5.    \nACQUISITIONS \nMatterport\nOn April 21, 2024, the Company entered into the Matterport Merger Agreement with Matterport, subject to the terms and conditions of which, each share of Matterport Common Stock issued and outstanding immediately prior to the effective time of the First Merger (the “First Effective Time”) (other than any cancelled shares or Dissenting Shares (as defined in the Matterport Merger Agreement)) will be converted into (i) a number of CoStar Group Shares equal to the Merger Exchange Ratio (such consideration, the “Per Share Stock Consideration”) and (ii) $\n2.75\n in cash per share, without interest (the “Per Share Cash Consideration”). Holders of Matterport Common Stock will receive cash in lieu of fractional CoStar Group Shares (the “Fractional Share Consideration” and, together with the Per Share Stock Consideration and the Per Share Cash Consideration, collectively, the “Matterport Merger Consideration”).\nConsummation of the Mergers is subject to certain customary conditions, including, among others, expiration or termination of the applicable waiting periods under the HSR Act and the Antitrust Laws (each as defined in the Matterport Merger Agreement) of certain other jurisdictions, the absence of any law, injunction, order, or award restraining, enjoining, or otherwise prohibiting or making illegal the consummation of the Mergers. Each party’s obligation to consummate the Mergers is subject to certain other conditions, including the accuracy of the representations and warranties of the other party, compliance in all material respects by the other party with its obligations under the Matterport Merger Agreement, and the absence of a material adverse effect related to the other party. Consummation of the Mergers is not subject to approval by our stockholders or to any financing condition.\nOn July 3, 2024, Matterport and CoStar Group each received a request for additional information and documentary materials (the “Second Request”) from the FTC in connection with the FTC’s review of the Transaction. The effect of the \nF-24\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSecond Request is to extend the waiting period imposed by the HSR Act until 30 days after Matterport and CoStar Group have each substantially complied with their respective Second Requests, unless that period is extended or terminated sooner by the FTC. Matterport and CoStar Group certified they were in substantial compliance with the Second Request in November 2024 and January 2025, respectively. Each of Matterport and CoStar Group continue to work cooperatively with the FTC in its review of the Transaction and expect that the Transaction will be completed in the first quarter of 2025, subject to the expiration or termination of the waiting period under the HSR Act and the satisfaction or waiver of the other closing conditions specified in the Matterport Merger Agreement.\nThe Matterport Merger Agreement requires the Company to pay an $\n85\n million fee to Matterport in the event the Matterport Merger Agreement is terminated under specified circumstances, including, among others: if certain antitrust approvals are not obtained or a governmental order related to antitrust or competition matters prohibits the consummation of the transaction. The Company intends to fund the cash consideration with cash on hand and expects the transaction to close in the first quarter of 2025. The cash consideration is estimated to be $\n940\n million and the stock consideration would require the issuance of approximately \n11.2\n million CoStar Group Shares using the share price of the Company at April 19, 2024, not considering Fractional Share Consideration. In addition, awards of restricted stock units relating to Matterport grants that are outstanding at the time of the First Merger will be converted into a corresponding award of CoStar Group Shares based on the Matterport Merger Consideration.\nVisual Lease\nIn November 2024 CoStar acquired Visual Lease for total consideration of $\n276.0\n million, in accordance with the terms under the Visual Lease Merger Agreement. Visual Lease is the operator of a SaaS platform for integrated lease management and lease accounting.\nThe following table summarizes the amounts recorded for acquired assets and assumed liabilities recorded at their fair value as of the closing date of the acquisition (in millions):\nPreliminary: November 1, 2024\nCash and cash equivalents\n$\n5.2\n \nAccounts receivable\n4.2\n \nLong-term deferred tax assets\n5.3\n \nGoodwill\n148.0\n \nIntangible assets\n135.9\n \nDeferred revenue\n(\n22.4\n)\nOther assets and liabilities\n(\n0.2\n)\nFair value of identifiable net assets acquired\n$\n276.0\n \nThe net assets of Visual Lease were recorded at their estimated fair values. In valuing the acquired assets and assumed liabilities, fair value estimates were based primarily on future expected cash flows, market rate assumptions for contractual obligations, and appropriate discount rates. The purchase price allocation is preliminary, subject primarily to the Company's assessment of certain tax matters and contingencies. The key assumptions used in the valuation include discount rates, projected revenue growth rates, customer attrition rates, and profit margins.\nF-25\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table summarizes the fair values (in millions) of the identifiable intangible assets acquired in the Visual Lease Acquisition included in the Company's North America operating segment, their related estimated useful lives (in years), and their respective amortization methods:\nEstimated Fair Value\nEstimated Useful Life\nAmortization Method\nCustomer base\n$\n119.3\n \n15\nAccelerated\nTrade name\n1.3\n \n5\nStraight-line\nSoftware technology\n1.5\n \n3\n Straight-line\nDatabase technology\n13.8\n \n7.5\n Straight-line\nTotal intangible assets\n$\n135.9\n \nGoodwill is calculated as the excess of the consideration transferred over the net assets recognized and represents the future economic benefits arising from other assets acquired that could not be individually identified and separately recognized. Specifically, the goodwill recorded as part of the Visual Lease Acquisition includes but is not limited to: (i) the expected synergies and other benefits that the Company believes will result from combining its operations with our CoStar Real Estate Manager operations and (ii) any intangible assets that do not qualify for separate recognition, such as the assembled workforce. The $\n148.0\n million of goodwill recorded as part of the acquisition is associated with the Company's North America operating segment, of which $\n132.7\n million is expected to be deductible for income tax purposes. Transaction costs associated with the Visual Lease Acquisition were $\n6.8\n million.\nOnTheMarket\nOn December 12, 2023, CoStar UK acquired OnTheMarket, the operator of onthemarket.com, a U.K. residential property portal. At the time of closing, CoStar UK acquired all of the then issued ordinary share capital of OnTheMarket for cash consideration of \n110\n pence per share or £\n94.0\n million ($\n117.9\n million). OnTheMarket had certain share option contracts that had not been exercised at the time of closing for which CoStar UK has established a liability for £\n2.0\n million ($\n2.5\n million). This resulted in total consideration of £\n96.0\n million ($\n120.4\n million). Certain shares outstanding at the time of the closing resulted from contracts held by employees of OnTheMarket or its subsidiaries that required OnTheMarket to withhold income and employment taxes of £\n4.0\n million ($\n5.1\n million) which represented consideration payable at December 31, 2023 and were remitted in January 2024.\nThe following table summarizes the amounts recorded for acquired assets and assumed liabilities recorded at their fair value as of the closing date of the acquisition (in millions):\nPreliminary: December 12, 2023\nMeasurement Period Adjustments\nFinal\nCash and cash equivalents\n$\n18.2\n \n$\n—\n \n$\n18.2\n \nAccounts receivable\n2.3\n \n0.4\n \n2.7\n \nGoodwill\n62.8\n \n(\n1.1\n)\n61.7\n \nIntangible assets\n55.2\n \n—\n \n55.2\n \nAccrued expenses\n(\n12.7\n)\n1.3\n \n(\n11.4\n)\nAccrued wages and commissions\n(\n2.0\n)\n—\n \n(\n2.0\n)\nDeferred income taxes, net\n(\n3.0\n)\n(\n0.1\n)\n(\n3.1\n)\nOther assets and liabilities\n(\n0.4\n)\n(\n0.5\n)\n(\n0.9\n)\nFair value of identifiable net assets acquired\n$\n120.4\n \n$\n—\n \n$\n120.4\n \nThe net assets of OnTheMarket were recorded at their estimated fair values. In valuing the acquired assets and assumed liabilities, fair value estimates were based primarily on future expected cash flows, market rate assumptions for contractual obligations and appropriate discount rates. The estimated fair value of the customer base assets incorporated significant assumptions that had a material impact on the estimated fair value, such as discount rates, projected revenue growth rates, customer attrition rates, and profit margins.\nF-26\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table summarizes the fair values (in millions) of the identifiable intangible assets acquired in the OnTheMarket Acquisition included in the Company's International operating segment, their related estimated useful lives (in years), and their respective amortization methods:\nEstimated Fair Value\nEstimated Useful Life\nAmortization Method\nCustomer base\n$\n42.0\n \n8\nAccelerated\nTrade name\n10.2\n \n15\n Straight-line\nTechnology\n3.0\n \n2\n Straight-line\nTotal intangible assets\n$\n55.2\n \nGoodwill is calculated as the excess of the consideration transferred over the net assets recognized and represents the future economic benefits arising from other assets acquired that could not be individually identified and separately recognized. Specifically, the goodwill recorded as part of the OnTheMarket Acquisition includes, but is not limited to: (i) the expected synergies and other benefits that the Company believes will result from combining its operations with international operations and (ii) any intangible assets that do not qualify for separate recognition, such as the assembled workforce. The $\n61.7\n million of goodwill recorded as part of the acquisition is associated with the Company's International operating segment, of which \nnone\n is expected to be deductible for income tax purposes. Transaction costs associated with the OnTheMarket Acquisition were $\n11.0\n million. \nBusiness Immo\nIn April 2022, the Company acquired Business Immo, a leading commercial real estate news service provider in France, for €\n5.8\n million ($\n6.3\n million), net of cash acquired and the assumption of outstanding debt. As part of the acquisition, the Company recorded goodwill and intangible assets of $\n7.1\n million and $\n3.9\n million, respectively. The net assets of Business Immo were recorded at their estimated fair value. The net assets of Business Immo were recorded at their estimated fair value. The Company retired the assumed debt in the second quarter of 2022. \nPro Forma Financial Information (unaudited)\nThe unaudited pro forma financial information presented below reflects the consolidated results of operations of the Company assuming the OnTheMarket Acquisition had taken place on January 1, 2022 and was as follows (in millions, except per share data):\nYear Ended\nDecember 31,\n2023\n2022\nRevenue\n$\n2,494.0\n \n$\n2,224.3\n \nNet income\n$\n371.9\n \n$\n361.9\n \nNet income per share - basic\n$\n0.91\n \n$\n0.91\n \nNet income per share - diluted\n$\n0.91\n \n$\n0.91\n \nThe impact of the OnTheMarket Acquisition on the Company's revenue and net income in the consolidated statements of operations from December 12, 2023 through December 31, 2023 was not material.\nF-27\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe unaudited pro forma financial information presented below reflects the consolidated results of operations of the Company assuming the Visual Lease Acquisition had taken place on January 1, 2023 and was as follows (in millions, except per share data):\nYear Ended\nDecember 31,\n2024\n2023\nRevenue\n$\n2,769.0\n \n$\n2,490.6\n \nNet income\n$\n135.0\n \n$\n357.3\n \nNet income per share - basic\n$\n0.33\n \n$\n0.88\n \nNet income per share - diluted\n$\n0.33\n \n$\n0.88\n \nRevenue and net income attributable to Visual Lease from November 1, 2024 through December 31, 2024 was not material.\nThe pro forma financial information of the Business Immo Acquisition was not material.\n6.    \nINVESTMENTS AND FAIR VALUE MEASUREMENTS \nFair value is defined as the price that would be received in the sale of an asset or paid to transfer a liability in an orderly transaction between market participants. There is a three-tier fair value hierarchy, which categorizes the inputs used in measuring fair value. These tiers include: Level 1, defined as observable inputs such as quoted prices in active markets for identical assets or liabilities; Level 2, defined as inputs other than quoted prices in active markets that are either directly or indirectly observable; and Level 3, defined as unobservable inputs for which little or no market data exists, therefore requiring an entity to develop its own assumptions.\nThe Company's financial assets comprise Level 1 cash equivalents with original maturities of three months or less in the amount of $\n4.5\n billion and $\n5.1\n billion as of December 31, 2024 and 2023, respectively. The Company had no Level 2 or Level 3 financial assets measured at fair value as of December 31, 2024 and 2023.\n The Company holds other financial instruments, including cash deposits, accounts receivable, accounts payable, accrued expenses, and Senior Notes. The carrying value for such financial instruments, other than the Senior Notes, each approximated their fair values as of December 31, 2024 and 2023. The estimated fair value of the Company's outstanding Senior Notes using quoted prices from the over-the-counter markets, considered Level 2 inputs, was $\n0.9\n billion and $\n0.9\n billion as of December 31, 2024 and 2023, respectively.\n7.    \nLEASES\nThe Company has operating and finance leases for its office facilities, data centers, and certain vehicles, as well as finance leases for office equipment. The Company's leases have remaining terms up to \nten years\n. The leases contain various renewal and termination options. The period that is subject to an option to extend the lease is included in the lease term if it is reasonably certain that the option will be exercised. The period that is subject to an option to terminate the lease is included if it is reasonably certain that the option will not be exercised.\nF-28\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nLease costs related to the Company's operating and finance leases included in the consolidated statements of operations were as follows (in millions): \n \nYear Ended December 31,\n \n2024\n2023\n2022\nOperating lease costs:\n \n \n \nCost of revenues\n$\n10.1\n \n$\n10.0\n \n$\n8.4\n \nSoftware development\n8.5\n \n6.3\n \n7.2\n \nSelling and marketing (excluding customer base amortization)\n15.1\n \n15.4\n \n12.6\n \nGeneral and administrative\n7.3\n \n4.0\n \n5.4\n \nTotal operating lease costs\n41.0\n \n35.7\n \n33.6\n \nFinance lease costs:\nAmortization of ROU assets\n4.7\n \n0.8\n \n—\n \nInterest on lease liabilities\n1.4\n \n0.2\n \n—\n \nTotal finance lease costs\n6.1\n \n1.0\n \n—\n \nTotal lease costs\n$\n47.1\n \n$\n36.7\n \n$\n33.6\n \nFinance lease costs primarily relate to vehicles used by the Company's research teams, and the amortization of the ROU assets are recorded to cost of revenue in the consolidated statements of operations. The impact of lease costs related to short-term leases was not material for the years ended December 31, 2024, 2023, and 2022. \nSupplemental balance sheet information related to operating leases was as follows (in millions): \nYear Ended December 31, \nBalance\nBalance Sheet Location\n2024\n2023\nOperating lease liabilities\n$\n138.9\n \n$\n109.9\n \nLess: imputed interest\n18.2\n \n7.0\n \nPresent value of lease liabilities\n120.7\n \n102.9\n \nLess: current portion of lease liabilities\nLease liabilities\n27.0\n \n36.9\n \nLong-term lease liabilities\nLease and other long-term liabilities\n$\n93.7\n \n$\n66.0\n \nWeighted-average remaining lease term in years\n5.6\n3.9\nWeighted-average discount rate\n4.4\n \n%\n3.6\n \n%\nROU Assets\nLease right-of-use assets\n$\n103.0\n \n$\n79.8\n \nFinance lease liabilities\n$\n16.6\n \n$\n14.6\n \nLess: imputed interest\n1.6\n \n1.6\n \nPresent value of lease liabilities\n15.0\n \n13.0\n \nLess: current portion of lease liabilities\nLease liabilities\n5.0\n \n3.1\n \nLong-term lease liabilities\nLease and other long-term liabilities\n$\n10.0\n \n$\n9.9\n \nWeighted-average remaining lease term in years\n3.0\n3.8\nWeighted-average discount rate\n6.4\n \n%\n7.8\n \n%\nROU Assets\nProperty and equipment, net\n$\n15.7\n \n$\n10.8\n \nF-29\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSupplemental cash flow information related to leases was as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows used in operating leases\n$\n46.8\n \n$\n44.9\n \n$\n41.6\n \nOperating cash flows used in finance leases\n$\n1.1\n \n$\n0.2\n \n$\n—\n \nFinancing cash flows used in finance leases\n$\n5.1\n \n$\n0.7\n \n$\n—\n \nROU assets obtained in exchange for new lease obligations:\nOperating leases\n$\n57.2\n \n$\n29.1\n \n$\n20.0\n \nFinance leases\n$\n7.2\n \n$\n13.6\n \n$\n—\n \n 8.    \nPROPERTY AND EQUIPMENT \nProperty and equipment consists of the following (in millions):\n \nDecember 31,\n \n2024\n2023\nLeasehold improvements\n$\n81.5\n \n$\n82.3\n \nFurniture, office equipment, and vehicles\n72.9\n \n70.4\n \nComputer hardware and software\n53.7\n \n56.3\n \nAircraft\n66.7\n \n44.2\n \nLand\n69.8\n \n52.2\n \nConstruction in progress\n431.8\n \n163.7\n \nBuildings\n373.4\n \n108.6\n \nProperty and equipment, gross\n1,149.8\n \n577.7\n \nAccumulated depreciation and amortization\n(\n134.9\n)\n(\n105.5\n)\nProperty and equipment, net\n$\n1,014.9\n \n$\n472.2\n \nDepreciation expense for property and equipment was approximately $\n57.2\n million, $\n33.8\n million and $\n29.1\n million, for the years ended December 31, 2024, 2023, and 2022, respectively. For the years ended December 31, 2024 and 2023, the Company removed $\n27.3\n million and $\n14.1\n million, respectively, of property and equipment that was fully depreciated from property and equipment, gross and accumulated depreciation and amortization, which had no impact on the Company's financial results.\nIncluded in the table above are $\n266.0\n million and $\n13.1\n million of buildings and improvements and accumulated depreciation and amortization, respectively, related to operating leases where The Company is the lessor as of December 31, 2024.\nF-30\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n9.    \nGOODWILL\nThe changes in the carrying amount of goodwill by operating segment consist of the following (in millions):\n \nNorth America\nInternational\nTotal\nGoodwill, December 31, 2022\n$\n2,149.2\n \n$\n165.6\n \n$\n2,314.8\n \nAcquisitions, including measurement period adjustments\n(1)\n—\n \n62.8\n \n62.8\n \nEffect of foreign currency translation\n—\n \n8.6\n \n8.6\n \nGoodwill, December 31, 2023\n2,149.2\n \n237.0\n \n2,386.2\n \nAcquisitions, including measurement period adjustments\n(2)\n148.0\n \n(\n1.1\n)\n146.9\n \nEffect of foreign currency translation\n—\n \n(\n5.5\n)\n(\n5.5\n)\nGoodwill, December 31, 2024\n$\n2,297.2\n \n$\n230.4\n \n$\n2,527.6\n \n__________________________\n(1)\n International goodwill generated during the year ended December 31, 2023 from the OnTheMarket Acquisition was $\n62.8\n million.\n(2)\n North America goodwill generated during the year ended December 31, 2024 from the Visual Lease Acquisition was $\n148.0\n million.\nThe Company expects $\n132.7\n million of goodwill generated from acquisitions completed in 2024 to be deductible for tax purposes. Goodwill generated from acquisitions completed in 2023 were \nnot\n deductible for tax purposes.\nNo\n impairments of the Company's goodwill were recognized during each of the years ended December 31, 2024, 2023, and 2022.\n10.    \nINTANGIBLE ASSETS\nIntangible assets consist of the following (in millions, except amortization period data):\n \nDecember 31,\nWeighted- Average\nAmortization Period\n(in years)\n \n2024\n2023\nAcquired database technology\n$\n47.4\n \n$\n36.3\n \n6\nAccumulated amortization\n(\n24.7\n)\n(\n21.0\n)\n \nAcquired database technology, net\n22.7\n \n15.3\n \n \nAcquired customer base\n556.9\n \n509.5\n \n11\nAccumulated amortization\n(\n304.1\n)\n(\n330.7\n)\n \nAcquired customer base, net\n252.8\n \n178.8\n \n \nAcquired trade names and other\n240.8\n \n258.9\n \n13\nAccumulated amortization\n(\n141.4\n)\n(\n139.3\n)\n \nAcquired trade names and other, net\n99.4\n \n119.6\n \n \nAcquired above-market leases\n41.5\n \n—\n \n9\nAccumulated amortization\n(\n9.3\n)\n—\n \nAcquired above-market leases, net\n32.2\n \n—\n \nAcquired in-place leases\n32.0\n \n—\n \n9\nAccumulated amortization\n(\n5.9\n)\n—\n \nAcquired in-place leases, net\n26.1\n \n—\n \nIntangible assets, net\n$\n433.2\n \n$\n313.7\n \n \nF-31\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAmortization expense for intangible assets was approximately $\n89.7\n million, $\n73.7\n million and $\n102.6\n million for the years ended December 31, 2024, 2023, and 2022, respectively. For the years ended December 31, 2024, 2023, and 2022, the Company removed $\n91.7\n million, $\n7.4\n million, and $\n87.7\n million, respectively, of intangible assets that were fully amortized from the acquired intangible assets and accumulated amortization, which had no impact on the Company's financial results.\nIn the aggregate, the Company expects the future amortization expense for intangible assets existing as of December 31, 2024 to be approximately $\n81.9\n million, $\n68.7\n million, $\n58.9\n million, $\n49.3\n million and $\n40.4\n million for the years ending December 31, 2025, 2026, 2027, 2028, and 2029, respectively.\nIntangible assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying value of such assets may not be recoverable. \nNo\n impairments of the Company's intangible assets were recognized during each of the years ended December 31, 2024, 2023, and 2022. The Company decided to eliminate usage fees related to agent access to a legacy product charged to a specific customer class. This resulted in an acceleration of $\n16.3\n million of amortization expense in 2022 for acquired customer base for this customer class.\n11.    \nLONG-TERM DEBT\nThe table below presents the components of outstanding debt (in millions):\nDecember 31,\n2024\n2023\n2.800\n% Senior Notes due July 15, 2030\n$\n1,000.0\n \n$\n1,000.0\n \n2020 Credit Agreement, due July 1, 2025\n—\n \n2024 Credit Agreement, due May 24, 2029\n—\n \nTotal face amount of long-term debt\n1,000.0\n \n1,000.0\n \nSenior Notes unamortized discount and issuance costs\n(\n8.1\n)\n(\n9.5\n)\nLong-term debt, net\n991.9\n \n990.5\n \nSenior Notes\nOn July 1, 2020, the Company issued $\n1.0\n billion aggregate principal amount of \n2.800\n% Senior Notes due July 15, 2030. The Senior Notes were sold to a group of financial institutions as initial purchasers who subsequently resold the Senior Notes to non-U.S. persons pursuant to Regulation S under the Securities Act, and to persons reasonably believed to be qualified institutional buyers pursuant to Rule 144A under the Securities Act at a purchase price equal to \n99.921\n% of their principal amount. Interest on the Senior Notes is payable semi-annually in arrears on January 15 and July 15. The Senior Notes may be redeemed in whole or in part by the Company (a) at any time prior to April 15, 2030 at a redemption price equal to \n100\n% of the principal amount of the Senior Notes, plus the Applicable Premium (as calculated in accordance with the indenture governing the Senior Notes), and any accrued and unpaid interest, if any, on the principal amount of Senior Notes being redeemed to, but excluding, the redemption date, and (b) on or after April 15, 2030 at a redemption price equal to \n100\n% of the principal amount of the Senior Notes, plus any accrued and unpaid interest, if any, on the principal amount of Senior Notes being redeemed to, but excluding, the redemption date. The Company’s obligations under the Senior Notes are guaranteed on a senior, unsecured basis by the Company’s domestic wholly owned subsidiaries and the indenture governing the Senior Notes contains covenants, events of default, and other customary provisions with which the Company was in compliance as of December 31, 2024.\nRevolving Credit Facility\nOn May 24, 2024, the Company entered into the 2024 Credit Agreement, which provides for a $\n1.1\n billion revolving credit facility with a term of \nfive years\n (maturing May 24, 2029), and a letter of credit sublimit of $\n20\n million from a syndicate of financial institutions and issuing banks. The 2024 Credit Agreement replaces the Company's 2020 Credit Agreement.\nBorrowings bear interest at a floating rate, which can be, at the Company’s option, either (a) an alternate base rate plus an applicable rate ranging from \n0.125\n% to \n0.750\n% or (b) a Term SOFR, SONIA rate, or EURIBOR for the specified interest period plus an applicable rate ranging from \n1.125\n% to \n1.750\n%, in each case depending on the Company’s Debt Rating (as defined in the 2024 Credit Agreement).\nThe 2024 Credit Agreement contains customary affirmative covenants for transactions of this type, including, among others, the provision of financial and other information to the administrative agent, notice to the administrative agent upon the \nF-32\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\noccurrence of certain material events, preservation of existence, maintenance of properties, and compliance with laws, including environmental laws, subject to certain exceptions. The 2024 Credit Agreement contains customary negative covenants, including, among others, restrictions on the ability of the Company and its subsidiaries to merge and consolidate with other companies, restrictions on the ability of certain subsidiaries to incur indebtedness, and restrictions on the ability of the Company and certain subsidiaries to grant liens or security interests on assets, subject to certain exceptions. The 2024 Credit Agreement contains a financial maintenance covenant that requires the Company to maintain a Total Leverage Ratio (as defined in the 2024 Credit Agreement) of less than or equal to \n4.50\n to 1.00, tested at the end of each fiscal quarter. The 2024 Credit Agreement also provides for a number of customary events of default, including, among others: payment defaults to the Lenders, voluntary and involuntary bankruptcy proceedings, covenant defaults, material inaccuracies of representations and warranties, cross-acceleration to other material indebtedness, certain change of control events, material money judgments, and other customary events of default. The occurrence of an event of default could result in the acceleration of obligations and the termination of lending commitments under the 2024 Credit Agreement. The Company was in compliance with the covenants in the 2024 Credit Agreement as of December 31, 2024. As of December 31, 2024, the Company had \nno\n amounts drawn under this facility.\nThe Company had $\n3.8\n million and $\n1.6\n million of deferred debt issuance costs related to the revolving credit facility as of December 31, 2024 and 2023, respectively. These amounts are included in deposits and other assets on the Company's consolidated balance sheets.\nFor the years ended December 31, 2024, 2023, and 2022, the Company recognized interest expense as follows (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nInterest on outstanding borrowings\n$\n28.0\n \n$\n28.0\n \n$\n28.0\n \nAmortization of Senior Notes discount and issuance costs\n2.8\n \n2.4\n \n2.3\n \nInterest capitalized for construction in progress\n(\n6.3\n)\n(\n1.6\n)\n—\n \nCommitment fees and other\n2.9\n \n2.6\n \n2.0\n \nTotal interest expense\n$\n27.4\n \n$\n31.4\n \n$\n32.3\n \n12.    \nINCOME TAXES \nThe components of the provision for income taxes attributable to operations consist of the following (in millions):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nCurrent:\n \n \n \nFederal\n$\n90.7\n \n$\n126.3\n \n$\n116.3\n \nState\n28.0\n \n36.6\n \n31.2\n \nForeign\n2.8\n \n0.9\n \n0.7\n \nTotal current\n121.5\n \n163.8\n \n148.2\n \nDeferred:\n \n \nFederal\n(\n42.1\n)\n(\n31.7\n)\n(\n20.4\n)\nState\n(\n8.4\n)\n(\n2.9\n)\n(\n9.6\n)\nForeign\n0.4\n \n(\n2.6\n)\n(\n1.2\n)\nTotal deferred\n(\n50.1\n)\n(\n37.2\n)\n(\n31.2\n)\nTotal provision for income taxes\n$\n71.4\n \n$\n126.6\n \n$\n117.0\n \nF-33\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe components of deferred tax assets and liabilities consist of the following (in millions):\n \nDecember 31,\n \n2024\n2023\nDeferred tax assets:\n \n \nAllowance for credit losses\n$\n5.1\n \n$\n5.8\n \nAccrued compensation\n13.0\n \n11.9\n \nStock compensation\n15.0\n \n15.3\n \nNet operating losses\n49.9\n \n34.7\n \nAccrued reserve and other\n19.6\n \n5.8\n \nLease liabilities\n26.2\n \n21.8\n \nCapitalized research and development costs\n140.0\n \n92.4\n \nResearch and development credits\n5.1\n \n4.5\n \nTotal deferred tax assets, prior to valuation allowance\n273.9\n \n192.2\n \nValuation allowance\n(\n33.3\n)\n(\n9.0\n)\nTotal deferred tax assets, net of valuation allowance\n240.6\n \n183.2\n \nDeferred tax liabilities:\n \n \nDeferred commission costs, net\n(\n42.8\n)\n(\n42.3\n)\nLease right-of-use assets\n(\n16.2\n)\n(\n16.0\n)\nPrepaid expenses\n(\n5.2\n)\n(\n4.1\n)\nProperty and equipment, net\n(\n9.4\n)\n(\n25.1\n)\nIntangible assets, net\n(\n144.0\n)\n(\n128.1\n)\nTotal deferred tax liabilities\n(\n217.6\n)\n(\n215.6\n)\nNet deferred tax assets (liabilities)\n$\n23.0\n \n$\n(\n32.4\n)\nFor both the years ended December 31, 2024 and 2023, the Company has not recognized deferred tax liabilities for temporary differences related to investments in foreign subsidiaries that were deemed permanently reinvested. Determination of the amount of unrecognized deferred income tax liabilities on these earnings is not practicable because such liability, if any, depends on certain circumstances existing if and when remittance occurs. A deferred tax liability will be recognized if and when the Company no longer plans to permanently reinvest these undistributed earnings.\nAs of both December 31, 2024 and 2023, a valuation allowance has been established for certain deferred tax assets due to the uncertainty of realization. The valuation allowance as of both December 31, 2024 and 2023 includes an allowance for acquired net operating losses and foreign deferred tax assets. \nThe Company established the valuation allowance because it is more likely than not that a portion of the deferred tax asset for certain items will not be realized based on the weight of available evidence. A valuation allowance was established for the foreign deferred tax assets due to the cumulative loss in recent years in those jurisdictions. The Company has not had sufficient taxable income historically to utilize the foreign deferred tax assets, and it is uncertain whether the Company will generate sufficient taxable income in the future to utilize the deferred tax assets. The Company has established a valuation allowance for certain acquired net operating losses where Section 382 limitations will impact the ability of the Company to utilize the net operating losses before they expire.\nThe Company’s change in valuation allowance was an increase of approximately $\n24.3\n million for the year ended December 31, 2024 and an increase of approximately $\n3.8\n million for the year ended December 31, 2023. The increases for the years ended December 31, 2024 and 2023 were primarily due to increases in foreign net operating loss deferred tax assets for which a full valuation allowance has been established. \nThe Company had U.S. income before income taxes of approximately $\n293.8\n million, $\n526.7\n million, and $\n493.2\n million for the years ended December 31, 2024, 2023, and 2022, respectively. The Company had foreign losses before income taxes of \nF-34\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\napproximately $\n83.7\n million, $\n25.4\n million, and $\n6.7\n million for the years ended December 31, 2024, 2023, and 2022, respectively. \nThe Company’s provision for income taxes resulted in effective tax rates that varied from the statutory federal income tax rate as follows (in millions):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nExpected federal income tax provision at statutory rate\n$\n44.1\n \n$\n105.3\n \n$\n102.1\n \nState income taxes, net of federal benefit\n18.4\n \n27.4\n \n21.5\n \nIncrease (decrease) in valuation allowance\n22.0\n \n1.9\n \n(\n0.5\n)\nForeign tax rate differential\n(\n3.3\n)\n(\n1.0\n)\n(\n0.3\n)\nResearch credits\n(\n28.9\n)\n(\n20.2\n)\n(\n17.5\n)\nExcess tax benefit\n(\n1.8\n)\n(\n5.9\n)\n(\n1.8\n)\nTax reserves\n6.8\n \n4.2\n \n1.5\n \nNondeductible compensation\n9.2\n \n8.8\n \n11.4\n \nOther adjustments\n4.9\n \n6.1\n \n0.6\n \nIncome tax expense\n$\n71.4\n \n$\n126.6\n \n$\n117.0\n \nThe Company has net operating loss carryforwards for international income tax purposes of approximately $\n147.2\n million that do not expire. The Company has federal net operating loss carryforwards of approximately $\n58.9\n million that begin to expire in 2033, state net operating loss carryforwards with a tax value of approximately $\n0.4\n million that begin to expire in 2033 and state income tax credit carryforwards with a tax value of approximately $\n8.0\n million primarily relating to state research and development credits and the D.C. qualified high technology company tax credit that began to expire in 2024. The Company realized a cash benefit relating to the use of its tax loss carryforwards of approximately $\n3.3\n million, $\n5.9\n million, and $\n12.6\n million in December 31, 2024, 2023, and 2022, respectively.\nThe following table summarizes the activity related to the Company’s unrecognized tax benefits (in millions):\nUnrecognized tax benefit as of December 31, 2021\n$\n14.8\n \nIncrease for current year tax positions\n3.4\n \nIncrease for prior year tax positions\n0.3\n \nExpiration of the statute of limitation for assessment of taxes\n(\n2.3\n)\nUnrecognized tax benefit as of December 31, 2022\n16.2\n \nIncrease for current year tax positions\n4.4\n \nIncrease for prior year tax positions\n1.7\n \nExpiration of the statute of limitation for assessment of taxes\n(\n2.4\n)\nUnrecognized tax benefit as of December 31, 2023\n19.9\n \nIncrease for current year tax positions\n5.8\n \nIncrease for prior year tax positions\n4.7\n \nExpiration of the statute of limitation for assessment of taxes\n(\n3.8\n)\nUnrecognized tax benefit as of December 31, 2024\n$\n26.6\n \nApproximately $\n26.6\n million and $\n19.9\n million of the unrecognized tax benefits as of December 31, 2024 and 2023, respectively, would favorably affect the annual effective tax rate if recognized in future periods. The increase for current year tax positions of $\n5.8\n million and increase for prior year tax positions of $\n4.7\n million for the year ended December 31, 2024 were primarily attributable to research credits. The decrease for expiration of the statute of limitation of $\n3.8\n million for the year ended December 31, 2024 was attributable to research credits. The Company recognized $\n1.0\n million, $\n0.7\n million, and $\n0.1\n million for interest and penalties in its consolidated statements of operations for the years ended December 31, 2024, 2023, and 2022, respectively. The Company had liabilities of $\n2.4\n million, $\n1.4\n million, and $\n0.7\n million for interest and penalties in its consolidated balance sheets as of December 31, 2024, 2023, and 2022, respectively. The Company does not anticipate the amount of the unrecognized tax benefits will change significantly over the next 12 months.\nF-35\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe Company is subject to taxation in the U.S. federal jurisdiction and various states and foreign jurisdictions. The Company’s federal income tax returns for tax years 2021 through 2023 remain open to examination. Most of the Company’s state income tax returns for tax years 2021 through 2023 remain open to examination. For states that have a four-year statute of limitations, the state income tax returns for tax years 2020 through 2023 remain open to examination. The Company’s U.K. income tax return for tax year 2023 remains open to examination. The Company believes that an adequate provision has been made for any adjustments that may result from tax examinations.\n13.    \nCOMMITMENTS AND CONTINGENCIES\nThe following summarizes the Company's significant contractual obligations, including related payments due by period, as of December 31, 2024 (in millions):\nYear Ending December 31,\nOperating lease obligations\nFinance lease obligations\nLong-term debt principal interest payments\nLong-term debt principal payments\n2025\n$\n31.8\n \n$\n5.4\n \n$\n28.0\n \n$\n—\n \n2026\n24.2\n \n5.9\n \n28.0\n \n—\n \n2027\n22.7\n \n4.9\n \n28.0\n \n—\n \n2028\n21.5\n \n0.4\n \n28.0\n \n—\n \n2029\n13.5\n \n—\n \n28.0\n \n—\n \nThereafter\n25.2\n \n—\n \n28.0\n \n1,000.0\n \nTotal\n$\n138.9\n \n$\n16.6\n \n$\n168.0\n \n$\n1,000.0\n \nThe Company leases office facilities under various non-cancelable operating leases, as well as data centers and vehicles under finance lease arrangements. The leases contain various renewal options. \nSee Note 7 for further discussion of the Company's lease commitments. \nCurrently, and from time to time, the Company is involved in litigation incidental to the conduct of its business. The Company records a provision for a liability when it is both probable that a liability has been incurred and the amount can be reasonably estimated. While it is reasonably possible that an unfavorable outcome may occur as a result of one or more of the Company’s current litigation matters, at this time management has concluded that the resolutions of these matters are not expected to have a material effect on the Company's consolidated financial position, future results of operations or liquidity. Legal defense costs are expensed as incurred.\n14.    \nSEGMENT REPORTING \nSegment Information\nThe Company manages its business geographically in \ntwo\n operating segments and \ntwo\n reportable segments, with the primary areas of measurement and decision-making being North America, which includes the U.S. and Canada, and International, which primarily includes Europe, Asia-Pacific, and Latin America. The Company is domiciled in the U.S. and all revenues earned in the U.S. are recorded in the North America Segment. The amount of revenues earned in Canada was immaterial for the years ended December 31, 2024, 2023, and 2022. Segment reporting is based on the management approach, whereby external segment reporting is aligned with the internal reporting used by the CODM, which is the Company’s Chief Executive Officer. The CODM relies on an internal management reporting process that provides revenue and operating segment EBITDA for making decisions and assessing performance as the source of the Company’s reportable segments. EBITDA is used by management internally to measure operating and management performance and to evaluate the performance of the business. \nF-36\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSummarized EBITDA information by operating segment consists of the following (in millions):\nYear Ended December 31, \n \n2024\n2023\n2022\nNorth America\nInternational\nTotal\nNorth America\nInternational\nTotal\nNorth America\nInternational\nTotal\nRevenues \n(1)\n$\n2,599.8\n \n$\n136.4\n \n$\n2,736.2\n \n$\n2,365.7\n \n$\n89.3\n \n$\n2,455.0\n \n$\n2,106.0\n \n$\n76.4\n \n$\n2,182.4\n \nLess:\nPersonnel\n1,104.0\n \n95.3\n \n1,199.3\n \n971.4\n \n66.2\n \n1,037.6\n \n809.6\n \n53.2\n \n862.8\n \nMarketing\n792.0\n \n67.4\n \n859.4\n \n548.0\n \n11.9\n \n559.9\n \n318.1\n \n5.0\n \n323.1\n \nGeneral and administrative \n(2)\n522.3\n \n32.2\n \n554.5\n \n443.3\n \n24.4\n \n467.7\n \n401.0\n \n12.8\n \n413.8\n \nEBITDA\n$\n181.5\n \n$\n(\n58.5\n)\n$\n123.0\n \n$\n403.0\n \n$\n(\n13.2\n)\n$\n389.8\n \n$\n577.3\n \n$\n5.4\n \n$\n582.7\n \n__________________________\n(1) \nSee Note 3 for details of revenue disaggregated by segment.\n(2) \nExcludes personnel costs\nThe following summarizes stock-based compensation, which is a significant non-cash item included in the personnel costs above, by segment (in millions):\nYear Ended December 31, \n \n2024\n2023\n2022\nNorth America\n$\n83.7\n \n$\n81.0\n \n$\n71.9\n \nInternational\n5.3\n \n4.0\n \n3.4\n \nTotal\n$\n89.0\n \n$\n85.0\n \n$\n75.3\n \nThe reconciliation of EBITDA to income before income tax expense consists of the following (in millions):\nYear Ended December 31,\n \n2024\n2023\n2022\nEBITDA\n$\n123.0\n \n$\n389.8\n \n$\n582.7\n \nAmortization of acquired intangible assets in cost of revenues\n(\n29.9\n)\n(\n31.5\n)\n(\n29.0\n)\nAmortization of acquired intangible assets in operating expenses\n(\n44.3\n)\n(\n42.2\n)\n(\n73.6\n)\nDepreciation and other amortization\n(\n44.1\n)\n(\n33.8\n)\n(\n29.1\n)\nInterest income, net\n212.5\n \n213.6\n \n32.1\n \nOther (expense) income, net \n(1)\n(\n7.1\n)\n5.4\n \n3.4\n \nIncome before income tax expense\n$\n210.1\n \n$\n501.3\n \n$\n486.5\n \n__________________________\n(1) \nIncludes $\n28.6\n million of amortization and depreciation expense associated with lessor activities for the year ended December 31, 2024. \nF-37\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSummarized information by operating segment consists of the following (in millions):\n \nDecember 31,\n \n2024\n2023\nProperty and equipment, net\n \n \nNorth America\n$\n1,006.7\n \n$\n465.7\n \nInternational\n8.2\n \n6.5\n \nTotal property and equipment, net\n$\n1,014.9\n \n$\n472.2\n \nGoodwill\n \n \nNorth America\n$\n2,297.2\n \n$\n2,149.2\n \nInternational\n230.4\n \n237.0\n \nTotal goodwill\n$\n2,527.6\n \n$\n2,386.2\n \nAssets\n \n \nNorth America\n$\n8,852.0\n \n$\n8,505.5\n \nInternational\n404.8\n \n414.2\n \nTotal assets\n$\n9,256.8\n \n$\n8,919.7\n \nLiabilities\n \n \nNorth America\n$\n1,603.0\n \n$\n1,499.7\n \nInternational\n100.3\n \n81.4\n \nTotal liabilities\n$\n1,703.3\n \n$\n1,581.1\n \nCash flows for the years ended December 31, 2024, 2023, and 2022 relating to purchases of long-term assets, including acquisitions and campus expansions, primarily relate to the North America segment.\n \n15.    \nSTOCKHOLDERS' EQUITY \nPreferred Stock\nThe Company has \n2\n million shares of preferred stock, $\n0.01\n par value, authorized for issuance. The Board of Directors may issue the preferred stock from time to time as shares of one or more classes or series.\nCommon Stock\nThe Company has \n1.2\n billion shares of common stock, $\n0.01\n par value, authorized for issuance. Dividends may be declared and paid on the common stock, subject in all cases to the rights and preferences of the holders of preferred stock and authorization by the Board of Directors. In the event of liquidation or winding up of the Company and after the payment of all preferential amounts required to be paid to the holders of any series of preferred stock, any remaining funds shall be distributed among the holders of the issued and outstanding common stock.\nEquity Offerings\nOn September 20, 2022, the Company completed a public equity offering of \n10.7\n million shares of common stock at an offering price of $\n70.38\n per share. Net proceeds from the public equity offering were approximately $\n745.7\n million, after deducting approximately $\n4.3\n million of underwriting fees, commissions, and other stock issuance costs. The Company intends to use the net proceeds from the sale of the securities to fund all or a portion of the costs of any strategic acquisitions it pursues in the future, to finance the growth of its business, and for working capital and other general corporate purposes. General corporate purposes may include additions to working capital, capital expenditures, repayment of debt, investments in the Company’s subsidiaries and the repurchase, redemption, or retirement of securities, including the Company’s common stock.\nF-38\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS  \n16.    \nNET INCOME PER SHARE\nThe following table sets forth the calculation of basic and diluted net income per share (in millions, except per share data):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNumerator:\n \n \n \nNet income\n$\n138.7\n \n$\n374.7\n \n$\n369.5\n \nDenominator:\nDenominator for basic net income per share — weighted-average outstanding shares\n406.3\n \n405.3\n \n396.3\n \nEffect of dilutive securities:\nStock options, restricted stock awards and restricted stock units\n1.5\n \n1.6\n \n1.5\n \nDenominator for diluted net income per share — weighted-average outstanding shares\n407.8\n \n406.9\n \n397.8\n \nNet income per share — basic\n$\n0.34\n \n$\n0.92\n \n$\n0.93\n \nNet income per share — diluted\n$\n0.34\n \n$\n0.92\n \n$\n0.93\n \nThe following table summarizes the shares underlying the unvested performance-based restricted stock and anti-dilutive securities excluded from the basic and diluted earnings per share calculations (in millions):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nPerformance-based restricted stock awards\n0.1\n \n0.2\n \n0.4\n \nAnti-dilutive securities\n0.8\n \n0.7\n \n1.0\n \n17.    \nEMPLOYEE BENEFIT PLANS \n \nStock Incentive Plans\nIn April 2007, the Company’s Board of Directors adopted the CoStar Group 2007 Stock Incentive Plan (as amended, the “2007 Plan”), subject to stockholder approval, which was obtained on June 7, 2007. In April 2016, the Company’s Board of Directors adopted the CoStar Group 2016 Stock Incentive Plan (as amended, the “2016 Plan”), subject to stockholder approval, which was obtained on June 9, 2016. All shares of common stock that were authorized for issuance under the 2007 Plan that, as of June 9, 2016, remained available for issuance under the 2007 Plan (excluding shares subject to outstanding awards) were rolled into the 2016 Plan and, as of that date, \nno\n shares of common stock were available for new awards under the 2007 Plan. The 2007 Plan continues to govern vested unexercised stock options issued prior to June 9, 2016. Upon the occurrence of a Change of Control, as defined in the 2007 Plan, all outstanding unexercisable options under the 2007 Plan immediately become exercisable.\nThe 2016 Plan provides for the grant of stock options, restricted stock, restricted stock units, and stock appreciation rights to officers, employees, and directors of the Company and its subsidiaries. Stock options granted under the 2016 Plan may be non-qualified or may qualify as incentive stock options. Except in limited circumstances related to a merger or other acquisition, the exercise price for an option may not be less than the fair market value of the Company’s common stock on the date of grant. The vesting period for each grant of options, restricted stock, restricted stock units, and stock appreciation rights under the 2016 Plan is determined by the Board of Directors or a committee thereof and is generally \nthree\n to \nfour years\n, subject to minimum vesting periods for restricted stock and restricted stock units of at least \none year\n. In some cases, vesting of awards under the 2016 Plan may be based on performance conditions. The Company initially reserved approximately \n22.7\n million shares of common stock for issuance under the 2016 Plan, which included shares of common stock that were authorized and remained available for issuance under the 2007 Plan as of June 9, 2016. Any shares of common stock subject to (a) outstanding awards under the 2007 Plan as of June 9, 2016 or (b) outstanding awards under the 2016 Plan after June 9, 2016, that cease for any reason to be subject to such awards (other than by reason of exercise or settlement of the awards to the extent they are exercised or settled in vested and nonforfeitable shares) will become authorized and unissued under the 2016 Plan. Pursuant to the terms of the 2016 Plan, all amounts reserved or issued under the plan were adjusted to reflect the Company’s \nten\n-for-one \nF-39\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\ncommon stock split. Unless terminated sooner, the 2016 Plan will terminate in June 2026, but will continue to govern unexercised and unexpired awards issued under the 2016 Plan prior to that date. Approximately \n12.3\n million shares were available for future grant under the 2016 Plan as of December 31, 2024.\nAt December 31, 2024, there was approximately $\n142.1\n million of unrecognized compensation cost related to stock incentive plans, net of estimated forfeitures, which the Company expects to recognize over a weighted-average-period of \n2.5\n years. The income tax benefit realized from stock-based compensation was $\n2.3\n million, $\n6.8\n million, and \nimmaterial\n for the years ended December 31, 2024, 2023 and 2022, respectively. \nSee Notes 2 and 12 for further discussion of stock-based compensation expense and income taxes, respectively.\nStock Options\nOption activity was as follows:\n \nNumber of\nShares\nRange of\nExercise Price\nWeighted-\nAverage\nExercise\nPrice\nWeighted-\nAverage\nRemaining\nContract\nLife (in years)\nAggregate\nIntrinsic\nValue\n(in millions)\nOutstanding at December 31, 2021\n1,976,100\n \n$\n10.22\n - $\n91.98\n$\n39.18\n \n6.24\n$\n80.8\n \nGranted\n202,100\n \n$\n67.29\n$\n67.29\n \nOutstanding at December 31, 2022\n2,178,200\n \n$\n10.22\n - $\n91.98\n$\n41.79\n \n5.60\n$\n79.6\n \nGranted\n140,800\n \n$\n76.78\n$\n76.78\n \nExercised\n(\n419,340\n)\n$\n10.22\n - $\n34.21\n$\n17.77\n \nOutstanding at December 31, 2023\n1,899,660\n \n$\n20.49\n - $\n91.98\n$\n46.69\n \n5.53\n$\n72.4\n \nGranted\n152,900\n \n$\n82.47\n \n$\n82.47\n \nExercised\n(\n122,736\n)\n$\n39.82\n - $\n76.78\n$\n58.03\n \nCanceled or expired\n(\n25,234\n)\n$\n67.29\n - $\n76.78\n$\n72.66\n \nOutstanding at December 31, 2024\n1,904,590\n \n$\n20.49\n - $\n91.98\n$\n51.48\n \n4.80\n$\n43.8\n \nExercisable at December 31, 2022\n1,766,070\n \n$\n10.22\n - $\n91.98\n$\n34.40\n \n4.96\n$\n76.5\n \nExercisable at December 31, 2023\n1,571,105\n \n$\n20.49\n - $\n91.98\n$\n44.32\n \n4.93\n$\n68.1\n \nExercisable at December 31, 2024\n1,615,687\n \n$\n20.49\n - $\n91.98\n$\n46.75\n \n4.15\n$\n43.6\n \nThe aggregate intrinsic value of outstanding options is calculated as the difference between (i) the closing price of the common stock at the end of the period and (ii) the exercise price of the underlying awards, multiplied by the number of outstanding options as of the end of the period that had an exercise price less than the closing price on that date. The aggregate intrinsic value of options exercised, determined as of the exercise date, was approximately $\n4.2\n million and $\n24.3\n million for the years ended December 31, 2024 and 2023, respectively. \nNo\n options were exercised in the year ended December 31, 2022.\nThe Company estimated the fair value of each option granted on the date of grant using the Black-Scholes option-pricing model, using the assumptions in the following table:\n \nYear Ended December 31,\n \n2024\n2023\n2022\nDividend yield\n0\n \n%\n0\n \n%\n0\n \n%\nExpected volatility\n35\n \n%\n35\n \n%\n31\n \n%\nRisk-free interest rate\n4.28\n \n%\n3.96\n \n%\n1.89\n \n%\nExpected life (in years)\n5\n5\n5\nWeighted-average grant date fair value\n$\n31.57\n \n$\n28.87\n \n$\n20.43\n \nF-40\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe expected dividend yield is determined based on the Company's past cash dividend history and anticipated future cash dividend payments. The Company has never declared nor paid any dividends on its common stock and does not anticipate paying any dividends on its common stock during the foreseeable future, but intends to retain any earnings for future growth of its business. Expected volatility is calculated based on historical volatility of the daily closing price of the Company's common stock over a period consistent with the expected life of the options granted. The risk-free interest rate is based on the U.S. Treasury rate with terms similar to the expected life of the options granted. The expected life for the options is determined based on multiple factors, including historical employee behavior patterns of exercising options and post-employment termination behavior as well as expected future employee option exercise patterns. \nThe following table summarizes information regarding options outstanding at December 31, 2024:\n \n Options Outstanding\n Options Exercisable\nRange of\nExercise Price\n Number of\nShares\nWeighted-Average Remaining Contractual Life (in years)\nWeighted-\nAverage\nExercise Price\nNumber of\nShares\nWeighted-\nAverage \nExercise Price\n$\n20.49\n - $\n27.35\n346,000\n \n2.16\n$\n20.49\n \n346,000\n \n$\n20.49\n \n$\n27.36\n - $\n37.02\n354,090\n \n3.16\n$\n34.21\n \n354,090\n \n$\n34.21\n \n$\n37.03\n - $\n53.24\n343,000\n \n4.10\n$\n39.82\n \n343,000\n \n$\n39.82\n \n$\n53.25\n - $\n72.04\n430,200\n \n5.89\n$\n66.90\n \n373,798\n \n$\n66.84\n \n$\n72.05\n - $\n91.98\n431,300\n \n7.75\n$\n84.40\n \n198,799\n \n$\n88.94\n \n1,904,590\n \n4.80\n$\n51.48\n \n1,615,687\n \n$\n46.75\n \nRestricted Stock Awards\nThe Compensation Committee of the Board of Directors of the Company historically approved grants of restricted common stock to employees and directors of the Company that vest over a specific service period and to executive officers that vest based on the achievement of certain performance conditions, primarily, the achievement of a \nthree-year\n cumulative revenue goal established at the grant date. The grant of awards with performance conditions supports the Company’s goal of aligning executive incentives with long-term stockholder value and ensuring that executive officers have a continuing stake in the long-term success of the Company.\nThe vesting of restricted common stock is subject to continuing employment requirements. Certain performance-based restricted common stock awards are also subject to a market condition such that the actual number of shares that vest at the end of the respective \nthree-year\n period is determined based on the Company’s achievement of performance goals and an established Company specific TSR factor relative to the S&P 500 Index over the same \nthree-year\n performance period. At the end of the \nthree-year\n performance period, if the performance condition is achieved at or above the pre-established threshold, the number of shares earned is further adjusted by a TSR payout percentage, which ranges between \n80\n% and \n120\n%, based on the Company’s TSR performance relative to that of S&P 500 Index over the respective \nthree-year\n period.\nThe Company estimates the fair value of its equity awards with both a performance and market condition on the date of grant using a Monte-Carlo simulation valuation model. This pricing model uses multiple simulations to evaluate the probability of achieving the market condition to calculate the fair value of the awards. Expense is only recorded for awards that are expected to vest, net of estimated forfeitures.\n \nThe assumptions used to estimate the fair value of awards with both a performance and a market condition were as follows:\n \nYear Ended December 31,\n \n2024\n2023\n2022\nDividend yield\n0\n \n%\n0\n \n%\n0\n \n%\nExpected volatility\n34\n \n%\n37\n \n%\n34\n \n%\nRisk-free interest rate\n4.47\n \n%\n4.31\n \n%\n1.71\n \n%\nExpected life (in years)\n3\n3\n3\nWeighted-average grant date fair value\n$\n86.96\n \n$\n81.58\n \n$\n71.19\n \nF-41\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe expected dividend yield is determined based on the Company's past cash dividend history and anticipated future cash dividend payments. The Company has never declared nor paid any dividends on its common stock and does not anticipate paying any dividends on its common stock during the foreseeable future, but intends to retain any earnings for future growth of its business. Expected volatility is calculated based on historical volatility of the daily closing price of the common stock of the companies within the S&P 500 Index over a period consistent with the expected life of the awards. The risk-free interest rate is based on the U.S. Treasury rate with terms similar to the expected life of the awards. The expected life is consistent with the performance measurement period of the awards.\nAs of December 31, 2024, the Company determined that it was probable that at least the minimum performance goals associated with restricted stock awards with performance and market conditions granted during 2024, 2023, and 2022 would be met by their forfeiture dates. The Company recorded a total of approximately $\n6.8\n million, $\n13.6\n million, and $\n11.9\n million of stock-based compensation expense related to restricted stock awards with performance and market conditions for the years ended December 31, 2024, 2023, and 2022, respectively. As of December 31, 2024, the Company expects to record an aggregate stock-based compensation expense of approximately $\n11.6\n million for restricted stock awards with performance and market conditions over the periods 2025, 2026, and 2027.\nThe following table presents unvested restricted stock awards activity for the year ended December 31, 2024:\nRestricted Stock Awards — without Market Condition\nRestricted Stock Awards — with Market Condition\n \nNumber of\nShares\nWeighted-Average\nGrant Date\nFair Value per Share\nNumber of\nShares\nWeighted-Average\nGrant Date\nFair Value per Share\nUnvested restricted stock awards at December 31, 2023\n2,139,911\n \n$\n70.38\n \n681,120\n \n$\n83.56\n \nGranted\n1,456,895\n \n$\n81.70\n \n320,640\n \n$\n86.96\n \nVested\n(\n789,329\n)\n$\n71.69\n \n(\n128,000\n)\n$\n99.73\n \nCanceled\n(\n252,488\n)\n$\n73.81\n \n(\n140,560\n)\n$\n87.38\n \nUnvested restricted stock awards at December 31, 2024\n2,554,989\n \n$\n76.19\n \n733,200\n \n$\n81.49\n \nRestricted Stock Units\nThe following table presents unvested restricted stock units activity for the year ended December 31, 2024:\n \nNumber of\nUnits\nWeighted-Average\nGrant Date\nFair Value per Share\nUnvested restricted stock units at December 31, 2023\n22,919\n \n$\n67.43\n \nGranted\n10,780\n \n$\n83.98\n \nVested\n(\n7,768\n)\n$\n68.61\n \nCanceled\n(\n2,399\n)\n$\n76.66\n \nUnvested restricted stock units at December 31, 2024\n23,532\n \n$\n73.88\n \nManagement Stock Purchase Plan\nThe Board of Directors adopted the Company’s Management Stock Purchase Plan in December 2017 with the intent of providing selected key employees of the Company and its subsidiaries, including the Company's executive officers, the opportunity to defer a portion of their cash incentive compensation and to align management and stockholder interests through awards of DSUs under the MSPP and awards of Matching RSUs issued under the 2016 Plan. Under this plan participants are permitted to elect to defer up to \n100\n% of their annual incentive bonus or commissions earned during the year by submitting an irrevocable election in accordance with Section 409A of the Internal Revenue Code, as amended. On the date the incentive bonus or commission would otherwise be paid in cash (typically during the following calendar year), the Company awards the \nF-42\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nparticipant DSUs representing the number of shares of common stock with an aggregate fair market value on that date equal to the amount of compensation elected to be deferred under the MSPP. On the same date the DSUs are awarded, the participant receives a grant of Matching RSUs covering the number of shares of common stock equal up to \n100\n% of the DSUs granted. The expense related to the DSUs is recognized on a straight-line basis during the period that the related incentive bonus or commission is earned. The Company granted \n57,498\n and \n82,374\n DSUs during the years 2024 and 2023, respectively. The expense related to the Matching RSUs is recognized over the \nfour-year\n vesting period following the grant date. \nThe following tables presents the Matching RSU activity for the year ended December 31, 2024:\n \nNumber of Matching RSU\nShares\nWeighted-Average\nGrant Date\nFair Value per Share\nUnvested MSPP restricted stock units at December 31, 2023\n196,967\n \n$\n66.61\n \nGranted\n57,498\n \n$\n88.27\n \nVested\n(\n20,420\n)\n$\n66.39\n \nCanceled\n(\n59,315\n)\n$\n71.30\n \nUnvested MSPP restricted stock units at December 31, 2024\n174,730\n \n$\n72.17\n \nEmployee 401(k) Plan\nThe Company maintains a 401(k) Plan as a defined contribution retirement plan for all eligible employees. The 401(k) Plan provides for tax-deferred contributions of employees’ salaries, limited to a maximum annual amount as established by the IRS. In addition to the traditional 401(k), effective January 1, 2015, eligible employees have the option of making an after-tax contribution to a Roth 401(k) plan or a combination of both. In each of 2024, 2023, and 2022, the Company matched \n100\n% of employee contributions up to a maximum of \n4\n% of total compensation. Amounts contributed to the 401(k) Plan by the Company to match employee contributions for the years ended December 31, 2024, 2023, and 2022 were approximately $\n26.2\n million, $\n25.5\n million, and $\n21.5\n million, respectively. The Company had \nno\n administrative expenses in connection with the 401(k) Plan for each of the years ended December 31, 2024, 2023, and 2022.\nEmployee Pension Plan\nThe Company maintains a GPP Plan for all eligible employees in the Company’s U.K. offices. The GPP Plan is a defined contribution plan. Employees are eligible to contribute a portion of their salaries, subject to a maximum annual amount as established by Her Majesty's Revenue and Customs. In each of 2024, 2023, and 2022, the Company's matching contribution was based on the percentage contributed by the employee, up to a maximum of \n6\n% of total compensation. Amounts contributed to the GPP Plan by the Company to match employee contributions for the years ended December 31, 2024, 2023, and 2022, were approximately $\n2.0\n million, $\n1.2\n million, and $\n1.0\n million, respectively.\nRegistered Retirement Savings Plan\nAs of January 1, 2015, the Company introduced a RRSP for all eligible employees in the Company’s Canadian offices. In each of the years ended December 31, 2024, 2023, and 2022, the Company matched \n100\n% of employee contributions up to a maximum of \n4\n% of total compensation. Amounts contributed to the RRSP by the Company to match employee contributions were approximately $\n0.2\n million, $\n0.2\n million, and $\n0.1\n million for both of the years ended December 31, 2024, 2023, and 2022, respectively. \nEmployee Stock Purchase Plan\nAs of August 1, 2006, the Company introduced an ESPP, pursuant to which eligible employees participating in the plan authorize the Company to withhold specified amounts from the employees’ compensation and use the withheld amounts to purchase shares of the Company's common stock at \n90\n% of the market price. Participating employees are able to purchase common stock under this plan during each offering period. An offering period begins the second Saturday before each of the Company’s regular pay dates and ends on each of the Company’s regular pay dates. On June 2, 2021, the Company’s stockholders approved an amendment to the ESPP to increase the number of shares available for purchase under the ESPP by \n1\n million shares. The Company registered the issuance of these additional shares under the ESPP pursuant to the registration statement filed on July 28, 2021. There were \n544,587\n and \n782,328\n shares available for purchase under the ESPP as of \nF-43\nCOSTAR GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024 and 2023, respectively, and approximately \n237,741\n and \n227,939\n shares of the Company’s common stock were purchased under the ESPP during 2024 and 2023, respectively.\n \n18.    \nSUBSEQUENT EVENTS\nStock Repurchase Program\nIn February 2025, the Board of Directors approved the Stock Repurchase Program which authorizes, but does not obligate, the repurchase of up to $\n500\n million of the Company’s common stock. Repurchases may be made from time to time at management's discretion, and the timing and amount of any such repurchases will be determined based on share price, market conditions, legal requirements, and other relevant factors. The program has no time limit and can be discontinued at any time at the Company’s discretion. There can be no assurance as to the timing or number of shares of any repurchases in the future. Purchases of shares of the Company's common stock under the Stock Purchase Program will be recorded as treasury stock.\nF-44"
}