{
  "ticker": "CTAS",
  "cik": "0000723254",
  "company_name": "CINTAS CORP",
  "filing_date": "2025-07-28",
  "accession": "0000723254-25-000017",
  "primary_doc": "ctas-20250531.htm",
  "item1_text": "Item 15.\nExhibits and Financial Statement Schedules\n65\nItem 16.\nForm 10-K Summary\n67\n2\nPart I\nItem 1.  Business\nOverview\nCintas Corporation (Cintas, Company, we, us or our), a Washington corporation, helps more than one million businesses of all types and sizes, primarily in the United States (U.S.), as well as Canada and Latin America, get \nREADY™\n to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, shop towels, restroom supplies, workplace water services, first aid and safety products, eye-wash stations, safety training, fire extinguishers, sprinkler systems and alarm testing, Cintas helps customers get \nReady for the Workday\n®\n.\n \nCintas was founded in 1968 by Richard T. Farmer when he left his family's industrial laundry business in order to develop uniform programs using an exclusive new fabric. In the early 1970's, Cintas acquired the family industrial laundry business. Over the years, Cintas developed additional products and services that complemented its core uniform business and broadened the scope of products and services available to its customers.\nBusiness Segments\nCintas’ reportable operating segments are the Uniform Rental and Facility Services operating segment and the First Aid and Safety Services operating segment. The Uniform Rental and Facility Services reportable operating segment consists of the rental and servicing of uniforms and other garments, including flame resistant clothing, mats, mops and shop towels and other ancillary items. In addition to these rental items, restroom cleaning services and supplies and the sale of items from our catalogs to our customers on route are included within this reportable operating segment. The First Aid and Safety Services reportable operating segment consists of first aid and safety products and services, as well as workplace water services. The remainder of Cintas’ business, which consists of the Fire Protection Services operating segment and the Uniform Direct Sale operating segment, is included in All Other. \nThe following table sets forth Cintas' total revenue and the revenue derived from each reportable operating segment and the remaining operating segments included in All Other for the fiscal years ended May 31:\n(In thousands)\n2025\n2024\n2023\nUniform Rental and Facility Services\n$\n7,976,073 \n$\n7,465,199 \n$\n6,897,130 \nFirst Aid and Safety Services\n1,218,090 \n1,067,334 \n951,496 \nAll Other\n1,146,018 \n1,064,082 \n967,143 \nTotal Revenue \n$\n10,340,181 \n$\n9,596,615 \n$\n8,815,769 \nAdditional information regarding each reportable operating segment and All Other is also included in \"Item 8. Financial Statements and Supplementary Data,\" in \nNote 14\n entitled Operating Segment Information of \"Notes to Consolidated Financial Statements.\"\nCustomers\nWe provide our products and services to over one million businesses of all types, from small service and manufacturing companies to major corporations that employ thousands of people. This diversity in customer base results in no individual customer accounting for greater than one percent of Cintas' total revenue. As a result, the loss of one account would not have a material financial impact on Cintas.\nCompetition\nThe primary markets served by each of the Cintas operating segments are local in nature and highly fragmented. Cintas competes with national, regional and local providers, large national retailers and small local retailers as well as companies with a significant online presence and the level of competition varies at each of Cintas' local operations. In addition, businesses may decide to perform certain services in-house instead of outsourcing these services. Product, design, price, quality, service and convenience to the customer are the competitive elements in each of our operating segments.\n3\nOperations and Distribution\nWithin the Uniform Rental and Facility Services reportable operating segment, Cintas provides its products and services to customers via local delivery routes originating from rental processing plants and branches. Within the First Aid and Safety Services reportable operating segment and All Other, Cintas provides its products and services via its distribution network and local delivery routes or local representatives. At May 31, 2025, Cintas, in total, had approximately 12,100 local delivery routes, 478 operational facilities and 12 distribution centers. \nSourcing\nCintas is committed to sourcing responsibly. Cintas sources finished products from many outside suppliers. As mentioned on our website, www.cintas.com, each and every supplier must comply with a vendor code of conduct as a condition of doing business with Cintas. Cintas also conducts internal training to ensure that employee-partners who have direct responsibility for supply chain management are knowledgeable and aware of issues and concerns surrounding our supply chain. In addition to sourcing from third-party suppliers, Cintas operates five manufacturing facilities that provide for standard uniform needs. Cintas purchases fabric, used in the manufacturing of its products, from several suppliers. Cintas' ability to find qualified suppliers who meet its standards and to access products in a timely and efficient manner, is subject to ongoing market risks. For a discussion of the risks associated with sourcing that may materially impact Cintas, please see \""
}