{
  "ticker": "CTVA",
  "cik": "0001755672",
  "company_name": "Corteva, Inc.",
  "filing_date": "2025-02-14",
  "accession": "0001755672-25-000005",
  "primary_doc": "ctva-20241231.htm",
  "item1_text": "ITEM 1.  BUSINESS\nUnless otherwise indicated or the context otherwise requires, references in this Annual Report on Form 10-K to:\n•\n\"Corteva\" or \"the company\" refers to Corteva, Inc. and its consolidated subsidiaries (including EIDP);\n•\n\"EIDP\" refers to EIDP, Inc. (formerly known as E. I. du Pont de Nemours and Company) and its consolidated subsidiaries or EIDP, Inc. excluding its consolidated subsidiaries, as the context may indicate;\n•\n\"DowDuPont\" refers to DowDuPont Inc. and its subsidiaries prior to the Separation (as defined below) of Corteva;\n•\n\"Historical Dow\" refers to The Dow Chemical Company and its consolidated subsidiaries prior to the Internal Reorganization as defined below;\n•\n\"Historical DuPont\" and \"Historical EID\" refers to EIDP prior to the Internal Reorganization (as defined below);\n•\n\"Dow\" refers to Dow Inc. after its separation from DowDuPont;\n•\n\"DuPont\" refers to DuPont de Nemours, Inc. after the Separation of Corteva; and\n•\n\"Merger\" refers to the all-stock merger of equals strategic combination between Historical Dow and Historical DuPont.\n \nBackground \nCorteva is a leading global provider of Seed and Crop Protection solutions focused on the agriculture industry and contributing to a healthier, more secure and sustainable food supply. Corteva was incorporated in Delaware in March 2018 and maintains its business headquarters in Indianapolis, Indiana. With one of the broadest and most productive new product pipelines in the agriculture industry, Corteva is focused on progressing science-based innovations, which aim to deliver a wide range of improved agriculture products and services to its customers. The company leverages its rich heritage of scientific achievement to advance its robust innovation pipeline and continue to shape the future of responsible agriculture. New products are crucial to solving farmers’ productivity challenges amid a growing global population while addressing natural resistance, evolving environmental environments and weather patterns, regulatory changes, safety requirements and competitive dynamics. The company’s investments\n \nseek to generate returns through providing farmers with technology-based and solution-based product offerings to meet these evolving production needs. Meanwhile, through Corteva’s unique routes to market, the company continues to work face-to-face with farmers around the world to understand their needs. \nThe company's broad portfolio of agriculture solutions fuels farmer productivity in approximately 110 countries. See Note 22 - Geographic Information, to the Consolidated Financial Statements, for details on the location of the company's sales and property. \nOn June 1, 2019, Corteva, Inc. became an independent, publicly traded company through the completed separation (the “Separation”) of the agriculture business of DuPont de Nemours, Inc. (formerly known as DowDuPont Inc.) (“DuPont” or \"DowDuPont\").  \nAs a result of the Internal Reorganization (defined below), on May 31, 2019, EIDP was contributed to Corteva, Inc. and, as a result, Corteva, Inc. owns 100% of the outstanding common stock of EIDP. Shares of EIDP preferred stock, $3.50 Series and $4.50 Series, issued and outstanding immediately prior to the Separation remain issued and outstanding and were unaffected by the Separation. Prior to March 31, 2019, Corteva, Inc. had engaged in no business operations and had no assets or liabilities of any kind, other than those incident to its formation.\nInternal Reorganizations and Business Separations\nSubsequent to the Merger, Historical Dow and EIDP engaged in a series of internal reorganization and realignment steps to realign their businesses into three subgroups: agriculture, materials science and specialty products (\"Internal Reorganization\"). On April 1, 2019, DowDuPont completed the separation of its materials science business into a separate and independent public company, Dow, Inc. \nOn April 1, 2019, Historical Dow entities, which held certain assets and liabilities aligned with Historical Dow’s agriculture business and the assets and liabilities associated with its specialty products business, respectively, were transferred and conveyed to DowDuPont.\nOn April 1, 2019 and May 1, 2019, EIDP’s materials science and specialty products entities, along with their respective assets and liabilities, were conveyed to Dow and DowDuPont, respectively. On May 2, 2019, DowDuPont conveyed Historical Dow agricultural entities to EIDP. \n 3\nTable Of Contents\nPart I\nITEM 1.  BUSINESS,\n \ncontinued\nOn May 6, 2019, the Board of Directors of DowDuPont approved the distribution of all the then issued and outstanding shares of common stock of Corteva, Inc., then a wholly-owned subsidiary of DowDuPont, to DowDuPont stockholders. On May 31, 2019, DowDuPont contributed EIDP to Corteva, Inc. and on June 1, 2019, the Separation was completed. Corteva, Inc.'s common stock began trading on the New York Stock Exchange under the ticker symbol \"CTVA\" on June 3, 2019.\nSeparation Agreements\nIn connection with their ultimate separation, DuPont, Corteva, and Dow (together, the “Parties” and each a “Party”) have entered into certain agreements to effect the separation, provide for the allocation of DowDuPont’s assets, employees, liabilities and obligations (including its investments, property and employee benefits and tax-related assets and liabilities) among the Parties, and provide a framework for Corteva's relationship with Dow and DuPont following the separations. The Parties entered into the following agreements:\n•\nSeparation and Distribution Agreement - Effective April 1, 2019, the Parties entered into an agreement that sets forth, among other things, governance of certain aspects of the Parties’ ongoing relationships after the completion of their respective separations (the \"Corteva Separation Agreement\").\n•\nTax Matters Agreement - The Parties entered into an agreement effective as of April 1, 2019, as amended on June 1, 2019, that governs their respective rights, responsibilities and obligations with respect to tax liabilities and benefits, tax attributes, the preparation and filing of tax returns, the control of audits and other tax proceedings and other matters regarding taxes.\n•\nEmployee Matters Agreement - The Parties entered into an agreement effective as of April 1, 2019, that identifies employees and employee-related liabilities (and attributable assets) allocated (either retained, transferred and accepted, or assigned and assumed, as applicable) to the respective Parties.\n•\nIntellectual Property Cross-License Agreement - Effective as of April 1, 2019 Corteva and Dow, and effective June 1, 2019, Corteva and DuPont, entered into Intellectual Property Cross-License Agreements. The Intellectual Property Cross-License Agreements set forth the terms and conditions under which the applicable Parties may use in their respective businesses, certain know-how (including trade secrets), copyrights, and software, and certain patents and standards, allocated to another Party pursuant to the Corteva Separation Agreement.\n•\nLetter Agreement - Effective as of June 1, 2019 DuPont and Corteva entered into a Letter Agreement. The Letter Agreement sets forth certain additional terms and conditions related to the Separation, including certain limitations on each party’s ability to transfer certain businesses and assets to third parties without assigning certain of such party’s indemnification obligations under the Corteva Separation Agreement to the other party to the transferee of such businesses and assets or meeting certain other alternative conditions.\nBusiness Segments\nThe company’s operations are managed through two reportable segments: Seed and Crop Protection. The Seed segment develops and supplies commercial seed combining superior germplasm with advanced traits to produce high yield potential for farmers around the world. The Crop Protection segment supplies products to protect crop yields against weeds, insects and disease, enabling farmers to achieve optimal results. The combination of these leading platforms creates one of the broadest portfolios of agriculture solutions in the industry. Additional information with respect to business segment results is included in Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations, on page 39 of this report and Note 23 - Segment Information, to the Consolidated Financial Statements.\n 4\nTable Of Contents\nPart I\nITEM 1.  BUSINESS,\n \ncontinued\nSeed\nThe Seed segment is a global leader in developing and supplying commercial seed combining advanced germplasm and traits that produce optimum yield for farms around the world. The company’s Seed segment is a leader in many key seed markets, including North America corn and soybeans, Europe corn and sunflower, as well as Brazil, India, South Africa and Argentina corn. The company offers trait technologies that improve resistance to weather, disease, insects, herbicides used to control weeds and enhance food and nutritional characteristics, and digital solutions that assist farmer decision-making to help maximize yield and profitability. \nA summary of the Seed segment’s net sales by major product line and geographic region (based on customer location) are as follows:\n \nProducts and Brands \nThe Seed segment’s major brands and technologies, by key product line, are listed below:\nSeed Solutions Brands\nPioneer\n® \nseeds; Brevant\n®\n seeds; Dairyland Seed\n®\n; Hoegemeyer\n® \nhybrids; Nutech\n®\n seed; Seed Consultants\n®\n; AgVenture\n® \nbrand; Cordius®, Licensing Division of Corteva Agriscience, DUO\n®\n hybrid corn, NEXSEM\n®\n corn, Nord\nTM\n semillas; PhytoGen\n®\n cotton; Pannar™\n \nbrand corn\nSeed Solutions Traits and Technologies\nENLIST™ corn; ENLIST E3™ soybeans; ENLIST™ cotton; Enlist™ weed control system;  Herculex® Insect Protection; Herculex® XTRA Insect Protection; Leptra® insect protection technology offering protection against above ground pests; PowerCore® corn, PowerCore® Ultra corn, PowerCore® Enlist™ corn, PowerCore® Ultra Enlist™ corn, POWERCORE® trait technology family of products; Optimum® AcreMax® family of products offering above and below ground insect protection; REFUGE ADVANCED® trait technology; SMARTSTAX® trait technology; NEXERA® canola trait; Omega-9 Oils; Pioneer® brand Optimum® AQUAmax® products; Pioneer® brand A-Series soybeans; Pioneer® brand Plenish® high oleic soybeans; ExpressSun® herbicide tolerant trait; Pioneer Protector® products for canola, sunflower and sorghum; Pioneer MAXIMUS® rapeseed hybrids; Qrome® corn; Clearfield® canola; PROPOUND™ advanced canola meal; Vorceed™ Enlist™ products; Conkesta®; Conkesta E3® soybeans; WideStrike™ Insect Protection; WideStrike™ 3 Insect Protection; Inzen® trait; BOLT® technology; STS® herbicide tolerant trait; MAXIMUS®  canola hybrids; CottonBest ® program; Brevant® Protector products; Optimum® GLY herbicide tolerance trait Optimum® AcreMax® insect protection; Optimum® AcreMax® Leptra® insect protection; Optimum® AcreMax® Xtra insect protection; Optimum® AcreMax® XTreme insect protection; Bovalta® BMR products; Optimum® Intrasect® insect protection; Optimum® Leptra® insect protection\nOther\nLumiGEN™ seed treatments; Lumisena™; Lumiverd®; Lumiscend®; Lumiscend® Pro; Lumisure®; Lumiflex™; Lumiante™; LumiTreo™; Dermacor™ X-100; Vertisan® ST; Lumiderm®; Lumivia™ CPL; Lumivia™ and Lumialza™\n 5\nTable Of Contents\nPart I\nITEM 1.  BUSINESS,\n \ncontinued\nIn connection with the validation of breeding plans and large-scale product development timelines focused on rapidly ramping up differentiated technology solutions, in 2019 the company began accelerating the ramp up of the Enlist E3\nTM\n trait platform in the company’s soybean portfolio mix across all brands, including Pioneer\n®\n brands. Due to the five-year ramp-up of Enlist E3\nTM\n, the company significantly reduced the volume of products with the Roundup Ready 2 Yield\n®\n and Roundup Ready 2 Xtend\n® \nherbicide tolerance traits beginning in 2021, with expected minimal use of the Roundup Ready 2 Yield\n®\n and Roundup Ready 2 Xtend\n®\n traits thereafter for the remaining term of the non-exclusive license with the Monsanto Company. Refer to Prepaid Royalties within the Critical Accounting Estimates section on page 55 for additional information.\nDistribution\nThe Seed segment has a diverse worldwide network which markets and distributes the company’s brands to customers, primarily through the company’s multi-channel, multi-brand strategy, which includes four differentiated channels: Pioneer agency model, regional brands, retail brands, as well as third parties through licensing and distribution channels.\nThe Pioneer agency model is unique to Corteva and represents sales made directly to farmers via independent sales representatives. Through this agency model, the company interacts directly with farmers at multiple points in the growing season, from prior to planting all the way through harvest. These regular interactions enable the company to provide the advice and service farmers need while giving the company real-time insights into the customers’ future ordering decisions. The company’s regional brands connect to customers through regional brand employees and farmer-dealer networks. Retail brands provide a one-stop shop for seed and chemistry solutions and may include sales to distributors, agricultural cooperatives, and dealers. Finally, Corteva out-licenses traits and germplasm to third parties.\nKey Raw Materials\nThe key raw materials for the Seed segment include corn and soybean seeds. To produce high-quality seeds, the company contracts with third-party growers globally. Corteva focuses on production close to the customer to provide the seed product, which is suitable for that region and its weed, insect and disease challenges, weather, soil and other conditions. The company conditions and packages the seeds using its own plants and third-party contract manufacturers. By striking a balance between owning production facility assets directly and contracting with third-party growers, the company believes it is best able to maintain flexibility to react to demand changes unique to each geography while minimizing costs. The company seeks to collaborate with strategic seed growers and share its digital agronomy and product management knowledge with them. The company’s third-party growers are an important part of its supply chain. Corteva provides them with rigorous training, planning tools and access to a system that tests and advances products matched to specific geographic needs.\nThe Seed segment's research and development (\"R&D\") and supply chain groups work seamlessly to select and maintain product characteristics that enhance the quality of its seed products and solutions. Corteva focuses on customer-driven innovation to deliver superior germplasm and trait technologies. With its large sets of digitized data and its seed field management solution, the company can manage its field operations efficiently and draw insights from data quickly and effectively. This allows the company’s supply chain to react quickly to changing customer needs and provides R&D with tremendous amounts of data to analyze and incorporate into resource allocation decisions. The company continues to invest in and build capabilities that drive value via data digitization and analytics that enable it to create an even more responsive and efficient answer to customer needs.\n 6\nTable Of Contents\nPart I\nITEM 1.  BUSINESS,\n \ncontinued\nCrop Protection\nThe Crop Protection segment serves the global agricultural input industry with products that protect against weeds, insects and other pests, and disease, and that support overall crop health both above and below ground via nitrogen management and seed-applied technologies. The segment's crop protection solutions and digital solutions provide farmers tools to improve productivity and profitability, and help keep fields free of weeds, insects and diseases. The company is a leader in global herbicides, insecticides, nitrogen stabilizers, pasture and range management herbicides and biologicals.\nA summary of the Crop Protection segment’s net sales by major product line and geographic region (based on customer location) are as follows:\n \nProducts and Brands\n \nThe Crop Protection segment’s major brands and technologies, by key product line, are listed below:\nInsect and Nematode Management\nCLOSER™; DELEGATE\n®\n; INTREPID\n®\n; ISOCLAST™; EXALT®; PEXALON™; TRANSFORM™; VYDATE\n®\n; OPTIMUM\n®\n; Reklemel™; SALIBRO™; PYRAXALT™; QALCOVA™; JEMVELVA™; RADIANT™; SENTRICON\n®\n; ENTRUST\n®\n SC; SUCCESS®; TRACER™; LANNATE®; EXPEDITION®; SPINTOR®\nDisease Management\nAPROACH PRIMA\n®\n; VESSARYA\n®\n; APROACH\n®\n; APROACH POWER\n®\n; VIOVAN\n®\n; TALENDO™; VERBEN\n®\n; EQUATION PRO\n®\n; EQUATION CONTACT\n®\n; ZORVEC™; INATREQ™; CURZATE™; TANOS\n®\n; BIM® MAX; BEAM®; FONTELIS™; ACANTO™; GALILEO\n®\n; UNIVOQ™\nWeed Control\nARYLEX\n®\n; ENLIST™ weed control system; ENLIST ONE™; BROADWAY™; RINSKOR™; MUSTANG\n®\n; GALLANT™; VERDICT\n®\n; KERB\n®\n; PIXXARO\n®\n; QUELEX™; KORVETTO\n®\n; REXADE™; GALLERY\n®\n; SNAPSHOT\n®\n; VIPER\n®\n; BELKAR\n®\n; WIDEMATCH\n®\n; PERFECTMATCH\n®\n; CLINCHER®; GARLON™; TORDON®; REMEDY®; PASTAR®; SONIC\n®\n; TEXARO\n®\n; KEYSTONE\n®\n; PACTO\n®\n; LIGATE\n®\n; DIMENSION\n®\n; TOPSHOT®; RICER\n®\n; LOYANT™; ROYANT®; JAGUAR®; AGIXA\nTM\n, NOVIXID\n®\n, NOVLECT™; REALM\n®\n Q; LONTREL\n®\n; GRAZON\n®\n; PAXEO\n®\n; RESICORE\n®\n REV; SPIDER\n®\n; STARANE\nTM\n; SURESTART\n®\n; COACT®; SIMPLICITY®; REZUVANT®; PALLAS™; DURACOR®; TOLVERA™; ONDECK®; GAPPER®; ELEVORE®; LADIVA®\nNitrogen Management\nINSTINCT\n®\n; N-SERVE\n®\n Nitrogen Stabilizer; FULTIME®; VOLLEY®\nBiologicals\nSTIMULATE™; UTRISHA™ N; BlueN™; STARTER™ and HARVEST MORE®\nOther\nLANDVisor™\n 7\nTable Of Contents\nPart I\nITEM 1.  BUSINESS,\n \ncontinued\nKey Raw Materials\nThe key raw materials and supplies for the Crop Protection segment include chlorinated pyridines derivatives, specialty intermediates and technical grade active ingredients, chlorine, and seed treatments. Typically, the company purchases major raw materials through long-term contracts with multiple suppliers, which sometimes require minimum purchase commitments. Certain important raw materials are supplied by a few major suppliers. The company expects the markets for its raw materials to remain balanced. The company relies on contract manufacturers, both domestically and internationally, to produce certain inputs or key components for its product formulations. These inputs are sourced globally and the company generally formulates its products close to its end customers. Shifts in customer demand, reduced local availability of raw materials, and/or production capacity constraints may, at times, necessitate sourcing from an alternative geography. The company strives to maintain multiple high-quality supply sources for each input.\nCorteva’s supply chain strategy involves managing global supplies of active and intermediate ingredients sourced regionally with global best practices and oversight. Corteva’s supply strategy includes a robust and flexible global footprint to meet future portfolio growth. The company’s supply chain also provides competitive advantages including reducing time to meet customer requirements in regions while minimizing costs through the value chain.\nSeasonality\nCorteva’s sales are generally strongest in the first half of the calendar year, which aligns with the planting and growing season in the northern hemisphere. The company typically generates about 65 percent of its sales in the first half of the calendar year, driven by northern hemisphere Seed and Crop Protection sales. The company generates about 35 percent of its sales in the second half of the calendar year, led by Seed sales in the southern hemisphere. The seasonality in sales impacts both the Seed and Crop Protection segments. The company’s direct distribution channel, where products are shipped to farmers, is more affected by planting delays than its competitors. Generally speaking, unfavorable weather slows the planting season and can affect the company’s quarterly results and sales mix. Severe unfavorable weather, however, can impact overall sales. Accounts receivable tends to be higher during the first half of the year, consistent with the peak sales period in the northern hemisphere, with cash collection focused in the fourth quarter.\nHuman Capital Management\nCorteva aims to attract the best employees, to retain those employees through offering career development and training opportunities while also prioritizing their safety and wellness in an inclusive and productive work environment. The company’s strong employee base of approximately 22,000 employees, along with its commitment to Corteva’s core values, is a key element to the success of its business.\nWorkforce Composition.  \nAs of December 31, 2024, the company globally employs approximately 22,000 employees. In order to address regional specific customer needs within its global business, the company has a geographically diverse employee base with 47 percent, 21 percent, 20 percent, and 12 percent located in North America, Latin America, EMEA, and Asia-Pacific regions, respectively. \nApproximately 2 percent of the United States workforce is unionized and another 13 percent of our global workforce participate in works councils and collective bargaining arrangements outside the United States. In 2024, the company did not experience any work stoppages due to strike or lockouts.\nSafety.  \nLiving safely is one of the company’s core values by which the company manages its business. The company has implemented safety programs and management practices to promote a culture of safety to protect its employees, as well as the environment. This includes required trainings for employees, as well as specific qualifications and certifications for certain operational employees. \nInclusion.  \nThe company has a robust inclusion and belonging vision and strategy, based upon the belief that embracing individual differences benefits the company by creating a workforce with a greater variety of skills and perspectives as a result of their differentiated backgrounds and experiences. Specific inclusion and belonging initiatives are identified and tracked to create a culture of belonging that is designed to create an inclusive environment where the best talent is attracted, retained, and engaged. Critical to creating this environment are company-sponsored employee business resource groups (“BRGs”) that support and promote certain mutual objectives of both the employee and the company, including community engagement and the professional development of employees. The BRGs are open to all employees and provide a voluntary space where employees can foster connections within a supportive environment. The company maintains nine global BRGs, each led by a member of the company’s senior leadership: Disability Awareness Network; Global African Heritage Alliance; Global \n 8\nTable Of Contents\nPart I\nITEM 1.  BUSINESS,\n \ncontinued\nIndigenous Peoples Alliance; Growing Asian Impact Network; Latin Network; Pride; Professional Learning Acceleration Network; Veteran’s Network; and Women’s Inclusion Network. \nThe company monitors its recruitment and talent development processes, in order to prevent and detect inequities and potentially discriminatory practices that could negatively impact the creation of an inclusive culture and the retention of key talent for our leadership pipeline. The company reviews its inclusion and belonging efforts through periodic engagement surveys and other measures. The results of the company’s efforts, along with its inclusion and belonging strategy, are reviewed periodically with the company’s management, and through annual reviews of the company’s leadership pipelines and inclusion and belonging programs with the People and Compensation Committee of the Board of Directors. \nExperienced Management.  \nThe company believes its management team has the experience necessary to effectively execute its strategy and advance its product pipelines and technology. The company's chief executive officer and business presidents have an average of approximately 20 years of agriculture experience and are supported by an experienced and talented management team who is dedicated to maintaining and expanding its position as a global force in the agriculture industry. \nIntellectual Property\nCorteva considers its intellectual property estate, which includes patents, trade secrets, trademarks and copyrights, in the aggregate, to constitute a valuable asset of Corteva and actively seeks to secure intellectual property rights as part of an overall strategy to protect its investment in innovations and maximize the results of its research and development program. While the company believes that its intellectual property estate, taken as a whole, provides a competitive advantage in many of its businesses, no single patent, trademark, license or group of related patents or licenses is in itself essential to the company as a whole or to any of the company’s segments.\nTrade secrets are also an important element of the company's intellectual property. Many of the processes used to make Corteva products are kept as trade secrets which, from time to time, may be licensed to third parties. Corteva vigilantly protects its intellectual property. When the company discovers that its intellectual property has been unlawfully taken, it will take measures to mitigate any potential impact, which may include civil actions seeking redress, restitution and/or damages based on loss to the company and/or unjust enrichment, as well as reporting the matter to governmental authorities for investigation and potential criminal action, as appropriate.\nPatents & Trademarks. \n Corteva continually applies for and obtains U.S. and foreign patents and has access to a large patent portfolio, both owned and licensed. Corteva’s rights under these patents and licenses, as well as the products made and sold under them, are important to the company in the aggregate. The protection afforded by these patents varies based on country, scope of individual patent coverage, as well as the availability of legal remedies in each country. This significant patent estate may be leveraged to align with the company’s strategic priorities within and across product lines. At December 31, 2024, the company owned about 5,800 U.S. patents and about 10,600 active patents outside of the U.S. \nRemaining life of granted patents owned as of December 31, 2024:\nApproximate U.S.\nApproximate Other Countries\nWithin 5 years\n1,000\n2,200\n6 to 10 years\n2,100\n5,600\n11 to 15 years\n1,900\n2,600\n16 to 20 years\n800\n200\nTotal\n5,800\n10,600\nIn addition to its owned patents, the company owns approximately 3,900 patent applications.\nThe company also owns or has licensed a substantial number of trade names, trademarks and trademark registrations in the United States and other countries, including approximately 1,800 registrations and 1,000 pending trademark applications in a number of jurisdictions.\nIn addition, the company holds multiple long-term biotechnology trait licenses from third parties in the normal course of business. Most corn hybrids and soybean varieties sold to customers contain biotechnology traits licensed from third parties under these long-term licenses.\n 9\nTable Of Contents\nPart I\nITEM 1.  BUSINESS,\n \ncontinued\nCompetition\nThe company competes with producers of seed germplasm, trait developers, and crop protection products on a global basis. The global market for products within the industry is highly competitive and the company believes competition has and will continue to intensify. Corteva competes based on germplasm and trait leadership, price, quality and cost competitiveness and the offering of a holistic solution. The company’s key competitors include BASF, Bayer, FMC, Syngenta and ChemChina, as well as companies trading in generic crop protection chemicals and regional seed companies.\nEnvironmental Matters \nInformation related to environmental matters is included in several areas of this report: (1) Environmental Proceedings beginning on page 27; (2) Management's Discussion and Analysis of Financial Condition and Results of Operations beginning on pages 58-60; and (3) Note 2 - Summary of Significant Accounting Policies, and Note 16 - Commitments and Contingent Liabilities, to the Consolidated Financial Statements.\nRegulatory Considerations\nOur Seed and Crop Protection products and operations are subject to certain approval procedures, manufacturing requirements and environmental protection laws and regulations in the jurisdictions in which we operate. We evaluate and test products throughout the research and development phases, and each new technology undergoes further rigorous scientific studies and tests to validate that the product can be used effectively and that use of the technology is safe for humans and animals and does not cause undue harm to the environment when used in accordance with the directions for use.\nThe regulatory approval processes and procedures globally are becoming increasingly more complex, which has resulted in additional testing needs, longer approval timelines that are difficult to predict, and higher development and maintenance costs. We continue to invest on an ongoing basis to keep dossiers current, respond to regulators and meet evolving regulatory standards required by global regulatory frameworks. Failure to comply with these regulations or future regulatory bans and requirements related to our products and their use may materially impact our financial performance. The increase in timelines for regulatory approvals may result in the company not achieving its sustainability targets, or its anticipated returns on research and development investments.\nRegulation of Genetically Modified Organisms (“GMOs”) and Gene Editing\nGenetically modified seed products are subject to regulatory approval processes and procedures. For example, in the United States, the Coordinated Framework for Regulation of Biotechnology governs genetically modified or gene edited organisms, using existing U.S. legislation and legal authorities on food, feed and environmental safety. Plant GMOs are regulated by the U.S. Department of Agriculture’s (the “USDA”) Animal and Plant Health Inspection Service (the “APHIS”) under the Plant Protection Act. The APHIS assesses the trait to ensure that the trait will not pose a plant pest and is not a noxious weed. GMOs in food are regulated by the Food and Drug Administration (the “FDA”) under the Federal Food, Drug, and Cosmetic Act (the “FFDCA”). The FDA ensures that the food is safe for food and feed. Pesticides and microorganisms containing GMOs are regulated by the Environmental Protection Agency (the “EPA”) pursuant to the Federal Insecticide, Fungicide and Rodenticide Act (the “FIFRA”) and the Toxic Substances Control Act. The EPA assesses the trait or the stack containing the traits to ensure that there is no unreasonable adverse effect to the environment.\nOther countries also have rigorous approval processes, procedures, and scientific testing requirements for the cultivation or import of genetically modified seed products and gene editing technology. In the United States and other countries that have functioning regulatory systems, a rigorous scientific review is conducted by these agencies to demonstrate that genetically modified and gene edited products are as safe as traditionally bred, non-biotech/GMO counterparts for food, feed and the environment. Various countries in EMEA, Latin America, and Asia Pacific have banned GMOs entirely.\nRegulation of Crop Protection Products\nGlobally, manufacturers of crop protection products, including herbicides, fungicides and insecticides are required to submit an application/dossier and obtain government regulatory approval prior to selling products in a particular country. In the United States, the EPA is responsible for registering and overseeing the approval and marketing of pesticides, pursuant to the FIFRA, the FFDCA and the Food Quality Protection Act. Also, the USDA and the FDA monitor levels of pesticide residue that is allowed on or in crops. Already registered pesticides are required to be re-registered every 15 years to ensure that those products continue to meet the rigorous safety standards set by the regulators. The EPA reevaluates pesticide tolerances at least every 10 years, taking into account ecological and human health risks, in addition to cumulative risks as a result of multiple routes and sources of exposure. For certain crop protection applications, we rely on the availability of data from the U.S. Department of Health and Human Services\n \nto address potential risks to human health. \n 10\nTable Of Contents\nPart I\nITEM 1.  BUSINESS,\n \ncontinued\nBeginning in January 2022, before registering any new conventional pesticide active ingredient, the EPA evaluates the potential effects on listed species and their designated critical habitats under the Endangered Species Act (the “ESA”). The EPA also has initiated such evaluations for certain other active ingredients in response to existing or threatened litigation. Where the EPA determines that a pesticide in the registration and re-evaluation processes “may affect” a listed species, the EPA must consult with the U.S. Fish and Wildlife Service and the National Marine Fisheries Service. As part of its approval, registration, and reevaluation processes, the EPA may impose certain use restrictions on crop protection products under the ESA. When the U.S. Fish and Wildlife Service and the National Marine Fisheries Service add additional listed specifies, the EPA may initiate new ESA evaluations. Under the citizen suit provisions, the ESA also includes citizen suit provisions that allow the public to bring suit in court against federal agencies when they believe a listed species is not being adequately protected by the EPA. FIFRA contains similar provisions that allow the public to challenge an EPA’s registration decision. These lawsuits may subject products to additional use limitations and labeling requirements and further studies, as well as result in registrations being revoked, in whole or in part.\nThe company's European operations are subject to the European chemical regulation REACH (“Registration, Evaluation, Authorisation, and Restriction of Chemicals”) and the CLP (“Classification, Labeling, and Packaging of Substances and Mixtures”). Other jurisdictions also have rigorous approval processes, procedures and scientific testing requirements for the approval of crop protection products. We continue to monitor legislative and regulatory developments related to pollution and other environmental health and safety matters.\nAvailable Information\nThe company's annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports are accessible on Corteva's website at http://investors.corteva.com by clicking on the section labeled \"Financial Information\", then on \"SEC Filings.\" These reports are made available, without charge, as soon as is reasonably practicable after the company files or furnishes them electronically with the Securities and Exchange Commission. No portion of the company's website mentioned in this report, or the materials contained on it, have been made part of this annual report on Form 10-K or incorporated herein by reference, unless such incorporation is specifically mentioned herein. \n 11\nTable Of Contents\nPart I"
}