{
  "ticker": "CVX",
  "cik": "0000093410",
  "company_name": "CHEVRON CORP",
  "filing_date": "2025-02-21",
  "accession": "0000093410-25-000009",
  "primary_doc": "cvx-20241231.htm",
  "item1_text": "Item 1. Business\nGeneral Development of Business\nSummary Description of Chevron \nChevron Corporation\n1\n, a Delaware corporation, manages its investments in subsidiaries and affiliates and provides administrative, financial, management and technology support to U.S. and international subsidiaries that engage in integrated energy and chemicals operations. Upstream operations consist primarily of exploring for, developing, producing and transporting crude oil and natural gas; processing, liquefaction, transportation and regasification associated with liquefied natural gas; transporting crude oil by major international oil export pipelines; transporting, storage and marketing of natural gas; carbon capture and storage; and a gas-to-liquids plant. Downstream operations consist primarily of refining crude oil into petroleum products; marketing of crude oil, refined products and lubricants; manufacturing and marketing of renewable fuels; transporting crude oil and refined products by pipeline, marine vessel, motor equipment and rail car; and manufacturing and marketing of commodity petrochemicals, plastics for industrial uses and fuel and lubricant additives.\nA list of the company’s significant subsidiaries is presented in \nExhibit 21.1\n.\nOverview of Petroleum Industry \nPetroleum industry operations and profitability are influenced by many factors. Prices for crude oil, natural gas, liquefied natural gas (LNG), petroleum products and petrochemicals are generally determined by supply and demand. Production levels from the members of Organization of Petroleum Exporting Countries (OPEC), Russia and the United States are the major factors in determining worldwide supply. Demand for crude oil and its products and for natural gas is largely driven by the conditions of local, national and global economies, although weather patterns, the pace of energy transition and taxation relative to other energy sources also play a significant part. Laws and governmental policies, particularly in the areas of taxation, energy and the environment, affect where and how companies invest, conduct their operations, select feedstocks, and formulate their products and, in some cases, limit their profits directly.\nStrong competition exists in all sectors of the petroleum and petrochemical industries in supplying the energy, fuel and chemical needs of industry and individual consumers. In the upstream business, Chevron competes with fully integrated, major global petroleum companies, as well as independent and national petroleum companies, for the acquisition of crude oil and natural gas leases and other properties and for the equipment and labor required to develop and operate those properties. In its downstream business, Chevron competes with fully integrated, major petroleum companies, as well as independent refining and marketing, transportation and chemicals entities and national petroleum companies in the refining, manufacturing, sale and marketing of fuels, lubricants, additives and petrochemicals. \nOperating Environment \nRefer to \nBusiness Environment and Outlook\n of this Form 10-K in Management’s Discussion and Analysis of Financial Condition and Results of Operations for a discussion of the company’s current business environment and outlook.\nChevron’s Strategic Direction\nChevron’s strategy is to leverage our strengths to safely deliver lower carbon energy to a growing world. Our objective is to safely deliver higher returns, lower carbon and superior shareholder value in any business environment. We are leveraging our capabilities, assets and customer relationships as we aim to lead in lower carbon intensity oil, products and natural gas, as well as advance new products and solutions that reduce the carbon emissions of major industries. We aim to grow our oil and gas business, lower the carbon intensity of our operations and grow new businesses in renewable fuels, carbon capture and offsets, hydrogen, power generation for data centers, and emerging technologies.\nInformation about the company is available on the company’s website at \nwww.chevron.com\n. Information contained on the company’s website is not part of this Annual Report on Form 10-K. The company’s Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to these reports filed or furnished pursuant to \n1\n \nIncorporated in Delaware in 1926 as Standard Oil Company of California, the company adopted the name Chevron Corporation in 1984 and ChevronTexaco Corporation in 2001. In 2005, ChevronTexaco Corporation changed its name to Chevron Corporation. As used in this report, the term “Chevron” and such terms as “the company,” “the corporation,” “our,” “we,” “us” and \"its\" may refer to Chevron Corporation, one or more of its consolidated subsidiaries, or all of them taken as a whole, but unless stated otherwise they do not include “affiliates” of Chevron — i.e., those companies accounted for by the equity method (generally owned 50 percent or less) or non-equity method investments. All of these terms are used for convenience only and are not intended as a precise description of any of the separate companies, each of which manages its own affairs. \n3\nTable of Contents\nSection 13(a) or 15(d) of the Securities Exchange Act of 1934 are available free of charge on the company’s website soon after such reports are filed with or furnished to the U.S. Securities and Exchange Commission (SEC). The reports are also available on the SEC’s website at \nwww.sec.gov\n.\nHuman Capital Management \nThe Chevron Way explains the company’s beliefs, vision, purpose and values. It guides how the company’s employees work and establishes a common understanding of culture and aspirations.\nChevron leadership is accountable for investing in the company’s people and culture with the objective of engaging employees to develop their full potential to help deliver energy solutions and enable human progress. This includes reviews of metrics addressing critical function hiring, leadership development, retention, diversity and inclusion, and employee engagement.\nThe following table summarizes the number of Chevron employees by sex, where data is available, and by region as of December 31, 2024.\nAt December 31, 2024\nFemale\nMale\nData not available*\nTotal Employees\nNumber of Employees\nPercentage\nNumber of Employees\nPercentage\nNumber of Employees\nPercentage\nNumber of Employees\nPercentage\nNon-Service Station Employees\nU.S.\n5,556 \n26 \n%\n15,751 \n74 \n%\n19 \n— \n%\n21,326 \n47 \n%\nOther Americas\n1,175 \n30 \n%\n2,689 \n69 \n%\n10 \n— \n%\n3,874 \n9 \n%\nAfrica\n623 \n16 \n%\n3,189 \n84 \n%\n4 \n— \n%\n3,816 \n8 \n%\nAsia\n2,577 \n36 \n%\n4,476 \n63 \n%\n13 \n— \n%\n7,066 \n16 \n%\nAustralia\n542 \n26 \n%\n1,550 \n74 \n%\n3 \n— \n%\n2,095 \n5 \n%\nEurope\n434 \n28 \n%\n1,107 \n71 \n%\n24 \n2 \n%\n1,565 \n3 \n%\nTotal Non-Service Station Employees\n10,907 \n27 \n%\n28,762 \n72 \n%\n73 \n— \n%\n39,742 \n88 \n%\nService Station Employees\n2,545 \n46 \n%\n2,372 \n43 \n%\n639 \n12 \n%\n5,556 \n12 \n%\nTotal Employees\n13,452\n \n30\n \n%\n31,134\n \n69\n \n%\n712\n \n2\n \n%\n45,298\n \n100\n \n%\n* Includes employees where data was not collected or employee chose not to disclose.\nHiring, Development and Retention\nThe company’s approach to attracting, developing and retaining a global, diverse workforce of high-performing talent is anchored by an environment of personal growth and engagement. The company’s philosophy is to offer compelling career opportunities and a competitive total compensation and benefits package linked to individual and enterprise performance. The company recruits new employees in a variety of ways, including through partnerships with universities and diversity associations. In addition, the company recruits experienced hires to provide specialized skills.\nChevron’s learning and development programs are designed to help employees build technical, operating and leadership capabilities. The company’s leadership reviews metrics on employee training and development programs, which are refined on an ongoing basis to meet the needs of the business. The company invests in developing leadership at every level, including coaching programs for frontline supervisors, managers and individual contributors. Chevron invests in developing and upskilling employees, including things such as tailored generative AI training for leaders, practitioners and the broader workforce. In addition, the company offers the Digital Scholar Program, preparing employees with advanced technology skills through one-year Master of Science degrees in Engineering and Management.\nIn addition, leadership reviews the talent pipeline, identifies and develops succession candidates, and builds succession plans for key positions. The Board of Directors provides oversight of CEO and executive succession planning. \nManagement routinely reviews the retention of its professional population, executives, all levels of management, and the majority of its regular employee population. The voluntary attrition for this population in 2024 was 3.1 percent, in line with historical rates. The voluntary attrition rate generally excludes employee departures under restructuring programs. Chevron believes its low voluntary attrition rate is in part a result of the company’s commitment to employee development, competitive pay and benefits, and culture.\n4\nTable of Contents\nDiversity and Inclusion\nChevron believes human ingenuity is best able to solve difficult problems when people with different ideas, experiences and backgrounds work together in an inclusive environment. \nThe company has 11 employee networks (voluntary groups open to all employees with shared interests). The Chairman’s Inclusion Council provides employee network presidents with a direct line of communication to the Chairman and Chief Executive Officer, the Chief Human Resources Officer, the Chief Diversity and Inclusion Officer, and the executive leadership team to discuss how employee networks can help reinforce the company’s values and achieve its business objectives. \nDiversity and inclusion at Chevron means zero tolerance for discrimination based on race, sex or other protected characteristics, and a deep respect for the cultures in which we operate. Chevron rejects the use of quotas and focuses on removing barriers to equal opportunity, fostering diversity, and ensuring that selection decisions are based on merit.\nEmployee Engagement \nEmployee engagement is an indicator of employee well-being and commitment to the company’s values, purpose and strategies. The company regularly conducts employee surveys to assess the health of the company’s culture. Our surveys indicate high levels of employee engagement compared to our industry.  \nChevron prioritizes the health, safety and well-being of its employees. The company’s safety culture empowers every member of its workforce to exercise stop-work authority without repercussion to address any potential unsafe work conditions. The company has set clear expectations for leaders to deliver operational excellence by prioritizing the safety and health of its workforce, and the protection of communities, the environment and the company’s assets. \nAdditionally, the company offers long-standing employee support programs such as Ombuds, an independent resource designed to equip employees with options to address and resolve workplace issues; a company hotline, where employees can report concerns to the Corporate Compliance department; and an Employee Assistance Program, a confidential consulting service that can help employees resolve a broad range of personal, family and work-related concerns. \n5\nTable of Contents\nDescription of Business and Properties\nThe upstream and downstream activities of the company and its equity affiliates are widely dispersed geographically, with operations and projects\n2\n in North America, South America, Europe, Africa, Asia and Australia. These activities are managed by the Oil, Products and Gas organization. Tabulations of segment income statements for the three years ended December 31, 2024, and assets as of the end of 2024 and 2023 — for the United States and the company’s international geographic areas — are in \nNote 14 Operating Segments and Geographic Data\n to the Consolidated Financial Statements. Similar comparative data for the company’s investments in and income from equity affiliates and property, plant and equipment are in \nNote 15 Investments and Advances\n and \nNote 18 Property, Plant and Equipment\n. Refer to Management’s Discussion and Analysis of Financial Condition and Results of Operations for a discussion of the company’s \nCapital Expenditures\n. \nUpstream \nReserves \nRefer to \nTable V\n for a tabulation of the company’s proved reserves by geographic area for each year-end from 2022 through 2024. Reserves governance, technologies used in establishing proved reserves additions, and major changes to proved reserves by geographic area for the three-year period ended December 31, 2024, are summarized in the discussion for Table V. Discussion is also provided regarding the nature of, status of, and planned future activities associated with the development of proved undeveloped reserves. The company recognizes reserves for projects with various development periods, sometimes exceeding five years. The external factors that impact the duration of a project include scope and complexity, remoteness or adverse operating conditions, infrastructure constraints, and contractual limitations.\nThe company’s proved reserves at year-end 2024 were approximately 9.8 billion barrels of oil-equivalent (BOE). The largest reductions from year-end 2023 were from record production and the sale of assets in Canada, and the largest additions were from extensions and discoveries in the Permian and DJ Basins. At December 31, 2024, 41 percent of the company’s net proved oil-equivalent reserves were located in the United States, 16 percent were located in Australia and 13 percent were located in Kazakhstan.\nThe net proved reserve balances at the end of each of the three years 2022 through 2024 are shown in the following table: \nAt December 31\n2024\n2023\n2022\nCrude Oil, Condensate and Synthetic Oil  — Millions of barrels\nConsolidated Companies\n3,027\n \n3,770 \n3,868 \nAffiliated Companies\n889\n \n1,007 \n1,129 \nTotal Crude Oil, Condensate and Synthetic Oil\n3,916\n \n4,777 \n4,997 \nNatural Gas Liquids  — Millions of barrels\nConsolidated Companies\n1,075\n \n1,138 \n1,002 \nAffiliated Companies\n84\n \n91 \n86 \nTotal Natural Gas Liquids\n1,159\n \n1,229 \n1,088 \nNatural Gas — Billions of cubic feet\nConsolidated Companies\n26,526\n \n28,318 \n28,765 \nAffiliated Companies\n1,849\n \n2,063 \n2,099 \nTotal Natural Gas\n28,375\n \n30,381 \n30,864 \nOil-Equivalent — Millions of barrels\n*\nConsolidated Companies\n8,523\n \n9,628 \n9,664 \nAffiliated Companies\n1,281\n \n1,441 \n1,565 \nTotal Oil-Equivalent\n9,804\n \n11,069 \n11,229 \n*\n Oil-equivalent conversion ratio is 6,000 cubic feet of natural gas = 1 barrel of crude oil\n.\n2\n \nAs used in this report, the term “project” may describe certain new upstream development activity, individual phases in a multiphase development, maintenance activities, existing assets, new investments in downstream and chemicals capacity, investments in emerging and lower carbon activities, and other activities. All of these terms are used for convenience only and are not intended as a precise description of the term “project” as it relates to any specific governmental law or regulation.\n6\nTable of Contents\nAverage Sales Prices and Production Costs per Unit of Production \nRefer to \nTable IV\n for the company’s average sales price per barrel of crude (including crude oil and condensate) and natural gas liquids (NGLs) and per thousand cubic feet of natural gas produced, and the average production cost per oil-equivalent barrel for 2024, 2023 and 2022. \nGross and Net Productive Wells \nThe following table summarizes gross and net productive wells at year-end 2024 for the company and its affiliates: \nAt December 31, 2024\nProductive Oil Wells\n1\nProductive Gas Wells\n1\nGross \nNet \nGross \nNet \nUnited States\n35,135 \n24,099 \n2,110 \n1,758 \nOther Americas\n1,277 \n752 \n— \n— \nAfrica\n1,679 \n653 \n48 \n18 \nAsia\n1,699 \n807 \n1,309 \n405 \nAustralia\n532 \n299 \n118 \n33 \nEurope\n27 \n5 \n— \n— \nTotal Consolidated Companies\n40,349 \n26,615 \n3,585 \n2,214 \nAffiliates\n2\n1,510 \n595 \n— \n— \nTotal Including Affiliates\n41,859 \n27,210 \n3,585 \n2,214 \nMultiple completion wells included above\n659 \n355 \n147 \n115 \n1\n Gross wells represent the total number of wells in which Chevron has an ownership interest. Net wells represent the sum of Chevron’s ownership interest in gross wells.\n2 \nIncludes gross 1,381 and net 466 productive oil wells for interests accounted for by the non-equity method.\nProduction Outlook\nThe company estimates its average worldwide oil-equivalent production in 2025 to increase six to eight percent over 2024, assuming a Brent crude oil price of $70 per barrel and excluding the impact of asset sales. This estimate is subject to many factors and uncertainties, as described beginning on page 40. Refer to the \nReview of Ongoing Exploration and Production Activities in Key Areas\n for a discussion of the company’s major crude oil and natural gas development projects.\nAcreage \nAt December 31, 2024, the company owned or had under lease or similar agreements undeveloped and developed crude oil and natural gas properties throughout the world. The geographical distribution of the company’s acreage is shown in the following table:\nUndeveloped\n2\nDeveloped \nDeveloped and Undeveloped \nThousands of acres\n1\nGross \nNet \nGross \nNet \nGross \nNet \nUnited States\n4,294 \n3,700 \n4,273 \n2,856 \n8,567 \n6,556 \nOther Americas\n16,503 \n11,078 \n920 \n232 \n17,423 \n11,310 \nAfrica\n13,433 \n7,098 \n1,320 \n530 \n14,753 \n7,628 \nAsia\n13,373 \n7,440 \n934 \n363 \n14,307 \n7,803 \nAustralia\n3,384 \n2,628 \n2,246 \n899 \n5,630 \n3,527 \nEurope\n106 \n21 \n12 \n2 \n118 \n23 \nTotal Consolidated Companies\n51,093 \n31,965 \n9,705 \n4,882 \n60,798 \n36,847 \nAffiliates\n3\n693 \n287 \n111 \n51 \n804 \n338 \nTotal Including Affiliates\n51,786 \n32,252 \n9,816 \n4,933 \n61,602 \n37,185 \n1 \nGross acres represent the total number of acres in which Chevron has an ownership interest. Net acres represent the sum of Chevron’s ownership interest in gross acres.\n2 \nThe gross undeveloped acres that will expire in 2025, 2026 and 2027 if production is not established by certain required dates are 2,951, 1,149, and 733, respectively.\n3 \nIncludes gross 405 and net 143 undeveloped and gross 19 and net 5 developed acreage for interests accounted for by the non-equity method.\n7\nTable of Contents\nNet Production of Crude Oil, Natural Gas Liquids and Natural Gas\n \nThe following table summarizes the net production of crude oil, NGLs and natural gas for 2024 and 2023 by the company and its affiliates. Worldwide oil-equivalent production of 3.3 million barrels per day in 2024 was up approximately seven percent from 2023, mainly due to the full-year of legacy PDC Energy, Inc. (PDC) production and growth in the Permian Basin. Refer to the \nResults of Operations\n section for a detailed discussion of the factors explaining the changes in production for liquids (including crude oil, condensate, NGLs and synthetic oil) and natural gas, and refer to \nTable V\n for information on annual production by geographical region.\nComponents of Oil-Equivalent\nOil-Equivalent\nCrude Oil\nNatural Gas Liquids\nNatural Gas\nThousands of barrels per day (MBD)\n(MBD)\n1\n(MBD)\n2\n(MBD)\n(MMCFD)\nMillions of cubic feet per day (MMCFD)\n2024\n2023\n2024\n2023\n2024\n2023\n2024\n2023\nUnited States\n1,599\n \n1,349 \n782\n \n710 \n370\n \n287 \n2,684\n \n2,112 \nOther Americas \nArgentina\n51\n \n43 \n43\n \n37 \n—\n \n— \n47\n \n36 \nCanada\n3,4\n132\n \n132 \n104\n \n109 \n6\n \n5 \n131\n \n110 \nTotal Other Americas\n183\n \n175 \n147\n \n146 \n6\n \n5 \n178\n \n146 \nAfrica \nAngola\n64\n \n67 \n52\n \n55 \n4\n \n4 \n48\n \n48 \nEquatorial Guinea\n46\n \n49 \n9\n \n11 \n5\n \n5 \n191\n \n198 \nNigeria\n129\n \n147 \n96\n \n104 \n3\n \n5 \n183\n \n227 \nRepublic of Congo\n28\n \n30 \n26\n \n28 \n—\n \n— \n10\n \n9 \nTotal Africa\n267\n \n293 \n183\n \n198 \n12\n \n14 \n432\n \n482 \nAsia \nBangladesh\n99\n \n104 \n3\n \n3 \n—\n \n— \n577\n \n610 \nChina\n29\n \n30 \n7\n \n9 \n—\n \n— \n132\n \n126 \nIndonesia\n5\n—\n \n3 \n—\n \n1 \n—\n \n— \n—\n \n11 \nIsrael\n100\n \n95 \n1\n \n1 \n—\n \n— \n592\n \n566 \nKazakhstan\n45\n \n45 \n26\n \n26 \n—\n \n— \n113\n \n114 \nMyanmar\n6\n4\n \n15 \n—\n \n— \n—\n \n— \n22\n \n87 \nPartitioned Zone\n61\n \n61 \n60\n \n60 \n—\n \n— \n5\n \n6 \nThailand\n47\n \n42 \n14\n \n10 \n—\n \n— \n200\n \n192 \nTotal Asia\n385\n \n395 \n111\n \n110 \n—\n \n— \n1,641\n \n1,712 \nAustralia\n Australia\n479\n \n488 \n40\n \n40 \n2\n \n2 \n2,625\n \n2,678 \nTotal Australia\n479\n \n488 \n40\n \n40 \n2\n \n2 \n2,625\n \n2,678 \nEurope \nUnited Kingdom\n12\n \n14 \n11\n \n12 \n—\n \n— \n7\n \n11 \nTotal Europe\n12\n \n14 \n11\n \n12 \n—\n \n— \n7\n \n11 \nTotal Consolidated Companies\n2,925\n \n2,714 \n1,274\n \n1,216 \n390\n \n308 \n7,567\n \n7,141 \nAffiliates\n7\n413\n \n406 \n286\n \n281 \n25\n \n25 \n611\n \n603 \nTotal Including Affiliates\n8\n3,338\n \n3,120 \n1,560\n \n1,497 \n415\n \n333 \n8,178\n \n7,744 \n1 \nOil-equivalent conversion ratio is 6,000 cubic feet of natural gas = 1 barrel of crude oil.\n2\n Includes crude oil, condensate and synthetic oil.\n3\n Includes synthetic oil:\n46\n \n51\n46\n \n51\n—\n \n—\n \n—\n \n— \n4\n Canada Duvernay shale and AOSP assets were sold in December 2024.\n5\n Indonesia Deepwater assets were sold in 2023.\n6 \nChevron withdrew from Myanmar in April 2024.\n7 \nVolumes represent Chevron’s share of production by affiliates, including Tengizchevroil in Kazakhstan and Angola LNG in Angola.\n8\n Volumes include natural gas consumed in operations of 609 million and 596\n \nmillion cubic feet per day in 2024 and 2023, respectively. Total “as sold” natural gas volumes were 7,569 million and 7,148 million cubic feet per day for 2024 and 2023, respectively.\nDelivery Commitments\n \nThe company sells crude oil, natural gas, and NGLs from its producing operations under a variety of contractual obligations. Most contracts generally commit the company to sell quantities based on production from specified properties, but some NGLs and natural gas sales contracts specify delivery of fixed and determinable quantities.\n8\nTable of Contents\nIn the United States, the company is contractually committed to deliver approximately 25 million barrels of NGLs and 813 billion c\nubic feet of natural gas to third parties and affiliates from 2025 through 2027. \nThe company believes it can satisfy these contracts through a combination of equity production from the company’s proved developed U.S. reserves and third-party purchases. \nThese commitments are primarily based on contracts with indexed pricing terms. \nOutside the United States, the company is contractually committed to deliver a total\n of 3.2 tr\nillion cubic feet of natural gas to third parties and affiliates from 2025 through 2027 mainly from operations in Australia and Israel. The\n Australia sales contracts contain variable pricing formulas that generally reference the prevailing market price for crude oil, natural gas or other petroleum products at the time of delivery. The sales contracts for Israel contain formulas that generally reflect an initial base price subject to price indexation, Brent-linked or other, over the life of the contract. The company believes it can satisfy these contracts from quantities available from production of the company’s proved developed reserves in these countries.\nDevelopment Activities \nRefer to \nTable I\n for details associated with the company’s development expenditures and costs of proved property acquisitions for 2024, 2023 and 2022.\nThe following table summarizes the company’s net interest in productive and dry development wells completed in each of the past three years, and the status of the company’s development wells drilling at December 31, 2024. A “development well” is a well drilled within the known area of a crude oil or natural gas reservoir to the depth of a stratigraphic horizon known to be productive. \nWells Drilling*\nNet Wells Completed \nat 12/31/24\n2024\n2023\n2022\nGross \nNet \nProd. \nDry \nProd. \nDry \nProd. \nDry \nUnited States\n451\n \n355\n \n630\n \n3\n \n697 \n2 \n454 \n2 \nOther Americas\n9\n \n8\n \n64\n \n—\n \n39 \n— \n35 \n— \nAfrica\n4\n \n2\n \n6\n \n—\n \n7 \n— \n6 \n— \nAsia\n24\n \n9\n \n72\n \n1\n \n58 \n2 \n32 \n1 \nAustralia\n—\n \n—\n \n2\n \n—\n \n3 \n— \n1 \n— \nEurope\n1\n \n—\n \n—\n \n—\n \n— \n— \n1 \n— \nTotal Consolidated Companies\n489\n \n374\n \n774\n \n4\n \n804 \n4 \n529 \n3 \nAffiliates\n3\n \n1\n \n3\n \n—\n \n4 \n— \n6 \n— \nTotal Including Affiliates\n492\n \n375\n \n777\n \n4\n \n808 \n4 \n535 \n3 \n* Gross wells represent the total number of wells in which Chevron has an ownership interest. Net wells represent the sum of Chevron’s ownership interest in gross wells.\n \n \nExploration Activities \nRefer to \nTable I\n for detail on the company’s exploration expenditures and costs of unproved property acquisitions for 2024, 2023 and 2022. \nThe following table summarizes the company’s net interests in productive and dry exploratory wells completed in each of the past three years, and the number of exploratory wells drilling at December 31, 2024. “Exploratory wells” are wells drilled to find and produce crude oil or natural gas in unknown areas and include delineation and appraisal wells, which are wells drilled to find a new reservoir in a field previously found to be productive of crude oil or natural gas in another reservoir or to extend a known reservoir.\nWells Drilling*\nNet Wells Completed \nat 12/31/24\n2024\n2023\n2022\nGross \nNet \nProd. \nDry \nProd. \nDry \nProd. \nDry \nUnited States\n2\n \n1\n \n5\n \n2\n \n— \n2 \n3 \n2 \nOther Americas\n—\n \n—\n \n1\n \n—\n \n— \n— \n1 \n1 \nAfrica\n1\n \n—\n \n1\n \n1\n \n— \n— \n1 \n— \nAsia\n—\n \n—\n \n3\n \n2\n \n1 \n— \n2 \n— \nAustralia\n—\n \n—\n \n—\n \n—\n \n— \n— \n— \n— \nEurope\n—\n \n—\n \n—\n \n—\n \n— \n— \n— \n— \nTotal Consolidated Companies\n3\n \n1\n \n10\n \n5\n \n1 \n2 \n7 \n3 \nAffiliates\n—\n \n—\n \n—\n \n—\n \n— \n— \n— \n— \nTotal Including Affiliates\n3\n \n1\n \n10\n \n5\n \n1 \n2 \n7 \n3 \n* Gross wells represent the total number of wells in which Chevron has an ownership interest. Net wells represent the sum of Chevron’s ownership interest in gross wells.\n9\nTable of Contents\nReview of Ongoing Activities in Key Areas \nChevron has exploration and production activities in many of the world’s major hydrocarbon basins. Chevron’s 2024 key upstream activities, some of which are also discussed in the section \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n, are presented below. The comments include references to “total production” and “net production,” which are defined under “Production” in \nExhibit 99.1\n. \nThe discussion that follows references the status of proved reserves recognition for significant long lead time projects not on production as well as for projects recently placed on production. Reserves are not discussed for exploration activities or recent discoveries that have not advanced to a project stage, or for mature areas of production that do not have individual projects requiring significant levels of capital or exploratory investment. Projected start-up timing for nonoperated projects are per operator’s estimate.\nUnited States\nUpstream activities in the United States are primarily located in Texas, New Mexico, Colorado, California and the Gulf of America. Acreage for the United States can be found in the \nAcreage\n table. Net daily oil-equivalent production in the United States can be found in the \nNet Production of Crude Oil, Natural Gas Liquids and Natural Gas\n table.\nAs one of the largest producers in the Permian Basin, Chevron continues to develop its advantaged portfolio of 1,780,000 net acres in the Delaware and Midland basins in west Texas and southeast New Mexico and is expected to achieve one million barrels of net oil-equivalent production per day in 2025. The asset is comprised of stacked formations enabling production from multiple geologic zones from single surface locations, staging the development for optimized capacity utilization of facilities and infrastructure. The company has implemented a factory development strategy utilizing multi-well pads to drill a series of horizontal wells that are subsequently completed using hydraulic fracture stimulation. This manufacturing-style process, combined with advantaged acreage holdings and technological advancements, have enabled productivity improvements across unique geological locations throughout the basin. Acreage transactions enabling longer laterals and the company’s diversified land assets via non-operated joint ventures and royalty positions have also contributed to higher returns. The company continued to progress water handling initiatives and ongoing emission reductions, including the partial or full electrification of drilling and hydraulic fracturing fleets, and the expansion of electricity sources with two new solar projects reaching final investment decision in 2024. Chevron’s 2024 net daily production in the Permian Basin averaged 405,000 barrels of crude oil, 251,000 barrels of NGLs and 1.6 billion cubic feet of natural gas. \nChevron also holds approximately 72,000 net acres in the Haynesville Shale in east Texas. The company continues to pursue strategic opportunities for these assets.\nChevron is the largest oil and natural gas producer in Colorado, where development is focused across approximately 580,000 net acres in the Denver-Julesburg (DJ) Basin. Chevron follows a factory development strategy utilizing multi-well pads to drill a series of horizontal wells that are subsequently completed using hydraulic fracture stimulation. It has also implemented facility design and electrification improvements to consolidate assets and remove facilities, reducing surface footprint and greenhouse gas emissions. In 2024, Chevron’s net daily production in Colorado averaged 132,000 barrels of crude oil, 107,000 barrels of NGLs and 930 million cubic feet of natural gas. Chevron also has operations in Colorado’s Piceance Basin, as well as an acreage position in Wyoming.\nIn 2024, Chevron’s California average net daily oil-equivalent production was 71,000 barrels. Chevron owns and operates between 87 and 100 percent interests in six fields including Kern River, Cymric/McKittrick, Midway Sunset, San Ardo, Coalinga and Lost Hills. The company announced its first solar-to-hydrogen production project in Kern County, which will create lower carbon hydrogen through electrolysis, utilizing solar power, land and non-potable produced water from Chevron’s existing assets.\nDuring 2024, net daily production in the Gulf of America averaged 168,000 barrels of crude oil, 10,000 barrels of NGLs and 86 million cubic feet of natural gas. Chevron is engaged in various operated and nonoperated exploration, development and production activities in the deepwater Gulf of America. Chevron also holds nonoperated interests in several shelf fields.\nChevron has a 62.9 percent-owned and operated interest in the unit areas containing the Anchor Field, located in the Green Canyon area. Stage 1 of the Anchor development that consists of a seven-well subsea development and a semi-submersible floating production unit achieved first oil in August 2024 utilizing an industry-first 20,000 pounds per square inch \n10\nTable of Contents\ndeepwater technology. Two producing wells were brought online and development drilling is progressing on subsequent wells. The field has an estimated remaining production life of 30 years.\nChevron has a 60 percent-owned and operated interest in the Ballymore Field located in the Mississippi Canyon area, which is being developed as a subsea tieback to the existing Chevron 75 percent-owned and operated Blind Faith facility. The development includes three production wells, with first oil expected in 2025. Proved reserves have been recognized for this project. \nChevron has a 60 percent-owned and operated interest in the Big Foot Field, located in the deepwater Walker Ridge area. First oil from further development is expected in 2025 and 2026. The field has an estimated remaining production life of 25 years.\nChevron has a 50 percent-owned and operated interest in the Jack Field, a 51 percent-owned and operated interest in the St. Malo Field and a 40.6 percent-owned and operated interest in the production host facility used for the joint development of both fields, all located in the Walker Ridge area. In 2024, the St. Malo Stage 4 waterflood project delivered first water injection and completed the installation of a second multi-phase subsea pump module within the St. Malo Field. An additional St. Malo well delivered first oil and further development drilling commenced in the Jack Field. The Jack/St. Malo Stage 5 project reached final investment decision (FID), with first oil expected in 2026. The Jack and St. Malo fields have an estimated remaining production life of 20 years.\nThe company has a 58 percent-owned and operated interest in the deepwater Tahiti Field, located in the Green Canyon area. In 2024, the company’s first deepwater Gulf of America producer-to-injector conversion well started water injection and an additional water injector well reached FID. The Tahiti Field surpassed 500 million barrels of oil-equivalent cumulative production in 2024 and has an estimated remaining production life of 20 years.\nThe company has a 15.6 percent nonoperated working interest in the deepwater Mad Dog Field, located in the Green Canyon area. In 2024, first water injection was achieved from the Mad Dog 2 project and additional producing wells were brought online. The field has an estimated remaining production life of more than 30 years.\nChevron has a 37.5 percent nonoperated working interest in the Perdido Regional Host, which accommodates production from the Great White, Silvertip and Tobago fields in the Alaminos Canyon area. In 2024, the Silvertip Expansion Project, in which Chevron has a 60 percent nonoperated working interest, reached FID, with first oil expected in 2026. Additional development drilling in the Great White Field is currently ongoing, with first oil expected in 2025. The Perdido asset has an estimated remaining production life of more than 15 years.\nChevron has a 25 percent nonoperated working interest in the Stampede Field, which is located in the Green Canyon area. In 2024, development drilling on a new well with tie back to the host facility commenced and first oil is expected in 2025. The Stampede Field has an estimated remaining production life of more than 20 years.\nThe company has a 40 percent nonoperated working interest in the Whale discovery located in the Alaminos Canyon area. Whale consists of a fifteen-well subsea development and floating production unit. In January 2025, first production was achieved with two producing wells brought online and development drilling in progress on subsequent wells. The field has an estimated remaining production life of more than 25 years.\nDuring 2024, Chevron was formally awarded 26 exploration blocks as a result of Gulf of America lease sale 261.\nChevron has a 50 percent interest in \nBayou Bend, a carbon dioxide transportation and sequestration affiliate that holds approximately 140,000 acres for carbon dioxide storage.\n In 2024, onshore and offshore stratigraphic wells were drilled to delineate carbon dioxide storage potential\n.\nChevron owns a majority interest in ACES Delta, LLC, a joint venture developing the Advanced Clean Energy Storage Project in Delta, Utah. The project, currently under construction, is designed to produce hydrogen made from renewable energy, store that hydrogen in two salt caverns, and deliver it as needed to hydrogen-capable gas turbines to generate power. The project is expected to be commercially operational in 2025.\nOther Americas\n“Other Americas” includes Argentina, Brazil, Canada, Colombia, Mexico, Suriname, Uruguay and Venezuela. Acreage for “Other Americas” can be found in the \nAcreage\n table. Net daily oil-equivalent production from these countries can be found in the \nNet Production of Crude Oil, Natural Gas Liquids and Natural Gas\n table.\n11\nTable of Contents\nArgentina\n Chevron has a 50 percent nonoperated interest in the Loma Campana and Narambuena concessions in the Vaca Muerta shale. At Loma Compana, 48 horizontal wells were drilled in 2024, with 46 wells in total put on production. This concession expires in 2048, and the Narambuena concession expires in 2027.\nChevron owns and operates a 100 percent interest in the El Trapial Field with conventional waterflood. The conventional field concession expires in 2032. Chevron also owns and operates a 100 percent interest in the east area of the El Trapial Field in the Vaca Muerta shale formation for unconventional development. In 2024, Chevron continued development on its unconventional resources\n \nwith one drilling rig. The unconventional concession expires in 2057.\nChevron has a 14 percent interest in a pipeline system that provides an important export route for Argentina’s crude oil. During 2024, a majority of the company’s exported crude oil was transported through this pipeline system.  Chevron is currently evaluating other strategic alternatives to increase its export capacity in the country.\nBrazil\n Chevron holds 35 percent nonoperated interests in two blocks in the Campos Basin, following the relinquishment of two blocks in 2024. Chevron secured 15 additional exploration blocks in the South Santos and Pelotas basins in 2024.\nCanada\n Upstream interests in Canada are concentrated in the offshore Atlantic region of Newfoundland and Labrador. The company also has interests in the Northeast British Columbia and the Beaufort Sea region of the Northwest Territories. \nChevron has a 26.9 percent nonoperated working interest in the Hibernia Field and a 24.1 percent nonoperated working interest in the unitized Hibernia Southern Extension areas offshore Atlantic Canada. The company has a 29.6 percent nonoperated working interest in the Hebron Field, also offshore Atlantic Canada.\nIn December 2024, the company sold its 20 percent nonoperated working interest in the Athabasca Oil Sands Project and associated Quest carbon capture and storage project in Alberta, as well as its operated assets in the Duvernay shale. \nColombia\n Chevron has a 40 percent-owned and operated interest in the offshore Colombia-3 Block. \nMexico\n All blocks in which Chevron has a participating interest are in the process of being relinquished to the government.\nSuriname\n Chevron has a 40 percent-owned and operated working interest in Block 5 and an 80 percent-owned and operated interest in the shallow water Block 7. Chevron also holds a 33.3 percent nonoperated working interest in deepwater Block 42.\nUruguay\n In 2024, Chevron acquired a 60 percent-owned and operated interest in offshore exploration Block OFF-1 with plans to initiate a 3D seismic campaign in 2025. \nVenezuela\n Chevron’s interests in Venezuela are located in western Venezuela, the Orinoco Belt and offshore Venezuela. As of December 31, \n2024,\n no proved reserves are recognized for these interests. In 2024, the company conducted activities in Venezuela consistent with the authorization provided pursuant to licenses issued by the United States government. \nChevron has a 39.2 percent interest in Petroboscan, which operates the Boscan Field in western Venezuela, as well as a 25.2 percent interest in Petroindependiente, which operates the LL-652 Field in Lake Maracaibo with licenses that expire in 2041. Chevron has a 30 percent interest in Petropiar, which operates the heavy oil Huyapari Field under an agreement\n \nexpiring in 2047, and a 35.8 percent interest in Petroindependencia, which includes the Carabobo 3 heavy oil project located in three blocks in the Orinoco Belt under a contract expiring in 2050. \nChevron also operates and holds a 60 percent interest in the Loran gas field offshore Venezuela. This is part of a cross- border field that includes the Manatee Field in Trinidad and Tobago. This license expires in 2039.\nAfrica\nIn Africa, the company is engaged in upstream activities in Angola, Cameroon, Egypt, Equatorial Guinea, Namibia and Nigeria. Acreage for Africa can be found in the \nAcreage\n table. Net daily oil-equivalent production from these countries can be found in the \nNet Production of Crude Oil, Natural Gas Liquids and Natural Gas\n table.\nAngola\n The company operates and holds a 39.2 percent interest in Block 0, a concession adjacent to the Cabinda coastline that expires in 2050.\n \nThe Block 0 Sanha Lean Gas Connection Project (SLGC) was completed in 2024 and added a new platform that ties the existing complex to new connecting pipelines for gathering and exporting gas from Blocks 0 and 14 to Angola LNG. \nIn 2024, construction continued at the South N’Dola project located in Area B of Block 0, with first oil expected in 2025.\n12\nTable of Contents\nChevron also operates and holds a 31 percent interest in a production sharing contract (PSC) for deepwater Block 14 that expires in 2028.\nIn 2024, Chevron added frontier exploration acreage positions for Blocks 49 and 50 offshore Angola in the deepwater lower Congo Basin.\nChevron has a 36.4 percent shareholding in Angola LNG Limited, which operates an onshore natural gas liquefaction plant in Soyo, Angola. The plant has the capacity to process 1.1 billion cubic feet of natural gas per day. This is the world’s first LNG plant supplied with associated gas, where the natural gas is a byproduct of crude oil production. Feedstock for the plant originates from multiple fields and operators. \nChevron owns a 31 percent nonoperated working interest in the New Gas Consortium Project (NGC). NGC is an offshore gas concession in which the Quiluma and Maboqueiro (Q&M) fields will be the first to be developed, with first production expected in 2026\n. \nThe Q&M development includes two wellhead platforms and an onshore gas treatment plant with connections to the Angola LNG plant. Proved reserves were recognized for this project in 2024.\nAngola-Democratic Republic of Congo (DRC) Joint Development Area\n Chevron has a 31 percent interest in a production sharing agreement (PSA) with the Angola and DRC governments to explore Block 14/23 located in the Zone of Common Interest established between the Republic of Angola and DRC maritime area.\nAngola-Republic of Congo (ROC) Joint Development Area\n Chevron operates and holds a 15.5 percent interest in the Lianzi Unitization Zone (Lianzi), which is located in an area shared equally by Angola and the ROC. This interest expires in 2031. In January 2025, the company sold its interest in the ROC portion of Lianzi, while retaining the Angolan portion\n.\nRepublic of Congo\n In January 2025, the company sold its 31.5 percent nonoperated interest in the offshore Haute Mer permit area. \nCameroon\n Chevron has a 100 percent interest in the YoYo Block in the Douala Basin. Preliminary development plans include a possible joint development between YoYo and the Yolanda fields located in Equatorial Guinea Block I. \nEgypt\n Chevron has interests in Egypt blocks in both the Mediterranean and Red Sea. In the Mediterranean Sea, Chevron holds a\n \n63\n \npercent-owned and operated interest in North El Dabaa (Block 4), a 45 percent-owned and operated interest in the Nargis Block and a 27 percent non-operated working interest in North Cleopatra (Block 7). In 2024, Chevron relinquished its 63 percent-owned and operated interest in North Sidi Barrani (Block 2) and its 27 percent nonoperated interest in North Marina (Block 6). \nIn the Red Sea, the company holds a 45 percent-owned and operated interest in Block 1. \nEquatorial Guinea\n \nChevron has a 38 percent-owned and operated interest in the Aseng Field and the Yolanda Field in Block I and a 45 percent-owned and operated interest in the Alen Field in Block O. The Yolanda field is a discovered natural gas field that straddles the Equatorial Guinea and Cameroon maritime border, for which development options are being reviewed with both governments. \nThe company also holds a 32 percent nonoperated interest in the Alba natural gas and condensate field.\nChevron holds interests in two processing facilities located in Punta Europa. These include a 28 percent nonoperated interest in the Alba LPG Plant and a 45 percent nonoperated interest in the Atlantic Methanol Production Company.\nIn 2024, Chevron added two exploration acreage positions for Blocks EG-06 and EG-11, offshore Bioko Island.\nNamibia \nChevron has an 80 percent-owned and operated interest in Petroleum Exploration License (PEL) 90 (Block 2813B) in the Orange Basin, offshore Namibia. In early 2025, Chevron acquired an 80 percent-owned and operated interest in PEL82 (Blocks 2112B and 2212A) in the Walvis Basin.\nNigeria\n Chevron holds 40 percent interests in concessions across the onshore and shallow-offshore regions of the Niger Delta, most of which were converted in 2024 to the terms of the Petroleum Industry Act of 2021. The company also holds acreage positions in five operated and six nonoperated deepwater blocks, with working interests ranging from 20 to 100 percent. \nChevron operates and holds a 67.3 percent working interest in the Agbami Field, which straddles deepwater Petroleum Mining Lease (PML) 52 (previously known as Oil Mining License (OML) 127) and OML 128. P\nML 52 expires in 2044, and OML 128 expires in 2042. \nAdditionally, Chevron holds a 30 percent nonoperated working interest in the Usan Field in OML 138 that expires in 2042. \n13\nTable of Contents\nIn deepwater exploration, Chevron operates and holds a 55 percent working interest in the Nsiko discovery in OML 140 and a 100 percent working interest in the Aparo discovery in OML 132. Chevron also holds a 27 percent nonoperated working interest in OML 139 and OML 154, and the company continues to work with the operator to evaluate development options for the multiple deepwater discoveries in the Usan area, including the Owowo Field, which straddles OML 139 and OML 154. The development plan for the Owowo Field involves a subsea tie-back to the existing Usan floating, production, storage and offloading vessel. The field development plan for the Owowo Stage 1 development project was approved in August 2024. At the end of 2024, no proved reserves were recognized for this project.\nAlso, in the deepwater area, the third-party-operated Bonga South West Aparo Field in OML 118 straddles both OML 132 and OML 140. Chevron holds a 16.6 percent nonoperated working interest in the unitized area. The development plan involves subsea wells tied back to a floating production, storage and offloading vessel. At the end of 2024, no proved reserves were recognized for this project.\nChevron holds a 40 percent-owned and operated working interest in Oil Prospecting License (OPL) 215 that covers 256,000 net acres.\nIn 2024, Chevron discovered new oil in the Niger Delta at Petroleum Mining Lease 49 (previously within OML 90). This Meji NW-1 discovery is expected to increase Chevron’s oil production in the joint venture asset in which it holds a 40 percent working interest.\nChevron operates the Escravos Gas Plant, which has a total processing capacity of 680 million cubic feet per day of natural gas and liquefied petroleum gas and condensate export capacity of 58,000 barrels per day. The company operates the 33,000-barrel-per-day Escravos Gas to Liquids facility. In addition, the company holds a 36.9 percent interest in the West African Gas Pipeline Company Limited affiliate, which supplies Nigerian natural gas to customers in Benin, Togo and Ghana.\nAsia\nIn Asia, the company is engaged in upstream activities in Bangladesh, China, Cyprus, Indonesia, Israel, Kazakhstan, the Partitioned Zone between Saudi Arabia and Kuwait, Russia and Thailand. Acreage for Asia can be found in the \nAcreage\n table. Net daily oil-equivalent production for these countries can be found in the \nNet Production of Crude Oil, Natural Gas Liquids and Natural Gas\n table. \nBangladesh\n Chevron Bangladesh operates and holds 100 percent interest in Block 12 (Bibiyana field) and Blocks 13 and 14 (Jalalabad and Moulavi Bazar fields) under two PSCs. The rights to produce from Bibiyana and Jalalabad expire in 2034 and from Moulavi Bazar in 2038.\nChina\n Chevron has a 49 percent nonoperated working interest in the Chuandongbei project, including the Luojiazhai and Gunziping natural gas fields located onshore in the Sichuan Basin with the PSC expiring in 2038. The company also has a 32.7 percent nonoperated working interest in Block 16/19 in the Pearl River Mouth Basin, with the PSC expiring in 2028.\nIn the Bohai Bay, the company previously held a 24.5 percent nonoperated working interests in the Qinhuangdao (QHD) 32-6 PSC, which expired in November 2024.\nCyprus\n The company holds a 35 percent-owned and operated interest in the Aphrodite gas field in Block 12 under a PSC, with an exploitation license that expires in 2044. In February 2025, the government and the joint venture agreed to a development and production plan with revised PSC project milestones.\nIndonesia\n In 2024, Chevron commenced an exploration project managed by its joint venture at the Way Ratai geothermal working area in Lampung.\nIsrael\n Chevron holds a 39.7 percent-owned and operated interest in the Leviathan Field, which operates under a concession that expires in 2044. A third gathering pipeline is under construction and is expected to increase gas production capacity from approximately 1.2 to 1.4 billion cubic feet per day from the Leviathan reservoir. This pipeline is scheduled for completion in early 2026. \nChevron is also undergoing front end engineering design (FEED) and procurement for long lead items to further expand the installed capacity at the Leviathan Field from 1.4 to up to 2.1 billion cubic feet per day. This expansion aims to increase production and improve the monetization of the asset, including opportunities via existing and planned regional infrastructure as well as potential avenues for entry into the global LNG market. The FEED work is critical to reach FID and is contingent upon meeting certain commercial and regulatory conditions.\n14\nTable of Contents\nThe company also holds a 25 percent-owned and operated interest in the Tamar gas field, which operates under a concession that expires in 2038. Phase 1 of the Tamar Optimization Project includes installation of a new pipeline to increase delivery capacity to the processing platform, allowing for production at the platform to increase from approximately 1.0 billion to 1.2 billion cubic feet per day. This project is scheduled for completion in 2025. \nChevron reached FID on Phase 2 of the Tamar Optimization Project in February 2024, which is expected to further increase capacity up to approximately 1.6 billion cubic feet of gas per day and includes investment in additional midstream infrastructure. This project is scheduled for completion in 2026. \nKazakhstan\n Chevron has a 50 percent interest in the Tengizchevroil (TCO) affiliate and an 18 percent nonoperated working interest in the Karachaganak field.\nTCO is developing the Tengiz and Korolev crude oil fields in western Kazakhstan under a concession agreement that expires in 2033. Most of TCO’s 2024 crude oil production was exported through the Caspian Pipeline Consortium (CPC) pipeline.\nTCO completed the Wellhead Pressure Management Project (WPMP) in 2024\n \nwhile also completing\n two major train turnarounds. In early 2025, TCO \nstarted oil production at the Future Growth Project (FGP)\n. FGP is the third processing plant in operation at the Tengiz oil field, which is expected to increase crude oil production by 260,000 barrels per day at full capacity and ramp-up total output to one million barrels of oil-equivalent per day. \nThe Karachaganak field is located in northwest Kazakhstan, and operations are conducted under a PSA that expires in 2038. During 2024, a majority of the exported liquids were transported through the CPC pipeline. In 2024, the Karachaganak Expansion Project Stage 1A facility scope\n \nwas completed with final associated injector well to be completed in first-half 2025 and Stage 1B continued development expecting to complete second-half 2026. Both projects increase gas re-injection capacity and extend stable field production. Proved reserves have been recognized for both projects. \nKazakhstan/Russia\n \nChevron has a 15 percent interest in the CPC. Through 2024, CPC transporte\nd an average of 1.4 million barrels of crude oil per day, composed of 1.2 million barrels per day from Kazakhstan and 0.2 mi\nllion barrels per day from Russia.\nKurdistan Region of Iraq\n After relinquishment of company interests in Sarta and Qara Dagh PSCs in 2023, Chevron continues to work with the government and joint venture partner on final exit agreements, expected to be completed in early 2025.\nMyanmar\n Chevron withdrew from Myanmar, effective April 2024\n.\nPartitioned Zone\n Chevron holds a concession to operate the Kingdom of Saudi Arabia’s 50 percent interest in the hydrocarbon resources in the onshore area of the Partitioned Zone between Saudi Arabia and Kuwait. The concession expires in 2046. In 2024, the NWWB-1 exploration well reached total depth and was placed on production. Current activities focus on optimizing base business, further exploration and development drilling and delivering new technology that enables production growth. \nThailand \nChevron holds operated interests in the Pattani Basin, located in the Gulf of Thailand, with ownership ranging from 35 percent to 71.2 percent. Concessions for producing areas within this basin expire between 2028 and 2035. Chevron has a 35 percent-owned and operated interest in the Pailin field in Block 12/27. Chevron also has a 16 percent nonoperated working interest in the Arthit field located in the Malay Basin. Concessions for the producing areas within this basin expire between 2036 and 2040. Chevron also has an exploration and production license for Block G2/65, which covers 3.7 million net acres.\nChevron holds between 30 to 80 percent operated and nonoperated working interests in the Thailand-Cambodia Overlapping Claims Area that are inactive, pending resolution of border issues between Thailand and Cambodia.\nAustralia\nChevron is the largest producer of LNG in Australia. Acreage can be found in the \nAcreage\n table. Net daily oil-equivalent production can be found in the \nNet Production of Crude Oil, Natural Gas Liquids and Natural Gas\n table.  \nUpstream activities in Australia are concentrated offshore Western Australia, where the company is the operator of two major LNG projects, Gorgon and Wheatstone, and has a nonoperated working interest in the North West Shelf (NWS) Venture and exploration acreage in the Carnarvon Basin.\n15\nTable of Contents\nChevron holds a 47.3 percent-owned and operated interest in Gorgon on Barrow Island, which includes the development of the Gorgon and Jansz-Io fields, a three-train 15.6 million-metric-ton-per-year LNG facility, a carbon capture and underground storage facility and a domestic gas plant. Progress on the Jansz-Io Compression project continued during 2024 with first gas expected in 2028. Proved reserves have been recognized for this project. Gorgon’s estimated remaining economic life exceeds 40 years.\nChevron holds an 80.2 percent interest in the offshore licenses and a 64.1 percent-owned and operated interest in the LNG facilities associated with Wheatstone. Wheatstone includes the development of the Wheatstone and Iago fields, a two-train, 8.9 million-metric-ton-per-year LNG facility, and a domestic gas plant. The onshore facilities are located at Ashburton North on the coast of Western Australia. Wheatstone’s estimated remaining economic life exceeds 16 years.\nChevron has a 16.7 percent nonoperated working interest in the NWS Venture in Western Australia. In 2024, the company agreed to an asset swap of its 16.7 percent interest in the NWS Project, NWS Oil Project and its 20 percent interest in Angel Carbon Capture and Storage Project with Woodside’s 13 percent nonoperated interest in the Wheatstone Project and 65 percent operated interest in the Julimar-Brunello fields and related infrastructure, which is expected to close in 2026, subject to customary closing conditions and regulations.     \nThe company continues to evaluate exploration and appraisal activity across the Carnarvon Basin, in which it holds more than 2.6 million net acres. In 2024, Chevron was awarded the WA-553-P exploration permit in the North Carnarvon Basin, which covers approximately 800,000 net acres. Chevron owns and operates the Clio, Acme and Acme West fields. The company is collaborating with other Carnarvon Basin participants to assess the possibility of developing Clio and Acme through shared utilization of existing infrastructure.\nChevron holds operated and nonoperated working interests ranging from 20 to 70 percent, in five greenhouse gas assessment permits to evaluate the potential of carbon dioxide storage. The blocks, including four in the Carnarvon Basin off the northwestern coast of Western Australia and one in the Bonaparte Basin offshore Northern Territory, total nearly 10.2 million gross acres. This acreage includes Block G-18-AP and Block G-20-AP, both awarded in 2024 and the Angel Carbon Capture and Storage Project, subject to the asset swap mentioned above. \nUnited Kingdom\nAcreage can be found in the \nAcreage\n table. Net oil equivalent production for the United Kingdom can be found in the \nNet Production of Crude Oil, Natural Gas Liquids and Natural Gas\n table.  \nChevron holds a 19.4 percent nonoperated working interest in the Clair Field, located west of the Shetland Islands. The Clair Field currently consists of two platform drilling centers: the original Clair Phase 1 and a later added Clair Ridge center. The company is assessing a third drilling center to develop further resources in the area. The Clair Field has an estimated remaining production life extending beyond 2050. \nSales of Natural Gas Liquids and Natural Gas \nThe company sells NGLs and natural gas from its producing operations under a variety of contractual arrangements. In addition, the company also makes third-party purchases and sales of NGLs and natural gas in connection with its supply and trading activities. \nU.S. and international sales of NGLs averaged 511,000 and 268,000 barrels per day, respectively, in 2024. \nDuring 2024, U.S. and international sales of natural gas averaged 5.2 billion and 5.7 billion cubic feet per day, respectively, which includes the company’s share of equity affiliates’ sales. Outside the United States, substantially all of the natural gas sales from the company’s producing interests are from operations in Angola, Australia, Bangladesh, Canada, Equatorial Guinea, Kazakhstan, Israel, Nigeria and Thailand. \nRefer to \nSelected Operating Data\n in Management’s Discussion and Analysis of Financial Condition and Results of Operations, for further information on the company’s sales volumes of NGLs and natural gas. Refer also to \nDelivery Commitments\n for information related to the company’s delivery commitments for the sale of crude oil and natural gas.\n16\nTable of Contents\nDownstream\nRefining Operations\nAt the end of 2024, the company had a refining network capable of processing 1.8 million barrels per day. Operable capacity at December 31, 2024, and daily refinery inputs for the company and affiliate refineries for 2022 through 2024, are summarized in the table below. Average crude unit distillation capacity utilization was 87.9 percent in 2024 and 89.8 percent in 2023.  \nAt U.S. refineries, crude unit distillation capacity utilization, which includes all crude oil and other inputs, averaged 86.6 percent in 2024, compared with 90.8 percent in 2023. Chevron processes both imported and domestic crude oil in its U.S. refining operations. Imported crude oil accounted for approximately 60 percent of Chevron’s U.S. refinery inputs in both 2024 and 2023.\nIn the United States, the company continued work on projects aimed at improving refinery flexibility and reliability. In 2024, the company completed the upgrade of the Pasadena Refinery, which is expected to increase light crude oil throughput capacity to 125,000 barrels per day with a phased start-up through first-quarter 2025. This project should allow the company to process more equity crude from the Permian Basin, supply more products to customers in the U.S. Gulf Coast and realize synergies with the company’s Pascagoula Refinery. \nOutside the United States, the company has interests in three large refineries in Singapore, South Korea and Thailand. Singapore Refining Company (SRC), a 50 percent-owned joint venture, has a total capacity of 290,000 barrels of crude per day and manufactures a wide range of petroleum products. The 50 percent-owned GS Caltex (GSC) Yeosu Refinery in South Korea remains one of the world’s largest refineries with a total crude capacity of 800,000 barrels per day. The company’s 60.6 percent-owned refinery in Thailand, Star Petroleum Refining Public Company Limited (SPRC), continues to supply high-quality petroleum products into regional markets.\nPetroleum Refineries: Locations, Capacities and Crude Unit Inputs\nCapacities and inputs in thousands of barrels per day\nDecember 31, 2024\nRefinery Crude Unit Inputs*\nLocations \nNumber \nOperable Capacity \n2024\n2023\n2022\nPascagoula\nMississippi\n1\n \n369\n \n337\n \n355 \n359 \nEl Segundo\nCalifornia\n1\n \n290\n \n224\n \n232 \n251 \nRichmond\nCalifornia\n1\n \n257\n \n242\n \n236 \n183 \nPasadena\nTexas\n1\n \n85\n \n65\n \n84 \n78 \nSalt Lake City\nUtah\n1\n \n58\n \n49\n \n55 \n53 \nTotal Consolidated Companies — United States \n5\n \n1,059\n \n917\n \n962\n924\nMap Ta Phut\nThailand\n1\n \n175\n \n160\n \n153 \n156 \nTotal Consolidated Companies — International \n1\n \n175\n \n160\n \n153 \n156\nYeosu\nSouth Korea\n1\n \n400\n \n369\n \n367 \n375 \nPulau Merlimau\nSingapore\n1\n \n145\n \n117\n \n116 \n121 \nTotal Affiliates\n1\n \n545\n \n486\n \n483 \n496 \nTotal Including Affiliates — International \n3\n \n720\n \n646\n \n636 \n652 \nTotal Including Affiliates — Worldwide \n8\n \n1,779\n \n1,563\n \n1,598 \n1,576 \n* Includes crude oil and all other feedstocks to the crude distillation units.\nRenewable Fuels\nThe company develops and produces renewable fuels, including but not limited to renewable diesel, renewable gasoline, biodiesel, sustainable aviation fuel and renewable natural gas (RNG).\nChevron owns and operates 11 biofuel refineries located in the U.S. and Germany, eight biofuel refineries producing biodiesel and one producing renewable diesel, with two refineries idled in 2024. Expansion work at the Geismar renewable diesel plant in Louisiana to increase production capacity from 7,000 to 22,000 barrels per day is in final commissioning stage, with startup expected in first quarter 2025.\nChevron holds a 50 percent working interest in Bunge Chevron Ag Renewables LLC, which\n \nproduces soybean oil from processing facilities in Destrehan, Louisiana, and Cairo, Illinois. Soybean oil can be used as a renewable feedstock to make renewable diesel, biodiesel and sustainable aviation fuel. In 2024, FID was taken to build a new oilseed processing plant in Louisiana. \n17\nTable of Contents\nThe company continues to advance its dairy biomethane activities through Brightmark RNG Holdings LLC (Brightmark), CalBioGas LLC, and CalBioGas Hilmar LLC. In 2024, Brightmark announced the inauguration of its Eloy Renewable Natural Gas center in Arizona and also achieved commercial operations at ten additional projects across Iowa, Michigan, Ohio, South Dakota and Wisconsin. These facilities utilize anaerobic digesters to capture methane from dairy farms and transform manure into pipeline quality fuel, fertilizer and water. In California, commercial operations began in 2024 at the central gas processing facility for CalBioGas Hilmar LLC, the company’s newest partnership with California Bioenergy LLC, which includes seven new anaerobic digestion dairy farm projects. \nChevron markets RNG through its nationwide network of 66 compressed natural gas (CNG) stations under the Chevron and Beyond6 brands. In 2024, Chevron opened six CNG stations across California, Florida, Georgia and Texas.\nMarketing Operations\nThe company markets petroleum products under the principal brands of “Chevron,” “Texaco” and “Caltex” throughout many parts of the world. The following table identifies the company’s and its affiliates’ refined products sales volumes, excluding intercompany sales, for the three years ended December 31, 2024.\nRefined Products Sales Volumes\nThousands of barrels per day\n2024\n2023\n2022\nUnited States\nGasoline\n1\n667\n \n642\n639\nJet Fuel\n255\n \n260\n212\nDiesel/Gas Oil\n1\n213\n \n227\n216\nFuel Oil\n54\n \n44\n56\nOther Petroleum Products\n2\n97\n \n114\n105\nTotal United States\n1,286\n \n1,287 \n1,228 \nInternational\n3\nGasoline\n382\n \n353\n336\nJet Fuel\n229\n \n234\n196\nDiesel/Gas Oil\n1\n479\n \n472\n464\nFuel Oil\n182\n \n161\n168\nOther Petroleum Products\n2\n223\n \n225\n222\nTotal International \n1,495\n \n1,445 \n1,386 \nTotal Worldwide\n3 \n2,781\n \n2,732 \n2,614 \n1 \nIncludes renewable fuel sales:\n40\n \n44\n24\n2\n Principally naphtha, lubricants, asphalt and coke. \n3\n Includes share of affiliates’ sales: \n386\n \n389\n389\n \nIn the United States, the company markets primarily under the principal brands of “Chevron” and “Texaco.” At year-end 2024, the company supplied directly or through retailers and marketers approximately 8,500 Chevron- and Texaco-branded service stations, primarily in the southern and western states. Approximately 370 of these outlets are company-owned or -leased stations.\nOutside the United States, Chevron supplied directly or through retailers and marketers approximately 5,200 branded service stations, including affiliates. The company markets using the Chevron and Texaco brands in Latin America and the Caltex brand in the Asia-Pacific region. In South Korea, the company operates through its 50 percent-owned affiliate, GSC. The rebranding project to transition service stations in Australia from Puma to the Caltex brand is expected to complete in 2025. \nChevron markets commercial aviation fuel to 64 airports worldwide. The company markets base oil globally under the Chevron and Nexbase brands and markets lubricant and coolant products under the Chevr\non, Texaco and Caltex brands.\nChemicals Operations \nChevron Oronite Company develops, manufactures and markets performance additives for lubricating oils and fuels and conducts research and development for additive component and blended packages. At the end of 2024, the company manufactured, blended or conducted research at 11 locations around the world. \nChevron owns a 50 percent interest in Chevron Phillips Chemical Company LLC (CPChem). CPChem produces olefins, polyolefins and alpha olefins and is a supplier of aromatics and polyethylene pipe, in addition to participating in the \n18\nTable of Contents\nspecialty chemical and specialty plastics markets. At the end of 2024, CPChem owned or had joint-venture interests in 30 manufacturing facilities and two research and development centers around the world.\nCPChem has two major integrated polymer projects under construction, the Golden Triangle Polymers Project in Orange, Texas, for which CPChem holds a 51 percent-owned and operated interest and the Ras Laffan Petrochemical Project in Ras Laffan, Qatar, for which CPChem holds a 30 percent nonoperated working interest. Start-up for both projects is targeted for 2026. CPChem is expected to complete the Low Viscosity Poly Alpha Olefin Expansion Project at the CPChem Beringen, Belgium site in first-half 2025. \nChevron is also involved in the petrochemical business through the operations of GSC, the company’s 50 percent-owned affiliate in South Korea. GSC manufactures aromatics, including benzene, toluene and xylene. These base chemicals are used to produce a range of products, including adhesives, plastics and textile fibers. GSC also produces olefins, which are used to make automotive and home appliance parts, food packaging, laboratory equipment, building materials, adhesives, paint and textiles.\nTransportation\n \nPipelines\n Chevron owns and operates a network of crude oil, natural gas and product pipelines and other infrastructure assets in the United States. In addition, Chevron operates pipelines for its 50 percent-owned CPChem affiliate. The company also has direct and indirect interests in other U.S. and international pipelines. \nRefer to \nNigeria\n and \nKazakhstan/Russia\n in the Upstream section for information on the West African Gas Pipeline and the Caspian Pipeline Consortium. \nShipping\n The company’s marine fleet includes both U.S. and foreign flagged vessels. The operated fleet consists of conventional crude tankers, product carriers and LNG vessels. These vessels transport crude oil, LNG, refined products and feedstock in support of the company’s global upstream and downstream businesses. In 2024, Chevron announced plans to install a hard-sail wind-assisted propulsion system on a new time-chartered LNG carrier to reduce carbon intensity, with an expected delivery in 2026.\nOther Businesses\n \nChevron Technical Center\n \nThe company aims to scale affordable, innovative technology solutions to support a sustainable, resilient energy system. Chevron Technical Center (CTC) conducts research, develops and qualifies technology and provides technical services and competency development in support of business outcomes. Areas of expertise include earth sciences, reservoir and production engineering, facilities engineering, reserve governance and reporting, capital projects, drilling and completions, innovation, technology ventures, catalyst and process technology, technical computing and digital and data science. In 2024, Chevron announced the establishment of an engineering and innovation center in India to provide technical and digital solutions for the enterprise. \nCTC includes the company’s information technology organization, which\n \nintegrates computing, data management and analytics, cybersecurity and other key infrastructure technologies to provide a digital foundation to enable Chevron’s global operations, projects and business processes.\nThe company is focused on technologies that are ready to adopt and scale today, as well as breakthrough technologies in support of its oil, natural gas and products and new energies businesses, including shale and tight recovery, deepwater development, lowering the carbon intensity of heavy oil, advancing facilities of the future, renewable fuels, carbon capture utilization and storage, hydrogen and geothermal energy.\nChevron leverages its in-house expertise to undertake internal research and development to advance energy solutions. The company holds more than 4,000 patents for new technologies, with nearly 3,400 additional patents pending, making Chevron one of the leading U.S. patent holders in the industry. \nCollaboration is increasingly important to close innovation gaps and integrate emerging technologies into existing energy value chains. Chevron works with startups, universities, national laboratories, joint ventures and service companies to explore, evaluate and scale solutions. Chevron is applying artificial intelligence (AI) to drive productivity, efficiency and value to its global operations. The company is building high-impact use cases leveraging its extensive data and insights and collaborating with others to access AI solutions to help unlock value. In an effort to ensure its AI systems are reliable and effective, the company is employing processes to assess its capabilities, limitations and readiness. Chevron is a member of the Responsible AI institute, a consortium focused on integrating AI responsibly while safeguarding human values.  \n19\nTable of Contents\nThe Chevron Technology Ventures (CTV) unit identifies and invests in externally developed technologies and new business solutions with the potential to enhance the way Chevron produces and delivers affordable, reliable and lower carbon energy. CTV has more than 25 years of being the primary on-ramp for early-stage, external innovation into Chevron, including venture investing, with ten funds that have supported more than 150 startups and worked with more than 350 co-investors. \nIn addition to the company’s own managed funds, Chevron also makes investments indirectly through the following funds: the Oil and Gas Climate Initiative (OGCI) Climate Investments’ Catalyst Fund I, which targets decarbonization within the oil and gas, industrial, built environments and commercial transportation sectors; Emerald funds, one of which targets energy, water, food, mobility, industrial IT and advanced materials and another that focuses on sustainable packaging; Carbon Direct Capital, a growth equity investor in carbon management technologies; and the HX Venture Fund 1 that targets Houston, Texas high-growth start-up companies.  \nSome of the investments the company makes in the areas described above are in new or unproven technologies and business processes; therefore, the ultimate technical or commercial successes of these investments are not certain. Refer to \nNote 27 Other Financial Information\n for quantification of the company’s research and development expenses.\nChevron New Energies\n \nThe new energies organization is focused on developing new businesses with the aim to support the company’s objectives to lower the carbon intensity of its operations and enable growth opportunities with the potential to generate competitive returns. These include additional fuel solutions utilizing hydrogen and its derivatives such as ammonia, carbon emissions management through carbon capture and offsets, and power generation for data centers. The company is also pursuing opportunities in other emerging areas, including enhanced geothermal to deliver non-intermittent lower carbon power, and lithium extraction and production for battery and other applications.  \nEnvironmental Protection\n \nThe company designs, operates and maintains its facilities to avoid potential spills or leaks and to minimize the impact of those that may occur. Chevron requires its facilities and operations to have operating standards and processes and emergency response plans that address significant risks identified through site-specific risk and impact assessments. Chevron also requires that sufficient resources be available to execute these plans. In the unlikely event that a major spill or leak occurs, Chevron also maintains a Worldwide Emergency Response Team comprised of employees who are trained in various aspects of emergency response, including post-incident remediation. \nTo complement the company’s capabilities, Chevron maintains active membership in international oil spill response cooperatives, including the Marine Spill Response Corporation, which operates in U.S. territorial waters, and Oil Spill Response, Ltd., which operates globally. The company is a founding member of the Marine Well Containment Company, whose primary mission is to expediently deploy containment equipment and systems to capture and contain crude oil in the unlikely event of a future loss of control of a deepwater well in the Gulf of America. In addition, the company is a member of the Subsea Well Response Project, which has the objective to further develop the industry’s capability to contain and shut in subsea well control incidents in different regions of the world. \nThe company aims to lower the carbon intensity of its oil and gas operations and comply with the related laws and regulations to which it is subject. Refer to"
}