{
  "ticker": "D",
  "cik": "0000715957",
  "company_name": "DOMINION ENERGY, INC",
  "filing_date": "2025-02-27",
  "accession": "0000950170-25-028387",
  "primary_doc": "d-20241231.htm",
  "item1_text": "Item 1A. Ris\nk Factors\n\n\nThe Companies’ businesses are influenced by many factors that are difficult to predict, involve uncertainties that may materially affect actual results and are often beyond their control. A number of these factors have been identified below. For other factors that may cause actual results to differ materially from those indicated in any forward-looking statement or projection contained in this report, see\n Forward-Looking Statements\n in Item 7. MD&A.\n \n\n\nRegulatory, Legislative and Legal Risks\n\n\n \n\n\nThe rates of the Companies’ principal electric transmission, distribution and generation operations and gas distribution operations are subject to regulatory review.  \nRevenue provided by the Companies’ electric transmission, distribution and generation operations and by gas distribution operations is based primarily on rates approved by state and federal regulatory agencies. The profitability of the Companies’ businesses is dependent on their ability, through the rates that they are permitted to charge, to recover costs and earn a reasonable rate of return on their capital investment.\n\n\n \n\n\nAt the federal level, the Companies’ wholesale rates for electric transmission service are regulated by FERC. Rates for electric transmission services are updated annually according to a FERC-approved formula rate mechanism, and may be subject to additional prospective adjustments and retroactive corrections. A failure by the Companies to support these rates or a change in FERC policy could result in rate decreases from current rate levels, which could adversely affect the Companies’ results of operations, cash flows and financial condition.\n\n\n \n\n\nAt the state level, Virginia Power’s retail base rates, terms and conditions for generation and distribution services to customers in Virginia are reviewed by the Virginia Commission in a proceeding that involves the determination of Virginia Power’s actual earned ROE during a historic test period, and the determination of Virginia Power’s authorized ROE prospectively. Legislation enacted in Virginia in April 2023 reset the frequency of base rate reviews to a biennial period commencing with the 2023 Biennial Review. Under certain circumstances described in the Regulation Act, Virginia Power may be required to refund a portion of its earnings to customers through a refund process and to reduce its rates. Virginia Power makes assessments throughout the review period and will record a regulatory liability for refunds to customers in any period it is determined probable, which could be material to the Companies’ results of operations in the period recognized and to cash flows on completion of any biennial review.\n\n\n \n\n\nIn states other than Virginia, the Companies’ retail electric base rates for generation and distribution services to customers are regulated on a cost-of-service/rate-of-return basis subject to the statutes, rules and procedures of such states. Dominion Energy’s rates for gas distribution to retail customers are similarly regulated at the state level. If retail electric or gas earnings exceed the returns established by state utility commissions, retail electric rates or gas rates may be subject to review and possible reduction, which may decrease the Companies’ future earnings. Additionally, if any state utility commission does not allow recovery through base rates, on a timely basis, of costs incurred in providing service, the Company’s future earnings could be negatively impacted.\n\n\n \n\n\nUnder certain circumstances, state utility regulators may impose a moratorium on increases to retail base rates for a specified period of time, which could delay recovery of costs incurred in providing service. Additionally, governmental officials, stakeholders and advocacy groups may challenge any of the regulatory reviews or proceedings referred to above. Such challenges may lengthen the time, complexity and costs associated with such regulatory reviews or proceedings.\n\n\n \n\n\nThe Companies’ generation business may be negatively affected by possible FERC actions that could change market design in the wholesale markets or affect pricing rules or revenue calculations in the RTO markets.  \nThe Companies’ generation stations operating in RTO markets sell capacity, energy and ancillary services into wholesale electricity markets regulated by FERC. The wholesale markets allow these generation stations to take advantage of market price opportunities, but also expose them to market risk. Properly functioning competitive wholesale markets depend upon FERC’s continuation of clearly identified market rules. From time to time FERC may investigate and authorize RTOs to make changes in market design. FERC also periodically reviews the Companies’ authority to sell at market-based rates. Material changes by FERC to the design of the wholesale markets or its interpretation of market rules, the Companies’ authority to sell power at market-based rates, or changes to pricing rules or rules involving revenue calculations, could adversely impact the future results of the Companies’ generation business. For example, in April 2024, FERC issued an order that accepted proposed changes to the PJM wholesale capacity market that significantly changed how a generation resource’s capacity value is calculated and decreased the total amount of capacity recognized in the PJM region as eligible to meet reserve requirements. In addition, changes to the interpretation and application of FERC’s market manipulation rules may occur from time to time. A failure to comply with these market manipulation rules could lead to civil and criminal penalties.\n\n\n \n\n\nThe Companies are subject to complex governmental regulation, including tax regulation, that could adversely affect their results of operations and subject the Companies to monetary penalties.  \nThe Companies’ operations are subject to extensive federal, state and local laws and regulations and require numerous permits, approvals and certificates from various governmental\n \n\n\n \n33\n\n\n\n\n \n\n\nagencies. Such laws and regulations govern the terms and conditions of the services the Companies offer, relationships with affiliates and protection of critical electric infrastructure assets, among other matters. The Companies are also subject to legislation and associated regulation governing taxation at the federal, state and local level. They must also comply with environmental legislation and associated regulations. Management believes that the necessary approvals have been obtained for existing operations and that the businesses are conducted in accordance with applicable laws. The Companies’ businesses are subject to regulatory regimes which could result in substantial monetary penalties if either of the Companies is found not to be in compliance, including mandatory reliability standards and interaction in the wholesale markets. New laws or regulations, the revision or reinterpretation of existing laws or regulations, the imposition of new tariffs, changes in enforcement practices of regulators, or penalties imposed for non-compliance with existing laws or regulations may result in substantial additional expense. Adverse developments in tax laws, credits or other incentives including changes in legislation, administrative interpretations or judicial determinations could result in material modifications to business models or otherwise negatively affect the Companies’ results of operations, financial condition and/or cash flows. Recent legislative and regulatory changes that are impacting the Companies include legislation enacted in Virginia in April 2023, the IRA, the VCEA, the 2017 Tax Reform Act and tariffs imposed on imported solar panels by the U.S. government in 2018.\n\n\n \n\n\nThe Companies have been and may continue to be or become subject to legal proceedings and governmental investigations and examinations.  \nThe Companies may from time to time be subject to various legal proceedings and governmental investigations and examinations.  For example, Dominion Energy, following the SCANA Combination, was subject to numerous federal and state legal proceedings and governmental investigations relating to the decision of SCANA and DESC to abandon construction at the NND Project. Dominion Energy spent substantial amounts of time and money defending these lawsuits and proceedings and on related investigations. In addition, juries have demonstrated a willingness to grant large awards in certain cases, including personal injury claims. Accordingly, actual costs incurred may differ materially from insured or reserved amounts and may not be recoverable, in whole or in part, by insurance or in rates from customers. The outcome of these or future legal proceedings, investigations and examinations, including settlements, may adversely affect the Companies’ financial condition or results of operation.\n\n\nEnvironmental Risks\n\n\n \n\n\nCompliance with federal and/or state requirements imposing limitations on GHG emissions or efficiency improvements, as well as Dominion Energy’s commitment to achieve net zero carbon and methane emissions by 2050, may result in significant compliance costs, could result in certain of the Companies’ existing electric generation units being uneconomical to maintain or operate and may depend upon technological advancements which may be beyond the Companies’ control.  \nVirginia has adopted the VCEA which establishes renewable energy and CO\n2\n reduction targets for Virginia Power’s generation fleet and grid operations, including the requirement that 100% of Virginia Power’s electricity come from zero-carbon generation by the end of 2045.  The legislation mandates the development of 16.1 GW of solar or onshore wind capacity by the end of 2035, which includes specific requirements for utility-scale solar of 3.0 GW by the end of 2024, up to 15.0 GW by the end of 2035 and 1.1 GW of small-scale solar by the end of 2035. The legislation also deems 5.2 GW of offshore wind capacity before 2035 and 2.7 GW of energy storage by the end of 2035 to be in the public interest.  The VCEA and related legislation also authorizes Virginia to participate in a program consistent with RGGI, requiring the purchase of carbon credits to offset emissions from Virginia Power’s generating fleet within the state.  In January 2022, the Governor of Virginia issued an executive order which put directives in place to start the withdrawal of Virginia from RGGI. In December 2023, the withdrawal took effect. Cost recovery for these initiatives will require approval by the Virginia Commission which may be denied or materially altered to the detriment of the Companies. For example, the Companies recorded charges in 2022 associated with the Virginia Commission’s approval in June 2022 of Virginia Power’s petition that RGGI compliance costs incurred and unrecovered through July 2022 be recovered through existing base rates in effect during the period incurred. In addition, permitting and other project execution challenges may hinder Virginia Power’s ability to meet the requirements of the VCEA. The Companies could face similar risks if there is further legislation at the federal and/or state level mandating additional limitations on GHG emissions or requiring additional efficiency improvements.\n\n\n \n\n\nIn February 2020, Dominion Energy announced its commitment to achieve net zero carbon and methane Scope 1 emissions by 2050. In February 2022, Dominion Energy expanded this commitment to cover Scope 2 emissions and material categories of Scope 3 emissions. To meet this commitment, the Companies expect to construct new electric generation facilities, including renewable facilities such as wind and solar, and to seek the extension of operating licenses for the Companies’ nuclear generation facilities. The Companies also need to depend on technological improvements not currently in commercial development. Additionally, actions taken in furtherance of Dominion Energy’s net zero commitment may impact existing generation facilities, including as a result of fuel switching and/or the retirement of high-emitting generation facilities and their potential replacement with lower-emitting generation facilities. Further, the ability to realize this commitment will require the Companies to be able to obtain significant financing. These efforts will require approvals from various regulatory bodies for the siting and construction of such new facilities and a determination by the applicable state commissions that costs related to the construction are prudent. Given these and other uncertainties associated with the implementation of Dominion Energy’s net zero commitment, the Companies cannot estimate the aggregate effect of future actions taken in furtherance of this commitment on their results of operations or financial condition or on their customers. However,\n \n\n\n \n34\n\n\n\n\n \n\n\nsuch actions could render additional existing generation facilities uneconomical to operate, result in the impairment of assets, or otherwise adversely affect the Companies’ results of operations, financial performance or liquidity.\n\n\n \n\n\nThere are also potential impacts on Dominion Energy’s natural gas business from its net zero emissions commitment as well as federal or state GHG regulations which may require further GHG emission reductions from the natural gas sector which, in addition to resulting in increased costs, could affect demand for natural gas. Additionally, GHG requirements could result in increased demand for energy conservation and renewable products, which could impact the natural gas business.\n \nDominion Energy’s renewable natural gas projects, expected to be a key component of Dominion Energy’s environmental strategy, require approvals from various regulatory bodies for the siting and construction of such facilities.\n\n\n \n\n\nThe Companies’ operations and construction activities are subject to a number of environmental laws and regulations which impose significant compliance costs on the Companies.  \nThe Companies’ operations and construction activities are subject to extensive federal, state and local environmental statutes, rules and regulations relating to air quality, water quality, waste management, natural resources, and health and safety. Compliance with these legal requirements requires the Companies to commit significant capital toward permitting, emission fees, environmental monitoring, installation and operation of environmental control equipment and purchase of allowances and/or offsets. Additionally, the Companies could be responsible for expenses relating to remediation and containment obligations, including at sites where they have been identified by a regulatory agency as a potentially responsible party. Expenditures relating to environmental compliance have been significant in the past, and the Companies expect that they will remain significant in the future. Certain facilities have become uneconomical to operate and have been shut down, converted to new fuel types or sold. These types of events could occur again in the future.\n\n\n \n\n\nThe Companies expect that existing environmental laws and regulations may be revised and/or new laws may be adopted including regulation of GHG emissions which could have an impact on the Companies’ business (risks relating to regulation of GHG emissions from existing fossil fuel-fired electric generating units are discussed in more detail above and below). In addition, further regulation of air quality and GHG emissions under the CAA may be imposed on the natural gas sector. The Companies are also subject to federal water and waste regulations, including regulations concerning cooling water intake structures, coal combustion by-product handling and disposal practices, wastewater discharges from steam electric generating stations, management and disposal of hydraulic fracturing fluids and the potential further regulation of polychlorinated biphenyls.\n\n\n \n\n\nCompliance costs cannot be estimated with certainty due to the inability to predict the requirements and timing of implementation of any new environmental rules or regulations. Other factors which affect the ability to predict future environmental expenditures with certainty include the difficulty in estimating clean-up costs and quantifying liabilities under environmental laws that impose joint and several liabilities on all responsible parties. However, such expenditures, if material, could make the Companies’ facilities uneconomical to operate, result in the impairment of assets, or otherwise adversely affect the Companies’ results of operations, financial performance or liquidity.\n\n\n \n\n\nThe Companies are subject to risks associated with the disposal and storage of coal ash.  \nThe Companies historically produced and continue to produce coal ash, or CCRs, as a by-product of their coal-fired generation operations. The ash is stored and managed in impoundments (ash ponds) and landfills located at 11 different facilities, eight of which are at Virginia Power.\n\n\n \n\n\nThe EPA has issued regulations concerning the management and storage of CCRs, which Virginia has adopted. These CCR regulations require the Companies to make additional capital expenditures and increase operating and maintenance expenses. In addition, the Companies will incur expenses and other costs associated with closing, corrective action and ongoing monitoring of certain ash ponds and landfills. The EPA’s May 2024 final rule regulates inactive surface impoundments located at the retired generation stations that contained CCR and liquids after 2015, and certain other inactive or previously closed surface impoundments, landfills or other areas that contain accumulations of CCR. The Companies believe that they may have inactive or closed units or areas that could be subject to the final rule at up to 19 different locations, including 12 at Virginia Power. The Companies also may face litigation concerning their coal ash facilities.\n\n\n \n\n\nFurther, while the Companies operate their ash ponds and landfills in compliance with applicable state safety regulations, a release of coal ash with a significant environmental impact could result in remediation costs, civil and/or criminal penalties, claims, litigation, increased regulation and compliance costs, and reputational damage, and could impact the financial condition of the Companies.\n\n\n \n\n\nConstruction Risks\n\n\n \n\n\nThe construction of the CVOW Commercial Project involves significant risks. \nThe CVOW Commercial Project is a large-scale, complex project that will take several years to complete. Significant delays or cost increases, or an inability to recover certain project costs, could have an adverse effect on the Companies’ financial condition, cash flows and results of operations.  If the Companies are unable to complete the construction of the CVOW Commercial Project or decide in the future to delay or cancel the project, the\n \n\n\n \n35\n\n\n\n\n \n\n\nCompanies may not be able to recover all or a portion of their investment in the project and may incur substantial cancellation payments under existing contracts or other substantial costs associated with any such delay or cancellation. The Companies’ ability to complete the CVOW Commercial Project within the currently proposed timeline, or at all, and consistent with current cost estimates is subject to various risks and uncertainties, certain of which are beyond the Companies’ control.\n \n\n\n \n\n\nThe construction of the CVOW Commercial Project is dependent on the Companies’ ability to maintain various local, state and federal permits, rights of way and other regulatory approvals and authorizations, including Virginia Commission approval for rider recovery of project costs. In addition, determination of costs allocated by PJM to the project for network upgrades remains subject to change, even after the CVOW Commercial Project is placed in service, as such amounts are driven by the ultimate costs of development of the transmission lines and related facilities that PJM determines is necessary to support various generation facilities within PJM, including the CVOW Commercial Project. The final determination of such costs is outside the control of the CVOW Commercial Project and may be impacted by events affecting the developers of such transmission lines, including any increases in costs for permitting, inflation, tariffs, supply chain constraints or other factors affecting the ultimate costs to complete such facilities. Also, the CVOW Commercial Project may become the subject of litigation or other forms of intervention by third parties, including stakeholders or advocacy groups, that may seek to challenge permits or other regulatory approvals received, including for routing of onshore electric transmission, which could delay or increase the cost of the project.\n \n\n\n \n\n\nThe construction of the CVOW Commercial Project is also dependent on the ability of certain key suppliers and contractors to timely satisfy their obligations under contracts entered into or expected to be entered into. Given the unique equipment and expertise required for this project, the Companies may not be able to remedy in a timely and cost-effective manner, if at all, any failure by one or more of these suppliers or contractors to timely satisfy their contractual obligations. Certain of the fixed price contracts for major offshore construction and equipment components are denominated in Euros and Danish kroner. In May 2022, Virginia Power entered into forward purchase agreements with a notional amount of approximately €3.2 billion. Accordingly, to the extent the instruments do not effectively hedge the Companies’ exposure to these currencies, including by default of the counterparty, adverse fluctuations in the applicable exchange rates would likely adversely affect the cost of the CVOW Commercial Project. Similarly, adverse fluctuations in the price of fuel used for transportation and installation, would likely adversely affect the overall costs to construct the project. In addition, the cost of the CVOW Commercial Project could be adversely affected by the impact of applicable tariffs, if any.\n\n\n \n\n\nThe Companies’ ability to recover unforeseen cost increases associated with construction of the CVOW Commercial Project is potentially limited which could negatively impact the Companies’ future financial condition, results of operations and/or cash flows.  In accordance with the Virginia Commission’s December 2022 order, the Companies are subject to a cost sharing mechanism in which Virginia Power will be eligible to recover 50% of such incremental costs which fall between $10.3 billion and $11.3 billion with no recovery of such incremental costs which fall between $11.3 billion and $13.7 billion.  There is no cost sharing mechanism for any total construction costs in excess of $13.7 billion, the recovery of which would be determined in a future Virginia Commission preceding.  In addition, the order includes enhanced performance reporting provisions for the operation of the CVOW Commercial Project.  To the extent the net annual net capacity factor is below 42%, as determined on a three-year rolling average, Virginia Power is required to provide detailed explanation of the factors contributing to any shortfall to the Virginia Commission which could determine in a future proceeding a remedy for incremental costs incurred associated with any deemed unreasonable or imprudent actions of Virginia Power. Any such action by the Virginia Commission could adversely impact the Companies’ future financial condition, results of operations and/or cash flows.\n\n\n \n\n\nThe Companies’ ability to invest the significant financial resources necessary for the CVOW Commercial Project is dependent on the Companies’ access to the financial markets in a timely and cost-effective manner. A decline in the Companies’ credit worthiness, an unfavorable market reputation of either the Companies or their industry or general market disruptions could adversely impact financing costs and increase the overall cost of the project.\n\n\n \n\n\nIn October 2024, Virginia Power completed the sale of a 50% noncontrolling interest to Stonepeak. Virginia Power and Stonepeak will each contribute 50% of the remaining capital necessary to fund construction of the CVOW Commercial Project provided the total project cost, excluding financing costs, is less than $11.3 billion. For capital funding necessary, if any, for total project costs, excluding financing costs, of $11.3 billion through $13.7 billion, Stonepeak will have the option to make additional capital contributions. If Stonepeak elects to make additional capital contributions for project costs, excluding financing costs, in excess of $11.3 billion, if any, Virginia Power shall contribute between 67% and 83% of such capital with Stonepeak contributing the remainder.  To the extent that Stonepeak elects not to make such contributions, Virginia Power shall receive an increase in its ownership percentage of OSWP for any contributed capital based on a tiered unit price for membership interests in OSWP as set forth in the agreement. Virginia Power and Stonepeak have the right to provide capital contributions for any total project costs, excluding financing costs, in excess of $13.7 billion. The inability of Stonepeak to satisfy its share of funding requirements in a timely manner could have a negative effect on the Companies.  In addition, Stonepeak’s interests and objectives may differ from those of the Companies and, accordingly, disputes may arise that may result in delays, litigation or operational impasses.\n\n\n \n\n\n \n36\n\n\n\n\n \n\n\nThe construction of the CVOW Commercial Project involves the use of evolving turbine technology and takes place in a marine environment, which presents unique challenges and requires the use of a specialized workforce and specialized equipment. In addition, the timely installation of the turbines is dependent on the completion and availability of a Jones Act compliant vessel currently under construction.\n\n\n \n\n\nThe timeline for construction of the CVOW Commercial Project may also be negatively impacted by severe weather events or marine wildlife, including migration patterns of endangered and protected species, both of which are outside of the control of the Companies and their contractors.\n\n\n \n\n\nThe Companies’ infrastructure build and expansion plans often require regulatory approval, including environmental permits, before commencing construction and completing projects. The Companies may not complete the facility construction, conversion or other infrastructure projects that they commence, or they may complete projects on materially different terms, costs or timing than initially estimated or anticipated, and they may not be able to achieve the intended benefits of any such project, if completed. \nA number of large- and small-scale projects have been announced, including the CVOW Commercial Project, electric transmission lines, facility expansions or renewed licensing, conversions and other infrastructure developments or construction. Additional projects may be considered in the future, such as those necessary to meet the projected demand growth driven by data centers and artificial intelligence, including to address the concentration of data centers primarily in Loudoun County, Virginia. The Companies compete for projects with companies of varying size and financial capabilities, including some that may have competitive advantages. Commencing construction on announced and future projects may require approvals from applicable state and federal agencies, and such approvals could include mitigation costs which may be material to the Companies. Projects may not be able to be completed on time or in accordance with estimated costs as a result of weather conditions, need for new land and right of ways, delays in obtaining or failure to obtain regulatory and other, including PJM, approvals, changes in laws or regulations, delays in obtaining key materials, labor difficulties, difficulties with partners or potential partners, concerns raised during stakeholder engagement, a decline in the credit strength of counterparties or vendors, inflation, the impact of applicable tariffs or other factors beyond the Companies’ control. For example, Dominion Energy has been involved with projects which have experienced certain delays in obtaining and maintaining permits necessary for construction along with construction delays due to judicial actions which impacted the cost and schedule such as the Atlantic Coast Pipeline Project and ultimately led to its cancellation in July 2020. Even if facility construction, expansion, electric transmission line, conversion and other infrastructure projects are completed, the total costs of the projects may be higher than anticipated and the performance of the business of the Companies following completion of the projects may not meet expectations.\n \n\n\n \n\n\nStart-up and operational issues can arise in connection with the commencement of commercial operations at the Companies’ facilities. Such issues may include failure to meet specific operating parameters, which may require adjustments to meet or amend these operating parameters. Additionally, the Companies may not be able to timely and effectively integrate the projects into their operations and such integration may result in unforeseen operating difficulties or unanticipated costs. Any delays in the timely completion of necessary PJM interconnection projects for new electric generation facilities under development by Virginia Power, including the CVOW Commercial Project, may result in capacity constraints if, and until, such projects are completed. Further, regulators may disallow recovery of some of the costs of a project if they are deemed not to be prudently incurred. Any of these or other factors could adversely affect the Companies’ ability to realize the anticipated benefits from the facility construction, electric transmission line, expansion, conversion and other infrastructure projects.\n\n\n \n\n\nThe development, construction and commissioning of several large-scale infrastructure projects simultaneously involves significant execution risk.  \nTo achieve Dominion Energy’s commitment to net zero emissions by 2050 and comply with the requirements of the VCEA, the Companies are currently simultaneously developing or constructing several electric generation projects, including subsequent license renewal projects at Surry and North Anna, the CVOW Commercial Project, several electric transmission projects and various solar projects. Several of the Companies’ key projects are increasingly large-scale, complex and being constructed in constrained geographic areas or in unfamiliar environments such as the marine environment for the CVOW Commercial Project. The advancement of the Companies’ ventures is also affected by the interventions, litigation or other activities of stakeholder and advocacy groups, some of which oppose natural gas-related and energy infrastructure projects. For example, certain stakeholder groups oppose solar farms due to the increasing quantities of land tracts required for these facilities. Similarly, certain stakeholder groups oppose new natural gas generation facilities, such as the proposed Chesterfield Energy Reliability Center. Given that these projects provide the foundation for the Companies’ strategic growth plan and to meet projected growth, if the Companies are unable to obtain or maintain the required regulatory and other, including PJM, approvals, develop the necessary technical expertise, allocate and coordinate sufficient resources, adhere to budgets and timelines, effectively handle public outreach efforts, including its commitment to fair treatment, community involvement and effective communication, or otherwise fail to successfully execute the projects, there could be an adverse impact to the Companies’ financial position, results of operations and cash flows. Failure to comply with regulatory approval conditions or an adverse ruling in any future litigation could adversely affect the Companies’ ability to execute their business plan.\n\n\n \n\n\n \n37\n\n\n\n\n \n\n\nThe Companies are dependent on their contractors for the successful and timely completion of large-scale infrastructure projects. The construction of such projects is expected to take several years, is typically confined within a limited geographic area or difficult environments and could be subject to delays, supply chain disruption, cost overruns, inflation, labor disputes or shortages and other factors that could cause the total cost of the project to exceed the anticipated amount and adversely affect the Companies’ financial performance and/or impair the Companies’ ability to execute the business plan for the project as scheduled.\n\n\n \n\n\nFurther, an inability to obtain financing or otherwise provide liquidity for the projects on acceptable terms could negatively affect the Companies’ financial condition, cash flows, the projects’ anticipated financial results and/or impair the Companies’ ability to execute the business plan for the projects as scheduled.\n\n\n \n\n\nOperational Risks\n\n\n \n\n\nThe Companies’ financial performance and condition can be affected by changes in the weather, including the effects of global climate change.  \nFluctuations in weather can affect demand for the Companies’ services. For example, milder than normal weather can reduce demand for electricity and gas distribution services. In addition, severe weather or acts of nature, including hurricanes, winter storms, wildfires, earthquakes, floods and other natural disasters can stress systems, disrupt operation of the Companies’ facilities and cause service outages, production delays and property damage that require incurring additional expenses. Changes in weather conditions can result in reduced water levels or changes in water temperatures that could adversely affect operations at some of the Companies’ power stations. Furthermore, the Companies’ operations could be adversely affected and their physical plant placed at greater risk of damage should changes in global climate produce, among other possible conditions, unusual variations in temperature and weather patterns, resulting in more intense, frequent and extreme weather events, abnormal levels of precipitation and, for operations located on or near coastlines, a change in sea level or sea temperatures. Due to the location of the Companies’ electric utility service territories and a number of its other facilities in the eastern portions of the states of South Carolina, North Carolina and Virginia which are frequently in the path of hurricanes, the Companies experience the consequences of these weather events to a greater degree than many industry peers.\n\n\n \n\n\nHostile cyber intrusions could severely impair the Companies’ operations, lead to the disclosure of confidential information, damage the reputation of the Companies and otherwise have an adverse effect on the Companies’ business.  \nThe Companies own assets deemed as critical infrastructure, the operation of which is dependent on information technology systems. Further, the computer systems that run the Companies’ facilities are not completely isolated from external networks. There appears to be an increasing level of activity, sophistication and maturity of threat actors, in particular nation state actors, that wish to disrupt the U.S. bulk power system and the U.S. gas transmission or distribution system. Such parties could view the Companies’ computer systems, software or networks as attractive targets for cyber attack. For example, malware has been designed to target software that runs the nation’s critical infrastructure such as power transmission grids and gas pipelines. In addition, the techniques used in cyber attacks evolve rapidly, including from emerging technologies, such as advanced forms of automation and artificial intelligence. The Companies’ businesses also require that they and their vendors collect and maintain sensitive customer data, as well as confidential employee and shareholder information, which is subject to electronic theft or loss.\n\n\n \n\n\nA successful cyber attack through third-party or insider action on the systems that control the Companies’ electric generation, electric transmission, electric distribution or gas distribution assets could severely disrupt business operations, preventing the Companies from serving customers or collecting revenues. The breach of certain business systems could affect the Companies’ ability to correctly record, process and report financial information. A major cyber incident could result in significant expenses to investigate and repair security breaches or system damage and could lead to litigation, fines, other remedial action, heightened regulatory scrutiny and damage to the Companies’ reputation. In addition, the misappropriation, corruption or loss of personally identifiable information and other confidential data at the Companies or one of their vendors could lead to significant breach notification expenses and mitigation expenses such as credit monitoring. If a significant breach were to occur, the reputation of the Companies also could be adversely affected. While the Companies maintain property and casualty insurance, along with other contractual provisions, that may cover certain damage caused by potential cyber incidents, all damage and claims arising from such incidents may not be covered or may exceed the amount of any insurance available. For these reasons, a significant cyber incident could materially and adversely affect the Companies’ business, financial condition and results of operations.\n\n\n \n\n\nThe Companies’ financial results can be adversely affected by various factors driving supply and demand for electricity and related services. \nDemand for the Companies’ services can be driven by changing populations within its utility service territories, significant new commercial or industrial customers or other changes in consumer habits. For example, data centers in Virginia Power’s service territory, particularly in Loudoun County, Virginia, have been a source of significant increase in demand which is expected to continue over the next decade. Technological advances may enhance energy efficiency in end-use devices, including lighting, furnaces and electric heat pumps and could lead to declines in per capita energy consumption. Additionally, regulatory and/or legislative bodies could introduce requirements and/or incentives to reduce energy consumption. Consumer demand for the Companies’ services may also be impacted by any price increases, including those driven by factors beyond the Companies’ control\n \n\n\n \n38\n\n\n\n\n \n\n\nsuch as inflation or increased prices in natural gas.  Further, Virginia Power’s business model is premised upon the cost efficiency of the production, transmission and distribution of large-scale centralized utility generation. However, advances in distributed generation technologies, such as solar cells, gas microturbines, battery storage and fuel cells, may make these alternative generation methods competitive with large-scale utility generation, and change how customers acquire or use the Companies’ services. The widescale implementation of alternative generation methods could negatively impact the reliability of the Companies’ electric grid and/or result in significant costs to enhance the grid. Virginia Power has an exclusive franchise to serve retail electric customers in Virginia. However, Virginia’s Retail Access Statutes allow certain electric generation customers exceptions to this franchise. As market conditions change, Virginia Power’s customers may further pursue exceptions and Virginia Power’s exclusive franchise may erode.\n\n\n \n\n\nIncreased energy demand or significant accelerated growth in demand due to new data centers, expanded use of artificial intelligence, widespread adoption of electric vehicles or other customer changes could require enhancements to the Companies’ infrastructure. As discussed above, the ability of the Companies to construct new facilities is dependent upon factors outside of their control, including obtaining regulatory approvals, environmental and other permits. Any delays in, or inability to complete, construction of new facilities or expand and/or renew existing facilities could have an adverse effect on the Companies’ financial results.  In addition, purchased power from PJM or others may be from generation sources which emit more emissions than the Companies’ facilities, which could negatively impact Dominion Energy’s ability to meet its commitment to net zero emissions. Alternatively, reduced energy demand or significantly slowed growth in demand due to customer adoption of energy efficient technology, conservation, distributed generation, regional economic conditions, or the impact of additional compliance obligations, unless substantially offset through regulatory cost allocations, could adversely impact the value of the Companies’ business activities.\n\n\n \n\n\nThe Companies’ operations are subject to operational hazards, equipment failures, supply chain disruptions and personnel issues which could negatively affect the Companies.  \nOperation of the Companies’ facilities involves risk, including the risk of potential breakdown or failure of equipment or processes due to aging infrastructure, fuel supply, pipeline integrity or transportation disruptions, accidents, labor disputes or work stoppages by employees, acts of terrorism or sabotage, construction delays or cost overruns, shortages of or delays in obtaining equipment, material and labor, operational restrictions resulting from environmental limitations and governmental interventions, changes to the environment and performance below expected levels. The Companies’ businesses are dependent upon sophisticated information technology systems and network infrastructure, the failure of which could prevent them from accomplishing critical business functions. Because the Companies’ transmission facilities, pipelines and other facilities are interconnected with those of third parties, the operation of their facilities and pipelines could be adversely affected by unexpected or uncontrollable events occurring on the systems of such third parties.\n\n\n \n\n\nOperation of the Companies’ facilities below expected capacity levels could result in lost revenues and increased expenses, including higher maintenance costs. Unplanned outages of the Companies’ facilities and extensions of scheduled outages due to mechanical failures or other problems occur from time to time and are an inherent risk of the Companies’ business. Unplanned outages typically increase the Companies’ operation and maintenance expenses and may reduce their revenues as a result of selling less output or may require the Companies to incur significant costs as a result of operating higher cost units or obtaining replacement output from third parties in the open market to satisfy forward energy and capacity or other contractual obligations. Moreover, if the Companies are unable to perform their contractual obligations, penalties or liability for damages could result.\n\n\n \n\n\nIn addition, there are many risks associated with the Companies’ principal operations including nuclear accidents, fires, explosions, uncontrolled release of natural gas and other environmental hazards, pole strikes, electric contact cases, the collision of third party equipment with pipelines and avian and other wildlife impacts. Such incidents could result in loss of human life or injuries among employees, customers or the public in general, environmental pollution, damage or destruction of facilities or business interruptions and associated public or employee safety impacts, loss of revenues, increased liabilities, heightened regulatory scrutiny and reputational risk. Further, the location of electric generation, transmission, substations and distribution facilities or natural gas distribution facilities near populated areas, including residential areas, commercial business centers and industrial sites, could increase the level of damages resulting from these risks.\n\n\n \n\n\nThe Companies conduct certain operations through partnership arrangements involving third-party investors which may limit the Companies’ operational flexibility or result in an adverse impact on its financial results. \nCertain of the Companies’ operations, including the CVOW Commercial Project, are conducted through entities subject to partnership arrangements under which Dominion Energy or Virginia Power has significant influence but does not control the operations of such entities or in which Dominion Energy or Virginia Power’s control over such entities may be subject to certain rights of third-party investors. Accordingly, while Dominion Energy or Virginia Power may have a certain level of control or influence over these entities, it may not have unilateral, or any, control over the day-to-day operations of these entities or over decisions that may have a material financial impact on the partnership participants, including the Companies. In each case such partnership arrangements operate in accordance with their respective governance documents, and the Companies are dependent upon third parties satisfying their respective obligations, including, as applicable, funding of their required share of capital expenditures. Such third-party investors have their own interests and\n \n\n\n \n39\n\n\n\n\n \n\n\nobjectives which may differ from those of the Companies and, accordingly, disputes may arise amongst the owners of such partnership arrangements that may result in delays, litigation or operational impasses.\n\n\n \n\n\nThe Companies may be materially adversely affected by negative publicity or the inability of Dominion Energy to meet its stated commitments.  \nFrom time to time, political and public sentiment may result in a significant amount of adverse press coverage and other adverse public statements affecting the Companies. Any failure by Dominion Energy to realize its commitments to achieve net zero carbon and methane emissions by 2050, enhance the customer experience or other long-term goals could lead to adverse press coverage and other adverse public statements affecting the Companies. The ability to comply with some or all of Dominion Energy’s voluntary commitments may be outside of its control. For example, the ability to reduce emissions while meeting the Companies’ increasing demand growth is expected to be dependent on the technological and economic feasibility of large-scale battery storage, carbon capture and storage, small modular reactors, hydrogen and/or other clean energy technologies. Dominion Energy is also dependent on the actions of third parties to meet the expanded commitment regarding Scope 2 emissions and Scope 3 emissions. If downstream customers or upstream suppliers do not sufficiently reduce their GHG emissions, Dominion Energy may not achieve its net zero emissions goal. In addition, while the Atlantic Coast Pipeline Project was cancelled in July 2020 and the legal proceedings and governmental investigations relating to the abandonment of the NND Project have been resolved, there is a risk that lingering negative publicity may continue.  Adverse press coverage and other adverse statements, whether or not driven by political or public sentiment, may also result in investigations by regulators, legislators and law enforcement officials or in legal claims as well as adverse outcomes.\n\n\n \n\n\nAddressing any adverse publicity, governmental scrutiny or enforcement or other legal proceedings is time consuming and expensive and, regardless of the factual basis for the assertions being made, can have a negative impact on the reputation of the Companies, on the morale and performance of their employees and on their relationships with their respective regulators, customers and commercial counterparties. It may also have a negative impact on the Companies’ ability to take timely advantage of various business and market opportunities. The direct and indirect effects of negative publicity, and the demands of responding to and addressing it, may have a material adverse effect on the Companies’ business, financial condition and results of operations.\n\n\n \n\n\nDominion Energy’s nonregulated generation business operates in a challenging market, which could adversely affect its results of operations and future growth.  \nThe success of Dominion Energy’s contracted generation business depends upon favorable market conditions including the ability to sell power at prices sufficient to cover its operating costs. Dominion Energy operates in active wholesale markets that expose it to price volatility for electricity and nuclear fuel as well as the credit risk of counterparties. Dominion Energy attempts to manage its price risk by entering into long-term power purchase agreements with customers as well as hedging transactions, including short-term and long-term fixed price sales and purchase contracts. The failure of Dominion Energy to maintain, renew or replace its existing long-term contracts on similar terms or with counterparties with similar credit profiles could result in a loss of revenue and/or decreased earnings and cash flows for Dominion Energy.\n\n\n \n\n\nIn these wholesale markets, the spot market price of electricity for each hour is generally determined by the cost of supplying the next unit of electricity to the market during that hour. In many cases, the next unit of electricity supplied would be provided by generating stations that consume fossil fuels, primarily natural gas. Consequently, the open market wholesale price for electricity generally reflects the cost of natural gas plus the cost to convert the fuel to electricity. Therefore, changes in the price of natural gas generally affect the open market wholesale price of electricity. To the extent Dominion Energy does not enter into long-term power purchase agreements or otherwise effectively hedge its output, these changes in market prices could adversely affect its financial results.\n\n\n \n\n\nDominion Energy purchases nuclear fuel primarily under long-term contracts. Dominion Energy is exposed to nuclear fuel cost volatility for the portion of its nuclear fuel obtained through short-term contracts or on the spot market, including as a result of market supply shortages. Nuclear fuel prices can be volatile and the price that can be obtained for power produced may not change at the same rate as nuclear fuel costs, thus adversely impacting Dominion Energy’s financial results. In addition, in the event that any of the contracted generation facilities experience a forced outage, Dominion Energy may not receive the level of revenue it anticipated.\n\n\n \n\n\nWar, acts and threats of terrorism, intentional acts and other significant events could adversely affect the Companies’ operations.  \nThe Companies cannot predict the impact that any future terrorist attacks or retaliatory military or other action may have on the energy industry in general or on the Companies’ businesses in particular. Any such future attacks or retaliatory action may adversely affect the Companies’ operations in a variety of ways, including by disrupting the power, fuel and other markets in which the Companies operate or requiring the implementation of additional, more costly security guidelines and measures. The Companies’ infrastructure facilities, including nuclear facilities and projects under construction, could be direct targets or indirect casualties of an act of terror or other physical attack. Any physical compromise of the Companies’ facilities could adversely affect the Companies’ ability to generate, purchase, transmit or distribute electricity, distribute natural gas or otherwise operate their respective facilities in the most efficient manner or at all. For example, in December 2022 electric utilities in North Carolina and Washington experienced physical attacks on substations with the damage causing power outages. In addition, the amount and scope of insurance coverage\n \n\n\n \n40\n\n\n\n\n \n\n\nmaintained against losses resulting from any such attack may not be sufficient to cover such losses or otherwise adequately compensate for any business disruptions that could result.\n\n\n \n\n\nInstability in financial markets as a result of terrorism, war, intentional acts, pandemic, credit crises, recession or other factors could result in a significant decline in the U.S. economy and/or increase the cost or limit the availability of insurance or adversely impact the Companies’ ability to access capital on acceptable terms.\n\n\n \n\n\nFailure to attract and retain key executive officers and an appropriately qualified workforce could have an adverse effect on the Companies’ operations.  \nThe Companies’ business strategy is dependent on their ability to recruit, retain and motivate employees. The Companies’ key executive officers are the CEO, CFO, COO and presidents and those responsible for financial, operational, legal, regulatory, accounting, tax, information technology and cybersecurity functions. Competition for skilled management employees in these areas of the Companies’ business operations is high. Certain events, such as an aging workforce, mismatch of skill set, or unavailability of contract resources may lead to operating challenges and increased costs. The challenges include lack of resources, loss of knowledge base and the length of time required for skill development. In this case, costs, including costs for contractors to replace employees, productivity costs and safety costs, may rise. Failure to hire and adequately train replacement employees, including the transfer of significant internal historical knowledge and expertise to new employees, or future availability and cost of contract labor may adversely affect the ability to manage and operate the Companies’ business. In addition, certain specialized knowledge is required of the Companies’ technical employees for construction and operation of transmission, generation and distribution assets. The Companies’ inability to attract and retain these employees could adversely affect their business and future operating results.\n\n\n \n\n\nNuclear Generation Risks\n\n\n \n\n\nThe Companies have substantial ownership interests in and operate nuclear generating units; as a result, each may incur substantial costs and liabilities.  \nThe Companies’ nuclear facilities are subject to operational, environmental, health and financial risks such as the on-site storage of spent nuclear fuel, the ability to dispose of such spent nuclear fuel, the ability to maintain adequate reserves for decommissioning, limitations on the amounts and types of insurance available, potential operational liabilities and extended outages, the costs of replacement power, the costs of maintenance and the costs of securing the facilities against possible terrorist attacks. The Companies maintain decommissioning trusts and external insurance coverage to minimize the financial exposure to these risks; however, it is possible that future decommissioning costs could exceed amounts in the decommissioning trusts and/or damages could exceed the amount of insurance coverage. If the Companies’ decommissioning trust funds are insufficient, and they are not allowed to recover the additional costs incurred through insurance or regulatory mechanisms, their results of operations could be negatively impacted.\n\n\n \n\n\nThe Companies’ nuclear facilities are also subject to complex government regulation which could negatively impact their results of operations. The NRC has broad authority under federal law to impose licensing and safety-related requirements for the operation of nuclear generating facilities. In the event of noncompliance, the NRC has the authority to impose fines, set license conditions, shut down a nuclear unit, or take some combination of these actions, depending on its assessment of the severity of the situation, until compliance is achieved. Revised safety requirements promulgated by the NRC could require the Companies to make substantial expenditures at their nuclear plants. In addition, although the Companies have no reason to anticipate a serious nuclear incident at their plants, if an incident did occur, it could materially and adversely affect their results of operations and/or financial condition. A major incident at a nuclear facility anywhere in the world, such as the nuclear events in Japan in 2011, could cause the NRC to adopt increased safety regulations or otherwise limit or restrict the operation or licensing of domestic nuclear units.\n\n\n \n\n\nFinancial, Economic and Market Risks\n\n\n \n\n\nChanging rating agency requirements could negatively affect the Companies’ growth and business strategy.  \nIn order to maintain appropriate credit ratings to obtain needed credit at a reasonable cost in light of existing or future rating agency requirements, the Companies may find it necessary to take steps or change their business plans in ways that may adversely affect their growth and earnings. A reduction in the Companies’ credit ratings could result in an increase in borrowing costs, loss of access to certain markets, or both, thus adversely affecting operating results and could require the Companies to post additional collateral in connection with some of its price risk management activities.\n\n\n \n\n\nAn inability to access financial markets and, in the case of Dominion Energy, obtain cash from subsidiaries could adversely affect the execution of the Companies’ business plans.  \nThe Companies rely on access to short-term money markets and longer-term capital markets as significant sources of funding and liquidity for business plans with increasing capital expenditure needs, normal working capital and collateral requirements related to hedges of future sales and purchases of energy-related commodities. Deterioration in the Companies’ creditworthiness, as evaluated by credit rating agencies or otherwise, or declines in market reputation either for the Companies or their industry in general, or general financial market disruptions outside of the Companies’ control could\n \n\n\n \n41\n\n\n\n\n \n\n\nincrease their cost of borrowing or restrict their ability to access one or more financial markets. Market disruptions could stem from general market disruption due to general credit market or political events, the reform or replacement of benchmark rates, the failure of financial institutions on which the Companies rely or the bankruptcy of an unrelated company. Increased costs and restrictions on the Companies’ ability to access financial markets may be severe enough to affect their ability to execute their business plans as scheduled.\n\n\n \n\n\nDominion Energy is a holding company that conducts all of its operations through its subsidiaries. Accordingly, Dominion Energy’s ability to execute its business plan is further subject to the earnings and cash flows of its subsidiaries and the ability of its subsidiaries to pay dividends or advance or repay funds to it, which may, from time to time, be subject to certain contractual restrictions or restrictions imposed by regulators.\n\n\n \n\n\nMarket performance, interest rates and other changes may decrease the value of the Companies’ decommissioning trust funds and Dominion Energy’s benefit plan assets or increase Dominion Energy’s liabilities, which could then require significant additional funding.  \nThe performance of the capital markets affects the value of the assets that are held in trusts to satisfy future obligations to decommission the Companies’ nuclear plants and under Dominion Energy’s pension and other postretirement benefit plans. The Companies have significant obligations in these areas and hold significant assets in these trusts. These assets are subject to market fluctuation and will yield uncertain returns, which may fall below expected return rates.\n\n\n \n\n\nWith respect to decommissioning trust funds, a decline in the market value of these assets may increase the funding requirements of the obligations to decommission the Companies’ nuclear plants or require additional NRC-approved funding assurance.\n\n\n \n\n\nA decline in the market value of the assets held in trusts to satisfy future obligations under Dominion Energy’s pension and other postretirement benefit plans may increase the funding requirements under such plans. Additionally, changes in interest rates will affect the liabilities under Dominion Energy’s pension and other postretirement benefit plans; as interest rates decrease, the liabilities increase, potentially requiring additional funding. Further, changes in demographics, including increased numbers of retirements or changes in mortality assumptions, may also increase the funding requirements of the obligations related to the pension and other postretirement benefit plans.\n\n\n \n\n\nIf the decommissioning trust funds and benefit plan assets are negatively impacted by market fluctuations or other factors, the Companies’ results of operations, financial condition and/or cash flows could be negatively affected.\n\n\n \n\n\nThe use of derivative instruments could result in financial losses and liquidity constraints.  \nThe Companies use derivative instruments, including futures, swaps, forwards, options and FTRs, to manage commodity, interest rate and/or foreign currency exchange rate risks.\n\n\n \n\n\nThe Dodd-Frank Act was enacted into law in July 2010 in an effort to improve regulation of financial markets. The CEA, as amended by Title VII of the Dodd-Frank Act, requires certain over-the-counter derivatives, or swaps, to be cleared through a derivatives clearing organization and, if the swap is subject to a clearing requirement, to be executed on a designated contract market or swap execution facility. Non-financial entities that use swaps to hedge or mitigate commercial risk, often referred to as end users, may elect the end-user exception to the CEA’s clearing requirements. The Companies have elected to exempt their swaps from the CEA’s clearing requirements. If, as a result of changes to the rulemaking process, the Companies’ derivative activities are not exempted from the clearing, exchange trading or margin requirements, the Companies could be subject to higher costs due to decreased market liquidity or increased margin payments. In addition, the Companies’ swap dealer counterparties may attempt to pass-through additional trading costs in connection with changes to or the elimination of rulemaking that implements Title VII of the Dodd-Frank Act.\n\n\n \n\n\nFuture impairments of goodwill or other intangible assets or long-lived assets may have a material adverse effect on the Companies’ results of operations.  \nGoodwill is evaluated for impairment annually or more frequently if an event or circumstance occurs that would more likely than not reduce the fair value of a reporting unit below its carrying amount. Other intangible assets and long-lived assets are evaluated for impairment on an annual basis or more frequently whenever events or circumstances indicate that an asset’s carrying value may not be recoverable. If Dominion Energy’s goodwill or the Companies’ other intangible assets or long-lived assets are in the future determined to be impaired, the applicable registrant would be required during the period in which the impairment is determined to record a noncash charge to earnings that may have a material adverse effect on the registrant’s results of operations. For example, in the fourth quarter of 2022, Dominion Energy determined that its nonregulated solar generation assets within Contracted Energy were impaired, resulting in a $685 million after-tax charge. In addition, Dominion Energy recorded an aggregate $309 million after-tax charge in the fourth quarter of 2023 and first quarter of 2024 for the impairment of certain goodwill associated with the Questar Gas Transaction.\n\n\n \n\n\n \n42\n\n\n\n\n \n\n\nExposure to counterparty performance may adversely affect the Companies’ financial results of operations.  \nThe Companies are exposed to credit risks of their counterparties and the risk that one or more counterparties may fail or delay the performance of their contractual obligations, including but not limited to payment for services. Some of Dominion Energy’s operations are conducted through partnership arrangements, as noted above. Counterparties could fail or delay the performance of their contractual obligations for a number of reasons, including the effect of regulations on their operations. Defaults or failure to perform by customers, suppliers, contractors, joint venture partners, financial institutions or other third parties may adversely affect the Companies’ financial results.\n\n\n \n\n\nPublic health crises and epidemics or pandemics could adversely affect the Companies’ business, results of operations, financial condition, liquidity and/or cash flows.  \nThe effects of an outbreak of a pandemic, such as COVID-19, and related government responses could include extended disruptions to supply chains and capital markets, reduced labor availability and productivity and a prolonged reduction in economic activity. The effects could also have a variety of adverse impacts on the Companies, including reduced demand for energy, particularly from commercial and industrial customers, impairment of goodwill or long-lived assets and diminished\n ability of the Companies to access funds from financial institutions and capital markets. Certain measures or restrictions taken to control a pandemic or similar event, such as travel bans and restrictions, quarantines, shelter-in-place orders and shutdowns, may cause operational interruptions and delays in construction projects. In addition, legislative or government action, such as legislation enacted in Virginia in November 2020, may limit the Companies’ ability to collect overdue accounts or disconnect services for non-payment, which may cause a decrease in the Companies’ results of operations and cash flows.\n \n\n\n \n\n\n \n\n\nItem 1B. Unresolve\nd Staff Comments\n\n\nNone.\n \n\n\n \n\n\nItem 1C. \nCybe\nrsecurity\n \nRisk Management and Strategy\nIn an effort to reduce the likelihood and severity of cyber intrusions, the Companies have a comprehensive cybersecurity program designed to protect and preserve the confidentiality, integrity and availability of data and systems. \nConsideration of cybersecurity risks is a key component of the Companies’ overall risk management and \nintegrated\n into processes such as evaluation of potential new vendors or suppliers. The Companies are subject to mandatory cybersecurity regulatory requirements, interface regularly with a wide range of external organizations and participate in classified briefings to maintain an awareness of current cybersecurity threats and vulnerabilities.\n \n \nThe Companies’ corporate intelligence and security program includes both cybersecurity and threat intelligence components as part of its evaluation and mitigation of risks. The evaluation of risks includes consideration of cybersecurity and privacy risk, including potential impact on the Companies’ employees, customers, supply chain and other stakeholders, intelligence briefings on notable cyber events impacting the industry and evaluation of insider threats. \nThe Companies utilize a robust set of internal and third-party assessment tools to test its cyber risk management policies, practices and procedures as well as challenge assumptions upon which its defenses are built.\n These assessments provide opportunities for self-critical analysis and constructive feedback needed to build cyber resilience. Trainings are routinely provided to employees to help identify, avoid and mitigate cybersecurity threats and to ensure an understanding of the Companies’ cyber risk management policies. In addition, risk assessments are conducted as a component of the evaluation of vendors and suppliers.\n \nThe Companies’ current security posture and regulatory compliance efforts are intended to address the evolving and changing cyber threats. \nDuring the past three years, the Companies have not experienced any cybersecurity incidents resulting in a material impact to their business strategy, results of operations or financial condition.\n The Companies have identified the risk that a hostile cyber intrusion could severely impair the Companies’ operations, lead to disclosure of confidential information, damage the Companies’ reputation or otherwise have an adverse effect on the Companies’ business as disclosed under the Operational Risks header within"
}