{
  "ticker": "DASH",
  "cik": "0001792789",
  "company_name": "DoorDash, Inc.",
  "filing_date": "2025-02-14",
  "accession": "0001628280-25-005715",
  "primary_doc": "dash-20241231.htm",
  "item1_text": "Item 1. Business\nOUR BUSINESS\nOur mission is to grow and empower local economies. We aim to do this by providing services that reduce friction in local commerce and help merchants better connect with consumers in their communities. Our primary offerings include the DoorDash Marketplace and the Wolt Marketplace (our \"Marketplaces\"), and our Commerce Platform.\nOur Marketplaces operate in over 30 countries, including the United States, and account for the vast majority of our revenue today. Our Marketplaces serve three primary constituents: merchants, consumers, and the independent contractors who use our platform to generate earnings, or \"Dashers\n1\n.\"\nOur Marketplaces provide an integrated suite of services that help merchants establish an online presence, connect with consumers in their communities, and solve mission-critical challenges, such as customer acquisition, demand generation, order fulfillment, merchandising, payment processing, and customer support. We typically earn a fee from merchants for the services we provide based on the size of each transaction. We also offer advertising as a value-added service through our Marketplaces to help merchants and consumer packaged goods companies increase consumer engagement and drive incremental revenue.\nConsumers access our Marketplaces through our apps and websites to discover, engage with, and purchase goods from merchants in their communities. We seek to attract and retain consumers based primarily on the selection, convenience, quality, affordability, and service we provide. We typically charge consumers fees for each transaction, inclusive of a fixed delivery fee and a service fee that varies based on the size of the transaction. Our Marketplaces also offer our consumer membership programs, DashPass and Wolt+, which aim to lower transactional friction by reducing the delivery and service fees we charge, while providing additional membership benefits. In December 2024, our Marketplaces served over 42 million monthly active users\n2\n and, as of December 31, 2024, we had over 22 million DashPass and Wolt+ members.\nIn addition to our Marketplaces, we offer our Commerce Platform, which is a suite of services that help merchants grow, run, and operate their businesses on their own channels. DoorDash Drive On-Demand and Wolt Drive (together, \"Drive\") are white-label delivery fulfillment services that generate the majority of revenue within our Commerce Platform. In addition to Drive, we also provide services within our Commerce Platform that help merchants establish online ordering, build branded mobile apps, enable tableside order and pay, and improve customer support.\nFor Dashers, our Marketplaces and Drive provide opportunities to generate income that helps them achieve their goals. Dashers choose if, when, and where to dash, which tasks to accept, as well as how frequently and for how long to dash each time they choose to do so. We typically pay Dashers based on the amount of time they are active on our platform or the number of tasks they complete and the time, distance, and desirability associated with each task. We seek to attract Dashers primarily based on the accessibility, flexibility, and earnings opportunities we provide.\nWe believe our business achieves its greatest benefits when we provide attractive services for each of our key constituents. Consequently, to grow our business, we intend to provide merchants with an expanding suite of services that help them build and grow successful omnichannel businesses; consumers with a broad selection of merchants and products to choose from, consistent and high-quality experiences, and affordability that drives increased adoption; and Dashers with unique opportunities that compete effectively for their time and effort with every task.\nCOMPETITION\nThe markets in which we operate are intensely competitive and characterized by shifting user preferences, fragmentation, and frequent introductions of new services and offerings. We compete for our constituencies on the following criteria:\n•\nMerchants.\n We compete for merchants based on our ability to generate consumer demand and the quality of our business enablement and demand fulfillment services.\n1\n Dashers that use our DoorDash Marketplace and Wolt Marketplace are referred to as \"DoorDash Dashers\" and \"Wolt courier partners,\" respectively, in this Annual Report on Form 10-K.\n2\n Based on the number of individual consumer accounts that have completed an order on our Marketplaces in the past month, measured as of December 31, 2024.\n6\nTable of Contents\n•\nConsumers. \nWe compete for consumers based on a number of factors, including the selection of merchants and products available, the quality of the ordering, fulfillment and service experience, and affordability.\n•\nDashers.\n We compete to attract and retain Dashers based on a number of factors, including accessibility of our platform, flexibility in when, where, how much and how frequently to work, overall quality of the dashing experience, and earnings potential.\nIn particular, local food delivery logistics, the largest category of our business today, is fragmented and intensely competitive. Globally, we compete with other local on-demand delivery companies, including Uber Eats, Just Eat Takeaway, Delivery Hero, and other local incumbents. We also compete with merchants that have their own online ordering platforms, online ordering systems, merchants that own and operate their own delivery fleets, grocers and grocery delivery services, convenience stores and convenience store delivery services, and companies that provide merchant delivery services. In addition, we compete with traditional offline ordering channels, such as take-out offerings, telephone, and paper menus that merchants distribute to consumers. As we continue to expand into additional verticals, we may compete or come in closer competition with additional businesses with substantial resources, users, and brand power.\nFor additional information about the risks to our business related to competition, see the section titled “\nRisk Factors—Risks Related to Our Business and Operations—We face intense competition and if we are unable to compete effectively, our business, financial condition, and results of operations could be adversely affected.\n”\nHUMAN CAPITAL\nEmployees\nAs of December 31, 2024, we had over 23,700 employees worldwide. We also engage contractors and consultants. Certain international employees are subject to statutory collective bargaining agreements. We have not experienced any work stoppages, and we believe that our employee relations are strong.\nWe believe that people are at the core of every business. This drives our focus on improving the experiences of merchants, consumers, and Dashers, and it also drives how we think about our employees and the culture and values that we cultivate. Our employees are critical to our success.\nAt DoorDash, we grow and empower local economies. We give our team the freedom and opportunity to build the future—for our company, our constituencies, and our communities. Together, with grit, courage, and rapid innovation, we create the dynamic energy that drives our business forward.\nDashers\nWe are committed to make dashing an earnings opportunity that is accessible, flexible, and supportive of social progress. In 2024, 8 million people dashed\n3\n, earning a total of over $18 billion.\nWe believe access and choice are empowering. Our goal with dashing is to provide as many people as we can with an opportunity to earn incrementally in a way that fits their lives. Since Dashers are independent contractors, we must compete for their time and effort with every task. We compete against other earnings opportunities, other sources of capital like loans or credit cards, as well as alternative uses of time like doing errands or leisure. Because of this competition, we must make dashing attractive, worthwhile, and incremental to other choices available. Specifically, we strive to make dashing positive based on: \n•\nAccessibility\n: We believe the barriers to entry in dashing are very low. Where permitted by applicable law, prospective Dashers must pass a background check and, in most geographies, have access to a bike, scooter, or car. People who qualify to become Dashers are often eligible to begin generating income within a day of signing up. We know of no other earnings opportunity that provides superior accessibility to dashing.\n•\nFlexibility\n: Once Dashers qualify, they choose whether to dash, where to dash, when to dash, how long to dash for, and how frequently to dash. This allows Dashers to scale their effort to their earnings needs. It also allows Dashers to generate earnings around other commitments in their lives, which often include full or part-time jobs, school, parenting, or commitments to care for family or friends.\n3\n Based on the number of Dasher accounts that have delivered an order through our platform in 2024.\n7\nTable of Contents\n•\nEarnings\n: We must provide Dashers with opportunities to earn that are competitive with alternative opportunities and commensurate with Dashers' expectations. In addition to the absolute level of earnings, we provide tools that improve immediacy and accessibility of earnings, as this is often valued by Dashers. \n•\nService\n: We aim to provide Dashers with high levels of service. This includes a dedicated service team that is accessible through our app, website, email, chat, and phone. We also provide visibility into our policies and practices for determining ratings and deactivations.\nOur Commitment to Diversity and Inclusion\nAt DoorDash, we are committed to growing and empowering inclusive communities in our company, our industry, and the geographies we serve. We believe that a diverse and inclusive workforce is critical to helping us attract and retain the talent necessary to grow our business. We also believe we will be a more successful company if we amplify the voices of those who have not always been heard, and when everyone has “room at the table” and the tools, resources, and opportunities to succeed.\nINTELLECTUAL PROPERTY\nWe believe that our intellectual property rights are valuable and important to our business. We rely on trademarks, patents, copyrights, trade secrets, license agreements, intellectual property assignment agreements, confidentiality procedures, non-disclosure agreements, and employee non-disclosure and invention assignment agreements to establish and protect our proprietary rights. Though we rely in part upon these legal and contractual protections, we believe that factors such as the skills and ingenuity of our employees and the functionality and frequent enhancements to our platform are larger contributors to our success in the marketplace.\nWe have invested in a patent program to identify and protect a substantial portion of our strategic intellectual property in logistics, selection optimization, and other technologies relevant to our business. As of December 31, 2024, we had 244 issued U.S. patents, 25 patents issued in non-U.S. jurisdictions, 54 U.S. patent applications pending, and 21 patent applications pending in non-U.S. jurisdictions. We continually review our development efforts to assess the existence and patentability of new intellectual property.\nWe have an ongoing trademark and service mark registration program pursuant to which we register our brand names and product names, taglines, and logos in the United States and other countries to the extent we determine appropriate and cost-effective. As of December 31, 2024, we held 56 registered trademarks in the United States and 194 registered trademarks in non-U.S. jurisdictions. We also have common law rights in some trademarks and numerous pending trademark applications in the United States and non-U.S. jurisdictions. In addition, we have registered domain names for websites that we use in our business, such as www.doordash.com and other variations.\nWe intend to pursue additional intellectual property protection to the extent we believe it would be beneficial and cost-effective. Despite our efforts to protect our intellectual property rights, they may not be respected in the future or may be invalidated, circumvented, or challenged. For additional information, see the sections titled “\nRisk Factors—Risks Related to Our Intellectual Property—Intellectual property infringement assertions by third parties could result in significant costs and adversely affect our business, financial condition, results of operations, and reputation\n” and “\nRisk Factors—Risks Related to Our Intellectual Property—Failure to adequately protect our intellectual property could adversely affect our business, financial condition, and results of operation\ns.”\nGOVERNMENT REGULATION\nWe are subject to a wide variety of laws and regulations in the United States, Europe, and other jurisdictions. These laws, regulations, and standards govern issues such as worker classification, labor and employment, commissions and fees, anti-discrimination, payments, gift cards, whistleblowing and worker confidentiality obligations, product liability, environmental protection, personal injury, text messaging, membership services, intellectual property, consumer protection and warnings, marketing, advertising, taxation, privacy, data protection, cybersecurity, competition, unionizing and collective action, arbitration agreements and class action waiver provisions, terms of service, mobile application and website accessibility, money transmittal, and background checks. The sale and delivery of goods through our platform is also subject to laws, regulations, and standards that govern food safety, alcohol, pharmaceuticals, controlled substances, hazardous substances, other age-restricted products, and the interstate and intrastate transport of goods. These regulations are often complex and subject to varying interpretations, in many cases due to their lack of specificity and, as a result, their application in practice may change or develop over time through judicial decisions or as new guidance or \n8\nTable of Contents\ninterpretations are provided by regulatory and governing bodies, such as federal, national, state, and local administrative agencies.\nSee the sections titled “\nRisk Factors\n,” including the sections titled “\n—If Dashers that utilize our platform are reclassified as employees under U.S. federal or state law, or the laws of other jurisdictions in which we operate, it could have an adverse effect that is material to our business, financial condition, and results of operations\n” and “\n—Our business is subject to a variety of laws and regulations globally, including those related to worker classification, Dasher pay and conditions of work, merchant pricing and commissions, and consumer fees and taxes, many of which are unsettled and still developing, and any of which could subject us to legal claims, increased costs, operational burdens, or otherwise adversely affect our business, financial condition, or results of operations\n”  for additional information about the laws and regulations we are subject to and the risks to our business associated with such laws and regulations.\nCORPORATE INFORMATION\nWe were incorporated in 2013 as Palo Alto Delivery Inc., a Delaware corporation. In 2015, we changed our name to DoorDash, Inc. Our principal executive offices are located at 303 2nd Street, South Tower, 8th Floor, San Francisco, California 94107, and our telephone number is (650) 487-3970. Our Class A common stock is listed on the Nasdaq Stock Market under the symbol “DASH.”\nAVAILABLE INFORMATION\nOur website is located at www.doordash.com, and our investor relations website is located at ir.doordash.com. Copies of our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to these reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), are available free of charge on our investor relations website as soon as reasonably practicable after we file such material electronically with or furnish it to the U.S. Securities and Exchange Commission (the \"SEC\"). The SEC also maintains a website that contains our SEC filings at www.sec.gov.\nWe announce material information to the public about us, our products and services, and other matters through a variety of means, including filings with the SEC, press releases, public conference calls, webcasts, the investor relations section of our website (ir.doordash.com), our blog (doordash.news), and our X account (@DoorDash) in order to achieve broad, non-exclusionary distribution of information to the public and for complying with our disclosure obligations under Regulation FD. \nThe information disclosed by the foregoing channels could be deemed to be material information. As such, we encourage investors, the media, and others to follow the channels listed above and to review the information disclosed through such channels. Any updates to the list of disclosure channels through which we will announce information will be posted on the investor relations page on our website. \n9\nTable of Contents"
}